{"result_id": "271024", "URL": "https://shoebat.com/2021/03/26/rutgers-becomes-first-university-to-mandate-covid-vaccines-for-attendance/", "timestamp": "2023-04-25 17:07:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/03/26/rutgers-becomes-first-university-to-mandate-covid-vaccines-for-attendance/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Rutgers Becomes First University To Mandate COVID Vaccines For Attendance", "cleaned_text": "One can disagree about the nature of COVID, whether it is a disease, a political tool, or both. But regardless of what one holds to, it is clear COVID is not going away any time soon. There has been a lot of talk because of this about mandating shots against COVID, and this has been a highly controversial topic for many. Now according to UPI, Rutgers University has become the first institute of higher education in the US to mandate COVID vaccinations for students in order to attend.\n\nRutgers University in New Jersey has become the first major college in the United States to require all of its students to be vaccinated against COVID-19 if they want to attend classes on campus this fall.\n\nAdministrators said President Joe Biden’s mandate for everyone to be eligible for a vaccine by May will give students enough time to get the shot.\n\n“We are committed to health and safety for all members of our community, and adding COVID-19 vaccination to our student immunization requirements will help provide a safer and more robust college experience for our students,” Rutgers President Jonathan Holloway said in a statement.\n\nThe flagship university in New Jersey said students with medical and religious exemptions will be allowed to attend classes without vaccination. Students taking classes online also aren’t bound by the mandate.\n\n“An effective vaccination program is a continuation of Rutgers’ commitment to health and safety for all members of our community of more than 71,000 students, the cities we are in and the communities we serve throughout New Jersey,” Rutgers Chief Operating Officer Antonio Calcado added.\n\nThe university won’t require staff and faculty to receive the vaccine, but they will be “strongly urged” to receive it.\n\n“Vaccination is key to stopping the current pandemic,” Brian Strom, chancellor of Rutgers Biomedical and Health Sciences, said.\n\nRutgers is believed to be the first major U.S. university to impose a vaccine mandate for students to return to campus. (source)", "opengraph": {"locale": "en_US", "type": "article", "title": "Rutgers Becomes First University To Mandate COVID Vaccines For Attendance - Walid Shoebat", "description": "One can disagree about the nature of COVID, whether it is a disease, a political tool, or both. But regardless of what one holds to, it is clear COVID is not going away any time soon. There has been a lot of talk because of this about mandating shots against COVID, and this has been […]", "url": "https://shoebat.com/2021/03/26/rutgers-becomes-first-university-to-mandate-covid-vaccines-for-attendance/", "site_name": "Walid Shoebat", "article:published_time": "2021-03-26T23:09:01+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/03/03262021d.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.upi.com/Top_News/US/2021/03/26/new-jersey-rutgers-university-students-covid-vaccine/3531616761439/"], "authors": [], "publish_date": "2021-03-26T23:09:01+00:00"}