{"result_id": "271040", "URL": "https://shoebat.com/2014/10/30/spanish-government-reveals-plot-isis-use-ebola-weapon-westerners/", "timestamp": "2023-04-25 17:07:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2014/10/30/spanish-government-reveals-plot-isis-use-ebola-weapon-westerners/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Spanish Government Reveals Plot By ISIS To Use Ebola As A Weapon Against Westerners", "cleaned_text": "The government of Spain has revealed a plot by jihadists connected with ISIS to use ebola as a weapon against westerners and their other enemies, as one report reads:\n\nSpain’s state secretary for security, Francisco Martínez, has told Congress that jihadists with connections to the extremist force Isis have discussed on internet forums how they could use Ebola as a weapon against the United States and the West in general.\n\nSpeaking on Wednesday in the congressional Interior Committee, Martínez pointed to internet conversations of this kind as proof that jihadists treat cyberspace as “an extension of the battlefield”.\n\nThe state secretary said that it was necessary to combat the online challenge posed by extremists’ use of the internet, explaining that terrorist groups have identified six objectives in their online activities: “Threatening enemies through propaganda, preparing operations, exchanging information, ideological training, recruiting new members and acquiring finance”.\n\nAccording to Spain’s RTVE public broadcasting corporation, the interior ministry number two said there had been “many examples” of threats to use the Ebola virus and other toxins in a new form of terrorism offensive against the West, referring specifically to three recent cases.\n\nMost recently there was the “jihadist chat room” conversation discovered in mid-September in which “the use of Ebola as a poisonous weapon against the United States” was discussed in a forum Martínez described as “linked to Isis”.\n\nThe security chief also mentioned a series of tweets from July in which, he said, the terrorist organization Ansar al-Islam was shown to be considering the use of “deadly chemical products from laboratories”.\n\nFinally, Martínez told his audience of lawmakers that Isis’s spokesman had issued an internet call for supporters to kill Westerners, including civilians, by any means possible, including “poisonous injections”.\n\nEarlier in October US Homeland Security Secretary Jeh Johnson dismissed suggestions Isis was planning to use biological weapons, including the Ebola virus, to attack the United States.\n\n“We’ve seen no specific credible intelligence that [Isis] is attempting to use any sort of disease or virus to attack our homeland,” Johnson said in remarks to the Association of the United States Army.", "opengraph": {"locale": "en_US", "type": "article", "title": "Spanish Government Reveals Plot By ISIS To Use Ebola As A Weapon Against Westerners - Walid Shoebat", "description": "By Theodore Shoebat The government of Spain has revealed a plot by jihadists connected with ISIS to use ebola as a weapon against westerners and their other enemies, as one report reads: Spain’s state secretary for security, Francisco Martínez, has told Congress that jihadists with connections to the extremist force Isis have discussed on internet […]", "url": "https://shoebat.com/2014/10/30/spanish-government-reveals-plot-isis-use-ebola-weapon-westerners/", "site_name": "Walid Shoebat", "article:published_time": "2014-10-30T21:10:53+00:00", "image": "https://shoebat.com/wp-content/uploads/2014/10/d8a3d982d986d8b9d8a9-d988d8a7d982d98ad8a9-d985d986-d8a7d984d8bad8a7d8b2d8a7d8aa.jpg", "image:width": "1600", "image:height": "1200"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2014-10-30T21:10:53+00:00"}