{"result_id": "271014", "URL": "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/", "timestamp": "2023-04-25 17:07:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The Government Of France Wants To Make A Vaccine Certificate Mandatory To Enter Public Places. Tens Of Thousands Of People Take To The Streets To Protest Against This And Declare It Tyranny", "cleaned_text": "The anti-establishment (and anti-Macron) movement of the Yellow Vests, of which we wrote on in 2018, did not die with the coronavirus lockdown. Rather, went temporarily under the radar, and only intensified. Now this very atmosphere of rage is re-manifesting itself against the government’s policy have making a covid vaccine certificate mandatory in order to enter certain public places. The Yellow Vest movement was enraged by a diesel tax, and now the people are upset about a vaccine certificate. One report from RT states:\n\nLaw enforcement officers in the French capital used tear gas and water cannon to disperse the crowds as the situation on the streets spiraled out of control during the massive demonstrations provoked by the government’s plans to extend health passes for public places and enforce mandatory vaccination for certain jobs, including health workers.’ Videos published on social media showed a crowd of angry young people forcing police officers to retreat from the Champs-Elysees by blocking the road, pelting officers with various objects and even attacking police vans. Law enforcement responded by deploying water cannon to disperse the crowd. Elsewhere in Paris, a tense standoff between officers in riot gear and demonstrators ended up in a brief but fierce scuffle that prompted the police to use tear gas. In another incident, a crowd attacked a police motorbike by pelting it with bottles, forcing law enforcement officers to intervene. There has been violence against police officers, as you see here an officer on a motorbike being attacked: The idea of the government making you have a covid certificate to enter public places like “museums, cinemas or swimming pools” is despotic. If the state can impose such controls under the justification of an illness, then its not too difficult to imagine the state doing the same things with certain people that it may consider undesirable. At the same time, we cannot be optimistic about such an angry movement without having at least a little bit of incredulity; for just as disasters (like covid) may be used by governments to justify tyrannical policies, so can things that are unjust be used by the mob as a pretense for mob rule. Covid (which more than likely came from a lab) is merely aggravating and exasperating the world into a rage against the established order. Yes, people will cheer this on from the sidelines, but we must be careful for what we wish for. In 2011 we began researching and writing on the unrest that erupted in Syria. We continuously read and wrote about the bloody violence that was taking place in that country, and how forces from NATO were working behind the misery. We also talked a lot about the ideology of the rebels. That was the Arab Spring. Now, while still not ignoring the happenings of the Middle East, we continue our search for the conspiracy of tearing mankind apart, by looking to the happenings that are occurring in Europe. We predicted the Europe spring going all the way back to 2016. We are speaking here of France and its current volatile state. We saw the Guy Fawkes masks in Egypt. Now we are seeing them in France. In doing this research we quickly realized that reading just the English media when inquiring for details on the violent Paris riots was very limiting. To find out what is happening in France, read French media. So much of our information, while not absent of English language sources, is based to a great extent on French media sources. Now that we have for years been focusing on the Arab Spring, we must turn our eyes to the Euro Spring, not ignoring the East, but bringing to mind that the enemies of mankind work effortlessly throughout the globe in an international contrivance of evil. As the first Pope of Rome said: “Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour” (1 Peter 5:8). We must be watchful not to let ourselves be deceived. Many videos on Youtube — which have garnered hundreds of thousands of views — are using racial pride to shore up support for the movement, praising the attempted rebellion in France as the rise of “the working class White man,” when all such words are ways to stoke violent ethnic sentiments, fueled by a disorderly fantasy of racial superiority. The riots and demonstrations in France did not just consist of Left-wingers, but factions of the Right-wing as well, including monarchists and nationalist Catholics, which is really not all that surprising given their history of membership amongst the Nazis, the most famous being Leon Degrelle. These Right-wing groups include the neofascist Bastion Social, the ethno-centric pagan nationalist Generation Identity, the monarchist organization Action Francois (French Action) and the nationalist traditionalist Catholic organization, Civitas. Antoine Berth, spokesman for French Action, said that 2000 (out of 3000) of the group’s members were involved in the movement throughout France. Berth said that French Action participated from the beginning of the movement in several rallies all over France and have blocked roads and conducted toll operations (basically activists took over toll stations and allowed drivers to pass for free). Members of French Action have held up banners exclaiming “Down with thieves” or “Down with the Republic”. “Down with the republic” means bringing France to a state of anarchy, which means violence and bloodshed. There is a group that is influenced by such philosophies and also backs the Yellow Vest movement; we are speaking of the popular pagan folk metal band, Peste Noire, who in late 2017 made a video calling for the destruction of the French republic and massive blood and gore on the streets. While for years we were told about the Islamic jihadist music videos talking about killing infidels, now we see the same type of propaganda, but this time being done by European nationalists. Notice that the title of the video is Le Dernier Putsche (“the latest revolution”). The bearded men with machine guns look no different from the Chechen mujahideen: Peste Noir has also showed support for the Yellow Vest movement on Facebook: To give you an idea as to the diabolicalism of this pagan and nationalist cult, here is a quote from the lead singer of this group (who calls himself “Famine”): “Black Metal is the musical memory of our bloodthirsty ancestors of blood, it is the marriage of Tradition, of old racial patrimony with fanaticism, with the rage and the rashness of a youth now lost. It is a chthonic religion: a cult of the earth and a return to it, therefore a nationalism; a cult of what is BELOW the earth: Hell – the adjective “chthonic” applies to the Infernal gods as well. BM is a fundamentalism, a music with integrity (from latin integer, complete) which helps me to remain complete in a dying world, amidst a people in decay, unworthy of its blood. It is the apology of the dark european past. It is a psychosis which helps us to flee a reality we cannot tolerate anymore. “At the other extreme, far-right groups such as Action Francaise and Bastion Social also made their presence known. Both groups had used social media called on their supporters to turn out at Saturday’s protests.” Action Francaise (or “French Action) is a French nationalist organization obsessed with bringing down the French Republic and replacing it with a monarchy. The head ideologue of French Action was Charles Maurras, a writer who viciously hated Christianity. He rejected the “Hebrew Christ” and the “turbulent Eastern Scriptures,” and elsewhere the “four obscure Jews,” that is Matthew, Mark, Luke and John. French Action covers itself with a veneer of Catholic tradition, but in reality they are pagans. In September of 1926, Pope Pius XI condemned French Action as a pagan movement: In substance, there is, in these manifestations [of Action française], traces of a rebirth of Paganism, to which is linked the Naturalism that these authors have placed, unconsciously, we believe, as so many of their contemporaries, in the public schooling of this modern and secular school, poisoner of youth, against which they themselves fight often so ardently. In other words, the liberal decadence that these Right-wingers claim to be fighting, is being advanced under a different cloak by these very nationalist ideologues. If the Pope declared that such a group is pagan, then they are pagan and there is no need to inquire deeper to prove it any further. Today a favorite talker of French Action is Eric Zemmour, a French Algerian Jew who once said that employers “had the right to refuse Arabs or Blacks”. Civitas is another Right-wing group involved in the rebellion. It is a nationalist organization that puts up a false face of Catholicism and is well connected with the schismatic Society of St. Pius X. Civitas has been participating in the rebel cause since the beginning and has partaken in road blockades. Its leader Alain Escada, who is a Nazi sympathizer and adores the “trad” Catholic SS Nazi leader, Leon Degrelle, said: “From the first days, we had a large number of activists who participated locally in all places of blockades”.\n\nGeneration Identity is another nationalist group involved with the mob. Its spokesperson, Romain Espino, said: “From the beginning, we understood that it was a real popular anger, not something remote control”. Anaïs Lignier, another speaker for Generation Identity, said that the the mobilization of “yellow vests” is also “a complaint against immigration”.\n\nOther nationalist figures are involved. Alain Soral, known for promoting racial hatred, has joined the cause. He presented himself with a yellow vest and said: “the crisis pisses in the mouth of power.” Another racialist is Henry de Lesquen who said: “As a liberal nationalist in economics, I am against the excess tax, especially to finance a ‘delirium climatist’,” he then went on to say that he sees in the protesters France’s “French ancestors”.\n\nMartin Sellner, the leader of the Austrian branch of the Generation Identity movement, has also backed the Yellow Vest movement and showed his solidarity by sporting a yellow vest:\n\nWhat is happening here is that the nationalists — or really the ethno-nationalists — are seeing this situation as an opportunity for their racialist revolution. They are hoping for chaos; this is the fantasy that they have been dreaming of. With chaos and revolt, they can use the desire as a way to establish their ideology amongst the mob, and direct the mob to a racialist movement bent on a eugenist, pagan and despotic disposition.\n\nThis mentality is not something really distinct from France’s rebellious history. Jean-Jacques Rousseau, the major ideological influence behind the French Revolution, promoted the idea of a national religion outside of Christianity, and pushed the idea that Christianity is not for the advancement of the French people because it is foreign to France (the type of talk very common within Nazi pagan circles). Rousseau wrote:\n\nJean Jacques Rousseau, wrote his complaint, that “the Gospel doesn’t establish any national religion,” and went on to say that “national divisions led to polytheism,” and this same French anti-Catholic expressed his protest against Christ Who he accused of “separating the theological from the political system,” and through the Christian Faith, “destroyed the unity of the state, and caused the internal divisions that have never ceased to trouble Christian peoples.” He believed that pagan culture provided a society with more of a masculinist and warrior spirit, unlike Christianity which he held to be for slaves:\n\nThese nationalists in France — and in Europe — continue on this religion of strength and domination. Martin Sellner, the Austrian leader of Generation Identity, works with an American ethno-tribalist neo-pagan homosexual and terrorist named Jack Donovan. It was Sellner’s Generation Identity that brought Donovan to Germany to push for his cult of the ‘sacramentalism’ of violence, how one can lie to people who are not of your “tribe,” and how the idea of afflicting violence against foreigners or enemies should not even be morally questioned, but rather done only if the violence serves the purpose of one’s tribe.\n\nGeneration Identity — who have been extolled by American and European nationalists as ‘saviors’ of Europe — brought in an American racist terrorist into Germany to push for ethnic violence. What is happening is a pernicious group of revolutionaries, bent on a racial, pagan and anti-Christian aspiration, striving to achieve their ends of a sinister and diabolical utopian vision. “How can there be peace,” said Jehu to Joram, “as long as all the idolatry and witchcraft of your mother Jezebel abound?” (2 Kings 9:22) And how can peace be the goal of such a movement when its witchcrafts abound? Donovan recounted that when he was in Germany: “I performed a blood ritual at the center of the Sonnenobservatorium Goseck in Germany.”\n\nThe abysmal spirits that possessed the soul of France during the horrific French Revolution, still possess her soul today. It is why France’s rebels today fantasize about imitating the revolutionaries of the late 18th century. For example, one of the leading voices of the Yellow Vests is Maxime Nicolle who on his Facebook page had a picture of a guillotine.\n\nThese people are fantasizing about revolution and gore on the streets. Ideological fantasizers are the most dangerous kind. For once fantasy appears to be getting close to reality, violent hearts race with sanguinary urges, and the minds of such people get excited by the sense that their dreams (which to us are nightmares) are soon coming to fruition. With their dreams appearing to near reality, such rebels will think that if only they kill enough people, then their dreams will come alive. This mentality was the driving force of the horrors of the French Revolution.\n\nIf these rebels today escalate things to the way that they want, expect to see the bloodshed of the 18th century on the streets, but much worse. Just to show you how satanic the Revolution was, lets read some descriptions of its violence.\n\nMme. Roland, an adamant supporter of the revolution, whose husband was France’s Minister of the Interior, was herself horrified and recounted the cruelty done by the rebels:\n\nA man was about to be executed, his daughter begged the slaughterers to have mercy on him. The killers murdered another man, drained out some of his blood into a cup and told her, that if she wanted to save her father, she must drink the blood. To save her father’s life, she drunk the blood. The murderers took another woman, and with sadistic pleasure, finished her off by setting a fire between her swollen legs. Within this same time, in the bloody year of 1792, two hundred and fifty priests were rounded up and slaughtered, although they embraced death with joy, leaving one witness to write: “I do not understand, they seemed happy. They went to death as to a wedding.”\n\nIn 1794, sixteen Carmelite nuns were brought to the execution stand. One of them asked why they were being executed. The answer was: “foolish attachment to your stupid religious practices,” upon which the nun looked to her fellow monastics and said: “There you are, sisters: we have been condemned for our religion. …What a happiness to die for our God!” They began singing Veni Creator, and the last one to continue the song was the final nun to be beheaded on the guillotine.\n\nA disciple of Rousseau was revolutionary Maximilien Robespierre or as his followers called him, “The Incorruptible.” When he took over France with his reign of terror he summarized his movement quite simply in his famous Republic of Virtue: “If the strength of popular government in peacetime is virtue, the strength of popular government in revolution is both virtue and terror; terror without virtue is disastrous, virtue without terror is powerless. Terror is nothing but prompt, severe, and inflexible justice; it is thus an emanation of virtue; it is less a particular principle than a consequence of the general principle of democracy applied to the most urgent needs of the fatherland. It is said that terror is the strength of despotic government. […] Subdue the enemies of liberty through terror and you will be right as founders of the Republic. The government of revolution is the despotism of liberty against tyranny.”\n\nThere was also the genocide of the Catholic Vendéeans, slaughtered by the French rebels because they had refused to acquiesce to the Revolution. In the Noyades there was mass drowning when naked men, women, and children were tied together in specially constructed boats, towed out to the middle of the river Loire and then sunk. Historians believe that around 170,000 Vendéeans were killed, around 5,000 in the Noyades. When it was over, French General Francois Joseph Westermann penned a letter to the Committee of Public Safety stating:\n\n“There is no more Vendée… According to the orders that you gave me, I crushed the children under the feet of the horses, massacred the women who, at least for these, will not give birth to any more brigands. I do not have a prisoner to reproach me. I have exterminated all.”\n\nTo give you a further idea of just how sinister this revolution was, here is a quote from historian Stanley Loomis:\n\n“Cannibalism, disembowelment and acts of indescribable ferocity took place here…The Princess…refused to swear her hatred of the King and Queen and was duly handed over to the mob. She was dispatched with a pike thrust, her still beating heart was ripped from her body and devoured, her legs and arms were severed from her body and shot through a cannon.”\n\nAnd make no mistake, the French Revolution is just as much praised by the Right as it is by the Left in France. Yvon Blot, one of the ideological pioneers of the French New Right, described the French Revolution as coming from “the pure origins of Indo-Europeanism”.\n\nThe French, to this day, glorify the French Revolution (just as the Turks today revere the Young Turks and Kamal Ataturk), which means that they can still repeat its evils (just as Turkey today can still resume its genocide). Alexis de Tocqueville once wrote: “The French are better at fighting revolutions than making reforms”. In July of 2017 the French-American author Guy Sorman wrote a warning about the revolutionary tendencies of the French:\n\nThe revolutionary temptation remains a political and cultural constant in contemporary France. Only certain activist minorities, unions and Trotskyist teachers commit acts of violence, but the polls show that 60% of the French see this resistance to the modest liberalization of the labor market proposed by François Hollande’s government as legitimate. … Over the centuries, the parties and the arguments evolve, but the very idea of revolution remains immutable and rather respectable, which is unique to France.\n\nThis distinctive French attitude stems from the glorification of the Revolution of 1789, which is considered to have founded modern France. Celebrated continuously, never contested and taught to all as unique and perfect, the Revolution is propagated as necessarily positive. The fact that it resulted in the Terror, beginning in October 1789, into the widespread massacres of 1793 and then into Napoleon’s dictatorship — are but minor matters.\n\nWhen we see revolution we cannot just blindly believe that it is good or that it is some righteous revolt of an oppressed class. France’s Interior Minister Christophe Castaner called the rebels “professionals of disorder” and destruction who had organized the violence. Far Left activists have graffitied on the walls the letters ACAB: “All Cops are Bastards”.\n\nOne of the biggest buzzwords is “grassroots,” as if this movement is simply a crusade by the common man. There were some powerful entities at work here. We are speaking of the corporations of social media (just like what happened in the Arab Spring).\n\nThe chaos in France has been greatly helped through the algorithms of Facebook. The Yellow Vests movement is, in the words of Ryan Broderick, “a beast born almost entirely from Facebook.” According to a report from BuzzFeed, Facebook changed its algorithms to where a lot of promotion would be for the propaganda of the side of the Yellow Vests:\n\n“Due to the way algorithm changes made earlier this year interacted with the fierce devotion in France to local and regional identity, the country is now facing some of the worst riots in many years — and in Paris, the worst in half a century.”\n\nLike every other mobbish and vitriolic movement, the French rebel groups are organizing to a great extant through Facebook, and use it to spread their message with memes and viral videos. Facebook has changed its algorithms to advance local groups. So these groups in France who are promoting the political movement against the French government are getting their message to the highest audiences thanks to this change in the Facebook marketing system.\n\nIn January of this year, pages on Facebook called “Anger Groups” (Groupes Colère) began popping up. The first one was started by a Portuguese bricklayer named Leandro Antonio Nogueira, who was living in the administrative territory of Dordogne. Nogueira’s group — which currently has around 90,000 followers — was called “Are you fed up? This is now! (anger + dept)”, and it encouraged people to protest the government by blocking roads.\n\nHe then began to help form other “Anger Groups” in France in order to give working class people an outlet through which to make their complaints. These groups erupted in popularity. This was no coincidence. As Broderick writes:\n\n“These pages weren’t exploding in popularity by coincidence. The same month that Nogueira set up his first group, Mark Zuckerberg announced two algorithm changes to Facebook’s News Feed that would “prioritize news that is trustworthy, informative, and local. … So, Facebook tweaked its algorithm and local Anger Groups spread across French Facebook at a shocking speed.”\n\nIn May of this year a woman named Priscillia Ludosky, from the Paris suburb of Seine-et-Marne, started an online petition called “For a drop in the fuel prices at the pump!” to protest fuel taxes. She also started sharing links on Facebook to spread her message. But, her group did not really gain popularity until October. On October 10th, Ludosky wrote on her Facebook page that a local radio show agreed to interview her only if her petition was able to get 1500 signatures. By the next day she announced that he would be doing the interview on the subsequent day. The interview was written up by a local news page for Seine-et-Marne and shared to a Seine-et-Marne Facebook page with about 50,000 subscribers. The interview got 500 shares from that Facebook page. The day that Ludosky got on the radio, another online petition was made called: “For a fuel price capped at 1 euro per liter.” The petition was posted on the French-language crowdsourcing site MesOpinions, and went viral, garnering 160,000 engagements off the MesOpinions Facebook page alone.\n\nNot too long after this, October 22nd, a newspaper called Le Parisien presented the petition made by Priscilla Ludosky and it quickly went from 10,000 signatures to 225,000. Now, Ludosky’s petition has over a million signatures.\n\nOn October 15th another online petition was made on MesOpinions called “Stop the fuel at the price of gold”, and its title was later changed to “France in Anger” and received 17.3 million total interactions since October.\n\nHere is a very interesting thing to observe: all of the top ten “Anger Groups” were made in the exact same week that Ludosky went on the radio and the second petition went viral. This is not coincidental.\n\nThe popularity for the movement is shown on the internet. One Yellow Vest page called “COMPTEUR OFFICIEL DE GILETS JAUNES” or “The Official Yellow Jackets Counter” currently has 1.7 million members according to its members page. Another page, Anonymous France, has 1.2 million likes. According to one statistic, 72% of the French population currently support the rebellious movement.\n\nOn October 12th, two truck drivers, Eric Drouet and Bruno Lefevre, both from the same Paris suburb as Ludosky, took Ludosky’s petition and started a Facebook event based on it called “National Blockage Against Rising Fuel” and scheduled it for Nov. 17.\n\nThe Yellow Vests (Gilets Jaunes), appeared almost out of nowhere and organized mainly through Facebook groups. These rebels have been using Facebook to fuel their ideology of revolution that fantasizes about repeating the horrific French Revolution.\n\nThe protests sparked after the French government announced that a green tax on fuel would be imposed starting on the first of January.\n\nSince last weekend more than 130 people were injured and 412 arrested in violent riots in Paris. Four people, so far, have been killed. Cars have been burned and shops looted.\n\nThe Secretary General of France’s Democratic Confederation of Labour, Laurent Berger, has expressed grave concern about the violence of the Yellow Vests, and described the pressure to support their cause as “a form of totalitarianism” unto itself. “There are a number of practices that took place this weekend that are disturbing… ” said Berger. “Being forced” to “agree with those who demonstrate to pass is a form of totalitarianism that is not acceptable,” said Mr. Berger. He also affirmed that the “discontent will survive”.\n\nThe French government has tried to appease the rioters by suspending the diesel tax, but leaders of the revolution say that it is “too little, too late”, proving that the motivation behind this chaos has nothing to do with a diesel tax (as Trump says), but a sinister agenda of power. For even after the French government acquiesced to the demand against the diesel tax, demonstrators were back in the streets wearing their yellow jackets. They also have blocked fuel depots and had taken over tole booths to let people drive through them for free next to a sign reading “Macron dictator.”\n\nPrime Minister Edouard Philippe announced a six-month delay on the fuel tax, stating: “No tax is worth putting the nation’s unity in danger”. But this has not abated the rebel movement. A leader of the protestors, Benjamin Cauchy, said: “It’s a first step, but we will not settle for crumbs”.\n\nDamien Abad, a French lawmaker from the center-right Les Republicains party, said that:\n\n“If your only response, Mr. Prime Minister, is the suspension of Macron’s fuel taxes, then you still haven’t realized the gravity of the situation … What we are asking of you Mr. Prime Minister, is not a postponement. It’s a change of course.”\n\nSo the agenda is not, as Charlie Kirk has affirmed, “the middle class rebellion against cultural Marxism”, but really a mob using actual grievances as a pretext to violence. Rebels are not condemning Macron for socialism, but are calling him a “president of the rich”.\n\nMarine Le Pen of the nationalist Front National party is also using the violent unrest for political aspirations, and has called for the lower Chamber of French Parliament to be dissolved and snap elections conducted. Le Pen said:\n\n“It is necessary to implement proportional representation and dissolve the National Assembly in order to hold new proportional elections.”\n\nSo far, the attempt to calm the mob has not worked. A report from France24 states: “After three weeks of rising frustration, there was little sign Philippe’s measures would placate the ‘yellow vests’.” An editor for France24, Philip Turle, did a series of interviews with members of the angry mob, and recount that almost all of those talked with were still not satisfied by the government’s attempt to abate the mobbish storm.\n\nThe French government has warned that thousands of rioters could storm Paris to “to vandalise and to kill”. Facebook groups made by the rebels are calling for an “act 4”, or another set of violence and chaos. “France is fed up!! We will be there in bigger numbers, stronger, standing up for French people. Meet in Paris on Dec 8,” said one group’s banner. Eric Drouet, one of the leading voices of the mob, made a video on December 1st called “Act 3,” in which he said: “We will move to the next level, so we will try to be heard a little more and wake up this government that only observes our actions”. Now these rebels are planning on an “Act 4,” for which the French government is preparing. Almost 90,000 police officers are planned to be deployed, which reflects the gravity of the situation.\n\nAccording to a report from Le Monde:\n\nFor the first time, a dozen armored vehicles of the gendarmerie, able to destroy barricades, will also be deployed in the capital. The Paris Police Prefecture has on its side called traders in the Champs-Elysees area to “close [their] doors and access”, while the Eiffel Tower and a dozen Parisian museums will remain closed.\n\nThe rebels are planning on another destructive storm of riots. Brace yourselves for the European Spring.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Government Of France Wants To Make A Vaccine Certificate Mandatory To Enter Public Places. Tens Of Thousands Of People Take To The Streets To Protest Against This And Declare It Tyranny - Walid Shoebat", "description": "The anti-establishment (and anti-Macron) movement of the Yellow Vests, of which we wrote on in 2018, did not die with the coronavirus lockdown. Rather, went temporarily under the radar, and only intensified. Now this very atmosphere of rage is re-manifesting itself against the government’s policy have making a covid vaccine certificate mandatory in order to […]", "url": "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/", "site_name": "Walid Shoebat", "article:published_time": "2021-07-25T20:16:10+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/07/france.jpg", "image:width": "1458", "image:height": "900"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/3aIL-fk0w_g?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/3aIL-fk0w_g?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/4Y8KoNZZ_aM?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/4Y8KoNZZ_aM?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Fpsybx4NUBI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/Fpsybx4NUBI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/5sHieHpNcsw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/5sHieHpNcsw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://www.rt.com/news/530164-clashes-paris-protests-vaccination-certificates/", "https://shoebat.com/2021/06/09/numerous-reports-show-that-covid-came-from-a-lab/", "http://shoebat.org/2017/03/19/erdogan-has-just-declared-he-intends-to-have-muslims-invade-christian-europe-in-the-future-and-that-turkey-will-build-nuclear-bombs-to-soon-attack-the-christian-west-to-subjugate-the-church/", "http://shoebat.org/2017/01/14/the-coming-beheading-of-christians-will-spread-globally-with-the-rise-of-populism-as-biblical-prophecies-and-current-trends-reveal-turkey-austria-germany-france-japan-to-poland-the-philippines/", "http://shoebat.org/2016/09/26/nazism-is-taking-over-germany-the-muslims-and-the-germans-are-working-together-to-cause-mass-violence-that-will-spark-major-war-and-usher-in-the-revived-nazi-empire-that-will-slaughter-countless-chri/", "https://www.francetvinfo.fr/economie/transports/mobilisation-du-17-novembre/enquete-franceinfo-pourquoi-l-ultradroite-a-t-elle-embrasse-la-cause-des-gilets-jaunes_3084163.html", "https://shoebat.com/2018/12/08/get-ready-for-the-europe-spring-the-yellow-vests-are-not-good-but-are-part-of-a-conspiracy-to-bring-back-the-horrific-french-revolution/peste-noire-yellow-vests-2/", "https://en.wikipedia.org/wiki/Peste_Noire#cite_note-ReferenceB-55", "http://www.apple.com", "http://crc-resurrection.org/toute-notre-doctrine/restauration-nationale/maurras/charles-maurras/", "https://rorate-caeli.blogspot.com/2011/09/taming-action-i.html", "https://en.wikipedia.org/wiki/%C3%89ric_Zemmour#Immigration_and_assimilation", "http://shoebat.org/wp-content/uploads/2018/12/martin-sellner-.jpg", "https://www.earlymoderntexts.com/assets/pdfs/rousseau1762book4.pdf", "http://shoebat.org/2018/11/19/tommy-robinson-joins-major-organizations-that-want-to-destroy-christianity-promote-homosexuality-human-sacrifice-and-terrorism/", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=facebook", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=twitter", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=reddit", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=linkedin", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/#print", "#", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=skype", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=jetpack-whatsapp", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=telegram", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=pocket", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=pinterest", "https://shoebat.com/2021/07/25/the-government-of-france-wants-to-make-a-vaccine-certificate-mandatory-to-enter-public-places-tens-of-thousands-of-people-take-to-the-streets-to-protest-against-this-and-declare-it-tyranny/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-07-25T20:16:10+00:00"}