{"result_id": "271010", "URL": "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/", "timestamp": "2023-04-25 17:07:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Pope Orders Vatican Salary Cuts Amid COVID-Related Financial Trouble", "cleaned_text": "There are a lot of sordid facts about the history of people in the Church and the Vatican, but also a lot of myths. It is a myth, for example, that the Vatican is the ‘richest’ entity in the world, or that somehow, the Church controls the world’s finances. The Vatican is certainly not the richest in the best estimations that favor her, and if a full accounting probe was to be done, it likely would show that she is in severe financial debt. Also, she does not control the world’s finances, but naturally touches many parts of the wider network because of the expanse that the Church naturally has.\n\nIt is a known fact that there is a lot of questionable transactions that have gone through the Vatican banking system, and for the above reasons. A full audit of the bank would likely not just expose problems for her, but most likely wider ones that could likely collapse the world financial system and lead to political chaos. Thus the issue is not “the Church”, but the people, and how the affect each other.\n\nWe know that COVID has financially impacted all nations, and the Vatican is no exception. It is long known that the US (owing to her wealth and large number of Catholics) and Germany (owing to the Kirchensteuer) are the largest contributors to the Church’s financial operations, and both have been hit hard by the global shutdowns owing to the pandemic. That said, it naturally has had to have impacted the Vatican, as Reuters reports that Pope Francis is ordering a salary cut for Vatican employees.\n\nPope Francis has ordered cardinals to take a 10% pay cut and reduced the salaries of most other clerics working in the Vatican in order to save jobs of employees as the coronavirus pandemic has hit the Holy See’s income. The Vatican said on Wednesday that Francis issued a decree introducing proportional cuts starting on April 1. A spokesman said most lay employees would not be affected by the cuts. A senior Vatican prelate said it was believed to be the first time in living memory that a pope had taken such action. Francis, 84, and from a working class family, has often insisted he does not want to fire people in difficult economic times, even as the Vatican continues to run up deficits. Cardinals who work at the Vatican and live there or in Rome are believed to get salaries of about 4,000 to 5,000 euros ($4,730 to $5,915) a month, and many live in large apartments at well below market rents. Most priests and nuns who work in Vatican departments live in religious communities in Rome, such as seminaries, convents, parishes, universities and schools – giving them greater protection from economic downturns. They have much lower living expenses than lay employees – such as police, ushers, firefighters, cleaners, art restorers and maintenance personnel – who live in Rome and many of whom have families. It is these lay workers who the pope appeared to want to protect, as most of their employment levels were not listed in the papal decree. Vatican pay grades go from levels 1-10 for most employees. Senior positions have four grades, from C to C-3. Apart from the cardinals, other clerics will see their salaries reduced by between 3% and 8%. Programmed pay rises for all but the three lowest pay grades will be suspended until March 2023. (source)\n\nIt will be interesting to see if this salary cut has further consequences, and if the trends continue, that the holes and failings in the global financial system would be exposed and possibly force a reckoning with the debt, which would have major political consequences.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Pope Orders Vatican Salary Cuts Amid COVID-Related Financial Trouble - Walid Shoebat", "description": "There are a lot of sordid facts about the history of people in the Church and the Vatican, but also a lot of myths. It is a myth, for example, that the Vatican is the ‘richest’ entity in the world, or that somehow, the Church controls the world’s finances. The Vatican is certainly not the […]", "url": "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/", "site_name": "Walid Shoebat", "article:published_time": "2021-03-24T19:55:18+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/03/03242021c.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2021/03/03242021c.png", "https://www.reuters.com/article/BigStory12/idUSKBN2BG1LG", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=facebook", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=twitter", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=reddit", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=linkedin", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/#print", "#", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=skype", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=jetpack-whatsapp", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=telegram", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=pocket", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=pinterest", "https://shoebat.com/2021/03/24/pope-orders-vatican-salary-cuts-amid-covid-related-financial-trouble/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-03-24T19:55:18+00:00"}