{"result_id": "271050", "URL": "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/", "timestamp": "2023-04-25 17:07:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Viruses, Militarization, And 2021 Thoughts", "cleaned_text": "As 2020 leaves and 2021 comes into full focus, many things await for this new year. There are many hopes and dreams, but also a lot of concerns about what may come to pass, given that, as a theme I have fully emphasized, nothing has really changed in terms of fundamentals but only become worse.\n\nThe main driver of all things getting worse this year has been COVID. Regardless of what one thinks or does not think about COVID, the fact remains that COVID is a really big deal because it exposed the serious economic problems in the US economic machine that has driven the world since the end of World War II. The details of this, while interesting and important in themselves, are not worthy of discussion here, except to say that there were serious problems building since 1965, and that beginning around 1974, those problems were not dealt with through actual economic activity, but through phantom tactics that were nothing more than financialization for the most part. This scam exploded in 2007 with the subprime-cum-derivatives crisis in the financial markets, and has not gone away. The world should have had a major economic collapse by now, and the only reason it has not was because of the US government doing what governments traditionally do as a political solution, which is to destroy the value of the currency through printing. This is not a new thing, but has been done in many countries throughout history going back to ancient times. The main difference is now that the US is so central to the world economy, problems in the dollar create problems for the world that could set the world back to a pre-world war type scenario.\n\nAnd this warning, the resetting of conditions back to those pre-world war I, are happening around us, except this time with guns more powerful than ever before, nuclear weapons, computers, robotics, and artificial intelligence. If you wanted a science fiction future, you got it coming, because that is what is going to be delivered for the future.\n\nSo what is a man to make of all this? Indeed, it is New Years Eve, and I have been sitting here watching the events of the past year on “rewind” while looking to try and anticipate what the future will bring.\n\nLet’s go through a brief list of topics and delve into them.\n\nCOVID: This is not going away. COVID is a real issue, but it is more about the political nature of the virus at this point (not to deny the medical issues tied to it in any way). The virus has been used as an excuse to bring out the worst tyrannical impulses in governments, and this trend is going to continue worldwide. What remains to be seen of how the vaccine will influence the relationship between the rulers of society and the ruled is yet to be determined, but we can say for sure that COVID is going to be fully exploited for any political leverage it can bring. Prepare for the potential of COVID travel passports, more invasive forms of monitoring in the name of ‘public safety’, potential restrictions on movement in certain venues, and possibly more severe measures. Measures will vary by country, but the point is that no matter how severe or not various ‘measures’ are applied by nation, the excuse of safety is being used to strip people of their freedom, and people are lining up to get rid of them in the name of ‘safety.’\n\nFreedom as a concept: Speaking of freedom, expect to see continual erosion in things such as freedom of speech, freedom of expression, and just the general idea that people can have an opinion outside of a prevailing and accepted cultural orthodoxy regardless of whether or not it makes any sense. I’m not talking so much about religion here as I am about ‘socially acceptable’ ideas, but certainly not excluding the former. Basically, with the decline in government and man being a creature made to worship, he is exchanging the worship of God for the worship of his own vanities, proclivities, and even governments, and so he is elevating his passions for these ideas over their natural status as concepts governed under religious belief to conceptual idols, and in doing this is risking the creation of political sectarianism and violence as forms of religious practice and worship. It’s why people have come to equivocate certain political positions with sentiments usually reserved for religious fervor or heretical damnation, since the religious impulse has been hijacked, abandoning the supernatural and truth for things of a temporal nature.\n\nConflict in the world: It’s always existed, but it’s getting worse. Honestly I am at a point where one’s daily task, as a person, ought to be just to read a good newspaper such as the Financial Times or Wall Street Journal daily since thee are so many things happening related to so many issues. However, if I had to point and choose a few, I would watch the social and militaistic impulses in Germany, Turkey, and Japan closely.\n\nChina: Please. And let me say I’m not saying that China is NOT a threat or dangerous or does bad things. However, one must remember that China is not nor has ever been as powerful as she seems (her country, mind you, is named in all languages after Emperor Qin, the tyrannical emperor said to have red hair and blue eyes and come from the Turkic Tocharian peoples and was the one who build the Great Wall, made the terra cotta soldiers, standardized the Chinese language, created the Chinese system of dates, weights, and measures, and was also a sadistic cannibal who served his enemies as food to their families). China has a history of being invaded over and over by every Turco-Aryan people that has ever inhabited the steppes of Central Asia or Siberia, not to mention their continual beatings from Japan and the fact that tiny southeast Asia, while not imperial in any way, continually is able to keep China out of their homelands only speaks to the Chinese weakness. Expect to see anger against China increase and the drums for war beat against them, but unless China can stop seriously mistreating her people, clean up her internal messes in all things from trade to farmland, and stop the rampant fraud that has characterized Chinese history since the days of Confucius, expect 2021 to be just another year of delaying what is likely going to be the inevitable cycle of revolution coming from a “mandate of heaven”.\n\nDeutschland:…and über alles as well, for while in 2021 she won’t be there yet, that is what she is striving for. As US power continues to decline in Europe owing to economic problems, as I have noted, watch for the Bundeswehr to continue aggressive programs of remilitarization in the name of “continental security” or a term related to this. Watch for major companies such as Airbus, C.G. Haenel, and Rheinmetall (especially that latter one) become more powerful, see their stock prices grow, and get more contracts with the German government as the potential for an eventual and new I.G. Farben awaits here formation. As the economic problems worsen in Germany these trends will only become more pronounced and if not stopped, and while it won’t be in 2021, there could again be the sound of boots marching from Deutschland to her neighbors once again.\n\nThe US Dollar: You still own that stuff? Not that dollars are bad, but the dollar is rapidly losing value as Trump and most likely Biden, following the example of their predecessors, are going to print, print, print, like a drunken sailor spending money on booze, cards, and questionable women at port. I don’t give financial advice, and I’m not saying go on a spending spree. But I’m also saying it may be wise not to save your money in a traditional bank, but to consider investing it into commodities that preserve value, examples being gold, silver, precious metals, and land. I’m not saying spend, but I am saying to pay attention to the markets, because I have explained before, value comes from scarcity, and it is impossible to ‘print’ one’s way to wealth, unless one wants to be a trillionaire in Zimbabwean dollars.\n\nAfrica: Watch for more geopolitical fighting on the continent as the preparations for war resources continues. Burkina Faso, Congo, Mozambique, and Ethiopia/Eritrea will be special areas of interest to pay attention to.\n\nJapan: The trends are the same as Germany. Watch for a revival of nationalism, and especially, militarism with a major focus on AI. Also, immigration and population issues will be something to pay attention to, since Japan is undergoing major population problems and waves of migrants from across Asia and Brazil have been brought in to deal with the matter.\n\nAI and robotics: One of the most dangerous trends, and yet also the most important too because robotics is the way of the future. What heavy industry making guns and weapons was in World War I, what nuclear science was in World War II, is what robotics and AI will be in World War III.\n\nDo you have children? It might be a good idea to consider helping them learn about robotics and AI, since this will guide the future. But first steps first, there is a lot more to go than just straight to the Terminator. Battery research, especially with rare earth elements in said batteries to prolong the life of tools, and the proliferation of the “Internet of Things” are the big sub-steps to watch, the latter moreso than the former as far as the popular man is concerned (the former is more about scientists and research for companies such as Tesla). If you haven’t already, consider things like learning Arduinos, Raspberry PI, and other electronic automation processes something that should be looked at very carefully.\n\nYou’re old now: Millennials, that is. They are now moving into middle age and the Zoomers are rapidly catching up, as the youngest Zoomer is going to be eleven and the oldest Zoomer will be 26. As the Millennials age, trends to watch will be long-term impoverishment, worsened by the effects of COVID-19, and also to check the suicide rates of Millennial women, for as next year the youngest of the Millennial women (1981) will turn 40, it is at this age that many begin to despair of life, generationally speaking as a whole, and one may start to see what I have feared in so far as the emergence of a trend towards suicide. I also note again this pertains more to women, since men can sire children into old age (think Larry King), but women if they have not had a child by 40 are practically done in so far as it concerns a first child.\n\nGoodbye, Boomers: The oldest of the Boomers turn 75, and with the youngest being 56, all over the age for AARP membership, the Boomers are now the official old people of society, and given that the average age of death in the US is about 78, the Boomers are going to continue to die off, although they will still have some influence. As the 2020s are a decade of escalation, expect to see family tensions begin to escalate as the Boomers begin to get sick and fighting for inheritance- that is, what is left after the reverse mortgages and credit card debts are concerned -within families intensify, all exacerbated by the effects of COVID that have economically devastated people. This will be a major trend to watch beginning in 2021 and continuing for the rest of the decade.\n\nAmerican Lord of War?: Not the movie with Nicholas Cage, but the same concept, where given rising domestic tensions in the US, while I don’t expect to see blood on the streets yet, the tensions will definitely increase among political factions to the point that people are going to be angry to the point they may start hurting each other. Pay special attention to the political right, since they are the ones that have been generally speaking the most restrained, and given the known inclinations of the political left to use violence such as with the BLM riots, look to se potential calls for the political right, using the justifications of the political left, to do violence themselves.\n\nMigration and fertility: With the exception of deseparte Millennial women looking to get a child as their fertility runs out given their increasing age, fertility rates for the non-Hispanic white bloc in the US and Western world will likely decrease, continuing long-standing trends for decades. Likewise, expect in 2021 to see likely not above replacement rate, but proportionately higher birthrates among the Black and Hispanic demographics. In the case of Europe and to a lesser extent the US, immigration will continue, and many increase significantly owing to conflicts, especially in the Tigray region of Ethiopia. In this sense, most “population growth” and fertilty will not be grown by actual choices made in-country, but by migrations from out-of-country. Russia is expected to have the same, continuing the trends of replacement from Central Asia due to death and emigration from Russia among the Slavic population.\n\nIn general, we can say that 2021 is going to be much like 2020, just amplified. The most important trends, in my estimation, to watch will be the financial sector and the money printing, because that is directly tied to all the above trends. Either way, it is most likely going to be more of the same, but just more intense, building up to something greater in the future.\n\nIt’s a rough ride, and now is the time to enjoy the journey. Get ready, because the future is upon us.\n\nHappy new year from all of us at Shoebat.com\n\nDonate now to help support the work of this site.\n\n When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Viruses, Militarization, And 2021 Thoughts - Walid Shoebat", "description": "As 2020 leaves and 2021 comes into full focus, many things await for this new year. There are many hopes and dreams, but also a lot of concerns about what may come to pass, given that, as a theme I have fully emphasized, nothing has really changed in terms of fundamentals but only become worse. […]", "url": "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/", "site_name": "Walid Shoebat", "article:published_time": "2020-12-31T22:41:44+00:00", "image": "https://shoebat.com/wp-content/uploads/2020/12/12312020.jpg", "image:width": "600", "image:height": "600"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2020/12/12312020.jpg", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=facebook", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=twitter", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=reddit", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=linkedin", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/#print", "#", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=skype", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=jetpack-whatsapp", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=telegram", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=pocket", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=pinterest", "https://shoebat.com/2020/12/31/viruses-militarization-and-2021-thoughts/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2020-12-31T22:41:44+00:00"}