{"result_id": "271048", "URL": "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/", "timestamp": "2023-04-25 17:07:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Lets Talk About The Nipah Virus And Its 60-70% Death Rate", "cleaned_text": "Another virus has appeared, and it has a death rate of 50% to 70%. Its called Nipah. This virus recently killed a 12 year old boy in India, and there is serious concern that it could spark a pandemic. So far this virus has only been in south and southeast Asia where it has been contained since the 1990s. But if it spreads, then it would a horrendous death count. According to the Indian Express, “previous outbreaks have remained largely localised and have been contained relatively quickly.” Lets hope this does not spread at a global scale. The first time Nipah was discovered was in Malaysia in 1998 and then in Singapore in 1999. Its name is from the village in Malaysia where its first victim who was isolated died. All outbreaks have taken place in south and southeast Asian. There have been ten outbreaks in Bangladesh since 2001.\n\nThe virus is transmitted from animal to human, but once its in humans then it can spread from human to human, and like covid it can spread through nasal droplets. According to two Bangladeshi researchers “respiratory droplets of an infected person can transmit the virus”. In most of the cases it has been hospital staff and caregivers (people close to those infected) who have contracted nipah.\n\nThe virus typically spreads from bats onto other animals, pigs, dogs, cats, goats, horses and sheep. From these animals, they can spread to humans. As the Indian Express reports: “Humans get infected mainly through direct contact with these animals, or through consumption of food contaminated by saliva or urine of these infected animals.” Nipah is not as contagious as covid, but obviously it is its death rate that concerning. For example, in an outbreak that hit Siliguri (a major city in India) in 2001, 66 people were infected and 45 of these died. But its infectious rate is rather slow, hence why it has been controlled for all of these decades. In 2018 there was an outbreak in Kozhikode (Indian city in Kerala) and nearby Malappuram districts. All of the people who had either direct or indirect contact with suspected Nipah cases had to be put under observation. Around 3,000 people were put in quarantine. Kerala already has a protocol to follow in the case of a nipah outbreak. When nipah appeared again in 2019, Kerala’s health department contained the situation and only one nipah case was reported in Ernakulam district.\n\nWhen the state reported Nipah again in 2019, the health department already had a protocol in place to handle the situation. In 2019, only one case was reported in Ernakulam district. Kerala’s protocol system was intensely executed once the most recent nipah case was reported. Three hospital wards in Chathamangalam panchayat in Kozhikode, where the victim lived, were completely shut down. According to the Indian Express: “Movement to and from these three wards have been banned. Police have put up barricades and checkpoints at all locations leading to the village of the victim.” The Indian Express also explained its rate of contagiousness:\n\nSo far, contagiousness in low. In Bangladesh, the majority of cases are from drinking fresh date palm sap or animal infection. Bats, infected with the virus, will suck the sap from the tree, leaving nipah in the substance. Humans will consume a fresh date palm drink only hours after it has been harvested. Since nipah can survive for days on sugar-rich solutions, people who consume infected fresh sap, can indeed get the virus. There is also the phenomena of the virus spreading from pigs to humans. Bats will a chunk of fruit and the rest of it will drop to the ground where they are eaten by pigs. Humans with direct contact with these pigs can get infected through the saliva of the animal. Infections have also spread from cow to human. For example, a sick cow in Meherpur, Bangladesh in 2001 was strongly associated with Nipah infection.\n\nNow, what is the chance of nipah becoming a pandemic? In the words of Stephen P. Luby, Professor of Medicine:", "opengraph": {"locale": "en_US", "type": "article", "title": "Lets Talk About The Nipah Virus And Its 60-70% Death Rate - Walid Shoebat", "description": "Lets talk about this horrifying virus: Another virus has appeared, and it has a death rate of 50% to 70%. Its called Nipah. This virus recently killed a 12 year old boy in India, and there is serious concern that it could spark a pandemic. So far this virus has only been in south  and […]", "url": "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/", "site_name": "Walid Shoebat", "article:published_time": "2021-09-09T01:14:00+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/09/My-Post-2021-09-08T201341.706.jpg", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/LxoiW-TSzYg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/LxoiW-TSzYg"}], "links": ["https://indianexpress.com/article/explained/nipah-virus-spread-covid-pandemic-kerala-7490952/", "https://academic.oup.com/cid/article/49/11/1743/344101?login=true", "https://med.stanford.edu/news/all-news/2018/05/5-questions-luby-on-virus-with-potential-to-cause-global-pandemic.html#:~:text=Epidemiologist%20Stephen%20Luby%20is%20among%20the%20Stanford%20researchers%20studying%20the%20Nipah%20virus.&text=A%20little%2Dknown%20virus%20discovered,bats%20or%20pigs%20to%20humans.", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=facebook", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=twitter", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=reddit", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=linkedin", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/#print", "#", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=skype", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=jetpack-whatsapp", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=telegram", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=pocket", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=pinterest", "https://shoebat.com/2021/09/08/lets-talk-about-the-nipah-virus-and-its-60-70-death-rate/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-09-09T01:14:00+00:00"}