{"result_id": "271021", "URL": "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/", "timestamp": "2023-04-25 17:07:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The Protestant Church Of France Just Did Its First Gay Wedding", "cleaned_text": "The Protestant church of France just did its first sodomite wedding. It is being declared as a moment of progress, but it only indicates the decay of the nation. According to a report from Le Monde:\n\nThe two citizens of Sodom stated that their wedding has now opened the doorway to empower other residents of Sodom to come forth with their sodomite revolution: “We know it has been a tough fight for others before us. By making our little journey, it’s a way of honoring them”. Emmanuelle Seyboldt, a minister for the United Protestant Church of France, speaks of the Christian faith as something that is evolving: “Society is changing and the Church is evolving.” Thus, truth is does not exist according to Seyboldt. The Church is the pillar and foundation of the truth (1 Timothy 3:15), and if it is “evolving”, then the truth cannot exist, since truth does not change. ” “Jesus Christ is the same yesterday, today, and forever.” (Hebrews 13:8) God does not change, and since Christ is God (the Second Person of the Holy Trinity), it was Christ Who, in His place within the Triune God, destroyed Sodom. Hence the Scripture reads: “the Lord rained brimstone and fire on Sodom and Gomorrah, from the Lord out of the heavens.” (Genesis 19:24) The Lord rained down from the Lord, because this was the Holy Trinity destroying Sodom, Christ destroying Sodom. Abraham was visited by three men, but he only bowed down to one of them. Even before the birth of Christ, the Son of God would visit humankind; thus Moses saw back of God after asking to see His glory. Christ destroyed Sodom, and His valorous law still remains the same, teaching mankind on what is unseemly.\n\nSince we are talking about the movement of Sodom in France’s Protestant church, I would like to present an article that we wrote on how a protestant minister helped lead one of France’s biggest pedophile networks…\n\nSuch are the words of a 14th century saint, showing that there is nothing new under the sun; that whatever evils we witness today, was witnessed in the past. Bernardino was living in an era that we today would assume was very conservative. And while the Church still held tremendous influence over society in those days, even in a time that was more conservative in comparison to today, there lied the religion of Sodom. The religion of Sodom is not just observed by the priests of the church of the Left, but also by the priests of the temple of the Right.\n\nWhen it comes to exposing pedophilia, conservatives tend to focus on the Left-wing and ignore the presence of pedophiles amidst the ranks of the Right-wing. You will argue that there are no Right-wing pedophiles or pederasts because the Right is all about tradition and morality, but this is based on a misconceived understanding of the two different paradigms of the Right and Left and how their warped view of mankind — while having their differences — lead to the same evils. The Leftist positions himself as being on the outside of moral obligations, essentially as a rebel against social norms. The Rightest, on the other hand, while lauding his own traditionalism and his preservation of culture, will see himself — nonetheless — as in a higher state of moral order, and thus in the name of tradition he will return to antiquity, prior to Christian ruling, to the days of paganism when horrific perversity was seen as normal. In the words of Michael Prazen: “The extreme left revolutionary is outside morality, while the extreme right revolutionary places himself above morality.”\n\nLet us introduce you to the Jeffery Epstein of France. Like Epstein, this man was part of a pedophile network and he knew of the perverted activities of the rich and powerful. Like Epstein, this man knew too much.\n\nThere once was a Baptist minister in France named Joseph Douce. While he was a “minister”, he defended pedophilia, made friends with pedophiles, and was connected to a pedophile priest who took pictures of tens of thousands of young boys from the Philippines, Sri Lanka and other poor countries. He also was connected to a network of Right-wing operatives, including Right-wingers who advanced their pederastic and homosexual agenda as a fulfillment of their Rightest masculinist ideology. What this signifies is a pederastic and pedophile element that has been entrenched within the Right-wing movement.\n\nThis is not a mere isolated incident, but a light exposing how far this rabbit hole goes.\n\nJoseph Douce was born in a Dutch speaking family in Belgium where he would study in the seminary to become a Catholic priest. He would later serve as a volunteer for a NATO unit in France where he rose up to the rank of corporal. In 1965 he was accepted to the Europa Seminär Stenonius in Maastricht in 1965, an institution under the leadership of the Catholic Bishopric of Roermond. Just a year later, Douce would leave the Catholic Church and convert to Protestantism. He became a minister of the Baptist tradition in 1971 and would quickly become the first religious leader in French history to celebrate homosexual marriages. During the years 1974 and 1975, Douce studied sexology and psychopathology at the Protestant University of Amsterdam. He even got the nickname, “pastor porno” because he commenced his ministry in a former porn theater in Pigalle, and also visited saunas and other “dating places,” to meet gay men. During his diabolical ministry in supporting pedophiles and pedophilia, Douce was receiving funds from the porn industry. According to French journalist Bernard Violet, Douce “accepts a monthly donation of 5,000 francs from the king of porn cinema of the seventies.” Although, who this “king of porn” was has not been specified.\n\nDouce was a psychologist and a sexologist, and on account of his fixation on homosexuality he was removed in 1975 from the Federation of Evangelical Baptist Churches of France (FEEBF).\n\nIn 1976 Douce openly declared himself a homosexual and founded the “Center of Christ the Liberator” (Center du Christ liberateur) in Paris, and it was made to be a refuge for the degenerates of society: homosexuals, transgenders, sadomasochists and even pedophiles. Douce defined the center with typical modern day heretical jargon:\n\nIn 1982 Douce created a publishing firm called Lumière et Justice which would publish books under his direction and which were of a sinister character. One such book was Pedophilia in question in which Douce “develops scabrous theses and explains wanting to decriminalize pedophilia”. In 1990, the head of the French intelligence agency at the time (Central Directorate of General Intelligence), Claude Bardon, ordered that Douce be put under his surveillance after it was suspected that he was leading a pedophile network from his bookstore. Indeed, it is true that Douce had meetings for pedophiles. According to Christophe Hondelatte, Douce “even had a talk group where he hosted pedophiles on Sundays.” Douce was one of the founders of the International Lesbian and Gay Association (ILGA), the largest LGBT organization globally. Douce’s “Center of Christ the Liberator” was also involved with another organization called the International Pedophile and Child Emancipation (IPCE) and partook in its meetings.\n\nDouce was connected to another perverted British born priest named Nicolas Glencross who, since 1948, served a small parish in Nièvre, Saint-Léger-des-Vignes. While serving as a pastor to ‘defend’ the LGBT, Glencross was also involved in something very sinister and dark: each year he would return to France with children from the countries that he would travel to like India, Peru and Sri Lanka for his diabolical desires. Each child was paid 50 francs each by Glencross so that he could take pictures of them in the nude. Glencross also enjoyed drawing the children naked. Speaking before the magistrate, Catherine Scholastique, Glencross explained: “I have a pencil in my eyes, I like to capture what is fleeting”. Glencross produced between 20,000 and 30,000 photos of children in the space of forty years. In June of 1990, police arrested Glencross in the parish in Nievre where he was living. The police discovered, in the rectory, a photography studio and bags of filled with his pedophile photos which were intended for pedophile magazines. According to Thierry Meyssan (writing in 1997):\n\nFrench journalist Bernard Violet details how “The boys most often found themselves naked, in academic or suggestive poses.”\n\nGlencross was involved in an international pedophile network that profited from child pornography. Meyssan writes that Glencross met with one Michel Caignet, a neo-Nazi who was active in Identitarian activism and advanced the sodomist ideology that held that pedophilia and pederasty was an ideal form of masculinity that conformed to the Graeco-Roman civilization. Caignet ran a pedophile magazine called Gaie France; the magazine’s subscriptions were managed by Pastor Joseph Doucé himself. In 1975 Caignet was arrested in Austria with an SS uniform and a Nazi armband in his suitcase . Caignet was at one point the treasurer of FANE (Federation of European National Action) in 1978. Caignet, as part of FANE, vowed “to fight without reserve (…) alongside his European comrades for the safeguard and the rebirth of the white race and for the establishment of national socialism” .\n\nCaignet collaborated with Michael Kuhnen, a neo-Nazi leader who was also a huge proponent for National Socialist homosexuality. According to Le Monde, Caignet “became the friend and the main relay in France of Michael Kuhnen, leader of German neo-Nazism, who died of AIDS in 1991.” Together with Kuhnen, Caignet helped create the EuropÄische Bewegung or the “European movement”. Kuhnen was also a frequent member of the neo-Nazi cafe called “Den Odal”, which was opened in 1968 by Bert Eriksson, a Nazi political operative who founded the Right-wing Vlaams Belang, a major party in Belgium that has helped establish Right-wing anti-immigration activism in Europe. Eriksson, alongside Flemish separatist Filip DeWinter (one of the founders of the Counter-Jihad movement), founded the party.\n\nIn 1988, Filip DeWinter, alongside Eriksson, joined a demonstration of a hundred or so Nazi sympathizers. The plan of these neo-Nazis was to enter the Lommel German war cemetery where 40,000 Nazi German Wehrmacht soldiers were buried, and put flowers on their graves. DeWinter was the one who organized, in 2007, the Counter-jihad Summit in the EU Parliament building, which would officialize the Counter-jihad as an international movement. It was the Counter-jihad movement which helped to commence the later nationalist phenomena that the world began to witness in 2015, with the spark of populism and nationalism within the EU (especially during the migrant crises), and which had links to provocateurs like Robert Spencer, Pamela Geller and Geert Wilders.\n\nMichel Caignet was thrown out of the FANE the day after April 20, 1986 when he and his Nazi comrades celebrated the birth of Hitler. During the banquet celebrating Adolf Hitler’s birthday, Caignet distributed his newspaper, Gaie France, to foreign guests and suggested that Mussolini was homosexual, which greatly upset his Italian fellow Fascists. Gaie France (which no longer exists) published pornographic material of children and youths, and also presented poetry in praise of pedophilia. In issue n. 11 the magazine quoted this poem:\n\nIn issue n. 6 of Gaie France it speaks about preferences for European children over non-European children:\n\nIn issue n. 30 of Gaie France, it criticizes “the incredible demonization of sexual relations between adults and minors (even simple touching)”. This statement even goes so far as to reinterpret the silence of the victims as satisfaction: “Far from creating a trauma in the young adolescent (…), the relationship he experienced with a man who, in 80% of cases, was close to his family or an educator that he knew well, was sufficiently well experienced and taken care of so that he did not feel the need to complain.” Issue n. 12 of the magazine published a survey that it conducted in which a third of readers defined themselves as lovers of “young or very young” children .\n\nCaignet was looking for a source for more of his deviant photography. He connected with Glencross — who was constantly producing child pornography — through another intermediary who feigned ecclesiastical position, Joseph Douce. According to Meyssan, Glencross passed his pedophile material to Caignet through Douce.\n\nGlencross was eventually charged by a Paris judge with inciting minors into lewd behavior and sentenced to prison where he died of a heart attack in December of 1991. The neo-Nazi connection in this story, Michel Caignet, leads to a greater and more international pedophile network. Caignet was a major producer for a child pornography company that was operational in both France and Colombia. It was called Toro Bravo, and it was based off of Bogota. On June 17th, 1997, 2,500 French officers mobilized for a mission raiding the homes of eight hundred people who were involved in the creation of child pornography. This mission was called operation “ADO 71”, the biggest raid of pedophiles in France’s history.\n\nOfficers reviewed thousands of child pornography cassettes seized throughout France, and they did not conceal their disgust at what they were witnessing. One of the officers told the AFP: “We are in the abject, it is the bottom of the horror”. In one raid, officers found a pederast in bed with a fifteen year old boy. This operation was done in the midst of a much vaster investigation of an intricate pedophile network within France. The day prior to the police raids, June 16th, seventy-two defendants were made to stand before the 15th correctional chamber of Paris, where they had to answer for “concealment of corruption of minors, dissemination, fixation, recording and transmission of the pornographic image of minors of more or less than 15 years ”.\n\nAmong them were purchasers, manufacturers and distributors of pedophile video cassettes imported from Colombia. One of the distributers was Michel Caignet, the Nazi. One of the objectives of ADO 71 was to gather evidence against Bernard Alapetite who, according to El Mundo, was arrested “as the head of a network for the distribution of child pornography videos. Following the operation known as ADO 71, in which a pedophile ring was dismantled and more than 300 people were indicted, Alapetite was sentenced to three years in prison.” Alapetite’s pedophile operations was one of abysmal perversity, and he himself was filled with an ideological mission as well.\n\nAlapetite was a part of a movement known as “the Center for Research and Documentation for the Advent of a New Order in Social, Economic and Cultural Spheres”, or simply the New Order (Ordre Nouveau), a fascist organization that was active between 1963 and 1973 and which would eventually initiate the creation of Front National, the very party of Marine Le Pen, the leader Right-wing politician in France.\n\nAn article from the Independent reported that Alapetite had “a one-time associate of Jean-Francois Galvaire, a member of the political bureau of the National Front.” Galvaire stated to a newspaper (Journal de Dimanche) that he had had no recent connections with Mr. Alapetite. When the Journal de Dimanche told him that Mr Alapetite’s homosexual video-production company, Platypus, had until recently shared an address with an Front National front organization chaired by Mr Galvaire, he replied: “There are lots of companies there, even some freemasons”.\n\nOne of the missions of the New Order — the very type of rhetoric being declared today by Right-wing activists and organizations — was to “Stop uncontrolled immigration” as well as to bring about “the rebirth of patriotism, the promotion of a hierarchy of values, as well as family and educational restoration” .Alapetite collaborated in the 1970s with the neofascist review “Defense of the West,” and another publication of the French New Right movement, Elements, edited by GRECE (Research and study group for European civilization) and directed by Alain de Benoist, one of the main intellects of the French Right.\n\nAccording to France-Soir, Alapetite was “known for being part of the neo-Nazi movement and for having collaborated in far-right reviews”, as well as in a review edited by Michel Caignet, the very Nazi who was running the pedophile operation in France in conjunction with the Colombia branch. Alapetite was a photographer for Caignet’s pro-pedophile magazine, Gaie France (the very magazine that the pastor, Joseph Douce, collaborated with), and founded another magazine called P’tit Loup which Caignet was involved with and which was described by Pierre Verdrager as “specializing in very young children – almost all pre-pubescent, between five and ten years old for the most part – and included numerous photos of nudes”.\n\nAlapetite was arrested and brought to trial for purchasing in Poland and other Eastern European countries, also in Spain and Germany, child pornography videos which he then duplicated and resold for 800 francs each. The judge, Christine Parguel, renewed the charges against him, such as “concealment and dissemination of objects obtained with the aid of the offense of corruption” and “transmission of images featuring minors over or under fifteen years in a pornographic situation ”.\n\nA “sales director” of this filmed chid abuse for Toro Bravo was one Daniel Wailliez. When speaking before the judge of the court, Sophie Portier, on the children in the videos, Wailliez described himself as an “aesthetic voyeurist” and stated: “These are the kind of kids that I love.” According to Michèle Ganascia, deputy public prosecutor, Wailliez frequently travelled to China, Thailand, the United States, Senegal, Indonesia and Egypt while holding a copy of the “Spartacus guide,” a homosexual magazine with a collection of addresses for homosexuals “with a pedophile connotation”. Authorities caught on to what he and his child pornography cell were doing when Wailliez put in add in a newspaper looking for “boys for exhibitionism and caresses”, even for photo shoots. When police began investigating Wailliez they found that he appeared on the files of Interpol for having corresponded with a network of Spanish pedophiles.\n\nWhen the authorities searched his home, they found pedophile magazines (both French and non-French), and they also discovered a compilation of two hundred photographs of young boys “in a lascivious position”, produced by a company called “Studio Vision 2000” (no information on this company could be found online).\n\nAuthorities also found a dozen cassette tapes showing youths committing acts too egregious to describe here. Wailliez explained that he had obtained these tapes through various magazines: Gaie France Magazine, Gaie France, Complice and Gay Pavois. But all of these magazines, as Wailliez admitted, were one and the same degenerate work: Gaie France, which was ran by the neo-Nazi Michel Caignet who ran the same magazine under different titles. The French newspaper, Le Monde, explained what was revealed through the investigation:\n\nColombian journalist, Sergio Mendoza Castro, described Toro Bravo as such:\n\nThe host for this “company” was one Jean-Manuel Vuillaume who, while in Bogota, maintained contact with Caignet. Vuillaume was arrested at Roissy airport when he was returning from yet another trip to Colombia, and was imprisoned. Vuillaume would sell to Caignet original child pornography videos filmed in Colombia, at a price of 3,500 or 5,000 francs. Caignet then would assign to one Olivier Lechat (who lived in Lille) with the job of making a hundred copies of the videos per month.\n\nThe duplicates were then sold for one hundred francs each. The treasurer for the company was one Michel Meignant de Cacqueray, he was also the manager of Sictel, publisher of Gay Pavois, one of the magazines under the Nazi Caignet. Police officers found the client file of the Sictel company and found 1,800 names. It was on this information that French authorities commenced the major raid on June 17th. Jean-Manuel Vuillaume, Michel Caignet, Michel Maindre de Cacqueray and Olivier Lechat — the main perpetrators in this criminal underground operation, were prosecuted in a French court for “aggravated concealment committed in an organized gang” and faced ten years in prison and incurred a fine of five million francs. Daniel Wailliez tried to defend himself by saying (in regards to the child pornography videos): “I refute any pedophile tendency … But I like to watch them”. Wailliez was found dead in 2002 in his apartment with severe blows to the head from a blunt object. Another one of the criminals in the court was Patrice Noyelle, who was said to have had 2,000 books, 600 magazines and more than 700 cassettes on pederasty.\n\nBut why would Right-wing fanatics, bent on bringing society to “tradition” want to damage society by partaking in, and making profit off, pedophilia? There is one explanation, from the French political scientist Paul Aries, which affirms that pedophilia did two things for these Nazis: Firstly, it was an avenue for easy money; and secondly, it was a way to recruit the fringe of society into a radical movement. As Aries wrote, the use of “pedophilia is (was) a good way to finance extremist activities through the sale of products. It also allows (was) to recruit people, gay or not, likely to consider themselves pariahs of society, and finally referred (to) a tradition of the young Nazi party”.\n\nIn this contagion of horror, there is an ideological component, one that hates mankind and desires to destroy him. In this, it is no wonder that pederasts run rampant in the ranks of fascists.\n\nThe Right-wing’s defense of pedophilia and pederasty\n\nSuch are the words of Gabriel Matzneff, a French Russian Jewish ideologue for pedophilia and truly an ambassador for the nightmare of Sodom. According to the New York Times, for decades Matzneff “was celebrated for writing and talking openly about stalking teenage girls outside schools in Paris and having sexual contact with 8-year-old boys in the Philippines.” In his published diaries, Mes Amours Decomposes (“My Decomposed Loves”), Matzneff boasts about sodomizing countless children, including 11- and 12-year-old Filipino boys who he describes as “a rare spice”. He also once wrote: “When you have held in your arms, kissed, caressed, possessed a 13-year-old boy, a 15-year-old girl, everything else seems bland, heavy, tasteless”.\n\nHe enjoyed mingling with France’s elites. He was invited to the Elysee Palace by Francois Mitterrand himself and socialize with far-Right leader Jean-Marie Le Pen (father of Marine Le Pen). He received funds from the fashion designer Yves Saint Laurent and his partner Pierre Berge.\n\nHe had these connections and was within an influential network regardless of the fact that he boasted of his pedophilia. In 1985 Matzneff wrote:\n\nMitterrand continued to interact with the pedophilia apologist even after Matzneff published a blatant defense of pedophilia in 1974 titled “Les Moins de Seize Ans” (“Under 16 Years Old”).\n\nAfter he was elected president in 1981, Mitterrand invited Matzneff for lunch at the presidential palace at least once, in 1984, according to the François Mitterrand Institute. Mitterrand wrote an article for the magazine, Matulu, in complimenting Matzneff as an “impenitent seducer,” and stated that he “has always amazed me with his extreme taste for rigor and with the depth of his thinking.” This article was used by Matzneff to dissuade police from further investigating him. In fact, not too long after Mitterrand’s article was published, the Paris police began investigating the tips against Mr. Matzneff, and when the pedophile showed detectives the article, they left him alone.\n\nFor years he has openly supported pedophilia and boasted of his diabolical actions and desires, and it was only just in 2019 that an investigation was launched against him and he will be tried in 2021 for promoting pedophilia and for allegedly raping a 15 year old girl. “Who are they to judge their fellow men?” Matzneff angrily replied to those who are disgusted with him in an interview with the New York Times. “These associations for virtue, how do they sleep, what do they do in bed and with whom do they sleep, what are their secret and repressed desires?” While it is common for conservatives to point to the Left as a movement of support for pedophilia, what they always ignore is the Right-wing support for this very evil. As Pierre Verdrager wrote:\n\nMatzneff’s most enthusiastic supporters have been intellectuals of a movement that — while portraying itself as new — is really just modernly marketed Right-wing, fascist and racialist ideology. This movement was and is known as the New Right, which really has its roots in France under the organization called “Research and Study Group for European Civilization” or GRECE. One of these intellectuals, Alain de Benoist, wrote a praise for Matzneff in 1986 called “The Archangel Gabriel”, in which he appeals to Matzneff’s pedophilia and condemns the society that reviles him:\n\nAnother New Right ideologue, Christian Bouchet, also supported Matzneff through his publication, Lutte du Peuple, which published an article defending the pedophile against judgement: “How dare to judge someone who, by his lifestyle, by his choice of behavior, is the standard bearer of dissidents of the Western civilization”. Bouchet is an occultist who has written numerous books on Aliester Crowley and neo-pagan Wicca, he was also a member of an Order of the Knights Templar cult (which is fascinating given the reality of Right-wing terrorists identifying with the Knights Templar and the Masonic Lodge, a subject which we have written on extensively).\n\nBouchet would later downplay the dark reality of Matzneff’s pedophilia by saying: “He was never considered a pedophile. At the time, it was commonplace.” For him to say that pedophilia “was commonplace” reveals a truth that sheds light on the dark roots of the European Right: that pedophilia has been ubiquitous amongst its ranks. This was reflected when Renaud Camus, one of the biggest intellectuals for Europe’s Right-wing and the one who coined the phrase “the Great Replacement” (a term used to refer to a conspiracy that the Left is launching mass immigration to replace the white European race), defended pedophilia. In 1997, Camus stated for the magazine, Infinity:\n\nThe New Right’s defense for pedophilia runs full circle back to Michel Caignet — the Nazi in the Tora Bravo pedophile network who collaborated with Joseph Douce. Guillaume Faye, amongst the most highly favored of the New Right intellectuals, wrote an article for the first issue of Caignet’s pederast Nazi magazine, Gaie France, in which he wrote that the gay community has “a role to play in the perspective of a cultural, political and artistic within European civilization ”.\n\nThe phenomena of pedophilia and pederasty is not limited to the Right-wing of the 1970s, 80s and 90s, but continues on today. For example the well known conservative commentator, Dennis Prager, said this in 2017:\n\nMilo Yiannopolous, a Jewish homosexual Rightest (who was once very famous in Right-wing circles), defended pedophilia:\n\nIn this labyrinth of darkness and degeneracy we find nothing more than the ideology of predators who, masqueraded under a guileful intellectualism, prey on the vulnerable and on humanity itself, with the sinister objective of bringing the world where lawlessness abounds under the curtain of law and order.\n\nWhatever happened to pastor Joseph Douce? He was last seen on the evening of July 19th, 1990, leaving his apartment with two men carrying police badges who asked the pastor to follow them. He was soon declared missing. Months later, on October 18th, Douce’s body was discovered by a mushroom gatherer in the Rambouillet Forest west of Paris. “It is definitively the body of Joseph Douce,” said state prosecutor in Versailles, Roger Tacheau. He said that dental records reviewed in the autopsy showed the man died on or about July 20, the day after Douce disappeared from his Paris apartment. Yves Bertrand, a French intelligence agent, affirmed that Douce was a part of a major pedophile network and had knowledge of people in politics who partook in pedophilia, and thus knew too much and was likely assassinated:\n\nBertrand’s records exposed a scandal for the French government in 2007. He was found dead in 2013, and his cause of death was classified as unknown\n\nThis was a French Epstein, who knew too much about the pedophile activities of politicians, and knew too much.\n\nDouce was definitely a part of a powerful circle, and what this reflects is the reality that within the layers of political power, there lies the religion of Sodom. The intellectual rebels of the Right-wing, who we associate with patriotism, are forces of evil, destruction and chaos, masqueraded as forces of law and order. There is no Right, there is no Left, but only good versus evil.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Protestant Church Of France Just Did Its First Gay Wedding - Walid Shoebat", "description": "By Theodore Shoebat The Protestant church of France just did its first sodomite wedding. It is being declared as a moment of progress, but it only indicates the decay of the nation. According to a report from Le Monde: It is 10:30 am in Montpellier and a line forms on the forecourt of the Protestant […]", "url": "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/", "site_name": "Walid Shoebat", "article:published_time": "2021-07-27T00:05:48+00:00", "article:modified_time": "2021-07-27T00:15:51+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/07/france-gay-wedding-.jpg", "image:width": "1612", "image:height": "906"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lemonde.fr/le-monde-des-religions/article/2021/07/26/l-eglise-protestante-benit-le-premier-mariage-de-pasteures-lesbiennes_6089518_6038514.html", "http://genres.centrelgbtparis.org/2016/11/01/secrets-de-foret-de-rambouillet/", "https://archive.is/goMdx#selection-721.13-721.103", "https://shoebat.com/2021/01/06/the-jeffery-epstein-of-france-read-about-the-major-right-wing-pedophile-network-that-raped-and-exploited-tens-of-thousands-of-children/joseph-douce-minister/", "https://www.europe1.fr/societe/letrange-disparition-du-pasteur-douce-il-y-a-peu-de-chances-que-lon-connaisse-un-jour-la-verite-3838508", "https://www.lexpress.fr/informations/le-pasteur-victime-des-brebis-galeuses_613394.html", "https://www.europe1.fr/societe/letrange-disparition-du-pasteur-douce-il-y-a-peu-de-chances-que-lon-connaisse-un-jour-la-verite-3838508", "https://translate.google.com/translate?hl=en&sl=fr&u=https://www.humanite.fr/node/79900&prev=search&pto=aue", "https://www.voltairenet.org/article7502.html", "https://www.cairn.info/revue-pardes-2005-1-page-49.htm?contenu=resume", "https://www.streetpress.com/sujet/1604673651-ombre-matzneff-extreme-droite-pedophile-grece-alain-benoist-nationalistes-fafs-neonazis", "https://www.voltairenet.org/article7506.html", "https://www.lemonde.fr/archives/article/1997/06/18/michel-caignet-l-ami-des-neonazis-allemands_3782857_1819218.html", "https://shoebat.com/2016/12/23/bombshell-major-scandal-uncovered-pamella-geller-and-robert-spencer-running-an-international-scam-involving-neo-nazis-anti-christian-neo-pagans-mafia-thuggery-and-terrorism/", "https://www.liberation.fr/france-archive/1997/06/20/pedophiles-des-violeurs-parmi-les-voyeurs-un-suspect-chez-qui-la-police-avait-trouve-des-cassettes-s_209158", "https://shoebat.com/2021/01/06/the-jeffery-epstein-of-france-read-about-the-major-right-wing-pedophile-network-that-raped-and-exploited-tens-of-thousands-of-children/caignet/", "https://pallieterke.advn.be/pdf/1994/19940525_049_021.pdf", "https://www.lemonde.fr/archives/article/1997/06/18/la-justice-examine-les-filieres-d-un-reseau-pedophile-international_4418304_1819218.html", "https://www.humanite.fr/node/160704", "https://www.liberation.fr/france-archive/1997/06/16/videos-pedophiles-la-justice-visionne-le-reseau_209627", "https://web.archive.org/web/20091212215927/http://www.elmundo.es/papel/2007/07/12/mundo/2151767.html", "https://www.independent.co.uk/news/world/four-suicides-follow-french-child-porn-raid-1257566.html", "https://www.cairn.info/revue-pardes-2005-1-page-49.htm", "https://www.liberation.fr/france-archive/1997/06/16/videos-pedophiles-la-justice-visionne-le-reseau_209627", "https://translate.google.com/translate?hl=en&sl=de&u=https://www.suedwind-magazin.at/kinderhandel-am-globalen-markt&prev=search&pto=aue", "https://www.leparisien.fr/faits-divers/un-pedophile-retrouve-mort-21-10-2002-2003503989.php", "https://www.liberation.fr/france-archive/1997/06/17/cadre-sup-serieux-adepte-de-voyeurisme-esthetique_209403", "https://www.cairn.info/revue-pardes-2005-1-page-49.htm#no10", "https://archive.is/Jjfzq#selection-475.48-475.214", "https://www.theweek.co.uk/105682/gabriel-matzneff-paedophile-charges-against-author-shame-french-establishment", "https://shoebat.com/2021/01/06/the-jeffery-epstein-of-france-read-about-the-major-right-wing-pedophile-network-that-raped-and-exploited-tens-of-thousands-of-children/gabriel-matzneff/", "https://www.leparisien.fr/faits-divers/gabriel-matzneff-sera-juge-pour-apologie-de-viol-aggrave-en-2021-13-02-2020-8258985.php", "https://www.streetpress.com/sujet/1604673651-ombre-matzneff-extreme-droite-pedophile-grece-alain-benoist-nationalistes-fafs-neonazis", "https://shoebat.com/2020/04/28/the-masonic-conspiracy-to-usher-in-a-global-revolution-of-nationalism-slaughter-and-chaos/", "https://www.upi.com/Archives/1990/10/26/Authorities-identify-body-of-missing-gay-pastor/7865656913600/", "https://translate.google.com/translate?hl=en&sl=es&u=https://tecnicopreocupado.com/2015/07/22/joseph-douce-simbolos-y-pederastas/&prev=search&pto=aue", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=facebook", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=twitter", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=reddit", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=linkedin", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/#print", "#", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=skype", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=jetpack-whatsapp", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=telegram", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=pocket", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=pinterest", "https://shoebat.com/2021/07/26/the-protestant-church-of-france-just-did-its-first-gay-wedding/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-07-27T00:05:48+00:00"}