{"result_id": "271008", "URL": "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/", "timestamp": "2023-04-25 17:07:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Mega Outbreak Of Anal Cancer Ravages The LGBT, Doctors Announce 'This Is The Next Great LGBT Health Crisis And We Don't Know How To Stop It'", "cleaned_text": "HIV/AIDS was normalized in the the LGBT community because, as they admit, are the prime transmitters of HIV and AIDS due to sexual practices such as sodomy. According to scientists, there is another major health crisis that is about to befall the LGBT and they have “no idea’ how to treat it, and that is an epidemic of anal cancer:\n\nAlmost 620,000 gay and bisexual men in the United States were living with HIV in 2014, and 100,000 of these men were not even aware of their infection. These men are 100 times more likely to have anal cancer than HIV-negative men who exclusively have sex with women. Yet, no national screening guidelines exist for anal cancer prevention in any population. Anal cancer is predominantly caused by chronic or persistent human papillomavirus (HPV) infection. HPV infection can lead to the development of anal precancer which, if remains undetected or not adequately treated, may lead to anal cancer. Likewise, HPV infection is also responsible for causing cervical, vaginal, vulvar, oropharyngeal, penile and rectal cancers. The objective of screening is to identify and treat these precancers to prevent occurrence of anal cancer. However, one of the reasons for the lack of screening guidelines is that anal precancer treatment has not yet been shown to prevent invasive cancer. Our study, published today in the journal Cancer, attempts to find a possible solution to prevent anal cancer in HIV-positive gay and bisexual men, using the best available data. We found that age-specific anal precancer management, including post-treatment HPV vaccination, can potentially lead to an 80 percent decrease in lifetime risk of anal cancer and anal cancer mortality among gay and bisexual men. Some in the medical community have identified anal cancer as the next big crisis among HIV-infected gay and bisexual men. Initiation of anti-retroviral therapy in the 1990s greatly reduced the AIDS-related death rate and improved survival. However, this improvement in survival led to an increase in the lifetime risk of developing anal cancer, especially among HIV-positive gay and bisexual men. Anal cancer is typically preceded by persistent HPV infection that often leads to precancer. HPV is common among U.S. men; about one out of two men in the general population has HPV infection. HPV typically clears naturally; however, under certain circumstances, it might persist longer and might progress to anal precancer. If it remains undetected, untreated or inadequately treated, this precancer can progress to anal cancer. The American Cancer Society estimates there will be 8,200 new anal cancer cases in 2017. In the absence of national screening recommendations, more than 50 percent of these individuals will be diagnosed at stage III or IV, when five-year survival is less than 40 percent. This creates a major public health concern. We do not yet know how best to manage anal precancer (also known as high-grade squamous intraepithelial lesions) so that anal cancer could be prevented. A national randomized clinical trial study – Anal Cancer HSIL Outcomes Research (ANCHOR) – is currently determining optimal anal precancer management by comparing treatment and active monitoring. The question then arises: How do we start managing our patients using the best available evidence? Likewise, it is imperative that these individuals have as much information as possible about anal cancer prevention. Using a mathematical model, we simulated the life course of 100,000 hypothetical HIV-positive men who have sex with men (MSM) who were 27 years or older and were diagnosed with high-grade squamous intraepithelial lesions. In our model, we compared four different management strategies: (1) individuals were not provided any form of treatment, which is the current practice; (2) individuals were actively monitored (followed biannually) and those who developed early cancer were treated; (3) individuals were immediately treated using surgery (current most popular strategy among clinicians who treat precancer); and (4) individuals in addition to surgical treatment received HPV vaccination (potential strategy). We followed these hypothetical patients over their lifetime in our computer model to estimate harms and benefits of the management strategies. We tracked the number of individuals who developed anal cancer and then estimated their risk of death from anal cancer. We then estimated above outcomes by patient age. For each strategy, we estimated age-specific lifetime outcomes considering cost, quality of life and life expectancy. We found that HIV-infected gay and bisexual men who are 38 years or older should be treated using surgical treatment of ablation (either infrared coagulation or electrocautery), and that HPV vaccination should be administered at the time of surgery. This strategy is cost-effective and has the potential to decrease the lifetime risk of anal cancer by up to 80 percent in those men. The model also found that because younger men are more likely to be cured of their precancer without intervention, patients younger than 29 should not be treated and those between 29 and 38 years old should be actively monitored (watch-and-wait approach) in order to prevent treatment-related inconvenience and morbidity that might affect their quality of life. (source)\n\nThe answer to stopping the anal cancer epidemic is very simple. It is so simple that almost anybody can do it, and if it is followed it guarantees almost 100% that one will never get anal cancer.\n\nThe reason why anal cancer is so common among the LGBT is because the anus is a exit meant for expelling solid waste from the body after the nutrients from it have been absorbed. It is not meant for having (usually dozens of) men repeatedly thrust their penises into it so they can masturbate. If that is not bad enough, there are many homosexual men and now, thanks to the influence of the LGBT in porn, heterosexual porn has been promoting the practice of shoving one’s entire fist and sometimes as far as one’s arm up to the elbow into another person’s anus for the purpose of sexual gratification. This practice, called “fisting,” is very common among homosexuals and is as unnatural and disgusting as it is an excellent way to spread and contract disease.\n\nThis is a cesspool. Cesspools are the locations where fecal matter and urine goes from an outhouse. A Septic Tank is a type of cesspool.\n\nWould you stick your hand in this? If you did, imagine how long it would take to get the smell out. Most people might be concerned with diseases because, well, it is a pool of feces. The very idea that a man would get sexual pleasure out of shoving his arm into such a disgusting thing means there is something desperately wrong with him, and he most likely should merit hospitalization and examination by both a psychologist and a trained exorcist.\n\nYet sticking one’s arm into this is what the LGBT does with the practice of fisting. Think about that.\n\nOne cannot underemphasize the influence of the LGBT on the pornography industry, which in turn influence society. If masturbating into another man’s anus and then shoving one’s fist into it is not bad enough, there is also the practice of “rosebudding.”\n\nHave you ever taken a shirt by the collar and then “flipped” it so the shirt is now inside out? That is what the practice of “rosebudding” is, except it involves one’s anus. Originally practiced among homosexuals, gay men with loose anuses from repeated episodes of sodomy would begin to get rectal prolapse, which is a serious medical condition in which the intestines actually being to fall out of the body. However, instead of actually treating this as a serious medical condition, the LGBT enshrined it as something to strive for, so much that it has now become its own special genre of fetish pornography and is being practiced among heterosexuals, including many women. As the article below notes, merely echoing from a heterosexual perspective what the homosexuals already do, “prolapse sex” involves licking and masturbating on the insides of another person’s intestines protruding out the anus in reverse for the purpose of sexual pleasure.\n\n“It smells like blood. And it tastes like raw flesh. It’s not something you’ve ever been exposed to. But it strikes a chord somewhere deep inside.” That’s how Sheena Shaw, a 29-year-old porn star and extreme anal queen, describes the primal appeal of rosebud—a kind of extreme anal sex that is rapidly gaining popularity in the adult film world, popping boners and flipping stomachs with equal abandon. While rosebud is named after those crimson flowers you get on Valentine’s Day, that’s where any intimation of sweet, romantic love ends. The sexual act that Shaw specializes in is, in fact, caused by an anal prolapse—a medical condition in which the inner walls of your rectum collapse and slip out of your butthole, the bright red internal tissue blooming out of your anus like a desert rose (cue Sting). Of course, extreme anal practices like rosebud, fisting, enemas, and ass gaping are nothing new to the S&M crowd, or even the gay-porn industry. What is changing, however, is the encroachment of hardcore sex acts from the fringe into the mainstream. “Everyone’s pressured to do anal,” Sheena says. “Culture teaches us what to like and what not to like.” What used to be taboo is now a staple, and the public is taking notice. On a thread titled “Increased Visibility of Anal Prolapse: Reasons?” from September 2013 on the online forum Adult DVD Talk, a user commented: “Anal prolapsing: at one time it was reserved… for girls who had performed one too many double anal scenes (Ava Devine, Amy Brooke: we’re looking at you). Now, we’re seeing much more of it on screen, even from performers who are fairly new to the industry.” So what is causing this blossoming of a thousand rosebuds? The same user hypothesized that anal performers just hid their prolapses off camera in the past. “(They) are now only showing it on screen because it has become acceptable and there is a growing market for it.” Indeed, big porn companies like Evil Angel have started to produce top-quality extreme anal films with a variety of high-profile porn stars. Once a trend like this takes hold, a self-perpetuating feedback loop almost guarantees its continued spread. “When a gorgeous porn star does it, it is legendary stuff for extreme-anal-porn fans, thus resulting in even more gigs for the girls who can and will do it,” says the California-based porn director Jay Sin. He’s witnessed this effect firsthand—films of his like Deep Anal Abyss, Anal Acrobats, and Anal Buffet have gone on to become cult favorites. (Anal Buffet is now into its ninth sequel.) But the conclusion that everyone from your boss to your creepy uncle is tuning in and getting turned on by girls pushing their innards out of their assholes is a vaguely unsettling—and simplistic—one. While porn films have gotten more aggressive and violent in recent decades, this could also be a result of not just evolving tastes but the internet’s impact on the porn industry. (source)\n\nSince “prolapse sex” is literally getting pleasure off of the inside of the tube used to pass fecal matter, one can say that it is the equivalent of trying to bathe oneself in a sewer.\n\nA medical drawing of a rectal prolapse from Wikipedia. The LGBT thinks this kind of serious medical disorder is something that people should masturbate into.\n\nIndeed, anybody who thinks that masturbating into another person’s medical wounds is “sexually arousing” is deeply disturbed.\n\nAs mentioned in the study above, doctors are “shocked” at the rates of anal cancer and are calling it the next great plague to befall the LGBT after HIV/AIDS. But how can one say that they do not know the cure? The reality is that the cure is to stop engaging in the abominable sin of Sodom, a sin so heinous that it is called “worthy of death” in both the Old and New Testaments, that it is one of four sins that specifically “cries to Heaven for vengeance,” the sin for which God destroyed the city of Sodom as a sign for all time to the wickedness of this sin, the sin that the saints have recalled is so vile that even the demons are repulsed at it, and the sin for which the great saints of old burned people at the stake for. All of these words we have documented from Sacred Scripture and Tradition, and you can read them in our archives.\n\nIn light of all of this information, is it really a surprise that a new disease epidemic is befalling the LGBT? Between the evil nature of this sin and the fact that the LGBT is engaging in abominable, medically abnormal and disease conducive practices, how could a new disease epidemic be avoided? Indeed, it would be impossible to so do because of the nature of what is taking place.\n\nAs the article points out, this is not just limited to the LGBT, but owing to the influence of the LGBT these abominable practices once limited to their circles are now being found common among heterosexual couples. Between the internet “amateur” porn videos and the major porn companies, what was once an LGBT perversity is now found commonly among many households, and that which one would not think to have ever considered practicing at all is now being normalized.\n\nThe anal cancer epidemic is a plague, but even more so there is the disease of the soul that is perverting the world with the sin of Sodom.\n\nRemember that God is Love, and He is Mercy as He is Justice. He sent His only Son to redeem the world, but at the same time He will also give justice to those who refuse to receive His mercy. This becomes even more pertinent given that, as we have been warning, there is currently an arms race taking place which has all appearances of leading up to a third world war, to which there echoes the Prophecy of Our Lady of Akita, merely echoing the words of what those have seen it is the Third Secret of Fatima:\n\n“As I told you, if men do not repent and better themselves, the Father will inflict a terrible punishment on all humanity. It will be a punishment greater than the deluge, such as one will never seen before. Fire will fall from the sky and will wipe out a great part of humanity, the good as well as the bad, sparing neither priests nor faithful. The survivors will find themselves so desolate that they will envy the dead. The only arms which will remain for you will be the Rosary and the Sign left by My Son. Each day recite the prayers of the Rosary. With the Rosary, pray for the Pope, the bishops and priests.” “The work of the devil will infiltrate even into the Church in such a way that one will see cardinals opposing cardinals, bishops against bishops. The priests who venerate me will be scorned and opposed by their confreres…churches and altars sacked; the Church will be full of those who accept compromises and the demon will press many priests and consecrated souls to leave the service of the Lord. “The demon will be especially implacable against souls consecrated to God. The thought of the loss of so many souls is the cause of my sadness. If sins increase in number and gravity, there will be no longer pardon for them” (source)\n\nGod destroyed Sodom for their sins. The same sin of Sodom has now overtaken the world. At the same time, we stand on the edge of a third world war.\n\nIn the meantime, the state of California, where so many people ardently support the LGBT and which serves as the center of the American pornography industry is attempting to force coffee roasters to put labels on their mugs saying that roasting coffee may release a possible chemical that might cause cancer (but are not absolutely sure):\n\nSo it is a social “sin” to criticize the LGBT in any way, including discussion of how their behaviors are transmitting disease as well as are a grave sin in the eyes of God, yet coffee manufacturers are under legal assault right now because THE STATE OF CALIFORNIA HAS DECLARED that a natural by product of the roasting process which has been consumed by billions for countless centuries without cancer might-maybe cause cancer, although they cannot clearly explain why?\n\nJust think about that. And in the meantime, I’ll have a cup of coffee instead.\n\nCHRISTIANS ARE BEING TORTURED AND MURDERED AS WE SPEAK. PLEASE CLICK HERE TO GIVE A DONATION THAT WILL HELP OUR RESCUE TEAM\n\nOUR TIME ONLINE RUNS SHORT. SHOEBAT.COM FACES DAILY HARASSMENT BY FACEBOOK AND EACH TIME IT IS A DIFFERENT EXCUSE. IT IS BEST TO REACH US BY EITHER GOING DIRECTLY TO SHOEBAT.COM OR THROUGH OUR NEWSLETTER. CLICK HERE TO JOIN OUR NEWSLETTER, AND CONTINUE EDUCATING YOURSELF ON WHAT THE MAINSTREAM MEDIA WON’T REPORT", "opengraph": {"locale": "en_US", "type": "article", "title": "Mega Outbreak Of Anal Cancer Ravages The LGBT, Doctors Announce 'This Is The Next Great LGBT Health Crisis And We Don't Know How To Stop It' - Walid Shoebat", "description": "HIV/AIDS was normalized in the the LGBT community because, as they admit, are the prime transmitters of HIV and AIDS due to sexual practices such as sodomy. According to scientists, there is another major health crisis that is about to befall the LGBT and they have “no idea’ how to treat it, and that is […]", "url": "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/", "site_name": "Walid Shoebat", "article:published_time": "2017-09-26T21:02:55+00:00", "article:modified_time": "2017-09-27T04:13:16+00:00", "image": "https://shoebat.com/wp-content/uploads/2017/09/Top-10-Most-Dangerous-Diseases-in-World.jpg", "image:width": "950", "image:height": "534"}, "tags": [], "tweets": [], "movies": [], "links": ["http://shoebat.org/wp-content/uploads/2017/09/Top-10-Most-Dangerous-Diseases-in-World.jpg", "http://www.latimes.com/sns-how-the-anal-cancer-epidemic-in-gay-and-bi-hiv-positive-men-can-be-prevented-80358-20170926-story.html", "http://shoebat.org/wp-content/uploads/2017/09/4414936_1_orig.jpg", "http://shoebat.org/wp-content/uploads/2017/09/cesspit.jpg", "https://en.wikipedia.org/wiki/Prolapse", "https://www.vice.com/en_us/article/qbvmz3/a-rosebud-by-any-other-name-would-smell-like-shit", "http://shoebat.org/wp-content/uploads/2017/09/Full_thickness_rectal_prolapse__mucosal_prolapse..jpg", "https://en.wikipedia.org/wiki/Rectal_prolapse", "https://www.ewtn.com/library/mary/akita.htm", "https://www.cnbc.com/2017/09/26/coffee-sold-in-california-could-carry-cancer-warning-labels.html", "http://shoebat.org/wp-content/uploads/2017/09/coffee-cup-1797283_960_720.jpg", "https://ffmu.webconnex.com/rescuechristians", "http://shoebat.org/subscribe-to-tbat-newsletter/", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=facebook", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=twitter", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=reddit", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=linkedin", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/#print", "#", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=skype", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=jetpack-whatsapp", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=telegram", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=pocket", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=pinterest", "https://shoebat.com/2017/09/26/mega-outbreak-of-anal-cancer-ravages-the-lgbt-doctors-announce-this-is-the-next-great-lgbt-health-crisis-and-we-dont-know-how-to-stop-it/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2017-09-26T21:02:55+00:00"}