{"result_id": "272010", "URL": "https://www.sott.net/article/479215-Widower-of-BBC-presenter-Lisa-Shaw-who-died-from-jab-has-no-alternative-but-to-file-suit-against-AstraZeneca", "timestamp": "2023-04-25 17:07:29 CEST+0200", "meta": {"description": "The widower of a BBC presenter who died from coronavirus vaccine complications has launched legal action against pharmaceutical giant AstraZeneca on behalf of 75 people whose 'relatives died or suffered injuries related to the jab'. Mother-of-one...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/479215-Widower-of-BBC-presenter-Lisa-Shaw-who-died-from-jab-has-no-alternative-but-to-file-suit-against-AstraZeneca", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Widower of BBC presenter Lisa Shaw, who died from jab has 'no alternative' but to file suit against AstraZeneca --", "cleaned_text": "\n• Dawn Wooldridge, 36, who was found dead in her home in June 2021 after having failed to collect her five-year-old son from school. It is more likely than not she died from acute myocarditis due to her recent vaccination.\n• Tom Dudley, 31, two weeks after getting the jab, was found unresponsive in the early hours at the home he shared with his partner Simone and their two daughters.\n• Jack Hurn, 26, died less than two weeks after receiving the AstraZeneca vaccine in June 2021. An inquest heard he was told there was no Pfizer jab\n• Kelly Dunley, 38, tragically died after developing a deep vein thrombosis - a type of blood clot - after receiving the AstraZeneca Covid jab, a coroner ruled. and was given out-of-date information in relation to blood clot risks associated with the vaccine\n• Oli Akram Hoque, 26, from Ilford, died from a rare blood clot weeks after taking the AstraZeneca vaccine, an inquest heard.\n• Nicola Weideling suffered catastrophic bleeds on her brain after being hospitalised with blood clots caused by the vaccine which she had received 24 days before dying, a coroner has ruled.\n• Alpa Tailor, 35, died from blood clots on her brain caused by the AstraZeneca vaccine, a coroner ruled.\n\nThe widower of a BBC presenter who died from coronavirus vaccine complications has launched legal action against pharmaceutical giant AstraZeneca on behalf of 75 people whose 'relatives died or suffered injuries related to the jab'.Mother-of-one Lisa Shaw, 44, died from 'vaccine-induced thrombotic thrombocytopenia' in May 2021, about a week after receiving her first Covid jab. She worked for BBC Radio Newcastle.Lawyers for her husband, Gareth Eve, reportedly sent pre-action protocol letters to AstraZeneca last year on the behalf of nearly 75 people who allege that their relatives died or suffered injuries related to the vaccine.Her husband, Gareth Eve, reportedly spent two years trying to get the Government, MPs and three prime ministers to address what happened to Lisa and now feels he has 'no alternative' but to pursue legal action.Mr Eve, who is vaccinated himself, says the lawsuit is not about 'whether somebody is anti-vax' but about those who lost loved ones and have been 'made to feel like it's a dirty secret'.'It's not about Covid, it's not about how many lives the Covid vaccination has saved, it's about what this vaccination has done to Lisa and other families,' he told the BBC Mr Eve said he sought legal action after two years of failed attempts to contact officials, alleging no one had 'reached out or engaged with us at all'.He reiterated that he and the fellow claimants are 'not crackpots or conspiracy theorists' but instead family members who lost someone because of the vaccine.'These things have happened to too many people and we're made to feel like it's a dirty secret, that we're talking about something we shouldn't be talking about.'The father of one said the lawsuit is aimed at drawing attention to 'what this vaccination has done to Lisa and other families'.He added that it's established that his wife's death was 'caused by AstraZeneca's Covid vaccination'.Mr Eve said he is seeking 'some sort of acknowledgement or recognition that these deaths have occurred'.He also stated that the complaint is not about financial compensation because no amount of money is 'going to bring my son's mam back'.The claimants have taken legal action against AstraZeneca under the Consumer Protection Act 1987.It is understood that they are pursuing damages on the basis that the Covid vaccine was a 'defective product in that it was not as safe as consumers generally were reasonably entitled to expect'.The claimants have also demanded payment under the Government's Vaccine Damage Payment Scheme.The Government says that if a person is 'severely disabled' as a result of a vaccination against certain diseases, they could get a one-off tax-free payment of £120,000.The Vaccine Damage Payment is not a compensation scheme. Applicants can still take legal action to claim compensation, even if they get a payment from the scheme, the Government says.The Oxford-AstraZeneca vaccine was first approved for use in the UK in December 2020 when the Government ordered 100million doses of it as part of its inoculation programme. The jab was rolled out alongside Pfizer's Covid vaccine.Ms Shaw died from a vaccine-linked condition that induces brain swelling and bleeding the following May.A spokesman for the Department for Health and Social Care said the vaccines were the 'most effective prevention' against Covid, the BBC reported. But he did also acknowledge there have been 'extremely rare circumstances' where a person was left 'severely disabled or died' because of the jab.The spokesman noted that all vaccines used in the UK have 'undergone robust clinical trials' and meet the Government regulatory authority's 'strict standards of safety, effectiveness and quality'.Similarly, a spokesman for AstraZeneca - declining to comment on pending litigation - told the broadcaster that patient safety is its 'highest priority'.The company also reiterated that the Medicines and Healthcare Products Regulatory Agency has 'clear and stringent standards to ensure the safe use of all medicines, including vaccines'.The spokesman added: 'Our sympathy goes out to anyone who has reported health problems.'MailOnline has approached AstraZeneca and the Department for Health and Social Care for comment.Other UK citizens who have been definitively ruled to have died from the vaccine include:", "opengraph": {"url": "https://www.sott.net/article/479215-Widower-of-BBC-presenter-Lisa-Shaw-who-died-from-jab-has-no-alternative-but-to-file-suit-against-AstraZeneca", "type": "website", "title": "Widower of BBC presenter Lisa Shaw, who died from jab has 'no alternative' but to file suit against AstraZeneca -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/675891/full/69693695_11959425_image_a_1_16.jpg", "description": "The widower of a BBC presenter who died from coronavirus vaccine complications has launched legal action against pharmaceutical giant AstraZeneca on behalf of 75 people whose 'relatives died or suffered injuries related to the jab'. Mother-of-one...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/675891/full/69693695_11959425_image_a_1_16.jpg", "https://www.dailymail.co.uk/news/article-10786421/Wonderful-mother-two-36-died-dose-Covid-Pfizer-vaccine-inquest-told.html", "https://www.dailymail.co.uk/news/article-10614835/Father-two-31-died-blood-clot-caused-AstraZeneca-jab.html", "https://www.dailymail.co.uk/news/article-10861911/Graduate-died-AstraZeneca-jab-given-outdated-information-risks-inquest-hears.html", "https://www.dailymail.co.uk/news/article-10906969/Woman-38-died-complications-AstraZeneca-Covid-jab-coroner-rules.html", "https://www.dailymail.co.uk/news/astrazeneca/index.html", "https://www.dailymail.co.uk/news/article-10755311/Ambitious-trainee-solicitor-26-died-rare-blood-clot-having-Astra-Zeneca-Covid-vaccine.html", "https://www.dailymail.co.uk/news/article-10627157/Covid-UK-Marketing-executive-45-died-stroke-caused-AstraZeneca-jab.html", "https://www.dailymail.co.uk/news/article-9986391/Mother-dies-AstraZeneca-vaccine-caused-blood-clots-brain.html", "https://www.dailymail.co.uk/news/bbc/index.html", "https://www.dailymail.co.uk/news/article-9928939/BBC-presenter-Lisa-Shaw-died-complications-caused-AstraZeneca-covid-jab-coroner-rules.html", "https://www.bbc.co.uk/news/uk-england-tyne-65187992"], "authors": [], "publish_date": null}