{"result_id": "272014", "URL": "https://www.sott.net/article/474938-Major-new-autopsy-report-reveals-those-who-died-suddenly-were-likely-killed-by-the-covid-vaccine", "timestamp": "2023-04-25 17:07:32 CEST+0200", "meta": {"description": "A major new autopsy report has found that three people who died unexpectedly at home with no pre-existing disease shortly after Covid vaccination were likely killed by the vaccine. A further two deaths were found to be possibly due to the...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/474938-Major-new-autopsy-report-reveals-those-who-died-suddenly-were-likely-killed-by-the-covid-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Major new autopsy report reveals those who died suddenly were likely killed by the covid vaccine --", "cleaned_text": "A major new autopsy report has found that three people who died unexpectedly at home with no pre-existing disease shortly after Covid vaccination were likely killed by the vaccine. A further two deaths were found to be possibly due to the vaccine.The report , published in Clinical Research in Cardiology, the official journal of the German Cardiac Society, detailed autopsies carried out at Heidelberg University Hospital in 2021. Led by Thomas Longerich and Peter Schirmacher, itIn total the report looked at 35 autopsies carried out at the University of Heidelberg in people who died within 20 days of Covid vaccination, of which 10 were deemed on examination to be due to a pre-existing illness and not the vaccine.Almost all of the remaining cases were of a cardiovascular cause, as indicated in the table below from the supplementary materials, where 21 of the 30 deaths are attributed to a cardiovascular cause. One of these is attributed to blood clots (VITT) from AstraZeneca vaccination (the report was looking specifically at post-vaccine myocarditis deaths), leaving 20 from other cardiovascular causes.For the five deaths in the main report attributed as likely or possibly due to the vaccines, the authors state:This indicates that the authors limited themselves to deaths where there was no \"pre-existing, clinically relevant heart disease\", making the report very conservative in which deaths it was willing to pin on the vaccines.Dr. Schirmacher told me:It is of course very possible that the vaccines also cause death where there is an underlying cardiovascular condition, and indeed, that it is more likely to do so. Thus these five deaths are the minimum from these autopsy cases in which the vaccines are involved -It is worth noting here that initially in 2021, when the autopsies were first carried out, Dr. Schirmacher stated his team had concluded 30-40% of the deaths were due to the vaccines. These earlier estimates may give us a better indication of how many of the deaths the authors really think are attributable to the vaccines, when they are unconstrained by highly conservative assumptions (and looking at causes besides myocarditis). Note that these percentages are based on a selection of deaths that occurred shortly after vaccination, not a random sample of all deaths, so the authors rightly warn that no estimation of individual risk can be made from them.Did the autopsies find spike protein from the vaccines present in the heart tissue? The samples from the five vaccine-attributed deaths were tested for infectious agents including SARS-CoV-2 (in one instance revealing \"low viral copy numbers\" of a herpes virus, which the authors deemed insufficient to explain the inflammation). However, no tests were done specifically for the virus spike protein or nucleocapsid protein, such as have been used successfully in other autopsies to aid attribution to the vaccine, so unfortunately this evidence was unavailable for these autopsies.It also confirms how deadly even mild vaccine-induced myocarditis can be - and thus why studies like the one from Thailand , finding cardiovascular adverse effects in around a third of teenagers (29.2%) following Pfizer vaccination and subclinical heart inflammation in one in 43 (2.3%), and the study from Switzerland finding at least 2.8% with subclinical myocarditis and elevated troponin levels (indicating heart injury) across all vaccinated people, are so worrying.The authors of the new study diplomatically write that the \"reported incidence\" of myocarditis after vaccination is \"low\" and the risks of hospitalisation and death associated with COVID-19 are \"stated to be greater than the recorded risk associated with COVID-19 vaccination\" - notably declining to commit themselves to the official propositions that they dutifully repeat.The fact that those who die suddenly after vaccination may have died from the hidden effects of the Covid vaccine on their heart is thus now firmly established in the medical literature. The big remaining question is how often it occurs.: Dr. John Campbell has produced a helpful overview of the report's findings in his latest video", "opengraph": {"url": "https://www.sott.net/article/474938-Major-new-autopsy-report-reveals-those-who-died-suddenly-were-likely-killed-by-the-covid-vaccine", "type": "website", "title": "Major new autopsy report reveals those who died suddenly were likely killed by the covid vaccine -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/664845/full/Q5IVT6EKQ5OUTNNAUZBKLFN6YQ_768.jpg", "description": "A major new autopsy report has found that three people who died unexpectedly at home with no pre-existing disease shortly after Covid vaccination were likely killed by the vaccine. A further two deaths were found to be possibly due to the...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"//www.youtube.com/embed/j_DdSMn55cA?wmode=opaque\" allowfullscreen=\"\" title=\"Myocarditis German photographs\" width=\"560\" height=\"315\" frameborder=\"0\"></iframe>", "src": "//www.youtube.com/embed/j_DdSMn55cA?wmode=opaque"}], "links": ["/image/s33/664845/full/Q5IVT6EKQ5OUTNNAUZBKLFN6YQ_768.jpg", "/image/s33/664844/full/image_7.png", "/image/s33/664843/full/ximage_6_png_pagespeed_ic_ZovL.jpg", "/image/s33/664842/full/image_4.png", "https://dailysceptic.org/2022/10/27/mrna-vaccines-injure-the-heart-of-all-vaccine-recipients-and-cause-myocarditis-in-up-to-1-in-27-study-finds/", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.preprints.org/manuscript/202209.0051/v1", "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://dailysceptic.org/2022/05/31/fears-of-cover-up-as-pathologist-who-said-30-40-of-post-vaccine-autopsies-died-of-the-vaccine-went-oddly-silent-and-suddenly-stopped-carrying-out-autopsies/", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.preprints.org/manuscript/202209.0051/v1", "https://dailysceptic.org/2022/08/12/one-in-three-vaccinated-teenagers-suffer-cardiovascular-side-effects-one-in-43-suffer-heart-inflammation-study/", "https://www.youtube.com/watch?v=vveMHtVk_mY", "https://www.youtube.com/watch?v=j_DdSMn55cA"], "authors": [], "publish_date": null}