{"result_id": "272039", "URL": "https://www.sott.net/article/475517-Dr-Kerryn-Phelps-reveals-devastating-Covid-vaccine-injury-says-doctors-have-been-censored", "timestamp": "2023-04-25 17:07:44 CEST+0200", "meta": {"description": "Dr Kerryn Phelps has broken her silence about a \"devastating\" Covid vaccine injury, slamming regulators for \"censoring\" public discussion with \"threats\" to doctors. Former federal MP Dr Kerryn Phelps has revealed she and her wife both suffered...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/475517-Dr-Kerryn-Phelps-reveals-devastating-Covid-vaccine-injury-says-doctors-have-been-censored", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Dr Kerryn Phelps reveals 'devastating' Covid vaccine injury, says doctors have been 'censored' --", "cleaned_text": "Dr Kerryn Phelps has broken her silence about a \"devastating\" Covid vaccine injury, slamming regulators for \"censoring\" public discussion with \"threats\" to doctors.Former federal MP Dr Kerryn Phelps has revealed she and her wife both suffered serious and ongoing injures from Covid vaccines, while suggesting theIn an explosive submission to Parliament's Long Covid inquiry, the former Australian Medical Association (AMA) president has broken her silence about the \"devastating\" experience — emerging as the most prominent public health figure in the country to speak up about the taboo subject Dr Phelps married former primary school teacher Jackie Stricker-Phelps in 1998.\"Jackie asked me to include her story to raise awareness for others,\" she said.Dr Phelps revealed she was also diagnosed with a vaccine injury from her second dose of Pfizer in July 2021, \"with the diagnosis and causation confirmed by specialist colleagues\".She revealed she had spoken with other doctors \"who have themselves experienced a serious and persistent adverse event\" but thatThe Australian Health Practitioner Regulation Agency (AHPRA), which oversees Australia's 800,000 registered practitioners and 193,800 students, last year warned that anyone who sought to \"undermine\" the national Covid vaccine rollout could face deregistration or even prosecution.Earlier this year, Australian musician Tyson 'tyDi' Illingworth said he had been told privately by doctors that they feared being deregistered if they linked his neurological injury to the Moderna vaccine.Dr Phelps said she had heard stories of vaccine injury from \"patients and other members of the community\".\"Within this group of vaccine injured individuals, there is a diminishing cohort of people who have symptoms following immunisation, many of which are similar to Long Covid (such as fatigue and brain fog), but who have not had a Covid infection. These people would be an important subset or control group for studies looking into the pathophysiology, causes of and treatments for Long Covid. It is possible that there is at least some shared pathophysiology between vaccine injury and Long Covid, possibly due to the effects of spike protein.\"She added that \"in trying to convince people in positions of influence to pay attention to the risks of Long Covid and reinfection for people with vaccine injury, I have personally been met with obstruction and resistance to openly discuss this issue\".\"There has been a delay in recognition of vaccine injury, partly because of under-reporting, concerns about vaccine hesitancy in the context of managing a global pandemic, and needing to find the balance between risks and benefits on a population level,\" she said.\"Reactions were said to be 'rare' without data to confirm how common or otherwise these reactions were. In general practice I was seeing cases, which meant other GPs and specialists were seeing cases too. Without diagnostic tests, we have to rely largely on clinical history.\"In July this year, the independent OzSAGE group of which Dr Phelps is a member issued a position statement calling for better systems and management of Covid vaccine adverse events and \"recognition of the impact of vaccine injury\".Dr Phelps, who was heavily involved in crafting the statement, wrote in her submission that the OzSAGE document \"outlines the scope but not the scale of the problem because we do not know the scale of the problem\".\"This is partly because of under-reporting and under-recognition,\" she said.But Dr Phelps pointed to data from Germany's pharmacovigilance body, the Paul Ehrlich Institute (PEI), which has \"undertaken ongoing surveys of vaccine recipients ... as opposed to the TGA which only accepts passive reports, or AusVaxSafety whose survey stopped at six weeks\".Dr Phelps said there was concern some adverse events could \"cause long-term illness and disability\", but data was limited because the \"global focus has been on vaccinating as many people as quickly as possible with a novel vaccine for a novel coronavirus\".\"Because of this, all of the studies that have been published so far are either small, or case studies only,\" she said.She noted some countries had gathered significant databases of adverse events, ranging from allergy and anaphylaxis to cardiovascular, neurological, haematological and auto-immune reactions.Dr Phelps said until there was acknowledgment and recognition of post-vaccination syndrome or vaccine injury, \"there can be no progress in developing protocols for diagnosis and treatment and it is difficult to be included in research projects or treatment programs\".\"It has also meant a long and frustrating search for acknowledgment and an attempt at treatment for many individual patients,\" she said.\"People who suffer Covid vaccine injury may present with a range of symptoms, and results of standard medical tests often come back normal. And like patients with Long Covid, they too are also asking the medical profession and public health systems for help.\"Earlier this year, Dr Rado Faletic — who previously spoke out about his battle with the TGA — launched Australian advocacy group Coverse to provide support and collect testimony from those suffering vaccine injuries.The TGA said in a statement that people who submit adverse event reports \"are not routinely given feedback about their adverse event report beyond the acknowledgement letter\".\"However, in some cases reporters are contacted if further information is required to either complete or assess the adverse event report,\" a spokesman said.\"The TGA's function is to analyse adverse event report data to look for potential conditions or adverse effects which may be linked to vaccination. The Product Information (PI) documents for Covid-19 vaccines include information on adverse events including the expected frequency, when known. The PI documents are available on the TGA website. The TGA also publishes information about adverse events in the Covid-19 vaccine safety report.\"AHPRA said in a statement that the regulator had \"been clear in all of our guidance about Covid-19 vaccinations that we expect medical practitioners to use their professional judgement and the best available evidence in their practice\".\"This includes keeping up to date with public health advice from Commonwealth, state and territory authorities,\" a spokeswoman said.\"Legitimate discussion and debate, based on science is appropriate and necessary to progress our understanding and knowledge. The [March 9, 2021 position] statement does not prevent practitioners from having these discussions.\"She added that as of June 2022, only 11 practitioners had been suspended \"in relation to concerns raised about Covid-19\".\"The concerns raised about the practitioners related to the spreading of misinformation about Covid-19 or vaccination advice, including that the Covid-19 pandemic was fake, that the vaccination program was about government led mind control or in some instances representing that patients would develop cancer by having a vaccination administered,\" she said.Reached on Tuesday, Dr Phelps declined to comment further on the submission.Dr Phelps, who remains a practising GP, was elected as the first female president of the AMA in 2000.She was also a City of Sydney councillor from 2016 to 2021, and Deputy Lord Mayor under Clover Moore from 2016 to 2017.In 2018, Dr Phelps ran as an independent candidate in the by-election for the eastern suburbs seat of Wentworth following the resignation of Prime Minister Malcolm Turnbull, defeating Liberal Dave Sharma.She spent less than a year in federal parliament, losing to Mr Sharma in a rematch in the May 2019 election.", "opengraph": {"url": "https://www.sott.net/article/475517-Dr-Kerryn-Phelps-reveals-devastating-Covid-vaccine-injury-says-doctors-have-been-censored", "type": "website", "title": "Dr Kerryn Phelps reveals 'devastating' Covid vaccine injury, says doctors have been 'censored' -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/666270/full/Kerryn_Phelps_and_Jackie_Stric.jpg", "description": "Dr Kerryn Phelps has broken her silence about a \"devastating\" Covid vaccine injury, slamming regulators for \"censoring\" public discussion with \"threats\" to doctors. Former federal MP Dr Kerryn Phelps has revealed she and her wife both suffered...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/666270/full/Kerryn_Phelps_and_Jackie_Stric.jpg", "https://www.tga.gov.au/news/covid-19-vaccine-safety-reports/covid-19-vaccine-safety-report-15-12-2022", "https://www.nzherald.co.nz/nz/fourth-kiwi-dies-where-link-to-pfizer-covid-10-vaccine-can-not-be-excluded-say-health-authorities/FU4V4VET5FGWLC6F325E6AIKHE/", "https://www.news.com.au/lifestyle/health/health-problems/fourth-vaccine-dose-unlikely-to-be-approved-for-under30s-due-to-myocarditis-risk/news-story/a2da9fe71fa873f4e5aae0390625691d", "https://www.news.com.au/lifestyle/health/health-problems/outright-lying-australian-scientist-hits-out-at-tga-after-lifechanging-covid-vaccine-injury/news-story/c57a554e4f7b6750e8ae6ff2db6c9514", "https://www.news.com.au/finance/economy/federal-budget/covid-vaccine-injury-payouts-explode-to-77-million-budget-reveals/news-story/df39fcf430c6cadb487a9914df7a3422", "https://www.news.com.au/lifestyle/health/health-problems/dj-who-lost-motor-skills-after-moderna-vaccine-says-doctors-privately-admitted-link/news-story/23d4186d816aeb91b18691548963be12", "https://www.news.com.au/lifestyle/health/health-problems/its-killing-us-familys-horror-armwrestle-with-vax-scheme/news-story/ec80e2b805a56197e33d17a5c2c572da", "https://ozsage.org/wp-content/uploads/2022/07/IMPORTANCE-OF-COVID-19-VACCINATION-DEVELOPMENT-OF-BETTER-SYSTEMS-OzSAGE-July-2022.pdf", "https://www.news.com.au/lifestyle/health/health-problems/they-say-its-stress-sydney-woman-seeks-answers-to-migraines-and-tinnitus-six-months-after-pfizer/news-story/03cb54afd06b6f785b762f9c1a15aa1b", "https://coverse.org.au/"], "authors": [], "publish_date": null}