{"result_id": "272013", "URL": "https://www.sott.net/article/476047-Why-is-the-vaccine-killing-our-young-men-and-women", "timestamp": "2023-04-25 17:07:31 CEST+0200", "meta": {"description": "Author's Note: A detailed compilation of the epidemic of sudden deaths in our healthiest members of society can be found within Cause Unknown. Damar Hamlin was extremely fortunate to collapse where he did and medical care was immediately...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/476047-Why-is-the-vaccine-killing-our-young-men-and-women", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Why is the 'vaccine' killing our young men and women? --", "cleaned_text": "\n• Some other component of the vaccine.\n\nHow Do The Vaccines Kill People?\n• The spike protein causes protein misfolding to occur (which I suspect is due to it containing a prion-forming domain, or from its effect on colloidal stability). When a misfolded fibrous clot forms, in addition to the clot itself being irregular, the body's enzymes are unable to break the clot down down (as they no longer fit this altered protein). This causes the clot to keep on growing as there is nothing to oppose its growth and eventually, it hits a critical mass that is fatal for the vaccinated individual. This process has been demonstrated outside of the body, so it is reasonable to assume it also occurs within the body.\n• The spike protein (and possibly the lipid nanoparticles) have a positive charge that collapses the colloidal stability of fluids they enter, which causes things within the fluid to clump together (clotting is one example of this process). Due to how many of the characteristics of COVID-19 appeared to mirror what I would expect from an agent that had a significant adverse effect on this stability, I studied this link extensively, concluded the adverse changes were due to COVID-19's spike protein, and then observed similar but worse effects occur once the spike protein vaccines entered the market. In addition to the above article, I also discussed this subject here, and recently a detailed paper was written on this same topic.\n• The vaccines frequently cause anti-phospholipid syndrome, which puts you at high risk for blood clots.\n• The spike protein binds heparin and activates the alternative complement cascade (which causes blood clotting).\n• The vaccine spike protein is directly toxic to the endothelium and also provokes an autoimmune response to the endothelium. Endothelial dysfunction is a common cause of blood clots and heart disease.\n• The spike protein (and lipid nanoparticles) are highly immunogenic. One of the major issues with most vaccines is that when the body is exposed to an immunogenic adjuvant, in addition to it developing an immune response to the antigen that is present (e.g., a tetanus toxoid) it will also develop autoimmunity to other antigens that were also present (for example, one study showed that mice developed allergies to pollens that were in the air at the time of their vaccination). For those interested in learning more about how vaccine adjuvants induce autoimmune disorders, this textbook is an excellent reference.\n• The spike protein's sequence has a high degree of overlap with many different human tissues. When this overlap is present, autoimmune responses to the matching protein often initiate (termed autoimmune mimicry — rheumatic fever which results from the streptococcus bacteria matching the mitral valve of the heart is a well-known example). The uncanny degree of overlap that the spike protein has with the human body was a major red flag to many critiquing the choice to utilize a vaccine design that produce spike proteins inside the body.\n• The vaccine \"works\" in this way:\n• Very high rates of autoimmune complications in the vaccinated. An Israeli study found that 24.2% of those receiving a booster developed an exacerbation of a pre-existing autoimmune condition. One colleague who is a rheumatologist in practice has also observed that around 25% of patients who are vaccinated either developed a new autoimmune condition or had an exacerbation of a pre-existing autoimmune disorder. I have also observed the same thing as my colleague in rheumatology, and in neurology practices I've visited. Additionally, heart surgeon Dr. Steven Gundry performed a test that utilizes inflammatory markers to predict the risk of an acute coronary syndrome (e.g., a heart attack) in the next 5 years on 566 patients, and found that before vaccination their risk averaged 11%, while afterward, it averaged 25% (that is a huge increase).\n• The vaccine appears to frequently cause anti-phospholipid syndrome (APS), which I suspect is a consequence of its design. Before COVID-19, 0.0487% - 0.0649% of people developed APS each year. My rheumatologist colleague in turn has observed that the condition frequently follows vaccination (many of their patients have tested negative before and positive after) and presently finds 30-40% of those they test before receiving a booster (to determine their risk for the booster) are lightly positive for APS while 1.5-2% are strongly positive. APS, especially if strongly positive, is a very dangerous (and hard to manage) condition that dramatically increases one's likelihood of severe blood clots, infertility or stillbirths (e.g., by impairing the blood supply to the placenta), and death.\n• Although there have been a large number of sudden unexplained deaths following COVID-19 vaccination, there has been significant pressure exerted globally against conducting the autopsies that otherwise would have been required. Nonetheless, a few pathology teams have independently conducted these autopsies and there are now many studies that have detected profound and highly abnormal inflammation directed at the tissues that likely accounted for these deaths. Additionally, they also developed a way to test for the spike protein in those tissues and found that the spike protein was present, but not the COVID-19 virus, indicating that only the vaccine could have killed these individuals.\n• Fast-track the approval of other COVID-19 vaccines (e.g., the bivalent booster which was only tested on 8 mice).\n• Fast-track the approval of many other mRNA vaccines (e.g., RSV and Influenza).\n• Locking the spike protein into a prefusion state was done because it was needed for developing an effective vaccine, it was not done for safety.\n• The prefusion spike protein can still bind to the ACE2 receptor. It just can't enter the cell. This means it can still assert a pathologic effect upon the ACE2 receptor either through binding it or through remaining bound and triggering an autoimmune response to the cell it is now attached to. For example, the spike protein binding to the ACE2 down-regulates that critical receptor, which has a variety of consequences, including endothelial dysfunction (a common cause of heart disease).\n• While the SARS-CoV-2 virus must enter the cell to reproduce (which requires it transforming to the post-fusion state), there is no need for the vaccine spike protein to do the same because it \"reproduces\" by way of the vaccine mRNA entering cells, and the lipid nanoparticle entry is completely independent of ACE2.\n• It assumes that the vaccine will always produce this form of the spike protein (in reality there is variability in the final spike protein which vaccines produce) and that this form prevents its transformation to the post-fusion state (I have not been able to find anything which demonstrates that this always occurs).\n• It assumes that the only receptor which the spike protein binds is ACE2. It has also been shown that the spike protein binds the CD147 receptor, and creates significant issues when doing so (e.g., it releases the inflammatory cytokines associated with a cytokine storm). Evidence also exists that the spike protein binds integrins (e.g., α5β1 within the endothelium), which like CD147, once bound, also triggers a cytotoxic inflammatory cascade.\n• It assumes that the only mechanism of spike protein toxicity is its binding to the ACE2 receptor. In reality, it has a variety of other significant toxicities, such as those mentioned throughout this article and others detailed in the previous article.\n\nI have long been interested in studying how pharmaceutical drugs injure people. Before COVID-19, while quite common, this issue was relatively unknown, because the media — which receives significant sponsorship from the pharmaceutical industry — was rarely willing to cover this subject. Because of my interest, I've focused on trying to understand how the COVID-19 vaccines injure people, such as causing sudden adult death syndrome.Presently, I believe the mostculprit for the vaccine injuries is the spike proteins they produce. Almost all of the vaccine side effects I've observed have a mechanism that can be linked to a consequence of the spike protein,However, since most of the vaccines given were the mRNA ones (and thus most of the injuries arose from this platform), I also believe an argument can be made for the following contributing to these injuries:Some of the complications associated with the mRNA vaccines can be traced to known effects of these other components (e.g., the artificial mRNA could be causing the immunosuppression observed), so they may be very relevant to what is occurring. However, nothing besides the spike protein appears to explain the broad spectrum of complications observed and has thus been my primary focus.Before COVID-19 it was very rare for me to hear of healthy people dying suddenly (excluding one friend who died shortly after starting a psychiatric medication which I later learned had that side effect) especially deaths following a collapse in public. Because of how unprecedented it was, one of the initial things that really spooked many of us about COVID-19 was seeing recordings of these types of sudden deaths in China and Iran. Curiously, however, when COVID-19 arrived in America, even in the worst hit areas like New York, those same events never happened, which led many of us to conclude those initially reported events were most likely some type of propaganda campaign.A key reason why medical injuries often go unrecognized and unacknowledged is because a single drug can cause so many different complications. Physicians in practice are often unlikely to see enough of a single specific injury for it to raise a red flag. Another common reason is a symptom may be generic enough that it is easy to write it off as being caused by something else, or not to have one's attention drawn to the fact it happened.Although the \"Died Suddenly\" phenomenon is immensely tragic, there is also one major upside — it is a medical injurycan recognize and associate with the vaccines (which as a previously discussed survey indicated,of the American population appears to have done ).At this point, there are a variety of possible mechanisms to explain how the spike proteins from the vaccines ultimately kill people ( e.g., through cancer ). If we instead focus on the sudden deaths, there appear to be two primary processes occurring:There are 5 different mechanisms that I believe can account for the highly unusual blood clots we are seeing from the vaccines.Two of them and the supporting evidence were the focus of this article Briefly, they were:After that article was published it ended up being read by a large number of people (due to the interest in Died Suddenly) which prompted a few refutations of it to be written. I decided to respond to one as it contained many of the common errors I observe with attempts to defend any conventional narrative and because it allowed me to further expand my explanation for spike protein toxicity (e.g. the other 3 causes of blood clots). Today's article is essentially a follow-up to that article The additional mechanisms I put forward there to explain the blood clots (and provided supporting evidence for) are as follows:Since I published that article, I have also learned that the spike protein activates TLR2 and TLR4 . These pathways are highly inflammatory to the point their activation is associated with sepsis, and sepsis is by far the most common reason for hospital admissions (it is also the most common cause of death globally ). Additionally, both TLR2 and TLR4 , when activated, cause blood clotting to happen.Although Died Suddenly advanced the theory that the abnormal fibrous clots found during autopsies or the embalming process were the causative agent for the sudden death syndrome observed since the time the vaccines entered the market,(e.g., the spike protein endothelial damage described above or the amyloidosis which the spike proteins appear to cause described in the previous article , each of which can cause fatal cardiovascular failures).At this point, the strongest evidence for tissue damage exists when there is an autoimmune response to the spike proteins (an autoimmune response is when the immune system erroneously attacks the body). Although a variety of factors exist to explain why this autoimmune response is occurring, I believe the three most likely explanations are as followsThe problem with this approach is that it would be reasonable to conclude that the immune system might also kill those cells or develop an autoimmune response to the normal cellular components surrounding the synthetic spike proteins.While each of these concerns was quite valid,When I initially learned of this from reviewing the leaked EMA documents , I was astonished that Pfizer was allowed to opt out of this, and took it as a tacit admission that there would be profound autoimmune complications from their vaccine. This is becauseSince the time the vaccines entered the market, there have been a variety of signs that there are profound immunological consequences from these vaccines. Those signs include:The most recent study , for example, examined 35 individuals who died within 20 days of vaccination, 25 of whom were determined to have not had a pre-existing condition that could have caused their sudden death. Of these 25 fatalities, it was determined that 5 died of myocarditis (with 3 of those deaths almost certainly due to vaccination, and 2 others having a likely but not definitive link), while the other 20 had other fatal conditions commonly associated with spike protein vaccination (e.g., heart failure).I believe that these signs of profound autoimmune pathology occurring are all likely consequences of the three explanations for autoimmunity that were described earlier in this section. For example, the spike protein being expressed in the cell membrane would explain why the immune system is attacking vaccinated cells (additionally, it has been repeatedly shown by the pathologists that cells being attacked by the immune system also have spike proteins).One of the most common tactics humans use for gaining power is to declare something to be true. Sometimes this works out wonderfully (e.g., the \"Declaration of Independence\" perfectly touched upon the sentiments of the American colonists and led to the creation of the most powerful empire in history), but in many other cases declarations are used for much more nefarious ends (e.g., conquering a country and eliminating its citizenry).Something rarely appreciated about the pharmaceutical industry is that more money is spent on selling drugs than the research to develop them (which helps to explain why so many critical steps were skipped on developing the spike protein vaccines while so much was spent to promote them to the public). Because of this, it's only possible to understand a lot of things about pharmaceutical products if you look at them through a marketing lens.One common approach (done by either internal marketing departments or PR companies contracted by the pharmaceutical companies) is to come up with effective sales slogans.and before long the medical profession adopts the declaration (and not long after the public does as well).One of the best examples of these principles was the idea that depression is due to a chemical imbalance (deficient serotonin) in the brain. After this slogan was created, it was eagerly adopted by the medical profession, used by providers to push the medications on millions of patients who did not want them, and before long, was also adopted by the peer groups of those patients who likewise used that slogan to push the antidepressants on them (I have heard more sad stories of this than I can count). The problem with this entire theory was that it was never proven (it's quite difficult to measure serotonin in the brain) and other mechanisms that better explain the function of antidepressants have since been discovered. Despite this, that declaration is still thought to be true by the majority of healthcare workers and the general public.In the case of COVID-19 one of the best examples we had of a false declaration was the idea that the vaccines would prevent COVID-19 transmission (discussed further here ),because otherwise, you were a murderer. When this declaration was made, there was no evidence (besides wishful thinking to support it) but almost everyone took it as being true.For example, early in the vaccine rollout, after my employer (who I considered to be very open-minded and well-versed in medical literature) realized that I and a few coworkers had not been vaccinated. We were then summoned to meetings to address our extreme lapse in medical ethics. In these meetings, I provided the evidence we were not putting our patients' lives at risk by not vaccinating, but all I got in return was \"well if the vaccine prevents you from getting COVID-19, that means it will prevent transmission.\"Presently, the most problematic declaration we are dealing with is that since the COVID-19 mRNA vaccines have been proven to be \"so safe and effective\", it is fine to:As you can see, the declaration upon which all of this is based is absurd, but as history has shown, that often does not matter. If a declaration is asserted as fact, that typically is all that is needed for it to be forced down everyone's throats.False declarations often take the form of deceptive arguments where a few false premises are strung together to support the declaration, which others adopt and then believe were their own idea rather than something industry fed to them. With the vaccines, I have noticed a few common declarations besides the alleged prevention of transmission, which formed the focus of the previous article in this series.The first declaration is that vaccinated blood is the same as unvaccinated blood, because the spike protein rapidly disappears from it. Based on the clinical observations I and colleagues have made, along with the autopsy studies showing spike proteins in the tissues of individuals who died suddenly long after vaccination,As best as I can tell, this claim is largely sourced from a single study of 12 participants which found that spike proteins peaked at 5 days and then declined (and while many assume this had to have happened, spike protein clearance was never officially studied by Pfizer).This study also noted that \"our results are consistent with spike-specific antibodies blocking the detection of the antigen in antigen capture-based assays.\"This suggests that other attempts at calculating the amount of circulating spike protein in the blood are undercounting the amount of spike protein present (as they use the same methodology) and that a significant degree of the decline observed is due to increased antibody production, not a decline in spike protein production. It should also be noted that the new study discussed later in this article also used the same assay to measure the spike proteins, and the method utilized there to separate antibodies from the spike proteins would not necessarily address the issue highlighted above (where spike protein antibodies directly blocked the assay).Lastly, one of the major problems with the mRNA technology is that the mRNA would be broken down too quickly for there to be time for enough of the desired protein (e.g., the spike protein) to be produced. This was solved through pseudouridation, which prevented the body's degradation of the mRNA. Unfortunately, it is still not known how long this degradation is prevented; all we have is a study that showed at 60 days the mRNA was still present (once again Pfizer never studied this as they should have).The second declaration is that the vaccine modification of the spike protein renders it harmless:Note: Dr. Burnett is arguing that the S protein being locked into the prefusion state (by two prolines being added to it) makes the vaccine spike protein harmless since it needs to enter the post-fusion state to enter cells.I addressed this argument in the previous article because it is one of the most common declarations utilized by vaccine proponents to debunk claims of harm (e.g., it was also used by Drew Comments in his discussion with Steve Kirsch).There are a variety of issues with this argument. The main ones are as follows:Since that time, a new study has helped to further clarify some of these questions. Circulating Spike Protein Detected in Post-COVID-19 mRNA Vaccine Myocarditis , evaluated 16 patients with post-vaccination myocarditis and 45 controls who had been vaccinated but did not have myocarditis. Those 16 patients ranged from 12-21 years of age (averaging at 16), 15 of whom received Pfizer and 1 who received Moderna. Additionally, since viral infections can also cause myocarditis, a large number of viral infections were evaluated for, and no difference could be identified between those with myocarditis and the controls.Before we go further, I must note that it is impossible to have a paper pass peer review and be published in a conventional journal (especially if it discusses a controversial subject) unless it repeatedly states an allegiance to the narrative and portrays its findings so that they support the prevailing biases of the reviewers and journal editors. For this reason, we have a curious phenomenon where conclusions of papers often contradict the paper's findings and one needs to carefully review a paper to conclude anything from it (unfortunately most people instead default to reading its conclusion).For example, this paper provides a few very concerning findings about the vaccines but concludes with:Given that this article took the journal 6 months to approve the publication of from the time of submission, I can somewhat sympathize with what the authors had to do to get it published. Despite these constraints, they were nonetheless able to provide a few very valuable pieces of information.The key finding of the paper was that while most (but not all) of the signs of autoimmunity they looked at (with the caveat that many were not examined) were the same between the vaccinated and unvaccinated groups,This, in turn, argued that the presence of the spike protein may have played a contributory role in the myocarditis.Since spike protein can become bound to antibodies against them (and thus no longer be detectable with the instrumentation used), the authors then used Dithiothreitol (DTT) to separate the two to evaluate for the total amount of spike protein present:What these results essentially showed was that the vaccinated controls were able to neutralize the spike proteins present in their blood, but vaccinated individuals who developed myocarditis were not. Additionally, the S1 component of the spike protein was cleared much faster than the entire spike protein (which the authors suspected was due to it being smaller).There were also a few other useful pieces of data within this study:First, at the time spike protein levels were evaluated in vaccinated patients who developed myocarditis, it ranged from 17.76 pg/ml to 126.4 pg/ml (averaging 33.9±22.4 pg/mL). This suggests that very low concentrations of vaccine spike protein being present in the blood can cause pathologic effects.Second, although the free spike protein was observed to clear in the majority of patients with myocarditis, it was also observed to persist in 25% of the patients with myocarditis (and I suspect many other vaccine injured patients):Third, it should be noted that these results significantly differ from the frequently cited study of the blood of 12 vaccinated individuals who did not appear to develop complications from the vaccine:For additional context, in a previously mentioned study , 1000 pg/ml of spike protein was found to be sufficient to cause pathologic misfolding of fibrin blood clots, and it is very likely a lower concentration also could cause this misfolding to happen (however it was never tested).These three findings suggest that the concentrations of spike protein within the blood of vaccinated subjects have not been sufficiently studied (we presently have a few small studies with different values and numerous potential methodological issues). Given the potential toxicity of small doses of the spike protein, exactly how much spike protein is made is something that needs to be figured out, and more importantly, should have been ascertainedFurthermore, as the authors noted from their findings, there appears to be an age-related capacity for handling vaccine-introduced antigens (younger individuals were less able to neutralize spike proteins). Since the children in this cohort received the same dosing of mRNA vaccines as adults, it was a critical oversight by Pfizer and Moderna to not properly study the levels of free spike protein in vaccine recipients, particularly at specific age groups (as this would have argued for children receiving a lower dose). Oversights like this unfortunately are quite common, as people tend to assume that vaccines, by virtue of being vaccines, are safe and thus they do not consider the need to calibrate the dose to avoid potential toxicity.Finally, this study presented signs that some immunological dysfunction was occurring in post-vaccine myocarditis, which in turn, suggested innate inflammatory activation was occurring (there were significantly elevated levels of interleukin[IL]-8, IL-6, tumor necrosis factor-α, IL-10, and interferon-γ). There was also a slight increase in PD-1-expressing bulk CD4+ T cells that could potentially indicate some degree of T-cell activation or exhaustion.Through illustrating the direct toxicity of the vaccine spike protein (something the medical profession is still very reluctant to acknowledge), this study provides some valuable clues for what may be killing the healthiest members of our society. This is important because sudden deaths are typically so rare in the ages for which we (and those in the life insurance business ) are now observing those deaths, everyone can tell Sudden Adult Death Syndrome is a real thing that had to have come from somewhere.Although tragic, the catastrophe we are now facing — caused by an extremely dangerous product being forced upon the entire public--offers a unique opportunity. There is finally a window to bring public awareness to just how dangerous pharmaceuticals can be, and how incapable our system is of addressing this issue, or even admitting it is a problem (whereas, in the past, not enough damage was evident to reign in the growing pharmaceutical corruption taking over our society).This study also provides a valuable clue to another question which many of us have been pondering for a while. Why do some people react so badly to vaccines while others are relatively unaffected?In the past, like others, I have advanced the theory that there are differences between the vaccines and that some vials are much more toxic than others. This study instead highlights another explanation; some members of the population cannot form the antibodies necessary to neutralize the vaccine spike protein.This is particularly interesting for two reasons. The first is that the vaccines are known to adversely affect the immune system (e.g., through creating immune suppression), which may provide another explanation for why the vaccines become more toxic with successive doses (e.g., consider the recent discovery that successive immunization creates tolerance to the spike protein, which Jessica Rose discussed in detail).The second is that one of the most effective treatments I came across for treating vaccine injuries were the original monoclonal antibodies, which like the vaccines, were made to target the original spike protein. This suggests that some of the vaccine-injured patients could not adequately form these antibodies on their own, and thus needed them to be administered externally.Sadly, under the logic that the monoclonal antibodies no longer covered the existing strains of COVID-19 (which had mutated due to the vaccines selecting the original COVID-19 out of the population), the FDA revoked the monoclonal's Emergency Use Authorization EUA (but of course did not apply the same logic to the vaccines). Because the EUA was pulled, almost all of the monoclonals were thrown away, and I presently only have access to a few that my colleague intercepted as their hospital was dumping its supply. I can't prove this, butHowever, while the inability to form appropriate antibodies to the spike protein offers a compelling reason for the variability in susceptibility to vaccine injuries, I still believe that lot-to-lot variation is the primary issue (and neither by any means excludes the other, because a poor antibody response will be more problematic as more spike protein enters the body). In the next article, I will go into some recent discoveries that strongly argue that this is occurring and is known to the manufacturers of the Pfizer and Moderna vaccines.Finally, I wanted to put out a request. Do any of you have experience reading Western Blots from the standpoint of being able to detect if they are authentic? A few important ones were sent in, and my team believes they are fraudulent, but due to the importance of these results, we would also like to solicit the opinion of someone with expertise in the area.", "opengraph": {"url": "https://www.sott.net/article/476047-Why-is-the-vaccine-killing-our-young-men-and-women", "type": "website", "title": "Why is the 'vaccine' killing our young men and women? -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/667766/full/hamlin.jpg", "description": "Author's Note: A detailed compilation of the epidemic of sudden deaths in our healthiest members of society can be found within Cause Unknown. Damar Hamlin was extremely fortunate to collapse where he did and medical care was immediately...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/667766/full/hamlin.jpg", "https://amidwesterndoctor.substack.com/p/what-can-we-learn-from-cause-unknown", "https://amidwesterndoctor.substack.com/p/a-century-of-evidence-has-accumulated", "https://amidwesterndoctor.substack.com/p/why-does-every-vaccine-often-cause", "https://amidwesterndoctor.substack.com/p/why-does-every-vaccine-often-cause", "https://www.biorxiv.org/content/10.1101/2022.11.24.517882v1", "https://www.sciencedirect.com/science/article/abs/pii/S0091674974800047", "https://www.amazon.com/Vaccines-Autoimmunity-Yehuda-Shoenfeld-ebook/dp/B014T25FX6", "https://stevekirsch.substack.com/p/how-rare-are-vaccine-side-effects", "https://www.ahajournals.org/doi/abs/10.1161/circ.144.suppl_1.10712", "https://thrombosisjournal.biomedcentral.com/articles/10.1186/s12959-022-00409-8", "https://www.nature.com/articles/nrrheum.2010.47https://www.nature.com/articles/nrrheum.2010.47", "https://amidwesterndoctor.substack.com/p/how-do-vaccines-cause-sudden-death", "https://pathologie-konferenz.de/", "https://www.mdpi.com/2076-393X/10/10/1651", "https://investors.modernatx.com/news/news-details/2021/Moderna-Receives-FDA-Fast-Track-Designation-for-Respiratory-Syncytial-Virus-RSV-Vaccine-mRNA-1345/default.aspx", "https://www.pfizer.com/news/announcements/pfizer-and-biontech-receive-us-fda-fast-track-designation-single-dose-mrna-based", "https://www.cell.com/cell/fulltext/S0092-8674(22)00076-9", "/image/s33/667769/full/vaccine.jpg", "/image/s33/667768/full/vaccine.jpg", "https://cen.acs.org/pharmaceuticals/vaccines/tiny-tweak-behind-COVID-19/98/i38", "https://www.ahajournals.org/doi/10.1161/CIRCRESAHA.121.318902", "https://www.ahajournals.org/doi/10.1161/CIRCRESAHA.121.318902", "https://portlandpress.com/clinsci/article/135/24/2667/230273/The-SARS-CoV-2-Spike-protein-disrupts-human", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8820157/", "https://amidwesterndoctor.substack.com/p/critical-thinking-in-the-age-of-censorship", "/image/s33/667770/full/spike_protein.jpg", "/image/s33/667771/full/myocarditis.jpg", "/image/s33/667772/full/spike_protein.jpg", "https://rwmalonemd.substack.com/p/when-is-mrna-not-really-mrna", "https://amidwesterndoctor.substack.com/p/the-american-public-is-extremely?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://arkmedic.substack.com/p/welcome-to-gilead", "https://amidwesterndoctor.substack.com/p/what-is-causing-the-died-suddenly?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://amidwesterndoctor.substack.com/p/critical-thinking-in-the-age-of-censorship?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://elifesciences.org/articles/68563", "https://www.nature.com/articles/s41422-021-00495-9", "https://www.hcup-us.ahrq.gov/reports/statbriefs/sb277-Top-Reasons-Hospital-Stays-2018.pdf", "https://www.med.ubc.ca/news/sepsis-leading-cause-of-death-worldwide/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7197442/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4270899/", "https://amidwesterndoctor.substack.com/p/what-is-causing-the-died-suddenly", "https://www.bmj.com/content/372/bmj.n627", "https://link.springer.com/article/10.1007/s00392-022-02129-5#Sec3", "https://igorchudov.substack.com/p/cdc-lied-about-vaccine-myocarditis", "https://www.ahip.org/news/articles/new-study-in-the-midst-of-covid-19-crisis-7-out-of-10-big-pharma-companies-spent-more-on-sales-and-marketing-than-r-d", "https://amidwesterndoctor.substack.com/p/why-the-covid-19-vaccines-could-never", "https://amidwesterndoctor.substack.com/p/critical-thinking-in-the-age-of-censorship", "https://academic.oup.com/cid/article/74/4/715/6279075?login=false", "https://www.cell.com/cell/fulltext/S0092-8674(22)00076-9", "https://amidwesterndoctor.substack.com/p/critical-thinking-in-the-age-of-censorship", "https://stevekirsch.substack.com/p/drew-comments-tacitly-admits-that", "https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.122.061025", "https://academic.oup.com/cid/article/74/4/715/6279075?login=false", "http://portlandpress.com/bioscirep/article/41/8/BSR20210611/229418/SARS-CoV-2-spike-protein-S1-induces-fibrin-ogen", "https://amidwesterndoctor.substack.com/p/what-can-we-learn-from-cause-unknown", "https://amidwesterndoctor.substack.com/p/the-story-behind-sudden-death-syndromes", "https://igorchudov.substack.com/p/booster-caused-immune-tolerance-explains", "https://jessicar.substack.com/p/the-immunological-mechanism-of-action"], "authors": [], "publish_date": null}