{"result_id": "272034", "URL": "https://www.sott.net/article/476299-COVID-19-vaccine-hesitancy-linked-to-increased-risk-of-traffic-accidents", "timestamp": "2023-04-25 17:07:42 CEST+0200", "meta": {"description": "New research suggests that individuals who disregard recommendations for vaccination against coronaviruses may also disregard rules of road safety. A new study published in The American Journal of Medicine has identified a link between vaccine...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/476299-COVID-19-vaccine-hesitancy-linked-to-increased-risk-of-traffic-accidents", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "COVID-19 vaccine hesitancy linked to increased risk of traffic accidents --", "cleaned_text": "A new study published in The American Journal of Medicine has identified a link between vaccine hesitancy for COVID-19 and increased risks of traffic accidents. Researchers found that individuals who neglect health recommendations for vaccination may also neglect basic road safety measures. The study suggests that raising awareness about the connection between vaccination and road safety may encourage more people to get vaccinated against COVID-19.This is the first study that explores the possible relationship between vaccine hesitancy and traffic crashes, which are a major cause of injury and death, and can be made worse by other underlying health conditions.\"COVID-19 vaccination is an objective, available, important, authenticated, and timely indicator of human behavior - albeit in a domain separate from motor vehicle traffic,\" explained lead investigator Donald A. Redelmeier, MD, Evaluative Clinical Sciences, Sunnybrook Research Institute; Department of Medicine, University of Toronto ; Institute for Clinical Evaluative Sciences; and Division of General Internal Medicine, Sunnybrook Health Sciences Centre, Toronto, ON, Canada.\"Whether COVID-19 vaccination is associated with increased traffic risks, however, has not previously been tested. Simple immune activation against a coronavirus, for example, has no direct effect on the risk of a motor vehicle crash. Instead, we theorized that adults who neglect health recommendations may also neglect basic road safety guidelines,\" he continued.Investigators tested whether COVID-19 vaccination was associated with the risks of a traffic crash in Ontario, which is the most populous part of Canada with over 14,500,000 residents in 2021. The yearly crash risk was 2% for an average adult (minor incidents included), the minimum driving age was 16 years, and novice drivers initially received beginner licenses. The COVID-19 vaccine became available in the winter of 2020, doses were widely delivered to adults by the spring of 2021, and uptake had plateaued in the summer of 2021. Vaccination was free to all, supported by community outreach, accompanied by public campaigns, and connected to a central registration system.The investigators conducted a population-based longitudinal cohort analysis of adults and determined COVID-19 vaccination status through linkages to individual electronic medical records. Traffic crashes requiring emergency medical care were subsequently identified by multicenter outcome ascertainment of 178 centers in the region over a one-month follow-up interval.Over 11 million individuals were included, of whom 16% had not received a COVID-19 vaccine. The cohort accounted for 6,682 traffic crashes during follow-up. Unvaccinated individuals accounted for 1,682 traffic crashes (25%), equal to a 72% increased relative risk compared to those vaccinated. The increased risk was more than the risk associated with diabetes and similar to the relative risk associated with sleep apnea.The increased traffic risks among unvaccinated adults extended to diverse subgroups (older & younger; drivers & pedestrians; rich & poor) and were equal to a 48% increase after adjustment for age, sex, home location, socioeconomic status, and medical diagnoses. The increased traffic risks extended across the entire spectrum of crash severity and appeared similar for Pfizer, Moderna, or other vaccines. The increased risks collectively amounted to 704 extra traffic crashes.\"The study found traffic risks were 50%-70% greater for adults who had not been vaccinated compared to those who had,\" noted Dr. Redelmeier. \"These data suggest COVID-19 vaccine hesitancy is associated with significantly increased risks of a traffic crash, however, this does not mean COVID-19 vaccination directly prevents crashes. Instead, it shows how adults who do not follow public health advice may also neglect the rules of the road. Misunderstandings of everyday risk can cause people to put themselves and others in grave danger.\"The authors recommend that individuals who hesitate to take the COVID-19 vaccine reflect on their choices and recognize how such decisions have repercussions in ways they do not imagine. \"We don't want unvaccinated people to feel persecuted and are not suggesting they stop driving; instead, we suggest they drive a bit more carefully. Physicians counseling patients who decline COVID-19 vaccination could consider safety reminders so their patients do not become traffic statistics,\" Dr. Redelmeier concluded.Reference: \"COVID Vaccine Hesitancy and Risk of a Traffic Crash\" by Donald A. Redelmeier, Jonathan Wang and Deva Thiruchelvam, 2 December 2022, The American Journal of Medicine.The study was funded by the Natural Sciences and Engineering Research Council of Canada, the Canadian Institutes of Health Research, the Canada Research Chair in Medical Decision Science, and the University of Toronto Graduate Diploma in Health Research.", "opengraph": {"url": "https://www.sott.net/article/476299-COVID-19-vaccine-hesitancy-linked-to-increased-risk-of-traffic-accidents", "type": "website", "title": "COVID-19 vaccine hesitancy linked to increased risk of traffic accidents -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/668383/full/Car_Accident_Crash_Concept_777.jpg", "description": "New research suggests that individuals who disregard recommendations for vaccination against coronaviruses may also disregard rules of road safety. A new study published in The American Journal of Medicine has identified a link between vaccine...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "University of Toronto", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/668383/full/Car_Accident_Crash_Concept_777.jpg", "/image/s33/668384/full/COVID_Car_Accident_Research_Te.jpg", "https://doi.org/10.1016/j.amjmed.2022.11.002", "https://scitechdaily.com/tag/university-of-toronto/"], "authors": [], "publish_date": null}