{"result_id": "272027", "URL": "https://www.sott.net/article/459793-Comparison-of-official-govt-reports-suggest-fully-vaccinated-developing-acquired-immunodeficiency-syndrome-much-faster-than-anticipated", "timestamp": "2023-04-25 17:07:38 CEST+0200", "meta": {"description": "Latest UK PHE Vaccine Surveillance Report figures on Covid-19 cases show that doubly vaccinated 40-79 year olds have lost 44% of their immune system capability. Their immune systems are deteriorating at around 5% per week (between 3.8% and 9.1%)....", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/459793-Comparison-of-official-govt-reports-suggest-fully-vaccinated-developing-acquired-immunodeficiency-syndrome-much-faster-than-anticipated", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Comparison of official govt reports suggest fully vaccinated developing acquired immunodeficiency syndrome much faster than anticipated --", "cleaned_text": "Latest UK PHE Vaccine Surveillance Report figures on Covid-19 cases show that. Their immune systems are(between 3.8% and 9.1%).If this continues then 30-59 year olds will have zero Covid/viral defence (and perhaps a form of acquired immunodeficiency syndrome) by Christmas and all double vaccinated people over 30 will have completely lost the part of their immune system that tackles Covid-19 by January next year.The 5 Public Health England (PHE) tables below from their excellent Vaccine Surveillance Report of all fully genome sequenced delta cases, separated by 5 weeks, clearly show the progressive damage that the vaccines are doing to the immune system's response. PHE have done so much great work and the picture is very clear.Here is the weekly decline in doubly vaccinated immune system performance compared to unvaxxed people. Vaccine efficacy is measured using Pfizer's vaccine effectiveness formula...(Unvaxxed case rate - Vaxxed case rate)/the Larger of Unvaxxed or Vaxxed case rate - We are using the ratio of vaxxed to unvaxxed case numbers to determine vaccine efficiency just as Pfizer itself does.A Vaccine efficacy ofmeans that doubly vaxxed people are 50% more protected from Covid than unvaxxed people. It means that the delta case rate in the vaxxed is half the delta case rate in the unvaxxed.A Vaccine efficacy ofmeans that unvaxxed people are 50% more protected from Covid than doubly vaxxed people. It means that the delta case rate in the vaxxed is double the delta case rate in the unvaxxed.A Vaccine efficacy ofmeans that doubly vaccinated people are 0% more protected from Covid than unvaxxed people. It means that the delta case rate in the vaxxed equals the delta case rate in the unvaxxed. It means the vaccines have lost all their effectiveness.Everybody over 30 will have lost 100% of their entire immune capability (certainly for Covid and most likely for viruses and certain cancers - following the evidence from Cole Diagnostics in Idaho and Dr Nathan Thompson) within 16 weeks.Doubly vaccinated 30-59 year olds will have lost it by Christmas. These people will then have no immune defence to Covid at all. The question then becomes how much of the immune system is involved in defending against Covid? The worst case scenario is that they effectively have full blown AIDS and destroy the NHS.Unless a cure is found quickly they may well die (as occurred at the start of the AIDS epidemic).These immune system degradations could be caused by ADE (Antibody Dependent Enhancement - where the vaccine induced antibodies start working in reverse) and be, or could beand result in a form of vaccine mediated AIDS (Acquired Immune Deficiency Syndrome). The fact that the 3rd Jabs worked in Israel (for a short period of time before the 4th jabs were proposed) means that. So that rules out ADE.The falling efficacy of the vaccines does not asymptotically approach zero (which would mean that vaccines merely lose effectiveness over time).(which means the vaccines become toxic to the immune system). Then it goes more negative in a linear manner week on week.The vaccine booster shots have to be the same as the vaccines themselves, because it takes forever to do clinical trials and get approval for something different. So if you take a booster shot, these figures show that you are giving yourself an even faster progressive form of AIDS (after an initial few months of effectiveness).Table 2. COVID-19 cases by vaccination status...Pfizer originally claimed a 95% efficiency for their vaccine (calculated as in the boost or degradation column above). The figures above indicate that,(the younger age groups have had the vaccine for the shortest time). But the figures above also show that the vaccines do NOT merely lose efficiency over time down to zero efficiency. They progressively damage the immune system until a negative efficiency is realised. They presently leave anybody over 30 in a worse position than they were before vaccination For more see here.", "opengraph": {"url": "https://www.sott.net/article/459793-Comparison-of-official-govt-reports-suggest-fully-vaccinated-developing-acquired-immunodeficiency-syndrome-much-faster-than-anticipated", "type": "website", "title": "Comparison of official govt reports suggest fully vaccinated developing acquired immunodeficiency syndrome much faster than anticipated -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s31/624423/full/vaccine_001_4.jpg", "description": "Latest UK PHE Vaccine Surveillance Report figures on Covid-19 cases show that doubly vaccinated 40-79 year olds have lost 44% of their immune system capability. Their immune systems are deteriorating at around 5% per week (between 3.8% and 9.1%)....", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s31/624423/full/vaccine_001_4.jpg", "/image/s31/624689/full/image_150.png", "/image/s31/624688/full/image_151.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1016465/Vaccine_surveillance_report_-_week_36.pdf", "/image/s31/624687/full/image_152.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1018416/Vaccine_surveillance_report_-_week_37_v2.pdf", "/image/s31/624686/full/image_155.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1019992/Vaccine_surveillance_report_-_week_38.pdf", "/image/s31/624685/full/image_154.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1022238/Vaccine_surveillance_report_-_week_39.pdf", "/image/s31/624684/full/image_156.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1023849/Vaccine_surveillance_report_-_week_40.pdf", "/image/s31/624683/full/image_157.png", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1025358/Vaccine-surveillance-report-week-41.pdf", "/image/s31/624682/full/image_159.png", "https://theexpose.uk/2021/10/15/latest-data-shows-covid-vaccines-have-negative-effectiveness-minus-109-percent"], "authors": [], "publish_date": null}