{"result_id": "272015", "URL": "https://www.sott.net/article/476833-FDA-advisers-vote-to-replace-original-COVID-vaccine-with-bivalent-boosters-despite-lack-of-clinical-trial-data", "timestamp": "2023-04-25 17:07:32 CEST+0200", "meta": {"description": "Advisers to the U.S. Food and Drug Administration (FDA) on Thursday voted unanimously to replace the original Pfizer and Moderna primary series mRNA COVID-19 vaccines with the bivalent boosters designed to target Omicron variants. The bivalent...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/476833-FDA-advisers-vote-to-replace-original-COVID-vaccine-with-bivalent-boosters-despite-lack-of-clinical-trial-data", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "FDA advisers vote to replace original COVID vaccine with bivalent boosters despite lack of clinical trial data --", "cleaned_text": "'COVID is not the flu'\n\nWhat about COVID shots and strokes?\n\nPrasad: Safety systems 'so antiquated' that finding safety issues 'is hopeless'\n\nHe pointed out that the FDA asked for\n\nwhich showed 1,223 confidential and proprietary deaths in the first three months\n\nAdvisers to the U.S. Food and Drug Administration (FDA) on Thursday voted unanimously to replace the original Pfizer and Moderna primary series mRNA COVID-19 vaccines with the bivalent boosters designed to target Omicron variants.The bivalent mRNA boosters — no human clinical trials — contain components of the original COVID-19 ancestral strain plus the BA.4 and BA.5 Omicron subvariants.The recommendation by the 21-member Vaccines and Related Biological Products Advisory Committee (VRBPAC) moves the FDA one step closer to its goal, announced Monday , of creating a single annual COVID-19 shot If the FDA accepts the committee's recommendation, the U.S. \"would likely phase out\" the companies' original vaccines, developed in 2020, that target the Wuhan strain, CNBC reported The move aims to \"simplify the approach to vaccination in order to facilitate the process of optimally vaccinating and protecting the entire population moving forward,\" said Dr. Peter Marks, Ph.D. , director of the FDA's Center for Biologics Evaluation and Research, in his opening remarks.However, a series of recent studies demonstrating problems with the safety and efficacy of the bivalent boosters for adults and children have raised concerns about the shots The FDA's own briefing document released prior to Thursday's meeting conceded that interpreting the data from studies on immune system response to the bivalent boosters, \"is complicated because of the limited sample size, the variability in the assays used and the status of assay qualification, the populations tested, and the intervals between vaccination and serum collection.\"Still, the FDA's Jerry Weir, Ph.D. , said there is \"remarkable\" real-world data showing the efficacy of the bivalent boosters. Vinay Prasad, M.D., M.P.H. , disagreed, tweeting:Committee members raised questions about the lack of data on vaccine durability and about dosage, safety and efficacy data for children, but those concerns did not affect their vote.\"Having managed to fill the meeting with no relevant data, the committee voted unanimously, 21 of 21, to promote bivalent boosters in the future for initial series and later boosters,\" Dr. Meryl Nass , internist, epidemiologist and member of the Children's Health Defense scientific advisory committee, told The Defender in an email following the meeting.Monday's FDA briefing document outlined a proposal for new vaccination protocols — a single annual dose of the vaccine for most people and two doses for very young children, the elderly and immunocompromised people.The panel discussed the proposal but did not vote on it.Moderna, Pfizer, Novavax, the FDA and the Centers for Disease Control and Prevention (CDC) gave presentations on the viability of annual boosters but presented only limited data on the duration of protection offered by the vaccines.\"They assiduously avoided discussion of how long a shot might offer protection — instead the briefers cited studies of efficacy for only 2-3 months after receiving a vaccine,\" Nass said. She added:The FDA said it expects to assess the evolution of COVID-19 annually to determine which strains to vaccinate for, a process they likened to the one followed for the flu vaccine But several committee members repeatedly noted, agreeing with committee member Dr. Pamela McInnes , that \"COVID is not the flu.\"Vaccine makers would update the annual shot through a process that would begin each spring to try to match the vaccine as closely as possible to whatever variant is predicted to be dominant in the coming winter, according to a framework proposed at the April 6, 2022, VRBPAC meeting Pfizer confirmed the vaccines would take 100 days to produce after the variant had been determined, but Novavax said it would take up to six months for its vaccine.Weir told VRBPAC members on Wednesday that a late Spring/early Summer recommendation is \"reasonable and practical,\" based on the 2022 bivalent experience. Dr. John Beigel , associate director for clinical research at the National Institute of Allergy and Infectious Diseases' Division of Microbiology and Infectious Diseases, showed the committee a slide demonstrating that \"next generation of SARS-CoV-2 Vaccines\" will need to provide \"enhanced breadth of protection (variant proof), improved durability, and enhanced ability to block infection/transmission.\" He did not elaborate on how those goals might be achieved. Dr. Nicola Klein, Ph.D. , director of the Kaiser Permanente Vaccine Study Center, presented data on strokes among recipients of COVID-19 vaccines.The CDC on Jan. 13 announced it had identified a preliminary safety signal for the bivalent boosters . The signal, identified through the CDC's Vaccine Safety Datalink analysis, was an increased risk of ischemic stroke in bivalent booster recipients ages 65 and older.The analysis also found the risk was present in the Pfizer formulation but not in Moderna's, and that the signal was raised because of increased stroke risk in the 21 days following inoculation compared to the risk on days 22-42.In her presentation, Klein noted that the CDC first identified the safety signal in November 2022, and it had been consistent since then, although the rate ratio has attenuated over time. In the last week, the rate diminished such that it no longer met the signal threshold, Klein said.Later in the meeting, when asked if it would be prudent to separate the flu and COVID-19 vaccines for elderly people, the CDC's Dr. Tom Shimabukuro , responded:Commenting on Klein's presentation, Nass said, \"The FDA briefers produced only confusion about strokes.\"Klein told the committee the ischemic stroke signal \"doesn't stand out as extremely striking, unlike some other signals which we have seen, for example, myocarditis — it's an extremely strong signal that you can see without doing statistics.\"In a tweet, Prasad said adverse events like vaccine-induced immune thrombotic Thrombocytopenia and myocarditis were detected only because they have a \"massive elevation\" from baseline.Myocarditis was mentioned several times during the meeting, but most other adverse events came up only during public comment.Charging the FDA and Pfizer with failing to mention the lack of evidence supporting the bivalent vaccines, particularly for young men who are most at risk of myocarditis, Prasad tweeted:Increasing numbers of physicians, including Dr. Paul Offit , an FDA committee adviser and director of the Vaccine Education Center at the Children's Hospital of Philadelphia, discouraged bivalent boosters for young and healthy people.Several members of the advisory committee also raised concerns about recommending annual bivalent boosters for children given the lack of data.Chatterjee said: Dr. Rituparna Das, Ph.D. , Moderna's vice president of COVID-19 clinical development, told the committee the vaccine maker has a study called \"BabyCOV\" where they are testing the bivalent vaccines on 3 to 5-month-old babies at eight-week intervals with no placebo group.During Thursday's Q&A session, Dr. Hayley Gans pointed out that the rapid-cycle Vaccine Safety Datalink analysis conducted by the CDC and FDA, which found the stroke signal, looked only for particular predetermined safety signals.\"How, overall, are we also handling other potential ways that these vaccines are impacting our population?\" Gans asked the committee. \"Obviously we've heard some reports and there is some data out there. How are we addressing potential autoimmune and other entities that aren't amenable to the rapid cycle?\" she asked.The CDC's Shimabukuro responded, \"You're correct, in the Vaccines Safety Datalink analysis our outcomes are prespecified.\" However, he added, there are \"other systems to monitor outcomes beyond the rapid-cycle analysis outcomes,\" such as the Vaccine Adverse Events Reporting System ( VAERS ).He continued:Several vaccine-injured people shared their personal experiences and made pleas to the advisory council to halt the vaccine rollout during the public comment session.Only 2 of 16 commentators said they supported the FDA's proposal.They expressed outrage at the lack of response by regulatory agencies and frustration that \"the government doesn't compensate for vaccine damages or fund studies to treat them,\" as Justin Prince commented.A vaccine-injured ER nurse collaborated with Josh Guetzkow, Ph.D. , on a presentation showing the extensive injury signalsThe presentation included a wide range of safety signals, including a number of cardiovascular, thrombosis, neurological, menstrual hemorrhagic signals and pediatric signals and deaths. Dustin Bryce , with the Interest of Justice nonprofit, argued the FDA has no choice but to revoke the Emergency Use Authorization and stop the experimental shots today.Bryce said:He said the FDA's failure to inform the public about the scientific community's uncertainty about the risk-benefit analysis threatens the validity of informed consent.\"Community engagement is essential to establish and maintain trust and preserve the social order,\" he concluded.The advisory panel, in their subsequent discussions, largely ignored concerns raised during the public comment session, with the exception of Gans' question about adverse events not captured in the Vaccine Safety Datalink analysis.Watch Thursday's VRBPAC meeting here:", "opengraph": {"url": "https://www.sott.net/article/476833-FDA-advisers-vote-to-replace-original-COVID-vaccine-with-bivalent-boosters-despite-lack-of-clinical-trial-data", "type": "website", "title": "FDA advisers vote to replace original COVID vaccine with bivalent boosters despite lack of clinical trial data -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/669603/full/fda_advisers_covid_bivalent_va.jpg", "description": "Advisers to the U.S. Food and Drug Administration (FDA) on Thursday voted unanimously to replace the original Pfizer and Moderna primary series mRNA COVID-19 vaccines with the bivalent boosters designed to target Omicron variants. The bivalent...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "260", "embed_code": "<iframe width=\"560\" height=\"260\" src=\"//www.youtube.com/embed/ZjULNuSYfd0?wmode=opaque\" title=\"178th Meeting of Vaccines and Related Biological Products Advisory Committee - 1/26/2023\" frameborder=\"0\" allowfullscreen=\"\"></iframe>", "src": "//www.youtube.com/embed/ZjULNuSYfd0?wmode=opaque"}], "links": ["/image/s33/669603/full/fda_advisers_covid_bivalent_va.jpg", "https://www.amwa-doc.org/amwaleads2021/archana-chatterjee-md-phd/", "https://childrenshealthdefense.org/defender/vaccine-researcher-gregory-poland-tinnitus-covid-shot/", "https://childrenshealthdefense.org/defender/cdc-vaers-covid-vaccines-serious-injuries/", "https://childrenshealthdefense.org/defender/fda-study-covid-vaccine-blood-clot-elderly-et/", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-ends-surgeons-career/", "https://childrenshealthdefense.org/defender/julie-gamble-covid-vaccine-injury/", "https://childrenshealthdefense.org/defender/mrna-vaccines-covid-pots/", "https://childrenshealthdefense.org/defender/tennis-pro-jeremy-chardy-pfizer-covid-vaccine-injury/", "https://childrenshealthdefense.org/defender/fda-eight-months-produce-pfizer-safety-data/", "https://www.cnbc.com/2023/01/26/fda-advisors-recommend-using-covid-omicron-shots-for-all-doses.html", "https://childrenshealthdefense.org/defender/covid-boosters-no-human-trials/", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/wsj-covid-booster-fda/", "https://www.fda.gov/media/164699/download", "https://www.cnbc.com/2023/01/26/fda-advisors-recommend-using-covid-omicron-shots-for-all-doses.html", "https://www.fda.gov/about-fda/fda-organization/peter-marks", "https://www.nejm.org/doi/full/10.1056/NEJMc2213907", "https://childrenshealthdefense.org/defender/vaers-covid-vaccines-canadian-woman-dies-bivalent-booster-shot/", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://childrenshealthdefense.org/defender/covid-bivalent-booster-falls-flat-cdc-report/", "https://childrenshealthdefense.org/defender/cdc-children-systemic-reactions-covid-booster-et/", "https://childrenshealthdefense.org/defender/wsj-covid-booster-fda/", "https://www.fda.gov/media/164699/download", "https://flucop.eu/about-flucop/external-advisory-board/jerry-p-weir/", "http://www.vinayakkprasad.com/", "https://childrenshealthdefense.org/authors/meryl-nass-md/", "https://childrenshealthdefense.org/defender/", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7107e2.htm", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://nihrecord.nih.gov/2018/06/29/ncats-deputy-director-mcinnes-retires-after-29-years", "https://childrenshealthdefense.org/defender/fda-vaccine-advisors-waning-efficacy-boosters-vaccine-injured/", "https://childrenshealthdefense.org/defender/covid-nw-cdc-recommends-novavax-booster/", "https://nihrecord.nih.gov/2021/04/30/niaid-researcher-discusses-outcomes-covid-antiviral-studies", "https://divisionofresearch.kaiserpermanente.org/researchers/klein-nicola", "https://childrenshealthdefense.org/defender/cdc-ischemic-stroke-covid-bivalent-boosters-safety-signal/", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://my.clevelandclinic.org/health/diseases/24208-ischemic-stroke-clots", "https://www.eventscribe.com/2018/NFIDFallCVC/ajaxcalls/PresenterInfo.asp?efp=SUhOV09EUVQ0MjE2&PresenterID=491468", "https://childrenshealthdefense.org/defender/covid-vaccine-induce-myocarditis/", "https://twitter.com/VPrasadMDMPH/status/1618655899111006208", "https://covid19-sciencetable.ca/glossary/#thrombocytopenia", "https://www.paul-offit.com/about-paul-offit-md", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://www.linkedin.com/in/rituparna-das-49860796", "https://stanfordhealthcare.org/doctors/g/hayley-gans.html", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://childrenshealthdefense.org/defender/deaths-adverse-events-updated-covid-booster-shots-vaers/", "https://childrenshealthdefense.org/defender/cdc-vaers-covid-vaccines-serious-injuries/", "https://www.topnpi.com/tx1417251968/dr-justin-prince", "https://childrenshealthdefense.org/authors/josh-guetzkow/", "https://worldcouncilforhealth.org/multimedia/interest-of-justice/", "https://interestofjustice.org/"], "authors": [], "publish_date": null}