{"result_id": "272047", "URL": "https://www.sott.net/article/479212-The-mRNA-platform-What-it-is-what-it-means", "timestamp": "2023-04-25 17:07:49 CEST+0200", "meta": {"description": "Back in the spring of 2020 we learned that Operation Warp Speed was hard at work creating a vaccine faster than one had ever been created before. From the decades-long history of vaccine development, we knew that vaccines took 5 to 10 years to...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/479212-The-mRNA-platform-What-it-is-what-it-means", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "The mRNA platform: What it is, what it means --", "cleaned_text": "Never before were a human's own cells hijacked to create something that is supposed to attack the body.\n\n. Now the technology would use your own body to create an enemy that it then had to fight\n• Pharmaceutical companies: primarily Pfizer and Moderna. There are billions to be made, with a meal ticket into the foreseeable future. These companies are also so incestuous with government, former regulators working within, that they could easily push the relatively untested drugs out there.\n• The Biosecurity state: people within defense organizations, who see it as a mechanism of control, enabling the ability to track people's movements through vaccination cards. This happens if vaccine mandates happen.\n• Seekers of power: politicians and others (Bill Gates, the Davos crowd, etc.) desiring a mechanism to gain greater biological control over the population, and to be able to give or take away rights on command. This naturally leads to eugenics.\n\nBack in the spring of 2020 we learned that Operation Warp Speed was hard at work creating a vaccine faster than one had ever been created before. From the decades-long history of vaccine development, we knew that vaccines took 5 to 10 years to make. The subsequent clinical trials could take longer.How was this possible? When did this scientific leap take place? What was this fantastic new technology that would make such rapid development a reality?We quickly learned that the new vaccine would use something called mRNA technology. And there were several companies ready to make it happen.The way mRNA works is not like the way any vaccine worked before. Formerly, vaccines were created by taking a weakened or dead form of the virus and injecting that into humans. The human body would create antibodies to fight and beat the weakened virus, thus giving the body the instructions to create antibodies against it if the full force virus were to ever attack. The individual was immune.We saw this happen two years ago, comparing old and new versions of what they posted on their website.Here was the definition on the CDC website in 2020 The new version became much more general, to include mRNA. Here is the current definition on the CDC website:The first question you may ask is \"Why would the CDC want to make it seem like this is just a standard old familiar technology? Why do they feel like they have to call it a vaccine? Are they trying to trick us into feeling comfortable? Why?\"mRNA is not a traditional vaccine, but it's not new either. It is actually a thirty-year-old technology. You might remember there used to be this thing called \"gene therapy\" that no one talks about anymore. That's what category this belongs to.The original purpose of gene therapy was to give people the ability to have their own bodies produce something that they weren't producing naturally, something that their bodies needed, like insulin for diabetics. The purpose was to make up for a deficiency that the body could not generate on its own.But the technology had limitations. One thing that was noticed in the first few years of gene therapy is that it didn't work for long . Multiple doses had to be supplied, and the conditions in the body had to be right.Although this use of mRNA as a therapeutic has been around for decades, with some good and some disappointing resultsSuddenly, the technology went from a therapeutic to treat a minority of individuals with particular deficiencies to a drug that everyone in the entire world would take to combat a virus.When the mRNA Covid vaccine is injected into a person, it moves to the cells and creates the portion of the virus known as the spike protein, the active part of the virus that causes all the harm. The body reacts and fights it off. It's a biological Trojan Horse.So why would anyone expect this to work like a traditional vaccine, one that bestows immunity for many years, often a lifetime? We have already seen that this method often does not. Didn't the companies selling these drugs as a vaccine and the FDA know this from the beginning?This is a very old idea in virology, called original antigenic sin . Basically, your body gets tuned to the variant that you are fighting, and can't see new ones as well. Didn't the companies selling these drugs as a vaccine and the FDA know this from the beginning?Boosters, anyone?Not only that, they also had no idea of side effects, because they had never used this technology to create an antigen.So originally, the technology was developed to produce something your body needed that it wasn't producing. This had never been done before.What could the possible effects be? They didn't know.When the pandemic hit, the folks in the companies that make mRNA saw this as a huge opportunity. Moderna was founded in 2010 . Up until this point, they never talked about vaccines, only the therapeutics they were developing, which was their sole focus. Up until the bonanza of 2021, the company never made any money at all. Curiously, there is a huge overlap in the financial interests of high-ranking executives in Moderna and Pfizer and high-ranking officials in the FDA and CDC.What a boon for these companies! If they could pull it off, they would have a drug they could quickly create for new antigens, and keep selling them over and over. This is why it is called a new platform for drug delivery. It's a platform because it's one technology that can be used to quickly create a vaccine when new antigens appear.Suddenly, with fear of a dangerous pathogen in the air, opportunities abound.All of these varied interests, with varied agendas, now have a stake in making this platform work. The more people they can get on the platform, the better off their interests are served.So if the majority of the population is pushed into this through fear of a virus, all the better. We all know that fear is a great driver to motivate people and it serves to pressure any dissent to go along.Who are these agents?Think about this. Government agencies tried to force their citizens on a drug delivery platform. The penalties for non-compliance were ostracization, denial of the right to work, and prohibition to participate in society. They were in on it with rich and powerful individuals and companies. They would then introduce a mechanism to track our movements through vax cards, and control our activities.The mRNA gene therapy technology was a remarkable advancement with untold potential benefit for humanity. The interests of power have leveraged it into something inhumane and destructive.", "opengraph": {"url": "https://www.sott.net/article/479212-The-mRNA-platform-What-it-is-what-it-means", "type": "website", "title": "The mRNA platform: What it is, what it means -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/675364/full/Shutterstock_2256712783_800x46.jpg", "description": "Back in the spring of 2020 we learned that Operation Warp Speed was hard at work creating a vaccine faster than one had ever been created before. From the decades-long history of vaccine development, we knew that vaccines took 5 to 10 years to...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/675364/full/Shutterstock_2256712783_800x46.jpg", "https://brownstone.org/articles/governments-national-security-arm-led-the-covid-response/", "https://brownstone.org/articles/choice-quotes-from-bill-gatess-new-book/", "https://brownstone.org/articles/eugenics-then-and-now/", "https://web.archive.org/web/20200410192211/https://www.cdc.gov/vaccines/vpd/vpd-vac-basics.html", "https://www.cdc.gov/vaccines/vac-gen/imz-basics.htm", "https://www.news-medical.net/health/Gene-Therapy-Issues.aspx#:~:text=Other%20challenges%20faced%20in%20the,to%20provide%20a%20permanent%20cure.", "https://en.wikipedia.org/wiki/Original_antigenic_sin", "https://www.zippia.com/moderna-careers-1407747/history/"], "authors": [], "publish_date": null}