{"result_id": "272026", "URL": "https://www.sott.net/article/477596-Pfizer-vaccine-trial-fraud-charges-set-out-in-mainstream-press-for-first-time", "timestamp": "2023-04-25 17:07:37 CEST+0200", "meta": {"description": "I am pleasantly surprised to see the mainstream German publication Die Welt openly reporting that clinical trials of the Pfizer Covid vaccine were rife with alleged fraud. What a change! The article explains that Pfizer unblinded and removed...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/477596-Pfizer-vaccine-trial-fraud-charges-set-out-in-mainstream-press-for-first-time", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Pfizer vaccine trial fraud charges set out in mainstream press for first time --", "cleaned_text": "\n• Almost everyone was affected by Corona vaccinations. People were either vaccinated or discriminated against, with the extent of discrimination varying from country to country.\n• Covid vaccination harmed a significant fraction of vaccine recipients. The harms are numerous. A Thailand study found 29% of young males having subclinical heart damage, for example. I discussed (numerous times) immune system damage affecting vaccinated people who suffer Covid reinfections and endless other illnesses.\n• While many vaccinated individuals do not realise that Covid vaccines negatively affected them, they can be easily convinced that they are vaccine victims when presented with evidence.\n• Many vaccinated people had multiple Covid infections. If nudged, they will see the apparent disconnect between promises and the ugly reality.\n• Lawsuits against Big Pharma, and possibly against Google and Facebook, will, naturally, make many people consider whether they are also victims when financial compensation becomes a possibility.\n• People understandably fear death, and the excess mortality we are experiencing worldwide should unsettle any person whose risk of death is heightened in a mysterious, unknowable way.\n• Many political operators will realise they can build a career by being anti-Covid-vaccine and demanding retributions. While this has the potential of turning ugly, it is an important factor.\n• There is a possibility of mass hysteria created around \"will the Covid vaccine kill me\", which the above-mentioned political operators can turn to their advantage.\n\nI am pleasantly surprised to see the mainstream German publication Die Welt openly reporting that clinical trials of the Pfizer Covid vaccine were rife with alleged fraud . What a change!The article explains thatfrom the Covid vaccine trial. It also gives examples of Pfizer subjects whose deaths appear to have been covered up. One of the victims described by Die Welt is Pfizer subject C4591001 1162 11621327, whose story I unearthed in July of 2022.As you remember,Die Welt also describeswho remained alive, but whose sufferings were written off as \"anxiety.\"Note how Die Welt sarcastically puts \"rare side events\" in quotes.The newspaper finds more cases of apparent Pfizer fraud:While Die Welt does an excellent job at exposing Pfizer's alleged trial fraud, which the FDA appeared to want to hide for 75 years, most of what is discussed is not new to us.Die Welt mentions thatI expect this 'fraud waiver' to be litigated furiously in many countries of the world. In the United States, liability for certain misdeeds, such as fraud, cannot be waived in advance because it would \"violate public policy\" and encourage fraud. Thus, I expect Ed Dowd's 'fraud vitiates all contracts' doctrine to prevail legally in many localities.A question that many of us are asking is,. A friend of my Substack, Eugyppius, concludes with regret that \"there will be no Corona reckoning in Germany\".I am not an expert on German politics, but I would like to make a statement:which gives us a hint of the future.The governor of Florida, Ron DeSantis, is a shrewd political operator who expects to benefit from defending the public from Covid vaccines.I am optimistic that some reckoning and some punishments will happen. Consider this:The most important determinant of how much 'Covid reckoning' we will see is the future fate of humanity and the disturbing trends of excess mortality and infertility I want these trends to reverse and mortality and fertility to return to normal. That fortunate turn of events would necessitate only a moderately serious reckoning.In the highly undesirable case of the general public's health trends taking a turn for the worse, the more extreme measures against people who lied to us to force the public to take the deadly experimental vaccines may prove justified.So, do you think at least one country will see any 'Covid reckoning'?", "opengraph": {"url": "https://www.sott.net/article/477596-Pfizer-vaccine-trial-fraud-charges-set-out-in-mainstream-press-for-first-time", "type": "website", "title": "Pfizer vaccine trial fraud charges set out in mainstream press for first time -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/671750/full/1_Pfizer_Argentine_Lawyer_Augu.jpg", "description": "I am pleasantly surprised to see the mainstream German publication Die Welt openly reporting that clinical trials of the Pfizer Covid vaccine were rife with alleged fraud. What a change! The article explains that Pfizer unblinded and removed...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/671750/full/1_Pfizer_Argentine_Lawyer_Augu.jpg", "https://www.mdpi.com/2414-6366/7/8/196", "https://igorchudov.substack.com/p/yes-covid-vaccines-unset-and-erase", "https://igorchudov.substack.com/p/google-and-facebook-owe-compensation", "https://archive.is/m3snI", "http://igor.chudov.com/tmp/Die-Welt.pdf", "https://igorchudov.substack.com/p/pfizer-study-subject-c4591001-1162", "https://www.eugyppius.com/p/dont-be-fooled-by-dumb-talkshows", "https://igorchudov.substack.com/p/is-depopulation-we-are-seeing-planned"], "authors": [], "publish_date": null}