{"result_id": "272024", "URL": "https://www.sott.net/article/476315-FDA-vaccine-committee-member-calls-for-end-to-mass-Covid-vaccination", "timestamp": "2023-04-25 17:07:36 CEST+0200", "meta": {"description": "Dr. Paul Offit, a member of the U.S. FDA's vaccine advisory committee, has written in the New England Journal of Medicine, the world's top medical journal, calling for an end to the mass vaccination of anyone at low risk from the virus. In an...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/476315-FDA-vaccine-committee-member-calls-for-end-to-mass-Covid-vaccination", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "FDA vaccine committee member calls for end to mass Covid vaccination --", "cleaned_text": "Dr. Paul Offit, a member of the U.S. FDA's vaccine advisory committee, has written in the New England Journal of Medicine , the world's top medical journal, calling for an end to the mass vaccination of anyone at low risk from the virus. In an op-ed titled \"Bivalent COVID-19 Vaccines - A Cautionary Tale\", Dr. Offit writes that Covid boosters are \"probably best reserved for the people most likely to need protection against severe disease\".Dr. Offit, who is Professor of Vaccinology and Professor of Paediatrics at the University of Pennsylvania, goes through in detail the process that led toThe likely reason the bivalent vaccines failed is immune imprinting, Dr. Offit explains.When epidemiological data did become available, they showed very poor protection.The bivalent vaccine had very poor take-up and the variants it was targeted against were quickly gone.That Dr. Offit is only doing so now, and not with any recognition of any safety problems, is less welcome, of course. Still, he will likely not be thanked by his paymasters, and it is in the right direction, so he should receive credit for that.We still await the acknowledgement that the benefit of these vaccines was never favourable for people at low risk from the virus, who never needed them, and that their safety profile is far worse than the companies and regulators have led the public to believe.CNN reports that Dr. Offit is \"angry\" that Moderna failed to include unfavourable infection data in its submission to the FDA last year. \"I was angry to find out that there was data that was relevant to our decision that we didn't get to see,\" Dr. Offit said. According to CNN:", "opengraph": {"url": "https://www.sott.net/article/476315-FDA-vaccine-committee-member-calls-for-end-to-mass-Covid-vaccination", "type": "website", "title": "FDA vaccine committee member calls for end to mass Covid vaccination -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/668424/full/offit_750x375.jpg", "description": "Dr. Paul Offit, a member of the U.S. FDA's vaccine advisory committee, has written in the New England Journal of Medicine, the world's top medical journal, calling for an end to the mass vaccination of anyone at low risk from the virus. In an...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/668424/full/offit_750x375.jpg", "https://www.biorxiv.org/content/10.1101/2022.10.22.513349v1", "https://www.biorxiv.org/content/10.1101/2022.10.24.513619v1", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s", "https://dailysceptic.org/2022/12/13/u-s-government-has-been-planning-to-lockdown-and-wait-for-a-vaccine-since-2007/", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://edition.cnn.com/2023/01/11/health/moderna-bivalent-transparency/index.html"], "authors": [], "publish_date": null}