{"result_id": "272019", "URL": "https://www.sott.net/article/458400-The-conspiracy-theorists-were-right-It-IS-a-poison-death-shot", "timestamp": "2023-04-25 17:07:34 CEST+0200", "meta": {"description": "\"I'll do one more mind experiment with you: If everyone on the planet were to get Covid and not get treated, the death-rate globally would be less than half a percent. I'm not advocating for that, because 35 million people would die. However, if...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/458400-The-conspiracy-theorists-were-right-It-IS-a-poison-death-shot", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "The conspiracy theorists were right - It IS a 'poison-death shot' --", "cleaned_text": "Did the regulators at the FDA know that all previous coronavirus vaccines had failed in animal trials and that the vaccinated animals became either severely ill or died?Yes, they did.Did they know that previous coronavirus vaccines had a tendency to \"enhance the infection\" and \"make the disease worse\"?Yes.Did Dr Anthony Fauci know that coronavirus vaccines had repeatedly failed and increased the severity of the infection?Yes, he did. (See here: Fauci on ADE Did the drug companies conduct any animal trials prior to the FDA's approval that would have convinced a reasonable person that the vaccines were safe to use on humans?No, they didn't.Did they complete long-term clinical trials to establish whether the vaccines were safe?No, there were no long-term clinical trials.Did they conduct any biodistribution studies that showed where the substance in the injection goes in the body?They did, but the data was not made available to the public.Do the contents of the vaccine largely collect in various organs and in the lining of the vascular system?Yes, they do.Do large amounts of the substance accumulate in the ovaries?Yes.Will this effect female fertility and a woman's ability to safely bring a baby to term?The drug companies are currently researching this. The results are unknown.Does the vaccine enter the bloodstream and collect in the lining of the blood vessels forcing the cells to produce the spike protein?Yes.Is the spike protein a \"biologically active\" pathogen?It is.Does the spike protein cause blood clots and leaky blood vessels in a large percentage of the people that are vaccinated?It does, although the blood clots are mostly microscopic and appear in the capillaries. Only a small percentage of vaccinees get strokes or suffer cardiac arrest.Should people be made aware of these possible bad outcomes before they agree to get vaccinated? (\"Informed consent\")Yes.Did the FDA know that Pfizer had \"identified vaccine-associated enhanced disease, including vaccine-associated enhanced respiratory disease, as an important potential risk\"?Yes, they did, but they did not demand that Pfizer fix the problem. Here's more:Did the drug companies vaccinate the people in the placebo group after the clinical trials in order to conceal the difference in the long-term health outcomes between the two groups?That is the conclusion a rational person would make.So, they nuked the trials?Yes.Did the FDA largely shrug-off its regulatory duties and abandon its normal standards and protocols becausea- It wanted to rush the Covid vaccines into service as rapidly as possible?b- It knew the Covid-19 vaccine would never meet long-term safety standards?We don't know yet, but the adverse events report strongly suggests that the Covid-19 vaccine is hands-down the most dangerous vaccine in history.Is the FDA rushing the \"boosters\" without proper testing?Yes, it is. Here's a clip from author Alex Berenson's latest at Substack:Have the boosters been modified or improved to meet the changes in Delta variant?No.Is there any additional risk in taking a booster-shot after already taking two experimental gene-based vaccines in less than a year?Considerable risk. Here's more from the Doctors for Covid Ethics:So, it's the double-whammy. On the one hand, the booster will perform largely like the original vaccine, penetrating cells and forcing them to produce spike protein which, in turn, generates blood clots and leaky blood vessels. And, on the other, the newly-produced S proteins trigger a damaging immune response in which the complement system attacks and destroys the cells that line the inside of the blood vessels. Every additional booster will intensify this process weakening the vascular system and increasing the clotting. If the Doctors are correct in their analysis, then we could see a sharp uptick in all-cause mortality in the heavily-vaccinated countries in less than a year. Cardiac arrests are already rising.Here's another question that's worth mulling over: Was there any reason for the regulators at the FDA to think that these problems would not arise following the launching of the vaccine campaign?No. They should have known there would be problems as soon as they saw that the vaccine did not stay in the shoulder as it was supposed to. The vaccine wasn't supposed to enter the bloodstream and spread across the body leaving billions of spike proteins in its wake. (The spike protein is a cytotoxin, a cell killer. It is not an appropriate antigen for stimulating an immune response. It is a potentially-lethal pathogen that poses a threat to one's health even if it is separated from the virus.) Nor was the vaccine supposed to triggerwhich is the condition we hinted at above when referring to \"vaccine-associated enhanced disease\". Here's a brief explanation:Is this what we are seeing right now? In all the countries that launched mass-vaccination campaigns early (Israel, Iceland, Scotland, Gibraltar and UK) cases, hospitalizations and deaths are rising faster in the vaccinated portion of the population than the unvaccinated. Why?Are they really experiencing a fourth or fifth wave or have the vaccines generated \"inactivity-enhancing\" antibodies that make the disease worse? This 2-minute video helps to clarify what's going on:... With the Delta variant- when you are vaccinated .... the antibodies take the virus and help it infect the cells.\"This is ADE, and this is probably why hospitalizations and deaths are rising among the vaccinated in Israel, UK and the rest. True, the Delta variant is less lethal than the Wuhan virus but, unfortunately, that rule does not apply to those who have been vaccinated and whose antibodies promote the uptake of the virus into their cells. This increases the viral replication function that increases the severity of the disease. In short, people are getting sicker because they were vaccinated. Here's another short video that helps to explain:It's not the variant that intensifies the disease, it's the fact that the vaccine targets one narrow endpoint, the spike protein, that gradually adapts to survive. As the virus progressively learns to avoid the vaccine, vaccine-induced immunity wanes. Natural immunity produces broad, robust immunity to the whole virus not merely one part of it. It is strong and enduring.So how will the vaccinated fight new forms of the virus, after all, the vaccine is not a medicine that overpowers a particular pathogen. It is a subtle (genetic) reprogramming of the immune system that forces one's cells to produce a particular version of the spike protein. Boosters that stimulate production of the same protein will have only modest impact. In short, boosters are still fighting the last war.Also, as we mentioned above, coronavirus vaccines tend to create antibodies that \"enhance infectivity\" when they encounter adapted forms of the virus. That means that millions of inoculated people will now face forms of the virus for which they have almost no protection and for which their compromised immune systems can only provide limited help. Here's more from the article above:\"Blunder\", he says?It wasn't a blunder. It was deliberate. The Covid-19 vaccine was supposed to fail like all the coronavirus vaccines before it. That's the point. That's why the drug companies skipped the animal testing and long-term safety trials. That's why the FDA rushed it through the regulatory process and suppressed the other life-saving medications, and silenced all critics of the policy, and pushed for universal vaccination regardless of the risks of blood clotting, cardiac arrest, stroke and death. And that's why the world is on the threshold of an \"international catastrophe of mass mortality.\" It's because that's how the strategy was planned from the very beginning.The vaccine isn't supposed to work, it's supposed to make things worse. And it has! It's increased the susceptibility of millions of people to severe illness and death. That's what it's done. It's a stealth weapon in an entirely new kind of war; a war aimed at restructuring the global order and establishing absolute social control. Those are the real objectives. It has nothing to do pandemics or viral contagion.", "opengraph": {"url": "https://www.sott.net/article/458400-The-conspiracy-theorists-were-right-It-IS-a-poison-death-shot", "type": "website", "title": "The conspiracy theorists were right - It IS a 'poison-death shot' -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s31/621094/full/AntiVaxxMW_5x.jpg", "description": "\"I'll do one more mind experiment with you: If everyone on the planet were to get Covid and not get treated, the death-rate globally would be less than half a percent. I'm not advocating for that, because 35 million people would die. However, if...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["https://rumble.com/vkqs1o-dr.-zelenko-schools-israeli-rabbinic-court..html", "/image/s31/621094/full/AntiVaxxMW_5x.jpg", "https://doctors4covidethics.org/wp-content/uploads/2021/09/Letter-and-Notice-of-Liability-to-EMA-and-MEPs.pdf", "https://alexberenson.substack.com/p/are-you-kidding-me-pfizer-volume", "https://doctors4covidethics.org/wp-content/uploads/2021/09/Letter-and-Notice-of-Liability-to-EMA-and-MEPs.pdf", "https://sciencewithdrdoug.com/2020/08/01/is-a-coronavirus-vaccine-a-ticking-time-bomb/amp/?__twitter_impression=true&s=08", "https://rumble.com/vloa7j-must-watch-expert-testimony-on-mandatory-vaccination-and-medical-coercion.html", "https://twitter.com/gawjus_g/status/1428506270760321026", "https://sciencewithdrdoug.com/2020/08/01/is-a-coronavirus-vaccine-a-ticking-time-bomb/amp/?__twitter_impression=true&s=08", "https://youtu.be/DtkeRJZnCHs"], "authors": [], "publish_date": null}