{"result_id": "272037", "URL": "https://www.sott.net/article/476562-Pure-evil-Davos-attendee-Tony-Blair-calls-for-digital-vaccine-tracking", "timestamp": "2023-04-25 17:07:43 CEST+0200", "meta": {"description": "Former British Prime Minister Tony Blair said that global \"digital infrastructures\" are needed to monitor who is vaccinated as he predicted a \"slew\" of new vaccines to be introduced to the world in the next few years. Appearing at the annual...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/476562-Pure-evil-Davos-attendee-Tony-Blair-calls-for-digital-vaccine-tracking", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "'Pure evil' -- Davos attendee Tony Blair calls for digital vaccine tracking --", "cleaned_text": "Former British Prime Minister Tony Blair said that global \"digital infrastructures\" are needed to monitor who is vaccinated as he predicted a \"slew\" of new vaccines to be introduced to the world in the next few years.Appearing at the annual World Economic Forum meeting in Davos, Switzerland, Iraq War architect and former Labour Party Prime Minister Tony Blair said that even though the Chinese coronavirus has subsided in the public mind, governments must continue to develop digital tracking systems for vaccines, including for unspecified jabs for the \"world's most dangerous diseases\".\"You need the data, you need to know who has been vaccinated and who hasn't been. Some of the vaccines that come online will be multiple shots... so you've got to have a proper digital infrastructure and most countries don't have that,\" the former British prime minister said.\"I think there is a huge impetus for a national digital infrastructure, digitisation in healthcare is one of the great game changers, we should be helping countries develop a national digital infrastructure, which they will need with these new vaccines,\" he added, revealing that he has been lobbying the G20 nations to adopt this approach.Mr Blair lamented that the coronavirus is largely seen as a \"rearview mirror\" issue in the halls of power, but he said that the focus could be kept up by relaying to politicians that \"we are going to have a whole new slew of new vaccines, injectables that are going to deal with some of the worst diseases in the world that give us the opportunity to make big changes in the health of the world.\"\"If you want the politicians to focus, they need to think, this is coming down the track soon, because if you tell them about a future pandemic, they will go 'someone else's problem', but you tell them in the next few years you are going to have an opportunity to make a big difference in the health of your population that will focus them.\"Responding to Mr Blair's comments during his GB News prime time news programme,From the early days of the Wuhan virus crisis, Mr Blair injected himself into the mix, calling for a globalist wish list to be enacted to supposedly slow the spread of Covid.Just weeks after the first lockdown was put in place in Britain in 2020, Blair repurposed his think tank to focus on the pandemic, announcing that he has teams \" embedded in governments around the world\".Blair's think tank would go on to call for \"dramatically increased technological surveillance,\" saying it would be \"a price worth paying\" to confront the virus.The former prime minister has also been a keen advocate for people to take the Chinese coronavirus vaccinations, even going so far as to say that those who refuse to take the jab are acting like \"idiots\".Despite the lower risk to children for the virus, The Tony Blair Institute also drew criticism for calling for vaccines to be forced onto youngsters, including those of nursery school age", "opengraph": {"url": "https://www.sott.net/article/476562-Pure-evil-Davos-attendee-Tony-Blair-calls-for-digital-vaccine-tracking", "type": "website", "title": "'Pure evil' -- Davos attendee Tony Blair calls for digital vaccine tracking -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/669097/full/GettyImages_1087870576_2_640x4.jpg", "description": "Former British Prime Minister Tony Blair said that global \"digital infrastructures\" are needed to monitor who is vaccinated as he predicted a \"slew\" of new vaccines to be introduced to the world in the next few years. Appearing at the annual...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/669097/full/GettyImages_1087870576_2_640x4.jpg", "https://twitter.com/KurtZindulka", "https://www.breitbart.com/europe/2020/05/10/tony-blair-our-teams-are-embedded-in-governments-around-the-world/", "https://www.breitbart.com/europe/2021/09/19/tony-blair-says-govt-should-vaccinate-nursery-age-children-and-impose-vax-passes/"], "authors": [], "publish_date": null}