{"result_id": "272006", "URL": "https://www.sott.net/article/473732-Oxford-study-finds-negative-vaccine-effectiveness-against-Covid-hospitalisation-and-death", "timestamp": "2023-04-25 17:07:27 CEST+0200", "meta": {"description": "Back in spring 2021 the U.K.'s health agencies were in full swing, trying to get everyone in turn to take their free Covid vaccine. Back then, many people still believed that Covid was a serious threat to all of us, and as a result initial...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/473732-Oxford-study-finds-negative-vaccine-effectiveness-against-Covid-hospitalisation-and-death", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Oxford study finds negative vaccine effectiveness against Covid hospitalisation and death --", "cleaned_text": "\n• That individuals once vaccinated became carefree and started to exhibit behaviours that increased their risk of getting ill with Covid. I find this unlikely - it presumes that the unvaccinated chose to maintain a fear of Covid at the point where the vaccines became available. However all the evidence available to me suggests that instead in most cases they simply didn't consider themselves to have been at high risk from Covid even before vaccination started.\n• That the unvaccinated were more likely to have had a natural infection with Covid by spring 2021 and thus already had protection against severe disease. This is perhaps a reasonable suggestion - this also suggests that prior infection offers additional protection against hospitalisation and death compared with vaccination. It's unclear why this effect was not quantified and controlled for in the study as the data on prior infection status is presumably available.\n\nOf course, it is entirely plausible that the increase in risk of hospitalisation and death after vaccination is directly linked to the vaccines themselves. It is a little odd that the authors didn't explore this possibility in their paper.\n\nBack in spring 2021 the U.K.'s health agencies were in full swing, trying to get everyone in turn to take their free Covid vaccine. Back then, many people still believed that Covid was a serious threat to all of us, and as a result initial take-up was rapid and even younger age groups eagerly awaited their turn to take the elixir that would offer salvation. Back in those simple days there wasn't much need to explain the details of how exactly the vaccines would offer salvation - Covid was a serious disease and as such you really didn't want to catch it at all, and vaccines clearly would offer the necessary protection because of 'antibodies'.As time went on, however, it appeared that some 'foolish' people weren't in mortal fear of Covid, despite the best efforts of the nudge units to make it appear that Covid was killing a large proportion of healthy individuals. So the agencies changed tactics. If people weren't going to clamour for the vaccines, they'd use emotional blackmail and appeal for people to take their dose to 'protect granny' and to help our country reach 'herd immunity' so that we could eliminate Covid from our shores.This encouragement to get vaccinated for the good of us all remained for a few months, until, around summer 2021, the message started to shift towards taking the vaccine to protect oneself from hospitalisation or death. And, once it was realised that people still didn't care that much, to once again use peer pressure to embarrass people into getting vaccinated 'to reduce pressure on the NHS'. It might have been a different country, but President Biden's statement in mid-December 2021 is an excellent example of that propaganda at work:And so we get to our position today, where our authorities are surely breathing sighs of relief that the vaccines at least offer some protection from serious disease, if not infection and transmission.Which is just one reason why a recent paper from Oxford, Edinburgh and Swansea universities in the International Journal of Epidemiology on the risk of serious Covid or death by vaccination status is so very important.The paper analyses hospitalisations and deaths related to Covid in the populations of England, Wales, Scotland and Northern Ireland, comparing the impact of one or two doses of vaccine with the remaining unvaccinated population. It is quite a nice paper, and unlike most other epidemiological studies to date uses the 'Target Trial' study design. This data analysis method attempts to calculate what results would have been found had there been a full randomised trial undertaken at the initial vaccine rollout. Because the study was based on population-wide data there are many hundreds of thousands individuals' data in the analysis, even after attempts to match the characteristics of the vaccinated and unvaccinated. Given that there were no large-scale studies into the safety and effectiveness of the Covid vaccines when they were first given in large numbers during 2021, this type of 'emulation' of such a study is possibly as good an approach as we're going to get.The results of the analysis are, quite frankly, astounding.Here are their pooled results (all ages, all four countries) for the first dose of AstraZeneca vaccine:This is the relative risk of hospitalisation and death in the vaccinated compared with the unvaccinated. If the relative risk is less than 1 then this implies that there's a lower risk of hospitalisation and death in the vaccinated. Values greater than 1 suggest that the risk of hospitalisation and death is increased after vaccination. The analysis clearly shows an initial protective effect, which reverses at around 60-70 days post vaccination.Here are similar data for the first dose of the Pfizer vaccine:This appears to be a type of vaccine waning, but the authors point out that during this time there was a shift in the predominant variants (to Delta), and thus it could also reflect an interaction between the immune response to the vaccines and the ability of non-matching variants to cause serious disease.The data in the paper for the second dose of vaccine are a little more complex to interpret. Instead of estimating the risk of infection versus the unvaccinated, the study calculated the risk relative to those that had only received their first dose of vaccine. For these data the AstraZeneca vaccine also results in increased risk after around 70-80 days:The Pfizer vaccine, on the other hand, offered some additional protection compared with those who had only received their first dose of vaccine for the duration of the study period, staying below 1 - though appearing to be trending upwards towards the end of the period:To put some numbers to these estimates, at the 98 day point, the data in the study suggested that for the AstraZeneca vaccine the vaccine effectiveness (VE) in protecting against hospitalisation and death was approximately minus-89% after the first dose and that the second dose made this worse by minus-59%. For the Pfizer vaccine the respective VE estimates at the 100 day point were approximately minus-85% and plus-46%.I should point out that these are pooled VE estimates, but similar VE were seen across different age groups. The exception to this is that the study didn't include any data on care home residents nor those aged under 18 years of age - perhaps those individuals fared better after vaccination, or perhaps not.The paper itself suggests two possible reasons for their worrying results:There's an important point about the results of this study. These results are for the impact of the vaccines on hospitalisation and death related to Covid infection and the paper offers no information on the impact of side-effects of taking the vaccines. It has been suggested by multiple authors that the vaccine side-effects are tolerable given the benefits offered by the vaccines. This clearly isn't going to be the case if the vaccines don't offer protection from infection (or make infection more likely) and if they don't offer protection from hospitalisation and death (or make this more likely).I still remain amazed that there was no rigorous assessment of the safety and effectiveness of the vaccines as they were given to the population back in 2021 - the rulebook appears to have been thrown out of the window.One last final point. I started this post with a suggestion that the increased risk of hospitalisation and death related to Covid in the vaccination would be harmful to the reputations of our nation's authorities given the fervour with which they promoted the vaccines over the last two years. Of course, there's also the small matter of the thousands of additional hospitalisations and deaths that have occurred if the results of the study discussed in this post turn out to be generally applicable to the population. It remains an open question whether our authorities will consider the threat to their reputations to be the most important factor and ignore these emerging data, or if they'll choose transparency and immediately open an investigation into the potential for the vaccines to cause harm.Amanuensis is an ex-academic and senior Government scientist. He blogs at Bartram's Folly", "opengraph": {"url": "https://www.sott.net/article/473732-Oxford-study-finds-negative-vaccine-effectiveness-against-Covid-hospitalisation-and-death", "type": "website", "title": "Oxford study finds negative vaccine effectiveness against Covid hospitalisation and death -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/661382/full/pfizer_moderna_vaccines.jpg", "description": "Back in spring 2021 the U.K.'s health agencies were in full swing, trying to get everyone in turn to take their free Covid vaccine. Back then, many people still believed that Covid was a serious threat to all of us, and as a result initial...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/661382/full/pfizer_moderna_vaccines.jpg", "/image/s33/661384/full/rr_days_since_vax.png", "/image/s33/661385/full/rr_days_since_vax_II.png", "/image/s33/661386/full/rr_astrazeneca.png", "/image/s33/661387/full/rr_adjusted_pfizer.png", "https://academic.oup.com/ije/advance-article/doi/10.1093/ije/dyac199/6770060", "https://bartram.substack.com/"], "authors": [], "publish_date": null}