{"result_id": "272017", "URL": "https://www.sott.net/article/474992-Irreparable-vaccine-induced-harm-Open-Letter-to-the-New-Zealand-government", "timestamp": "2023-04-25 17:07:33 CEST+0200", "meta": {"description": "COVID-19 vaccine surveillance and pharmacovigilance data In my past professional life - probably a decade ago, I had a client named Dr. Charlton Brown. Dr. Brown, at the time, was CEO and co-innovator at Immune Targeting Systems Ltd (UK). I...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/474992-Irreparable-vaccine-induced-harm-Open-Letter-to-the-New-Zealand-government", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Irreparable vaccine-induced harm: Open Letter to the New Zealand government --", "cleaned_text": "\n• Download \"Negative vaccine effectiveness and vaccine failure associated with COVID-19 vaccination\"\n\nCOVID-19 vaccine surveillance and pharmacovigilance dataIn my past professional life - probably a decade ago, I had a client named Dr. Charlton Brown. Dr. Brown, at the time, was CEO and co-innovator at Immune Targeting Systems Ltd (UK). I always enjoyed working with Charlton, as we share a certain curiosity for science/knowledge and a dry wit. It turns out that Charlton has been part of the medical freedom resistance and has been working to get the word out about the risks of mRNA vaccines. Up until his email to me earlier this week, I had no idea.This isn't the first time that people from my \"former\" professional life have emailed me to let me know that they are supportive of what I have been doing. In fact, I had a former colleague from my time at the Salk Institute in the 1980s write to me to express their support for me this week. These emails always lift my spirits as sometimes this seems like a very lonely fight, although the people writing in the comments section of this Substack also let me know that Jill and I are not alone - and this community often saves me from my own dark musings about the state of the world.I have no idea how many scientists and physicians are quietly, sometimes secretly, questioning the public health policies in this country and globally. But I do know that dissidents of the new normal are slowly finding their voice and are speaking out.Anyway, Dr. Brown emailed me ask if I could share this document with people who might find it useful. As a trained scientist, Dr. Brown has conducted a deep analysis of the mRNA vaccines and origins of the virus and has created an \"evidentiary document\" (analysis) that is incredibly powerful.Published below is Dr. Brown's open letter sent to the prime minister and all ministers in New Zealand. Be sure to click on the link to read and save his full analysis for future reference.Link to theFrom: Dr. Charlton BrownDear: Rt Hon Jacinda Ardern, Prime Minister, Hon Andrew Little, Minister of Health, Hon Dr. Ayesha Verrall, Minister of COVID-19 Response, and Hon Peeni Henare and Hon Aupito William Sio, Associate Ministers of Health", "opengraph": {"url": "https://www.sott.net/article/474992-Irreparable-vaccine-induced-harm-Open-Letter-to-the-New-Zealand-government", "type": "website", "title": "Irreparable vaccine-induced harm: Open Letter to the New Zealand government -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/664983/full/Covid_passports.jpg", "description": "COVID-19 vaccine surveillance and pharmacovigilance data In my past professional life - probably a decade ago, I had a client named Dr. Charlton Brown. Dr. Brown, at the time, was CEO and co-innovator at Immune Targeting Systems Ltd (UK). I...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/664983/full/Covid_passports.jpg", "https://static1.squarespace.com/static/61910a2d98732d54b73ef8fc/t/638f34348dca010eadd0f4ef/1670329398788/EvidentiaryDocument_COVID19NationalLevelHarm_01122022.pdf", "https://static1.squarespace.com/static/61910a2d98732d54b73ef8fc/t/638f34348dca010eadd0f4ef/1670329398788/EvidentiaryDocument_COVID19NationalLevelHarm_01122022.pdf", "https://www.linkedin.com/in/carlton-brown-13b66232/", "https://orcid.org/0000-0003-4871-7521", "https://static1.squarespace.com/static/61910a2d98732d54b73ef8fc/t/638f34348dca010eadd0f4ef/1670329398788/EvidentiaryDocument_COVID19NationalLevelHarm_01122022.pdf", "https://grandsolarminimum.com/2022/12/01/vaers-toxic-covid-19-vaccine-lot-evidence/", "https://grandsolarminimum.com/2022/12/01/covid-19-vaccination-antibody-dependent-enhancement-of-virus-infection-and-vaccine-associated-enhanced-disease-evidence/"], "authors": [], "publish_date": null}