{"result_id": "272035", "URL": "https://www.sott.net/article/474840-Why-Has-the-Government-Never-Apologised-to-Those-Who-Took-the-Vaccine-To-Protect-Others-via-a-Herd-Immunity-That-Never-Came", "timestamp": "2023-04-25 17:07:42 CEST+0200", "meta": {"description": "From the very start the UKHSA Vaccine Surveillance Reports delighted in telling us all how many millions of people had been vaccinated. Clearly, it was considered an important aspect of the message that Government wanted to send to the...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/474840-Why-Has-the-Government-Never-Apologised-to-Those-Who-Took-the-Vaccine-To-Protect-Others-via-a-Herd-Immunity-That-Never-Came", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Why Has the Government Never Apologised to Those Who Took the Vaccine 'To Protect Others' via a Herd Immunity That Never Came? --", "cleaned_text": "Alas, it turned out that the vaccines haven't offered meaningful protection from infection, and thus onward transmission, and 'herd immunity' is a phrase that appears to have entered the memory-hole.\n\nThat reminds me of the\n\nundertaken in 2020 where the surveyed population believed that 7% of the U.K. population had died of (or with) Covid, whereas the reality was less than 0.1% of the population had died,\n• The NHS NIMS estimated that there were 3,626,033 individuals in this age category at that time, leaving 335,878 unvaccinated (or about 10% of the population in this age group).\n• The ONS estimated that there were 3,196,813 individuals in this age category. This resulted in the embarrassing situation where there were 93,342 more individuals vaccinated than were in the population. The NHS got around this problem by simply stating that 100% of the population in this age group were vaccinated and kept quiet about the details.\n\nFrom the very start the UKHSA Vaccine Surveillance Reports delighted in telling us all how many millions of people had been vaccinated. Clearly, it was considered an important aspect of the message that Government wanted to send to the population. Week by week, the numbers vaccinated climbed ever higher, indicating that increasing numbers were now protected from infection by the tried, tested, safe and effective vaccines... And the nation waited with baited breath for the moment that we would achieve the much heralded herd immunity that would mean that our nation would be free from the scourge of Covid.This aspect of the report was discontinued in April of this year, a month that saw a Covid wave peaking at around 7% of the population of the U.K. concurrently infected with Covid.The UKHSA's final graph of vaccine coverage in that April 2022 report showed that uptake had flatlined for most age groups.Did the UKHSA finally stop publishing the vaccine update graphs in their Vaccine Surveillance Report because they had ceased to serve their purpose? The lack of any significant increase in vaccination uptake would surely be interpreted by the 'vaccine hesitant' that there were significant numbers who like them were also resolute in their determination to avoid the Covid vaccines. Nevertheless, the vaccine coverage data live on in the national flu and COVID-19 surveillance reports . I find this shift to a new venue rather odd, because while I could accept that a report on vaccine surveillance might include vaccine coverage, there's less reason for it to be included in a report on disease incidence. Even odder is that while the UKHSA devotes 13 pages out of 84 (15%) on coverage of the Covid vaccines, there's only 1½ pages devoted to coverage of the influenza vaccines. I'd have thought that the influenza vaccine uptake data would be equally as important as the Covid vaccine uptake data in a 'flu and COVID-19 surveillance' report. We're currently hearing ever more frantic noises about the importance of getting both the bivalent boosters and the influenza vaccine.I've already touched on the fact that the initial cries for all to be vaccinated were based on achieving herd immunity. This was based on 'science', given that effective vaccines that reduce the risk of infection to near zero do offer the means to dramatically reduce the prevalence of a disease to near zero once the herd immunity threshold has been reached. In late 2020 this aspect of the Covid vaccination strategy was discussed in a paper by world expert (and former Chief Scientific Officer of the U.K. Ministry of Defence) Professor Roy Anderson. In this paper he discussed how herd immunity might be gained, the impact of a short duration of immunity (as short as 18 months of near complete protection!) and how the vaccines might be targeted to different parts of the population. Of particular note in this paper are the recommendation for an extended period of rigorous vaccine surveillance:Of course, these rigorous studies are conspicuous by their absence, with mainly lower quality 'observational' studies having been undertaken.These individuals have also remained quiet about the value in striving to achieve very high vaccination rates if the vaccines don't offer protection from infection (no herd immunity possible) and at best only offer protection from hospitalisation or death (both very low risks for the non-vulnerable population).The appeals to 'get vaccinated' slowly changed from 'protect yourself' to 'protect granny' and then to 'protect the NHS', without any real explanation to the public as to why these messages had to change. I have given up thinking that it is odd that our authorities haven't apologised to all those who took the experimental vaccines only 'to protect others' - indeed, the situation is actually that the vaccines were rolled out to achieve herd immunity and it is only by a fluke that they've turned out to offer some protection against hospitalisation and death. Our authorities are, of course, very keen to tell everyone that the vaccines were always intended to achieve this end result, even with very little evidence from the original vaccine trials that this was occurring.I sometimes wonder why anyone under the age of 60 or so is getting vaccinated at the moment. I believe that it might be a vaccination inertia effect, where people are simply doing what they did before without bothering to ask themselves why they're doing it. Perhaps this vaccination inertia effect will cease soon.I'm sure that the 'would have been worse' individuals are surprised that any unvaccinated individuals have survived this Covid pandemic at all.and this was heavily biased towards the most elderly and other vulnerable, which is relevant because it highlights that most of the population weren't at high risk from Covid in the first place. Again, it has been forgotten that so many people were misled, and that official sources of information didn't try to rectify this misunderstanding at the time.My final point on the the vaccination uptake data is perhaps the most important aspect that should be discussed, although it isn't actually about the numbers vaccinated, but about how many people in the U.K. remain unvaccinated? The data that we have on the numbers vaccinated are probably fairly robust (albeit there are questions surrounding those that paid to get their vaccine passport without getting vaccinated, or whether there were those that had contacts in the NHS who could 'pretend' to inject them with 'their free dose'). However, the question of the number that are unvaccinated at any point in time is much more complex to answer. On the face of it, this appears simple - those in the population who aren't vaccinated are the unvaccinated ones.The problem is that we don't seem to have a good understanding of how many people there are in the U.K. Most official estimates use the population estimate provided by the Office for National Statistics, based on returns from the 2020 census plus a modelled estimate of how the population might have changed since that point. However, this estimate appears to be lower than other estimates of the population's size - for example, the number of people in England aged over 18 is estimated by the ONS to be approximately 44,450,000 (estimate from July 2022), while the number registered with the NHS aged over 18 and who are eligible to receive a vaccine dose is approximately 50,850,000 (also from July 2022). What's more, some independent parties estimate an even higher population - from supermarket estimates based on the quantity of food sold to estimates from water-companies based on how much faeces that food turns into, estimates of the population size stubbornly keep on exceeding the ONS's estimate. Quite how we have such a poor estimate of the population of the U.K. is beyond me - you'd think it would be highly important when it comes to many aspects of managing the U.K., from the provision of social services to planning how many roads we need to have. Nevertheless, this is the situation we find ourselves in - perhaps our Government finds it convenient to have unreliable data on the population size?While this difference in population estimate might appear to only have a small impact on the estimates of the numbers remaining unvaccinated in the U.K., it becomes important given the very high proportion of the population that have received a dose of Covid vaccine. For example, the NHS reported that it had given 3,290,155 first doses of Covid vaccine (of all types) to those in England aged between 60 and 64 by the end of June 2022:Many of the official measures of how well the vaccines were doing used the lower estimate (based on ONS data) of the population size, and thus estimated a very low number of unvaccinated. This had the effect of making Covid cases, hospitalisations and deaths appear to be occurring at much higher rates in the unvaccinated than was probably the case - results that have been enthusiastically promulgated in reports of vaccine effectiveness by our various authorities. This impact of uncertainty in the number of unvaccinated has been covered in many blog posts, but possibly the most rigorous assessment of the problem has been covered by Professor Norman Fenton in his various scientific papers and blog posts - they're well worth a read.In my next post I'll discuss an aspect of the vaccine that appears to be a direct consequence of high vaccination levels - the rise of the Covid variants.", "opengraph": {"url": "https://www.sott.net/article/474840-Why-Has-the-Government-Never-Apologised-to-Those-Who-Took-the-Vaccine-To-Protect-Others-via-a-Herd-Immunity-That-Never-Came", "type": "website", "title": "Why Has the Government Never Apologised to Those Who Took the Vaccine 'To Protect Others' via a Herd Immunity That Never Came? -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/664551/full/xherd_750x375_png_pagespeed_ic.jpg", "description": "From the very start the UKHSA Vaccine Surveillance Reports delighted in telling us all how many millions of people had been vaccinated. Clearly, it was considered an important aspect of the message that Government wanted to send to the...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/664551/full/xherd_750x375_png_pagespeed_ic.jpg", "/image/s33/664552/full/ximage_79_png_pagespeed_ic_yzQ.jpg", "https://dailysceptic.org/2022/10/29/oxford-study-finds-negative-vaccine-effectiveness-against-covid-hospitalisation-and-death/", "https://www.kekstcnc.com/insights/covid-19-opinion-tracker-edition-4", "https://bartram.substack.com/", "https://bartram.substack.com/subscribe", "https://www.gov.uk/government/publications/covid-19-vaccine-weekly-surveillance-reports", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1072064/Vaccine-surveillance-report-week-17.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1072064/Vaccine-surveillance-report-week-17.pdf", "https://www.gov.uk/government/statistics/national-flu-and-covid-19-surveillance-reports-2022-to-2023-season", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7836302/", "https://www.england.nhs.uk/statistics/statistical-work-areas/covid-19-vaccinations/covid-19-vaccinations-archive/", "https://www.normanfenton.com/blog"], "authors": [], "publish_date": null}