{"result_id": "272012", "URL": "https://www.sott.net/article/473475-EU-sets-out-commitment-to-lockdowns-vaccine-passports-mask-mandates-and-legally-binding-global-pandemic-treaty", "timestamp": "2023-04-25 17:07:30 CEST+0200", "meta": {"description": "The European Union has set out its commitment to the continued use of lockdowns, mask mandates, vaccine passports and other restrictions this winter to control the spread of COVID-19, and also to the creation of a \"legally binding\" global...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/473475-EU-sets-out-commitment-to-lockdowns-vaccine-passports-mask-mandates-and-legally-binding-global-pandemic-treaty", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "EU sets out commitment to lockdowns, vaccine passports, mask mandates and 'legally binding' global pandemic treaty --", "cleaned_text": "\n• Continue national COVID-19 vaccination strategies using the currently available vaccines to reduce hospitalisations, severe disease and death.\n• Close vaccination coverage gaps. Improving vaccine uptake of the primary vaccination course and first booster dose among eligible individuals, including eligible children and adolescents according to national vaccination schedules, remains a priority. This is of particular importance for population groups at higher risk of severe outcomes and for countries with lower vaccination rates.\n• Maintain sufficient vaccination capacities, either by reactivating vaccination centres or by using other resources, such as general practitioners.\n• Prioritise the administration of an additional booster dose (second or subsequent) for specific population groups: people aged 60 years and over and individuals of any age at risk of severe disease (e.g. individuals with underlying comorbidities, immunocompromised individuals and pregnant women). The boosting of healthcare workers and long-term care facility personnel should also be considered. Subsequent boosters could be administered as early as three months after the previous one, and priority should be given to people who received their last booster more than six months ago.\n• Closely monitor the effectiveness and safety of the [new and] adapted vaccines once widespread rollout commences. If needed, national vaccination strategies should be adapted when more evidence on the performance of these vaccines becomes available.\n• Implement and, if possible, coordinate effective communication initiatives and strategies to promote uptake of additional vaccine doses, and promote completion of the primary series by those who have not yet done so. Clear information should be provided around the rationale for recommendations, and the benefits of the primary course and boosters for different population groups, including for those who already had the disease.\n• Ensure that capacity is in place to regularly update public communication strategy, based on epidemiological developments, changes in the public's perceptions and attitudes of the ongoing pandemic and COVID-19 vaccination, including the capacity to monitor and swiftly respond to false or misleading information.\n• Increase vaccine confidence by monitoring and addressing the public's questions and concerns, explaining the science behind the recommendations and debunking mis- and disinformation in the mainstream media and on social media. Clear, consistent, and evidence-based messaging demonstrating the continued safety and effectiveness of COVID-19 vaccines is key. Target hard-to-reach population groups through tailored communication and draw on health professionals and community leaders as trusted sources of information.\n• Address the political dimension of vaccine hesitancy and disinformation campaigns linked to anti-Western and anti-EU narratives. Particular challenges include channels where disinformation is circulating in relation to other crises, especially the Russian military aggression against Ukraine.\n\nThe European Union has set out its commitment to the continued use of lockdowns, mask mandates, vaccine passports and other restrictions this winter to control the spread of COVID-19, and also toThe document, published on September 2nd and titled \" EU response to COVID-19: preparing for autumn and winter 2023 \", was prepared by the EU Commission (the EU executive) and sent to the EU Parliament.On lockdowns and other restrictions, it proposes a framework ofThese indicators include severe disease and hospital occupancy data, and importantly are stated tmaking this potentially part of normal winter disease management, continuing indefinitely.It suggestsgiving a preference for FFP2 masks. [Face mask] use in closed public spaces, including public transport, can be a first option to limit community transmission. Recent evidence shows that FFP2 face masks, which are readily available in the EU/EEA, have a stronger protective effect than medical masks or cloth masks in the community. Member States are therefore strongly encouraged to consider their use in specific settings.The document recommends thebefore any rise in infections to try to avoid the \"need for more disruptive ones such as lock downs, closing businesses and schools, stay-at-home recommendations and travel restrictions\". It stresses the need forOther measures such as working from home or limiting the size of mass gatherings have proved effective to limit transmission of the virus. When implemented ahead of increases in cases, these measures can avoid the need for more disruptive ones such as lock downs, closing businesses and schools, stay-at-home recommendations and travel restrictions.Political commitment and community engagement are key for the success and the effectiveness of non-pharmaceutical measures. The one welcome aspect of the document was thethough even here school closures were not ruled out. The COVID-19 pandemic has disrupted the lives of children and adolescents affecting their everyday routines, education, health, development and overall well-being. It is therefore important to keep in mind the negative impacts of school disruptions on the health and development of children. The implementation of measures at schools should be aimed to be kept at a minimum and the further loss of learning should be prevented.The documentHowever, it recommends(i.e., vaccine passport, though it also recognises natural immunity) wherever travel restrictions are \"necessary\", boasting about how widely it is already used. Member States can make use of the EU Digital Covid Certificate in case the epidemiological situation this autumn and winter makes it necessary for countries to temporarily reintroduce travel restrictions. The EU Digital Covid Certificate Regulation, which has been extended until June 2023, provides the necessary framework to manage the impact of restrictions on free movement and to facilitate travel. It ensures that citizens can benefit from interoperable and mutually accepted certificates of COVID-19 vaccination, test and recovery. In principle, holders of valid EU Digital Covid Certificates should not be subject to any additional restrictions when travelling within the EU.The EU Digital Covid Certificate has been a major success in providing the public with a tool that is accepted and trusted across the EU (and in several third countries) and in avoiding fragmentation of multiple national systems. As of August 1st 2022, 75 countries and territories from across five continents are connected to the EU Digital Certificate system (30 EU/EEA Member States and 45 non-EU countries and territories), and several more countries have expressed interest in joining the gateway or are already engaged in technical discussions with the Commission. This makes the EU Digital Covid Certificate a global standard.The EU Digital COVID Certificate system is sufficiently flexible to adapt to the evolution of the COVID-19 response. Possible adaptations to the validity period of certificates issued for the first booster may become necessary in light of further scientific evidence and the evolution of the pandemic.What's the point of restricting the travel of the unvaccinated (or not-sufficiently-vaccinated) when the vaccinated are no less likely to spread the disease? This key question is entirely unaddressed.These include the \"priority\" of encouraging(that's right, for the extinct Covid strains) among all eligible children and adolescents, and an action point of(don't they have anything else to do?). It suggests administeringimplying they are little use after six months.It alsoto ensure \"clear, consistent and evidence-based messaging demonstrating the continued safety and effectiveness of COVID-19 vaccines\".The vaccine action points include (emphasis mine):The document emphaticallyLastly, the EU believes it is vitally important to build on the lessons learned from the COVID-19 pandemic and to strengthen the global health architecture - with a reinforced WHO at its centre. The EU is determined to be a driving force in the negotiations on a new, legally binding, international agreement on pandemic prevention, preparedness and response and on targeted amendments to strengthen theThese complementary processes are a priority for the EU and provide a historic opportunity to find multilateral solutions to common challenges, based on the principles of collective solidarity, equity, fairness, inclusiveness and enhanced transparency.Moreover, the newto which Team Europe has already pledged at least €588 million, will provide funding to support pandemic prevention, preparedness and response, including the implementation of the amended International Health Regulations and the new international agreement on pandemic prevention, preparedness and response.The document also trailswhich \"will provide the political framework with priorities, governance and tools,and making the most of Team Europe's capacity to protect and promote health globally\".For those of us who still hold to the evidence-based pandemic strategies of pre-2020, premised only on mitigating impacts by expanding emergency healthcare capacity and finding safe and effective treatments, and not imposing intrusive, harmful and unproven methods of trying to prevent the spread of a disease that is anyway harmless to most people, this bodes ill indeed for the current direction of travel in Europe and globally.", "opengraph": {"url": "https://www.sott.net/article/473475-EU-sets-out-commitment-to-lockdowns-vaccine-passports-mask-mandates-and-legally-binding-global-pandemic-treaty", "type": "website", "title": "EU sets out commitment to lockdowns, vaccine passports, mask mandates and 'legally binding' global pandemic treaty -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/660755/full/1_European_Union_headquarters_.jpg", "description": "The European Union has set out its commitment to the continued use of lockdowns, mask mandates, vaccine passports and other restrictions this winter to control the spread of COVID-19, and also to the creation of a \"legally binding\" global...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/660755/full/1_European_Union_headquarters_.jpg", "https://health.ec.europa.eu/system/files/2022-09/2022_covid-19_prep-autumn-winter_en.pdf"], "authors": [], "publish_date": null}