{"result_id": "272042", "URL": "https://www.sott.net/article/475736-The-government-reports-that-inadvertently-told-the-truth-about-COVID-vaccine-failure", "timestamp": "2023-04-25 17:07:46 CEST+0200", "meta": {"description": "As I write these words I see that daylight is dimming, reminding me that it is the shortest day of the year. The winter solstice traditionally marks the start of the 10 day period when we take time off work to visit relatives and engage in...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/475736-The-government-reports-that-inadvertently-told-the-truth-about-COVID-vaccine-failure", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "The government reports that inadvertently told the truth about COVID vaccine failure --", "cleaned_text": "Alas, we've gone far beyond the realms of 'trust the science' and it is clear that no-one in authority is allowed to even whisper the potential for the vaccines to have made things worse.\n\nThis chart suggests that for those aged over 50 there might be a short period of vaccine effectiveness, but this is soon followed by a period of significantly increased risk of hospitalisation which gradually reduces over a 12 month period.\n\nAs I write these words I see that daylight is dimming, reminding me that it is the shortest day of the year. The winter solstice traditionally marks the start of the 10 day period when we take time off work to visit relatives and engage in general revelry before the arrival of the annual 'collapse of the NHS' that'll take us through to the start of springtime. This year to join in with relative newcomer COVID-19 once again demonstrating its ability to re-infect everyone, we've got an influenza outbreak that looks set to rival that of 2010-11, high incidence of RSV, Strep-A threatening the old and young and perhaps a touch of human metapneumovirus to keep us on our toes. In the past few years we've also had a new tradition, where a senior representative of the U.K.Government is chosen to tell everybody to refrain from enjoying themselves over the holiday period in order to save the NHS, and to remind all to try to receive as many vaccines as their arms can handle - we've not had this yet this year, but I note that there's still time for our authorities to slip it in before Christmas Eve. Given the imminent collapse of the NHS, perhaps it is a good time to discuss how well the Covid vaccines have been helping to reduce infections, hospitalisations and deaths from Covid, according to the data in the UKHSA's Vaccine Surveillance Report.It wasn't until early September 2021 that the UKHSA started to include actual vaccine surveillance data in the Vaccine Surveillance Report My favourite theory is that someone in authority, ignorant of the complexities of the immune system (that's the vast majority of those in authority, if not all of them), demanded that the data be included to show the population how well the vaccines were bound to be performing...In that first reporting of real-world incidence data by vaccination status, the UKHSA put only a small paragraph to remind readers that you mustn't simply look at the data and infer how well the vaccines are doing:Of course, that final sentence is correct in that there are a multitude of reasons why raw data shouldn't be interpreted simply. However, data based on population-wide testing tends to at least offer a strong indication of what is really going on.After a few more weeks of the apparent deterioration of the vaccines' protection, the UKHSA gave up on the helpful charts (presumably they were too easy to interpret how bad things were getting), but they were still publishing raw data in tabular form and they continued to include ever more text warning of the dangers of interpreting these data 'at face value'. By November 2021 the UKHSA had resorted to including a stern warning in bold in its section on real-world data:Again, their polite request not to look at the real-world data with an open mind hid the real problem - that they preferred to believe that it was the real world that was wrong and that their cleverly constructed experimental studies that were right (despite there being a lack of evidence supporting these experiments' core assumptions, as described in an earlier post ).The final tables on real-world incidence data came at the end of March 2022:Of course, the UKHSA were keen to suggest that the differences seen between vaccinated and unvaccinated infection rates were actually due to... well, anything that they could think of that wasn't 'the vaccines':The UKHSA authors were correct to point out some potential reasons for the very high incidence of Covid in the unvaccinated population, but they left one potential reason out: that they'd used a poorly tested vaccine that might have resulted in an increase in the risk of infection, a.k.a. negative vaccine effectiveness. To include this potential reason would have been supported by prior research into candidate vaccines for coronaviruses (including SARS and MERS).We're now nine months from that last table of real world data on Covid infection by vaccination status, and in the meantime studies from from around the world continue to suggest that the vaccines increase the risk of Covid infection.Perhaps if the UKHSA had been more interested in having an open mind compared with its 'it's anything but the vaccines' attitude towards the data it presented there might have been more caution taken with the vaccine rollout and as a consequence we might currently be seeing far fewer than 1 in 20 of the population concurrently infected with Covid I'd also note (yet again) that the 'test-negative case control' method discussed at length in a previous post will give misleading indications of vaccine effectiveness if the vaccines are associated with an increase in 'similar to, but not Covid' infections.To put it plainly, on a single day (December 19th) around 0.4% of the population developed a new non-Covid respiratory illness ('cold'), while around 0.15% of the population developed a new Covid infection - are the vaccines also responsible for a general decrease in immunological protection from other diseases? I have previously discussed some of the potential complex side-effects of the vaccine. Yet another is the potential for the vaccines to generate autoantibodies against interferons, chemicals produced by the body as an early immune response to viral and other infections.Interferons also act to modulate the innate and adaptive immune responses, so an impaired response might also impact on the risk of bacterial infection. Note that if this is occurring then all in the population would be impacted by increased infection levels given that some in the population would have an increased propensity to become infected and thus infect others.This is yet another aspect of the impact of the Covid vaccines on the immune system that deserves much more scientific investigation than has been undertaken to date.The table of infections by vaccination status presented a little earlier in this post does, of course, show more than just the infection data. An important aspect of the vaccines is their supposed protection against hospitalisation and death. Back in April 2021 the vaccines certainly appeared to offer significant protection against the most serious of outcomes.It is important to point out something largely ignored by the Vaccine Surveillance Reports. What is clear from the graphs above is the significant effect of age on the risks from a serious outcome following an infection with Covid; those aged under 50 were always at a lower risk of hospitalisation and death. Beyond that, these raw data don't take into account morbidities. Even the lower rates of hospitalisation and death seen in those aged under 50 hide the fact that very few healthy younger adults ended up in hospital as a result of Covid and even fewer died - the problem was with those younger adults who had significant morbidities (that's not to dismiss the risk to the vulnerable, but the mantra that 'everyone is at risk' was unhelpful). It is also unclear regarding the impact of any 'healthy vaccinee' effect in those early months (i.e., because individuals 'close to death' weren't given the vaccine, and were more likely to have a serious outcome from what would be a benign infection in a healthy individual).The other aspect of the data not entirely clear from those charts is the significant reduction in risk seen with time. The UKHSA data suggest that the risk of hospitalisation and death saw a 10-fold fall in the seven months between September 2021 and March 2022. The claimed effectiveness of the vaccines at protecting against these serious outcomes must be interpreted with these lower absolute risks in mind. Is a vaccine with a 50% effectiveness at protecting against hospitalisation and death offering much real-world value if the risk of hospitalisation and death faced by an unvaccinated individual is relatively low compared with day-to-day risks?Even if the vaccines once offered protection against hospitalisation and death, is it still the case? Since August 2022 the Vaccine Surveillance Reports have been including real-world data on hospitalisations from the UKHSA's Severe Acute Respiratory Infection (SARI) Watch system. In November's report these data suggest the following hospitalisation figures for the subset of hospitals included in the SARI-Watch data:Oddly, the UKHSA data table didn't include any data on the proportions vaccinated in the SARI-Watch areas, only the proportions hospitalised by vaccination status - I've included the proportions vaccinated for England in the table above, which should be close enough for comparative purposes.The section covering the SARI-Watch data also includes charts for the proportion of hospital admissions by the period of time since each admitted individual's last dose of vaccine. The most recent chart is shown below.Even worse, for those aged under 50, these data suggest that the vaccines offer an immediate increase in risk, albeit there appears to be a silver lining in that the risk soon dissipates.Are the U.K. experts responsible for advising Government paying any attention whatsoever to these real-world data?Looking back from where we have ended up, it should be fair to ask whether there was ever any benefit in vaccinating those at low risk from Covid. Even given the uncertainties surrounding the Covid vaccines in early 2021, would we have gained nearly all of the supposed benefits by vaccinating only those most vulnerable? If we had taken this approach then the potential risks of the vaccines wouldn't have affected the majority of the population. Indeed, if we are indeed seeing negative vaccine effectiveness, then we will likely be having much larger Covid waves that could well be resulting in more hospitalisations and deaths in the vulnerable, compared with if we'd vaccinated only those individuals actually at risk from Covid.That brings us to the end of this series of posts reviewing the UKHSA's Vaccine Surveillance Report - a document released by Government when we needed it most, but which delivered as little as it could beyond the propaganda value.I hope you've enjoyed reading the instalments over the weeks. Oh, and do enjoy your Christmas break, no matter the attempts of our Government to spoil it.Amanuensis is an ex-academic and senior Government scientist. He blogs at Bartram's Folly - subscribe here", "opengraph": {"url": "https://www.sott.net/article/475736-The-government-reports-that-inadvertently-told-the-truth-about-COVID-vaccine-failure", "type": "website", "title": "The government reports that inadvertently told the truth about COVID vaccine failure -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/666745/full/xcovid_19_vaccine_mixing_shutt.jpg", "description": "As I write these words I see that daylight is dimming, reminding me that it is the shortest day of the year. The winter solstice traditionally marks the start of the 10 day period when we take time off work to visit relatives and engage in...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/666745/full/xcovid_19_vaccine_mixing_shutt.jpg", "/image/s33/666737/full/image_78.png", "/image/s33/666738/full/image_79.png", "/image/s33/666739/full/image_80.png", "https://dailysceptic.org/2022/12/21/covid-infection-risk-increases-with-number-of-vaccine-doses-by-up-to-300-study-finds/", "https://health-study.joinzoe.com/data", "/image/s33/666740/full/image_81.png", "https://www.youtube.com/watch?v=PwJCFsW0RZE", "/image/s33/666741/full/image_82.png", "/image/s33/666742/full/image_84.png", "/image/s33/666743/full/image_85.png", "/image/s33/666744/full/image_86.png", "https://www.gov.uk/government/publications/covid-19-vaccine-weekly-surveillance-reports", "https://dailysceptic.org/2022/11/10/the-implausible-modelling-behind-the-claims-in-the-ukhsa-vaccine-surveillance-reports/", "https://health-study.joinzoe.com/data", "https://dailysceptic.org/2022/10/28/the-fatal-flaw-in-the-ukhsas-inflated-vaccine-effectiveness-estimates/", "https://dailysceptic.org/2022/11/03/why-does-the-ukhsa-vaccine-surveillance-report-never-mention-side-effects/", "https://dailysceptic.org/2022/12/09/how-the-obsession-with-antibodies-has-failed-us/", "https://bartram.substack.com/", "https://bartram.substack.com/subscribe"], "authors": [], "publish_date": null}