{"result_id": "272031", "URL": "https://www.sott.net/article/475849-Does-vaccination-actually-weaken-our-resistance-to-Covid-19", "timestamp": "2023-04-25 17:07:40 CEST+0200", "meta": {"description": "Those new results may explain why the probability of infection and re-infection seem to increase in direct proportion to the number of injections. As early as 2020, various scientists voiced their concern that a vaccination campaign in the middle...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/475849-Does-vaccination-actually-weaken-our-resistance-to-Covid-19", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Does vaccination actually weaken our resistance to Covid-19? --", "cleaned_text": "Those new results may explain why the probability of infection and re-infection seem to increase in direct proportion to the number of injections.As early as 2020, various scientists voiced their concern that a vaccination campaign in the middle of a pandemic might do more harm than good. They were promptly branded conspiracy theorists, smeared and then removed from social platforms, and vilified in the mainstream media.The development of the pandemic during the past year or so has made it clear they were probably right. It is now evident that the vaccines do little to protect against infection, and in fact, new research keeps appearing that indicates how, over time, they can have an opposite effect.A new study of immune reaction raises even graver concerns about the consequences of the vaccination campaign. Like other such studies, it shows how vaccination spurs the production of immunoglobulin antibodies (IgG) in large quantities, which is certainly what they are intended to do. This study, however, delved deeper, looked at which subtype of IgG antibody the body actually produced following vaccination, and found a huge increase, especially after the third injection, of the IgG4 antibody subtype. Under normal circumstances, IgG4 is less than 5% of IgG antibodies in the body, but after the third vaccine dose, it increased to a fifth of all IgG antibodies. When the triple-vaccinated then got reinfected, the percentage of this subtype increased even more, reaching half of the body's antibodies against the spike protein.Irrgang et al.: \"Class switch towards non-inflammatory, spike-specific IgG4 antibodies after repeated SARS-CoV-2 mRNA vaccination\", Science Immunology, 2022.However,Rather, a high level of IgG4 is an indication that the body is less likely to show a strong reaction to allergens. Beekeepers, for example, are likely to have a high percentage of IgG4, which goes hand in hand with their limited immune response to bee poison.It looks likely, especially if we consider how the vaccination seems to increase susceptibility to infection, but we do not know it yet for certain; further research is required.What we know however is that the study results show how the level of the IgG3 subtype, which plays the biggest role in protection against viruses and bacteria,This is a cause for concern also, but does not come as a surprise to those who have kept a close eye on the studies and real-life data, already showing the uselessness of the vaccines.Shresta et al.: \"Effectiveness of the Coronavirus Disease 2019 (Covid-19) Bivalent Vaccine\", MedRxIv 2022In other words, those results suggest that repeated vaccination with mRNA vaccinesto the virus, which may explain why the probability of infection and re-infection seems to increase in direct proportion to the number of injections. One can only wonder if this also explains to some extent the large increase in chronic Covid symptoms, organ damage and excess deaths. In his recent post on the subject, investigative journalist Alex Berenson calls for immediate restriction of booster campaigns, and research into the correlation between autoimmune diseases and vaccinations.As Geert Vanden Bossche pointed out at the time, and this should have become undeniable by now, vaccination against virus variants that are no longer circulating only encourages the spread of new vaccine-evasive variants, thus fuelling the pandemic. His concerns were of course dismissed as \"misinformation\", just like Dr. Martin Kulldorff's opinion that there was no need to vaccinate those to whom the disease was almost harmless.Last year, Michael Yeadon warned that the third dose of the vaccine might push us into an abyss of disease and death. That warning was, of course, immediately dismissed as a conspiracy theory. But this new study may put some weight to his concerns.The unprecedented censorship of scientific discussion has certainly had a decisive impact on the way things have evolved during the past three years. How grave the consequences of this will eventually become still remains to be seen.", "opengraph": {"url": "https://www.sott.net/article/475849-Does-vaccination-actually-weaken-our-resistance-to-Covid-19", "type": "website", "title": "Does vaccination actually weaken our resistance to Covid-19? -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/667289/full/iceland.jpg", "description": "Those new results may explain why the probability of infection and re-infection seem to increase in direct proportion to the number of injections. As early as 2020, various scientists voiced their concern that a vaccination campaign in the middle...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/667289/full/iceland.jpg", "/image/s33/667290/full/iceland.jpg", "https://pubmed.ncbi.nlm.nih.gov/19222496/", "/image/s33/667291/full/iceland.jpg", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf?utm_source=substack&utm_medium=email", "https://www.science.org/doi/10.1126/sciimmunol.ade2798", "https://alexberenson.substack.com/p/very-urgent-do-covid-mrna-vaccines", "https://palexander.substack.com/p/alarming-irrang-et-al-class-switch", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf?utm_source=substack&utm_medium=email", "https://jamanetwork.com/journals/jamanetworkopen/article-abstract/2794886", "https://alexberenson.substack.com/p/very-urgent-do-covid-mrna-vaccines", "https://twitter.com/davidzweig/status/1607386635678765057", "https://www.thefp.com/p/twitters-secret-blacklists"], "authors": [], "publish_date": null}