{"result_id": "272003", "URL": "https://www.sott.net/article/478570-Vaccine-makers-prep-bird-flu-shot-for-humans-just-in-case", "timestamp": "2023-04-25 17:07:26 CEST+0200", "meta": {"description": "Some of the world's leading makers of flu vaccines say they could make hundreds of millions of bird flu shots for humans within months if a new strain of avian influenza ever jumps across the species divide. One current outbreak of avian flu...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/478570-Vaccine-makers-prep-bird-flu-shot-for-humans-just-in-case", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Vaccine-makers prep bird flu shot for humans 'just in case' --", "cleaned_text": "Some of the world's leading makers of flu vaccines say they could make hundreds of millions of bird flu shots for humans within months if a new strain of avian influenza ever jumps across the species divide.One current outbreak ofhas killed a record number of birds and infected mammals.and global health officials have said theOthers, like Sanofi, said they \"stand ready\" to begin production if needed, with existing H5N1 vaccine strains in stock.There has also been a push among companies to develop a bird flu vaccine for poultry, a market potentially far larger than that for humans.Less reassuring, however, is that most of the potential human doses are earmarked for wealthy countries in long-standing preparedness contracts, global health experts and the companies said.Many countries' pandemic plans say flu shots should go first to the most vulnerable while supply is limited. But during the early stages of COVID-19, many vaccine-rich countries inoculated large proportions of their populations before considering sharing doses.\"We could potentially have a much worse problem with vaccine hoarding and vaccine nationalism in a flu outbreak than we saw with COVID,\" said Dr. Richard Hatchett, chief executive of the Coalition for Epidemic Preparedness Innovations (CEPI), which helps fund vaccine research.By contrast, the WHO is seeking guarantees of 20% global supply for other types of pandemic in the wake of COVID-19.The U.N. agency saidin a mix of donated doses and doses to be bought by the agency at an affordable price. The agreements include six of the largest seasonal flu manufacturers, such as GSK, Sanofi and CSL Seqirus, the WHO said.WHO did not comment on the potential for vaccine hoarding in a flu pandemic but said mechanisms were being developed \"so that countries can work together — not in competition with each other\" to respond to such a crisis. It said it was \"fully confident\" manufacturers and member states would meet their obligations.In a pandemic, vaccine manufacturers would shift production of seasonal flu vaccines and instead make shots tailored to the new outbreak when needed.based on data from human trials showing the vaccines are safe and prompt an immune response, a process already used with seasonal flu vaccines. This meanseven if they have to be tweaked to better match whichever strain does jump to humans.In all,Existing antiviral treatments for people already infected will also help mitigate the impact.At the same time, moving to large-scale production of a more targeted shot could take months, the manufacturers said. Some potential shots use a traditional method,\"Creating the first dose is the easiest,\" said Raja Rajaram, head of global medical strategy at CSL Seqirus. \"The hardest is manufacturing in large quantities.\"Experts have long advocated for new approaches in developing vaccines, both for seasonal and pandemic flu. COVID-19 proved the potential of mRNA technology to adapt more quickly to changing viruses because the vaccines use genetic information from the pathogen, rather than having to grow the virus itself.actually began with pandemic flu, and was modified for COVID-19, said Raffael Nachbagauer, executive director of infectious diseases at Moderna.he said, adding Moderna could respond \"very quickly\" in an outbreak scenario. The results will be closely watched, as the data on Moderna's seasonal flu candidate was mixed.Nachbagauer said the company was mindful of the equity issue needing to be addressed but has no contracts yet.\"It would be premature to sign anything or commit to anything that we can't actually deliver on as of today,\" he said.", "opengraph": {"url": "https://www.sott.net/article/478570-Vaccine-makers-prep-bird-flu-shot-for-humans-just-in-case", "type": "website", "title": "Vaccine-makers prep bird flu shot for humans 'just in case' -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/674126/full/1_The_Flock_Reuters.jpg", "description": "Some of the world's leading makers of flu vaccines say they could make hundreds of millions of bird flu shots for humans within months if a new strain of avian influenza ever jumps across the species divide. One current outbreak of avian flu...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/674126/full/1_The_Flock_Reuters.jpg", "/image/s33/674127/full/1_Ducks_at_a_poultry_farm_in_C.jpg"], "authors": [], "publish_date": null}