{"result_id": "272033", "URL": "https://www.sott.net/article/477416-Higher-excess-deaths-clearly-linked-to-higher-vaccination-rates-in-England-new-analysis-shows", "timestamp": "2023-04-25 17:07:41 CEST+0200", "meta": {"description": "The more vaccine doses an area of England has received, the greater the number of excess deaths it has experienced, an analysis of officialdata has found - adding to worries that the novel Covid vaccines are contributing to the sharp rise in...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/477416-Higher-excess-deaths-clearly-linked-to-higher-vaccination-rates-in-England-new-analysis-shows", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Higher excess deaths clearly linked to higher vaccination rates in England, new analysis shows --", "cleaned_text": "The analysis looked at excess death rates and vaccination rates for all 300-plus lower tier administrative areas in England. It used the pre-pandemic five-year average (2015-19) as a baseline and controlled for confounding factors such as age and deprivation by comparing the findings in the vaccination era to those in the first Covid wave, before vaccines were available (Figure 1).In the first wave (March 15th to June 21st 2020) the areas which would go on to be more highly vaccinated had lower excess deaths on average (the reference vaccination rate is as of March 7th 2021, first dose only). This is a result of the healthy vaccinee effect, whereby people who choose to get vaccinated tend on average also to be people who had better health outcomes pre-vaccine (note that vaccination and health both tend to correlate with wealth).. The downward slope in the chart above is thus a baseline for what happens after vaccine rollout. After the vaccination rollout, if the slope becomes steeper then it means that the more-vaccinated areas have even lower excess deaths than they did before the rollout, indicating the vaccine may be lowering the death rate and saving lives as intended. On the other hand, if the slope becomes shallower or reverses direction then it means something is counteracting the background health advantage of the more-vaccinated areas, suggesting the vaccines may be having the opposite effect of the intended one and increasing excess deaths.The analysis looked at the three periods of excess deaths in England after the vaccine rollout (Figure 2). These are, broadly, the Alpha period of winter 2020-21 (December 20th 2020 to March 7th 2021), the Delta period of the second half of 2021 (June 27th 2021 to January 9th 2022) and the Omicron period of 2022 (March 27th 2022 to January 1st 2023) - thoughThe low vaccine coverage during the Alpha period, very early in the rollout, make the findings for that period uninformative and they have been omitted here.The results for the double-dosed during the Delta period, on the other hand, are striking (Figure 3). (N.B. 'double-dosed' here doesn't include triple-dosed; the 0% vaccinated point is the City of London.)The downward slope of the pre-vaccine baseline (the healthy vaccine effect) has gone completely, and now there is a shallow upward slope. Far from the more-vaccinated areas seeing improvement from the vaccine, then,This worrying finding is only confirmed when we look at the triple-dose data for the same period (Figure 4).Once again,, the downward slope now reversed into a slight upward slope.Worse, the upward slope only gets steeper as we move into 2022 and the Omicron period (Figure 5).This would be bad enough, but recall that the baseline is the 'healthy vaccine effect' whereby the excess death rates pre-vaccine were significantly lower in what would become the more-vaccinated areas.. It may be that the reason for this change is not the vaccine - full data by vaccination status are required to confirm or refute this. But given that most of the other likely factors (e.g. age, deprivation, background health conditions) are controlled for by the fact that areas are being compared to their own historic baselines, it is hard to think what it could be. (To be fair, some of it may be mortality displacement from 2020 owing to more people in the less-vaccinated areas dying earlier on, though that can't be all of it given the trend gets worse for the more-vaccinated areas over time rather than better.)At any rate, it offers no support to the claim that the vaccines reduce overall deaths, suggesting that any finding that claims they do may be a result of the healthy vaccinee effect.Data analyst Joel Smalley, who is behind the analysis, commented The Government has refused to carry out an investigation into the cause of the recent wave of tens of thousands of excess deaths in England. Perhaps this is why.", "opengraph": {"url": "https://www.sott.net/article/477416-Higher-excess-deaths-clearly-linked-to-higher-vaccination-rates-in-England-new-analysis-shows", "type": "website", "title": "Higher excess deaths clearly linked to higher vaccination rates in England, new analysis shows -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/671270/full/7Z4D2XW77NMH7JTI5TWXWJ76MY_768.jpg", "description": "The more vaccine doses an area of England has received, the greater the number of excess deaths it has experienced, an analysis of officialdata has found - adding to worries that the novel Covid vaccines are contributing to the sharp rise in...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/671270/full/7Z4D2XW77NMH7JTI5TWXWJ76MY_768.jpg", "https://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/causesofdeath/datasets/deathregistrationsandoccurrencesbylocalauthorityandhealthboard", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/adhocs/11826fiveyearaverageweeklydeathsbylocalauthorityandplaceofoccurrenceenglandandwalesdeathsregistered2015to2019", "/image/s33/671271/full/image_38_1140x850.png", "/image/s33/671272/full/image_37_1024x766.png", "/image/s33/671273/full/image_40_1024x759.png", "/image/s33/671274/full/image_44.png", "/image/s33/671275/full/image_555_1140x847.png", "/image/s33/671276/full/image_49.png", "https://metatron.substack.com/p/mo-jabs-mo-deaths", "https://metatron.substack.com/p/mo-jabs-mo-deaths", "https://petition.parliament.uk/petitions/628188"], "authors": [], "publish_date": null}