{"result_id": "272009", "URL": "https://www.sott.net/article/477690-Hard-evidence-in-new-study-Brain-heart-damage-caused-by-mRNA-vaccine", "timestamp": "2023-04-25 17:07:29 CEST+0200", "meta": {"description": "Scientists in Germany have found that mRNA vaccination, not COVID-19 infection itself, caused brain and heart damage in an older adult with underlying conditions. This study was published in October 2022 in the journal Vaccines: \"A Case Report:...", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://www.sott.net/article/477690-Hard-evidence-in-new-study-Brain-heart-damage-caused-by-mRNA-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.sott.net", "title": "Hard evidence in new study: Brain, heart damage caused by mRNA vaccine --", "cleaned_text": "Why Aren't More Autopsies Being Conducted?\n\nScientists in Germany have found that mRNA vaccination, not COVID-19 infection itself, caused brain and heart damage in an older adult with underlying conditions. This study was published in October 2022 in the journal Vaccines: \"A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against COVID-19.\" It examined the situation of a 76-year-old German man with Parkinson's disease.The first vaccine he received in May of 2021 was the Oxford/AstraZeneca vaccine. That was followed by two more injections in July and then December of the same year. His two subsequent vaccines were both made by Pfizer After the second vaccine, the patient's family noticed marked changes in his behavior. He started experiencing more anxiety, became more lethargic, and did not want to be touched. He became withdrawn, even from close family members, and the symptoms of his pre-existing Parkinson's disease worsened considerably.Given the ambiguous clinical symptoms prior to his death,The unusual and fascinating results of the autopsy led to a published case report about what is now being claimed as a vaccine-induced death.\"We can say definitively that this damage was caused by vaccine,\" insisted nurse educator, John Campbell, Ph.D., who explained the study in detail in a 14-minute YouTube video that he shared with his 2.68 million subscribers on Feb. 16.The COVID-19 pandemic was caused by a virus called SARS-CoV-2, which is short for Severe Acute Respiratory Syndrome Coronavirus 2. It is an RNA virus belonging to the family Coronaviridae. The name for this family of viruses is derived from the Latin word \"corona,\" meaning crown. This is because the virus under electron microscopy appears crown-like due to small bulbar projections formed by viral spike (S) proteins.Like many other respiratory viruses, coronaviruses spread quickly through droplets that one person projects out of the mouth or nose when breathing, coughing, sneezing, or speaking. The droplets can then be inhaled by another person.Once inside the recipient's respiratory system, the viral spike protein plays a key role in virus-host cell communication. A successful communication results in the virus being accepted by the recipient's cell, completing the process of natural infection.Apart from the spike protein, SARS-CoV-2 also has other essential structural proteins, such as an envelope (E), a membrane (M), and nucleocapsid (N) proteins.As the spike protein is the most abundant and most \"exposed\" viral protein, it was the obvious choice as a viral antigen for vaccine development.In fact, without exception, all of the FDA-approved COVID-19 vaccines use the spike protein as a viral antigen. None of the authorized vaccines use any other SARS-CoV-2 proteins as viral antigens.As a former vaccine developer with a Ph.D. in molecular genetics, Joe Wang has questioned the design of these vaccines Campbell explained.In order to conduct an autopsy to determine the cause of death in the 76-year-old Parkinson's disease patient, researchers processed tissues in his body with formalin, cut them into sections, and stained them with hematoxylin and eosin in order to examine them.They compared their samples with controls, both of the cultured cells from SARS-CoV-2 positive COVID-19 patients (that contained both the spike protein and the nucleocapsid), and cultured cells that contained vaccine-induced spike protein expression but no nucleocapsid protein.The patient experienced. There were patches of degeneration and inflammation in the front of his brain and his brain further contained three kinds of pathological findings: neuronal death (dead nerve cells), microglial infiltration (defense cells in the brain), and lymphocytes, which are associated with viral infection.but, instead, by vaccine-induced spike proteins.This research showed very clearly that the patient's pathology was caused by the vaccines and not by natural infection.The case report included detailed photographs of the patient's affected tissue. The images speak for themselves: Scientists or doctors who deny the connection between vaccines and abnormal tissue findings need only review the images for themselves.Pathologists found that the patient had several places in his brain where there was damage, as well as generalized swelling in his heart. They also confirmed that he was suffering from Parkinson's disease, and that he had some long-standing hardening in his arteries. Finally, they found evidence of pneumonia, which may have been caused by him aspirating his own saliva or other body fluids.\"It looks like what happened here is that the vaccines caused the brain damage,\" Campbell says. It appears that the vaccine-induced brain damage caused the patient to have seizures.Then the seizures (what Campbell called \"fitting\") caused him to go unconscious, and while unconscious, he breathed in some of his own vomit or saliva, which contributed to his cause of death.\"The vaccine circulating around the body will come into contact with the blood vessels. So the lipo-nanoparticles containing the mRNA will go into the blood vessels. And it's the blood vessels' cells themselves that will express the spike protein,\" Campbell explained. When the spike protein is expressed in the brain and the heart, it causes an inflammatory response and leads to the death of different parts of the brain.This is a question Campbell asked in his video — one for which he had no answer. Why are German pathologists conducting autopsies but American and British medical scientists are not?Dr. Robert Lowry, a Texas-based neurologist who specializes in sports medicine, thinks not conducting autopsies is a grievous mistake. Lowry, who has been practicing medicine for over 30 years, insisted back in July of 2022 that autopsies should be conducted on every young person who dies suddenly and unexpectedly.In addition, based on his research and what he has seen in his clinical practice, Lowry does not hesitate to say that we should not be giving any more mRNA injections.\"We need to stop these vaccines because they don't work,\" Lowry told The Epoch Times.he said.", "opengraph": {"url": "https://www.sott.net/article/477690-Hard-evidence-in-new-study-Brain-heart-damage-caused-by-mRNA-vaccine", "type": "website", "title": "Hard evidence in new study: Brain, heart damage caused by mRNA vaccine -- Sott.net", "locale": "en_US", "image": "https://www.sott.net/image/s33/672015/full/Shutterstock_1996814345_1_870x.jpg", "description": "Scientists in Germany have found that mRNA vaccination, not COVID-19 infection itself, caused brain and heart damage in an older adult with underlying conditions. This study was published in October 2022 in the journal Vaccines: \"A Case Report:...", "site_name": "Sott.net"}, "tags": ["Comets", "SOTT Radio Network", "JFK Series", "Storms", "Plagues", "9/11", "Smoking", "Drought", "Extreme Temperatures", "Wildfires", "Animals", "Sinkholes", "Floods", "SOTT Summaries", "Volcanoes", "Comets and Catastrophe Series", "Strange Skies", "Strange Sounds", "Fireballs", "Earthquakes"], "tweets": [], "movies": [], "links": ["/image/s33/672015/full/Shutterstock_1996814345_1_870x.jpg", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.theepochtimes.com/health/pfizer-covid-vaccine-safety-varies-from-lot-to-lot_4467336.html", "https://www.youtube.com/watch?v=NZhzWzoPB3M&t=617s", "https://www.youtube.com/@Campbellteaching", "https://www.theepochtimes.com/health/pandemic-lessons-learned-rushed-covid-vaccines_4229160.html", "https://www.theepochtimes.com/health/do-mrna-vaccines-have-a-polyethylene-glycol-problem_4948405.html", "https://jennifermargulis.substack.com/p/we-should-be-doing-autopsies-on-every"], "authors": [], "publish_date": null}