{"result_id": "273020", "URL": "https://skeptiko.com/richard-smoley-does-magic-work-495/", "timestamp": "2023-04-25 17:08:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/richard-smoley-does-magic-work-495/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Richard Smoley, Does Magic Work? |495|", "cleaned_text": "Richard Smoley is a respect religious scholar who thinks magic is real.\n\nAudio Clip: [00:00:00] You mean I have to live out the rest of my life in this body? No fucking way. You got me into this, you get me out. I can’t do that Chucky. Why not? Cause you’re an abomination. An outbreak against nature. Now you prefer to take everything I’ve taught you and use it for evil, and you have to be stopped.\n\nAlex Tsakiris: [00:00:29] That’s Chucky from, I don’t know, one of my Chucky movies. And he’s consulting with the Voodoo doctor that got him into this mess in the first place. Of course, this is more movie fantasy. But again, is it? For anyone who’s really studied magic very much like today’s awesome guests, Richard Smoley, the lines can get rather blurry. You reference black magic, that’s going to be, immediately that’s where everyone goes?\n\nRichard Smoley: [00:01:02] Well I think there is a certain reality to it. Irish taxi driver in Honolulu, who got involved with a native Hawaiian girl and her mother really did not like this at all. She told him whole off but he didn’t. And he suddenly started to become subject to paralysis from the feet up little by little by little by little. So then someone who was familiar with these things said, I think there might be some magic involved here, let me go and talk to this mother. I don’t know, maybe there is maybe not but I think that maybe if he gets on the next boat to the mainland things will be alright. And you know, that evening, this cab driver was right and took the next boat to San Francisco.\n\nAlex Tsakiris: [00:01:51] And speaking of blurry lines, what happens when we apply that same sensibility to Oh, Christianity, Is Jesus an egregore?\n\nRichard Smoley: [00:02:04] No, I think Jesus was a historical figure and…\n\nAlex Tsakiris: [00:02:08] Is Christ Consciousness an egregore because Jesus as a historical figure is kind of a cop out. I mean,Bart Ehrman, who is essentially an atheist thinks Jesus is a historical figure too. He was some wandering guy who went around and said a couple of things. You almost come to the point of saying that in the book, the truth about magic, you say the Christian Gods can best be understand as an egregore. The Tibetan Buddhists call it a Tulpa.\n\nAlex Tsakiris: [00:02:37] This is a great level three chat with a truly remarkable researcher and knowledgeable guy. I gave him a pretty hard time, but I have the ultimate respect for Richard. Let’s get right to the interview. Welcome to Skeptiko where we explore controversial science and spirituality with leading researchers, thinkers and their critics. Today we welcome Richard Smoely to Skeptiko. Richard of course,is a Harvard and Oxford trained scholar in religion and philosophy, and a recognized expert on all sorts of stuff related to Christian mysticism, Gnosticism, Theosophy and all other kinds of stuff that we like to talk about here on Skeptiko. Richard has a new book out The Truth About Magic, which I’m sure we’ll talk quite a bit about. But I’m hoping we can also get him to talk about some of his other research and some of his other work, particularly one that I’ve referenced before on this show and in my book, How God Became God, what scholars are really saying about God and the Bible, an excellent book from a guy who again is recognized among religious scholars as somebody that really needs to be paid attention to even if he, a lot of times steps outside of the bounds of normal kind of academic religious scholarship, which is much needed. I mean, you don’t want to stay in those boundaries because there’s not much happening there. It’s just something we should really talk about because it’s something I’ve dealt with on this show and that’s part of the reason I was drawn to Richard in the first place is kind of getting this understanding of who we can really rely on, how we should sort through all this important information about spirituality and the religiosity that’s associated with it. So there is a lot to unpack here. I hope we can get to all of it. I might piss Richard off and this could end early but I am going to risk going to some of those other places because they are of my interest and I’m really not interested in a coast to coast kind of canned questions kind of thing. I do want to say because we might get into some of that stuff that I have a tremendous amount of respect for Richard Smoley. For his work, for his deep spirituality that he is both wrestling with, you can tell in a very dynamic and important way, in his also communicating effectively with people who are equally trying to find their way on the spiritual path. So with all that Richard I know you probably don’t know what’s coming now. So welcome. thanks for joining me.\n\nRichard Smoley: [00:05:41] Well it’s a pleasure to be here and I very much look forward to it and go ahead and feel free to piss me off.\n\nAlex Tsakiris: [00:05:51] You know for not pissing each other off, at least a little bit, I mean, we don’t want to piss each other off all the time. But if you’re not risking doing that, then I feel like you’re not really fully engaging the dialogue, especially on a topic that is as controversial as the stuff we’re going to talk about today. Because let’s go back and talk about your current book, your latest book, I should say, The Truth About Magic. Tell us a little bit about that book and you know, the usual stuff and why you wrote it, who it’s for and you know, a brief overview.\n\nRichard Smoley: [00:06:31] I wrote this book in two days and it’s part of a larger project, GMD media, the publisher of the book had me do an audio visual video simultaneous recording over two days, which was a year ago almost exactly. And then I edited the transcript. So this is an edited transcript of basically me speaking. And I think this is good, because it forced me to keep things as simple and clear and concise as possible. And that is what this book and what the audio video series is about. It’s an attempt to introduce people to this whole world of alternate realities, including magic, the occult, and many other things, psychic powers, many other things that they’ve been wondering about, but never have really felt they’ve had kind of an entry point into. And that’s what this book is about.\n\nAlex Tsakiris: [00:07:33] Okay because you know, for folks who are listening to this show, that pick up this book, there’s definitely some nuggets in there that are really quite profound and well written. You’re a fantastic writer, we all know that. But I think a lot of people are going to struggle with where you’re coming from in terms of this introduction, who you’re speaking to. I mean when we talk about the occult, when we talk about magic, most of us now are thinking about magic in modern day culture you know. Damien Echols in high magic and celebrity magic and I pulled up musicians who’ve actually practiced magic and Netflix magic. I mean, we are obsessed in our culture with magic, but it’s not as, I don’t know, kind of dumbed down as it is in this book. I just wonder, aren’t most folks way past this, magic is real stuff?\n\nRichard Smoley: [00:08:46] Well, let me put it this way. I read something a few days ago that said the average American has a seventh grade reading level. So although there are many Konya Shanty, lots of edgy artists, magician types out there, I know some of them. This is not really for them because they know all this stuff already. This is for people who haven’t got a clue. It’s the type of very sophisticated edgy types you’re talking about. Maybe interested in some of it from what I have to say from my own point of view. But I’m hoping they also be interested in it and say, well look my cousin doesn’t know anything about this stuff, where do I start? Well, you could hand them this book and at least give them a handle on it. So this is not kind of written for the Konya Shanti, for the people who already know a great deal about it. It’s written for the average Joe and I think that is much needed.\n\nAlex Tsakiris: [00:09:51] Okay, but if we’re really to jump right in the middle of that I mean you know, is Damien Echols from the West Memphis three? Are you on board with his understanding of magic? Is Alister Crowley do what thou wilt you know, here’s how to compel the spirits to do your bidding kind of stuff. I mean here’s a guy who was convicted of raping and killing three kids in Arkansas, convicted and never you know, I mean, there’s a whole bunch of kind of bad stuff, to keep it really simple whether we’ll leave the evil term out of it, that is associated with people who are going down the magic path, without thinking super deeply about it. So I’m just not sure. I want you to clarify when you say they already know. What is Damien Echols know? I don’t think he knows shit. I think he’s really missed the point about what the spiritual path is and the fact that he’s wrapped it in this word called Magic, and is troubling to me. And I think we need to sort that out in a way that is beyond kind of seventh grade reading stuff, or do you have any similar concerns, or your, what do you think?\n\nRichard Smoley: [00:11:14] Well in the first place, let me state right out in front, that I have never up until this moment heard of Damien Echols, which would, so what you say about his work is all I know about it. I can make certain conclusions about it just from you know, some of the things you said like crowley fella, do what thou wilt shall be the whole of the law, so that is part one section of magic. I think one thing that needs to be pointed out is that when you take something like this, you are encompassing an enormous moral spectrum, as well as a spectrum of practice, as well as a spectrum of theory. Let’s take two other areas with huge spectrums. Let’s take religion. Religion has often pointed humanity towards some of its highest goals and highest achievements, particularly artistic achievements if you think about it, and yet it’s responsible for all sorts of crimes and mishaps and lies. And then let’s take another discourse, which is science. Yeah, science created the COVID vaccine but on the other had, a lot of the environmental problems that we’re dealing with now are part of the science and the result of the scientific worldview. So to say well any of these is, they got part of this, is that not really science, that’s not really religion well in a way that special pleading. So there are all sorts of things that go on in magic, from the best to the worst and that only means that magic is very, very much a human phenomenon.\n\nAlex Tsakiris: [00: 13:14] Well is it, I mean that’s kind of the point of your book is that it’s really not, in the way that we’ve normally limited our understanding of human endeavors. And in particular, the way science and atheistic science, which is by design, this has kind of been my thing is that you know, the science mean that you are a biological robot in a meaningless universe, that you couldn’t possibly have any understanding of anything beyond your five senses, is a very deliberate attempt to kind of control this ability that we have to reach these extended realms that you’re talking about in the book. So I guess first I’d want to drive that stake in the ground. What do you think about that?\n\nRichard Smoley: [00: 14:03] Yeah, well we’re witnessing the collapse of the scientific worldview now, because it’s come a foul of its own internal confusions and contradictions, because many of which are implicit in what you just said. Because on the one hand, it’s all a question of what we can perceive through our five senses, enhanced by electron microscopes, the Hubble you know, spacecraft whatever, but nonetheless it’s still a matter of our five senses. Okay now on the other hand, science is also telling us that these five senses are highly limited, highly conditioned, proceeding only a very small part of what actually may be out there. As shown first by the fact that scientific theories and results are becoming more and more anomalous in terms of you know, common sense thought in the second place? Well you have, I believe it’s Donald Hoffman somewhere in your vicinity of UC Irvine was saying, well our senses evolved really just be able to function and you know, decide whether the animal is going to kill you or you’re going to kill the animal. And it excludes a whole bandwidth of things because they’re not relevant to our survival. So you cannot then argue that this is very, very limited view. And that, at the same time, as the scientific worldview pretends to do, that’s telling us even everything that’s knowable. Another point in fact is science has limited itself to five senses as conventionally known. And yet somehow all over the decades, all over the centuries, all over the world, all sorts of different cultures, people have real perceptions that do not accord with the five senses as conventionally understood. Oh by the way, I’m sure you’ve dealt, well I know whom you’ve interviewed so you’ve certainly dealt with this. There’s certainly a number of researchers who say, well you know, actually, science has proven the existence of psychic phenomenon, at least to a certain degree. So all of this makes this whole scientific world cave in on itself and I think we’re witnessing that today it may even have disastrous consequences. Now I did not say that we are witnessing a collapse of the scientific method because the scientific method as a method narrowly focused, is a legitimate one. On the other hand, its conclusions can never be final. You know, sir Karl Popper said, if you think you’ve come up with final results in science, you’ve given up the game.\n\nAlex Tsakiris: [00: 16:58] Yeah, so let’s kind of stay with the science thing for just a minute. I hear you what you’re saying Donald Hoffman, I think he’s terrific. He’s been on the show, one of my favorite guests. And the limiting through the five senses, got it. And in terms of Sciences ability or inability to measure, which is what science is really all about, is measuring and comparing. And when it acknowledges that it doesn’t have the means to fully measure then it’s kind of obsoleted itself. Another way that it obsoleted itself is really 100 years ago when the whole quantum theory, Max Planck you can’t get behind consciousness. Consciousness is fundamental, double slit experiment, which I think you know, one of the most important experiments of our modern time is the one done by Dean Raiden, where he took the double slit experiment and said, well let’s take it to its natural conclusion. Let’s put a highly skilled mediator in there. And I’ll generate a photon beam through my little photon beam generator and my little photon beam collector, and I’ll ask him to interfere with the photon beam. And consistently you know, six sigma result if you know science that’s off the charts, statistically he was able to do that, and show that and that’s replicated throughout many labs, many replications of that experiment. Nobel Prize winning stuff, never get one but the point being that now we are saying, and you are nodding your head so I know, you’re totally down with this and you talk about this in the book. As soon as we introduce consciousness into the equation, our conventional science as we know it, model is obsoleted. Because now every experiment needs to have a little asterisk next to it which says, we did the best we can in measuring this guys, but we really couldn’t measure consciousness. So we just kind of left that out of the equation. Well, how big is that asterik? So, but let me unravel that. Because the question I really, I guess I was asking Richard is, are we to believe that that is an accident, that sciences insistence, that we are not these rich spiritual beings who are on a spiritual journey? Sciences insistence that we are nothing more than biological robots in a meaningless universe? Are we to assume that that’s just accidental, that those guys just like gosh, darn it that’s the best we could figure out? I don’t think it is. I think it’s by design. I think it’s a social engineering project, because people who are of that mindset are easier to control.\n\nRichard Smoley: [00:19:44] Yeah, well there are a lot of reasons for this. And one reason is that historically, science and religion have been bitter enemies and remain so. Very soon, when science was born in the 17th century and churches got very, very nervous about this and either tried to cuckoo it, deny it, or sit set its limits very, very narrowly. I think with science, again if science, the scientific worldview, the worldview that you’ve just described, is I believe obsolete. The scientific method as a method of inquiry, will remain useful as long as anyone wants to use it. So I do distinguish very strongly between those things. And there is something as you know, called logical positivism, which is obsolete except maybe it’s not so obsolete, which says that no statement that cannot be scientifically verified is either true or meaningful. Well, in its pure form that didn’t last much more than a decade. But the logical positive mindset stays with us to this decade. So science is simply in my view, science does what it does. But it steps beyond its bounds by saying no other method of knowledge, I say knowledge, I’m not saying faith. Because faith, as you know, is basically a bullshit word. Other methods of knowledge are totally invalid. And that is where I think science is overstepping its bounds.\n\nAlex Tsakiris: [00:21:30] Okay, I’m gonna try one more time. If I was interested in controlling the world and somebody has to control the world, that is our, that evidence is clear. I mean, we try, the United States tries to control the world, we are an empire , that is our goal. That is there’s a self preservation part of that. But that is why we fight wars. That is why we undermine other governments. That is why we spy. That is why we do all this stuff, because we’re trying to control the outcome. And as part of doing that, it’s become clear especially in our lifetime, both of us are old enough to see that there are many social engineering projects that just are later revealed as being true. The one I always use as my touchdown, because half people know it and half people don’t but you know, Gloria Steinem. And so, and the reason I bring that up is not to talk about the women’s movement but I just get tired. I just had an interview yesterday with Bruce Grayson, that you know, just eminently excellent near death experience researcher, and I kind of wound up going in kind of the same territory is, do you really think this stuff isn’t control? Why wouldn’t this stuff be controlled? Why wouldn’t someone have an interest in where culture goes? So the tie back again to Gloria Steinem is, you know, we can argue about how involved she was but how about why the hell does this care about the women’s movement in which direction it goes? Why did they care about the LSD movement? Why are they deeply involved in that? Because they’re deeply involved in social engineering and control and as soon as we accept that, why do we think they’re not playing that game in science? Of course they are.\n\nRichard Smoley: [00: 23:26] Well there was a lot, what you said when, I didn’t know that fact about Gloria Steinem. I knew she had been a Playboy Bunny so maybe the CIA was trying to get her to infiltrate the Playboy Club and undermine Hugh Hefner’s playboy philosophy.\n\nAlex Tsakiris: [00:23:42] But I think you’re being sarcastic there but I mean, you it’s almost like you got to pause and do the Google search, see or say she was CIA. And I don’t know if it’s like a 60 Minutes interview but it was like of that level, and then go back and look at why she even came out and admitted it is because somebody outed her, somebody in the woman’s movement out at her, and then go look at why they outed her and then you have memos from her CIA boss saying that. So, you know, and this is kind of the thing I pinged you on a little bit with the book. It’s like, there’s some history here that I feel like we have to kind of, again, drive a stake in the ground and say okay, did that happen? Or did that not happen? Because we’re going to build a lot of implications on top of that, that if we don’t ground ourselves in that, you know.\n\nRichard Smoley: [00:24:33] Well, I certainly think historical research and there has certain validity. I am not a postmodernist or a deconstructionist or conspiracy theorist that says this is all lies. I will refer you in fact to the only most factual book I’ve read about the CIA which is called Legacy of Ashes. And if you read this book legacy of ashes and I’ve forgotten the author’s name, the history of the CIA is one continuous legacy bumbling. Whatever they did, they did wrong. They blew the Bay of Pigs, they blew the, they ignored the Korean War, they well, in the Iraq war started partly because Cheney knew how bad the CIA was. And for his own personal reasons, just chose to disbelieve them when they said, No I don’t think there’s any weapons of mass destruction. So my point here is, I guess I better not apply to the CIA for a job anytime soon. But my point is you’re right, there’s all of this control you’re right, all of it. But what is the net effect of all of this control? Because no one entity has enough control to enforce it worldwide. Conspiracy theorists like to believe there are but they don’t really have very good grounds for thinking. So it’s more like there’s a conspiracy of a large number of powerful competing interests, whose interests dovetail sometimes, sometimes very much conflict. And this, what would that produce chaos or at least some measure of chaos? What do we see in society, the world in it, some measure of chaos?\n\nAlex Tsakiris: [01:10:56] One more point, if I can and then I’ll let you go. You’ve been very generous with your time here. But I want to return to my little story about my buddy Tom Zinser. Again the psychologist, clinical psychologist from Grand Rapids. And he starts encountering these people who have experienced satanic ritual abuse. And as you know, that’s a very controversial topic for a lot of folks. But it really shouldn’t be, any little bit of investigation of that that’s honest and fair, you will find that for whatever reason, there’s people who are engaging that activity, and it’s extremely harmful to the victims. And I’ve interviewed at least one of the victims here Onika Lucas, who was involved with the dietro case in Belgium, which kind of made national news you know, back in the 90s, when it happened. So these things are very real and they’re always countered with kind of a disinformation thing like satanic panic, which I guess is real in a way too. But there is a fundamental truth to it. So it wasn’t just panic, it might have been exaggerated by fundamentalist Christians who took it too far. But there was a real truth to it. So that’s what Tom Zinser found. So he’s working with patients and he’s finding out that they really have been traumatized, sexually abused in a lot of cases, at very young ages. But what he finds that’s particularly important and interesting for our discussion, is the incidence of Dis-associative Identity Disorder. And that that may be actually a mechanism, a tool to engage with the extended realms and that these practices of doing things to people in order to create this Dissociative Identity Disorder might actually be a tool. Well lo and behold, go look at MK Ultra and you’ll find exactly that that’s what they were engaged in. They were intentionally trying to do that. Go interview Whitley Strieber like I did, you’ll find that that’s what they were engaging in. There does seem to be a mechanism, almost a science to reaching these extended realms through Dis-associative Identity Disorder. Is that anything you’ve stumbled across? And do you have any thoughts on that?\n\nRichard Smoley: [01:13:28] No its an idea I’ve never heard, although it’s an interesting one. It makes a certain amount of sense on the face of it having just heard it, but I want to go back because you’ve screened through an enormous number of satanic figures a few moments ago. And these people are all over the place. I got Anton Zander Levey whose, well I can’t point to him but you see him here somewhere.\n\nLet’s show the picture of him and Michael Aquino. That’s that’s my go to guy, who they were big buddies. Well, Keno if you look at the evidence to him, I mean he’s a pedophile. And evidence of him and his wife abusing kids and I pulled it up on the screen in case we wanted to talk about it. Search warrant…\n\nRichard Smoley:[ 01:14:20] I don’t know about his particular case. I mean he was a colonel in the US Army Intelligence. Oh, my God but on the other hand, I guess that’s the type of person you may want that knows how to do this stuff, or…\n\nAlex Tsakiris: [01:14:38] Well, he was publicly a Satanist though I mean, right?\n\nAlex Tsakiris: [01:14:41] So he was a member, he stayed in the military and said, hey I’m freedom of religion, I’m a Satanist you know, this is what I do, this is how I practice and so yeah.\n\nRichard Smoley: [01:14:53] Well, I do know other people who call themselves Satanists who seem in the face to be actually really quite decent and ethical people. So you know, Satanism isn’t as bad, but there are really people doing this. You know how you know that there is a satanic ritual abuse going on definitely. Because you have to apply the principle. If you can think of it, somebody tried it. That is basically probably the epitaph of the human race. Yeah, if you thought of it, somebody stripers. The epitaph of real epitaph of the human race is probably it seemed like a good idea at the time, but we can bypass. So yeah, this thing exists. But I would be very cautious about saying, everyone who kind of seems to fit the label of you know, temple of set or the left hand path as they sometimes call it, is doing these kinds of things. I do believe people are doing these things in the name of Satan. On the other hand, in terms of just sheer statistics, how many people are doing this in the name of Jesus Christ and Catholic churches? I mean numerically, which group is larger?\n\nAlex Tsakiris: [01:16:12] Go down the list of churches. You know, LDS churches you mentioned Catholic churches, you can go to all the other strange groups that now have come out the same thing. So yeah and cults, cults as well including all the ones, including Indian cults and all the rest of them so no I get your point, I get your point on that. It’s really more of a, and that’s where I wish you would have gone more in the book, because the way I see it is there certain energies that people are tapping into and that’s what my buddy Tom Zinser said, he said, Look there is darkness and darkness is like a gravitational force. It’s not bad per se. It’s just the relief through which we see lightness, through we see light. And that light is really the game, light is what it’s about. And you would agree with this because that’s what your book is about. It’s about achieving oneness with the good, with God with the moral imperative to do right, which we all know what’s the right thing to do. But darkness is always there and available to us and it doesn’t mean that it’s evil. Our acts of being drawn to the darkness in order to satisfy our problems is what evil is, this is what Dr. Zinser told me and it makes a lot of sense. It would also make sense in terms of the satanic people, the serial killers who are claiming connection to spirit entities same thing, they’re just trying to tap into something that relieves them of the feelings that they have because they feel the dark force and they don’t know how to get to the light force. There was a good sermon, but do you have anything to say about it?\n\nRichard Smoley: [01:18:01] Well, one of the chapters of my book is called the Life Force, and which is sometimes called Ci or Prana, and what is it? Well, one thing is the difference between a living human being and a corpse, which are as you know, otherwise anatomically identical least at the outset. And this life force is morally neutral. I mean, that is one of the appeal of the Star Wars series, because the Star Wars series talks about the force. And the force is morally neutral, there is the light side of the force and the dark side of the force. You can use electricity or nuclear power for the most benign and helpful means ,you can use them for the most perfidious means. So you know, and then why you choose one or the other well, then that gets into very, very complicated moral questions. But um yeah, that’s what I have to say about it.\n\nAlex Tsakiris: [0 1:19:03] Well excellent, I think the torture session, you know it has to have been torture. It’s been an awesome dialogue and I appreciate your openness, I mean you didn’t back off of any questions or anything like that which I, and it’s fun to engage in these kinds of dialogues that take us beyond what we normally talk about. So this book that people are going to want to check out, The Truth About Magic is out now on Kindle. Richard’s many other books are available as well and you’ll find just some great stuff in there from somebody who truly is a spiritual seeker that we want to keep in touch with. So Richard, thanks so much for joining me.\n\nRichard Smoley: [01:19:44] Well, thank you very much and just to reinforce one point that might not be already clear. I want to say it was a pleasure from beginning to end.\n\nAlex Tsakiris: [01:19:54] Oh, fantastic. Thank you Richard, I enjoyed it very much.\n\nRichard Smoley: [01:19:58] Thank you so much. Thanks for your interest in my work.\n\nAlex Tsakiris: [01:20:02] Thanks again to Richard Smoley for joining me today on Skeptiko. The one question I’d have to tee up from this interview. Isn’t this why evil matters? How are we ever going to get to that next level of understanding of this stuff, If we can’t get past level one? Okay, that’s a total inside baseball kind of question but you’re still with me you’re probably playing inside baseball with me. So jump in there with an answer. Plenty of places to do it. track me down however you see fit. Until next time, take care and bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Richard Smoley, Does Magic Work? |495| - Skeptiko - Science at the Tipping Point", "description": "Richard Smoley is a respect religious scholar who thinks magic is real. Click here for Riochard Smoley’s Website Click here for forum Discussion Skeptiko-495-Richard-Smoley Audio Clip: [00:00:00] You mean I have to live out the rest of my life in this body? No fucking way. You got me into this, you get me out. I […]", "url": "https://skeptiko.com/richard-smoley-does-magic-work-495/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2021-04-06T15:00:44+00:00", "article:modified_time": "2021-04-06T15:05:30+00:00", "image": "https://skeptiko.com/wp-content/uploads/2021/04/skeptiko-495-richard-smoley.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Richard Smoley, Does Magic Work? |495|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/kVRCluASEGU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/kVRCluASEGU?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-495-richard-smoley.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-495-richard-smoley.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-495-richard-smoley.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/richard-smoley-does-magic-work-495.4679/", "http://www.innerchristianity.com/", "http://www.skeptiko-forum.com/threads/richard-smoley-does-magic-work-495.4679/", "http://www.skeptiko-forum.com/threads/richard-smoley-does-magic-work-495.4679/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2021-04-06T15:00:44+00:00"}