{"result_id": "273011", "URL": "https://skeptiko.com/rick-archer-buddha-at-the-gas-pump/", "timestamp": "2023-04-25 17:08:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/rick-archer-buddha-at-the-gas-pump/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Rick Archer From Buddha at the Gas Pump on Meditation and Spiritual Practices", "cleaned_text": "Interview with Rick Archer host of the website and Youtube channel, Buddha at the Gas Pump.\n\nJoin Skeptiko host Alex Tsakiris for an interview with Rick Archer of, Buddha at the Gas Pump. During the interview Archer talks about a thought experiment he uses to better understand our place in the universe:\n\nRick Archer: Here’s the game: zoom out to the level of perspective where you can watch the Andromeda galaxy collide with the Milky Way over the next 8 billion years. Realize, of course, that that’s actually a very, very tiny localized event compared to the whole universe but it’s big enough for our purposes here.\n\nThen imagine as you watch that over 8 billion years all the trillions and trillions of lives playing themselves out on all the inhabited planets in those galaxies. Each one of those lives seems very real and serious to the person living it, but from that perspective they’re like little fireflies winking in and out, even faster than that. Billions and trillions of little strobe lights going on and off.\n\nNow zoom it down, past the human level down to the level of the plank scale and you discover there is no universe. It’s just all a field of pure potentiality in which even a cubic centimeter of empty space at that level has more energy than all the energy in the entire manifest universe. That’s essentially what you are.\n\nNow zoom it back to the human level. Here’s what you are in expressed form, in a manifest, living form. But, this perspective as a human being is no more real than the zoomed out cosmic perspective or the zoomed in plank scale perspective. Those are just different perspectives on reality. We just have a peephole as a human being. Just a little peephole and yet we can actually culture an awareness that is cosmic like that. That does transcend time and space. That’s vast. That’s eternal. That can be our living reality. That can be the sort of substance of our lives.\n\nThat’s what enlightenment is all about, which is the question you started this interview with. It’s not a pipedream; it’s not a fantasy. It’s something that many people have lived throughout history and something that we would have a very interesting world on our hands if it were commonplace. All the problems and travails that beset us as a civilization today would be just distant memories if that were a common experience.\n\nToday we welcome Rick Archer to Skeptiko. Rick is the creator and host of Buddha at the Gas Pump, a website and YouTube channel that features an amazing collection of interviews with all sorts of interesting thinkers, spiritual teachers, and enlightenment-seeking individuals. Rick, I’m a big fan of your show and I’m so happy to welcome you to Skeptiko.\n\nRick Archer: Well, the feeling is mutual. I started listening to your show for the first time last Tuesday and now it’s Saturday and I think I’ve listened to six or seven of them, which means over an hour a day I’m listening to Alex while I ride my bike and wash the dishes and stuff. I’m thrilled by it. I’m going to continue listening. You and Bill Maher and Bill Moyer are my favorite podcasters now.\n\nAlex Tsakiris: Wow, that’s quite a group to lump me into. I have to say, this is kind of a mutual admiration society but I feel similarly. I really stumbled across your site about a year ago and anyone who searches for any variety of well-known spiritual teachers is liable to bump into Buddha at the Gas Pump. I did. Didn’t really latch onto it too much and then I kept hearing from listeners here. Here was an interview with that person from Rick. Then I really dug into it and was amazed.\n\nWhat you’ll find if you go to Buddha at the Gas Pump are these interviews, over 150 of them at this point, with a lot of morsels and nuggets of little insights that you can take and work. Some you will dismiss and some you’ll dig into more but there’s just so much there.\n\nTell us a little bit about the concept behind Buddha at the Gas Pump and how it all got started.\n\nRick Archer: Well, I’m a long-time spiritual practitioner myself. I’ve been meditating regularly since the ‘60s so I have a genuine interest in this stuff. I also have always liked asking questions of people. I would look at Oprah or Larry King and people like that and think, ‘I could do that.’ I just have a natural curiosity. My mind is always thinking of the next question. Even while I’m listening to your podcasts and you’re talking to some guy I’m thinking, ‘Okay, now ask them this.’\n\nSo I was out in the garage one day working out on my Bowflex machine and the idea just popped into my head, ‘Hey, do an interview show.’ One thing led to the next and there are a lot of details but that’s how the idea originated. Initially I thought of it as a local radio show that I would do here in my hometown with about a 10 mile radius of broadcast, a low power station. Friends kept saying to me, “You’re thinking too small. You should be out on the Internet. Make it bigger.” So that’s what ended up happening.\n\nAlex Tsakiris: So, Rick, as we dive into this there’s going to be a lot of folks who listen to Skeptiko who are going to be very much in sync with what you’re talking about. There are other folks who are going to be a little bit more leery and not quite into it. So I thought where we might start is by breaking down some very simple terms that may be terms that we throw around that aren’t so simple. I could start with this idea of “enlightenment.” This idea of “awakening.” Anyone who encounters your site is going to immediately run into those terms. What are we talking about? What is enlightenment? What is awakening?\n\nRick Archer: I’d like to give you as deep an answer as I can and to provide a context which will be a foundation for our whole discussion here. That is that we human beings, and in fact all sentient life-forms, are like filters. We’re like lenses. We’re like peepholes, if you will, which can glimpse a certain perspective on the world but obviously can’t take into account the whole thing.\n\nIf we put you and a moth and a chameleon and a bat and a cat all in the same room, each being would be seeing something completely different according to their perceptual capabilities. Now, scientists tell us that if we boil it down deeper and deeper and deeper we get down to a ground state, a quantum field, a unified field as it’s sometimes called.\n\nThere are debates about what that is or whether it’s been confirmed and so on, but as I understand it that’s a very good model or metaphor, at the very least, if not an actual real correlation for what enlightenment is. The unique capability of a human being which bats, despite their exceptional hearing abilities or fruit flies, despite their exceptional smelling abilities–where they can smell a glass of wine at 1,000 yards–don’t have.\n\nHuman beings have the capacity to actually consciously become aware of that field, of that ground-state of existence. It turns out when that awareness dawns you discover that’s what you are, essentially. The term you often use, a biological robot, you are that but in a relative, limited sense but more fundamentally, realistically, more deeply, you are essentially the ground-state of the universe. You are the intelligence from which the whole thing arises.\n\nWe can elaborate on that because that might around skepticism for me to just say that. So enlightenment is that conscious realization, to my way of using the word.\n\nAlex Tsakiris: You’re right in that that is to a certain extent controversial. Another way of looking at it is it shouldn’t be. Let’s deconstruct that because one of the things I was really hoping to do was connect the work that you’re doing with these first-person accounts of people who say, “Hey, I got to this state called awareness or awakening and this is what it’s like and here’s how I did it,” and then connect that with some of the work we’re doing which is also coming at it from this logical, rational, science standpoint and saying, “Is that true? Can we trust that? Can we test that?”\n\nThat’s the other thing we’re all doing. There’s a lot of overlap. I don’t mean to make it seem they’re two camps because they’re not. I’d start with this whole idea of consciousness because you just touched on it. As you also alluded to, in the science world that we live in even that is controversial. It’s more than controversial, it’s not accepted. It’s not accepted that you are conscious. I think we can blow past that because hey, we all know we’re conscious. We all know we have a free will.\n\nYet we live in a society, in a culture, where those ideas are not in keeping with the mainstream paradigm. I think we always have to remind ourselves of that, that the science news we’re reading, the science reporting that we’re getting is built on this assumption that you are this biological robot. You are your brain. So how do we make that leap and get past that?\n\nI guess what I’d bring that back to is meditation or some kind of practice because the teachers that come onto your show often talk about some kind of practice. Maybe we can talk about that practice and meditation and how meditation brings many people to that first-person realization that the model I was just talking about is not true and that there really is a “you” to you.\n\nRick Archer: I think, as you say, the mainstream culture has a certain mindset but it takes a while for the mainstream culture in any age to catch up with the leading edge of thinking. By and large the mainstream culture is probably still in a Newtonian mindset whereas 100 years ago quantum physics dawned and the mainstream culture hasn’t caught up with that. Even mainstream science hasn’t caught up with that. Quantum physics tells us that essentially life, as that we see as apparently material stuff, is a quantum fluctuation in a field of all possibilities. Yet we don’t live our lives that way.\n\nPerhaps enlightened people see the world that way. They actually are living the reality of what the quantum physicists are postulating. Throughout history there have been people who have expressed that kind of perspective, many of whom have used techniques and modalities such as meditation and other things to bring about that realization. Even in spiritual circles it’s argued sometimes that techniques can’t do it for you.\n\nThe spiritual authorities I respect, although they say a technique doesn’t cause enlightenment, there’s one Zen guy who said enlightenment may be an accident but spiritual practice makes you accident-prone. So techniques and practices, if they’re effective—and I think there are varying degrees of effectiveness—you go for what makes sense to you and you do it. Maybe you move on to something else after a while. Over time you culture on a physiological basis the ability to have the kind of recognition here that we’re talking about.\n\nAnd there has been a great deal of research on various kinds of meditation, transcendental meditation, Buddhist meditation, Vipassana, and so on. You’ve heard of neural plasticity, that the brain changes as a result of experiences we have. Well, the brain changes as a result of meditation dramatically. People who’ve been practicing meditation techniques for 10, 20, 30 years—there’s a guy you might want to have on your show named Fred Travis who’s done a lot of study on this. Their brains function in quite a remarkably different manner–which I’m not really qualified to get into the details of—than the average brain.\n\nSo we’re instruments. We’re like sense organs of the infinite, we could say. As such we can intentionally enhance our ability to sense. To tune in not only to various relative strata of experience, many of which you talk about on your show, but to the foundation of all those relative strata, the ground-state of the universe.\n\nAlex Tsakiris: I’m with you right up until the ground-state of the universe thing. Then I just pull back a little bit.\n\nRick Archer: We can play with that.\n\nAlex Tsakiris: We should. We should play with it. I think that’s a fair term. You do a wonderful job on your show of being inclusive of a lot of different spiritual traditions, modalities of teaching, and at the same time being skeptical—I guess is no better word—of some of the obvious contradictions and paradoxes that arise whenever you get there.\n\nSo what I want to do next is backtrack a little bit from when we took that baby step and said okay, clearly by the hard science that we might love so much such as neural plasticity and those kinds of things, we can prove that this materialistic, biological robot thing falls apart, right? If you can have a thought in meditation and that can change the physical structure of your brain, well then you have a chicken-and-the-egg problem if you’re a materialist, right? What came first? This brain that you claim is the source of everything or the thought which just changed the brain?\n\nBut let’s jump past that because we’ve already said that materialism falls apart if you look at…\n\nRick Archer: Well, there are two schools of thinking there. There are those who say that consciousness is an epiphenomenon of brain functioning and there are those who say that consciousness actually gives rise to the whole material universe including the brain, which is an interesting thing because it’s a bootstrap process whereby consciousness creates forms which eventually can recognize consciousness. So it’s a way of consciousness playing hide-and-seek with itself.\n\nAlex Tsakiris: Which brings us to the paradox and the contradiction thing that I want to get into because it’s so fascinating. On one side intellectually it’s fascinating but it’s also challenging on another level if you’re really trying to get your arms around this stuff. On one hand we have the materialists, the scientists, really the Atheist crowd who are saying you’re just this biological robot. Then we get past that and move into some of the folks that you’re talking to. We go to Buddha at the Gas Pump and we go, “Oh, no. There’s more of this universal consciousness.” It can wind up sounding a lot like the same thing that we started with which is that this is all an illusion.\n\nSo how do we get past that contradiction? Or should we? Is this all an illusion? Consciousness as we know it—are we really back to creating an illusion of a reality that isn’t really there?\n\nRick Archer: Just in terms of perception with some of the examples I used earlier of different kinds of animals, what we see as the world is our human interpretation of it. Each one of the 7 billion humans has a slightly different interpretation. For instance, it’s now speculated–with some physiological research to back it up–that birds have receptors in their retinas which can actually turn the magnetic lines of the Earth into visual phenomena so that they can migrate by actually seeing little lines that they can follow. So is that an illusion? Well, it’s a concept for a human being but it’s a reality for a bird if that’s true.\n\nNow, physics would tell us that if you remove all the empty space from—let’s take all 7 billion people in the world and remove all the empty space that’s between all the subatomic particles in their bodies and collapse it down to just neutrons, protons, and electrons. You end up with an object about the size of a grain of rice. So there’s not much there yet we perceive these solid physical things.\n\nAnd then take that grain of rice and begin to analyze the subatomic particles which make up the protons and neutrons and so on, and you get down to the point where those aren’t physical anymore. They’re just statistical fluctuations in an underlying field. So yeah, it seems like…\n\nAlex Tsakiris: I’m with you but then we’re abstracting it back to this scientific level that doesn’t hit people where they’re living. Hey, I have problems. I’ve got stress. I’ve got deep existential issues of who am I? So I come to a teacher and the teacher says, “Let go of the story. This is an illusion.”\n\nRick Archer: I see where you’re going with that.\n\nAlex Tsakiris: “You’re not really here. You’re attached to something that isn’t real.” So in a funny way we’ve come full circle. We haven’t really come full circle but it’s all an illusion. How do we process that from a spiritual standpoint?\n\nRick Archer: I would never say that to somebody. I think it’s irresponsible. I think we can say knowledge is different at different states of consciousness. Reality is different at different states of consciousness. But the quantum physicist who realizes that fundamentally there’s no such thing as gravity because there’s a certain most basic level of nature where gravity hasn’t yet arisen. You can’t go jumping off buildings by virtue of that understanding and expect to live.\n\nSo somebody who says, “I’m going through terrible problems. I’ve lost my job, my kid is on drugs, whatever,” that stuff needs to be dealt with with compassion and understanding and a recognition of the relative reality of that experience. It does no good to the person to just say it’s all unreal.\n\nAlex Tsakiris: What about attachment, though? How do we balance that, again a contradicting paradox? How do we balance that with attachment to both, our problems and our solutions or our feelings of liberation or enlightenment? Isn’t that a reality, too?\n\nRick Archer: Yeah. And again, back to the word “enlightenment.” My understanding of enlightenment is not just some recognition of the abstract—or maybe not so abstract—foundation of the universe. It’s an integration of that with all levels of life. Being able to raise a family, have a job, whatever, and yet do so while grounded or established in being, if we want to call it being. So we could say we’re multi-dimensional beings.\n\nEnlightenment is not just meaning locking into one dimension to the exclusion of the others. It’s a fully integrated incorporation of being able to function on all levels simultaneously or at least to move between them according to the need.\n\nAlex Tsakiris: I think that’s wonderful. I really appreciate that, which means I agree with it. But I am struck sometimes by how much people want to move past what’s going on here and now. You know, whether you talk about psychedelics, which is a topic I wanted to get into later but it seems to have come up now so let’s talk about it.\n\nThe psychedelic experience and this idea that Terence McKenna coined the idea that we need to perturb consciousness. The best way to really get a handle on consciousness is to perturb it and there’s something intellectually attractive to that. But on the other hand, there’s something about asking the fundamental question of why. At the end of the day, we’re going to come back to this. This ordinary consciousness. It seems like we have to deal with that.\n\nI’m not putting down the use of psychedelics and I could substitute for psychedelics almost any spiritual practice. Breathing, deep meditation, anything. But at the end of the day, it seems to me that we’re geared to come back and deal with this experience. Tell me any thoughts you have about that or any of your favorite guests who have dealt with some of these issues.\n\nRick Archer: Sure. Well, psychedelics were how I got my start in this whole journey. I perturbed the heck out of consciousness for about a year, you know? After about a year of pretty serious perturbing I was a mess. I dropped out of high school. I couldn’t stay at home with my father; he was kicking me out of the house all the time. Basically I’d messed myself up both subjectively and in terms of my outer life.\n\nWhat I realized from the whole experience was that a lot depends on how you perceive the world. Most people just take for granted that the world they perceive is the world that is, and psychedelics blew that out of the water for me. But if I’d been continuing on that path all these years I probably would be dead by now.\n\nSo I found for me something that was much more wholesome and constructive. Within weeks of practicing it, it had transformed my life. I had gotten back into school; got a job; reconciled with my father. It had all kinds of practical significance but at the same time was opening me up to deeper levels of experience in a way that was much more gratifying than drugs because it was natural and much more stable. You take an acid trip or something and you come down after 12 hours and it’s gone but genuine spiritual development is an integrative process which grows by degrees and you don’t lose it.\n\nPeople sometimes say, “What good is meditation because you have an experience while you’re doing it and then you’ve got to go back to your regular life?” That’s like saying, “What good is eating a meal because you’ve got to stop eating after a while?” The meal stays with you. It goes to build tissue in your body and so on. The same with a spiritual practice. It has a cumulative influence over time.\n\nAlex Tsakiris: I like that. That’s good. Let’s swing back and talk about science for a minute. There’s this saying in science that I really like and I like the history of it. It’s “Shut up and calculate.” You mentioned quantum physics—really the pioneers of quantum physics were over 100 years ago but those folks got to a point where they said the philosophical implications of what we’ve discovered here in quantum physics, this idea of entanglement, the experimenter effect, as you summed up really nicely, kind of violates all these other ideas we have.\n\nIt fundamentally says we can’t really measure things like we think we can and therefore maybe science isn’t what we think it is. But they reached a point where they said, “What are we going to do with this?” They adopted the idea of “Shut up and calculate.” So the Direct TV satellite system in my living room relies on “Shut up and calculate.” It’s do with what we have and see if we can make something practical out of it.\n\nThe reason I bring all that up is because I think we bump into that in the spiritual practice, as well. There are two ways it cuts. One way is hey, this practice works for me. I feel better. But there’s a side of me that doesn’t want to go there necessarily. It wants to pull it apart and says, “How do we test that? How do you know that your practice really is genuine? Is it efficacious? Are any of these things?”\n\nIf you get into these discussions with people—I don’t want to pick on Christians—but Fundamentalist Christians are the easy target on this because you can push them. You can say, “You believe in this book and you believe in inerrancy and here we have all these records that how it’s not inerrant. It’s not historically what you think it is.” You’ll eventually get to this “Shut up and calculate” thing, which in spiritual terms is “It works for me.”\n\nSo any thoughts on that? How do we deal with the “It works for me” versus “Is this the best I can do?” in terms of a spiritual practice, in terms of a belief system?\n\nRick Archer: Well, I just listened to your interview with Chris White. It was interesting. Fundamentalist. A sincere Christian who was going to great lengths to defend a particular perspective and shoehorning the data into that perspective, almost to the point where he wouldn’t let you speak. He kept talking so much and you would try to say, “But…but…” and he would keep going.\n\nPersonally, I’m not a scientist either by profession or anything else but I like the principles of science. I think that is why I like your show. Things should be verifiable by direct experience, not only by one person but repeatedly by other people who choose to go through the same steps that that person went through. I think that can apply to a great many spiritual practices. You can come in with a skeptical attitude, and many people do, and do a certain practice and if you follow the instructions and do it regularly you’ll begin to have the kinds of experiences that others have had. You may not have believed you would but you actually do; it just happens.\n\nSo that’s a short answer to your question. There might have been more you wanted me to say to that.\n\nAlex Tsakiris: I think that’s a great answer. I think that’s the scientific method in a very practical sense that we all use and apply every day. I think that’s one of the problems with science is sometimes we want to remove it from our everyday life. I think what you summed up there is exactly what we all do. Hey, is this working? Do I need to test it more? I’m going to test it some more and if it continues to work then I can rely on it.\n\nRick Archer: I should just add that there has been a great deal of physiological and sociological and psychological research conducted on meditators of various stripes and some rather profound things are seen. In some cases the research is used as a PR tool and undesirable outcomes are not published and so on, but a good deal of it is done with a lot of integrity and rigor and published in peer-reviewed scientific journals.\n\nSo something is definitely happening and some of it is quite remarkable. Like you’ve said many times on your show, people whose paradigm conflicts with those findings tend to brush it under the rug or dismiss it and not even look at it but it’s there. I think it’s becoming harder and harder to ignore.\n\nAlex Tsakiris: I want to talk about a sensitive area for you. I want to talk about TM. I feel like I can go there. It’s something you have talked about on your show. I think it’s right there; talk about sweeping stuff under the rug. I think it’s something that comes up to anyone who’s really honest about looking into any spiritual practice. If we broaden it a little bit, it’s the guru phenomena.\n\nI’ve been involved in enough spiritual practices over the years—not as deeply maybe as you have—but to see this happen again and again it’s funny. It’s like the old MTV band after band that makes it big, has all this money, wastes it all on drugs, and is now broke. It’s over and over again. We see this with the guru phenomena. Great spiritual insights, huge following, sexual indiscretions, money mismanagement, and deception. What’s going on with the guru thing in general? And how did you process that as it unraveled with your TM experience?\n\nRick Archer: Well, since you mentioned rock n’ roll, there’s a great line by the band from the song The Night They Drove Old Dixie Down which is, “You take what you need and you leave the rest.”\n\nTM was invaluable for me. It transformed my life. It saved my life. I mean, the direction I was going I was starting to mess with heroin. Some of my friends ended up dying. So it turned me around like night and day. Very profound. I had all kinds of wonderful experiences over the years and great times with Maharishi in person and so on.\n\nThe TM movement booted me out about a dozen years ago because I was becoming too independent in my thinking, really. That’s what it boiled down to. Organizations of every sort, political, spiritual, and so on, seem to have their own mindset and they don’t like people rocking the boat too much or thinking outside the box too much. But that was great. It was a perfect step in my progress to be booted out and to be able to step back and reassess all my assumptions and not take for granted many of the things I’d been taking for granted all these years.\n\nI still meditate although it’s actually strictly speaking not to him because I got a different mantra from a different teacher, but I do it TM style. I have nothing but appreciation for everything I derived from it and for all the wonderful people that are still involved in it and so on.\n\nRegarding sexual scandals and all that almost every guru, including Maharishi, has been prone to them. I honestly don’t know what to make of it because I had been raised spiritually with the concept that higher consciousness correlates with higher ethics. And of course, ethics is very much a human thing sometimes. What one culture considers ethical, such as polygamy, is not ethical in another. But there’s a sort of universal agreement that teachers in a position of authority, many years older than trusting innocent students, shouldn’t mess with their students.\n\nAlex Tsakiris: There’s also the more universal code of we tell the truth. When that is violated I think everything falls apart. I don’t want to cut this off because this is interesting. Is there anything about this spiritual devotion that makes the leaders more prone to this?\n\nYou summed up the question; now I want you to answer it. What is going on? Why does this happen again and again?\n\nRick Archer: I don’t have any absolute answers but a theory that I play with is that—I’ll just say teachers because it’s not exclusive to any one. There are quite a few of them who have fallen prey to this. They’re raised in a certain culture, maybe an Eastern culture, and it may be an Ashram in an Eastern culture which is relatively cut off from the general society. So they undergo decades of development in that context and there are certain aspects of their personalities which I guess modern psychologists would call “shadow” things that are never confronted until they suddenly find themselves transplanted to the West with hordes of devoted, beautiful, young followers.\n\nThere’s tons of money available and so on. All sorts of things get triggered which they hadn’t even recognized were part of their makeup. They hadn’t realized that they hadn’t dealt with those things so they indulge in them or fall prey to them. That’s just my theory. There might be other explanations for it but that’s one of the best that I’ve been able to come up with so far.\n\nAnd it doesn’t necessarily mean that morality and higher consciousness aren’t correlated but it’s not like the legs of a stool where you pull one leg and all the other legs follow to the exact same degree. It’s more like really big stretchy rubber bands, where there’s definitely a tendency for morality to correlate with higher consciousness but it’s not tight. It’s like Ken Wilber talks of lines of development. He says the lines can get quite out of synch with one another. One can be highly advanced along one line and relatively immature in other lines.\n\nAlex Tsakiris: Any practical advice you’d give someone in seeking or becoming drawn to a guru? That’s the other part of this. Let me interrupt that question with another question. Talk about the guru process because in our Western culture we can then jump to the conclusion that we should dismiss any thought of a guru or any devotion to a teacher. I don’t think we should go that far, either. What are your thoughts on how we balance that?\n\nRick Archer: I always try to avoid black and white thinking and I think there’s tremendous benefit potentially to be derived from association with the guru. And there also may be a time to leave. There’s tremendous benefit to the chick to be in an incubator for a certain period of time and then there’s a time when they’ve hatched and they should probably get out of the incubator and stretch their wings.\n\nI think any guru worth his salt doesn’t want you to maintain some kind of subservient, dependent relationship with him for the rest of your life. They want you to stand on your own two feet at a certain point. Some gurus will actually kick you out of the nest at a certain point and say, “Go do it on your own.” I would encourage people not to dismiss the guru phenomenon out of hand. If you feel drawn to associating with some teacher, great. But keep your eyes open. It’s so easy to fall into a kind of cult mentality. That will mix it up for you.\n\nAlex Tsakiris: In all seriousness, I think that’s a great service that Buddha at the Gas Pump does, is expose people to a variety of teachers that you can dip in and at a very safe Internet/YouTube level decide a lot of things. You do have that distance. Do you think that is part of what you do? Was that intentional on your part or do you see people using Buddha at the Gas Pump in that way?\n\nRick Archer: I don’t know if it was one of my initial intentions but I’m very aware of it and people do use it in that way. One principle that I’ve gotten more and more clear on as I’ve gone through this process is that we’re all on the journey. I found a St. Teresa quote recently in which she said, “It appears that God Himself is on the journey.”\n\nSo where I used to think of enlightenment as sort of a static, superlative terminus—you get there and you’re totally done, I now see it as never-ending refinement/ enfoldment. There might be some elements of enlightenment or the fundamental element of consciousness itself which in and of itself doesn’t change but the clarity with which that is appreciated and the degree to which that is integrated into your relative life, there’s no limit to that.\n\nI’m not sure if I deviated from your question but yeah, I know why I said that. It’s easy to glom onto a particular teacher and say, “This guy knows it all. He’s the ultimate, perfect master,” or whatever. I would just take that with a grain of salt. You don’t want to be a dilettante necessarily and hopping from teacher to teacher. There can be a value in committing to one teacher. On the other hand, just recognize that teachers themselves are human beings and that they too can be growing and be in need of certain development of understanding or experience or compassion or various human values just as you are.\n\nAlex Tsakiris: I can’t stress enough how great it is to have the opportunity to be exposed to the variety. The whole process puts it in a perspective that you couldn’t get any other way than to have one person dig into these issues one after another with these different teachers. It gives you this ability to get a perspective that you can’t get any other way. I really, really think that’s wonderful.\n\nLet’s switch gears for a minute and talk about the skeptics and how we process the skeptics. It’s interesting to me that for the most part you don’t go there. You don’t need to go there. You’ve just bounced past that and said, “Okay, we don’t need to worry about this first-person experience that says there’s something real here; there’s something worth pursuing.”\n\nBut at another level I’ve found that both because this was my path and maybe because it was my path I’ve bumped into a lot of other people that it’s their path, too. They feel that that’s a bump they need to get over, and that’s what about these other people who are saying, “Hey, this isn’t so. How can this be?” How do we process the skepticism that is out there in our culture?\n\nRick Archer: You know, it’s funny. I anticipated that question and I did a Google search on predictions that turned out to be wrong. There are all kinds of things here.\n\nTelevision. The word is half Latin and half Greek. No good can come of it. Some guy said that in the early days.\n\n“What can be more palpably absurd than the prospect held out of locomotives traveling twice as fast as stagecoaches?” That was in the Quarterly Review of 1825.\n\n“That the automobile has practically reached the limit of its development is suggested by the fact that during the past year no improvements of a radical nature have been introduced.” That was from Scientific American in 1909.\n\nI’ll give you one more. “Where a calculator like the iDIAC today is equipped with 18,000 vacuum tubes and weighs 30 tons, computers in the future may have only 1,000 vacuum tubes and perhaps weigh only 1-1/2 tons.”\n\nIt goes on and on. All kinds of things like that. You know how it is—150 years ago if we get into a time machine and go back and talk to people, like Mark Twain and the Connecticut Yankee in King Arthur’s Court, and try to describe to people what life was going to be like 150 years hence, we would get very few believers. Yet now we all take this stuff for granted. So people tend to get anchored and hypnotized by the culture in which they live and assume that things couldn’t be radically different than that despite all the lessons of history.\n\nThe question of whether we’re entering into a new age and there could be an age of enlightenment right around the corner and all, I think we should be more open to the possibility than many people might be despite the evidence of all the dire situations in the world. History has proven time and time again that things continue to change radically. In our lifetimes the pace of change has been accelerating exponentially.\n\nSo with regard to skeptics, I think when you first invited me to do this interview I thought, ‘Oh, this is going to be some skeptical guy who’s just going to hit me with all kinds of skeptical questions.’ But then when I began listening to your show I thought, ‘This is the kind of skepticism that I consider healthy and that I really enjoy,’ which is to question everything but keep an open mind. The kinds of skeptics that you sometimes run up against are just the flip side of fundamentalist. They’re fundamentalist nonbelievers and then you have the fundamentalist believers. Neither of those are scientific and neither of those are really spiritual seekers in a sincere sense, in my opinion.\n\nAlex Tsakiris: That’s interesting. I guess there are two other ways we can go with that. One is to examine why that position is so popular, because it is. It’s been elevated in our society to the level of really it is the status quo. It would be interesting to explore why we are so drawn to that. Why we are so drawn to materialism, which is really rather obvious.\n\nWe’re drawn to materialism because it makes us feel good. It makes us feel in control. I’m on my computer. I make my computer do what I want it to do. You in your other life own a company that does search engine optimization. What can be better than that? You’re higher in the ranking. You succeeded; you achieved your goal. There’s just an innate attraction that we have to this materialism, and with it goes skepticism of anything that suggests that this world we see, that we can control, isn’t all there is.\n\nAny additional thoughts on our attraction to materialism? It doesn’t go away, right? Just because we have a spiritual awakening, our attraction to this control, this materialism, it doesn’t go away does it, Rick?\n\nRick Archer: No. There are a couple of things from what you said. One is that I think human beings tend to become habituated to whatever they’re experiencing. Year after year after year of only experiencing gross level of phenomena, we kind of get calcified on that level of experience. So anything outside the realm of that experience seems mystical to us or woo-woo and it’s easy to discount it. That doesn’t jibe with an understanding of quantum physics but most people don’t study quantum physics.\n\nA lot of times people like Eben Alexander, who you had on your show, they are of that mindset and then they have a mystical experience whether through near-death or whatever. Not in Eben’s case but other people. It’s psychedelics or whatever. Then they realize, whoa—there’s actually more. I was just scratching the surface here. So I think if skepticism and materialism is the predominant mindset it must mean that the majority of people in the world are locked into that level of experience.\n\nBut it seems to me that we’re in a time now when deeper levels of experience are becoming more and more common. We’re not living in an Ozzie and Harriet world anymore, you know? This does look like Kansas, Toto. Right and left, people are awakening to deeper realities. It’s becoming a cultural epidemic, I would say. There probably will come a time and there probably have been times, if not on our planet then certainly on other planets—we can get into that—where an appreciation of the full range of creation, full range of reality, is the norm.\n\nIt’s like in the summertime. You can dive into the lake and go nice and deep. In the wintertime you’re limited to ice fishing. If you cut a hole and drop a line maybe something tugs on your line but you don’t really know what’s down there. So most people are sitting on top of the ice, but the ice is thawing and I think a time will come when we’re all accomplished scuba divers and we can explore the whole lake, top to bottom.\n\nAlex Tsakiris: That’s awesome. But let me jump over on the other side and play Devil’s advocate a little bit. One of the real discoveries for me that saddens me but propels me forward and gives me hope of understanding things a little bit better is to understand that the skeptics aren’t just what they seem to be, either. The skeptics are serving a function and a function that our culture has ordained and our system of capitalism has promoted.\n\nThat is if you look closely at the skeptics, they’re not so much skeptics as defenders of the status quo. So you take any topic—they’re on the side of the status quo. If it’s genetically modified foods you could say, “Where do the skeptics stand on that?” Well, they stand with Kellogg’s. Or if you talk about vaccines, they stand with big pharma. If you talk about global climate change, which I think is interesting and a topic I want to get into, they stand on yeah, it’s happening even though you could make the case of real skepticism would be where is the proof? Show me the evidence.\n\nCertainly at this point—to dive into that a little bit—clearly the evidence has come forward that it was all along no more than a multi-trillion dollar sham to try and create a global carbon trading business. Whatever science was behind it, it was really being propelled by people who stood to make just a ton of money by trading carbon credits. That’s what was driving whatever science was behind it or whatever reality was behind it.\n\nRick Archer: So you’re saying you’re actually a climate change denier?\n\nAlex Tsakiris: Well, at this point there’s nothing to deny anymore. The most recent data that’s come forward that is ordained by the UN and everyone else shows that clearly in the last six or seven years there hasn’t been any increase in temperature of any substantial amount that would support the model of the carbon reflective kind of thing. Rather than say “carbon denier” or “climate change denier,” what I prefer to look at is what the underlying systems are that are driving this and are they real in the sense that we think they’re real and pulling that apart.\n\nIn this case, I don’t have to choose denier or believer. I just have to say the reality is there was this element that stood to make trillions of dollars by trading carbon credits and the only way that was going to advance was by advancing this science. Now the science has come out and said that the old model that we had didn’t work and that’s why we go towards a different model. But I don’t want to get too far into this.\n\nRick Archer: Yeah, I could get into a whole debate with you on that and I’m not the best qualified person to do it. The temperature in the Antarctic has risen 10 degrees. I don’t exactly know the timeframe but the penguin populations are dying. The ice is melting. Greenland is melting like crazy. To me and 95% of the climatologists whom I don’t believe stand to make any money from creating carbon credits are on the side of global warming being real. I’m surprised to hear that you’re almost fundamentalistically assertive about the fact that it’s a hoax but…\n\nAlex Tsakiris: I didn’t say it’s a hoax. And let’s not get too far into that data because it’s a whole other discussion. It would be an interesting show to have. I’m just going with the best data that I’ve seen that says the models that we have just don’t stack up in terms of the kinds of decisions we’ve made. But let me broaden that.\n\nRick Archer: The best way to leave that? Get some really respected climate scientists on your show who assert that climate change is real and you guys have a debate about it because I’m not qualified.\n\nAlex Tsakiris: I’m not going to do that because I’m not qualified and that’s not my show. My show, though, does say that we have to look beyond the surface-level explanation for things. We have to dig into that. I guess I would also tie that back from a spiritual teacher standpoint to this idea of activism. We can take that little discussion we just had and then look for it as it bubbles up in terms of activism. What should I do as part of my spiritual awakening? Should I go advocate a certain position? Should I get involved in a political way about making change in something?\n\nLet me stop there and ask what you see as the link and the responsibility for spiritual development, spiritual awakening, and activism, mainly political activism?\n\nRick Archer: I’ve had people on my show who claim to have had a spiritual awakening, an abiding one, who are all across the political spectrum. Some very conservative, but I would say most liberal. An article just came out recently about some studies showing spiritual awakenings tend to shift one in the direction of more liberal political views. I can’t cite the study off the top of my head.\n\nAs far as what one should do…\n\nAlex Tsakiris: Not what one “should” do, Rick. Should one do? Is activism part of a deeper spiritual growth?\n\nRick Archer: I think it depends on your dharma. I think some people should be just working a job and taking care of their family if that’s what they feel called to do. Or be a musician. Or be a scientist. Join Doctors Without Borders or go a march on Wall Street. People have different inclinations so I wouldn’t want to suggest any universal prescription or even suggest any universally valid correlation between spiritual fulfillment and political or ecological or social activism. I do tend to think that political and social and ecological activists tend to be more sensitive, refined, aware people but that’s just my observation. It’s like different strokes for different folks. I couldn’t give you a pat answer.\n\nAlex Tsakiris: It’s interesting because an ongoing philosophical debate/discussion between my wife and me always centers around this one spiritual story that was shared to me through Ram Dass’ book about his guru and a very important spiritual teacher to me, Neem Karoli Baba.\n\nRam Dass tells this story of Neem Karoli Baba sending him on a mission with this one woman to go deliver this medicine to these children. They get to a pass and a guard stands there and says, “Pay me. Bribe me. Give me a bribe in order to get through the pass.” And Ram Dass says, “Hey, we can’t bribe this guy. That would be dishonest. That would be immoral. We can’t do it.” And his friend, his Dharma sister says, “Are you nuts? We get this medicine down to these kids and they’re not blind. We don’t get it down there, they’re blind. We pay this guy a few rupees. What do we care? We’ve got to get this medicine.”\n\nI see that as such an interesting story because it encompasses to me all the complexity that we’re talking about in terms of activism, in terms of doing or in terms of not doing. I don’t know that there’s an answer that I latch onto in that dilemma but I do think it sums up the question of when we take action and do we have to be careful about the action that we take? Any thoughts on that?\n\nRick Archer: Some stories from The Mahabharata come to mind. There are all sorts of stories in which Lord Krishna, who’s supposed to be the embodiment of God, cajoles the Pandavas—Arjuna and his brothers—into bending ethics in order to accomplish certain things. There was a point in the battle where this elephant named Ashwatthama had been killed and Yudhishtra, the head of the Pandavas, Krishna had him call out, “Ashwatthama is dead,” because Ashwatthama was also the name of the son of this other warrior. The other warrior was completely crestfallen as a result of that announcement, not knowing he was referring to an elephant, not his son.\n\nSo the Vedic literature is full of all of these paradoxical conundrums where right and wrong is no longer and black-and-white as we would like to think it is. It stretches you to read that stuff. So yeah, I hear what you’re saying. It can take a thorn to remove a thorn. Your story about Ram Dass and the medicine is the perfect example.\n\nAlex Tsakiris: See, I’m more drawn to Ram Dass in that story. I’m more drawn to be very careful about the unintended consequences. Back into climate change–be very careful about buying into the idea without exploring the great force of end justifies the means thinking. I think we live in a culture and a society and a United States government that has conditioned us to believe that a little bit of torture, maybe that wasn’t such a bad thing. So we had to bomb Baghdad? We killed thousands of innocent children walking to school. Well, in the grander scheme of things, we’re still the best place on Earth to live.\n\nNot that we aren’t the best place on Earth to live. I haven’t seen all other places so I don’t know. But I think this end justifies the means thinking…\n\nRick Archer: I think you’re right. You’re totally right. All this stuff is murky waters, you know? It’s not black and white. None of us is spotlessly pure and none of us is utterly evil. We’re speaking in generalities here. We sort of have to deal with each situation as it arises to really make sense of it. I don’t know. It’s hard to give flip judgments on stuff.\n\nOn an issue like climate change, if Antarctica were to melt we’d have a 600 foot rise in sea level which would kill billions of people. So this stuff is serious business. There could be people with ulterior motives to trade carbon credits and make billions of dollars or whatever but that doesn’t necessarily mean that the principle of the thing is wrong just because some people are trying to cash in on it.\n\nAlex Tsakiris: True enough. I tell you what. You’ve touched on another topic I really, really want to get into because it’s another one that is often swept under the rug but is really bubbling underneath the surface of spiritual advancement. That’s the idea of evil and good and whether there is such a thing as evil. Let’s stop right there and tell me how you sort that out.\n\nRick Archer: I sort that out with the understanding that if you’re going to have a relative creation apparently—maybe it could have been some other way but the way it apparently is is that you have to have pairs of opposites. You have to have polarities. If you’re going to have hot you have to have cold. If you’re going to have fast you have to have slow. And if you’re going to have good you’re going to have to have evil. You can’t live in a dualistic universe without those pairs of opposites. So that’s the short answer to your question.\n\nAlex Tsakiris: Let’s take the next logical step. There’s evil. Evil exists. We see it all around us. We therefore in the process of saying something’s evil, we’re saying there is good. Are we also saying that there is a moral imperative? We’ve already talked about morals. Are morals real? Are there universal moral truths that we should follow?\n\nRick Archer: I don’t know if I’m qualified to answer that but…\n\nAlex Tsakiris: Are any of us? That’s God’s question but let’s bring it down.\n\nRick Archer: What I do feel often happens is that we anthropomorphize God. I was listening to an Atheist on Bill Moyer’s show not long ago and she was saying there couldn’t be a God because look at all the horrible stuff that happens. Why would God do horrible stuff? She’s humanizing God. She’s saying He should be like I would want a person to be. But if we understand God to be this omnipresent, all-engulfing intelligence that entertains itself by spinning worlds within itself and playing within those worlds, appearing to lose itself and rediscover itself, then anything from Auschwitz to Shangri-La are possibilities.\n\nBut one more proviso on this. This again is my personal perspective. I do feel that the universe is one big evolution machine. I’ll tell you what I mean by that. Presuming that the cosmology is right and it starts out with some kind of Big Bang and then over billions of years stars form and eventually those stars live out their lives and explode and create heavier elements and those heavier elements eventually find their way to planets and eventually evolve into bodies–every particle in our body was once in a star. There seems to be this evolutionary direction to things which appears to be moving in the direction of self-recognition of the intelligence which gave rise to the whole thing in the first place.\n\n“I am” may have become many. The Oneness needs duality in order to create structures through which it can enjoy itself as a living reality not just as an unmanifest reality. So that may sound kind of abstract but in terms of morals that’s too human a term for me. In terms of there being an evolutionary direction of things in the direction of greater and greater capacity for the intelligence which gave rise to the universe to express itself and reflect itself in a living way, that seems to be the tendency.\n\nAlex Tsakiris: You may be right. Abstractions may be the only way we can deal with that. Let’s try and pull it back down. You mentioned Eben Alexander a minute ago. Of course, he wrote a New York Times bestselling book, Proof of Heaven, after having a near-death experience. He’s a neurosurgeon, highly, highly regarded, Harvard Medical School and all that. He’s converted, as you say.\n\nHe comes back and tells us—and we can lay this down along all the spiritual teachers and enlightenment-seekers you had on Buddha at the Gas Pump and compare and contrast—he comes back with very concrete answers. Is there a moral imperative? Yes. Are we meant to do good in this way? Is love good? Is caring for other people good? Yes, these are good things. Is there a God? Yes. Is there Heaven? Yes. And not leaving out the possibility that there’s more but that there is this state.\n\nI’m not saying that I agree with him and I’m not saying I disagree with him.\n\nRick Archer: I agree with him. I can agree with all of the things you just said. I was taking it out to a more abstract level; a more kind of cosmic universal level and attempting to explain why the bad stuff seems to be happening and how everything is moving in a certain direction. That doesn’t contradict the things that Eben Alexander just said. It’s definitely better to do good than bad. All the things you just said—I won’t reiterate them.\n\nAlex Tsakiris: Okay. Then let’s jump over on the other side. One of the debates that seems to really drive people nuts…\n\nRick Archer: Oh! Let me just add one more thing. The reason it’s better is it actually serves the purpose of what I was just describing. It’s more conducive to the evolution of the life form that you are. It cultures your nervous system in the direction of greater refinement rather than coarsening and crudening and deadening it if you do the positive things rather than the negative things.\n\nAlex Tsakiris: That’s a good working hypothesis. I’ll leave it at that. So let’s talk about demons. Let’s talk about the Devil. That stirs up a lot of controversy with folks. It’s amazing to me that I can talk about these other issues that we just spoke about and you get a different kind of skepticism. A different kind of push-back. I don’t have any direct experience with demons or evil beings or negative beings or any of that stuff but I’ve encountered enough people on the show who have said, “This is a reality that I encountered because I went outside of my body and this is what I saw. This is what I experienced.” What do you make of that?\n\nIn the last couple of shows I’ve put it in this context of do we live in a demon-haunted world? Is that another aspect of our experience that we have to—I don’t want to say worry about but we would worry about it. How do we deal with that?\n\nRick Archer: First of all, I’ve had a couple of experiences in both sides, positive and negative. It could have been written off as dreams but they seemed real at the time. We’ll talk about them if you want. But secondly, the broader principle is that this whole idea of there being subtler realms of creation that we’ve alluded to and we’ve used physics as an example—in terms of our actual capacity to experience them, there are subtler realms of creation. Those who do experience them may encounter various forms of life that dwell on those levels, and dwell exclusively on those levels whereas human beings are able to traverse the whole range in terms of their experience.\n\nThere are certain types of beings which only live on certain subtle levels, astral or celestial or so on. Jac O’Keefe—I don’t know if you watched my interview with her but she was sitting in a pub in Ireland having a beer. She was an Atheist. All of a sudden, kapow! She saw spooks all over the room, floating in the air. Totally freaked her out. You can listen to her interview for an elaboration but it opened her up to this whole world of possibilities that she didn’t know existed. One thing led to the next and she eventually got onto becoming a non-dual realizer and teacher.\n\nBut anyway, that’s my take on it, that there are numerous strata of creation and the subtle strata may contain beings both positive and negative. That is open to experiential verification.\n\nAlex Tsakiris: Yeah, you’ve got to go there. Tell us.\n\nRick Archer: Oh, in terms of my own experience?\n\nRick Archer: I believe in a lot of things I haven’t verified experientially, like the whole UFO phenomenon. I think it’s real but I have no direct experience of it. In terms of these two little experiences, and again they could be written off as dreams but they seemed very vivid.\n\nOne was I was in Biarritz, France on a meditation course, doing a lot of long meditations. It was kind of stormy but there was something kind of ominous about the storminess. Maharishi told us to keep our windows closed and I, being a rebellious sort, opened my window because I wanted the fresh air. During the night this witch-like being came and attacked me and started grabbing at my neck. I started mentally doing a puja, which is a ceremony of gratitude, and the positivity of that dispersed that influence. That totally could be a bad dream. Who knows? But there’s something more to it, it seemed.\n\nThe positive one was maybe five years later. I’d been meditating about a dozen years at this time and again, I was asleep. I had this experience where I was taken by the hand and led into a room by what seemed to be a benign being. I was asked to lie down on my stomach on a pallet and hold onto some handles. I was then worked over, up and down my spine, with some kind of implement. It was excruciating and incredibly intense but I held on for dear life and I came up out of this thing with the most profound metamorphosis I’d ever experienced.\n\nThere was this sense that I had been bound with iron bands all of my life and that those bands had been broken. There was tremendous relief and gratitude and bliss. Really, it was an awakening to the self, to the absolute. I was completely grounded in that and living in this state of wonder for days afterwards. It almost seemed like a kind of intervention by some kind of subtle and very benign intelligence. Again, it could be written off as a dream but that was my experience.\n\nAlex Tsakiris: That’s a great story. Hey, Rick, I know this is probably like picking favorite children but for folks who are new to Buddha at the Gas Pump and are going to dip in—of course, they should go wherever they feel they’re drawn but–give us a sampling of some of the shows that you think your new listeners might find most interesting.\n\nRick Archer: Oh, there are so many. I don’t want to play favorites because I really like all these people and I form a bond with them. I’m calling up my site so I can scan down a list.\n\nAlex Tsakiris: That’s an unfair question so let me ask it a different way. What are some of the most popular shows that other folks have found?\n\nRick Archer: Okay, starting at the top of the list, Adyashanti was one of the most popular and has had a lot of hits. And Anita Moorjani, who had the near-death experience. You probably know of Anita. She was very popular. Mooji is a great guy, a beautiful teacher and his interview was very popular. I particularly like a good friend of mine, Igor Kufayev, who’s Uzbekistanian and we’ve become good personal friends and have gotten together at a conference and all. I did two interviews with him. Ellie Roozdar, a very sweet woman from Iran. People really liked her. A lot of people liked the Gangaji interview.\n\nNo slight to the people I didn’t mention. There are 163 of them now. Those might be a good place to start.\n\nAlex Tsakiris: As we wrap things up here, I want to hear any other thoughts that you have on topics we might have missed. And there’s a great Zen idea that was shared with me by a listener. I’ve heard it before but it was great to be reminded. I’d like to hear your comment on it.\n\nIt’s “Before enlightenment, fetch water and chop wood. After enlightenment, fetch water and chop wood.” What does that mean to you? Do you ascribe to that? How do you take that?\n\nRick Archer: Yeah, it just means that the relative aspects of your life are not going to necessarily undergo an obvious transformation when enlightenment dawns. You might still be working in the same job and married to the same person and raising the same kids and everything else. But there’s an inner transformation which could be quite dramatic if somebody else were able to step into your shoes and see through your eyes. They would realize that something incredibly profound had taken place but it wouldn’t necessarily be apparent on the surface.\n\nAlex Tsakiris: That’s awesome. I also take it a slightly different way and that’s that to the extent that I see myself as different, I’m falling for the trap, too. What I was is still there, too, so I have to keep fetching water and chopping wood because that’s what I am in this body and we’re going to be on this mission for as long as we’re given this time. That’s what we do. We fetch water and chop wood.\n\nRick Archer: Yeah. If you don’t you’re going to get thirsty and freeze.\n\nAlex Tsakiris: Rick, tell folks anything else that we might want to know about Buddha at the Gas Pump. Any thoughts you have about where the show might be going. Any conferences like you just mentioned that you might be at. And how can people get in touch with you?\n\nRick Archer: I’d like to throw one thing out before we do that because that’s a wrap-up point, if you don’t mind taking another few minutes. It’s a little game that I play with myself all the time. I find myself doing it quite spontaneously. I call it Cosmic Zoom Lens.\n\nHere’s the game: zoom out to the level of perspective where you can watch the Andromeda galaxy collide with the Milky Way over the next 8 billion years. Realize, of course, that that’s actually a very, very tiny localized event compared to the whole universe but it’s big enough for our purposes here.\n\nThen imagine as you watch that over 8 billion years all the trillions and trillions of lives playing themselves out on all the inhabited planets in those galaxies. Each one of those lives seems very real and serious to the person living it, but from that perspective they’re like little fireflies winking in and out, even faster than that. Billions and trillions of little strobe lights going on and off.\n\nNow zoom it down, past the human level down to the level of the plank scale and you discover there is no universe. It’s just all a field of pure potentiality in which even a cubic centimeter of empty space at that level has more energy than all the energy in the entire manifest universe. Just incredible potential. That’s essentially what you are.\n\nNow zoom it back to the human level and here’s what you are in expressed form, in a manifest, living form. But this perspective as a human being is no more real really than the zoomed out cosmic perspective or the zoomed in plank scale perspective. Those are just different perspectives on reality. We just have a peephole as a human being. Just a little peephole and yet we can actually culture an awareness that is cosmic like that. That does transcend time and space. That’s vast. That’s eternal. That can be our living reality. That can be the sort of substance of our lives.\n\nThat’s what enlightenment is all about, which is the question you started this interview with. It’s not a pipedream; it’s not a fantasy. It’s something that many people have lived throughout history and something that we would have a very interesting world on our hands if it were commonplace. All the problems and travails that beset us as a civilization today would be just distant memories if that were a common experience.\n\nAlex Tsakiris: A rather optimistic view of things. That’s wonderful that things can get better. I guess you said before that you believe that there is a movement towards things moving in that direction. That is your sense of things.\n\nRick Archer: And that plays into your previous question about Buddha at the Gas Pump. Yes. I feel very unscientifically and perhaps anecdotally that there’s definitely a movement in that direction. There’s a quickening. There’s an awakening. It’s going like popcorn.\n\nI remember when I was a kid I saw a science show on TV where they had a whole big room full of mousetraps that were all set. Each mousetrap had a Ping-Pong ball on it. I think it was meant to illustrate nuclear fusion or something. They set off one mousetrap and the Ping-Pong ball bounced and set off another mousetrap. Pretty soon the whole room was just mousetraps going off with Ping-Pong balls flying everywhere.\n\nSo I think there’s a kind of epidemic taking place. We can speculate as to the causes of it. It might be just that there’s a bubbling up from the basis of life that’s just as if the ground in a forest somehow becomes more nutritious with some rain or something. All the plants start to thrive. Or it could be somehow that the plants themselves are helping each other to stretch the analogy that one awakened person is helping to awaken other people.\n\nBut whatever the mechanics, I think it’s happening and I feel totally optimistic. I don’t get bummed by the various dire predictions for the world because I feel that, as we also said earlier in the interview, radical transformations can take place in society which are totally unforeseen by the vast majority of people. Maybe wishful thinking but I feel like we’re on the cusp of such a transformation. It may not even come in our lifetimes but it very well may. Whether or not it does, it can come in any one individual’s lifetime. We don’t have to wait for the whole society to transform. You can enjoy heaven on Earth now, yourself.\n\nAlex Tsakiris: Great, great. I think that does tie in to your mission, what you’re doing at Buddha at the Gas Pump, which again is great. You’ve got to go check it out. I think you should just let serendipity take its course. Pick a couple of interviews and see if you get hooked.\n\nWhat’s coming up for you with the show? Any future changes or new directions? What about conferences or if people want to connect with you personally?\n\nRick Archer: There’s contact info for me on the site, although I have to be a little bit restrictive as to how much I can engage in email with people because I do have a fulltime job. Sometimes people send me big, long things. I don’t even have a chance to read them, much less to respond to them. I don’t mean to be rude, you know, but I work fulltime and I do this on top of that. I have a family and other things.\n\nSo I can’t interact too much with people but I will be at a conference this fall, the Science of Non-Duality conference in San Jose, California. I’ve gone for the last two years and it’s been a lot of fun. A number of Buddha at the Gas Pump listeners are going to try to get out there so we can have our own little conclave within the conference. So www.scienceofnonduality.com if you want to check that out.\n\nAs far as plans for the show are concerned, I’m still waiting for Oprah to call. She hasn’t called yet for some reason. I figure I could do Super Soul Monday.\n\nRick Archer: I’m 63 years old. I don’t feel like working for the rest of my life at something that is not intrinsically meaningful to me. As much as people need search engine optimization, there are others that can do that for them. I would enjoy having this morph into something that could support me fulltime and I could do it until the day I die. It’s like one of those things where, would you keep doing what you’re doing if you won the lottery? Most people would quit their jobs. I certainly wouldn’t quit doing this. I would do it more.\n\nAlex Tsakiris: That really says it all. It’s a wonderful site, a great, great service. It’s tremendous that this has been enabled by the Internet and that that opportunity has been taken advantage of and filled in. We live in a wonderful age and it’s shows like this, Buddha at the Gas Pump, that make it possible for us to really celebrate the materialism and some of the stuff that goes with it.\n\nIt’s been great having you on, Rick. Thanks so much for joining me on Skeptiko.\n\nRick Archer: Thanks, Alex, it’s been great. We’ll be in touch. I’m going to keep listening to your show and I’m really enjoying it.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rick Archer From Buddha at the Gas Pump on Meditation and Spiritual Practices", "description": "Interview with Rick Archer host of the website and Youtube channel, Buddha at the Gas Pump. Join Skeptiko host Alex Tsakiris for an interview with Rick Archer of, Buddha at the Gas Pump.  During the interview Archer talks about a thought experiment he uses to better understand our place in the universe: Rick Archer: Here’s […]", "url": "https://skeptiko.com/rick-archer-buddha-at-the-gas-pump/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2013-03-26T15:20:00+00:00", "article:modified_time": "2017-07-25T20:06:03+00:00", "image": "https://skeptiko.com/wp-content/uploads/2015/07/206-RICK-ARCHER-BUDDHA-AT-THE-GAS-PUMP-yt-e1435774636263.jpg", "image:width": "560", "image:height": "315", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=FhEAbmpRG38", "https://skeptiko.com/rick-archer-buddha-at-the-gas-pump/batgap/", "http://batgap.com/about/", "https://www.youtube.com/watch?v=FhEAbmpRG38", "http://www.skeptiko-forum.com/threads/206-rick-archer-from-buddha-at-the-gas-pump-on-meditation-and-spiritual-practices.2383/", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-206-rick-archer.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-206-rick-archer.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-206-rick-archer.mp3", "http://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-206-rick-archer.mp3", "www.scienceofnonduality.com%20"], "authors": ["Alex Tsakiris"], "publish_date": "2013-03-26T15:20:00+00:00"}