{"result_id": "273025", "URL": "https://skeptiko.com/andy-paquette-total-election-control-582/", "timestamp": "2023-04-25 17:08:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/andy-paquette-total-election-control-582/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Andy Paquette, Total Election Control |582|", "cleaned_text": "Andy Paquette… author, artist, researcher… cracks the code NY elections database… looks like total control of the process.\n\n[00:00:00] Alex Tsakiris: Um, this episode of Skeptiko, a show about getting it done the old fashioned way\n\nwhat’s it all about? America? Jesus, freedom. Say it again. America. Jesus. Freedom. What does that mean? Shit, I don’t know, but the people sure love it when I say it. and the newer way you have 30,000 people that were purged and voted.\n\n[00:00:33] Andy Pacquette: So after doing a lot of research and identifying suspicious records, , I made requests of what we call the, , canvas team. , in one case, this lady told, , our canvasser, you know, this has my three registrations all on the same two days, one right after the other, a year before I actually registered to vote. And I know this because I was pregnant when I went in there to register.\n\n[00:00:55] Andy Pacquette: And my one-year-old son is in the house right now,\n\n[00:00:58] Andy Pacquette: Individual voters are totally incapable of doing this. You can’t, you have to have access to the official database to do it.\n\n[00:01:05] Alex Tsakiris: That first clip was from my favorite election movie of all time campaign with Will Farrell and Zach Galifianakis. And the second was from today’s amazing guest, Andy Piquette.\n\n[00:01:16] Alex Tsakiris: Man, this dialogue went on and on. So I actually broke it into two, cuz we’re really kind of two completely different subjects. But I think you’ll enjoy both of them. Remember, don’t get too sucked into the drama. It’s just a show.\n\n[00:01:30] Alex Tsakiris: Welcome to Skeptiko, where we explore controversial science and spirituality with leading researchers, thinkers, and their critics.\n\n[00:01:38] Alex Tsakiris: I’m your host, Alex Tsakiris, and today we welcome Andy Paquette back to Skeptiko. You know, Andy, I wanted to start with little story and, uh, I don’t know if I’ve told this, I’ve told it to you, but I don’t know if I’ve told it on air, but, Trish and Rob McGregor, who have, you’re kind of well known in the paranormal parapsychology, written over a hundred books, buddies with George Lucas, you know, kind of thing.\n\n[00:02:04] Alex Tsakiris: They heard an interview that we did, that you did for me, and they said, gosh, we gotta have that guy on. So they interviewed Andy, and at the end, exact quote, uh, Trish goes, I think Andy might be the most psychic person I’ve ever met. Now, I mean, that’s pretty amazing, especially when you, uh, if you read her books or listen to all, I mean, she, she always has these stories of these incredible people that she’s met.\n\n[00:02:33] Alex Tsakiris: what’s really, really extraordinary about you, Andy, and I’ve shared this before, but let me share my screen for a second.\n\n[00:02:38] Alex Tsakiris: So if, if anybody wants to go, and I think you will wanna go Pa P a Q. A r t.com, drawings, paintings, commercial art, Hollywood, you know, doing computer graphics on, what was that? What was the biggest movie you ever did?\n\n[00:02:57] Andy Pacquette: Well, it’s hard to say. I mean, I, I worked on Space Jam and Spider-Man and Daredevil, , and then some smaller ones.\n\n[00:03:03] Alex Tsakiris: So then you have this, , incredible photography that you do, , commercially in New York, you know, like major thing.\n\n[00:03:10] Alex Tsakiris: And then along the way you kind of get a PhD just cause, just cuz you wanted to I guess. And then, , so we’re not gonna talk about any of that today, cuz what we’re gonna talk about is Art Zark, because, , , it was more than a year ago.\n\n[00:03:31] Alex Tsakiris: You contacted me about this topic that we’re gonna talk about, and I immediately realized that you had done. I think a lot of people just find to be impossible, and a lot of people at the end of this might still think is impossible, but at the time I thought, wow, this is so, so big and such a huge story that I, I love that Andy is sharing it with me, but there’s no way this is ever going to make it on Skeptiko.\n\n[00:04:01] Alex Tsakiris: This is going to be a national news story. He’s going to be contacted by all the major news outlets. This is just too big. And if anything, I was kind of worried about your, your safety because it was such a huge story and such a, uh, important story. Of course, . Here we are, a year and a half later, a tiny little Skeptiko getting out.\n\n[00:04:29] Alex Tsakiris: What is really just an amazing, amazing story and, , my spin on it, of course is always gonna bring us back to the spiritual in some way. The questions of, uh, why evil matters, who are the characters really behind that in terms of that larger spiritual perspective, which you are so much about as well, even though it isn’t gonna come out directly in what we’re gonna talk about.\n\n[00:04:57] Alex Tsakiris: So with that, I don’t know, I wasn’t trying to tease this thing, but with that, I guess maybe you should tell us how you wound up with like the first time I talked to you, I remember you said, I just downloaded the database. I have a database of all the voters in New York, like 8 million voters or something like that.\n\n[00:05:21] Alex Tsakiris: I, I mean, I, what, what is the, what is the starting point that we should start with this\n\n[00:05:26] Andy Pacquette: whole. Okay. First off, I hate to say this, but in your intro, I’ve been wanting to like kind of stop you and, and say something and, and hopefully not horrify you too much, but I, I wanted to do this as Dr. Zark without connecting it to Andrew Paquette.\n\n[00:05:40] Andy Pacquette: Uh, is that too late?\n\n[00:05:42] Alex Tsakiris: Too late? Everybody knows you Andy. Everybody in Skeptiko land totally knows you. I mean, you can’t, it, you shouldn’t. I think, again, I thought about that cause we talked about that in pre-interview. No, the story is that now we, we can talk about this. It’s okay to talk about it. You’ve published on it.\n\n[00:06:01] Alex Tsakiris: You’ve published on it, you’ve done public presentations on it. You, you’re, you’ve outed yourself. There’s no need. We don’t have to make a big deal out of it, but yeah.\n\n[00:06:10] Andy Pacquette: , so how it started was I had come to New York to, , start up a commercial photography studio.\n\n[00:06:16] Andy Pacquette: Okay. And I’d invested quite a lot of money on that too. It was not cheap to do this. And, uh, I did that right after I got my PhD because, uh, well in part what happened was I was working on a PhD at Kings College London and I realized I don’t like doing this. This is not any fun. Okay. , I, the research and my dreams was fine cuz I was doing it for my own purposes.\n\n[00:06:36] Andy Pacquette: And I kind of wanted that information. I wanted to understand that information. But the research I was doing for the PhD, I was thinking, okay, as soon as this is done, I’m never doing this again. This is it. Okay. And at the same time, while I was working on the PhD, just to kind of relax from all the, the pressure of teaching full-time and doing a PhD and traveling to London all the time to do it.\n\n[00:06:57] Andy Pacquette: Um, I had picked up photography and I’d started getting clients and I thought, you know what? This is what I wanna do. I’m gonna quit my job. I’m going to, uh, as soon as I have the PhD and I’m gonna move back to New York and I’m going to start a commercial photography studio, that’s what I wanna do. So I came out here and, um, as I’m sure you understand, setting up any kind of a business, it takes you a little while, right?\n\n[00:07:17] Andy Pacquette: And then you start getting your clients, and then you get more clients and then you’re going concerned. And I expected that. So I’d saved up some money, and I was able to last quite a while. Um, so I figured it’d take me at least a year before I was even at point of first contact for a client, and then maybe another year, and I’d start having a, a low level of client.\n\n[00:07:36] Andy Pacquette: But it would, it would get me, , where I needed to be so that I could have a continuing stream with them. So, , about 18 months later, I got my first client, and then shortly after I got another one, and then the pandemic hit okay. And then all of a sudden everything was shut down. The studios were shut down.\n\n[00:07:52] Andy Pacquette: I couldn’t access clients. The, the crews I would have to work with in New York were unavailable. And even if they were available, there was nowhere to shoot. It was like, everything just stopped. Okay. And I. I was just, I was sitting there and I was thinking, this can’t be happening. And yet it was. So I thought, okay, fine.\n\n[00:08:09] Andy Pacquette: , I can’t do any business, so I’m just going to take pictures of, you know, fun stuff. So I was taking pictures of diners and farms and churches and, you know, anything I thought looked really American, you know, uh, I also wanted to do a series on, uh, tractor trailers, which I haven’t done yet. And, uh, uh, truck stops and things like that.\n\n[00:08:26] Andy Pacquette: But anyway, so this is what I’m doing when I see , a podcast, , that was talking about audits across the country. And the thing is that, that got my interest and the\n\n[00:08:38] Alex Tsakiris: reason they got election audits, this is after, after the 2020 election. And this was just about the hottest topic. You couldn’t go anywhere without the whole, and then it’s, it evolved into the whole January 6th and the whole thing.\n\n[00:08:53] Alex Tsakiris: But if we gotta go back now, cuz it’s, the calendar has flown by, it’s easy to forget what a central issue this was gripping everybody. And, and by the way, you know, this is the, at the time Google comes out, and says, Hey, the only thing that is verboten we are not allowing is any kind of searches about election fraud , or vaccines.\n\n[00:09:16] Alex Tsakiris: We’re the two, two things that, that they just said, which is strange in part of this story, but just to put it in context, it’s about the.\n\n[00:09:25] Andy Pacquette: Well, yeah, it was, and here’s the thing, when I moved to New York, I was thinking, okay, I’m moving to a blue state. So when the election happened, I’ve got that in my mind I’m thinking, this is a blue state, it’s a stable blue state.\n\n[00:09:37] Andy Pacquette: They don’t need to commit fraud. They will win anyway because they have so many people who vote that way in this state. So I w really was assuming that New York was gonna go to all of the Democrat candidates. It didn’t strike me as at all unusual when that happened. What struck me unusual though, is the night of the election, I was in bed watching the election returns on my iPad, and I saw Trump had more than a half million vote lead in Pennsylvania, and he had about a half million vote lead in Wisconsin.\n\n[00:10:05] Andy Pacquette: He had these huge leads in the states that were gonna determine the election, and there was no way after the polls closed that anyone was gonna catch up to that. That just wasn’t gonna happen. He was gonna win. And that’s what I was thinking when I went to bed. , and I went to bed at like three o’clock in the morning or four o’clock in the morning anyway, , but when I woke up, they were all saying Biden was the winner.\n\n[00:10:25] Andy Pacquette: And I was sitting there thinking, how, how, how on earth do you make up that many votes? That was the thing that was puzzling me, uh, so much, especially because they said they closed all the counting centers. It’s like, so, so you stopped counting and you woke up the next morning and all of a sudden there’s a half million more votes in there and it puts you over the top.\n\n[00:10:42] Andy Pacquette: And now the guy who is the winner last night, it’s the loser. It didn’t make sense to me. So anyway, , so I heard about a group that was, , going to try and audit the election here in New York, , right around August. And I thought, you know what? I don’t have anything else going on. And my wife was saying, you gotta do it.\n\n[00:11:00] Andy Pacquette: You gotta do it. You just have to know. And I was like, yeah, I do kind of have to know. So I, I, I signed up. , and one of the first things that happened was they asked me to. research director, which surprised me because I, I, I was like, how do you know that I would be qualified to do that? , it, it just didn’t make any sense to me.\n\n[00:11:16] Andy Pacquette: And I, I have a feeling my PhD helped a little bit, but I’m sure they had other people with advanced degrees that were, , on the team too. I, , now my current theory is I might have been like the only guy at the moment at that time that had applied, cuz apparently I’m like one of the first people on the team without realizing it.\n\n[00:11:33] Andy Pacquette: This is what always happens when you’re second, you think the first guy was there forever, you know what I mean? So, , but in fact the group had just put, uh, put themselves together\n\n[00:11:41] Alex Tsakiris: So this is the group New York Citizens Audit that you joined. So Auspiciously and then, yeah. So, so what happens next with the database?\n\n[00:11:51] Andy Pacquette: Okay. Well, first thing was, uh, we were supposed to, I, I told them, I said, look there.\n\n[00:11:57] Andy Pacquette: Nothing to, there’s no research to conduct until we have data. We have to have data, so you have to ask for it. So we need to get, um, the, uh, the databases for all the counties. And at the time, they had somebody handling the, , those kinds of requests. They’re called FOIL requests in New York, which stands for Freedom of Information Law.\n\n[00:12:15] Andy Pacquette: And, , they sent them out to all 62 counties, and I think it took maybe a couple months, , before we got it.\n\n[00:12:22] Alex Tsakiris: And, and, and can I just pause here for a minute? Minute because this is, uh, I gotta say, this was surprising to me that there, there’s a database that, , you can access as part of a foya FO in, in New York.\n\n[00:12:35] Alex Tsakiris: , I always kind of thought all this stuff was, was private, but then when you think about it, there would be a public interest in it. So what, real briefly, what is the law? What is the database? What can you get out of the database as being a citizen of New York?\n\n[00:12:49] Andy Pacquette: Okay, first off, it, it, it’s for the whole country.\n\n[00:12:52] Andy Pacquette: This is federal law. Okay. But, , all of these things are, um, are public and the states limit the, the kind of information you can get. So some states limit it more than others. In New York, we get quite a lot. Okay. The only thing that we’re prevented from seeing as a, as a, , private citizen is the driver’s license numbers and social security numbers.\n\n[00:13:14] Andy Pacquette: So we don’t get that, but we get everything else. And, , the purpose of of having this access is that we are supposed to be able to independently, um, confirm the accuracy and the currency of the database, meaning it is current, right. Um, so. And, and it has to be susceptible to challenges. And the only way to do that is to make it available to the public.\n\n[00:13:36] Andy Pacquette: So what we are working with entirely are publicly available records given to us, directly by the people who compile and, um, manage those records. Okay. So that’s it. We don’t have anything else. Um, you know, there are a couple of, uh, different places we’ve gotten the records from. You know, the, the voter rolls came from the individual counties in the state, but, uh, other information, like for instance, uh, we have the, uh, published, certified results from the Secretary of State, but anyone can get those.\n\n[00:14:04] Andy Pacquette: They’re on the Secretary of State’s website, so no big deal there. Um, I did get one file and I wish I knew the providence of it, and I don’t. So I, I can’t really say it’s official, but it’s a count of votes from all the precincts. And, um, the only reason I trust it is because every spot check I’ve done it matches exactly with other sources that I have.\n\n[00:14:24] Andy Pacquette: So, um, I’m thinking it’s an accurate count. However, I can’t, um, I can’t claim for sure that it’s from an official source cause I don’t know where it came from.\n\n[00:14:33] Alex Tsakiris: So you actually had to compile all the databases from all the different counties then.\n\n[00:14:37] Alex Tsakiris: And you have a little bit of a database background because you’re not only like a computer graphics genius, but you did this 8,000 database of pre-cognitive dreams that is truly, uh, uh, just substantial breakthrough for parapsychology and pre-cognition. And that’s all in your book Dreamer, which we talked about before.\n\n[00:15:01] Alex Tsakiris: But I mean, that’s just like an epic, epic kind of book. But you, you have this, this background. So when you call me and you say you have the database, what did you have at that point?\n\n[00:15:15] Andy Pacquette: When I called you, uh, I had gone a little bit further, but first I have to make one. Um, I have to give you a caveat. 22 counties gave us their databases.\n\n[00:15:24] Andy Pacquette: The remaining 40 did not. Okay. The state gave us their database, which gave us everything for all the counties. But the problem is the state database does not agree with the county databases. Now, you could say that’s because there’s a bit of a timeline between when we got them, but that really doesn’t explain everything that we saw.\n\n[00:15:43] Andy Pacquette: Because for instance, I was looking at the, um, the county database, and I was seeing certain numbers, and I was talking to a colleague who was working with me on this project who was working with the state database, and we were comparing numbers. And every time we did it, it’s like he had a different number than me.\n\n[00:15:58] Andy Pacquette: And I was feeling like, well, I’m, I’m the dumb one here, so I must be making a mistake. So I looked at it more carefully and I was like, no, I, I don’t think I am. So I contacted him and I said, what’s going on here? And he looked at it on his end and it turned out our databases had different information for the same people.\n\n[00:16:13] Andy Pacquette: Okay? And, um, like for instance, there were, how many were there in New York City alone? It was something like a quarter million votes were recorded in the county version of the records that were missing from the state version of the records, right? So for instance, so let’s just say you had a vote recorded and you lived in Manhattan, okay?\n\n[00:16:34] Andy Pacquette: So you’d have an ID number, and let’s say your ID number is 1, 2, 3, 4, 5, right? So if you look up ID number 1 2, 3 45 in the state database, it would say Alex Securus, no vote, but, well, actually it wouldn’t say anything. It just wouldn’t have, uh, a record of a vote, right? But then if you look at the county record for the exact same file with your name and everything, it’s gonna stay 2020, general election.\n\n[00:16:55] Andy Pacquette: So the vote disappeared and the thing. The official record, according to the law, is the state record. So the state record, there’s no vote, and the county record there is. So what happened to it? And there’s a quarter million of these, actually. It’s more than a quarter million. It’s each of the five boroughs.\n\n[00:17:13] Alex Tsakiris: stuff, small stuff. Andy, don’t bury the lead here, get onto it because there’s this, there’s this moment here that is like an amazing, one person can make a difference moment where you compile all this data into one database, and then you start doing some, I don’t know, some Jedi mind tricks, kind of precognitive stuff.\n\n[00:17:37] Alex Tsakiris: But you figure out this amazing pattern that shows this, , massive, massive, , you can’t really even say it’s fraud. It’s just the engineering of the potential of fraud, , in this thing. And, and let’s get as quick as we can to that part of the story, because that then leads to all the other parts of the story.\n\n[00:18:01] Andy Pacquette: Okay, I’ll, I’ll get there. So, so the thing is, so I’m seeing all this funny stuff going on. , which makes it crystal clear to me there are fraudulent records in the system, period. Okay. I know that it, it goes beyond that. Cause I was talking about how the, the records were falsified where the, the votes were being taken away.\n\n[00:18:17] Andy Pacquette: But I also found, um, somewhere in the neighborhood of just under a million records, which I now know is actually more than 2 million records, , where they had fake registrations. And I was thinking, okay, I’ve read about these fake registrations in other states and uh, and now I’m seeing them in New York.\n\n[00:18:32] Andy Pacquette: And they were in much larger quantities, by the way, than I saw in other states, except for maybe Pennsylvania. And I was thinking, these records are useless to anybody unless there’s a way to find them. You have to be able to, and they have to do it covertly. The reason is because if you’re, if you’re casting a fake ballot, right?\n\n[00:18:53] Alex Tsakiris: , so first we have to talk about what a fake registration is and how you spot and how anyone could spot if they, if you pointed them to the data in the spreadsheet like you have to me, and you’ve shown the screen and you go, look, this is fake.\n\n[00:19:09] Alex Tsakiris: We got 10 names, all the same name, different counties and different codes and stuff like that. But you, you, you can convince anyone pretty quickly that these , are fake registrations. And then the next thing you’re saying is what went through your mind is that to really turn that into a, a usable system for kind of being able to manage elections, manage being the operative word, you’d need some kind of more systematic way get your hands around this data.\n\n[00:19:43] Alex Tsakiris: As a, as a database guy, you’re like, there, there has to be more than just people injecting fake data into the database,\n\n[00:19:52] Andy Pacquette: Okay, so we have , , the certain data fields that we can match so we can see if they agree with each other or not.\n\n[00:19:57] Andy Pacquette: Okay? So you’ve got your first name, your last name, your date of birth, you’ve got your address. . So if I’ve got two records and all of that data is the same, then I take a look at the ID numbers. And you’ve got two of them in New York. You’ve got a county ID and a state id. If the state IDs are the same, that’s a duplicate record.\n\n[00:20:12] Andy Pacquette: And those are legal. And the reason is because you’re allowed to move from one county to another county. So you get different county IDs, and that means you get different balance. But , if your state ID numbers are different, that’s a cloned record. In order to create this fake id. At least that’s the way I’m characterizing it, cuz that’s how it looks. But the fact is that by law you’re not allowed to have more than one S v I D number. You’re certainly not allowed to have 11 or 22. And we do have people who have that many. So that’s a real problem.\n\n[00:20:41] Andy Pacquette: So those are clones. And if I were to show the list, it’s just an endless stream of records. It’s hundreds and hundreds and hundreds, thousands of them. And if I include records that they go before the 2020 election, it’s actually 2.4 million of these. So\n\n[00:20:54] Alex Tsakiris: if I can, let me bring it back to kind of on a personal level. , if I was there and I started looking through that database and I found that clone records that are clearly illegal, , I wouldn’t be totally, , stunned, , because I know there’s election fraud has been going on since they started doing elections.\n\n[00:21:12] Alex Tsakiris: You know, Joseph, Stalin, it doesn’t matter who votes, it matters who counts the vote. This is as old as time. So I wouldn’t be really that shocked if I was you, if I was in your situation and I found , these cloned registrations, these other irregularities. But what really caught me when you started talking to me was the scale of this and.\n\n[00:21:36] Alex Tsakiris: , the programmed nature of it. So keep going. I know you’re getting there, but I wanna push you to get there as soon as you can. ,\n\n[00:21:45] Andy Pacquette: I’m sorry. Okay. So anyway, so I compare these names and I’m like, okay, well these all have his address, so this is definitely the right guy. It’s the same guy, but I look at the ID numbers and they’re not the same.\n\n[00:21:57] Andy Pacquette: Okay? So this is an issue. Um, now the, the, we have county IDs and state IDs. The count I IDs can be different. Okay? This is if you move from one county to another, but the state IDs cannot be different. You can move out of the country and come back and you still have to have the same state id. The law actually has all sorts of things built into the system so that you cannot get a new S P O I D.\n\n[00:22:19] Andy Pacquette: The first thing any registrar is supposed to do when they look at your application is, does this person already exist in the database? That it’s, it’s the first question, question they have to ask. And they’re not asking you, they’re asking the database based on the information you give them. So they’re doing it exactly the same search I’m doing, which also means they know you’re a clone.\n\n[00:22:37] Andy Pacquette: Okay? Because I know you’re a clone. They have to because they’ve got the same data. I know that cuz I’ve got their data. That’s what they gave me. Okay? So the thing is, here I am 10 o’clock in the morning popping outta the shower one day and I’m thinking about this and it occurs to me, you know what we have, at that time, I didn’t know how many it was, but it was hundreds of thousands.\n\n[00:22:56] Andy Pacquette: We have hundreds of thousands of fake registrations in the database, and they’re hard to find because there’s 21 million records in the database. They’re basic. It’s like dropping water into the ocean. How are you gonna find those specific drops? The bad guys who do this cannot use them unless they can access them, which means they have to know which ones are fake and which ones are real.\n\n[00:23:19] Andy Pacquette: And so I was thinking about that and it’s, I I was thinking there has to be a way that they have tagged these files so that they know which is which now. , it seemed to me it wouldn’t really make a lot of sense to have a field called, you know, fake registration, and then they just tick the box if that’s what it is, because it’d be too obvious if they did that, they’d have something inside the database.\n\n[00:23:40] Andy Pacquette: They would clue everybody into the fact that they’re breaking the law. So they had to do it in a way that nobody would notice. So I was asking myself, okay, so, so where could they do that? I mean, could they, could they have like a special key code that they would add to a, a field? So I was looking at all the fields.\n\n[00:23:56] Andy Pacquette: I was trying to figure out which field would they be most likely to manipulate, and I was trying to figure out if there were any differences in these fields. Um, and I wasn’t really getting very far with that. Um, but it still was bugging me. So for months I was trying to keep an eye out for any sign that something like that was going on, that these records were tagged in any way.\n\n[00:24:17] Andy Pacquette: And I eventually discovered a way that, that these records were tagged, but it was not the way I expected because I was expecting them to modify something that was there. I didn’t expect them to link two things in a unique way that was effectively attacked. So, so the data actually stayed the same, but by linking things that shouldn’t have been linked, it made it possible to identify these, and that’s where the start of discovering this algorithm, uh,\n\n[00:24:46] Alex Tsakiris: Okay. So, so we might, we might need to be a little bit, , geeky for a minute and explain that, because the two fields that you linked together were in this unusual way, were the state ID and the county id, right? Yeah. And we should show people, it, it, well, maybe you can explain it so we don’t have to show too many things and get in trouble potentially with showing stuff that, but maybe you can, maybe you can’t.\n\n[00:25:13] Alex Tsakiris: Whatever you figured that out.\n\n[00:25:14] Andy Pacquette: I anonymize the, the whole thing so I can show it without any names or anything. And I, uh, so it is anonymized.\n\n[00:25:20] Alex Tsakiris: Okay, so you, you have this relatively long state ID and, , you can’t really mess with that directly, otherwise somebody’s gonna find out and you have this county ID and you can’t mess with that directly.\n\n[00:25:34] Alex Tsakiris: So what show us jump to this kind of very, very cool thing where you link these two together. It’s a , fantastic story. It’s a, it’s like one of the, one of the little anecdotes I love about this . Andy does this and it’s unbelievable. Imagine a guy sitting in his office in New York who just wasn’t even thinking of doing this and then kind of cracks the code on the largest , electronic election fraud scam in United States history.\n\n[00:26:08] Alex Tsakiris: That’s known. He cracks the code and now they’re gonna go start telling it. I’m moving it forward in the story you’ll pick up. But he goes in and has like some super high level, I don’t know, F B I or you know, tell whatever, looking over his shoulder and they’re like, dude, would you take a job as being a , forensic, , database?\n\n[00:26:30] Alex Tsakiris: Because they can’t believe what you’ve done, what you’re gonna show us in a minute in terms of how you crack this code. But that’s the kind of feedback that you get at the end of this in terms of the level of what you’ve figured out here. I’m not stretching that.\n\n[00:26:43] Andy Pacquette: Right. That’s true. Uh, yeah. Except not the f b uh,\n\n[00:26:48] Alex Tsakiris: Yes. I should, of course it wasn’t the B, but, right. Yeah, it is at, at a level of, you know, significant law enforcement\n\n[00:26:56] Andy Pacquette: agents. Apparently there were people who thought I had some skills when it came to this kind of stuff.\n\n[00:27:03] Andy Pacquette: So let’s go to the Yates Spiral. Okay, so let’s just open this up. Okay, now I have cleaned this up. Okay, so what, what you are seeing right now, you absolutely would not be able to see if you were just looking at the database. Okay? It would be impossible cuz the actual database is an absolute jumble.\n\n[00:27:22] Andy Pacquette: What I had to do is I had to filter this and I had to filter it in a very specific way, in a way that nobody who worked at the county or the state would ever do unless they knew the algorithm was there. There are a lot of steps to get to what I’m showing you now that I’m gonna show you basically the clean version of the algorithm.\n\n[00:27:39] Andy Pacquette: So what they’ve done is they’ve taken what I’m calling a short id, that’s the state ID and the county id, which is this, and they’ve linked them, okay? So if you look at these, I’ve highlighted them so that you can see the, the algorithm that they’re working with. So this is blue, see this is a one digit number for the county id.\n\n[00:27:57] Andy Pacquette: These are all five digit numbers, and then they’re broken by a four digit. Now if you look at this four digit number and you go to the next one, you see they’re, they’re consecutive 15 3 54, and then 15, 3 55, and then 15 3, 56. So these are all separated, uh, by a, an even distance. So these are 11 apart. Now, uh, just going based on the number of rows apart isn’t the best way because sometimes they’re missing records.\n\n[00:28:20] Andy Pacquette: It’s better to actually. Subtract these numbers from each other and then you get exactly 11 different. But as you can see, this is pretty consistent. Okay. But the thing is, it’s much more complicated than you might think just by looking at the first few records.\n\n[00:28:34] Alex Tsakiris: So, can I just interject something cuz I they’re not supposed to be consistent , the standard story of how these numbers would be generated. Like, , you go to register to vote, you’re given a number. You, you wouldn’t wind up with this pattern.\n\n[00:28:48] Andy Pacquette: No, no. Not even close.\n\n[00:28:49] Alex Tsakiris: Explain why that shouldn’t be there on a really basic\n\n[00:28:53] Andy Pacquette: level. Okay. Well we sent, uh, uh, email requests to all 62 county commissioners asking them how do you assign your numbers?\n\n[00:29:01] Andy Pacquette: Okay. And the county commissioners all said, we assigned the numbers, uh, consecutively. Okay. And to an extent that’s true, but it’s not really true. It’s just sort of true. So if you look at the, the numbers that start, that have five digits here, like 15th, 3 54, and look at the date, that’s October 14th, 1978.\n\n[00:29:20] Andy Pacquette: And the next one in that sequence is also October 14th, 1978. And the same thing goes for the next one. The problem is the way they’re broken up like this, so all of a sudden you’re going from dates in 1997 to 78, to 97 to 78, and so on. So they’ve broken the pattern. So they’ve taken something that was sequential and then they’ve blown it to smithereens so that they can have this, this pattern.\n\n[00:29:44] Andy Pacquette: Okay? Um, but the thing is it gets much more complicated. So see here this pink. This is showing up in the ninth position. So the positions that are important here are the, uh, the first position, which is here, the fourth position here, the ninth, and then the 11th. And also there’s an optional 12th that happens every 10 records.\n\n[00:30:03] Andy Pacquette: So what this is gonna do is it’s gonna start counting by a hundred. So these guys are counting by, uh, oh, by the way, I hate to say this cuz this is a complicated pattern, but when you’re sorting by S B I D, which is what I did here, the, uh, the gaps are 11, 111, a thousand 111, 11,100, 1100, 11,111, 1,000,100, 11,111.\n\n[00:30:27] Andy Pacquette: If you’re sorting by C I d, the gaps are 10 a thousand, 10,000, a hundred thousand, a million. So, um, so I I, I get mixed up between those two. Sometimes I almost said 10, but I should say 11 because of the sort method here. But the thing is that here we’re on row 83, which by the way, is all by itself significant.\n\n[00:30:44] Andy Pacquette: I’ll explain why in a second. And this is the first pink one. So if I go down, if I add 111 of that, that’s 194. So if I go to row 194, there’s the next pink one that’s 111 down. This is predictable.\n\n[00:30:57] Alex Tsakiris: what you’re showing us. The big picture takeaway is you are now looking at a database. One, there’s no one in the world would’ve figured out this key to showing this, these regularities or irregularities, however you don’t wanna look at it. These patterns that you found in the data that suggest, , an algorithm is behind this.\n\n[00:31:18] Alex Tsakiris: Because again, back to your big picture, you just said ’em minute ago. Like if you task somebody with the job of saying, okay, we got this database over here, what I need to be able to do because I like to rig elections, I need to be able to quickly pull up all of our fake. Registrations in a particular county, and then I need to manipulate ’em, and then I need to change ’em back.\n\n[00:31:42] Alex Tsakiris: And I need to make it so that no one ever saw how to do it. And what you’re telling me is that when you first look at the database, you go, well, that’s impossible. There’s no key that someone could pull up all the clones. And Andy goes, well wait, actually there is, and you could actually write computer code that would then pull this up. And then they have all these other tricks like giving codes that are out of range in range and top of range and bottom range. And you could go into that and you could talk to us for hours about what you found.\n\n[00:32:14] Alex Tsakiris: I just don’t want people to miss the big picture of what you’re looking at is the system by which you would manage, again, operative word, manage a database like this in order to commit election fraud.\n\n[00:32:31] Andy Pacquette: Yeah. And that is true. I, it, it can be used to do that. Now I need more information to be able to say they definitely used it that way, but it could be used that way.\n\n[00:32:39] Alex Tsakiris: , whoa, whoa. , don’t back down here, because the, the next thing talk\n\n[00:32:42] Andy Pacquette: about purged. Yeah. Okay. The purged records are very interesting. We, we know that they’re not really treating purged as purged. Purge means they’re ineligible to vote. And, , we have over 30,000 people who voted after they were purged. So clearly purged means standby or something else.\n\n[00:33:03] Alex Tsakiris: Hold up cuz you just said the world there you have 30,000 people that were purged and voted. And now I want you to swing back and connect it to something you said earlier about this is what the citizenry are supposed to be able to do, is to be able to check these elections, if you will. That’s why they’re made publicly available.\n\n[00:33:27] Alex Tsakiris: And I want you to tell me this, tell the story to everyone that you told me the other day, that you actually have boots on the ground, that you found a purge record. And tell me a story about revealing a name of somebody who did it, because I hate when we get to this point and we go, well it’s uh, potentially that this could be used.\n\n[00:33:45] Alex Tsakiris: Oh, come on, let’s just get on with it. this was used to manipulate, you know, why could we accuse everyone else of, of doing this, Russians and everybody else. Why do we know that? We’ve done this for ages and every country around the world. There’s been, , the standard spycraft to be able to go into a country and if the elections close, use some kind of technology like this to.\n\n[00:34:11] Alex Tsakiris: Manipulate it in our favor, which by the way, we’ll have you tell that story in a minute, but I want you to tell the story of the door check, knock check that you did on the\n\n[00:34:22] Andy Pacquette: purge. Okay. So after doing a lot of research and identifying suspicious records, , I made requests of what we call the, , canvas team. And those guys went out and they knocked on doors and they checked on things. So the first group that they checked on were the clone records, and we found, you know, confirmation that indeed they were cloned records.\n\n[00:34:41] Andy Pacquette: The voters themselves had no idea what was going on. They didn’t know they had X-ray IDs. They were totally unaware of it. And some of them were actually pretty extreme. I mean, we had examples where the, the documents we got back from the, from the county showed forged signatures on the registration documents.\n\n[00:34:55] Andy Pacquette: And the, when we showed it to the voter, they were really surprised. And they were, like, in one case, this lady told, , our canvasser, you know, this has my three registrations all on the same two days, one right after the other, a year before I actually registered to vote. And I know this because I was pregnant when I went in there to register.\n\n[00:35:13] Andy Pacquette: And my one-year-old son is in the house right now, and this is the year 2022. I didn’t register to vote in 2020. I registered a year after that. But all three of those registrations were, were predated basically, , by a year. And that made her eligible to vote in elections that she didn’t vote in and wasn’t eligible to vote in.\n\n[00:35:31] Andy Pacquette: , and she, she confirmed that the signatures were photographic duplicates of her signature, but they were pixeled by pixel exactly the same. , another example, we had a gal who had, , two votes recorded for her and, uh, both in 2020. She was a young gal in her twenties, early twenties. She had just, she was just then able to vote for the first time in a presidential election, and she went down with her mother in 2020 to vote on November 3rd, right?\n\n[00:35:56] Andy Pacquette: So she went there. . And when she arrived at the, at the polling station, she was told, you know, you’re not registered to vote, therefore you can’t vote. We can’t let you vote. And so she was like, well, can I register? And they’re like, no, you can’t. The registration deadline has passed. So you can go online and you can register, but you’re gonna have to wait till the next election to vote.\n\n[00:36:14] Andy Pacquette: So, uh, what she told her Canvasser was, uh, a couple weeks later she did go online and she did register to vote. But meanwhile, what we had in our records was a vote for the 2020 election for each of her two cloned ID numbers. So she had two ID numbers, each of which had voted. And in the records it showed that she had registered on November 23rd, which is 20 days after the election, which is almost a month after the deadline for registering.\n\n[00:36:41] Andy Pacquette: So, , so in that case, we’re, we’re looking at someone who, um, managed to vote before she was. and who managed to vote even though she didn’t vote and managed to do it twice, even though she didn’t do it once. , so when we go out in Canvas, this is the kind of thing we find out, and we find it happens over and over and over again.\n\n[00:36:58] Andy Pacquette: You know, we give the benefit of the doubt most of the time to, to, um, uh, how shall I say this? Records that could be legal. We give them the benefit of the doubt, okay? It’s only the ones\n\n[00:37:08] Alex Tsakiris: that I hate when we defaulted, all that kind of correctness kind of bullshit. It’s like, look, you just proved election fraud.\n\n[00:37:16] Alex Tsakiris: Then the big question that everyone has is, does it scale? How could it scale? You know, are they hacking the machines? Whatever. That was the whole dialogue. That is not disappeared. Like, now we can talk about this stuff, right? A couple years ago you couldn’t talk about it. Now you can’t talk about it. It’s in the past.\n\n[00:37:32] Alex Tsakiris: So you connected the two. So you got people boots on the ground, went out there and said, Hey, is this you? Did you do this? No. So then it’s in the database. That’s election fraud. No question. The real breakthrough that you do is you go, whoa, whoa, whoa. Here’s the scale of it guys. Millions of records. Here’s how it’s done.\n\n[00:37:53] Alex Tsakiris: Here’s how you would sit back on your computer and pull it up and change it and do it. Here are the means. Here are the keys for doing it. That’s, that’s the breakthrough that you bring us.\n\n[00:38:06] Andy Pacquette: Yeah. And actually one thing I I should also point out is individual voters are totally incapable of doing this. You can’t, you have to have access to the official database to do it.\n\n[00:38:16] Andy Pacquette: So everything I’m seeing in the database, it’s giving me the information that allows me to send people out to Canvas and then get these answers, , is information that can only be entered by people who’ve got access to that database. And that’s a really, really important point because, , , like, I’ve got a, there’s an assembly woman in New York State who, according to the voter rolls, double voted in three separate elections, 2016, 18, and 19.\n\n[00:38:39] Andy Pacquette: Okay. Um, and. . And yet I seriously doubt she has any idea that her records show that. And that’s just based on every other, , bit of canvassing that we’ve done. And all the people tend to be surprised that they’ve got all these extra, um, ID numbers. One lady, , she had, , she had a married name and a maiden name, and both of them had their own independent registration numbers, which all by itself is illegal.\n\n[00:39:01] Andy Pacquette: And what she discovered was her maiden name had continued voting, but her married name was erasing the votes that she was making. So she was making real votes that didn’t show up in the record, and she was really mad about that. And then the other registration was voting well after she stopped using the name.\n\n[00:39:17] Andy Pacquette: And after that registration number, , well actually that registration number should be the one she’s still using. Actually. Uh, it’s kind of a funny thing because by cloning what they’re doing is they’re basically giving the fake record to the real voter, and they’re keeping the real record, the one that’s legal, that is to say, , and they’re using it for their own purposes.\n\n[00:39:38] Alex Tsakiris: thing. Hey, Andy, I, I want you to tell the story of the guy on your team who has, uh, an Intel Black Ops background without revealing his name, OB, obviously, but I, I think it’s very telling. It really shouldn’t be surprising. We’ve heard this all along, but it’s really, really significant when you, when you hear that something like that directly from somebody on the\n\n[00:39:59] Andy Pacquette: Okay, well first off, he’s not on the team. He was helping the team, so he’s, he’s like more of a consultant. Um, but this particular guy, when I showed him the algorithm, he was really shocked because he’d seen it before. He said, I used to do elections overseas for the military and we used something that looked just like that to make sure that we could manage those elections.\n\n[00:40:23] Andy Pacquette: He said, I never expected to see it in the United States. He’s one of two guys with the same background that told me the same thing. , so they say there’s a couple differences. Like he said, in Iraq they have serial numbers on the ballots, which we don’t have, but, , but as far as like the, the, the, the numerical difference between the records are what’s called rep units.\n\n[00:40:40] Andy Pacquette: So that’s, uh, two digit or greater numbers that are all made out of one. So 1, 1111, et cetera. He said that kind of a thing is just all over the place in that software that they were using. So, yeah, it’s, and he actually said this on TV a little while ago in a response to one of the other people on our team.\n\n[00:40:59] Andy Pacquette: He was like, you know, uh, uh, military contractors who worked elections, you guys know this. You’ve seen\n\n[00:41:04] Alex Tsakiris: it. that’s amazing. , , , I think that leads into some of the bigger questions because, you know, one of the interesting things about you, Andy, cuz we have been friends for a long time , and we’ve kind of been through a lot of different things, you know, just kind of in our private conversations.\n\n[00:41:18] Alex Tsakiris: But you, you were kind of , a trumpster there for a while , you’ve written for Red Voice, red Voice Media, and you still do, and that’s fine. But I definitely get the sense, and I think it’s partially because of this research, That you don’t see, you see yourself more apolitical, if you will, kind of more along along the lines that I do, that this is a sham at a much bigger level.\n\n[00:41:43] Alex Tsakiris: And you’ve shared with me that your research tells you that this cannot be, uh, pinned to one party, one political group or another. It’s more or less a technology that can be applied to whoever they decide to apply it to. Do you wanna speak to that?\n\n[00:42:03] Andy Pacquette: Well, I do agree with you. I, I still have my, my favorites and they tend to be on one side of the political spectrum as opposed to the other.\n\n[00:42:11] Andy Pacquette: But I also have a lot of people on both sides that I really think are absolute criminals, frankly. And when I, and the fact is that this system, what we’re seeing, it doesn’t seem to play favorites the way people would expect. And actually one of the, one of the problems we’ve had is that sometimes Republican politicians are made aware of this and they’re like, well, that could be used against us too,\n\n[00:42:33] Andy Pacquette: I’m like, yeah, it absolutely could. , and it could also be used in their favor. And the other thing it implies is that anybody who’s currently in office benefited from this, whether they realized it or not. , so I, I think that there’s probably, you know, pockets of honest elections that you have throughout the country, and there’s probably places where fraud was implemented in order to make sure a certain candidate won, but it was unnecessary because that person was gonna win anyway.\n\n[00:42:57] Andy Pacquette: So you, you do get the people’s choice sometimes, but, , what this algorithm that they’re using, and the other kinds of fraud that we’re seeing, , imply is that, , our votes actually don’t. Play a significant role in who wins. , they, they do play a more significant role if the margin of victory is more than about 10%.\n\n[00:43:17] Andy Pacquette: , but if it’s less than 10%, it seems to be completely stage managed. Uh, that’s how it looks to me. And as far as who they’re, they’re picking, it seems like, and I’m, this is, I’m kind of going off my own research here when I say this, but, but it looks to me like if you’ve got a very Republican area, then they’re gonna pick a Republican to win, but it’s gonna be a Republican that, um, that they like.\n\n[00:43:39] Andy Pacquette: And if it’s a heavily Democrat area, then, you know, you’ve got Democrats who behave more like Republicans I in, in the, at least the way they’re portrayed in the popular media. But they’ll find a Democrat who is exactly what they want, and then they’ll let that guy win, or that gal, whoever it is. Um, so the whole thing seems to be a, a battle of perceptions.\n\n[00:43:59] Andy Pacquette: It’s like, okay, what will the people accept who we will also accept, you know, whoever it is that’s managing this stuff. And when I say whoever it is that’s managing this stuff, I really don’t know who it is. Um, it’s, it, I would not pin it on a political party. Absolutely not as far as I’m concerned.\n\n[00:44:14] Andy Pacquette: Whatever is controlling this is controlling both political parties and probably a little bit more beyond that. , which is actually kind of a spooky thing to think about.\n\n[00:44:22] Alex Tsakiris: Well, it, it, it’s spooky, but maybe in a way it gets us back to what this show’s all about. , you know, Skeptiko inquiry to perpetuate doubt, but also also why evil matters.\n\n[00:44:34] Alex Tsakiris: , what is evil about this? What is evil about the deception? And don’t we have to live with a little bit of this just as part of the way the, the sausage gets made as they say, you know, it’s like, Hey man, when you’re overthrowing the election in some country that’s teetering on going Kami, then, you know, maybe you stand back and go, oh God, thank God we got in there and we did a better job of throwing the elections than the Russians did, or the Chinese did, or whatever.\n\n[00:45:02] Alex Tsakiris: And there’s a certain part of that narrative that we accept and go, well, I guess that is kind of part of the price we pay for the good part of the American Empire, but then that quickly comes around to kinda bite us in the butt when we look at how it can be weaponized against us. ,\n\n[00:45:24] Andy Pacquette: I totally agree with you, and I’ve been, I have a feeling that there’s some element of that that we disagree on, but for the most part, I think it is a terrible thing that we created methods that are so dangerous, we use ’em against other people and then figured it would never happen to us because we are the ones with the tools.\n\n[00:45:42] Andy Pacquette: You know, they, they, they have this, this well-known saying, and Christianity do unto others as you would’ve them do under you. Right? Well, we are doing unto them, apparently what is being done to us. Okay. And that I think is exactly what we should expect after having created something like this. And it’s a shame.\n\n[00:45:58] Andy Pacquette: And I, frankly, I think that these kind of tools need to be eradicated. And even if other people try to use them against us, we can’t use them, period. It’s just too dangerous. Uh, you know, you’ve got, you’ve got people who are all up in arms about gun control. This stuff with elections is far more dangerous because with this you can control nuclear missiles.\n\n[00:46:16] Andy Pacquette: , and you can control a lot of other things. Like, for instance, fake vaccines, uh, connected to fake pandemics. , and you can kill a lot of people without their even knowing that they’re being murdered, essentially. I, and I hate to say it so strongly, but that’s how I view the, the vaccine right now. Um, but in any event, Yeah, this is, this is a very dangerous thing and I think that we let ourselves in for it When we said, you know what?\n\n[00:46:39] Andy Pacquette: It’s okay to treat other countries like this. It’s just not, uh, we are not being good neighbors by doing this. We are not being good shepherds at all. If we can’t think of an honest way to handle our foreign relations, then we need to think harder. We don’t need to just become every bit as criminal as the other guy.\n\n[00:46:55] Andy Pacquette: I don’t, I just don’t think that\n\n[00:46:56] Alex Tsakiris: works. I don’t know. I I get ya. I, I love the idealism. I think that gets us to really a spiritual perspective to me, is the only way you can resolve that. Because if you’re talking about this world, then you’re always gonna be making compromises cuz it is about getting that hill and you want me on that wall, you need me on that wall kind of stuff.\n\n[00:47:18] Alex Tsakiris: And there’s a reality to that, that I think we too often wanna kind of forget. You live a great phony baloney lifestyle there in New York. And I certainly lead a great phony baloney lifestyle here in southern California. And if that was ever really threatened, , I’m not so sure where I draw the line of righteousness, particularly when those enemies could be, , some other systems that really, really don’t care on a deep level.\n\n[00:47:48] Alex Tsakiris: So, you know, maybe, maybe trace that water one more time with response to that. Cuz I, I love your Christian idealism. I’m not sure it works in the real world. , but then again, I, I appreciate what you’re doing because I think what you’re doing is the essence of being an American. It is the only chance we have to fight to the end for those ideals for that.\n\n[00:48:17] Alex Tsakiris: For that perfection, for that beacon of light on the hill. And uh, that’s what I see that you’re doing, even if it seems like kind of a pushing the boulder, , up the mountain only for it to roll off the other side kind of thing.\n\n[00:48:31] Andy Pacquette: Yeah, well I certainly see where you’re coming from. I mean, it reminds me of Cory 10 Boom’s book, the Hiding Place, , which is about how two sisters, , were hiding Jewish people in Holland.\n\n[00:48:41] Andy Pacquette: They both got brought to the, uh, concentration camps and the sister refused to compromise her, her Christian prison principles. , and she wound up dying there and the other one made compromises and she lived and wrote the book. , and so what you’re basically saying is an exigent circumstances, how are you gonna behave?\n\n[00:48:59] Andy Pacquette: And frankly, I don’t know until I meet the, or encounter those, those circumstances, but I do feel rather strongly that, , if we say it’s okay to engage in what we consider to be that horn behavior just so we can deal with other people who are engaging in Aho behavior, we’re not thinking hard enough.\n\n[00:49:16] Andy Pacquette: There’s probably another way to get there. ,\n\n[00:49:18] Alex Tsakiris: . Okay. The, the story I always use for the longest time, , Ram Dass story, we’re both yogi kind of people. So Ron Das is there with ne Curley Baba, and he says, okay, uh, so forgive me, these are Ro Das stories.\n\n[00:49:31] Alex Tsakiris: So you don’t know what part is kind of mythical, what part is real. But he’s sent to this distant village along with this other dev devote volunteer to bring this medicine to these, , peasants, right? And they get to the hill and there’s a guy there and he goes, yeah, you gotta pay. in order to get there.\n\n[00:49:55] Alex Tsakiris: He’s an armed guy. He’s, you know, mafia, he’s, uh, cartel, whatever you wanna say it in terrorists, however you wanna put it in today’s. And he says, no, pay me and Ram Dasko. We can’t, we, we can’t do that. That would violate everything that Baba is all about. You know, we, we’d be compromising our ourselves in compromising the whole act of what we’re trying to do, of love and kindness in bringing this medicine to these people.\n\n[00:50:25] Alex Tsakiris: And the woman is just outraged. She’s like, what are you talking about? See those kids down there? You can see ’em running around. Some of them will be blind. Some of them will be dead if we don’t bring that medicine. So give the guy a few rupees, let’s get the medicine down there. So I always think, you know, what’s the right action in that situation?\n\n[00:50:51] Alex Tsakiris: And I don’t think there, I don’t think there is one. What do\n\n[00:50:54] Andy Pacquette: you think? Well, in that particular case, I think the, the most expedient answer is to give the guy the money and go down and save the villagers. Uh, assuming they’re not giving them covid vaccine, because then they’d have the opposite result. But,\n\n[00:51:08] Alex Tsakiris: Everybody, everybody says that. So I’ve developed a twist that I, I like to add to the story now. Great cuz everybody says that. Okay, now here’s what your money is doing. This guy is involved in sex trafficking, and what he’s gonna do is go find some opium addicted peasant and gonna buy his 11 year old daughter and sell that daughter into a life of prostitution and sex slavery.\n\n[00:51:35] Alex Tsakiris: So now same question. What’s your.\n\n[00:51:39] Andy Pacquette: That’d probably be the same answer. Maybe come back with and, and, uh, arrest the guy or, or deal with him somehow. But, uh, to prevent that from happening. But if you have one thing that has a, a, like a, like a timeline on it where we’re, , getting it accomplished quickly, uh, how shall I say this?\n\n[00:51:58] Andy Pacquette: If you don’t get it done quickly, then you lose the opportunity. I, I would say do that first and then deal with the second problem. And the second problem is stopping this other stuff that’s going on. , but the, as getting all the way back to the election business that we’re seeing here, uh, we clearly developed very dangerous tools that are being used against us.\n\n[00:52:16] Andy Pacquette: Okay. , that’s assuming that the military intelligence guy who said that to me is correct. I assume he is correct, but if no matter who did it, the tools are super dangerous and these things can cause much more harm than they’re being credited for being capable of doing. You know, when I see the way that election fraud is handled by politicians and the judiciary, and in some cases investigative authorities, I’m really disappointed that they seem to think elections are so unimportant that they don’t have to investigate them.\n\n[00:52:47] Andy Pacquette: They don’t have to prosecute cases like this, and they don’t have to deal with them in any meaningful way that, so they’re able to go out there with the talking points that all of our elections are safe and secure. Um, to me that is absolutely terrifying that these guys don’t realize that hey, or that the people of this country don’t realize that when they take an election from you, they are taking an immense amount of power over you.\n\n[00:53:12] Andy Pacquette: Okay? It’s the same people who are allowing riots to take place without punishing anyone that have cities burned down buildings, looted people shot. Injured. They’re, they’re allowing these vaccine shots to go out all over the place and people getting hurt and they’re not stopping it. Despite the fact that all the rules that were in place up until 2021, early 2021 would’ve prevented that from happening.\n\n[00:53:37] Andy Pacquette: That they would’ve stopped the vaccines after the first couple of deaths. They wouldn’t, they wouldn’t have allowed them to stay going for all this time. It’s ridiculous. There’s an amazing amount of damage that’s being, um, that we’re seeing as a result of stolen elections. Cuz this just could not have happened without the stolen elections.\n\n[00:53:55] Alex Tsakiris: What do you say we watch, uh, Dr. Zark video .\n\n[00:53:59] Andy Pacquette: Go for it.\n\n[00:54:00] Andy Pacquette: Hello, this is Dr. Zark of New York Citizens Audit. Welcome to lesson six in our ongoing election fraud series, attack of the Clones. Clone records in New York are a problem. New York Citizens Audit has found no less than 320,000 excess numbers. This is what they look like.\n\n[00:54:15] Andy Pacquette: This is only the start of the shortest list we have. It would’ve taken 10 minutes at the same speed to show them all. Is this a problem?\n\n[00:54:22] Alex Tsakiris: There you go. Our our right Doctor zk, what did we just.\n\n[00:54:28] Andy Pacquette: You saw one of 15 videos that I made to explain in one minute segments, although some of them go a little over that. Um, some of the findings that we’ve come up with at New York Citizens Audit. So that particular one was a way to demonstrate the, the sheer quantity of clones that we found and that particular list that I was, uh, zipping through.\n\n[00:54:49] Andy Pacquette: And I didn’t get through the whole thing cuz it just takes too long. Uh, was about a hundred thousand records long. Uh, I have another list that’s 630,000 records and I never bothered exporting the list. It’s 2.4 million records. Um, but the, the fact is there’s a lot of records and it’s, it’s just really, really shocking how many there are that are compromised.\n\n[00:55:10] Andy Pacquette: You know, imagine this, we are in New York State, there’s 21 million records in the voter rolls, and how many people voted? 8 million. Okay. And how many people actually live here? Nowhere close to 21 million. We’ve got a lot of excess records. And you know, one thing I’ll mention about this is that, uh, judicial Watch, which is an organization that, uh, well, they basically file foil requests and sue, um, um, various government, uh, officials and entities for reasons based on, uh, related to election fraud.\n\n[00:55:41] Andy Pacquette: Um, they recently sued New York City, uh, because they said you have all these excess, uh, records in your roles. And of course it’s true, they do. Uh, and New York, in fact, is the one of the most egregious offenders in, uh, New York State. And by the way, when I say New York City, uh, some people might not be aware.\n\n[00:55:58] Andy Pacquette: New York City is made up of five counties. So they’re, uh, Bronx, uh, Kings Queens, Richmond, and New York counties. So New York County is Manhattan, that’s the island, but the other five are around, or four are around them. So he sued all four or five of those. and got them to agree to remove the out of date records, right?\n\n[00:56:18] Andy Pacquette: So, um, so what they did was they sent him a note, which he trumpeted all over his website, you know, saying we, we agree we are going to remove 430, I think it was 431,000 and change records, uh, of the these out of date records, right? And they, they said we did this on February 2nd of, I think it was 2022.\n\n[00:56:41] Andy Pacquette: And so what I did was I, I had one of our guys take a look at the databases on either side of that date, cuz we had a database from October of 2021 and another one from May of 2022. And I said, just find out if they really took out those records and guess what? They didn’t. Okay. They lied to the court.\n\n[00:56:57] Andy Pacquette: Okay? And not only that, it’s kind of interesting because if you look at it, you have, you have the number of records is actually going up every database we have. So every few months, the number of records is going up pretty significantly. And at the same time, we have a declining population. So we have more people leaving than we have coming in and somehow the number of records is going up at a constant pace.\n\n[00:57:20] Andy Pacquette: Um, and meanwhile, they supposedly took out almost half a million records. Now what we did find was about 300,000 records that were converted from active status to purged status. But that’s not 438,000. And that’s not necessarily deleting them either. So, so somewhere along the line, something got missed and nevermind the fact that some of them got changed from active to purged.\n\n[00:57:45] Andy Pacquette: I looked up some special cases, you know, people who have 11 records and 22 records. They’re still there.\n\n[00:57:50] Alex Tsakiris: They’re there. Oh, Andy. Oh, Andy, Andy,\n\n[00:57:56] Alex Tsakiris: Like, I always say it was always thus. , . What are you going to do about this? Obviously nothing is going to happen, , but again, you are fighting the good fight, the honorable fight, the righteous fight.\n\n[00:58:13] Alex Tsakiris: Where do you plan on going with this?\n\n[00:58:16] Andy Pacquette: Well, the fact is, I didn’t wanna do this in the first place, and while I’m working on it, I don’t wanna do it. I can’t wait till this is all over and I can go back to doing commercial photography because I like visual arts and I wanna get back to that.\n\n[00:58:28] Andy Pacquette: However, I can’t seem to drag myself away from it because it’s kind of fascinating. And also there doesn’t seem to be anything else to do right now, thanks to the world being all in chaos at the moment, as you might have noticed. Um, so, so yeah, I, I mean, I’m, I’m doing a, so I’m writing about this, but like all the rest of my writing, it’s because somebody else asked me to do it.\n\n[00:58:49] Andy Pacquette: Um, yeah. You know, you mentioned my writing for law enforcement today in Red Voice. Um, I never really planned on writing, um, for other people, but they keep on asking me, so I keep on doing it. But, um, yeah, I can’t wait till this is over. I, and as far as I’m concerned, uh, the data has to be analyzed. We have to get it into the right hands, and then those people have to do their job.\n\n[00:59:10] Andy Pacquette: And then if it’s at all possible, this has to get fixed. But as far as I’m concerned, the second I can stop doing this, I’m outta here. Um, but at the moment it remains interesting. I mean, it, it’s just the other day I found something really fascinating. I discovered that these guys were actually changing people’s state ID numbers so that they could take, uh, a crim.\n\n[00:59:31] Andy Pacquette: Illegally generated record and make it look like it was legal. And you know, the, the thing is, I was, I was thinking, you know what they could give as an explanation for that, we, we’ve got tens of thousands of these by the way, uh, is they could say, well, we noticed that this looked illegal, so we fixed it by making it look legal.\n\n[00:59:48] Andy Pacquette: And you know, the funny thing is that’s kind of what cooking the books is all about, right? That’s, that’s, oh, we noticed if somebody else saw this, they’d noticed that we were stealing money, so we had to fix the books so that it didn’t look like we were stealing money. It’s like, that might be their explanation, but it’s not a particularly good explanation.\n\n[01:00:03] Andy Pacquette: And it certainly doesn’t absolve them of any guilt. Um, but you know, we found that too when we were, uh, asking for the registration records is that, um, they purged them when they got the request. So they were active for years. And then when they got our request, they looked at all these cloned records and they’re like, oh my gosh, this is the same person.\n\n[01:00:21] Andy Pacquette: We better purge all those guys right now. So it doesn’t really fix the problem, you know what I’m saying? You know, sometimes you can fix a broken window and it’s all done and nobody cares anymore. But when you’re talking about a crime, which is what we are talking about here, fixing it actually covers up the crime.\n\n[01:00:37] Andy Pacquette: And so that’s not really fixing it. Now you’re looking at obstruction of justices, uh, justice, uh, official malfeasance, um, negligence, uh, I think there’s another word in there. Oh, destruction of evidence. Yeah. This is four things, destruction of evidence. Um, and there’s obstruction of justice, and then it’s official malfeasance plus negligence.\n\n[01:00:56] Andy Pacquette: So, um, so that doesn’t really fly. And that’s one thing that I kind of dislike about what I’ve been seeing in the, in the press about this, is sometimes people will complain. They’re like, okay, this happened. It needs to be fixed. And then they say, okay, we fixed it. Everything’s fine now. And I’m like, no, because the problem that was created was the result of a.\n\n[01:01:15] Andy Pacquette: you didn’t investigate the crime, you didn’t go find the person who did it and say, you need to go to jail or pay a fine or something. Um, and that step has to be taken. You know, one thing that really disturbs me about this, and I do want to say this, is, um, these cloned records make it look like innocent people have committed voter fraud.\n\n[01:01:34] Andy Pacquette: Okay? I don’t believe for a second that these are genuine examples of voter fraud. Um, they are election fraud. Election fraud is handled at a much higher level. It cannot be done by individual voters. So I know of a case right now that happened in New York, um, where a immigrant to this country who has a green card, um, has something like, I, I forget what the number was.\n\n[01:01:56] Andy Pacquette: It was like eight or nine registration records, okay? And all was different S B I D numbers. And I checked in the database and I, I found that it was true, and some of them had voted right? And, uh, but the guy wasn’t an American citizen. He’s not eligible to vote at all, let alone multiple times in the same election, right?\n\n[01:02:12] Andy Pacquette: So his records make it look like that’s what he did. But this guy says, in answer, he says, I didn’t even know I was registered. I never registered to vote in the first place, and I certainly have never voted. And the fact is, I actually believe the guy, okay? And I believe him because of what I’m seeing in the voter rolls.\n\n[01:02:28] Andy Pacquette: Um, but he was actually being investigated by the DA’s office for voter fraud that could actually happen to people whose names are being used like this. And it really, really bugs me because what happens is they’re transferring the blame for something that hap that could only happen at a high level down to people at the very bottom level who are not only.\n\n[01:02:47] Andy Pacquette: They have no idea the thing even happened. They don’t even know that their names are being used like this. Um, so, you know, that’s one thing I, I definitely wanna deal with because I, I don’t like the idea of innocent people. Um, even being annoyed by someone knocking on their door and, and pestering them to see if they committed voter fraud or not.\n\n[01:03:06] Andy Pacquette: I mean, they aren’t utterly innocent of any knowledge of this. Um, they shouldn’t be bothered at all. Um, so it, it, it really bugs me that we’ve got all these people at a very high level doing something to achieve their own nefarious end, whatever that happens to be. And in so doing, they are throwing the blame for everything they do.\n\n[01:03:24] Andy Pacquette: If it’s ever discovered on the bottom most rung of the hierarchy here. And in that this case, that means the victims are then getting blamed for the people, uh, who are victimizing them. It’s, it’s horrible. It’s like incredibly perverse to see this. I hate this. So, anyway, there you go. But you wanted to talk, I wanted to say something about the outer range records and I wanted to show you a couple images cuz they’re pretty shocking.\n\n[01:03:44] Andy Pacquette: You don’t wanna show No, no, no, no. I think we say something. I wanna say something. No, no. Oh, come on Alex. Let say you can cut it out. You can say I’ll cut it out. Alright, we’ll see. Okay. One thing about the algorithms, you got the outer range numbers and the in range numbers.\n\n[01:04:00] Alex Tsakiris: , if you’re gonna say it, then you better say what you mean when you say out of range in range numbers, cuz you’re gonna have to roll this all the way back to somebody walks in, they wanna register to vote, they’re assigned a number.\n\n[01:04:15] Alex Tsakiris: It’s supposed to be a random, uh, it’s supposed to be a sequential number, whatever the next one on the list is. And then why you would even need, you would’ve to say why you even need a range, how that would even work, which is kind of, and then why there would be so many that aren’t in a range. I mean, it’s, it’s another half hour if you really wanna do it properly.\n\n[01:04:36] Andy Pacquette: Okay. So you’re giving me an option here. You’re not just explaining to me why I’m not gonna do this . , I mean, the thing is, is that the, these numbers, uh, have some predictable characteristics that are kind of interesting. So if I share my screen, I’ll show you what the ranges look like.\n\n[01:04:52] Andy Pacquette: And this is the key to the algorithm. Maybe if, if not for this, I would never have found it. Um, so when you look at a database, you, you’re not looking at a, at what I’m seeing here. Okay. So what I’ve got is a bunch of, uh, county names. I’ve got the county codes that are assigned by the state. I’ve got the, uh, the S B I D numbers, that’s the state ID numbers, uh, that are, that they have in those counties.\n\n[01:05:14] Andy Pacquette: And this is how many there are, et cetera. Okay? So you can’t see this. Um, but more importantly, each of these counties are assigned a range of numbers. So Onaga County here starts with this number that I’ve got my cursor over, and it ends with this number. Okay? But that’s only for about 56% of the numbers attached to Onaga.\n\n[01:05:34] Andy Pacquette: All the rest are in a different area that is not reserved by county. So, um, what happens is the numbers that are not in this territory disguise the presence of the numbers that are here. And they, they exist below and above, um, these numbered ranges. So basically what they’ve done is they’ve thrown a whole bunch of chaff into the air, and then in a very narrow range in the middle, they’ve gone ahead and designated a certain range of numbers attached to each one of these counties.\n\n[01:06:02] Andy Pacquette: And again, you can’t figure this out by looking at the database very easily. The way I did it was I had to actually look at every single number individually, look at the county it was attached to, and figure out the relationships. And you, there was no way to sort it this way because if you only look at the county, I’m gonna get all that chafed, I’m gonna get all that stuff that’s out of range.\n\n[01:06:21] Andy Pacquette: And I’m also gonna get all sorts of other numbers from people who move into the county, from another county, and they’re gonna take their number with them. So it’s a real mess. So it took me about a week to figure out these ranges, and I didn’t do it by myself. I had a, a, a colleague help me do it. Um, but once we figured it out, we realized they’re utterly stable.\n\n[01:06:39] Andy Pacquette: So the next thing was, let’s look at the ranges. Now you saw what happened when I looked at the in range numbers. That’s that pattern made out of those rep units, the ones and elevens and hundred elevens, et cetera.\n\n[01:06:48] Alex Tsakiris: Andy, Andy, I promise you, no one is going to be able to follow this. No one is gonna be able to get in your head.\n\n[01:06:56] Alex Tsakiris: That’s why you’re one of the few people on the planet that could have ever decoded this. That’s why your Dr. Zark, so, I mean, go ahead if you want, but I just, I think you are way, way, way into it now in a way that I guess bolsters , the point that you’re making that, you know, they, it’s pretty hard to figure this out from a, from a system standpoint, but go ahead.\n\n[01:07:25] Andy Pacquette: Well, okay. I was gonna say you could just have cut it right there and I could have accepted that, but fine, I’ll continue. So, um, in range, we have the spiral pattern, which is what I was showing you before with the, the 11th. Right. But outer range, they have a different pattern. Now. The first time I looked at it, I was zooming in on it and I see, uh, these patterns.\n\n[01:07:44] Andy Pacquette: Okay, so these are numbers, these are coordinates rather, that are created by the C I D numbers on the bottom and the state ID numbers on the left. Uh, and as you can tell, these are making shapes. This is not what you get when you sequentially assign numbers or consecutively assigned numbers. This is a clear, uh, graphic design element that’s somehow been incorporated into these numbers.\n\n[01:08:06] Andy Pacquette: And the other thing that’s kind of interesting, if you look at this group of numbers, this is 24,000 numbers. Um, and almost all of them are purged status. Only one of them is active. So the thing that this implies is that, um, purged records are going to be positioned like this. Okay? So I wanted to see how true was that, how far did that extend?\n\n[01:08:28] Andy Pacquette: And I found out it went very, very far indeed. So I’m gonna show you a couple of other graphs. Andy,\n\n[01:08:35] Andy Pacquette: All right, fine, fine. You know, you can stop it there and just, you know, reassure everybody. It’s complex and, and Andy can predict these things, and so that’s fine.\n\n[01:08:44] Andy Pacquette: So I, I, I can predict things based on the, the numbers and I shouldn’t be able to do that. It’s just, it should be impossible, but unfortunately it’s not. So I’ll stop sharing. There you go. How’s that? You happy? I’m\n\n[01:08:56] Alex Tsakiris: happy. It’s, it’s amazing. We’ll leave people some links so that they can watch all the awesome Dr.\n\n[01:09:03] Alex Tsakiris: Zark videos that you did, which are, uh, drawn, hand, drawn by you. A lot of them just, uh, amazingly done.\n\n[01:09:13] Alex Tsakiris: again, , , how can we be having this conversation on Skeptiko when no one else has had this conversation?\n\n[01:09:20] Alex Tsakiris: , I, if someone steps back and really just takes a look at that aspect of it is like this guy has done, something , truly amazing. And he’s tried to get people to pay attention. It’s not like he’s intentionally going dark on it, just nobody cares.\n\n[01:09:39] Andy Pacquette: Well, I don’t know if I go that far.\n\n[01:09:40] Andy Pacquette: It is actually getting quite a bit of traction in New York now. Um, although where, where, where, Andy, where? Well, okay, look, I’m not gonna give names, but we’ve got district attorneys now who are looking into it and we’ve got some politicians who are looking into it. We’ve got people in other states that are looking into it.\n\n[01:09:56] Alex Tsakiris: That is what you said a year ago. I mean, , nothing will ever come of this by the nature of it. I mean, , this is Epstein level kind of stuff. And one thing we know about Epstein was it wasn’t about Epstein. Right.\n\n[01:10:11] Andy Pacquette: actually, you just, you just said something that I’d like to have you comment on because you actually have some expertise with this kind of stuff. So when you saw all this data and you saw the, the algorithm that I pointed out to you, what were you thinking? Where, what, where did this come from, from your point of view?\n\n[01:10:29] Andy Pacquette: And what did it mean?\n\n[01:10:31] Alex Tsakiris: Well, you know, when, when we first talked about this, I thought the real genius move on your part cuz you’re not really a computer programmer. And that was my educational background and my profession. So when I looked at it, my first thought was how would I do it? How would I program it?\n\n[01:10:48] Alex Tsakiris: You know, and I’m not smart enough to program it, but I’m smart enough to know how somebody would program it. And, , I was stunned that you could reverse engineer it from just looking at the spreadsheet. I, just, I was, I was stunned. So all that stuff, you know, all that stuff that you said, you’d have to be able to write this algorithm, you’d have to be able to hide the algorithm, , in some code, either backdooring it in or some mach, you know, some election machine or something like that.\n\n[01:11:17] Alex Tsakiris: All the stuff that is now revealed by the work that you’ve done.\n\n[01:11:21] Andy Pacquette: Okay, thanks. Yeah, I, every person I talked to who had a background in computer engineering said pretty much the same thing. Uh, this is really complicated. They’re really amazed. It was discovered this way at, or discovered at all, actually.\n\n[01:11:36] Andy Pacquette: And as far as I know, actually the only things like this that have been discovered in this country so far were discovered by me. Um, and that’s this one, the one in New Jersey that I cracked. And, um, although actually no, I I take it back, Hawaii looks like they’ve got a, a lead on this. So that one’s kind of interesting.\n\n[01:11:53] Andy Pacquette: And they, the way they tag theirs, based on what I’ve been told, is more of an actual tag. So they’ve, they’ve got 129,000 of their ID numbers, which is 10% of their population, which have the same 12 digits at the appended to their UU id.\n\n[01:12:09] Alex Tsakiris: Had a, they had a lazy systems engineer there in Hawaii. He was kind of too, he was just worried about getting out and catching some waves.\n\n[01:12:15] Alex Tsakiris: He didn’t wanna do the hard work that they do in New York. It’s that New York work ethic that they did it the\n\n[01:12:20] Andy Pacquette: right way. . I wish it was a California work ethic. Frankly, I’d like to go hiking at Yosemite again on these days, but it’s too far away at the moment. , anyway. Okay. So, uh, is that all your questions or do you have a couple more things?\n\n[01:12:34] Alex Tsakiris: Nope, that’s it. It was, uh, I’m so glad, I’m so glad we did it. Uh, we’ll just, we’ll just leave it at that and we’ll leave people some links that they can go watch and checkouts. Okay.\n\n[01:12:46] Andy Pacquette: If you don’t mind, I’d appreciate it if you link to the subtext arc files. , at the moment, that’s all the income I’m getting and it’s like nothing\n\n[01:12:55] Andy Pacquette: I got, I’ve got 12 subscribers. Hey, subscribers, I’ve got 144, , free subscribers.\n\n[01:13:01] Alex Tsakiris: , Okay, I am gonna cut it off there. I know that’s kind of abrupt, but we just kind of rolled into this whole unbelievably, , great hour-long discussion about dreams, about yal matters, precognition, all sorts of stuff related to his incredible precognitive dreams, which are really, , paradigm changing to parapsychology as a whole.\n\n[01:13:26] Alex Tsakiris: You know, again, the guy’s a PhD was published the Dream Book and published in peer reviewed journals about his precognitive dreams. So it’s, it’s an amazing conversation. And we went places that I’ve never gone with them before. So check that out. As far as this episode.\n\n[01:13:45] Alex Tsakiris: . The one question I tee up from this show is,\n\n[01:13:48] Alex Tsakiris: Is this a big deal? I’ll tell you how much it’s changed for me. When I first heard about this a year, year and a half ago, I thought it was a really big deal. Now it don’t seem like a big deal. How about for you?\n\n[01:14:02] Alex Tsakiris: Let me hear from you and join in the fun. I think I might go over to Discord. Dunno. Also, if you want to be a show producer and you have a guest that you think needs to be on the show, let me know and we’ll try and set it up. Until next time, take care. Bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Andy Paquette, Total Election Control |582| - Skeptiko - Science at the Tipping Point", "description": "Andy Paquette… author, artist, researcher… cracks the code NY elections database… looks like total control of the process. Click here for Andy Paquette’s Website Dream substack: https://sleepwakes.substack.com/ Zark Files: https://zarkfiles.substack.com/ Art:  www.paqart.com www.paqphoto.com Click here for forum Discussion [00:00:00] Alex Tsakiris: Um, this episode of Skeptiko, a show about getting it done the old fashioned way […]", "url": "https://skeptiko.com/andy-paquette-total-election-control-582/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2023-02-14T15:19:00+00:00", "article:modified_time": "2023-02-17T19:22:00+00:00", "image": "https://skeptiko.com/wp-content/uploads/2023/02/skeptiko-582-andy-paquette.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Andy Paquette, Total Election Control |582|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/rRfSdoZZbvA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/rRfSdoZZbvA?feature=oembed"}], "links": ["https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-582-andy-paquette.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-582-andy-paquette.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-582-andy-paquette.mp3", "https://www.skeptiko-forum.com/threads/andy-paquette-total-election-control-582.4861/", "https://www.paqart.com/", "https://sleepwakes.substack.com/", "https://zarkfiles.substack.com/", "http://www.paqart.com/", "http://www.paqphoto.com/", "https://www.skeptiko-forum.com/threads/andy-paquette-total-election-control-582.4861/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2023-02-14T15:19:00+00:00"}