{"result_id": "273021", "URL": "https://skeptiko.com/andy-paquette-precognitive-dreams-583/", "timestamp": "2023-04-25 17:08:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/andy-paquette-precognitive-dreams-583/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Andy Paquette, Precognitive Dreams |583|", "cleaned_text": "[00:00:00] Alex Tsakiris: on, this episode of Skeptiko, a show about things you cannot see,\n\n[00:00:08] Clip: your thoughts attract things with a force that you cannot see, but is definitely real.\n\n[00:00:16] Alex Tsakiris: But like he just said things that are definitely real.\n\n[00:00:24] Alex Tsakiris: . You’re leaving our time space continuum, and then you have the ability to jump back in at these various other points, substantiated by the fact that you’re bringing back verifiable information.\n\n[00:00:36] Alex Tsakiris: What do you think is the mechanics of that?\n\n[00:00:39] Andy Pacquette: , so I have a mental model that I use to understand this. . And I don’t know if it’s right, it’s just, this is how I see it, , , I picture it as being kind of like a security guard with a bank of monitors.\n\n[00:00:49] Andy Pacquette: And those, those monitors are a view on all sorts of different things in different places, and some of them are different times. . And so, whichever monitor that security guard is looking at is what he’s going to see.\n\n[00:01:01] Alex Tsakiris: That first clip was from the Secret Movie of 2020, and the second was our guest, Andy Piquette, who, if you don’t know, and we’ve done shows on this in the past, is probably the most amazing precognitive dreamer ever in that he dreams about things that are gonna happen in the future. He has a database over 10,000. The database has been verified over and over again. He’s a PhD. He’s published in peer reviewed journals about his work. Many people have studied him. Amazing guy.\n\n[00:01:32] Alex Tsakiris: , . This dialogue’s actually a continuation of the one we just had and I published as 5 82. So you don’t really need to listen to that one, to listen to this one. They’re completely different, but we do kind of just roll right into this one. So I guess if you wanted more of a background on Andy, you could go there, but otherwise, I think you’ll catch on really quickly to what’s going on.\n\n[00:01:58] Alex Tsakiris: What, what about your dreamer? CK I’m subscribed to that.\n\n[00:02:02] Andy Pacquette: You can do that one too. I, I just remembered. , by the way, what do you think of the illustrations on there? I actually made a few fresh just for that\n\n[00:02:07] Alex Tsakiris: remember some of them now that I think about it, , yeah. You’ve done illustrations of the dreams.\n\n[00:02:12] Andy Pacquette: Yeah, and I can’t believe, I don’t know where my own CK is located. , just a sec. Uh, I, you know what it is, is I closed it because I didn’t wanna accidentally out myself as Andy Paquette, and then you just went and did it anyway. Because the thing is, I really enjoyed making these illustrations and, you know, I kind of like the style actually quite a lot.\n\n[00:02:34] Andy Pacquette: And one of these days I’d kind of like to make a. Where I, you know, it just has these, uh, these illustrations along with, uh, the dreams that go with them. Uh, just because I, I think it would be, you know, interesting to look at as a book.\n\n[00:02:46] Alex Tsakiris: Again, while you’re pulling that up, yeah. 8,000, I’m sure it’s over 8,000 precognitive Dreams recorded in a database, a searchable database,\n\n[00:02:57] Alex Tsakiris: peer reviewed, , research that’s been done on it. Precognitive Dreams. Andy goes to Sleep and Dreams, something is going to happen. And then he, without revealing anything, verifies that it did happen. And then records the accuracy of the dream, and then all these other aspects about it, which you can find , , in his ck that he’s pulling up here,\n\n[00:03:21] Alex Tsakiris: and here are some of those illustrations.\n\n[00:03:22] Andy Pacquette: Go ahead. Yeah. So this is a dream where I was shown the, , boxing Day tsunami about three weeks before it happened. , so there was this, this guy basically showing me that this is where it was gonna happen, and showed me the tidal wave and all the rest of that jazz.\n\n[00:03:37] Andy Pacquette: , this is the tidal wave. , and then the people running, uh, let’s see. This is a different dream. This is from a long, long time ago. This is about a guy who, a ghost who didn’t realize he’d died while drowning, and he couldn’t stop that cycle. This is from that tsunami dream again. Uh, in this case it was the earthquake part of the tsunami, cuz it was preceded by an earthquake.\n\n[00:03:56] Andy Pacquette: So I saw an earthquake watch station in Japan, and I was looking at the, these readouts on their, um, Geiger, not Geiger counter. What are those things called? You know what I, I’m talking about seismograph. And then he was showing me where it was located on this globe, which is basically the South Indian Ocean.\n\n[00:04:12] Alex Tsakiris: real, real, real quick. I, I asked you this question, , and keep showing him. It’s so unbelievably beautiful. I love your style. I think it’s just fantastic. But you’re a pro man. I mean, you have pro, pro, pro, super pro on that. You know, I asked you this the other day, and I wasn’t totally satisfied with the answer that you gave.\n\n[00:04:31] Alex Tsakiris: What do you make of this? What do you make of the fact that you’re able to go into this state, this altered state of consciousness we dreaming is an altered state of consciousness. We don’t think of it that way. And you’re able to access different timelines and pull back information about those timelines into our timeline.\n\n[00:04:54] Alex Tsakiris: What, where do you go with that? And then particularly with your own spirituality, which is, you know, kind of religious?\n\n[00:05:05] Andy Pacquette: Well, first off, I don’t know that I count myself as, as religious. I mean, I, I do go to church. , but I, I find that I disagree with, you know, some primary tenets of almost every religion.\n\n[00:05:18] Andy Pacquette: Actually, probably all of them act. , and it’s primarily because it disagrees with my dreams, which I actually trust more because I’ve actually been able to validate these things to an extent and. That makes them more trustworthy to me than someone’s interpretation of somebody’s teachings that have been interpreted a thousand times already.\n\n[00:05:34] Andy Pacquette: So, , which means they’ve gone through the game of telephone too many times to be completely trusted, as far as I’m concerned.\n\n[00:05:41] Alex Tsakiris: But again, while you’re showing these beautiful, beautiful slideshow, incredible big picture question, God or blob of consciousness, cuz a lot of people take what you’re doing and say, oh, there’s a blob of consciousness, there’s a stream of consciousness, there’s the akashi records that you can just go and get in there.\n\n[00:06:02] Alex Tsakiris: There is no moral imperative. There is no, hierarchy of consciousness. It’s a blob of consciousness. Where do you stand on that?\n\n[00:06:10] Andy Pacquette: Yeah, I’d say it’s a hierarchy and there is a God, God is real. I, I, I actually, I really resisted saying that for a very long time, but at this point, I don’t think there’s any other conclusion to draw from.\n\n[00:06:22] Alex Tsakiris: , is God ai or should I say is ai? God?\n\n[00:06:26] Andy Pacquette: No, it, , as far as I’m concerned. And I don’t wanna go too far on the nature of God because there’s really a limit to what I know and what I can infer from what I’ve seen. , ,\n\n[00:06:34] Alex Tsakiris: but you can’t say that, that, you can’t say that that’s an important part of this conversation.\n\n[00:06:39] Alex Tsakiris: You don’t always peeves me, Andy, and this is a separate interview, but we’re gonna go ahead and roll it in, is that all this discussion by these super intelligent people, I, I love, uh, Lex Friedman. I listen to ’em all the time. I listen to all these other AI guys.\n\n[00:06:54] Alex Tsakiris: You are outside of space time with these dreams. All, , spiritually transformative experiences are outside of space time. AI is by definition inside of space time. It’s in silicone, it’s here, it’s now, it’s on this time scale. You are jumping out of the timescale. So immediately that should eliminate it for anyone , to consider it in kind of , a literal way that AI is related to this.\n\n[00:07:24] Alex Tsakiris: So question number two, where people go is, is et God?\n\n[00:07:30] Andy Pacquette: No, I wouldn’t think so. And that would be part of the creation.\n\n[00:07:34] Alex Tsakiris: , cause the related question I always say is, does et have an n D E ?\n\n[00:07:42] Alex Tsakiris: Like you say, we can’t necessarily say what that light is, but all indications are that it’s bigger than that. It’s bigger than et and it’s bigger than ai. And we don’t know for sure, but it’s on this hierarchical scale. I don’t wanna put words in your mouth, but that’s what I hear you saying is No, it’s, it’s a lot bigger than that, bro.\n\n[00:08:02] Andy Pacquette: Yeah. Yeah. Well, I, I think we’re in agreement there. Um, so anyway, I, let me see if I can find that ck but yeah, I’m getting a, I’m kind of getting a kick out of looking at these drawings now. This is really fun. Uh, oh. This was a hilarious one. This, I, I dreamt that a leprechaun had caused my mom’s toilet to start flushing the water up like a fountain.\n\n[00:08:25] Andy Pacquette: And so I, I called her. and I told her about this funny dream and she said, it’s funny because that morning her toilet had actually done this. It it, it’s like the water was pushing up like a fountain and she had to call a plumber to fix it. Um, I have no idea how that happened or what this element meant, but uh, but nevertheless, that part of it was true.\n\n[00:08:44] Alex Tsakiris: Andy, go back. Go back. Yeah. Since we’re, we’re streaming all through these, because this is like, again, folks, 8,000 of these and he just told you thousand 500 actually, I’m sorry, 13,500. Each one of them incredibly amazing. I want you to add as much detail as you can or that you’d like to this particular dream, what happens?\n\n[00:09:08] Alex Tsakiris: Do you have any thoughts before you, you go to bed, you know, are, do you have multiple dreams? How do you record it? How do you verify it in, in this case, if you can remember that, because I think then someone can extrapolate to all the pictures that you shown in all these huge events like tsunamis that kill a quarter of a million people.\n\n[00:09:29] Alex Tsakiris: Tell us a, a add any details you can , to that particular, , leprechaun and the,\n\n[00:09:35] Andy Pacquette: okay, well I’m gonna pull up my Dream Journal record. Put it on the side. So I’m gonna look over here. This is August 13th. Oh wait, no it isn’t. It’s uh, lemme just look it up here. I’m just gonna look it up in the database and I can tell you, , just so you know, I have a pretty good recall of my dreams that the details quite often escape me, so I have to look them up.\n\n[00:09:53] Andy Pacquette: Oh wow. This is a long record. Okay, so, uh, this particular night, this is scene ID number five. So this is at a minimum, the fifth dream from that night.\n\n[00:10:03] Alex Tsakiris: , can you pull that up? What you’re reading from? ,\n\n[00:10:06] Andy Pacquette: well I just wanna make sure there’s nothing like off coloring , but cuz from that time period I had a couple like that, but, okay.\n\n[00:10:13] Alex Tsakiris: Read for us, if you will, exactly what’s on the screen, cuz people aren’t probably gonna be able to see it.\n\n[00:10:19] Andy Pacquette: Okay. Yeah. So what I’m looking at here is, , I’ve got a bunch of tabs. This one gives me an ID number for the record. It’s number 13,827. Got an ID number. It’s got its date of the Dream, what journal it was in, which is a paper journal that IRI wrote in by hand.\n\n[00:10:35] Andy Pacquette: What was the date? , this is, , February 28th, 1990. I’ve got this one flagged as unusual because it mentions a leprechaun, which is just kind a weird thing. , and in this, at this time, I frequently got, , my wife mixed up with my mom and my dreams for some reason. I don’t know why. , but, , in this case, , I realized this was about my mom because of where it was located.\n\n[00:10:55] Andy Pacquette: So I called her to verify it. And, , and she said that indeed. Hold on,\n\n[00:11:01] Alex Tsakiris: hold on, hold on. I wanna take it. I want you to take it through sequentially. You said it’s the, it’s the fifth dream of the night. Yeah. How do you know that? , how, what’s the process like of your recall of the dream? Does it happen in the morning?\n\n[00:11:14] Alex Tsakiris: And then how do you record it? When do you record it, and then when do you verify it? And then what did you actually record in this one?\n\n[00:11:22] Andy Pacquette: Okay, well, you know what would be kind of fun? Let me, uh, stop the share so I can actually show you the journal that’s in it’s right behind me. Um, but I, uh, I record these in dream journals.\n\n[00:11:34] Andy Pacquette: Okay. This is the wrong dream journal, but you can see it. Okay? This is right after it. Okay? So this is all written by hand, okay? And this is in this big fat binder. And I’ve got like, I don’t know, 34 of these sitting here in my, , so what would happen is I would go to sleep and I’d probably sleep for maybe 30 minutes or 40 minutes and I’d have a dream, and then I would go ahead and, , wake up and write down the dream.\n\n[00:11:59] Andy Pacquette: And then I’d go back to sleep and I’d wake up another hour later and I’d write down another dream. And that would go on throughout the night. So my sleep would be interrupted anywhere from usually, you know, three at a, at a minimum to as many as like 15 times. And I would write out 15 dreams. So it’s not like I, I wait until I was up for the day and I wrote ’em all out.\n\n[00:12:19] Andy Pacquette: Uh, it usually was as they happened. Uh, now these days I’m a little bit more lazy about that, so I don’t do that quite, it’s not often, although admittedly I did exactly that last night. But usually not, usually now I will just wait until, , I’m up for the day. , but in any event, so I wrote the whole thing out and , and then I was thinking, all right, based on the information in here, I’m gonna identify the person this happened to as my mom.\n\n[00:12:42] Andy Pacquette: , so I made exactly one call to my mom and I said, mom, , did this happen? And in my notes here, I record that on, looks like, looks like it recorded a few months later, , that I s uh, oh, that’s probably because of when the database was made. Anyway, so she confirmed that indeed on that morning her toilet had ejected exactly the way I, I had drawn it.\n\n[00:13:05] Andy Pacquette: , and as far as the rest of it goes, I don’t know if that was my dream self trying to make sense of why the toilet would be flushing that way or what, but , but the fact that the, the, the toilet was ejecting the water straight up was true and I certainly had no way of, of knowing that in advance. , you know, some of these are just a second.\n\n[00:13:23] Andy Pacquette: Lemme share the screen again. Some of these I’m sharing less because, , they’re precognitive cuz a lot of them aren’t precognitive. Some of them are and some of them aren’t. , but some of them are actually very interesting for other reasons. So I had one back here. That I’m going to go towards, which I found fascinating.\n\n[00:13:41] Andy Pacquette: , if I can find it. , and I, I just, I, I think about the, oh, shoot, I’m just gonna do it shortly. I’m gonna look at my, my, , there we go. Okay. So in this dream here, I meet a guy who I know from Maine, and he wants to show me something. And he takes me basically to a portal, and I go through the portal and all of a sudden I’m, , I’m somewhere else.\n\n[00:14:05] Andy Pacquette: Okay? So it feels like I’m, uh, living in these Chevy circumstances and somebody else has, , paid for the place I’m living in. They, they’re paying for my food and my furniture and everything else. And I’m grateful to have a place to stay and to have food and all the rest of it. But I’m, , a little ungrateful because I, , I’m used to better things.\n\n[00:14:25] Andy Pacquette: I mean, like when I was in California, I made a good salary and I had really nice things. So, so not having those really put me out. So I was, I was kind of like grateful and not grateful at the same time I even slept on this thread, bear mat on the ground. Okay? And so, uh, I’m looking out the window, which is right here, and I see out the window, I look down and there’s these guys in orange costumes playing soccer, and it looks like a medieval town somehow.\n\n[00:14:49] Andy Pacquette: , so I thought, oh, that’s kinda interesting. And, but then as I’m thinking about these guys, I’m suddenly transported to this other location and it’s basically empty space except for a pedestal that has, or a podium with a book on it. And I go into this book, and it’s a humongous book. And when I open it, it has this weird effect.\n\n[00:15:08] Andy Pacquette: It, it actually makes me fly up. So it, I’m like basically levitating. And then when I close, , it brings me back down. So I’m thinking, oh, this is hilarious. I’m gonna show this to those guys who are playing soccer down there cuz, and they’re just walking into the room here. I’m gonna play a trick on them. And so they, uh, they come over here, I am giggling, you know, he, he, he in my mind and I say, okay, take a look at this.\n\n[00:15:28] Andy Pacquette: And the guy’s like, well, heck, the pages are all blank, right? Which is what I saw. But then they start filling up and they’re filling up with the words of creation of all things. It’s, I’m literally seeing them waterfall out of this book, and I can see that each word is the thing itself. And it’s not just the thing itself, it’s the history.\n\n[00:15:44] Andy Pacquette: It’s the reason for its being, it’s how it got created. It’s who made it, uh, which is in this case God, and it’s the future of the thing. And it’s, it’s purpose and, and the reason why it’s existing and how long it’s gonna be there and what’s gonna happen when it goes away. It’s like all this information, it’s just this amazing amount of information and it’s just pouring out and it’s, it’s covering everything.\n\n[00:16:04] Andy Pacquette: And I, and I see it’s talking about the world and the grasses and the people and the animals and air and gravity and just everything. And it’s just expanding and expanding and filling the universe. , and I can see all this stuff being created as the words are coming out of the book. And you know, like here I’m seeing the words and, and then I’m seeing the thing, in this case, a blade of grass, okay?\n\n[00:16:25] Andy Pacquette: And then I’m seeing the root systems for the grass, and then I’m seeing the insects and how they interact with the grass and how you need to have both of those things. And it’s all accounted for. And this, this grand design of all this stuff. And then I’m seeing all the people who’ve ever lived or ever will live, and I’m seeing their whole histories.\n\n[00:16:41] Andy Pacquette: I even see myself and I’m like, Hey, I gotta take that later to read in a different dream, which I did, by the way. And then I see the author of all this stuff, the author of all Creation. And that’s how I think of him in the dream. I’m not thinking of him as God, but I think it’s fair to identify him that way now.\n\n[00:16:54] Andy Pacquette: So anyway, so I, I see all this stuff being created and it’s just fascinating. And I realize, you know what? I actually have a responsibility to this guy now that I know why I was made and what my purpose. I have an obligation to do the things that are required of me in this life.\n\n[00:17:13] Andy Pacquette: But the thing is, what was interesting , is that af after this particular scene that I made a drawing of, I went back, uh, to, you know, like Earth and I was doing my own thing. And the whole time I had this, I was hyper aware that the creator of the universe was aware of every tiny thing I did or thought or said is absolutely aware of it.\n\n[00:17:33] Andy Pacquette: And so any, anything I did or thought or said, it was not what I, , was meant for me. And, and actually I had considerable freedom within this, but, but there were certain things that I was expected to do and I didn’t wanna do this. So I knew that God saw all this and I was like, well, I’m surviving so far.\n\n[00:17:50] Andy Pacquette: He hasn’t zapped me yet. So I guess this is okay. But I also knew I had this duty to accomplish whatever this duty was. . And so eventually I ran into those guys who are like my friends now, , who I’d seen, uh, playing soccer, right? And now they had a, like a vegetable stand at a, a market in this medieval town.\n\n[00:18:08] Andy Pacquette: And I said, Hey, uh, you know, I’ve been kinda lonely walking around doing my own thing. How about you guys, , dropped this stuff that you’re supposed to do for God that you saw when the, when the book opened up and, , we can go do something fun? And they’re like, no, no, you’ve misunderstand. We want to do this.\n\n[00:18:22] Andy Pacquette: , we feel good doing this. And now that, you know, all this stuff that you saw, you have, , an obligation to report for due to yourself also. Okay? And so that was the end of the dream. But what I did not expect was that it actually had precognitive elements to it. So, , some years later, actually, not too many years later, it might have been literally two years or a year and a half, something like that.\n\n[00:18:44] Andy Pacquette: , I actually had a job offer to go work in the Netherlands. And , the thing is, is I didn’t have much money at the time, which, you know, because I basically left my career behind in Hollywood. And, , and so they actually had to front me the money for practically everything. So they, they, you know, got the apartment for me, they got groceries for me.\n\n[00:19:03] Andy Pacquette: , you know, I had rent, you know, the furniture was rented. It wasn’t mine. It was basically exactly like the dream. And, and the, the place I was living was in a medieval village. The village had been founded in like the year 1000 or something like that. The cathedral in town. They started construction in 1200 and finished in 1300 or so.\n\n[00:19:21] Andy Pacquette: , and most of the town still looked like it was this ancient place. , so, and I was sleeping on a thread bear mat. And the reason was because there were so many bugs in the cot that I had that the, the, the thread bear mat had fewer of these bugs. So I thought it was more comfortable to sleep there. So that’s what I was doing.\n\n[00:19:36] Alex Tsakiris: What about the orange jerseys?\n\n[00:19:39] Andy Pacquette: Right? So, so one day I was, I had just woken up from an nap or something on that, on that, that mat, it was a straw mat. And I looked out the window and I’m, you know, on the third floor and, and I saw these guys playing soccer outside, wearing orange jerseys.\n\n[00:19:51] Andy Pacquette: It was World Cup. You know, the, the guys in the Netherlands are absolutely bonkers for the World Cup. , and\n\n[00:19:56] Alex Tsakiris: that’s their color. I mean, that’s their color. Anyone knows the Netherlands, they’re all orange. I mean, it’s all, it’s, yeah, like,\n\n[00:20:02] Andy Pacquette: and I had no idea this, I mean, at the time I had the dream. I certainly, you know, that was the other thing about the dream is that I wasn’t expecting , the, the combination of modern and medieval elements.\n\n[00:20:12] Andy Pacquette: And it didn’t make sense to me. I, I hadn’t, I didn’t remember ever seeing a city like that before. , and as it turns out, I had, because I, I had been to Europe when I was, uh, in my teens, but, , but it wasn’t exactly what I was expecting to do later. And that’s certainly not when I was in my forties. , so anyway, but the, but the town I was in definitely had that mixture of modern and, and ancient.\n\n[00:20:34] Alex Tsakiris: Andy, you’re this unbelievable world class mystic. You just saw her. I mean, that’s, like I said at the very beginning, this interview, I said, now you know why Trish McGregor said, I think he might be the most psychic person I’ve ever met in my life. So this is mind blowing your listen to this little tiny, tiny show, Skeptiko, and you’re hearing just this incredible flow of information from a mystical source, which is Andy as a mystic though, and as I’ve kind of explored this, you know, this stuff is, It always seems allegorical when you break it down.\n\n[00:21:13] Alex Tsakiris: You know, there’s the near death experience. They come back and there’s contradictions to these things. , so I’m wondering a couple of things. Number one, I’m wondering what do you understand to be the mechanics, if you will, the closer to technology part of you? And when I say closer to technology part, I think a lot of us who are really investigating this are wondering how we should understand this.\n\n[00:21:40] Alex Tsakiris: You slipping in and out of this timeline, cuz that’s what you’re doing. You’re leaving our time space continuum, you’re jumping out of it, and then you have the ability to jump back in at these various other points, apparently substantiated by the fact that you’re bringing back verifiable information.\n\n[00:21:58] Alex Tsakiris: What do you think first is the mechanics of that? And then I wanna ask you about the meaning of that. Why, why is that, why is that there? And how can you be so sure about this hierarchy of consciousness isn’t some hierarchy of control? A lot of questions there, so go for it.\n\n[00:22:18] Andy Pacquette: Yeah, I was gonna say, that’s a lot of questions there.\n\n[00:22:20] Andy Pacquette: , so I have a mental model that I use to understand this. Okay. And I don’t know if it’s right, it’s just, this is how I see it, and I gave this to you the other day, but, , I picture it as being kind of like a security guard with a bank of monitors.\n\n[00:22:32] Andy Pacquette: And those, those monitors are a view on all sorts of different things in different places, and some of them are different times. Okay. And so, whichever monitor that security guard is looking at is what he’s going to see. Okay? So if he’s looking at the future, he is gonna see the future. If he’s looking at something else, he’s gonna see something else, whatever it is.\n\n[00:22:50] Andy Pacquette: Now, the way I see it, we have like a, a security code, if you will, a password that gives us access to, in most cases, one of those monitors. And it’s our own life on our timeline, but sometimes for whatever reason, we get access to some of the other monitors. And for whatever reason, I, I think that’s kind of what’s going on here.\n\n[00:23:08] Andy Pacquette: That’s just how I visualize it anyway. , who\n\n[00:23:11] Alex Tsakiris: gave you all these access codes? . How come you’re the one who gets ’em all? I’m\n\n[00:23:15] Andy Pacquette: not saying they’re really access codes. I’m just saying it’s, that’s how I’m picturing it.\n\n[00:23:19] Alex Tsakiris: , and I’m saying using your same analogy. Why does Andy have all these access codes? Number two, why do sometimes for people who come back with incredible information about these access codes, sometimes that information doesn’t pan out. Sometimes the future doesn’t happen.\n\n[00:23:35] Alex Tsakiris: Sometimes they get caught up in kind of strange beliefs and, you know, things that really kind of contradict logic. Why aren’t, why aren’t those screens always, , perfect. And what is the whole. Mechanism, if you will say about the nature of this ultimate reality, not our reality down here. Because all of a sudden our reality down here seems kind of almost, not trivial, but like much, much less significant because you’re now at a whole different level.\n\n[00:24:05] Andy Pacquette: that for me, back to your first question. Who, who gave you the access codes? Okay. Cause I actually had a dream about that, that I remembered while you were talking. Okay. So in the dream, I was told that in other lives I had actually done so much like work, and I understood it to be like meditation and more spiritual types of things, but that I had, I had a certain level of knowledge that I had developed that makes this possible.\n\n[00:24:31] Andy Pacquette: , and it’s certainly not the only person that this happens to. It happens to lots of people. But, uh, though I would say a distinct minority of the population, it’s still, you know, a large number. Oh, it\n\n[00:24:41] Alex Tsakiris: doesn’t, no, it doesn’t . What, go\n\n[00:24:44] Andy Pacquette: ahead. Well, all right, fine. So obviously Alex and I disagree on something, but in any event, , but apparently it’s like other experiences before this life somehow gave me this, this access.\n\n[00:24:56] Andy Pacquette: That’s how it looks anyway, in that dream. , but as far as when it breaks down, um, you know, I, in my own dreams, I certainly see examples where, um, they’re right. But the way I wrote them down was wrong. So like, where I, I described something inaccurately because I didn’t really understand what I was looking at.\n\n[00:25:16] Andy Pacquette: Now, I’m very careful about how I record things now because of that, because I, and this is something that if you don’t accept the possibility that you’re dreaming about something real, you’re never gonna think about this if you, if you accept that possibility, yes.\n\n[00:25:29] Alex Tsakiris: I’ll give you a specific example that I often use that’s kind of drives the point home.\n\n[00:25:33] Alex Tsakiris: I interviewed this guy a near death experiencer. I have no reason to doubt his experience. And it was really quite dramatic stung by these boxed jellyfish that can kill you, stung seven times. He was actually put in the morgue. It was in this, oh, I know about comes back, comes back to tell us all that Near death experience is a exclusively Christian experience.\n\n[00:25:58] Alex Tsakiris: And he knows this cuz he met Jesus. He met God and he goes around to all churches and talks to Christian people and he says, look, if you’re not seeing Jesus in your nde, I’ll tell you buddy. Then you’re, it’s satanic, you know. Now this guy, I don’t wanna put him down because he, he had a screen over there, right?\n\n[00:26:19] Alex Tsakiris: He, he left to that other dimension. He had a screen, he interpreted it. And if you listen to what he says, he’s not like completely misinterpreting it. He’s like, no, I met Jesus. This is what Jesus told me. I got another guy, David Ditchfield. Same, met Jesus. You push him a little bit further and he goes, well, I’m not really sure if there was something above that that I didn’t see.\n\n[00:26:44] Alex Tsakiris: But again, that data coming back to us is, Problematic in a, in a number of ways. Yeah, I\n\n[00:26:52] Andy Pacquette: agree with you. And I also, I, I know about the, the situation you’re talking about with the box, uh, jolly guy. And I’m a little disappointed with him interpreting the experiences that way myself, just because there’s other data that contradicts it.\n\n[00:27:06] Andy Pacquette: And I think there’s good reason to believe that the other data’s more accurate than his interpretation.\n\n[00:27:10] Alex Tsakiris: . Gotta interject. But, but let’s be clear because, because you’re really laying it on the line here in a way that I’ve never, I’m so grateful for you to have this conversation, cuz we’ve talked for a long time.\n\n[00:27:20] Alex Tsakiris: I’ve always tried to get to this point and never gotten there. So we’re right on the cusp. No, Andy, , he’s saying, yes, I’m interpreting this and that, but I’m not interpreting the whole thing. Kind of like your dream. You’re drawing these incredible illustrations. If someone came and said, oh no, , there wasn’t one male there, there were six women, you’d go, no, no, there wasn’t.\n\n[00:27:41] Alex Tsakiris: There was one guy there and he was dressed like this. So that is his, he’s not saying he’s maybe a little bit off there, this or that. He’s saying, no, you are off because it was Jesus. And Jesus told me this. Why would he come back? Let me, lemme just ask this question. Why do you expect him to come back and reinterpret, reimagine his experience based on your data any more than I would tell you to do the same thing.\n\n[00:28:08] Alex Tsakiris: No, Andy, don’t worry about your dream. Your dream isn’t, doesn’t conform to the data. Put that one aside. Yeah.\n\n[00:28:14] Andy Pacquette: You’re, you’re thinking, I’m talking about the wrong part of this. Um, because I don’t contest the fact that he’s saying I saw Jesus. The, the thing that is bothering me is him telling other people that if you don’t see Jesus, it’s Satanic.\n\n[00:28:25] Alex Tsakiris: first. That’s what Jesus, that’s what Jesus told him. Why do you want, oh, I\n\n[00:28:30] Andy Pacquette: didn’t get, get that. I thought that was his interpretation. Okay. . . That’s interesting. I’d have to think about that. I, I hadn’t, I didn’t realize that that was,\n\n[00:28:37] Alex Tsakiris: um, see, this is the problem with the mystic is that when the mystic comes back and is confronted with the, reason in logic, which is we can’t dismiss or discount the reason in logic and say, no, that doesn’t conform to all these other accounts.\n\n[00:28:55] Alex Tsakiris: No. The entity that you saw is contradicted by Gregory Shan’s analysis of near-death experiences across culture across time in 600. You no, it doesn’t conform to that. I think too often I, I hear the mystic just plow ahead rather than give pause and say, I don’t know why that, I don’t know why I got that information and someone else got information that does contradict what I, what I was\n\n[00:29:26] Andy Pacquette: Well, what you’re, okay. Basically what you’re illustrating is imperfect knowledge. And I think, I think that’s a given. I, I kind of assume it when it comes to this kind of stuff. I assume it’s a, a, you know, like a fragment or a, a a, a glance at something that you’re not really seeing the whole thing. Um, kind of like archeology where you’re, you’re digging up the tombs, but you can’t talk to the people who are there to explain how they got there.\n\n[00:29:49] Andy Pacquette: You have to kind of figure it out. And I think that there’s always going to be a level of interpretation in all of this stuff, um, including anything that I talk about. Um, and actually I know that, because while I was talking about one of them, I was saying, I figured this wasn’t, you know, who I thought it was in the dream it was somebody else.\n\n[00:30:05] Andy Pacquette: And I did that based on other clues that were within it that I’ve learned to recognize based on examining these things carefully. Um, and in the same way, like, uh, some of the other research I’ve done, I’ve, I’ve certainly found some things. They’re, they’re genuine observations, but how they got there or what they’re doing, that’s me interpreting what I see.\n\n[00:30:25] Andy Pacquette: So I, I think that when you’re, when you’re talking about the box jellyfish guy whose name I, I’m sorry it escapes me, but, um, Ian, Ian McCormick, but that’s, there you go. That’s it. Yeah. Ian McCormick. So, uh, when you’re talking about Ian, I don’t wanna discount what he experienced or what he says he experienced or how he recalls it, but on the other hand, the way he’s, he’s presenting this to other people doesn’t seem completely correct to me.\n\n[00:30:52] Andy Pacquette: Okay. And if, if that one part that you just said is literally something straight out of his dream, then I, I I’m asking myself, okay. How could that be true?\n\n[00:31:01] Alex Tsakiris: Well, I’ll tell you, I’ll tell you my interpretation of how it can be true. Yeah. And it, it’s like I’m jumping into your story, but that’s okay. Cuz I can jump into your story.\n\n[00:31:12] Alex Tsakiris: You are not, you are here talking to me. You’re not in that mystical state. You are, you are here now. You are not in that other alternative timeline. And that’s what I think the, the mystics always forget is that I can relate to this in a way that I process dreams. Number one, I I was just kind of a normal dreamer until my son turned me onto Lucid Dreams and he turned me on, if you will, just by telling me repeatedly over and over that he was having Lucid dreams and an eight year old kid and he’s your son.\n\n[00:31:43] Alex Tsakiris: You’re like, he’s not making this up. So then you, you research it a little bit. And anyone who’s looked into Lucid Dreaming will tell you the, the, the most likely trigger event for you. Having lucid dreams are not having lucid dreams. Is someone telling you that it’s possible they have lucid dreams. As soon as they tell you, then your mind can do it.\n\n[00:32:00] Alex Tsakiris: But as soon as you have a lucid dream, my experience with it is I suddenly realized that all my dreams were this combination of me in control and something else in control, and that I was in this dance of creating and seeing the unfolding of it. And so that’s part number one that I would have to resolve inside of, you know, everything that you’ve done.\n\n[00:32:26] Alex Tsakiris: But number two is I think back on dreams that I’ve had for a long time. Even in the morning, I will, and they are no longer of the same nature that they were there. So I just gotta believe that when we’re in this timeline, in this time space continuum, we’ll have some aspect of that greater, but , of course, it’s not going to be accurate. It’s, it’s, we’re human, we’re, we’re down here.\n\n[00:32:54] Andy Pacquette: Yeah. Well, okay. You know, on a, on a basic level, I can go along with that. Uh, yeah, I can go along with that. That we’re gonna be making those kinds of, , either mistakes or interpretations or maybe even the messages delivered to us in such a way that we on purpose make those mistakes because the message has to be delivered that way for us to understand it.\n\n[00:33:15] Andy Pacquette: Um, and I can picture that too with Ian McCormick that it would be delivered. In fact, actually this reminds me of something I found really interesting in this book that I get a huge kick out of. I’ve read it probably, I don’t know, 30 or 40 times now. Uh, the boy who saw True, this is literally my favorite book.\n\n[00:33:31] Andy Pacquette: It’s an anonymous, it’s a reproduction of an anonymous, From a, like a six year old kid, um, back in the 1880s. He happens to be clairvoyant and doesn’t know it. And so he just wrote this diary out and after he died, his widow brought it to, uh, Cy Scott, who is a musician who published a few books at the time and asked him if he’d be willing to find a way to get it published.\n\n[00:33:53] Andy Pacquette: And so he published it with some notes. Um, but one of the things in there is the boy is saying that I saw Jesus again. I saw him tonight and this is what he said. I saw Jesus. He says this several times, but at a certain point in the book, he has a, um, a, uh, tutor and the tutor figures out that the kid is clairvoyant and starts asking questions about it.\n\n[00:34:16] Andy Pacquette: And, um, and during one of those sessions, um, it comes out that it’s not Jesus. It’s, it’s, uh, the astral body of some Indian in India who is sleeping at the time and giving him instruction while he’s sleeping. And he says it, I didn’t tell you before because it was convenient. Um, it was more convenient this way because it would be too confusing for you at your age for me to, um, to, to tell you I, who I really was, because you just wouldn’t understand it.\n\n[00:34:45] Andy Pacquette: But now that you’ve got this tutor here, I can explain to him and he can explain it to you, and you’re gonna understand it now. So now you know, you can, you just know me as your friend from, from this other place. Um, so I can certainly picture that kind of thing going on all over the place where it’s not, uh, uh, like a malignant, uh, uh, action, you know, designed to pull the wool over our eyes or deceive us in any way.\n\n[00:35:07] Andy Pacquette: It’s more that they just allow us our knowledge and our experience and our connection to these things to define how we understand what we’re being told, , so that I can picture.\n\n[00:35:20] Alex Tsakiris: So Andy, back to the, the final question, the big question. What does this tell you kind of deep, deep in your soul about the nature of reality?\n\n[00:35:32] Alex Tsakiris: And I keep hearing consistently the data, the data, the data is love is goodness, is light . And that comes through again and again. And then I hear so many folks who want to ignore that, don’t wanna talk about that.\n\n[00:35:47] Alex Tsakiris: It’s like we went through the, the whole thing with the near death experience science for 20 years. And you know, I always remember, well one researcher, and I’m almost sure it was Jeff Long, who said, look, everyone’s ignoring the fact that the overwhelming statistic here is that like in the high nineties, people are saying it’s about love, it’s about connection to the light.\n\n[00:36:10] Alex Tsakiris: And the reason I bring that up is I, I, I don’t like hold onto that because I wanna believe it. I hold onto it because the data for that is overwhelming and everyone seems to want to just talk about AI and ET and all this stuff that’s just so much more backdoor materialism kind of stuff, which is interesting and occupies our, our imagination.\n\n[00:36:40] Alex Tsakiris: But it just seems to be , a whole leap away from the essence, the core essence of the data.\n\n[00:36:47] Andy Pacquette: . I happen to agree with that and that’s certainly consistent with my own experience. , I mean, I certainly see like a darker side to this, but that’s not. That’s not the goal, that’s not the objective. It’s, it’s not what everything’s trending towards. It’s what we’re trying, we’re trending away from.\n\n[00:37:02] Andy Pacquette: Okay. , so when I see people talking about the unpleasant NDEs, for instance, as, as proof of the idea that they’re not all pleasant, , I would say that’s because of that person’s mental construct or their, you know, the, the condition of their spirit at that time is, was causing that to happen. But yeah, everything is about love and light.\n\n[00:37:19] Andy Pacquette: I think that is ultimately the message of everything that I’ve been getting anyway. , although initially when I started this research, that’s not what I was looking at. I was just, it, and that’s how I got drawn into it. , I got drawn in because I was seeing, I was having dreams of the future.\n\n[00:37:32] Andy Pacquette: And actually it wasn’t even because I saw it. My wife saw it and she got me, uh, looking into it, and then I saw she was right. , it was only over time after I accepted that part of it that I started seeing the other stuff. , and I, I saw, you know, I’ve seen God in my dreams. I, I, as far as I’m concerned, he’s very real.\n\n[00:37:49] Andy Pacquette: And as far as the nature of reality is concerned, what we were experiencing right now is not reality. This is the dream state. This is the dream world, okay? What we call dreams is our very poor recollections of the real world. Okay? So it, to me it’s the, the permanent, , existence that is more real than the imper one.\n\n[00:38:07] Andy Pacquette: And this physical universe is Im permanent, and the spiritual one is permanent. So that’s reality.\n\n[00:38:13] Alex Tsakiris: I said that was the final question. I’ll slip one more in , how high is the hierarchy? How far does it go I kind of have a sense that this is where people stumble.\n\n[00:38:22] Alex Tsakiris: They see the hierarchy down here, and that’s what they think of hierarchy. And I think what we’re talking about, the data comes back and says, no , no. It’s like , an order of magnitude. More magnitudes, magnitude beyond that, in terms of the hierarchy, what are your thoughts?\n\n[00:38:39] Andy Pacquette: , I wouldn’t be surprised. , I mean, if you look at a, , gradient and a computer that’s got a high Vitex screen, right?\n\n[00:38:45] Andy Pacquette: You know, you go green to yellow or any, any two colors, right? You can have millions and millions of variations of yellow and orange from one side to the other, as as it blends from one color to the other. And I would say that when you’re talking about hierarchies of spiritual hierarchies, it’s gonna have to do with the individual, , history of every individual spirit.\n\n[00:39:06] Andy Pacquette: And it’s gonna be much more numerous than all of those pixels in the gradient pattern because everyone’s going to be that much different, and that’s gonna put them in a different location. , and ultimately I would say we’re not talking ranks, you know, like a major and a kernel in a general, , , what we’re looking at is just exactly who we are and where we fit in and how, where those experiences place us and how it adds to our knowledge.\n\n[00:39:30] Andy Pacquette: , but we are all different, and that’s the hierarchy, if that makes any sense. , and as, as far as, you know, some people having, or some spirits having more sway than others, that would just be because they have more knowledge or experience in a relevant area. , and that would put them in a position to share that with someone else, but it doesn’t necessarily mean that they’re above them.\n\n[00:39:52] Andy Pacquette: You know, actually another point from the boy who saw True that I really like is, , in that book, the boy’s mother is kind of frightened by the fact that he seems to be clairvoyant. I mean, she doesn’t comes out and says it, but you can tell she’s like, you know, maybe there’s something wrong with your eyes, you know, when he sees ghosts, right?\n\n[00:40:08] Andy Pacquette: We’ll have an op optician in here to look on you and, and we’re gonna bring you to the Hertfordshire, , spa and, and see if, you know, the, the taking the waters there will, will improve your vision problems or whatever. , so the thing is that one thing that boy is told , , in one of these, , clairvoyant encounters , with the tutor present is.\n\n[00:40:28] Andy Pacquette: You had to know about this and you had to meet the scooter at this time in your life because your mother cannot appreciate your gifts. , she has a closed mind to this kind of a thing. She lacks knowledge of this. She lacks any experience of it, it does frighten her. And you needed to know that this was okay.\n\n[00:40:46] Andy Pacquette: And that’s why we arranged for you to have this tutor so that you could have someone you can talk to. But the thing you also need to understand is that for all that she doesn’t know about this, she knows other things you don’t know and you have no experience of, and she will help you in those areas. So you need to be aware that even though you might be above her in knowledge in this area, she’s above you in other areas.\n\n[00:41:07] Andy Pacquette: And those are also important. So when I, when I look at this concept of hierarchy, I, the, the reason I specify it is we are who we are and that places us where we belong in that hierarchy, I want to keep in mind that we all have these different experiences and that puts all of us above somebody else and all of us below somebody else, because there’s always someone who knows more.\n\n[00:41:32] Andy Pacquette: And there’s always somebody who knows less. , until you get to the top of this and we’re talking God. But, , like in my case, I can talk to you about, you know, certain subjects and other subjects, I’d be completely hopeless. , and I think that extends in every direction.\n\n[00:41:44] Alex Tsakiris: Why evil? Why does it exist and should we resist it?\n\n[00:41:51] Andy Pacquette: This is not the question I expected to be answering today. , I don’t know, quite frankly. I, I, I think it’d be kind of tough to say why. , but I think it may be because we have free will to experiment in this reality. And free will you could look at simply as curiosity In this particular case, I mean, I’ve been curious about things that were amazingly stupid and , you know, like I, I once was curious about all these bees that were or lost that are coming out of a hole on the ground in a field when I was a kid.\n\n[00:42:17] Andy Pacquette: And I thought, I wonder what happened if I put my foot over this hole. Okay. And next thing I knew, I had my foot on a landline basically. Cause I had a, who knows how many, hundreds of those guys eager to get out. And as soon as I moved my foot, they got me. I, I got like 20 stings in my neck from that experience.\n\n[00:42:32] Andy Pacquette: It’s horrible. It’s the most painful thing I’ve ever experienced in my life. , and as far as I’m concerned, evil is no more complicated than that. It’s, somebody gets curious, what’s gonna happen if I do this? Okay. They get the reaction, okay, maybe it’s delayed. Sometimes they get the reaction and what they did was evil.\n\n[00:42:46] Andy Pacquette: And what I did with that you could say was evil in the sense that I shouldn’t have done it. , , I was blocking a passageway intentionally, , and thus, uh, causing potential harm to the insects underneath.\n\n[00:42:56] Alex Tsakiris: My understanding of evil is more along the lines of a blockage of the light that is convenient at the time, or seems logical at the time.\n\n[00:43:06] Alex Tsakiris: And we make that decision and then that gets us into a pattern.\n\n[00:43:12] Andy Pacquette: Yeah, I can see that happening. I mean, I can also see people developing a taste for evil. I mean, we certainly have examples of psychopaths who do really crazy, evil things. , and in those cases, I would say it’s, it, it actually in every case, a lack of understanding on their part.\n\n[00:43:28] Andy Pacquette: , and it, it causes this stuff to happen. It doesn’t make it any less evil. And it doesn’t mean it shouldn’t be stopped. It absolutely should be. But, , But the, but the fact is, there are reasons why that would happen. And I think ultimately, , you know, when psychologists look at this stuff, a lot of times they say, well, this is psychological damage due to, you know, certain things happening in your upbringing.\n\n[00:43:47] Andy Pacquette: And I can tell you I’ve had the kind of upbringing that would put me in that category pretty easily. , and it didn’t affect me that way. And I know plenty of other people that have backgrounds like that and it doesn’t affect them that way. And I also know people who had very comfortable lives, you know, their parents were wealthy and they, everybody liked them.\n\n[00:44:03] Andy Pacquette: And you know, they, went to church and, and yet they turn into creepy, sadistic weirdos. , so ultimately, I don’t think those kinds of things are the reality of it. I think the reality is a spiritual one and it’s where they come from and where they come from is not their parents. Where they come from is , the accumulated experiences of their spirit.\n\n[00:44:21] Andy Pacquette: And, and that’s where evil comes from. Does that make sense,\n\n[00:44:24] Alex Tsakiris: Andy? This has been just amazing and I hope we can share it with other people and they find it to be amazing. And if only a couple do, then they’re the right ones to have received it. So it’s all good. Uh, thank you so, so much. You are, you’re just unbelievable.\n\n[00:44:44] Andy Pacquette: Well, thank you too. I, I appreciate it. , now by the way, in keeping with the, everything is light.\n\n[00:44:50] Andy Pacquette: I’m wondering if you’re going to change the dark theme of your background at some point. Uh, . Cause you’re wearing black. I mean, I’m wearing black too. I don’t normally do this, but I thought it’d be good contrast for this.\n\n[00:45:01] Alex Tsakiris: , well I did it cuz like I just had a t-shirt on and if you put the, see how that, see what that does to the camera?\n\n[00:45:10] Alex Tsakiris: So I was just scrambling around trying to get something. and this was, I could have run upstairs and got a another. I have all these t-shirts that I’ve made to inspire me. This one says keep the main thing, the main thing. You know, I thought it said\n\n[00:45:30] Andy Pacquette: And I keep the, what? What did you think it said? Keep the main thing, the main thing. . That was fine. , anyway. Okay. Well that’s fine. I’m just gonna say this, just, uh, I, I, I’m a little still thinking about the anti cat doctor arc thing. , cuz nobody knows that connection.\n\n[00:45:47] Andy Pacquette: Of course it’s going to come out because I pub I wrote this paper where I,\n\n[00:45:51] Alex Tsakiris: I, I talk about all these things, Andy. It’s out. , it’s out. Trust me. Anyone who wanted to, you’re not hiding. Anyone who wanted to find would find you in a in a second. They don’t care anymore. They don’t care anymore.\n\n[00:46:08] Andy Pacquette: Yeah, you’re probably right about that.\n\n[00:46:09] Alex Tsakiris: Time has passed. They don’t care anymore. . No one’s gonna fix this problem. No one’s going to jail. So we can just tell, we can just tell folks what happened. And the, the, the true, the true spirit of truth, uh, finding is, uh, will, will win out if it’s supposed to win out.\n\n[00:46:29] Alex Tsakiris: You know, just\n\n[00:46:30] Andy Pacquette: outta curiosity, um, I know I, I’d like to be more optimistic that something would happen. , this would be fixed, but let’s take your position as, as true for the time being. Okay. So let’s say it’s exactly as you say. So if things continue like this, what do you see for the.\n\n[00:46:46] Alex Tsakiris: You know, the thing that I always point to, especially recently, , I don’t know why this puts people on tilt, but if you know me well enough, Andy, that, you know, is soon as I found that this immediately put people on tilt.\n\n[00:46:58] Alex Tsakiris: I just go there all the time. , and that’s slavery in America. Yeah. Well, that’s what it is. Well, no, I’m talking about 18 hundreds, 17, 18 hundreds. Yep. Yep. That is, that is demonic. That is Satanic in. I’m not Christian. But whatever those terms mean, that is, that you would take this person, you would enslave them to do work.\n\n[00:47:28] Alex Tsakiris: You would go to church on Sunday and then come home and rape their little eight year old daughter or son as you pleased that you would rip a child from the mother’s arms and sell her. This is Satanic, this is evil. And this went on for year after year, decade after decade. We fought a war over it. People still wanna recast that.\n\n[00:47:54] Alex Tsakiris: I’m always amazed at people who wanna apologize or kind of change that history. No, we fought a war over that. Now. We did it for another a hundred years. So I think sometimes when we get caught up with our special little point in the timeline, and you know how, oh my God, what is gonna happen? Hey, as a country, we, we live through that.\n\n[00:48:16] Alex Tsakiris: You, you wanna jump ahead in the ti timeline. , the other one I like to go to is Abu grave. Abu Grave. Remember the photos? Well, we went out on the battlefield and we scooped up these. People, we later found out that about half of them were really combatants. Other were just innocent people that were on the battlefield.\n\n[00:48:38] Alex Tsakiris: And we did the most horrific torture of them imaginable. If you wanna remember those photos, we made them stand in their own feces in urine, we made, we handcuffed and made ’em do perverse sexual acts that went against their deepest spiritual traditions. We did stuff to their genitals. We did this, that military did this, and no one really went to jail or was a, so, you know, what’s gonna, what’s gonna happen?\n\n[00:49:12] Alex Tsakiris: What’s gonna happen over, over this? I mean, , what’s gonna happen is what you are doing right now will find a way to go forward and hopefully make it better. But for God’s sake, , let’s own our history a little bit here and use that as a, as a guide to what we’re in.\n\n[00:49:33] Andy Pacquette: Well, you know, it’s funny because my, my dreams have something to say about this.\n\n[00:49:37] Andy Pacquette: , but I, I don’t really share a whole lot just because I don’t like to think that it’s true. But, and one thing, since you mentioned Abu Grave, I actually have a personal connection to that story, and that is, , when I caught the, , Sony taking, or not taking money, but covering up for another company that was taking money from the de Department of Defense, , we had, , Seymour Hich from, uh, you know, the Village Foy, who was gonna do a story about it.\n\n[00:50:01] Andy Pacquette: And, , but then when my attorney called him, , you know, with a, with a follow-up call, Hersh said, I’m sorry, I have to drop that story because I’m on a plane to this place called Abu Gray. It’s a bigger story and that’s what I’m gonna, I’m gonna do instead. But, , anyway, but with my dreams, uh, they are saying very, very bad things are happening, are going to happen to America.\n\n[00:50:23] Andy Pacquette: They’re gonna be devastating and they’re gonna be totally unexpected, but they, it’s gonna be very, very devastating.\n\n[00:50:29] Alex Tsakiris: , so one thing , that I would ask Theistic again, very famously, uh, Ken Ring.\n\n[00:50:36] Alex Tsakiris: Kenneth Ring, who is a prominent near-death experience researcher and parapsychology researcher, focused in on these people who had precognitive dreams of environmental disaster. And a lot of people have had those over and over again. And there was another independent researcher that did the same, and they came up with the same results.\n\n[00:50:59] Alex Tsakiris: And the results were this large scale global environmental disaster in the 1980s. Yeah. So it didn’t occur. It didn’t, it didn’t occur. So that’s why , I totally respect everything that you just said, and I just say maybe, maybe not. I, and I kind of think that I am a co-creator of this reality, and I’m not in the backseat waiting for, , America to, , fall apart or for the world to fall apart.\n\n[00:51:27] Alex Tsakiris: And also, I look at it from a pragmatic level. It’s, we’re still the beacon of light of the where would you go? Where, where would you go? Would you go to China? Would you go to Russia? Would you go to Europe? We have to make this the best we can because despite everything else, , we still have some of the keys to the kingdom.\n\n[00:51:49] Alex Tsakiris: We can, to the best of our ability, restore it better than we have a chance. Yeah. If you are, if we’re having this conversation in China or Russia or a million other places, there is no chance that we will affect any change. At least here there’s a chance. You are doing it, you’re doing the work.\n\n[00:52:10] Andy Pacquette: You know, it’s funny, while you were talking, I had this, this image came to me, uh, from what I’m painting, you know, back when, back when I was like this painting behind me.\n\n[00:52:18] Andy Pacquette: Okay. So when I make my paintings, I want my colors to be clean. So to do that, I mix my colors before I put any brush strokes down on the canvas. Okay. So I figure out what all the colors are that I’m gonna need before I do anything. Okay. And then when I change colors, I change brushes also so I don’t get the paint mixed up right.\n\n[00:52:36] Andy Pacquette: But I hate to throw away all this expensive paint when I’m done with the painting. So I will take, , usually I take like a piece of paper and I make a quick like, duplicate of the painting, , on paper. , just using all those colors. I figured at least that way I’ve got. , but then I still have a lot of paint left over.\n\n[00:52:51] Andy Pacquette: So what I do is I dump it all into a jar for basically a gray color or a dark purple or something, right? So it all gets mixed together and it’s a big mess. So then I’ve got a jar of this gunk, basically. Okay. And so whenever I need gunk added to like a bright color, I can go, go get it. Okay. So when I, when I look at humanity, I’m thinking of all this gunk in this jar.\n\n[00:53:11] Andy Pacquette: It was all these pure colors at one time, but now it’s just like gray garbage. Okay? And, and I’m looking at the task of improving humanity as trying to go in there and find all the individual specs of like, cadmium, yellow, medium, and washing off all that other John, and taking them out and making them pure again, and then putting them together where they belong.\n\n[00:53:34] Andy Pacquette: That’s what it feels like. It’s a huge track task. Does that make sense?\n\n[00:53:39] Alex Tsakiris: , , where does that lead you , cuz cuz here was the point remember is you’re saying I had these pre-cognitive dreams, man, America’s going down the tubes.\n\n[00:53:46] Alex Tsakiris: Oh right. And I’m like, not so fast. That’s the other thing that comes back that does kind of, kind of peeve me about the mystic is that come back into this world, look at this timeline and use something called the scientific method and look at the data and look at the exceptions to the data.\n\n[00:54:01] Alex Tsakiris: And we have to explain those too. Cuz as we know as good scientists, the exceptions sometimes tell us more than the patterns. So here are the exceptions. It doesn’t always work out like you think.\n\n[00:54:11] Andy Pacquette: Yeah. So first off, I’ve referenced the research you’re talking about as an example of exactly what you just said.\n\n[00:54:17] Andy Pacquette: , because I, I want to be aware of these kinds of things and I want to be aware of the fact that they don’t always pan out. And I want to have an idea of why that is. So when I talk about it in the context of the dreams I’ve had about the future, which has nothing to do with an environmental disaster, by the way.\n\n[00:54:33] Andy Pacquette: , I have that same attitude. Well, let’s wait and see what happens. The thing that bothers me is that everything’s trending in that direction. Now. It wasn’t before, but now it is. And that’s, that’s the thing that makes it more interesting, , because when I’m, when I see the, like the dream I had of New York being not completely, but nearly depopulated and the way it happens where none of the buildings get destroyed, it’s just the people leave willingly and then other people come in and take their place, but not in the same numbers.\n\n[00:55:01] Andy Pacquette: So you’ve got like 90% of the city is gone and, and then you’ve got this 10% remaining. , I can actually picture that happening now as a combination of lost commerce, the pande, the pandemic, pardon me, and all this illegal immigration going on. , I can see all three of those things conspiring to create a scenario like the one in that dream.\n\n[00:55:19] Andy Pacquette: Whereas prior to like two years ago, I wouldn’t have been able to picture that. , , the, , you know, the, the pandemic policies, those things scared the daylights out of me because these vaccines, I don’t think we’ve even gotten close to knowing the extent of damage that’s been caused by those things because they have, you know, some people drop dead that right away.\n\n[00:55:36] Andy Pacquette: Some people get myocarditis and die two months or three months or six months later. We have no way of knowing yet the magnitude of the harm that’s been caused. And not only that, even the people who don’t die, if they’re just debilitated and they can’t function at the same levels, they’re less productive.\n\n[00:55:51] Andy Pacquette: You know? And, , and that lack of productivity I is meaningful because it, it means our infrastructure is disabled. And that is important because having a disabled infrastructure disables people too in another way. ,\n\n[00:56:04] Alex Tsakiris: do you ever notice, Andy, how you can seamlessly shift from this incredibly, , mystical view of the world to this very, , mechanical, , database spreadsheet, which is valuable?\n\n[00:56:16] Alex Tsakiris: I’m not, I’m not criticizing you Andy, cuz it, it’s extremely valuable. You couldn’t have done the work you’ve done on the elections without that. But , the, the switch that you do is, very interesting and I’m not sure quite what to make of it. And I wanna know, are you, are you kind of aware of, of that kind of No, the way\n\n[00:56:35] Andy Pacquette: you just said, its like a total surprise to me, actually.\n\n[00:56:37] Andy Pacquette: I found it kinda interesting . , but no, I’m, I, I don’t, I don’t think of it that way. I mean, uh, I do know I am aware that I have a tendency to draw analogies quite frequently. And I have a reputation among the people who know me for drawing pretty good, you know, analogies, , I think you might have noticed that yourself every once in a while.\n\n[00:56:57] Andy Pacquette: , I actually, uh, what did, what was the nickname? There was this, uh, guy made a nick, a nickname for me that had the word analogy in it. , and I forget what it was. It was, it was not a, , friendly, , nickname, by the way. . This guy didn’t like the fact that I did that all the time, but I just found it easier to explain myself that way.\n\n[00:57:13] Alex Tsakiris: You’re an artist. It’s like your fantastic, , illustrations. I mean, I, I’m looking at those and like, I mean, a picture is worth a thousand words. It’s, it’s unbelievable. We, we ought, we ought to wrap this up. We could. Because, and the reason I just said that is not because I have to go or that I want to cut this off.\n\n[00:57:32] Alex Tsakiris: It’s that I almost, I felt this urge to talk about AI now and these AI generated images and what you think those mean to art and what those say about the, our, consciousness and our creativity and the touring test and all the rest of that. And I kind of feel like that’s an hour discussion that I can’t even, I can’t even, it is, and\n\n[00:57:57] Andy Pacquette: I have opinions about artificially generated art also.\n\n[00:58:01] Andy Pacquette: , very, very strong opinions about that.\n\n[00:58:04] Alex Tsakiris: Let’s, let’s do, let’s do an AI\n\n[00:58:06] Andy Pacquette: interview. Yeah. Maybe so. Okay. Uh, I, I will talk to you later then. Have a good day.\n\n[00:58:12] Alex Tsakiris: Thanks again to Dr. Andy Piatt for joining me today on Skeptiko. The one question I tee up from this interview is,\n\n[00:58:19] Alex Tsakiris: ? What the heck are we to make of the time, space continuum that we think we’re on when people like Andy seem to be able to twist it, turn it, manipulate it? And then I guess if I was gonna sneak in a second question, why does that not necessarily lead to.\n\n[00:58:38] Alex Tsakiris: Kind of a perfect knowledge of everything. Love to hear your thoughts. Track me down. Until next time, take care. Bye for now\n\nUntil next time, take care. Bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Andy Paquette, Precognitive Dreams |583| - Skeptiko - Science at the Tipping Point", "description": "Dr. Andy Paquette… peer-reviewed precognitive dreams… world-class graphic artist… mystic. Click here for Andy Paquette’s Website Dream substack: https://sleepwakes.substack.com/ Zark Files: https://zarkfiles.substack.com/ Art:  www.paqart.com www.paqphoto.com Click here for forum Discussion [00:00:00] Alex Tsakiris: on, this episode of Skeptiko, a show about things you cannot see, [00:00:08] Clip: your thoughts attract things with a force that you […]", "url": "https://skeptiko.com/andy-paquette-precognitive-dreams-583/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2023-02-17T19:22:14+00:00", "article:modified_time": "2023-02-17T19:27:41+00:00", "image": "https://skeptiko.com/wp-content/uploads/2023/02/skeptiko-583-andy-paquette-dreams.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Andy Paquette, Precognitive Dreams |583|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/AxtbN8fwffw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/AxtbN8fwffw?feature=oembed"}], "links": ["https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-583-andy-paquette-dreams.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-583-andy-paquette-dreams.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-583-andy-paquette-dreams.mp3", "https://www.skeptiko-forum.com/threads/andy-paquette-precognitive-dreams-583.4862/", "https://www.paqart.com/", "https://sleepwakes.substack.com/", "https://zarkfiles.substack.com/", "http://www.paqart.com/", "http://www.paqphoto.com/", "https://www.skeptiko-forum.com/threads/andy-paquette-precognitive-dreams-583.4862/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2023-02-17T19:22:14+00:00"}