{"result_id": "273042", "URL": "https://skeptiko.com/232-greg-taylor-there-probably-is-an-afterlife/", "timestamp": "2023-04-25 17:09:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/232-greg-taylor-there-probably-is-an-afterlife/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Greg Taylor Tells Readers, Don't Worry There Probably is an Afterlife", "cleaned_text": "Interview with the author of, Don’t Worry! There Probably is an Afterlife looks at deathbed visions, near-death experiences and other scientific evidence suggesting survival of consciousness.\n\nJoin Skeptiko host Alex Tsakiris for an interview with Greg Taylor. During the interview Taylor talks about his research into deathbed visions:\n\nGreg Taylor: That’s what really kicked off my interest in deathbed visions. I read Peter Fenwick’s paper with Hilary Lovelace, Comfort for the Dying: A five-Year Retrospective and One Year Prospective Studies of End of Life Experiences. They surveyed 38 palliative carers, including doctors, nurses, anybody involved in that. Their statistics showed that at least 60% had stories of deathbed visions and the like. It’s more than half of all those carers who report these things.\n\nWhen I went to Uni McConnell in Ireland and there’s an American study that had like 500 participants and they’re all around that 60% to 70% of palliative carers say that they’ve experienced these things, it’s just a massive amount. It’s very common and yet we hardly hear of it. Near-death experiences get all this media attention and deathbed visions don’t seem to rate the same attention.\n\nAlex Tsakiris: Why do you suppose that is… I think one factor is we like the technology angle of resuscitation, and it fits in with our cultural bias about how medicine is advancing. I think that fits into this story. We’re bringing people back and now they can tell these stories.\n\nGreg Taylor: I’d agree with you there. I think that’s probably tied in to as well with the fact that we’d prefer to hear about people living than people dying. We don’t want to confront the fact that people do die all the time.\n\nToday we welcome Greg Taylor to Skeptiko. Greg is the creator of the amazing stalwart of paranormal websites, The Daily Grail, which has been going strong for probably longer than the Internet has been around. Greg also has a new book out now called, Stop Worrying! There Probably is an Afterlife, something that is right up our alley here on Skeptiko.\n\nGreg was a guest on our show over four years ago. It’s a great pleasure to welcome you back, Greg. Thanks for joining me on Skeptiko.\n\nGreg Taylor: It’s a pleasure to be here, Alex.\n\nAlex Tsakiris: I thought we might start with, since a lot of people probably are familiar with The Daily Grail but a lot of folks probably aren’t, let’s start there. Tell folks about The Daily Grail, what you do there, what’s been happening there, how it started, just the basic rundown on The Daily Grail website.\n\nGreg Taylor: The Daily Grail is basically a website that’s devoted to news on science and history and anything on the fringes of the mainstream. We don’t go too far. We’re not into the whacked-out territory of people just losing the plot completely. We’re just testing those edges of science and history which a lot of orthodox scientists would say were woo—Randi or someone like that. I don’t think science can move forward unless people keep pushing those boundaries of the edges of science and history. So that’s what the site’s devoted to.\n\nIt started 15 years ago so it’s been going a long time. It’s just evolved over time. Originally I was more interested in a lot of the history things. That’s what I grew up with. Since then, as time’s gone on, I’ve become more and more interested in matters of consciousness which I think really is the big fringe area of science. As much as science likes to claim they know what’s happening with the mind, really we still have no idea. So that’s taken a lot of my time over recent years and has ended up in the book that I’ve just written.\n\nAlex Tsakiris: Why this book? Maybe you answered that earlier when you said you feel like your site, The Daily Grail, has shifted more and more into the consciousness area. Why did you feel a need to tackle this survival of consciousness issue, near-death experience, deathbed experiences, and all the rest?\n\nGreg Taylor: It’s just become an area that has really interested me. The general public knows about near-death experiences. That seems to be news that gets out there in the mainstream. When I started looking at deathbed visions or end-of-life phenomenon, which is a whole chapter, there are just some amazing things in there. Peter Fenwick’s done some amazing work there and researched the things that are showing up.\n\nI think a lot of people weren’t aware of that. Even though they’ve released it there are a lot of people who thought they knew a lot about these topics and they’re coming to me saying, “Wow, I did not know that. This is amazing.” The whole goal of the book is to get this information that, if you dig into it a bit, you start seeing just isn’t getting out there to the mainstream.\n\nYou know as well as I do that skeptics are starting to win that whole dialogue in the public by shouting down anything that’s to do with this topic. I just wanted to get a book out there that wasn’t all New Age-ish. It was just going through the actual scientific research and saying, “Look, there seems to be something interesting happening here.” Maybe it is; maybe it isn’t. But we deserve to look at these things more honestly and openly than we are at the moment.\n\nAlex Tsakiris: I think you did a really nice job of it. First of all, it’s extremely well-written—not that I was surprised that it was well-written. It’s accessible on one hand and on the other hand it has a lot of great content as is evidenced by the more than 20 pages of notes and citations that you’ll find in the back. You must have really done a pretty extensive job of covering your reading list before doing this book.\n\nWhat was your initial plan in terms of the breadth that you were going to tackle with the survival of consciousness issue? We mentioned a couple, near-death experience, deathbed visions, terminal lucidity. How wide did you cast the net initially? How much wider did the net get once you got out there and saw what else there was?\n\nGreg Taylor: That was exactly what happened. I knew a fair bit about mediumship in the last hundred years or so. I’ve researched into that. I was quite familiar with the near-death experience thing. I just dipped into the deathbed vision and it just kept growing and growing. I looked at reincarnation stuff for a while–Ian Stevenson’s material and things that have been done since. Eventually I ended up with what would have been about a 600-page book.\n\nIt was getting away from my goal of just hitting people with these cases and keeping it really simple. I think I cut it down from about 150,000 to 74,000 words. The editing actually took longer than the writing in the end. I was trying to make sure it had punch and it got across to the general reader rather than appealing to guys like you and me who are quite familiar with all the topics already. I wanted it to hit the general readers so they could see these topics. It was a big job. The net grew a lot. Then I started having to chop back a lot. Hopefully in the end I’ve produced something that has that punch for the general reader.\n\nAlex Tsakiris: What surprised you the most, Greg? What did you stumble across that really took you by surprise, given that you knew a lot? For people who don’t know The Daily Grail, you’re staying on top of these topics on a daily basis. The Eben Alexander thing hits with near-death experience and you’re all over it; somebody writes a new book or Pim von Lommel comes out with his book years ago and you’re on it. What did you come across that really surprised you?\n\nGreg Taylor: It was the deathbed visions, the end-of-life experiences.\n\nAlex Tsakiris: Let’s jump right in there. Give folks an example of one or two of the cases that you talk about in the book that you thought were really interesting. If you can’t think of one I’ll tee one up. I like your story about Arthur James Balfour and his story. I guess it’s his niece that really gives the story but it’s a pretty amazing account. If you can recall that one and tell listeners or if you have another favorite one maybe you want to share that.\n\nGreg Taylor: I’m a great lover of that whole Victorian era, the spiritualism and things like that. With mediumship research that I’ve done I’ve read quite a lot of that and I find it quite interesting. When you go back to the deathbed vision material, a lot of people died at home in that era. There seems to be a lot more reportage of these sorts of things.\n\nEven if you just leave alone the whole afterlife topic they’re just beautiful stories of people dying with their families. Some are tales of children dying and the parents are with them. Back then, without vaccines and things like that, a lot of young children died. Quite often some of the stories you read, the whole family of children die just one after another. It’s tragic stuff but they make for great stories. Some of those really touched me.\n\nThe Balfour story, he was the former Prime Minister of the UK. It’s fascinating. Again, another topic that hardly anyone’s heard of. I was reading Archie Roy’s book when I saw it and I was going, “Look at this! Why don’t more people know about this deathbed vision?”\n\nAlex Tsakiris: Do you think we could take a minute and read it? I think it would give people a feel for it.\n\nGreg Taylor: I’ll just read an excerpt from the book, which is the start of the chapter and includes some of my introduction.\n\n“Arthur James Balfour was a stalwart of British politics at the turn of the 20th Century, serving as both Prime Minister of the United Kingdom and later as the Foreign Secretary. His influence is still felt today by his authoring of the Balfour Declaration of 1917 which supported the establishment of a Jewish homeland in Palestine. Less well known, though, is the tale of his final days in which the former prime minister and foreign secretary was apparently feted by a diplomatic mission from the undiscovered country.\n\nWith his niece by marriage, Jean Balfour, sitting by his bedside Arthur lay listening to his favorite music, seemingly content with his lot despite his impending appointment with death. With the nurse having retired downstairs and Balfour’s sister, Eleanor Sidgwick, sitting with them in the room, Jean suddenly felt an odd feeling of expectancy, as if anything might happen.”\n\nThen it goes into her account as told in her words.\n\n“…Presently I became aware with a sensation of a mighty rushing wind (which was entirely subjective, as nothing around me was even stirred), that the room was full of a radiant, dazzling light. This I felt rather than saw, as a blind person might do, and I started trembling.\n\nNow it seemed to me that there were people there too; they had no concern with me, they were invisible; but I knew that they were clustered about A.J.B.’s bed, and that their whole attention was concentrated on him. They seemed to me to be most terribly eager, and very loving and strong; and I recollect feeling a good deal of apprehension because I felt they were there for some purpose, though I did not know what it could be.\n\nI could not stop the trembling, so I was wondering if I ought to go out of the room into the passage for a little while, when it seemed to me that something like a voice within me said, ‘You are not to go away,’ and I looked at E.M.S (Eleanor Sidgwick) sitting in the armchair to see if she was aware of anything unusual, but she did not appear to be.\n\nThe music came to the passage where the words occur: ‘And in my flesh shall I see God.’ At that moment my eyes were compelled to look at A.J.B. His face, transfigured with satisfaction and beauty, seemed to express all the glorious vision which both music and words conveyed; and I stared, fully expecting him to die at that moment, and to pass straight into the Heaven that awaited him on all sides.\n\nBut his face changed, and then he was shaken with the seizure that marked the last phase of his illness, and I was filled with terror and distress. Perhaps my shock was the greater for having just been upon such spiritual heights; and the extraordinary thing was that I was vividly aware that the feeling in the room had not changed, that the radiant joy and light still thrilled around him, and that the agonising spectacle of the poor body’s affliction caused no dismay to those unseen ones who watched, but that it was what they had wanted to happen.\n\nThat was what seemed to me so incredible as I fled for the Nurse; and as I ran immediately afterwards to telephone for the Doctor, I was saying over and over to myself, It was intended – it was intended.’\n\n…Thinking it over afterwards I began to realise that though to my bodily view it was terrible, to those who see the spirit it may have been simply a fierce effort to cast off the body and set free a soul already with them; and since a merciful unconsciousness accompanies the onset of a stroke we do not know, and never will know, into what peace and joy his soul may have receded in that little space…”\n\nSuch a beautiful little anecdote in the words of someone who was there at the time.\n\nAlex Tsakiris: And it’s interesting because as you point out, if you’re a skeptic you can dismiss this story. You can dismiss anything. You can say, “Oh my gosh, it’s a family member and they wanted to create this.” That doesn’t really make any sense, really. These people are no different than we are today. Why would someone make up this kind of story?\n\nMoreover, the reason that we see a lot of momentum towards this belief that we have is that it is highly suggestive of an afterlife. It’s consistent with so many other accounts that you hear from all kinds of people in all walks of life. It’s so hard to take that in, isn’t it? Because it is such an amazing story. We shouldn’t need thousands of examples. Even though we have a lot of examples we shouldn’t need so many examples of that, should we? It’s an amazing account. I just can’t get over it.\n\nGreg Taylor: The thing that grabbed me about that one was when she introduced it by saying she felt this rush of wind. That’s something else that I’ve researched for quite some time. A lot of people having near-death experiences and other anomalous phenomena feel or talk about a rush of wind hitting them. They use those exact words. That’s what really grabbed my attention.\n\nBeyond any sort of proof of those things, like you said, these are profound experiences and that’s one of the things I ended up coming to in this book. These are life-changing experiences and yet at the moment in modern society they’re being belittled. Again and again in these accounts you find that people didn’t tell about this accounts to other people just because they were afraid of being labeled crazy. Palliative carers and people at deathbeds have these profound experiences and then say, “I didn’t tell anyone for a whole year,” because they thought someone would say, “You’re crazy.”\n\nWe really need to get out of that habit and start talking about these beautiful experiences again.\n\nAlex Tsakiris: You mentioned that a lot of these are recorded from back in the Victorian era but there are also a lot of contemporary accounts, too. I don’t recall while reading your book if you ran across a Diana Archangeli who was a head of hospice at the Kubler-Ross Center in Houston. She’s someone I spoke with. She was not a nurse but a very high-level person in that important hospice group in Houston that really started the whole hospice movement.\n\nShe was in contact with a lot of hospice nurses and collected a whole bunch of these stories and published them in a book. There is a group of hospice nurses for which these accounts are just so commonplace that they’re not even disputed. I challenge any person who is skeptical but still interested in this to go down to your local elder care/hospice organization and buy a cup of coffee for a couple of nurses. Ask them about deathbed visions. I guarantee you won’t get past a couple of sips and they’ll have more stories than can fill a book.\n\nGreg Taylor: That’s what really kicked off that deathbed vision chapter. I read Peter Fenwick’s paper with Hilary Lovelace, Comfort for the Dying: A five-Year Retrospective and One Year Prospective Studies of End of Life Experiences. They surveyed 38 palliative carers, including doctors, nurses, anybody involved in that. Their statistics showed that at least 60% had stories of deathbed visions and the like. It’s more than half of all those carers who report these things.\n\nWhen I went to Uni McConnell in Ireland and there’s an American study that had like 500 participants and they’re all around that 60% to 70% of palliative carers say that they’ve experienced these things, it’s just a massive amount. It’s very common and yet we hardly hear of it. Near-death experiences get all this media attention and deathbed visions don’t seem to rate the same attention.\n\nAlex Tsakiris: Why do you suppose that is?\n\nGreg Taylor: I spoke to Michael Barbato, who is a palliative care physician here in Australia, and he was of the feeling that with the end-of-life experiences the person dies afterwards so there’s not this personal testimony. A lot of the time with near-death experiences you have people who can go on TV shows and say, “I died and I came back and this is what I experienced.” End-of-life experiences, generally they go on to die afterwards so you don’t have this testimony. That may be the driving factor behind that.\n\nAlex Tsakiris: The other thing I think is a factor is we like the technology angle of resuscitation and it fits in with our cultural bias that we have about how medicine is advancing. I think that fits into this story. We’re bringing people back and now they can tell these stories.\n\nGreg Taylor: I’d agree with you there. I think that’s probably tied in to as well with the fact that we’d prefer to hear about people living than people dying. We don’t want to confront the fact that people do die all the time.\n\nAlex Tsakiris: Let’s talk a little bit about near-death experience research. You did a very nice job of covering it in the book, as well. What is the state of near-death experience research? Where are we really at in terms of advancing that to the next level, whatever that level is?\n\nGreg Taylor: There are two fronts there. There’s that whole proof-based evidence which I think Sam Parnia’s effort is probably only the real thing that could convince skeptics or orthodox scientists. For those listeners who don’t know, Sam Parnia and colleagues have this study called the AWARE Study. They have targets in rooms where they think people are going to have cardiac arrests and they hope that if they have an out-of-body experience and they get up to the ceiling they might be able to see these targets and then report back. So if someone comes back or two people come back and say they saw the targets that might start changing the whole imminence-based thing—maybe. Skeptics are rather hardcore in their beliefs about that sort of thing.\n\nThen there’s also the side of near-death experience research where it’s more about learning more about how they affect people’s lives. I think Bruce Greyson’s probably right at the coalface there working on that. So you’ve got these two areas and the evidence based is always going to be an uphill battle. I think the AWARE Study is probably the only method of going forward.\n\nYou do have all these veridical accounts of OBEs and Janice Miner Holden has done a great job of assembling lots of those anecdotes but I don’t think they’re ever going to convince the hardcore skeptics, whereas the AWARE Study might start persuading people if they can come back with data. That’s going to be a really hard push. I explain in the book as to how much research needs to be done just to pull out a few OBEs.\n\nI think Bruce Greyson and people like that writing for the general near-death studies who are looking more at the social phenomenon and the personal phenomenon as to how near-death experiences affect people, I think that’s quite interesting as well. It probably gets lost in the mix a bit. People want evidence but there’s this whole other side that it’s a profound experience and how is it affecting people? So yeah.\n\nAlex Tsakiris: You’ve touched on this a couple of times already but let’s talk about the culture war debate over consciousness. You start the book, Stop Worrying! There Probably is an Afterlife, with a very nice introduction on the ghost in the machine. In that you not only trace the origins of near-death experience research but of this scientific culture war over consciousness. Frame that up for us a little bit.\n\nOn one side we have this—people get tired of me saying this but—consciousness is an illusion of biological robots side versus this consciousness is fundamental. You talk about some prominent scientists who believe that consciousness is the fundamental building block of the universe. Frame up for us that culture war debate over consciousness and where you think it’s heading.\n\nGreg Taylor: This is something we cover on The Daily Grail quite a lot. That’s one reason for the introduction. I needed to introduce the reader to this debate because in the modern day Richard Dawkins and all that seems to get all the publicity, especially when you read a lot of scientific sources. I just explained how over recent centuries all these different aspects of science have led people more and more away from a spiritual worldview into the view that the physical world is everything and we are just slime on a little piece of rock that orbits the sun and we have a limited lifetime and basically there is no meaning to life.\n\nI then point out that even though that gets all the media, there are a bunch of really good scientists, very highly respected, the likes of Paul Davies who don’t believe that’s the case or at least suspect that’s not the case. They see consciousness as something very fundamental in the universe. Us being conscious and then analyzing the universe ourselves seems to be this way of the whole universe waking up and learning more about itself.\n\nThen there’s the aspects of quantum physics where consciousness seems to be really tied into quantum physics. This is something I talked about in another interview recently. It’s amazing when you talk about science and how it’s supposedly concrete facts. It finds out the facts and it reports back the facts.\n\nI went through all the quantum physics literature and it’s quite amazing that you have all these quantum physicists who go from one end of the scale saying consciousness is fundamental and is everything right through to hardcore Materialists who say consciousness has nothing to do with quantum physics. They all state it as if it’s been scientifically proven. It’s quite amazing that that divide, coming from something that you thought was science, you know?\n\nAlex Tsakiris: Yeah, but one of my frustrations is sometimes I wonder if we don’t play into that false divide because it is a false divide. I think that if people dig into quantum theory, quantum mechanics experiments, and not only those but the other experiments with consciousness from all over the place, they’ll find that not only is the data heading us toward this idea of the expanded view of consciousness and away from the status quo view that consciousness is an illusion, but the whole thing was just absurd in the first place.\n\nNo one believes that we don’t love our children, that we don’t love our parents, our family. That there isn’t this special connection that we’re able to form. Yet that is totally at odds with this status quo view, as you said, that we are slime on a rock orbiting the sun kind of thing. You won’t really find anyone who truly believes that we don’t have free will and acts as if we don’t have free will. Yet my kids go to school and they don’t beat them over the head with it but it’s underlying all their education about science. So are we playing into this Emperor Has No Clothes kind of thing where we go, “Gee, there really is a debate out there and it’s hard to see how we have scientists on one side and scientists on the other.”\n\nCan’t we just call it for what it is? It’s a total bunch of bull that just doesn’t make any sense. Consciousness is an illusion and we’re biological robots. We know better than that, don’t we?\n\nGreg Taylor: All of these high profile scientists, Dawkins and the like, they will tell you straight out their beliefs. Whether they believe them fully when they go to bed at night, I don’t know. But they get caught in traps where they say one thing and in the argument you can corner them and say, “Well, if there’s no free will then you’re not making that decision and this argument is absurd.”\n\nThere’s this whole other side, too. When you talk to Henry Stapp, a very respected quantum physicist, he’s just beyond the people are wrong here and let’s just get it right. He’s starting to feel that the actual worldview that we’re teaching to kids in school actually could be responsible for a whole degradation of moral standards in the world. If you push that there’s no free will then nobody has any responsibility and you start going down a very deep and dark hole there. So he’s quite outspoken on that fact in his book. He goes into detail about how he thinks the view of integrating consciousness and free will back into the worldview would go a long way to redressing some of the ills of the world.\n\nAlex Tsakiris: Although that’s a scientist wanting to stay on top of the heap and saying, “We still have all the answers. Just let us spin it a different way.” The way I always looked at it is it really undermines science because the average person who, at least we know from a crowdsourcing standpoint, is not dumb. The wisdom of crowds has been established over and over again. People just know that’s bull so they more and more disassociate with the scientific worldview and they think they’re just a bunch of nerds who don’t know what they’re talking about. And they’re right. They’ve convinced themselves of something.\n\nI remember talking to Dr. Charles Tart years ago about this and he wrote a book on the end of Materialism. I guess he wrote it a little prematurely since it was a few years ago, but when I spoke to him I said, “How can this be? How can these guys keep promoting this nonsense?”\n\nHe goes, “It’s amazing what intelligent people can talk themselves into when they don’t check themselves.”\n\nI think that’s what’s going on. I think the Emperor Has No Clothes. No one believes this; it’s a bunch of crap and I think the general public knows it’s a bunch of crap. It just further undermines their trust in science so they say, “Yeah, engineers can do things. I know my phone works.” But when it comes to really big questions I think they turn away from science and go, “They don’t know what they’re talking about.”\n\nGreg Taylor: There are certainly belief systems involved. As much as scientists and skeptics say they’re the non-believers, there’s definitely belief systems involved there. I just saw an example the other day. A new paper came out disputing the famous experiments on free will from a while back that was quoted over and over again by anybody against free will. This new paper was pointing out errors and where it’s gone wrong. I’ve seen no coverage of it at all.\n\nRichard Wiseman, who is always on about free will, he’s said nothing about it. Dawkins, nothing about it. If Rupert Sheldrake had come out with a paper arguing for consciousness they would have been all over it and talking about it. So again, it’s a belief system that they will not look at things that dispute their belief systems and they’ll attack anything that disputes their worldview.\n\nAlex Tsakiris: You know, I always find things to pick on, Greg, so I guess the thing I’ve got to pick on about the book and want to ask you about is the very first sentence of the book. It’s “You are going to die.” Which I guess is supposed to be provocative and puts us all in the same boat. We have to kind of wrestle this survival of consciousness thing to the ground but hey, don’t worry, there’s probably an afterlife.\n\nI take exception to that. I look at the research; I look at the evidence and I come to the opposite conclusion. You’re not going to die. Isn’t that what the evidence is telling us?\n\nGreg Taylor: Well, there’s two parts to that. The “You are going to die” bit is just the fact that your physical body is going to die. The point there is that people will ignore in any way they can that their physical body is going to die unless there’s some great step forward in a singularity-type thing. I was just putting that right on the table.\n\nAgain, Michael Lombardo, who I spoke to says we need to embrace more the fact that we will die at some stage. We need to be ready. Even if you believe that our consciousness survives on, people are going to be left behind without physical contact with that person. So there’s something there that needs to be addressed.\n\nBut I agree. The whole point of the book is to say there seems to be evidence that consciousness does survive. The opening was just basically like you said, to hit people in the face straight-up and say, “Let’s address this off the mark.” Also just to get at that fact that you have to start thinking about your death and what that means for how you act your life out. In the final chapter I go back to while you’re here on this planet let’s do good and let’s learn and help people. Let’s do the right thing so that by the time your physical death comes you have lived your life well.\n\nAlex Tsakiris: You have a nice quote in there. I forget who it’s from but “Our death really defines our life.” If we didn’t have death looming—the death of our physical body, the question mark of what that annihilation will mean–we would have a whole different conception of our lives. I think until we fully take that in, as you point out, we can’t fully appreciate what we have in this experience, whatever we’re supposed to do with it.\n\nGreg Taylor: When you’re working on a project even, if you have a project that’s open-ended it tends to not get done. It gets shuffled back while you work on other things that are more urgent. So addressing that fact that at some stage your body is going to die means that you should concentrate a lot more in squeezing everything out of every day as you go on rather than getting to your 60s or 70s and realizing you just didn’t achieve what you wanted to in this life on Earth.\n\nAlex Tsakiris: We’re approaching something that you don’t cover a lot in the book and I was wondering why, and that is the spiritual implications for all of this. I mean, they seem to be looming right there but I guess that’s another one of my frustrations with a lot of this research.\n\nTake for example the near-death experience or the deathbed vision experience. People don’t come back from that and say, “Oh my gosh, that’s highly evidential of survival of consciousness.” No. They want to talk about God. They want to talk about the white light. The want to talk about the moral meaning, the moral imperative that that brings to their lives. Do we, in general, shy away too much from the obvious spiritual implications for all this?\n\nGreg Taylor: Oh, I think so. There was a lot of that in the material; it just got edited down for the punch to the general readership. I’m just trying to get across to them all of these things. I think David Fontana wrote a book addressing some of this, what happens in the afterlife and what that might mean for how we live our lives. So that’s covered elsewhere. I would have liked to have covered it.\n\nIn the Conclusion I actually mention it a little bit. It was edited down but I was saying that if near-death experiences had started a religion about the way to live spiritually, it’s not a bad way to live, I think. Basically the near-death experiencers come back and say, “What you should be doing is loving people and learning as much as you can and doing right by other people.”\n\nLike the life review process—quite often you see it’s experienced from other people’s aspects in how you affected them. It addresses that you should be acting well toward other people.\n\nAll these aspects of the near-death experience would make a great spiritual way forward if you wanted to turn it into a religion. But once things become a religion we know they become corrupt.\n\nThe other thing was at the best of times I feel uncomfortable suggesting to others what they should be doing or what they should be thinking. I like to just put the facts across to people. So the spiritual elements, I feel a little bit uncomfortable addressing them because I’m certainly not a spiritual guru or anything like that. So I just wanted to get the facts of these things across and also transmit a little bit about what near-death experiencers are coming back saying. I address a little bit of that in the Conclusion about living your life well.\n\nI understand your frustration there. It’s something I wrestled with a little bit during the writing of it. It just came down to a decision as to what effect I wanted the book to have, really.\n\nAlex Tsakiris: Let me jump over on the other side and say I think you did a great job. I think in terms of winning people over I think this book might have a lot more success than a book that’s highly spiritually oriented. You’re right; that does send people askew a little bit because it bumps up against some very important, cherished beliefs that they have.\n\nSo at the end of the day, I think you probably made the best decision. You just present a ton of hard-hitting, well-documented, carefully researched facts that are hard to get past. I think you leave it up to the reader to come to their own conclusions about what to do with it. So maybe you did the right thing.\n\nGreg Taylor: Well, that was the goal. I think once you add the spiritual elements you’ve got it exactly right. You’re bumping up against people’s own beliefs or their own feelings and you’re going to lose most of the skeptics and scientists straightaway. Then the further you go into the spiritual matters the more you might be bumping up against other people’s religious feelings. I’m glad you think it was the right decision.\n\nAlex Tsakiris: So, Greg, tell us how it’s going with the book. What other events are you doing? What’s going on in general? What can we expect to see coming up on The Daily Grail?\n\nGreg Taylor: The book is just rolling along nicely and getting lots of good reviews. It needs word-of-mouth. It’s an independent publication, all done completely by myself so if people can spread the word about it any way they can or want to interview me, I’m open to that. I appreciate any help in getting word out. At the moment sales are strong and 99% of the feedback has been good. The other 1% is from that portion of the skeptics that we know we’re going to get it from.\n\nWith The Daily Grail, this book has taken a lot of time between the researching and the writing and then the editing down; it’s taken up a lot more time than I expected. Next on The Daily Grail is to basically redesign the site and make it a little bit more friendly for mobile phones and the like. I think it’s looking a bit antiquated at the moment but I’m working on basically no money or time so I do what I can.\n\nAlex Tsakiris: The book is Stop Worrying! There Probably is an Afterlife. Our guest has been Greg Taylor, creator of The Daily Grail. We’ll have links to both of those. Do check it out on Amazon. Nothing but splendid, spectacular reviews. I think you’ll really enjoy the book. I think you’ll find a lot of little nuggets in there that you will be amazed that you didn’t know. It’s certainly a book that you could give to someone else and they could gain a lot out of it if they’re not totally up to speed on this field.\n\nGreg, thanks again. Best of luck with the book and thanks for joining me on Skeptiko.\n\nGreg Taylor: Thanks, Alex. It was a pleasure and thank you for the podcast, too. You do a great job on the podcast and you probably don’t get enough kudos for it. So thank you.", "opengraph": {"locale": "en_US", "type": "article", "title": "Greg Taylor Tells Readers, Don't Worry There Probably is an Afterlife", "description": "Click here for YouTube version Click here for forum discussion Interview with the author of, Don’t Worry!  There Probably is an Afterlife looks at deathbed visions, near-death experiences and other scientific evidence suggesting survival of consciousness. Join Skeptiko host Alex Tsakiris for an interview with Greg Taylor.  During the interview Taylor talks about his research […]", "url": "https://skeptiko.com/232-greg-taylor-there-probably-is-an-afterlife/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2013-12-10T19:41:37+00:00", "article:modified_time": "2017-07-25T20:06:00+00:00", "image": "https://skeptiko.com/wp-content/uploads/2013/12/232-greg-taylor-interview-alex-tsakiris-skeptiko-232-e1424975031284.jpg", "image:width": "680", "image:height": "383", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=xbaMerMmcyo", "https://www.youtube.com/watch?v=xbaMerMmcyo", "http://skeptiko-forum.com/threads/232-greg-taylor-tells-readers-don%E2%80%99t-worry-there-probably-is-an-afterlife.337/", "https://skeptiko.com/wp-content/uploads/2013/12/stop-worrying-afterlife-greg-taylor21.jpg", "http://dailygrail.com/Spirit-World/2013/11/Afterlife-Book-Paperback", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-232-greg-taylor.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-232-greg-taylor.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-232-greg-taylor.mp3", "http://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-232-greg-taylor.mp3"], "authors": ["Alex Tsakiris"], "publish_date": "2013-12-10T19:41:37+00:00"}