{"result_id": "273027", "URL": "https://skeptiko.com/joseph-atwill-why-the-bible-is-pro-roman-464/", "timestamp": "2023-04-25 17:08:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/joseph-atwill-why-the-bible-is-pro-roman-464/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Joseph Atwill, Why the Bible is Pro-Roman |464|", "cleaned_text": "Joseph Atwill’s insights about the relationship between power and religion seem more relevant than ever.\n\nThat’s a clip from Gladiator, and although the movie is fiction, people who really know Roman history, like today’s guest Joseph Atwill, will tell you that the movie is spot on when it comes to the kind of political manipulation, mind control and conspiracy wielding that the Romans had mastered 2000 years ago.\n\nOf course, this movie has another side to it, a very deep interpersonal family and spiritual angle to it, which, as we all know, plays a much greater role in the rough and tumble world of world politics and social engineering. I love this next piece.\n\nToday’s guest on Skeptiko, Joseph Atwill, author of Caesar’s Messiah, has become a real cornerstone in my understanding of how we should approach so many of the deepest, most important questions about religion and spirituality, well, from a Skeptiko perspective at least. At any rate, it was so great to reconnect with Joe and be reminded how especially relevant his work is today.\n\nJoseph Atwill: [00:01:55] Yeah, I actually am quite, intrigued and supportive of your perspective on consciousness because of its political aspect. And, of course, given my background, obviously the first thing I’m looking at is how are our ideas about ourselves manipulated politically? Have we been basically given an idea about our consciousness that is untrue, just so that we can be more easily ruled? And the idea that we are an illusion is, in my mind, a decadent political position. And it’s not even worthwhile discussing in terms of it as spirituality, because you already have this enormous problem, that if you think of yourself as an illusion, if you think of life as something that is absurd or meaningless, then you basically don’t have the right kind of resiliency, in terms of coherent political perspective.\n\nAlex Tsakiris: [00:02:57] Welcome to Skeptiko where we explore controversial science and spirituality with leading researchers, thinkers, and their critics. I’m your host, Alex Tsakiris and I’m going to make the case, because I believe it to be true, that today’s guest is the most important biblical scholar in modern times. And that’s sounds like a lot, but it kind of goes even further than that because the Bible, whether we like it or not, it is so deeply woven into our culture, our legal system, our political system, and our collective psyche, well, all of that makes Joe Atwill kind of a really, really important figure in my opinion. But again, I’m going to make the case in this show, and you can judge for yourself.\n\nNow, Joe has been on the show before. The proposition that he makes is rather simple, at least the way that I understand it. And that is that the Bible is pro Roman and the best, and really the only non-wacky metaphysical explanation for this provable historical fact is that the Bible is part of a political PSYOP.\n\nSo that’s a lot for people to take. I know I’ve covered this topic before, and it immediately really triggers people. So let me interject and clarify a little bit.\n\nThat proposition that I just laid out there, that doesn’t mean, at least to me, that the Bible can’t be transmitting some deeper spiritual truths, that the Bible can’t be the foundation for some wonderful traditions that are somehow transmitted through that truth. And it certainly doesn’t mean that in some way that we don’t totally understand, people are connecting through the Bible with some kind of extended consciousness, spiritual experience that we talk so much about on this show. But what it does mean, at least to me, is that if the Bible does fit this understanding that we have of what a political control mechanism is, what a political PSYOP is, then we really have to deal with that first.\n\nSo Joe is not only an unbelievable authority on all of that stuff, but as we’ll find out and hopefully explore again on this show, he’s really taken where that amazing discovery from gosh, 15 years ago now, since the original publication of Caesar’s Messiah, he’s really taken that in a number of different directions, in terms of what these kind of control mechanisms, if they exist, and these political PSYOPs, if they are running in the background, what they might mean for us, what they might mean for our culture. And I’m sure you’re going to see a lot of tie-ins to everything we’re experiencing right now.\n\nSo Joseph Atwill, fantastic to have you back. It’s always such a great treat for me to have a chance to talk with you. So welcome.\n\nJoseph Atwill: [00:06:19] Thank you for having me Alex, it’s my pleasure.\n\nAlex Tsakiris: [00:06:24] So, I don’t know quite where to begin, but I will say this, here’s where I wanted to begin, because whenever people say, “Hey, Joseph Atwill’s been on the show before, and you can learn about his background, just go back and listen to a prior interview.” Whenever I hear that on another show, I’m like, “Hey man, I ain’t going back and listen to that interview,” or maybe sometimes I will. But what we ought to start with is, give people a sketch of who you are, who you were before you wrote Caesar’s Messiah, who you became after you wrote Caesar’s Messiah, and what you’ve been doing in the last 10 years really, since the main fervor over the whole book happened. Give us that broad sketch of who you are.\n\nJoseph Atwill: [00:07:12] Yeah don’t think anything particularly unusual. I grew up out of the United States for a bit, most of my education was in Japan. My father was not in the military but had a family chemical company. So it was an unusual childhood in the sense that it was isolated. And I think that was kind of where I got into interest in the Bible and also reading in general because basically I went to a Catholic school that, provided me with most of the stimulation that I was able to experience.\n\nSo I just kind of was interested in it as literature and I fell away from the faith for no particular reason. In my teenage I just found other things that were more interesting. I always retained kind of the interest in Jesus.\n\nSo I was in business, some companies sold the companies. I became a reasonably successful investor type person, not great wealth, but self-sufficient. So I was able to pursue academic hobbies, and one of them was basically the Dead Sea Scrolls, which were fascinating to me because two reasons. One, there was a scandal concerning them, in the sense that they hadn’t been released, there were a whole collection of the scrolls that hadn’t been released 30 years after their discovery. And also because they described a messianic cult, but one that was basically xenophobic and militaristic, and this is completely in opposition to the cult of Christ. And so my question was, well how did these two groups get along? In the Gospels they’re not mentioned, this other alternative warrior structure, messianic movement is not mentioned. This seemed odd to me.\n\nAnd so I tried to get a better historical perspective of the Gospels and that led me, as it leads everyone, because there’s only one source of information about this era and this geography, is to Josephus. And I started reading Josephus and just trying to get a better and more informed position about the Gospels and that was when I started recognizing that there was a strange relationship between the Gospels and the history of this military campaign in Judea.\n\nAlex Tsakiris: [00:09:54] Can I interject with a question? Number one, what gave you the confidence that you had, the, I don’t know, intellectual biblical scholarship chops to kind of dive in in that way? 90% of people would have been totally intimidated. That’s question number one. And then number two, as you start having these inklings how did you even have the confidence to kind of pursue such radical ideas?\n\nJoseph Atwill: [00:10:23] Well, I could just see that there was no coherent explanation. I mean, there was sort of like my analysis of Shakespeare. It doesn’t come so much from just a position of no arrogance, in regards to existing scholarship, it’s just that the existing scholarship couldn’t really explain the text. That was the basic format that I was operating under. Because I wasn’t an academic, I didn’t have any connections into academia. I couldn’t care less what they thought, they hadn’t produced anything in the literature that I had read. And I was very well read in Christian scholarship of the well-known names. I was very interested in the historical basis for Christianity and for Jesus.\n\nSo I was well read in this area and nothing was really very satisfying, and to be honest, that was really the, like what is the basis for my making these assertions. It was just the fact that I hadn’t been satisfied with the prior literature and felt I was just curious as to what I could just see, it was just curiosity.\n\nBut it took quite a while, it took several months of analysis to really come to the point where I could see that there was a deliberate pattern. I thought at first that the parallels were simply satire, that they might be a way that Josephus was mocking Roman Christianity. But really, the key insight was simply that I eventually saw that the relationships, these parallels that I was trying to understand, they occurred in the same sequence and that was really revolutionary. And you don’t really need academic competence to recognize a sequence, because it just is a sequence, or it isn’t. And since I could see that they were, all these parallels are occurring in the same order, I could see that that was obviously deliberate.\n\nAnd you get to your idea of it being that the Gospels are PSYOPs. Well, that was when I could see it, because this was clearly, the pattern in the Gospels was obviously relating to the military campaign of the Roman Caesars, the Flavian family.\n\nSo at that point the confusion I had about the historicity of Christianity just fell away. Once you have, as your basic foundation, understanding Christianity that it was Roman literature, then you’ll see that you can read through the Gospels and suddenly they make perfect sense. I mean, all of the mystery about Jesus, all of the kind of puzzle passages, the stuff that the scholars have been arguing about for 2000 years, it all just disappears. I mean, it just becomes very, very straightforward.\n\nAnd at the end of the story you have Jesus predicting this individual’s going to be coming and he’s going to bring all of this destruction. And then all of these events were in fact brought to pass by the Flavian Caesar. Well, at this point you have the identity of the individual that Jesus is predicting. It just becomes self-evident.\n\nSo that’s what happened to me. I really didn’t set out to revolutionize Christianity, I just set out to see if I could have a better explanation for the texts than the literature that I’d been reading\n\nAlex Tsakiris: [00:14:14] So, you know what, the way I always try and explain this to people, because I know my encounter first with Caesar’s Messiah and then through numerous conversations with you, I kind of questioned myself. Could this possibly be true? And you don’t have to go very far to find Joseph Atwill critics. And I think we should explore that, we have in the past, but it’ll probably come up again.\n\nBut just recently I was kind of relistening to and trying to come up to speed on some of your more recent interviews. And I saw a great interview you did with Robert Price, who is a very noted biblical scholar, and someone who interestingly enough was not super charitable about your work at the beginning, a few years back. But without doing a full mea culpa has kind of come around to basically agreeing with the premise of Caesar’s Messiah. Like some of these biblical scholars have, they kind of don’t want to really straight on say, “Yeah, that’s probably the truth, that needs to be the starting point truth with which we look through the lens here.”\n\nBut anyways, I’m kind of digressing, because as I was listening to that, one thing that came out, the thing that always impressed me is the pro Roman aspect. Because you just said the big switch for you was looking at the Bible as Roman literature, or I would take it one step further as a Roman PSYOP, because that’s, I think, the implications of what you’re saying. But just as Roman literature, one of the key pivot points for me was this idea that the Bible is pro Roman.\n\nSo I was listening to you and Bob Price and you were talking about some of the more recent scholarship, in addition to some of the older scholarship, that just, in rather obvious ways where you can kind of point to and say, that’s strangely pro Roma. And given the times, given what we know about Judea, giving we know those struggles that were going on and say, give unto Caesar, what is Caesar’s. Carry his backpack not one mile, two miles. Talk about that a little bit, talk about the pro Roman part of the Bible that if you’re not trained to see it is pretty stunning.\n\nJoseph Atwill: [00:16:38] Well, just to explain the passage you were describing, Jesus says to his disciples, “When asked to carry the pack, go the extra mile,” this is a famous of expression in our vernacular and people don’t understand what it means. What he’s referring to is the requirement in an occupied nation. And remember, at this point, Rome is prison of nations basically, it has conquered all of these areas, and one of the aspects of the colonialization was that a Roman soldier and all Roman soldiers had this power, could ask any individual who was a member of the conquered nation to carry their backpack for one mile. And this was why they had milestones, that’s what the expression means. It refers to the distance that conscripted native would have to carry a Roman backpack. And they were heavy, they weighed like 35, 40 pounds, so it was a big deal. But Jesus said, “No, no, don’t go one mile, go the extra mile.” Today this would be like, don’t just wear your mask inside Costco and Trader Joe’s, but wear it on the street.\n\nAlex Tsakiris: [00:18:09] Or the other way I think of it, it’d be like telling one of those Antifa goons, “Go shine the boots of an investment banker. And I’ll tell you what, don’t just shine one pair of his boots, tell him to go to his closet, shine two pairs of his boots.” Because put it in the context of the conflict, the feelings.\n\nJoseph Atwill: [00:18:33] This was the most violent century in the history of Israel. Rome had conquered it, surreptitiously. They were able to become basically allied with one of the native Kings, the family of Herod, who were the Roman puppets. And then they were able to basically slither into power one inch at a time. And then finally they just were the authority. The Hasmonean kingdom was over and now you had the Herodian era. Herod was the tax collector of Rome.\n\nNow, during this period from like the year 1 through 135 CE, the period during which you had the Ministry of Jesus purportedly, you had just one revolution after another. Rome insisted upon placing images of the Caesars inside the temples. It was the only real requirement of colonialization in terms of religion. The Roman colonialist colonies could have any religion they wanted, Rome couldn’t care less, but they had to permit Caesar worship. The Imperial Cult was a great propaganda tool, and so it was just mandated. Everyone had to have images of Caesar, and Herod basically was carrying out this edict inside the Temple of Jerusalem. The religious Jews saw this, of course, as completely in opposition to their religious fundamentals. And so they rebel, and there was one after another, after another.\n\nAnd these weren’t, a couple hundred people, you have to look at the history closely and see just how catastrophic the rebellions were to the Roman empire. There were three major rebellions and perhaps a dozen minor ones. The famous rebellion of a 66 through 73, where the temple was destroyed, in that period the Jewish revolutionaries were actually able to drive Rome out of their nation and to establish an independent nation state right in the middle of the Roman empire. So this was just an absolute catastrophe for Rome colonial interests, and so this led to the Seven-Year War. But that wasn’t the end of it.\n\nThen in 112, 115, you had another rebellion and this rebellion there’s some historical documentation of, but in general, it’s been swept under the rug, but it was an absolute blood bath. The Jews were able to gain military control over Cyprus, and they genocide the entire gentile population, supposedly a quarter million people. They drove Rome completely out of Egypt for a period of time. And it’s just incredible to think about this. This is Rome’s breadbasket.\n\nSo, Rome was able eventually to get that under control and then the rebellion broke out again in 133 Bar Kokhba. This was the one where you ended up with the diaspora, they just wouldn’t let the Jews even come into Israel because they felt that the geographical aspect of the religion was part of what was fomenting rebellion. But that rebellion, again, it was just catastrophic to the Roman empire.\n\nAlex Tsakiris: [00:22:12] And again, I think that’s something that we can probably relate to more in these times that we’re in, because if you read this history, the way it’s normally presented, what comes through is, yeah, it was a pain for the Romans, but they knew they were going to win. I mean, this is the Roman Empire, this little skirmish isn’t going to really mess things up. But put it in the context of like what we’ve been seeing on TV, you know?\n\nSo the Antifa folks are going to take over Seattle. How does that feel to us? It’s like, wait a minute, they’ve taken over, they blocked it off. They’ve said, “You can’t come in. This is now ours.” We know that isn’t going to last. We know that eventually we’ll put down that rebellion, but it sure is very, disconcerting, uncomfortable. It is a huge problem.\n\nSo I think it’s such an important point that you’re making about these times, and then really to imagine, like whoever was the leader, or the supreme leader of the Antifa group that has now taken over the whole West Coast, for him to come forward and say, “Yeah, shine their shoes, and give them what’s theirs, and here’s how we should…” It doesn’t make any sense. We just wouldn’t trust that, we wouldn’t believe that any more than we believe that Jeffrey Epstein hung himself while guarded by half a dozen prisoners or half a dozen prison guards.\n\nJoseph Atwill: [00:23:37] Well, that’s the thing. We have, what we believe is a history, and to the extent we believe it as history, as things that actually occurred, we are basically being manipulated. As you know, my position is we really can’t trust any history at this point. They were able to manipulate us with the history of Jesus Christ, the history of so-called, the author Shakespeare, and I think really what we have as history we need to be skeptical about. I need to have different ways of understanding it, than just what they tell us, because really we’re run, controlled by…\n\nYou know you mentioned the term psychological operation. Well, whoever is doing that has to remain secret. It doesn’t work if everyone knows that this is basically just a psychological operation to influence us. So they have to be secret. We have to give them trust, which means that you’re dealing with people that I call lifetime actors. They’re not real. The personality that you’re seeing is artificially created just to manipulate us. The history they’re giving us is basically just there to create influence in our minds. And this isn’t very theoretical at this point. I think if you look at the whole COVID phenomena and how we responded to it, how the government’s responded, I think this is obviously very well organized. It’s very artificial, the response. And it’s taking us to a place that we are not being told about. In my opinion they’re going to, basically wreck the economy. This is done to create poverty and from there they’re able to implement a much more locked down kind of slave state.\n\nAlex Tsakiris: [00:25:47] I do hear what you’re saying about the COVID thing. I’m reluctant to go there. I want some more time to pass. I think sometimes looking at these major, major what that would be, a major cultural operation, cultural PSYOP is best examined through a longer lens. One such example that I think really brings light to this is the work that you’ve done on Gloria Steinem and it’s something else that I bring up quite frequently on this show, because I think it really highlights how our modern history is being manipulated, spun in different ways, and how these lifetime actors, as you described it, are really shaping the thing. Particularly because Gloria Steinem is in the news and there’s these new Netflix streaming specials on it. She’s never really come clean about all the facts, the facts that we could look up and we’ll talk about on this show.\n\nSo I guess we could go to Gloria Steinem next, or I’m almost tempted to put off Gloria Steinem because again, one of my frustrations or one of my needs in this work, this book I’m working on, Why Evil Matters, is to really flush out the Christian perspective, because I don’t think Christians, well-meaning honest, respectable Christians understand the extent to which they’re complicit, in a lot of this stuff that’s going on. And I’d say particularly complicit in our understanding and inability to deal with evil. And the way I think they are complicit relates directly to what we’re just talking about. Because I think if you’re not willing to thoroughly dive in and say, “Oh my gosh, is he right? Could he possibly right? Is what really drove the formation of this religion/cult slash, was it really a political PSYOP? Like all these other political PSYOPS I know about, was it really about controlling people? Was it really about, hey, this might just be a better way to get a handle on these Jews that are driving us nuts over there, could that possibly be true?” And that’s what I think is so, so important. About what you’re talking about here, beyond the kind of atheists conspiratorial, “Oh, screw those Christians, they don’t know what’s going on. There is no God.” I’m not totally putting that down. I don’t think that’s the place to go. I’m just saying from my point of view, and Why Evil Matter, I don’t think Christians understand how they have become complicit because they don’t understand the PSYOP. Do you have any thoughts on that?\n\nJoseph Atwill: [00:28:50] Just that it’s true. If you don’t understand kind of the origin of the cult, and I think that’s the correct phrase, that you’re involved with, and you don’t understand the purpose for the rulers, basically you cannot avoid being complicit in evil because it starts out with secrecy. I mean, you don’t need secrecy if there is not evil afoot.\n\nSo, since Christianity is ruled through secrecy and comes from secrecy, then there are purposes for it, which had to be kept secret. So you are complicit, and you really should, I think, if you’re honest with yourself, try to see if there is some way of understanding the origin of religion.\n\nAlex Tsakiris: [00:29:49] See because the thing, I guess I hammer on this from a couple angles and people don’t like either one, but we’ll try it again. If someone was to really do a deep dive into the Christian pedo thing and the Pedo Pope thing, and they were to come out on the other side and say, “Wow, overwhelming evidence that at the highest level, that institution has been compromised to the extent that the burden of proof is on them to show that there isn’t systematic abuse of children going on from highest down to the lowest levels of that organization.” If someone was to come to that conclusion, which I think a reasonable person could, then what do you do on Sunday, when you go in the Catholic Church and they pass the plate around? Well, you do what you’ve always done, is you throw a few bucks in there, or you throw in your little envelope that says I gave at the office or whatever it is. But now your complicity really becomes clear. You’ve put money in the plate, and you know now where some of that money is going, and that kind of hits us at another level,. But that is still, that’s not the conversation we’re having, the conversation we’re having even among Christians who are struggling with the religion, is more along the lines of kind of the apologetics. Which is how they’ll come at your work and say, “Well what about this?” And they’ll quote this scripture, this scholar.\n\nAnd again, I just want to emphasize that to me they’ve kind of missed the point. I mean, the first point is all that is important and can be hashed out, and what this guy said when, and who wrote this back then, and this verse contradicts with. All that is secondary to the basic premise that it’s Roman literature. It’s pro Roman. It doesn’t make any sense at the highest level that this document, this writing would come out and would wind up being pro Roman. Deal with that first.\n\nJoseph Atwill: [00:31:56] Well, particularly now that this relationship, this deliberate relationship, which incidentally was created to be understood. Now that that’s sort of in existence, people really should actually take a pass out and just see what they can make of it. The quality of the evidence in Caesar’s Messiah is completely different than other sort of historical kinds of attempts to understand Christianity because what it does is it just takes two texts and lays them side by side. And then just says, look, here are these relationships which any normal person can see are completely linked. It’s the exact same event, that Jesus is simply predicting something that comes about.\n\nNow, the overall sequence of the entire ministry, the Adult Ministry of Jesus is made up of these linked events basically, and therefore it’s deliberate. And once that is understood, then there’s really no way to explain it other than the fact that this was produced by Rome and that Rome had a purpose.\n\nEverything is self-evident from that point on Alex. I mean, you don’t really need to do kind of complicated analysis to understand why Christianity was produced by Rome. They wanted another version of Judaism they wanted, they wanted something that was pro Roman.\n\nAlex Tsakiris: [00:33:30] You’ve done this a hundred times Joe, but just kind of quickly go over some of those parallels, some of those sequences, and then most importantly highlight what Josephus… So the end play here, let me recap if I can for people. Josephus, if you don’t know, if you haven’t kind of done the deep dive already, which I never knew who Josephus was before I talked to you, but he is this, sometimes characterized as a Roman historian, but who he really is, is a Jewish, well, he was a Jewish rabbi. He was also a Jewish general and he was the first boots on the ground guy in Galilee when the Romans came in to do their march and they’re taking over of Judea and he said, “Hey guys…” And through some strange, very shady unbelievable set of circumstances came to ally himself with the Romans.\n\nAnd most importantly, what you always point out is that in this process he had this spiritually revelatory experience. And this is his claim from this Jewish rabbi, that everything he understood about Judaism was wrong, and that what the Messiah was really all about what the Second Coming was really all about, was Roman Caesar, and that therefore… I mean, this was so transparent at this point. Therefore, this is why we should be pro Roman because this is what has been prophesized all along.\n\nSo I’m sorry. I went on and on there. Lay out some of those parallels and then add anything you can to the big picture story here.\n\nJoseph Atwill: [00:35:22] Yeah, it depends how you would want to characterize it, but there might be as many as 70 events which are linked, from between the Adult Ministry of Jesus that is characterized in the Gospels and the history of the war that Josephus recorded. Some of the parallels are actually quite complicated and most of the critics of Caesar’s Messiah would go to the most complex and then say, “Look, it’s a hallucination by Atwill, this is parallelomania. But the fact is you can simply, basically look at events which are not complicated, which in fact are in many cases, simply the historical events and see that the story of Jesus was made up of events from the war. His Adult Ministry starts at the Sea of Galilee, where he tells his disciples that if they follow him they will fish men. This is the same location where Titus Flavius begins his military campaign at the Sea of Galilee. And he sinks the Jewish fishing fleet, and then they fish for the Jews with their Spears. The locations of the two stories are the same and occur in the same sequence.\n\nSo, Jesus, after the Galilean Ministry goes onto Jerusalem, Titus does the same. You have, like a series of historical events. Basically, Jerusalem is encircled with a wall, you have the abomination of desolation. and then you have the temple being raised. I mean, these events are known to be basically from the Jewish war. These are prophecies in the Gospels but are historical events in Jesus.\n\nYou have the amazing three crucified, one survives taken down by Joseph of Arimathea parallel, which came out in Caesar’s Messiah even though it’s just so incredibly obvious that the two stories are the same. Why it had never become part of modern scholarship is just beyond me.\n\nThere was one other scholar, Cliff Carrington, an Australian autodidact who had also noticed it, but he hadn’t published it. So we were unaware of one another’s work.\n\nAlex Tsakiris: [00:37:59] And we should just add there, so we don’t get Bible geeky too quick. Big picture, these writings of Josephus, who really, you kind of even pierced through that paper-thin idea of Josephus and suggest, let’s just say this is the Roman court historians, it’s their version. But what’s really important is among biblical scholars, if you really push them, they won’t even disagree with the idea that the Gospels, as they say are “dependent” on Josephus. Which means, it’s kind of this flowery way of kind of softly admitting that Josephus was used to write the Gospels. That should be game over. And it’s kind of interesting to me that that isn’t game over, but that is also, taking this in a slightly different direction, but it’s one I always wanted you to comment on.\n\nSo Caesar’s Messiah is not going to change the world, and even when I talked to you five, seven years ago, I think the first time I talked to you, I guess I always had in the back of my mind that as more people understand this, this is really going to make a huge difference. And I have to say with all respect, it hasn’t, and it’s almost more interesting in the reasons that it hasn’t. Because in a way, the reasons it hasn’t, kind of supports your case even further.\n\nBecause the reason it hasn’t is number one, the organization you’re against is a cult, and cults don’t go down like that, they don’t go down with logical rational information. in culture, go down like that. And the second reason is that you’re exposing a political PSYOP, so by definition the hidden controllers behind this are quite satisfied with the narrative the way that it is. So we wouldn’t expect it to change just because somebody says, “Hey, isn’t this obvious? This is what’s really going on.” Any thoughts on that?\n\nJoseph Atwill: [00:40:15] Well, I mean, basically you described it very well. There are Christian scholars who in private will accept that my analysis and will even mention to me that it seems coherent but will attack me publicly and defend Christianity based on a historical Jesus. Everything can be nuanced or diced to a point where you have doubt, and if there’s any doubt whatsoever, then they can just put that forward, showing that we don’t need to pay attention to this kind of analysis.\n\nWhen I brought Caesar’s Messiah out I was curious as to how it was all going to play out. I really wasn’t looking forward to some enormous cultural upheaval, I thought that would not be fun for me personally. So I was a little concerned about it. The book is only promoted through word of mouth. I have no attempts whatsoever to promote it. And it has sold over 100,000 copies, which in terms of New Testament scholarship makes it basically a kind of bestseller.\n\nThere’s a documentary which now has a YouTube watched count of over 4 million. So it has slowly worked itself into consciousness of the kind of collective cultural consciousness. But I wouldn’t be surprised if it were just like under a natural process of like 50 years for it to really have, sort of an upheaval aspect to it. But people who read the analysis, spread the word to other people.\n\nAnd like you say, a really good example of the power of how obvious the analysis is, would be, Dr. Price, the Bible Geek, who’s one of the very best known and probably the very best New Testament scholars in the world. And when the book came out he did a very negative review, which I still suffer from in which he accused me of parallelomania. He said this is clever but basically it’s a hallucination. But being a very honest person, when he began to have doubts, he went back and did more analysis. And then you saw the recent video that we did where he now is basically accepting the premise of Caesar’s Messiah, which is that the son of man that Jesus predicts is in fact, the Flavian Caesar. So the conclusion of Caesar’s Messiah is now something that he is promoting as just routine New Testament scholarship.\n\nSo there has been a change, and how long it will take, I have no idea. There are such great and kind of momentous upheavals going on in our world right now, I think under those conditions, Christianity is something people cling to harder than they would otherwise, they’re not open.\n\nAlex Tsakiris: [00:43:43] But people who have an atheistic lens, and I’m not saying you do, I’m not saying you don’t, but I know that a lot of the people who follow you have that lens, they become like Christian apologist. They’re sorting through the data, trying to spin it in the way that they want. But this idea that there’s some movement away from the cult of Christianity, or there’s a movement away from spirituality, I mean, to what? The problem is there is no place to go. Atheism is philosophically completely bankrupt, and it’s because that scientifically it never made any sense from the beginning. From the time, a hundred years ago, and we did the double slit experiment, the observer effect is the philosophical hurdle that atheism can’t jump over. We are a part of the process. We are more than this biological robot in a meaningless universe. So there’s a dead end there and anyone who pursues it down that, what’s traditionally been called the mythicist, what is really the atheist perspective, they’re never going to make any headway, in my opinion.\n\nJoseph Atwill: [00:44:54] Well, headway will be very difficult to make because, even in like the experiments that you mentioned, it’s so difficult to really make progress from there. In our world, God, if he exists, does not make himself known in a clear way. And so there’s always room for doubt. We are just existentially precarious. I mean, what is a human to make of his experience and his or herself? Believing in God, makes coherent a lot of the unexplainable physical phenomena.\n\nAlex Tsakiris: [00:45:37] See, but even when you cast things as believing in God, that is a very narrow kind of, again, it’s the apologist version of atheism. Right? Let’s talk about God because no one can define God and we immediately understand that that’s a term that’s going to trigger people.\n\nI go back to consciousness and you realize that the scientific position of the atheists is that consciousness is an illusion. So Neil deGrasse, Tyson, one of the most popular out there figures in science, that’s his position. That is an absurd idea. I keep quoting to all the people that come on and they go, “That is absolutely absurd. No one in time has ever believed that, no culture has ever believed that. We’ve falsified it scientifically over and over again. Why is that meme perpetuated when it doesn’t make any sense? If only one thing, you know that you are conscious.” I don’t know if you’re conscious, I don’t know if you’re a robot, but I know that I’m conscious and I’m having this experience. So that’s philosophical.\n\nBut then, like I say, if you go to the quantum physics and you start doing the double slit experiment, consciousness is fundamental, that’s what everyone’s saying. That’s what Niels Bohr is saying, that’s what Schrodinger is saying, that’s what everyone’s saying. Right? That’s the conclusion for that, never been falsified.\n\nSo the whole logic life chick in science and philosophy behind the atheist position is ridiculous. And the only way it’s propped up, I mean, this is the parallel to your work. It’s propped up by another conspiracy. So driving people over to your religious cult is a nice way to control them because then, as long as you can control the dogma of the cult, you have a certain degree of control over people. Well pushing people towards this other scientism, a cult, and convincing them that their biological robots in a meaningless universe and they should be afraid, and they should be afraid of dying of course, but they should also be afraid of everything because they have no control over anything. Well, that’s another very effective means.\n\nSo, you have these two forces that are perfectly synchronized in terms of what they do to the population and make them just go, “Hell, I don’t know, but I’m certainly not going to think very deeply about things.”\n\nJoseph Atwill: [00:48:12] Yeah, I actually am quite intrigued and supportive of your perspective on consciousness because of its political aspect. I mean, I don’t think atheism is disprovable to any more extent than God is provable. And I’m not sure that these are actually the most important questions, which is to me, what is the correct understanding of ourselves in spirit, you know? And, and of course, given my background, obviously the first thing I’m looking at is how is our ideas about ourselves manipulated politically? Have we been basically given an idea about our consciousness that is untrue, just so that we can be more easily ruled? And the idea that we are an illusion is in my mind a decadent political position. And it’s not even worthwhile discussing in terms of it as spirituality because you already have this enormous problem, that if you think of yourself as an illusion, if you think of life as something that is absurd are meaningless, then you basically don’t have the right kind of resiliency in terms of coherent political perspective, you see.\n\nSo, I think that one of the ways that you can tell if your perspective on spirituality is valid, is if it is producing a more powerful position for you politically. This to me is a better, more reasonable guide path approach than even considering, like the ideas of like the French existentialists or the modern, quantum theorist look about consciousness.\n\nThis is structurally nonsensical because the first thing we want to do about our understanding of our spirit is arrange it into the world with ourselves, and we don’t want to accept ideas about ourselves, which make us impotent. This is not the purpose of the original analysis, it’s not why we were having these questions. We have the questions about spirit because we want to improve ourselves, we want to improve our lives.\n\nAnd so you have to have some, basically resistance to even enter into these kinds of discussions because not only are they nonsensical, and of course you’re always dealing with something which is unprovable, but they’re just decadent politically.\n\nI really like your approach on evil and why its existence is important. I mean, this is such a great path for people to walk down because what it does, I mean, you’re never going to get people, who are devout Christians, to give up their faith. You’re never going to change that kind of fundamental position. But what you can do is set a person up to have the right kind of skepticism, which is why I even like the title of your show. Because that’s really what we’re looking for is just individuals who are more skeptical, who are more facile intellectually, who cannot be enslaved through ideas.\n\nThis is really, in my mind, what is important about Caesar’s Messiah, is that it shows that look, we were enslaved, we were intellectually enslaved, we were enslaved by propaganda. And the critical point is we didn’t know we were enslaved. We didn’t understand it. And how important is that today with our current position, right? When our constitution is being thrown away. This perspective, the perspective that you’re offering in your show, it’s more important to me politically than sort of analytically, because I don’t really care whether or not someone comes up to the position that there is life after death. What I want is for them to have a spirituality that is something that is beneficial to that individual. And it isn’t going to happen through one of these PSYOP religions are through these PSYOP media programs. To me things like CNN and Fox News are just other aspects of Christian propaganda basically, they’re just the oligarchs using clever manipulative techniques to get people into the position of accepting slavery without knowing it. Promote spirituality that promotes skepticism.\n\nAlex Tsakiris: [00:53:04] That’s awesome, and it might serve as a really, really nice segue into Gloria Steinem thing, I think.\n\nSo, some of the work that you’ve done on that, and not just with the facts, but the way that you’ve connected it and tied it together, particularly tied it together with the left, the progressive movement, which again, is part of this atheistic side of things.\n\nAnd again, folks, I’m not a Christian, I’m not a religious person, so I don’t have that problem with the atheist. I just see it as a mirror image of the control mechanism. I love your term, the lifetime player.\n\nSo hit people up with the stuff they don’t know about Gloria Steinem and how that fits so perfectly with just another example, another play, a major play in the playbook of the control mechanism, the divide and rule theme.\n\nJoseph Atwill: [00:54:10] Right. Steinem is an example of an individual that was selected and trained by the ruling class. She was selected in college. There was a scholarship which she was the only one that ever basically received, and this…\n\nJoseph Atwill: [00:54:42] It was the Chester Bowles scholarship, which then enabled her to travel to India. Basically Chester Bowles, you can look back and see that he was in contact with Allen Dulles, these letters are in existence. And he was telling Dulles that they needed to send agents for the purpose of social… basically for a kind of promotion of the culture of the West, in areas where communism was emerging as a kind of counterbalance. And he mentioned India.\n\nSo then his scholarship was given to Steinem and she traveled to India with this money. Her activity there, she claimed to have written a book. What is known is that from there she went into Europe where this part of our career is outed basically as a CIA agent. This was what was exposed by the Redstockings, which were a group of feminists that were aghast that Gloria Steinem had taken over their movement basically, and that she was getting all this publicity.\n\nSo this organization, the Redstockings did research into her activity in Europe, and they found that she was basically an agent provocateur sent in to break up youth festivals which were promoting, socialism, and they had been seen as something that could lead to, like a lack of favor on the population towards capitalism in the West.\n\nAlex Tsakiris: [00:56:25] So, classic infiltration, co-opting kind of thing, right? They get this attractive young woman. “You’re the perfect person to go to these student festivals, get in with the people, find out who’s who.” That’s the initial play. And then the next play is, maybe to try and misinform, disinformation thing, like 90% of what you’re saying is right, 10% of what you’re saying is wrong.\n\nWhat I like what comes out of that, part of the documentation we have for it, I love where we have actually the memo from her boss at the time, a CIA guy, and he says, “Wow, Ms Steinem, she is a whiz kid. She’s the best we have at this.” And folks, this is completely unrelated to the feminist thing. This is just a CIA agent who is really good at doing what she’s doing. And whether you call her a CIA agent or whether you call her a lifetime player that’s connected with the CIA with some loose ties. Maybe you can even explore that. How do you think that works? Because a lot of people would go, “Show me your pay stub for the CIA.”\n\nJoseph Atwill: [00:57:38] Oh, no, she was actually an employed agent and admitted such. If anyone’s curious about this, after she was outed by the Redstockings, and even this is like a very interesting and revealing story. They did the analysis, she found out about it and brought suit against the publishing company that was going to bring it out as a book. She’s prevented it from actually being published. It was only brought to the public because a student newspaper, a student housing newspaper at Columbia University brought out the analysis, because individuals there knew the feminist and the Redstockings organization, and they brought it up because they felt this was first amendment. So they brought out this analysis and evidence showing that Steinem was a CIA agent.\n\nSo Steinem was caught, and she then had the famous press conference where she said, “Yeah, I was an agent. I was a CIA, but the CIA was a good liberal organization, and I felt that I was really helping liberalism.” In other words, she never broke stride from her image as a progressive left intellectual.\n\nAlex Tsakiris: [00:58:54] And it’s more than she never broke stride in my opinion, because I think the craftiness with which she re-spun the story after she was exposed, is so telling, it’s almost like a another play out of the playbook. It’s taking stuff that’s true, but then, giving it another twist. But it’s also at the same time denying, like when she says, “Yes, I actually found that the CIA was,” you said, “a great help in advancing progressive values towards the liberation of women.” And everyone’s like, “Wow, yeah, I guess, maybe so.”\n\nWell, what about the student festivals? All that is erased out of the story in order to keep this narrative going.\n\nJoseph Atwill: [00:59:46] Well moreover, she was on the board of directors of an organization that, at the time of… So she was talking about my history as a CIA agent in the past, but then, as it then came out, she was still a member of this organization that was receiving CIA money at the very time that she was having the press conference.\n\nAnd then if you look at the funding of Ms Magazine, this is actually hilarious because the individual Clay Felker, who arranged for the funding, he was one of the CIA agents she was working with in Europe. So, I mean, it’s just preposterous that she could even make the case with a straight face that she was no longer a CIA agent.\n\nBut you see, here it becomes grim because now you’re looking at Ms Magazine as something that is actually being brought into existence by the CIA. And so now you have the question of why are they mucking around in our culture? Why are they putting in such an extreme version of feminism?\n\nThere’s a great interview with, Kathie Sarachild who was a member of the Redstockings and she talks about how Steinem was given publicity that they, the actual legitimate feminists could never get. And she talks about Steinem’s extreme anti-family and anti-male position as really not being something that the original feminists were promoting, which they were mainly an economic focused organization. They were looking for equal pay for equal work. This whole idea about destroying the family was not really part of their agenda. Why was Steinem suddenly given all the publicity?\n\nAnd so now you get into basically the counterculture and you can see that Steinem, you can easily place her in the context of an overall psychological operation against our culture to produce a debased population that has less family production, has more single moms, has more, what I would call, pornographic males. Because you have to remember Alex, every time that an organization is divided, like an ethnicity is broken into families, the families are then broken into individual sexes. And now, of course, even the sexes are being divided, with the transsexual movements.\n\nEvery time that is done the individual that is produced by the process is less politically powerful.\n\nAlex Tsakiris: [01:02:36] Gee, that sounds Roman. Divide and rule. That Latin translation is often mistranslated. It’s not divide and conquer, it’s divide and rule. And this is exactly what they did, right? They’d go in, they’d invade a territory and then they’d go to the one tribal leader and say, “Hey, I just talked to that other guy over there. What a jerk huh?” And he goes, “Well, yeah, we’ve had some problems with him in the past.” “Yeah, I know. I’ll tell you what, we’ll protect you from that guy, we’ll put up a little barrier here, because you really need that don’t you?” I mean, that’s exactly what they did. Just read Roman history.\n\nJoseph Atwill: [01:03:19] Exactly. Look, there’s only so many ways that it is possible to manipulate humans. I mean, there are probably an infinite number of variations, but the broad structure is always the same. You need to have trust. So you need to have an individual who is given trust and then that trust is used to give false narratives to fake history. That’s it.\n\nSo Steinem is created as a defender and a heroine of the feminist cause, so that’s the lens that women look at her through. They don’t look past that image. They don’t look to her CIA background. They don’t question the idea of was this deliberate, because to do so you see how clever the propaganda is, to do so would make them have that moment of self-criticism.\n\nAnd it’s fascinating to me, you mentioned it earlier in the show about how hard it is for Christians to do this. Well, think about someone who’s grown up as a feminist, how difficult that process, the same process would be for that individual because to look at Steinem, realistically is the same thing as for a Christian to look at Jesus realistically. It’s almost impossible to do because your mind has been structured away from the process that would permit that to happen.\n\nAlex Tsakiris: [01:04:39] Hey, just one more Steinem story that I always like to slip in, in case there’s any lingering doubts on the part of people. And then I want to ask you kind of the big devil’s advocate question on all of this stuff. But the other story I wanted you to get to, and I love this, in this kind of sad, tragic humor, dark humor kind of way, is the 2012 Syrian Women’s Liberation, ploy, scam that she pulled. Do you have the details on that, or shall I pull it up?\n\nJoseph Atwill: [01:05:13] I have actually, the last couple of years kind of gotten away from Steinem. She’s included in my new book, but that chapter was long since written and I really try to make the story of her emergence as a political person, as a famous person. That’s really kind of the part I’m interested in. What happened in Syria?\n\nAlex Tsakiris: [01:05:36] Let me, let me pull it up.\n\nJoseph Atwill: [01:05:38] Yeah. I’d like to hear about this actually.\n\nAlex Tsakiris: [01:05:40] Yeah, this is a classic Joe, just a classic. So in 2012, so if you remember back, this was kind of in the middle of the whole Syrian thing, which if people don’t understand it, Syria was backed by the Russians. We were trying to overthrow Syria through ISIS. And again, if people are uncomfortable with that, you have to just understand that we were really the funding agency, the creation of ISIS from the beginning. And ISIS remember are the ones who put burkas on the women, cut off the arms if a woman was found outside and had any skin exposing. That’s ISIS, right?\n\nMeanwhile Syria is, by all accounts, the most secular, the most progressive politically state among the Arab States in that area.\n\nSo Gloria Steinem, and again, your point of lifetime player, right? So you think, oh yeah, she’s just this old feminist from the 70s. This is 2012. Her group, Women Under Siege project comes out and denounces Syria as not supporting the rights of women in Syria. Violence against women in Syria. And again, this is when Syria is battling ISIS. But what was the CIA’s position at the time? Of course, the CIA’s position was overthrow Syria.\n\nSo I mean, crazy. So here’s the kind of wacky devil’s advocate position that I want you to try and sort out.\n\nAt the end of the day a lot of these conflicts are, I don’t know, comparable to war. I mean, they really are, we always do. And in war you know you have to do certain things in order to get the job done. You’ve got to sacrifice the men on this hill, and you know they’re going to die, so you can send the guys around the other side of the hill and knock them out that way. But you know these guys are going to die.\n\nCould one make the case that in certain instances our grand overlord controllers are just doing the dirty work that we’re not willing to do? So the Gloria Steinem project, as evil as it was in its implementation, as underhanded as a secret society, PSYOPy, was serving the purpose of advancing the rights of women in a way that we were unable to do, because really, why did women not have the vote until 1920? And why hadn’t women move forward more in terms of equality at the time that Steinem was doing that?\n\nSo are they sometimes moving the ball in the right direction? World War II, are they allowing the Japanese to bomb Pearl Harbor while we send the fleet of aircraft carriers out because the number of people who were behind getting in World War II was super low, and as soon as they bombed Pearl Harbor, everyone went and enlisted?\n\nJoseph Atwill: [01:09:22] I would say, if you have to use secrecy, there was something wrong with your position, just from a basic human moral structure. I mean, I think there is nothing that would be uniquely and totally evil. I mean, you look at the Gospels, at the beginning of the show, you were talking about all of the good things that are possible to gleam from it.\n\nTo make an, an operation, widely held, widely supported, you have to have in part of what you present to the public something that they find is beneficial. It has to be part and parcel of it. But that simply creates the hooks for the control, which is hidden, and the public is then taken into a place that they would not have gone otherwise.\n\nIt goes to basically democracy. If this is a system that is reasonable, then you have to resist propaganda and whether or not from time to time it takes you to a better place than the public would have gone if they were left to their own devices, that, in my mind, is a very small price to pay for structures like World War II or World War I, or the Civil War, or things that I would regard part of this list, for example, like the Great Depression, that I think are brought about through the financial techniques that are deliberate.\n\nSo I would say that there isn’t total perfection and democracy and total evil and propaganda, but I would just vote for democracy because I would think that it ultimately will reflect the interests of more people than if you just let the oligarchs run things.\n\nAnd I would also say that the problem with permitting the oligarchs to run things is that you’re risking something that democracy would not permit, which is a genocide. I think genocide is one of our major problems as a species, and particularly today I would say it’s something we should be considering as something we should be attempting to avoid.\n\nSo I would just point out that open democracy, disclosure is more likely to resist genocide than a few brilliant people at the hot tub of Jeffrey Epstein’s Island sitting around planning what the future could be for mankind. Just given both the results and the natures of the process, I would go for democracy every single time.\n\nAlex Tsakiris: [01:12:24] Nice. Nice. Nice. Nice. Yeah, it’s tough. Okay, I have to push that a little bit further, because I’m all over that on one hand, on the other hand, there’s an idealism there that doesn’t totally square with history.\n\nI’ll just leave it at that. I mean, in a way you are such a spiritual guy, you have this kind of spiritual idealism because anyone who would look at history would say, “Nice, Joe, but we know that don’t work.”\n\nJoseph Atwill: [01:13:08] Yeah. Well, I would agree with them. Unfortunately, it’s a completely muddled process, and both extremes, a total democracy and total dictatorship will have good moments and bad moments. The way to really increase the quality of democracy, because obviously democracy has this problem in that it makes stupid decisions, is to have individuals inside democracy that are basically more skeptical, have more analytic power. And this is why, as you know, I’m such a big fan of your show, because I think it helps promote that. I mean, that’s really where righteousness is, in my opinion. If you want democracy to be more powerful, you need to have more skeptical and more analytically powerful humans.\n\nSo the recovery process from Christianity, and even from things like existentialism from atheism, recovering from those, what I would regard as oligarchic structures for the purpose of a mind control, is a long, hard one, and we need lots and lots of people like yourself trying to move people to a more objective, more and more realistic, more sensory-based, a more analytic based perspective. It is a hard task, if you look at the media, how powerful it is and who owns it, and how easy it is to manipulate people. But there is hope because the independent media…\n\nAlex Tsakiris: [01:14:58] There is no hope. That’s what I want to kind of throw out there. And I want to kind of pursue this a little bit further with you. No, there is no hope and that is really what spirituality is about. It’s the other aspect of the Christian Bible, that we never talked about this back, because I didn’t want to kind of cloud the discussion.\n\nBut the real conflict within Christianity is people want to understand how they can reconcile their spiritual truth that they feel is connected to the Bible, with the absurdity of the Bible. And I just played a clip, I had an interview a couple of times ago with this guy, he’s produced this really great science film that kind of supports this idea that the idea that consciousness is not fundamental, just isn’t supported by the science. But then what he tries to do is sneak in Catholicism, you know? And it’s like, “Yeah, and the guy who discovered it, he was a Catholic and he turned Catholic and dah, dah, dah.”\n\nSo I really kind of called him on that and I called him on that by pointing out, Oxford religious scholar, Richard Smoley, and I played a quote, where Smoley says, “It’s ridiculous. No thinking person could accept the Adam and Eve story. That God got so mad because this guy ate a piece of fruit that he condemned…” He goes, “It is a preposterous kind of idea, dah, dah, dah, dah.”\n\nBut see, that is completely on a different track than where you are with Caesar’s Messiah, right? It’s back to people struggling with this other question, which is how can I reconcile these spiritual truths? One of which is, this material world isn’t all there is, so I can let go, at least a little bit of it. I don’t have to be totally consumed with whether we’re going to wind up with a social credit Chinese style communist state, or whether we’re going to wind up with a fascist, whatever that means, controlled kind of state. I can let go of that a little bit because in this larger extended consciousness realm, that all has a different place than it does in purely a materialistic way.\n\nSo I have spiritual people on one hand struggling with that, struggling with this truth that they know and feel, but can’t reconcile with the cult that they’ve found themselves in. And then on the other hand, I have where you’re coming from, which is to say, hey, the only way out of the PSYOP is to just be super truthful and honest and all that.\n\nAnd I mean, for me, like were in business, I was in business, that isn’t going to happen man. I mean, money’s going to drive this stuff, it isn’t going to be the alt media. You think any of those guys are the least bit worried about the alt media? Look at the game they’ve played already with this thing, like we were talking at the beginning off air. If they can be this successful with this and they haven’t even played half of their cards, I just don’t see why they would really have any worry about their ability to manipulate the system.\n\nSo you get a sense of where I’m going with all of that. It’s like, unless you get bigger, unless you get outside of the game completely, there’s no reason to be hopeful.\n\nJoseph Atwill: [01:18:48] Oh, that’s well said, but it’s such a complicated kind of position. I’m not sure actually that there is this kind of a mutual exclusivity. I think that leaving a cult can be a path to much more intense spirituality.\n\nJoseph Atwill: [01:19:12] So it has to do with the nature of the cult, the nature of the influence of the cult on the person’s consciousness and how he perceives himself.\n\nAs far as the oligarchs not being worried, I would disagree with that. I think that actually one of the reasons that we’re having so much oligarchic activity at the moment is because the independent media was actually starting to cut its… If you look at, for example, like the vaccine statistics, very interesting. I was sent some data showing that over 60% of the people now will refuse a mandatory vaccine. If this is true, this is really a revolution. I mean, that’s really an aspect of the influence of the independent media.\n\nAnd then, if you go back in our history, where did the common person have access to information before? I mean, really there hasn’t ever been a moment. I mean, history, in my opinion, is all propaganda. So when you had the existence of the independent media, when it came into existence with Gary Webb really, and his investigations into the CIA’s selling of crack cocaine, and he decided that he would use this new internet tool to post his data because he couldn’t get the newspaper he was working with to do it. Well, suddenly there was this tool that people could use to exchange information.\n\nNow it’s obvious it can be manipulated. But nevertheless, there is a chance, and I think this is the very first time we’ve ever had, in our entire history, the word history here is well used, where we can exchange information. And to date we’ve been completely under intellectual control.\n\nAnd so, as far as what power can eventually produce, I have no idea. I don’t know how much time it’s going to have to have influence. But while it does exist, we can use it. I mean, just for an example, your show. 50 years ago, wouldn’t have been physically, let alone culturally possible for you to have such a platform.\n\nSo it is interesting. There is hope. And I think people should be governed by their spirit. They should look at what process and what activity gives them energy? What gives them, basically a more intense, more vivid spirit. And so when people, when they take the case that they’ve been black billed, that they know the truth, they know the oligarchs, they know propaganda, and it’s just left them impotent. And I always respond by saying, look, you have that feeling because you’re not fighting. If you would have access to your normal energy that any sentient being, any being that comes through the process of evolution, to whatever you believe in that, you’re going to fight back, then you’ll feel better. You want to find those things in life, activities that will fill you with energy. And you know you’re on the right path when you’re leaving the cult behind and moving into a world of more intense energy.\n\nSo I’m actually optimistic. I wouldn’t be a bit surprised if there will be revelations that will be more powerful because of the current oligarchic maneuvers, to increase the technologic observation and slave state conditions. I think people will be more ready, for the fruits of the independent media. And they will, they’ll have a more clear mind.\n\nI want to apologize for my voice. Like I was saying, I’ve had a throat problem for about two weeks now and it left me like a frog. I’m sorry for that.\n\nAlex Tsakiris: [01:23:35] No, it’s awesome. And where else would we expect to find a message of hope than from the guy who wrote Caesar’s Messiah?\n\nAlex Tsakiris: [01:23:48] Most people have said he’s taking away all faith, all hope. And it’s really the only hope we have, that was really quite, quite beautifully poetic.\n\nJoseph Atwill: [01:23:57] Leave the cult in you’ll enter into real hope and then from there you’ll enter into real behavior, real activity. You’ll be more powerful. This is what I think the actual goal of Skeptiko is, is you’re going to produce more powerful individuals who will produce a higher quality of democracy. And I told this to you years ago, I said, that’s why I really love your show and I support it so much, is because to me it’s just self-evident. That if you listen systematically to the stuff that you bring out, you will become a better, kind of powerful individual within democracy, you’ll be more skeptical, but you’ll also be more active. And so that’s what I would like to say that I support and what I hope my work brings about as well.\n\nAlex Tsakiris: [01:24:48] Joe, you keep referencing this new book. Where are you at in that? What’s going on with that?\n\nJoseph Atwill: [01:24:53] Well, I was about ready to release it before the COVID thing, then that produced the final chapter. So, hopefully if I can get it out within a month I’ll be happy, and I’ll be sending a copy to Skeptiko. But I really did want to include my thoughts on COVID because in fact, I had sort of predicted that this was going to come about at one of the drafts that I had worked on. As I had mentioned to you, kind of the basic structure of the book is an analysis of Brave New World by Huxley and the dystopian world that it envisions is, I think, what is the end result of the whole COVID process.\n\nSo that’s a complicated story to go into, but yeah, that’s kind of where the book is now. It just tries to summarize and to make a conclusion to the other two books. So Caesar’s Messiah and Shakespeare’s Secret Messiah. So my take on literature and on the oligarch use of literature in history is something that the public is aware of, and hopefully that will be useful in dealing with things that we’re given by the media as terrifying, and things that we would give up our freedom and give up our constitution because of. That’s what I’m hoping to make people aware of at the end of this book.\n\nAlex Tsakiris: [01:26:44] Any thoughts of reviving the podcast? I used to really enjoy what you occasionally put out there, in terms of more up to date analysis of what’s going on.\n\nJoseph Atwill: [01:26:55] Well, if anyone wants to listen to Powers and Principalities, it’s a weekly podcast I do with Tim Kelly and basically it covers just anything we’re interested in talking about.\n\nAlex Tsakiris: [01:27:06] You know what, I have to apologize. So this is great. I was able to find it through a Google search. Episode 160, here we go, The Legend of Anthony Fauci. Oh this is great, I can’t wait. This is great, okay. I will have a link. I will correct what I see as a minor little glitch here by putting a link. But no one would even know that this is you, Powers and Principalities, Episode 160.\n\nJoseph Atwill: [01:27:37] Yeah, it’s funny because what we find is that this avoids censorship. When you put your name on and they have it flagged, particularly YouTube because YouTube, they want to prevent discussion and analysis. And of course, we’ll discuss everything, and so therefore they just try to make it hard to get at, and this is how we get around it.\n\nMost of the people who listen, just do so by subscription to Tim’s channel. I think there’s like 20,000 people and it just goes out as an email to them. But then for the general public, they can find us through that method and then linking out to Podomatic getting it that way.\n\nAlex Tsakiris: [01:28:22] Awesome. Hey, Joe, thank you so much for the time today. Is there anything else we should…\n\nJoseph Atwill: [01:28:27] I hope we can do it again. Let’s do it sooner. I love to talk and there are so many things. Hopefully, I’ll have my voice back in a week.\n\nAlex Tsakiris: [01:28:34] Well, once you get the book out, we should just do a thorough deep dive.\n\nJoseph Atwill: [01:28:40] There’ll be controversy when that comes out. So it would be a good time.\n\nThanks again to Joseph Atwill for joining me today on Skeptiko. The one question I’d have to tee up from this interview is Joe’s question. Is the real tell in the scientism biological robot, meaningless universe meme, what it does to us from a political perspective? Joe’s point is that if you believe that consciousness is an illusion and that your existence is absurd and meaningless, then how would you ever form a coherent political perspective?\n\nI think that’s quite a unique and original insight from Joe, and I’d love to hear what you think about it. So of course the best place to do that for me is for you to come over to the Skeptiko Forum and pop in there and make your voice heard, so that I can find out what’s on your mind, and I can grow from everything that you share with me. If that’s not your thing, well, that’s not your thing. I hope you continue to listen. I think I have some really good shows coming up and I’m rounding out my interview series on this book, Why Evil Matters.\n\nSo there will be a light at the end of this evil tunnel, but I don’t know I can’t really promise how far out that might be. Stick around anyway, we’ll have fun. We’ll do something.\n\nUntil next time, take care and bye for now.\n\ny of them. I think I first came across William on The Opperman Report and he’s done a ton on there. But it’s just an incredible body of work and it’s really, really relevant to the stuff that I want to talk about, and that’s why I reached out to William and he was nice enough to come on and talk about some of this stuff. It’s such a great fit for some of the stuff I’ve been looking into. Some of the books we should mention. I’ve pulled them up. Abomination: Devil Worship and Deception in the West Memphis Three. You guys have heard me mention West Memphis Three, and sometimes I say it like inside baseball, and I know there’s a lot of people that don’t totally get that. I mean, they get it kind of on a place holder meme level, but William’s really going walk us through that because he’s done some amazing research on that. And then there’s Children of the Beast: Aleister Crowley’s Shadow Over Humanity. A really interesting book. And also I should mention a Vimeo movie that you need to get, and we’ll show that in just a minute. And then finally, Prophet of Evil: Aleister Crowley, 9/11 and the New World Order. So William just pretty amazing stuff there. It’s great to have you on. Thanks so much for joining me. William Ramsey: [00:04:22] Great, thank you for having me, glad to be here. Alex Tsakiris: [00:04:25] So I think right off the bat, a lot of people are super intrigued, hooked into this attorney researcher, writing books on Crowley and the West Memphis Three and not your traditional kind of true crime stuff. It’s not at all your thing, so tell us a little bit about how you came to do what you do, William Ramsey Investigates. William Ramsey: [00:04:52] Well, I was always kind of a person who was willing to research things that were not covered by the corporate media. I went to law school in DC and worked there from ‘95 to ‘98 and saw some very remarkable things. I’ve briefly worked on the, what they call the suicide of Vince Foster, which was really the murder of Vince Foster, and he was murdered and dumped in a park, Fort Marcy Park. Alex Tsakiris: [00:05:17] We can’t just leave that hanging for people who don’t know, a quick sketch of that case. How significant it is, what it’s about and why it’s not a suicide. William Ramsey: [00:05:28] Right. So he was a lifelong friend, actually. I think he lived in the same town as Bill Clinton. He was a lawyer, he’d graduated. His name was Vince Foster. Graduated first in his class at Villanova, which is a challenging law school. So it’s a very significant accomplishment. And he worked in the White House. He was, I think, the Chief Council or a council in the White House. Alex Tsakiris: [00:05:52] I mean, he was tight linked into those guys. Especially Hillary, right? I mean a lot of other things maybe. William Ramsey: [00:05:58] Yeah. The Rose Law Firm, and things going back to Arkansas and there was all kinds of shenanigans and criminality that were happening in Arkansas. There was a massive drug and laundering op. Running a laundering operation that was using Mena Arkansas, which was a kind of an airport that was in the [unclear 00:06:17], it was transshipment point for, not millions, but billions of dollars’ worth of cocaine and all that money had to be washed. There are all kinds of investigations of people who’ve talked about that aspect of how the Clinton’s came up in power. But Vince Foster was found in a Fort Marcy Park, it was called Fort Marcy, because it’s an old civil war Fort that was made out of really large pieces of the civil war soldiers, the union soldiers cut down tall trees and made this Fort there that protected the Potomac and Washington DC during the civil war in 1860s. And it’s still a remnant and it became kind of a thoroughfare. I mean, it has kind of a sketchy background, but he was found there on a berm, under unusual circumstances. He left for lunch, I can’t remember the dates now, I believe it was 1994. Clinton came to the White House in 1992 and had served two terms. But he was found there, and it was immediately called a suicide and it was super suspicious. Alex Tsakiris: [00:07:29] Yeah, we won’t go into it too far, but I’d like to know your involvement, but wasn’t it crazy? Burn marks, you know, gun on the left side of the head, he’s right-handed. William Ramsey: [00:07:37] He was left-handed, right. The gun was in the hand, which almost never happens in a suicide because the involuntary shot goes through your body. So it looked like somebody who watched a Hollywood movie would stage something. And also the fact that he was lying down on a berm. So what he would have done to do that was to actually decide to walk all the way deep into this park, and then lie down with his back on a berm, and then perform the act, hold onto the gun, which nobody knew he owned, and then cover himself and rug fibers and then the blood pattern would magically drift away, that was non gravitational. And there were all kinds of covered up, there were ripped up suicide notes that were found in his briefcase. It was really dark and very dirty. Alex Tsakiris: [00:08:30] How did you get connected and what did you do? Did you do investigations or anything? William Ramsey: [00:08:36] Well, yeah, well, I was an intern for the lawyer, for Patrick Knowlton, who was one of the chief witnesses. So Patrick Knowlton, I mean, this goes back 25 years. It’s unbelievable, but this guy’s name was John Clarke, and he’s still a lawyer in DC and I just went to work for him. And what I did for him was compile this evidence file that was different than what was in the Starr report. And it was Kenneth Starr and the chief aid for Kenneth Starr was Brett Kavanaugh, who is now the Supreme Court Justice. So most of the Starr report was actually written by Kavanaugh. And if you ever read through the Starr report and read through the footnotes, which I suggest you do, you should read the footnotes before you actually read the main text. Kavanaugh didn’t pull any punches. There were all kinds of stories about what Bill Clinton was really up to, how many girlfriends he had and stuff like that. Anyway, so I worked for Clarke and I actually sat down with Knowlton and they’re still around, they’re still giving interviews. And Knowlton was the first witness at the park who saw something suspicious. The FBI tried to change his or manipulate his story. After Vince Foster died, it’s not really that funny, but after Vince Foster died, there was a new FBI director the next day. So the FBI director got switched out. So what Clarke did it created something, and actually, it’s pretty fascinating because he successfully had that addendum attached to the Starr report by the District Court of DC. It’s a three-person court. They actually just ruled on the Flynn case if you’re familiar with that. That’s a three-person court and the Writ of Mandamus was accepted by them and they overturned the lower court with this corrupt judge, in my opinion, by the name of Sullivan who handled the Flynn case in an atrocity, he just shouldn’t even be on the bench. So that addendum, the Clarke addendum, or the Knowlton addendum to the Starr report is available and was put on there by this three-person judges, there are all kinds of facts that Starr didn’t seem to want to think. So the gripe it’s Kavanaugh with the Clintons is personal, and it goes back to that. It goes back to the mid-90s. A lot of people don’t know that. So a lot of this kind of specious, you know, “He laughed at me while he was sexually assaulting me,” there’s a motivation for all of that stuff that went down with Kavanaugh. So that was a long side, but that was really how I kind of figured that their stories, their narratives, and then there’s the real story. And the politicization of reality is unfortunately a horrible situation to endure for all Americans because you’re still going through it right now. And that was one of the things that happened in the whole Vince Foster fiasco, along with so much other criminality. Anyway, John Clarke had me take that addendum, I was so dumb. I was so naive. I walked around and hand delivered it to every member of Congress, both in the Senate and the House of Representatives. So I was just handing this thing out, and I remember handing it to Arlen Specter’s office and all these other places. So I was handing it out and that started some very interesting events of my life. But that was really how I was willing to kind of addressing. So that was really the big start and I was always a researcher. I was always reading things. And I remember at the time I was reading Michael Rivero, who does whatreallyhappened.com, who is probably for me one of the more important alternative analysts or independent voices out there. But he had a website called Rancho Runamukka, that’s how far back I go on all of that stuff. So that’s really the start. Alex Tsakiris: [00:12:40] Let me ask you this because you know, I’ve noticed, and I know this for myself, but there’s this stripping away of the layers of the onion that I think a lot of us go through, you know? I can only imagine such a great story. I mean, you’re an intern, you’re so impressionable, like you say, you’re laughing at yourself for being naive, and we can all relate to starting a career and just doing what they say and kind of following the numbers. William Ramsey: [00:13:07] 100%. Alex Tsakiris: [00:13:08] What was it like though, as you got… I mean, the stuff you’re doing right now is so, so far out there. I imagine that yourself back then, couldn’t even imagine you getting to where you’re at now with this stuff, in terms of being far out there, I can relate to that for myself. I would have laughed at this stuff 10 years ago, and now it’s like, so real. William Ramsey: [00:13:31] I think so. I was always listening to people talking about JFK. So that was probably my thing. And I always thought they were kind of kooky. But now I think they were all right. And I didn’t understand the kind of secret society element, the elite mechanisms of control through the media. So I had to learn really a lot of that stuff firsthand. So I was super naive. I believed everything in my books. I followed the path of high school, college, you know, these are the tiers of success. And, you know, I saw a whole different story. It’s pretty amazing too, because when I was in DC, I had very close friends who worked in these law firms. Like the attorney for Jeffrey Epstein before he was murdered, I used to go over to their law offices on Fridays for free beer and see all these guys, Reid Weingarten. So I just saw a lot of stuff firsthand. Plato Cacheris, who was Lewinsky’s attorney, so I used to go to Plato Cacheris’ office, because all of my friends, we were all interns. So we were all in this same kind of tier reality at that time. So anyway, that’s why I doubted Epstein committed suicide too. So these things do happen, these things really do happen, and I never really considered the occult, which is really something that I really started out with. Nobody really wanted to talk about occult ideas influencing political events or the culture, at least at my time. A lot of people would dismiss you, I’ve already been called a conspiracy theorist. But for my books, I really tried to very rigorously cite them and try to maintain a higher academic standard. Alex Tsakiris: [00:15:34] I think that’s what comes through and I think that’s what kind of intrigues people, is you have that kind of lawyer sensibility. And as you get more of the background, you can understand… You know, I think a lot of people don’t even understand the different jobs that attorneys do, and you’re kind of giving us an insight into how you think. And I think some of that is from your legal training. Now tell me more though about the occult thing, because one of the things I feel is kind of hanging in the shadows here, because when I originally contacted you, I told you this project I’m working on and it’s Why Evil Matters. And it’s really this idea that, it’s kind of like, as I described in this show, kind of alternative science or frontier science and frontier spirituality. And by that, I mean, I think there’s a lot of things that are happening in science that is pointing toward this larger, more expansive view of consciousness. An easy one to point to his near-death experience, or reincarnation, either one. Solid science, you can point to. I think 200 peer reviewed papers, at least in near-death experience. And the work that’s been done in reincarnation, particularly at the University of Virginia, is just stellar work, no one challenges that. And it’s been my position, not really position, just what I’ve observed over the last 10 years that I’ve done that, is that has shifted the dialogue. We’re going to talk about cultural lot, I think, because when you talk about the West Memphis Three, that’s what I love about that case, it pops us right in the middle of this and it starts splitting up some of these things. Like the occult and satanic culture and how there’s this wink and nod and do what thou wilt, and I can lie, cheat, steal, do whatever I have to. I can deceive you because that’s part of it, man, you know. But then, at the same time that we never talk about, is there is this twin part of it that just isn’t exposed, and that is the atheistic, you’re a biological robot in a meaningless universe part of science. So you go to neuroscience and it’s still, I mean, I repeat this every fricking show, but I can’t help it. They don’t believe that you have not only free will, they don’t believe that you have an experience. They don’t believe that consciousness is real. And when I say that, they mean that consciousness is purely an illusion. It’s a byproduct of the brain. And when you get stuck in that materialistic paradigm, and science is built on that, psychology is built on that, neuroscience, you know all this, I’m just repeating it. You can’t even begin to process satanic ritual abuse. However, you are going to pull that apart, you would say what I’ve heard religious scholars tell me on this show, it doesn’t matter if it’s true, it only matters what they believe. And I’m like, well, no, you’ve got that completely backwards. The first thing that matters is, is there this extended realm of consciousness? And are they somehow connecting with some benevolent force in that realm? You may that, but at least you got to look at the evidence for that before you dismiss it and say, “Well, that can’t possibly be true.” But the funny thing about our culture is we have this dual thing going on, where both are operating, where there’s this, you know, Johnny Depp, Duncan Trussell, a wink and a nod, of course it’s all happening in this extended realm. And then you’ve got this other side of Neil deGrasse Tyson, you know, of course consciousness is an illusion. And then here’s the shadow part that I just got to get out there because I don’t want it to be like hanging, is you have the religious part and the Christian part. And I think when we do an interview like this and I talk to you and that’s why I’d rather get it out up front, there’s going to be a lot of people who are going to watch the movie, read the book and they’re going to be, “Oh, okay, I get it. This guy has a Christian agenda and he’s going to start preaching to me and telling me his narrowly defined understanding of how I need to relate to God, how I need to relate to that ultimate thing,” that’s most important in everyone’s life, is their soul, and what that soul means to them. So, I’ve thrown a lot on the table there. William Ramsey: [00:20:09] Well, I’m impressed because I think you covered it kind of a little, in a general sense the groups that are influencing the culture. You’ve got the kind of occultist, you’ve got the materialist scientists like deGrasse Tyson or Steven Pinker or Kraus, or some of these other guys, or the Darwinists. And then, you know, you can put me right in that Christian camp, I’m comfortable with that. I don’t really think that I’m promoting a real specific kind of sectarian agenda within Christianity, but I definitely am a Christian, 100%. Alex Tsakiris: [00:20:48] Okay. So let’s just touch on that for just a second. Before we go there though. I did say I want to visit your Vimeo channel and show people some of the videos on there. And I want you to talk about that. And then we’re going to talk about a couple of interviews I’ve done one with Opperman, who I think has a fantastic show, it’s such a go-to show, he’s just got to get rid of those trashy commercials. The only way I can listen to it is with my little player in my hand, my thumb, right there. Skip. Okay, come on Ed, give me something good. But I want to about Opperman and then I also want to talk about Russ Dizdar, you know, Russ? William Ramsey: [00:21:28] Sure, yeah. We go back a little way. Alex Tsakiris: [00:21:30] So two guys I’ve interviewed, because I want to get that Christian thing handled, and then I want to dive into a Damien Echols because I think that’ll get us right back to all these things were going. I want you to tell people a little bit about some of the work that you’ve done on Vimeo, because you’ve taken the books that I showed, and they’ve done some really cool videos. And some of them have a lot of slideshow kind of stuff. But you have some great video in there. You have a really good voice for this stuff, you make it work. And you can watch here, if you’re watching, but some of the stuff, you know, Johnny Depp and Echols and then you’ve got stuff on the Process Church. So tell us a little bit about what’s going on on Vimeo. And then I have another one that I watched last night, Children of the Beast, a video you did on Aleister Crowley. So tell folks a little bit about how these movies came to happen, and you know, how you feel about them. William Ramsey: [00:22:32] Well, they were kind of outgrowths from my books. So I’ve done, other than the Smiley Face Killers, which I think it’s one of the most important true crime stories that hasn’t really been told nationally, which is the abduction and disappearance of young men for the last 25 years, not only in the U S but all over the world. But the other ones, the Children of the Beast, was an outgrowth from my book and I really just wanted to kind of make a more visual approach to that, so that people could see that. Because a lot of the books, if you put too much and too many images in there, it distracts from the narrative. But if you kind of put it into a documentary format, I think people also can learn and see things visually much better, obviously in the documentary. So Children of the Breast, Prophet of Evil: Aleister Crowley, 9/11 and the New World Order, is another documentary, and then Occult Hollywood volume two is out there. So I’ve got five full length documentaries. My Children of the Beast documentary is beyond full length, it’s three and a half hours of events that people say aren’t happening, which is men disappearing, found in water, judged as accidental death over and over again, hundreds of times. So that’s how those really came about. So Children of the Beast was really an outgrowth of my research into Crowley, which was an outgrowth of my research in 9/11, which was just a general outgrowth of my interest parapolitics or occult politics maybe. But like all of those things, that’s how my interest in the Smiley Face Killers came about, is because I kept seeing this symbol in my research into Crowley, and then it led me to think, “Okay, well, what, the Smiley Face Killers, is this an urban myth? And then I started studying it and then I started seeing people or young men disappear and end up in water. The first one I studied was a guy by the name of Joey LaBute out of Columbus, Ohio, and then I just was watching it and my chief researcher, Jim Smith, has really been on the story. I think he’s the best researcher out there on the subject. There are multiple ones, Gilbertson and Gannon were the original kind of inquirers into the study, they wrote a book called Case Studies in Forensic Drownings. Alex Tsakiris: [00:24:54] The interesting thing to me, that I was totally unaware of, is that you connect the Smiley Face Killer thing, that a lot of people have kind of heard about and don’t know kind of what to do with it. And you’ve connected it to some of this same strange occult signaling, satanic signaling that’s going on. And it is funny because ever since you mentioned it, I start seeing that smiley face in art, in t-shirts in all the right/wrong places. And I like how you’re very careful, again, you have this kind of investigator sensibility, just the facts ma’am and you build your case slowly, you don’t jump to a lot of conclusions. And even when we’re going to talk about Crowley and talk about the West Memphis Three, you’re very careful to build your case counselor. So let me just touch on the Christian thing because here’s, I think, the catch. And then I’m going to let it go. But there is this sense among a lot of people that if someone is Christian, that they’re so agenda driven and I’m guilty of accusing Christians of this too. Because I think Christians do not accept their culpability in some of this stuff, and culpability in the sense of just how the average person processes this, and says, “Really? In this day, with the Catholic Church outed as systematic sexual abuse from the highest level directed from the Pope, you’re going to tell me that this folds right into Jesus on the Cross, Son of God, screw you.” And further, I mean, what Crowley is saying, and this is especially the reason I think we need to pull the Christian part about it, is that one way to read the Crowley narrative, the Crowley biography, and I think it’s totally the wrong way, but it’s the way they keep doing it, is he was rebelling against a just incredibly overbearing Christian father, who really was kind of a kooky. Anyone would say, you know, it’s taken the Christian thing way to this kooky extreme. No birthday parties, no presents, no Christmas, you know, all this cultish kind of stuff. And of course, then then we can pack it back into the psychology, and then we never have to deal with the real stuff that’s going on. And I would maintain, and then I’m going to let you respond to it, maybe I’ll play a couple of clips from Ed and Russ Dizdar, and then we’ll move on. ed and, uh, and is, and then we’ll, we’ll move on. But I’d say the same kind of thing with the West Memphis Three, when you break that down, if people haven’t heard your stuff before, it’s going to be stunning, because you stack the evidence and it’s just overwhelming. But people are still going to process it as, “Oh man, satanic panic, those damn Christians are at it again. Dah, dah, dah.” So in general, go ahead and respond. William Ramsey: [00:28:08] I think that’s fair. I’m glad that you brought up the Catholic Church because that’s the exemplar that antagonists of what they believe Christianity, even Crowley too, he was part of the exclusive brethren by Darby, who you may argue isn’t even enough authentic Christian. So he’s definitely within this wide broad tent of what’s defined as Christianity, but that’s very generalist kind of way to put it. I don’t think Darby was, I mean, he was a sense dispensationalist, there all kinds of problems with his theology. Some of these Christian leaders in different sects are very comfortable with the occult. Supposedly like Darby, I need to research that more, but also Joseph Smith, the guy who started The Watchtower, the Jehovah’s Witnesses. There are all kinds of problems. And I think that this actually happens often. It’s like, you can look at the gospel as a kind of caricature and then say, you’re just going to throw that agenda on people. I know what happens and that’s fine. I don’t even describe myself as a kind of sectarian Christian. I’m really just a Bible believing Christian. So I think that the real basis of any proper definition of that faith would be to see what’s in the gospels and what is in Paul’s writings and that should be basis point, not the church. The Catholic Church has hyper corrupt. I mean, the kinds of things that have been going on in there and the doctrines that are there. And even Crowley it’s interesting you bring Crowley up. He actually favored Catholicism. He actually said that the real enemy were the Protestants and the Jews. So he had this kind of like a tolerance for it. And even some of his religion that he adopted, he took from Orthodox Christianity. So his whole occult Gnostic mask is from the Orthodox Church and he absorbed a lot of Christian teachings and twisted it. But yeah, you’re right. So Darby himself. So I think that these critiques are common, they’re fair, but I think that they can be addressed and that’s fine. You can look at me. You can look at me through whatever lens you want, but if you want to look at the facts, that I’ve written about in those books, they’re all fairly long, they’re all footnoted. They’re almost none of my subjective opinions, they’re really just reference points. They’re properly referenced in my opinion. And then you can take it as what you want to believe. Alex Tsakiris: [00:30:50] See, you know, right there. We’re cool. William Ramsey: [00:30:53] We’re getting into epistemology, right? Like why do you believe what you believe? Alex Tsakiris: [00:31:00] Exactly. And to that end, I pulled up the interview that I did with Ed, and I just rattled his chain, but I’m glad I did. I mean, I don’ mind pushing people in that way. But what Ed said that really kind of set me off and I pushed on him and then he got really pissed off, is he’s like, “Why do you care what I believe? Why do you care what I believe?” And it’s like, you don’t get it, Ed, that is the whole thing. You’re entering this realm. You’re entering this battlefield. Yes, I care what you believe. Just like when I had Hugh Urban on, Dr. Hugh Urban from Ohio State University, telling me about his book on Scientology and how it didn’t matter that Crowley and Jack Parsons were performing a ritual in the desert to bring forth the antichrist through the Whore of Babylon, and he said, “Hey, it doesn’t matter if there’s any reality to it. It’s just matters what they believe.” If Christians don’t understand that it matters what they believe, and they better be ready to defend what they believe or, as you do, separate that and say, “I would like to keep my personal beliefs, my relationship with God out of this and instead, look at my a hundred pages of footnotes. Look at all my documents, look at all that,” and just take that on its own merit. Again, I don’t care about Ed’s… I love his show and stuff. It’s just that thing. I had Russ Dizdar on. Fantastic. Tremendous amount of information because Russ got what I was saying and right from the beginning he was like, “No Alex, you want me to approach this with just giving you the facts for satanic ritual abuse, and I’m going to tell you about the victims, I’m going to tell you about what we find when we go to these sites, and what we observe in terms of the inverted, pentagram, the language, all this stuff, and let that kind of tell the story.” And that’s what I like. William Ramsey: [00:32:59] I mean, we’re all biased. We all have our own outlook. I can’t detach that from my books, my personality, and the way I believe about things. So I think people requiring total objectivity is unattainable. So people always say, “Oh, you’re biased.” Well, everybody’s biased, age, race, education, gender, politics. So I think that that’s fair. I listened to left and right, I don’t really mind as long as they’re really being honest, that’s really what I want, if they’re being honest with the facts. And that’s really what I try to have, is an integrity towards the reader or listener of my videos. Like this is just what they thought. I don’t do a lot of editorializing, unlike corporate media or CNN or MSNBC and all this trash that shouldn’t exist. So I don’t mind defending, I mean, we can do defensive Christianity, like what you think the true Christianity is. I don’t stand with some of these people other people would call Christian or what would be the foundations of that faith. Alex Tsakiris: [00:34:08] Another show, and I don’t think it’s our show. It’s not the show that we need to do, because the show that we need to do is on your books, because you already totally get where I’m coming from and you picked up the trail immediately because you’re a good attorney and you kind of saw through that. But what I think is interesting is the link, the path, and the Damien Echols thing is just fascinating to me and we’re going to approach it and tear it apart. So I’ve been on the trail of the Crowley thing and I have friends who are in the magical community, if you will. And I have friends that are trying to make sense of that in a way that isn’t crazy, that I don’t think is evil, that I don’t think is demonic. I’m not sure that really works at the end of the game, at the end of the day, in terms of my understanding of spirituality, but I respect that people have different ways of doing it. And I don’t think that everyone who looks in that direction is damned or condemned, or even doing it for evil purposes. So with that, you know, I just want to get to the facts, because I did this interview for my book with a guy I really like at Forum Borealis, and I did it with Al. And I started going into the Crowley test, what I call it. And when I get the apologists for Crowley I just started tearing them apart. I go, “How does that make any sense to you? This is exactly what he said. How does this make any sense to you? He did this. He admitted to diddling little kids.” I mean, he admitted to that. He acknowledged that he had children present during his sex magic. William Ramsey: [00:36:03] He encouraged it, right, he encouraged it. Alex Tsakiris: [00:36:06] But there’s all this apologist stuff and that’s the test that immediately splits it. But I’m kind of jumping ahead because I want to go back to, people don’t really know, like I was telling you, Forum Borealis., he’s in Europe, he’s in Norway, and I’m rattling off West Memphis Three, and he’s like, “What’s West Memphis Three?” So if you can just sketch out the big picture of West Memphis Three. And I think the other thing that I’d love to have you talk about, and then I’m going to hit you with some more questions on the details, because they’re fantastic, is what happened to West Memphis Three? Because the general impression is, “Well, they just found him innocent that they didn’t do it.” William Ramsey: [00:36:48] Right. So they’re supposedly innocent. They were arrested for a crime they did not commit. These are the standard kind of PR axioms that you’ll see in almost every article that is pro West Memphis Three, which there are very few anti West Memphis Three out there. But the true crime story really started in May 5th of 1993, after three young boys went disappeared. They were eight years old, right, in line with Crowley’s teachings on human sacrifice in Magick in Theory and Practice. They were eight years old. They disappeared. They were found the next day in a ditch, in a little area called Robinhood Hills outside of West Memphis, West of Memphis, Tennessee across the Mississippi river. Two were found later after a medical examination to have been drowned. They were tied up in a very strange manner, ankle to wrist. One had bled out after his genitals had been removed. And so it was a particularly graphic and brutal crime. There was blood all over the place. It was never admitted into court, but the luminol tests were taken, so there was blood all over that area. And there was an outcry trying to figure out who did this. There was a suspect that was mentioned by a probation officer by the name of Jerry Driver, who said that this young man by the name of Damien Echols, his real name, given name Michael Hutchison was his born name, but he changed his name to his stepfather’s last name and took on the name Damien. So he was investigated. And according to the records that are on the police records, he was brought into the police office. He was questioned. He failed the polygraph test. He said, “If I talk to my mom, I’ll tell you everything. If you let me talk to my mom.” So he went and talked to his mom, then he clammed up, but the investigation continued. They didn’t have enough evidence to arrest any of them until they brought in another young man by the name of Jessie Misskelley on June 3rd of 1993, who then confessed and implicated Damien Echols and Jason Baldwin. And all three were arrested. They were tried separately, due to some evidence that was going to be put in the trial. And 24 jurors found them both guilty. Damien Echols was over 18. He was given the capital punishment. And the other two pretty much got life sentences. And probably the key lever in creating doubt in the public’s mind was the involvement of an HBO documentary. There was really a trilogy. The first one was titled, Paradise Lost, which came out in 1996. And then there were two others, I think it was 2001 and maybe 2004. I can’t remember the exact dates of when those came out. But there were three that cast doubt upon the guilt. The first one kind of was somewhat of objective, but the second one kind of blamed one of the stepfathers by the name of Byers, and then third one pretty much implicated another man by the name of Terry Hobbs created kind of a furor. It snowballed, other people got involved, celebrities got involved. Money was raised, possibly they’re saying a huge amount of money, 10 to $20 million. One of the best attorneys out there got involved and put pressure on the state government through new laws that had been created about DNA testing and there was going to be a hearing in 2011, I think in December to a judge, whether some of this DNA could be used. But in August 2011, an agreement was reached and the three pled guilty. So they already had all been found guilty. They pled guilty again, to first degree murder. They admitted on sign documents, you know, they’re adults now, but through the best attorneys really available, that there was enough evidence to possibly convict them again. They went to court. They were put under 10 years of probation, they were let out while professing innocence on something called an Alford plea, which is based on a Supreme Court case Alford V North Carolina, which allows you to profess your innocence publicly while pleading guilty. So they’re basically guilty. They’re still guilty and under probation until next year. Alex Tsakiris: [00:41:20] I asked you to keep it vanilla and man, you really kept it vanilla. Let me kind of pull you into the real stuff. Like anyone who goes and Googles West Memphis Three, I’m not exaggerating, the first 1o, the second 10, the third 10, satanic panic, satanic panic, satanic panic. That’s the only thing you hear about this case. It doesn’t have anything to do with the facts. And that’s what’s going to be so interesting as we dive into this. Why did this become the kind of poster child for satanic panic? And why do we think that that that’s not accidental? It can’t be. And all again, all the wrong people lining up with this guy and flashing, you know, satanic signs and all the rest with this guy wind up, lining up with this guy and flashing satanic signs and all the rest with this guy. William Ramsey: [00:42:16] Statements, yeah, all kinds of stuff. I mean, it’s all over there. So why is it satanic panic, if the guy, as a member of the OTO while he’s in jail, while he’s also just recently admitted to being part of AA, was specifically traced to Crowley who wrote in his own writing on vice that he was prosecuted for his love of the knowledge of Aleister Crowley specifically? Crowley’s name pops up all over his, and that’s really what peaked my interest in this whole case. Alex Tsakiris: [00:42:44] Isn’t it true William, that we have evidence of him, like performing a satanic ritual in a burning garage that he set on fire? Go ahead on that one. William Ramsey: [00:42:58] Well, that’s true. I mean, that was in the original case. They say that he was prosecuted for wearing black, but he was actually arrested before the events for kind of moonlighting, I think, in an abandoned trailer. And then there was testimony of all kinds of weird stuff he was doing. And there were all their statements in the court files, which I included in my book about them hanging out at Stonehenge, just crazy stuff. Off the charts. Alex Tsakiris: [00:43:26] Off the charts and you do an amazing job in the film. Let me pause for a minute. Let me see if I can pull that up. [Clip 00:43:34 – 00:44:01] Alex Tsakiris: [00:44:01] Okay, I’ll stop it there if I can. But I wanted to give people a little bit of a taste for the excellent movie that you put together. Tell us what’s happening there. You really feel for that kid, I have to say. I know they prep these defendants, but he looks so innocent and harmless, but that’s exactly the point I wanted to put on about the deception. He’s caught with an outrageous lie there, right? William Ramsey: [00:44:33] Yeah. I mean, they caught him in a lie that he was writing like a secret script. I mean, the allegation is that he was obsessed with the occult, right? But they denied all that, but while he was in jail, what’s he doing? He’s writing the secret script that has Jason Baldwin’s name and Aleister Crowley. And then he gets out, what’s he do? He’s right back writing books about magick with a K and making all of these very different interviews. He’s quoting, he’s talking about the Moonlight, he’s talking about rituals, he’s tweeting about it. I mean, it’s just incredible that people can actually be the led on to think that that involved in this case. Alex Tsakiris: [00:45:13] So I want to touch on two things. I want to hit on the deception thing in a minute, because I think if people aren’t aware that that is part of the ethos, that is built into this system of beliefs, which is that I can lie to you. It’s okay for me to lie to get my end. And it’s right in the title of your book. Do you want to speak to that, have you found that to be true? William Ramsey: [00:45:42] Absolutely. I think that they lie about all that stuff. They lie about their secret society, associations, about who their friends are, about their signals. There’s a real wink and a nod, just like you mentioned within these groups. So I think that not disclosing… What did Orwell say, “Admission is the greatest form of lie.” So they admit to tell you all this stuff, that there’s all kinds of weird associations. I mean, there’s some dark habits. I mean, there’s so much deception in this case that almost everything that’s proffered by Echols in some thing, it’s just nothing is really that honest. He said that he was sick, that he was beaten in jail all the time, that his teeth were going fall out, that they had to take the deal because he was going to die. Alex Tsakiris: [00:46.33] Hey guys, I just wanted to jump in for one second with a couple additional points that I wish I would’ve asked William, but I didn’t. So I’m going to try and get those in here. And these come directly out of his book, Abomination: Devil Worship and Deception in the West Memphis Three Murders. And it’s really important for getting to the bottom of this question of whether Damien Echols did these deeds, these horrible, evil deeds. I have to make the distinction because a lot of people don’t get this. It doesn’t speak to whether or not he should have been released, you know, whether there were some technical requirements in the legal system that weren’t met, or any of that stuff, that’s separate from whether the guy did it. But the guy did it. He has in the book the police interviews they did. And these police interviews are tricky because police in these situations do some pretty, I don’t know, too me kind of shady kinds of things. Like one of the things they do to people is they say, “Okay, who do you imagine would have done this crime?” So they, they get them down this whole line. But listen, what he says, first Damien confirmed that he liked to read books and one of his favorite writers was Church of Satan founder, Anton LeVay and The Satanic Bible. Now that again, for the people who are apologists for Satanism, they’re like, “Hey, you know, should be able to read whatever you want.” Sure, you should be able to read whatever you want, but they ask them specific questions about the murder. And they say, you know, “Damien how would you imagine it going down?” and he said he figured that the killer knew the kids in the woods and even asked them to come out to the woods. He stated that the boys were not big, not smart, and they could have been easy to control. He also felt that the killer would not have worried about screaming due to being in the woods and close to the Expressway. And then he said some important factual details. Damien said that the bodies of all the boys had been mutilated and one had been mutilated a lot more than the others. This is a fact that was not known to anyone except those at the crime scene because the police never released this information. He also said that Steve Jones from the Juvenile Authority had told him about how the boy’s testicles had been cut off and that someone had urinated in their mouths. Damien said that that could have been the reason why their bodies were placed in the water, so that the urine could have been washed out. This is another critical piece of evidence because this information was never released. Steve Jones from the Juvenile Authority had no way of knowing that and couldn’t have told that to Damien. Only someone at the crime scene could have known that. So again, I’ll leave it off there because I hate all this nasty gory true crime stuff. But again, pack this back into the question of whether or not this is a case of satanic panic. Okay, back to the interview. William Ramsey: [00:49:50] You know, all kinds of crazy stuff. If you look at the totality, it’s just nonsense. It’s really hard for people to believe that in literal Satanism that there are groups of networked people out there. And I think that that’s really the hardest part of addressing the West Memphis Three. Alex Tsakiris: [00:50:11] I think you’re absolutely right about that. You know, one of the chapters I have in my book is an interview that I did with this woman named Anneke Lucas. And she’s really a lovely person, and we connected. We both like yoga and she’s a yoga teacher for incarcerated women in Upstate New York, and she’s got this transformation that she’s gone through in her life. And she would have to, because at six years old, she was sold by her mother to a satanic ritual occult abuse network in Belgium. William Ramsey: [00:50:46] Belgium right. Was she associated with the Dutroux thing? Alex Tsakiris: [00:50:51] Well, she’s careful about who she names, but it’s very clear that that is the group that had her because she mentions, and that’s fascinating too, right? Because talk about history repeating itself, you know, there was this big drain the swamp and this is this pedo ring. As I tell people, anyone who has any doubts, you can still Google photos of kids in cages, tied up. Just all the most horrible of the horrible things you can see. And her account is that she was going to be killed. She had been raped, like thousands of times, six years old remember, six years old by her mother. But the interesting thing I always alert people too, is that if you want to take a secular perspective on this, it doesn’t work because what these people are doing, and they will tell you what they’re doing, is they are trying to, one, connect with some malevolent force in this extended realm.. and they’re trying to connect with that force for a reason, to bring in a certain energy into this realm. And that’s why they connect with Aleister Crowley. And it’s nothing unique about Aleister Crowley, it’s just many people have chosen that at all costs, they’re so attached to this world and what they can get out of this world, that any entity in that extended realm that connects and offers that chance, they’ll do it. William Ramsey: [00:52:30] I’m glad you brought up that case because it was totally networked, it was covered up. There were all kinds of shenanigans that took place under the surface. Like the prosecutor got fired, and there’s an incredible German documentary that traces just the people that were murdered around the Dutroux case that knew too much. It’s like 25 people. Like, “I knew too much, they’re going to kill me,” ends up dead. Another person says, “I got information on this,” gets run over by a car. It’s incredible. It’s like JFK, you know, all the people who knew about that, who ended up dead. It’s incredible. The Dutroux case, if you don’t think that that’s network evil, I’m sorry, you’re just wrong because it went to the highest levels of that elite. And Dutroux was known to leave Belgium, he was moving around Europe. So they don’t even know the totality of what happened and the horror show. Like two of the kids died because he was in jail and couldn’t feed then in the dungeon. So that’s a real problem. People cannot connect to spiritual evil, and I’m glad you brought that up because that’s what these people are doing. That’s what Crowley was doing. If you read his Corpus and all the stuff, he’s talking to entities, he’s traveling through the astral plane, he’s got Aiwass and the wizard and the Amalantrah Working, the [unclear 00:53:46] Working, Coronzon. He’s supposedly talking to all these people. That’s what a lot of these things are doing is summoning demons and that’s who’s giving him information, that’s what he’s writing down. So, I think that magic, that’s really it. And the real argument is like, are these figments of your imagination, or is there something outside of your personality that people are perceiving? And if you want to talk about the magical community, that’s an argument. However, I don’t know how Crowley could have written down, like a gray alien back in 1918 in New York, after an Amalantrah Working. So that is such a stretch for the imagination, and you still see this kind of reference alien, extraterrestrial, what if they’re extra dimensional? So they see when people do yage or they do ayahuasca, there’s always this green man they’re talking to. People have these weird entity experiences. And that may be all the UFO phenomenon really is, is really people who are having extra dimensional events, not extraterrestrial. I could talk about the Children of the Beast, LeVay talking to McMurtry, and all of these other guys. Alex Tsakiris: [00:55:08] I think, here’s what I want to go with that. And maybe we’ve hammered on this enough or maybe not, I can’t tell. But there’s this doublespeak going on. The cultural part of it, and I’m struggling. I’d like you to talk more about the culture around Satanism and occultism. And I don’t want to use those words in the way that they’re usually used. You know, I mean, I had Oxford Christian scholar, Richard Smoley, How God Became God, a super great guy, a scholar, a religious scholar and remains a Christian. But he’ll point out to you that historically Satan isn’t in the pre-Torah writings and he kind of pops in after Zoroaster. And we have all these things of that reality, we’re co-creating reality. William, I can’t tell you how many near-death experience people I’ve talked to, but I talked to a guy just the other day, a fantastic guy. I have no doubt about his Christ consciousness experience because that’s what happened to him. He died. He went to kiss his girlfriend at the commuter train and the door closed on his coat, dragged him under the train and he died, and he saw Jesus and he had this incredible experience. And I don’t doubt that he had this incredible experience in this consciousness realm with Jesus. But then I asked him, I said, “You know David, a lot of people I’ve talked to that have multiple near-death experiences, they sometimes say that the Christ figure kind of gives way to an even greater and a higher God, and there’s hierarchy.” And he goes, “I can’t deny that that isn’t true, because I got a sense that there’s more for me,” and stuff like that. I’m not trying to kind of preach to you on any of that stuff. What that opens up to me is the possibility that we need to consider an unbelievably varied realm in this extended realm, which is even more complicated than our realm, because we don’t know what these guys are doing exactly. And I’m uncomfortable with just saying a demon, they wanted a demon. I just don’t think we know enough. We know it’s evil, we know it’s dark and I’m just kind of rambling here. So save me. William Ramsey: [00:57:33] I think it’s interesting because you can even look at the biblical context, these, like demonic entities are all through, kind of the global mythos, through all of these legends and stuff like that, that there’s bad spirits. Almost every culture has some kind of reference to these kinds of things that are outside of themselves. Not ghosts or something, but some kind of evil presence. So it’s a commonality, not just kind of in the Bible, where the New Testament talks about Christ being tempted by Satan. There are actually references to Satan right there at the end in Jerusalem at the Last Supper with Judas, right? Satan enters into Judas and he goes and betrays Christ. There’s even a reference to Satan and Isaiah, for example, which is the Old Testament. But yeah, before that, maybe not so much. It’s interesting because in the Bible, Paul mentions Moses contesting against the two magicians of the time in Pharaoh’s Court, Jannes and Jambres, but they’re not mentioned in the Exodus or Mosaic narrative. So Paul seemed to have some reference to these two magicians and there are magicians in the Bible like Simon Magus and the Witch of Endor. So this kind of magical tradition is a part of human civilization, a dark magic, maybe if you want to call it that. So something outside of yourself, like some demon, I think, extra entity or something like that, isn’t that hard to believe. And then if you want to say, like people who’ve experienced miracles, near-death experiences, there are varieties of religious experiences, just like that book said. So I don’t think it’s outside of that. It happens whether it’s within the Christian tradition or not. Alex Tsakiris: [00:59:33] Right. So we’re kind of pushed in this box. So we’re kind of in agreement, that we’re being kind of pushed in this box to either deny evil. And when I say evil, you know, let’s try and work towards a definition. This kind of soul crushing, extra-dimensional help in order to destroy someone’s soul, that’s evil. We can kind of drive that one in the ground and say, “Okay, I don’t know about drone striking a wedding party in Yemen,” which I think is pretty bad, but who knows it has some geopolitical aim or something like that. This we can more clearly say, I can’t see any other way that that isn’t evil. So then what is the play in culture? Why do we have this divide? Why do we have, like we talked about at the very beginning, you know, that Neil deGrasse Tyson, who we really think is probably just completely oblivious, you know, is just happy living in his materialistic world. And then you’ve got the kind of Hollywood, which you’ve just explored extensively, is going like, “Well, we’re way past you guys. We’re using the force.” William Ramsey: [01:00:46] That’s a good point. I mean, look at Johnny Depp, he’s supposedly uses these entities to inform himself on all of his roles. Like, he’s fully involved in… like what we call evil. People ask me, “You’re an admirer of Crowley, you seem to talk about in in laudatory terms,” I don’t, I call him the prophet of evil. He thought he was a prophet of the new aeon. I believe is evil because all of his ideas are antithetical towards the treatment of society, really in general. It’s super selfish, like you said already and go over this theme of our conversation, you lie, you manipulate, the slave shall serve. Crowley was kind of like a classist of the worst sort. But I think the definition of like, what people are willing to do to their fellow man to get worldly benefits, whether it’s money, sex, fame, kind of the standard sins. Then can kind of counterpoise that at least in the teaching of Christianity to somewhat universal. It’s like Christ is a servant, and you turn the other cheek and there are those teachings here where you’re not supposed to propagate trauma or hurt on somebody else. That’s kind like what turning the other cheek is, you don’t strike back. So it kind of lessens whatever harms are out there, it doesn’t engender that kind of malevolence towards people, people hurting each other. It’s interesting too about how many of these occultists really are Christ and Christian aiders, whether it’s Hubbard or Crowley or Hitler or some of these other people. How they really deliberately counterpoise themselves against the teaching of Christ. Alex Tsakiris: [01:02:53] And I think there’s a couple of interesting things and I don’t know if we can kind of smooth this out and hit all the points. And this is in the Crowley thing, and maybe you can pick up on it and elaborate on it. But the do without wilt ethos, which whenever you talk to a Crowley apologist, they jump on that, they go, “You don’t know what that means. You don’t know what that really means.” I go, “His whole life is about that. Look at his life, look at the deeds, the fruit.” But I guess related to that is kind of this Sabbatian Frankist kind of, we can’t all be saints, so let’s all be sinners, and this kind of Crowley, I want to do the most horrible, but then they twist it into, again, this Christian thing, because that will in this twisted way bring about the next coming of Christ. Do you want to speak to that at all? William Ramsey: [01:04:00] Well, I think that, you know, Crowley said he got power from transgression, and I think that’s a very common theme within occultists or Satanists or whatever, however you want to call them. And I think the worst crimes, it’s an inversion. So definitely it’s there in Crowley. It was funny, somebody asked Crowley, “What if you have two people who are doing what they will, what if they conflict, what if they headbutt over it?” and he didn’t have an answer for that. So you can just see the wreckage of Crowley’s life, the ruined lives, the wrecked lives, the suicides. It was like an energy drain on almost of his scarlet women, branding him on the chest, and then he was done, they were done, they were not giving him this spiritual energy that he wanted. And they just moved on. If the apologists think that he lived an exemplary life, I think that they’re deluding themselves, there’s a lot of delusion in the Crowley followers and there’s a lot of simplification there. The people who admire Crowley only saw him one side, which is his religion, but not his real personality and the way he behaved toward others. I think if they look at the truth of really what he did… And that was really one of the things why I was inspired to write a book about Crowley, is because of all of the expurgated elements of his life that people just left out. They just call him the great man, or liberator of humanity and all of this other stuff, but he was an outright Satanist, he admitted as much, that Aiwass was Lucifer and the devil of the star or universe. So he just concealed it and camouflaged it much better than maybe a person like LeVay. Alex Tsakiris: [01:06:06] So William, before we run at a time, because I’ve kind of babbled on about a lot of my stuff. One of the important things about your work, especially with Crowley, is you give the direct connections to present day culture. Like Timothy Leary might be one that some people have known that for a while, but some people don’t. Obviously, the music industry, the Hollywood industry, and this just admiration and this kind of blind devotion. And you can only imagine the feedback we’re going to get from this show. I mean, because there are some real Crowley defenders and they’re just out to stamp out anyone who says that. Connection to important cultural figures in time, Crowley. William Ramsey: [01:06:48] Well, I mean, you can just go back through so many influential people, whether it’s Hubbard, whether it’s Leary, whether it’s Jimmy Page, Kenneth Anger, who’s associated with the Manson family. I mean, he literally lived with Bobby Beausoleil and Bobby Beausoleil was Lucifer Rising. And one element of the whole corpus of works about Manson that you almost never hear about is that Beausoleil who murdered Hinman was living with Anger, he was in a movie with him, and he also considered himself a warlock. He was also associated with so many other cultural events, and still alive, still alive today believe it or not. Anger has been friends with Jack Parsons and Marjorie Cameron all the way to today. And it’s also an element of the elite because one of his great sponsors was J Paul Getty Jnr, one of the richest men in the world. Whenever Anger wanted to take flight, he just got a carte blanche payment from the Getty family, which tells you a lot about the elite. And Getty used to do all kinds of weird rituals and tunes and stuff. If you really look past the curtain of these people, they’re much darker than you can imagine. So I think that that culture is very important, and it’s usually left out in these histories of these people. Like I said, it’s selected history. So if we can go back to the very beginning of our talk, where if you have a materialist, a Darwinist, a person without a spiritualist view, they just won’t even look at these things as important markers upon character and how that character plays itself out in the real world. They just won’t even accept it. Then you have occultists that are deliberately keeping that out. So there’s a real historiographical problem because a lot of these people move into these characters and their understanding of what they’re really doing, because there are parties deliberately, whether because of their own inherent biases or intentionally because they’re occultist, which is to hide something, keeping that out. And that’s really, when you see these characters, how, if you don’t get all of the facets of their character, and like Hubbard, he was the source, I mean, all the same fake prophecy type stuff, how toxic and dangerous Hubbard really was in Scientology. If you don’t see that part of his connection to Crowley, you could literally have your soul raped by him in that whole organization. Alex Tsakiris: [01:09:25] You know, kind of related to that, it took me a long time to come to this realization about the atheist materialist, you know, there’s no meaning you’re a biological robot. William Ramsey: [01:09:35] The whole top of your brain is just a big deceiver of reality to perpetrate, your genes. That’s all it is. Alex Tsakiris: [01:09:44] It’s impossible for me to accept that that isn’t conspiracy also. William Ramsey: [01:09:52] That’s a good point, that’s a great point. Alex Tsakiris: [01:09:53] That that isn’t orchestrated, because it just totally fits into the playbook. And people don’t realize that to do that it doesn’t require a completely orchestrated kind of thing. You just put the cheese in the maze where you want these little rats to run and they don’t even know what they’re doing, but they’re doing the bidding of someone who says, “Hell yes, I want people to think that life is meaningless and to just be materialists and consumers,” that fits in perfectly. William Ramsey: [01:10:21] Let me just add to that because it’s like, if you’re an elitist, that’s what you want the people, the slaves serving to believe. There’s no meaning. Don’t make any changes. There’s no action on your behalf. If you look at Darwin and really unpack The Origin of Species, it really is a big racetrack and it has its own ideology outside of science. It’s about the most favored races, and the struggle for survival. That’s the subtext of it. If you ever see Darwin, he’s making the occult sign of silence. So this kind of occultism has been around forever, pre-Crowley. He just adapted and adopted and stole it. But it puts Darwin in a completely different light about what his real objectives his were and why The Royal Society wanted to promote those objectives, which is basically the King and Queen of England. They justified their whole empire, right? Alex Tsakiris: [01:11:16] Totally. William Ramsey: [01:11:17] They’re at the top of the global empire. Alex Tsakiris: [01:11:19] We did a bunch of shows on Wallace, you know, who was the contemporary of… If you go back in the history books, like 50 years, the co-discoverers of evolution were Darwin and Wallace. And Wallace is kind of erased out because Wallace comes to the conclusion that there’s a higher order of consciousness to this. There’s no getting around it. And in fact, I’ve had some scholars on here and I didn’t make a very convincing case that Darwin plagiarized Wallace’s his writings in order to get his theory. Because he didn’t have the data. Wallace was in the field collecting widely the data. He stops on the Galapagos islands, which is great, you know, but he gets this very narrow bit. Wallace, he’s the working man kind of thing. He’s out there having to struggle and collect all these things. I forget where he was. But anyways, that’s for another time. Because he’s the other question, I wanted to skip back and really, really dig into this one. We see the Hollywood thing and we get that Johnny Depp is in, he just looks like a tragic figure to me. He just looks like somebody whose soul has been sucked out of him. I know that’s going to sound kind of churchy to people. Don’t you see that? Don’t you see that in some of these people? But other ones, you feel like maybe they’re just being duped and that’s when you really feel sorry. They’re going to the parties and, you know, Brodovitch is cutting up the cake and isn’t this cool. And they don’t understand what’s at play, or do you think they do? William Ramsey: [01:13:07] well? I mean, I could probably analogize, like they had just a naive view of certain things. You know, I had a very naive view of American politics, and there’s a lot more going on under the surface than you could imagine. And it’s probably the same in Hollywood. People wanted to be famous or they wanted to be in the arts, and they might not even know what it takes to get to the top. And I think that Hollywood, for example, at least recently, I think you’ve got to be initiated to get to the top. One way or another, you’re either into pedophilia or occultism, or just something dark. So everybody knows something about somebody else, you know? And that’s why like a guy like Weinstein was raping people for decades. The amount of people who come forward is probably just a tip of the iceberg for that guy. So there’s something really creepy going on in Hollywood. And I think a lot of those guys, if you really read about some of these stories, it’s just… Have you ever read Crazy Days and Nights? It’s a really good website, but they are leaking information from these guys that they’re just monsters. A lot of these stars and celebrities and directors were child rapists. And some people don’t survive in Hollywood, they crack, and they leave, or they just are disillusioned. But the ones that have been there forever, Johnny, Depp’s a perfect example. If you look at this court case that he’s having with Amber Heard’s involvement, they have a recording of that guy just howling in pain. There’s something about him that’s wrong. And his association with Echols. He was one of the chief financial backers to get Echols out along with Peter Jackson. Alex Tsakiris: [01:14:56] Do you know who, uh, Chris Knowles is? He writes a blog. William Ramsey: [01:14:59] Yeah, I know Chris Knowles. Alex Tsakiris: [01:15:00] I interviewed Chris a few weeks ago, and I think he’s like me. He has some friends who we like and respect, who are kind of in this magic community and we keep going, “What are you doing guys?” But he said it so perfectly. He said, “If you think you’re talking to this demon or this entity, and they’re going to do these fantastic things for you, what are you have to offer in return?” And I thought, doesn’t that just ring true on a kind of personal level? How do you think you’re going to make that deal work? You have nothing except your soul to give and that’s what you will be asked to give at one point or another, you know? William Ramsey: [01:15:46] Very good point. Very good point Alex Tsakiris: [01:15:49] Last point and then I’ll wrap it up. I appreciate we’ve pushed it right up to the 90 minutes. Russ Dizdar has a really interesting theory. It’s going to sound completely wacky to a lot of people, but I got a lot of reason to believe that he’s on the right thing. And that a lot of times when you hear about this sexual abuse of children, pedophilia, that it’s not even so much about sexual abuse, it’s about traumatizing children in order to create this dissociative identity disorder, because it is a direct link to making them more vulnerable to spiritual attack. And the crazy thing about that, is that connects directly to stuff we’ve learned about MKUltra and that we were trying to weaponize that dissociative identity disorder aspect, because we learned that it’s almost like a technology, it’s a secret code. What do you think about that? Do you have any thoughts? William Ramsey: [01:16:49] I think he’s right. I think he’s right. I think that that’s true. I mean, I think in a very dark way, a lot of the stuff that happens in the Catholic Church is to keep people in the Catholic Church. So they get traumatized, they become helpless, they become less active, so to speak or authoritative. So I think that that’s definitely believable, right? I think that that’s what they’re doing. They’re deliberately traumatizing the kids as well. Yeah, for sure. And in some of these cases, McMartin and stuff, the kids are deliberately being traumatized or the Finders case, they’re all using these same techniques and these strange occultists are running the whole show. Look at the Finders case man, terrifying. And you can get into deliberate traumatization in 9/11, incredible. It’s traumatizing if you think the government did it, or it’s traumatizing if you think that some guy in a cave in Afghanistan did it. Alex Tsakiris: [01:17:50] So when you get into weaponized traumatization, then just the thought that someone has figured out that they can get a leg up by doing that, is really scary, especially in this extended realm. William Ramsey: [01:18:08] Very scary. And you know the traumatization starts and then the suggestion follows. Right? So you traumatized and then the suggestion, and then… Alex Tsakiris: [01:18:16] You’ve opened up the door. William Ramsey: [01:18:16] You’re absolutely right. Then you have this kind of approach, this technique that they know, right? It becomes a skill and they develop that. I mean, this book, you should have Tom O’Neill as a guest, the book Chaos, about Manson. He uncovered information that these guys, Jolyon West and Greenberg were in communication with each other, talking about creating hypnotized people and traumatizing them all the way back in the 50s and 60s. And they had the lie about these techniques and say, it’s not possible because that was the cover on the truth that they could literally hypnotize people through traumatization and stuff like that. If you look at Sirhan Sirhan, I’ve talked to authors about that. He disappeared for two weeks. They don’t even know where it was. California was really crazy in the 60s. Holy smokes. Anyway, that’s off topic. But it kind of is this technique you’re talking about. Some of these wizards, materialists, like Jolyon West who had his son kill him and his wife in a fricking assisted suicide, which is super dark. Alex Tsakiris: [01:19:28] Okay. I was going to try and wrap it up, but you’ve kind of opened something. So I want you to close that door because it brings it around full circle. You’re talking about it and I love that you’re just kind of, just the facts ma’am, but connect that. What does that mean on a political level, when you talk about local politics or national politics or geopolitically? What does that mean? We are part of that, right? We live here. How do you process that? William Ramsey: [01:20:01] It’s terrifying. Well, it’s terrifying, like this book, The Shock Doctrine, they think that these political leaders, all the way back to the overthrow of Allende, duly elected guy in Chile, or Pinochet, that they have learned this technique of how to terrify a populace where you don’t even have to use force because the psychological traumatization is so strong that people will be terrified to do anything. And so I think that that is a horrible conclusion. Just the implication of that and the conclusion of that happening in other countries, and possibly even here. If you read My War by Vallely and Michael Aquino, don’t be surprised if these guys are using that on you. I mean, that’s what’s really scary, is these techniques, they know it. Alex Tsakiris: [01:20:57] I’ve avoided in all my shows, even talking about COVID, never brought it up. But the trauma part is just unavoidable. When you start putting together these cases and you’re talking about Chile, you know, and let’s get everyone in the soccer stadium and turn on the lights and keep them there for two days. And then let’s just take two of them out and shoot them. That’s all we have to do, is just kill two of them and bring back the bodies. And now everyone can go home. That’s it. William Ramsey: [01:21:29] In that whole overthrow they only killed 3,000 people considering was a huge country. It’s a tragedy, but to pacify the entire country, it’s not that many people dead. Alex Tsakiris: [01:21:42] So William, it’s been just awesome having you on, especially this end part. I hope people can get an appreciation for just gosh, the depth of knowledge. And I almost feel like maybe we didn’t… I pulled around in too many of the wrong places, but I couldn’t help it because you just know so much. And I wanted to pick and poke at so many different things. Tell folks how they can stay on top of this work, where they can find where you’re going and keep up with your shows and keep up with your books. And maybe what’s on the horizon coming up. William Ramsey: [01:22:11] Well, I’ve been doing documentaries recently, so my documentaries can be found on Vimeo under William Ramsey. I have five documentaries there. And then I kind of do a podcast, William Ramsey Investigates, which you can get on iTunes or Spreaker or anything like that. I have a lot of old research into the West Memphis Three on my YouTube channel, which I’m trying to kind of just morph away from or use less. But there are old videos there if you want to see my research going back with all these other characters at William Ramsey Investigates. And I have three books that I wrote about these different subjects, which you can find on Amazon, or my website is williamramseyinvestigates.com, if you want signed copies Alex Tsakiris: [01:22:52] And William Ramsey Investigates, I just want to tell people again. It’s up to date stuff. We’ve just been kind of in this one little lane, but you’re talking to all sorts of different interesting people and really digging in, in that kind of attorney style, get to the facts, kind of thing. So who were some of the guests that you’ve had on recently that you were really excited to interview and who were some of the people you have coming up? William Ramsey: [01:23:15] Well, just like I talked to you, I talked to Tom O’Neill about his book Chaos. I highly recommend that book. If you want to talk about a huge I talked to a really good book about, uh, the liberal, if you want to talk about a huge PSYOP, it’s the Symbionese Liberation Army, the book is Revolution’s End by Schreiber. I highly recommend that book because it was just one tiny little piece of this operation Chaos, where a fake leftist organization, in my opinion and I think the author’s opinion as well, was created to subvert the left. And there was the Symbionese Liberation Army, and this guy Cinque. And I would highly recommend that book because it’ll twist your ideas about how some of these… Alex Tsakiris: [01:24:00] I would highly recommend that interview you did. That was a great interview. William Ramsey: [01:24:02] Oh really good. Brad Schreiber is his name, highly recommended, a great writer. And then Lise Pease about RFK and Sirhan Sirhan, about political assassination. So, you know, I’m really definitely interested in parapolitics. And I think that those books all back up their premises and their positions. I think that Sirhan Sirhan was a patsy and something was going on with him. He was a subject of something, really creepy. Those are just some examples. I think I’ve been very fortunate to get really good authors. I do read the books, so I definitely try to be an informed interviewer and not try to give anything away, just focus on the context of the book and let people make their argument or why they have this position. I’m done with political parties, so I don’t really have a partisan axe to grind and I think that benefits talking to people. So I think in that regard I’m pleased with some of the interviews I’ve done recently, for sure. Alex Tsakiris: [01:25:21] Well, fantastic. It’s been absolutely great heavy on, and I hope people do check out William Ramsey Investigates. So thanks again. William Ramsey: [01:25:29] Well, it’s great to talk with you man. It’s really good to be with somebody as well informed as you. So it’s been a delight for me. Thanks again, William Ramsey for joining me today on Skeptiko. He is quite impressive, in terms of his knowledge of this topic and his ability to dive deep with all the legal stuff. So it was really great having him on. The one question I tee up from this interview is, where do you come down on Damien Echols and the West Memphis Three with regard particularly to satanic panic? Is he the poster boy he’s made out to be for satanic panic, or was there enough satanic stuff going on in and around his life? You know, I’d even bring up the thing with his mother. His mother gave birth to him when she was like 15 years old and it’s just such dysfunctional. You cannot go through this and not feel sorry for this kid, Damien Echols, even though he did what he did. But his mother, his mother is into all of this stuff and gets him into all of this satanic stuff, and that’s all washed away and obscured in this ocean of, “Oh, it’s all satanic panic, witch hunt, craziness.” Which it’s not in my opinion, but what’s your opinion, this is supposed to e a question, so let me tee it up as a question. What do you think, satanic panic? Yes or no? I realize it’s going to be kind of hard to answer that one since I came down pretty strong on it, but it’s kind of a hot button issue for me. Do let me know what you think. Stay with me for all of these future shows coming up, I’ve got a bunch of them, I don’t know how I’m going to get them all out, but they’re coming. Until next time, take care and bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Joseph Atwill, Why the Bible is Pro-Roman |464| - Skeptiko - Science at the Tipping Point", "description": "Joseph Atwill’s insights about the relationship between power and religion seem more relevant than ever. photo by: Skeptiko [Clip 00:00:00 – 00:00:31] That’s a clip from Gladiator, and although the movie is fiction, people who really know Roman history, like today’s guest Joseph Atwill, will tell you that the movie is spot on when it […]", "url": "https://skeptiko.com/joseph-atwill-why-the-bible-is-pro-roman-464/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2020-09-22T15:00:47+00:00", "article:modified_time": "2020-09-22T15:09:54+00:00", "image": "https://skeptiko.com/wp-content/uploads/2020/09/skeptiko-464-joseph-atwill.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Joseph Atwill, Why the Bible is Pro-Roman |464|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/zn_RltDvtQk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/zn_RltDvtQk?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://flic.kr/p/zXGAP1", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-464-joseph-atwill.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-464-joseph-atwill.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-464-joseph-atwill.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/joseph-atwill-why-the-bible-is-pro-roman-464.4571/", "http://www.caesarsmessiah.com/", "http://www.skeptiko-forum.com/threads/joseph-atwill-why-the-bible-is-pro-roman-464.4571/", "http://www.skeptiko-forum.com/threads/joseph-atwill-why-the-bible-is-pro-roman-464.4571/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2020-09-22T15:00:47+00:00"}