{"result_id": "273041", "URL": "https://skeptiko.com/david-icke-love-not-fear-is-the-answer-460/", "timestamp": "2023-04-25 17:09:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/david-icke-love-not-fear-is-the-answer-460/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "David Icke, Love Not Fear is The Answer |460|", "cleaned_text": "David Icke was recently banned from Youtube for advocating free thought, free speech and non-violent resistance, but does his science hold?\n\n[Clip 00:00:00 – 00:00:35] Let them shake their group think heads at you, let them be ashamed of you, embarrassed of you, pissed off at you. They will call you names, and you must let them let them. Let them jeer, let them point, let them laugh. Be resistant to their mockery, be the fodder for their jokes, be a magnificent failure in their eyes. A tiger does not lose sleep over the opinion of sheep. Go ahead. Be the scar tissue of their worldview, their normality. They will loath you. They will fear you. They’ll wish they were you.\n\nThat’s David Icke speaking to a huge crowd that gathered to see him at Wembley Arena. That is before he was banned from YouTube and Facebook for advocating non-violence, freedom of speech, free thought and love your neighbor.\n\nHere he is in today’s interview on Skeptiko talking about science and consciousness.\n\nAlex Tsakiris: [00:01:02] You were one of the first people to blow the whistle on this fake scientific understanding of consciousness and its insistence that we are biological robots in a meaningless universe, and we should accept our empty lives and just get on with it.\n\nDavid Icke: [00:01:20] What you’ve just described is the foundation to mass human control, without which mass human control cannot happen. Because if you know that you are, in your true eye, an expression of consciousness, a point of attention within an infinite flow of consciousness, then there’s no way that a handful of psychopaths and idiots, which is basically the combination that runs the world, can impose themselves on your life, in the way that you will acquiesce to whatever they tell you. You won’t do it because you know you are consciousness, you know you are an infinite expression of consciousness and that will never allow itself to be subjugated and intimidated into submission.\n\nAlex Tsakiris: [00:01:02] You were one of the first people to really blow the whistle on this fake scientific understanding of consciousness and its insistence that we are biological robots in a meaningless universe, and we should accept our empty lives and just get on with it.\n\nDavid Icke: [00:01:20] What you’ve just described is the foundation to mass human control, without which mass human control cannot happen. Because if you know that you are, in your true eye, an expression of consciousness, a point of attention within an infinite flow of consciousness, then there’s no way that a handful of psychopaths and idiots, which is basically the combination that runs the world, can impose themselves on your life, in the way that you will acquiesce to whatever they tell you. You won’t do it because you know you are consciousness, you know you are an infinite expression of consciousness and that will never allow itself to be subjugated and intimidated into submission.\n\nAlex Tsakiris: [00:02:13] Welcome to Skeptiko where we explore controversial science and spirituality with leading researchers, thinkers and their critics. I’m your host Alex Tsakiris, and every year Time Magazine publishes a list of the world’s 100 most influential people. Of course, it’s Time Magazine, so it’s a farce, but the professed criteria that the editors use is actually quite beautiful. Here’s what they write.\n\nThey claim to look for people that in one way or another embody a breakthrough, they broke the rules, broke the record, broke the silence, broke the boundaries to reveal what we are capable of.\n\nBoy oh boy, today’s guest, David Icke, although he’s never appeared on the Times list of the world’s most of 100 influential people, based on those criteria he certainly should be, he should be one of those people that year after year is on that list. When you look at the amazing achievements of David Icke, over his 30-year career, he would certainly fit those criteria.\n\nBut instead, we’re faced with an Orwellian banning on YouTube and Facebook, but the deep admiration, appreciation, respect of all of us who’ve benefited so much from truly one of the bravest thinkers of our time. David has a very important new book out called The Answer, we’re going to dive into that and hopefully talk about some other things.\n\nIt’s just a real pleasure to have you on David, welcome and thanks for being here.\n\nDavid Icke: [00:03:56] Thank you, Alex. I’ve got a black shirt on today for one reason. I’m not in mourning, it’s the only color that won’t show me pouring the sweats out, because we’re going through a real heatwave in Britain at the moment and my lighting system is the window. So, it’s hot in here.\n\nAlex Tsakiris: [00:04:31] Hey David, you’re rolling out this new book, there’s a ton of buzz about it. It couldn’t have been a prophecy, I don’t know how you did it, but tell people about The Answer, what you’re trying to get across and what’s it about.\n\nDavid Icke: [00:04:45] Well, you talk about prophecy, but the synchronicity has been remarkable, because I started writing The Answer in October 2019, and we came up with the title, The Answer, because that’s basically what the whole book’s about, and we decided a publication date, which is now. Then I wrote 85% of the book and I was just rounding off the end and bang then came the pandemic hoax, as I show in the book, totally a hoax. And I watched, over the months that have followed, the first 85% of the book where I said, this is what the plan is, this is where they want to take humanity, unfold before my eyes.\n\nAnd that period also gave me the opportunity to take apart the official “virus narrative”, which if people are prepared to do their own research and talk to doctors and biologists and other medical professionals who would never get on CNN or MSNBC or the BBC, they would realize, that narrative coming out to the World Health Organization and being defended by Silicon Valley and the mainstream media, is so nonsensical. It’s so unsupportable by the facts, and this is the point of the censorship, that the only way you can protect it from being dismantled is by censoring those who are seeking to do that.\n\nSo this is where the censorship, this theory of censorship through Silicon Valley and the mainstream media has come from, particularly Silicon Valley these days. It’s not primarily being done, because, “Oh, look at the power we have, we are going to censor,” they’ve got no choice, they have no choice but to sensor, because unless they do their official narrative will be in pieces on the floor.\n\nAlex Tsakiris: [00:07:03] Can I ask you a couple of questions here? Because man, I am so with you, in terms of what you’ve revealed and what you’ve told us about the plandemic and how it fits into this overall plan. And you know, you talk about prophetic, it’s unbelievable. I listened to an interview you gave in 2007, when the swine flu came out, and it’s like you’re listening to the interview today. So many important, step by step, how they’re going to run it, how they’re going to do it. And let’s just give credit to Nicole Marie from the News for the Soul show. If anyone wants to check out that interview, they should.\n\nBut here’s the thing, here’s what concerns gives me a little bit. David, I’ve done a ton of debunking of fake science on the show.\n\nAlex Tsakiris: [00:07:51] I’ve been at it for 10 years. You’ve been at it for a hell of a lot longer because you just do this stuff and I don’t know how you keep your energy up and your work up. But to me, and I hesitate to even say this, because in some ways this isn’t even central to your thing, but let’s get down to specifics. When you say that they’ve never isolated the virus, I want to know what you really mean. Because when I look at the science behind it, I think they’ve isolated the virus. I don’t think that’s the deal. I think the deal is, whether they engineered the virus in the first place and whether they already engineered the vaccine to it. Which you revealed in that 2007 interview that Baxter Labs in the prior case.\n\nI’m sorry, go ahead, please tell me what you think.\n\nDavid Icke: [00:08:40] Well, two things. On the second point we agree. They have already, and I said this in an interview way back, even before the lockdown kicked in, that the contents of the vaccine, the Gates vaccine will already be in place because they’re playing the hoax in part to get the vaccine inside every man, woman, and child on the planet. People’s alarm bells should go off with that immediately.\n\nBut on the other side, there is not a scientific paper, or a scientific study that has been revealed, and I’ve been saying this and people like Dr. Andrew Kaufman in America and others have been saying this for months now, that isolates the virus only in and of itself with no other contamination whatsoever. We’ve now reached the point where people are doing freedom of information act requests, asking for government agencies to reveal any papers that do that, and they can’t.\n\nAlex Tsakiris: [00:10:05] Look, I think that’s not even central to the most important part of what you’re revealing, but like here’s a paper in Nature. When I look at fake science, they don’t rollout fake science in Nature, usually, because there are real labs, there are real people involved. But here’s where they lay out exactly the…\n\nDavid Icke: [00:10:25] Yeah, so they say. What I would say to people is to go to the videos of, of Dr. Andrew Kaufman who’s been on this from the start and also look at those websites that have gone to the studies themselves, they’ve gone to the scientists themselves and they’ve asked the question, “Did you purify this virus?” And the answer is always no. And without that you cannot say that you had a virus, you have a virus, you’ve shown that virus exists.\n\nAnd the other thing is, if you have a real virus and you have a virus that is “deadly” and you have a virus that is very a sinister in terms of human health, then what you don’t have to do is tell doctors to put COVID-19 on death certificates all over the world when people have died of other things, and you don’t have to invoke financial incentives in America to get hospitals to diagnose respiratory symptoms as COVID-19 and not something else.\n\nWhat we also have is the RT-PCR test, which is not testing for a virus. When you’ve got people like Kary Mullis who invented the thing and got the Nobel Prize for it, saying that this test should not be used to diagnose infectious disease, and that’s where the cases are coming from. If people read The Answer and the two chapters I’ve done on this, like I say, quoting doctors, biologists, medical professionals, etc. who you’ll never see in the mainstream media, they’ll see the scale of the scam that’s gone on.\n\nAlex Tsakiris: [00:12:40] David, I don’t want to get too far in the weeds on this because the overall picture that you’re painting, in terms of the ability to shift the numbers, shift the deaths, shift the testing, all that stuff. I’m totally down with that. All the research I’ve done confirms that. I just want to know if you’re open to the possibility that, you know, you mentioned the postulate that we can isolate the virus and test the virus, and are you open to the possibility that they have done that, just like they did it with the SARS virus? But virologists, this is what they do all day long. They do it for chickens, they do it for cows, they do it for pigs, and they also do it for human beings. They isolate viruses, they culture them in labs and stuff.\n\nDavid Icke: [00:13:25] First of all, we can go to and fro on this forever. People should read The Answer and look at the evidence put forward there, which is immense. They should go to the videos of Dr. Andrew Kaufman and they should look at other people who are challenging this and you’ll see how they explain away this claim to have been isolated.\n\nI mean, if you’re going back ,as many, many people have now, to the original scientists who claim to have isolated and purified the virus, and you’re going to those that have produced these papers, and you’re asking them a simple question, “Were you dealing with a purified isolated virus?” and they say no. Well, I mean, where do you go from there?\n\nAlex Tsakiris: [00:14:15] I hear you. And I don’t want to hammer it out anymore, like you said, go to The Answer, read the book, there’s tons of stuff on your website as well, it’s great.\n\nYour time is limited. You are the man on consciousness, that’s been the main focus of this show. Hundreds of interviews with some of the leading consciousness researchers on the frontier of that technology or that science I should say, but you take it at such a deeper level and you connect it in some really important ways that I think are central to, if you will, ‘the answer’ through all of this.\n\nBut where I wanted to start on the consciousness question is you really, truly were one of the first people to really blow the whistle on this fake scientific understanding of consciousness and its insistence that we are biological robots in a meaningless universe, and we should accept our empty lives and just get on with it. And I think that is one of the central, central conspiracies to this whole thing, and you’ve completely deconstructed that and destroyed that from the very beginning.\n\nDo you want to talk about science’s claim that you are nothing, you are a meaningless robot in a meaningless universe, and how that fits into the overall plan, the overall agenda?\n\nDavid Icke: [00:15:34] Well, two things. First of all, if we’re talking about COVID-19, I think there is a virus, but it’s not a physical virus, it’s a mind virus, a mind perceptual virus, and it’s taken over vast swathes of the human race. And that’s what’s driving this thing.\n\nAnd on the other side what you’ve just described is the foundation to mass human control, without which mass human control cannot happen. Because if you know that you are, in your true eye, an expression of consciousness, a point of attention within an infinite flow of consciousness, and that your point of attention can be the size of a pea or it can be infinite, it’s just how open and what level of consciousness you want to choose to allow in, then there’s no way that a handful of psychopaths and idiots, which is basically the combination that runs the world, can impose themselves on your life, in the way that you will acquiesce to whatever they tell you. You won’t do it because you know you are consciousness, you know you are an infinite expression of consciousness and that will never allow itself to be subjugated and intimidated into submission by the said psychopaths and idiots.\n\nSo what you have to do, if you want mass control, this has been going on for a long time, you have to isolate, what I call in The Answer five-sense mind, mind from the infinite level of consciousness. So five-sense mind should be an expression of a greater self. But once you isolate that into what I symbolize in the book as a bubble, if you can isolate five-sense mind in this symbolic bubble, and then within the bubble feed that isolated mind a sense of reality by controlling the education system, all the way through the formative years, by controlling the mainstream media, the Silicon Valley media and so on, then you can first of all isolate mind from expanded consciousness and then you can program that isolated mind with a sense of reality. Which is all about little me, it’s all about self-identification with labels, what I call I am/are, I am/are man, I am/are woman, I am/are black, I am/are white, I am this sexuality, I am/are that sexuality. And what you’re doing is you’re creating what I call a phantom self where you are manipulating five-sense mind to perceive its true eye as what it is experiencing. Because all of those labels I’ve just reeled off, I’m not who we are, they’re what who are is experiencing. And once you lose the understanding of that, now you are at the mercy of those that control the information in society.\n\nAnd we talk about being in the information age and who controls information runs everything, well there’s a simple reason for that. Because from information received comes perceptions formed and from perceptions formed comes behavior played out. So controlling information overwhelmingly manipulates perception, which then leads to behavior. You control information, you control behavior.\n\nAlex Tsakiris: [00:19:29] David, can you add, because I’ve heard you talk about this before and it’s been a hot button for me, can you speak more about how science in particular, as we’ve come to understand it, psychology, biology, neurology, how all that has been wrapped up in what you call this five-senses kind of bubble and isolated? And this idea that never will extend beyond that ,will never consider the kind of extended consciousness experiences that you had, that were so transformative to you, that thousands, and now millions of people have had and said, “Hey, I had this near-death experience, or I had this out-of-body experience, this shamanic experience, and it totally transformed me.” And then we have science as an institution saying, “No, that just never happened. It’s impossible because you are merely your brain.”\n\nDavid Icke: [00:20:20] Yeah. Well, if you chart back into the ancient world, you had a widespread perception that we are consciousness. You know, different names, different, descriptions to an extent, but basically there was a widespread belief that we are consciousness and that there are other worlds, there isn’t an infinite experience.\n\nBut like I said earlier, if you have people in that self-identity, they become a nightmare to control. So what happened is the global cult, as I call it, I explain what that is in The Answer, created mainstream science, as it created mainstream medicine through the Rockefeller family. And the foundation of cult science, shall we say, is basically, can I see it, touch it, taste it, hear it? Okay, it exists then. And if I can’t then it probably doesn’t. And what I’ve just described is exactly what I described a few minutes ago about the five-sense mind.\n\nScience itself is an institutional expression of the five-sense mind and if therefore your only tool is a hammer, every situation looks like a nail, and that’s what has happened with mainstream science. But there’s also, talking of the hammer, the way these institutions are policed, the way the medical profession with regard to this “virus” is being policed now, I can tell you, I’ve talked to enough of them, is by the carrot and the stick. That is, if you parrot the official narrative, then you’ll get letters after your name, you’ll get fated, your peers are in awe of you, and you will become a celebrated scientist, or at least you’ll survive in the scientific profession. But as we’ve seen for so long, if you are a maverick, and what is a maverick? It’s someone that wants to think outside of the box and go into places that the institutions don’t want you to go because if you do you might find something out that they don’t want people to know.\n\nSo you have this self-policing mechanism whereby you benefit, if you sing from the song sheet, and you take the consequences if you don’t. Try getting funding if you’re challenging human caused climate change. Try getting funding if you are singing from the song sheet, no problem, easy. So this is how it’s self-policing.\n\nSo there’s a reason for that, and the reason is science in its true nature, in its true expression, which is the unbridled pursuit of knowledge, would come across this stuff. I mean, you go into the quantum physics realm, they’re already well along that road. You even see that, you see where the quantum disciplines of science has gone and you see much of the rest of science, they have to acknowledge that yes, quantum physics exists, they can’t ignore that, but they crack on with their own disciplines as if there is no quantum physics.\n\nAlex Tsakiris: [00:24:17] Well, it’s shut up and calculate, you know, it’s shut up about the philosophical implications and calculate.\n\nHey, can I shift gears though because there are so many topics I want to talk about? You just mentioned the cult of science and everything you said there I thought was just so beautiful, and there are so many subtleties there that I hope people can pull out of that. But the cult word is such an important word.\n\nA couple of years ago you wrote a very important book, The Trigger, that not only provided probably the most complete breakdown of the 9-11 act as part of this control process. But you also connected it to a deeper cultish connection of the Sabbatian-Frankist Death Cult and this idea that if we can’t all be saints then let’s all be sinners, which was the go-to ideology of the Sabbatian-Frankists.\n\nCan you review that for us and connect it to what you’re talking about in The Answer because I think people really struggle? What you do that no one else does, is you connect all of these dots. So you just kind of lay it out on the science side and now you’re going to talk about the cultish Death Cult and its connection to religion, which is the twin pairing of that. And then hopefully we’ll be able to get to the ET and the UFO phenomena, which everybody always wants stovepipe this stuff and treat them like they’re separate, and you’re the only guy who can kind of do full spectrum.\n\nBut talk for a minute about that, that Sabbatian-Frankist Death Cult transgression, do the opposite of what the right thing in your heart is to do, has been this ongoing recurring theme of these folks.\n\nDavid Icke: [00:26:08] Well, I do talk about the Sabbatian-Frankist cult in The Answer and weave it in with current events as well as much else. But to break this down into a simple explanation. I’ve been writing for a long time, decades really, in different books at different times about what I call a mind virus. And when I say mind virus, and I’ve mentioned it already in our chat, I’m not talking about the kind of virus that people say is a physical virus, I’m talking about a computer virus, or the equivalent of a computer virus. And it basically works in the human mind in the same way that a computer virus works.\n\nSo if you think of a computer, that’s the five-sense mind, and then you’ve got the person on the keyboard with the mouse, that’s expanded consciousness. Now, when there’s a virus that takes over the computer, if it’s bad enough, the person on the keyboard and the mouse is banging away and the computer is not reacting. It’s now gone its own way, something else has taken over. And I say, and I’ve been saying for a long, long, long, long time, that there is a consciousness that is in a very distorted state, and that distortion makes it malevolent in its intent, which attaches to the human mind. Particularly because it’s of a frequency in of itself and not a high frequency either, if you get pulled into low vibrational emotional states, like depression and anxiety and fear and resentment, hatred, all of these low vibrational emotion, then you are basically moving your frequency state into its stadium. Drug taking and things like that can pull you into its stadium.\n\nWhat I was reading the other day and I’ve just got a book which I’m quite a way into already, was the native American concept of what they call a wetiko. Which in the way it’s described, and many, many different native American groups have different names, but wetiko is one of them. What they’re describing is what I’ve been describing in my books over the years as an equivalent to a computer virus.\n\nSo if you take that symbolism of the computer and the guy at the keyboard, the guy at the keyboard being the symbolic of expanded consciousness, what this mind virus does is get into that gap, for want of a word, between the five-sense mind and expanded awareness and it can isolate you in these bubbles that I’m talking about. And the whole thing takes place in the subconscious mind. This mind virus operates in the subconscious mind. The conscious mind believes it’s making its own decisions and coming to its own conclusions and perceptions, but actually they’re being fed out of the subconscious mind.\n\nAnd I have seen this such a tremendous amount in the last few months, where I’ve seen people who have concluded their perceptions of this “virus” situation and what should happen and all the rest of it, and, “These are my opinions, this is what I think,” and then you listen to them and they’re simply repeating the official narrative at which they’ve taken to be their own perception.\n\nAnd one of the concepts of wetiko is that it’s a mind blindness which convinces the conscious mind that it’s not blind, thus people are operating in a state of mind blindness while thinking they’re not,. And it works in the subconscious in a very similar way to subliminal inserts in advertisements, whereby the conscious mind looks at an advertisement and there’s a subliminal insert there, subliminal, below threshold, below the threshold of the conscious mind, but it won’t see it. But once someone points out the subliminal insert, and I’ve experienced this, it absolutely happens, from that moment on the conscious mind, every time it looks at that advert, the first thing it will see will be the subliminal insert.\n\nAnd one of the concepts of wetiko is that when the conscious mind becomes aware of this mind virus, when it becomes aware of its influence, then its influence wanes and goes. And for me, a quick way to bypass this mind virus, which goes under endless different names in endless different cultures, it’s the same concept, is basically a simple re-designation, re-evaluation of self-identity, because while we are self-identifying with our labels, what are we self-identifying with? With five-sense concepts, and thus we’re pulled into the five-sense realm by our perception of that being the eye. But when you re-evaluate your self-identity, from I am my labels, to I am the consciousness having the experience called the labels, then immediately your perception of self expands, you’re no longer Ethel on the checkout or Bill at the call center, that’s an experience. You are the consciousness, ultimately infinite in nature that is having that experience. And as you expand your self-identity, you expand your consciousness, your consciousness moves into higher frequencies of resonance and you are leaving the realm of wetiko, the mind virus, the mind blindness.\n\nAlex Tsakiris: [00:33:01] Look, that is outstanding, and I want every bit of that in there. But I also want to return you, because there’s like a number of different plays in the playbook right? So the wetiko is one, the mind virus is one, but I really think what you tuned into with this Sabbatian-Frankist cult of evil, which is only available to us because of the cult of religion. So we take a cult like the Jewish cult, just like the Christian cult, just like all religions, our true relationship to the larger consciousness in order to kind of create these control mechanisms. That’s what religions do. It doesn’t mean that some spirituality can’t come through them.\n\nBut what I think is particularly important that you point out is this idea of transgression, the idea of redemption through sin, the idea that it’s best to do the worst. So it’s almost like a different mind virus that gets played out.\n\nBut what I thought you did such a beautiful job of explaining is, I think a lot of people have trouble understanding how these folks could do such horrible, horrible things. And I think you really tuned into it there, is that they are raising that horror to something that they celebrate as being their highest form of their spiritual expression. And as twisted as that might be, they’ve made that their religion. Do you have any thoughts on any of it?\n\nDavid Icke: [00:34:42] Well, I was just going to complete the sequence of what I was talking about, which was going to bring me into Sabbatian-Frankism, it was going to bring me into this global death cult that I expose in The Answer. Because having described wetiko, this deeply imbalanced, deeply distorted state of consciousness, what this death cult is, whether it’s the Sabbatian-Frankist part of it, or whether it’s other expressions and the global cult as a whole, it is a completely wetiko controlled state of mind, state of consciousness, state of perception.\n\nSo when you look at Sabbatian-Frankism for instance, one of the things it does is invert everything. And what is this distortion, this distorted consciousness that the native Americans call wetiko, I call the mind virus, it is a distortion of balanced love-based reality. And you know, if you look through history, wherever you go, whether it’s a religion or whether it’s a native, kind of culture, you have this constant theme of good versus evil and all that stuff. And I would suggest this comes from this distorted consciousness that seeks to manipulate and assimilate other consciousness into itself, and that which is love, that which is balance, that which is harmony, etc.\n\nSo you have this mind virus, but this cult is its human expression, because their whole perception and behavior is based on its distortion. This is why this death cult is connected, and I had connected it so many times to Satanism, to pedophilia, to the banking system crushing human lives, all of these things that I’ve gone on. All the things that we’d rather like the world to be rid of, including current events I would strongly suggest, are actually expressions through this cult of this mind virus. And it’s seeking to manipulate the general population into these low states of emotional frequency.\n\nI mean, look around Alex, at current events. What level of anxiety and fear is coming off people? Increasingly I see what level of hatred is coming off people. All these divisions in society. This is classic expressions of this mind virus and this cult, which in its physical human form, is structuring and manipulating human society to generate these low vibrational emotions. So what does that do? It starts to make a vibrational fusion between this distortion and the increasingly distorted human perceptual states caused by the way that society is manipulated.\n\nSo the answer is not to find a solution, it’s to go the other way, to stop getting pulled into these low vibrational emotions because again, you go back to the wetiko concept, the native Americans and others who have different names for the same concept, talk about the fact, I’ve mentioned it already, that once you identify its influence upon you with the conscious mind, it loses its power. And when you read articles by psychologists and you see various studies that have been done, they estimate that 95% of human action, which is usually reaction, is subconscious in nature, you can see that actually the conscious mind becomes a spectator to the subconscious mind, and it’s in the subconscious that this mind virus operates and thus is hidden from the conscious mind. But when it ceases to be hidden, then it loses its power.\n\nAlex Tsakiris: [00:39:55] David, what is part of your daily process, your practice to return to that larger consciousness?\n\nDavid Icke: [00:40:02] I don’t do anything. I don’t do anything, except one thing. I always do what I know to be right. What I feel to be right. So, for instance, if I feel, I know, not least through endless scientific studies, but wearing a mask is A, bad for your health and B, it is actually not about health at all, the masks, it’s about subjugation, it’s about submission, it’s about a symbol of submission. If I believe that, and I do, if I know that to be right here, then I’m not going to wear a mask and whatever the consequences are of that, well, they’ll have to take their course, because I’m doing what I know to be right.\n\nIf you’re in a state where you feel that, but what are the consequences for me? Then wetiko has got you.\n\nDavid Icke: [00:41:12] It’s heart. When you open your heart, the love of pure attraction, which is associated with, again, the distortion of what love is. What we call love is innate intelligence. Why? Because it’s a massive connection to expanded awareness, which is why this cult wants to shut the heart down. My heart aches. My heart is broken. Look at all the associations of heart to states of human perception and states of human emotion. It’s not just attraction, it’s innate intelligence. And something else, it is without that which enslaves humanity more than anything else. It is without fear. Because this knows, it doesn’t think, it knows that we are an expression of infinite awareness that is on an infinite journey of explanation, of forever, forever. So what is there to fear from that state of self?\n\nI wrote to somebody today, I said, life starts when fear of death ends. It’s one of the great, if not the greatest fears, fear of the unknown, which it’s an expression of. And so, this does what it knows to be right. So if you open your heart, first of all, it takes you beyond the wetiko frequency, wetiko can’t influence that. It could close the heart and close this heart vortex, but it can’t influence what this heart vortex in an open state is connecting with because it’s out of its frequency range. And if you are without fear, then you are without intimidation. And without intimidation, the few cannot possibly control the many.\n\nOne of the things Alex that’s come out of this is putting to bed, at least in a vast number of new people, the idea that I’ve been told again and again in the last 30 years, a few people can’t control the world, but they can, because you’ve just watched it happen. You’ve just watched billions under house arrest because a tiny few people said that it should happen. Now, how does that happen? It happens because those who are told to submit to it, acquiesced to it. It’s a whole sequence of imposition by the few, acquiesce by the many. Imposition by the few, acquiescence by the many.\n\nNow, when this opens, when you connect with that, what we call love, but that’s been so discredited in its real meaning, we have to use things like unconditional love or infinite love to try to get anywhere near it, once that happens, you’re not in fear, thus you’re not intimidated, thus you will always do what you know to be right. And if enough people did that, then it would be game over, because the few can only control the many if the many acquiesce to it.\n\nAlex Tsakiris: [00:44:48] David, you gave me chills. I mean, you literally give me chills. That’s so eloquent. And now we understand why you fill up Wembley stadium, why you fill up, when you’re allowed to travel and be in other countries, why you speak to thousands and thousands of people, unprecedented really for, for someone in the lane that you’re riding in to do that.\n\nBut I want to return to a question I asked kind of at the beginning, because I think it’s also something that people struggle with, people who are spiritually minded struggle with, and that is the action versus being part. Like, I need to just be my spiritual self and evolve my spiritual self, versus I need to, to take action. And sometimes that action might be in conflict ultimately with someone else, even if don’t seek that out. How do you balance that, action versus being, the doing versus being part? You get what I’m saying, in terms of those are common terms, common questions inside spiritual communities.\n\nDavid Icke: [00:45:55] But your being becomes your doing. Your doing is an expression of your being. I do find Alex, and I’ve been on this journey a long time and I’ve seen a lot of things and met a lot of people. The height of what was called the new age movement, I met some lovely people, but I saw an enormous amount of denial and escapism masquerading as spirituality, whereby, “I’m just working on my being,” and that being an excuse not to express a doing, because you’d rather not face the consequences of doing it.\n\nWhen I started going around America in the early 1990s or mid-1990s, I was invited to speak here and there at those big whole live expos they used to have. I think there’s one out of Los Angeles, one out San Francisco, and I would be the strange conspiracy guy at 10 o’clock at night when everyone had gone home. And they used to say, “But what you’re saying is negative,” well, two things to that. They always used to say, “You’re getting people to go into fear.” Well, two things, well a number of things, never mind two. One, if you are spiritually open, as you say you are, so why are you talking about fear? Fear should not be affecting you if you’re really connected.\n\nAnd this is the other point. I used to hear them say, “People have to wake up.” Yes, but in that case wouldn’t it be a good idea to address what is keeping them asleep? Because if you read my books Alex, I never cover in a book the names, dates, places, nature of the conspiracy without going into the spiritual nature of reality, because the two are not apart from each other, they are expressions of each other. And I don’t think, myself, that we come into this reality as it is to then try to convince ourselves that we haven’t, and therefore we don’t have to go into areas that we’d rather not go into. True spirituality, the great spiritual people of history were not necessarily and overwhelmingly were not those who went to church, they weren’t those who ran some coven or cult, they were the ones that actually said, “This is not right and I am going to do what I can to make a difference about it.” They didn’t call themselves spiritual, they didn’t call themselves religious, they just did what they knew to be right, and they’re the people that changed things because they faced head on what needs changing, rather than trying to find an excuse not to go there.\n\nI’ll give you an example, just a quick one. There’s someone in Britain who claims to be part of the alternative media, but when the masks came in for mandatory masks in shops, they said that they had made a decision that they were going to wear a mask in shops because they said they didn’t want old people to feel unsafe. So you’re listening to that and you’re saying, “Let me just translate that. You want an excuse not to disobey authority, that’s what you want, so you’ve come up with that.” And this is what I mean about finding an excuse not to do what you know to be right. And for me, once you do this everything changes, everything changes. Not least because as this takes you out there to levels of perception, levels of insight, levels of awareness that are not within this bubble, but are well beyond the bubble, you can observe this reality from outside this reality. So instead of within the bubble, everything’s random dots, what’s going on? You see the picture when you go into this expanded state of awareness.\n\nI’m not sitting on a mountain like the Buddha saying, “Look, I’ve found enlightenment,” this is our natural state.\n\nAlex Tsakiris: [00:51:16] Is it okay for the Buddha to sit on the mountain? Is it okay for that Yogi to sit in the caves in the Himalayas, is he may be doing his right action? Because I love what you’re saying. You’re so totally congruent in what you’re saying. Can people express that differently or is non-action always an excuse?\n\nDavid Icke: [00:51:36] But of course they can. But then again, when you take the story of the Buddha, it wasn’t about non-action, sharing knowledge is not non-action. Action doesn’t have to mean that you grab a poster and go out on the street. In fact, I think that’s a waste of effort in so many ways. It’s my view, I can only come from where I’m coming from, other people have a different view and they’re entitled to, they have a right to. But I see people going out on protests… I’ll give you an example.\n\nWe had a protest in Britain against the government, against the establishment, right? It was basically an antiestablishment protest, but everyone was wearing a mask or vast numbers were wearing a mask. So you’re going on a protest against the establishment, and you’re wearing a mask, why? Well, because they told us.” “Okay, so how does that work out? You go out and you protest, okay, you’ve protested, and it makes you feel good, okay, there’s no problem with that, but then what? Or, “We’re going to fight the enemy, oh yeah, we’re going to fight the enemy, we’re going to stockpile weapons, we’re going to fight them.” And yet none of that is necessary. All that is necessary is, I’m going to do what I know to be right.\n\nAnd different people will come to different conclusions, but you’re doing what you know to be right and therefore you’re not just in that perceptual state, you are going to express it. It’s not just a being, it’s a doing. Therefore you are making a massive statement and collectively you are making a transformation of society with a simple one syllable word, “No.” No is not negative, no can be an incredibly, powerfully, positive word. “You are going to do this because we, the few, have said you will do it.” “No, won’t do it.” No protest, no stockpiling weapons, “No, not doing it.”\n\nAnd whenever thousands of people have refused to acquiesce, refuse to obey, the all-powerful state doesn’t know what to do with them because the state power and cult power behind the state depend on human acquiescence. It depends on people saying, “Yes sir,” when they really would rather say no, but what are the consequences for me. The heart would never do that.\n\nAlex Tsakiris: [00:55:16] That’s incredible. Two, maybe three more questions, if I can squeeze it in. One, could you speak to religion? Because many people get offended, they feel like religious beliefs are somehow protected beliefs, and to many other folks it just looks like a complete other aspect of this social engineering project. It’s a way of getting between us and our connection to that ultimate extended consciousness. It takes many forms. It has many of the aspects of control that you’ve talked about. Speak to religious beliefs and whatever you have to say about that.\n\nDavid Icke: [00:56:02] Well, I call it in general the God program, and we have all of these religions, Alex, but when you break it down, when you break the God program down, it operates the same, it’s a blueprint, and all of the different names and different rituals, they kind of obscure the fact that actually it is a very simple blueprint. And you’ve mentioned part of it there in that, you know I talk about this wetiko virus, mind virus wants to get in there, in the spaces or make spaces between the five-sense mind and expanded awareness. Well, look at the blueprint of religion.\n\nSo, “What are you?” “I’m a Christian.” “What does that mean?” Well, I go to church and this man in a frock (women often now) tells me what God wants me to do.” “Okay, well that’s interesting.” “And he tells me the consequences of me not doing what God wants me to do.” “Okay, you?” “Oh, I’m a Muslim.” “What does that mean?” “Well, I go to the mosque and this man in a frock, he tells me what God wants me to do and what God will do if I don’t do what God says, which is what this man in a frock tells me he says.” “Okay, you?” “Oh, I follow Judaism.” “What does that mean?” “Oh, I go to the synagogue and this man in a frock, he tells me what God wants me to do and they’ll be hell and damnation if I don’t do what he says, and that’s what Judaism is.”\n\nAnd so you go on and you go on and you go on. What are those people in frocks actually doing Alex? They’re getting in the spaces between the five-sense mind and expanded consciousness. They do not want a direct connection. Even the word connection is not correct and it’s only a human language, because it’s not even a connection, because what is all one does not connect, it just is. And what happens is we get a disconnection of influence. It doesn’t mean we’re not still part of the great forever, we always are and always will be, it’s that it’s not influencing us because of this perceptual isolation, which religion has played a major, major part in.\n\nSo what you had originally were forms of culture that for all their flaws, and there were many, they practiced a direct connection with what they perceived as the creator, or what I call The One. And then religion came in and it created that blueprint and we got the, “Only through this can you get to God, only through me, only through believing me and what I say can you get there. And by the way, we’re going to give you a story, we’re going to give you a series of rules and regulations, and if you don’t follow them, well, have you ever stoked the fires of hell? Well, that’s where you’re going mate.”\n\nAnd then, as the impact of that, what was that? It was a tiny, tiny perceptual state that’s being sold here. You can’t question it because you’re a blasphemer if you do and you’re out, you’re not one of us anymore.\n\nBut as people started to reject that then in came mainstream science, and we went from a situation where you can only get to the state of expanded consciousness as I would call it, if you do what we tell you, because we know what God wants, we went to, actually, there is no state of expanded consciousness, there’s just you and you come out of nowhere, three score years and ten, if you’re lucky, and then you go back into nowhere.\n\nAnd now basically, you’ve got these two working simultaneously with the science through technology and the technocracy that’s developing, controlled by technocrats, not politicians, is now becoming more and more and more dominant, and there’s a common theme. I mean, just look at the common themes everywhere that this system, this cult behind this system is emphasizing everywhere, and that is you cannot have a direct connection with expanded states of consciousness.\n\nAlex Tsakiris: [01:01:17] You did have that direct connection and I wonder if you could tell that, inform this whole process, because a lot of people go back, they’ll look, they’ll read in your books and maybe you want to mention the books that actually detail you being on the mountain and having that experience, direct experience, personally well experience, and then interacting with nature in a strange way that we hear so often, you know, the cloud comes over. I can’t tell you how many times I’ve heard that from other people who’ve had these shamanic journeys. But you experienced this extended realm. It even changed you in this transformational way, where a lot of people struggle re-integrating that and you did for a few months. But then you just explode in terms of your knowledge and what you’ve been able to bring forth with that. But I also want you to explain, if you can, what you learned about the other realms of that extended realm in particular, maybe some of the darker aspects of it. Can you tie that into it, your direct experience and where we can learn more about that?\n\nDavid Icke: [01:02:15] Well, I mean, what happened to me, just very quickly, I was a television presenter with the BBC and a national spokesman for the British Green Party at the time in the 1980s. I had this strange experience, over a year where, when I was in a room alone, it seemed like there was someone else there. This got more and more tangible, more and more powerful. And eventually I spoke out into an empty hotel room, “If you’re there, would you please contact me because you’re driving me up the wall?” And a few days later, not many days, I was in a bookstore just down the road from here, it’s still there, not a bookstore so much as a news shop, a newsagent. And I had this experience, where suddenly my feet were stuck to the ground, I was standing at the entrance, like magnets were pulling them down to the ground and I had this, it wasn’t a voice, it was a thoughtform, a strong, thoughtform. It said, “Go and look at the books on the far side.”\n\nNow, I’m new to all of this at the time, this is 30 years ago, and I’m bewildered at what’s going on. And I start walking towards the very few books in this shop, because it sold tourist things, buckets and spades, newspapers and stuff, very few books. And there were romantic novels overwhelmingly. I knew the shop well, I thought, “What the hell am I going over here for?” But something was leading me there.\n\nAnd I got there and there was one book in among the romantic novels and it was a book called Mind to Mind by Betty Shine who was a professional psychic, I’d never been to a psychic before. But I’d just had a year with this presence around me, which was getting more and more powerful, so I read her book, I went to see her, not telling her anything, except that maybe my hands are needing help because I had arthritis. And in the four times I went over a period of a month she went into psychic mode and said I was going to go out on a world stage and reveal great secrets. And basically, she described what has happened in the last 30 years in a few minutes.\n\nAnd then, in a bewildered state, because my life was dramatically changing, my awareness, my perceptions were dramatically changing through 1990 and into early 1991, and suddenly I had this overwhelming feeling to go to Peru. And I got on a plane to Peru, purely on, I know I need to go there. You know this intuitive knowing that we have when we open our heart.\n\nSo I went there and lots of amazing things happened, but I ended up on a hill at a place called [Sistani 01:05:10] not far from Puno in near Lake Titicaca. I was in kind of a taxi bus which I had hired to take me there, it was out of season, and as we were driving away, I looked at this hill and all I could hear in my head was, “Come to me, come to me, come to me, come to me.” And people will appreciate, when this is all new to you, you wonder what the hell is happening to you.\n\nSo anyway, I said, “Stop the bus, please, because I’m going up that hill.” And I went up the Hill, and as I was standing there under a piercing hot Peruvian sun with no clouds, what came through my head was, “They’ll be talking about this a hundred years from now, it will be over when you feel the rain,” which was a ridiculous thing under a piercing hot cloudless Peruvian sky.\n\nBut anyway, this energy started to go into the top of my head and through my feet and then come the other way. Now my arms went out at 45 degrees without any conscious decision to do it, and the energy was building up and building up. My body started to shake, and I was going in and out of consciousness. Like when you’re driving a car and you forget whether the last two miles has gone, your subconscious has been driving the car, thank goodness. And it was a bit like that.\n\nAnd one of these times I came back to a conscious state I saw that there was a light gray mist over the distant mountains, and as I watched it, it happened ever so quick, ridiculously quick, like a video, on fast forward, it got darker and darker and I thought it’s raining over those mountains. And in the next little while I watched this, well, it was just stair rod rain coming towards me. And as it got towards me, it was straight out of some B movie that no one would ever believe. It was a wall of rain coming towards me. And eventually it hit me and I was soaked in a second. And by this time my body is shaking crazy with this energy. And and as soon as the rain hit me, the energy went, stopped, and now my arms, which didn’t hurt before, agony, my legs were like jelly.\n\nMy life changed then, I came back to England, concepts and things, insights were pouring into my conscious mind, far, far too many to process. And it was like pressing too many keys on the computer, the computer froze, couldn’t process it. And I went through three months of almost not knowing my name, not quite that, but you get the point. I didn’t know where I was, what I was doing, what was happening to me.\n\nAnd then, it was like the computer unfroze after about three months and it happened very quickly, the unfreezing happened very quickly. And suddenly I am who I was before, but not. People who I met were saying, “Well, I thought you supposed to have gone crazy,” because it was in all of the media I’d gotten mad, because I was a television presenter at the time, or in that period. They said, “You’d gone made, you’re the Dave I’ve always known.” And I kind of was outwardly, like I am now, but I saw the world completely differently. Instead of seeing the dots I saw how they connected. I would see what was really being said, as opposed to what the words said and what happened was my life became the synchronistic journey of meeting people, running into experiences, coming across documents and books and stuff. And it was like some force was handing me puzzle pieces to put into the picture.\n\nAnd you know, I’ve got a stream of books here, a lot of them are very considerable because they cover so many interconnected subjects. I would never have been able to produce those books if I were just using my conscious mind and there wasn’t some other force that was… It was like walking through a maze Alex, and someone was opening and shutting the doors, so you went in the right direction. Without that, and that was coming from some other level, then it couldn’t be done, because what is being uncovered and what I uncover in The Answer, does not want to be uncovered without support from other levels of consciousness, reality, what are we going to call them, you couldn’t possibly have unraveled it. It’s taken 30 years as it is, but without that support, that guidance, it couldn’t be done.\n\nAlex Tsakiris: [01:10:46] David final question. The new book, The Answer, that is out just now, it’s just coming out today or tomorrow, I think, as we speak here, what does it have to say about a topic you’ve covered more thoroughly and before anyone really was on it, again, it’s like a repeating story, about our connection to the UFO, ET phenomenon? And in particular, I wanted to hone in on a couple of points. In the last couple of years here in the United States, the Department of Defense has taken hold of that narrative, has coopted, have spun it into this political, in my opinion, what is a political psyop disclosure and it has very much of, this is a national defense issue.\n\nSo we have that on one hand, it’s almost like a parallel of what you were talking about, how we have science and religion, each sandwiched in to disrupt our understanding of the consciousness. Here we have the good ET, bad ET, and we have both narratives existing at the same time, where the DOD is continuing to spin the ET is going to…. It’s a national defense, so give us all of the power to go and deal with it. And then at the same time, we have folks in the UFO community, the ET experiencer community are saying no, these are actually bringers of spiritual transformation and it’s a good ET and they’re trying to protect our environment.\n\nSo in the process of, if you can, covering all of that, I also want you to touch on the fact that we are almost certainly looking at many, many species with many, many agendas, with many from different places. So we can’t automatically just say ET either, can we?\n\nI know I laid a lot of the table there, but if anyone can handle it, you can.\n\nDavid Icke: [01:12:46] Where do you start? Well, I come from that angle, from a different point of view. Just after the turn of the millennium I’d thought about it before, but the start of the turn of the millennium, I concluded that we live in some kind of virtual reality. Well, a matrix to use the name in the movies, but a virtual reality, which was part of the disconnecting of our perception of reality from the greater reality.\n\nWhen I was a kid in the 1950s, my father had no interest in astronomy before this incident or afterwards. And I’m still bewildered about what the heck happened. We had no money. We never went anywhere because we had no money. And one day, it would have been about 1958, 1959, my father walked down the stairs one morning and said, “We’re going to London,” and I was shocked because I’d never been to London, it was a long time before I’d go again. And 1958, 1959, I would be six or seven. We’re going to London. And I remember we went on a steam train and my father said, ‘We’re going to the Planetarium,” right?\n\nNow, I didn’t know what a planetarium was. I wasn’t bothered, I just wanted to go to London. I’d heard about it, or so much about it. So we go on this steam train to London, we go to a planetarium, which I know the date because it had just opened, it opened in 1958 in London next to Madame Tussauds in London, in Baker Street. I didn’t know what to expect.\n\nSo, we walk into this planetarium and I sit down on a seat, I don’t know what to expect and then suddenly the roof, the ceiling, the domed ceiling became the night sky and it must have been about midday we were sitting there. And I looked today, and something hit me that never left me that, even at that early age, that could be the night sky. It looked like it was midnight and the roof had come off and that never left me.\n\nAnd, when all this started for me, that I’ve just described, I looked up at the sky one day and it’s appeared to me as a gigantic dome, like something out of the Truman Show, and that all came back to me when I started to go down this road, of this is some kind of holographic projection.\n\nAnd this comes into your question because, of course, we know about this whole concept of the, was it the Fermi paradox? Of how there can be so many planets and so many stars and yet the amount of conscious ET activity is ridiculously little, compared with that potential out there. And for me the lack of ET activity against the potential of it is part of isolating human perception.\n\nYou imagine if there were other races, what we call ETs, interacting with the earth. You imagine what would happen to human perception. It would be dramatically different. We would be getting access to tremendously different perceptions of reality, perceptions of possibility, how to look at life, how to look at this and how to look at everything. We would be in a completely different knowledge base. But if you can isolate or perceptually isolate people to the point where there is no out there or perceived to be no out there, certainly no conscious interaction, then you can isolate this bubble again and you can control what? You can control the information that the target population receives, which leads to its perception, which leads to its behavior.\n\nAnd I’m not saying, not for a second, and I wouldn’t because I don’t believe it’s true, that what we call ETs can’t come into this projected reality, both malevolent and the other kind, but it’s my feeling that this reality, this astronomical reality, is not teaming with life as you would probably expect it to be because if it was, the ability to control would not be a tiny fraction of what it is, it would be impossible in fact. There would too many sources of other information.\n\nI see this one planet, this one green, from a human physiological point of view, inhabitable planet, which according to mainstream science anyway, compared with the projected size of the university is about a billionth of a pinhead. And then I see all this other potential for life, planets, stars, etc. that appear to not, certainly within the frequency band of human sight, not to be inhabited, and it makes no sense to me whatsoever that a planet so small should have this phenomenally beautiful environment, very unique environment, and then you look out and there’s nothing else, certainly within interaction range that’s anything like it.\n\nSo you’ve got humanity, many people within humanity do actually believe that there is nothing out there. And it’s another part of this isolation and I wonder what it is that we’re looking at when we look at the night sky, because that experience when I was six or seven years old in the planetarium hit me so powerfully I never forgot it. Well, if I can see the night sky on the top of a ceiling, then what is the night sky? And I’m still thinking like that now.\n\nSo like everything in all reality, there are benevolence expressions of all that is, and there are, shall we say wetiko infested expressions of all that is. But I just wonder what this night sky really is, what this space that we perceive really is. And whether it is what we think it is, or actually just a holographic projection which to our senses would seem incredibly real, as it does.\n\nAlex Tsakiris: [01:21:26] Our guest again has been David Icke, truly, as I said at the beginning, one of the bravest, I would say one of the most important thinkers of our time. He’s never going to make it on that Times list of one of the top 100 most influential…\n\nAlex Tsakiris: [01:21:43] Be sure to check out this new book, The Answer, and hopefully it’s an entry point, if you haven’t, to checking out his other books. I think Trigger is a super-duper important book, if you haven’t looked at that.\n\nHis website is fantastic too. Many, many videos, blog posts, valuable stuff, well, well worth it, iconic.com. And we have to support, even more we have to support this kind of work because part of the process is to put this boa constrictor’s stranglehold, and gradually try and cut off the money that this important research deserves.\n\nSo David, truly, truly wonderful having you on. Thank you. Thank you so much.\n\nDavid Icke: [01:22:30] Thank you, and we started Iconic, which now is about 750 videos and series and podcasts and full-length feature films, because we could see this severe censorship coming and we wanted a place where this could be available. And some great news, I think it’s great news anyway, we’ve just licensed Vaxxed, you know, the movie Vaxxed, about vaccinations which they’ve got a big controversy with De Niro’s film premier if you remember. We’ve licensed that. So that’s on Iconic very soon. The only place you can see it streamed.\n\nAlex Tsakiris: [01:23:14] You know what I’d like to do. I’d like to offer, if anyone’s stuck around this long, I’m going to purchase for you, for listeners, 10 copies of The Answer, okay? And I’ll assign those randomly for every 10th person that that gets to me, okay? So the first 100 that email me, every tenth one will receive a copy of The Answer compliments of the show, because it’s so, so important. And I hope when you receive that, the one thing I’d ask is that you do check out Iconic and at least sign up for a month and see if it doesn’t provide the kind of value that I’m talking about.\n\nOkay. So just email me, and I’ll be honest about it, every 10th one I’ll give you a copy of The Answer with the hope that you’ll check out Iconic.\n\nSo, David, thanks again. Good luck with the rollout of this and all the terrific work that you’re doing.\n\nDavid Icke: [01:24:07] A real pleasure, Alex. Really lovely talking to you.\n\nThanks again to David Icke for joining me today on Skeptiko. I’m probably going to be diving further into this topic, because I’m not so certain about some of the science he’s referring to. But again, as I tried to make clear in the interview, the overall lay of the land that he’s describing is so incredibly on target and way, way too close to the truth. I mean, scary close to the truth.\n\nSo I guess that is the question to tee up from this interview and that is, what do you take from David Icke’s view of the COVID-19 plandemic, and what do you leave behind?\n\nLove to hear your thoughts, they will inform me, they will drive me, they will direct me in how I move with this. So please let me know what you’re thinking. And thanks as usual so much for joining me and for being a part of this. I have some good ones coming up. I did slip David Icke in here ahead of some other ones, so I have some ones that are going to be really delayed. But that’s okay, they’ll all get out there and the book will get out there too and it will all work out just the way it’s supposed to.\n\nUntil next time, take care and bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "David Icke, Love Not Fear is The Answer |460| - Skeptiko - Science at the Tipping Point", "description": "David Icke was recently banned from Youtube for advocating free thought, free speech and non-violent resistance, but does his science hold? photo by: Skeptiko [Clip 00:00:00 – 00:00:35] Let them shake their group think heads at you, let them be ashamed of you, embarrassed of you, pissed off at you. They will call you names, and […]", "url": "https://skeptiko.com/david-icke-love-not-fear-is-the-answer-460/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2020-08-18T14:03:29+00:00", "article:modified_time": "2020-08-18T15:01:16+00:00", "image": "https://skeptiko.com/wp-content/uploads/2020/08/skeptiko-460-david-icke.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"David Icke, Love Not Fear is The Answer |460|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/yE9riY9ilrk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/yE9riY9ilrk?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://flic.kr/p/zXGAP1", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-460-david-icke.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-460-david-icke.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-460-david-icke.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/david-icke-love-not-fear-is-the-answer-460.4560/", "http://www.skeptiko-forum.com/threads/david-icke-love-not-fear-is-the-answer-460.4560/", "http://brucefenton.info/exogenesis-hybrid-humans/", "http://www.skeptiko-forum.com/threads/david-icke-love-not-fear-is-the-answer-460.4560/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2020-08-18T14:03:29+00:00"}