{"result_id": "273012", "URL": "https://skeptiko.com/vaccine-autism-link-not-in-headlines-292/", "timestamp": "2023-04-25 17:08:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/vaccine-autism-link-not-in-headlines-292/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Why CDC whistleblower revelations about vaccines and autism never made headlines, and what that means for science |292|", "cleaned_text": "Investigative reporter Jon Rappoport explains why the media intentionally ignored whistleblower revelations about vaccines and autism.\n\nMy wife is the medical expert in our family. She has a PhD in psychology, works with doctors, and performed medical rounds as part of her training. I, on the other hand, can’t stand to drive by a hospital. So I was surprised when on a ride home from the movies Joni launched into a bit of a rant about a recent measles outbreak and accompanying media reports on the public’s lack of confidence in vaccines. “But what about that whistleblower from the CDC who revealed that there really was a link between the measles vaccine and autism,” I said. Joni looked at me with incredulity. She’s smart, well informed, watches the Today Show, reads medical journals and even blogs for Psychology Today; how could she not know about this large-scale medical fraud that destroyed the lives of thousands of children?\n\nJoin Alex Tsakiris for an interview with investigative journalist and author, Jon Rappoport, author of Exit From the Matrix:\n\nJon Rappoport: … then if we flash-forward another year, to the end of July 2005 Congressman William Posey of Florida, who has been in contact with the whistleblower, Dr. William Thompson, stands up on the floor of the House of Representatives and says, “I am now going to read a statement from Dr. William Thompson…” And in this statement Thompson is saying he and his coauthors on this study are sitting in an office at the CDC (Center for Disease Control) and bring in a large garbage can and proceed to throw out pages of documents that implicate the MMR vaccine and its connection to autism. I mean from a reporter’s point of view, can you ask for a bigger story than that?\n\n… so when you get someone who is say, well-intentioned and who is writing for the New York Times or whatever, their whole education and background and indoctrination is to rely upon what is published in these peer-reviewed accepted medical journals as fact. And therefore, yes, if you looked at all these studies, you would say vaccines are safe and effective. So what’s the problem? The people who say they aren’t must be crazy… that would be the obvious conclusion; you would have to go one level deeper in order to discover that what they are relying on and calling science is actually fraud.\n\nJon Rappoport: Also, I want to point out something — judging what people can accept, what they’ll be willing to research on their own or investigate, that’s always a crap shoot to me. So therefore to characterize some of the things that I say as “moon shots” for most people, what I’ve discovered over the last 14 years that I’ve been publishing over the Internet is I take my findings and I present them, period. I don’t try to water them down or make them more generalized, or cater to people who would “not be able to accept” what I’m saying. And what I’ve discovered is if I go with what I’ve found out in an uncompromising way the audience is there–and it builds and expands. I consider that a very important clue for people who for are example considering becoming investigative researchers on their own. What do you do when you find out something that is so profoundly at odds with the consensus? Do you shape it? Do you sculpt it in a way that will be more acceptable to a larger number of people from your point of view? Or do you just shoot the moon and give it out? Here it is. This is it. My feeling and conclusion based on my experience is you do the latter. If you always do the latter, in other words, present exactly what it is that you found, explain it and give evidence for it then you win. If you don’t you end up in a kind of grey Twilight Zone where you accomplish far less in the long run.\n\nJon Rappoport: I can cap this off by flash-forwarding to the summer of 2014, about a year ago. All of the sudden, a CDC long-term researcher, very respected, published lots of vaccine studies–his name is William Thompson–confesses publicly in writing on the website of his attorney Rick Morgan from Cincinnati, that he and his colleagues in 2004 cooked the data on a study of this MMR vaccine and thereby excluded the possibility that the vaccine had any connection to autism when in fact the data they excluded showed that there was a connection to autism. He does this in writing–William Thompson of the CDC.\n\nAlex Tsakiris: He does it in writing and people can also go on YouTube and listen to–\n\nAlex Tsakiris: Yes. Tell us about that.\n\nJon Rappoport: [Thompson’s] talking to Andrew Wakefield. He’s talking to a PhD named Brian Hooker. He’s talking in a tone of voice that is shot through with guilt and remorse, and a stricken conscience. And he is also saying things like, for any of the vaccines that still contain mercury you would have to be crazy to give these vaccines to anybody, much less a child…There are many other parts to this story which would take us well beyond this hour. Then the major media blacks out this story which is a gigantic story. It’s a story of scientific fraud having to do with vaccines and their harmful causation of autism. And only certain websites are carrying this story, one of which is mine, No More Fake News. I’m writing about this everyday and getting more information about this. Thomson is refusing to talk to reporters. He’s in a very bad place because he’s still working at the CDC. He’s obviously had conversations with his bosses there, and I’ll give you one more tidbit: the study that we’re talking about in question–the 2004 study on the MMR vaccine–was coauthored by Thompson. But two other authors on the study, Frank DeStefano and Coleen Boyle who work at the CDC are not only researchers and authors, they also happen to be high-ranking executives at the CDC in the area of vaccine safety. So this now is the kind of story that should not only boil over on page 1 of every major media outlet in the world, but it should prompt further investigation to see what else comes out of the closet. But it doesn’t. It absolutely doesn’t. Then if we flash-forward another year, to the end of July 2005 Congressman William Posey of Florida, who has been in contact with the whistleblower William Thompson, stands up on the floor of the House of Representatives and says, “I am now going to read a statement from William Thompson…” And in this statement Thompson is saying he and his coauthors on this study are sitting in an office at the CDC and bring in a large garbage can and proceed to throw out pages of documents that implicate the MMR vaccine and its connection to autism. I mean from a reporter’s point of view, can you ask for a bigger story than that?\n\nAlex Tsakiris: Part of the game plan here, in terms of the soft denial, isn’t to reject the counter-opinion it’s just to cast doubt on the whole situation…to turn it into yet another fist fight in the street that we look at for a minute and then we turn our heads away from. Only, this is a very professional [fist fight]. So it’s done in a way to–it’s a familiar pattern–not an outright denial, it’s just to throw sand into the person’s face and confuse everything.\n\nJon Rappoport: And also, I would liken it to a lawyer who’s standing in front of a very friendly judge. What does that lawyer have to do or say that’s going to get the friendly judge to agree with him? Very little. He’s just going to have to say, well Your Honor, in this case, yackety-yack… and the judge is going to nod and say, yes I’ve considered this and I agree, so the objection is overruled and we’re going to move on. That’s all it takes because you don’t have major media who are really looking over the shoulder and determined to find out the truth. So you need the soft denial to do very little for everybody to move on and ignore what’s really happening.\n\n[easy-tweet tweet=”whistleblower revelations about vaccines just one layer of rotten onion”]\n\nAlex Tsakiris: How does it happen that good, well-educated, well-intentioned people wind up parroting this really destructive crap that if they’d investigate a little bit, [they] would see is completely untrue?\n\nJon Rappoport: We only have a few minutes so I’ll have to boil it down. I’ll mention that, and I’ve published these statements many times as quotes: Marcia Angell was the editor of the New England Journal of Medicine for 20 years. Recently we had a similar statement from the editor of The Lancet, one of the most prestigious medical journals in the world. And basically what Angell said was–in writing, in 2009 in the New York Review of Books: “Reluctantly of the course of 20 years I have come to the conclusion that I can no longer trust published medical studies or clinical reports from doctors.” Now she has looked up close and personal and poured through more clinical studies and trial reports, etc. than anybody writing for the New York Times or any doctor practicing medicine in a hospital could even dream of doing, and she comes to that conclusion: the entire field is rife with fraud. So when you get someone who is say, well-intentioned and who is writing for the New York Times or whatever, their whole education and background and indoctrination and studies rely upon what is published in these peer-reviewed accepted medical journals as fact. And therefore, yes, if you looked at all these studies, you would say vaccines are safe and effective. So what’s the problem?\n\nThe people who say they aren’t must be crazy. They’re just unhinged. They’re screaming in the night. They have no factual basis behind them therefore this must signal some kind of decline in Western civilization and a loss of faith in science itself which is what got us to his point in our civilization. That would be the obvious conclusion but you would have to go one level deeper which these people are not willing to do in order to discover that what they are relying on and calling science is actually fraud. They don’t know that. They don’t want to know that. They don’t in some cases even know that this level of fraud exists. They’re incurious people. They don’t have that kind of independent curiosity that leads them to go where they will on their own. They attach themselves to what they consider to be the establishment, the best version of science. And they roll the dice on that for the rest of their lives. That’s all they do and that’s why you see those articles there.\n\nAlex Tsakiris: And there’s also a certain part of human nature that wants us to go along–wants us to connect with other people in a way that doesn’t create conflict at every turn. So for someone like that–a science writer at the New York Times, you’re getting it from a couple of different angles–one, you’re getting it from science; and then you’re also getting it from your journalistic buddies, too, who like to fashion themselves as mavericks. But at the same time are very careful to not step too far out of the lines and lose their job or lose their positions in the paper where they’re not getting front page, full coverage, and they’re back in Section B, page 14.\n\nJon Rappoport: Happens all the time. It’s now reached a point in major media where reporters instinctively know what they can do and what they cant’ do. They don’t need to be told. Only on the rare occasion does the word come down from the top. And reporters understand that they can lose their jobs, that they can lose their careers. In other words, they will not only be demoted they will be let go and then they won’t be able to find a job in the same level of media ever again. [They’ll be] blacklisted. This is what they’re dealing with. This is the…you got the carrot and the stick and this is the stick. They know that. They understand. Everybody knows the game.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why CDC whistleblower revelations about vaccines and autism never made headlines, and what that means for science |292| - Skeptiko - Science at the Tipping Point", "description": "Investigative reporter Jon Rappoport explains why the media intentionally ignored whistleblower revelations about vaccines and autism. photo by: Art Writ My wife is the medical expert in our family. She has a PhD in psychology, works with doctors, and performed medical rounds as part of her training. I, on the other hand, can’t stand to drive by a hospital. So […]", "url": "https://skeptiko.com/vaccine-autism-link-not-in-headlines-292/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2015-11-03T16:46:50+00:00", "article:modified_time": "2017-07-25T20:05:55+00:00", "image": "https://skeptiko.com/wp-content/uploads/2015/11/skeptiko-vaccine-290-jon-rappoport.jpg", "image:width": "600", "image:height": "312", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["https://skeptiko.com/wp-content/uploads/2015/11/skeptiko-vaccine-290-jon-rappoport.jpg", "https://www.flickr.com/photos/vcucns/6792819478/in/photolist-bmfYzd-93nCcJ-9Cgxag-9nMLkC-nQg4F7-7mhs8c-nzrPYF-9j2Fmj-9SPoVi-93jy5g-dyWhLx-aFTx9R-dz2HRq-hkw4gF-hkw3oP-93jDmt-dtN69K-nw21gs-hkv33d-dynqzK-xhY15A-jiFCyR-2W2iXP-a7RGBX-bD5et1-6jk9td-ngzho7-93nFWJ-jiFZyC-bRYX7k-8KoAyi-93nbW1-drRkCK-hkuy1R-dz2KYL-7cWoPz-7cWoMB-en8Ycg-jiFCqz-bD5fJw-bRYYxX-drRqyW-8LSifK-bQMEnD-93j4dH-eJUFB3-93j4ft-9vHhZE-jiFZUY-bRUiFF", "https://www.psychologytoday.com/experts/joni-e-johnston-psyd", "http://www.nomorefakenews.com/", "http://marketplace.mybigcommerce.com/categories/Jon-Rappoport/", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-292-jon-rappoport.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-292-jon-rappoport.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-292-jon-rappoport.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "http://www.stitcher.com/podcast/skeptiko", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/why-cdc-whistleblower-revelations-about-vaccines-and-autism-never-made-headlines-and-what-that-mean.2688/", "http://www.nomorefakenews.com/", "http://www.nomorefakenews.com", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2015-11-03T16:46:50+00:00"}