{"result_id": "273009", "URL": "https://skeptiko.com/page/30/?id=18", "timestamp": "2023-04-25 17:08:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Skeptiko", "cleaned_text": "Dr. Dan Booth Cohen and Emily Volden merge extended consciousness and after-death communication into psychotherapy. photo by: Pip R Lagenta Welcome to Skeptiko where we explore controversial science with leading researchers, thinkers, and their critics. Today we talk...\n\nDr. Dan Booth Cohen and Emily Volden merge extended consciousness and after-death communication into psychotherapy. photo by: Pip R Lagenta Welcome to Skeptiko where we explore controversial science with leading researchers, thinkers, and their critics. Today we talk...\n\nDr. Alexander Wendt and James Corbett Clash Over Inevitable One World State |301| To this Ohio State University International Relations Professor a one world state is inevitable. To Alt media blogger James Corbett it's a catastrophe. photo by: Royce Bair Today's show is not about consciousness, spirituality, or any of the topics we normally cover....\n\nMovies: Is Ex Machina ignoring the hard problem of consciousness? |300| According to the movie Ex Machina, strong AI and the Singularity are just around the corner, but consciousness science suggests otherwise. photo by: Alex Garland Here's the second installment of our Skeptiko at the Movies series. This time me and the guys from...\n\nMovies: Is Red Lights the worst movie about parapsychology every made? |299| Both parapsychology researchers and Skeptics are misrepresented in this hack job of a movie, but that's what makes it fun to talk about. photo by: Rodrigo Cortez I love going to the movies, but so much of the stuff I want to talk about afterwards is left unsaid. I...\n\nWhy David Bentley Hart thinks choosing a tie reveals more about consciousness than near death experiences |298| Theologian and Philosopher Dr. David Bentley Hart has little patience for sloppy thinking atheists. Looks to consciousness and spirituality. photo by: André Batista The wooden pews in the Greek Orthodox church I grew up in were hard and uncomfortable. I think it was...\n\nHe claims to have traveled outside his body to bring back art… and much more |297| Jurgen Ziewe used lucid dreaming to travel outside of his body and explore other realms of consciousness. photo by: Jurgen Ziewe I always thought lucid dreaming was baloney, until I had one myself. For several years my oldest son had told me about the wild escapades...\n\nFormer military psychic spy claims parapsychology is off course. Suffers from Stockholm Syndrome. |296| Remote Viewer Dr. Paul Smith has concerns about the direction of parapsychology research. Also doubts 9/11 remote viewing. photo by: David Webb A few years ago, when the kids were younger, they loved playing hide-and-seek in our backyard. Our version of the game was...\n\nWhat science-as-we-know-it can learn from the 9/11 truth movement |295| Investigative journalist Luke Rudkowski shows us how to talk to power and challenge the status quo. photo by: Luke Rudkowski I don't like Las Vegas very much. Too many grueling COMDEX computer trade shows burned into my memory I suppose. But a few years ago, my wife...\n\nWhat does the end of materialism mean for political science? |294| Dr. Alexander Wendt examines the implications of consciousness science for the social sciences. photo by: David Ohmer I was introduced to the power of interdisciplinary thinking when I found myself way over my head in a graduate course in cognitive psychology. I had...", "opengraph": {"locale": "en_US", "type": "website", "title": "Skeptiko - Skeptiko - Science at the Tipping Point", "url": "https://skeptiko.com/", "site_name": "Skeptiko - Science at the Tipping Point"}, "tags": ["Consciousness Science", "Spirituality", "Share", "Parapsychology", "Uncategorized", "Skepticism"], "tweets": [], "movies": [], "links": ["https://skeptiko.com/dan-booth-cohen-emily-volden-systemic-family-therapy/", "https://skeptiko.com/dan-booth-cohen-emily-volden-systemic-family-therapy/", "https://skeptiko.com/dr-dan-booth-cohen-emily-volden-302/", "https://skeptiko.com/dr-alexander-wendt-and-james-corbett-clash-over-inevitable-one-world-state-301/", "https://skeptiko.com/dr-alexander-wendt-and-james-corbett-clash-over-inevitable-one-world-state-301/", "https://skeptiko.com/ex-machina-ignoring-hard-problem-of-consciousness/", "https://skeptiko.com/ex-machina-ignoring-hard-problem-of-consciousness/", "https://skeptiko.com/red-lights-worst-movie-about-parapsychology/", "https://skeptiko.com/red-lights-worst-movie-about-parapsychology/", "https://skeptiko.com/david-bentley-hart-on-consciousness-and-spirituality/", "https://skeptiko.com/david-bentley-hart-on-consciousness-and-spirituality/", "https://skeptiko.com/jurgen-ziewe-lucid-dreaming/", "https://skeptiko.com/jurgen-ziewe-lucid-dreaming/", "https://skeptiko.com/paul-smith-remote-viewing-stockholm-syndrome-296/", "https://skeptiko.com/paul-smith-remote-viewing-stockholm-syndrome-296/", "https://skeptiko.com/science-know-can-learn-911-truth-movement-295/", "https://skeptiko.com/science-know-can-learn-911-truth-movement-295/", "https://skeptiko.com/what-does-the-end-of-materialism-mean-for-political-science/", "https://skeptiko.com/what-does-the-end-of-materialism-mean-for-political-science/", "https://skeptiko.com/page/31/?id=18&et_blog", "https://skeptiko.com/page/29/?id=18&et_blog"], "authors": [], "publish_date": null}