{"result_id": "273030", "URL": "https://skeptiko.com/conservative-christian-chris-white-debunks-ancient-aliens-theories/", "timestamp": "2023-04-25 17:08:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/conservative-christian-chris-white-debunks-ancient-aliens-theories/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Conservative Christian Chris White Debunks Ancient Alien Theories", "cleaned_text": "Interview with Ancient Aliens Debunked filmmaker Chris White who swamps the Ancient Alien theories with science, but relies on Biblical inerrancy for core beliefs.\n\nJoin Skeptiko host Alex Tsakiris for an interview with Chris White, creator of the popular documentary film, Ancient Aliens Debunked. During the interview White discusses the film as well as his controversial conservative Christian beliefs:\n\nAlex Tsakiris: Here’s what Ancient Aliens, the TV show says is one of the most compelling bits of evidence for the Ancient Alien proposition, and that’s the site of Pumapunku and the ruins there. That’s where you start the film. So, take us through Pumapunku, and how that’s debunked.\n\nChris White: The main thing that the Ancient Astronaut theory proponents suggest is that these angles are too perfect and the stone-cutting is too amazing to be anything that any ancient peoples could have done. We could talk about what the site actually was and so on but the main thing is that the stonemasonry there at Pumapunku is not difficult to do.\n\nThere’s lots of things that they say are true about Pumapunku that are not. For example, they say that these stones are granite and diorite and therefore they’re too hard. Not only is that not true if they were granite or diorite but they’re not granite or diorite. They’re red sandstone and ambercite. They are not as heavy as they say they are and they’re not as in the right-angles as they say they are.\n\nLater, Mr. White offers opinions on the limitations of Islam and Buddhism, and the primacy of Christianity:\n\nChris White: In Islam they have a lot of rules that say, “Give to the poor. Fast. Be nice to people.” Those are rules that they’re following because of threat of whatever.\n\nAlex Tsakiris: You can’t generalize like that, Chris.\n\nChris White: I think it’s dangerous when we say, “Oh, we know that these people are just as good.” I think you can analyze—not their personality — I’m not talking about whether they’re good or not but you can analyze the very tenants of what they’re trying to do. And I think very few times do people understand Hinduism or Buddhism or Islam or any of these things…\n\nAlex Tsakiris: Chris, how many Buddhist monks have you met? How many Buddhist monks have you encountered and really sat down and experienced, and talked to?\n\nChris White: It’s really not about the individual; it’s about what they are claiming that any individual would claim…\n\nAlex Tsakiris: How is it not about the individual? It’s only about the individual.\n\nChris White: Because nobody has reached the very thing that they need which is freedom from Nirvana or getting to Nirvana. Show me a Buddhist that would claim that right now. Everybody’s saying, “Oh well, the suffering is caused by tanha.” Tanha is sin. It’s our desires to do bad things that we don’t want to do. That’s the reason that any Buddhist is trying to do the ascetic practices. They try to eat less rice, go onto a hill, do whatever because they’re trying to defeat the innate desire to sin. Now, that’s their path.\n\nIf you understand that they’re hoping that one day, if they do all the right meditations and they eat the less food and they give away enough possessions and they’re nice enough to people, it will happen and they will be diminished in their level of desiring to sin. That’s Buddhism.\n\nToday we welcome filmmaker, radio host, and podcaster, Chris White to Skeptiko. Chris’ latest documentary, Ancient Aliens Debunked, has caused quite a stir among Ancient Alien believers, as you might expect, as well as skeptics and even Evangelical Christians, as Chris himself is quite public about being a Conservative Christian.\n\nThere’s a lot here to unpack and Chris, I’m really glad that you’re joining me today on Skeptiko to do just that. Welcome.\n\nChris White: It’s great to be here, Alex. I’m really excited about this interview. It’s a really unique opportunity and I’m looking forward to it.\n\nAlex Tsakiris: That’s great to hear. I have to start off by telling you I really think you’ve done an excellent job with this film. Very compelling; very convincing. And for an Internet, YouTube-based documentary, which I guess it essentially is, it comes across as so much more. It comes across as a really polished, finished product.\n\nI also have to say that while I was just saying it’s very convincing, I was someone who followed the Ancient Alien series on TV and found myself very persuaded by a lot of the things that they had to say. Your film came along and it really shook me up about some things. You present the information in a very compelling, well-documented way, too, where people can follow-up on your claims and judge for themselves who has the facts on their side. So great job.\n\nChris White: Thanks. Certainly my intention was to have it be a tool for people like myself who originally believed in the Ancient Aliens thesis and basically being a way for people to hear the other side of the story. That was really the purpose of it. Actually, it took quite a while to do all the research. There were some things in the research that I certainly was learning, too. So it’s not like I just knew all this stuff right out of the gates. It actually was the product of a good deal of research, as well.\n\nAlex Tsakiris: Tell us a little bit about that process. How did the film come to be?\n\nChris White: Well, this is something I’ve been talking about in various ways for a few years, on my podcasts and so on, and a lot of times people would write and say either, “I believe this or a friend or family member believes it. Where should I go to learn more or to help them with it?” A lot of times I would point them to people like Dr. Michael Heiser, who appears in the film and who I know you have had on the show. He’s got www.sitchiniswrong.com and a few resources that dive into it but there really wasn’t an “easy button,” as I’ve been calling it, to where you can say, “Here’s a comprehensive debunking of the main ideas of the Ancient Astronaut theory.”\n\nSo like a lot of things I do it was just borne out of necessity more or less, to be a tool. I wanted to put it in a form on the website where it’s written; it’s also sourced. Something that can actually be a genuine tool for others who want to expand further on it.\n\nAlex Tsakiris: What’s the reaction then? There’s been a ton of publicity. You have Joe Rogan, you have other pseudo-celebrities pinging it. A lot of skeptics pinging it. And a lot of views, right?\n\nChris White: Yeah, it’s doing really well. Certainly better than anything else I have done. There’s a lot of interest in this topic and I chalk most of that interest in the film up to an inherent interest that people have in the topic. But yeah, there’s been a lot of extra views and a lot of stuff that I would expect. Some die-hard Ancient Astronaut theorists as well as the skeptics, and really it’s all across the board.\n\nIt’s actually not as bad as I would have thought in terms of people actually challenging some of the strong points that I made. It’s a three-hour movie. There’s a lot of research in it. A lot of detailed stuff. I was sure that I was going to get something terribly wrong and that would be flushed out in the criticisms of it. In regard to the Ancient Astronaut theory and the debunking of it, I’ve been pleasantly surprised that there hasn’t been anything detrimental to any of the topics. So in terms of actual good criticisms, there’s been a few things but mostly it’s been standing up pretty well.\n\nAlex Tsakiris: I agree. You know, the first thing I did was go and Google the debunking of the debunking kind of thing. I found a couple of folks who were featured in the film had responses but not a lot. I mean, a little nibbling around at the edges but the basic thesis that you put forward, and it’s more than a thesis. The facts that you build, one on top of another, I didn’t see anyone really knocking those down in any substantial way.\n\nChris White: The best was by Philip Coppens who unfortunately recently passed away by a very aggressive cancer really recently. I certainly want to pay him respect and not say anything disrespectful here, but he did really the best comprehensive debunking of the various facts. I refuted that debunking, so there’s a debunking of the debunking of the—you get the idea. It’s on the website, my response to Philip Coppens. I would suggest that if anyone has seen that one to see my response to it because I find that many of the things he said were just not true.\n\nAlex Tsakiris: I really want to encourage folks to go to www.ancientaliensdebunked.com and watch the film. It’s 100% free, commercial-free, no promos for anything else.\n\nI also want to give folks a little bit of a sense for the kind of information that you talk about. Maybe one we can start with is the one that you start the film with. I love the way you just deal with this. You say, “Okay, here’s what Ancient Aliens, the TV show says is one of the most overwhelming bits of evidence for the Ancient Alien proposition and that’s the site of Pumapunku and the ruins there.” That’s the first one you start out with and say, “That’s the best. Let’s look at it.” Take us through Pumapunku and how that’s debunked.\n\nChris White: Well, this one is one that I spent a lot of time on, reading a lot of papers from archeologists and so on at the site. It’s basically part of a greater complex called Tiwanaku. Some people would argue that point and do so because of old-school Erich von Däniken, who is the guy who mostly started the Ancient Astronaut theory. He tries to distinguish between Tiwanaku and Pumapunku for his own purposes but it’s part of a site there that had some really interesting stone masonry.\n\nThese are the famous H Blocks that are often seen that look like big stone “H’s.” The main thing that the Ancient Astronaut theory will suggest is that these angles are too perfect and the stone-cutting is too amazing to be anything that any ancient peoples could have done. We could talk about what the site actually was and so on but the main thing is that the stonemasonry there at Pumapunku is not difficult to do.\n\nThere’s lots of things that they say are true about Pumapunku that are not. For example, they say that these stones are granite and diorite and therefore they’re too hard. Not only is that not true if they were granite or diorite but they’re not granite or diorite. They’re red sandstone and ambercite. They are not as heavy as they say they are and they’re not as in the right-angles as they say they are.\n\nI think one of the important points about all of this is that the culture that built Pumapunku was relatively recent by all archeological dating methods. There’s a lot of ways to date sites like these. You try not to take one particular way and try to take as many as you can and see if they are all adding up to get an idea of how old something like this is. We know the iconography there. It’s Yaya-Mama, which is something that is known about. It’s again dating the place.\n\nWhat I’m trying to say here is that it’s relative recent in a time when metalworking in that area in South America was really well-done. They were doing great things with metalworking. They were casting strong copper and alloys on-site. These are alloys that are usually part of a local ore that already came pre-alloyed, if you will, that they probably chose because they made stronger tools. But all that is to say these tools they were casting on-site or at least they were casting these brackets and things that were a part of the site on-site were more than enough to do what we see in the stonemasonry at Pumapunku.\n\nAnd they things that they say are impossible, things like these holes, they are not impossible. They would just require some pretty basic drilling techniques, techniques that existed 1,000 years or more before this in Egypt that we see being used all over the place. Things like Egyptian bow-drill kind of things. It could be any number of things, really. But that’s basically the idea. It doesn’t require alien technology to do this stonemasonry and it’s actually quite mundane when you get into the details of how they made flat surfaces on stone and that kind of thing.\n\nAlex Tsakiris: What I really like is the way you support that claim is by showing some of the other archeological finds there that you don’t see in the Ancient Aliens series. That really made me question how they were presenting the facts. What you do is you show some pieces of stone that are in process of being finished and you make the case that we can even see where they’re making these stones into the finished product.\n\nThen you also say where they were casting iron. Again, if this is at the site it makes you wonder why the producers of Ancient Aliens didn’t factor that into their equation. That really makes a strong case, I think, for what you are saying which is that it’s a slanted view in order to advance a certain theory. That theory is the Ancient Alien theory.\n\nChris White: I’ll just add to what you said about the importance of those stones that are in the process of being made. That is such a consistent thing in ancient stonemasonry in the quarries of all these places. I do think there’s one interesting thing in that it seems that ancient stonemasonry in all these different parts of the world seem to be done essentially the same way, whether it’s Easter Island, all the sites at Pumapunku, even in Egypt and other places where they’re making flat surfaces.\n\nThey all do it the same way. They start out with a sort of trough-like impressions made by a harder pounding stone than the rock that they’re working with. Then they finish it off with grinding tools. Sometimes they’ll do it in a way that I wish I had presented in the film because it’s evident at Pumapunku and Egypt and other places. They would drill holes and then put saturated wood in there in this line and it would form this crack and break off a side which they would then polish.\n\nBut anyway, that’s a really important part and it exists in just about every culture that is working with stones to the magnitude that they were.\n\nAlex Tsakiris: Great stuff, Chris. So your film, Ancient Aliens Debunked, has also gotten a lot of traction from the skeptical community. Not too much of a surprise that they would latch onto this, but what has that experience been like for you?\n\nChris White: Well, that’s an interesting question. The skeptic community has been supportive initially. Skeptic.com posted the video on the front page of their site and in fact asked me to do an article, which I think is coming out in the next Skeptic. I’m not sure about that.\n\nI tried to warn them before doing this. I said, “Look, you’re going to get a lot of heat from this because I’m a Christian and I think it’s just better if you don’t.” Honestly, I turned down other interviews because people weren’t aware when they were asking me for interviews that I was a Christian, and I knew just based on what happens when people post on a skeptic site and they’re like, “What are you doing posting this Christian da-da-da-da-da?” So I’m trying to say, “Look, just so you know, I’m a Christian and this is going to be an issue.”\n\nBut Skeptic.com was one that was saying, “Whatever. We don’t care.” They did put out an article after that which was essentially challenging. The main sticking points they had were my stance on the Nephilim and particularly the flood myths of ancient legends which I essentially said, “It’s probably based on some actual event rather than just a copying of texts and so on.” So that was the main thing.\n\nTo answer your question, I really like the skeptic community in that I think they’re ostensibly trying to look for the truth, but I feel as though—and I’m sure you would agree to an extent—that there are a lot of presuppositions in the skeptic community that really prevents them from doing their main job, which is to find the truth wherever it leads. That being said, I’m not saying that I’m right in everything that I said or anything like that.\n\nBut I do think that the skeptic community is beneficial and it’s something that I consider myself a part of to a degree. A lot of the things that I do are debunkings of nonsense and random stuff, so I consider myself somebody that likes to be analytical and debunk things. So in some sense I feel a kinship with the skeptic community even though I’m sure that they would not claim me in any way, shape, or form.\n\nAlex Tsakiris: I can understand. I think anyone who is critically analytically minded feels a kinship with the ideals of the skeptic community as it’s come to be known. But my experience with the skeptic community is that they’re completely not upholding those ideals. I mean, Michael Shermer, great, he published your thing and did an article on his website and his magazine, but I find them to really just be Apologists, more or less, for scientific materialism which, let’s face it, is really a cover for Atheism.\n\nThe thinking always starts with one conclusion; that’s for biological robots. There’s no soul, there’s no free will. Then it’s all just working backwards to only look at data that fits into that conclusion. So I just don’t find them being open-minded and critically thinking in that way. I don’t know. The kinship is there but I also see this just complete undermining of their values. They’re putting out one thing and really doing something else.\n\nChris White: Yeah, I totally agree with that. I think because it seems to me—and this is from the outside looking in—it’s almost like whatever it is that’s mainstream, like if the news reports on it that’s what we’re going to defend, you know?\n\nChris White: Like, the news says vaccines are good and I don’t know where you stand on that kind of stuff. We have to defend that it’s good or whatever. It’s like they’re just supporting whatever it is that is mainstream.\n\nI know that in the skeptical community I’ve heard certain skeptics make reference to this—that every skeptic has something that isn’t accepted and believes something that isn’t accepted in the skeptic community. I would suggest that there’s probably a lot more of that going on in the skeptic community but it’s like they can’t talk about it or do much about it because there’s such a strong “Oh, you can’t do that! That doesn’t fall in line with the party.”\n\nAlex Tsakiris: I completely agree. And that gets into a whole conspiratorial aspect of it that I think is very real and has to be looked at in a very serious way, whether you come to the conclusion that it is in fact conspiratorial or not. I think it needs to be on the table and that’s how can this group keep coming to the same conclusions over and over again that maintain the status quo? We know that the status quo isn’t always right. So how can we keep coming to that?\n\nVaccines is a great one; we won’t get into it here but if you just look at the character assassination that was done and where the facts really fall out at the end of the day, there’s many, many cases. You can look at climate changes as another one. I should really say global warming because that’s how it started and then it moved into climate change. Those are way off-topic for our discussion.\n\nWhat I think is relevant is I want to emphasize your point because I totally agree with it. If you are a part of that community you do have to step back and say, “When do we ever step out against the status quo? And since we don’t am I being manipulated by some other agenda here?” I don’t know—I just think it’s something that should be on the table but isn’t often on the table.\n\nAlex Tsakiris: So, Chris, your Christian beliefs have also become a hot topic of conversation as it relates to the film. Again, to emphasize to people, this is not a Christian-oriented film. It isn’t making a case. It isn’t evangelical in nature. But at one point you do come to talking about the flood mythology and you make reference to Noah’s Ark and as that being confirmed by nautical engineers. You’re a pretty open guy out there, you’re very public. If anyone pursues that at all, they find that you’re a pretty darned conservative Christian.\n\nI guess you’re supportive of the idea that the Noah’s Ark story has a realness to it and process that. You’ve got to understand, right, if people are astounded when they learn that you think a 500-year-old man built this big boat, loaded it up with all these animals from around the world, and cruised the oceans for a year. That’s hard for a lot of people to swallow that.\n\nChris White: Well, certainly we can talk about Noah’s Ark and that’s certainly something that’s come up a lot. The thing is, I think there’s a lot of general presuppositions about this that comes from the Sunday School version of Noah’s Ark and things like that. The text is actually quite technical about Noah’s Ark and it explains a lot of these things. I think the issue is very defendable. There’s been a good paper—it’s often referenced—called, The Feasibility Study, for a lot of things like that, like the different animals. How could you get them on the Ark, and so on.\n\nI would take a bit different view in that I don’t think you’ve got to work dinosaurs into the equation like I think is so often an unfortunate thing that has been a part of this defense. But the point is that the idea is feasible. One of the many things the BBC article thing did recently is like you can’t build a wooden boat that big because it would just crush under its weight. There’s been really good work done on that to essentially say first of all, there isn’t anybody saying that metal wasn’t a part of this. Even the Bible mentions metalworking was before this.\n\nI could go into the details but I’m not sure that’s the direction we want to go here. But all these different things about the Ark itself, I think have very rational explanations. If one takes the time to look into those things, I think you’ll at least come to the conclusion that there is a rational defense of this.\n\nI didn’t even defend any of that in the movie. What I defended was the idea that it was such a consistent story over virtually every culture in the history of humanity. And not just a flood story with various elements, whether it be eight people or animals and a boat and a dove or raven. Not just little details like that that are so conspicuous that we need to address them but other things. This flood and this whole boat situation was a result of some hybridization thing that happened and that was why the flood was sent.\n\nIt goes even further than that. Beings that were a part of that hybridization that were locked in some sort of abyss. It’s these weird consistent things. Now, not every story contains all of those elements but there’s pieces of it in all of these stories. What I was really impressed with was when Skeptic actually wrote an article saying, “We don’t have to deal with these stories they highlighted, for example, the Chinese flood myths.”\n\nI was impressed with Jason Colavito who is also a skeptic and certainly an Atheist or Agnostic. I’m not sure where he stands but he’s certainly not a Christian. He wrote another article saying, “Look, Skeptic.com just totally blew over this ancient Chinese flood myth.” He pointed out that this really is a connection. You can’t just simplify this and say, “Oh, it’s just a flood. We don’t have to worry about it.” He was saying that there are really consistent things and it really did happen. And at the end of the article he’s essentially saying to the skeptic community, “Look, I don’t believe Chris in this regard or whatever but these things are real and we haven’t come up with a good explanation for them.”\n\nThe problem, Alex, is that when you start to look at the similarities in mythologies, which was the whole point that I made in any of this, my point on the ancient flood myths and my point on the Nephilim, is that it doesn’t fit any pattern that anybody’s ever presented as far as the nature of civilization. No model makes sense of this. So they have to argue, “Oh, these similarities don’t really exist. They’re just sort of/kind of similarities. It’s an accident.” They had to argue a bunch of things that don’t actually work if you’ve been in the mythology, because the deeper you did and the older you go in the mythology it becomes clear. This is really something that is consistent. It’s the same story.\n\nWhat I suggested is that the best logical explanation of that evidence, if this is true that these cultures in different areas of the world as diverse as the Americas or China and Africa and Europe, etc., if they really are saying the same thing, then we have to say they migrated back to a certain point. They must have been involved enough at that point before the migration to all look at this, even if it was just a written text or mythology that wasn’t based on fact, they had to look at that text and say, “Okay, let’s all go teach our grandchildren that this is the history of the world.”\n\nAnd they taught their children and grandchildren that absolutely as if it was true for the rest of the generations that when they were asked, “How did we all get here? What’s the story of civilization?”\n\n“Oh, I’ll tell you. There was once this flood. At the end of the flood some people came out and da-da-da-da-da.”\n\nThat’s what everybody’s telling everybody else all across the world.\n\nNow, that’s the philosophical situation that we’re in and until somebody starts to stop saying that they don’t exist and admit that they do, then we can start having a rational discussion with skeptics and everybody else. But at this point we’re at really the Dark Ages of people owning up to it. Nobody’s challenged me on this. They’ve only said, “All you’ve cited on this were Christian Apologist sites and I can’t look into that because it’s a Christian Apologist site.”\n\nWell, okay, maybe it’s a Christian Apologist site but they are citing evidence there that they’re pointing you to the different mythologies in all the different places. You can go look at those mythologies and you can report back and say, “Well, I looked at them and they don’t exist.” But that’s not what you’re going to find. Anybody that actually does this work and is in deep in the mythologies is going to come up with it.\n\nI was just looking at something recently about the Aboriginal drawings that look like gray aliens. That is the same story. There was a flood. There was a boat. There were these Angels and they did this hybrid thing. It’s the same thing. This is in Australia. The Aboriginal thing that’s supposed to be like the oldest whatever—whatever, you know?\n\nSo we’ve got to wrap our minds around this and then we can come up with something. As you mentioned, it’s not a Christian film but if I’m trying to reach out to Ancient Astronaut theorists, they know this stuff. In my opinion, the only reason the Ancient Astronaut theory ever existed in the first place is because they were dealing with this truth first. They had to say, “Okay, this stuff exists. It was aliens.” That’s about as simple as it gets. And then they came up with a whole bunch of other stuff. Religion just piled on top of that.\n\nIf I didn’t address that, these ancient mythologies and their similarities, I would not have debunked the Ancient Astronaut theory. So I couldn’t leave it out. I knew it was going to get everybody mad and everything else, but I had to be honest. I think that a person who can do that regardless of the consequences is going to ultimately draw out better discussion from people than there would be if I had just left it alone.\n\nAlex Tsakiris: I certainly agree with that and I agree that it was the right move because it’s where you’re coming from. And to not misrepresent that but to put that out front I think is not only brave but as you just mentioned I think it advances the dialogue. So in that spirit of really directly addressing that, I’d like to step up and take it from a slightly bigger picture perspective.\n\nOver the last few years on Skeptiko I’ve had the chance to interview a lot of really well-credentialed people. People who have all the right degrees, are in all the right positions. Then you push them and you find out they wind up believing a lot of pretty strange stuff or stuff that you can pretty quickly find is not supported by the best evidence we have. I think a lot of Atheists will fall into that category. For anyone who has listened to this show, you probably know some of the cases that I’m pointing to.\n\nSo this whole issue of why we believe what we believe is very interesting to me. I think it’s central to the Ancient Alien theory, to the Christian Apologist line of reasoning, and to the consciousness extended/consciousness supernatural stuff that we’ve spent more time on. I think it really is at the core of it because it really is about belief.\n\nWhen we were talking a minute ago about Michael Shermer and the skeptical community, I could give you example after example where they’re confronted with just the kind of evidence that they say they want—peer-reviewed studies, top doctors, and they just either deny it, twist it, or ignore it. That comes up over and over again.\n\nI like that you’re willing to push out there with stuff that you know is going to be unpopular; you know is not going to gain you a lot of fans and yet you want to advance that.\n\nSo let’s push into that a little bit. I guess I have to start by saying that the problem I have with a lot of the things that you say about the flood myth is that again it seems to immediately go into this Apologetics mode.\n\nIf I just had to listen to the last part of what you were saying about there’s this common mythology and you can point out the different mythologies and all the rest of that, I’m nodding my head like okay, great. But I know where you’re going with it. I think I do. And I think where you’re going with it is that these books that you have that we call the Bible are therefore the only books that we should rely on for understanding our true nature, for understanding our relationship with anything divine, anything more, God I guess is what we’d say.\n\nWhen you really break that down it just doesn’t fly. I think that’s borne out in the statistics. A recent phenomena of the Internet is this idea of crowd sourcing and that the crowd really knows more than the eggheads in a lot of topics. I think obviously that’s sometimes true, sometimes not true. But I think it is true and if you look at what the crowd says, the crowd says God, yes—90% say yes. Heaven or an afterlife, again a huge percentage of the population says yes.\n\nBut you move in and say, “Is this one book that we have the sole source of knowledge about that God,” statistics go way down. A vast majority of people say no. That just doesn’t make any sense from all the different data that we’ve pulled together.\n\nSo isn’t there some wisdom in that? How can we really fit our worldview and back it into this idea that these fragments of books that we found are really the sole source of all the knowledge we ever need to know about God?\n\nChris White: Well, there’s a lot of things there. First of all, I would say that in terms of epistemology, how we know what we know, and this whole thing is about truth and that is the bottom line. There’s no other pursuit. If something isn’t true then you shouldn’t believe it. This idea of blind faith is not a concept in Christianity. It’s a modern concept that skeptics of Christianity put on Christians. The Bible doesn’t want you to believe anything that isn’t true.\n\nPaul says, “We of all men are most pitiable if this isn’t true.” Christianity is a belief based on things you can test. Things that are empirical. I think you could sympathize with this and have a worldview that a lot of people that claim a very scientifically-sound worldview would snub at. You’re saying, “No, no. I looked at this. I talked to the people. This is something that is real. You can be empirical about this. You can test this and there’s something we need to deal with here.”\n\nThe only difference between your plight there and mine is that we’ve both looked into our respective fields more than each other. We have presuppositions about the ones that we haven’t looked into. The idea of the Bible being the one set of truth, when you ask people about this—and I’ve certainly found this—the main thing out of somebody’s mouth is something to the effect of, “We can’t trust those books. They’ve been written over and over by men. They’ve changed so much.”\n\nI find that people really have no concept of what they’re even trying to argue about there. The idea that they’ve changed so much over time is something that you can test with great accuracy. If they have changed so much over time as just about virtually everybody on the street will tell you they have, it would be the easiest thing on the planet to prove. There are copies and manuscripts of the Bible from different time periods and different continents that agree within 99.5 degree accuracy. That’s astounding.\n\nI’m not claiming the truth of that yet. I’m just saying that we must agree that these things haven’t changed over time and that was just a starting place.\n\nAlex Tsakiris: I don’t want to go down that path necessarily. We could; it’s interesting to me but I want to redirect it in another direction, not to cut you off but to get your opinion on this. It’s something that we touched on in our email exchange and I think it’s really an interesting point that doesn’t get talked about a lot. That’s the supernatural hypothesis, you know?\n\nWe had a little bit of an email exchange back and forth and at one point you said, “I think a lot of the criticisms against Christian Apologetics is based from this kind of non-supernatural perspective.” Basically, scientific materialism. It starts with the assumption that there can’t be anything supernatural, therefore—so they’re doing Apologetics on the other side.\n\n“You’ve never seen anything supernatural in your life, have you folks?”\n\nEveryone’s thinking, ‘Well, yeah, I have,’ but they’re nodding their head, ‘Yeah, yeah, there’s nothing supernatural.’\n\nAnd then from there they go, “Well, how can you trust any of these things that these people are telling you?”\n\nI want to go down that path because it’s something that doesn’t get talked about. Let’s assume the supernatural, if you will, because in the work that I’ve done in terms of consciousness, parapsychology, near-death experience, out-of-body experience, wherever you look, you find what you could call supernatural. I think it’s a natural fact that we have to deal with. I know that’s a contradiction in terms but the evidence strongly suggests that this does happen.\n\nBut if we incorporate that in, how does that fit into then your worldview? It seems that Christians have as big a problem with that part of it as they do with overcoming the skeptic who says, “No, nothing supernatural could ever happen.”\n\nChris White: I think the baseline here is still epistemology. How do you know what you know? If something is supernatural—and I would certainly agree with just about everything that your studying and have on the show that they exist and there’s a real phenomenon there. That’s really not the question. Whether or not it’s existing, I think probably one of the reasons we are all struggling about what is true is because we tend to find something supernatural that happens.\n\n“Hey, wow! This supernatural thing is genuinely real. Hey, everybody, come and look. Everybody see this supernatural thing is genuinely real.”\n\nThey presume that whatever theology is presented in that supernatural context is therefore true. Just because it’s supernatural doesn’t make whatever it is be true. A good example would be a lot of the channeled material and different things that happen in that regard. People can channel a genuine entity. I don’t know where you’re at with that—some of this stuff, and automatic writing, and you can actually see these entities are saying something that’s not true. For example, the 2012 stuff all started with channeled material. They say stuff about the pole shift and the galactic alignment that is scientifically provable to be false. But stuff that was so difficult, so brilliant in a way, to ever be borne out, to ever be found out, that nobody would ever catch them on.\n\nI would say there’s deception in the supernatural world and that changes how one deals with what is true. So you have to keep coming back to how are we determining what is true or not?\n\nAlex Tsakiris: I want to roll you back to the very first thing that you said, which was that some of this channeled material seems to be legitimate although some of the facts of it are then contradicted by modern science. But somewhere in there you said that there’s some realness to this channeled material. Did I hear you right on that?\n\nChris White: Yeah. And I would say the same thing is true with all the stuff that you’re dealing with. The ESP phenomena and so on. We could go on down the line.\n\nAlex Tsakiris: Here’s the problem then, Chris. If there’s some realness to the channeled material and I find the same problem that you do—you take these amazing books that have been written. A lot of folks really are into the Seth material, you know? There’s some beautiful stuff in the Seth material. Then there’s some other stuff that’s just wacky and completely contradicts what we know about modern science, modern neurology, all the rest of it. So what do you do? Do you throw it all out?\n\nI think the challenge is even greater for the Christian person. You take A Course in Miracles. It’s a book written in the ‘70s, purports to be channeled or at least directly inspired by Jesus. How would we ever establish whether or not that was true, more true, less true, than scripture? Because a lot of scripture is essentially channeled material, more or less.\n\nLet me add this to it because I think this is important, too. What do we do with the fact that thousands and thousands of people have been inspired and drawn to a life and a relationship with Jesus Christ through some of this channeled material that you may or may not like? A Course in Miracles or Conversations With God, another bit of channeled material that seems to be very in keeping with a lot of Christian ideals, a lot of Christian doctrine and more importantly, is personally meaningful to people. For those people it strengthens their relationship with Christ.\n\nHow do we just throw all that out and say, “Wait a minute. It’s not Biblical. We can’t tie it back to the archeological records, therefore we have to throw it out.”\n\nChris White: Well, I think it starts with what Christianity is. None of the Gospels or the New Testament writings are anything like that. They’re not just talking about good ideas. It is Luke starts out, “I write this to you, most excellent Theophilus, so that you might know for certain…”\n\nChris White: I’m doing the research here. I’m going and talking to all these people and researching this stuff. It never stops being exactly what it claims to be. This is Paul writing a letter to churches describing what happened to him and what’s going on at that time.\n\nChris White: The Gospels are saying, “Look, I was there.” This is what I’m saying—there are people describing actual events. So it’s really not about “Hey, they wrote some good stuff.” They’re saying, “No, no. We’re going to tell you about this dude and what he did.” They’re saying, “Look, he rose from the dead and we all saw it. There were 5,000 there at that time. You guys all remember when this happened.”\n\nAlex Tsakiris: But Chris, hold on. Let me…\n\nChris White: There are things that are empirically testable within those claims. These are claims of actual things that happened. Now I’m just saying that based on what they are saying in terms of they’re making factual claims consistently. There is hardly a page of the New Testament that isn’t something that you could be like they’re either lying or that didn’t happen. And so you can test it. There are various ways you could go about testing it.\n\nNow in regard to the channeled material, they talk about Jesus and they say nice things about Jesus and you say therefore that they have a relationship with Jesus…\n\nAlex Tsakiris: No, they say that they spoke with Jesus. I’m not trying to cut you off to stifle the conversation. I’m just trying to redirect the conversation. The conversation we’re having right now I haven’t heard before. I’m sure other people have had it. I just don’t hear it very much and that’s that you and I believe in the spiritual, okay?\n\nSo I accept not only the possibility but the probably reality of Christ Consciousness, right? So Christ Consciousness is there and it’s present. I accept that it’s in our conversation here and that I can tap into it and I can have a relationship with that Christ Consciousness. And I accept that you can tap into it and you can have a relationship with that.\n\nI don’t have to support that completely scientifically but I can say that it’s a pretty logical conclusion from just processing the data and saying, “Well, it does seem like consciousness is a reality. We’re not biological robots. It seems like consciousness does survive death and there does seem to be a hierarchical nature to consciousness and therefore God. Then I can mix in this idea that Jesus seems to be a real figure and many, many people have experienced that consciousness. So I’m right there with you, I think, on most of this stuff.\n\nWhere I don’t understand the divide is when Donaldson comes along and says, “I connected with that Christ Consciousness and I wrote this book called, Conversations With God, and I wrote it in the 1990s.” Why not? Why can’t we accept that that is a real possibility? Christ Consciousness is interacting with all of us. Why not interacting with Donaldson to write these books?\n\nChris White: Again, it comes down to the fact that supernatural experiences don’t equal truth. Everybody that has a genuine supernatural experience where some being came and talked to them doesn’t mean that being told them the truth. At the end of the day…\n\nAlex Tsakiris: That doesn’t mean that they didn’t.\n\nChris White: I think we’re in a good position here, Alex, because if we accept that there are beings in another dimension, however we quantify that—that can be a technical discussion. I don’t know how many dimensions there are. Let’s say there’s ten. And if we interacted with them and they’re in some way able to interact with us, let’s say they’re physical beings just as real as you and I are. Now if we agree that they exist, then I think anthropology is one of our best tools in terms of science to figure out what their motivations are, what they’re like, what their abilities are.\n\nThat becomes the most important thing in the world of everything we could ever do right now to figure out what they’re like. I think when you go back into anthropology you see a consistent profile of these beings. They’re summoned the same way; they’re consistently referred to as evil, deceptive, very, very intelligent, have an agenda of sorts, seek and accept worship. But I think the deceptive thing is really what comes so clear from Sumerians forward. These things will tell you what you want to hear.\n\nThey are often referred to in the texts as “watchers,” people that are observing you. They know what books you’re reading. They know what to say when you have the Ayahuasca trip and they know how to stroke just exactly what you’ve been reading on the plane trip to Peru. They have an agenda and unless we realize their agenda—and you’re saying, “Oh, you’re talking Christian theology right now.” We’re talking just truth right now.\n\nIf we can accept some of the basic premises that I just said, that there are beings and that people all across the world know how to summon them from time immemorial without Christian biases and are saying the same stuff, deceptive, super-intelligent, able to interact and give thoughts to and possess and are seeking possession. Possession is not a concept unique to Christianity and it’s always negative.\n\nWhat I’m trying to say is unless we have come up with a good epistemology about that phenomenon, we should not accept all this other stuff. “Oh yeah, that was the Christ Consciousness, sure. It said it was Jesus, after all.”\n\nAlex Tsakiris: But we shouldn’t discount it, either. I’m glad you went into the evil category. I don’t know if we can get there but I think it’s another thing that you’re brave about and I just agree with you. You have to put it on the table because it clearly comes through over and over again as a consistent part of the human experience. We have to understand that and not be afraid to go there despite the way our modern culture wants to deal with it.\n\nBut I come back to the same thing because I do think you’re flipping back and forth. Of course, this is going to be my perspective on it in that it does come down to how we would test it. I’ll give you another small example and I’d love for you to comment on it. Most people who have studied the Bible know this, but when you look into the book of John and Jesus says, “Let he who is without sin cast the first stone,” that famous story, beautiful story, very much in keeping with what anyone who is raised as a Christian thinks about Jesus.\n\nBut then we find out through Biblical scholarship that that’s not an original part of the scriptures. But for hundreds of years it’s inspired Christians; it’s driven Christians to be better Christians.\n\nSo what are we supposed to do? Are we supposed to be slaves to the latest archeological discovery and the approval of some Biblical scholar? That’s where I say if we just step back don’t we know by common-sense that we’re never going to get to the bottom of what was really said about this person’s life 2,000 years ago? It’s always going to be wrapped in mythology and mystery and mistranslation and all the rest of that.\n\nChris White: That’s exactly my point. You say that we know that Jesus didn’t say that but do you know why they say that they know that Jesus didn’t say that? It’s certainly not an archeological thing.\n\nAlex Tsakiris: Well, in any of the Greek translations…\n\nChris White: Sure it is. That’s the oldest copy we have of the early manuscript texts. What I’m trying to say is that if you understand why they’re saying that it’s because of the presuppositions.\n\nAlex Tsakiris: I’ll back off of the John thing and go research it. But my understanding of it is—and I think my source on that is Bart Ehrman, who some people in the Conservative Christian community don’t like but you have to agree is a pretty top-notch Biblical scholar. My understanding is most Biblical scholars agree that it isn’t in some of the very earliest translations. But I’m going to back off that. I’m going to go do my independent research and I’ll add an end note where people can go and look at both sides of that.\n\nI’d rather get back to the question of do you really think that at the end of the day, Chris, you’re going to wind up with this perfect book that has everything you need to know about God and your relationship with Him?\n\nChris White: Let me put it like this. When I first started all this stuff I didn’t have any of this confidence in the Bible or anything. It’s been seven years now of people who are brilliant people sending me things like, “Hey, you haven’t checked this out. Look at this thing or that thing.”\n\nI’ve been doing videos and Apologetic stuff for at least that long and every day my inbox is filled with critics. Stuff that I haven’t heard before and stuff that if it is true, then I’m wrong and Christianity isn’t true and I shouldn’t believe it.\n\nChris White: I don’t want to believe something that’s not true.\n\nChris White: Now what I’m saying is over the years of looking at that stuff and being like, ‘Okay, I have to figure out whether or not this is true. I have to now go look at this and see if this is true. Is this contradiction real?’\n\nI can tell you after all those years that’s the reason I have the confidence right now. The only reason I would even give the Bible faith at this point is because after so many years of letting it show, ‘Look, I’m right about this,’ it continues to validate itself.\n\nI can honestly tell you, Alex, without any hesitation that there aren’t any parts of the New Testament and things that I used to think were true, I’ve seen the websites that say, “Well, it’s not true because of this thing or that thing.” And it’s not. All of that stuff has more than sound, logical explanations and anybody who has those things, “Well, I know it’s not true, Chris, because I know this one thing,” just Google that exact same thing. Just cross-reference it with an Apologetic site first. I’m not saying go to Apologetic sites but at least hear what they have to say and see if it’s a logical explanation…\n\nChris White: If there’s a logical explanation then you can be like, “Okay, there’s one for you, Bible, but I’ve still got 59 that I’m not going to believe you.” Maybe try the 58th.\n\nAlex Tsakiris: I don’t find it very convincing at all. And when I listen to folks like Bart Ehrman debate Christian Apologists I think it’s so one-sided that it doesn’t even bear to be a fair fight. But again, that’s not the issue to me. The issue to me is something you blew past. The Bible can be this somewhat humanly flawed document that I think it is and it can still be the most important document in someone’s life because it can bring them in relationship with God.\n\nIn my cosmology, God can be big enough to reflect perfectly that Christ Consciousness for someone and bring them as far as they need to go in their development. And at the same time, God can reflect to the Buddhist follower Buddha Consciousness perfectly and draw them to a path towards God. I don’t see a problem with that.\n\nI don’t see the support for what you’re saying that gee, if the Bible turns out to be something less than this perfect inerrant document, then Christianity fails. Of course it doesn’t fail because this whole thing works at a level that is way beyond what we understand. That’s what we already know.\n\nChris White: Mutually exclusive is the word that I would use in regard to that. You say that this all works because this Christ Consciousness idea is saying things that are beneficial to people. If we explore those kinds of ideas, generally it’s something to the effect of ‘Hey, once we all realize that we are innately divine and we start working on that practice then eventually we can become one with God,’ or something like that, that’s a cosmology that’s a claim of fact that is mutually exclusive from the Jesus of the Bible that at least has some evidence in history that he says these things.\n\nThere is no evidence in history that Jesus said anything like the Christ Consciousness idea but there are things that He said.\n\n“I am going to raise up the dead at the end of time. Me personally. I’m going to raise up everyone and I’m going to judge them.” That’s the kind of stuff that this guy says. Now, He says stuff that doesn’t quite jibe.\n\n“If anyone comes to me and does not hate his father and mother, wife and children, brothers and sisters, yes his own life also, he cannot be my disciple.” He says, “Look, I have to be #1 in your life. Everything else by comparison must seem to be hate if you’re going to be my methetes.” That’s the word that’s sometimes given to Socrates or something. If you’re going to be a methetes you’re going to try to be mine but it’s not going to work unless I am #1.\n\nWhen people suggest this is the real Jesus, they’re doing so with no historical reason to do so and they’re doing so despite everything that the one historical guy says is the antithesis of it. I would say that the bottom line is that Christianity isn’t a bunch of rules that you follow. It’s a supernatural thing that happens to a person that is measureable.\n\nI bet, Alex, that you know somebody in your life that is kind of hard to explain but you knew them before they were saved and then afterwards you might think they’re a different person. That’s what it means to be born again. That’s something that actually is a real, measureable thing. Their heart changes; they desire good things and begin to hate bad things. It’s something that is real, not a bunch of rules. There are a lot of people that claim to be Christians that simply aren’t and that’s because of modern evangelism and things like that but I won’t get into that.\n\nAlex Tsakiris: You know, it’s funny. You’ve really led us back to the really hard part for me. There’s a lot of agreement in me with what you’re saying but I’ve just experienced through this show and through my research many, many people from all different kinds of religions and cultural backgrounds who have had these kinds of profound spiritual experiences that you’re talking about. And anyone can see them and see that they’re changed people. Their family can see they’re changed people. They’re more loving people; they’re more connected people; they’re more Godly people.\n\nWhile those kinds of experiences obviously fly in the face first and foremost with the Atheists, scientific materialism that insists we’re all biological robots, we don’t have any free will, all that stuff that they cling to so dearly, when you really study those kinds of experiences, modern day experiences with modern day scientists like researchers have done—and the kind that I’ve talked to on this show—you also come to the conclusion that it doesn’t fit into the Christian worldview, either. It contradicts it in some important ways that we would test, we would predict. It doesn’t fit.\n\nChris White: It comes down to the supernatural experience. You can have a Kundalini experience and you can have your whoever is telling you to do that tell you that means so-on and so-forth. There’s no doubt that something supernatural happened but what did that do to you? You can say it did something great. You can have an experience like David Icke who has these beings tell him he’s going to change the world and all this stuff.\n\nBut a lot of these people that I find are claiming to be enlightened now because they’ve had something supernatural happen to them in terms of a supernatural experience like going on a Ayahuasca trip or taking DMT, seeing an entity, have it tell you something cool or something that sounds good, that does not equal truth.\n\nWe still have a whole bunch of criteria that we need to apply to those things based simply on the fact that basic demonology—I’m not talking Christian stuff although Christianity has a lot to say about it—demonology is something you can get from other places. It suggests that that’s no great feat. Even Terrence McKenna said, “Look, it’s not a big deal to hear a voice in your head. The big deal is trying to figure out if that voice is telling you the truth or not.”\n\nAlex Tsakiris: Yeah, but those aren’t the people I’m talking about. I’m talked about the pious, devoted Buddhist monk, Hindu practitioner, just the beautiful people that we encounter in life that…\n\nChris White: I would say that’s a presupposition. I would say that if you understand Buddhism you would understand that none of them are claiming to have done the very thing that Christianity starts with. If you actually understand what the Noble Truths…\n\nAlex Tsakiris: I’m talking about the product of it. I’m talking about their life, the way they live their life in a way that we can observe and through generations…\n\nChris White: The way they live their life seems to us to be pious because they’re not eating that much rice. They’ve given away their possessions. They’re going somewhere and they’re on this path, right?\n\nAlex Tsakiris: No, it’s what they’re saying.\n\nChris White: We interpret it as that must be good…\n\nChris White: They’re following rules. In Islam—we have a lot of views about Islam—but they have a lot of rules that say, “Give to the poor. Fast. Be nice to people.” Those are rules that they’re following because of threat of whatever. Buddhism is a little different…\n\nAlex Tsakiris: You can’t generalize like that, Chris.\n\nChris White: I did a video one time that actually analyzes and I think you would appreciate it because it’s a factual thing. I think it’s dangerous when we say, “Oh, we know that these people are just as good.” I think you can analyze—not their personality. I’m not talking about whether they’re good or not but you can analyze the very tenants of what they’re trying to do. And I think very few times do people understand Hinduism or Buddhism or Islam or any of these things…\n\nAlex Tsakiris: Chris, how many Buddhist monks have you met? How many Buddhist monks have you encountered and really sat down and experienced and talked to?\n\nChris White: It’s really not about the individual; it’s about what they are claiming that any individual would claim…\n\nAlex Tsakiris: How is it not about the individual? It’s only about the individual.\n\nChris White: Because nobody has reached the very thing that they need which is freedom from Nirvana or getting to Nirvana. Show me a Buddhist that would claim that right now. Everybody’s saying, “Oh well, the suffering is caused by tanha.” Tanha is sin. It’s our desires to do bad things that we don’t want to do. That’s the reason that any Buddhist is trying to do the ascetic practices. They try to eat less rice, go onto a hill, do whatever because they’re trying to defeat the innate desire to sin. Now, that’s their path.\n\nIf you understand that they’re hoping that one day, if they do all the right meditations and they eat the less food and they give away enough possessions and they’re nice enough to people, it will happen and they will be diminished in their level of desiring to sin. That’s Buddhism. That’s why Buddha broke from Hinduism.\n\nAnd I think that people don’t even get what Buddhism is. They just see it in sort of a Western sort of New Age idea that it’s an alternative to Christianity. It’s not an alternative to Christianity. Nobody even gets it. They’re saying, “Hey, do this. You might get this. But it’s not going to take this lifetime. In fact, we don’t know anybody that’s ever done it. Maybe it will take 80,000 lifetimes.” It’s a sham.\n\nAlex Tsakiris: I would recommend Living Buddha, Living Christ by Thich Nhat Hanh, Nobel Prize nominee and a great spiritual teacher in my opinion. I’ll leave it with what you said. I don’t agree with it but I’ll leave it there because you’ve been very generous with your time. But I want to use your time wisely.\n\nI want to move on to talk a little bit about Dr. Michael Heiser, who is featured prominently in your film. He’s a Biblical scholar, ancient languages scholar. I listened to the interview you did with him on your podcast, “Nowhere to Run,” which I would also recommend for people to check out. It’s free. You can subscribe to it on iTunes. There’s some good information there, as well. As you mentioned before, he’s a guy that I’ve had on this show and we talked a little bit about that supernatural aspect to Christianity that doesn’t often get incorporated into that.\n\nAs I listened to the interview you did with him, I found out that while he has these ideas about the Ancient Aliens and the Sumerian texts which stand up to scrutiny, he also comes across as having some pretty—I don’t know—strange ideas about the UFO phenomena. For example, he believes in Roswell but he thinks it was Nazi technology that was secretly engineered by the government and they did this kind of cover-up as a double psi-op switcheroo kind of thing. What do you think of his position on the UFO phenomena? Is that where you’re coming from, that none of it could possibly be real? What do you think?\n\nChris White: Well, there’s a lot of different aspect to the UFO phenomenon. I would say I’m not an expert on the Roswell incident. From my understanding there are a lot of good things to research there. There’s been a lot of books written about it and a lot of real things that, if you will, are anomalies about it.\n\nI find that his explanation that would make logical sense if this was a part of Project Paperclip or Operation Paperclip where we took Nazi scientists at the end of WWII. Obviously, that would be a bad PR thing if all of a sudden we were using Nazi scientists and they crashed this craft that was being worked on with the Nazis. It’s a pretty standard craft. You can go look at it. It’s a predecessor to the modern-day stealth technology.\n\nIf it had been crashed back then, especially if there were people onboard, using Nazi scientists there would be reason to cover it up. That’s a logical explanation as far as it goes but it’s not something I know a whole lot about.\n\nSomething I do know a lot about is some of the other issues. I think Heiser probably comes more from the UFO area. He was interested in UFOs so I think he has a lot more to say about that kind of stuff.\n\nAlex Tsakiris: But as I understand it, he doesn’t accept any reality to the UFO phenomena in terms of it being extraterrestrial, in terms of it being from an engineering standpoint beyond what we’re able to produce here. Do you share that opinion?\n\nChris White: Well, in terms of the crafts that people see in the sky he would say that most of what people are seeing that’s genuine crafts are Black Project government stuff.\n\nAlex Tsakiris: Most or all?\n\nChris White: I don’t know about him but I would say most. I think there’s another aspect of it that’s…\n\nAlex Tsakiris: Do you think the other aspect of it is demonic?\n\nChris White: Well, yeah. I think that if you go to John Mack and his stuff on alien abductions it’s a good place to start. When Mack started doing the research, he noticed that everybody who was coming to him were pretty much hard-core cultists to the degree that he actually came up with a form that they had to fill out called, “Supernatural Belief Scale.” It’s still used today in sleep paralysis research, called “Revised Paranormal Belief Scale.”\n\nIt will ask you questions like, “Do you believe that black magic is a good thing,” and all these sorts of things to quantify the fact that everybody that’s having these experiences where these beings are actually torturing them and stuff like that are also people that are involved with some of what we would commonly call the occult.\n\nAlex Tsakiris: So there aren’t any Conservative Christians, Bible-believing Christians, who’ve had the contactee/abduction experience as far as you know?\n\nChris White: No, Christians can experience a demonic attack like this. One of the projects that I do is called www.stopsleepparalysis.org. A part of that is something called www.sleepsurvey.org. We’ve now had 1,300 or so responses to surveys about sleep paralysis. This is kind of an off-shoot of alien abduction, very similar. I would say most alien abduction experiences are just a severe version of sleep paralysis.\n\nOne of the repeatable things that you can find is one of the things we’ll be publishing in two main articles. If the scientific community didn’t have an anti-supernatural bias, the articles that we’re going to publish would finally put a nail in the coffin that this is, in fact, dealing with—how to say it? That occult practices and the degree in which you practice the occult has a direct correlate to the amount of and severity of these attacks, sometimes referred to as sleep paralysis or in the severe cases, alien abduction. Oftentimes it’s things like incubus and succubus that is doing the sexual violations in these.\n\nThere is an unbelievable correlate. I mean, the same people who are saying, “Yes, I do this and I do this and I channel and I do this thing and that thing,” are the same people who say, “I have it at least two or three times a week and I’m often getting sexually violated,” and so on.\n\nAlex Tsakiris: How do you define occult practices in terms of what you’re talking about?\n\nChris White: Well, you can go to the website, www.sleepsurvey.org and you can see there’s about 90 or so questions on that survey. One section has a great deal of occult checkboxes that are varied. Anything from, as I mentioned, channeling to Tarot cards or ancestor worship is an extreme version. Different things like that.\n\nChris White: Psychic abilities is a term of doing something. I’ll tell you this; you can’t “do” a psychic ability but there is a question on there, “Do you experience any other paranormal experiences?”\n\nThe second article that we’re going to publish is actually related to that in a sense in that anybody that’s saying that they have had paranormal experiences, including psychic phenomenon, from an early age—in the survey we’ve determined eight years old and under, just sort of an arbitrary number, basically trying to find anybody that either says, “I’ve had this since X amount,” or something like, “I’ve always experienced this.”\n\nIf a person checks that box or in some way says, “I’ve been experiencing this supernatural phenomenon since an early age,” they will almost 100% of the time—this is 1,300 individuals—they will check a box that says either, “My parents or grandparents were involved in the occult,” or “My parents and grandparents were involved in some paternal organization like Freemasonry.” I can explain why that is often a correlate.\n\nOr the other one that they’ll check is, “I don’t know whether my parents or grandparents were involved in this.” Perhaps they were adopted or some other thing. In the literature today, they’ve tried to make this connection and say it’s genetic. But what this paper is going to say is it’s not genetic. It’s not based on genes. That’s what they have to say because they are noticing that “My parent is also experiencing the same thing.”\n\nBut I think what the survey does is say conclusively that it’s not about their genes because if it were, then everybody would be checking something to that effect. This is something essentially saying that there is a generational connection. The reason is, for example, in Freemasonry there’s oftentimes rituals. The person doesn’t know what they’re doing in these rituals that they’re doing but essentially they’re giving away—the parent or grandparent has authority over their children to a certain age in the spiritual sense and essentially these rituals are designed to give that authority away to what they probably think is some benevolent force.\n\nBut that’s how that realm operates. As I mentioned, they’re incredibly brilliant. That’s the first thing you need to know about them. Secondly, they have an agenda and part of their agenda is to get people to what we call “open doors” to this.\n\nAnother thing that I would like to say in conclusion about this point is that in regard to sleep paralysis and experiencing these attacks, science has no explanation for it. They have no cure for it. They’ll tell you there is no cure. But I can say over hundreds and hundreds of cases that there is a cure. You can stop this from happening to you for good.\n\nIf you are experiencing this and you don’t want to—and I can tell you of 1,300 surveys there’s hasn’t been but five or six people that have checked the box that these things were good or neutral. They were all checking that they were evil, even when they pretend to be good. Just behind their smiles you can tell they are not good and they don’t like you very much. So what I would say is that there is a way out.\n\nAlex Tsakiris: And of course the way out is through Christianity.\n\nChris White: Initially it can essentially be calling on the authority of Jesus Christ to stop the individual attacks. The person doesn’t have to become a Christian to stop the individual attacks but they will keep coming back.\n\nAlex Tsakiris: And from your research into this area, what is the relationship between Christian followers and contact with aliens?\n\nChris White: Oftentimes if a person is coming from an occult background or some other kind of thing where they had a large amount of open doors—perhaps they were doing Reiki or some kind of extreme thing of channeling—it’s sort of like if the person was an alcoholic, they may be completely gone from the desire of alcohol but they may still have a few scars on their liver. The good thing is that there is a regeneration process. If somebody has been super, super far down the road of the occult they may have—I think of it as a porous protection that needs to be rebuilt.\n\nI would also submit that just generally speaking, a Christian can get very sporadic cases of this for lots of different reasons. For example, I’ve had over I don’t know how many years three cases of sleep paralysis. The main thing is that that’s the whole reason why Christians have been given this authority. In Luke 10:19, Jesus gives authority to Christians and says the spirits are subject unto them. He does it because He knows that they’re going to try, so He’s given us this massive weapon. Trust me, the only thing that that realm is afraid of is His authority. We can even see that in the Bible. They tremble at it and they should.\n\nAlex Tsakiris: Chris, don’t you think people are going to be frustrated again with the idea that it’s the old loophole, you know? If you are Christian and had these experiences, then there’s something else non-Christian in your background. I don’t quite understand the…\n\nChris White: For example, there was this lady who was in a witch coven and she was getting sexually violated on a regular basis by these things. She became a Christian. She is no longer experiencing this. It’s an amazing thing for her to not be sexually violated by this entity. They’re coming with great infrequency. I’m talking about maybe a very mild thing once every two months. But even in that two months it only lasts briefly because she now uses the authority that she knows she has.\n\nSo it does sound like that, I agree. It’s like, oh you’re saying they still get it. But no, it’s not the same thing. In most cases when they’re not that severe and the person wasn’t in a practicing witch coven or whatever it was, the light switch is turned off. So there is that kind of correlation. It’s not a mild thing.\n\nAlex Tsakiris: Yeah. It’s an interesting topic. I look forward to reading your paper. The research that I’ve done into it suggests that there just isn’t that 100% correlation that you’re looking for. I would tie it back into the near-death experience. That’s as close as we can get in modern science to really look at what lies beyond that veil, beyond that door, is the near-death experience.\n\nWhen we look at those accounts, universally what people come back and say—I should say almost universally, otherwise I’ll fall into the same trap—that God is bigger than just Jesus. God is bigger than just Christianity. It comes through across cultures, across times, from people who are Atheists, from people who are Christians. They’re all saying the same thing.\n\nI think similarly across the contactee experience community, which is something I’m just now getting into, there’s just a wide variety of experiences there, from the spiritual mystical to the very dark demonic. I think if we don’t look…\n\nChris White: I think that’s an important point. And look, the original thing that tipped me off to this whole thing back when I believed all the Alien Astronaut stuff, I was just doing research into alien abduction phenomena. What are these aliens telling these people? That’s what originally made me think something was wrong because these things came from millions and millions of miles away to badmouth some dude that lived 2,000 years ago. That’s like the main focus was, “Hey, by the way, Jesus wasn’t that great. Let me tell you about how He’s not that great.”\n\nAlex Tsakiris: That is not—let me tell you, I’ve looked into it enough, Chris. That is not an overwhelming message from the contactee community.\n\nChris White: I’ll say this. I think you as a researcher into near-death experiences, and I could probably Google and find 10 of them right now and would get contradictory accounts about what the afterlife is like. It’s certainly not a universal description of what the afterlife is like. I’m sure you would have to admit that.\n\nChris White: So if we’re dealing with contradictory accounts, people saying this is how it is over there, and yet they almost never agree on major points, we need to come up with a new epistemology. We need to figure out how we’re sifting through that because if it’s completely contradictory then how are we going to resolve that with great confidence that we’re doing the right thing in terms of that epistemology? So I think it’s more dangerous to just take these accounts at face value without at least taking into account that there could be something else at play.\n\nAlex Tsakiris: Chris, so Ancient Aliens Debunked, one thing I didn’t ask you at the beginning—how many views do you think you’ve had? Have you reached one million?\n\nChris White: Yeah. The main upload right now is 1,183,000 or so but I’ve got other uploads, some that have close to 100,000. As you said, other people have uploaded it so it’s certainly more than usual. I’m glad for that. I attribute that mostly to the universal appeal that the Ancient Aliens thing has. People are interested in it wherever they are.\n\nAlex Tsakiris: And I think it speaks to the quality of the documentary, the quality of the facts and the information. It’s hard to ignore it’s compelling and people pass it along because they feel like I do, a certain sense of betrayal in the producers of the Ancient Aliens series who left out this stuff that was very much available to them.\n\nSo what’s next? Where do you go from here?\n\nChris White: Well, like I said, I’m going to try to get these papers done about the sleep paralysis surveys. I’ve been sitting on this data for now a year. For a year I’ve been collecting the data; now I want to get that out. I’d like to do some kind of short thing about that. Talk about not popular, that’ll be one that’s not popular.\n\nThen I’ve got a few other things that I’m working on on the backburner. But that’s the main thing right now. I’d like to get that done.\n\nAlex Tsakiris: Great. Well, I certainly encourage people to check out the move, Ancient Aliens Debunked, as well as your podcast, “Nowhere to Run.” Where else might we direct them to see more of your work?\n\nChris White: Twitter is good. NTR1984 is the Twitter handle. You can find all that stuff at the main website, which is www.conspiracyclothes.com.\n\nAlex Tsakiris: Well, Chris, it’s been great having you on. I know we’ve had some real tough issues to wrestle about but I’m glad we had this dialogue. I’m glad we can share it with other people. Of course, it’s up to everyone to find their own path through this information.\n\nChris White: Yeah, Alex, I couldn’t agree more. I love these kinds of discussions. I wish I could just do this kind of stuff all the time. You are the perfect guy that I’d love to have these kinds of discussions with because we don’t have to deal with a lot of the other stuff and we can get right down to what matters. I really appreciate you having me on the show.", "opengraph": {"locale": "en_US", "type": "article", "title": "Conservative Christian Chris White Debunks Ancient Alien Theories", "description": "Interview with Ancient Aliens Debunked filmmaker Chris White who swamps the Ancient Alien theories with science, but relies on Biblical inerrancy for core beliefs. photo by David Hdez Join Skeptiko host Alex Tsakiris for an interview with Chris White, creator of the popular documentary film, Ancient Aliens Debunked.  During the interview White discusses the film […]", "url": "https://skeptiko.com/conservative-christian-chris-white-debunks-ancient-aliens-theories/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2013-01-23T03:35:24+00:00", "article:modified_time": "2017-07-25T20:06:03+00:00", "image": "https://skeptiko.com/wp-content/uploads/2015/08/chris-white-skeptiko.jpg", "image:width": "600", "image:height": "312", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["https://skeptiko.com/wp-content/uploads/chris-white-skeptiko.jpg", "https://www.flickr.com/photos/dahemo/", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-199-chris-white.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-199-chris-white.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-199-chris-white.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "http://www.stitcher.com/podcast/skeptiko", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://ancientaliensdebunked.com/", "https://www.youtube.com/watch?v=Nx50EjOrcMY", "http://www.skeptiko-forum.com/threads/199-conservative-christian-chris-white-debunks-ancient-alien-theories.2404/", "http://www.sitchiniswrong.com/", "www.ancientaliensdebunked.com%20", "http://www.stopsleepparalysis.org", "http://www.sleepsurvey.org", "http://www.sleepsurvey.org", "http://www.conspiracyclothes.com", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2013-01-23T03:35:24+00:00"}