{"result_id": "273003", "URL": "https://skeptiko.com/al-borealis-end-of-2020-show-479/", "timestamp": "2023-04-25 17:07:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/al-borealis-end-of-2020-show-479/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Al Borealis, End of 2020 Show |479|", "cleaned_text": "Al Borealis, this time we actually do an end of year show.\n\n\n\nClick Here for the Forum Borealis website\n\nOkay. I know I’m a little late in getting the end of year show out.\n\nIt was supposed to come out last week, but Al and I got so wrapped up in another discussion that it didn’t come out.\n\nSo what better way to kick off an end of year new year’s show Then with a good old fashion from comm clip.\n\nAh, come on, man. You know, that’s not gonna work. Here’s a clip from my interview with Al Borealis.\n\nAlex Tsakiris: [00:00:39] Here’s a good one for you. What topic do you feel? Was left unfinished for you that you plan on finishing in 2021,\n\nAl Borealis: [00:00:49] In known history, there’s never been one incident that has affected the whole goddamn globe. I mean, go back to the black, right. Go back to the black plague. There was one corner of earth where, you know, you could be like, no, no, I’m an enlightened Buddha.\n\nI’m just sitting here in my cave doing my own thing. I don’t care what’s going on. And Maya Ellucian globe. But now it’s like if the earth was like 50 different video games, all sorts, you know, from seems to axis and allies to all sorts of video games in one Now it’s like the whole earth is forced into becoming one big video game.\n\nAlex Tsakiris: [00:01:30] Let me just roll into it. So I, you know, my understanding of what we’re going to do here and which I think is really going to be fun. And a great idea is the classic kind of end of year. Wrap-up where we each look at.\n\nSome of our shows that most kind of inspired us or changed us, or it changed us in some way from, uh, 2020. So this is going to be fun. Right?\n\nAl Borealis: [00:01:54] I love the concept. Never done it before. We’ll probably start doing something like this every year, just for the website subscribers, of course, because it doesn’t fit the format.\n\nAlex Tsakiris: [00:02:09] You know, I’ve never done it either. So that’s kinda cool, but I think I’m going to start this as a, as a tradition too, because as I was writing out the questions, I like this is great. This is really awesome. So let me start with the first one. It’s an obvious one. I’ll tee it up for you.\n\nWhat was your favorite foreign Borealis show from?\n\nAl Borealis: [00:02:29] Yeah. And I’ve had that question before, just not the 2020. And I don’t mean to be like, uh, what you say when you have something up your ass, like, uh, anal about it, but it really depends on what you put in, in, in the world. Favorite. I mean, you could have, like, which show did you think was came out as the best one, despite everything like, just at the production end of thing.\n\nWhich one had, did have the most exciting topic? Or the most important topic which guests do are your favorite guests, which one did you surprisingly, you know, you’re coming to you and you know this where different people, different chemistry, some shows you wouldn’t expect them to go so well. And they, uh, you know, they just surprised you how, and some shows opposite you, you have great expectation and you become disappointed.\n\nSo it all really boils down to how you’re, what you’re going to single out as the good thing,\n\nAlex Tsakiris: [00:03:30] buddy. C’mon you just laid out a bunch of them. Tell us any one of those which would apply, which was your personal favorite, which was the favorite of the audience, which was the one that. Kind of caused the most stir any of those?\n\nAl Borealis: [00:03:45] Yeah. See, I’m a year behind with releasing shows. So ironically in the normal circumstances, none of the 2020 shows would have been out to the public at this point. But coincidentally, some are because of the pandemic. I had to break my own rule, uh, through, out there in a hurry. Lots of shows about the pandemic when I felt that would cover them.\n\nSo I think I should choose between them. And I’m going to surprise myself now, and I’m going to say the one red robot bono move or things, because I learned for the first time I realized what MMT was. So I’m talking about the money game, the money game, and it was a huge session. We did. Um, and, but I think he had to dumb it down so much that I think not just me, but also the audience finally.\n\nGot it. So in a weird way, that’s probably our favorite show. What about you, what’s your favorite show for 2020?\n\nAlex Tsakiris: [00:04:56] Well, there’s two that I would, that I would kind of single out kind of for different reasons.\n\nOne is, uh, Juergen, Ziva who, you know, returned to, to go. And he is just, he is someone who just exudes so much positivity, love and spiritual enlightenment from his many. experiences as an autobody traveler. And I just find him to be incredibly compelling about, uh, what he says and how we reports it. And we really got down to some real, I don’t know, uh, we really got, got into talking about some things that really matter the, the other person I, I kind of pull out.\n\nIt’s kind of a very skeptical interview was my interview with David Ike. and the title of that is love, not fear is the answer.\n\nAl Borealis: [00:05:49] yeah, I was just going to say that was a scoop. And, uh, I also love how you even, I could guess the skeptical treatment. I love what you\n\nAlex Tsakiris: [00:05:59] He got a little bit of a skeptical treatment because you know, and this again is, is like maybe a launching point for even a little bit of a discussion of us is.\n\nI mean when I do these interviews, the interviews that I most appreciate is, again, something you just said. And one of the reasons I love your show so much is you said you love the interview with Robert because you learned so much. And I was like, wow, that is the guy that’s that’s. What I love about you is your learning is our learning kind of comes through that.\n\nYou’re growing my, so I go into the interview with David Ike. And I’m like talking to all my friends, you know, I’m like David Ike is saying there is no virus that there is no COVID virus. Surely. And I’m like, surely he can’t mean that he must mean something else. He means that this is obviously somewhat of a planned orchestrated event in some ways.\n\nYeah. We all get that. But to say kind of in your face denial, that there is no virus, where is he coming from on that? So, and so I went and did some research and, you know, David Ike. So for people to know, I have the utmost. Utmost respect for the guy. And I love what the guy has done for as long as he’s done it, you know, you and I have been around doing this for a few years.\n\nDavid Ike has been doing it for 30 fricking years and he’s withstood so much crap from so many people. And yet he’s advanced a very, very. Uh, important topic about consciousness, which is really what his whole thing is about. But anyways, back to this,\n\nAl Borealis: [00:07:40] maybe no, but it didn’t start out like that. You know? I mean, some of.\n\nI mean, he’s not just, he’s not Jesus sacrificed on a cross. He begged for it. I mean, look at how he started out. I remember him from the very beginning, which is why I’m perpetually skeptical to him. Uh, he has the ability to say truths, of course. And I love the way he’s always hitting upwards of a birds.\n\nYes. But, you know,\n\nAlex Tsakiris: [00:08:09] Oh, the lizard people. Oh, yes, yes, yes. So let’s talk about that for a minute. So, you know, we’re going to talk for an hour if that’s okay. So, this is also the skeptical vibe that I don’t intentionally bring. It’s just kind of where I’m at.\n\nYou know, so I like the tension of, uh, David Ike being someone who’s saying something that clearly is, uh, just not solid science that they have on isolated the virus. And the reason that isn’t solid science is we now know that through your show, we know that the. Best evidence suggests that the virus is bio engineered will have its challenges.\n\nAl Borealis: [00:08:49] Yeah. You know what, let me switch my answer over to the show because it’s so important information to know that HIV is in. Yeah. I think that’s the, my favorite show now.\n\nAlex Tsakiris: [00:09:00] I’m going to let you get back to that in a minute, because I thought that was a phenomenal show, you know?\n\nYou know, back, we’re going to ping off of each other. And that’s just what we’re going to do. Part of my, uh, orient going into David Ike from a scientific standpoint was through the foreign Borealis shows that I had listened to that really, uh, laid that out, you know, laid that out in very, uh, clear sense scientific terms that the best evidence we have with it, we’ve, we’ve done, uh, the, an analysis of the gene structure of the virus, which suggests that, you know, all this nonsense about not isolating it is, is just another red herring into the, what I think. And future shows. I said it is another flat earth thing. You know, when I hear people talk about flat earth, I’m like, I understand on one level that you’re just exhausted with being bullshitted by so many things that you can’t come to grips with.\n\nWhat’s real. And you have this kind of. Yeah, hyper, uh, Uber empiricism, where I don’t believe anything, you know, unless I see it feel it, which is why would we make that the criteria. But anyways, that’s, I think where people come down. So I think people just have this that has become a splinter in the alt alt media community is to divide people, you know, divide people like you’re a flat earth, or you’re not a flat earth, or, but you’re still in the computer conspiracy community.\n\nYou will. You believe there’s no virus or you believe there is a virus, but you believe it’s a planned demic. This is classic divide and rule kind of stuff. Yeah. But I can’t leave this topic without talking about the lizard people, because ever since then, whenever I talk about how much I appreciate David Ike, I always bring up who is David Ike.\n\nAnd they always say, they, they, they pause for a minute cause they know they’re not supposed to say it. And then they say, He’s the lizard guy, meaning he’s the guy who thinks that world leaders aren’t shape-shifting reptilian aliens who are invading the planet,\n\nAl Borealis: [00:11:08] still sticking with it.\n\nAlex Tsakiris: [00:11:10] And I always want to go, I just want to go.\n\nOkay. That’s great. Let’s let’s just, but let’s put that on the. Examining table for just a minute and deconstruct it. And I’ll give you the heads up here. I’m not going to try and convince you that all that is completely true, the way that David says it, but in the same way that he’s saying that there is no virus gets at a deeper truth while he’s stepping over and stumbling over the science, which isn’t true.\n\nOf course there is a virus, but he’s. Reaching towards a larger truth, which is, this is a project. This is a game. This is a social engineering game. Similarly with the lizard people and the shape-shifting lizards, what aliens, what I always point people to on that is, you know, the best evidence we have suggests that.\n\nWe are being visited by aliens from another planet that isn’t even, that’s not even controversial anymore. That’s pushed out with the department of defense it’s on the New York times. It’s in the Washington post.\n\nAl Borealis: [00:12:22] Well, uh, I don’t think you follow just we’ll agree that if you say we’re being visited by lifeforms from another world.\n\nYou’ll you’ll get away with that. Soon, as you say on all the planet, you nailed it down to a 3d mechanical phenomenon, which it may be, which parts of it may be. But you cannot ascribe the whole UFO thing to that just because we know the whole UFO thing, can’t be, I mean, you have the Graham Hancock approach and shamonic approach the psychic aspect.\n\nBut you know, when we talk about Ikea, you should really ask ourselves which David Ikea are we talking about? Because he’s not claiming the lesser thing anymore. It’s already begun. If you could take IQ, isolate him for the last, say 10, 15. Maybe\n\nAlex Tsakiris: [00:13:13] he hasn’t backed off of the lizard. People\n\nAl Borealis: [00:13:15] kind of, he’s trying to, he’s trying to sound like check old footage, compare it with now.\n\nHe’s got a completely different spin on it. Now he’s saying that he’s not saying it’s a metaphor. If you did, it would be a great metaphor just as there’s no wires. It’s a great metaphor, which has a truth in it. But now he’s trying to say, they’re not physically. Listen, people it’s all about vibrations.\n\nAnd of course, when he enters the realm of operations, he’s entering my area, the area I’m working with privately, most of all. And so, uh, I put up even a more critical eye to what he’s saying. And it seems to me, my take on IQ have always been that he’s a. He’s a great generalist. Just like, uh, another dude that reminds me of Ikea is my concern on both of them.\n\nWhat they do is that they scout, uh, the world, uh, for inputs. Then they find something that integrated in their routine. And then they spew it out to their audience. Like they all want to be gurus, but it’s okay because it could be worse. At least they are hitting upwards. At least they choose to become like big shorts in the comp the culture thing.\n\nThe worst thing would be like doing like a, what was his name? You know, the CIA sponsored a astronomer with a PI back in the day who ever bought. Yeah. The big hero of the skeptics. I mean, he could be like that kind of guru. Right. Which is much worse working for the man. So I am conflicted on IQ. I think he’s actually fit, fulfilling a useful role.\n\nBut he would never be my girl. I see through him. He’s he’s kind of, I dunno if corn man is the word because he’s actually spearing truths too. He’s spewing, mostly truths kind of reminds me of Donald Trump in a way. I’m not a Maga guy. I would never join that cult. I can watch Trump critically, but I can also acknowledge good spill out coming from.\n\nSuch a guy as Trump, but at the same, I would say with Ikea, I mean, uh, probably fulfilling a function that’s needed, uh, and I’m trying to be generous with them. So, um, but, um, he’s still just a figure for me out there. And, um, I don’t think I would even want to interview him, but it is interesting when people like you get to enter your hand, man.\n\nConfront him at some, some of the stuff that I’ve been curious to, how he would reply. So, um, that’s why I know how he rationalizes it because I’ve heard him try to, you know, make sense of it in the more recent years, because what you’re saying these years now last 10 years are much more rational. And on the point it’s like, he’s moved closer to Alex Jones.\n\nSo to speak less new age, more political, but he big\n\nAlex Tsakiris: [00:16:35] We’re not going to get through anything. No, that’s okay. First of all, no, no, hold on. First of all, I think Carl Sagan is who you’re thinking of. Right? Carl saying interesting guy. Cause you’re right. I mean, But he was CIA in a way that a lot of people who listened to your show understand, and a lot more probably from your perspective, over there in Europe and they do in the U S but CIA doesn’t mean CIA.\n\nIt doesn’t mean like he was, you know, coming into the office, like, okay, what’s my instructions for today. Now Gloria Steinem was, but no coral Sagan. It’s more just like. How they just have connections and they just have this invisible college, which is another I’ll try and round this back into year end review.\n\nOne of the interviews. I really, really appreciate it from last year was with Dr. Diana , who\n\nAl Borealis: [00:17:34] I was wondering if you were going to mention that. I think that’s probably one of your most important interviews.\n\nAlex Tsakiris: [00:17:41] Well, here’s how it ties back into, uh, David Ike, because I got a challenge on a couple of things because that’s what I do.\n\nAnd it might be interesting for people. So let me again, we might not get very far with the. W with the 2020 review. And that might be okay too, but I’m always a little bit put off because I’m so interested in consciousness and I’ve spent so much time on it when people, uh, reduce the ITI phenomenon to, uh, To consciousness.\n\nAnd then with a wave of the hand, say, Oh, well, that’s, that’s going to kind of cover there in some way that now what Diana Walsh plus sulca reveals in her book is the opposite of that. So a lot of people point to the consciousness explanation. I put that in quotes for E T yeah. Lina jock valet, right? Dr.\n\nwho is extraordinary. So Dr. in the book, American cosmic, and she is a religious scholar. She’s again, she’s studying Roman history and, uh, the way she gets into it is somebody reads one of her papers and says, that sounds like a UFO experience. And she goes, no, it’s not a UFO experience. It’s this, uh, it’s this none, you know, saintly none back in 500 years ago that had this vision.\n\nThat sounds exactly like a UFO. So she winds up going to a UFO conference down there in North Carolina, where she’s the chairman of the department, a tenured professor at a well-respected university. And she goes, wow, this is too crazy. My account does sound like a UFO account. And that leads her to meeting jock valet.\n\nAnd she goes and meets Shak villi, and they tour Silicon Valley together. And then she goes out in the desert in Nevada and she finds space junk from the craft. Okay. So now this is the same. Craft that we see. And I’m not saying it’s literally the same, so don’t get me wrong. But when people watch the tic-tac video, That happened right out here.\n\nI’m sitting on the coast of California and the w the operations, they were running was 30 miles off the coast. And I interviewed the guy who was orchestrating the whole thing, the kind of top gun telling this pilot to go to that pilot. And he went up on the deck and he looked through the binoculars and he saw the craft and it changed him.\n\nHe had a transformative experience with the craft. So people who are advancing this kind of exclusively consciousness kind of explanation for things or vibrations, they’re more, it was what you said are more in my camp. You’re stepping over all this physical, nuts and bolts. Data that we have. And again, I’m a consciousness guy, so I’m not going to step over the consciousness data, but I am not going to suppose that some hokey consciousness only based explanation explains the people who are abducting people and creating these experiences.\n\nAnd I would further go and then I’ll let you respond to this, you know, other interview and this wasn’t from 2020, but it was from before. Was the interview that I did with Dr. RD six killer Clark. And she is a. Like I always say she has a little bit of a funny name. She’s native American, but she’s a professor and anthropology professor at Montana state university.\n\nAnd she went around and collected accounts and she’s, uh, keep in mind, she’s an anthropologist. She knows how to go and collect people’s accounts. You can’t say those are just stories. I mean, this is what anthropologists do. She collects accounts from all these native American people in the United States, in Canada, in central America.\n\nThey’re talking about star people that come from planets, they’re talking in some cases about lizard people that change form.\n\nAl Borealis: [00:21:58] Ike. No, no, no, but no, but remember what I said about IQ. He Scouts the world to find impulses. He didn’t invent the lizard thing. But he launched it like a literalism, like a fundamentalism thing. Like it’s actual literal that they are physically listen people, which is a new twist. Although of course there had been some UFO encounters where you had not just listed people, but all sorts of, because that’s that classical.\n\nUh, we always see aliens as. So none of our insects are animals. They never have individuality like weeder, but in terms of traditions, sure. The list of thing is an important symbolism and myth it’s tied up to, you can talk with Miguel, maybe\n\nAlex Tsakiris: [00:22:47] it’s real. I’m just saying maybe it’s real. Maybe it’s mythic. All the rest of that, but you’re just, I just don’t understand how you can step over all the data and just with, with the brush of the hand, just say, Oh yeah, well that just fits into this, uh, mystical fairyland, especially when the guys out there in the desert, finding the space junk and reverse engineering it and making millions of dollars.\n\nYeah. In this world by bio, by engineering, the space junk. I don’t know how you just step over that and go, well, none of that matters because you know, we all make up stories about verys and there’s these ancient stories about this and that it doesn’t, that doesn’t solve it for me.\n\nAl Borealis: [00:23:27] I have a, um, I mean, you say myth versus read myth.\n\nSo serene. But they’re not necessarily literal talk with Miguel corner. He can talk to you about the aspect of listed people in training, but yeah, let’s see where the, or for 2020, that’s a good point. Um, because like you, I, to, um, like a consciousness guy in a way, I mean, from the esoteric and despite that, just like you.\n\nI’ll go in another direction too, like outgoing in the classified space program direction, which is the most not symbols you can get. So I’m not saying either or either, uh, I’m also admitting that there’s a physical aspect to it, but when you say Nevada, you know, that’s right in the back alley of Harry Reed and, uh, also this skin Walker ranch oligarch, what’s his face again.\n\nHe liked that show. Uh, and we have a video to it also. Now, if you listen to that, you’ll hear him talk about which States. Are deeply into the UFO thing. I mean, in terms of which basis of the military and Nevada is one of them. So I would expect to find space junk in there and something is definitely on the move.\n\nMarco Rubio, you know that neo-con disgusting. Establishment hack, Marco Rubio. Oh, yeah. Reactionary. Flora,\n\nAl Borealis: [00:25:12] to go away. Yeah, we couldn’t remember the name, but Marco Rubio, that politician he’s now thrown himself on the disclosure wagon of all things. Um, even Brennan, the CIA guy, Brandon\n\nKind of admitted that there is something out there that’s very recently, but both you,\n\nAlex Tsakiris: [00:25:36] why would we care? Why would, why would anyone, okay, so I’m going to weave in my other talks, you know, so in 2020 I interviewed Richard Dolan and,\n\nAl Borealis: [00:25:46] um, so did I, and you know what, I’m changing my answer. Just the fact that I managed to get Dolan on my show again.\n\nMakes that my favorite show for 2020. Go ahead.\n\nAlex Tsakiris: [00:25:59] No, you go on tell us what, tell us what you took away from the Dolan episode. And then I’ll tell you\n\nAl Borealis: [00:26:05] actually that much, just the fact that I go to him on, cause I’ve been planned. I planned to discuss with him disclosure scenarios for so many years, it was on the agenda.\n\nNext time I get him on that’s going to be the topic. So I got two more. And it’s still not released to the public. And meanwhile, he’s gone out again. I guess he got inspired from that discussion because he’s made his own update that show on this kosher scenarios after that. So as you show it, because I’m so slow getting stuff out when it’s out, it’s going to be old news already, which is why I’m saying, you know, everyone else says we are the first.\n\nFirst on this first on that. Well, foreign Borealis, the last on everything, but we sweep it up where our in depth long form. So at least we don’t let anything. We pick up the pieces, nothing is left behind after we have done it.\n\nAlex Tsakiris: [00:26:58] Well, that’s good. You know, uh, I don’t know. I I’m thinking one of my resolutions for 2021 is I want to do the shows.\n\nI want to quit holding on to them and holding onto this idea that I have to release them at some kind of schedule, which I just, I don’t think I do. I think I should just get them out there as I do them. Well, one of the things that, you know, really was we had two really interesting points of discussion Dolan and I did, and one was okay.\n\nDisclose your as a political PSYOP and, uh, you know, Richard was he’s brilliant. I mean, he is the go-to guy. He’s just at a next level in terms of intelligence and thoughtfulness. And that he’s a researcher, he’s this historian professional. He knows that stuff, but we really had an interesting discussion because it just seems to me that what we’ve seen as quote unquote discloser with Tom DeLonge.\n\nUm, kind of to the stars Academy and, uh, all that to me looks very, very much like a political PSYOP and the. Tip off for me that it’s political is it never mentions. It only mentions people on one side of the political spectrum. And I don’t care about one side or the other. I’m just saying if you were, if it was a genuine disclosure, it would include both sides, especially when the guy who you’re including you’re excluding from the discussion is the president of the United States.\n\nIt just doesn’t make sense. Other than it being some kind of political move that those guys were trying to make. And it’s a really, at this point we can look back and say that it’s a failed political move because they really tried really, really hard with the disclosure and pushing that out. And the general reaction from the public was, so what I mean, you’ve given us\n\nAl Borealis: [00:28:57] and you mean those guys that you love to hate that really tried?\n\nUm, yeah. Uh, Harry Reed, Tom DeLonge, those people tried it. It’s true. They had this project, they’ve tried to push the tic-tacs and I did manage to, you know, make it was that in 2020 though. I thought it was last year.\n\nAlex Tsakiris: [00:29:15] Venda let’s throw Peter lavander the PI yeah, he was\n\nAl Borealis: [00:29:20] hired to do the book for them. Yeah.\n\nAlex Tsakiris: [00:29:23] I think he was hired to do more than the book\n\nAl Borealis: [00:29:26] interviews for the books. Of course.\n\nAlex Tsakiris: [00:29:29] He was hired as one of the people to do the rollout for one of the nos. Yeah.\n\nAl Borealis: [00:29:34] But, but they roll out, you know, they have several levels. He’s kind of their connection to the Alex. It remember their main impact is not the outs.\n\nThey do have a tie out, but that’s not where they working. They’re working in mainstream media. They’re trying to move that. And they’re working with mainstream power players, politicians, bureaucrats, et cetera. And to a certain extent, they’re also working with the mainstream public and they did well, if it was 20, I thought it was 19 that it is, but they didn’t manage to move the needle in terms of now.\n\nYou can, now it’s actually legitimate in the mainstream. And when I say mainstream, I don’t even just mean the mainstream. Yes. Like the mechanism of that press, I was mean YouTube person and everyone who is not very out, like everybody who has in a mainstream paradigm. No, it’s totally okay. A legitimate to entertain.\n\nThey all have that. And they all have the old school. They’re not entertaining dimensions and weird stuff like that. They’re entertaining visitors from all the planets, basically. So that’s now in the Y you can do that. You won’t be laughed as, you know, sneak it out of the room and yeah, it’s actually clean for the first time in our life, which is a kind of a big deal actually.\n\nAlex Tsakiris: [00:30:58] we have to move on. You know, we talk so much just because we kind of don’t, we don’t agree on these, but we don’t agree, you know, and that’s what I think we did in the last show. So we don’t need to kind of repeat it, but it’s not about agreeing. No, it’s about. Really being at this space where we are, where we really so fundamentally agree on all the most important things that we can move to the next level, I call it, you know, level three, where we can really start hashing out.\n\nLike we just did on the ETF thing. We are both totally committed to the idea that the extended consciousness aspect of ITI is where all the action really is. Yeah. So we’re in agreement on that. So then we can disagree about. To what extent is the physical manifestation of it as a nuts and bolts phenomenon?\n\nHow important is that? How does that play into it? I hope people, your people can follow on on my people can too. But you know, th that, that’s where we’re, that’s where I’m pointing towards those, the discussions I want to have. And it’s always going to come with disagreement, because if you think we’re just a band of brothers, because we both agree on, you know, that how fuck the world is and how, how they’re just trying to railroad us into some.\n\nIt’s completely controlled, uh, you know, scripted reality. I’m not interested in that. I’m that? That’s just another trap to say, Oh,\n\nAl Borealis: [00:32:25] could I, I have a take on, on a reframing what you just said. Forget the agreement thing. I think what matters is honesty, truth. I think the thing with people like you and me is that we recognize each other as truth seekers and.\n\nThat’s really a rare currency these days between co-opted people, hypnotized people, stupid people, hacks trolls, sellouts. I think the value in the so-called out is people who recognize other people as honest, sincere. That’s the man of the people on there we can afford. Indeed. It’s an advantage with disagreement.\n\nAs long as we know, we have no fifth columnist, we have no spice in our midst and then disagreements are good because then we’re back to the basic tools of moving forward. The discussion on the investigation, which is thesis, antithesis synthesis. So, so I think that’s the most important currency you have.\n\nAnd I have. That we are merciless truth seekers in each, each our own way. But it’s funny because 2024, you are like, have been a lot about how it has been very philosophical. This revision is mobile talking about UFO’s. Yes, you did some UFO stuff, which you always do, but your main topic, at least the first half of the a was the evil thing and going through your shows, I mean, a very important show you did was Anneka Lucas.\n\nYou know, I try to get her own. I tried to get Dr. haven’t managed, but in you have that, we have your shows with both of them, two completely different topics, but very important topics. And I think new may actually be the most challenging for the paradigm because. Everybody, you know, the UFO thing is old and there’s no lack of gurus there that you can trust.\n\nBut when it comes to the disclosure of PIDO rings, okay. People know to a certain extent it’s really like the Epstein thing, but how far it goes there really don’t know. And many people think that the children being abused thing is just a, like a meme or a myth, but then you drag someone like Lucas into the equation.\n\nAnd there’s no, there’s really no defense against that ugly truth anymore, which is why I think all in all it’s March Paragon, challenging them, whatever. For example, Richard Olin could conjure up. What do you think.\n\nAlex Tsakiris: [00:35:13] Well, they good. There’s so much to talk about there. One, I was really struck by what you said at the beginning about honesty and sincerity, because for you, and I think it just comes natural.\n\nWe don’t see it in any other way and I’m not. Proclaiming myself to be kind of any, for me, it’s more of the origin of the show. You know, I didn’t have any economic drive in the show and from the beginning, and that was a gift, a gift that I didn’t even realize because I started the show before it was even economically viable to think about making any money podcasting.\n\nIt just wasn’t even at the beginning, there just wasn’t any part of it. Yeah. So. But that really set the tone for me, because I was always interested in this truth seeking and in understanding and, and talking to the smartest people that I, that I could. And I think that anyone who’s listened to foreign Borealis gets the same thing.\n\nAnd like you said, with the long form, which is the care that you take to, I like what you said about nuts, sweeping up all the, the little pieces that might fall on the floor, because invariably. There’s some of those little pieces turn out to be, you know, super important. So I’m going to add a couple of little pieces to the arnica Lucas story, because, and for people who haven’t heard from your show, who haven’t heard about it, Aanuka Lucas.\n\nUm, is, uh, I always say it the same way. The reason, one of the reasons I connect with Annika Lucas’s cause she’s a Yogi and I’m a Yogi and we’re\n\nAl Borealis: [00:36:48] yeah, she literally, it’s a yoga. It’s the way she dealt with it. exactly.\n\nAlex Tsakiris: [00:36:54] And, and she has, uh, you know, her, her who she is now, because we don’t wanna, we don’t want to just talk about her in the past as if that’s all she is.\n\nShe is a woman now who does, uh, Uh, a non-for-profit where she goes in and helps incarcerated women in the United States and Northern New York by helping them deal with trauma through yoga. And, uh, I have actually talked to some of the people in her program about doing a yoga center, starting yoga classes out here.\n\nUh, again, because I think we’re all traumatized in different ways. So she is a real person and she’s a powerful, forceful person that is making changes in the world today. But we’ll of course the story is the true story. Her life story is that at six years old, her mother sold us, sold her. To a satanic ritual abuse cult.\n\nAnd that’s really important, you know, to talk about sweeping up the pieces. It was a satanic cult. Now I’m not a Christian. So I have to spend an hour with you deconstructing what Satanism means to me\n\nAlex Tsakiris: [00:38:07] what evil means. We’re not going to do that here because we already, we already did that. But the point is,\n\nAl Borealis: [00:38:13] hang on, let me inject.\n\nI totally to switch my answer again. Actually the evil show I did with you. It’s probably my favorite. Why? Because I think that’s the only time during 2020. That I really regret it. Now, when I look at it like this, but it’s the only show where I felt that I could go all the way philosophically with no breaks.\n\nAnd I guess I had to do with, you said, okay, she now can do that. Like, I’ve done it with Joseph Farrell with Dell. So deep into a topic. That’d be coming out on the other side and for 2020, I don’t think I did that that much, except with you in the even show, we went all the way and you know, within time constraints, um, physical limitations, but yeah, that was a classical in-depth show.\n\nI really appreciated that one. And, and we really conjured up again. It was the dynamic of both understanding better to say understanding then agreeing the big picture. Uh, understanding the big picture and then, uh, fencing on the details. But anyway, go on with Lucas.\n\nAlex Tsakiris: [00:39:22] Well, I really appreciated that show too.\n\nAnd I loved that. I was able to bring you into that kind of philosophical discussion because I love your shows that are, you know, new information shows, I guess I wouldn’t call them, you know, they’re, they’re, they’re terrific. And we all sit there and you ask them. Great questions and we learned, but I love pulling you out of that role a little bit and hearing you think more broadly and talk more broadly because this.\n\nAnd you are one of the great people to do it with, for me on this topic of evil that I’ve spent so much time on because the whole premise of my thing was that we need your kind of, of deeper thinking in, in that, because the premise is that if we look to science, we’re fucking loss when it comes to evil, because they completely deny that it even exists.\n\nAnd when you throw. Hanukkah Lucas in their face and say, she’s, first of all, she’s not the only one, you know? I mean, there’s, it’s not like this is the lone person who’s ever said this. I mean, if you really listen to her,\n\nAl Borealis: [00:40:32] the push your case is tight. The evidence people were\n\nAlex Tsakiris: [00:40:35] okay. So do trow thing, you know, that was just all over the news and\n\nAl Borealis: [00:40:40] like, Oh yeah, you can’t deny it.\n\nAlex Tsakiris: [00:40:42] So. You can’t, you can’t deny it. And so imagine, you know, a six year old child being raped, hundreds and hundreds of times, multiple times a day, taken to, you know, a big mansion castle slash mansion and being raped by people that you recognized as world leader needs. And it being satanic SA 10, Nick satanic.\n\nSo. Yeah, because we always want to leave that out and we say, Oh, pedophilia. Well, okay. It’s not pedophilia. That means love of child. We’re talking about raping kids. And we’re talking about also what she reveals is that the, her path was to be killed. Yeah. And she had seen other kids killed and there was a table blood-soaked table where they killed them and she was on that table.\n\nSo I think we have to be more precise about, you know, what we’re talking. So, but. But what I like is you and I are able to talk about what that means to say satanic ritual abuse inside of a culture that has been totally mindfuck by Christianity. Christianity is just a complete sham, right? I mean, there isn’t.\n\nThere’s a realness to Christ consciousness. Apparently in these extended realms, there is a realness to Christ consciousness because it’s reported all over the place, like the near death experience reported and it’s all loving and it’s all good. And it’s life transforming. It’s spiritually transforming in a positive way.\n\nSo that’s one yeah, anchor point, but those Catholic brace and Pope’s, and. Bishops that are raping those little kids. They sure as hell ain’t have the same spiritual orientation. So those two things cannot exist in a resolvable way. So we, we are in this understanding of evil. We’re forced with one side, look at complete.\n\nUh, useful idiot and mindless, you know, intentionally ignoring it just by saying it doesn’t exist, which I think is conspiratorial and that’s science. And then we have religion who just has no seat at the table because they’ve completely, they’ve been a part of it. So yeah. Our discussion. I appreciate it because that’s just me talking, you know, I don’t even know if you can put that out that, see, this is what alienates, so many people from my thing, but I don’t have any other way to say that.\n\nUh, and I don’t feel a need to say in any other way. So I just kind of say it directly, but we were able to go there and as you know, I’m not able to go there with most people because they’re sensitive on one or more of those.\n\nAl Borealis: [00:43:24] Yeah, no, it’s a silo thing, but 2020 has really been a dark year in many aspects.\n\nI guess the silver lining has been that people who needed it, not you and me, but, but many mentoring people sleep walkers. As we arrogantly referred to them. Last time we talked, they got shaken out of their hype. Gnosis. And now they’re starting to really question the paradigm and there an existence is always a good thing.\n\nYou know, the silent majority as they call that generation, they were the most humble of all. Of course, they were succeeded by the most spoiled disgust in generation, the boomers, but the silent majority, they had to suffer through war and everything. So they knew real values. And it’s going to be the same with the generations who experienced this stuff because many people got the timeout and they got to understand real values again, and here in my country, like I said, last time we talked, nobody was thrown to the wolves.\n\nUh, everybody understood that, that. When you are forced to shut down and become a prisoner in your own home, you’re going to get to bail out from that. So everybody got burned out and postitive spill out of that. Was that now more people than ever work from home, like you immediately. And they hated it in the beginning.\n\nNo, they love it now. They prefer it. So many jobs when they come back in this country, not in Europe, they’re they’re destroyed, but, uh, elsewhere, then many people will continue working at home and many people would also, if we ever get society back to something resembling normality, they will value much more.\n\nWhat we took for granted before the lockdowns, you know, distancing and all that stuff. Just go to a fundament. I mean, it’s the most alienated step in human artificial evolution because we are not supposed to. Be close to each other. We’re not supposed to get your other, we’re not supposed to, you know, all these things that we grew up on, it was just taken for granted.\n\nAnd it’s ingrained in us back to the tribal society. We’re really going to be removed from such a crucial, essential human feature like that. I really wonder how. How, I mean, it’s the transhumanists wet dream, but precisely because we, we rubbed off that is why people will value that much more. And I guess this Christmas people were, you know, they could meet family again and be physically present again.\n\nAnd I think just in general, people value that much more that they didn’t do before. And so the question is 2021. Will that be just as dark will, was this just the first step? And I have to, I, I, before we started, I recommend it to you, a new report from Corvette. I want to give a shout out to that one. It’s called future vaccines.\n\nOne of the last choice. He made a documentary, everybody run and watch that. I try to debunk the contents because I don’t want it to be true. It’s a very sober. Like all the stuff he does super documented, but, uh, unfortunately I think everything there is true. And in that case, 2021 will be the real and the game.\n\nIt will be the real decision point of where humanity is going. So 2021 could be completely, uh, dark much darker than 2020, but it can also be the opposite. It can also be. And a healthy back clash to what happened in 2020.\n\nAlex Tsakiris: [00:47:16] Well, that’s huge. I mean, you said so many things there that, and I made a notes on a couple of them that I wanted to pull out.\n\nUh, your, your point about this being a generation defining moment.\n\nAlex Tsakiris: [00:47:31] nine, 11, fuck nine 11. This is on a, I think you’ve tapped into something there that, that, that puts it in the proper perspective. And that’s why I’ve called it out like that. No. This is generation defining. This is world war two generation defining, you know, the people who went through world war two.\n\nWe still hold them in a reverence because we understand that they went through a transformation. And at the beginning, we were very reluctant to call this that because we made jokes about, you know, The greatest generation was called to war, and we’re called to sit in front of the TV and watch Netflix. I get that.\n\nAnd it’s a funny joke, but at this point going on a year, it’s something different. And the fear factor that’s been played into this is something different that we’ve had to endure. And the global consequences of this is something we’ve had to endure. I believe it is. As you described it, generation defining.\n\nThe other thing that I think the point that I wanted to pull out that you talked about was artificial evolution. That is clearly what’s at play here, both a social evolution that’s artificial. And what they’re really aiming for is some kind of physical evolution that’s artificial as well. So I think it’s great for you to call that out, but your biggest point, and I think this is what.\n\nWell, I think it’s potentially true. I don’t know if it’s true, like you, I don’t know which way this plays out, but I do think they may have overplayed their hand. You know, one of the points I really took away from the discussion that we had just a couple of days ago was that the, the oligarchs are not.\n\nThey’re not Bulletproof. In some cases, they’re not even that smart. They’re not playing it, right. They’re not even playing it to their full advantage and they might’ve overplayed their hand here. Because as you mentioned, when you get together at Christmas and you give someone a hug and you say, fucking a, I needed that, you needed that.\n\nWhat the hell are we, how have we been mesmerized hypnotized into this nonsense? It could have the kind of backlash that could really, uh, turn the tide in a longer-term game that they’ve been playing. So I just totally resonate with, with everything you just said there for 2021,\n\nAl Borealis: [00:50:04] I’m tempted to go all the way down the rabbit hole now and entertain a few scenarios because you were saying this may be.\n\nYeah, physical evolution kind of, and they all were playing the hand. Yes. We agree there. Dump the oligarchs of today are inbred idiots and yeah, they’ve forgotten the lessons of the past booked and, and you’re right. The generations of the past first, the depression and then the war. Uh, now we are having a depression on a war simultaneously, but what if this isn’t the oligarchs.\n\nPlan at all. What if the oligarchs are just in for the ride? I mean, they are looting. There basically\n\nAlex Tsakiris: [00:50:50] are those two different though. I mean, we have to be clear because people stumble\n\nAl Borealis: [00:50:53] and I’m going to go all the way down the rabbit hole. I’m not saying I believe this, but let’s entertain it. What if there is much more intelligent forces that are behind whatever can look like some kind of plan here.\n\nUm, Because the oligarchs are like any,\n\nAlex Tsakiris: [00:51:16] can I interject? Let’s just be specific on that because we talked for 15 people, 15 minutes and people are like, what the hell are they really talking about? So let me throw out a couple and tell me if these are, are on the table for you. One is, is the obvious one that just stuns me that it’s population control.\n\nRight? I mean, the planet doesn’t work, right. If you keep adding,\n\nAl Borealis: [00:51:37] but you’re talking about intentions, I’m talking about perpetrators.\n\nAlex Tsakiris: [00:51:41] So I’m saying maybe, maybe one of the agenda items. For the perpetrators is population control, maybe another agenda. And I’m not saying, I believe in any of this, I want you to respond.\n\nI just want to make it explicit. So another one would just be one world government, and that could even be related to some kind of interplanetary plan. Right. Those two things. Nice. I was going, I know you were, I want to make it, I thought you were, but I want to make it explicit so that people know what we’re talking about.\n\nSo one could be people who are just. Running this from Convault bureaucratic, uh, level saying there’s too many people for the resources we need to cut down in the population. Checkbox there possibility another possibility checkbox is to say kind of the same thing, but say, we just want one world government because we want to control stuff and it’s better for business to have one world.\n\nAnd it’s a hunger games and that’s how we do it.\n\nAl Borealis: [00:52:36] Yeah. Yeah. Like the openness to global argument\n\nAlex Tsakiris: [00:52:39] and a third one third possibility. And these are not mutually exclusive, but they can be looked at mutual exclusive is some kind of. Interplanetary XO political thing where, you know, we’ve been talking to some group and they’re like, dude, but you know, w we can’t really go forward with you guys until you get it together.\n\nAnd, you know, we have kind of one group that we’re talking to. We’re not going to go around to 50 different groups, you know, get it under control down there, and then we’re ready to help you move into the future. So, Please continue, but add any one other, other ones if you want. But I think that those are at least three of the things that you’re doing.\n\nAl Borealis: [00:53:17] Yeah. But I have too much worse, uh, to add, uh, first off, forget this dog Trek thing. If it was like that. They would never, you know, like on the said the goal and the path is one. So the means will never justify that and to go now. So, so if it was like that welcome to the enlightened global, uh, community, they would never accept it.\n\nYou know, what are we going to be tricked and forced and suppressed. I\n\nAlex Tsakiris: [00:53:48] get ya. I get ya. I’m just throwing it out.\n\nAl Borealis: [00:53:50] It’s worse. What if they are good on cannabis? Why are they. One thing is to socially transform earth. Why do they need to. Mess with our DNA, because what the virus is doing is one thing which is pretty, uh, unforeseen.\n\nAnd that’s why I enjoy the show with, uh, both George Webb van doctor absently, because they were pointing to how this is an, uh, unprecedented, uh, virus with the four strains mixed in one, including HIV, which is why it is disarming your immunity. But if you look at the future vaccine program, I mentioned you will see that the solution they have in place, isn’t a vaccine at all.\n\nThat’s the problem it’s messing with our DNA. And these go straight into the most paranoid aspect of skeptical shows because you much more than me have entertained the notion of alien. So, I mean, if we were an alien species and we wanted to take over. Forget about the 1950 scenario, you know, like fighting in the streets that never works.\n\nThat’s like America didn’t even manage that in Vietnam or in Syria. That’s just, that’s the Dumbo cave membership. No, no what’s going on now could be a much more effective way to cleanse. The earth and transform it to whatever’s coming. So that’s that paranoid dark scenario, just mentioning it. Not saying I believe it, but another one, which I don’t believe, because I don’t think AI is possible, but if you remember when you and me have gone back and forth on this, but if it was AI would already be calling the shots, I’m trying to, you know, find the most effective way.\n\nBut you can, you can be old school too. You can also just say that because I asked Richard Dolan of this, I think both times I had him on and both times he acknowledged it as a very good question that he rarely gets, which is that what if the oligarchs are not calling the shots because power is where power is and if you have access to.\n\nToys that makes the rest of the world look caveman. Then you are in power. No matter if someone else owns the money and stuff, you have the weapons, you have the twine machine, the, the, the, the space machine to whatever that sect that clique, that Nazi CIA kind-of, breakaway civilization. Really have more power because they can take over the economy anytime they want.\n\nAnd indeed, we see. So even nine 11, if you look into Joseph Harris, take on that, you’ll see that it’s, it’s actually more esoteric than, um, you know what, let me read something to you that our listener of mine sent me. Okay. And then I want you sure. You’re okay. So regard this. So Dr. Tai Tatiana, Corey Geena, senior research fellow for the Institute of macroeconomic research under the Russian ministry of economic development and close to precedent Putin in our circle said the nine 11 attacks were not the rural COVID-19 terrorists, but a group of extremely powerful private persons seeking to reshape the world.\n\nThis group, he added. Has assets of about $300 trillion, which they will use to legitimize its power and create a new world government. Uh, this was, uh, this, uh, report was even occurred even in Providence, on July 12, 2001, July 12, 2011. As yet another prediction of diet ovens that would be for the United States in August, uh, 2011.\n\nIn other words, Russia had precise knowledge of what Mr. Blair called an unnamed global group. Yeah, because I skipped that part. Sorry. Um, and let me go on here and precise financial knowledge of. It’s assets. This implies something equally important for analysis for it means that not only did Russia, so of a deeper layer than simply a rogue element within American national security state, it also strongly suggested possibility that Putin’s government communicated this information to the Bush administration prior to the nine 11 attacks, given that there is evidence suggesting some involvement of the Bush administration in the planning of the drills.\n\nBeyond which mirror aspects of the nine 11 attacks. We posted that the Russian intelligence information may in part be behind the realization on the part of the Bush administration that the coup attempt was in progress and that it had to be headed off the allegations of Dr. Correa Geena also implies something else.\n\nAn equally significant the global group must have had detailed inside financial knowledge and connections. Which the Russians also knew. So this Pharrell mentioned in his book or nine 11, he’s talking about layers of conspiracy. Layers of, um, planning that went on. And, uh, so then we’re back to a concept of a small group, a break of a civilization.\n\nWe’ve we’ve been hunting them down because the, it all started with the ball man, brotherhood, back in the forties and the fifties. And it just developed into this machine, this corporate cartel mafia. Group. And it is a real, extra terrestrial, um, not extraterrestrial. It’s a real extraterritorial group.\n\nIt’s better to say they’re not bound by countries because the normal oligarchs, they have everything to gain of maintaining the status quo because this is their, again, they are getting everything. So why would they screw this up? So we have to look at an ex-player being aliens, being extra territorial, being.\n\nAI being something out of Pandora’s box like that we have to introduce it to the philosophical makes at least what do you think?\n\nAlex Tsakiris: [01:00:31] I mean, I don’t know quite what that gets us when we have so many pieces that are already. We can lay our hands on and say, uh, you know, in terms of like what happened after nine 11, certainly, uh, the, the Wars that were planned, the fact that the Patriot act.\n\nIn the United States, which is a thousand page legislation landed on the desk of all the representatives who had to had to vote on it. Literally within hours after nine 11, you can’t write it in an hour. You can’t write those thousands.\n\nAl Borealis: [01:01:07] Well, that’s a shock to a cream. It just happened. Now. Just happened now with the latest, uh, bill.\n\nThe only two, three, a handful of Congress, men were against it. It’s long. It’s the longest bill in the history is longer than the longest book in history, which is the rise and fall of the Roman empire. And they had like a few hours to decide to vote for it. And it contains everything under the earth except monitor the American people.\n\nBut. They have money for Trump’s wall, their money for East rail, Egypt, and lots of countries, their money for insane things. So it’s, it’s just a pillage. It’s a loot of the current system. And that tells me one thing, Alex, when they do this, it means there’s no going back. In, in the powers that be whoever they are, however far we will speculate, they are not planning on a return to normal society.\n\nThat’s why they are looting the treasury and killing off businesses. You know, in a capitalist society that would never happen, you know, just eradicate all lines of industries. So they’re doing that, uh, breaking people’s economy forever. Surely something else is in the pipeline than going back to Norma, because there’s no going back to normal, even if we want to, especially not in America.\n\nAlex Tsakiris: [01:02:30] Well, let’s as we kind of wrap this up, let’s. Kind of talk about that and go back to the conversations that we’ve had in the past and this year 2020, because I think it really gets to the heart of the issue that I’ve been on, which is kind of the evil thing. The reason I think the evil thing is so important is because I think it relates to your question of the oligarchs not being in power and.\n\nYou know, so you just gave evidence to why we should be suspicious of the idea that these few shadowy figures we see who are pulling these economic levers are really the people in power. What you’re hinting at is that there’s something. Some force that’s larger than that. Whether it’s AI, whether it’s some Xcel political thing.\n\nWell, the other thing I, I guess I’d point to is I don’t think we have to even look that far. We just looked at a and we say, okay, you’ve been around some of the most powerful men in the world. What do they care about? Who do they say are pulling the strings? And I said, well, I don’t know, but they get together and they do these satanic ritual abuse.\n\nSo take satanic, but they do these ceremonies. They’re obviously trying to con not trying, they’re connecting with an extended consciousness realm and that extended consciousness realm is. Reaching them in this realm. So the fact that we can’t really talk about that we can talk for hours and we never kind of get around to really saying, okay, what does that really mean?\n\nWhat does that mean in a way that isn’t dorky. Out of my little, uh, Bible here kind of definition or dorky out of my scientific peer reviewed papers as well that couldn’t possibly be possible because consciousness is an illusion what is going on? And you’re, you’re in a seat where, where you’ve studied this at great length.\n\nWhat are in these extended realms? Because they are clearly part of the power structure that is at play here. And what are they, what is their take on all this? Why can’t we even have a discussion about that?\n\nAlex Tsakiris: [01:04:42] did, you and I did, and we’re having\n\nAl Borealis: [01:04:44] a leader who can. The satanic thing. I mean, you could argue it’s a cover, whatever, but you’re right on the deepest level possible.\n\nYou are, right? Because wherever we get or impulses from at the end of the day, every human being has to make an ethical choice about their own life. And if your own life impacts other people like it usually do, if you’re a parent or if you’re a boss or whatever, but imagine if you were an oligarch or a general or a CAA gentle, whatever, a bankster.\n\nThen it does at the end of the day, it does influence the rest of society. And then yes, your ethical thing will have impact on if there are sinister forces out there. Influencing that level of our values system of our emotions, all good forces for that matter, then there, yeah, there will be a battle of war in heaven that will be parallel to whatever happens, but you don’t, I don’t want to throw in the towel like you’re signalizing.\n\nWhat if you have a lightning round where we going through the rest of your questions? Because I really want this to be the whole talk we’ve had so far. Has been amused around the red thread, which is 20, 20, 20, 21. We’ve sticked to that today. And I think because of that,\n\nAlex Tsakiris: [01:06:03] okay. Lightning round, lightning round, I’m going to start it.\n\nOkay. What show were you most proud of in 2020, most proud of most proud of whether anyone else recognized it or listened to it? Which show did you say? I did a good job there.\n\nAl Borealis: [01:06:21] Uh, there’s so many different levels. You can answer that on, you know,\n\nAlex Tsakiris: [01:06:26] you always say that you’re really\n\nAl Borealis: [01:06:29] specific, but, um, I’ll go Richard Doolin on.\n\nSo on a personal level, I was very pleased. He was impossible to get on much. Thanks to you, by the way, if you hadn’t got to go him on right before. I don’t know if I had him on a, got your wife on. I’m proud of that. I. I guess it’s\n\nAlex Tsakiris: [01:06:51] of your performance, not just proud of booking them. What were you proud of, of the way you handled it?\n\nI mean, I know what shows I thought I was most, most effected by of yours, but I want your answer. What do you think?\n\nAl Borealis: [01:07:04] Yeah, but, uh, uh, okay. That you, you’re going to answer for yourself, not for mine. I think maybe one of the last shows son Perry on, on a completely different topic on the agenda game. Because he’s a big shot.\n\nPeople don’t understand what the big short is within his field. He’s a huge big shirt. Uh, me and him had a very, uh, good champ history. So a very good it’s like a postitive subject and not just a depressive subject. So I think maybe that one in a way.\n\nAlex Tsakiris: [01:07:36] What about who was that again? Sam who?\n\nAlex Tsakiris: [01:07:40] sent her, you know,\n\nAl Borealis: [01:07:46] published. It’s published to the subscribers. It’s not out to the public, but the subscribers who listen to this have had a chance to listen to that too. It’s called the beauty of owner seduction. It’s basically how to become a\n\nAlex Tsakiris: [01:07:59] okay. I’m going to have to go back and look at it cause I’m a subscriber.\n\nSo I’m going to go and look,\n\nAl Borealis: [01:08:04] I mean you, you’re probably not that motivated. You have your babe, you are a man.\n\nAlex Tsakiris: [01:08:12] No, no, it’s just, when you have to go different places to get the content, you know, and then you have to go into the secret section. You know, sometimes I\n\nAl Borealis: [01:08:19] get that this is a lightning round. Which one are you most pleased with?\n\nAlex Tsakiris: [01:08:23] You know, one that jumps to mind that, that didn’t get a lot of attention and just kind of went out and no one paid any attention. It was my interview with Mark Pitstick on after death communication. And, uh, this is a guy who was working with, uh, Dr. Gary Schwartz at university Arizona. Sole phone, you know, an ability to talk to the dead.\n\nAnd I think they’ve completely bungled it. I think their work is fundamentally critically important for putting a final death blow to materialism, but they’ve just kind of taken it in a very weird wacky direction. And I just think pointing that out and it was an uncomfortable interview at various times, but\n\nAnyway, I can just go listen to it. I mean, I really, I really kind of held him accountable to, uh, what I think is a wacky, uh, you know, th their science is good. Their conclusions are, uh, are somewhat wacky and they’re going to turn people off.\n\nAl Borealis: [01:09:23] So he’s one of the materialists who researched it.\n\nAlex Tsakiris: [01:09:28] No he is, uh, now I’m just lightening round.\n\nSo I’m just gonna throw that. We’ll move on to the next one. Yeah. Um, let’s see. Here’s a good one for you. What topic do you feel? Was left unfinished for you that you plan on finishing in 2021, or maybe take that last part out, even if you don’t plan on finishing it, what do you feel unfinished business with in 2020?\n\nAl Borealis: [01:09:55] Uh, you know, I have several serious. Yes. So\n\ntopic probably is going to deliberately be rolled out more in 2021. Uh, I did economy or dead solar system anomalies, the virus. I think won’t go away. I have to take the vaccine zone. You know, that’s going to be a big one for, for the coming year. And since continents, gender game, no, even evil. I feel I want to be able to live alone forever.\n\nUm, no, I think everyone. I know. I know. I, I don’t, I’m I’m looking made for these kinds of questions. I love them. But I’m the worst answer as to, to all of them.\n\nAlex Tsakiris: [01:10:47] And that’s what makes it kind of interesting, really, because this is not the stuff that you’re comfortable with. You don’t mind would be, as I kind of explained, I think the Christianity thing, uh, really needs more unpacking because I’m surprised at how many people continue to be.\n\nHoodwinked by just the absurdity of the idea. And I am totally into spirituality and spirituality is the most, most important thing in my\n\nAl Borealis: [01:11:12] life. Yeah. But you never really did that, man. You never really had a broadside period against Christians. I mean, you’ve tolerated them from time to time. You’ve lashed out against.\n\nSTEM where they do. So\n\nAlex Tsakiris: [01:11:27] I don’t know my interviews with Attwell with Joseph Attwell are pretty kind of in your face. And I did one last year, you know, Joseph had bell, why the Bible is pro Roman. And again, that’s another one I, I thought was good and I think people still don’t quite get it, but I think that’s what needs to be extended is that if you don’t understand that the PSYOP thing has always been wound up in religion.\n\nIt then you’re, you’re going to be incapable of deconstructing it and you’re going to be more open to the, to the viruses that will come the mind viruses that will come because you know, like we’re talking at the very beginning of the Santa thing, you know? Okay. So on one hand, Santa is this on the other hand, Santa Lois, your vulnerability to really just absurd things that you just go along with because you look around the people around you and like, Well, everyone else is saying it.\n\nAl Borealis: [01:12:21] people won’t get the reference because I don’t think we taped that when we talked about that. So they don’t\n\nAl Borealis: [01:12:30] Are you referring to the fact that chin room, our joke, the Santa myth, and when they realize it’s not real anymore, they go one of two places either they become. Uh, skeptical and suspicious and deny it.\n\nDo you know, debunk graph everything or they just get the healthy dose of anti-authoritarianism because they, at a subconscious level, they recall that I was told something and it wasn’t true. That can happen again. I have a one for you for the lightning round. How would you describe this year in three to five keywords?\n\nThat’s a good one. Uh, and, um, when we talk about 20, 20, not the coming year.\n\nAlex Tsakiris: [01:13:11] Yeah. That is, that is a good one. And, you know, it’s like, uh, uh, like I’ve described it to my kids. It’s kind of a trite thing, but unprecedented, unprecedented in my life, in my entire life. Never. Anything even close,\n\nAl Borealis: [01:13:30] not just in your life.\n\nThere’s never been. Well, maybe if we go back to Atlanta, but in known history, there’s never been one incident that has affected the whole goddamn globe. I mean, go back to the black, right. Go back to the black plague. There was one corner of earth where, you know, you could be like, no, no, I’m an enlightened Buddha.\n\nI’m just sitting here in my cave doing my own thing. I don’t care what’s going on. And Maya Ellucian globe. But now it’s like if the earth was like 50 different video games, all sorts, you know, from seems to axis and allies to all sorts of video games in one different styles, different types. Now it’s like the whole earth is forced into becoming one big video game.\n\nIt’s like the walls of the different video games that went on here. Are cracked in and there’s an overarching game that, Oh, you thought you were playing monopoly pump, welcome to this futuristic game. Or you thought you were doing a same city or whatever they call it, you know, dressing up princesses. Oh, welcome to the real world.\n\nThe, it is goddamn unprecedented in terms of boots, space and time, you know,\n\nAlex Tsakiris: [01:14:48] that. Shit out. You are brilliant with these things. No, I just can’t stress that enough. And I always like to repeat it when things strike me that hard. But number one, The point that you make. That’s so easy for us to overlook because we’re just swimming in the sea of it, of this global communication network infrastructure, 24 hour news.\n\nWe are one world and we’ve never been one world before. So the fact that this has happened, Is truly historic, because of course we could never go back to one time a time when we’re this connected. So I just don’t think a lot of people have said that, but I think the way that you said that with relative, relative to the impact of this, it’s made it tenfold greater because of that.\n\nAnd the other point that you make, I think that analogy is super powerful because I think we all relate to that analogy as being some fundamental it truer than. Then maybe just an analogy in some fundamental way that we don’t even want to crack the simulation experience.\n\nAl Borealis: [01:15:54] I left that to you. Okay.\n\nAlex Tsakiris: [01:15:57] But I think that’s where you took us in a way.\n\nAnd I think that’s just a great, we are all being forced to play the same simulation narrative and there doesn’t seem to be any way out. Cause it’s a. It’s a OneWorld kind of thing.\n\nAl Borealis: [01:16:13] Yeah. And that’s, that’s unprecedented, like you said, if I was going to put three to five keywords on next year, I would say end game, although the end game can be prolonged, but at least we see the beginning of the end game.\n\nAnd I would also say the great choice. I think 2021 is the great choice because if the end game is rolled out, It all depends on how people of the globe will react to it. And I do think more people are waking up. I tried to argue that last time when we got hijacked into a cul-de-sac, so I won’t give examples, but I’m saying that there are signs that are waking up.\n\nSo it’s a great choice. Where do we go from here? Because if we have a globe shattering event, which we had. And it’s the mind is we could have, if I was to choose, I would choose this one much more than that. Say, uh, tilt of the globe poles or a Metroid, or there’s so much that could have this kind of impact.\n\nA complete economic collapse. I mean, verse than what we’ve seen. Well, I think this is the better one and, uh, no matter what will be thrown at us at a global scale, we would have a choice. And now we have the choice and it’s calming for 2021. So I think numerological two, you will see a completely work out 2021 is.\n\nKind of a nine 11, again, it’s a great choice. And I can say which way it goes or just count because the powers that be a more powerful than ever, but. In the same cliche every time people say that they also say that more people than ever have woken up and it’s still true. So we’ll see, we’ll see where it goes.\n\nI don’t think w you know, people will never agree upon a reality. That’s the problem that they are now. I can’t join forces with you because we don’t agree about every detail. That’s why we have stuff like religions, right? Like Jewish Islam, Christian, or like left right in politics. We have all these artificial things dividing us.\n\nWhen we don’t realize we can be clear about that. When we got our world back first, we have to fucking get a world back, man. It’s a primary need needs where we are bound to the hip. You know, and people don’t get that. So they still bickering the old school paradigm as if that’s still valid losers. Wake up.\n\nThere’s no such thing as free speech anymore or free press look at us orange. Oh, don’t get me started. Let’s move on to our next lightning round. Let’s afford a, the rest of it.\n\nAlex Tsakiris: [01:18:53] No, I think, um, let me come in on, on that. Because, uh, again, I think you made two really important points in your kind of prediction.\n\nYou did a kind of a prediction. Thanks. No, the end game and the great choice. And I was just thinking, as you were saying that I was thinking it’s really hard to argue with that. It’s hard to argue with the idea that we haven’t reached some. Decision point or we’re entering into some decision point, which is, I think what you’re pointing to.\n\nAnd I think we all feel that in a real world\n\nAl Borealis: [01:19:27] and then try to get away with whatever they can. So it’s up to us to stop it. Like, for example, you, you need the short to be able to travel free people, principle people like you and me may, uh, remain in a precedent.\n\nAlex Tsakiris: [01:19:41] Oh, I mean, there’s no, there’s no fricking way.\n\nAnd, and, and this gets back to what we were talking about before, you know, do they overplay their hand because you, you push certain people too far and it, it’s not going to end well for, for them, you know? So yeah. You know, that’s a point you made in the last show, so, and I thought you made it quite, quite well about, uh, Roosevelt.\n\nI aye. I’ve mulled over that point a couple of times since then, and that, you know, your point of the Roosevelt said, you guys think I destroyed capitalism. Fuck you. I saved capitalism. You want to drive people towards, you know, socialism than just kind of give them nothing. Well, here, I think we’re seeing the same thing in kind of the opposite.\n\nYou want to drive people towards libertarianism or towards another, you know, American revolution from our perspective. Yeah, you’re doing it. Yeah. You’re you’re you’re, you’re absolutely setting the fire.\n\nAl Borealis: [01:20:39] So freedom because libertarian is such a narrowly defined,\n\nAlex Tsakiris: [01:20:43] say Liberty. Yes. The, yeah, the, the Liberty, but all those, all the, any word you choose has\n\nLet’s not forget because that’s close. If you don’t have autonomy, you don’t have freedom. Those two things go together.\n\nAlex Tsakiris: [01:20:57] I agree. And I think that that when that is pushed too far, Uh, I don’t know. I th something could, something could happen there. But, uh, I think we’ve done good work here. Yep. Nope. Fine. I think we’ve had a good chat about 2020 and about 2021. So now in classic, kind of into your fashion, we have to have some kind of Marymount and some kind of cheer up cheer session\n\nAl Borealis: [01:21:27] at the end, then I’m going to do, I’m going to end this, uh, behind the scenes in a way I’ve never done before.\n\nI’m going to. Oh, to one of my songs and I’m going to end my version of this recording with a song where I’m singing, because I think my listeners, if they care enough to peak behind the scenes stuff, they’re going to also find amusement in hearing something new in it. Right. When you tricked me out of my shadows onto the camera, that was like a news thing, right?\n\nAlex Tsakiris: [01:21:56] So this is cool. You got to send it.\n\nAl Borealis: [01:21:58] It’s healthy, man. It’s healthy, but yeah, it’s great to, to be a podcaster Kumar. Oh,\n\nAlex Tsakiris: [01:22:03] no, no, I’m not putting that down. I’m just saying I don’t, you know, I don’t paint. I don’t\n\nAl Borealis: [01:22:08] know. Not that that’s classical sense of a creative outlet. No, no, but who needs that? I mean, you just need one and that’s a message I’ve had for all these years.\n\nPeople really underestimate creativity, something that can battle diseases, something that can battle depression. It can even battle the good damn dictatorship that trying to put on us.\n\nAlex Tsakiris: [01:22:30] There it is. See, I said, we needed this uplifting. There it is. And that’s the leading to the song. We’re all creative beings.\n\nI said it wrong and I don’t even believe what I just said. We’re all constantly creating and expressing our, if we’re not, then we should be expressing our unique creative. Being who we are all the time.\n\nAl Borealis: [01:22:56] And so if you don’t have a creative outlet in your life, you’re listening to this. Find one. I don’t care if you making food. If you’re, if you’re doing some autistic thing, collecting number plates, you can find a million ways to be creative, do it, do it because it’s your God given gifts.\n\nAnd the, by the way, it’s called the garden of souls. And I do think it’s a Sufi poetry that I’ve made into a song lyric. So yeah. I think it’s undoing it to a more positive, positive spin buddy. Yeah.\n\nAlex Tsakiris: [01:23:34] Buddy, you just did it perfectly. There is. That’s going to be the intro to the song that I’m going to play.\n\nAnd here it is. Until next time, take care. And bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Al Borealis, End of 2020 Show |479| - Skeptiko - Science at the Tipping Point", "description": "Al Borealis, this time we actually do an end of year show.   Click Here for the Forum Borealis website Click here for Forum Discussion Okay. I know I’m a little late in getting the end of year show out. It was supposed to come out last week, but Al and I got so wrapped […]", "url": "https://skeptiko.com/al-borealis-end-of-2020-show-479/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2021-01-06T14:31:34+00:00", "article:modified_time": "2021-01-06T14:53:05+00:00", "image": "https://skeptiko.com/wp-content/uploads/2021/01/skeptiko-479-end-of-2020-1.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Al Borealis, End of 2020 Show |479|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/3xNrsUrrdo0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/3xNrsUrrdo0?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-479-end-of-2020-al-borealis.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-479-end-of-2020-al-borealis.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-479-end-of-2020-al-borealis.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/al-borealis-end-of-2020-show-479.4614/", "https://www.forumborealis.net/", "http://www.skeptiko-forum.com/threads/al-borealis-end-of-2020-show-479.4614/", "http://www.skeptiko-forum.com/threads/james-ellis-raising-the-conversation-past-level-zero-473.4599/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2021-01-06T14:31:34+00:00"}