{"result_id": "273036", "URL": "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "timestamp": "2023-04-25 17:09:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Mary Rodwell, Extended Consciousness Hierarchy |587|", "cleaned_text": "[00:00:00] Alex Tsakiris: Um, this episode of Skeptiko, , a show about the aliens that may be living among us\n\n[00:00:09] Clip: This place is crawling with them. What’s that?\n\n[00:00:13] Clip: Hey guys. Oh, thank God. And we started a community as survivors. Y’all come live with us.\n\nWait, how did you know? Come on. Redneck wants us to move into his community. Us. ​\n\n[00:00:30] Alex Tsakiris: and switching to a totally serious straight up mode what their agenda may be.\n\n[00:00:36] Mary Rodwell: I don’t believe they’ve come in with all that awareness. The downloads, the information, scientific information, don’t believe that’s for a waste of time. I believe there’s a reason behind it, there’s an agenda behind it, and I think it is going to change the consciousness of this planet at some point.\n\n[00:00:52] Alex Tsakiris: , that first clip was from Key and Peel, where they’re yucking it up, but you kind of get a sense that, there’s a little bit more going on there, especially when you look at the movies that Jordan Peele has made. And the second clip was from today’s returning guest, Mary Rodwell, who I think is just amazing and terrific and will be absolutely over the top. Impossible for some people to process straight on. But nonetheless, , I think we have to, and we certainly do in this interview. And before I get to the interview, I wanted to play a clip that was kind of a post-interview discussion we were having.\n\n[00:01:31] Alex Tsakiris: I think it’s really relevant to this question. I keep asking, you know, does ET have an n D E, does et have a life review, is really what I’m driving at. And Mary answers the. So here’s this extended clip, and then we will jump right into the interview.\n\n[00:01:49] Mary Rodwell: I, there was a regression that I did with a gentleman who was very spiritual.\n\n[00:01:53] Mary Rodwell: And he is one of the ets going to a very primitive society. And he basically said, we decimated them. We killed them all off. And, and they saw us as gods. And I know afterwards he was horrified. Mm-hmm. . But one of these gods that had come down and basically barbarically just decimated them. Didn’t, didn’t surprise me.\n\n[00:02:14] Mary Rodwell: Cuz I think we’ve done the lot, you know, we’ve, we’ve done all of this ourselves. We’ve just, did\n\n[00:02:19] Alex Tsakiris: he say, why did he say, was that his,\n\n[00:02:21] Mary Rodwell: it’s just that superiority. He just wanted slaves. So the ones he kept alive were slaves. He was horrified afterwards. Cause he was a very spiritual guy and he was like, did I really do that?\n\n[00:02:34] Mary Rodwell: You know? Mm. It seems like you did. You know, so,\n\n[00:02:38] Alex Tsakiris: so you know what I, I’m tempted to if, if you’ll allow it. put that little vignette in cuz it directly answers, does et have an n d e, does et have a life review? Because the near death experience, to me, the, the most, one of the most beautiful spiritual aspects about it is, yes, you will be judged, but you will be the judge.\n\n[00:03:03] Alex Tsakiris: Yes, you will be the judge, you will be the witness, and your story answers. That et is in that same game, in that same cycle of growth, of learning, of seeing how actions have consequences. Do you think that’s, is that your, is that what you take away from that story? Yeah.\n\n[00:03:25] Mary Rodwell: Well what I also do you see is when I take them through the death sequence, I’m saying, so what did you learn in that life?\n\n[00:03:32] Mary Rodwell: And they may say, limits compassion. I didn’t do so well in this, this, and this. So the life review is by you only. You are the one looking at what you’ve achieved as a soul in that what you gained, what you didn’t do so well with. I’ll have to look at that again or I’ll have to explain. And\n\n[00:03:49] Alex Tsakiris: in this case, in this case, it was et doing.\n\n[00:03:53] Mary Rodwell: Oh yeah, he was, he was, he was. Because he said, we are seen as gods because they had the technology and what have you. And he said, we just decimated them. We just kept alive the ones we wanted as slaves. He didn’t say, I can’t remember what kind of et he was, but he was, you know, , I can’t remember what form he was.\n\n[00:04:11] Mary Rodwell: I, I, I only assume he was some form of humanoid or whatever, but he, that’s what he said. We decimated them.\n\n[00:04:19] Alex Tsakiris: Welcome to Skeptiko, where we explore controversial science and spirituality. Today we welcome author and researcher Mary Rodwell, back to Skeptiko. Now, Mary has been on, I think, three times before, not in a couple of years, which is, I mean, love to have her on all the time, but love it when I have kind of a real reason for digging back into this amazing body of work that she has.\n\n[00:04:47] Alex Tsakiris: I have a ton of respect for Mary. , I’ve found her for years to be among the smartest, most forthright and just well informed researchers when it comes to the whole et. And they force me to use all these other acronyms too. Non-human intelligence, contact experience, kind of field, her books.\n\n[00:05:09] Alex Tsakiris: , particularly her second book, the New Human Awakening to Our Cosmic Heritage, is going to be super relevant to a lot of the stuff we’re gonna talk about today. So if you haven’t read that book, please get it, read it. It’s vital to not only understanding, not just this interview, which we’re gonna jump right in the middle of, but what’s going on in general.\n\n[00:05:34] Alex Tsakiris: So Mary, thank you so much for being here. It’s great to have you\n\n[00:05:38] Mary Rodwell: Alex. It’s always a pleasure, and thank you for inviting me.\n\n[00:05:41] Alex Tsakiris: Okay, so here’s the thing. , I have this guy on the show, philosopher, author, brilliant, really love this guy, Dr. Jason Gianni. Have you ever heard. No, I, I don’t think I have. Probably not.\n\n[00:05:54] Alex Tsakiris: He’s kind of more in the parapsychology field, but absolutely kind of blew it up a few years ago with this book Prometheus and Atlas, which everyone was talking about, kind of redefining this whole thing and then followed it up with another book, closer Encounters. And I have him on, and I’ve had people buzzing in my ear because one of his conclusions speculations, and I don’t wanna go too far, cuz he is very, uh, balanced guy, very reasonable guy, just wanting to look at all the evidence.\n\n[00:06:26] Alex Tsakiris: But where he’s coming from is, hey, this near-death experience stuff, this spiritually transformative, experience kind of stuff that you’re talking about, Alex, it’s et. I think you’re being deceived. I think it’s et and you know, we’ve talked about that before. There’s some elements of that, uh, that, that do need to be explored.\n\n[00:06:47] Alex Tsakiris: Do need to be broken out. So, lo and behold, here we are. I’ve come running to you for help. Mary, help us out. Help us understand these extended realms of consciousness, where they might be the same, where they might be different, where they might be overlapping in ways that, that we don’t normally understand.\n\n[00:07:08] Mary Rodwell: Well that’s a, a really wonderful insight from that gentleman. And the bottom line is that’s some of the conclusions that we, we’ve discovered with the Dr. Edgar Mitchell free Foundation, which has moved into Consciousness and Contact Research Institute, where we are looking at consciousness as primary to all of these kinds of experiences.\n\n[00:07:30] Mary Rodwell: And what we’ve discovered is for some people with contact that ultimately results in the 4,200, the result we had was 85% noticed a psychospiritual transformation. That’s a huge number that have said it, expanded consciousness. But what we also discovered is many of them had this, their IT contact or their contact with non-human intelligences after a near death experience, after maybe a healing experience, after a shamanic experience.\n\n[00:08:06] Mary Rodwell: For example, if you, you know, or maybe that, you know, they’d gone into, um, taking ayahuasca or whatever and having in so this whole range of altered states or profound human experience. Astral travel, remote viewing. All of these things ultimately led to this expansion of consciousness and connecting to these intelligences.\n\n[00:08:29] Mary Rodwell: So there seems to be many avenues to connecting to that higher consciousness and our connection to these various intelligences. And not all of them we know are physical. We are talking about interdimensional, interdimensional, transdimensionally, and very likely those coming from our future. I had a seven year old explain to me he was a time traveler, and he actually came from the future make of that, what you will.\n\n[00:08:56] Mary Rodwell: But what it’s really saying is that we’ve got to explore this from a very broad perspective now, rather than how it has been in in the past in a purely nuts and bolts eu, eu, F. .\n\n[00:09:10] Alex Tsakiris: Great. Well, you’ve, you’ve kind of laid out so many topics to kind of go into, so let me start pulling it apart with a little bit of our history together, because I don’t know if you remember completely, but a few years ago we had this wonderful, , interview exchange where I was interviewing you and, , Dr.\n\n[00:09:29] Alex Tsakiris: David Jacobs, and we were kind of interleaving these interviews and for people who don’t remember, don’t recall, dr. David Jacobs along with , bud Hopkins, and I guess we could say John Mack were really some of the, the first people to look at et contact experience.\n\n[00:09:46] Alex Tsakiris: And they were kind of covering the gamut way back then. You know, John Mack saying, are these John Max at Harvard? And he’s, uh, initially saying, wow, this is incredibly important and we have to look at it. And then he is saying, Hey, is this really spiritual or something else? And then we have Bud Hopkins and David Jacobs who are saying, what the heck are you guys talking about?\n\n[00:10:05] Alex Tsakiris: Spiritual? This is abduction, this is rape, this is violation In any normal way. We talk about, uh, people being violated. . Yeah. So in the discussion that we had, what I thought was really interesting in Ev interleaving, these interviews back and forth, Jacobs comes on and says, look, I know how to do this stuff.\n\n[00:10:26] Alex Tsakiris: I know how to do forensic hypnosis. I know how to ask questions that kind of lead people in the wrong direction to see if it can self-correct and all the rest of this stuff. And I talk to you and you go, great. I do too. . I’m a medical professional. I’m very careful. I do my research and have always done my research to the highest standard I possibly can.\n\n[00:10:45] Alex Tsakiris: I do the same. And he says, but wait a minute. She’s saying it’s all about this spiritual consciousness stuff, baloney A and then you have your part. He says, it’s about a program. . It’s an operation to create a hybrid human. And I come back to you and you go, well, Yeah, it is spiritual, but yeah, it is a program to create hybrid humans.\n\n[00:11:12] Alex Tsakiris: So I, I, I guess that has always stuck in my mind and I’m not sure, you know, I’ve been, I was with the free guys along for the ride for a long time with Ray and all those guys. I really thought they went, they shot the moon with the consciousness stuff way too far to, in my opinion, didn’t pull it back to full spectrum of experiences, , that there are some negative experiences here that aren’t easily kind of shoehorned back into this.\n\n[00:11:41] Alex Tsakiris: Wonderful, we’re all in Kumbaya, you know, it’s all love and light kind of thing. So retracing those steps with David Jacobs, , where do you sit these days in terms of, I guess we could, in very simple terms, experience versus abduction, alien contact experience versus abduction.\n\n[00:12:03] Mary Rodwell: It’s a very good question and the, the problem is, it’s so complex.\n\n[00:12:08] Mary Rodwell: First of all, I would say, you know, when David Jacobs and, and I’ve met him, a lovely gentleman actually, , , he heard my presentation and apparently he, someone asked him what he made of Mary’s presentation and he said, I didn’t understand any of it, so I dunno, I must have been speaking in another language.\n\n[00:12:26] Mary Rodwell: But anyway, , the hybridization, let me go back right to the beginning when Homo Sapian, sapians was created, you know, in the missing link and the fact that we have d , dormant, d n a, all the rest of it, when somebody says to me, you know, they’re hybrid hybridizing humanity with lots of different d n A and what have you, you know, and David Jacob says, and, you know, it’s, it’s gonna, he sees that as a big threat.\n\n[00:12:54] Mary Rodwell: I’m saying, look, we’re all hybrids. We were hybrids right from the very beginning because. A lot of evidence has been suggested that at least 12 different species have interfered with the indigenous d n a, , command Sergeant Robert Dean, that beautiful ologist that, , is so respected, , admitted, , that he’d been up on the craft before he died, and he was told on the craft that at least 12 different species had, , been part of our makeup, if you like.\n\n[00:13:23] Mary Rodwell: What I’m seeing now is a lot more evidence of awareness of it so that people will say to me, I’m a hybrid, and I’ll say, and they may even say, , you know, I’ve got more pian D n a or I’ve got more octorian or whatever, so that. Itemizing to or specifying how they connect to a particular star system or whatever, which I believe is part of this activation that’s going on of that d n a, that’s then giving people more insight into their origins that, you know, we call it their star origins and what have you.\n\n[00:13:59] Mary Rodwell: Now, the second part of why is it we’ve got 15% that are hugely in fear and very negative and whatever I have, you know, and I, I think this is only right to say there’s, there is bound to be certain species that have a self-serving agenda. I, I don’t doubt that. But I also will say some of them are working and we can’t dismiss the MyLab and the military interference where they’re abducting people and making it out to b e t.\n\n[00:14:29] Mary Rodwell: Now this is the bit nobody wants to hear because. How can humanity do this to humanity? Well, they can and have done, and what they have is the technology to abuc people and make them believe it’s et They are also creating from my research programmed life forms that look like zita or grays look like reptilians that are not, that are programmed by the military.\n\n[00:14:56] Mary Rodwell: This is really dark stuff. If it’s as I believe the research is saying and the people that I’ve worked with in hypnosis that have been in underground basis and had this happen to them, and I remember one beautiful lady who had had hypnosis, , regarding a really terrifying experience. She was in an underground base.\n\n[00:15:17] Mary Rodwell: She was lying on a table. There was a huge picture or hologram of a mantis, and she was being told, this is evil. This is bad. You must fear these. Now make of that what you will. . But what I’m hearing from those that have had very, some very benevolent interactions, but also some very dark interactions. So some of it may very well still be, you know, , these non-human intelligences that are self-serving.\n\n[00:15:46] Mary Rodwell: But we’ve also got a very self-serving, , , , military complex or deep state complex, or whatever you wanna call those behind the scenes that are working in these, that know about the technologies, know about the ets, know about how to abduct them, and are deliberately creating this negative fear-based program to keep the humanity, the rest of humanity knowing the truth.\n\n[00:16:12] Mary Rodwell: This is not conspiracy theory guys.\n\n[00:16:15] Alex Tsakiris: This is Well, it’s fine if it, it’s fine if it is, cuz it, it is, I mean, that’s the best way to describe it. It is a conspiracy. It’s an intentional, yeah. Which is kind of interesting. I don’t wanna get too farfield, but whenever we talk about, uh, U F O U A P, the whole thing, it, it’s kind of funny when people throw conspiracy into it, it’s like, well, it’s now outed as a conspiracy.\n\n[00:16:39] Alex Tsakiris: Yes. They’ve lied for 70 years and it’s been outed that they systematically lied, systematically spread disinformation misinformation. It, it’s, it’s not, uh, so to say conspiracy theory. It’s like, of course, the, the thing that’s strange in that is that we still, when we, when we’re presented with people like Lou Elizondo and he says, , counterintelligence.\n\n[00:17:03] Alex Tsakiris: Okay. That’s okay. Still tell me. It’s like, oh wait a minute. Shouldn’t we say full stop? You’re part of the group that’s lied for the last 70 years. Or the guy walks out there, the general and he has the blue suit and all that. You’re like, wait a minute. You guys lied for 70 years. You never came clean about it.\n\n[00:17:19] Alex Tsakiris: Why? You are, you’re how did yourself as being part of a conspiracy. But I wanna try and pull this apart in a slightly different way cuz you went back to the David Jacobs thing and you said he saw your presentation and he said he didn’t understand. I think that’s a, I think there’s a, a truth to that that really gets at something deeper.\n\n[00:17:39] Alex Tsakiris: That is a complicating factor in this whole thing. And I explore that with Jacobs. The reasons Jacob. Doesn’t believe, doesn’t understand anything you’re saying is because he doesn’t believe in consciousness. And I’m not saying like this extended realm, et o uh, OBE kind of thing. He believes that everything about our here and now experience is generated by the brain in this 3D reality.\n\n[00:18:07] Alex Tsakiris: And in that way, he’s out of sync with a hundred years of quantum physics. He’s out of sync with. observer effect with mox plank with consciousness is fundamental it, but it is this scientific materialism that has been this effort derail this stuff from the beginning. So what’s interesting about the conversation that we’re having, and that free is tremendously responsible in a positive way of bringing us into, is to say, gosh, darn it, you guys forget that crazy scientific materialism.\n\n[00:18:42] Alex Tsakiris: Of course it’s about consciousness, but the tricky part is like when you talk about, , the MyLab stuff, how would we understand MyLab without et Yes. So, you know, then the, then the question becomes, what is the relationship between our cooperation, our. Collaboration with some of these non-human intelligences and some of the worst stuff that we see going on today.\n\n[00:19:08] Mary Rodwell: you’ve encapsulated it really, really well. I, and. , the thing that I did discovered very early on when I was working with experiences and I did some big groups when I was at, you know, big conferences, you know, we had experience groups where 70 people would turn up and what have you and I would have most really exploring it, really open to, and telling me about their encounters.\n\n[00:19:33] Mary Rodwell: Some of them extremely beautiful, very uplifting and what have you. There was always that small percentage of highly traumatized, um, that are very negative about all their experiences. And it was n it became very obvious that primary to those that were most traumatized were the ones that generally were victims of my lab, were victims of the human side in collaboration with certain, , species.\n\n[00:20:01] Mary Rodwell: And that in itself was very illuminating. That’s why I needed to find out. So what is, what is going on here, you know, Where is that trauma coming from? Some of those were traumatized because they didn’t understand and when you take them into, they may say, you know, , I’ve been scared all my life and what have you.\n\n[00:20:20] Mary Rodwell: And I’m gonna tell you a, a little, , your listeners a little story very briefly to explain this. , there was a, a whole family in England that I did a regression with the whole family cuz their car had been taken up. The grandmother was particularly terrified after, um, this experience, but she’d been terrified all her life.\n\n[00:20:39] Mary Rodwell: And, , I did a regression with her and a grandson, but the one with her was like this. I said, I want you to go to the origin of your fear telling the subconscious subconscious go directly to where this started. It took her to two years old in the cot and she was looking up and seeing two mantis beings standing there.\n\n[00:21:05] Mary Rodwell: And she said, I looked up. and saw these beings and it terrified me cuz I didn’t know what they were or who they were or whatever. So I said to her, did they harm you? She said, actually, no, they just were observing me. So I said, so they didn’t harm you? She said, no, and we worked with where she held the fear and I, I won’t go into the therapeutic way, but we cleared that.\n\n[00:21:31] Mary Rodwell: She then saw all the way through her life how they’d helped her in her life in so many ways. She came out, literally, she was in her si middle sixties dancing. She, this is the first time in my life I’m without fear and they didn’t harm me. They’ve been helping me all my life, but I didn’t understand. And that was the, the what you can do when you take them into that space to see the full picture and to see what actually went on.\n\n[00:21:58] Mary Rodwell: Nine times outta 10, it ends up as being a healing procedure. You know, 50% of those that were were, were, , talked about their experiences. Out of that survey that we did, 50% had healing procedures. Preston Den talks, he’s written several books on the amount of healings done by these beings. This isn’t put out, this isn’t what everybody knows.\n\n[00:22:21] Mary Rodwell: They just know they’re all bad and evil. Why is that? Because of our own dark, uh, government that is deliberately promoting a negative persona to all of our et interactions.\n\n[00:22:34] Alex Tsakiris: Let me throw another case that everyone knows at you, because I think it, it hits on so many of these points. So, uh, Whitley Streiber is probably the most famous Yeah.\n\n[00:22:44] Alex Tsakiris: Abductee ever. And I’ve interviewed him a couple times. He’s interviewed me, been on shows. He, he, he’s not so fond of me anymore cuz I didn’t like his book on Jesus or the, the implications of the one one true God kind of thing, but Right. Okay. . Interesting thing about Whitley, MK Ultra guy, right? Mm-hmm.\n\n[00:23:06] Alex Tsakiris: like, not a lot of people know this, but you can know this if you just read his books. So MK Ultra, again, would connect with MyLab direct link, right? So we, you, someone would have to, could push back and go, Hey, there’s no evidence of that. Well, , there’s evidence of MK Ultra, right? There’s evidence that right.\n\n[00:23:22] Alex Tsakiris: When Whitley was seven, eight years old, somebody from in San Antonio and his dad is in military intelligence, air Force intelligence, they knocked on the door and said, we got a special program for your boy. Yeah. And he goes in, there’s in these kids, in these Faraday cages and they’re trying to create this disassociation with them.\n\n[00:23:41] Alex Tsakiris: Yes. Uh, d i d kind of thing. Yeah. And then as we kind of touched on at the beginning, isn’t it funny Whitley goes on to be an experiencer and the door is open now for him to have et contact, but here are the points that I guess. I, I, I really appreciate your, your openness to kind of handling this or, or, or to discussing it cuz that’s what you do.\n\n[00:24:05] Alex Tsakiris: He was raped, right? Mm-hmm. . So Whitley’s experience was, I was raped. And he says that to this day. And our understanding of that experience in terms of our culture, in terms of our values, in terms of our spirituality, is yes, you were violated in a way that, that you did not consent to. Yes. And even though he, it will come around to some of the spiritually transformative, positive kind of aspects of this, it is not crystal clear to him where that falls.\n\n[00:24:37] Alex Tsakiris: So I’m always a little bit leery when I hear the free stats and it rolls into, you know, Well, you know, it really was good after all. That can be, I, I don’t know that we can really hang our hat on that because a lot of people can reframe their experiences in ways that, good, you’re nodding your head, please tell me what you’re thinking.\n\n[00:25:00] Mary Rodwell: I’ll give you another incident. And I’m, I’m not saying that everyone ultimately didn’t move from a very negative experience that they may very well have had into seeing some more positive silver lining in it. , because we can, we can expand and say, because of that, it’s brought me to this place. And that’s been really helpful and very useful and what have you.\n\n[00:25:23] Mary Rodwell: I mean, I, you know, I can understand that, but I’ll, I’ll give you. What I’m, when I, I’ve done hundreds of regressions, hundreds and hundreds now I’ve worked with over 3000, three and a half thousand families and children and whatever. , to give you another example of a man that had experiences, he was quite cool about being on the craft.\n\n[00:25:42] Mary Rodwell: He was quite cool about, , all of this. He felt very connected to them and all the rest of it. But he said, every, there is something that still terrifies me, Mary. And I said, so what is it? He says, when that eye starts to come towards me, he said, I freak out. He said, there’s something about that that terrifies me and I don’t know why.\n\n[00:26:00] Mary Rodwell: So I said, what do you think is happening? He says, I don’t know. So I took him specifically to that point where, , he, he wanted to clear the. So, , I took him very gradually and I could see his body language was getting more and more, , anxious and stressed, as I’m saying. Okay, so the, the eye is coming towards you now.\n\n[00:26:21] Mary Rodwell: Okay, it’s coming, it’s coming, it’s coming. And I’m, you know, I’m hoping we’re gonna get through this without him being further traumatized. Then all of a sudden, he completely relaxes. And I said to him, so what happened? Then? You’ve got the eye coming. You’re terrified of this eye coming towards you. What happened?\n\n[00:26:39] Mary Rodwell: Oh, he says, they’re just giving me information. So he’d been afraid from his human mind. They were coming to take him over when in fact all they were doing was feeding him information through that medium or whatever. And so when anyone comes to me with fear, I’m always going to the origin of that fear and seeing if that fear actually.\n\n[00:27:02] Mary Rodwell: They can look at that fear and deal with it and find out what’s behind it. So for me, I’m always working with the consciousness of that individual that is helping them to understand what that experience is. There have been, you know, the, my lab ones where it’s been terribly traumatic and they may be in an underground base and they’ll say human figures, white coats, doctors, they’ll see et beings and what have you, and it can be everything from rape.\n\n[00:27:31] Mary Rodwell: I remember, , facing the shadow, embracing the light by Nira Isley. I did the forward for the her book and she was heavily traumatized by her, my lab experiences. And she was in, um, in the military. She’d been abducted, she was raped and what have you, and she was explaining that. And this takes it. You see her always takes it to that bigger, broader, um, schematic of the soul because she said to me, When I realized that, that I had those experiences and she was connected to what she called her star family.\n\n[00:28:08] Mary Rodwell: She said, why? Why did you not protect me? Why did you let this all happen? And then she said, oh, I realize that that was part of the mission to experience it and write about and expose it. And then as soon as I’d done that, they stopped. So we, you see, you can’t just look at it from this minuscule microcosm and say, I get it, because you can’t get it.\n\n[00:28:33] Mary Rodwell: You can only get it when you’ve got the bigger picture. And the bigger picture takes takes us to a spiritual realm called the soul. Oh my .\n\n[00:28:44] Alex Tsakiris: This is, uh, this is so exciting. This is exactly where I wanted to get and I love how we keep swapping these stories. You have real stories. I have , kind of secondhand stories, but I’m gonna throw one on the table.\n\n[00:28:56] Alex Tsakiris: Cause I just spoke to a very prominent near-death experience researcher earlier in the week, and she’s worked with a lot of children who’ve had near death experiences. Yes. One of the cases that she worked on very, very horrible. But a reality is a child who is born into a Satanic cult and there’s a multi-generational satanic cult and anyone who knows about these cults, and I also interviewed.\n\n[00:29:23] Alex Tsakiris: Couple other people who’ve worked in that realm, either as doing regression with people who’ve had that, , psychologist professionals or people who like Anna Col Lucas, who were sold into the dut cult in Belgium when she was six years old, imagine by her mother, kind of thing. So this is a reality, and I wrote a book a couple years ago titled Why Evil Matters.\n\n[00:29:44] Alex Tsakiris: And I always come back to that why Evil matters. Evil Matters because I think it is a lens by which we can start to understand the greater soul reality, the greater, , spiritual reality. So back to this woman though, born into this satanic cult who had multiple, multiple near death experiences, an unbelievably shattered life.\n\n[00:30:10] Alex Tsakiris: She spends 15 years after she starts having flashbacks in terms of coping with it, but she eventually copes with it. And here’s what she says. I’ll read it. I now know I came into this life to shift the consciousness of my biological family and the members of the cult. I was shown that as they performed rituals, I was in a protective bubble.\n\n[00:30:33] Alex Tsakiris: And I could see that by being in my presence, their heart chakra was ignited. What was dark before now ignited the eternal flame in their heart and their connection to the divine source. A remembrance. Whether this changed what they were doing or not, I don’t know.\n\n[00:30:51] Alex Tsakiris: I was given the grace of understanding how they were in so much darkness. They truly could not remember who they were. They needed my compassion, and the compassion flowed from me into that moment. And here’s the tough part. Hmm. Um. , I had an experience of our oneness, our apparent separation as them an abuser and myself as a victim was revealed in that moment of truth.\n\n[00:31:21] Alex Tsakiris: I was not a victim. So from a soul perspective, from a spiritual perspective, from a God perspective, I get it. I don’t get it from anything we call ordinary 3D reality. And I don’t think it, it, I think we can’t just try and fold that back in and say, oh, this is what’s happening. Oh, it’s all planned. Oh, it’s it, it’s my soul contract.\n\n[00:31:49] Alex Tsakiris: Maybe yes, maybe not, but it would not fit with anything that you and I are talking about in terms of holding governments responsible in, in terms of a legal system that we have in terms of our relationships to each other. Uh, none of that would make sense in this 3D reality. If we said, There are no victims, there are no abusers.\n\n[00:32:11] Alex Tsakiris: I get it on a soul level, but on another level, I, I, no,\n\n[00:32:16] Mary Rodwell: that’s the issue, isn’t it? Because let me just take you to what, what brought me more into the soul journey and understanding the soul journey as opposed to the microcosm that we’re here with no memory of who we are, what we are, um, going through an experience where we are making choices to work through different soul challenges, if you like life challenges.\n\n[00:32:41] Mary Rodwell: So it give you an example, I do a lot of past life, I have done a lot of past life experiences and they may go through a particular past life where it was tough. Maybe they starved whatever. I take them through the death sequence for a reason so that they can see they are eternal. And I will say to them through that, when they’ve seen that, that how they’ve died, et cetera.\n\n[00:33:03] Mary Rodwell: And I’ll say, what did you learn in that life? and they may say, well, I learned about limits, or I learned about compassion, or I learned about X, Y, and Z. Okay, so they’ve got a new package to work with and then they’ll talk about going to their soul fam, their soul grouping or their soul family and choosing the experiences that they’re going to make, , have as a human next time round.\n\n[00:33:25] Mary Rodwell: But who’s gonna be in the family, what they’re gonna learn from and what have you. But the whole idea is that we come here on incarnate with those, that lack of memory, so that we can truly experience what it’s like to be human in a limited, , hologram, if you like, of reality. Cuz I’m, I’m still not sure about whether we’re in the hologram or not , what is reality?\n\n[00:33:50] Mary Rodwell: Um, whatever. Anyway, , so it’s about then learning from those choices. And in that sense it’s learning what is loving and what is not loving. ultimately, to put it really simply not, I don’t like the good and bad and whatever, it’s what is loving, what is not loving. And we’re all as souls here helping each other to grow, to learn, to expand as part of the cosmic source of consciousness that I believe we’re all from.\n\n[00:34:18] Mary Rodwell: So it’s, we are playing a role and experiencing and deciding through our choices where we are gonna go with our experiences and how we choose to learn from them. And it’s all about attitude. How, how are we going to interpret those or whatever. So I just see it as we are te we’re a bit like Star Trek and you know, the ho, the holodeck where you say, I’m gonna go back into the 1930s and I’m gonna experience whatever.\n\n[00:34:41] Mary Rodwell: I’m really putting it in really simple kind of terms, but that’s how I’ve come to understand that we’re all here as salt, helping each other to grow as well as making our own journey. For an expansion of consciousness, for an expansion of, of that, that source divine source. We all, you know, are all from whatever name you want to, you wanna give that.\n\n[00:35:02] Mary Rodwell: It’s an expansion of that that, I mean, I’m, I dunno if I’m right, but that’s at the moment, the only way that I, I can understand what’s going on and I get what that lady is saying. Absolutely. I get it. Absolutely. I get\n\n[00:35:17] Alex Tsakiris: it. Absolutely. Only if there is a hierarchy of consciousness, if there is a unity of consciousness.\n\n[00:35:24] Alex Tsakiris: If there is God, for lack of a better term. Yeah. I don’t get it. If I. If I take the, what I sometimes worry about with kind of the free consciousness everywhere is the blob of consciousness is there is no hierarchy, there is no moral imperative. There is no good or bad. It’s just blob of consciousness.\n\n[00:35:43] Alex Tsakiris: Then I don’t understand evil, I don’t understand people who are, you know, because one of the things you said about like our government or my lab or, you know, the Satanic ritual abuse. If we look at the differences that kind of jump out is one, they seem very attached to this. What you, the term you like to use is 3D reality, you know, this time space continuing.\n\n[00:36:04] Alex Tsakiris: They seem very interested in controlling things in this reality and, uh, amassing things and, and, uh, manipulating things. Yeah. As opposed to when we look at near-death experiences, , for the most part, what they’re about is what you’re talking about is love is about acceptance. It’s about, oh my gosh, now I see.\n\n[00:36:25] Alex Tsakiris: That this is just a game and I’m just playing it. And so there is that contrast. Yeah. But et doesn’t fit always in one category or another. So , the way I always put it out is, does et have an n d e, you know, what is the nature of this hierarchy of consciousness? Because some people are gonna come back and say, which I, I can’t say that they’re wrong, ET is God, ET is orchestrating the N D E.\n\n[00:36:55] Mary Rodwell: The problem is that we can only come from our own programming, our own awareness of what is reality. So ev for example, if someone’s very religious, , they will perhaps see a being, , a light being as a, an angel, as an angelic presence or whatever, where someone else with different, , beliefs will call that a light being.\n\n[00:37:18] Mary Rodwell: It’s, it’s how we, we are going to perceive and judge it from our limited understanding or whatever. My sense is there are different levels of consciousness d and we are accessing, depending on how open we are, we access more and more of those higher levels of consciousness, which I believe ultimately are all connected to whatever that source of consciousness we all belong to.\n\n[00:37:41] Mary Rodwell: I believe we’re all part of that, but what we are choosing to do is be limited in certain realities so that we can grow and basically, you know, I said I was nosy. I think the soul is nosy, , and wants to, wants to experience. Both, you know, all shades of experience, not just one shade or another, but all shades of experience and, and understanding it through whatever level of awareness that they have at the time.\n\n[00:38:14] Mary Rodwell: That’s as much as I can say because I, I don’t know what, I don’t know. I only know that one thing is that we, we can’t see the full picture. We, you know, because we’re, we’ve incarnated into a limited, uh, 3D reality, which is only allowing us glimpses so that we can ex really, truly experience and be part of that experience if we already knew how it was all gonna play out.\n\n[00:38:39] Mary Rodwell: It’s like, you know, reading the end of the book. We’ve learned nothing because you say, oh, already know how it’s gonna work out. So, you know, it doesn’t really matter. So being limited is actually a gift because it allows us to really be and make choices from our limited knowledge and awareness as a growth.\n\n[00:38:56] Mary Rodwell: You know, I see it all as, you know, we’ve come here to have an it, you know, we’ve have an adventure, a soul adventure, really, and we’ve all chosen a particular scenario more than others, even if we’re not aware of it. But from that, we are gaining insight and understanding of our higher purpose, our higher self and, and our connection to whatever that source is.\n\n[00:39:16] Mary Rodwell: And I have no idea what that source is because I remember a nine year old telling me about God, and she said, it isn’t male or female, Mary, you know, , she basically said it’s, it’s an ultra terrestrial, was her name for it. And she said, and we all come from there and it’s, it, it is where the light and the angels reside was how she put it.\n\n[00:39:38] Alex Tsakiris: down with that. But you know, as we keep bouncing back and forth in this discussion, we have a desire, you and I both do to try and make things as truthful, open, honest, and positive as we can in this reality. And when we see deception, when we see intentional deceit, manipulation, and harm, then we feel a need to at least point it out and at least try and bring people accountable to\n\n[00:40:08] Mary Rodwell: Absolutely. One of the things I can’t help myself doing is when I see the lies, the deceit, and what have you, I’ve gotta say something because, you know, I believe that if you’ve come into this reality and you are gonna be trapped by fear of everything bef because you can’t speak your truth, or you are afraid of judgment or whatever, you are actually, uh, denying your soul purpose.\n\n[00:40:31] Mary Rodwell: Because your soul has come here to have an integrity and a uniqueness that is here to bring whatever your energy is to this planet. If you are hiding behind fear or, or whatever, which is what is going on with lots of people. They’re so afraid of being themselves, being unique, and basing judgment. We’re here to actually say, we are meant to, you know, rattle your cage.\n\n[00:40:56] Mary Rodwell: We’re here to rattle everybody’s cage because through that, we all actually grow and learn and whatever. So for me, I’ll, I’ll talk about anything I think is wrong on this planet, because for me it’s about the one thing of all, and that’s truth. Or I remember when I was doing hospice, looking,\n\n[00:41:15] Mary Rodwell: And one of the things they said to me was, you know, I regret not saying or showing people who I was or what I was. And I, I remember making a, a contract with myself and saying, Whatever now I do is going to be who I am and what I am and at least when I die, my kids are gonna say, well, mom was a pain in the neck, but at least we know we knew her.\n\n[00:41:40] Mary Rodwell: We knew what was in her heart. We, and that’s my legacy. Even if I was a pain in the neck, you know, and, and a irritant or whatever it is. Because that’s to me is what it’s about. Speaking a truth and actually pointing out things that are not loving, that are not right, that need to be changed on this panel.\n\n[00:41:59] Mary Rodwell: And I will talk about any subject you like and I’ll, I don’t care who I offend cuz as far as I’m concerned, I’m here too. Be true to my sole self and who I\n\n[00:42:10] Alex Tsakiris: am. . But it’s tricky, isn’t it, Maryanne, especially in, in your work because you have, , , broadened your, the entire body of your work is all about acceptance, right?\n\n[00:42:23] Alex Tsakiris: You’re providing away you, you’re a people helper, you know, so you, and people can get that you’re empathetic and they can just see him talk to you and have this warm glow of energy that flows back and forth, and you’ve used that to allow people to share things they’ve never spoken with about anyone else.\n\n[00:42:40] Alex Tsakiris: With that comes the problem of not everyone is really in touch with this reality, let alone an extended reality. So they’re mixing together a lot of things and you know, not everyone’s experience is valid from a 3D perspective. Not everyone’s opinion matters equally, and you, you seem to be able to find a grace in kind of balancing that.\n\n[00:43:04] Alex Tsakiris: But that is a challenge going forward. Particularly, and I know you’ve dealt with this too, when we factor in that, that very fact is being used to manage the system, right? Because I can then, I can know how to orchestrate disinformation and misinformation and create agents that can kind of perpetrate this stuff.\n\n[00:43:26] Alex Tsakiris: So it’s tricky, right? How, how have you handled that? It’s a good,\n\n[00:43:33] Mary Rodwell: I’ve looked into how do I help? The, you know, the diverse understanding that people have when they come to me, right from the ones that are just waking up to the fact they’re having these multi-dimensional experiences to the ones that have been of okay with it all their lives that have known all their lives.\n\n[00:43:50] Mary Rodwell: They’re having interactions with these beings, um, going off planet, um, aware of their, that traveling with these be. So the broad range from totally with it. I don’t understand humans because I find them, you know, pretty dark and pretty horrible, um, to the ones that are. Why are these beings doing this to me?\n\n[00:44:10] Mary Rodwell: You know, how dare they, they, you know, so all the only thing I can do, and I go back to my counseling mandate, you know, client-centered counseling, Carl Rogers and what have you, and it was always about working with the reality of the individual and helping them work it through their own understanding and experience of, of how they, they, , understand their, , life and whatever.\n\n[00:44:34] Mary Rodwell: So what I have found myself doing more and more is exactly that. That when somebody comes to me, I’m saying, okay, so what is it that’s gonna be helpful to you? With what you understand and want, how can I help you? And it may be I need to explore this experience or that experience, but the most important with what’s happening on this planet right now, we have a lot of very dark agendas on this Planet Rhino.\n\n[00:44:58] Mary Rodwell: Now, nobody, anyone who you know otherwise, if you don’t know this, it’s about time you woke up and selt the roses because it’s, it’s without doubt, a very dark, there’s some very dark agendas, there’s so much misinformation, disinformation, all the rest of it from both, you know, from all over the place. How do you work that out?\n\n[00:45:17] Mary Rodwell: How do you decide what to believe or not to believe? And I say, I say, okay, so how am I gonna help you do that? That you can discern and resonate to your truth. Now let’s face it, everyone’s got a different truth. And so I will give them tools to do that. And for some people it’s showing them how to trust.\n\n[00:45:40] Mary Rodwell: Inner wisdom to trust their , resonance to whatever information comes in. So I’ll say to them, how do you feel about that? How do you sense it? , what is your, , knowing, telling you? So I’m going right back to the heart of their re , gaga counter if you like, and saying, this is the only thing you’ve got guys.\n\n[00:46:03] Mary Rodwell: Cuz no matter who’s out there telling you, I know the truth, I know how it is or whatever, ultimately, there’s only one person that can decide what to believe and not to believe and trust in their own resonances yourself. You were born with that cuz I said it would be illogical as Spock says, to be born without the tools, you need to work your way through this, , this lifetime.\n\n[00:46:22] Mary Rodwell: So let’s go to how you understand your resonance to truth. And that is your guidance cuz nobody else is, is actually knowing more than you. Ultimately, there’s no one on the planet, no matter what. They tell you that they know more than you and they’re more advanced than you. That’s what you’ve been programmed to believe.\n\n[00:46:38] Mary Rodwell: That you are the useless one and everybody else knows more than you. Particularly if they’ve got pieces of paper that tell you that they know more than you. Rubbish, rubbish, rubbish, rubbish. The only one that’s , the guru, the only one who’s a student is all in you. And that’s what\n\n[00:46:54] Alex Tsakiris: I work. That’s fantastic and I’m really interested in one aspect of that that you talked about and it’s wonderful and I can see how it could play out.\n\n[00:47:04] Alex Tsakiris: But I want you to tell me if, if this has been your experience and that is giving people the tools to understand their experience. You know, I interviewed a guy, terrific guy, near death Experiencer. , he was in England and he was walking for the train, leaning in to kiss his wife and his jacket got caught in the door.\n\n[00:47:23] Alex Tsakiris: I shouldn’t laugh. He was dragged under the train and died, you know, died, died, went and saw Jesus, came back and had these incredible gifts. These were all things that you could talk about, which we’ve talked about in the past. He’s incredible. Grist becomes an artist, even though he is never interested in art composes music, even though he is never interested in music in that way.\n\n[00:47:43] Alex Tsakiris: But I pushed him on the Jesus thing and he was emphatic that it was Jesus that he encountered, and I said, You know, David, your experience with Christ Consciousness. I have no reason to doubt that. I can just tell you that I’ve interviewed a number of people who’ve had multiple near death experiences and over time they came to understand that there might be something beyond Jesus.\n\n[00:48:08] Alex Tsakiris: Yeah. And he paused for the longest time. He goes, I think there might be something beyond Jesus, and I wonder, you probably have a million stories of how the tools that you give people how it might change their narrative that they’re putting out there, of meeting some feline, being from a particular planet in the past life and all the rest of that.\n\n[00:48:32] Alex Tsakiris: And then it morphs into something kind of that more fits in with a lot of other things you’ve seen. Okay.\n\n[00:48:41] Mary Rodwell: So I have. Numerous stores, as you say, of people meeting crystalline beings, lion beings, feline beings, , mantis. Yeah, there’s a, there’s so many I can talk, talk, tell you about a 17 year old, , that has drawn at least 250 different types of beings that she interacts with.\n\n[00:49:01] Mary Rodwell: And the whole family are drawing the being, cause they’re all having them from the nine year old to the 12 year old to the whatever, or these beings. So people say to me, so how do you work with someone with their own experience? Because each one is unique to their own persona, you know, their own experience and whatever.\n\n[00:49:18] Mary Rodwell: I’ve gotta work within the reality of that individual that comes to me. So I need to find out what’s going on with them. And one of the things is, how do they operate multidimensionally? And that means I might ask some questions. Do you feel energy? Do you feel presence? , do you see orbs of light? Do you get downloads?\n\n[00:49:36] Mary Rodwell: You know, do you get information in your head you haven’t consciously learned? And they may or say, yeah, get all of that and what have you. So I’m saying, well, you’ve got an option now I can help you access more of what that’s about. Or you can go into, you know, hypnosis and we can go and revisit that experience and get, get information from that.\n\n[00:49:55] Mary Rodwell: Now, I didn’t intend to get into this cuz it tells you a little bit more about Mary. Um, I can help. So I will say to them, do you want to find out where your source of connection is? Who are you connected to spiritually, apart from your higher self or super conscious self, which is what we access in hypnosis.\n\n[00:50:16] Mary Rodwell: You know, I, I don’t just say super, uh, subconscious, I say super conscious. In other words, your highest knowing and, uh, of you know who you are. , but there are always sources around us that are giving us information from other realms. We all have it. Whether we deny it or not, they’re there because they are, they are there giving us guidance.\n\n[00:50:38] Mary Rodwell: We might be very relaxed and I mean, I know that Einstein and a few others said whenever they wanted information, they’d go into a relaxed state and they’d suddenly come in. Who are the, those sources of information? Right. Okay. Well I can take somebody into a space where they can start to access who that is, find out who it is or how they understand it.\n\n[00:51:00] Mary Rodwell: And so I will show them how to do that. So it’s a basically getting them to connect to that source in how, you know, they may, um, visualize that particular intelligence or whatever. Sometimes it really surprises them because it may not be human. Alright. And then, okay, so who are they? Why do they support you?\n\n[00:51:21] Mary Rodwell: So I get them having a dialogue. So they get used to being asking questions. What’s the response? Asking questions, what’s the response? Does that resonate to you? Does that make sense when you ask that question? Because what I’m doing when many intuitives come to me and they’re, you know, many of them will do, you know, be very, very accurate.\n\n[00:51:40] Mary Rodwell: But I’ll say to them, so who is your , not really sure. Well, I said, well, you’ve been talking to your best friend behind a wooden door, don’t you think you ought to find out who they are? So they go, that would be a good idea. I said, because you can ask them questions, then you can check out the information.\n\n[00:51:57] Mary Rodwell: You can make sure it resonates. Oh, that sounds like a good idea. Well, let me show you how to do it. So I will actually lead them through a process that I was given in my own awakening, if you like. That actually helps them bring in that awareness and understanding. So they are then being able to consciously communicate whatever that source is that gives them information.\n\n[00:52:20] Mary Rodwell: And they can check it out and I’ll say, make sure it resonates with you. Does it make sense? Ask them any question you like, what’s the response? So I get them communicating with a, whatever that source is, however they understand that source, however they visualize that source. And also, and so people say, oh, well you could bring in negative energies and what have you.\n\n[00:52:40] Mary Rodwell: I says, look, let me put it in very practical 3D terms. If someone comes to your door and wants, you know, and is having a chat to you, what is it in you that lets someone invite someone in and give them a cup of tea to ones you keep the other side of the door? What is it that G that gives you that glue?\n\n[00:53:00] Mary Rodwell: It’s no different in the spiritual realm, you know, by the quality of the information and how it supports you or doesn’t support you. Is it accurate? Is it loving? Is it guidance or is it telling you what to do? It’s the same with humans, you know, that’s what we do all the time. There’s no difference in the spiritual realm.\n\n[00:53:16] Mary Rodwell: It’s exactly the same. Come on guys. You don’t make it harder than it’s when it isn’t\n\n[00:53:21] Alex Tsakiris: hard. Well, except many of us struggle with that mightily.\n\n[00:53:27] Alex Tsakiris: Uh, because that’s going, that’s continuous, right? So, yes. What has this technique, this protocol that you are working on and are practicing and have experience with, cuz you’ve now hundreds of people have, have gone through this with you.\n\n[00:53:43] Alex Tsakiris: What is that telling you about the nature of. , that extended consciousness that you are connecting with and how it fits in with our, again, your term 3D reality, because there seems to be this element of, you know, let’s just say some of the pieces we see. Yeah. Like you said this and a lot of times seems like a hologram and it seems like other beings, other intelligences have the ability to pop in and out of this hologram with a technological, almost kind of, , precision where they can come and go and do, and that they even seem to be interfacing with us sometimes in a technological way in terms of whether it’s magnet electromagnetic things or this and that.\n\n[00:54:31] Alex Tsakiris: So do you have any, is that prompting any thoughts for you? To the question which is, you know, what is our relationship to that particular extended consciousness realm that is interfacing with your clients?\n\n[00:54:47] Mary Rodwell: If I understand your question, how does that all operate and how, in terms of how we access those other realms and information, , is that the kind of question that you’re asking here?\n\n[00:55:01] Alex Tsakiris: I’m, I’m trying to hone in on. The possibility, as we discussed earlier, that there might be multiple hierarchies and that we don’t often talk about that. And I, I, I don’t know if that’s a problem, but my gut tells me that that is a problem. And we hear this from all sorts of mystics that, you know, there’s this realm really close by and it’s negative, you know, and, but there’s not much going on there.\n\n[00:55:24] Alex Tsakiris: But it sure seems like there’s a lot going on there. And they can come in and they can do a lot of crazy stuff in this world that you can go woo, you know, but it’s not really the big game. And then there’s this other realm. of kind of like the angels, uh, spirit guides, but that’s also kind of in this closer realm.\n\n[00:55:42] Alex Tsakiris: And then there’s this other realm above that. And then there’s this other realm above that. And I don’t wanna speculate too far, but the, these are the kind of questions that I think we have to, you know, try and pin down. And I guess I’m trying to, uh, give you an opportunity to educate me in terms of what your speculation is about, in particular, the protocol that you’ve developed.\n\n[00:56:03] Alex Tsakiris: Is it accessing all those realms? Is it just ac uh, better able to access a particular vibration, if you wanna call it that? How is, how do you think that’s working, Mary?\n\n[00:56:14] Mary Rodwell: I keep things pretty simple. because I think when you get too complex, a lot of people don’t get it or can’t understand how they can work with that.\n\n[00:56:24] Mary Rodwell: So for me, I’m working within the reality of the individual that’s come to me in helping them move that step forward to understanding in however they choose. Now, some will talk about parallel universes, different timelines, accessing them, aspects of the soul. Walk-ins and being part of all of those kinds of things.\n\n[00:56:44] Mary Rodwell: So for me, it’s where is that person at? It’s like I do an assessment, a spiritual assessment of someone where they’re at in terms of where they’re stuck and what is it that’s gonna take them to that next level, which ultimately will take them to any other levels if they’re ready for it. Because I don’t know ultimately where that soul chooses to end up at the end of the day, in terms of their awareness.\n\n[00:57:04] Mary Rodwell: So what I’m doing is giving them tools to go as far as they’re ready to go at that moment in time. So I simplify everything. So for them it may be that, that they’re working with their super conscious hire self. So how do you access that to trust it and, and resonate with it and access the answers that you’re seeking?\n\n[00:57:22] Mary Rodwell: Because as multi-dimensional people, , we have in our d n A, we know we are able to access other realities, other, you know, other timelines, all of that through our dna. because that’s what the scientists are now telling us that we can do. So it’s, are we ready yet? Or are, , have we got the awareness or the, the ability to create the frequency to access that so the person’s in a particular awareness or frequency, radio signal.\n\n[00:57:49] Mary Rodwell: And what I’m doing is actually helping them to refine that signal to access the nearest help. Now it may be spirit guides, it may be the higher self, it may be. Um, what others would say is higher intelligence is ascended, masters, angels, whatever, whatever they’re comfortable with or whatever they are at that moment.\n\n[00:58:09] Mary Rodwell: Um, interpreting it as that doesn’t mean that’s the poor picture. It’s cuz let’s face it, a spirit guide can present any form they choose to show you. When I take them through building that uplay avoidantly, that’s the, that’s the form they want them to see and connect to. And usually it’s because the person has a connection to that particular form.\n\n[00:58:29] Mary Rodwell: So they’re saying that’s when we knew one another. and I will ask, get them to ask the question, how many lifetimes have we been together? And they, they’ll instantly say, 17 or 200 or whatever. Okay, so was any of those lifetimes together as you both being human? And they’ll, um, what was the relationship? So I’m giving them information about their source so that they can start to give it some tangibility to give it something that g enables ’em to have confidence in it so that they can access more information.\n\n[00:59:01] Mary Rodwell: So for me, I’m, I’m saying get to know this source of yours. What are the questions you wanna ask? What do you wanna know about this? Or how many is in your team? You know, many have what I call a non-human support team. How many is in there? What does your guide say? Oh, 57 or eight 13, whatever. That’s what they’re working with.\n\n[00:59:20] Mary Rodwell: That’s not my interpretation cuz I may pick up other stuff and I’m not gonna go into how I do that, but I do. Um, I’ll be picking up stuff that will actually verify often what they’re saying. Okay, so I’m letting out a little bit of information here cuz I pick up stuff. Have\n\n[00:59:36] Alex Tsakiris: you keep that stuff? Uh, just one more question about your process.\n\n[00:59:39] Alex Tsakiris: I, I, I love it. I mean, it sounds like you’re, you know, giving people the keys, giving a couple rules of the road, pointing ’em to the rent a car and say, there you not rent a car, it’s their car. Say, that’s it. There’s your car. Go have a, have a good journey. That’s right. Um, just one question on your, how has your journey and your skillset, you know, changed over the years?\n\n[01:00:04] Alex Tsakiris: You seem to be kind of laying hints that you started out this very kind of straight down the road counselor, uh, nurse, uh, weren’t you a midwife for Uh, uh\n\n[01:00:17] Alex Tsakiris: and, and then, you know, you’ve worked into these other counseling things, but now you’re doing what some people would call psychic medium kind of\n\n[01:00:30] Mary Rodwell: , , I grew up Catholic, believed all of it for a long time till I started a question usual kind of thing. , they call him recovering Catholics now, don’t they? Or something like that. , whatever. But during that, the reason I started questioning cuz I started reading eclectically books on reincarnation, a whole range of paranormal type of experiences, psychic arch archeology.\n\n[01:00:51] Mary Rodwell: And I always believed it was a unique thing to certain people that they could access, other realms, that they could connect. And I, that my belief was that it was unique to certain individuals. I now believe that’s rubbish, that I believe every single one of us can do it, because I found out that myself fascinated by all of the eclectic reading, but still believing that it wasn’t something Mary could do.\n\n[01:01:17] Mary Rodwell: , I was proved wrong because during my, uh, counseling life, I was invited to join a group. Uh, a couple of them were clinical psychologists, so I was, if I was going crazy, I was going round the bend with, in good company, still believing that this was going to be them showing me how amazing. I mean, there was a nursing system, was a whole group.\n\n[01:01:39] Mary Rodwell: What we did in three years blew my mind because every question and Skeptiko way I was looking at it, certain things happened with me that I, I really couldn’t quantify in 3D terms. I had certain things happen and I, I won’t go into them now, but one of them very profound within the third week of going there, that proved to me that I was experiencing something very real, very tangible, and it blew my.\n\n[01:02:11] Mary Rodwell: And from then, more and more I acce I learned how to access certain information that, you know, once I knew how it worked, because I, when I, somebody comes to me, I say it’s very, very simple. When you wanna know the difference between 3D and multi-dimensional in 3d, you think before you speak in right brain, you speak before you think it’s a complete reverse.\n\n[01:02:35] Mary Rodwell: And it’s hard, but it’s easy. It’s hard to shut down left brain, but it’s easy because you don’t have to think because the information will come in once you trust it. That knowing, that sensing, that feeling, and then information may come, you may even see stuff. I mean, I can tell you that I can see stuff in a screen here that was shown to me.\n\n[01:02:54] Mary Rodwell: Just like a video screen. If I wanna know something, I’ll say show me and they’ll show me and I can go into. , I can literally go into it. Um, I, and I’ll give you an example of how it ex, once you open to it, you open the door. As long as you validate it and accept what you’re being shown, then it just expands because you’re giving it permission to give you more information.\n\n[01:03:20] Mary Rodwell: And I can, I can see something, you know, somebody will say, I’m in medieval times and it’s a, and it’s, um, we’re in a town of this. I can start to see that and smell it. I can, and I’ll go, oh, what? Stop . Now don’t, and everyone can do this. So everyone, we are programmed outta this from birth virtually. And even the religions won’t let you open up.\n\n[01:03:49] Mary Rodwell: Because once you start accessing your own truth, you may not believe the dogma that they’re trying to shove down your face. Right.\n\n[01:03:58] Alex Tsakiris: Well, That, that, yeah. Right. And, uh, so here I want you to shine some of your awesome light on this because I really wrestle with this, and that is, when you talk about the darker agendas, I’m just not sure.\n\n[01:04:13] Alex Tsakiris: One, I, I’m totally convinced that we cannot understand those without understanding aspects of the spiritual realm. If we try, like they’re trying to force us to kind of understand it from this materialistic science or from a greed perspective and money or power. And this, no, if you don’t understand the, the influence, the potential spiritual influence that some people are, you know, just watch the Super Bowl halftime and they’re all about satanic stuff.\n\n[01:04:40] Alex Tsakiris: Yeah. And all the rest. But I, I don’t wanna digress. One of the guys I really like and respect, uh, is, uh, Dr. Dean Raden, who is, uh, of course leading parapsychology researcher. Maybe the leading parapsychology researcher in the world, but Mary, he’s not doing that so much anymore. He’s now a part of a biotech startup that’s using the Covid virus vaccine technology to jab people to change their D n A, so they become more psychic and more of a hive mind.\n\n[01:05:15] Alex Tsakiris: This to me is when you were talking about dark agenda. This is dark agenda transhumanism kind of stuff that we just cannot process in an ordinary way. Now, I interviewed Dean and I said, what are you doing? You know, this kind of thing. There are a lot of people who’ve worked themselves into this headspace in a way that they think is consistent with their values, their beliefs.\n\n[01:05:47] Alex Tsakiris: And yet so much of the time, I think I’ll just say me, I look at it, I go, that is Satanic. That is, uh, somehow tapping into this need to control, to dominate, you know, what you guys went through there in, in Australia, right? We’re gonna shut the whole thing down. It’s that energy. You can feel it, you know?\n\n[01:06:06] Alex Tsakiris: So when Dean Raden says, oh yeah, we’re gonna jab you in the arm with this new vaccine technology, are, is he collaborating with et. , is he competing with ET is, does et have anything to say about this? Because the, the connection that you’re making is, this is the game that you say ET has been playing all along, right?\n\n[01:06:31] Alex Tsakiris: So now we have to connect the dots. We say et is the game in the game of genetic manipulation, which is nuts and bolts. You know, you wanna say nuts and bolts? That’s nuts and bolts. And now here, Dean Raden saying, I got the latest, greatest technology. I can change D n a, I can play the genetic engineering game.\n\n[01:06:51] Alex Tsakiris: So we have this connection now between 18 and evil. Is this evil? Is it, where is ET and what’s it’s role in this again, competitor, collaborator.\n\n[01:07:04] Mary Rodwell: It’s a good question. , the only difference with them is it’s more of a mechanical way that they’re doing the altering of the d n A through the through. What they’re supposedly calling vaccines, which is not, of course what it is.\n\n[01:07:17] Mary Rodwell: Um, it’s actually, um, I believe probably turning them into being controlled robots. Ultimately. That’s what I’m, I sense is, is you know, behind all of this control and god knows what else is, is going on with that. So we’ve got different agendas with different intelligences, that’s for sure. And some of them work together and some of them don’t.\n\n[01:07:39] Mary Rodwell: I do sense, and I can only say that cause I’ve got no way of proving it. Is there a certain species that are certainly influencing those within the hierarchy or, or what I call the. Cabal, deep state shadow government, let’s you know the whole gamut of it all. I, I, and I’m gonna also say this, whether people like it or not, the Vatican’s part of it as well, I reckon, um, that, you know, uh, I won’t go any further than that, but I black part of the, the black part of\n\n[01:08:13] Mary Rodwell: V I think is part of it as well. And I think they are being influenced by their own sources of connection to the other realms to do this, , maybe possessed by some. I wouldn’t put that past. I have seen those that prefer to be possessed by an intelligence because it makes feel powerful, it makes ’em feel strong, and they don’t wanna let that go.\n\n[01:08:37] Mary Rodwell: And I think that they’re manipulated often. It doesn’t take responsibility away from them because I think, you know, um, There’s a spiritual con consequence to every action and decision that we make. So even, uh, we are allowing a, a possession, we’re allowed on some level, often as not, , on some unconscious level even that to allow us to control, because ultimately that’s what we wanna do, that our motivation is greed, power control or whatever.\n\n[01:09:06] Mary Rodwell: And there’s no doubt in my mind there’s a percentage of humanity that are in that bracket broadly, and they’ve had an agenda for many centuries to continue this power and control, which I think has begun on for centuries. I mean, I, I know this is the latest is where it’s, it’s come to, but this has been happening right from the very beginning is, you know, because what drives you to.\n\n[01:09:29] Mary Rodwell: is not generally a loving, compassionate, open, non-judgmental kind of person. Most people that go into power is because they are driven by, and, and, , that’s what motivates and the power, the control, the money, whatever it is, greed, all those kinds of things. That’s why we, you know, we end up with politicians, , corporations and banks and what have you.\n\n[01:09:53] Mary Rodwell: That’s the motivation is control and power and more control and power and more control. That’s not loving, that’s not spiritual, that is not in any way coming from compassion and love of the individual each other, because you don’t want that. If you are coming in with the motivations of love, love, because you don’t want to control people.\n\n[01:10:13] Mary Rodwell: You don’t judge them, you don’t, all of those kinds of things are of a higher frequency and a higher vibration, so, But\n\n[01:10:21] Alex Tsakiris: it’s tricky, right? . I read the quote from the, from the woman who was just the worst or worst, you know, she’s in a Satanic family, they’re killing little kids and stuff like that.\n\n[01:10:29] Alex Tsakiris: Yeah. And then her point though, which is, I don’t know what to do with this. You know, I don’t know what to do with it, but that I, my, oh, I understood my path was to light the heart chakra in those people. I don’t associate with them anymore. They’re my biological parents. I don’t condone what they do. I don’t want to be around them.\n\n[01:10:49] Alex Tsakiris: But I maybe understand that I am not the victim, but more playing a role in this larger thing. I don’t know what to do with that. And as we talked about, I think that you and I are, are people that are not drawn to that just kind of, well, you know, whatever it would be will be kind of thing. But it does come up again and again.\n\n[01:11:14] Mary Rodwell: the way that I work is that, first of all, I don’t know anything other than I’m trying to help someone navigate how they choose to understand their life and experience, because that’s ultimately their responsibility. And whether I agree with it or not, because I’m not, when someone comes to me, I don’t tell them I think this is this, this and this.\n\n[01:11:37] Mary Rodwell: Nah. I’m saying, tell me about how you understand this and how you know, where do you wanna go with it? So I’m actually helping them with their agenda in how they want to understand their life experience and how they wish to interpret it. I may help them to expand on it and say, have you thought of this or this?\n\n[01:11:55] Mary Rodwell: Does that make any sense to you? Does that re resonate with you? Or whatever. So it’s not about. Imposing my particular understanding values order. I can say, this is what I think this is, in my opinion, this is whatever you can either resonate or not resonate to it. And often I, you know, I’m surprised when people say, oh, well it makes sense to me too.\n\n[01:12:14] Mary Rodwell: I think, oh, well that’s nice, , that helps. Um, but I’m not, that is not my ultimate agenda. My ultimate agenda is saying, this is your, going back to client-centered counseling, Raja, uh, Rogerian mandate was, I believe that’s inspired. It’s about helping that individual understanding how they best can live their life and for that woman, that way of understanding it.\n\n[01:12:38] Mary Rodwell: Whether you wanna accept it or not, is how she’s getting through her particular life challenge, which is extraordinary dark. And I, I can’t even imagine. I can’t even imagine how you would get through something like that. So for her, that makes sense. , that’s what she is, is it’s enabling her to live her life in, in the way that she’s chosen.\n\n[01:13:01] Mary Rodwell: That’s all that matters. My judgment of it doesn’t make the slightest bit of difference either way. And may\n\n[01:13:07] Alex Tsakiris: be true. And it may be true on some level of consciousness. That’s right. That we can’t Yeah. Connect\n\n[01:13:12] Mary Rodwell: with. Right. And, and, and, and, and for some people they’ll absolutely resonate with that. I mean, I hear so many extraordinary stories.\n\n[01:13:20] Mary Rodwell: Cause I get asked, you know, tell me an extraordinary story, one that stands out. I could give you three dozen that stand, five dozen that stand out. They’re all extraordinary. Not only with adults, but the things the children tell me and what have you. And I’m thinking, but you know, this is unbelievable. But what it’s taught me is there are so many ways of interpreting this.\n\n[01:13:42] Mary Rodwell: Reality we call 3d, depending on our, you know, from the very beginning, how we are programmed, how we choose to understand it, how we interpret it. And I always remember a lecture many, many, many years ago where someone was talking about reality and how at any one moment we get between eight, I think someone like 8,000 bits of information at one time.\n\n[01:14:03] Mary Rodwell: And of that 8,000 bits, only eight bits do we actually take on. And even that is altered into four bits of information. So we are seeing everything through the eye of a needle and thinking we know what this is. So of course we are all experiencing it in different ways and understanding it and interpreting, depending on how we choose.\n\n[01:14:27] Mary Rodwell: To put that into our life, our life experience and whatever. So of course we’re all gonna have different understanding. I have got many, many that connect to me, many of these star origins, and they’ll talk about the planet they’ve come from. You know, when you get, uh, a little eight year old explaining to you that she’s a hybrid and she’s, um, she comes from a water planet.\n\n[01:14:47] Mary Rodwell: She’s even drawn the being that she was and says, I’m now part human, part water being, and this is an eight year old interpreting her understanding and what have you. Now is it for me to say, oh, well that’s a lot. It’s just her imagination or whatever. No, this is, this is resonating with her to a point where everything she’s interpreting is from that understanding.\n\n[01:15:09] Mary Rodwell: Right. You know, you can believe it or not believe it, that’s entirely up to you. But for me, I find that, that it’s not for me to judge once somebody’s experience just help them if they ask for it to integrate whatever has the mo is the most use to them, the most helpful to them in their, their journey and how they want to understand it.\n\n[01:15:29] Mary Rodwell: So I’m not a judge, jury or anything cuz I can’t judge what I don’t know. I don’t know what I don’t know. I\n\n[01:15:36] Alex Tsakiris: That’s extraordinary. And, and you’re doing amazing work. I, I always have to pick on things. I think you’re, you’re judging all over the place. You know, you’re just, what you are bringing, you are bringing.\n\n[01:15:48] Alex Tsakiris: Everything that is your life experience, your intuitive experience and your hard earned experience as a counselor is allowing you to discern. And discernment is judgment and guiding people is judging people, but it’s just not in the way that we normally think of it. God thank us that you are there and that you are judging the way you are because you are letting in the information that very other few people are not only willing to but capable of, which is always what comes through in talking to you is how you’ve refined your skills and your ability to do this.\n\n[01:16:30] Alex Tsakiris: Is is really, really, uh, I, I, I think it’s extraordinary and I don’t even have a direct experience with it cuz I haven’t worked you with you in that role. But I understand you’re as busy as ever, Mary. I can only imagine that people are calling you or contacting you all over from all over the world asking to help them tell folks who are hearing this and think they can benefit from this, how you might be able to help them\n\n[01:16:55] Mary Rodwell: well, I what I offer and still do, they might have to wait several weeks or whatever for me to find slots where I can be available to them apart from telephone and zoom and what have you.\n\n[01:17:09] Mary Rodwell: I’m offering counseling with hypnosis if that that proves appropriate. I also help people with their multi-dimensional awareness. So in other words, if they’re opening up multidimensionally and many of those that are having et kinds of contact or other forms of contact via an experience, I can help them work to understand that more in a multidimensional way.\n\n[01:17:36] Mary Rodwell: I can give them tools to do that. So those are two options that they may have. What I start with, um, Alex is I send out a questionnaire. It’s not your standard U F O questionnaire, it’s one looking at the PA patterns of experience. Like do you feel energy, you know, do you get downloads? Do you feel you’re not from here?\n\n[01:17:56] Mary Rodwell: All these kinds of knowings sensing feelings are all part of that. So anyone who’s in the nuts and bolts will look at that and think, oh, what a load of whatever. Which is fine cuz I expect that, um, whatever. Um, but what it’s doing is giving me a picture of what’s actually happening with that person on a deeper level.\n\n[01:18:16] Mary Rodwell: And all the questions. I’ve got one for children as well because you know, I get lots of parents now with children that are not coping with 3D reality in the sense of the programming because they’re coming in with lots of awareness and whatever. So I’ve got one for them. Cuz the parents don’t always know what questions to ask the kids.\n\n[01:18:34] Mary Rodwell: They don’t even know what the kids are. The kids might not think to articulate it. They may think everybody sees energy, for example. So it’s helping the parents understand their children and then we can work out what’s gonna be helpful. You are quite right when I say, excuse me, I’ve got a bit of a dry throat.\n\n[01:18:58] Mary Rodwell: When I say non-judgment, what I’m me meaning is that I’m assessing what I’m. Is a better word. It doesn’t, it, it means I, you know, assert, honors, all realities. What I’m saying is, whatever your reality is, I honor that’s how you understand your reality and I will help you work with that and find a way to connect dots if that’s what you need to do.\n\n[01:19:23] Mary Rodwell: So when people contact me, it may be a telephone call, maybe Zoom, it may be talking to them, it may be talking to the children, um, whatever. I get a lot of experiences that can’t tell their partner or their partner doesn’t wanna hear it, or it’s terrified and so shuts it all down so they feel completely isolated and alone.\n\n[01:19:43] Mary Rodwell: There are people around the globe that I haven’t extraordinary experiences, but nobody to talk to. So AER has a support network where I’ve got someone who collects those individuals that need to talk to others that are just as aware, so they’re not alone. So I’m creating, if you like, resources as much as I can.\n\n[01:20:03] Mary Rodwell: given what, what resources I have to offer. And that’s it really.\n\n[01:20:09] Alex Tsakiris: You are such a terrific presenter. So clear, so articulate. , do you have any major presentations coming up or any books, anything like that you can tell\n\n[01:20:19] Mary Rodwell: us about? Well, I’m doing the paradigm shift here in the Sunshine Coast in June. I’m flying over to the UK to present, , at, uh, the Awakening Expo.\n\n[01:20:29] Mary Rodwell: , I’m just trying to think of the other name. It’s, it’s got as well, but it’s in Manchester, I think, the 25th to the 27th. , and it’s also, , the hidden knowledge tour as well. So it’s a big one. I, I may very well be doing one in Prague again, which I did last year, which was actually a recorded presentation cause I didn’t go over to Prague at the time.\n\n[01:20:50] Mary Rodwell: But they were very happy and wanted me to do another one. , I’m doing something in, in Sydney in a couple of months time as well. So I’m still putting out the information, but I’m expanding it Alex to, again, the nuts and bolts are gonna hate me for this. I’m really sorry guys, but I’m actually showing past life links to many of these intelligences.\n\n[01:21:10] Mary Rodwell: This is the experiences, again, I’m going into information coming from hypnosis. And regression where people have gone into, , understanding the links to this life from another life. , am I gonna write another book? Not at the moment because I haven’t got the time, but I’ve also got to know what it is that’s gonna be different to everything else that’s out there that is gonna be useful and helpful.\n\n[01:21:34] Mary Rodwell: I believe we are getting close to something very, very dramatic in terms of our planet and the, I’m waiting for more understanding of what that may. Some are calling in a kind of event that’s going to shift consciousness. I don’t know if that’s the case or not, but I am interested to see why so many of these new individuals, these children and young adults, are having such awareness, such understanding.\n\n[01:22:01] Mary Rodwell: I don’t believe they’ve come in with all that awareness. The downloads, the information, scientific information, don’t believe that’s for a waste of time. I believe there’s a reason behind it, there’s an agenda behind it, and I think it is going to change the consciousness of this planet at some point.\n\n[01:22:17] Alex Tsakiris: resistant to this special time thing because everyone throughout history has said there’s a special time. I know , what kind of sets me in a different direction is like when I say, You know, Dean Raden and you say, okay, now, and it’s not just Dean Raden, I’m just our, our ability to do the hybridization and we know it’s going to happen.\n\n[01:22:40] Alex Tsakiris: I mean, that’s one thing that Dean said that you gotta agree with is, Hey, you can like this or not like this, this is the future is we are gonna be manipulating this d n a, uh, at will. And that’s gonna come because we can’t stop it. We can’t, once it’s out of the, the ai, uh, explosion kind of thing I think is, is significant.\n\n[01:23:00] Alex Tsakiris: And then it’s hard not to see the, uh, rollout as clumsy as it is, the disclosure rollout. Why happening now at this point in time, unprecedented. You just start putting those together and you go, okay, am I, am I making that up? Or is there something going on there? And you go, no, there’s never been another time when all those things are lining up.\n\n[01:23:21] Alex Tsakiris: Which is kind of weird too, because those are the dark agenda things. , and then you’re talking about the more. I don’t wanna say love and light, but the positive, uh, consciousness ascending kind of, uh, possibility. So any last thoughts on how those two will, will coexist or feed off of each other?\n\n[01:23:45] Mary Rodwell: I, I absolutely get Alex and I’m, you know, there’s a very healthy left brain part of me that says, you know, things aren’t looking too good down here.\n\n[01:23:54] Mary Rodwell: You know, in multiple ways. I, you know, I’m following all of this as well. The thing that gives me hope is hearing from so many people now of their conscious interactions with many of these different species that appear to be extremely deme, um, benevolent. And when people say, well, they’re not gonna come down and fix it, maybe they’re coming to us in a rather unique and subtle way, and that’s in, they’re incarnating into human form.\n\n[01:24:25] Mary Rodwell: So they can bring in what they need to bring in to turn this planet around. And that’s including things like free energy, , new technologies, healing technologies. This is what I’m getting. I, I mean, I had someone just recently that was, uh, did a session with me and he was, he was at a, a point where he didn’t know where he was going, a healer, et cetera, and he was given the information of a new technology literally as we did the session.\n\n[01:24:52] Mary Rodwell: He was gi Given that, is this all a waste of time? Is it all these people imagining that in some way they’re there to fix the planet and be the heroes and what have you? Or is it actually something where this is all being put into place so we can counter. all the darkness on this planet. I don’t know, but I’ll tell you what, we’re here for the adventure and one way or another we are gonna find out, I assume.\n\n[01:25:16] Mary Rodwell: And I see it like that, the ad I’ve come down for the adventure, you know, cuz I’m nosy and I wanna see how it plays out. But I will tell you this Alex, and this is a personal thing, that when they said to me perhaps before I came here, Mary, you’re gonna go down there and you’re gonna work your things off.\n\n[01:25:33] Mary Rodwell: You know, um, you’re gonna really work hard, but sorry, it’s not gonna work out. Do you know what I’d be telling them? Go and find some other idiot to go down there. Cuz to be quite honest, it ain’t gonna be me. So, I assume it’s gonna work\n\n[01:25:48] Alex Tsakiris: out. Right on. I love that. I love that. So if, if you’re in it, you’re in it to win it in the, in the best impossible way.\n\n[01:25:56] Alex Tsakiris: So that is awesome. It is so awesome to talk to you and as I say, you bring this light and energy to this work that can easily look very dark and just your, you shining your light on it always makes it a little bit better. So I really appreciate you coming on and talking to me.\n\n[01:26:16] Mary Rodwell: It’s a pleasure, Alex, always to speak with you.\n\n[01:26:21] Alex Tsakiris: Thanks again to Mary Rodwell for joining me today on Skeptiko. There’s really only one question to tee up from this interview.\n\n[01:26:27] Alex Tsakiris: And that is do you buy it? How resistant are you to this? And why are you resistant to this? , that’s the part that really gets me , is continually, I come back to this point of there should be a reset when the United States government comes out and says, Hey guys, we’ve been lying our ass off.\n\n[01:26:48] Alex Tsakiris: All this stuff is real. We should now be able to shift focus to something like what Mary Rodwell is saying in this interview. And say, well, certainly the burden of proof has now shifted. Where before I could dismiss this stuff out of hand. I can no longer do that because they’ve admitted that this stuff is real.\n\n[01:27:11] Alex Tsakiris: But very few people are willing to make that transition and you’ll hear more about that. That’s one of my kind of pet peeve issues right now. So that’s gonna do it for this episode. Let me hear from you. Love to hear from listeners, love to hear from people who are thinking deeply about the show.\n\n[01:27:27] Alex Tsakiris: I’m not really interested whether you like it or the style, or I do this or I do that. What I’m interested in is what you are thinking. If you’re really thinking deeply about this stuff, I’d love to hear from you. Until next time, take care. Bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Mary Rodwell, Extended Consciousness Hierarchy |587| - Skeptiko - Science at the Tipping Point", "description": "Mary Rodwell… hypnosis… healing… alien contact experience… UFO/UAP expereience… psychic abilities… past life regression. Click here for Mary Rodwell’s Website Click here for forum Discussion skeptiko-587-Mary-Rodwell [00:00:00] Alex Tsakiris: Um, this episode of Skeptiko, , a show about the aliens that may be living among us [00:00:09] Clip: This place is crawling with them. What’s […]", "url": "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2023-03-15T03:10:45+00:00", "article:modified_time": "2023-03-15T03:49:51+00:00", "image": "https://skeptiko.com/wp-content/uploads/2023/03/skeptiko-587-mary-rodwell-2.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Mary Rodwell, Extended Consciousness Hierarchy |587|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/0A1CTNButQ8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/0A1CTNButQ8?feature=oembed"}], "links": ["https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-587-Mary-Rodwell.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-587-Mary-Rodwell.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-587-Mary-Rodwell.mp3", "https://www.skeptiko-forum.com/threads/mary-rodwell-extended-consciousness-hierarchy-587.4869/", "https://www.facebook.com/events/d41d8cd9/mary-rodwell-the-power-of-awakening-transformation-through-extraterrestrial-cont/835960583966683/?_rdr", "https://www.skeptiko-forum.com/threads/mary-rodwell-extended-consciousness-hierarchy-587.4869/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/andy-paquette-precognitive-dreams-583/", "https://skeptiko.com/andy-paquette-precognitive-dreams-583/"], "authors": ["Alex Tsakiris"], "publish_date": "2023-03-15T03:10:45+00:00"}