{"result_id": "273040", "URL": "https://skeptiko.com/massimo-pigliucci-on-how-to-tell-science-from-bunk/", "timestamp": "2023-04-25 17:09:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/massimo-pigliucci-on-how-to-tell-science-from-bunk/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Massimo Pigliucci on How to Tell Science From Bunk | Skeptical Science", "cleaned_text": "107. Massimo Pigliucci on How to Tell Science From Bunk\n\nCity University of New York Professor skeptical of near-death experience, likens NDE researchers to astrologers.\n\nThere’s pseudoscience, bunk, scientific nonsense, and then there’s real science… at least according to Dr. Massimo Pigliucci author of, Nonsense on Stilts: How to Tell Science From Bunk.\n\nJoin Skeptiko host Alex Tsakiris for an interview with Professor Massimo Pigliucci, a philosopher at the City University of New York. During the hour-long interview Dr. Pigliucci rejects claims of near-death experience science. When asked to explain why so many NDE researchers have concluded otherwise Dr. Pigliucci stated, ” that’s like saying the vast majority of astrologers are in agreement with the fact that astrology works.”\n\nPigliucci also offers his opinion on how non-scientists should choose sides on controversial science issues like climate change, “I am about to go to the Amazing Meeting in Las Vegas, which is organized by the James Randi Foundation, and I fully expect to upset several people there because my presentation will be about how skeptics are not scientists and therefore, they shouldn’t really pass judgment on issues for which the scientific community has reached a consensus. For instance, let me give you an example. Several skeptics, including James Randi, are skeptical of the notion of climate change and global warming. Well, I’m sorry, but that’s not their place. They’re not climate scientists; they know nothing about climate science. And frankly, they don’t have the expertise to pass judgment.”\n\nAlex Tsakiris: Today we welcome someone who—let me get this straight—has three PhDs, is that right?\n\nAlex Tsakiris: [Laughs] So Dr. Massimo Pigliucci is a Professor of Philosophy at the City University of New York. He’s a well-known thinker and writer in the skeptical community, and he’s also the author of several books, including his latest that we’re going to talk about today entitled, Nonsense on Stilts: How to Tell Science From Bunk. Dr. Pigliucci, welcome to Skeptiko.\n\nDr. Massimo Pigliucci: It’s a pleasure to be here.\n\nAlex Tsakiris: Well, thanks so much for joining me. You know, I got my hands on your book, and it was really interesting. I experienced the full range of reactions reading it. At times I found myself in total agreement with you. Certainly what this show’s been all about is finding the data and trying to find the scientific data and follow it wherever it leads, even if it’s unconventional in its direction. But I also found myself, I guess, sometimes at odds with both your interpretation of the science methods and what science is revealing.\n\nSo while I was reading your book, Nonsense on Stilts, I kept coming back to a quote, a comment from a recent guest of ours, Dr. Peter Bancel who’s an experimental physicist in France and is a collaborator on the Global Consciousness Project. So what I’d like to do to kick things off, if this is okay, is I’d like to play you this clip from Dr. Bancel, which I think will really frame up this discussion, and then get your reaction, if that’s okay.\n\n“The Skeptiko approach is interesting, but it’s—to my mind it’s not science. Skeptics are basically concerned that somebody is wrong in their thinking and that thinking should be corrected. And so skeptics are worried about sort of convincing people that they’re wrong, or something like that. So it has to do with a sort of a social question. I mean, science is something else. Science is—to my mind it doesn’t really even take a skeptical stance. It’s just trying to ask the best questions that you can and then devise the best experiments to address those questions, simply because you’re curious about how things are going on in the world.”\n\nAlex Tsakiris: Okay. So any thoughts on that?\n\nDr. Massimo Pigliucci: Yes, I think he’s right on the first point. He’s not right on the second point. So he says that skepticism is not science. That’s correct. In fact, I am about to go in a month or so to the Amazing Meeting in Las Vegas, which is organized by the James Randi Foundation, and I fully expect to upset several people there because my presentation will be about how skeptics are not scientists and therefore, they shouldn’t really pass judgment on issues for which the scientific community has reached a consensus.\n\nFor instance, let me give you an example. Several skeptics, including surprisingly James Randi himself, as well as most famously Penn and Teller, are skeptical of the notion of climate change and global warming. Well, I’m sorry but that’s not their place. They’re not climate scientists; they know nothing about climate science. And frankly, they don’t have the expertise to pass judgment.\n\nThat doesn’t mean, of course, that science is always right or the experts are always right by far. In fact, in my book I base an entire chapter about the long history of blunders in science. So I’m certainly not suggesting that science is infallible or anything like that.\n\nBut I am saying that unless you actually have that technical expertise in matters of science, your job should not be to sort of be skeptical of notions such as climate change or the fact that AIDS is caused by HIV or the fact that there’s no connection between autism and vaccines, and so on and so forth. So I do agree with your previous guest that skepticism is not science.\n\nSkepticism is a movement that deals with public understanding of science. I mean, the point of skeptics is to increase further public understanding of science by explaining to the general public the difference between science and bunk. It is not to criticize science itself because science itself already has a very well established set of procedures for how to criticize its own ideas. It’s called the peer review process. So on that one I agree.\n\nAlex Tsakiris: But hold on—I’m sorry, go ahead and address the second point.\n\nDr. Massimo Pigliucci: Yeah, let me make quickly the second point and then we can have a discussion about it. So the second point that your guest made was that science doesn’t even take a skeptical stance. That I don’t think is correct. In fact, the history of science shows that more often than not, the scientists tend to be conservative in their acceptance of new theories and new notions. That is, the typical response of a scientist to a new theory is, ‘I don’t think so,’ or ‘I don’t believe it,’ or ‘Show me the data,’ or ‘Let me see why you think that that is the case,’ which of course is a quintessential skeptical stance. And frankly, I think that’s for good reasons.\n\nYou know, science is a well-established set of procedures and it has produced a well-established body of knowledge, so any new theory, any new notion, especially if it is contrary to what science has accepted up to that point, ought to be received and is, in fact received by scientists with skepticism. That doesn’t mean that scientists don’t change their mind. It doesn’t mean the new theories are not eventually accepted if in fact they are good theories; they are sound theories.\n\nBut the initial reaction is always one of—when you write a scientific paper, which I’ve done several times in my career as a scientist before becoming a philosopher–when you write a scientific paper, the first thing that the editor does, or the journal where you submit the paper does, is to send it to two, three, or four people to criticize it. The first reaction is one of skepticism. People want to make sure that what you write is sound, that it makes sense that your conclusions are congruent with the data that you have and so on and so forth.\n\nSo I disagree that the stance of science is not one of skepticism. Of course it is. But it is of skepticism in the positive sense; it’s not skepticism in the sense of ‘I don’t believe it not matter what,’ it’s skepticism in the sense of ‘Okay, let’s see what you claim is and if the evidence that you put forth is proportional to the claim.’\n\nAlex Tsakiris: Right. And without degrading into a total discussion about semantics, what I’ve found totally delightful about Dr. Bancel’s comment is I think it reframes what you’re saying in a more positive light in that yes, science is a method, it’s not a position. I think he puts that out first and foremost and says, let’s always remember it’s about the method and therefore, being skeptical, this agitation kind of stance that we think of isn’t necessary, I think is what he’s saying. What he’s saying is just ask good scientific questions; ask them in a way that is testable inside of an experimental framework, and voila, you have good science.\n\nI agree with that and I’d take it one step further and maybe ask you, don’t you see that perhaps there’s a fundamental problem when we start throwing around terms like ‘bunk’ and ‘pseudo-science?’ Let me refine that a little bit, if I will, and give you an example. A few years ago when the Korean stem cell research or Hwang Wu Suk—I had to look up his name—he came out and he had fabricated his data, right?\n\nAlex Tsakiris: So he created all this data to get the results he wanted and he posted it. Now that’s bunk. Or an example I’ve used on this show before is Sigmund Freud, a pillar in our scientific community, but when you look at what he did it was bunk. He created these cases that didn’t really exist and then published them like real data. Now that’s bunk.\n\nBut when we venture into some of these other areas where there are different opinions, where people are struggling to kind of figure out the science, don’t we have to be careful when we throw around terms like ‘pseudo-science’ and ‘bunk?’ I mean, I run into that all the time with parapsychology and other controversial science, where people are throwing out these terms and they just don’t know what they’re talking about. They’re not grounded in the research. They’re just grounded in a position. Here’s my position, is that mind equals brain, so anything that contradicts that, I don’t even have to really look at the science behind it. I know it’s false; it’s bunk. It’s pseudo-science.\n\nDr. Massimo Pigliucci: Right. So you make some interesting points but let me make a few comments. First of all, the case of the Korean research on stem cells, it’s actually not even bunk, it’s just fraud, right? I mean, had the results been real, meaning they would have been, in fact, science not bunk. They would have been perfectly good science.\n\nAlex Tsakiris: But he did have some good science, right? I mean, he’s a good researcher. He just stretched so…\n\nDr. Massimo Pigliucci: No, he just made up stuff so that’s fraud, and there are very good procedures within the scientific community to punish people, scientists who engage in fraudulent production of data. The papers are publicly retracted by the journals, there is an international system of censure, and so on and so forth. So I wouldn’t call that example bunk because had it been genuine data, that would have been perfectly fine science that would have been simply making up a perfectly normal contribution to the way we understand that the biology of stem cells. What happened instead is that those researchers just made up stuff, in which case—that happens from time to time—so I would consider that fraud.\n\nNow let’s go to Freud. Freud is not exactly pseudo-science, either. This was a classic case that was treated by Karl Popper, who was the philosopher of science who originally came up with the idea of what I call the in the book the demarcation problem. The demarcation problem is how do you tell science from non-science?\n\nWhat Popper did was to take some examples of what he considered absolutely solid science, and the best one that he could come up with was Einstein’s theory of relativity, which had been spectacularly confirmed very recently when Popper was writing, and to compare that to examples of clear non-science. One of these examples was, in fact, Freudian psychoanalysis. But what he said about Freud was that it’s not a question of whether Freud was right or wrong; it’s a question of how do we know whether he was right or wrong?\n\nPopper’s point is that we can’t know because pretty much every human behavior is explainable one way or another by psychoanalytic theory. Popper’s point is if a theory is that flexible, that no matter what the data are it can explain them, then there is no way in principle, even, to falsify the theory, to show that the theory’s wrong, if it is in fact wrong. And a theory that cannot be falsified is not science. If there is no way to tell whether a theory is right or wrong because the theory explains everything that gets thrown its way, then it’s not science. That doesn’t mean it’s pseudo-science; that doesn’t even mean it’s wrong. It just means that we cannot know and therefore we cannot think of it as science.\n\nNow let me get to your third example, which is paranormal…\n\nAlex Tsakiris: Hold on. Let me just interject there because I agree with you. I think that’s a great point and I love the way you pulled it out. In Freud’s case, as we found out later, probably later after Popper wrote that is that there was actually fraud involved. I mean, he didn’t really have those patients. He was manufacturing—the theory was that his theory, whether that was real science or not—but the data that he used to support it wasn’t real data. So you kind of have both…\n\nDr. Massimo Pigliucci: I am not sure about that point. I don’t know enough about the history of psychoanalysis to actually confirm that.\n\nDr. Massimo Pigliucci: Well, if it is then it’s a matter of fraud and it falls into the same in the first example before. But there is no reason why the theory itself has to be discarded just because a particular practitioner engaged in fraud. I mean, that’s the same for as far as research on stem cells. It’s not like we shouldn’t do stem cell research or that there’s something wrong with the biology of that research just because that particular Korean group of researchers engaged in fraud.\n\nSo there’s a distinction we need to be making between individual instances of researchers who commit fraud—those obviously should be discarded as such. If you make up stuff then it’s obviously not science. But a distinction needs to be made between that and the possible failure of the theory itself. And my point was therefore broader about Freudian psychoanalysis. The idea is that it’s not a scientific theory, period. No matter even if the data are correct. Even when the data are right; even when you can bring up case histories, document the case histories and all that. The theory still is not science because it cannot be falsified.\n\nNow let’s go to your third example, which is paranormal research. You’re right, a lot of people do throw around terms like ‘bunk’ a little too easily. In fact, if you check out in the book, there is a chapter where I talk about paranormal research and UFOlogy, for instance—UFOs and things like that. I actually do criticize some alleged skeptics or what I call “armchair skeptics” who come up with explanations.\n\nThe case that I get into in some detail is a particular instance of alleged flying saucers being observed. A couple of skeptics just reacted when they were asked by the media, coming up with explanations basically out of thin air for what the flying saucer was. It turned out that those explanations were in fact wrong. There was a natural explanation for the sighting but it wasn’t the one that the skeptics were providing.\n\nSo that’s an example of a skeptic being close-minded. They simply knew that it couldn’t possibly have been flying saucers and so they came up with the first explanation that came to their mind without bothering to check whether the explanation actually fit the data. That’s not good skepticism. Now that is not the kind of thing that we need to do.\n\nOn the other hand, research on the paranormal has been done for almost a century. We have done plenty of experiments, say on telepathy or clairvoyance or things like that, and we know it doesn’t work. So how many more times do we have to show that?\n\nDr. Massimo Pigliucci: Of course it is.\n\nAlex Tsakiris: No. I’ll tell you what. That’s going to launch us into, I think, the other part of this discussion, which I think is interesting. Talking about philosophy of science and skepticism is interesting and it provides some grounding and I like a lot of the points that you scoped out there and I think that’s useful in the book, but it does seem—and I expressed this in the email to you—it’s only when you really dig into it that you really have a grip on this.\n\nI think for me, you get to the real challenges of this skepticism and bunking and pseudo-science. What I’d pull us back to, and I sent you this in email, is a post that you wrote in October 17, 2006 about out-of-body experiences. So this is something that we’ve dug into more on this show, so I can at least know a little bit of something about, unlike some of the other topics you talk about where I’ll just be out in the weeds.\n\nIn this post, here is the comment that you make that I just find incredibly troubling. You talk about the nature article and Olaf Blanke’s research and then you say, “This is good stuff. That should take care of the whole paranormal mumbo-jumbo about out-of-body experiences.” Now that’s your quote.\n\nDr. Massimo Pigliucci: Uh-huh (yes). I stand by that quote, yes.\n\nAlex Tsakiris: It’s astounding. To me, it seems incredibly—well, it seems unscientific. I mean, here you have this phenomena, out-of-body experience. It’s widely reported; it’s very perplexing; it’s very much unexplained, especially since a large number—the largest number of the cases reported happens at times when we can presume that there’s no electrical activity in the brain. That is, people are flat-lined, and that’s when they’re having OBEs. So that’s the situation.\n\nAnd then you have this research come along and it produces the effect that’s similar, but everyone agrees, hey, this isn’t really a full-blown out-of-body experience. It’s not a lucid experience; it’s hallucinatory; it’s not a full body experience. All these things that we normally see in an out-of-body experience…\n\nDr. Massimo Pigliucci: But out-of-body experiences are hallucinatory. That’s the point.\n\nAlex Tsakiris: Well, no. They’re really not if you research them as they’re most encountered in the near-death experience research…\n\nAlex Tsakiris: …and what the near-death experience research finds conclusively over and over in studies is that they’re non-hallucinatory.\n\nDr. Massimo Pigliucci: You mean to say that there is actually research that shows that people get out of their bodies?\n\nAlex Tsakiris: All this research is descriptive, right?\n\nAlex Tsakiris: So Olaf Blanke just asks people about their experience and if you look at that research when they’re reporting on their out-of-body experience, they say, “My arms were shorter than they were. They were out of proportion. They were in this way, that way.” Those are clearly hallucinatory. That’s not how their body really is. It’s exactly the opposite in near-death experience. They don’t see things hallucinatory. They’re realistic.\n\nDr. Massimo Pigliucci: They may be realistic but that doesn’t mean that they’re real. I mean, we have plenty of…\n\nAlex Tsakiris: But hold on, hold on.\n\nAlex Tsakiris: But here’s the point. The point is that you have this one study. He didn’t even really look at near-death experience. He just speculated that this might have some similarity. I would add that the study was not replicable, right? There’s a researcher in Sweden who tried to replicate the experiment. To this day, no one has really replicated Blanke’s work. But you jump on it and say, “This should take care of the whole paranormal mumbo-jumbo.” I mean, we have some real science here to unravel. It seems like it…\n\nDr. Massimo Pigliucci: Actually, we don’t. There’s been a lot of research done on so-called out-of-body experiences. And we know that’s—the article that I cite there, it’s only one piece of evidence that the paranormal so-called explanation is in fact not an explanation at all.\n\nThere is plenty of research that has been done on out-of-body experiences. We know that they can be caused by certain physical chemical conditions in the brain. We know that they are essentially—the best explanation—I shouldn’t say we know, but the best explanation for what’s going on is that these are, in fact, hallucinatory experiences that are caused by certain replicable, by the way, chemical physical characteristic–situations of the brain.\n\nAlex Tsakiris: Okay, what research are you citing? What research is that?\n\nDr. Massimo Pigliucci: Well, I can give you the list on when we get off the air but that the problem is…\n\nAlex Tsakiris: I just got done with that same kind of conversation with Dr. Steven Novella and…\n\nDr. Massimo Pigliucci: Right. Yeah, he’s a good source on that.\n\nAlex Tsakiris: Well, I just got done interviewing him and he came to the same point that there’s a bunch out there and he never followed through. So I don’t know if you’re talking about Persinger. Michael Persinger…\n\nDr. Massimo Pigliucci: Persinger is certainly one of those, absolutely. But the…\n\nAlex Tsakiris: Okay, I don’t—we’ve had him on the show. I don’t think his research at all is conclusive in that way. He hasn’t worked with near-death experience researchers and when he has, it hasn’t been an experience that they say matches up to their experiences. So my point…\n\nDr. Massimo Pigliucci: Yes, but my point is you’re making—you or whoever is making points—a paranormal explanation for near-death experiences is an extraordinary claim. We do have alternative explanations which are much more naturalistic and much more rational for those experiences. It seems to me that of course, again, science is not—it’s not about ultimate truth. It’s about provisional conclusions.\n\nBut from everything that I’ve read of that literature, it seems to me that the naturalistic explanation is by far the most likely. Now if you want to make the case that no, it’s not, and there is something else, it seems that that is an extraordinary claim and as Carl Sagan famously put it, “Well, that requires extraordinary evidence.” Besides, what kind of explanation is there really? It’s your paranormal explanations don’t seem to me explanations at all. There’s no mechanism that is being proposed; there is no understanding of how these kinds of things happen. That’s not science.\n\nAlex Tsakiris: Wow, that’s really going to launch us off in a couple of different areas.\n\nAlex Tsakiris: First of all, okay, the other researchers. And that’s all we can do is balance all the research out there. The folks that we’ve had on this show, and one of the people I point to is Dr. Peter Fenwick, one of the most highly regarded neuropsychologists in the world, practicing in the UK for many, many years. He was on and spoke quite, I think authoritatively, about the out-of-body experience research, about Blanke’s research, about Persinger’s research, and he finds it interesting but not at all compelling in the way that you do.\n\nThe same with the other folks that I’ve had on. Dr. Jeffrey Long has written extensively and published peer-reviewed articles about the very marked differences between Blanke’s out-of-body experience that he encounters and those that he’s encountered in near-death experience. So I don’t think it’s all to the point where we can say this whole “paranormal mumbo-jumbo” stuff should go away. And I think that’s part of the problem. When you get into the…\n\nDr. Massimo Pigliucci: Alex, I’m sorry. Let me stop you there for a second. If we’re going to play the expert game, it’s too easy. That’s one of the things that I get into in the book. Almost for any position whatsoever, no matter how far out it is, you will find somebody with a PhD. or an MD that is willing to defend that position. But that’s not the way science works. I mean, you can find scientists who deny climate change. You can find scientists who deny evolution. You can find scientists…\n\nAlex Tsakiris: But Massimo, in this case, it’s the opposite of what you’re talking about…\n\nAlex Tsakiris: …because—hold on. Let me finish my point before you disagree. The large majority of near-death experience researchers who’ve really published in this field are in consensus. They’re in agreement.\n\nDr. Massimo Pigliucci: Alex, that’s like saying the vast majority of astrologers are in agreement with the fact that astrology works.\n\nAlex Tsakiris: That’s an outrageous statement. How can you claim—it is. How can you claim—have you even read—do you know these people’s qualifications? Do you know their published work? You’re lumping them all together and calling them astrologers? I mean, where do you come off saying that? Again, Blanke, the guy that you’re referencing, he’s not a bad guy but he’s never studied near-death experience. And even since his publication, he’s even come out and said, “I think the phenomena are still real and not totally explained by just the mechanics of it…\n\nDr. Massimo Pigliucci: Alex, there’s a distinction between saying that a phenomenon is real. I don’t doubt the phenomenon is real. No neuroscientist doubts the phenomenon is real. That’s one thing on which we agree. I would also agree that we don’t have complete understanding of the phenomenon itself.\n\nThat doesn’t bother me either, because we don’t have complete understanding of many more mundane things that the brain does, let alone how the brain reacts under unusual conditions. There is a huge gulf however, between that and saying that these people are actually having some kind of super-normal, paranormal, or supernatural experience. That’s a huge…\n\nAlex Tsakiris: But I didn’t even get there…\n\nDr. Massimo Pigliucci: I know you didn’t but this…\n\nAlex Tsakiris: …you didn’t even let me get there because…\n\nAlex Tsakiris: …because you threw all these people—you threw all these researchers into the category of astrologers. I mean, when you talk about—I mean this whole point is how do we separate science from bunk? And I’m talking to…\n\nDr. Massimo Pigliucci: Let me be more clear about what I said or what I meant to say. If somebody who does near-death experience research claims that what these people are doing is experience—having a supernatural experience, that’s not science. It’s not science because first of all, science cannot actually say anything about the supernatural to begin with. That’s not what science does.\n\nDr. Massimo Pigliucci: Yes, by definition. By epistemological, if you want to be technical. It’s by epistemological agreement in philosophy of science. No philosopher of science would agree that science has anything to say about the supernatural for a variety of reasons that we can get into if you want.\n\nAlex Tsakiris: That gets into semantics.\n\nDr. Massimo Pigliucci: No, it’s not semantics. Epistemology is not semantics. Epistemology is…\n\nAlex Tsakiris: Right. But the discussion…\n\nDr. Massimo Pigliucci: …a serious branch—let me finish for a second. It’s a serious branch of philosophy that deals with how do we know things, right? And since science has been well understood over the last several decades in philosophy as a particular kind of activity which is based on a particular set of assumptions about what is being studied, one of those assumptions is regularity of the laws of nature. If the laws of nature started behaving erratically or in a way that is completely unpredictable you wouldn’t be able to do science.\n\nNow the supernatural, by definition doesn’t have to be bound by natural laws, obviously, otherwise it wouldn’t be supernatural, which means that in fact epistemologically science has reached its limit there. There is nothing sensible that a scientist can say about the supernatural. And therefore, if a scientist claims—invokes a supernatural explanation for a particular phenomenon, that scientist right there has ceased to do science.\n\nAlex Tsakiris: But who are we talking about here? I…\n\nDr. Massimo Pigliucci: I don’t know. Who are we talking about? We’re talking about people who suggest that there are supernatural or paranormal implications into these kinds of experiences…\n\nAlex Tsakiris: But I didn’t bring that up. You’re arguing kind of against yourself. I brought up…\n\nDr. Massimo Pigliucci: Well, I like to do that because I always win that way.\n\nAlex Tsakiris: [Laughs] Fair enough. But I brought up Dr. Peter Fenwick. I brought up Dr. Jeffrey Long. If you’re familiar…\n\nDr. Massimo Pigliucci: Let’s not talk about individuals. Let’s talk about explanations. What is it that these people think is going on?\n\nAlex Tsakiris: Well, let me finish my darned sentence here.\n\nAlex Tsakiris: The theory is that consciousness, in some way we don’t totally understand, survives bodily death. Now, that’s well-constructed. It’s not totally framed up in scientific terms but it’s an important theory because it contradicts the prevailing materialistic explanation of consciousness, which is pretty much nonexistent because consciousness is something we’re grabbing at. So to say that consciousness in some way we don’t understand seems to survive bodily death, I don’t know why that violates some sacred creed of science. I don’t think it does.\n\nDr. Massimo Pigliucci: It’s not about anything sacred because science doesn’t have any sacred creeds. It has assumptions, as I said, but those are not sacred. Even those are not sacred. So let’s analyze what you just said. You said something like this is a theory of consciousness or a theory of survival of consciousness beyond the physical brain that we don’t completely understand. You said something on those lines.\n\nAlex Tsakiris: Hold it. I’d interject. We do not understand consciousness. I mean no one understands consciousness.\n\nDr. Massimo Pigliucci: No, no, no, I’m not referring to consciousness. I’m referring to you saying that these people are putting forth a theory something on the lines of an incomplete or not yet completely formed theory of survival of consciousness beyond the physical brain. Is that correct?\n\nAlex Tsakiris: Well, we have to step back and say we’re trying to get our arms around consciousness, whether it’s material or immaterial, what it is, when it begins, does it begin at birth…\n\nDr. Massimo Pigliucci: But we do have quite a bit of knowledge about consciousness. I would certainly agree that the problem of consciousness is far from being solved, but it’s not that we don’t know anything about it, right?\n\nAlex Tsakiris: Right. We can always say we know something about it, but fundamentally, we don’t understand its nature, whether it’s material or immaterial, whether there’s a cause and effect, all those things are up for grabs.\n\nDr. Massimo Pigliucci: Well, actually we do. In philosophy…\n\nAlex Tsakiris: Let me finish. We don’t know what entities or beings are conscious. We don’t know—we think dogs and gorillas are conscious because when they look at themselves in the mirror they identify themselves. We think other animals have some other limited form of consciousness.\n\nAlex Tsakiris: Let me finish. We don’t know if computers can be conscious or what’s necessary…\n\nDr. Massimo Pigliucci: We know that they are not.\n\nAlex Tsakiris: [Laughs] Okay, we know that they’re not. So the point being that when anyone who speculates about the end of consciousness is only speculating, even if we get down to hard-nosed medical terms, we’re really less and less sure about what death actually means. I just heard Dr. Sam Parnia, who’s explored this probably more than anyone in terms of resuscitation and what our definition of death really means.\n\nSo to then in that larger context for someone to explore one aspect of that and saying, “I’m going to explore the end of consciousness and whether consciousness can survive bodily death,” and then present the findings of the phenomena that they observed, is that in some way from the research that we’ve done, consciousness seems to survive bodily death. That’s how I’d frame it up.\n\nDr. Massimo Pigliucci: All right. First of all, it doesn’t because even if I grant you that there is something about what you’re saying to these experiences, these are not people who actually died and came back. These are, by definition, near-death experiences. So it still doesn’t establish anything at all about consciousness surviving after death. We’ve never had an example in history of somebody who was actually certifiably dead and his consciousness has survived.\n\nAlex Tsakiris: See, now hold on. Because right there Dr. Parnia would strongly disagree with you. And the best research on this…\n\nDr. Massimo Pigliucci: Yeah, like what? Give me an example.\n\nAlex Tsakiris: Okay. First of all, his definition of death, which is as good as I’ve heard, is to say to look at cardiac arrest patients and to know that when someone has a cardiac arrest, this is not a heart attack, this is cardiac arrest. Your heart has stopped. We know within 10 to 15 seconds your brain stops. We know that if we do nothing, you’re dead. So his comment is that that person, by any means that we normally talk about it, is dead. That person is dead. So any experience that they have that we can tie to happening after that period of cardiac arrest is unexplainable with conventional medicine. And we see…\n\nDr. Massimo Pigliucci: As the good doctor should know, there is actually quite a bit of disagreement about where exactly the line of certain death is. Cardiac arrest is strictly one of the criteria. Certain brain activities are another one of those criteria. The two don’t necessarily go together as you pointed out. There is the line between one and the other. But the point is, before I accept that the very extraordinary notion that consciousness can survive death, I want to make sure that somebody’s absolutely and completely dead.\n\nI don’t know of any example, unless you obviously believe in the story of the resurrection of Jesus, of any example at all in which we actually have a documented instance of somebody who was dead by anybody’s independent observer understanding of death and then he came back. We just don’t have it.\n\nAlex Tsakiris: Well, the best research that we do have or one of the best pieces of research was done by Dr. Penny Sartori, who did a prospective study of people who had cardiac arrest in the hospital and then asked them to recount their resuscitation process.\n\nSo this is after they’ve had cardiac arrest. How were they resuscitated? And what she found was in the two groups she looked at, one group that had near-death experiences, the other group that didn’t, the group that had near-death experiences was dramatically more accurate in recounting their resuscitations. Now this is the kind of evidence that we normally accept; we normally say that’s suggestive of the hypothesis.\n\nAnd what you seem to have done, and I would say, getting back to this extraordinary claims/extraordinary proof thing–although people who listen to this show regularly will cringe at me launching into this topic again—I don’t think that comes into play. That’s fine for the general public to say, “Hey, you need extraordinary proof before you believe anything.”\n\nBut other than that, scientists have built-in, they’ve internalized extraordinary claims/extraordinary proof. That’s how the peer review process works. That’s how people are accepted or promoted inside of science, by offering extraordinary proof or making extraordinary claims. So we can’t apply that layer on top of things as an observer, as like you said, like an “armchair” scientist saying, “Wait, that’s an extraordinary claim.”\n\nBy whose means do we determine what’s extraordinary? That’s the whole purpose of science, is to remove us from the bias and prejudices that we feel in making these kinds of subjective evaluations.\n\nDr. Massimo Pigliucci: No. I think that we have a different understanding of science and how it works. The standard of extraordinary—let me put it another way. Let’s get away from the standard phrase, the Carl Sagan phrase. Let me put it in more rigorous framework, which in fact I tried to do in one of the chapters in the book.\n\nOne of the most widely accepted ways in both theoretical science and philosophy of science these days, thinking about the relationship between claims and evidence, is the Bayesian framework. So Bayesian theory which is very wide-spread in statistical analysis decision-making theory and so on and so forth, and it’s now being used in several other areas of science. It’s actually a very simple theorem in probability research, probability theory, and it essentially explains what is the relationship between degree or strength of belief in a particular notion, whatever the notion is. A hypothesis, for instance, a particular scientific hypothesis, and the evidence that is available.\n\nAnd the Bayesian framework not only tells you what the relationship is between belief and evidence, it also tells you what is the rational way of changing your belief when the evidence changes. Because one of the things we need to take into account of course, that the evidence does change over time. Science proceeds not just because people have new ideas, but also because new data come in. New facts come in that need to be explained by either the old hypothesis or by a new hypothesis.\n\nNow if we adopt a Bayesian framework, all that it says is that it rigorously quantifies the older idea that extraordinary claims require extraordinary evidence. In fact, the Bayesian framework says that the claims have to be proportional to the evidence.\n\nAnd what I’m saying is that in this particular case, I just don’t see from my reading of the literature that the claims are even close to being proportional to the evidence. The claim is really extraordinary because we do not have any reason to believe, or again, any compelling evidence to believe that consciousness—whatever it is and however it works—survives bodily death.\n\nAlex Tsakiris: But I just cited you several…\n\nAlex Tsakiris: …and you’ve cited nothing. I mean, you’ve come back with nothing other than to say it’s out there, it’s overwhelming, believe me, believe me. Give me something to sink my teeth in. Give me the data. And tell me how the data—how this new data has informed or changed your view along the lines that you just said, because what I see, both from what you’ve written and what you’ve said here, is just a very dogmatic stance…\n\nDr. Massimo Pigliucci: First of all, if we want to talk about…\n\nAlex Tsakiris: …these guys who take this position are astrologers…\n\nDr. Massimo Pigliucci: I’m sorry, but first of all, if we’re going to talk about stands and dogmatism, you haven’t actually given me any evidence, as I’m sure you realize. You just threw in a couple of names there. If we wanted to have this as a serious discussion, then we should email each other whatever references we feel are compelling and then each one of us should go through those references, and then we’re going to be talking about actual looking at evidence.\n\nThe fact that you can throw me a name, I can throw you another name. As I said, ask Steve Novella. You said, I asked him. Well, as far as I know he’s one of those people that actually knows these literatures to a good degree. And he’s a medical doctor, incidentally. So he can actually address those issues much better than I can.\n\nI’m asking, however, a much more basic question, which is regardless of which authorities one can cite in favor or against, neurobiology in general—and biology in fact even more fundamentally, and cognitive science and I would add even—I’m going to throw into the mix also—philosophy of mind. All of those fields, the consensus in all of those fields is that there is, in fact, no evidence of decoupling consciousness from physical activities of the brain.\n\nThat doesn’t mean we understand consciousness. It doesn’t mean that we have a good mechanistic explanation for what’s going on, but it is something that philosophers of mind refer to as the “no ectoplasm clause.” The no ectoplasm clause is the idea that whatever consciousness is, it seems to depend on the brain. If you shut down the brain it goes away. And if you shut down the brain permanently, it doesn’t come back.\n\nAlex Tsakiris: If what you’re asking for and suggesting, and I’m all for this, because I’ve found in doing this show that really one show is never enough. One show kind of tees up the topics, and as you said, I totally agree with you and I wasn’t trying to ambush you with a bunch of quotes and references that you can’t respond to off the top of your head because that doesn’t prove anything on my side or detract anything from your side. I’m happy to engage in that. I’m happy to send you those references and structure a debate around that topic. Are you open to doing that?\n\nDr. Massimo Pigliucci: Yeah, although as I mentioned a few minutes earlier, I’m not actually the best person to do that. I do believe in expertise. You see, one of the chapters in the book is about expertise.\n\nAlex Tsakiris: Well, you can get any experts you want to help you. I’m just saying, are you the guy—are you willing to step forward and say—I’m certainly not an expert, either, so I’m going to be relying on experts to coach me. Are you willing to engage in that?\n\nDr. Massimo Pigliucci: Well, instead of doing that, we can do that if you like, but instead of…\n\nDr. Massimo Pigliucci: …having two non-experts doing that, why don’t you actually ask two experts? Get one of your people, the people that you mentioned before and get him up against somebody like Steve Novella or Ken Frasier, the editor of Skeptical Inquirer, and see what happens at that point. Those are people who actually—allegedly at least—know the literature.\n\nAlex Tsakiris: I’d rather do it with you. You’re right here. We’ve opened up the dialogue. I’d rather see it through. And I’m happy to follow through with that if you are.\n\nDr. Massimo Pigliucci: Well, clearly we can’t do that today because that would require…\n\nAlex Tsakiris: Right. No, no, no. We’ll schedule it a month or two out, whatever feels right. I’ll send you the references and you know what I think would be interesting and stimulating along the lines of the book, Nonsense on Stilts, I think it’s almost like a case study and we can publish it as we’re going, as we’re accumulating data. And then we’ll kind of cap it up with a discussion about it, and I’m sure it will be…\n\nDr. Massimo Pigliucci: Well, you can send me this stuff and we can talk about it. It seems however, honestly, a fairly bizarre proposition because if in the spirit of Nonsense on Stilts, I am suggesting that if the controversy is about expertise, then you have to ask the experts. Now neither you nor I are experts in this particular area, so it seems like we will be talking about just by quoting second resources. Is that a…\n\nDr. Massimo Pigliucci: …really good reason, I mean, a way to go about it?\n\nAlex Tsakiris: But you’re the one who wrote, “This stuff should take care of the whole paranormal mumbo-jumbo.” You’re the person who’s put themselves out forward with making these—and you said right after that, “I stand by that.” So that’s all I’m asking you to do is stand by it.\n\nDr. Massimo Pigliucci: Alex, there is no contradiction between the two statements and it seems to be clear to me, clear that there shouldn’t be any contradiction. I am also say—let me give you another example that is exactly along similar lines. In the book, as you know, I take a strong stance in favor of the notion of climate change. But I don’t do that on the basis of my understanding of climate science because I’m not a climatologist. I’m not in atmospheric physics.\n\nWhat I do is I do what any good skeptic would do. That is you go to the sources, to the actual experts, you look at what they’re saying and say, ‘Well, is there a consensus within that community?’ And if the answer is yes there is, then the best bet for somebody who does not have technical expertise in that area is to say, ‘Look, unless there is in fact a controversy within the scientific community, my best bet is to go with the current consensus,’ of course with the understanding that every consensus in science is provisional.\n\nSo where I take stands that are, in fact, based on my own expertise is where my expertise belongs, and that expertise is in evolutionary biology. So if we’re talking about evolution versus creationism, we can do ten shows on that. I have no trouble with that. Or in philosophy of science. If we’re talking about the epistolary of science, if we’re talking about the limits and positive aspects of science, we can also do that. For everything else, including what I say in the book, my position is precisely that. The best that a non-technical expert can do is to look at the consensus if there one in the relative community of experts.\n\nBy the way, before some of your listeners might actually raise these issues, I’m going to preempt it if you don’t mind. Whenever I say, “Oh, you should listen to what the experts are saying,” I am accused of committing a logical fallacy, which is the argument from authority. And I’d like to clear up what the issue there is because for a philosopher to be accused of committing a logical fallacy, it’s really an ironic thing and sure to be embarrassing if it were true. So the argument from authority of course, is a fallacy when you use it this way, if you’re saying that it necessarily follows from a scientific consensus or from what an authority says that what that authority says is true.\n\nSo if I were to say that, “You know what? I know for certain that climate change is real. Why? Because the experts say so,” that would definitely be an example of a logical fallacy. You cannot derive certain knowledge, you cannot derive consequentially, absolutely certain knowledge from the fact that there is agreement within a certain community of experts because of course, the history of science shows that the community of experts can be wrong.\n\nWhat I am saying instead is what I think is a very rational and in fact, even common sensical position which is understanding that whatever concerns science reaches is in fact provisional, your best bet as a non-technical expert is to look at whether there is a consensus and if there is a consensus, go with it.\n\nThat seems to be, to me, rather uncontroversial, and it seems to me therefore, as a kind of service to the kind of debate that we’re having that when the two of us can have a debate as non-experts. We can keep throwing at each other names and citations, but the fact of the matter is I am not an expert on consciousness and you’re not an expert in cognitive science, so the best…\n\nAlex Tsakiris: Hold on, though. I let you go on there for a while, but hold on. You are an expert…\n\nAlex Tsakiris: …by virtue of Nonsense on Stilts and how to tell science from bunk. And you are a guy with three PhDs and I’m a PhD drop-out, so I think we ought to be able to at least demonstrate how someone would sort through this material. It doesn’t have to be antagonistic. I don’t have anything against you and I think we’ve got a nice conversation here and you’re obviously a very intelligent guy and a likeable guy. I’ve listened to your podcasts.\n\nAlex Tsakiris: But I think it’s useful to show how we sort through this stuff and how we throw out certain pieces of information and what information we include. And that’s what I’m suggesting we do. I’ll be happy to send you that and we’ll just see how the process goes. You’re not committing yourself to doing anything, but…\n\nDr. Massimo Pigliucci: No, I understand. I mean, I’m curious to see the material that you send me. I’ll look at it and we can do a followup. All I’m saying is I don’t think that’s actually the best way to proceed, but if that’s the way you’d like it, we can do it.\n\nAlex Tsakiris: Well considering I’ve had on just about every expert I can think of, I mean I’ve had Steve Novella on the show. He’s not really an expert in near-death experience at all. But I’ve had on Kevin Nelson, who’s a skeptic and has published in near-death experience. I’ve had on Michael Persinger. I’ve had on Jeffrey Long. I’ve had on Peter Fenwick. I’ve had on Penny Sartori. So I’ve tried to reach out to the experts. I’m not talking to kind of high-level…\n\nDr. Massimo Pigliucci: Did you ever have them in the context that you’re talking about? Because you’re suggesting a debate between the two of us. Did you have in the context of a discussion between a proponent and an opponent of the notion?\n\nAlex Tsakiris: Yeah, yeah, yeah. Over and over again.\n\nDr. Massimo Pigliucci: And what happened? On the same show you mean?\n\nAlex Tsakiris: What we’ve done, and it really works better, is threaded shows. So one person comes on and presents theirs. So I’ve had, for example, Kevin Nelson come on from the University of Kentucky. His theory on near-death experience is REM intrusion. He came on and presented his. Had Dr. Jeffrey Long come on, present a rebuttal. Invited Dr…\n\nDr. Massimo Pigliucci: Right. I understand, so that’s the way it’s usually done. But what I’m saying is that first of all, actually I’m—I guess—this is your show so you do things as you like. But I’m actually suggesting that that’s not the best way to do it because…\n\nAlex Tsakiris: I’ll tell you why it is the best in my opinion. This is totally stylistically show-wise. If you don’t, you wind up with as we naturally do here because we both are enthusiastic about the subject and have a lot to say, but you wind up kind of stepping over each other. You can’t completely make your points, and it turns into a sound byte pro versus con, point versus counterpoint, and I think you lose the real depth that I…\n\nDr. Massimo Pigliucci: But that’s exactly what you’re suggesting the two of us would do.\n\nAlex Tsakiris: I think we can do it in a different way. I think there’s a number of different ways to do it, and I’m totally open to doing it in that way, where I give you total free reign to speak or what I’ll probably do is present a case. I’ll kind of make my pitch out there and then leave that out there and then invite you to—you can do it on your podcast, if you like. You can present your rebuttal and then we can kind of go from there.\n\nDr. Massimo Pigliucci: That’s definitely a possibility. Anyway, should we move on to another topic or…?\n\nDr. Massimo Pigliucci: I don’t know. We can stay on this for a few more minutes, but it seems like it kind of…\n\nAlex Tsakiris: No, no, I would love to and there’s many, many other topics I would love to talk about. I do feel like we’ve used up a lot of your time. We’re at 52 minutes here in the conversation. Let me ask you as we begin to wrap things up, how things are going with Nonsense on Stilts? Obviously, it’s a book that’s getting some attention and seems to be reviewed well. How’s it going for you?\n\nDr. Massimo Pigliucci: It’s going all right. It’s an interesting reception. For instance, a very positive review in The New Scientist and then there’s a very negative review in The Chronicle of Higher Education, which turned out to be written by somebody who is a professor of philosophy, I think at the University of Pennsylvania, and really, really disliked it. It was interesting the reason he disliked it. He thought that I was a “science warrior” as he put it. It was one of these scientistically-oriented people who just is a close-minded defender of science.\n\nAnd the funny thing is that people on the other side of the debate accuse me of not being enough of a defender of science. My colleague, Jerry Coyne, for instance, at the University of Chicago, constantly says that I’m an accommodationist and a fluffy-thinking kind of guy who doesn’t take enough of a stand.\n\nSo I find it amusing that some of the reactions are, ‘Oh, this guy is too much of a strong defender of science,’ and some of the other reactions on the other side are, ‘Well, this guy is not defending science enough.’ I would like to draw the conclusion that I’m doing something right if I’m managing to piss off both sides of the debate. But that may not be the case, I don’t know.\n\nDr. Massimo Pigliucci: It’s been an interesting experience from that perspective. We’ll see how the book is going to be doing over the next few weeks and months. It was certainly a lot of fun to write. I learned a lot about topics that I knew only superficially or cursorily about it. It took some time to put something like this together, obviously, as you might imagine.\n\nAnd I definitely enjoy talking to people about these topics because it turns out that every time I that I have these kinds of conversations—I’ve been on several podcasts, I’ve been on a couple of NPR shows and so on—every time that I have a conversation, it’s a different conversation. It’s really interesting because people seem to be picking on different chapters of the book or different themes of the book.\n\nThat makes for an—I don’t want to say endless variety of conversations because of course, it’s a finite one—but it’s a really interesting and varied set of conversations. I’m really enjoying the opportunity to talk about it.\n\nAlex Tsakiris: Great. Well I think it’s obviously an incredibly important and timely topic in terms of just science in general. I think where we go with the gap that we have in scientific knowledge and how that’s being treated in our society. I think you try your best to address it. It’s very interesting.\n\nI also have to say that I did find and listened to your podcast. The whole thing on accommodationist and whether you’re a true-blue atheist or not kind of thing, I found very interesting. I’d love to get into that sometime and talk about how you can accommodate spiritual beliefs and that or whether that’s appropriate or how that fits in because I think one of the problems—and I think it’ll evolve into that a little bit naturally if we continue this dialogue.\n\nI would submit that one of the problems with near-death experience research is it’s under this pale of spirituality that makes it just a hot button issue that folks can’t really look clearly and think and talk about the data because there’s this fear that it’s going to bring in all these issues of culture war issues in terms of spirituality. So I think the accommodationist thing, and I’d encourage anyone to go—we’ll provide links to your podcast, as well—to go listen to that. I think it’s an interesting dialogue.\n\nDr. Massimo Pigliucci: Yeah. It’s definitely been fun and as I said, I find myself in this bizarre situation where I don’t think of myself as either an accommodationist or a new atheist, which means that I get criticized by both sides. It’s fun. I can take it. I’ve got enough of a broad shoulder to be able to take that.\n\nAlex Tsakiris: Yes, yes, you do. Well great, and Dr. Pigliucci, thank you very much for joining me today on Skeptiko. I look forward to talking to you more.", "opengraph": {"locale": "en_US", "type": "article", "title": "Massimo Pigliucci on How to Tell Science From Bunk | Skeptical Science", "description": "City University of New York Professor skeptical of near-death experience, likens NDE researchers to astrologers. There’s pseudoscience, bunk, scientific nonsense, and then there’s real science… at least according to Dr. Massimo Pigliucci author of, Nonsense on Stilts: How to Tell Science From Bunk. Join Skeptiko host Alex Tsakiris for an interview with Professor Massimo Pigliucci, […]", "url": "https://skeptiko.com/massimo-pigliucci-on-how-to-tell-science-from-bunk/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2010-06-22T16:34:50+00:00", "article:modified_time": "2017-07-25T20:06:11+00:00"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["http://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-107-Massimo-Pigliucci.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-107-Massimo-Pigliucci.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-107-Massimo-Pigliucci.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-107-Massimo-Pigliucci.mp3"], "authors": ["Alex Tsakiris"], "publish_date": "2010-06-22T16:34:50+00:00"}