{"result_id": "273005", "URL": "https://skeptiko.com/scott-shay-conspiracy-theories-in-academia-525/", "timestamp": "2023-04-25 17:07:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/scott-shay-conspiracy-theories-in-academia-525/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Scott Shay, Conspiracy Theories in Academia |525|", "cleaned_text": "Scott Shay is a business leader worried about the intellectual corruption of academia.\n\n[00:00:00] Movie Clip: My deepest I was about to go when the camps together through all that just to be shot in the living room by Verba. Nazis Jonas, God damn Nazis.\n\n[00:00:17] Alex Tsakiris: That’s Al Pacino from the Amazon series hunters about a group of modern day Nazi hunters. Spoiler alert Al Pacino isn’t quite what he seems to be in that little clip there. Although isn’t that a perfect theme set up for this show in general, and for this episode, things aren’t always what they seem. Take, for example, today’s guest the very excellent and well spoken, Scott Shay who’s written a book called Conspiracy U, now, you know, or you might know from listening this show that I have a special affinity for successful business people who then venture into these kind of intellectual pursuits, like Scott does. This guy is sharp, and he’s worldly in a lot of ways. And as you’ll see, in this dialogue, he’s able to quickly kind of cut through a lot of the chaff and get down to talking about real stuff. And we talk about plenty of real stuff in this interview, here are some clips. I do run across people now and then who have the whole hoax thing. And it pops up in sometimes the strangest way. I’ll talk to people and I’ll think, or having a good conversation, and then I find out this part.\n\n[00:01:29] Scott Shay: I’ve talked to folks just like they have to who are and I talk about folks in the book who are had PhDs in something, they’re not dummies. And yet when it comes to believing in a conspiracy theory about the Jew Arthur Butz, who’s a Professor of Engineering at Northwestern University as tenure claims that everything that happened to my father and everybody else was just a myth designed by Zionists with political motivation, and that these Jews were so smart that they were able to place 1000s of false documents. Sadly, what happens on campus no longer stays in campus. These theories are becoming much more ubiquitous. They are infiltrating in some areas into the investment world this whole BDS movement, boycott this divest and sanction is a direct heir to what happened on campus.\n\n[00:02:27] Alex Tsakiris: Let’s go to something a little bit harder. Because the other I guess, concern I had with the book is that, when I think of anti-Zionist conspiracy theories, I think of this Ghislaine Maxwell and her pedophile lover Jeffrey Epstein, were both Israeli spies who took pictures of powerful men having sex with underage girls to blackmail them, their alleged Mossad handler has sensationally claimed. Now, I would just add that that alleged Mossad handler kind of stands up to scrutiny pretty well. He was tried in court and was actually acquitted because he showed that he was an agent of Israel and his arms dealing.\n\n[00:03:07] Scott Shay: Well, look, first of all, I’d like to say this. What have the with the anti-Zionists say is something separate? I mean, there. By the way, I have no idea if that’s right, wrong or indifferent. I’ve never heard that or seen that before you put it up on the screen. So I don’t express any opinion. But I will say this, the United States has done despicable things, a lot of countries do despicable things.\n\n[00:03:34] Alex Tsakiris: So, I think this is a really good interview from a really terrific guest who’s willing to go there and engage on stuff and talk in a very unscripted way like this. Hats off to Scott Shay for doing that. So here’s the thing, if you like this interview, if you agree with me, that this is unique, you’re not gonna find another interview like this. Well, anywhere I listen to a ton of podcasts. I don’t hear very many interviews like this, share this interview with other people. Let’s let other people know that these kinds of dialogues, these kinds of challenging dialogues are happening on the internet. That’s my mission to make that happen. And to make it happen, I need your help. In the last episode, I asked people to reach out a little bit to share the Skeptiko thing with other people. And you did. I’m really, really grateful that you did. So, I’m going to ask you to do it again. Take a moment and do what you can to let people know that we’re out there. We’re holding down the fort in terms of these next level intelligent dialogues slash debates about real important stuff. That’s my pitch. Remember, there’s no strings attached. There’s no money changing hands. There’s no firewall. There’s no advertising. There’s no nothing. Go buy Scott’s book, if you want to spend any money do that, but you don’t have to give me anything. Just share the ideas. Okay, here’s the interview. Welcome to Skeptiko, where we explore controversial science and spirituality, with leading researchers, thinkers and their critics. I’m your host, Alex Securus. And well today, we have a good one, super successful business leader, banker and author, Scott Shay is here to talk about his new book, Conspiracy U. Scott is the co-founder and chairman of Signature Bank in New York, a very, very substantial bank. He has an undergraduate and MBA from Northwestern. I mentioned that, particularly because it is relevant to this story as we go on. Scott, welcome to Skeptiko. Thank you so much for joining me.\n\n[00:05:46] Scott Shay: Alex, thank you for having me on your show. It’s great.\n\n[00:05:50] Alex Tsakiris: So, Scott, why don’t we start just tell people the basic premise of the book.\n\n[00:05:55] Scott Shay: So the basic premise of the book is that conspiracy theories from both the far left and far right, are masquerading as scholarship at universities, including my own Northwestern University. And these conspiracy theories are not just about Jews, but there are plenty of them, much Jews and Zionism, and I was amazed and stunned to see how things that make no sense are passed off as academic research at advanced universities.\n\n[00:06:34] Alex Tsakiris: Great. I’ll tell you what, can you tell us a little bit about your father? I think it’s actually there’s some important history there that I learned that I didn’t know before. And it certainly plays into one of the most important conspiracy theories that we might talk about a little bit.\n\n[00:06:49] Scott Shay: Yep. Well, my father grew up in [unclear 6:52], Lithuania. And he was when the Nazis came in, in 1941. It was just before he was going to turn 14, his father was murdered. Practically before his eyes, his brothers, his aunts, his uncles, and almost all of his cousins were murdered my closest relatives on his side as a second cousin once removed. The bad news was, and the really, really bad news is the decades of conspiracy theories and a boycotts of Jews and spec center. Let everybody to think that these Jews, no matter how nice these local Jews are, they’re part of some evil cabal. And once the Nazis came in, every last Jew was handed over inspectioner, nobody escaped.\n\n[00:07:39] Alex Tsakiris: So that’s the little bit that I guess I’ve heard about. But your story, and I don’t know if it was in the book, or I read in another interview did kind of added to that, I mean, tragically, this was an enabling kind of thing that was going on in Lithuania that really propelled that. And then, I do run across people now and then who have the whole hoax thing. And it pops up in sometimes the strangest way. I’ll talk to people and I’ll think we’re having a good conversation about something that we both believe in or think we believe in or want to explore. And then I find out this part, and I always kind of, I am surprised, but then the actual history, not of your father, but that same period, is what I refer people to because what happens to your dad.\n\n[00:08:33] Scott Shay: So here’s the thing to that I, and unfortunately, in this process, I’ve talked to folks just like that, too, who are and I talk about folks in the book who are have PhDs in something, they’re not dummies. And yet, when it comes to believing in a conspiracy theory about the Jew, Arthur Butz, who’s a Professor of Engineering at Northwestern University, as tenure claims that everything that happened to my father and everybody else was just a myth, designed by Zionists with political motivation, and that these Jews were so smart that they were able to place 1000s of false documents. They were able to, in his words, bamboozle Germans to confess to committing crimes against humanity, just because the Jews were so good at gas lighting. They were able to and another it’s a word of his bamboozle or hoodwink the judges at Nuremberg, who there were a few Jews on the margins, who convince these otherwise smart jurists that, that there had been this massive tragedy among the Jews, when at most, at most, he would say, and this is a tenured professor at Northwestern University. At most it was a typhoid break, typhoid outbreak brought by some Russians, who were also prisoners of war and he stayed. The only reason that Jews were put into camps was for their own protection. Hitler wanted to make sure that no one would bother the Jews. When you think about it, you have to dismiss all the evidence in order to believe what he’s saying. And strangely, about 11% of millennials think that that’s the case.\n\n[00:10:19] Alex Tsakiris: So in the case of your dad, if I have the story, right, he’s in Dachau, horrible, horrible concentration camp. He’s liberated in April of 1945. He weighs 60 pounds. But the facts that we know is like, hey, one of the only reasons Dachau is what it is, and it’s shown for what it is to the world is because Patton’s kind of charging through with his tanks, famously not to rescue necessarily Dachau, but that was the strategy of the Americans at this point. But then, like, I tell people who, you can go online and find like, a guy who’s still alive was 19, at the time was just a US soldier serving with Patton and he says, “Yeah, I was there. And it was [unclear 11:04].” Patton just like, you hear the story Patton went into town, grabbed the mayor, and grabbed the people in town and made a march through the camp. He says, “This is a real story. I was there. I saw it.” And then Eisenhower Dwight, our became our future president came to the camp and was a guy who was seasoned in war was just so horrified that he was literally throwing up, this guy had seen a lot of stuff. And he was throwing up at the side of it. So I think it just, I don’t want to hammer that too much. Because I got some other stuff for you, that might not jive with all your stuff. But …\n\n[00:11:38] Scott Shay: Hammer away on that. I mean, my father, if he hadn’t been liberated, in those days, or at most, a few weeks, he’d have been dead. And he the only reason he’s alive today I’m alive today is because American soldiers brought him to a field hospital. Otherwise, he’d be dead. I mean, my father was great patriot because the Americans saved them. And they did it out of the goodness of their heart. It took them a year to be fully recovered.\n\n[00:12:07] Alex Tsakiris: Oh, I can only imagine. Okay, so that’s an important history, because it’s your personal history. But it’s also just as it ties into the book. It’s just an important history to know, because there are people, I wasn’t aware of that figure that you threw out. But it’s stunning to think that 11% of millennials would believe the whole hoax thing, because it’s just a silly conspiracy theory. And that’s what I want to talk about next. Because this book of yours Conspiracy U talks about, maybe you want to before we get there, tell us about the main conspiracy that you’re driving at, because it’s the one that you detail in the book and talk about I found rather obscure within the realm of conspiracy theory, but obviously, it’s one that you think is important, is it? The one that you mentioned, there’s other ones you mentioned the book, which ones do you really want to highlight?\n\n[00:13:02] Scott Shay: Well, it’s the anti-Zionism. One is a conspiracy theory. Now you can be for the Jewish state. You can think Israel’s good, Israel’s not so good, but conspiracy theories. And you really get this is that it’s not just about unwarranted or harsh criticism. That’s bad. But academics, publishing books, it major presses, Duke University Press, Stanford University Press that have tenure, are writing stuff that’s made up about Zionist, Jews, naming Palestinians so that they can harvest their organs, that somehow Zionist slash Jews are in cahoots with people all around the Earth, to teach police to harm people of color. These are so silly in terms of when you start to try to analyze any facts. But when you talk to folks who are propagating these theories, the Jasper Poor are the world some of them recognize that they’re just politically motivated, but others they just continue to create a larger and larger balls non-falsifiable theory so not unlike what Butz does with the Holocaust. The folks on the far left think that there’s some amazingly effective conspiracy of Jews to cover up all the bad stuff that they’re doing in the world. From organ harvesting to clean colluding with the Minneapolis Police in the murder of George Floyd. I mean, this stuff is amazing. And then 300 California University organizations created a resolution that they want to do censure Israel for their involvement with the George Floyd and other murders, harassments of people of color. There’s no sense to this. I mean, let’s not forget, there’s 6.7 million Jews in Israel, we have 8 billion people in the world. And yet some of the Jews are the massive focus of all of these theories. And by the way, I talk a little bit about the boycott issue. I mean, there is one boycott movement in the world, the one BDS movement in the world. And strangely enough, it’s against the one Jewish nation in the world, like every other country is perfect.\n\n[00:15:50] Alex Tsakiris: Okay. Let me kind of pull this apart a little bit. I think there’s a lot of common ground between us. I think, for someone who’s investigated conspiracy theories a lot and has some of the same frustrations that you do about the silly conspiracy theories, flat Earth conspiracy theory, there is no COVID-19, there is no COVID virus, there is no viruses at all [unclear 16:12]\n\n[00:16:13] Scott Shay: This is a lie and Paul is dead.\n\n[00:16:16] Alex Tsakiris: Well, there’s also conspiracy theories that I think justify our examination. And I wanted to bring up are you aware of the origin of the modern term conspiracy theory and where it came from? Because I looked in your book, you have a chapter conspiracy theories, what they are and why they are bad. We’ll talk about that in a minute. But are you aware of the modern origin of the term conspiracy theory?\n\n[00:16:45] Scott Shay: No, I read Joven Bradford and Sam Kasim who wrote about conspiracy theories.\n\n[00:16:51] Alex Tsakiris: They don’t talk about its directly from a document that was released through a FOIA request. I think the New York Times initiated the FOIA request in 76, or something like that. The title of the document, this is CIA, Concerning Criticism of the Warren Report, and was drafted in 67, it was about JFK. And it was to all the media outlets back then you remember the day media outlets, you could kind of count the ones that really mattered, all of them were told, do not veer from the story of Lee Harvey Oswald lone nut assassin. And then they introduced this term conspiracy theorist as a pejorative term, and use that to kind of characterize all these people. Now, the upshot of that I don’t know if you’re totally aware of this. But again, I’m not picking that up. That’s a FOIA year release document from the CIA. But the upshot that that I guess a lot of people in the same way that you’re talking about, a lot of people don’t realize that in 1978, the House Select Committee on Assassinations, concluded that JFK was probably a conspiracy. And they’re using that softly. They prove pretty conclusively from the evidence that it was a conspiracy. So the official position of the United States government is that JFK was a conspiracy. The real question is, why does Dan Rather go on? Why does Dan Rather go on TV and say, Hey, I can’t show you the Zapruder film, because it’s too gory. But you can clearly see that his head falls forward. Well, we all know now that we’ve seen it, that that’s a lie. Here’s my point. Not all conspiracy theories are bad. And I’m a little bit concerned the way you kind of, are you falling for part of the game that is in conspiracy theories, but only focusing on the silly ones, whether they’re silly ones directed at the group that you care about, or the silly ones, in general?\n\n[00:18:52] Scott Shay: So, I think that’s a great question. So the nomenclature that I use to describe what you’re talking about is a little different. I say there are two things. There’s conspiracy theories, which I use in a pejorative way. And then there are theories about conspiracies. So if you have a theory that there was a conspiracy, the way I would use the terms, like JFK, or that black men we’re in, were falsey vaccinated falsy treated in Tuskegee, then you have a theory about a conspiracy, and you should investigate it. You should try to investigate that you should investigate whether the CIA gave LSD to unwitting victims, because those are theories about conspiracy. So you’ve got a fact now you’re going to investigate it. It may not be that you can get all the evidence you need. It may be that it’s being hidden. But it’s a theory about a conspiracy. And you have to say I think based upon this, that this may have happened conspiracy theories such as Arthur Butz, or such as that as some academics Jasper Poor, others claim about Zionists about Jews is that there is a cabal that are doing all of these evil things with no proof. I mean, I’ve read whole books with no actual facts, other than maybe, some demographic table doesn’t foot that …\n\n[00:20:30] Alex Tsakiris: I’m with you on that. But you realize that a lot of people view their quote unquote, evidence as factual and important. So it’s kind of an eye of the beholder thing, I’m totally with you, it seems completely ridiculous to me, as does Flat Earth, but they hold conferences, they have, quote, unquote, scholarly discussion. So it’s not so easy. Is it to really make that distinction you’re talking about?\n\n[00:20:55] Scott Shay: No, but that’s what we were supposed to be thinking people. So one book that I indicate that it was written by Jessica Winegar and [unclear 20:04] the both full professors at universities. And it’s about they have this conspiracy theory that anthropology departments across the country are subject to compulsory Zionism, and that you can’t get promoted unless you subscribe to the compulsory Zionism. Okay. That is an allegation. Got it. Now, they’re going to write a book. Got it. Okay, that so far where everybody should be on the same page. They write this whole book that finds two instances of professors who didn’t get tenure, who had anti-Israel views, one of which ultimately got tenure, I believe, and don’t compare their scholarship to any other scholar, but assume that it’s because of their anti-Zionist views. Not mentioning as you wouldn’t a normal study. Any other professor didn’t get tenure and comparing that. I’m sure there were scores of people who didn’t get tenure and anthropology departments. And the question is evaluate their scholarship. But no, that wasn’t done it was just assume that was their anti-Zionism was the sole reason and be the rest of the book. It’s hard to exaggerate. They interview person after person who feels that this has happened, they feel that this has happened. And they go on for and talk about how evil it is that this is happening. And all of these Zionists are moles, and they use campus rabbis in quotation marks. But there’s no facts. The only fact in the whole book is that one person didn’t get tenure. And, okay. So they still may have and they could still say they have a theory about a conspiracy. I think they haven’t presented the slightest evidence, but okay, but to say that they proved it at the end of the book, and then anybody who disagrees with them, is not a good person. Doesn’t make any sense to me. And it’s not scholarship. It’s …\n\n[00:23:19] Alex Tsakiris: Agreed. But two points on that, Scott, first, Archie kind of punch in a little bit below your weight class. I mean, no one takes that the whole postmodern, humanitarian, academic, I mean, that’s like cliche now, it’s just so discredited. They have peer review papers that are machine generated that get but it’s like, no one, do we really need to punch down those people anymore? I guess that’s question one. And I’ll wrap question two right into it. Because I think it’s related because one of the concerns I have is the Kancil culture kind of thing is enabling the censorship of people. Like I don’t care how stupid those people are, and they’re obviously not very bright. I don’t want to see them removed from the public dialogue. I don’t want to see their YouTube channel taken down, which is happening so frequently now. I don’t want to see them out of Facebook, Twitter, let the conversation go on. I haven’t say what the whole hoaxers. I invite them on the show. I’m like, “Hey, maybe, I missed something.” It took me 30 seconds to refute your stuff, but maybe, have some other stuff. Come on. Isn’t that the kind of dialogue we want?\n\n[00:24:30] Scott Shay: So I have two points. I’ll answer the questions in order. First, sadly, what happens on campus no longer stays on campus. These theories are becoming much more ubiquitous. They are infiltrating in some areas into the investment world this whole BDS movement. Boycott this divest and sanction is a direct heir to what happened on campus BDS started in. Well, actually, and we can go off in this I want to answer your question, but BDS actually started on the far right. BDS has been around since they were painting black smears on Jewish shopkeepers [unclear 25:12] Lithuania, to tell people not to shop because this was a Jewish shopkeeper. And that was part of what prepared people for candover the Jews to say, they’re so evil. So, the first modern BDS was actually again, on the far right, William Luther Pierce, who was a neo Nazi, a famous American neo Nazi you set up I think the National Alliance Party tried to get McDonnell Douglas not to send, he sponsors to shoulder resolution not to have them resupply Israel. So BDS started on the right, but it was adopted on campus. And it’s being used today. And the general dialogue on, in other areas. Look at the New York Times. The New York Times, published an article in which there was an interview endorsing David Ickes book, which you probably heard of, [unclear 26:07] set you free. Well, this says that the Jews both started the Holocaust, that Hitler was a Nazi. I’m sorry, Hitler was Jewish. They both started the Holocaust and funded the Holocaust. I mean, it’s the most garbled thing that the Talmud is the most evil book in the world. And this is now out there in the New York Times reported on this uncritically because if you go to campus now, this criticism of Jews and only Jews in print is acceptable somehow. So I don’t go with your premise that what happens on campus stays on campus. And a lot of these folks also are big, true tweeters, and interviewers, and are part of that. Now, the tougher question that you ask, I think so I don’t think I’m punching down. Actually, I think I’m punching up and they probably are ignoring it. The bigger question is Kancil culture? And how do we deal with people who have strange ideas about certain things, but in other areas may be brilliant Kant, for example. I mean, we think of him as the founder of modern, reasoned morality. Well, he hated blacks. He was an amazing racist, Confucius, who we again, wise person, he was a Chinese supremacist. And the list goes on and on there, in Africa, I mean, there were several amazing poets who also were misogynist. So this goes on and on. You have in the modern day, Heidegger. He was a Nazi. We didn’t know it, for sure at the time, until his notebooks, so called Black notebooks are released. But he was a Nazi. Should we stop reading? His all of what he wrote, some of it was absolutely brilliant. I think we have to recognize that within some folks, both on the far right and the far left, that we can’t excuse their strange ideas. We can’t excuse them, but nor can we exercise them. So we have to look at them both. Watson, who co discovered DNA also has said racist things. But should we get rid of DNA research? Should we not take what he wrote? Of course not. That means it’s harder for us as thinking people to do this. But we shouldn’t cancel people.\n\n[00:28:41] Alex Tsakiris: So, I just interviewed a guy from Google, pretty high level guy mainly in the AI department. I mean, Google is manipulating and canceling demonetizing all that stuff. How do you come down on that? Don’t cancel anyone. There’s no such thing as hate speech? Everything is kind of okay. Where do you draw the line? We all have the line to draw. I draw it pretty much like free speech is foundational to this whole experiment we’re in so I’m very, very uncomfortable with the hidden demonetization they don’t even have any rules or guidelines, and they’ve done it for years and not told anyone and now they’re finally exposed. But I think that’s just very dangerous.\n\n[00:29:28] Yeah, I would say, the problem is today, the line is drawn very close to whatever that person organization happens to believe.\n\n[00:29:38] Alex Tsakiris: This is our modern press. Why do we accept that they can control censor and politicize their narrative?\n\n[00:29:46] Scott Shay: Look, generally I agree. I think free speech is the foundation of the civic society of the United States. And I’m in favor of free speech. Even when I totally disagree with it, I’m not in favor, I would not say to cancel Butz’ book, I think, rather, it has to be carefully read as I did, and recognize that it’s a pack of lies, but it’s out there and to try to squash it, I think is actually going to make it more attractive.\n\n[00:30:22] Alex Tsakiris: I agree. Let’s go to something a little bit harder. Because the other, I guess, concern I had with the book is that, when I think about anti-Zionist, or anti-Semitic, anti-Jewish, I’m not even sure that we can, that sometimes when you combine all those together, I’m a little bit uncomfortable. But you definitely at the beginning of this interview, spelled out kind of my point that, there’s all sorts of people of the, this is you, you know this, the Jewish tradition, who might not agree with you politically, might not agree with the politics of Israel, or even the Zionist agenda as it is, the religious state for the Jewish people, all sorts of different opinions out there of people that have a Jewish tradition, as well as other people like they have a voice in this too. But here are the anti, when I think Scott when I think of anti-Zionist conspiracy theories, I think of this, I’ll pop it up on the screen here and show you. I’ll read it so people can hear it. Ghislaine Maxwell and her pedophile lover Jeffrey Epstein, were both Israeli spies who took pictures of powerful men having sex with underage girls to blackmail them, their alleged Mossad handler has sensationally claimed. Now, I would just add that, that alleged Mossad handler kind of stands up to scrutiny pretty well, he was tried in court, and was actually acquitted, because he showed that he was an agent of Israel and his arms dealing, I’m not here to hammer out, to flesh out what, but there’s some factual evidence here, Maxwell’s father is [unclear 32:01], he gets a state funeral in, in Israel, where the several Prime Ministers are there, and all the top intelligence guys are there. So there’s fact behind this. This is the kind of stuff that when I think of anti-Zionist, and I wouldn’t go so far as to say that with this, but that, to me, is what we need to talk about not some wacky Professor with the whole hoax idea?\n\n[00:32:29] Scott Shay: Well, look, first of all, I’d like to say this, with the anti-Zionists say is something separate. I mean, there. By the way, I have no idea if that’s right, wrong or indifferent. I’ve never heard that or seen that before you put it up on the screen. So, I don’t express any opinion. But I will say this. The United States has done despicable things. A lot of countries do despicable things. A recently, Iran massacred 1500 protesters, not so nice to kill 1500 Iranian citizens. Nobody says, “Let’s abolish Iran.” I haven’t heard people say, from border to border, let’s exterminate or expel all Iranians and end their state. That is what the anti-Zionist say. Hamas says that openly. BDS says openly the founder says, “No Jewish state. Period!” So there’s a difference. And this is what I was starting, that what I sort of I was hinting out a little bit. You can have harsh criticism; you can say you want to vote this government out. You can say a lot of things. But that’s very different than saying and what the anti-Zionists are doing. We’re just saying that the Jews don’t have a right to self-determination. You could say, CIA is bad. You can say, a lot of spy organizations are bad. I get I’m not a pining on that. But the criticism of Israel is different by an order of magnitude from criticisms of every other country on this earth.\n\n[00:34:13] Alex Tsakiris: I get that. And I think your book does an excellent job of bringing that into focus, and reminding us that that’s still out there. And it’s not something we can just kind of blow past. I do wonder, and I’m going to throw one more out there, which is another kind of, I guess, fuel for the extreme anti-Zionist conspiracies that you’re talking about, is the more serious kind of anti-Zionist conspiracies that we would need to kind of consider or throw on the table. So I’m gonna throw one up another one. And, again, I’m doing nothing other than reading a mainstream newspaper. This one’s in Scotland.\n\n[00:34:55] Scott Shay: This has been debunked. Look, I know that, you know this one actually makes me angry because there’s so many Jews who were murdered in that tower. I mean, I find this reprehensible and there were supposedly photos of people dancing who were Muslims around a mosque. Everybody’s got their own friggin conspiracy theory about this. This is actually I mean, it’s anybody can write anything about anything.\n\n[00:35:24] Alex Tsakiris: Let me just make sure we’re talking about the same thing because there’s a lot of conspiracy theories around 911 that tie into Israeli Mossad. This one again, maybe, you have data to the contrary, and that’s okay. I just want to make sure that people know what we’re talking about. Here is again, from the Herald Scotland, longest standing newspaper in Scotland. There was ruin and terror in Manhattan. But over on the Hudson River in New Jersey, a handful of men were dancing, as the World Trade Center burned and crumbled. Five men celebrated and filmed the worst trust atrocity ever committed on American soil, as it played out before their eyes. They were Israelis, and at least two of them were Israeli intelligence agents working for Mossad. So I’ve looked, once\n\n[00:36:15] Scott Shay: You know what, again, just this is made up. This concept and I really find this, frankly, repugnant, because there are again, also photos if you want to go to Jersey City, there are photos of supposedly Muslims dancing and handing out candy and beeping horns, this is not sourced. And it …\n\n[00:36:36] Alex Tsakiris: Well it is sourced. They hit there’s FBI documents on the arrests that were released in the FOIA. And these guys were sent back to Israel, two months after without any investigation, they appeared on Israeli TV, but I don’t want to get into hashing out those details. But I’m telling you, Scott, I’m not coming at this. At some wild wacky, kind of conspiracy nut thing, anyone who goes investigated, there’s plenty of evidence, who knows how …\n\n[00:37:05] Scott Shay: Alleging that the 19 hijackers, from Saudi Arabia and elsewhere, didn’t plot this with ISIS to destroy the World Trade Centers and effectively declare war in the United States? [unclear 37:19] Zionist plot? I mean, …\n\n[00:37:22] Alex Tsakiris: I’m definitely not saying that it’s a Zionist plot. And the way I’m trying to bring it back into focus with your book, again, Conspiracy U, is that I think we have to look at the role of conspiracy theories are playing in our culture, in both a positive and a negative way. So, I don’t think we’re too far apart on this. And I think there’s going to be conspiracy theories that are going to gaslight, all of us. And I think we have to find a way to, I guess, embrace them in the same way that you’re exposing a couple of very important, you’ve convinced me in the book, and in this interview, very important conspiracy theories in academia. I’m just saying, I think we have to have a different attitude about conspiracy theories that I didn’t exactly get from your book, even though I think it was very convincing about some of the ones that you met. So that’s my point. And I definitely, I’m open to your feedback on that.\n\n[00:38:30] Scott Shay: Well, again, I think you can have theories about conspiracies, I’m not using the Warren or the CIA language, you’re gonna have theories about conspiracies, and then you have to evaluate them. There was a ton of research done the 911 Commission and others, both what’s been classified and declassified, and even more has been declassified during the Biden administration. And it’s pretty clear what happened. But I’m, I’m, again, I but the thing that concerns me is that anytime something bad happens in the United States or elsewhere, there is a reflex to somehow blame it on the Jews. Climate change now is being blamed on Jewish oppression of Gaza. Doesn’t matter that they’re, you know, smokestacks in China or elsewhere. With burning coal that’s somehow blamed on the Jews, George Floyd 300 universities organizations said, this is somehow designers Jews fault I mean, there’s an impulse that when something bad happens. Now knowing people that died in that tower, I have to say, I can’t hold back an emotional reaction. Knowing Jews who died in that tower I just can’t go back an emotional reaction to seeing that what you put up I’m sorry by sounded a little loud but it definitely hits a raw nerve because they were involved Jews, and they were good people and they were murdered. And so that’s tough for me.\n\n[00:40:13] Alex Tsakiris: Totally, I totally get that. I tell you what, in the time that’s left, tell folks about some of your other books and your work in general. Because in the reason I want you to do that, and we can’t possibly get to that in this interview. I think it starts to get back to the root core of this, which is spirituality, which is atheism. I think atheism is the root cause of what you see in academia. If we’re able to advance without criticism, this idea that we’re meaningless biological robots in a meaningless universe, I think it is the first conspiracy that opens up this door and I’m not a religious person. But I think that you’re onto something when you’re putting your finger on it in those other books. So tell us about that as we wrap this up.\n\n[00:40:59] Scott Shay: So thank you. First of all, my previous book, this is my third book, Conspiracy U, A Case Study, but my previous book In Good Faith, talked about spirituality was In Good Faith, questioning religion and atheism. And I will give you the punchline, since we don’t have a lot of time. The one thing that I came that is the common core, and that is what I think the most basic moral value is the golden rule, expressed negatively the way Hillel did. “Don’t do unto someone else, what would be hateful, if it were done to you.” In other words, don’t treat anybody else the way you wouldn’t want to be treated. Don’t think about it groups, don’t think about identities. Think about that individual person, because we all share and Hillel’s view, a common spark of the divine or you’re an atheist, a common spark of humanity. And my whole book, the whole In Good Faith is about finding the common ground between religion and between ethical atheism. And what I find is the biggest problem is and this ties into what we’re talking about. The biggest problem is most people who claim to be atheist aren’t atheist, some are but some are, and what they really aren’t too many religious quote unquote, religious people, they’re really idolaters. And here’s the problem. We talk about idolatry, like it’s some quaint bowing down to idols. But in reality, if your listeners Just remember one thing from this interview, I hope they remember the following. Idolatry is actually a set about lies, is a set of lies about power. It’s about ascribing super authority, or super powers, or some mysterious forces, to finite beings like ideologies, beings like [unclear 42:55] or ideologies, like communism and other-isms. And so we may have thought we licked idolatry 30 years ago, and but in reality, Hitler’s, Stalin, the Assad family, the Kim family, and I can go on and on, use the same tropes of ancient FIRO power pageantry, myth theater, all backed up with secret army secret informers, and strong police and armies. And it said both the macro level and the micro level. At the micro level, I think idolatry explains how people like Charlie Rose and Harvey Weinstein and Matt Lauer got away with what they got away with because they were considered idols. They had super authority in their arenas. So they were unquestioned and unquestionable until there was enough weight of evidence against them. And that, too, could be called in a sense conspiracy theories. I mean, we could get that would be a whole another broadcast how they got away with what they got away with. So I really am passionate about that. And so I’m really passionate. My writing In Good Faith was a five-year project for me. And I think it’s gonna, I really do think it’s an important book.\n\n[00:44:15] Alex Tsakiris: Fantastic. Our guest again, has been Scott Shay the book, you’re going to want to check out the latest one, Conspiracy U, A Case Study. But that other one sounds like a perfect Skeptiko pairing with that. Scott, it’s been terrific having on the show. Thank you so much for joining me.\n\n[00:44:32] Scott Shay: Alex. It’s really been a pleasure. Thank you.\n\n[00:44:34] Alex Tsakiris: Thanks again to Scott Shay for joining me today on Skeptiko. The one question I tee up from this interview is kind of the big one. What do you make of anti-Zionist conspiracy theories? Scott makes a really strong case about a couple of them that weren’t on my radar that we might want to pay attention to. On the other hand, there’s a couple that don’t seem to pop up on his radar. So what are your thoughts about that? Let me know. Join me over on Skeptiko forum, which I would really invite you to join me on the Skeptiko forum, particularly, if you want to have a next level dialogue. It’s not a place just for venting, you have to have some thinking behind your opinion, maybe some references, links, that kind of stuff. But that’s all in the spirit that I talked about at the beginning of let’s grow this community. And let’s grow it the way we want with people who want to engage in intelligent dialogues, tough dialogues, but intelligent dialogue. So, I will leave you with a reminder of that. If you can help me out in that way. I would greatly appreciate it. That’s gonna do it for this interview. I have several more coming up. I don’t know how many more but I have more. Until next time, take care and bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scott Shay, Conspiracy Theories in Academia |525| - Skeptiko - Science at the Tipping Point", "description": "Scott Shay is a business leader worried about the intellectual corruption of academia. Subscribe:   Click here for Scott Shay’s website Click here for forum Discussion   skeptiko-525-scott-shay [00:00:00] Movie Clip: My deepest I was about to go when the camps together through all that just to be shot in the living room by Verba. […]", "url": "https://skeptiko.com/scott-shay-conspiracy-theories-in-academia-525/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2021-11-02T14:59:14+00:00", "article:modified_time": "2021-11-02T15:47:55+00:00", "image": "https://skeptiko.com/wp-content/uploads/2021/10/skeptiko-525-scott-shay.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Scott Shay, Conspiracy Theories in Academia |525|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/69JV5jzJuFI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/69JV5jzJuFI?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-525-scott-shay.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-525-scott-shay.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-525-scott-shay.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "https://www.skeptiko-forum.com/threads/scott-shay-conspiracy-theories-in-academia-525.4773/", "https://www.scottshay.com/", "https://www.skeptiko-forum.com/threads/scott-shay-conspiracy-theories-in-academia-525.4773/", "https://www.skeptiko-forum.com/threads/riz-virk-computer-science-eats-science-524.4772/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2021-11-02T14:59:14+00:00"}