{"result_id": "273037", "URL": "https://skeptiko.com/bruce-de-torres-911-jfk-511/", "timestamp": "2023-04-25 17:09:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/bruce-de-torres-911-jfk-511/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Bruce de Torres, 9/11, JFK, Covid Are We Part of the Show? |511|", "cleaned_text": "Bruce de Torres has used to acting skills as a lens for reexamining our history.\n\nAudio Clip: [00:00:00] Where the hell are you? Are you in that building?\n\n[00:00:03] We’re still in the north tower.\n\n[00:00:08] We got an inferno on the north tower on [inaudible 0:00:11]\n\n[00:00:11] Cannot take the elevators they are down.\n\nAlex Tsakiris: [00:00:13] That’s Charlie Sheen and Whoopi Goldberg from one of the biggest bombs of the movie year 2017. That being the movie 911. And of course, it was a disaster because as you’ll learn in today’s interview with the very excellent Bruce de Torres, we all already know what happened with 9/11. What’s really interesting is how we continue to process what we know.\n\nAlex Tsakiris: I mean, feeding the beast on a personal level, on a I know enough about 9/11. I got it, it was an inside job. I know enough about JFK. I got it. It was an inside job. Why do I need to personally feed the beast? Don’t I need to, as you’re talking about be with people, [and] just really be present on stage because we’re all on stage.\n\nBruce De Torres: [00:01:06] Yes. And we are the show and we are the audience. And if we are here, because we intended to be, because we are the manifestation of our own intention to exist. I like to think that we have 100% power because we have 100% responsibility for what things are to us. And then we’ve got a level of responsibility for what we actually cause and create. We have to parent ourselves. We have to pretend that we were raised by perfect parents. A mother who loved and reassured us and comforted us when we fell down, [and] scraped our knee. “There, there, you’re not alone,” rock and hold and, “You’re going to be okay.” And we have to pretend we had a perfect father, who I say his job is to fire us up [and] to say, “You can do it, come on. We got a lot to do today. We got a lot of wood to chop. We have a lot animal to catch. We’re going to make mistakes. We’re going to lose the tools. We’re going to break a bone. You might lose a tooth, and we’re going to clean ourselves up, we’re going to have a big meal, we get to go to bed exhausted. And we get to do it all over again tomorrow. Come on.”\n\nAlex Tsakiris: [00:02:24] And all that leads back to the reoccurring question of this show over the last couple years, what’s this evil thing all about? Let’s say we took the rich and powerful and we put them on a bell curve of evilness. They’d fit, they’d fit, they wouldn’t all be on one side of that curve of, “Oh, you’re rich and powerful, therefore you’re evil.\n\nBruce De Torres: [00:02:49] It’s quite liberating to imagine. The quote unquote rich and powerful, the elite of the elite, the 1% of the 1%, who have their hands on the levers of control, fit into the bell curve, that at one fringe, there are supremely psychopathic and evil, tyrannical tyrants. And at the other hand, are folks who would be saint like and benevolent to us, right? And the vast majority in the middle, just muddle through. And whoever is in charge today, they’ll be evil, if evils in charge, they just don’t care. They’re just going waddle through. Because if you have a belly full of food, we’ve never had this in our evolutionary history until the last 150 years, a belly full of food, and decent shelter. Turn that TV on. I don’t want to think. What’s there to think about? How can I improve this?\n\nAlex Tsakiris: [00:03:42] I really, really enjoyed the chance to have this dialogue with Bruce de Torres. Hope you enjoy it too. Welcome to Skeptiko, where we explore controversial science and spirituality, with leading researchers, thinkers, and their critics. I’m your host, Alex Tsakiris. And today, we welcome Bruce de Torres to Skeptiko. And he’s here to talk about an interesting book we were just chatting just a second ago about and I’m very, very grateful that he reached out to me about this book, because it’s such a Skeptiko kind of book in so many ways. It’s titled God, school 9/11 and JFK, the lies that are killing us in the truth that sets us free. Bruce, welcome to Skeptiko Thanks for joining me.\n\nBruce De Torres: [00:04:31] My pleasure. Thanks for having me, Alex.\n\nAlex Tsakiris: [00:04:34] So let’s start with kind of the classic kind of thing. Tell folks a little bit about yourself. You have an interesting background, especially in terms of a lot of people I’ve spoken to on Skeptiko, you’re more of a Fine Arts guy, acting, musicals, directing, and that kind of stuff. And yet you’re kind of entering this world that it intersects with some of the stuff that I’ve done. So tell us about that. Tell us who you are.\n\nBruce De Torres: [00:05:05] Well, sure. And thanks. I was an actor into my 30’s. It’s all I had wanted to do. And I also was a lifelong reader. I fell in love with reading way back in the first grade. So those were kind of the perfect storm for some things that happened in my 30’s. Basically, as I practiced acting, it refined itself into the specific point of paying all my attention on my scene partner. Specifically, I was coached, let my performance come out of me in response to what my scene partner was doing right there in the present moment. And it transformed that night on stage, what that experience was, Alex. So to kind of fast forward the answer…\n\nAlex Tsakiris: [00:05:58] Can I interject something? Don’t fast forward. I thought that was a very interesting part. It was the kind of… Because we’ve heard about this, those of us who have not been in acting, we’ve heard about this kind of transcendental nature, particularly as it relates to being in the moment which kind of connects with all these other spiritual traditions. And you are talking about experiencing that in a very real way. And I don’t want to just blow past it like, “Well, you know and other actors.” No man it was significant to you. It was significant to a lot of other people in your field. Talk about that a little bit.\n\nBruce De Torres: [00:06:38] Okay. It was astounding. The way I say it in my book is I paid attention to my scene partners that night like my life depended on it. And this is probably the exact language because I worked hard on the language. I’ve refined it. I followed their speeds and volumes, [unclear 0:07:02] rising and falling and accelerating and slowing down everything I did, according to what I was getting and working off of them. And I said my lines as my breathing at those moments just happened to produce them. And the audience exploded with laughter and in a nutshell, and I’ll spell it out precisely, for the first time on stage, I wasn’t thinking at all about giving a performance. I was focused on watching and seeing their performances. I wanted to see. I didn’t want to miss a thing they did. So I paid attention, like my life was at stake. I had never been so interested on stage before. And I’ll say it made… I’d never been so interesting on stage before Alex, because I got back to New York, we were doing that in Pennsylvania that play, and it seemed like I got cast and everything I auditioned for because it eradicated any self-consciousness and eradicated most of the fear. There were always some nerves before an audition. But as I remember to pay attention and see exactly how my quote unquote scene partner, what they’re doing, how they’re listening, to never lose them and never let them lose me. I had the kind of – oceanic is the word some folks have used, experience of the melding and the merging and the sharing and the bonding. And, I’ve since read so much about reality and philosophy and mysticism to know that I become one with what I… So that was amazing. But I was unprepared and you noticed from the book, I started paying attention to people in real life the way I did on stage and I realized I had so many habits. I call them, well others call them too rackets and habits of competition and immaturity Alex that just devastated me, and I had to bring my whole life to a halt to reevaluate. “Oh, my gosh,” and it was a horrible moment yet it was the best thing that had ever happened to me because it made me surrender kind of like an alcoholic who finally goes to AA. All my tricks don’t work anymore. I want to start from scratch and it all began just with paying attention and then doing a lot of journaling, a lot of the soul searching, and a lot of the real work that humans have to do to figure out who am I. What do I want? Why am I here? And I decided to stick around because it was a real existential crisis. I really hated myself. I hated the way I treated people. I hated how immature it was. I couldn’t believe how immature I was in my 30’s. It was so unacceptable. It was so unacceptable. But I decided to stick around as I thought, just to see what would happen next. And then I read a book that had an idea about energy. It was Thinking Grow Rich of all things, by Napoleon Hill, which talks about thoughts, I think.\n\nAlex Tsakiris: [00:10:29] A spiritual book in so many ways. Yeah.\n\nBruce De Torres: [00:10:32] Many ways, right? Many, many ways. And shall I continue with the narrative, or…\n\nAlex Tsakiris: [00:10:41] Sure, or we could actually leap right from there, into the book in a way because your book God School, 9/11, and JFK, is in a lot of ways, kind of this spiritual deep dive as well. I mean, it’s a history book. One of the chapters of the book is a brief history of the United States. That could also be the title of the book, a brief history of the United States. But instead you sandwich it between two things. You sandwich it between a very big picture, universe, unity consciousness, we’re all love, and the end of the book that says, I talked about all this stuff, but in the end, it’s all about love, it’s all about human consciousness. So we have these two kind of bookends that does kind of leave this big question. And I think this is one of the fundamental questions and one of the level three questions that I like to talk about. Because I was just mentioning, this book, people check it out, because it’s great. It has a certain, almost lyrical quality to it. The way you bounce from one topic to another in just one sentence after another is just a bombshell if you haven’t heard this stuff. Alexander Hamilton has the same pyramid that you see on the dollar bill on his grave, and you’re like, “Whoa, I didn’t know. What does that mean? Is that really true?” So but then you just move on to the next thing without really belaboring it. But I have to say, as I said, when we were chatting for just a second, this book is also an invitation to this deeper conversation. But I call these level three conversations, which you were just alluding to, which is, what then does this all mean? So I want to keep bouncing back and forth between the stuff. JFK, 911. Yeah. JFK 60 years ago, 9/11 20 freakin years ago, this is history. There’s so many people… My kids, they relate to this in the same way that you and I relate to the history that we heard from parents and grandparents and we are like, “[unclear 0:12;57]”. So do you know what I mean? I mean, this is really, I think our challenge in this interview, and in a larger sense, in this ongoing dialogue, is like, how do we relate to this history? Because I think that’s what your book, in a way essentially is about. It’s like, here’s the history as messed up as it is. And then how do we relate to it? What do you think about that? Is that a good way to…? Can we frame it up this way? Or is that kind of…?\n\nBruce De Torres: [00:13:29] Oh, I think you nailed it. And in fact, I worked on it for years and years, Alex. And there were many, many times where I thought, “Oh, this is good stuff. Oh, there’s going to be a handful of people who get it exactly the way I think I’m saying it.” And Alex, you’re reflecting back to me some of the greatest fondest hopes I had for what this book could be to some people. So the angels are singing right now for me because you write such a thing all alone for years and years and years and you wrestle with paragraphs and sentences. Should it be this? Should it be that? Have I said too much? Am I saying too little? So for you to have said all that, Alex, okay so yeah, I am right on board in how you framed what the book is and what I’m trying to say. And I tried to stay on point, which is the truth sets us free. It’s good to know the truth of all the stuff that’s in the book. Pulling back right to your question. Originally, all I was going to write was a book about my thoughts about what energy and consciousness is because I was excited about that. That’s what I set out to write. I should recount that, I think just for those who are listening, what the idea that I got about energy that I thought was unique, was if energy burst into existence 14 billion years ago to become this universe and everything in it. That’s a theory. I thought… Oh and what like Napoleon Hill said, “Thoughts become things because they’re made out of energy.” Okay.\n\nAlex Tsakiris: [00:15:19] I thought [unclear 0:15:20] said that. I’m just kidding because it’s [unclear 0:15:23]. Sure. Go ahead.\n\nBruce De Torres: [00:15:25] Yeah. Right. Right. Well, I’m just following the narrative of the inspiration for what I was writing. But yes, it’s everywhere. And that’s thrilling, because it’s corroborative, you know? But I thought, Okay. Why did if energy did that burst into existence become to become You, me and everything, why? And I had the simple thought, because it wanted to, is energy, the intention to exist. So, now pretend I’m jumping up and down and yelling at the top of my lungs, the way that that blew my mind. Because it explained to me how all the soul searching I had just done, why do I think what I do? Why do I have these habits? I recognized. Any way I want to look at it. Any questions I want to ask myself, those answers will come rushing, almost attracted. Law of attraction, whatever. Whatever I want to look for. However, I want to see things. That’s how I can see it. And dare we hope that is we cherish the thought and give it lots of love and energy and attention and gratitude and live as if it’s already real. Do we start seeing those things in our real lives? I’ll say yes, that’s my testimony. That’s my personal experience. So I got excited about these ideas that this is a completely spiritual realm. To see our Creator everywhere. If the intention to exist as our Creator, because it came into existence to be you and me. To see our Creator everywhere makes this Heaven. And I explore all this in a number of pages in the book. Whether we are the one eternal thing that existed, and when you’re eternal, the only thing you don’t have is perhaps someone to talk to. So it the one and only is appearing to itself [and] ourself, as Alex talking to Bruce as Bruce talking to you. And well, that’s how I felt on stage. And I bonded connected to the people I paid attention to as if they’re worth paying attention to. That’s what I discovered on stage. Bruce, why don’t you pay attention to people as if they’re worth paying attention to. And then I felt loved. And then I’ve dealt with the folks in my real life, and had to just retool my whole life, to orient myself toward feeling safe, [and] feeling everything is okay. I’m unharmable. Things are lovable because I say they are. The things become lovable when I decide to love them. And I go on and on, I explore that in a lot of ways in the book. Oh, and Alex, back to your very good observation about those sentences, in my book, I wanted… I used to love going into bookstores, discovering a book I’d never imagined before and not being able to put it down because it was so compelling. That’s the quality I wanted in my writing is that if you are lucky enough to pick up my book in a bookstore or anywhere, I wanted to grab your eyeballs and pull you. They are irresistible rungs of a ladder that you just have to keep going through, going through, [and] going through. And also reading so much about all of my topics. I didn’t want to say anything; I didn’t have to. That’s already well covered in those other books, all my sources, and those are in the back of my book. There’s 46 pages of sources in the back of my book. So like you observed, I say something in a sentence really elaborate [and] I go to the next development I want to kind of talk about. And I did intend it to be a great Handbook, to someone who’s skeptical about so called conspiracy theories, or what’s real and what’s fake, or what’s the true history of some things. I wanted my book to be a very valuable tool for that purpose, for a newbie, so to speak.\n\nAlex Tsakiris: [00:19:19] Okay, so great. And it accomplishes that goal in a lot of ways. But then this is where we’re going to have the level three kind of conversation, because as soon as you venture into the historian role, a brief history of the United States kind of thing, it’s tough. And I’d go from the super big way that it’s tough. And that is, are we feeding the beast? Because part of this is this desire, we have to know and to know and to know. And there’s a spiritual side of that that we’ve talked already so much about because look, let me digress, which is maybe I do too much. But this is not a spiritual book, per se. The majority of the book by quantity is something that people who are comfortable with exploring para-political conspiratorial ideas would be super comfortable with. It’s just a ton of information. Like you said, I love the sources, because you really do kind of this extended Bibliography that almost reads like an extended table of contents, somebody can jump to the sources and just read it and you can learn a lot. And then you can also say, I want to jump to this point, [and] that point. That is the body of the book. But given that that’s the body of the book, here’s the feed the beast issue. It’s like, if none of that’s… If the ultimate end message is unity consciousness, is spirituality, [and] is connection, I don’t want to focus so much on that. Are we feeding the beast? Are we staring into the abyss? And why would we want to do that? And I realize we’re jumping way ahead. But let’s do that. Because we don’t want to just talk about 9/11 in school and JFK.\n\nBruce De Torres: [00:21:08] You’ve just framed the single purpose or intention that I imagined for the book, which is, I was writing this book about energy and consciousness and spiritual nature of reality, etc. And then discovered 9/11 was an inside job, obsessed about that, and the energy book was in a drawer. I had written what I wanted to write about. It was about 39, or 41 pages, Alex.\n\nBruce De Torres: [00:21:42] And then I got obsessed about, quote, unquote, truth of the world’s events. For 10 years, I studied all that stuff, never thinking that I was going to put it in a book or put it in my book. And in 2014, I got the idea that those are problems solved by the truth. The truth of their nature, as opposed to the official stories that are lies, that are used to manipulate and exploit us and do a lot of damage and cause a lot of harm, and also the truth of our nature. Because the beast is slain, when we recognize it’s just like in the movie The Matrix, there is no beast, or if there’s a beast, we am it. So it’s our perception, etc. We can get very practical. We can explore practicality. How do you live? This is the conundrum of good and evil. If there’s a good God in the universe, why does he let bad things happen to good people. This is level three. And as adults, as a man my age, recognizing, I’m a general right now in a tribal arc of youth to warrior to general or manager. We’re not chiefs, yet, you and I. They say very little, and we go to them, when we really can’t solve anything, but they’re watching us. They’ve got no teeth. They’re very weak. They’re watching how you and I manage affairs, because we’re at the managerial level for life for the tribe to take care of the first thing is our own soul, [and] our own peace. I’m very inspired. There’s nothing. There’s not a lot about it in the book, maybe next to nothing, very inspired by the Native American traditions, their relationship to spirit, [and] what they felt reality was. And to summon men to live in that space, to allow for sacred space, to perform rituals that, free us from the ego, [and] to dance in a frenzy at night around a fire in order to kick up our heels and forget our troubles. Because we’ve got to tell ourselves, we can handle the truth because at the objective material, day to day level, there’s really, really frightening and horrible and mean and painful suffering that’s happening out there. And the level three question is, what good are these airy fairy ideas day to day, Bruce when I’m trying to make a living and my wife and I are arguing and we don’t have enough money for this or any other thing? And is this real or not? Should I get this injection? Should I not? Yeah. And I’m convinced. And this is not easy, because we’re all just humans and we all have runaway minds and fears, until we decide to work with them. We have runaway minds and fears until we decide to work on that. Why? What am I afraid of and why? Or we dive into alcohol drugs and mindless distractions and those addictions. One way or the other, we’re going to either anesthetize ourselves, or we’re going to take some deep breaths and we’re going to try to cultivate and feel what’s real. And what I say in the book, maybe toward the end or somewhere, is listen, we got to get alone, we’ve got to cultivate a peaceful mind and open heart, and feel what’s real. If we can quiet the mind – I don’t think anyone says we can ever stop thoughts completely. But if we can quiet them enough, we can feel what’s real. And paying attention is the tactic to experience, see, and feel what’s real. I’m claiming it’s love. And when we look in the eyes of someone else who wants to look in our eyes, what we see is the exact same consciousness. We see and feel ourself, because I claim at that level where only love is real, and everything is love, or everything is energy. Love and energy, are just words for what is, it’s a unity. It’s us, so when we look in each other’s eyes, with someone that we love, and we care about, we see love. We see ourselves. It’s a reflection of consciousness. Those are reasons to be cheerful. Now, how does anyone apply that? That’s very individual, what’s yours? What does that all mean to you Alex? I that’s kind of what it means to me. What does all that mean to you?\n\nAlex Tsakiris: [00:26:21] Well, I guess one of the things I was driving towards, because I honestly struggle with this both personally, and I see the struggle within this community that I’ve kind of stumbled into because I didn’t start with the conspiratorial community. I didn’t really start with a conspiratorial bent. I didn’t know any of that stuff when I started Skeptiko. And I really started from kind of a scientific angle just because the biological robot meaningless universe thing seemed like bullshit, and I want to prove it. And that’s what led me to the conspiracy. But JFK was really interesting. It wasn’t really my time, but looking into it, just a fantastic story. What the fuck else do I need to know about JFK? I find it infinitely interesting. I love it. I’m always digging into new information. But to me, it’s like reading comic books. I don’t pretend that that is going to inform my spiritual understanding. And I do worry about queuing up another podcast on JFK because I look at myself and I say, am I feeding the beast? Am I feeding somehow my desire to know something, to know something that somebody else doesn’t know? Because I’m there. I am there with that energy. I’m not denying it. It’s fed me for a long time. But I see the… If we’re going to have this level three discussion. I also see the other part of that, it says, “Why do I want to feel superior to someone else because I know something?” And at the same time, I can’t resist that urge. Because when I see people are so fucking stupid, because they don’t know something, I’m like, why are you allowing that willful ignorance to dominate your life and to make your decisions and you’re wearing the mask, and you’re all alone in the car. And how are you even functioning? But you know what? They are functioning. I just had… So let me pause there. Because now you know what I mean about feeding the beast. I mean, feeding the beast, on a personal level, on a I know enough about 9/11. I got it. It was an inside job. I know enough about JFK, I got it. It was an inside job. Why do I need to personally feed the beast? Don’t I need to, as you’re talking about, be with people. Just really be present on stage because we’re all on stage.\n\nBruce De Torres: [00:28:57] Yes. And we are the show and we are the audience. And if we are here because we intended to be because we are the manifestation of our own intention to exist. I like to think that we have 100% power because we have 100% responsibility for what things are to us. And then we’ve got a level of responsibility for what we actually cause and create. So two great handles that I hold on to that really, really worked for me, this is the best thing about ideas. It’s like they fire me up. They don’t have to be true. They fire me up and I choose to pursue being fired up, is we have to parent ourselves. We have to pretend that we were raised by perfect parents. A mother who loved and reassured us and comforted us when we fell down, scraped our knee. “There, there, you are you’re not alone.” Rock and hold, and, “You’re going to be okay.” We have to love ourselves like that. And we have to pretend we had a perfect father, who I say his job is to fire us up, [and] to say, “You can do it. Come on, we got a lot to do today. We got a lot of wood to chop. We have a lot animal to catch. We’re going to make mistakes. We’re going to lose the tools. We’re going to break a bone. You might lose a tooth, and we’re going to clean ourselves up. We’re going to have a big meal. We get to go to bed exhausted, and we get to do it all over again tomorrow. Come on.” To encourage. Some mother’s love. “There, we’re safe. Alex, we’re safe. We’re safe.” Especially if death is just the transition to experiencing our real self, our transcendent self. We never really could be harmed. We were always okay for eternity, and then to fire ourselves up. So when I’m alone and freaked out and wondering, why do this? why do that? Am I going to have enough for retirement? All classic, real, beastly, [and] scary thoughts I can get for myself. I practiced, practiced, [and] practiced, writing, and rehearsing and remembering and writing and rehearsing and remembering these ways of looking at it to just to summon, like a Native American. Thank you, all the fathers and all the mothers and all the grandmothers and the grandfathers who are here, right now. Show me what I need to see. Give me what I need to know. Let me serve. Let me help. Let me serve. Because everything’s got to flow. We can’t hold on to anything. Not a fear, not even an obsession. It’s all got to flow. It comes through us so we can give it. And as much as we can shape it toward being good parenting, as I think of you, as a human who needs the great love of a mother and the great encouragement of a father and choose to talk to you like that, I’m feeling it. And it becomes that self-fulfilling thing, [and that self-experiencing thing. And it’s my fantasy that this is what people need, because I need it so bad. That it works so well for me, that I… And as I’ve been unfolding the book in the last couple of months, things are kind of happening without a lot of effort. I follow through. I’m a professional, I know what I want. But I seem to be kind of in a zone that I belong in. And that’s me trying to talk all around these issues right now.\n\nAlex Tsakiris: [00:32:48] No, that is beautiful. Very, very, very beautiful. Okay, so Bruce, let me pull you back though. The truth. Do we risk becoming obsessed with the truth? Just like we can become obsessed with anything. I keep hammering on the same question. I’m going to hammer it from a different way. Is that when we really look at the motivations, at least what we suspect to be the motivations behind these evil doers. Which I love that phrase, right? Evil doers for history lesson. Who said evil doers?\n\nAlex Tsakiris: [00:33:26] That’s right, baby. [Crosstalk 0:33;37]. Evil doers. Because he was the ultimate evil doer, wasn’t he? I mean, if you really look into him, his dad was an evil doer, but he really stepped up the game in terms of evildoers. And those are really a lot of times that people have talked about evildoers. But if we look at the motivations behind these people, part of it… You look at that evil doer and part of it is like the whole Skull and Bones thing. And it’s like, I can’t tell you because it’s a sacred, isn’t it? And it’s like, not just, you can’t handle the truth, which is one thing we get, but the other vibe we get is you don’t deserve the truth. I’ve left you the fucking clues, because they left clues all over the place, right? 9/11 is a ritualistic kind of event of symbology. The clues are all over the place. JFK, the clues are all over the place. They are begging you. They’re begging you, Bruce, not the normies, they’re begging you Bruce, to crack the code. And I kind of think part of that is they want to suck you into that. Now, I know something. Now I’m better than someone else. Now, I’m an insider kind of thing. Because that’s their ultimate gain, is this lack of connection. This I am better. I am different. I am elite.\n\nBruce De Torres: [00:34:55] Yes. And that is what gets triggered in you, obviously. And it’s a very valid and understandable and reasonable thing. And what it triggers in someone else complete maybe fear and overwhelm, horror, [or] terror. Maybe all that information could just drive someone straight into alcoholism, despair and even suicide. On a fast track, almost relatively. In the course of a couple of years, I could easily see someone just… Because the more you look at it, the more confirmation you get. Yeah, that’s how my book would do a fair job of convincing and make the case that we live in opposite land. Everything we’re given us is nonsense, and baloney. And it’s by folks who want to do nothing but enslave, exploit, sicken, and remove a lot of us. Okay, how do we be cheerful in the face of that? There’s no one easy answer of it except to challenge each other. What are you going to make out of it? What are you going to make out of whatever new thing you hear today? Whatever new thing you hear about JFK, or if you’re that, someone who just discovers… someone who gets my book and who… until my book, they believe the official story about all these things, and they go, “This is persuasive, holy stink.” Right? Then they look at some of the sources because no one should ever believe just one book, you read about something. And then it’s literally like finding out there’s no Santa Claus. It’s really, really, really, really upsetting. It’s a huge. It’s a huge trauma. And they did leave all those clues. Now I’m just bouncing all over the place. They did…\n\nAlex Tsakiris: [00:36:45] You’re right on the beam, Bruce. You are right on the beam. And I want you to… I love the point that you made. And maybe it is kind of a repeat of something you said earlier. But what you do with this, we can see it around us. And we can see people who take this information. And you can kind of say for no fault of their own. They’re either set up for this through traumas that they’ve experienced in the past or whatever, but it is so overpowering for them that it really leads to kind of this destruction of their life. And we’ve seen that and I love what you’re doing because your comment saying despite that we have to walk into the fire. We can’t… Because there’s no looking forward. There’s no turning back. And we cannot turn back.\n\nBruce De Torres: [00:37:38] No. And read Joseph Campbell’s work. Maybe because I wanted to be an actor. And I put myself in these, the things I watched, I was like I’m pretending I’m this and pretending I’m that. It’s easy for me to – relatively easy because I still have my dark nights of the soul like anybody else – But I would encourage someone who’s wrestling with the despair, [and] choking on how negative and horrible and murderous and evil, how effing evil life on planet Earth can seem when you look at the social structures and the economic structures, and politically and militarily what’s happening. There’s a lot of evil to deal with. And we have to look at it, just like you just said, and this is what our imaginations are for. And specifically to develop a spiritual imagination. I would tell someone who wants a specific answer to this specific problem, I would say, “Do whatever it takes to experiment with having a spiritual imagination. Because if you can imagine that you’re an eternal thing. You’re always okay. You’re okay now. You’re always going to be okay. And this is some kind of an adventure or game that you intentionally set up to do to yourself, what’s there to be afraid of?” And if you imagine, it’s literally a fear test. It’s a courage test. We’re floating around as eternal spirits. You don’t have to have a life on earth because you believe it’s real, and it’s terrifying. Why would you do that to yourself? I don’t know Alex, but let’s say we did it anyway. We can go deeper, [and] we could say, because some souls are trapped to do that over and over again until they realize it’s a game. It’s an illusion. You’re doing this to yourself. And that’s why the Gandhi’s comeback and the Jesus’s comeback and the John Lennon’s come back and the poets and the Rumi and the Kahlil Gibran and all those who write and say – even Bill Hicks, the comedian – it’s all a ride. It’s just a ride. It’s thrills and shocks, looks very, very real, it’s just a ride. Because if that makes your life an ounce easier, well [unclear 0:39:52]. And here’s a particular resource. It’s a YouTube channel. You read about it in my book, by Anthony Chene – C-H-E-N-E – production. He has interviewed lots of folks who had near death experiences [unclear 0:40:08]. And they talk about, they died, what they experienced, they realized the truth of their spiritual nature and the nature of existence is all is all love. It’s just love. And we’re all connected. And then they came back, the doctor said, “You were dead for three minutes. You were dead for seven minutes.” [unclear 0:40:29]. Dead. And then often they heal [unclear 0:40:33]. If you’re a stone cold atheist, completely materialistic, who thinks you’re only worth the money you have in the bank right now and you’re terrified, and you ought to be and you start watching these videos, and you can create just a little space in your head to look at life like, “Baby, I planned all this before I was born.” And you start looking for reasons why that’s true, you’ll find them because the real mystics know, whatever we look for, we find because it’s us and we create it, [and] we attract it. And that’s how infinitely powerful we are. And here’s the last example before I’ll throw the conversation back to you, Alex to continue this or go any other place. This all reminds me of the survivor of the Nazi concentration camps, who was asked, “How did you survive when the vast majority of you didn’t?” And the guy said, “They could beat me. They could starve me. They could make me work in the snow, sleep in the snow, sleep on concrete, but the guards couldn’t make me stop loving them.” So he performed a miracle. You would think Nazi guards in a concentration camp are unlovable, but by loving them, this guy made them lovable. And by making them lovable. He made his own life, if not lovable, and durable. Because if you love where you are, you can get through it. How do you love your torturers Bruce? Well, that’s a that’s a level four question.\n\nAlex Tsakiris: [00:42:05] It is. It is indeed. Let me toss another log on the fire, complicity. This is something that really used to rile me up, especially in talking to Christian people, especially talking to Catholics and say, “Okay, we can do it.” But now it’s been laid bare. Satanic, dark, [and] completely compromised organization. Not a few bad apples. Fundamentally at its core evil. How can you go to church on Sunday and put money in that basket? How can you be complicit? A little bit wiser me says, “I’m complicit.” I’m complicit in everything. I’m complicit in JFK. I’m complicit in 9/11. I live in a beautiful house in Southern California overlooking the ocean. People 30 miles from me in Tijuana, I’ve been there. They live with cardboard and corrugated stuff that they’ve scraped out of the junkyard and battered up on the wall, and they’re probably people in San Diego County who live that way, as well. But I am complicit. We are all complicit. And that doesn’t take away from the spirituality that you’re talking about. But it does put a different spin on again, how we relate to these horrific evils that are being perpetrated all around us, doesn’t it? How do you wrestle with that?\n\nBruce De Torres: [00:43:41] Well, it brought to mind what may have motivated the Kennedys. And this is documented. Those nine children of rose and Joseph Kennedy were taught, “You don’t have to worry about money.” You don’t, because their parents were so rich. To whom much is given, much is required and much is demanded. They seem to have internalized the sense that to be worthy of that good fortune that they didn’t cause at all, they had to kind of pay it forward or pay it back. So you’re…\n\nAlex Tsakiris: [00:44:25] Here’s the thing. I love this because now we’re going to veer off in another direction and dive into facts. So JFK, and I just played this clip in the previous show, he knows who he fucking owes when he’s there, right? Because he was elected in a rigged election. His father Joe Kennedy, who was connected to the mob because he used to run alcohol from Canada down, he hires the mob to throw the election in Illinois, which is a swing state that gets it. And along with daily and the mobsters, they have a bunch of people voting who are dead and a repeat of a recent election, and they win. And they also do that in West Virginia and they win. Right? And then he goes on to… He’s got the Dr. Feelgood thing, right? And he’s getting injections in his throat of amphetamines, and all sorts of crazy drugs. And he gets one, right before he goes on stage with Nixon. And it probably is the debate that wins him the thing. So no one’s clean in this thing. And RFK, his brother, Robert, youngest Attorney General in history, he’s screwing Marylin at the same time his brother is, and a lot of people think he was probably in the room when Marilyn died. And it was probably his people that decided after they grabbed that diary of secrets that she had that, RFK might have been the one who went and said, “Okay, yeah, I guess it’s best to pull a Bill and Hillary kind of eliminate all the possible skeletons in the closet.” He’s not clean in this. He’s not perfect. And to recast that history, as somehow, the Camelot kind of thing. I don’t know.\n\nBruce De Torres: [00:46:08] They did so much good in their public careers, that to emphasize what you… And you didn’t emphasize it, you just chronicled it. And I’m not necessarily in complete agreement that they probably did all of those things. We could go through each one of those separately, but the balance, again, it reminds me of all that we got from the founding fathers of the United States, should not be flushed down the toilet, because a percentage of them owned slaves while they were espousing freedom. Let’s throw out hypocrisy and keep the good because no one on this dear planet is morally, ethically perfect, [and] consistent at every phase of their whole lives. So we get to cherry pick.\n\nAlex Tsakiris: [00:47:08] Bruce, I got to interject, because to me, that is so much what your book is about. To me, it’s almost about the opposite of that. Is that no, we’re not allowed to cherry pick. Because what you do is just immerse us in the whole soup. And then it forces to realize that any taste we pull out of that soup is us, [or] our palate cherry picking on our own. But no, it is totally legitimate to focus on the fact that George Washington was a slave owner. It’s completely legitimate to say his perspective, [and]his worldview that he was unable to climb on top of which by the way, he was the only one who did release his slaves when he died. So he gets a check mark for that. Thomas Jefferson, the great Liberator, he didn’t, and he was sleeping. Which is I think when you own somebody, and you’re engaging in sexual encounters with them, I don’t know how that is not rape, but who knows. I mean, I guess you can get consent in the same way that if you’re a Mormon, and you have the newly passed law, that the governor of Utah passed that said, “I kind of think that polygamy thing, it’s kind of more complicated than we thought. And guys who want to marry two or three women into their little cult [or] into their little coven, maybe that’s not such a bad idea.” I think that that’s what I take away from God school 9/11 and JFK, is walk through this with me and go through the spiritual journey that you’re really talking about that I realized that however I pick and choose you can find fault in it. There is no perfect walk through that history. What do you think about that?\n\nBruce De Torres: [00:49:00] Well, I agree there is no perfect walk. And it churned my guts like it churns a lot of people have how do you reconcile? It’s probably the same issue if there’s a good God why does he let bad things happen to good people? The conundrum of human evil.\n\nAlex Tsakiris: [00:49:18] And every atheist too, on Bill Maher’s show.\n\nAlex Tsakiris: [00:49:25] But did you really wrestle with that question? I don’t I mean, to me that’s kind of…\n\nBruce De Torres: [00:49:29] I used to. I had for years. And when you get to be my age, you realize, you know what? I’m not going to worry so much about certain things. But I want to make this point about this though, about what do you do with these, ‘George Washington had slaves for all he said about Liberty.’ And I guess Alex is what do we do with their example? There’s the republic they created, the ideals that we are supposedly pledged to and dedicated to and falling short of so who’s a bigger hypocrite?\n\nSo at the end of the day, it’s okay.\n\nhow am I going to live and what a, what am I going to try to force my government to be in? Do. Well, how am I, what am I going to do with the harm that my government is perpetrating right now in my name with my money. And, you know, we are morally legally, ethically responsible for all the atrocities that the American government has ever committed.\n\nwe’ve, it’s very fashionable and very easy to point fingers at Washington and say corrupt, corrupt, corrupt, but they’re the cart we’re supposed to be the horse we’re supposed to, hold their feet to the fire. Is it a lot harder now? Yes. Are there unprecedented technologies used to divide and conquer us and keep us afraid of each other and prevent this from organizing any effective action?\n\nYes, not with standing that we have to remember the goals of sanity. Peace, love happiness. And get through day by day by day. And when it comes to the founders and slavery, I don’t want to throw the baby out with the bath water and the same with the Kennedys. now in their defense, yes,\n\nthere’s a great case to be made. No one became president then or now Republican or Democrat without some mob help. It was a great case to be made for that and the test of who and what the Kennedy’s are or their legacy in their public lives. And your honor, there’s an equal case to be made that the worst allegations about Bobby sleeping with Maryland, was he there and the mob stories of how entrenched the Kennedys were with the mob have been demolished by other researchers.\n\nSo that’s, that’s a, that’s a whole other court case. That’s a whole other trial that would have to happen. That we’d have to see all the evidence. We’d have to see both sides confronted with. Um, what’s the, what’s the word when you’re confronted in court cross examination to see if either side holds up and then you and I would be able to give a valid verdict on how likely was it that Bobby had anything to do with Maryland’s death?\n\nI think we’re far from that. I don’t know. I shouldn’t say because I don’t know what you’ve read. I don’t know what you’ve looked at about that, but that’s what I would say in general about that I’ve looked at enough to say, because that used to turn my guts to think that either of them had anything to do with hers, with her death.\n\nAnd I would point to the work of Jim de Eugenio in particular, in, uh, dismantling forensically, the accusations along those lines to the degree that I can rest. If I, if I had the time I want to make the time, I might study it a little deeper, but I’ve done such a deep dive. Okay. I’m not a hundred percent certain, but I’m persuaded.\n\nAnd I needed to be because it was very upsetting that folks who were heroes to me, and at this point, I’m proud to say that the Kennedys are heroes to me. Um, that’s what I would say in response to that for the sake of anybody listening. So they know like, well, it ain’t necessarily the way Alex said,\n\nmaybe I got to look\n\nat it from all\n\nthese other angles, allow me.\n\nAlex Tsakiris: [00:53:16] No, no. And we do, but then doesn’t, that gets back to it. And it is good to do a little bit of a deep dive into, what we’re talking about. So if we did want to add a little bit of detail to that, just so that people can shoe horn themselves into this conversation. it’s speculated that, Marilyn Monroe was being closely monitored because she was keeping a diary.\n\nIt came to be known that she was keeping a diary and that she had some legitimate important secrets. If you will. Pillowtalk from her relationship with John F. Kennedy and, Robert Kennedy. Do you, or are you not down with the idea that RFK was also sleeping with Marilyn?\n\nBruce De Torres: [00:54:02] I’m very open to it. I’m not convinced about the diary because I’ve seen the reputations of the sources where those stories kind of came from.\n\nAlex Tsakiris: [00:54:14] Okay. So anyways, her death, Marilyn Monroe’s kind of suicide. Pretty clearly not a suicide. It’s a, take-down, it’s an incessant nation in some way. And there’s some pretty dark figures looming there. So that’s enough that anyone can kind of see, you know, where it is, but w the way\n\nBruce De Torres: [00:54:37] before we leave, before we leave that, Alex, may I ask, are you familiar with Christopher Fulton’s book poisoned, the inheritance poisoned fruit of JFK’s assassination?\n\nAlex Tsakiris: [00:54:49] No, I’m not. Who is the author again?\n\nBruce De Torres: [00:54:52] Christopher Fulton, if U L T O N came out a couple of years ago. And the point he makes in there is that JFK didn’t necessarily sleep with all the women that he had private meetings with that, and among in Maryland, among them, he may have slept with her. He may have had an affair with her, but he may also have been using celebrities.\n\nTo send messages back and forth to people outside of his regular presidential channels, which were monitored by the CIA and the military so that he could advance his agenda unscrutinised by the CIA and the military and the state department. So that’s just that even just, just another angle on the Maryland situation.\n\nAlex Tsakiris: [00:55:42] Right. I mean, trying to your publisher who is fantastic and a lot of ways, but you know, there’s like you could fall into the JFK thing there too, to their credit. I mean, there’s 200 books there on JFK that you can dive into and a lot of different stuff. So, but it, it, it is history and it is important to understand his history.\n\nWhat I think is even more important. And that’s why I love where we’re going earlier in that conversation. You are going to then have to confront that history, deal with that history and kind of go through that history, which is what you’re talking about. So beautifully, Bruce, that idea about imagining two perfect parents is something that’s profound.\n\nThat’s going to stay with me from this interview because I think it’s beautifully said. And I think when we balanced that with, , I can hit you with whatever I want to hit you with about JFK or RFK, because , you’re, battle-tested now you, you, it’s not like you’ve built armor to shield it off.\n\nYou’re just battle tested. You know how to go through the information and how to hold the rudder steady, no matter what new information comes up, because you’re still going to be at that core. Okay. You know, which is what you’re talking about. And to me, Again, that’s what, that’s what I resonate with in the book.\n\nThat’s what I think the book is about. How do we learn these skills? Because it is a skill that we totally get is super important right now is to be able to hold the rudder because this isn’t the end. You know, you throw in a chapter on COVID, um, no way you anticipated that 10 years ago when you started the book, but that’s the latest, you know, storm at sea to keep the metaphor going that you again, have to hold the rudder.\n\nAnd of course you’re going to get upset. And of course you’re going to be energized by the ideas and the facts, but it’s really not about that. It’s about how you process how you go through it. Maybe I’m repeating too much what we talked about already, but any thoughts on any of that?\n\nBruce De Torres: [00:57:50] yes. I try to train myself to be ready for anything.\n\nUm, my power going out in the middle of this conversation. And then what do we do?\n\nAnd will vaccines be necessary everywhere? I don’t want to say too many words that could get flagged on different platforms to the detriment of your viability and it shows viability.\n\nYeah, it’s I, I often imagine, I often imagine that this is what it was like being in Germany in the 1930s, when the Nazis came in in 1933 and then little by little, they did things to scare the population to tolerate new clampdowns restrictions, rules, regulations, until they became the full blown awful awful thing on the planet that Nazi Germany was, it was a little incremental.\n\nIt was relatively fast. So it’s just to be ready for anything. It’s literally to be ready for anything. And to, and to, and to know this is the privilege of being my age. I’m not going to say yes to everything, just to buy a little bit more time. You know, I’m not going to go on the box car. I’m not getting in the box car.\n\nEven if they say it’s for my protection, you know, oh, I’m not, I’m not doing it. I’m not going to help anyone arrest me. They can drag me down the concrete steps. I don’t care, but you gotta be my age to say that I couldn’t have said that just a few years ago or let alone when I was in my twenties, thirties or forties, you know, you’re desperate to live and you’re desperate to, you know, make something of yourself and, you know, prove something and get some answers to some questions.\n\nAlex Tsakiris: [00:59:39] I got to throw a little story. Log on the fire. Are you familiar with rich martini and his book flips? so you, but you’ve already referenced the past life between life stuff. All that research, which if anyone wants to look into it is pretty damn fricking solid. I mean the past life stuff is super solid.\n\nSo then when you look at what Lipton did in the, between lives, it’s kind of how do you one into your worldview and reject the other. So rich martini, who is a Hollywood producer. He did this movie in this book called flip side. One of the stories he tells and he videotapes and shows is a woman. Weekend retreat to do a, between life regression.\n\nShe regresses back. She is a concentration camp, participant Jewish, and, , she’s being led to the gas chambers and she remembers being led to the gas chambers and she wants to resist. Now. She’s like, oh my God. Now she decides, makes the conscious decision that no, it’s okay. I will stay with my people.\n\nThat’s what I’ll do. I’ll stay with my people. And she goes into the gas chamber and she dies. And in the process of dying, she realizes that in many ways, her burden was less because the real burden that she saw was the guilt that was being held by. Those prison guards who were there, who were victims to a certain extent in that they weren’t, they were complicit, but they weren’t really complicit.\n\nAnd they were carrying that soul crushing burden that they had of what they had done. And they would carry that through their life and maybe into future lives. So this to me is back to one of these fundamental questions of, you know, what do we do and what do we think we’re supposed to do when the box car comes\n\nBruce De Torres: [01:01:46] very personal? Very, I I’m trying to organize a thought and answer, you know, because what do we do and what are we supposed to do when the box car comes? Well, I guess we’ve got a process studies for ourselves. I can only tell you. I really, I really hope I’ve got the car. To just gently and slowly just sit on the floor.\n\nI’m not going to help myself go anywhere. And what are they going to do when that happens? I don’t know. Will I cry? Will I, will I lose control of my bodily functions or will I cave? Well, I go ahead and we’ll, uh, go along, you know, um, hopefully it won’t get that way. This is very scary to imagine. It’s a very scary scenario and scary things come our way.\n\nYou don’t get through life without a few scary things.\n\nAlex Tsakiris: [01:02:38] As you alluded to before, when you really dig into this one possible way of looking at it is this is an exercise in scary shit. This is an exercise to orchestrate fear to keep those parents at bay. The good parents that are inside us, that spiritually guide us, the elders that spiritually guide us one way to keep them at bay is fear, right?\n\nBruce De Torres: [01:03:08] yeah. Yeah. That’s how we can be usually control. And that’s why they show us things and they do things to us to scare the hell out of us. life could be called fear management, you know? Oh, you want to have a human life where eternal souls having a beer reevaluating. Gee, am I in the mood for another human life or not?\n\nYou know, remember it’s all fear management. Yeah. Yeah. Yeah.\n\nI love that. That’s great. Yeah. We have to imagine as a great meeting, great purpose. We need that all the wise ones say that, you know, a human life without, you know, purpose or an idea that makes it endurable livable. It becomes unlivable. Yeah. And it’s, it’s looking at this, that it is this kind of spiritual adventure that we’ve designed for ourselves quite intentionally.\n\nI love a lot of the survivors of the returnees from near death experiences say I realized that it was everything that happened was I knew it was going to happen, you know, before I came in, before I incarnated, you know, so that’s playful. , so if we can cultivate this idea of a, you know, perfect safety, even in the midst of all this, there’s always going to be things that scary us.\n\nI think I have in my book, or maybe it got taken out toward the end, the little parable of the man being chased by the bear. And he comes to the edge of a cliff. And there’s a tiger at the bottom. Who’s a snarling. And, but he’s got to climb down because the bear’s coming and he’s halfway between the bears Pauling from the top, trying to get them in the tigers, jumping up from the bottom, trying to get him.\n\nHe’s clinging to the side and right in front of his face, there’s a big red strawberry and he eats it and it’s the most delicious strawberries ever tasted in his life. And I’ve broken that down to think the bears are past and always chasing. And the tiger is our frightening future just looks hopeless, but the present moment is, are, is delicious.\n\nIt’s this is our strawberry, this right here right now.\n\nAlex Tsakiris: [01:05:10] So that living in the moment kind of wisdom. How do you connect that to. What we’re living through right now, what we’re going through, you know, , the example or the story that I always cling to. And I use so often in this because I’m kind of drawn to the non dual perspective, although I don’t want to cling too tightly to that is the, the hugging Saint, um, uh, who is, uh, I was turned on to, by my friend, Rick Archer at bat gap.\n\nAnd I went and actually spent a weekend in LA and visitor got a couple hugs and they didn’t do much for me, but I, I respect where she’s coming from, but tirelessly working 18 hours a day as an elder woman digging latrines in, India for the untouchables, doing everything she can with every ounce of energy she has.\n\nAnd when she’s asked, yeah, Um, uh, you tell us that this world is not what it’s about. This is an illusion. And yet all you do is about this world. All this energy you do is about this world. And she says world, well, world. And to me, that is, I’m not there. I’m with you, buddy. We are side by side. I get it. When you said, you know, we are the, the, the manager general type, we, she is the elder and I am the manager general type who does get fired up by that.\n\nI’m going to go research that RFK thing I want to know. And I’m going to try and gain hold of my emotions to not get too sucked into wanting to know more. But I do sure as shit, appreciate the elders who remind us world what world.\n\nBruce De Torres: [01:07:04] Yeah. Yeah. That reminds me of what I think I’ve heard about mother Teresa similar experience.\n\nShe had an aha looking at some suffering soul home, lying in the street and just hug them, you know, and the other sisters in our convent founder and said, what are you doing? We’ve got paperwork to do. We’ve got, you know, meal. And she just, and then the person died. She died. I think that’s her legacy. She was just hugging and comforting, the real sick, dirty disease people with our own hands, as much as possible.\n\nRight. I think where\n\nAlex Tsakiris: [01:07:38] she was, she was on stage bro. She was on stage being present. Wasn’t she, she was on stage sharing the stage with that other actor and being in the moment. Wasn’t she tell us, tell this person the time we have left, what else you want people to get in understand from this fantastically interesting book God’s school, nine 11 in JFK, the lies that are killing us and the truth that sets us free.\n\nBruce De Torres: [01:08:10] Well, uh, tangibly, I feel people should go to my site where you could read all about the book, Bruce D tourist.com.\n\nD E T O R R E s.com. And there’ll be a way you could buy it if you want, but at least you’ll see on the front page, these amazing reviews that it’s gotten by folks who are respectable minds, who’ve written a lot about these topics. What I want folks to get\n\nthe, the hopefully tender at the beginning, I spend the first many pages talking about myself and my thought process is in my own emotional kind of challenges because, uh, I’m a human and that’ll, you know, I’m not coming from a pedestal.\n\nI hope I don’t come from a and I might, because I do say things with great assertiveness later on my opinions, I’ll stand strong for my opinions, if, and I try to make the case in them, but the book really helps us grow up. If you have any doubt about any of the major topics, uh, that that’s who it is. Um, the critique about, you know, everything in the title is real, but it’s just not the official story.\n\nYou know? So the God chapter takes on organized religion to paint a bigger picture of who or what the spiritual force is. Bruce makes the case, it’s you, my friend and it’s me. And it’s every moment and it’s every life and it’s every animal and it’s every child. And I just want to indict and convict the mass media and the federal government as liars and murderers wise.\n\nSo we take what they say to day with a grain of salt, and we do our own research and we confirm, is this an enemy or is it not, is this a remedy or is it not? That’s the major function of the book and they, uh, the great takeaway hopefully is, um, a spiritual imagination and a description of our power. Now, what we focus on is what we have.\n\nWhat we focus on is what we grow. And we get to decide, am I enjoying, what am I, what I’m focusing on or not? And if I’m not, why not? Why can’t I enjoy what I behold, then it encourages us to do the soul, searching to get up early, do the journaling. And that’s the hard questions. Who am I? Why am I here?\n\nWhat’s a good life. What’s the nature of good. What’s the nature of evil and what do I want? And to develop a moral philosophy, this is what I think is good, bad. This is what’s right and wrong for me. And I get to be with me 24 7. I better be better. Be a cool dude. I better become a cool dude. I better be someone whose company I can stand.\n\nCause I’m stuck with me, you know, for the duration. And there’s, and there’s no more fun and powerful way to get over yourself than to pay attention to somebody else in care. What are they thinking? What are they feeling? Why are they doing this? Why they do that in task and to care, not to use them as a crutch, not to become codependent and attach yourself to them like a slave.\n\nThat’s very easy years of experience talking there. , that’s the big snowball of my book, Alex.\n\nAlex Tsakiris: [01:11:43] Okay. Libby, let me in skeptical fashion kind of do a counter a narrative if you will, because this stuff just never gets talked about in our community, if you will. And that is so consider the possibility.\n\nThat you could come to the conclusion, reasonably rationally, looking at the data that there kind of are a few too many people on the planet, you know, it ain’t so good. And we can keep talking about global warming, which is probably bullshit, but the underlying idea that you can’t keep just throwing your shit into the air and into the ocean that probably don’t work either.\n\nAnd the idea that, you know, the ecosystems are collapsing, that’s probably bullshit. But then again, it probably ain’t bullshit that the fish population is like 10% of what it is. So let’s say you and a couple of your friends got together and you said, It does seem that the population thing is a problem and it could get worse.\n\nIt could get a lot worse if we keep increasing the amount of people that we’re trying to put on this planet. And what if we went one step further and somebody said, yeah, you know how it’s going to get worse. We got a lot of people right now who just eat rice or beans or other stuff what’s going to happen when they want to eat protein, which takes a lot, but is a lot harder on the environment.\n\nAnd God forbid what’s going to happen when they say, Hey, I should be able to drive. Well, at least a little moped, if not a car into town, and I should be able to have that I phone, or at least some kind of device with a lithium battery that pollutes the environment. So, you know, there’s, it’s not just people, it’s technology of the people we already have.\n\nSo what if your little cadre of friends got together and said, you know what? This is kind of as a responsible group who are kind of have some influence, this is something we should address. What do you do? What do you, what do you, what do you do in that situation? And, and, and you know where I’m going with this, maybe what you do is what we see right now,\n\nBruce De Torres: [01:13:57] right? That’s a plausible explanation for the policies that are tightening around our neck. I’ll say. But if, if sane and rational folks could address that reality first confirm it that’s the reality. And let’s assume that it is, um, I thought while you were describing that, let’s add to that, uh, focus on rules and regs and governments that protect the rights of the people on an even playing field, not the special interests, not the giant corporate.\n\nAlex Tsakiris: [01:14:31] Oh, I have no interest really, in doing that. That’s never worked in history. Again, I’m now taking the other side of this. That’s never worked in history, and it’s not going to work in the future, Bruce. So you’re as part of the committee and I’m just shutting that down. I’ll buy you off. I’ll do whatever I have to. I’ll Clintonise you and move you out of the equation. But basically what we need here is a strong hand to get this shit done. And if you’re waiting for a consensus forget it, you’re never going to get it.\n\nBruce De Torres: [01:15:02] I don’t know how long I would last on the committee. Can we put it to a vote? Can we appeal to the other members? I don’t see anyone around. But let’s say, you represented everyone I had to work with. And you all agree to that like, “Oh, okay, there’s no political. There’s no consensus possible. There’s just what the rich and powerful are going to do or can do. We’re speaking as if we represent the World Economic Forum.”\n\nAlex Tsakiris: [01:15:37] Whoa, whoa, let me just add to this. This might be way off target. I think that’s kind of a mischaracterization of that. It’s not that the rich and powerful want to rule the world for their own evil gain. It’s that there’s only one way to rule the world. It’s the Roman way. It’s Total War. It’s total domination. It’s, you can’t change anything unless you’re in power. So make sure you win. So whether you want good or whether you don’t, you’re not going to get it by sitting on the sidelines. And that’s why we have a Jeffrey Epstein who is a front man. He’s not really the person pulling the strings. But that’s why we have human compromise. Right? Let me catch that guy back in the 50’s. Let me get Edgar Hoover, a picture of him dressed up in women’s clothes and in a compromising homosexual position, and now I own that guy for life. And he says ridiculous things like there is no mafia and other just absurdly crazy things. Well, today, those pictures wouldn’t carry quite as much weight. So let me get somebody with a little kid or let me get somebody doing something else. But human compromise is the way to go. And whether I’m a good player, or an evil player, if I’m not willing to play that game, now I better step aside because the guy who’s playing that game against me, is going to win. That’s just the rules of war.\n\nBruce De Torres: [01:17:09] I guess I’m stuck in a desire, a need, a belief, [and] a conviction, that if the rights of human beings could be honored and recognized, if human beings could defend their own rights in such a way, it’s tough to compete with… I can’t rule out I think, as you just did that the rich and the powerful… Did you say that they’re not trying to control us, from evil or selfish intent?\n\nAlex Tsakiris: [01:17:45] Now, I think what I was trying to say is in this kind of just stream of consciousness thing is that let’s say we took the rich and powerful and we put them on a bell curve of evilness. They’d fit. They’d fit. They wouldn’t all be on one side of that curve of, “Oh, you’re rich and powerful, therefore, you’re evil.” There’s rich and powerful, that are evil. There’s rich and powerful, that are good. And there’s the bell curve. There’s all the people in between, but keep going because I like where you’re going with the dilemma.\n\nBruce De Torres: [01:18:17] It gives me great hope. No, I love the bell curve. I love that as a model for… Alex, my takeaway from this, you just… Okay, I don’t wanna get too dramatic. That’s a little too easy for me. But I will say it’s quite liberating to imagine the quote unquote, rich and powerful, the elite of the elite, [and] the 1% of the 1%, who have their hands on the levers of control fit into the bell curve, that at one fringe, there are supremely psychopathic and evil, tyrannical tyrants. And at the other hand, are folks who would be saint like and benevolent to us, right? And the vast majority in the middle, just muddle through. And whoever is in charge today, they’ll be evil if evils in charge, they’ll be good if evils in charge, they just don’t care. They’re just going to waddle through. Okay? That gives me great hope because there’s fewer, purely tyrannical and evil minded. They really really are. Which is all the more reason to leverage human nature. Because that also fits in the bell curve. There are deviants and criminals and psychopaths at one side, there are real saints, [and] like the woman who just hugs people in her 80’s and cleans latrines in India. But the vast majority in the middle, just want to love and kiss their grandparents, love and kiss their kids, have a couple beers, put their feet up and watch the boob tube at the end of the day. They really don’t care what’s happening politically. They really don’t care what’s happening in Tijuana. They really don’t care. Because if you have a belly full of food, – we’ve never had this in our evolutionary history until the last 150 years. A belly full of food and decent shelter. Turn that TV on. I don’t want to think. What’s there to think about? How can I improve this?\n\nAlex Tsakiris: [01:20:07] That’s beautiful. The quote that I sometimes cling to, for the bell curve thing is Gandhi, who was a political person, we can kind of forget that because we always picture him as this saintly guy, but he did the deal with Pakistan to divide the countries, but he had mixed feelings about that. He did the deal with people that he didn’t agree with in the parliament in order to get things done. He did the deal with the British Empire. And they didn’t just come down and bow down to Gandhi. He was a man of the world, in a lot of ways. He was an attorney by training. But he said, “Good always wins out.” And he said it from a practical stand, because no, wait, look at history. Good always wins out. And then I think is the essence that I take away from, what you’re saying is that in our human nature, we do have that potential. So we see the potential for evil. And sometimes we focus too much on that. But maybe that’s what I’m saying. And you’re at least open to the idea. There’s a hell of a lot of good, and a hell of a lot of people. And it comes through in some pretty unusual ways that we might not identify as good. And maybe part of our challenge is to reorient ourselves to what it means to be good in that complicated way that you’re talking about.\n\nBruce De Torres: [01:21:34] And also, practically, in a very, very simple way, turn off the phones, turn off the TVs, [and] unplug from the mainstream messaging, because that’s all designed to whip us up into a frenzy of fear, worry and insecurity and panic. And spend time in nature, in order to feel what’s real. Because I contend, and this is the big macro spiritual idea that only love is real. And that’s how we feel in nature. That’s what we see in animals. That’s what we see in children. That’s what we feel in the rhythms of nature. And that’s the preponderance of who we are. We have these rational minds that can drive ourselves crazy with fear and security and competition. That defines human relations and politics and cultures and societies. I love the quote that you just shared from Gandhi, that good always wins. I liken it all the empires that have risen and fallen, typically, it’s through corruption. And then maybe there’s a revolution and maybe some do gooders, hold the flags, and they quickly become as corrupted as anybody who holds power over others. And they exploit people until that collapses. And yet, like a snake, always shedding its skin, life always reemerges. Poetically, I say we can pave the planet with concrete. And a blade of grass is eventually going to bust on through, and that gives us all hope. Because it’s the nature of reality.\n\nAlex Tsakiris: [01:23:02] That is awesome. I love that line. My new Dharma brother. I guess you’ve always been my Dharma brother. I just didn’t realize it till now. What a conversation. What an awesome book, God school 9/11 and JFK, the lies that are killing us, and the truth that sets us free. Bruce fantastic having you on. I really enjoyed it.\n\nBruce De Torres: [01:23:24] Amen. Me too, as well, Alex. May this be the first of many. Anywhere, not just on your show, but just henceforth.\n\nAlex Tsakiris: [01:23:32] Right on to that. Thanks again to Bruce de Torres for joining me today on Skeptiko. The one question I tee up and there could have been many, but we’ll start at the end. Do the rich in powerful fall in a bell curve distribution? I like that question. That’s a real Skeptiko question. So give your answer. Check out the Skeptiko forum. Track me down any way you like. Lots more to come. Stay with me for all of that. Until next time. Take care. Bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bruce de Torres, 9/11, JFK, Covid Are We Part of the Show? |511| - Skeptiko - Science at the Tipping Point", "description": "Bruce de Torres has used to acting skills as a lens for reexamining our history. Click here for the Bruce de Torres’s website Click here for forum Discussion skeptiko-511-bruce-de-torres Audio Clip: [00:00:00] Where the hell are you? Are you in that building? [00:00:03] We’re still in the north tower. [00:00:06] Sweetheart. [00:00:07] Hey, buddy. [00:00:08] […]", "url": "https://skeptiko.com/bruce-de-torres-911-jfk-511/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2021-07-27T14:18:39+00:00", "article:modified_time": "2021-07-27T14:24:55+00:00", "image": "https://skeptiko.com/wp-content/uploads/2021/07/skeptiko-511-bruce-de-torres-1.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Bruce de Torres, 9/11, JFK, Covid Are We Part of the Show? |511|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/4xf3q8KLHuM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/4xf3q8KLHuM?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-511-bruce-de-torres.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-511-bruce-de-torres.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-511-bruce-de-torres.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "https://www.skeptiko-forum.com/threads/bruce-de-torres-9-11-jfk-covid-are-we-part-of-the-show-511.4726/", "https://brucedetorres.com/", "https://www.skeptiko-forum.com/threads/bruce-de-torres-9-11-jfk-covid-are-we-part-of-the-show-511.4726/", "http://www.skeptiko-forum.com/threads/dr-david-skrbina-unabomber-panpsychism-and-jesus-510.4723/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2021-07-27T14:18:39+00:00"}