{"result_id": "273015", "URL": "https://skeptiko.com/sara-and-jack-gorman-deniers-denying-deniers-515/", "timestamp": "2023-04-25 17:08:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/sara-and-jack-gorman-deniers-denying-deniers-515/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Sara and Jack Gorman, Deniers Denying Deniers |515|", "cleaned_text": "Dr. Sara Gorman and Dr. Jack Gorman offer strong opinions about science as they know it.\n\nClick here for Sara and Jack Gorman’s website\n\nSky News Australia, Promo: [00:00:00] There’s no doubt speaking up takes Heriot. But we want to be your voice when you really need one. And we back the Australians who are doing it tough. We’re bold, we’re incredible. We’re Australia’s most fearless straight talkers. There’s a rawness and an authenticity to Sky that I think the struggle to find anywhere else.\n\nAlex Tsakiris: [00:00:21] That is a promo piece for Sky News Australia, which no matter what you think about Rupert Murdoch’s Sky News, you got to acknowledge that Sky News, Australia’s mainstream. And the reason I bring it up on this show is because they were in the news recently, because they had their videos banned from YouTube because they dared to challenge the idea that masks are effective for COVID-19, which I could go on and on about and I’m kind of tempted to, it’s this interview I have coming up with Sarah and Jack Gorman. They have a new book called Denying to the Grave: Why We Ignore the Facts That Will Save Us. And so right off the bat, this is like so classic Skeptiko this is like 10 years ago, Skeptico, because these people are super smart, qualified. Sarah, undergraduate degree, Harvard, PhD, Columbia. Jack has an even more impressive background, MD Columbia, psychiatry, multiple fellowships, taught at the med school there. I mean, these are very, very intelligent people. And their book is atrocious. When it comes to the science that we’ve talked about for so many years on this show. It completely fails from Jump Street; it fails from the fundamental science is a method it’s not a position statement. So again, I could go on and on. And I can’t do a lot of this with this interview slash debate that I know makes a lot of people uncomfortable. And for those of you who it doesn’t make uncomfortable, let me tell you are in the minority. When I do interviews like this, most people really do not like this kind of dialogue. But I got to say, “Where else are you going to hear this kind of stuff? Where else is this silliness going to be exposed?” So speaking of silliness, here’s where I start, which seems obvious to me to anyone who cares about science. And that is, should we limit scientific debate? Should we feel okay, that scientific debate is being banned, being censored? Here’s a clip. Very disturbing to me when people talk about information being dangerous, and opinions being dangerous, why we would ever want to limit a scientific discussion? Because we don’t agree with somebody, I find that very troubling.\n\nSarah: [00:02:38] I do think that anybody who spreads information about a medical technology that people need in order to survive. That’s not true. And usually it’s intentionally not true. I don’t think that they should be allowed to have any platform they want.\n\nAlex Tsakiris: [00:02:55] Sarah, who would determine what’s not true? Isn’t that the job of science?\n\nSarah: [00:03:00] Yeah, well, science has already determined certain things about vaccines that they’re safe and effective, certain vaccines that they’re safe and effective.\n\nAlex Tsakiris: [00:03:07] Does science really determine anything. I think in your book; you say there’s nothing [that] is 100% true. Science isn’t about proof, right? It’s about evidence, it’s about statistically certainty one way or another right?\n\nJack Gorman: [00:03:21] Yeah, first of all, I think we should just want one thing is we’re not really talking about the First Amendment here because the First Amendment only applies to government censorship.\n\nAlex Tsakiris: [00:03:28] The idea that YouTube, Facebook and Twitter are not part of what we have all assumed throughout our lives is this free press can’t be sustained. So Sarah is obviously lost in the woods here. But as the discussion goes on her dad, Jack tries to save her when we wind up talking about whether masks are effective. And here comes the really interesting part. Overall, the use of masks in community did not reduce the risk of influenza. Over and over again, these studies have been replicated, and they always generate a null result. And then finally, we had the man himself, Fauci comes out in reveals in an email that he never made public that he knew all along that in terms of public health, not in terms of laboratory not whether you can make a mask work in a laboratory setting, which we all understand you can, but whether from a public health standpoint, they work, he comes out and says, “Yeah, I know, they never worked.”\n\nJack Gorman: [00:04:32] I still think masks work, obviously. And probably Sarah does, too. I don’t have the data at the tip of my fingers the way you just did, which was really great that you had that there. So I’m not going to be able to engage in an informed conversation about it. But no one is suppressing, you decide. I got to say in my book, mask works, you get to say your masks don’t work. Public sees both sides.\n\nAlex Tsakiris: [00:04:56] Oh, no, that’s suppressed on YouTube. You can’t say that or you’re banned.\n\nJack Gorman: [00:05:00] You can’t say masks don’t work on YouTube.\n\nAlex Tsakiris: [00:05:03] That’s correct. So here it is. Here’s the payoff. Here’s the part I think is particularly interesting. Jack, super smart guy, MD, expert in public health policy, expert in this interface between science and public health policy, genuinely does not know that YouTube videos are banned. And I don’t even completely fault him for this. This is where conspiracy and the kind of material that I’ve really engaged in last few years, this is why it’s so important. One more clip from the interview that’s coming up.\n\nJack Gorman: [00:05:39] What else you got for us today?\n\nAlex Tsakiris: [00:05:41] I tell you one thing I got, you wrote on conspiracy theory. We think it’s reasonable to say, even without any data to support it, that most people have never been part of a conspiracy, or even known a person who has. And the thing that struck me is, man, first of all, I grew up in Chicago, where, I don’t know how it is in New York, but you don’t get anything done without paying somebody off, influencing somebody and everything is afraid. And then I was a research associate at the University of Arizona. And I left because I thought, the Ph. D process, and that whole thing was very political quote, unquote, which is also conspiratorial, and then I got into business, and I had a business and built my business, and sold it to NASDAQ company, everything about that everything about business, everything about large financial transactions, this holiday is conspiracy. But then the first one you use is an example of a conspiracy. And my audience will love this; a conspiracy was behind the assassination of President Lincoln, but not President Kennedy. And again, since we’ll wrap this up, but you guys need to Google, United States House Select Committee on assassinations, and then add conspiracy or sound data. I mean, that is the finding of that committee is that it was a conspiracy? Well, I guess as you can tell, I’m pretty worked up but it is so, so Skeptiko. So anyways, this is a dialogue that I’m glad we had, I’m sure it’s going to make a lot of people uncomfortable, and I’m sure it made our guests a little bit uncomfortable. But, man, you got to do your work if you’re going to come on the show. Here’s my interview with Sarah and Jack Gorman. Welcome to skeptiko where we explore countries heal science and spirituality with leading researchers, thinkers and their critics. I’m your host, Alex Tsakiris. And today, well, we have something special because intelligent science driven dialogues with people who disagree are difficult. And they’re not only difficult to have these kinds of discussions, but they’re even difficult to arrange them. I can tell you, I can’t tell you how many I’ve tried to do. And it’s really hard to get authors to come on if they have any sense that the other party isn’t going to agree with them. So when Holly who is the PR rep from Oxford University Press originally reached out to me and said, “Hey, would you like to do this?” I was like, “Absolutely, just make sure they’re down with it.” So I was delighted and surprised. So I think this is good. It’s an opportunity, again, to have these kind of dialogues that are, can be difficult to have, but I think can be important, too. So our guests today are super bright, super qualified. Dr. Sarah Gorman and Dr. Jack Gorman, join us today. Why don’t we start by talking a little bit about your backgrounds? First of all, this is the names of the same. We’re just chatting a second ago, we have a father daughter writing team here, which is quite cool. And I was just saying, I think I’d love to do that someday with my daughters. It’s a testament to a family that can hang together. I tell you, if you can write a book together and edit it together, then there’s a strong relationship there that really needs to be celebrated. So let’s start maybe, Sarah, start with you. Tell us a little bit about your very impressive background. Tell folks about your background, who you are and how you came to write the book.\n\nSarah: [00:09:26] Sure. Hi, thank you so much for having us today. It’s great to be here. My background is mostly in public health and sort of the intersection of psychology and public health. I have a PhD from Harvard and a Master’s of Public Health from Columbia. And I’ve spent many years writing and thinking about that intersection between these two fields is specifically how people make health decisions and why they make the decisions they do and why sometimes those decisions are not consistent with the advice they may get from health professionals or national authorities on health, etc. And I came to write the book because I was getting more and more interested, and actually frustrated with the response that my field was having to people who were vaccine hesitant. So people who were afraid to get the vaccine, usually for measles, mumps and rubella for their children. At the time, the predominant fear was that that vaccine might cause autism, which was not well supported in the literature, but was a prevalent fear among many people. And I was frustrated with a response from my field, which was mostly to basically fight with people and provide them with more and more factual information. And I really thought that they were missing the mark that, you know, this approach obviously didn’t work, and that they were assuming that people didn’t have information, which I didn’t think was at the heart of the problem. So, I wanted to understand a little bit better, what is the psychology that goes into coming up with a decision or a fear like this about a vaccine? And how does that develop? How does it become entrenched? What happens when it’s challenged, and everything along those lines, and I can let Jack talk a little bit about, how he developed his interest in the same topic, but it just so happened that around the same time, we were thinking about this, topics, in slightly different ways, but very similar, and realizing that there was enough here for a whole book project.\n\nAlex Tsakiris: [00:11:29] Awesome, Jack, you want to jump in there?\n\nSarah: [00:11:31] Sure. So I trained at Columbia University to be a psychiatrist, where I went to medical school and where I met my wife, who’s a psychiatrist. But as soon as I finished residency training in psychiatry, went right into research, and spent a career of about 20 years or so researching in biological areas of psychiatry and neuroscience, mostly at Columbia University. And the genesis of the book was really Sarah’s idea, because Sarah, called me one day and told me about her ideas about vaccine hesitancy, and the MMR and those kinds of things. And it happened to be at about the same time, I was thinking a lot about why people own guns, not a second amendment issue, but rather what the data show, which is that if you own a gun, most of the studies show, you’re more likely to be a danger of being harmed by that gun than to ever use it to protect yourself. And yet, lots of people argue that you need a gun at home to protect yourself and they own guns. And so we started talking about all the different instances in which mainstream science says one thing. And at least a substantial number of people believe something else. And what is that disjunction between belief and science. And that interests us a great deal, because we realized there were a lot of different areas where that was the case. We realized that we could irritate our liberal friends and our conservative friends equally, because depending on which issue we looked at, we find an issue where that was the case. And so that’s how we decided to write the book together. And then subsequently, we started a nonprofit company called Critica, which is intended to carry out some of these ideas. Very fundamental to our idea, was the recognition that scientists like we are, usually do a relatively poor job of explaining science to people, and very often are arrogant and condescending to people and don’t empathize with their goals, their needs and their interests. And so we wanted to try to explore what is the psychology of science denial? And how do we overcome it. I’d also like to say in terms of your program, I’m very interested in spirituality as well. I’m a religious person. And I tell people always that when I’m in religious services, I believe the earth is 5771, almost 5772 years old. And when I’m in the laboratory, I believe the world is 13.5 billion years old, and I have no trouble with those two beliefs.\n\nAlex Tsakiris: [00:14:30] Well, we’ll get at that might actually be another point of incongruity between us because I’m a very spiritual person, but not a religious person at all. I’m not down with that. But I think we’re going to have a lot to talk about, again, folks the book, denying to the Grave: Why We Ignore the Facts That Will Save Us and I think you guys have done a pretty good job of laying out the basic premise of the book and the genesis of it, which is interesting. I feel like I’ve done 500 shows on denying to the grave that’s what this show is all been about. But it’s the issues are always the other way around. And that’s the first thing that impressed me is like, isn’t this what everybody says, “Hey, I know the facts. The other guy, why isn’t he relating to the facts in the same way that I do?” You know, one of the very first interviews I did was with a guy I like and still greatly respect Dr. *Rupert Sheldrick*, who is a Cambridge biologist, published in Nature, certainly well respected guy. And he tells this story about presenting at the Royal Society in London, about his work on morphogenetic fields, which you guys would probably completely disagree with. And one of his colleagues on the Royal Society, stands up in turns his back to the screen, folds his arms over his chest, and says regarding Rupert’s data, “I wouldn’t believe it, even if it was true.” So isn’t that what we’re really up against? This was not Rupert’s position is not a mainstream position. But he has a lot of really good data to support what he’s saying. And we have a dogmatic scientific, ordained mainstream that says, “I wouldn’t believe it, even if it wasn’t true.” Isn’t that at the core of what we’re talking about? And then doesn’t it quickly get to data? Don’t we all think we have the facts and the other guy doesn’t?\n\nSarah: [00:16:38] Yes, I think that’s true. I think that’s true to some extent. And I would say, part of what we, what we write about in the book is that no one is immune to these phenomena, the psychological phenomena, in that make us not believe things that make us skew the data or look at things in the wrong way. Nobody is immune to it, including scientists, including physicians, we deal mostly with health sciences. And it’s really important, we have many, many pages in the book that we devote to helping professionals, medical and scientific professionals examine their own, understanding their own approach to data, and how they may be pushing things away, that could be true, because they have conflicts of interest that may not be financial, they may be reputational or something else. And so that is really an important part of what we examine as well.\n\nAlex Tsakiris: [00:17:34] I didn’t I got to say, I didn’t see it right from jump. I mean, you guys still talk about denying science, it’s like, this is Skeptiko, 10 years ago. Science is a method. It’s not a position statement. So your book is filled with political statements about Trump and this and that, and other political statements about topics that you guys seem to care about. It seems to be very philosophy of science, which is what I think you’re getting at light, it doesn’t mention the replication problem. It doesn’t mention the experimenter effect; it doesn’t mention the file drawer problem. All the issues that are at the cutting edge of philosophy of science, science methods, getting sorting through where the data really is how we’re being fooled. I don’t see any of that I just see standing on a soapbox talking about climate change, and COVID-19 and vaccine and all the rest of that stuff.\n\nAlex Tsakiris: [00:18:35] Well, you’re right, we don’t discuss those things in the book. And that’s a good observation. And I think what you’re getting at is all the things that scientists need to have a lot more humility about, all the things that plague science, and as you say, make Science a method, not a belief system. So the replication issue, for example, is a very good thing that you brought up, which is particularly problematic in psychology, as you know, we’re so many of the studies in psychology studies now showing don’t replicate over time. I must say that, as a scientist, that’s one of the most painful things to have happened is when a paper you publish with a finding, somebody else can’t replicate it. And that’s happened to me. And that is a very painful thing. And that’s part of our process, right? That’s part of how we eventually come to a conclusion is by doing studies, seeing if people can replicate it, finding out when we’re wrong, hopefully acknowledging when we’re wrong, which is one of the things that we think scientists don’t do often enough. I just read a harrowing story. It was a book review this morning, I just read in the Journal Science. I haven’t read the book. So I just read this book review. But it was the story about two children in an orphanage in Iowa, who had their IQ measured. And their IQ was measured at something like, 36 and 46. You may have heard of this book. And they were declared feeble minded, this Iowa orphanage. And the psychologists found that another place for these people to go another horrible asylum. But in this horrible asylum, the two young children were actually doted on and raised by adults who also have low IQs. And they came back a year later and measured their IQs. And these chose IQs was 90 and 80, something. And they came back 20 years ago, they were both married people, children, very happy lives, what they had shown is that IQ was capable of going up if a child got the proper amount of nurturance, and attention of love. And what the book is about is how scientists, psychologists in the IQ field refused to believe it. And how mainstream science fought tooth and nail against this idea that IQ was susceptible to nurture. Because at the time, this is back in 1930s, it was firmly believed in science, that IQ was totally a genetic function, totally inborn, that there’s nothing you could do environmental changes. And I almost brought tears to my eyes reading that because I thought, well, here’s an example. And there were other examples of scientists refusing to look at data, cells refusing to look at them, and they are these two kids, refusing to believe that these two kids been able to have this much of a change in IQ in a year. So, I think that’s one of the things that you’re noting. And we’re very sensitive to this. And one of the things that we certainly say that we write, I think in in this book, for example, a lot about the nutritional science where people have made such huge mistakes, actually, and refused to give up on ideas when new data comes in, that science always has to be ready to change its mind when new data comes in.\n\nAlex Tsakiris: [00:22:38] Well, I guess the thing that I think is bound up with this thing that we’re talking about right now, as it relates to things that are happening right now that people care about, COVID, climate change, global warming stuff that you talked about in your book, AIDS, HIV, which is something else we’ve kind of looked at on this show is what’s commonly referred to as the cancel culture kind of thing. So if you look at like the vax thing, in the Vaxxed movie, by Del Bigtree, there was a guy who’s banned now on YouTube, Google censored, Facebook banned there, too. What do you guys think about banning scientific discussion, banning people who have different views? This is very concerning to me. You mentioned you have these you, Jack you were interested in gun ownership. And you understand, there’s a difference between people’s beliefs and Second Amendment Rights and how people feel the need to protect it. I think something similar is going on with First Amendment Rights. I hear people talk very disturbing to me when people talk about science information being dangerous, and opinions being dangerous. And Del Bigtree who I’ve never interviewed Del Bigtree, I’ve interviewed some other people related to the topic scientists mainly why that why Del Bigtree, who is a recognized TV journalist has published on mainstream thing why we would want to ban someone why we would ever want to limit a scientific discussion. Because we don’t agree with somebody, I find that very troubling. What do you guys think? Should anti vaxxers as you guys would call them should, quote unquote, anti vaxxers should they be banned from YouTube? They are, but should they be?\n\nSarah: [00:24:34] Yeah, I do think that anybody who spreads information about medical technology that people need in order to survive, that’s not true. And usually it’s intentionally not true. I don’t think that they should be allowed to have any platform they want. Personally, I know that’s my own stance. I don’t think that it has to be gospel but it I think that it does become dangerous. These things spread very quickly. And people who are just trying to make a good decision for their children get pulled into, ultimately, in some cases killing their own children because of this. So, I do think it’s potentially dangerous.\n\nAlex Tsakiris: [00:25:17] Sarah, who would determine what’s not true? Isn’t that the job of science?\n\nSarah: [00:25:24] Yeah, well, science has already determined certain things about vaccines that they’re safe and effective, certain vaccines that they are safe and effective.\n\nAlex Tsakiris: [00:25:30] Does science really determine anything? I think in your book, you say, “There’s nothing is 100% true.” Science isn’t about proof, right? It’s about evidence. It’s about statistically certainty one way or another right?\n\nJack Gorman: [00:25:45] Yeah, first of all, I think we should just one thing is we’re not really talking about the First Amendment here, because the First Amendment only applies to government censorship. So whether or not we agree, YouTube, Facebook, Twitter, they can do whatever they want, because they’re private companies. So the question is, is it morally ethically right for them to do that? I also want to say that we try, we slip, and we forget, but we try never to use that term anti vaxxer because we find that to be a derogatory term. We want to talk to people who object to vaccinations, and have conversations with them. That’s very important to us. And we want to understand exactly what evidence they have, what is on their mind, where they’re coming from. I just wrote, actually, for our website, and will appear, hopefully, in September, an article, a commentary, talking about this very issue about when is it scientific dissent? And when is it misinformation? And one of the things that we’ve debated among ourselves is the drug hydroxychloroquine, which was originally said to be an effective treatment by some people for COVID-19. And now, the scientific consensus is it doesn’t work. Should people be able to say, for example, on YouTube, Facebook, and some of the Twitter, and hydroxychloroquine, works for COVID-19. If that information might lead people to take hydroxychloroquine get bad side effects, and not any benefit. I don’t actually answer the question, by the way, because I’m not 100% sure the answer. At what, but you’re asking the most important question, which is, at what point does something become dangerous and harmful and therefore should not be promulgated? And at what point is it a matter of legitimate scientific discussion? That we don’t want to stifle? Because it might lead us somewhere? If you have the answer to that, I’d love to hear it.\n\nAlex Tsakiris: [00:28:18] I’ll try. First off the idea that YouTube, Facebook and Twitter are not part of what we have all assumed throughout our lives is this free press is really not doesn’t, can’t be sustained. I asked my daughters who are younger, you know what is the New York Times? They barely even know what the New York Times is. So but you ask them what TikTok and Twitter and Instagram, they know that so clearly, Google YouTube and these other platforms, social media platforms, are a part of what we would consider the press. And we do as a public have a vested interest in the extent to which they censor control and shape information. So I would take issue with you right off the bat saying there aren’t First Amendment issues, I think they certainly are. But what I really object to is, Sarah, I just feel like, there’s a real disconnect when people talk about science. And then in the same breath, they say, but we need to control what’s true and what’s not true about science, that the whole endeavor of science is this constant questioning and challenging and retrenching about what we thought was true. It’s like the whole thing of extraordinary claims require extraordinary proof. No, that is completely anti scientific. The whole idea of science is to be not biased, who would be the meta agency that would determine what’s extraordinary and what’s extraordinary proof? Who would be the meta agency that would determine what’s true and not true in order to allow it to be on YouTube. And really the only way I guess, and we’re going to have to do it here, the only way to get to any grounding on this is to start diving into the data, which again, I kind of find is a shortcoming of your book. It’s not like you guys deconstruct any of the issues that you seem to care about. So we could go into climate change, or we could go into again, the masks on COVID-19 would be a perfect one, because we did a show on Skeptiko. And I kind of debated, a guy’s a PhD in biology from MIT. And he was spreading misinformation about masks being effective. And now clearly, we know, and we knew all along, that masks work in the laboratory. But every randomized control trial that’s ever been done, and I can pull up for you just the sampling. I mean, if you look at a meta-analysis, that’s been done on whether mask prevent viral respiratory infections, and they’ll do a meta-analysis of how many did they do in this study 17. Overall, the use of masks in community did not reduce the risk of influenza. Over and over again, these studies have been replicated, and they always generate a null result. And then finally, we had the man himself, Fauci comes out in reveals in an email that he never made public that he knew all along that in terms of public health, not in terms of laboratory not whether you can make a mask work in a laboratory setting, which we all understand you can, but whether from a public health standpoint, they work, he comes out and says, “Yeah, I know, they never worked.” And I certainly know the ones that most people are buying down at the drugstore don’t work. So, hey, let’s do a little reversal, like you guys are talking about, because your book talks about mask wearing as it’s absolutely proven, 100% scientifically. And now we have a reversal of that data. So are we going to, can you guys demonstrate your flexibility or you’re going to be Denying to the Grave that this is not the truth?\n\nJack Gorman: [00:32:27] Well, let’s take the larger issue, though. Which, I still think masks work, obviously. And probably Sarah does, too. I haven’t we haven’t discussed masks in a while. And I don’t have the data at the tip of my fingers the way you just did, which was really great that you had that there. So I’m not going to be able to engage in an informed conversation about it. But no one is suppressing, you decide, right? I got to say in my book, masks work, you get to say your masks don’t work, public sees both sides.\n\nAlex Tsakiris: [00:33:00] Oh, no, that’s suppressed on YouTube. You can’t say that, or you’re banned.\n\nJack Gorman: [00:33:04] You can’t say masks don’t work on YouTube.\n\nAlex Tsakiris: [00:33:07] That’s correct, you will be banned, your video will be demonetized first, then it’ll get a strike. And then it’ll be banned. And there’s multiple, multiple people that can attest to that they have 50 videos that are fine. And then a video like that gets banned all the time happens. I mean, some slipped through and some are banned. I mean, that’s the worst of it is that some slipped through and some are banned.\n\nSarah: [00:33:33] I just saw a little snippet of the study that you pulled up, but I didn’t notice that. It said that all included studies in the systematic review were deemed high risk of bias. And it also said that it wasn’t obviously about COVID-19. Was it specifically?\n\nAlex Tsakiris: [00:33:51] And I guess that’s part of my frustration is like, your points right now catapult us into a real scientific discussion, which is, here’s the data as it existed, pre COVID. Because these are, it’s a meta-analysis of 17 studies done, I think, between 2010 and 2015. So it’s definitely before COVID. So do these studies, are they relevant to our current situation? That’s a real scientific question. And it’s interesting. I think most people think that they are because if you’re looking at viral infections and flu when we went through SARS, we went through all that, probably a good connection there. But then the other thing is, because they found a no result, what are we to make of a null result? They sat, what were the limitations of the study that caused them to come up with a null result? These are all good questions to ask. But what I hear back from people, particularly the policy health makers are and there’s an exact quote, If I want to bother to dig it up is quit grumbling about wanting more scientific studies and just do what you’re told where the frickin mask? Well, when Fauci comes out in the hidden emails that he says this, “I knew that the mask didn’t work all along.” That, to me is the headline story is there’s a disconnect between science and public health policy, there’s no reason to wear a mask, unless you want to wear a mask. There’s no evidence that there’s this overwhelming boost that we’re going to get from wearing a mask. And yet that has been the public health policy. So that’s my problem with it.\n\nJack Gorman: [00:35:36] I would obviously disagree. I think the evidence is there, that masks are effective. Reducing transmission of aerosolized viral infections. As I said, I’m not going to be able to pull up study right now that supports that song [unclear 35:54]. One thing I totally agree with you about is that the open discussion of the data, and the evidence should never be suppressed. [inaudible 36:11]. I think that reason of people can disagree about the effects. Look at the data come to different conclusions. I think there will be more studies done on masks, do randomized control trials masks as you know. And that gets this whole area of when do we want to trust observations, studies [inaudible 36:35], randomized controlled studies. So lots of very interesting sides of the questions here. We have a situation though, where and perhaps you don’t agree with this split. A potentially deadly virus in our midst. So what did we do? And I’m asking you this question, because I think this is a tough question. I think the preponderance of the evidence right now favors effect this tests, you do not. I would argue that if I were looking at all this data, and I was not exactly sure, I’d wear a mask, because we’re going to be asking my opinion, as almost no downside. I think there’s sufficient data to say that it limits the transmission of aerosolized viral infections. So I would certainly recommend it that they wear masks. The next question is, should it be *mandatory*? I don’t [inaudible 37:54]\n\nAlex Tsakiris: [00:37:56] I’m with you, Jack. But then you kind of pull up on the really important one, you want to wear a mask out there in the York, I’ve any problem, anyone can wear a mask, I see people all the time driving around in their car all by themselves wearing a mask. You want to do that, man, it’s your world. And then, I got it.\n\nAlex Tsakiris: [00:38:14] Well, it doesn’t matter. That whole issue is public health policy. What we care about is that whether the public health policy can be made and enforced without science behind it. So what I think, so you can have your opinion, you know, which right you’re open it admitting that you don’t have the data, I at least have a little bit of data and I’ve …\n\nJack Gorman: [00:38:38] [inaudible 38:38] the data with me right now.\n\nAlex Tsakiris: [00:38:40] I’m fine. You don’t have the data at your fingertips. You could find …\n\nJack Gorman: [00:38:44] [inaudible 38:44] it edits, you know, if I had thought knew that we were going to plug this in, I had time to accumulate all of it. Because I’ve been reading these studies as well, like, you bet.\n\nAlex Tsakiris: [00:38:53] Well, I can simplify it. I think I can simplify the argument to a point where I don’t know that we’ll find agreement, but we’re already kind of closer to agreement than it might seem on this in that pre COVID, our public health policy interface between mask science was no mandates. So pre COVID, we were not mandating that people wear masks when there was flu outbreak the prior year and all the rest of that there was none of that. So I would suggest to you that again, what I think your book should be about is what kind of science would we need to tip that over? Not tip that over to a “Hey, I recommend that you really ought to look into this. You ought to do your own work and you ought to wear a mask.” What tips had over to know I can now mandate that. And now to the situation we’re in now, where we have a president, a president who is in this is absurdity. This is science completely run amok, in my opinion, is threatening, imposing mask restrictions for people who do or do not take the vaccine. So take out whether you are pro or against the vaccine, since when would a policy that is supposed to be driven by science, and about the welfare, the health and welfare of the population? When would that be used as a threat? I mean, either it’s good and you should do it or it’s not we don’t threaten it like, “Hey, if you do this, you won’t have to wear the mask. If you do that we won’t.” But that’s where we’re at. That is science really run amok? In my opinion, what do you guys think?\n\nJack Gorman: [00:40:36] I don’t want to do all the talking here, Sarah.\n\nSarah: [00:40:38] I’m wondering if maybe this is not a good question to ask. But I’m wondering if you could tell us some of your suggestions for how to contain that epidemic? I’m really curious, because I hear that you’re no don’t think masks are good idea. I’m not sure where you stand on vaccines. What are some things that you’ve been hearing that you think are good?\n\nAlex Tsakiris: [00:40:57] I’m glad you asked that question. I resist going there. I really am about the science. I really am about the method; I really am about the way it gets done. And I’m about a healthy discussion. I’m constantly like you guys are too I think, trying to absorb more and more information in order to figure out what’s real, what’s true, what’s best for my family, what’s best for me personally. So, that is a moving target. But it is a moving target. We can move along and talk about any other topic, we can talk about climate change, or global warming, same thing. We’re constantly getting new information, new data, and we’re trying to make the best decisions about what we should do. This show is primarily, 500 shows 480 of them are about consciousness, and about this kind of what I consider to be an absurdity. And Jack, you said you’re a religious guy. I don’t know about you, Sarah. But science has insisted that we are the consciousness is essentially an illusion. We’re biological robots in a meaningless universe. This has been falsified over and over by science that there really is something there really is a spirit when you’re in church, or in synagogue, that there’s something there’s a realness to that behind it. That’s what this show was been about. But where that information took me is to really try and understand science and understand how science is manipulated and jury rigged, like you guys talk about. Now I’ll switch gears for a minute here. You guys talk a lot in the book about global warming. There’s not one reference to climate gate. Climate gate is probably the most classic example from 2009. Remember climate gate for people are listening or don’t remember, what was his phrase? Hide the decline. So scientists conspiring against you guys really believe in conspiracy theories. Here’s a clear conspiracy theory. We caught these guys with their emails, conspiring with each other to falsify data to mislead Scientific Review Boards by hiding the decline. And they even said how they would do it, how they would manipulate the data in order to hide the data that was coming in, that looked like there was increased temperature was actually declining. Doesn’t that hit both buttons? Doesn’t that hit? There’s a conspiracy theory clearly. And doesn’t that kind of call into question raised the point of how we have to be careful about people who are manipulating science?\n\nSarah: [00:43:40] Climategate would you call climate gate doesn’t mean anything to me whatsoever. And the bottom line is that climate change is a real phenomenon. That is the greatest existential crisis that we face today. So that is the bottom line there. I’m, I’m not sure what to make of your picking and choosing and cherry picking among these different emails, things like that. Because on the one hand, you say you want to have a scientific discussion. On the other hand, you want to get away from science and evidence and talk about what’s in people’s emails. I’m not exactly sure how those things call each other.\n\nAlex Tsakiris: [00:44:26] Sarah, do you have anything to I’m sorry? Go ahead.\n\nSarah: [00:44:29] No, I just certainly don’t want your listeners to leave by thinking that climate change is not real for any reason because [inaudible 44:37] terror.\n\nSarah: [00:44:39] I just going to add that it and they agree with that but also slightly different point, which is that we at no point do we say we don’t believe in conspiracy. Conspiracies do happen. Watergate, definite conspiracy and many other things like that. So and I think that it’s hard to tell when some things that conspiracy and when something’s just sort of a mock conspiracy that someone’s come up with. So, I don’t have an easy answer to that. But I just wanted to correct that. It’s not true that we don’t believe in conspiracies, we definitely do and in science, too, they happen in science everywhere.\n\nAlex Tsakiris: [00:45:17] Okay, so I don’t know if this feels like it’s far afield, or not Jack, you can be the judge of that. But again, I separate out the issue of whether manmade global warming is substantiated by the data, we can almost put that aside from the discussion of climate gate. So I just pulled up on the screen, the email from Phil Jones. That was he didn’t reveal it was a whistleblower who leaked his email. And it says, I’ll read it. “I’ve just completed Mike. That is Michael Mann. His nature tricks of adding the real temps to each series for the last 20 years to show him how to hide the decline.” Now, there’s no other way to interpret that other than scientist conspiring colluding to hide the decline. That is the decline in temperatures in order to bullshit scientific peer review committee that was looking at their paper and to bullshit the UN Climate committee. I don’t know how else to read that other than that.\n\nJack Gorman: [00:46:38] Again, we can spend a lot of time there’s a lot, many, many ways there’s been this, we’ve gone over a million times have lots of different ways to read that. And that’s not what they meant. But, again, like, the thing that would concern me the most, at this point, is for your listeners to get misled into thinking, for example, that vaccines don’t work or that climate change is real, or things like that, based on a misinterpretation of some emails, we really don’t want that to happen. That would be really tragic. If people …\n\nAlex Tsakiris: [00:47:18] Well, you’ll pick as tragic. I think that’s what your book is all about. I don’t agree with what you’re saying. So I think we would have a vigorous scientific debate about all those things.\n\nSarah: [00:47:27] So we couldn’t and that would be great to have that I wouldn’t be the one to debate that with you, but I think vigorous debates always wonderful. A vigorous scientific debate that honestly and carefully rigorous data, would conclude that climate change is occurring to be known.\n\nAlex Tsakiris: [00:47:54] What’s Jack? That’s kind of dogmatic. I mean, that is your opinion. And I appreciate that. That’s your opinion. But I can just, and you’re not going to you can tell and call uncall on this anytime or call when you don’t want to kind of engage in this. But here is my favorite person on the other side, if you will, Judith Curry client climatologist from a Georgia Tech head of climatology department. And not only that, but somebody who was on the climate alarmist side initially, and then changed her position based on the data and here she is kind of preaching to a guy in the congressional hearing, what was the guy’s name again, Congressman Bayer. And she points out that so we could get into that debate. That’s probably out of scope of what we’re talking about here. But there’s a lot of folks that just wouldn’t agree with you. And for the record, your credentials in our stellar from psychiatry and your fellowships, Columbia. I respect all that. But if I want to go climatology, I’ll go to Judith Curry from Georgia Tech before I go to Jack from …\n\nJack Gorman: [00:49:13] By all means. And you should and I would go to the 97% of climate scientists who agree that climate change is a real phenomenon. And Dr. Curry be in a minority, and we could put 97 against three and let them have their debate. I’d be delighted to do that.\n\nAlex Tsakiris: [00:49:35] … I don’t think you have the data here is Dr. Curry’s post on the 52% consensus. If you really look at the cook, peer reviewed paper from which that 97% is derived. If you look under the hood, it’s an example again, like climate gate of just scientific scandal. What this did was have a bunch of grad students, evaluate abstracts from climate papers, and then make a value judgment on their part whether or not they thought they agreed or disagreed on something that he made up that has been one of the most thoroughly debunked. So, there’s some good science if you want to advance global warming idea, but don’t go the 97%. That’s been completely debunked. In here again, Dr. Curry from Georgia Tech, a real climatologist shows you the survey of the American Meteorological Society, who is really the group, the kind of people that we would want to ask the question of whether they think manmade global warming is a concern, and her data is 52%. So, again, it takes a lot to hash through all that stuff. And we can’t do it right here right now.\n\nSarah: [00:50:59] Right. I wish I had this what you wanted to do, because I would have brought more climate scientists, along with me that I’m sure you’ve done that already. I’m sure you’ve had programs, which you’ve had people on both sides, and let them show its climate sides very, very difficult. I don’t claim to be a climate scientist. It’s very, the math that those guys use is so complicated, that you really do have to rely on experts to come to conclusions like that. What else you got for us today?\n\nAlex Tsakiris: [00:51:35] Well, we can definitely move towards wrapping it up. I tell you one thing I got right from the finish. This this thing you wrote on conspiracy theory, I thought was, we think it’s reasonable to say, even without any data to support it, that most people have never been part of a conspiracy, or even known a person who has. And the thing that struck me is, man, first of all, I grew up in Chicago, where I don’t know how it is in New York, but you don’t get anything done without paying somebody off influencing somebody. Everything is a free. And then I was a research associate at the University of Arizona for it. And I left because I thought, the Ph. D process, and that whole thing was very political, quote, unquote, which is also conspiratorial, and then I got into business, and I had a business and built my business, I’m sold it to NASDAQ company, everything about that everything about business, everything about large financial transactions *this holiday’s* like conspiracy, you’re not telling the other side, isn’t it? So I, that just struck me as just kind of exactly the opposite of my experience. But then what you said was, you said the first one you use as an example of a conspiracy, and my audience will love this. A conspiracy was behind the assassination of President Lincoln, but not President Kennedy. And again, since we’ll wrap this up, but you guys need to Google United States House Select Committee on assassinations, and then add conspiracy or sound data. I mean, that is the finding of that committee is that it was a conspiracy. They had all the data. And there was this Dallas cop who had left his, you know, little walkie talkie thing on and he picked up the sound data. And there were four bullets on his sound data, which then throws out the lone nut assassin thing. And their conclusion was that it’s probably a conspiracy. So over and over again in the book, it’s just kind of a manifesto. I don’t get it.\n\nSarah: [00:53:48] Well, let me just say as we wrap it up. I definitely admire the thoroughness with which you research all these things. I think it’s really great. And I certainly was intrigued by the idea of the spirituality angle of your work, because it’s very important to me in my own life, and the way that science spirituality *into set atoms*. As you know, we have the end [unclear 54:16] and they are technical Christian. So it’s quite interesting to think about how these things intersect with each other. So I think it’s quite interesting, despite the fact that we obviously disagree about many things. I do think that your advocacy for open scientific debate is really terrific.\n\nAlex Tsakiris: [00:54:43] Well, thank you very much, Jack. Sarah, do you have any other thoughts that you’d like to add or anything else? You know, it’s been my kind of going on about the book. What else do you want to tell people that you feel they will find most useful in the book?\n\nSarah: [00:54:59] No. I would agree with what Jack said. And I think that hopefully there are tips in the book that can help people, when they’re making any kind of health decision. It doesn’t have to be about something that’s quote unquote, contentious. It could be about anything that you have to make a decision about related to your health. Hopefully, that there are tips in the book that and ideas that give you a sense of where you might have trouble making that decision where you might, let your emotions get the better of you and where you can seek more information and make sure that you’re making the decision in a calm way so that you’re making the best decision for yourself and your family. I think that you can find some of that in the book and just to become self-aware. And hopefully that will be helpful to people in their health in general.\n\nAlex Tsakiris: [00:55:50] Awesome. Well, as I said at the beginning, these kinds of discussions are sometimes difficult to have, and that’s why they’re not done more. So I’m glad we were able to do it. And I think we did it right with a lot of respect. And I wish you guys the best and I thank you for coming on Skeptiko.\n\nJack Gorman: [00:56:09] Thank you for having us.\n\nAlex Tsakiris: [00:56:11] Thanks again to Sarah and jack Gorman, for coming on Skeptiko the one question it up from this interview is should scientific discussion be banned on YouTube? Do they have the right to do it because they’re a private company? Let me know your thoughts. Lots more Skeptiko coming up. Stay with me for all of that. Until next time, take care and bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "Sara and Jack Gorman, Deniers Denying Deniers |515| - Skeptiko - Science at the Tipping Point", "description": "Dr. Sara Gorman and Dr. Jack Gorman offer strong opinions about science as they know it. Subscribe:   Click here for Sara and Jack Gorman’s website Click here for forum Discussion   skeptiko-515-Sara-Jack-Gorman Sky News Australia, Promo: [00:00:00] There’s no doubt speaking up takes Heriot. But we want to be your voice when you really […]", "url": "https://skeptiko.com/sara-and-jack-gorman-deniers-denying-deniers-515/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2021-08-25T14:37:04+00:00", "article:modified_time": "2021-08-25T14:42:59+00:00", "image": "https://skeptiko.com/wp-content/uploads/2021/08/skeptiko-515-sara-jack-gorman-1.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Sara and Jack Gorman, Deniers Denying Deniers |515|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/qiaPNw4c3GQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/qiaPNw4c3GQ?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-515-sara-jack-gorman.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-515-sara-jack-gorman.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-515-sara-jack-gorman.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "https://www.skeptiko-forum.com/threads/sara-and-jack-gorman-deniers-denying-deniers-515.4739/", "https://www.criticascience.org/about-the-book", "https://www.skeptiko-forum.com/threads/sara-and-jack-gorman-deniers-denying-deniers-515.4739/", "https://www.skeptiko-forum.com/threads/sara-and-jack-gorman-deniers-denying-deniers-515.4739/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2021-08-25T14:37:04+00:00"}