{"result_id": "273017", "URL": "https://skeptiko.com/scientific-evidence-of-afterlife-overwhelming-chris-carter/", "timestamp": "2023-04-25 17:08:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/scientific-evidence-of-afterlife-overwhelming-chris-carter/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Scientific Evidence of Afterlife Overwhelming Says Chris Carter | Near Death Experiences", "cleaned_text": "Interview with author Chris Carter explores the scientific evidence for the survival of consciousness.\n\nJoin Skeptiko host Alex Tsakiris for an interview with Chris Carter author of, Science and the Afterlife Experience: Evidence for the Immortality of Consciousness. During the interview Carter discusses the consequences of accepting scientific proof of an afterlife:\n\nAlex Tsakiris: Are there unintended consequences for overthrowing materialism? Maybe the game is going to wind up being played one way or another. We’re going to wind up with scientific materialism or Church rule. Someone has made the decision that at the end of the day I choose the phony scientific materialism over the thin, phony Church state.\n\nChris Carter: I think that’s a false dichotomy. I don’t think that’s the choice. One of the major themes of my book is that there’s a third alternative, one that does not require a leap of faith and one that does not require embracing the pseudo-scientific ideology of materialism. There’s a third alternative and it is to examine the evidence without prejudice, without materialistic prejudice or religious prejudice, and see what the evidence says.\n\nI believe that the conclusions that the evidence implies are not dogmatic. They do not ask people to go out and burn those who disagree with us at the stake or to wage war against those who disagree with us.\n\nCynthia’s Book: Belief Is So Last Century\n\nToday we welcome Chris Carter back to Skeptiko. Many of you know Chris for his withering attacks on skeptical nonsense and his books, Science and the Near-Death Experience, Science and Psychic Phenomena, and his latest, Science and the Afterlife Experience. Chris holds undergraduate and Master’s degrees in philosophy from Oxford. He’s a very fine writer, and it’s a pleasure to welcome him back to Skeptiko. Chris, welcome back. Thanks for joining me.\n\nChris Carter: Thanks, Alex. How are you doing?\n\nAlex Tsakiris: Great. Everything’s good. This latest book is really fascinating. It’s obviously a topic that we love to talk about here. You really dig into so much. I’m hoping we can talk about the book but also talk about a lot of other things surrounding the book. I’m anxious to have you back on.\n\nChris Carter: All right. That sounds great.\n\nAlex Tsakiris: So, Chris, you begin the book with this: “The manner in which we live our lives, to a large extent, depends on what we believe comes after it.”\n\nFantastic; love it. Tell us more about that quote.\n\nChris Carter: Well, right above where I say that I mention a quote by George Orwell and it goes, “The major problem of our time is decay in the belief in personal immortality.” So that’s what inspired the first paragraph of my book. Orwell’s grim vision of the future, which is portrayed in his novel, 1984, fortunately did not come to pass.\n\nHowever, many of us believe that mankind now faces a future even worse than anything Orwell imagined. We have population growth, we have global climate change, we have increasing income inequality in various countries, including the United States, increasing environmental devastation, basification of the ocean, growing hostilities around the world.\n\nSo I think that mankind needs a new message or perhaps an old message by which he can find a more purposeful and less destructive way of living.\n\nAlex Tsakiris: That’s interesting and that’s certainly one way to take it. It’s very interesting, actually, that you take it that way because I took it in a much more positive, personal sense. And that’s that in one way we struggle with these large social and cultural issues that you talk about, but in another way it’s really more of a personal journey for all of us.\n\nIt’s what decisions we make about the people around us. About how we care for them, about how we think about ourselves and our roles and our lives and what it means in relation to the people that have come before us either in our family or friends who have passed away. In that way, the manner in which we live our lives, to a large extent, depends on what we believe comes after it is a much more optimistic, has a much more positive spin to it, doesn’t it?\n\nChris Carter: I think that yes, the belief in an afterlife most certainly does put a more optimistic spin on our lives. But I think it also makes us more aware of our obligations to each other, to future generations, to not use the Earth’s atmosphere as one big garbage dump and to pay our fair share of environmental damage that we’re causing by dumping 90 million tons of heat-trapping gases into the atmosphere every 24 hours through the burning of fossil fuels.\n\nOn a smaller scale, I suppose, just by treating each other more humanely by looking after others, by voting to sustain the planet and to reduce income inequality. To make the richer people pay their fair share. I hate to sound like some sort of crazy left-wing radical. I’m not. I consider myself a moderate. But I do think that there are very dangerous forces operating in the world today which threaten the long-term viability of human civilization.\n\nAlex Tsakiris: You know, that’s really interesting. I didn’t imagine that we’d jump right into this political, current events kind of discussion but I’m really glad we did. I think it’s an important landing point, if you will, for this whole discussion of survival of consciousness. We’ll get back to talking about the book and survival of consciousness but I want to follow this line that you’re on also because it’s fascinating to me.\n\nWe don’t get a chance to talk about it enough, and that’s that while I share your concern and the issues that you raise are obviously pressing and obvious to all of us, at the same time I can’t help but feel that there’s another way of looking at survival that turns all those issues on their heads. One of the natural conclusions from the understanding of the best evidence suggests that survival of consciousness is real is that it gets us out of this time-limited sense that we live in and this pressing need to fix things now and that time is marching and that evolution is here and this kind of treadmill that we’re on, doesn’t it?\n\nBecause now we’re talking about consciousness really being infinite. And with reincarnation there’s really no way to logically conclude that we’re headed towards anywhere other than just further evolution, wherever that gets to. So isn’t that another natural conclusion that one can draw from this whole understanding of consciousness being unlimited in terms of time? I mean, we have all the time in the world, don’t we?\n\nChris Carter: I agree with you in a sense. I do think that reclaiming the widespread belief in an afterlife, which is something people did have perhaps 300, 400, 500 years ago, would result in many practical benefits. The philosopher, David Griffin, and I agree that belief in an afterlife confers several practical benefits, such as for example, such a belief may help overcome the fear of death. If people are convinced they’re not ultimately subject to any earthly power, this can increase their courage to fight for freedom, ecologically sustainable policies, and social justice.\n\nAnd if people believe that this life is not the final word and that justice will prevail in the next life, this can help them withstand the unfairness they encounter in the here and now. The idea of life as an unfolding journey which continues even after death can lead to a greater sense of connection with the universe as it unfolds into the future. And finally, the belief in life after death can help counter this extreme degree of materialism that has pervaded every niche of modern civilization, which many people think is behind a great deal of our most short-sighted and destructive policies.\n\nAlex Tsakiris: I hear you. I rail against that kind of stuff all the time. You are also someone who is known to rail against those same things and rail against the fundamental materialist, dogmatic, pseudo-skeptic culture that we have. I get all that.\n\nBut let me play devil’s advocate for a minute and talk about social cohesion. I want to take a little side trek with you for a minute and look at the vaccine controversy. Remember that guy, Andrew Wakefield, who said he’s a doctor in the UK; he’s a pediatric gastronomy guy, I think, for kids. He has a bunch of parents coming to him and saying, “My kids have autism and gosh-darn-it, I know it’s directly tied to these vaccines because we went and got the vaccines and boom. It happened.”\n\nSo he’s just a doctor presented with patients having this problem. He starts looking into this and he says, “Hey, I think there’s something to this.” He starts putting it together and wow, he gets slammed, right? I mean, this guy can no longer practice medicine. He’s slammed; and maybe he was right. Maybe we shouldn’t pump kids with nine different vaccines when we’ve never tested the interaction of these vaccines together. Maybe he was right.\n\nBut at the same time, didn’t we need to put this guy down? Didn’t we need to destroy Wakefield? Didn’t we have to protect the herd? We can’t have everyone running out and saying they’re not going to vaccinate their kids.\n\nSo maybe in the same way, when we hear folks like Richard Wiseman say, “Hey, by any other standards psi is proven.” And he could just as easily say, “By the normal standards of any other area of science, survival of consciousness is proven.” He could say the same thing. But then he says, “But we still shouldn’t believe it.” Maybe what he’s really saying is we’ve got to protect the herd. We’ve got to keep this thing going. So when smart guys like you, and I guess me, say we need to end all this materialistic nonsense, where are we taking people? Where would we head if we didn’t have this system?\n\nChris Carter: Right. Well, I’m not going to sit here and endorse the stupidity of the bovine mentality, the herd mentality. The Indians used to drive herds of buffalo off of cliffs because they knew that if they got the herd moving, the first ones would jump off the cliff because the others behind them were pushing them and the rest would simply follow the rest of the herd. So I have no admiration for the herd mentality.\n\nWith regards to Shermer, I don’t think his motivation is to protect the herd. I think his motivation is to promote his career.\n\nAlex Tsakiris: Right. And I hear you. Okay, so bison over the cliff is a great story and it’s true. But there’s another story, too. The other story is the Huns over the hill, right? So we all get real lovey-dovey and start feeling all this we’re all connected and we’re all good and all this stuff that you guys are pedaling. Then the Huns come over the hill and they kill every man, woman, and child because they believe their god told them they were supposed to rule the world.\n\nOr #2, the other thing, is that the Church gets all the power now because what you’re really heading towards is some kind of spiritual understanding. We know where that goes. It’s another power-grab by the bishops or the priests or whoever they want to call themselves. They grab all the power and then they start building all these nice little bonfires and are putting people on them because they don’t think they’re the right ones.\n\nI mean, let’s go there for a little bit, Chris, and not just talk about gee, we want change and we want this—let’s talk about where that change could really lead. These are realistic, unintended consequences of survival of consciousness becoming the mainstream belief system.\n\nChris Carter: In my book I wrote, “The experiences described in the pages that follow have important implications for humanity. Based upon my own experience and that of many others, I sincerely believe that deeply beneficial changes in our view of the universe and our place within it will be gained by those who read about these strange and often wonderful experiences and then they take their profound lessons to heart.” Then I add, “Most people base their beliefs regarding the afterlife on religious or materialistic faith but there’s a third alternative. One that requires neither a leap of faith nor the denial of evidence.”\n\nSo when you’re talking about some of the crimes that were occasionally committed by organized religion during the 15th, 16th, 17th Centuries, yes, those crimes were real. And those crimes led to a backlash known as The Enlightenment in which certain philosophers—not so much scientists—but philosophers such as Voltaire and Diderot and later in the 19th Century Aldous Huxley and others and today in the work of Richard Dawkins and other militant Atheists, their work is essentially a backlash against the excesses of irrational religious belief and religious extremism.\n\nThey, however, have gone to the other extreme. They’ve embraced a doctrine of crude materialism which they think is implied by science, which is really not. It’s implied by science which has been long obsolete. Their militant Atheism is based upon this doctrine of materialism and they are going to do everything they possibly can in order to deny or discredit any evidence that falsifies the doctrine of materialism.\n\nAlex Tsakiris: Agreed, but are there unintended consequences for overthrowing materialism? I just want to run that speculation with you, Chris, because we’re both of the same belief in terms of how completely idiotic that is in terms of trying to support that with any real science, any real evidence. But is there a chance that you know what? The game’s going to wind up being played one way or another. It’s going to wind up being played with scientific materialism or it’s going to wind up being played with Church rule. Someone has made the decision that at the end of the day I choose the phony scientific materialism over the thin, phony Church state.\n\nChris Carter: I think that’s a false dichotomy. I don’t think that’s the choice. One of the major themes of my book is that there’s a third alternative, one that does not require a leap of faith and one that does not require embracing the pseudo-scientific ideology of materialism. There’s a third alternative and it is to examine the evidence without prejudice, without materialistic prejudice or religious prejudice, and see what the evidence says.\n\nI believe that the conclusions that the evidence implies are not dogmatic. They do not ask people to go out and burn those who disagree with us at the stake or to wage war against those who disagree with us. Or on the other hand, to deny or suppress evidence. I think there’s a third alternative.\n\nI’d like to read something from my book here where I briefly discuss that. It’s in Chapter 1 and I say, “The deniers and debunkers tend to be militant Atheists who are motivated by allegiance to an obsolete worldview by ignorance of the implications of the new physics and by a hatred of religion and superstition. If they admitted to the reality of psychic abilities such as telepathy and of the near-death experience as involving a genuine separation of mind from body, then the materialistic foundation of their worldview would crumble. The deniers fear that the demise of materialism would usher in a return of an age of religious persecution and irrationality.\n\nThis fear is evident in the apocalyptic strain of some of the Committee (Committee for Scientific Investigation) writing. For instance, the announcement of the founding of the Committee for Scientific Investigation of Claims of the Paranormal stated, ‘Perhaps we ought not to assume that the scientific enlightenment will continue indefinitely. Like the Hellenic civilization, it may be overwhelmed by irrationalism, subjectivism, and obscurantism.’”\n\nThen I go on to say, “But these fears seem to be absolutely groundless. As mentioned above, surveys show that most scientists accept the likely existence of psychic abilities. Among the general public, belief in the reality of psi phenomena is widespread. But polls have also shown that over 90% of the public regard scientists as having considerable or even very great prestige and many of the leading near-death experience researchers are respected cardiologists and neuroscientists. And so I conclude society is unlikely to return to the Dark Ages because of widespread interest in psychic phenomena and in the near-death experience.”\n\nAlex Tsakiris: Okay. And Chris, I have to say you do build a very, very strong case in the book. Anyone who’s familiar with your previous books will appreciate the level of depth you go into and the extent of the evidence. It’s all very well documented. The way you’ve put it together I think is very, very convincing.\n\nLet’s talk a little bit about the skeptical arguments against survival because you also address those in the book. You jump over on the other side and say, “Here’s my best argument against the skeptical arguments.” You spend some time talking about the materialistic arguments but you really make pretty quick work of a lot of that because it’s mostly nonsense.\n\nThere’s the argument that there isn’t any evidence and that it’s all fraud. You just handle those. You say, “Hey, there’s a ton of evidence and here it is.” You say with regard to fraud there’s always going to be isolated instances of fraud but it’s not reasonable to think that that’s going to account for very much of the best evidence that you’ve put forward in the book.\n\nBut you spend a lot more time talking about the super-psi explanation, or as you call it in the book, the super-ESP hypothesis, as a possible explanation for this survival of consciousness. Explain to us and maybe start by what is super-ESP and then why you think it doesn’t hold up.\n\nChris Carter: Okay, let’s treat this in a historical manner to see just how the super-ESP explanation came to be proposed. For as long as there have been human beings, and for all we know perhaps even longer, there seems to have been evidence suggesting that human beings and perhaps other living things survive the deaths of their bodies. We have the Neanderthals. They buried their dead with flowers and jewelry and utensils, presumably for use in the next life. So all through human civilization we’ve had people believing that they will survive the deaths of their bodies. Many people simply accepted it as a matter of course. It wasn’t questioned.\n\nSo why did they believe this? Well, every indication seems to be that in all societies past and present people have experienced certain phenomena that would lead them to believe in survival. I’m talking about things like near-death experiences, death bed visions, people who report seeing deceased relatives coming to take them away just before they die. Children who remember previous lives—in other words, evidence for reincarnation. Apparitions, which have been reported from all societies of which we have records. And communication with the dead, which also seems to have been found in virtually all societies of which we have records.\n\nSo the obvious inference from this data was that we survive the deaths of our bodies and that sometimes those who have gone before us can return and communicate. Now, later on these beliefs were hardened into various dogmas. With the rise of agriculture came the rise of organized religion and priestly castes and of course, layers of dogma were added to the ancient beliefs in accordance with the conditions of the various societies. Some societies had peaceful religions; some societies had war-like religions and so forth. But they all had various priestly castes.\n\nThis did lead, of course, in some places but particularly the West with its fragmented geography, into various religious schisms which sometimes settled their differences violently.\n\nThen you had the scientific revolution due to people like Keppler, Galileo, and Newton. Now, Newton put forward a theory of physics which was very mechanistic and mechanical. The universe was now seen as a gigantic clockwork mechanism. Newton himself was a religious man. He thought that the planets were originally hurled by the hand of God and he thought that human beings were the sole exception in an otherwise deterministic, mechanistic universe.\n\nBut his followers, philosophers such as Voltaire, Diderot, and so forth, they wanted to attack the authority of the Church. The horrors of religious wars were fresh in their minds. So they used Newtonian physics to support the ancient philosophy of materialism, which essentially says that all that matters is matter and the mind is at most a useless epiphenomena, a by-product produced by the brain. So therefore, minds have no causal role in nature. The universe is causally closed. We should not believe in superstitious things or in organized religion.\n\nThen, of course, Darwin came along with his theory of natural selection based upon natural selection operating upon random variation in order to…\n\nAlex Tsakiris: You mean Alfred Russel Wallace came along, right?\n\nChris Carter: Darwin and Wallace invented their theory of evolution by natural selection at just about the same time. Wallace probably came up with it first. It’s hard to say. Then Darwin basically panicked and decided to publish his book.\n\nSo anyway, this was further ammunition for the militant Atheists. And so in response, the British and American Societies of Psychical Research were formed, first in England and later on in Boston. They were horrified by the materialism which was helping to sweep away spiritual beliefs. So they wanted to take on the materialists at their own game. They wanted to find scientific evidence for survival.\n\nAnd so they did. They found evidence of survival from apparitions and from communication through mediums. Then they seemed to have good evidence, good experimental evidence in favor of survival. The hypothesis that extrasensory perception could be used to explain these mediumistic communications was put forward. It was perhaps the mediums are very gifted in terms of extrasensory perception, in terms of telepathy and clairvoyance, and they’re simply reading the minds of the sitters in order to convey messages that seem to be from the deceased but are actually from the minds of the sitters.\n\nAlex Tsakiris: Right. So that’s your super-ESP hypothesis, right?\n\nChris Carter: No, not yet. That’s the ordinary ESP process. What happened then was an experiment was proposed. The so-called proxy sittings. And that’s where one person sits with the medium on behalf of a third person who is not present. The person who sits with the medium is told nothing more than the deceased person’s name and date of death. So they don’t know the person; they know nothing about the person except for that. They go see the medium on behalf of that person as the so-called proxy sittings and then see if you get results and see if the results are as good as if the person was there.\n\nWhat they found is that the proxy sittings gave results every bit as good as if the sitter who knew the person was there. So this conclusively proved false the idea that the medium was either fishing for information—in other words, looking for visual cues and following up on visual cues and so forth…\n\nAlex Tsakiris: Chris, remind everyone what timeframe we’re talking about here and who are some of the key players, both mediums and scientists who are investigating and really scrutinizing very carefully these mediums for any kind of fraud or impropriety. Throw out some names.\n\nChris Carter: Well, the British and American Societies of Psychical Research were really in full swing from about the year 1800 to about 1935, 1940. That was the heyday of psychical research into these things. Some of the people were physicists, Sir Oliver Lodge…\n\nAlex Tsakiris: Who at the time was one of the most respected intellectuals and scientists of his day, right?\n\nChris Carter: That’s absolutely right. There was Henry Sidgwick, the Cambridge philosopher. Frederic Myers, a scholar of classics at Cambridge. Mr. Hodgson and several others. William James in the United States. So there were some of the best intellectuals of the time. Scientists, philosophers, statesmen.\n\nSo anyway, the proxy sittings were invented and it ruled out fishing, where the medium fishes for information based upon various clues. They might say, “I see a man with dark hair.” If the person goes, “Hmm,” they go, “Yes, yes. He’s a man with dark hair. I see a woman with blonde hair. No? No one with blonde hair? Okay, let’s forget that.” That’s the technique of fishing.\n\nProxy sittings effectively ruled out fishing for information and they also ruled out telepathy between the medium and the sitter because the sitter didn’t know any of this information. Yet correct information was conveyed again and again. Just as good as if the sitter had known the person in question.\n\nSo what happened was since the proxy sittings ruled out telepathy between medium and sitter, the extrasensory perception hypothesis of communication was extended further and further and further in order to cover proxy cases. In order to cover the so-called “drop-in” cases where somebody drops in unknown to the medium, unknown to the sitter, yet also provides information that later turns out to be correct.\n\nAlex Tsakiris: So give us an example of how this ever-expanding hypothesis gets spun out there. How do they say it?\n\nChris Carter: It’s supposed to work with a degree that’s seldom if ever seen, apart from such cases of communication with the alleged deceased in question. If you look at extrasensory examples of telepathy and clairvoyance in real life they’re very low-level sorts of events. Telepathy is Latin for “distant feeling,” tele meaning distance, pathy meaning feeling as in sympathy and empathy. So telepathy literally means distant feeling. Clairvoyance means clear vision.\n\nIn real life these sorts of abilities almost always work between people who have some sort of close emotional connection. In the proxy sittings these people had no close emotional connection, yet extra-sensory perception was said to exist just as good as ever, with no reduction in ability.\n\nThe theory of super-ESP takes the theory of extra-sensory perception and it postulates that the mind of the medium has these supernormal abilities to access information anywhere, anytime, from the minds of people regardless of what those people are thinking. Regardless of what those people might be doing. Unlimited ability to access the minds from books which are at unknown locations on topics of no interest to the medium. And then it’s extended even further to assume that you can then dress up this information from the perspective of the deceased person in question. It gets even worse than that.\n\nThe problem with super-ESP is that it’s continually extended to cover each new case which cannot be explained on the basis of ordinary extrasensory perception.\n\nAlex Tsakiris: Chris, let’s talk a little bit about proof. At the end of the book you conclude by saying that there are three levels of proof. Proof beyond all doubt, proof beyond all reasonable doubt, and preponderance of evidence overcoming accepting the preponderance of evidence. Tell us where you fall in that scale regarding the belief that consciousness survives bodily death.\n\nChris Carter: In that chapter I have a section titled, “Theory of Knowledge,” in which I first define knowledge. I would define knowledge as a belief that meets the following three criteria: first of all, it is justified by a critical evaluation of the evidence and so therefore we have good reason to think it is true. Furthermore, we have no good reason to think it may not be true. For instance, consider my belief that I have only one brother.\n\nI believe this to be true because I was raised alongside them and I never saw my parents bring home and raise another boy. I therefore have good reason to consider this belief true. Furthermore, I have never heard any rumors about my mother giving up a boy for adoption before I was born, nor has anyone bearing a family resemblance or not ever approached me claiming to be my long-lost brother. I therefore have no good reason, or any reason for that matter, to suspect that my belief may not be true.\n\nNow, could I possibly be mistaken in my belief? Of course. But my point is that I have good reason to think my belief is correct and no good reason whatsoever to think it may be false. I therefore consider my belief that I have only one brother to be an item of knowledge. In other words, I consider it to be a fact. So knowledge is a category of belief.\n\nIt’s those beliefs we have good reason to think are true and no good reason to think may be false. So I consider a fact to be an item of knowledge. After a fairly long discussion, which I really can’t do justice in a brief phone call, I do conclude—as others before me have concluded—survival of consciousness past the point of biological death is a fact.\n\nAlex Tsakiris: A fact in which you say in the book is that’s proven to you beyond all reasonable doubt. I think that’s great. It’s great that you’d come out and are that bold to say that because as you know, most folks who we expect to be proponents usually fall into that, “Well, the preponderance of the evidence overwhelmingly suggests…” but they won’t go and say, “Hey, beyond reasonable doubt this is it.” You push it to that next level. What does that mean for you? Why is it important to go there and say this is the way it is? It’s beyond all reasonable doubt you survive your bodily death.\n\nChris Carter: Why is it important? Hmm.\n\nAlex Tsakiris: Let’s be real, right? Take NDE researchers. When you dig into these NDE researchers you can tell that’s what they believe, right? But very, very few of them say it that way. They always just backpedal a little bit and play it safe with the party line, if you will. The evidence is all up in the air but it seems to be leaning this way.\n\nI understand–you’re not an academic in an institution that requires you to hold any party line. But you do understand that your position is pretty bold, right?\n\nChris Carter: Yes, it is. I also think it’s an important statement to make. As I said before at the beginning of this conversation, I think that if more people recognized that survival is a fact, first of all, I think it would bring a lot more happiness to their lives. It would bring them a lot more optimism and it would reduce cynicism. I think it would reduce anger and vindictiveness, bitterness. And I think it would lead people to lead better lives.\n\nAlex Tsakiris: But aren’t there a lot of steps in-between there, Chris? That’s the one thing, I guess, that I took away from this. I’m on a similar journey that you are on in terms of this information, this data, this knowledge. I think it can be personally transformative. I have not had a near-death experience. I haven’t had any profound spiritual transformational experiences. I’ve had an experience of transformation via the data. Via the experiences of others, the people that I respect that I think have done a fair job of trying to sort this thing out and said, “Hey, this is where the truth seems to lie.” So I am with you on all that.\n\nBut I have to tell you, the people that I encounter in my day-to-day life, 1) they’re not usually persuaded to change their beliefs by data alone. I don’t know why. I’m kind of wired that way. But I’ve found that a lot of people don’t seem to be wired that way. 2) What seems to get in the way for people are a lot of the steps in-between okay, that’s what the data says and on the other hand, therefore this is how I should live my life. I mean, there’s a lot of questions there. There’s a thousand questions between my accepting that survival of consciousness is real and then my incorporating that into my life.\n\nCarl Sagan wrote a book many years ago, A Demon-Haunted World. Hey, do we live in a demon-haunted world? Science has rescued us from that demon-haunted world. Do you want to send us back to it? Is the world demon-haunted? These are the kinds of questions that I think spring to mind for people when they’re faced with the idea that consciousness survives death but they’re not filled in with all the answers to all the questions that that stirs up. What do you think?\n\nChris Carter: Well, as I said before, I think my book shows there’s a third alternative between blind religious faith and pseudo-scientific doctrine of materialism.\n\nAlex Tsakiris: That’s not what I’m talking about. Okay, so I accept your third rail. I’m all over it. I hear the data. Consciousness survives death. Huge implications for me now. What does that mean? Is it a demon-haunted world? Do I have to be afraid of spirits? What does this mean in terms of survival? How long do I survive? How many lives do I live? Do I go to Heaven? There are a thousand questions that immediately spring to mind that are the real questions that people have, you know?\n\nWe play this little skeptic believer, science versus religion stuff, and that just gets played out in this cartoonish way. But what people are really worried about are the personal questions that lie underneath that. You’ve done a fine job in your book of equipping people with the information they need to approach that first question.\n\nOkay, I can, as a reasonable person, accept that consciousness survives death. Bravo. Hurrah. But right beneath that are the really important questions. What are people supposed to do about those questions? It’s not just a matter of consciousness survives death so let’s save the planet and recycle. Those aren’t the questions that people ask. They have deeper questions.\n\nChris Carter: That’s why I wrote the final section of my book. The final section of my book is titled, “What the Dead Say.” So once I’ve convinced people that the dead have in fact survived and are indeed communicating through gifted human mediums, then I discuss what they say. It’s really those messages, I suppose, which are sources of wisdom and optimism. I don’t think there’s anything particularly horrific in there. There’s nothing about eternal hellfire.\n\nThe dead to say the old saying, we shall sow as we reap. That has truth to it. But they also say there’s no eternal hellfire. They talk about a gradual process of development on the Other Side. Many of us will return to this Earth to reincarnate. They say this does not happen 50, 100, 1,000 times. The average human being, according to the deceased communicators, only reincarnates two, three, perhaps four times at most.\n\nSo if people have questions like that, all they need to do is simply read the very last section of my book.\n\nAlex Tsakiris: I’m kind of with you on that, Chris, but as you know, those accounts, they vary tremendously.\n\nChris Carter: I don’t think so. I find enormous similarities between the different accounts. I explicitly point them out.\n\nAlex Tsakiris: We’ve talked to folks on this show that have all sorts of varying ideas about that. People who are mediumistic, people who channel, people who do all sorts of things. You can also look over in the near-death experience literature which also gives these direct accounts.\n\nGo to www.nderf.org, Jeff Long’s website, where he’s compiled 2,000 of those accounts. They vary tremendously. You’ll hear very religiously oriented, “I met Jesus and he said this,” versus all sorts of different accounts. So don’t we have to be a little bit careful when we start doing content analysis there and saying we can pull it apart and this is what it indicates? I just don’t think that’s the case.\n\nChris Carter: I can’t comment on Long’s work. I have a whole section called, “Near-Death Experiences Across Cultures,” in my second book, Science and the Near-Death Experience, and analyze near-death experience accounts from various cultures, China, India, Maori, New Zealand, Native Americans, and what I’ve found is that journeys to other worlds, out-of-body experiences, and encounters with the deceased and other worldly figures seem to be the most universal features of the near-death experience.\n\nBorders of some sort are also found in accounts from different cultures. But tunnel and life review experiences seem to be mostly confined to the West. So I disagree that near-death experience are vast and varied. No two are exactly alike but myself and other researchers have found very great similarities between the near-death experience…\n\nAlex Tsakiris: I think you’re taking what I said in the wrong way. I mean the skeptical argument that they’re vast and varied, no, I’m not going there. I’m very much a believer that near-death experience accounts bring us closer to a deeper understanding of part of what happens in this journey beyond our physical deaths. I’m not going there.\n\nI do think, and I think many people would agree with me, I’ve had the leading near-death experience researchers on the show and they’ve agreed that there really isn’t a good explanation for some of the varieties. Sure, we can look for the similar patterns and those are important and they’re certainly important when you’re debating or arguing against a skeptic who says, “Gee, we have to throw out all these accounts because they’re all over the board.” No. That’s not the case.\n\nBut if we’re really trying to do a content analysis, I think a lot of near-death experience researchers will agree that they’re challenging material. It can be all over the board. And the same thing with mediumistic readings. They can be very challenging in terms of figuring all that out.\n\nBut you know what? I’m glad you addressed it in that section of the book and maybe that’s where someone has to take over and take their own personal interpretation of the material and decide how they’re going to take it forward.\n\nLet’s do this. In the little bit of time that we have left, let’s talk about where you go from here. This is kind of an important wrap-up for you. This was a trilogy of books and a fantastic three-book set that you put together. Where do you go from here with this, Chris?\n\nChris Carter: I’m not really sure, to be honest with you. I wrote an article in The Journal of Near-Death Studies in response to an article written by a skeptical anesthesiologist named Gerald Woerlee. He attempted to debunk the famous Pam Reynolds near-death experience which occurred when she was clinically dead, basically.\n\nBriefly, they had to operate to remove an aneurism from her brain stem and to do so they had to clinically kill her. They had to stop her heart; they had to drain all the blood from her body; and then remove the aneurism from the base of her brain. During this experience she had one of the deepest near-death experiences ever recorded, showing many of the classic features found in most near-death experiences from around the world. For instance, feelings of peace, out-of-body experience, travel to another worldly realm, and meeting with deceased relatives.\n\nSome people say near-death experiences are all over the map. No. The best ones, and most of them, include those three core elements, including those experiences found in different cultures. I don’t care where you’re looking. You can look in Guam, you can look in Maori, New Zealand, American Aboriginals, wherever. Those core experiences will be found in near-death experiences. Some idiosyncrasies will be found, yes, but they’re usually trivial.\n\nAlex Tsakiris: But Chris, why do we want to go there? I mean, why do we want to say something like that? That seems to suggest we understand what’s going on, what realm they’re going to, what dimension they’re going to. Broaden it.\n\nI just had Eben Alexander on the show, a month or so ago, a former Harvard neurosurgeon who had this dramatic near-death experience. Very transformative for him. Where he’s going with the work is to look broadly at spiritually transformative experiences, right? Somebody has a Kundalini experience or somebody just has a spontaneous experience walking down the street.\n\nYou can find scores of these people in mental institutions because that’s where they wind up. They’ve really had a real awakening, a spiritual awakening, that we don’t fully understand and yet they wind up in mental institutions. But that’s another story for another time. But I think when we start going down that path and saying these are definitely the core experiences or the best experiences, we don’t know what the heck we’re talking about. We don’t know what that means.\n\nTomorrow I’m scheduled to have an interview with Robert Bruce, one of the best-known out-of-body experience travelers, astral travelers, in the world. He’s been at it for 30 years. He’s going to tell me a very detailed topography of the spirit world and all these different dimensions that he’s traveled to, both higher and lower. I don’t know how much of that is true but that’s certainly his experience. He has scores of people who back him up on that.\n\nWhat I say is we just don’t know. We cross the chasm from this ridiculous materialism that we’re in but then we have to be really careful because when we do cross that chasm, a lot of things that we try and say aren’t going to make a lot of sense. We can’t take this same scientific precision and bring it to that other dimension. It just doesn’t fit.\n\nChris Carter: I agree with that. But my point it that I have read a great deal of accounts describing the so-called afterworld and what I find is a great deal of similarity. I also find the deepest accounts explain discrepancies between the other accounts. In other words, the people who have been there the longest. So I don’t find that the reports are all over the map.\n\nBut then again, I don’t read or listen to every single—shall we say—New Age account or wild claim that is presented out there. I go only for what I consider to be the best, most reliable, most well-documented reports. I find a great deal of similarity in my reports and I discuss this similarity in my book, Science and the Afterlife Experience.\n\nAlex Tsakiris: I hear you, Chris. I just think when you start saying we only reincarnate two or three times, man, we have no clue. No clue.\n\nChris Carter: I didn’t say I personally think we only reincarnate two or three times. I said that that was a claim made by one of the communicators whom I regard as being the most trustworthy of the communicators, Frederic Myers, who established his identity over about 30 years through the famed cross-correspondences which convinced a great number of his friends and colleagues that it really was him communicating through mediums in various parts of the world. Mediums that did not know each other.\n\nSo after about 25 years after he had gone through this extensive period of launching these cross-correspondences, which are essentially literary puzzles, he then sat down and dictated in two books through the medium, Geraldine Cummins, his account of his experiences in the afterworld and what he had learned. I consider that account to be one of the best.\n\nAlex Tsakiris: Fair enough, Chris. I think I got you sidetracked. You were about to tell us a little bit more about where you think you might be heading. You were talking about your confrontation with Gerald Worley. What is coming up for you?\n\nChris Carter: Possibly some film projects. The first one may involve a challenge that I threw out to Gerald Worley. He said that the famous Pam Reynolds case could be explained in terms of some lingering sense of consciousness, some anesthesia-induced fantasy, and this sort of thing. I basically tore his arguments apart and then I challenged him.\n\nAt the end of my article I said, “Gerald, let’s go to the Barrow Neurological Institute in Phoenix, Arizona and let’s do this experiment. You and I will be prepared just as Pam was prepared before her operation and we’ll see. We’ll see if we can really hear people talking in the room, if we can really describe what’s going on in the room, and if we can really hear the song, “Hotel California.”\n\nAlex Tsakiris: Fascinating. Now that would be an experiment that I would tune in to watch. I hope we get that on my local cable network. Chris, we’re running out of time. It’s been great to have you on. I wish you the very best of luck with the book that is out now and everyone can get on Amazon. The title is Science and the Afterlife Experience. Again, Chris, thanks so much for joining me on Skeptiko.\n\nChris Carter: Thanks, Alex. If your listeners are interested they can actually go to the book’s website. It’s the same as the book—www.scienceandtheafterlifeexperience.com. They can read excerpts and endorsements and so forth.\n\nAlex Tsakiris: Great. By the way, there are a ton of fabulous endorsements. I think that speaks volumes for the progress you’ve made and the respect that you’ve earned in this field. You obviously have a lot of supporters. Well-earned and best of luck with your future endeavors, whatever they might be.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientific Evidence of Afterlife Overwhelming Says Chris Carter | Near Death Experiences", "description": "Interview with author Chris Carter explores the scientific evidence for the survival of consciousness. Join Skeptiko host Alex Tsakiris for an interview with Chris Carter author of, Science and the Afterlife Experience: Evidence for the Immortality of Consciousness.  During the interview Carter discusses the consequences of accepting scientific proof of an afterlife: Alex Tsakiris:   Are […]", "url": "https://skeptiko.com/scientific-evidence-of-afterlife-overwhelming-chris-carter/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2013-02-12T19:42:38+00:00", "article:modified_time": "2017-07-25T20:06:03+00:00", "image": "https://skeptiko.com/wp-content/uploads/2015/07/202-chris-carter-Scientific-Evidence-of-Afterlife-yt-e1436035336281.jpg", "image:width": "560", "image:height": "315", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=_iysIF-93Cc", "https://skeptiko.com/scientific-evidence-of-afterlife-overwhelming-chris-carter/chris-carter-book/", "http://www.scienceandtheafterlifeexperience.com/", "http://beliefissolastcentury.yolasite.com/free-download.php", "https://www.youtube.com/watch?v=_iysIF-93Cc", "http://www.skeptiko-forum.com/threads/202-scientific-evidence-of-afterlife-overwhelming-says-chris-carter.2393/", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-202-chris-carter.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-202-chris-carter.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-202-chris-carter.mp3", "http://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-202-chris-carter.mp3", "http://www.nderf.org", "www.scienceandtheafterlifeexperience.com"], "authors": ["Alex Tsakiris"], "publish_date": "2013-02-12T19:42:38+00:00"}