{"result_id": "273002", "URL": "https://skeptiko.com/dean-radin-quantum-consciousness-experiments-545/", "timestamp": "2023-04-25 17:07:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/dean-radin-quantum-consciousness-experiments-545/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Dean Radin, Quantum Consciousness Experiments |545|", "cleaned_text": "Dr. Dean Radin has shattered the quantum consciousness link question, but where will it lead?\n\nAlex Tsakiris: On this episode of Skeptiko a show about paradigm change. And how, when you get it, it isn’t always what you think.\n\nI have an interview coming up with the fantastic Dean Radin who I can assure you a hundred years from now Students will be studying his work and in particular, his experiments, because Dr. Dean Radin experimentally has destroyed crushed falsified to put it in scientific terms. The longstanding dominant soulless paradigm that we are biological robots in a meaningless universe. and if you think I’m laying it on a little too hard there, give a listen to none other than Joe Rogan, who we can all agreed, love him, or hate him is one of the most influential media sources in the world today higher than anyone you’ll see on cNN Fox and mSNBC. I mean, from a number standpoint, many, many more viewers. Here’s Joe yacking it up with our old friend of me, Michael Shermer.\n\n[00:01:04] Michael Shermer: but if you think about it, from a simple, , the entire universe is in your brain and when you cease to exist, the universe ceases to exist. It’s just sort of true by definition. Now he goes a little bit further and says, you know, that consciousness is everything.\n\nAnd that we bring into existence material stuff by thinking about or observing it or whatever. And here’s some quantum physics experiments that are really spooky and it’s like, okay, time out. You know, quantum physics is weird and spooky consciousness is weird and spooky. That doesn’t mean they’re connected.\n\n[00:01:33] Alex Tsakiris: So you see it now, right? You see Shermer is just wrong. Or put it in another way. Uh, his claims had been falsified experimentally. By none other than the work of today’s guest. Dr. Dean Radin.\n\nThe spooky weird things with quantum physics. Are related to consciousness and we can show it experimentally. Here’s a clip from the interview coming up with Dean.\n\n[00:01:56] Dr. Dean Radin: Well, so we’re trying to connect it to quantum mechanics. And so I’ve done that in two ways. The first way is using a double slit optical system to see if you can gain which path information, which is the, which of the two slits of photon goes through. And so we’ve, we’ve now done about two dozen such experiments and, some of them work then some of them don’t work, but if you do a meta analysis across the board, it looks like there’s pretty good evidence that something is going on, that the consciousness is involved in some way in the quantum process.\n\n[00:02:31] Dr. Dean Radin: I also want to add in , one other quantum oriented experiment that we’ve more recently published, which involves the use of entangled photons as the target of a mind matter interaction, because he wanted to look at non-local mind interacting with non-local matter. And did it do anything?\n\n, Part of the experiment was looking at, could you increase the strength of entanglement and then intentionally decrease the strength of entanglement? The short answer is yeah, we were able to modulate it.\n\n[00:02:58] Alex Tsakiris: , but like I said, at the top of the show . Paradigm change never goes exactly the way you think.\n\nTake Dean’s latest plan has biotech venture that seeks to jam people in the arm in order to change their DNA. Of course to fix their brain, which I thought were past the brain consciousness thing, but anyways, to fix their brain, so they’re not depressed, so they don’t have Alzheimer’s. And maybe they’re a little bit more psychic than they were before and maybe they’re even a little bit more connected, consciously more like a hive mind kind of thing.\n\n[00:03:31] Dr. Dean Radin: So I wrote a story which is designed to be an anti. To mow the way that psychic phenomena are usually portrayed in entertainment, , so think about the invasion of the body snatchers and the Borg in star Trek and virtually every other example where you have a hive mind, which is presented as the most horrific thing that you can possibly do. And we’re saying in this story, no, it is not only not horrific. It is the best possible thing that we can do too, because it pulls together something which is already interconnected, but we beat, we sort of behave in an illusory way that we’re separate and we’re really not connected.\n\nIt just that disconnection, that leads to the kind of madness that we’re currently seeing in Ukraine, right? People ad literally shooting at each other and not appreciating the fact that at a deeper level, everything really is interconnected, including. So this is part of the, of the plot line and the story where there’s a tension then between people who, who in this case take a genetic enhancement and become a, uh, a group mind.\n\nEssentially, everyone outside the group mind thinks that this is scary. We need to stop that it’s bad from inside. This is the best thing that ever happened. This is like the difference between homosapiens and homeless superior. If we, if we’re gonna survive, we need to advance as a species. And so the story is basically making the case that homo sapiens is dying and we have to, we either die or we evolve.\n\nWell, the evolution is going towards a new kind of human, and if it needs a little genetic push to get there. So be it.\n\n[00:05:17] Alex Tsakiris: So the question about whether or not this biotech is going to happen is really not a question at all. Of course it’s going to happen. Maybe the best we can do is hope that we have the right scientist with his hand at the switch. And in that way, maybe we should be glad that Dean Radin is doing this work. But I can’t help, but feel, we might want to study this one a little bit deeper.\n\nAnd fortunately, I can tell you I’ve done the research. Here it is.\n\n[00:05:45] Clip: One 12. It works on just the one. Primate one is all we need. Full cognitive recovery. We’re ready. Look, are you sure you’re not rushing this. The date is clear. We’re ready, Stephen. All I need is your approval for human trials.\n\nYep. That’s rise of the planet of the apes. And in this case, the scientists with the hand on a switches, James Franco. Think about that one for a minute. By the way, here’s how that thing turns out.\n\n[00:06:15] Clip: Donnie. You get her ready? She’s got stage fry. Is that what it is?\n\nWe’re ready to move on to the next phase. Uh, human trials.\n\nNo, no, no, no.\n\nHave been absolutely no side effects associated with one 12 with one exception.\n\n[00:06:37] Alex Tsakiris: Dean rain is an awesome scientist. We stand on the shoulders of giants like this. I’m very grateful that it came on. I’m very grateful that he was so open about answering all these questions. Who knows where any of this stuff is going to go. And who knows what our role is in directing it. Stick around. I have a monumental interview with Dr. Dean Radin coming up next on skeptical.\n\nWelcome to skeptical where we explore controversial science and spirituality with leading researchers, thinkers and their critics. I’m your host, Alex scarce. And today Boyle boy, what a treat, what a treat for me. And hopefully I can do a good job and make it a treat for you as well.\n\nWe have Dr. Dean Radin back on skeptical. think almost everyone who’s listening to this show who regularly listens to it knows who Dean Radin is, but in case you don’t know. We are talking about one of the world’s most respected and most famous pair of psychologists, as in all time, most famous, all time, most respected a truly groundbreaking career paradigm, shattering science.\n\nSo it really has to be put in perspective his day job as, as chief scientist at ions Institute of Noetic sciences. He has a very interesting biotech thing going on, cognitive Ingenix. We’re going to certainly want to talk about that and we’re going to want to talk about what they got. I thought we would talk about I was listening to an interview.\n\nYou recently did Dean and. At the end the guy goes, Hey, he kinda is apologizing. He goes, I’m sorry for asking you of the same questions that everyone asks you and you were like, know, that’s okay. take this kind of a challenge, kind of as a performance challenge to see how I can bring this information, all this science that I’ve accumulated and bring it out in a new way, or bring it down in a different way or shape it towards the audience.\n\nI think I’m talking to, and I thought, you know, it’s such a good, it was such an interesting response because certainly part of your career, but early part of your life was about performance and was about, you know, how do I take what I’m doing and bring it forth.\n\ndid I get that right in terms of what you told that guy.\n\n[00:09:02] Dr. Dean Radin: Well, it is true that, uh, I I’ve done now 650 or some number like that of interviews and it takes a fair amount of time. Uh, so I do it for two reasons. One is to be able to speak in a way that virtually anybody can understand what I’m talking about. So that, that takes some effort to do that because most of the time, my mind is inside, uh, some analysis somewhere and it’s very technical stuff.\n\nUh, so it’s very important when you’re speaking, not only to the general public, but to other scientists, that they can understand what you’re talking about. that means you can’t use jargon. You can’t go into heavy technical stuff because, you know, we can’t know everything. So I, I enjoy that challenge.\n\nThat’s the same challenge that I have in writing. I want the general public and everybody else to be able to read it and get something out of it. Uh, and the other thing is it keeps me sharp in terms of being able to talk about this. So sometimes even on national radio, you hear somebody who’s, every other word is, um, and, uh, and you know, and all that.\n\nAnd I try not to do that and try to make it sound like I actually know what I’m talking about. And the moment I do start to use ums and the AHS, it’s a signal to me that I actually don’t know what I’m talking about.\n\n[00:10:24] Alex Tsakiris: Great. I wish I could, uh, hold to that standard, but I don’t always do it. So I thought here’s what I thought we might do is a little bit of a performance challenge for you. Most folks know you through the. Enormously successful books that you’ve had, uh, the conscious universe, 1997, Harper Collins and tangled mine 2006, Simon and Schuster supernormal, 2013, random house, real magic, 2018 random house.\n\n, amazing because their science books by major publishers, that’s amazing enough. They’re in a field that more or less didn’t exist before you started writing these books. Double amazing.\n\nAnd at the same time, even though these books are how a lot of people come across your work, you are. essentially, what do you call it? An experimentalists? You are a scientist who observes the world and then can’t resist the urge to say, well, how can I take that and bring it into my lab and see if I can make it work in here.\n\nSo I thought your challenge would be to give us kind of a highlight reel of those four books and some of the most significant experiments that are somehow connected to those books. How’s that for a highlight real performance challenge.\n\n[00:11:50] Dr. Dean Radin: Yeah, I could do that, but I first want to correct you that the, the field that I work in has been around since 1882 and a systematic way. And there I’m standing on the shoulders of John. Like anybody working in science, the always standing on history and I am too. And there are plenty of books. So my colleagues are just as good as mine.\n\nI I’ve taken a slightly different tact, usually in writing it at a level, which I hope most people can understand. And sometimes other books tend to be more technical or denser. Uh, so I’m definitely not the first person to be talking about this stuff. So the, the four books, uh, the first one, the conscious universe actually wrote, uh, when I was at Princeton university many years ago.\n\nAnd I wrote like 80% of it and no book publishers who were interested in it, uh, probably because I wasn’t an author at that point. And nobody knew who I was and they didn’t, they didn’t know what I was writing about. Uh, so some years go by and then I’m at the university of Nevada and a piece of luck falls out of the sky.\n\nAnd it was featured in an article in the New York times magazine. And the next day I got multiple calls from a book publisher saying, oh, would you ever consider writing a book? And I said, oh, well, I have something actually. So that was, that’s how I got the conscious universe published. And the point of that book was that, uh, up until that time, a very common refrain that you’d hear from skeptics is a shred of evidence that this stuff is real.\n\neven for experiments that are done, they’re flawed or they’re fraud, or more importantly, they’re not replicated, which is the currency of truth in science. Well, I knew that wasn’t true. So I felt I needed to write a book, which I could not find in the shelves. That’s how all of my books are. Actually, I don’t want to write something.\n\nThat’s just going to repeat what somebody else says. So that first book, the conscious universe was written as a way of introducing people and scientists that, uh, what is the history? What are the replications? How do we know that it’s replicated? So it was introducing meta analysis and, you know, not a very technical way, but as appropriately for the time that they wrote it, the methods and presented one example after another of cases where we know that effects were repeated, uh, that they are replicated and overall, highly statistically significant, even though the magnitude of the results in each case is usually pretty small. So that was basically the point of that.\n\n[00:14:32] Alex Tsakiris: So Dean, let me ask you this at that time, what would you say experimentally? In your lab was driving you forward was really catching your interest the most at that time, when that book comes out\n\n[00:14:46] Dr. Dean Radin: Uh, back then, it would probably the most interesting thing to me would have been the presentiment experiments, the unconscious physiological response to future events, because it was relatively new. I was getting really good results and I already had some colleagues who are able to successfully replicate those effects.\n\nSo, so that was new.\n\n[00:15:07] Alex Tsakiris: and I always thought what was interesting about that work just related, you just referenced it that is, it pulls you deeper, deeper into. Kind of being on the forefront of advancing. I don’t want to say advancing the scientific method because that’s not true, but, but you were held to such a standard in terms of procedures you’re doing the controls you’re doing.\n\nAnd in particular, when you get to the pre sentiment stuff, it was like, how do you do a good baseline? And then how do you measure these small changes against that good baseline? And\n\ndo meta analysis? And then how do you work on it? You can like the file drawer, problem, all this kind of stuff that, you know, it was around and people were talking about in terms of science, but it, you just, it was forced into, I think, more of public attention in a way that should have really, uh, been a good lesson for science at the time.\n\nMaybe it was a good lesson, I don’t know, but to speak to some of that, cause I think that’s what you’re alluding to before.\n\n[00:16:13] Dr. Dean Radin: yeah, one thing you learn after a while is that people believe what they want to believe, and there’s no evidence that you can get no data, no amount of charts and graphs. No matter of explanation, that is going to change your mind, but does change people’s mind is a single personal expense. So that, so a book is never going to do that. So I’m appealing then to those of us who can apply rational thought to methods, which is of course what science is really good at its methods to get biases out of the way. And so some of the biases are, we want to believe what we want to believe. And so do you fix that? Well, are pretty good ways of doing that.\n\nSo that’s partly what the story was in the conscious universe as well, be able to describe how these experiments are done and to among other things, show that it’s not like every so often somebody will write, say, well, did you think of this? You know, are you, are you doing this? And, well, of course we thought of all of that.\n\nIt’s like the most elementary part of running an experiment is to make sure the controls are what you think they are and that the statistics are right. And all of the rest of it. That doesn’t mean that mistakes aren’t. I mean, like we, we learn from mistakes and then we don’t do it again. But look at the history, many, many decades of doing various kinds of experiments. There are very few loopholes left. In fact, in some cases we don’t have any loopholes that we’re aware of. Of course there are always the unknown unknowns, uh, that can bite you at some point. But in some cases here, we’re not talking about laboratory anomalies that only show up when we do experiments, these, these experiments were devised in the first place to what people report in their real life find a way of operationalizing it in a controlled manner and then doing in the laboratory.\n\nyou already have a lot of anecdotal evidence, which is not really the currency in science, but it does provide a way of saying if those experiences, as people describe are real and we can put them into the lab and we get similar effects. Well, then it probably is real. So some of those anecdotes are exactly the way that people describe them,\n\n[00:18:23] Alex Tsakiris: Okay. So conscious universe causes quite a stir again, because you put it in very scientific terms and you got the goods and you deliver it. You wait a few years and then entangled minds, 2006. How does that, how does the story arc go from conscious universe to entangled minds?\n\n[00:18:48] Dr. Dean Radin: because the question I did not answer, and the conscious universe has, how does this work? Like how do, how do we take these kinds of effects and show that they’re compatible with our current understanding of the physical. Because prior to the development, especially of quantum mechanics, but also relativity, it was easy to dismiss these effects because we thought that there that space time matter and energy were all absolutes.\n\nIn which case, how could you perceive something that was far away from you? It was, it was considered impossible. And there’s still people today, including academics who say it’s impossible because that’s not the way the physical world works well, the wrong. And so the entangled minds, uh, I wrote in response to questions I had gotten about how, how could this possibly fit with our current understanding of physics? That’s what that book is about. So it goes moderately deeply into quantum mechanics and interpretations thereof. And it addresses the interesting parallel between the same thing in quantum mechanics and in cyber search that are both considered. So they both can, they both involve non-local connections through space and time, and they both involve something about the active intention or observation in observing a system and having that a system change its behavior.\n\nAnd so some would say, well, this, this is a coincidence, it’s a meaningless correlation. And I would say, no. I think actually what people report when they have these experiences is a reflection of what we know about the physical world, because it does support those kinds of phenomenon. Nevertheless, there are still papers being published regularly, mostly by psychologists who say that these phenomenon cannot be real because they violate basic scientific ideas about the way the world works, which is butter nonsense, because it doesn’t violate anything.\n\nIt’s just that we don’t understand how to put all the pieces together yet, but we’re, we’re no longer in a classical physical.\n\n[00:20:55] Alex Tsakiris: So experimentally in your lab, going on? What are you doing that kind of relates to this entangled minds?\n\n[00:21:09] Dr. Dean Radin: Well, so we’re trying to connect it to quantum mechanics. And so I’ve done that in two ways. The first way is using a double slit optical system to see if you can gain which path information, which is the, which of the two slits of photon goes through. If you can gain that information by any means so-called, uh, then you will not see an interference pattern.\n\nYou reduce the wave-like nature of light and you make it particularly as a particle. So you can see the, the change very clearly by looking at the interference pattern that is produced by that kind of optical system. So we had people, many of whom were meditators to their minds, uh, To see if they could tell where the photon was going, if they found that too difficult and just push the photon intentionally.\n\nSo it would only go through one. And so we’ve, we’ve now done about two dozen such experiments and, some of them work then some of them don’t work, but if you do a meta analysis across the board, it looks like there’s pretty good evidence that something is going on, that the consciousness is involved in some way in the quantum process.\n\n[00:22:20] Alex Tsakiris: So one of the things that kind of repeats itself here that is really smart, the way you did this, science is like you take the conscious universe and you take the pre sentiment experiment where there’s an image flashing up on the screen and you’re measuring the human interaction with that. And the ways that we can measure it, I dilation all this different stuff.\n\nBut the reason that you set up that experiment that way is because they’ve been doing that experiment for freshmen psychology students for decades and decades. So you said, Hey, you guys are familiar with this experiment, right? Well, you never put the alligator clips on this part of it.\n\nAnd if you do, it kind of looks different. And I think that’s. Very very clever way to do it. And then with the double slit experiment, you just blow everything up because that is the experiment that has everyone has been danced around for a hundred years. Like, no, it can’t really be consciousness is fundamental.\n\nLike max Planck said, I mean, why can’t really process that? And you said, okay, well, let’s just freshen that baby up a little bit to, if let’s look at it this way and this way, and is there an interference pattern and can meditators do it? And because you did a, uh, you’ve done a number of kind of variations on the theme when it comes to bringing the double slit experiment and saying, yes, it really is about consciousness.\n\nWhat are some of the variations that, on that theme that you’ve done.\n\n[00:23:52] Dr. Dean Radin: Well, first of all, we created a series of different kinds of doubles. So we’ve used a continuous beam, helium neon laser, which has certain advantages and certain disadvantages, uh, we’ve used diode lasers, continuous beam. We’ve used single photon, double slit systems, each time, a conceptual replication of the previous one saying that worked, and this probably ought to work.\n\nAnd if this works fashion work and so on each time a different kind of analysis is required given the nature of the data, which is not completely optimal because, uh, before you do an experiment, you’re never quite sure what the analysis should be, especially for this kind of experiment. So that’s, that’s a disadvantage for, for doing these, which is why I’m still waiting for more than one other person to do a replication, because so far there’s only one replication.\n\nWhich for his pilot studies are highly significant. And in the same direction that I saw and for his formal studies were not significant from a directional perspective, but from a bi-directional perspective, it was. And which is what we have seen in our own experiments to what this means is that if you, if you imagine that you’re, nobody’s looking at the double slip system, you see a wave-like pattern, you see interference.\n\nIf somebody is looking at it, you can predict that if you can gain which path information you will collapse. So call the collapse, the wave function, and it will get apart particulate pattern, a diffraction pattern. Well, a that’s a directional hypothesis. That’s saying it will go from this to this. Uh, what, uh, my colleague had found was, uh, that he saw a significant result, but sometimes in a one direction.\n\nAnd sometimes it went in a different direction, in a different experiment. So we’ve analyzed, we went back and analyze our data as well. And we find that. That between one person and the next person, some people will make it go one way. Some will go the other way. And if you use a variance measure, as opposed to a mean shift, you actually get pretty significant results at hold up.\n\nWhat this tells us is that as usual things are never quite as simple as you originally think. It’s not simply that consciousness collapses the wave function, but at the way, I would put it rather is that it seems to steer what is going on. It steers the wave function. Now, where else do we see that? Well, we see it as the quantum Zeno effect.\n\nIf you Mo you repeatedly measure a quantum system, it will freeze its evolution. And that sometimes it will freeze it in one direction and sometimes they’ll freeze it in the other direction. Depends a lot. And how fast you are, you’re measuring it. So maybe something like that is going on that it’s, we’re, we’re steering the, the way that the photons are behaving rather than simply collapsing something.\n\nI was. Upset with that kind of result. Because as I said that, uh, you know, the reason you do an experiment is to see what kind of answer the universe will give you when you, when you present a question and if you’re lucky, it will, it will give you an answer, which is even more interesting than the one that you originally asked.\n\nAnd in this case, that is, seems to be what’s happening. It seems like, yeah, there’s, there’s weird stuff going on, which we wouldn’t have known before, unless we actually went ahead and did the.\n\n[00:27:15] Alex Tsakiris: So super normal comes along at 2013, and this is kind of , a shift. I’m all these are shift, but this is kind of a shift in a different direction.\n\nWhat’s that book about? And then experimentally, where you at 2010, 2013.\n\n[00:27:33] Dr. Dean Radin: Well, I also want to add in before I go there, one other quantum oriented experiment that we’ve more recently published, which involves the use of entangled photons as the target of a mind matter interaction, because he wanted to look at non-local mind interacting with non-local matter. And did it do anything?\n\nThe short answer is yeah, we were able to modulate it. Um, Part of the experiment was looking at, could you increase the strength of entanglement and then intentionally decrease the strength of entanglement? Well, you would think a priori that decreasing the strength of entanglement would be relatively easy because it’s pretty fragile.\n\nIt doesn’t take much to collapse it, but what we found uniformly, even with feedback that was designed to increase it and decrease it, it only increased the fidelity of entanglement increased as a result of intention focused on it, which is really interesting. So again, that was not expected. I mean, we hope we’d see something interesting going on, but we, every time we get a nice surprise and a result like that, then we think, okay, this is still worth pursuing because if we only ever show the results that we expect to get, well, that’s not so interesting. Okay. So\n\n[00:28:48] Alex Tsakiris: no, no, I’m sorry. Cause you’re, you’re on you’re so on point with that, and it’s so So if you can back up and break that down a little bit, fifth grade level, what is entanglement? , we don’t have to talk about non-local mind too much, but the, why are you making that connection between non-local mind and entanglement?\n\nWhy does that for you? then what is, what is the experimental effect? Again, break that down in more simple terms in terms of what you’re seeing and why we can read the kind of in your face and in your voice, when you talk about how. It kind of doesn’t really go the way that you thought it really just goes in this one direction.\n\nAnd see the wheels turning for you in terms of what that means and global consciousness project and all the rest of this stuff that we’re doing. So some time and break this down, break that down for us. If you would.\n\n[00:29:49] Dr. Dean Radin: All of the experiments involving mind and matter are essentially asking the question is mind con is it causal or put it in broader sense, is consciousness causal in the physical world? Does it play a role other than within the body? And so one way of thinking of it is that I can use my intention and make something happen with a hundred percent reliability. So I Chanel demonstrate. Uh, right arm move up. Well, it did that. Well, this is the mind matter interaction. My intention is made something happen. The question here though, is what else can I do? Is it purely something within the body or does it act at a distance? So the non-local aspect of it is saying that at a distance, my thoughts can influence something else and we can measure that it actually happened, uh, what makes it, and that’s, that’s a non-local in space.\n\nThe other part of course, is non-local in time and there’s evidence that that is also possible, but it makes people’s brains exploding at, I want to go there right now. So, so the, again, the, the simplest way of thinking of it is asking the question is consciousness actually, causal, you have billions of people out there who are praying that things in Ukraine will get better.\n\nAnd so on. Does that do anything other than make you feel. Well, a lot of people believe it does do something either it’s an assessory prayer, but some deity or to the focused attention or affirmations or whatever this is like in the populace. This is the way that people think. So these experiments are looking at that sometimes at a much more macroscopic level, like seeing if we can affect the structure of water, water, molecule structure, which we’ve done, or many, many other kinds of targets.\n\nAnd the reason why you go down into the quantum scale is partially because there’s a little door opened that says a there’s a non-local things happening, which is interesting. It sounds like psychic stuff. And because of this, this peculiarity, which you don’t see in classical physics, which is that observation matters well, of course, from a physics perspective, you say, well, no, it’s just about measurement.\n\nWell, what is measurement? Is it about knowing what’s happening or is about an irreversible process? There’s lots of discussion about what that means. For those of us who, uh, are interested more in, uh, in large scale effects. Like I have here, where do we have it? Yeah. So I bent the spoon. So here’s a large soup spoon, which somehow I, I bet.\n\nAnd in, as other people have said that it feels like taffy momentarily and you just squish it didn’t take any force really, other than just sort of pushing it over. Well, I’ve tried many ways done to see if I put it in boiling water. Will it revert well, does it become soft? All those questions? No, it’s a hard piece of metal.\n\nSo that’s a macroscopic demonstration of something going on, which apparently it’s something to do with the mind in some way, because it does, if you just have a spoon, you leave it there. It doesn’t do that. So why did it do that? So in a laboratory, we have yet to find people who can do this kind of thing on demand.\n\nI take, take a bar of metal like this one and just. Well, we know the tensile forces and all the rest. You can, you can’t do that. At least not by human force, but if somebody can do that and I’ve seen pictures of people taking things like rebars and just going, well, that should be impossible, but it happened. So we go into the lab and we try to figure out what does this mean for our understanding of the physical world in quantum mechanics, in particular for the entangled photons experiment here, we’re talking about one of the fundamental aspects, maybe as a shortening or said, the fundamental aspect of quantum mechanics the idea that when you have two particles interact and they go on their Merry way, that they share properties and independent of space and time.\n\nthat it’s not quite right to say that if you take two photons or two electrons and you separate them and you twiddle one, the other one will respond. That’s That’s not quite right, but it’s close. And the idea is that the. They’re not independent anymore. They share properties through space and through time.\n\nSo that has been first And then after many years verified in the lab and now it’s being used experimentally for communications and cryptography and things like that. So it’s, a real thing. In fact, quantum computers would not work unless that was true.\n\n[00:34:26] Alex Tsakiris: So say you have a couple of points. I just want to make sure people understand, so you can create this quantum modem kind of thing, and you can do this thing and you can see demonstrations of it. I think China’s kind of maybe ahead of the game, a little bit on that, who knows who’s ahead of what game, but there is, you know, for people who need the engineering kind of proof of it, there it is, it kind of works and it kind of does it and it’s using these same principles.\n\nSo again, what you do, the trick that you do is you say, okay, You guys unknowingly have opened the door. I like the way you said that before. Let me step all the way through. And by the way, I’m going to bring some of my friends here. Some of my friends who are and say, oh yeah, we can do that. And some of my friends who are just off the street, it says, Hey, I’ll give it a try.\n\nAnd now they’re getting into this thing at a level that just kind of blows everyone up. Right. So kind of connect some of those dots that I’m loosely throwing around there.\n\n[00:35:30] Dr. Dean Radin: Well, it go all the way back to max plank, who came up with the idea of the quantum and most of his contemporaries at the time they were idealists philosophical idealist. So they felt that consciousness was fundamental. They came up with the idea of quantum mechanics. So if you, we marry together the underlying philosophy of the founders of quantum mechanics with the phenomena themselves, then it almost becomes obvious that of consciousness is really fundamental.\n\nIt should be able to do something with these quantum systems. So that’s, I mean, this there’s not genius here. It’s kind of, it presents itself immediately. And you do find occasionally some mainstream physicists saying, oh, wouldn’t it be interesting to test these kinds of ideas. Maybe somebody, somebody will do that.\n\nAnd maybe it has a 2% chance of working well, you know, okay, we’ve already done that. So the second reason then for doing an experiment involving entanglement in particular is because entanglement you, we, we think of something as entangled or not entangled, but it’s not binary. You have a whole bunch of classical systems where a particle is really are.\n\nSo they might be correlated, but they’re not connected at all. And their properties are completely independent in the quantum world. The properties are there and there’s some kind of, uh, um, correlation going on, which is stronger than classical correlations. So we can talk about this in terms of the strength of the correlation, but that’s not a constant it’s it varies all over the place.\n\nIt goes from just barely above classical, which is kind of a weak correlation to very strong, but there’s an upper limit. And the upper limit, according to Orthodox quantum mechanics today is called a CyrusOne bound. So this is named after a Russian mathematician called Boris CyrusOne, who came up with the idea that mathematically there should be an upper limit to how strong this entanglement can get.\n\nAnd so there were many experiments to see. Could you go past that because if you could, it would mean that the current formulation of quantum mechanics is incomplete. And of course that would be that’s earth shattering. People getting very, very close to it with very sensitive equipment, but no one has surpassed it yet.\n\nSo we thought, okay, since it looks like maybe there’s something going on with a double set system, maybe we can modulate the strength of entanglement and maybe even push it above the CyrusOne bound. If we could do that, it would mean not only is Orthodox quantum mechanics incomplete, but that it requires consciousness in some way in order to modulate it above that bound.\n\nSo we thought, okay, experimentally, it’s interesting. But if it worked, it would be theoretically extremely important. So we were not able to push it above the CyrusOne bound. And we think, uh, one of the reasons is maybe what we’re dealing with is such a small, weak effect from the mine that it wasn’t able to do it. But the other thing is that the apparatus that we were using, which is the commercial apparatus, anybody could buy it and it sits on your desktop. When you look at, uh, how far we would have had to push it in order to go by the Cyrus inbound. It was somewhere between six and seven Sigma. So a massively statistically strong effect.\n\nAnd we never saw anything that strong. So we, it simply the apparatus wasn’t sensitive enough or we didn’t try hard enough or something, but we weren’t able to do it.\n\n[00:38:55] Alex Tsakiris: In the description you just gave, dancing back and forth between the Woohoo aspect of this that people use to just kind of dismiss it.\n\nAnd then the hard science, if you will like the mathematics of it, . Do you want to speak to the fact that when you say Orthodox physics, that means to a scientist who is in that field?\n\n[00:39:21] Dr. Dean Radin: Well, a minority of scientists are interested in what quantum mechanics means. Most people learning quantum mechanics are doing it as a mechanic, right? You learn certain tools, certain mathematical tools. You turn the crank and you’re able to predict certain things. And it’s extremely useful. Our whole modern world is basically uses quantum mechanics to make predictions about how electronics work and a whole bunch of other things. So only a minority. Typically people are more philosophically oriented perhaps are interested in, well, what in the world does this mean? Because quantum mechanics, after all is a purely mathematical theory, it’s just, it’s math. In fact, the, the there’s one equation, which you can use to show all the quantum mechanics.\n\nIt’s not a long equation. It takes a lot to unpack it in order to understand what it all means, but, uh, or at least mathematically what it means, but what it then means in terms of fundamentals, in our understanding of reality, that is still a completely open. So one of the ways of seeing that is, uh, every so often there’s a survey taken among physicists on their interpretation of quantum mechanics.\n\nAnd so they gave a number of different questions. Like, do you imagine quantum mechanics is this or this or this? One of the questions is about the role of the observer, which is about what does consciousness really matter or not. Well, other people answering the survey 22% said, yeah, it is fundamentally important to understanding the nature of quantum mechanics.\n\nWell, these are professional physicists who are working this problem. So it’s a minority, but it’s not that small of a minority one in five physicists out there. Think, yeah, there’s something really important about consciousness. The vast majority of research goes on in quantum mechanics is not looking at the fundamental.\n\nIn a sense, that is what we’re looking at. want to see whether, uh, w why were all of these of quantum mechanics who are idealists, which is not in favor very much. And within physics, especially, why did, how could they have come up with something like this? And yet hold a belief that consciousness really was fundamental.\n\nDid they know something? We don’t know? Well, it’s, it comes down to a philosophical preference in some case, but nevertheless, it didn’t stop them from revolutionizing physics, okay. give their ideas a shot and see what happens.\n\n[00:41:43] Alex Tsakiris: Okay. Super normal. 2013. What’s the story arc here. And what’s going on with.\n\n[00:41:50] Dr. Dean Radin: So after writing about the physics of this, then people started saying, yeah, but, but still the physics doesn’t yet explain going on. you know, is there something wrong with our world? W we need some other way of looking at it. And of course, I already knew that the founders of quantum mechanics were idealists.\n\nSo I said, well, let’s look actually in two parts at a traditions that are not the current tradition within science. So science rests upon the philosophical assumptions of materialism. Everything is made out of matter and energy. And that’s the end of it. In which case your, your brain and you are the same, they’re like consciousness for, I would say radical philosophers say that there is no consciousness.\n\nIt’s just an illusion. That’s somehow associated with something to do with brain activity. And this is still a dogma within the neurosciences that that consciousness doesn’t really do anything, but it is an emergent property of brain activity. They will admit that because you have close, uh, neural correlates of consciousness showing the relationship. I look at that correlation as the same way as statistician would and would say, well, just because you have a correlation that doesn’t tell you the direction of the causation, unless you have a really good reason to, to think that, you know, the direction of causation. So, so super normal, it was the, uh, looking at Eastern esoteric traditions to say, well, the modern way of viewing reality is relatively new.\n\nIt’s only a few hundred years old. This idea of materialism, you can find instances of materialism, even in Eastern philosophy and you can find it everywhere, but by, by more, uh, much more of the proportion of the esoteric traditions were all about consciousness being funded. And, and so I use the, uh, the yoga sutras of potentially as a way of demonstrating that something about 2000 years or more before it was the first written account of what happens when you do diligent, meditative practice, what happens?\n\nWell, one of the things that potentially wrote about was this just happens. And what is he talking about? 25 different kinds of psychic abilities that come about as a result of this discipline pack practice. So I use that as, as kind of a way of saying potentially he was writing about these superpowers a long time ago.\n\nIs there any reason for us today to take any of that seriously? And so systematically went through each one of the, of the cities, these special powers to say, is there any laboratory evidence suggesting that meditation does anything like this and short answers. In which case potentially also talks about things like levitation and the visibility and other like comic book effects.\n\nUh, what about those? Well, we don’t know. We don’t, we can’t bring that into the lab and we don’t ever see that until the lab, except if he was right on these first set of phenomenal, was he just making up the rest of it? You know what, that’s a kind of a weird way to write a book. So I kind of suspect that these super psychic effects like levitation, they might be real.\n\nAnd when you look at the literature, including contemporary literature, like in Tibetan meditation, they will say, yeah, the cities are definitely real, but the people who can do these advanced cities extremely rare, even among people who are lifelong practitioners. So it’s not only the practice, there’s some talent that seems to come into play that allows for these super abilities to.\n\n[00:45:30] Alex Tsakiris: Yeah. You know, uh, Yogananda, the famous Yogi wrote autobiography of a Yogi. Hasn’t had an awesome it’s right up the road from me. I go up there, look off to it and do yoga all the time, just cause I like to do yoga. And it’s a beautiful spot right there on the beach or overlooking the beach. But anyone who picks up that book and reads the first 30 pages.\n\nI mean in the way that you’re talking about it, just talks about in very matter of fact way of, you know, Hey, this is what happened to me. This is my life. And then my good ribeye located from here to there and, you know, shape shifted into, you know, it’s just, not talking about it like to shock you or anything.\n\nHe’s just saying this is my life as my autobiography. So yeah, I think it is interesting to look at that. Culturally, was there any, I know some of the lab experiments overlap with this stuff, was, is there anything you would kind of pull out as experimentally, super normal where you thought maybe one extraordinary person you had in the lab or anything like that?\n\nCause that even something to talk about, you know, the super talented versus the person off the street offers different insights as well as I’ve heard you talk about, but\n\n[00:46:45] Dr. Dean Radin: Yeah. Well, are you talking about Swami later?\n\n[00:46:50] Alex Tsakiris: Sure if you want to go there,\n\n[00:46:52] Dr. Dean Radin: I think I might’ve mentioned about Swami beta participating in an experiment. Um, so Swami Veda is part out of a Himalayan tradition of, um, uh, meditation, uh, had been meditating since he was a child. So when I met him maybe 70 years at that point, and part of his tradition was to develop or at least recognize the cities the cities would develop.\n\nAnd so this was one of my in fact, the very first experiment they did using, uh, an optical system to see if it had, if you can manipulate quantum properties in it. And I described it to him was what he would do. He would sit outside or shielded room. And then mentally do something to a light beam inside the shielded room. And so, uh, he didn’t know if he’d be able to do that or not, but he’s certainly willing to try. So he sat down outside the lab or outside our shielded room. And then in one minute segments, I would tell him, okay, now put your mind in that beam, like send it in the beam over there or now withdraw it and relax.\n\nSo one minute, every minute we do that well about halfway through the experiment, uh, I mentally lost it. I kind of, a moment, I forgot what we were doing. I didn’t know like what, what is happening here. And then I brought myself back somehow and kept going with the experiment. So later when we analyzed the data, we found that about halfway through the experiment, we started to get a really big result, like exactly the kind of thing I was hoping we would get.\n\nIt was as though able to block a light. And put it in simple terms. So I was talking about this to the two videographers. We had filming the whole thing from two different directions at that time. And they both gave me a kind of startled look because had compared notes among themselves. both of them mentally gone away the same time that I did.\n\nThis was halfway through the experiment. It’s like they kept filming, but they just or something for a moment. So I asked Swami beta about that later. And I said, well, when, you know, when did you think you actually were able to do this? Because the data shows that you did pretty good. And so that took a while, maybe halfway through a figured out what was necessary in order to do this.\n\nAnd it was a city, was, it’s a mind matter interaction city where you controlling light And they said, well, how did you, did you jump into the room there? Because all you have is your mind to do that. he gave it an interesting result or answer, which was, uh, I didn’t go into. My mind didn’t go anywhere.\n\nIt’s all in here pointed, pointed to his heart. So the universe is inside. From the point of view of these cities, it’s not outside, that’s in a sense why you’re able to control it because you’re, you have much better control over your what’s going on inside. And we’re talking about deep levels of consciousness now, which you can think of as pointing to your heart.\n\nIt’s not really in your heart, but it’s, it’s deep somehow. And it’s, there is no outside at that point, which is why I also liked this Quip from, uh, Ramana Maharshi, who has asked, uh, after listening to the guru, talked for awhile about, uh, how should people behave? So somebody asked him, how should we treat other people?\n\nAnd his response is there are no other people it’s all completely connected and it’s all inside. So I thought that was quite interesting. So I don’t often have the opportunity to, to work with somebody who’s such an. And unfortunately, Swami Veda is passed away now. So you can’t do anymore, at least not in this form.\n\nUm, but when you do have the opportunity to work with somebody who’s been meditating a very long time, they can do not all of them because some of them are not interested in developing the cities. I mean, some of them explicitly avoid doing that, like in the yoga tradition, the usual way a teacher would say about the cities is if something arises, just, you know, acknowledge it and just keep going.\n\nCause that’s not the end goal.\n\n[00:50:57] Alex Tsakiris: Okay. Up this plays right into real magic, 2018, but explain the, the leap here.\n\n[00:51:04] Dr. Dean Radin: Well, Super normal is all about Eastern philosophical ideas and Eastern esoteric traditions, supernormal as the Western esoteric traditions. So in the east, you have the cities special powers on the west. You have magic. They are essentially exactly the same. And even the methods of being able to produce magical effects, you can map onto yogic methods directly.\n\nIt’s all about intention. It’s about deep states of mind. A Yogi would talk about samadhi, a magician. We’ll talk about gnosis, it’s basically, it’s a parallel to each other. And of course, this is not too surprising because if you go back far enough in history, there was no east and west. Per se they’re all came at a one, one source or I’ll ask her or people plus, or minus a couple of centuries.\n\nSo, so a magical tradition. I figured, well, I don’t need to talk about yoga at all. In this case, I can talk about magic because of Harry Potter, among other things, the people have learned enough about it through stories and mythology and our entertainment world to at least wonder, is that based on anything or is it pure fantasy? Well, it appears that it is based on something. So just as they did for the yoga cities and showing that there is some science that can be brought to bear for magical practices, the same is true. Some magical practices map on very, very nicely to the experimental work in Paris. Psychology.\n\n[00:52:34] Alex Tsakiris: Okay. So here’s the part that I think gets a little bit tricky. So you’re at that level, you’re pounding on this consciousness thing it gets to the philosophical assumption, underlying science. And I’ve heard you talk about. Before in a very, very eloquent way, in a very way.\n\nAnd cause again, it’s, it’s obvious, it’s not well understood or process. And that’s that science is resting on philosophical assumptions. the biggest one is that the world is out there and we can measure it, which you kind of shattered out one with every experiment that you do, but there’s a bunch of other philosophical assumptions, kind of the main ones.\n\nI mean, if you really kind of get to where people live, like, is there good and bad? Is there a God, what should I do with my life? Um, why am I here? Kind of thing. so magic. Kind of answers that in a different way than I think most people are used to having it answered. What are your thoughts about some of those really deep, philosophical questions?\n\nYeah, you’re talking about issues of morality and ethics and, uh, it’s, might be related to all this, but I’m, I’m not sure I would go. Except for w with one proviso. And that is, uh, if, if you completely adopt materialism as the, way that you’ll understand reality, then that leads to a picture of the world, which is nihilism, which means there, there is no ultimate purpose or anything, uh, when, when your body dies, your dad, that’s the end of it.\n\nUm, and, is collected into this Quip of he who dies with the most toys wins. That’s rise to the modern world that we see today, where businesses extractive. taking things out of the natural world, turning into something else and then selling it to you. Well, that’s not sustainable.\n\nI mean, maybe wind power might be or solar power, but things out of the earth. And, and in assuming that it’s going to go on forever. that’s not the case. It cannot go on forever. And we’re, we’re beginning to reap the consequences. Of that model, especially when it comes to things like, uh, like oil.\n\nSo we have like double whammies. We have a philosophy which is underlying a lot of modern civilization, uh, which says there’s no purpose to anything you don’t really matter. Ultimately, nothing on earth matters. And when students go through, uh, especially, uh, uh, of course in science, they will, they will absorb materialism without even being taught.\n\nThat it is a philosophy rather than a set of assumptions and assumptions by their very nature are something that you can’t prove. It’s something that you believe that this is a good answer to something. One of the reasons why it is continues to be taught and used, and a lot of people defend it to their death is because it’s very effective. So you don’t want to throw away something that is very effective materialism as a doctrine within science is extremely useful. What I would say then, though, is. Is it sufficient to account for everything and the answer there from the kind of work I do in lots of other areas now, no, it is not able to explain everything.\n\nWhat that tells me is that just as you see again and again, throughout the history of science, that at one point people said, okay, now we really understand what’s going on. We got it. And then somebody comes along with a new idea and new experiments and say, oh, okay. What we thought we knew was actually a special case.\n\nAnd now we have a more expansive understanding of reality. So I see materialism as a special case that pertains to certain aspects, limited aspects of the world, which is extremely powerful and a very good way of understanding it, but it does not account for everything. So how do we expand it? I would say one way to expand it is to assume that materialism is a subset of idealism. So idealism in, once you do that magic psychic stuff, the cities, all of that are become easy to understand without doing anything to material.\n\n[00:56:56] Alex Tsakiris: So here’s where I’m, here’s where I’m kind of trying to go with that. Your work it’ll tell me if you agree with us or if you don’t, but not inconsistent with what people are doing with the near-death experience science, the shared death experience science, but just really interesting. And it’s some people say it’s anecdotal, but it’s really not.\n\nIt’s casework in the same way that medicine across the board is a combination of casework and, uh, as well as kind of Explorer, experimental laboratory work. But what your saying, what your findings are, not inconsistent with saying there are these extended consciousness realms. Now let’s go see what we might learn about those extended consciousness realms.\n\nthink you’re making some of those same leaps, whether you like to or not, you are deciding that you won’t do the spoon bending exercise on board upon. Cause you’re like, is this maybe going to make the wings of the plane kind of go down? So we, we are in the game of trying to figure out what these exp what these extended consciousness realms are and how we fit into them.\n\nAnd I think like the near-death experience science and the reincarnation science and the shared death experience, science nudge us towards there is a moral imperative. I mean, that’s what they’re just kind of saying consistently over and over again. So I’m just\n\n[00:58:29] Dr. Dean Radin: Oh, wait a minute. What, why, why would those experiences have a moral.\n\n[00:58:36] Alex Tsakiris: That’s what’s that’s what’s reported like, so if you start compiling that data, the best you can, and you go Von Lamoille, and you go start doing surveys of people after they recover from their cardiac arrest, and you ask them a series of questions do it in a scientific way. You can, in terms of good medical survey, that’s what they report overwhelmingly like 90%, you know, these off the chart kind of things.\n\nSo that’s just the data.\n\n[00:59:07] Dr. Dean Radin: Yeah. So, uh, so there w there was this, uh, essay contest, which you’re aware of by the big ALO, uh, foundation. And so we, we submitted, uh, one of the essays and we got, uh, one of the prizes and part of the upshot of what we were talking about is if you look at the eight or nine different classes of evidence for survival, Uh, how, how should we best interpret that?\n\nDoes it mean that they’re actually the consciousness and the body can be separate and they went to separate it retains enough about your own memories and personality and so on. So that when a medium reports talking to uncle Bob, it’s like an invisible form of uncle Bob. So that, I mean, most people, when they think about survival, they’re thinking about you survive in some other world somehow, and you’re still connected to this world.\n\nThat’s, that’s sort of a naive way of thinking about what survival is thought about. Like the idea of heaven. You’re exactly the same as now, except maybe you’re younger and you don’t need to eat or something like that. So what we are doing is questioning there. First of all, if you do a systematic review of these various kinds of evidence, and you assign a letter grade as to how good the evidence is from a scientific perspective, none of them are a, about the best you get us. So some of it’s compelling. I mean, the, you know, the whole package of, of these stories are very impressive. Uh, but does it mean that there is survival of any type or we concluded that we don’t know at this point? And the main reason we don’t know is because we, all of the evidence, a hundred percent of the evidence for survival comes from living people.\n\nSo this is in, in the jargon is called living agent side. Let’s see, it’s, it’s the lap hypothesis that it’s all based on psychic stuff. And I get very vigorous debates going on from people saying this couldn’t possibly be cited because it’s way too complicated. It’s like it requires some sort of depart an entity or something.\n\nAnd I say, well, that assumes that we know everything about PSI at this point while we don’t, we don’t have any idea what the limitations of CYA is. Something could look extremely complicated from one perspective, but from another, if you’re really good at some kind of psychic perception, you can bypass all the complexity and one. So our argument was that the figuring out the answer to the question of is their survival is extremely important for everyone. We’re all going to encounter that thing at some point. Um, but can we answer it now, given what we know? I would say the answer is no, we need to do a lot more research.\n\n[01:01:47] Alex Tsakiris: Sure a lot more research is always a good answer, but the little judo that you’re doing that I never quite experimentally? You’ve kind of falsified science. You’ve brought us to the edge, to the limit of it really in a way of saying, well, we really can’t measure any of this stuff anyway.\n\n, how would you respond to someone who says, well, okay Dean, that’s great. You know what? You’ve just proven. What I already know is that there’s demons in your room that are controlling all these experiments and you can’t see. G I’ve falsified that that doesn’t happen at all. And you can’t explain, you know, how the Swami is different from the average person.\n\nI have a friend Shirley Black, amazing person has three near-death experiences. had a little bit of this PK thing going on, but it’s really woken up in her third near-death experience. And now she can do, she can spin up pinch. Under a class and she goes off to go to the lab and she goes to three different major university, university of Virginia, uh, Ryan Institute, duke, in Canada.\n\nI mean, not like fake stuff. She goes like, oh, you want to study me? Put the wheel down there inside the class and I can spin it. So the whole PK thing is interesting, but it’s connected to this near death experience, at least in her mind. It is.\n\n[01:03:09] Alex Tsakiris: I think you’re but your work, you can’t your work, I think puts us past the edge where we can kind of pull it back in and say, oh, wait a minute.\n\nWe have science to say this way or that way. Haven’t you just kind of thrown us in this quandary of, Hey, the world isn’t out there and we can’t measure it.\n\n[01:03:32] Dr. Dean Radin: Well, I’m not quite sure what you mean by we can’t measure it because all of our experiments do involve measurement. So,\n\n[01:03:39] Alex Tsakiris: But you don’t know what you’re, you don’t know exactly what you don’t know exactly what you’re measuring. There’s an asterisk there.\n\n[01:03:46] Dr. Dean Radin: neither is that the case in most experiments and any measurement is an indirect measurement of something. It’s just a reflection of something. So in the case of like, say a Ganzfeld telepathy experiment, getting in an indirect measure of what people are experiencing. And the result of that suggests what’s going on in one person’s head can show up in the other person.\n\nSo that’s, this is the operational operationalization of people’s experiences in real life about telepathy they’re sharing thoughts. Well, in a laboratory, we can re we can that, the question underneath it as well. How did the thoughts get from one person to the other? And at this point, the best metaphor that we can use is that, or something like entanglement it’s, it’s probably not entanglement, at least not as we see in a physics lab, but it’s certainly like it. And, but this, this doesn’t bother me very much. So we don’t know exactly what’s going on at the leading edge of knowledge, you never know what’s going on. You’re doing the best that you can to ask questions and hopefully get an answer back that will address a hypothesis. most hypothesis are not about what is the fundamentally thing going on.\n\nThat’s it very difficult to do a, experiment, looking at fundamentals at that level. Most of the time you’re looking at various models of the way you imagined things are going on and it’s to testing various models begin to develop a picture of what you think might be going on fundamentally.\n\nBut ultimately we really don’t know. And that goes for the fundamentals in most disciplines, you know, as you start asking those annoying why questions again and again? Well, we don’t know.\n\n[01:05:27] Alex Tsakiris: No, I hear you and believe me I’m 1000%. How far are you from. Kick the can down the road. It’s tremendous. I do think though, you know, like Cheryl Lee and her near-death experiences, if you go back and look at her near-death experiences, they’re amazingly consistent with these ones that are collected under the best medically controlled survey conditions by which we base all this other stuff what they consistently tell us as part of that, which would kind of this thing upside down that our measurements are in this reality, which is fundamentally a lesser reality.\n\nAnd these extended consciousness, rims are kind of a greater reality. So we’re kind of looking through the wrong end of the telescope that these people are saying, Hey, I, in that mode, all questions are answered, you know, and it’s I get, I know everything. And then I’m forced down into this\n\n[01:06:23] Dr. Dean Radin: Yeah, but also. Keep in mind that just as with mystics saying, they say, well, the actual experience is ineffable. Therefore for me to talk about it, I’m going to have to squash some amazing thing that happened to me into words that can only provide a pale expression of what actually happened. And more importantly, that it, uh, the paper just came out within, within the past month showing a unusual case or where an epileptic I guess, was having their brain monitored and they died and they were able to remain dead, not a near-death experience, an actual death experience while they’re measuring the EEG.\n\nAnd they found to their amazement that there’s activity going on for a long time.\n\n[01:07:06] Dr. Dean Radin: This, this immediately raises questions about what is going on with an NDE. Is it a dream of.\n\n[01:07:13] Alex Tsakiris: that that data really consistent with, uh, explaining way, I’ve been trying to do forever. The near-death experience. It’s not in terms of the, the patterns, EEG patterns that they’re saying in the Delta gamma range. It doesn’t match that way. And it really doesn’t match, uh, from a time perspective either.\n\nI mean, be able to report the near-death experience. of times it’s like one woman who I had on the show, you know, she’s like, boom, I got stabbed. And immediately I’m outside of my body. I’m not dead, but I see the whole thing go to the, I see the ambulance go to the hospital. I see all this stuff going, which is consistent with all these.\n\nAnd then I leave my body and then I have this near death experience. So again, if we were going to take that tiny little window that we get sometimes with, uh, some data like this EEG, EEG data, and we would really try and honestly apply it against the best. Evidence we have in the near-death experience. I don’t think it holds up.\n\nWell, I want to be mindful of your time. So I’m going to bounce onto a couple other things. want to see if we can hit in the final minutes we have Edgar Mitchell, Dr. Edgar Mitchell, but 11th man or whatever. Sixth man. Walk on the moon. Six man, founder of ions passed just a few years ago. Did you have opportunity to interact with Dr.\n\n[01:08:39] Dr. Dean Radin: Yeah, he would, uh, in his later years he would come by for board meetings at ion. So yeah, I had many opportunities to talk to him.\n\n[01:08:48] Alex Tsakiris: Because the interesting thing I think about his story is like he founds ions because he has this unity consciousness experience he’s flying back and he sees little blue marble that is earth. And he has the unity consciousness experience. But later in life, he says, I really had was an ATA experience and he becomes very interested and he says, I know it to be true that, you know, 80 is real contact has been going on for a long time.\n\nI know people in the military, I was sworn to secrecy on this. I upheld the secrecy. I don’t think it’s good to uphold the secrecy anymore. Now I’m telling the truth. Have you ever reflected on that in terms of. Cause, cause that’s interesting how we set up ions to say a safe little way kind of partially explore what I really know.\n\nI mean, that’s one way to read that that doesn’t have to be your way reading it, but what do you, thoughts on that?\n\n[01:09:48] Dr. Dean Radin: Well, the ions, um, mission as described for many years was, uh, we explore the frontiers of conscious. Which was in alignment with what Edgar was interested in after all, he did have that experience. He went on to have many other very strange psychic experiences. Uh, he didn’t talk about UFO’s and ETS for a very long time because he knew how people respond to to that.\n\nAnd it was already recognizing that there’s a credibility problem when you start talking psychic stuff to other people. So we have tend to avoid the whole UFO ITI thing, mainly because it’s like a binary bomb. It, you, you combine two things that are slightly explosive and you have a major problem on your hands.\n\nSo is, is there a relationship? Well, maybe because a lot of UFO sightings and, and ideas about contact with ITI, it’s about consciousness, apparently, because, so the communication typically is telepathic and ETS can do things that you shouldn’t be able to do. Like walk through walls and stuff. So whether, and some point in the future, we we’d start to pursue that at this point, I would guess probably not.\n\nAnd the reason is that, um, much of what we do from a scientific perspective requires doing it in a laboratory environment, or at least under some kind of control conditions. And if we can find an ITI who can come to the lab and do stuff, we’d be very happy to entertain that. But it’s very similar to like somebody who says, well, one time I levitated.\n\nThat’s great. Can you do it now? No, I can’t do it anymore. Sorry. We, you know, we can’t, what we want to do is advance through science as best as we can. And in the process, maybe slightly change some of the ideas or the epistemology that’s used in science, but not to go off into what I would consider left field.\n\nWhere all you have are stories and yes, there are similarities among the stories. There’s. Some of them are very compelling. People have transformative experiences as a result of the stories or the experience that they have and they’re, they come back different. Um, and that’s certainly valuable work that our people who are studying these sorts of things, but it’s at this point, not something that we want to look at.\n\n[01:12:12] Alex Tsakiris: Tell us about cognitive genetics and, uh, particularly. You know, it relates back to the first part of this interview in that the origin story from this, as I understand it comes directly out of experimental work. So tell us what it is, what it’s about and that link the origin story, if you would.\n\n[01:12:36] Dr. Dean Radin: I mean, the origin of, of cardiogenic\n\n[01:12:41] Alex Tsakiris: it, uh, it was, I am, I mistaken? It, it did. It did seem to come out of this research, like who can do this stuff better than other people could there possibly be a genetic link to that.\n\n[01:12:57] Dr. Dean Radin: it’s related to that, but it’s not directly cause this is the, the genetics of psychic ability or psychic talent. That is a project that ions cognitive genics is of course paying attention to that since I was involved in that too, but it’s a neuro genetic engineering company where eventually we go to a place where we might be able to enhance or suppress psychic abilities genetically.\n\nAnd we think it has something to do with connections in the brain. So. In order to get there though, we have to start with something which is much simpler. So what we’re doing initially is, uh, looking at the mechanism of action for SSRI drugs, selective serotonin uptake inhibitors, re re re-uptake inhibitors.\n\nSo these are the are things like Prozac and Zoloft and all of the drugs out there that are used for anxiety and depression and a few other things. Well, if you look at how those things work in the brain, it involves a certain kind of neuronal receptor that it’s modulating. It’s basically downregulating that receptor you, down-regulate it.\n\nIf it’s too hyper excited, you become calm and depression also begins to lift. So we figured with modern genetic tools, especially CRISPR, which is the most recent version of a genetic editing tool, you can very precisely target certain neurons and cause them to download. So we kind of bypass all of the problems with, of which are huge problems of contraindications and SSRI drugs and the most pharma cause that goes all the way through your body.\n\nAnd instead target just the places in the brain that you need to change. So we’ve done experiments now that we were able to pro we provided proof of principle the method works and our secret sauce in this is how do you get it in the brain without putting a six inch needle into your head? Because that’s how a lot of these studies are being done.\n\nAnd also not having to put it in your cerebral, spinal fluid and not having to do Ivy and all those other methods. We developed a method which we’ll get it into your head to the right spot. And we can show that it actually does. Downregulate like an SSRI does, but at this point we think we, in fact, even from the mouse studies, we don’t see any side effects. So this is part of a, a big and very fast growing industry of what will become modern medicine people today are still, some people are afraid of, of M RNA treatments. They, they were afraid of it in the same way that people used to be afraid of organ transplants and prosthetics and all kinds of stuff.\n\nThis is simply the way whether they like it or not. This is where medicine is going because it’s extremely effective. So again, this have anything to do with psychic stuff? Not yet, but down the road, we think maybe we’ll be able to use the platform that we’ve created to do some interesting things for a psychic talent.\n\n[01:15:55] Alex Tsakiris: So I’m not a Luddite. And I get that. What, what you said is true, this is going to happen. Someone’s going to do it, get used to it. And if we don’t do it, somebody else will, why do you want to be okay? Why do you want to be that guy? I mean, there, there are a lot of legitimate concerns, especially right now we’re on the heels of what some scientists are calling, you know, the greatest medical crime against humanity in history.\n\nAnd you know, if you look at just, you know, just the other day, who’s the guy who presented in front of, uh, Congress. Oh, Senator Ron Johnson and the, the effects of. The vaccine on the DOD it’s staggering 300% increase in, uh, uh, miscarriages 500% increase of this 600%. We have no idea going on with this gene therapy, bio weapon kind of stuff.\n\nDon’t I know we have to push forward, but how do we do it in a way that, and or do we have to push forward? What is, what is going on here? And, and w w what do you think is the path forward for legitimate concerns that a lot of people have? on the other hand, the prospects of, you know, medical science advancing.\n\n[01:17:36] Dr. Dean Radin: Every advancement. Uh, an enormous amount of medical problems can be traced to genetic origins. And we’re not talking about like single genes that are producing a problem like cystic fibrosis or sickle cell anemia. Many of like are all of the whole process of neurodegeneration that leads to dementia. At least the Alzheimer’s all that these are very serious problems that have so far not been solved by anything. So there is the pharma that’s available, for example, for Alzheimer’s at best slows it down a tiny little bit, but if you have Alzheimer’s, you are going to die from Alzheimer’s. So wouldn’t it be nice if we figured out a way to prevent that retreated or curate even, and not just that, but all like every organ has its own set of things that can go wrong. Would it be better to figure out a way to fix that or. Yes, every new treatment, every, every new advancement in science to the development of the atomic bomb was a risk as a result of what Mary Curie was doing. Does that mean it’s better not to know or to know, and part of the scientific creed, at least the one that I follow is it’s always better to know, because at least then you can make decisions , I know how M RNA works. And whether the is the data that he’s actually using, something that other scientists will agree to. I don’t know, but I would have to go into this and look in detail, does this actually, the way it’s working,\n\n[01:19:09] Alex Tsakiris: Well, Dean, I mean, they have the, they got their data from the defense medical epidemiology database that got it from the DOD, his own database. It’s not like cooked up these numbers, you know, and then,\n\n[01:19:23] Dr. Dean Radin: but this is similar. This could be similar to the other databases where people put in side-effects that they say that they had as a result of getting a vaccine and that’s just people reporting things and you have no way of knowing what’s going on. So I don’t know whether this database is vetted. Maybe it\n\n[01:19:42] Alex Tsakiris: it’s the DOD database of like\n\n[01:19:44] Dr. Dean Radin: That doesn’t mean anything.\n\n[01:19:47] Alex Tsakiris: you talk about miscarriages, you know, there can be under-reporting over-reporting but you got to believe they’re kind of pretty spot on with the number of miscarriages. then what the other thing he has is he has doctors that forward and say, Hey, yeah, I’m consistent with what I’m observing in working with soldiers.\n\nThere’s a lot more cases all the stuff that you guys are talking about. So the\n\n[01:20:14] Dr. Dean Radin: Part of the problem in this is again, we’re dealing with correlations as opposed to causation. So are people more stressed because of a pandemic? Yes. Would stress lead to more miscarriages? Yes. So is that the causal thing, whereas the vaccine, or is it people who took the vaccine and their friends are telling them you’re crazy for taking the vaccine, which adds more stress, which leads to miscarriages and other, what I’m trying to say here is that, , unless I go and actually dive into this data and figure out what is it that’s actually being said and what is the nature of the data?\n\nSo, I mean, we’re part of the, this of science is being skeptical about everything. And in this particular case, there is so much politicization. Khalid politics involved in the way that people are interpreting what’s going on. I I’m not, I won’t accept anything that people say on a pro or con. I mean, I tend to pay more attention to things that end up in science and nature.\n\nUh, but something like this, I would look at where’s the source. That’s telling me this. Why is he saying this? All of these other questions, now we’re talking about a sociopath politics and not just science.\n\n[01:21:23] Alex Tsakiris: Okay. I’ll kind of wrap it up. . I just have to add, I am apolitical, , I’m also kind of politically ignorant, to be honest with you. I didn’t even know who the hell Senator Ron Johnson is.\n\nI don’t pay any attention to it. It just looks like theater to me. What I’m interested in is the science and what I’m interested in is the pair of political interface to science and how it’s just being. Uh, science, isn’t such a threat now. And so, you know what the DOD did, I’m no defense did in order to help you Dean that this stuff and fare it out.\n\nWhat the truth is. They just took the database down. They’re no longer going to give anyone access to it. And they said, oh yeah, that none of that data, it’s, it’s all kind of flawed. So we’re going to take it down and then we’re going to fix it and then we’ll put it back up. Well, I mean, come on, we’ve heard\n\nall that stuff. maybe it is. Maybe it is true. Who knows? That’s\n\n[01:22:21] Dr. Dean Radin: the point is we don’t know. And so, yeah,\n\n[01:22:25] Alex Tsakiris: Glitch in the system glitch in the system until somebody points it out that it’s wrong. And then we find it out. Okay.\n\n[01:22:31] Dr. Dean Radin: Well, so, so again, so on cognitive, genics the reason why I think it’s very valuable is because it’s better to know than not to know it is also the case that it just this morning saw a talk on this that the ability to do genetic very precise editing at this point is coming along very fast. there are a lot of people who know a lot about this.\n\nI’m kind of a, uh, an, a newbie when it comes to this of topic and it is amazing what can be done. And so if it can, if it just like, I mean, people will take some kind of normal off the counter or over the counter or pharma drug and die as a result people are different and any medication involves risk.\n\nThere certainly will be risks for some people with, uh, RNA or DNA Uh it’s for those people, it’s very unfortunate that something happened, but for the vast majority of people, it actually will be very high.\n\n[01:23:28] Alex Tsakiris: Well, you know, the light at the end of the tunnel for me is that I want you to be one of the guys with their hand on the switch, because this is going to go forward. This is going to be part of our future. And as you keep pointing out, whenever I say that you say quit talking about the future it’s here.\n\nNow. It’s like, when I talk to people talk about the future of AI. I like quit talking about the future of AI. You’re interfacing with AI all the time right now, and it’s just going to get more and more. So the, fact that, that you’ve established a track record of being careful about understanding the limits and opportunities of science and how to do science, right.\n\nAnd how to maintain the, the beauty of the scientific method certainly gives me hope. I got to believe is occupying a lot of your time and attention right now. genics is as super I made how far it can go is amazing as you’ve alluded to. What else are you, what else are you working on? Is, is this your main focus right now?\n\nAre you still the ions kind of stuff? And are you going to continue\n\n[01:24:37] Dr. Dean Radin: yeah, no, I’m, I’m, I’m I’m eugenics is, uh, is not my day job. It’s it’s my night job. Uh, but the other thing I’m working on is, uh, I’ve written a, um, a science fiction TV series, but with a writing partner, uh, and we’re shopping it around now. And the, the idea is that, uh, just to the re the same reason that we would write a popular book, that narrative narratives are what convinced people, where we’re used to sitting and listening to stories.\n\nSo I wrote a story which is designed to be an anti. To mow the way that psychic phenomena are usually portrayed in entertainment, it’s usually portrayed or linked with a horror story. And that’s not good for anybody. I mean, it works as a story, but I, you know, I don’t see it that way at all. So the story that I wrote is actually has a very positive spin on it and challenges many of the tropes that are used in science-fiction entertainment having to do with psychic phenomenon.\n\n[01:25:40] Alex Tsakiris: Give us a little taste of how that might play out. Story-wise in a very …snippet\n\n[01:25:47] Dr. Dean Radin: Well, so think about the invasion of the body snatchers and the Borg in star Trek and virtually every other example where you have a hive mind, which is presented as the most horrific thing that you can possibly do. And we’re saying in this story, no, it is not only not horrific. It is the best possible thing that we can do too, because it pulls together something which is already interconnected, but we beat, we sort of behave in an illusory way that we’re separate and we’re really not connected.\n\nIt just that disconnection, that leads to the kind of madness that we’re currently seeing in Ukraine, right? People ad literally shooting at each other and not appreciating the fact that at a deeper level, everything really is interconnected, including. So this is part of the, of the plot line and the story where there’s a tension then between people who, who in this case take a genetic enhancement and become a, uh, a group mind.\n\nEssentially, everyone outside the group mind thinks that this is scary. We need to stop that it’s bad from inside. This is the best thing that ever happened. This is like the difference between homosapiens and homeless superior. If we, if we’re gonna survive, we need to advance as a species. And so the story is basically making the case that homo sapiens is dying and we have to, we either die or we evolve.\n\nWell, the evolution is going towards a new kind of human, and if it needs a little genetic push to get there. So be it.\n\n[01:27:23] Alex Tsakiris: You know, an interesting connection to that. I don’t know if you know, Whitley Strieber, but I’m sure you know of him,\n\n[01:27:31] Alex Tsakiris: you know, him, his contact experiences, ongoing contact experience includes an understanding of the hive mind and understanding of the others who were visiting him, have a hive, mind, orientation, worldview, reality, I guess you’d really have to say reality.\n\nAnd that in Whitley’s words, and I’m not down with everything he has to say, but it is somewhat of a barrier in terms of understanding us. Because once you’re in that mindset, you’re like, why would you think that’s real? And it also has an interesting tie back. Doesn’t it to the quote that you used earlier in that I don’t think of others, you know, what do you, how do you get along with that?\n\nI don’t think of other.\n\n[01:28:22] Dr. Dean Radin: Yeah. Yeah. So they, the metal, one of the metaphors we use in this story is, uh, because initially the people involved were very resistant to. Uh, but it’s that, uh, it is as though you are a neuron and a brain, well, you, as the neuron could have certain capabilities and neurons are pretty clever, uh, but a single neuron would have no concept of what a hundred billion neurons with a trillion interconnections can do.\n\nIt’s like totally different. Well, the same is true here. If we really are interconnected in, in consciousness in some way, we feel like we’re an individual, as a collective, we can do, what we can take. Everything we know about being human, our cognition perception, all the rest of it. And some little bits of psychic phenomena, times 8 billion that’s, that’s the direction that the story takes.\n\nAnd then it explores the notion of what would happen of that.\n\n[01:29:21] Alex Tsakiris: Final question. What do you think of the fuss over the transhumanism agenda? What did they get? Right? What do they get wrong?\n\n[01:29:32] Dr. Dean Radin: I’m not deep enough into that to have a good opinion.\n\n[01:29:36] Dr. Dean Radin: to go onto it. I\n\n[01:29:37] Alex Tsakiris: Okay. I get with Dean you’ve been super generous with your time and a super open. I always expect that you guys just answer everything, knock them all out of the park. Terrific. Having you on. Thanks so much for being here.\n\nThanks again to Dean Radin for joining me today on skeptical. The one question I tee up from this interview is. What do you make of the DNA fiddling that is coming down the road and in particular, , what Dean really brings into focus here in this interview is. What does that mean for consciousness? However you understand consciousness. However you understand your interface to consciousness, whether it’s a blob of consciousness or a hierarchy of consciousness. What do you think that’s a lot to discuss here? and do stick around. I have some more, pretty good interviews coming up. So stay with me for all of that until next time. Take care. Bye for now. (music: Tomie’s Bubbles Candlegravity).", "opengraph": {"locale": "en_US", "type": "article", "title": "Dean Radin, Quantum Consciousness Experiments |545| - Skeptiko - Science at the Tipping Point", "description": "Dr. Dean Radin has shattered the quantum consciousness link question, but where will it lead? Subscribe:   Click here for Dean Radin’s website Book: Real Magic Click here for forum Discussion Alex Tsakiris: On this episode of Skeptiko a show about paradigm change. And how, when you get it, it isn’t always what you think. […]", "url": "https://skeptiko.com/dean-radin-quantum-consciousness-experiments-545/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2022-03-22T18:24:27+00:00", "article:modified_time": "2022-03-22T18:36:34+00:00", "image": "https://skeptiko.com/wp-content/uploads/2022/03/skeptiko-545-dean-radin.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "psychedelics", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "810", "embed_code": "<iframe loading=\"lazy\" title=\"Dean Radin, Quantum Consciousness Experiments |545|\" width=\"1080\" height=\"810\" src=\"https://www.youtube.com/embed/MKYlyv0lqBE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/MKYlyv0lqBE?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-545-dean-radin.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-545-dean-radin.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-545-dean-radin.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "https://www.skeptiko-forum.com/threads/dean-radin-quantum-consciousness-experiments-545.4813/", "https://www.sharedcrossing.com/williampeters", "https://www.amazon.com/At-Heavens-Door-Journeys-Afterlife/dp/1982150424", "https://www.skeptiko-forum.com/threads/dean-radin-quantum-consciousness-experiments-545.4813/", "https://www.skeptiko-forum.com/threads/dean-radin-quantum-consciousness-experiments-545.4813/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2022-03-22T18:24:27+00:00"}