{"result_id": "273022", "URL": "https://skeptiko.com/james-ellis-raising-the-conversation-past-level-zero-473/", "timestamp": "2023-04-25 17:08:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/james-ellis-raising-the-conversation-past-level-zero-473/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "James Ellis, Raising the Conversation Past Level Zero |473|", "cleaned_text": "James Ellis is a philosopher and creator of the Hermitix podcast where level three conversations are routine.\n\n[00:00:04] Forgive the longer than normal opening clip, but sometimes a little snow piercer, Gnosticism is therapeutic.\n\n[00:00:50] Today philosophy with the very excellent James Ellis from Hermitix.\n\nJames Ellis: [00:01:03] Not the zero I talk of a lot, but level zero for what the people online called normies because I don’t think most people are operating on there. The level of level one. I’m not saying I’m above them. There’s nothing wrong with just living your life and getting on with it. But in terms of like everyday conversation where people are saying things like, how are you, you know, how was your weekend? Those dead statements, that needs to be like level zero, where there’s just no content.\n\nAlex Tsakiris: [00:01:28] Welcome to Skeptiko where we explore controversial science and spirituality with leading researchers, thinkers and their critics. I’m your host, Alex Tsakiris and today we welcome James Ellis. Was it okay to out you James, because you were flying under the radar for a while?\n\nJames Ellis: [00:01:49] Yeah, and I’ve been under the name Meta-Nomad for like… since 2017 I’ve been blogging and writing under that name. I just about remember the old days old days of the internet, where forums were full of anonymous people with cool sounding names, and I really miss that anonymity. So that was one reason and also just so you don’t get the two things crossed. And then I started doing things, like courses where I thought just for like legitimization I need to do the whole real-life thing, a real-life name. So yeah, James Ellis is fine is that the short answer to that?\n\nAlex Tsakiris: [00:02:30] Well, great. I mean, you know, like we were just chatting about just a second ago. There are so many jumping off points for folks like you and I really am open to thinking, kind of in these parallel and non-parallel kind of ways, you know, what is reality, What is anonymity anymore and what is identity and all that kind of stuff. But we should just jump right into this and let people know that we’re kind of doing a swapcast here, but I’m primarily interviewing you for Skeptiko and then this may go out on your excellent feed, the Hermitix podcast. Let me pull it up here for people because we were just chatting about it a minute ago if anyone’s watching on YouTube. But really some great stuff here a lot of very, very insightful, deep, philosophical level three, as I like to call them, kind of conversations.\n\nAlex Tsakiris: [00:03:31] Okay. Well level three. First what’s level one? What’s level one is like science. So science is level one. Is there science? Like that’s one of the survey questions we’re going to go over. And what is the meaning of science? Is science obsoleted by consciousness, an understanding of consciousness that consciousness is fundamental and that maybe idealism is a better way of thinking about what we experience than is scientific materialism? So that’s kind of level one.\n\nAnd then level two is conspiracy, really, which is if you get there and you say, wow, it’s really an absurd idea to think that consciousness is an illusion, that it doesn’t exist. I mean, it’s an absurd philosophical idea, it’s also an absurd scientific idea because it’s been falsified. The idea that you’re an epiphenomenon of the brain really doesn’t hold up. So level two is kind of the controversy of conspiracy that comes in when we think…\n\nAnd then level three is shit, man. So now that we’re there, you know, once I get past those two, let’s chat. But if you can’t come to grips with those two, then to me you can’t begin to have the level three conversation. How does that hit you?\n\nJames Ellis: [00:04:56] Yeah, that works. I mean, I would say though that you need to introduce a level zero. Not the zero I talk of a lot, but level zero for what the people online call normies because I don’t think most people are operating on the level of level one. I’m not saying I’m above them, there’s nothing wrong with just living your life and getting on with it. But in terms of like everyday conversation, where people are saying things like, how are you, you know, how was your weekend? Those dead statements, that needs to be like level zero. Where there’s just no content. And I try to actually veer away from them because I actually find it just an actual waste of time.\n\nAlex Tsakiris: [00:05:33] Well, first of all, my orientation on this stuff, which I don’t know why, but the nature of the show is, you know, Skeptiko, inquiry to perpetuate doubt. And it must be annoying to other people sometimes, but I’m always thinking to the counter of that, you know, which on one hand, I totally, totally agree with that. And I think you make a great point and I think the way you characterize it is level zero, obviously, yeah, that normies, and that is such a pejorative term, but we get it. We all get it immediately.\n\nBut at the same time, there’s something fundamental about where we get at the end in level three, that is almost circular and brings us back to level zero. Because it’s like, really, what the fuck are we going to talk about? We might as well talk about football, and we might as well talk about the weather, because to suppose that we can have some deep, deep, you know, and really solve these answers to these questions in any other way than just kind of intellectually, just kind of stimulating ourselves. I don’t know. Maybe it is back to, there’s a certain basic human connection at level zero as well, that I think we got to acknowledge that it’s just like, hey, I’m a human being, you’re a human being. What the fuck, let’s talk about the weather and whether it’s going to rain today, you know what I mean? What do you think about that?\n\nJames Ellis: [00:07:04] Yeah, I agree. But if someone started talking to me about the weather, I probably would try to shy away from it. I think that’s a question of method though. So like anything can be super, super interesting to talk about, but it’s a question of how you approach the subject. Just saying, “Oh, bad weather we’re having today.” “Yeah it is.” Those are the kinds of conversations I actually really struggle to do because I don’t really see the point in them at all. But if someone was saying like, you know, if we actually began a discussion, someone came up to me and said, “Do you believe the astrological movements make it rain or whatever?” I’ve never really looked into that, but if they said that, I’d be like onboard straight away.\n\nSo I get what you’re saying, that you can actually come back round and it’s in terms of everyday reality, there’s a certain intuition there, which makes things super interesting.\n\nAnd I know I’m already bringing him in, you said we were going to mention him, but John Michael Greer, his whole sort of approachable conception of cultism when he sort of says, once you sort of begin to understand the way these things are working, the way you intuit the world, things begin to appear to you, which you are taught to say are rubbish. So it’s like those weird feelings you get at a time, or the idea that in a certain room you shouldn’t go in there or a certain forest, there’s something strange. You’re in a place and you think, something happened here way back in time that was really awful. Something along those lines. And that intuition you just get taught to suppress it because it’s not, we already jumping into the science thing, it’s not scientific, it’s not logical.\n\nBut that level three to level zero connection is you can utilize level three to begin to sort of, what I’d say is enchant the world.\n\nAlex Tsakiris: [00:08:48] There’s a lot to probably break down a little bit there. And I love jumping into the middle of this stuff because if we lose people great, you shouldn’t have been here anyway. But if you stuck around this long, then maybe it is worthwhile to go back and kind of just tell people where you’re coming from in general. And I think this idea that you talk about so much, accelerationism and zero accelerationism, I think, capitalism. I think you’re going to have an idea that certainly is…\n\nI’ve got to say when I first heard you talking about capitalism, I was like, what the fuck is he talking about? Versus compared to what, there is nothing else, other than free people doing what they want to kind of survive. Anything else to me seems absurd. But we could talk for an hour on that, so go ahead.\n\nJames Ellis: [00:09:53] Okay. So yeah, so I should have sort of done a full intro. So, for those who don’t know me I host Hermitix podcast, which is a podcast of philosophy and fringe subjects, so cultism, parapsychology, weird stuff. I think anyone who’s into that stuff sort of know the kinds of topics that would be on there.\n\nI target it primarily from a continental philosophy angle because that’s what my education background is in. My master’s is in continental philosophy and when I was studying continental philosophy my tutors were great, they were great people, they taught everything that was on our curriculum and they taught well. So this isn’t really anything against them at all, I still speak to them and I’ve had one of them on the show. But in terms of the way academia confront philosophy in those terms, it’s very disheartening because there’s a lot going on behind the scenes which is sort of ignored because it’s almost like we don’t have time to get into this conversation, we don’t want to go there, right? And I think there’s a huge history of philosophy in general, not specifically continental, but I think more continental because philosophers are more open to it.\n\nSo one example I’ll give just to cut to the chase on this is that Schopenhauer, super serious philosopher in the canon of Western philosophy, the Will-to-Life, we’re all stuck between suffering and boredom, but also incorporated all this Eastern stuff. Now the Eastern stuff is accepted because it’s compatible into his system. But not many people know that actually, he said at one point that if any of this is worth anything, it’s because telepathy might be existing, it might exist. So he’s sort of taking these things seriously.\n\nAlex Tsakiris: [00:11:39] When we say these things, let’s make sure, because Schopenhauer is one of those guys who kind of crosses over, right? So a lot of people in the kind of consciousness interested kind of folks reference him, but then a lot of people kind of in the philosophy fields reference him as well. So what is he getting at, in terms of consciousness since that’s a topic that I’m super interested in?\n\nJames Ellis: [00:12:09] In terms of consciousness, what I’d say for Schopenhauer… I view everything like, and I mean everything through the lens of Kant, Immanuel Kant. Now, it’s very difficult to get across Kant’s philosophy in less than an hour, but I’ll try and just get off the super important bit, which is the difference between the phenomenal and the noumenal or what we would understand as representation. So in terms of our senses, our perception, for Kant, as a human, the way in which the world is presented to us, it is a representation. So when you look at something you’re not looking at the real because it had to be processed by your brain. So it’s represented to you. So Kant’s point is that via our senses, at no point are we dealing with reality.\n\nNow, this is sort of reworded by many, many people after Kant, and there are plenty of spiritualists who’ve come to the same conclusion after Kant. I just generally always think, actually I really do think Kant was the first. He was definitely the first to do this rigorously in The Critique of Pure Reason which is an extremely tough book. But if you just accept that premise, when we move to Schopenhauer, he then incorporates the Veil of Maya, which is this Eastern concept, which I believe comes from the Upanishads, I believe. I’m not a Schopenhauer expert, but the Veil of Maya is something that, as I understand it, can be stripped back.\n\nSo I think the point for Schopenhauer is he readily admits that we can never actually truly attend to the real, because anytime as a human, even if we’re on some amazing drug trip or we think we’ve broken through to the other side, whatever that means, we are always in that Kantian doubt that because we are processing it, we can just never be sure it’s the real. However, I think for Schopenhauer there’s definitely a possibility of communication from that other side.\n\nSo he’s saying that none of this really is important at all unless telepathy is this possibility. And I think what he really means by that is, unless there is a possibility of communication between the absolute real and us, unless we can somehow actually begin to work out what is on this other side of this objective, then what’s the point?\n\nAlex Tsakiris: [00:14:27] Excellent. You know, one of the problems, I guess I struggle with in terms of philosophy, the way that it’s currently practiced, a lot of the people that I’ve listened to on your show, is they seem to be swamped by scientism. So what you just described is really just kind of a reworking of kind of yogic, Vedic kind of philosophy. Re-injected, reinterpreted in this Western philosophical way. Which always to me is interesting on one hand and the rest of the time it’s like, go and reference your sources on that. Because the way that it seems to be swamped is that the fundamental question seems to be the scientific question of consciousness, and that’s why I always start with the absurdity of the claim that we live in today, in terms of… And we’ll get back to John Michael Greer. On one hand in the time I sound like. Go reference your sources on that a little bit, because the way that it seems to be swamped is that the fundamental question seems to be the scientific question of consciousness.\n\nAnd that’s why I always start with the absurdity of the claim that we live in today in terms of, and we’ll get back to John Michael Greer because I think it circles back in a way. And that’s that we live in a science centered culture or really scientism centered culture and the idea that consciousness is an illusion, that you are an epiphenomenon of your brain is central to that in a way that philosophers haven’t processed. And in a lot of times, they’re just kind of following along blindly and making a lot of building on that in ways that they don’t even understand to go back and question the basic, who am I, why am I here, kind of nature of consciousness questions.\n\nSo let’s turn that into a question, because we did this fun survey thing, and I’m really glad that we had a good time doing it and looking at each other’s answers there. What is conscious? Is consciousness fundamental? Is consciousness an epiphenomenon of the brain?\n\nJames Ellis: [00:16:32] Can you expand on what you mean by epiphenomenon of the brain? Just so I know that I’m coming at it at the right angle.\n\nAlex Tsakiris: [00:16:41] I’m sure you are, but just for benefit of people because I always emphasize this point over and over. But if you walk into… what university did you go to?\n\nAlex Tsakiris: [00:16:58] Staffordshire. So if you go there and you go into the neuroscience department, they’ll tell you exactly what consciousness is and pull out all their machines and they’ll measure it, and they’ll say, here it is, it’s in your brain. So consciousness is 100% a product of brain chemistry, brain electrical activity. It’s in your brain, man. There’s nothing else outside of that. And the thing that I don’t think people fully grok is the extent… Because what people will say when you confront them with that, they go, Well, there’s a lot of scientists that aren’t that locked into that.” It’s like, no, not really. I mean, that is the dogma. That is the doctrine. If you’re outside of that, then you’re really playing a different game because at the end of the day, that is the understanding of what consciousness is. Consciousness is something that, if you want to get a little bit fancy, it’s an emergent property of the brain, but it’s still brain based.\n\nSo what do you think, is that your understanding of what it means?\n\nJames Ellis: [00:18:09] I would argue that that isn’t an understanding at all, and this is the problem of science and scientism for me. I’d just like to take a minute to just dwell on the scientism thing, and that idea that it’s almost leviathan of culture, it’s our new God, right? It’s the thing that we go to to make sure that everything we’re doing is right.\n\nIn terms of continental philosophy, one of the reasons actually I wanted to study it, is because one of its sort of cornerstones, which is why it’s split from analytic, is that it has this inherent distrust of science and scientism as this overarching way to explain the world, right? Because how you outlined that consciousness is the epiphenomenon of the brain is the same problem that I run into with science all the time, which is this idea of going into the neuroscience department and they say, X, Y, and Z, this is consciousness, or consciousness is in the brain, or it’s an emergent property. Okay, what the hell does that mean? Well, it’s an emergent property. Or they’ll say X amount of atoms does this, blah, blah, blah, blah, blah. It’s okay, that’s fine, but what the hell does it mean? Right?\n\nSo what my point is with that is, it’s very easy for them to describe anything, or explain anything within this recursive language. So it’s like, why does a cancer cell do what it does? Okay. Well, cancer cell is already your own terminology. It does it because of this certain mixture of chemicals, which is also their same terminology. And the way that they’ll justify doing that is… and you’re always within this circle of them explaining things. And there’s no originary point where you can go there’s the objective truth. It’s sort of a language game for them, it seems to me. And I don’t want to bring everything down to language, but what I would say is, I’d give the example of Heidegger, Martin Heidegger, a continental philosopher, he wrote Being and Time. I’ll try and not make this too complicated.\n\nBut he takes on Descartes, Rene Descartes, his cogito, probably the most famous saying in philosophy arguably, “I think therefore I am.” Now, this is taught in high schools as this saying, which you just say it, and it’s like, I think therefore I am. This is sort of the same thing we’re talking about with consciousness. So you say, I think, therefore I am, and everyone goes, “Oh, wow, yeah,” like that means anything.\n\nHeidegger sort of steps back and he says, “Well hang on, what the hell is am? What the hell is being? And it’s just meaningless, I think therefore I am. Okay, well you’ve outlined massive, massive things there which you haven’t taken on. What the hell is I? What is it to think? And what is am, what is it to be? And you haven’t actually addressed any of them. And Heidegger then goes back and addresses being, and I think he does a good job.\n\nSo I would completely disagree with the scientists, what I would say is I’d go back to Kant again in that the only thing we can assess reality from is what we are given, what works, which is this representation. We may very well be stuck in something which isn’t real, but you can’t do the scientist thing and just say, “This is consciousness, we have it.” I just think that’s a bit of a lie, you have to begin from… I don’t think Kant’s proposition… you can’t disprove the proposition, it’s like how can you prove that this is reality if we have to process it first? You have to begin from that.\n\nAlex Tsakiris: [00:21:32] I, so I fundamentally agree with you, right?\n\nSo, but the part that I think you know is tricky there is that in a way Kant is introducing. The miracle that we’re trying to avoid in the first place. So it’s almost like, you know, we are fundamentally this experience. That’s all we know. Right. And in when we get into the, that’s why I think the AI stuff and you know, simulation hypothesis stuff is so interesting.\n\nAnd my go-to guy on that is Eckhart. Totally. You know, the modern kind of spiritual teacher where he goes, okay. And someone pushed them on the simulation theory, and he goes, okay, so let’s say we are living in a simulation. You’re still there. You’re still the one experiencing that. So your experience is all you can know without invoking miracles.\n\nSo to a certain extent, the problem I have with con is it’s in a way. To me, it’s backdoor materialism, because it’s saying, okay, you do have this brain, you do have these senses. You are interpreting the outside world as it comes in. So, aha. Therefore you’re one step away from your experience. It’s like, well, you’re assuming now all this kind of stuff that we want to strip away and say, we don’t want to assume.\n\nSo if we start with just, we are. We are here. We are aware we are conscious. It seems to me that that has to be the starting point. Not that we are interpreting being here. Do you get what I mean?\n\nJames Ellis: [00:23:23] Yeah, no, no, no, no, I get it. I get what you mean. but I would say that you can’t ignore that proposition of the fact that your reality is because we, we, we, our understanding is that we do sense it, you know, the way that we, we.\n\nApprehend, this can look say to world vision, sight, hearing, touch. These things are things which have to be processed. So this is an argument that you can’t deny now with the idea of the materialism. That’s a super, super interesting idea because camp has been sort of reformulated by some people to be this of radical materialist in the sense that we exist within a materialism of our own sort of cell.\n\nAnd we’re just sort of stuck in this prison of materialism. and. The way out of that is to do with time in the sense that linear chronic time, it just isn’t real, but it still has to be in time. Everything is in time. So we have this linear time, which is false, but it’s still in time, which implies that in some way, pure time.\n\nIs a gang to us. Now. That sounds very, very complicated,\n\nAlex Tsakiris: [00:24:28] I think it’s just complicated, but it’s kind of self-contradictory right. I mean, it’s like,\n\nJames Ellis: [00:24:32] yeah. Having like two times is it’s really difficult to think about.\n\nAlex Tsakiris: [00:24:36] Yeah. And so what do you, what do you make of, you know, the go-to where we always wind up on this show a lot of times in turn with people who are.\n\nKind of have this science bent because you know, the first book that I wrote by science is wrong about almost everything was really about consciousness and centering around the experiments that have been done. Like what do you make of the quantum physics, you know, early 19 hundreds. Double slit experiment.\n\nSchrodinger’s cat. That’s usually our go-to in terms of pointing to a way that that kind of in a more direct way gets at falsifying. The kind of stuff you’re talking about. These are,\n\nJames Ellis: [00:25:23] these are super, super interesting experiments, but the people who are doing them on using them correctly, well, I mean by that is, I’m just going to stay on the camp line because we’re there and it’s easy to use the way in which we do interpret it.\n\nWell, that’s we are, we are then a subject, right? So we have a subjectivity. The world is a subjective relation to us. The interesting thing about these experiments, these, these quantum experience, double slit experiment, and one recently, which Eric wog I mentioned, and he didn’t seem to what seemed to see what I was trying to get at.\n\nHe mentioned a quantum computer, which supposedly produces. And effect, which affects its because. So it’s a retro causal, so it’s affecting, it’s affecting something that’s beginning. Right. And I said to him, I pose this question is what is the subjectivity of that computer? And in what’s the, you know, if we were to go into the mind of that computer, in what way is it actually.\n\nBeing presented reality because it’s clear to us that it isn’t the Holden to linear time because it can play around with time. And he sort of said, Oh, I don’t, he, he w he, he is assessing it in completely different ways. Completely fine. So I was then thinking, well, we’ve got this computer, which is now sort of completely out of joint in time, because it can play around with what we understand as the future of the past.\n\nAnd that then I think is the easier way to begin to think about time and consciousness. Is that. Our consciousness, the way that we experience reality, if that is how one could define being conscious is completely trapped within. The progressive forward mode of time. Uh, if we have to do anything else, it just wouldn’t make any sense.\n\nOur consciousness is completely like just clutching to that idea of the future and the past and the present. And so then I think any serious question of consciousness needs to begin to, especially when you see things about like this quantum computer is, or what is, you know, very simple question would be is why is it that our consciousness processes time, the way we do, And then the answer to that is very difficult.\n\nIt’s very bleak because I personally, you know, the, the philosopher that I’m about to release a book on in probably less than a week, less than two weeks, Nick land calls it a human security system. You know, it’s a system of security for us because it gives us, you know, as, as almost a resource for something larger than us, it gives us this progression.\n\nbut the past and the present of the future, Only makes sense in linear time, which isn’t real. So they just do not exist in that way. That’s not how time works. and as soon as you know, now we are beginning to play around with things, you know, era, you know, while goes great because you’ve got these things like pre-cognitive dreams, which are basically this documented proof that time doesn’t work, how we think it is in this quantum computer is playing around with, you know, the past and the future and putting them.\n\nYou know, mixing them up. It’s like, okay, we just need the continents, the double slit experiment. We just need to accept time does not work how we think it works. And all it is is if we were to say that humans are, you know, let’s call it linear time. Just linear and humans are humans. Humans interpret time, linearly.\n\nThat’s it. Other things might not, we can’t prove it any, any other way, because we’re stuck in linear linear time.\n\nAlex Tsakiris: [00:28:46] Man again, one, I don’t know if anyone’s gonna be able to follow this conversation or number two, if they’re how many people are interested in it,\n\nJames Ellis: [00:28:56] spoken about this stuff so much at the time and stuff.\n\nAnd like, I will admit, I, every time I try to think, like, how can I make this simple? How can Nick listen? And it, it’s something your brain really, really struggles with. And I think that’s actually built in to linear time. Is that energy stuff thinking like. No the future isn’t a thing, but it could stuck in it and you just cannot comprehend it.\n\nAlex Tsakiris: [00:29:18] Totally. But there are so many tricky points to that. So are you familiar with the work of Dean Raden in his pre sentiment? Experiments? I’ve\n\nJames Ellis: [00:29:27] heard of Dean Dean Raden, but I haven’t, I haven’t read it.\n\nAlex Tsakiris: [00:29:30] Yeah. You’d be really interested because, so he’s a pair of psychologist,\n\nAlex Tsakiris: [00:29:37] So with these guys, these guys were on this thing kind of from the beginning, just kind of taking it from another angle and Raden came up with a great experiment and he’s.\n\nSuper smart guy, you know, PhD, bell labs university of Illinois, all this kind of stuff, but now at the ions Institute. So he said, look, I’m going to take an old, tried and true freshmen psychology experiment. Sit you down in front of a computer screen and then show you images. Some of them really horrific.\n\nSome of them, you know, bunnies in a Prairie kind of thing. And I am going to measure, this is the pre sentiment versus pre-cognition, I’m gonna measure your physiological response to those. So these have been done like for a long, long time. He said, let’s look at that data more carefully. And what he found was a response.\n\nBefore the image is presented actually before the image is even selected by the computer. So, boom. So now we’re instantly, you know, pre cognition present. Moment. Time is blown out of the water there. The experiment is replicated over and over again in his lab. At this point it’s been, it’s been one of the most replicated experiments.\n\nGoing, because he’s really driven that home seven labs across the world over 50 times, six Sigma kind of result, you know, from science statistics, it’s over the top in terms of repeatable. And it does totally blow away this idea of linear time as you’re talking about the, the, the, the interesting thing about that to me, there’s a couple of points.\n\nOne. You know, we’re still limited, like in the languages, you said, you said our consciousness, right? So even that is a question, is it our consciousness? Are we in consciousness or are we separate from consciousness? And some philosophers that, you know, Bernardo Castro, dr. Bernardo Castro is one of our go-to guys here.\n\nI think he makes a strong case that. Idealism is a better way of understanding this and that we are in consciousness in some way we can’t fully understand. And the other thing I think that that supports that from a data standpoint is we have all these extended conscious experiences that we have to deal with.\n\nNear-death experience science, hold on. This cat is insisting to go out, stay there, here. Near death, experience science you know, you’re mentioning hallucinogenic kind of experiences, all those things, ITI experiences, they, one characteristic they all have is they seem to bounce us outside of space and time.\n\nRight. So what you’ll hear from a near-death experience person is I was there for a week. I came back, I had been clinically dead for seven minutes. Yeah. So there’s this kind of,\n\nJames Ellis: [00:32:53] I’ve had one of these experiences. I haven’t had a near death experience, but I had one of those sort of weird temporal experiences.\n\nWhen I was younger, someone we used to play this game when we were kids, it’s probably a very British thing. I don’t know if they do it anymore, when you can get your elbow around someone’s neck. And if you. If you get the two, I don’t know what it is. They’ll pass out. And we used to do that when we were drunk, which is a bad idea.\n\nDon’t condone it. We do silly things when it gets anyway, you know, I vividly remember this. I got knocked down and my memory then was to walk from my house. To my friend’s house where I was, which was a 30 minute walk. And that’s all I did when I was knocked out was do this walk. And then when I got to the kitchen in the house, I laid down in the position and work up, but I was 100%.\n\nBut then when I woke up, I was like, Oh God, I’m so sorry. I was apologizing because I thought they’d be worried. Because I was passed out for like 30 minutes. And they were like, what do you mean? What do you mean? I said, I’ve been gone ages. And they said, no, no. You’re like, you know, five seconds. And that was my first time.\n\nI said, okay, time does not work. Time does not work. How you think it works.\n\nAlex Tsakiris: [00:33:51] And as you said, we don’t really know what to do with\n\nJames Ellis: [00:33:55] no, I mean, that’s the question? Where was I, what, what is it? And I mean, I think this is what a lot of people are when I had, Oh, that’s really bad. I forgot his name. We were talking about DMT and he’s sort of saying that this is, I think this is on a practical level.\n\nOne of the best things to do is find a way to prolong and like stabilize. The the time in these areas, because they’re normally so fleeting and chaotic, you can only just sort of grasp onto them and then you’ll, you’ll draw them back. So if you can sort of prolong it, but I think there’s another question there as to the why is it that our brain or consciousness dis allows us to retain what it was we learned in that, that other time?\n\nRight. So most people who’ve done acid say like, they really can’t remember anything of it, but. Something is retained because they learned something from it. So there’s a question of memory and retention is that, you know, in terms of senses, you just can’t remember anything. It’s like a protection, but then other people, you know, report their OCD suddenly gone and they don’t want to smoke cigarettes anymore.\n\nSo there is something has been retained. So I think there’s something interesting. There,\n\nAlex Tsakiris: [00:35:04] are you familiar with the near-death experience science, the work that’s been done there?\n\nJames Ellis: [00:35:11] no, I’m not, no,\n\nAlex Tsakiris: [00:35:13] you know, there’s some of it that, again, just kind of swapping stories now that I think you’d find interesting along these lines that we’re talking about on the one, not particularly jumps to mind, I use it all the time, but it’s from a British, Researcher PhD in nursing.\n\nUh, her name is dr. Penny Sartori and she worked in the critical care unit of a hospital for a long time and came up with a rather novel experiment. That’s been replicated since where she went to people in the cardiac arrest board who had experienced cardiac arrest and had clinically died. And the important thing there is from this back to this.\n\nHard problem of consciousness. You know, consciousness is an emergent property of the brain physiologically after cardiac arrest. We have as good a handle as we’re going to get on what goes on. You know, we’ve studied that for a long time in humans and animals, and we think we understand what’s going on so it could change, but we think we understand, and we don’t think it’s your brain is in a state that can create memories or create.\n\nThese kind of radically radically conscious experiences that people report. So she goes through them and she says, okay, you just died. Tell me what your end, tell me what your resuscitation was like. So she’s got a group of patients, right? So she has 60 patients. 30 of them have had an NDE. 30 of them didn’t have an NDE.\n\nShe goes to all of them. She goes, tell me what your resuscitation is like. The ones that didn’t have an Andy they’re like, lady, what are you talking about? I was dead. Right? Nothing black, nada. I don’t know anything. She goes. Tell me, tell me what you think. Just tell me what you think they go. Okay. Well, I think this and this and that, like out of the TV show, she goes to the 30, that had a near-death experience and they are able to recount it.\n\nExactly. They go crazy. I was immediately, I was shot up and I was on the. Outside corner of the room, or I was right next to the doctor or I was two feet under, but then I moved above my body and I saw them wheel in this cart and they put the paddles on me, but the paddles weren’t working and then they were frantic.\n\nAnd this they’re going into exact detail of what happened to them during resuscitation. So we can deal with the time part, which also comes into it because I have all these extraordinary experiences in like you that come back and go, you know, it was five minutes. It wasn’t, you know, what you think it was like two days or whatever, but it also kind of challenges us in terms of even the question of what.\n\nWe are processing in that extended realm and what we can bring back, because here’s a point where people are bringing back very vivid memories, but then they’re also at times kind of echoing exactly what you’re saying. Then they go because it in Vera, not invariably, but sometimes then people transcend to this other, you know, super extended reality.\n\nAnd they’ll say things like. Every question before I could even verbalize it in my head or even think about it was answered. And I felt like I knew everything. And now I can’t tell you, I just tell you that I have this internal knowing, like you said, and my life is like this and their life. Isn’t always better.\n\nAlso they have integration problems, much higher rate of a divorce, much higher rate of physical problems a lot of times. So there’s the people who’ve really studied the near-death experience and the aftereffects of it. It, it does provide an interesting lens, but it’s not easily kind of chopped and parsed in that.\n\nWhat do you think of that? And then, then we’ll talk more about that.\n\nit’s tough. It’s tough. I mean, not, I always gonna assess consciousness.\n\nfrom what we can use. Because otherwise I don’t think that’s a scientific thing. I think that’s a practical, practical thing. So, I mean, this is like going back to Heidegger. I think just to give one example of the way I would begin to assess is saying things such as like between physiology and consciousness.\n\nI think these are sort of unhelpful because they’re already these conceptions that are. Made up bias to explain something else external to us. So it’s like we can sort of buy into our own bias. And I think Heidegger is the one, one of the few philosophers who really, really, really strives to make sure that he is not falling back upon his own biases in and beginning from the absolute base of being his then defines manners does zine, which is just there is or basic sort of.\n\nIt’s bad. I just can’t remember it. I spoke about it just the end of the day, but the, the primary points you remember of design is that Heidi guy begins by saying, okay, well, one thing that is primary to us, which is super, super important about you could say being, well, you could say consciousness is we are beings which investigate are and being.\n\nThat is sort of his starting point is we do know this because we are already what we’re doing when we’re doing this is assessing it. So what does that tell us about things? And I think to begin from there, and I think my problem with it and the reason I probably haven’t read a lot of the consciousness literature is that I think it just does seem to me that so many people have had these experiences where they’ve, they’ve gone elsewhere or done this or this or this they’re so deaf.\n\nThey’re just so different. you know, the only one I’ve heard of is that monks who meditate almost all of them end up believing in reincarnation. And I think it’s, we need to pay attention to when there is a pattern. I think that would be the important thing is to try sort of. Okay. Here’s the big problem, I think is I think the outline, our scientific language is incompatible with where we go and I’ve, you know, in a, in an episode of the hands girding, he said the absolute can’t be known.\n\nAnd I would always take the pessimistic view. Some could say pessimistic or. You know, individuals who have these experiences, they get the knowledge, they get it, they made the, they, they did the bridge. There it’s a, it’s a subjective intuition to them. I don’t think there’s a way where that communication is going to be universally bridge for us.\n\nI don’t, you know, I just don’t think that’s, that’s a thing. I don’t know. That’s sort of a cop-out answer and a bit depressing, but that’s where I sort of stand on it. Is that. It’s, you know, that’s not going to happen. I don’t think we’re ever going to be able to, sort of logically explain what’s going on over there because we don’t have that.\n\nWe don’t have that compatibility and I, in our minds to be able to do that,\n\nAlex Tsakiris: [00:42:19] See therein lies the problem with, I think, philosophy to a certain extent. No, really. I know I’m maybe poking the bear there a little bit. But it’s like ultimately we do have a need for some grounding, most of us have a need for some grounding in something that is like science, some kind of organized, systematic, empirical way of measuring and figuring out what those measurements mean. So I think we like the idea that we can collect 1000 or 2000 like Dr. Jeffrey Long has, near-death experiences and then catalog them and understand them and say 96% of people that come back from a near-death experience no longer fear dying versus in the general population it’s one of the most pronounced fears that they have. Or 76% of people see deceased relatives. So we want to measure almost by our nature and that draws us to science.\n\nSo when the philosopher comes along and says… there’s a certain denial of that in a way that I think is hard to take, because we do want to measure, even if we understand the inadequacies of it. What do you think about that James?\n\nJames Ellis: [00:43:49] I mean, I would say that there are philosophers who have actually tackled this problem. [Unclear 00:43:58] is specifically a philosopher of specifics. He always wanted to make sure that we were being very correct about our assessments. And this is one of the things I think Hermitix, my podcast is trying to bridge is that these things are ignored, and they’re drawn back into this sort of suppressive language of philosophy where you do need to a more holistic approach. And the combination between these things is where it begins to get interesting, because if you remain just in the, like in the consciousness sphere, I think they get a bit caught up. For instance, I find Jung so fascinating because that mixture between occultism and someone who really understands the human psyche is far more, dare I say it, progressive in terms of if someone truly wants to heal themselves, let’s say. If you want to heal yourself and you’re just stuck within the language of psychology, well then you’re also stuck with the cures that they offer, which aren’t very good because you’re only remaining in sort of one sphere of existence, and what might be happening to you might be happening on a far greater level. So I think that that’s why.\n\nBut in terms of sort of tackling head on why philosophy is sort of stuck. Yeah, I can’t do that.\n\nAlex Tsakiris: [00:45:12] No, and it’s not fair, maybe I was… Wait, I’ve got to poke you one more time before I let you go here. Poke you twice actually, but with John Michael Greer. A fascinating guy. And you guys, I don’t want to say you guys, but people like him, I so admire in so many ways, and he has taken this whole dialogue about the myth of progress and advanced it in a way that kind of brings an undeniable reality to the situation, that that level zero kind of person you were talking about, just needs to have it jammed in their face, I guess I feel. And maybe that’s what you were saying at the beginning, is you just want to go and go, “Bullshit. I mean, you’re just not looking at some of the basic real data that we have on that.” And that’s, I think, to your credit and to some of the folks you have on your show.\n\nBut here’s the rub with that. John Michael Greer believed some stuff about global warming that isn’t verifiable scientifically, and worse yet, back to my level two conspiracy thing, seems to have been tainted by forces that want to push that narrative in another way. So like when Al Gore 25 years ago stood on that kind of thing, in the movie and he raised up and he had a little pointer, he said, “This is where temperatures are, and this is where a CO2 is going.” Well, you can be a level zero kind of person to go, “Al, we’re 25 years on. The oceans have not risen,” which is the only measure we ever have to look at. I mean, where you live they measured the tidal rise and the level of the ocean for hundreds of years, it’s not that complicated to do. It hasn’t risen.\n\nThey go back and they can look at the ice caps and that, and the ice core things they do, they can go back and look at hundreds of thousands of years. And they’ll tell you, long, steady sea levels for a long time, but then, you know, big changes also.\n\nSo when John Michael Greer can’t get that right, that is a red flag for me. He can’t course correct. He can’t say, “Gee, I was wrong about global warming, but here’s how I process that now.”\n\nBut the second thing I want him to say is, “I was wrong about global warming because I got bullshitted. I got played by a globalist force that wants to advance certain issues that can only be solved globally.” And whether you like that or not, it is definitely a political kind of thing.\n\nAnd the other side of that is not like good. I’m not saying the fascist kind of nationalist thing is good in any way. I’m just saying, unless we understand those two forces politically and how they’re corrupting the data, how they’re corrupting our ability to try and understand the data, and that is conspiratorial. And unless we can approach it from a conspiratorial standpoint, we don’t have the beginning thing to launch off and make a whole bunch of assumptions about environmentalism and about the myth. Even the Myth of Progress we have to then step back and go, okay, what does that really mean if I’m wrong about global warming? And what does that mean about how I was duped about global warming? Any part of that you want to latch onto?\n\nJames Ellis: [00:48:53] Yeah, specifically with Greer, I’m not sure he’s entirely wrong about global warming, because he comes at it sort of with the angle of Druidry, which is more of a respect for nature, as opposed to the…\n\nOne of my big problems with the climate change argument is that underneath it’s a very selfish argument. It’s like ownership of the globe. Like we need to stop it because it’s our earth. And it’s like, well, even if you don’t stop it, the earth keeps going. Whether or not it’s true, I’m not going to get into that debate, but let’s just play devil’s advocate and say that these things are going to happen, it’s all going to rise up and temperatures go up, oceans rise up etc. etc. We’re only doing that for our own benefit. I don’t really think it’s because we care about the earth, because if we care about the earth, a lot of the things that we need to do to stop climate change, we would already do.\n\nSo I think Greer is coming at it more of a, like, instead of saying that the people who would say, “Oh, no, it’s fine to cut down the rainforest, but make sure you put up some renewable sources of energy there instead of coal mines.” I think Greer is more along the lines of, “Don’t cut down the forest, we don’t need to. You’re caught up in a consumerist game, which you don’t need to do at all. We don’t know needle this modern tech.” So I’d say he’s coming at it from that direction.\n\nAlex Tsakiris: [00:50:14] And I guess that’s where I’m kind of jumping three levels into the conversation. I got to quit saying levels because I’m going to confuse people, but it’s like, that is the brilliance of the point that he makes. And I think the way you articulated it was particularly good. And that’s the part that I want to go jam in the face of the level zero people. And I also want to jam the science in their face and say, you think you’re driving your Prius and you’re saving the earth, even with inside the confines of your own ridiculous, the scientific understanding of it, you’re not. You’re generating more CO2 with your fricking Prius.\n\nAlex Tsakiris: [00:50:52] But the real point behind all that, I think, that isn’t exposed by a lot of people who are in the kind of soft sciences, including philosophy, but also including a lot of the other soft sciences, is the point that you made that I’m not going to get into the debate about climate change, which is a PSYOP in and of itself, right? Because it’s really about global warming and they’ve managed to kind of change the language, which we all know is a powerful way of kind of controlling…\n\nJames Ellis: [00:51:23] This is one thing, it’s one thing I wanted to just put in that before we go any further. So in linguistic theory, I’ve not a master, I might get this completely wrong. Maybe a linguist might here this and go, “God this guy is right off.” But in linguistic theory there’s a thing called a free-floating signifier. So a signifier is a word, you signify something. You say a tree and we all have an image of a tree in our head. However, you have these things with free floating signifiers, which are basically signifiers which then, they’re just flowing. They mean so many different things to so many different people, that they’re basically meaningless. Postmodernism is a great one, or even modality is getting in there, right?\n\nJames Ellis: [00:52:09] That’s exactly what I was going to say. Exactly what was going to say, especially with all the corona stuff going on. My point I’m trying to make with this is everything that we’re talking about here is really about control and power. And corona is a great example, because in the news here in the UK you hear things like… my favorite one they say, and they say it every single news cycle without fail. I would actually put all the money I have on them to say that. Every single daily news broadcast features it, which is, “experts”. “The experts agree.” Whoa, back up 10 steps. Which experts? Why are they experts? Why do we need these experts? And they’re talking about coronavirus spreading. Whatever you think about coronavirus, the statement, “the experts have said this”, is absolutely meaningless. The same with, “the scientists agree”, or “science says”. It’s absolutely meaningless.\n\nAnd this is power language because people just offload their personal responsibility and individual responsibility onto these words, and they understand them as things which will keep them safe. The Ernest Becker argument of civilization is there just to lead us away from the fact that we’re going to die. These are also just words to lead us away from the fact that we are still responsible for our own wellbeing, which is why I think people are actually becoming quite ill is because they’re constantly caught up in the paradox of… they’ve inherited this idea that the scientists are right, but they’re consistently wrong. The same with experts. So you just sort of caught in this absolute hypocrisy.\n\nBut as Deleuze and Guattari say, nothing ever died of contradictions, it just keeps going, this sort of absurd madness, it just keeps going. Nothing dies of contradictions but what do you end up with? This strange oppressive mutation where you just go, “Scientists said it.” “Wait, so that means we have to do it?” “Yeah.”\n\nAlex Tsakiris: [00:54:16] Well, you know, I think we’re, we’re running out of time. You have a time limit.\n\nJames Ellis: [00:54:20] I’ve got about 10 more minutes.\n\nAlex Tsakiris: [00:54:22] Okay. Well then I will throw out the question. Because in a way, what we’re both trying to do here, and there are so many points that you just made that I could go, but how do we find terra firma? How do we find the ground that we stand on, from where we can at least approach some of these topics? Like, when you threw out the fear of death thing, in a way I almost feel like you brushed over that too quickly. It is fundamentally maybe the only thing that is really at play here.\n\nAlex Tsakiris: [00:55:01] So we can’t go to the next thing and say, and this is another… No, it’s like internally that’s what it’s all about. From the Eastern perspective that’s how we’ve built all these [unclear 00:55:14] that constitute our definition of who we are.\n\nJames Ellis: [00:55:18] This is the huge problem of the modern day, is that the only reason things can mean anything is if they’re put in a finite framework, which is eventually going to end. What does your family mean if you know that one day you’re going to die? Which then makes you think, right, so I need to, you know, build up something for them and I need to teach these lessons and keep that going and build a great family. You know, what does this project mean if one day I’m not going to be here, or the project would end?\n\nThe problem is it’s a schizophrenic problem because the schizophrenic doesn’t adhere to any of this. So the schizophrenic goes beyond death because it doesn’t have anything that’s going to die. And this is the problem of the modern day, is that everything that we’re in, all institutions, the media, social media, everything teaches us to live, not in the present in the Eastern sense, but in the, what I call the nano present, right? Just the smallest iteration of a news cycle. Like, what are we talking about today? This, this, this, this. Right, you’ve forgotten about… I always list things that people are probably… like Brexit. It’s gone. Or Black Lives Matter before corona. Or corona and now it’s the election and it’s like all these things are just forgotten in an instant. And this really removes the position of purpose and meaning for man because you completely forget that you exist on a finite timescale. We need to remember that, I think it’s important, super, super important to remember that. But modernity hates death and suffering, it sees them as bugs, not features of reality, it wants to get rid of them.\n\nAlex Tsakiris: [00:56:57] I don’t disagree with you on that, I just wonder if the problem is more fundamental. And getting back to the kind of nature of consciousness question, you know, one of the spiritual questions, two of the spiritual kind of little quips that I like is one, you know, the spiritual path is easy for one with no preferences. And the related one to that is, who am I and who have I become?\n\nSo we are all making these assessments about what we like, what we don’t like, who we are, and that has created this image of who we are. So I almost feel like when we say modernity, I get it, we all understand it. We all understand the oppressive force, but it’s really just a substitute for the experience that a particular… I’m drawn to some of the Eastern philosophies, have kind of pointed out all along. It’s like, no, man, it’s not really modernity, you just created this shit. You’ve created this shit by being so attached to one, the thoughts that you’ve created, but two, the experiences that you’ve had, that you misinterpreted, right? You know, it’s the classic, you see the stick on the ground on your walk and you think it’s a snake and then you recoil because you thought there was a snake on the ground. There wasn’t a fucking snake there, but you’ve processed it now as a snake and you’re going to have to un-process that if there is some getting clean that is desirable at some point.\n\nSo is the Eastern approach, does it kind of jump over a lot of these perceived problems with modernity and Myth of Progress kind of issues?\n\nJames Ellis: [00:58:48] I think it does, but I agree with… John Michael Greer says that people should only do drugs from their nation, from where they were brought up, from their area of the world. So if you’re European, you should just sort of drink alcohol and etc. etc.\n\nI think the same is true of spiritual traditions and any Westerner who I’ve met, who’s really like, “Oh, I’m really into Buddhism,” it’s always a sort of tainted Buddhism. And I think that that spirituality brushes over all that stuff because they’re just different. They are actually quite different in a good way, in a good way. But I think when Westerners take that on, they usually bastardize it and find a way to have this, you know, this still Western like, “Oh, I’m a Buddhist,” but you still within modernity, and it just turns into this strange thing.\n\nSo I would say, if you have a spiritual conclusion in mind in which you’re deconstructing modernity etc. you can do that from the position of the Westerner, and I think you have to do that from the position of the Westerner because instead of introducing a new language like you are with Buddhism and a new idea, you begin to deconstruct what it is you’ve built yourself. Which I think is a more productive thing to do as opposed to just, right, I’ve got this problem, instead of deconstructing the problem itself with what I’ve built, I’ll just throw something on top of it. No, you don’t need that other thing. Why did you build up this idea that you need a mortgage or whatever it is? Why do you feel like you need the super-duper mattress? Why in society is it weird to sleep on the floor, for instance? And begin there.\n\nAlex Tsakiris: [01:00:33] Again, our guest has been James Ellis, the very, very imaginative and deep, deep thinker, host of Hermitix podcast. And let’s pull up his blog there that you’re going to want to check out, Meta-Nomad.\n\nSo James, so awesome talking to you, and like I said, let’s make this part one of an ongoing dialogue, super funny. I appreciate it.\n\nThanks again to James Ellis for joining me today on Skeptiko. One question I’d tee up from this interview, is philosophy swamped by science? Is their inability to dive in, deep dive the way we’ve been talking about on the show for a while, does that undermine some of their strongest positions?\n\nI don’t know, James makes a strong case for the deep-thinking philosopher that he is, and he’s pulling together a lot of interesting pieces from a perspective that’s quite unique. So maybe that’s the counter punch to that?\n\nLet me know your thoughts. Of course, the place to do it as the Skeptiko Forum. Come join me over there. Lots of great shows coming up. Stay with me for all of that. Until next time, take care, bye for now.\n\nby the way, you know, if you look down in the corner here, there’s a little click button for Barnes and Noble and Amazon and if you click Amazon, you’ll see that a page is not found. This is a book that has been banned on Amazon, imagine that. I think that’s, that might be the most interesting part of this story. So the central, the central premise of Tom’s book, The Contagion Myth, is that Coronavirus doesn’t exist. Which, I have to say when I first heard it during my interview with David Ike who is someone who I really respect but I know David doesn’t always dig into the science or get the science right but when I first heard it, it had a real Flat Earth kind of ring to it like, you know, like a reverse conspiracy, over the top conspiracy claim. So when one of your representatives Dr. Cowan pinged me and said, Hey, would you like to have a chat with this guy? I jumped at the opportunity because I think this is really an interesting topic to talk about so thanks for joining me. Dr. Tom Cowan: 2:55 Thank you, it’s actually just a few corrections it’s Cowan not Cohen. Alex Tsakiris: 3:01 Did i say C- I keep saying that. Yeah, It’s Cowan I’m sorry. I’m sorry, It’s Cowan, I’m sorry. Dr. Tom Cowan: 3:06 But you can call me Tom if that will make it easier. Alex Tsakiris: 3:09 I will Tom. Dr. Tom Cowan: 3:09 I think just as a note, it was not actually published by Simon and Schuster, it was published by a company called Skyhorse and I think Simon and Schuster is technically the distributor, not the publisher. Alex Tsakiris : 3:24 Okay, well, I just think it’s fascinating that Simon and Schuster put their name on the book and yet it’s a book that’s been banned by Amazon. I think that’s amazing. But I do have to say, I mean, just kind of right to it the central premise that Coronavirus hasn’t been isolated in a lab is just, i mean, you’re not serious about that are you? I mean, that’s just kind of flat earth thing. I got so many I can show you some of the Dr. Tom Cowan: 3:57 So let me start that if I would by,if I can just. Alex Tsakiris: 4:06 Yeah, go ahead. Dr. Tom Cowan: 4:08 If I can respond to that and I’ll tell you how this came about if you want but let me just read from this was a January 2020 CDC bulletin on basically making testing for, sorry, this was a published,sorry, this was published in European surveillance which is a major European epidemiology journal and they say quote, this is January 2020, quote the ongoing outbreak of recently emerged novel Coronavirus poses a challenge to public health laboratories as virus isolates are unavailable. Further, they say in the problem of developing a test because these virologists were tasked with developing a test for this virus and again let me quote from the actual study. This is in peer reviewed a scientific literature, quote, we aim to develop and deploy robust diagnostic methodology for use in public health laboratory settings without having virus material available. In other words, they were tasked and they spoke about the challenge of developing a test when they actually didn’t have any virus available to make a test for and I can imagine that, that was in fact challenging because if somebody said I want you to make a test for a unicorn it would be nice to at least see the unicorn. Now, that’s not the only one because in the CDC bulletin from 2020 now we’re talking July, so this is later. This is the CDC and again, I’ll quote, since no quantified virus isolates of this 2019 star’s code to virus are currently available. In other words that’s the CDC saying we have no isolates, we have never isolated purified and seen this virus. So I could go on because a group of us who’ve been working on this actually emailed and communicated with the six top articles that say they isolated and characterized and purified the virus and in writing all of them admitted that they never actually isolated and purified the virus in writing. So those are simply the facts and I can tell you how we got there if you want but I’ll let you sort of guide the conversation here. Alex Tsakiris: 6:54 Okay, well, this guy who I thought was interesting because he’s from the University of Saskatchewan and I like saying Saskatchewan so I use him, but he’s also one of the top virologist in the world and you know, Darrell, what’s his name? Fel zorana, Bell Serrano, he’s up there in Saskatchewan. So he isolated the virus. But more importantly, like in 2006.. Dr. Tom Cowan: 7:19 I doubt that he isolated the virus. Alex Tsakiris: 7:21 Okay.. Dr. Tom Cowan: 7:22 If he did he should immediately let the CDC know that he did that because the CDC is under the impression that they actually have never isolated the virus. Alex Tsakiris: 7:33 Well i don’t think, there he is in his lab, i don’t think he’s keeping it a secret Dr. Tom Cowan: 7:40 Well then i can tell you, i could review his paper and demonstrate that in fact he couldn’t possibly have isolated this virus. Alex Tsakiris: 7:50 There we go, there we go. I love it. So you realize this is a guy published in Nature, obviously, one of the top science journals in the world in 2016 mind you, on his work he’s virologist and you know, part of the reason I guess why he got pulled into the COVID thing is he did all this work with camels strangely enough you know there’s all these viruses and animals that sometime crossover and there’s all these viruses in these camels that looked like the SARS. So he was over there studying that for years and years. He’s an expert, he has a lab like this and he has all these people in his lab and the idea that he is so grossly incompetent, which would really be, we would have you know, you guys up there in Canada, like Matt, we could go sue this guy, probably make millions if he is falsely claiming that he got the material, which he said was very difficult to get at the beginning and then he isolated the virus, if he’s falsely making that claim, gosh, let’s go at him. But again, it just doesn’t seem likely that this guy, in this lab published in Nature woke up one day and kissed his wife, goodbye and said, Okay, now I’m going to go falsify a bunch of science that I built my whole reputation and my whole life on. Dr. Tom Cowan: 9:13 All i have to tell you is, again, we have the six most important papers all of which claim they isolated and purified the SARS code to virus. Some of them were published in Nature and New England Journal of Medicine and my team actually emailed them because we could tell from the paper that there was no possible way they isolated the virus. All you have to do is actually, because I could describe if you want, how we isolate and demonstrate a purified virus, it’s very clear that they didn’t do that. The reason they didn’t do it is because they changed the rules. So whether he’s deliberately doing that Or not I don’t know. But they all admitted publicly and in writing, which you could tell from the from the papers that they didn’t ,couldn’t possibly have isolated and purified the virus. Alex Tsakiris: 10:14 That just well,what did Darrell say when you talk to him? Dr. Tom Cowan: 10:20 I don’t remember whether we talked to him or not. I don’t remember if he was the lead author of one of these six papers. Alex Tsakiris: 10:27 But he’s one of the top for anything Dr. Tom Cowan: 10:30 They say the same thing all the time. Alex Tsakiris: 10:31 The idea that there’s these virologist, professional virologist, like I said. Dr. Tom Cowan: 10:37 Let me interrupt you here because if we’re going to be talking about who said what, then this conversation is not going to be productive. If we want to talk about the science and how a virologist demonstrates isolation and purification then your listeners might learn something, if you want to try to ask me why he’s doing what he’s doing, I have no idea. Because I’ve never talked to the guy. Alex Tsakiris: 11:06 Yeah, but the point is, he’s saying you’re full of crap. He’s saying I got a sample, I isolated the virus. He’s even saying that since he does work with animals that he then, you know, injected the virus that he isolated into a certain species of monkeys which I don’t know how I feel about that but these monkeys then demonstrated all the symptoms of COVID. So no, he’s saying.. Dr. Tom Cowan: 11:33 I can tell from just this, looking at this highlight that you’re putting there and that his way of isolating is using surrogate markers which are completely invalid as anybody who understands the science would know. Alex Tsakiris: 11:50 So this guy doesn’t understand the science that’s what you’re saying? Dr. Tom Cowan: 11:53 He has a misconception. Alex Tsakiris: 11:57 So this guy.. Dr. Tom Cowan: 11:58 I can tell you exactly why he has a misconception if you want. If you don’t want, you can just stay with an argument about who’s right and then nobody will get anywhere. Alex Tsakiris: 12:10 Well, Tom, Dr. Tom, that’s what this is, It’s an argument about who’s right and you’re claiming you’re right and this guy’s claiming he’s right ,so I don’t know how we would break it down any other way. But this guy who published .. Dr. Tom Cowan: 12:25 I can tell you how to break it down. Alex Tsakiris: 12:27 This guy who, No, this is how science is done. That’s why virologist say we got this thousands of virologists around the world who study this stuff. Why are these people claiming that none of these folks know what they’re doing? Or you’re claiming they’re all part of some conspiracy, which, hey, the reason I’m concerned about this is there are some really legitimate questions about how this COVID thing has been rolled out, the science behind it, how it’s used to prop it up and I am really, really concerned about the way science has been mishandled on the COVID thing. But this idea that they haven’t isolated the virus, I mean, flat earth stuff. Dr. Tom Cowan: 13:16 I think we’re at an impasse here. Alex Tsakiris: 13:19 Okay, probably. Alex Tsakiris : 13:23 Impasse, indeed. I’m going to cut it off there and I do want to thank Dr. Tom Cowan for joining me today on Skeptiko. I think it’s great that he was willing to come on in and talk about this stuff and I’m certainly supportive of him having that opportunity. I can’t believe that Amazon banned his book, you know, later we talked about that. He said, other best selling books on Amazon. I don’t care what you think of this guy’s interpretation of the science. We have reached an absolute new level within this cancel culture where people are up in arms that they’re banning books! just unbelievable. But the other point, I guess, that I would rant on, and I probably will rant on in future episodes because it’s going to be coming up again and again, is this flat earth science thing and one of the advantages I think I have in going through the drills with Skeptiko, from the beginning, from Jump Street with Dean Raiden and that phony baloney, Yale neurologists skeptic, Dr. Steve Novella, do you remember one of the very first episodes of Skeptical where they, him and Dr. Ray Hyman from Oregon, since deceased were laughing about Dean Raiden and laughing about his work, laughing about his published research and I remember I told you at the time and I told you in the first book that I wrote that I’m interviewing these guys and I’m like, Oh, shit, they’re right in dmraid must be wrong, because no way they’d be laughing at this guy science. The point is, if you’re not always on that edge of doubting whether or not this edgy science, this frontier science is right or wrong, then I don’t think you’re really in the game. But the flip side of that, in my opinion, is this Dr. Tom Cowan, you haven’t proven it to me, no time? the job is for you to prove it to us, if you believe against all common sense and logic that this virus hasn’t been isolated, even though they’re spending billions and billions of dollars developing a vaccine, which would be impossible if they hadn’t isolated the virus and even though they’re competing not only within these multinational big farmer companies but they’re competing with other countries, like China has a vaccine, Russia has a vaccine, they’re all trying to get a leg up on the other ones to get a competitive advantage. All that is dependent on the idea that they have successfully isolated the virus at the very minimum. So if you’re going to go against that, if you’re going to be Tom Cowan, if you’re going to be quacky Andrew Kaufman and you’re going to stand up and say that you can’t do this flat earth thing where you say, oh, we’ll prove it to me, prove it to my satisfaction that you’ve isolated the virus. No, you prove it to us. You stand up like Dean Raiden stood up and do 20-30 experiments, publish them in peer reviewed journals, get other labs to replicate it, get other people with inside the community to support your work. Forget this flat earth, you got to prove it to me because I can’t see it this extreme empiricism. It’s just a joke and I feel like I need to point it out. I did another interview with Matt Blair, who was kind of riding shotgun in this one but didn’t say much and, uh, kind of point you to that in the notes and you can see it. It’s just kind of one of my personal little crusades here because I think there’s so many interesting, real, hard conspiratorial questions regarding COVID. But this notion that they haven’t isolated the virus, to me, that seems like, it just seems like a psyop to me, it just unknowingly I mean Cowan doesn’t know it’s a psyop, Kaufman doesn’t know what’s a psyop, but they’re letting that idea out there just to divide the conspiratorial community if you will into thinking Flat Earth bullshit. Okay, that’s a long rant I never usually do these but I felt it necessary in this case. If you have any thoughts on that? let me know I’m dying to hear. Otherwise, stick around. I got some more good Skeptiko’s coming up. They won’t all be like this one. Take care. Bye for now.", "opengraph": {"locale": "en_US", "type": "article", "title": "James Ellis, Raising the Conversation Past Level Zero |473| - Skeptiko - Science at the Tipping Point", "description": "James Ellis is a philosopher and creator of the Hermitix podcast where level three conversations are routine. [00:00:04] Forgive the longer than normal opening clip, but sometimes a little snow piercer, Gnosticism is therapeutic. [00:00:50] Today philosophy with the very excellent James Ellis from Hermitix. James Ellis: [00:01:03] Not the zero I talk of a […]", "url": "https://skeptiko.com/james-ellis-raising-the-conversation-past-level-zero-473/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2020-11-25T03:12:19+00:00", "article:modified_time": "2020-11-25T03:17:19+00:00", "image": "https://skeptiko.com/wp-content/uploads/2020/11/skeptiko-473-james-ellis-1.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"James Ellis, Raising the Conversation Past Level Zero |473|\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/SA7O9eEIeus?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/SA7O9eEIeus?feature=oembed"}], "links": ["https://skeptiko.com/wp-content/uploads/2016/10/please-share-skeptiko3.jpg", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-473-james-ellis.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-473-james-ellis.mp3", "https://media.blubrry.com/skeptiko/content.blubrry.com/skeptiko/skeptiko-473-james-ellis.mp3", "https://itunes.apple.com/us/podcast/skeptiko-science-at-tipping/id210217437", "https://skeptiko.com/email-subscribe-2/", "http://www.youtube.com/user/skeptiko?sub_confirmation=1", "http://www.skeptiko-forum.com/threads/james-ellis-raising-the-conversation-past-level-zero-473.4599/", "https://www.raadfest.com/dr-thomas-cowan", "http://www.skeptiko-forum.com/threads/james-ellis-raising-the-conversation-past-level-zero-473.4599/", "http://www.skeptiko-forum.com/threads/james-ellis-raising-the-conversation-past-level-zero-473.4599/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2020-11-25T03:12:19+00:00"}