{"result_id": "273028", "URL": "https://skeptiko.com/jason-louv-strange-mix-of-scientism-and-magick-385/", "timestamp": "2023-04-25 17:08:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://skeptiko.com/wp-content/uploads/2016/03/favicon-32x32.png", "canonical": "https://skeptiko.com/jason-louv-strange-mix-of-scientism-and-magick-385/", "encoding": "UTF-8"}, "image": null, "domain": "skeptiko.com", "title": "Jason Louv, A Strange Mix of Scientism and Magick |385|", "cleaned_text": "I have an interview coming up in a minute with this guy, Jason Louv about his new book on John Dee and I wanted to give you heads-up because this is, as far as I can remember, the most confrontational interview I’ve ever published on Skeptiko and I wanted to say two things about that.\n\nFirst, I’m okay with that. I’m okay with some heated exchanges and some disagreements, particularly in this case because this guy has done a ton of interviews on this book and the topics we clash over most people will find surprising… particularly that he has such a strong favorable opinion about scientism, and materialistic science-as-we-know-it.\n\nThe other thing is, he’s really closed down re conspiracies. He doesn’t “believe in conspiracies,” whatever that means. I wanted to bring this up because it’s such a litmus test. If you don’t “believe in conspiracies” you are on the outside of our culture looking in because conspiracies are at the heart of culture shaping. They’re at the heart of politics, they’re at the heart of money, they’re, unfortunately, at the heart of corporate science — they’re at the heart of everything important to our culture. So, to say, “I don’t believe in conspiracies,” and at the same time to say, “I believe in magick,” is… well, I wish I could have gotten there earlier in the interview 🙂\n\nBut, I think it’s important, I think it’s important to understand that and bring that forward, especially from a guy who’s made such a splash with this book.\n\nSo, here then is my interview with Jason Louv.\n\nAlex Tsakiris: Let’s start with the book, your publisher was nice enough to introduce me, so we are hereby obligated to talk about this really rather remarkable new book, it’s getting a lot of attention, as well it should, it’s really pretty fantastic. What I want to focus on here, tell people about the book, they should go out and get the book, even though we’re not going to spend a lot of time in this interview talking about it, they should get it. Talk about what I’ve underlined there, the occult and this empire architecture that is John Dee and why he is relevant to anyone, whether they’re super interested in magic or not.\n\nJason Louv: Okay. So, the book is called John Dee and the Empire of Angels and it’s a history and a biographical take on Dr. John Dee, who was Queen Elizabeth 1 court astrologer and scientific advisor. He was a real-life magician, he was interested in magic and not just for silly things like fortune telling, but very directly to get the British Empire going. He was the guy who coined the phrase ‘British Empire’, he is the person responsible for laying out the naval schematics, made it possible to create, among many, many other scientific and mathematical achievements. He’s the person that brought higher mathematics to the British public for the first time and he also spent about ten plus years doing occult rituals none stop, to talk to angels to try and learn the higher wisdom of humanity. Believe that or not, his work has had a tremendous impact on history, although it’s been kept secret and occulted.\n\nSo, what that means is, this book is not just about the singular individual but it’s about the secret history of the last 500 years of the world and about the occult forces that have been quietly, incredibly, forcefully shaping world history and what that really means is, this is the guy to what reality actually is and helps you, potentially, realign yourself to it and maybe you yourself might have to learn a bit of magic, just to get your way out of the nightmare of history.\n\nAlex Tsakiris: Okay, but he’s also a complicated guy, as you… you’re very fair-minded, I think, in the book. I mean, in some respects he’s a broken man, he’s not a perfect man. T\n\nThe other thing that’s important is, he’s a Christian. A lot of people will come across John Dee and will immediately dive into the magic and the wife swapping and the crazy kind of stuff, and then, this guy is a devout Christian, he is as Christian as he can be. Even when he’s doing his magic he’s praying intensely and intently to Jesus for protection and for guidance and all of this stuff, but in the end, he also has this other side. He is a somewhat broken man and then there’s the question of, is he being manipulated somehow?\n\nThese are some of the deeper questions, but the kind of stuff I did want to get into. So, let’s do that now, what do you think?\n\nJason Louv: Well, I push back on that a little bit, in the sense that Dee certainly had some misadventures, he had ups and downs, but the reality of John Dee is that he was a government servant, he was not a well-paid one, but we have to put that in context. Nobody was well paid at this time. Sir Francis spent his entire life in debt, but he wasn’t unique in that. Sir Francis Walsingham, who started the British Intelligence Agencies at this time also, also spent his life in debt. England was broke at this time, which Dee actually fixed by giving them the plans for building an empire and colonizing the new world.\n\nAlso, we have to put that in context and the reason that’s important is, so often people will point to stories of guys like John Dee or [0:06:19] and say, “Oh well, they died broke, they died destitute, that proves that there’s something sinister about magic and you shouldn’t mess with it.” Well, the reality is that John Dee rose to as higher of a position as he could have, given the economics of the time, given his class background.\n\nLook, it was the 1500s, life was hard. People were dying of plague, people were starving to death, nobody…\n\nAlex Tsakiris: That’s not what I’m referring to, what I’m referring to, and as you reveal in the book… I’m not putting the guy down because in one sense he is the ultimate spiritual seeker, truth seeker warrior, but the point where he almost reaches the point of suicide I think is telling. It’s telling in a couple of ways. One, he reaches it because his spiritual journey he feels will not be fulfilled. Well, there’s two ways to read that, one is to admire the, kind of intense interest and desire he has to achieve this spiritual fulfillment, but the other is, what’s going on in the psyche of this guy, that he’s going to commit suicide? What goes on in the psyche of him when he pairs with Kelley, who was not…\n\nSo, he is a complicated figure, maybe you don’t want to put broken on it, but I’m not talking about it in any other way than just from the truth seeker, spiritual warrior part. He had a tough go of it.\n\nJason Louv: My take on magic, and when I say magic, I use magic as a catch-all term for a lot of different spiritual paths, but specifically for the Western esoteric tradition. The point of the Western esoteric tradition is as I said, the raising of the entire individual along the vertical axis, so becoming a more enlightened, empowered and awake individual. That’s the safe way to do it. Conjuring spirits is the unsafe way to do it, by and large.\n\nNow, I’m not saying that to put down different traditions and religions that rely very strongly upon spirit contact, but that’s not my interest in magic and it’s not what I teach.\n\nAlex Tsakiris: Well, I can accept that that’s not what you teach or that that’s not what your interest is, my problem is differentiating between the map and the territory. You can say that that’s not your map, that’s not how you’re doing it, your map is personal empowerment or however you say it. The point is, is there a spiritual realm and does that spiritual realm have impact on our material realm? That is fundamentally the question that I think we wrestle with and we don’t wrestle to the ground and we really need to wrestle to the ground as even just a basic starting point.\n\nThe screen that I’ve put up here, it says, ‘reality’. This show is 90% about the fact that the absurdity that we live in a scientific reality that completely disavows, not only disavows, just doesn’t acknowledge anything beyond materialistic, dogmatic kind of science, right?\n\nSo, there is no room for magic, there’s no room for religion, there’s no room for anything beyond that materialism that we’re enmeshed in, and the absurdity is that no one really believes that. No one believes that they’re a biological robot in a meaningless universe. “We believe that we are able to connect with other people, that we have love, that we have meaning in our life, and yet we walk out kids to school and let them go into science class and science class tells them, “No. You are a biological robot and the universe is meaningless.”\n\nSo, the first challenge, before we even get into any of that sorcery or evocation of spirits or any of that, is to understand the difference between this bracket of reality, of science and spirituality, if you will, in its broader sense, in terms of there being more than just a material world. Are we on the same page there or not?\n\nJason Louv: I can tell you my take on it, which is that when I approach these things, first off, I do not put science and magic in opposition to each other. I think that’s a false dichotomy, and to be more specific about that, I think that science is the crowning achievement of humanity. I think it’s the greatest tool we’ve ever come up with, in order to light a light in the darkness, to light a light in the demon haunted world, as Carl Sagan once called it. I think that in this book, I really clearly shine a light on the work of people who were magicians and alchemists, like John Dee and Giordano Bruno and Isaac Newton and Francis Bacon and people like that, to create science magically. Science was a creation of the magical tradition and it’s a brilliant creation.\n\nNow, when I talk about magic, I’m very careful to separate these things because the last thing that I want is for the scientific paradigm to collapse. Right now, in America, we’re seeing the catastrophic consequences of people not being able to know what’s true anymore and the whole thing of fake news and things that are going on politically. We’re really on the verge of going back to the Dark Ages.\n\nSo, I’m very careful, even though I talk about magic, not to put up this kind of woolly 1970s, In Search of… with Leonard Nimoy, type of opposition between science and magic. Now that’s said, how are they different?\n\nThe way that I look at it is that science tells us the objective truths about what reality actually is, it’s a brilliant tool. Magic is about the realm of subjectivity, it’s the realm of how humans create meaning out of their experience.\n\nNow, are there ‘spirits’? Is there a spiritual reality? There are absolutely things that people have perceived as spirits throughout all human history that have appeared to have shaped history and certainly shaped people’s lives on a day-to-day basis. The broader question is, is there any objective reality to that or is that just an aspect of people’s minds? Perhaps a shared aspect of people’s minds, like a collective unconscious perhaps, to use an overused and a much-abused term. That’s the real question, what is that?\n\nThe question of whether people interact with them and whether these things play a gigantic role in people’s lives, that’s a [unclear 00:13:03] point, because that’s the truth, that’s what life on this planet is. Most cultures outside of Western culture, interact with these realities on a daily basis, whether that’s South America, Africa, India, Buddhist cultures, Thailand, even Christian groups for the most part are immersed constantly in a spiritual realm.\n\nNow, my previous answer, when I was saying the point of the way that I teach magic is that it’s about enlightenment is that, for me, that was a magical answer. As somebody who’s interested in yoga and meditation, all of that is an intermediary layer, the part where people get obsessed with sorcery and spirits and powers and psychic phenomenon and all that stuff, people often call that the astral plane and for me that’s an intermediary stage, that’s something to get passed.\n\nWhat I’m interested in is enlightenment states, and to get to that, you have to get beyond that layer of whatever it is, that hallucinatory layer, because what’s happens is, people get into meditation and magic is they get to unlock that hallucinatory layer and it becomes endlessly fascinating, just like TV would be, but ultimately it’s a distraction at the end of the day, and that’s another place where I have to distinguish what I’m teaching from a lot of other current approaches to magic. Are there spirits? Can you summon them? Yes. Can you do astral travel and all of these things like this? Yes. Is it an intermediary stage? In my opinion, yeah.\n\nAlex Tsakiris: So, here’s the hard part Jason. I totally agree with you in the end gain. I’m a yogi, right? So, that’s my orientation.\n\nAlex Tsakiris: Forget that. My problem with the magical community…\n\nJason Louv: It’s kind of important, but okay.\n\nAlex Tsakiris: Well, it’s important to me, right? It’s not important to this conversation right now.\n\nJason Louv: The reason I say it’s important is because I’m trying to tell what your focus is, what you’re focusing on with your practice.\n\nAlex Tsakiris: What I’m focusing on right now is, I don’t understand how you are fully embracing materialistic science and not drawing… I don’t get that.\n\nAlex Tsakiris: Because science has systematically and quite intentionally tried to deny all of the aspects of the greater self that you’re talking about. It’s not an accident. It’s not this miracle of science, kind of thing. It’s part of that, but it’s also culture shaping, in terms of telling us that, “You are not more, you are just a biological robot. Go out and shop. Satisfy your physical desires because that’s all you are.”\n\nJason Louv: Science doesn’t say, “Go out and shop.” That’s consumerism and advertising.\n\nAlex Tsakiris: How do you understand the distinction between scientific materialism and the consumeristic materialism? Where do you think that line is drawn philosophically?\n\nJason Louv: Well, those are two totally different things.\n\nAlex Tsakiris: No, they’re not totally different things.\n\nAlex Tsakiris: They’re exactly the same.\n\nJason Louv: No, no, no. You’re over-generalizing, with all due respect. You’re conflating a lot of different things. So, let’s back up to the beginning.\n\nFirst of all, with scientific materialism. To paint the entirety of hundreds of years of science with one brush and say that it has a unified dogma, is just inaccurate.\n\nAlex Tsakiris: What unified dogma are you talking about?\n\nJason Louv: Well, what you just said. Exactly what you just said.\n\nAlex Tsakiris: Hold on, I’m just saying, materialistic science, by definition, says that science is matter and that we can measure what is going on and what we experience, right? Isn’t that fundamentally what we call materialistic science? Isn’t that the definition?\n\nJason Louv: That’s one general part of thinking of science, but science evolves, science evolves constantly. One thing that I’ve shown in John Dee and the Empire of Angels is, if you go back to the beginnings of science and people like John Dee and Francis Bacon and Isaac Newton, those things were never separate and increasingly now they’re not separate. We see people like Rupert Sheldrake or Dean Radin, you mention, people who are looking at these things very seriously.\n\nBut science is not a dogma, science is simply a set of techniques and to discard it, well, that’s absolutely true, I’m sorry, to discard it would be like going back to the Dark Ages. You’re alive right now because you’ve had access to penicillin, you’ve had access to drugs and things that have been produced by science that have given you…We’re talking on this computer, all of these things have been given to us, and I really don’t draw a distinction. Science is an amazing tool, humanity has created many, many different wonderful tools, why would we refuse to use them? If you want to go back and live in a cave in the 12th century, go right ahead, but you seem not to be doing that because we’re having a conversation on Zoom. So, you must like science a bit, you’re certainly benefiting from it.\n\nNow, in terms of whether science denies certain parts of the spiritual realm? I have two answers to that. One answer is, that’s good to a large extent. When you look at certain parts in this world where people are still immersed in fear, fear of people having magical power over them, that’s no good, but also, everything is a process, everything is a process of change. Science has been a very important period for human consciousness to evolve through.\n\nAlex Tsakiris: Human consciousness? How does science, as we know it, modern science understand human consciousness?\n\nJason Louv: Well, it doesn’t fully, but that doesn’t mean that it doesn’t have the answer, and that’s where you get people like me coming along.\n\nAlex Tsakiris: What is the current position of science on human consciousness? That it’s epiphenomena of the brain. That is it. Plain and simple.\n\nJason Louv: I think that’s evolving quite a bit. I’ve done quite a bit of work on artificial intelligence…\n\nAlex Tsakiris: That’s not true. It’s not true. You can say it’s evolving, but it’s evolving from the position that’s clearly not true.\n\nJason Louv: I’ve agreed to this interview so please, at least let me finish my answers.\n\nAlex Tsakiris: It’s a conversation, so we can talk.\n\nJason Louv: Okay, so let’s talk one at a time, and I’ll be respectful.\n\nAlex Tsakiris: You interrupted me but go ahead.\n\nJason Louv: Okay, okay, I won’t. Alright, so I’ve done a lot of work on artificial intelligence. Science doesn’t have an answer for…\n\nAlex Tsakiris: I was in the PhD program on artificial intelligence in this year’s [unclear 00:19:38]. I know all about it. Go ahead.\n\nJason Louv: So, they don’t fully know, but that doesn’t mean that there’s not an answer. They’re trying to reduce consciousness to an algorithm. Personally, I don’t think they actually will.\n\nI want to make it very clear that I’m not saying that science has the ultimate answers, what I’m saying is that science is a process. It’s very hard to define because the very point of science is that hypothesis is made and then tested and that’s an ongoing process and things are overturned. We don’t fully know and certainly in my work, what I’m trying to do is bring interest to things like meditation and spirituality and I want people to look at them. I particularly want scientists to look at them in an empirical and methodical way, so that we can look at those parts of the human experience and bring back things that can be helpful to our further evolution as a species, particularly because technology is advancing so quickly, we haven’t been able to catch up with it on the wisdom front.\n\nSo again, everything’s a tool. I look at things magically in the sense that everything’s a tool, and I think we should use all of it.\n\nAlex Tsakiris: Yeah, I just think we have to nail some things down. So, when you say consciousness… I talk to these folks all the time, some of the leading researchers on consciousness, both on the materialistic side and more of the cutting-edge side. You know Dean Radin’s been on this show many times, Rupert Sheldrake has been on this show many times, as has Christof Koch, one of the leading researchers, or, who’s the guy? Hameroff, the guy who’s…\n\nSo, I’m familiar with this. I just don’t think you’re really fairly representing the struggle between this materialistic definition of consciousness that is an epiphenomenon of the brain and how science, as we know it, has just vehemently denied, even considering all of the data that contradicts that, all of the data from near-death experience science. Even going back to quantum physics. Quantum physics really puts a wrench in the whole idea of this consciousness being an epiphenomenon of the brain. This is a huge dilemma, not only a dilemma for science but it’s a huge stumbling block for science.\n\nSo, you don’t have to tell me science is a method, it’s not a position statement. Of course, we all get that, but the reality is, the way science operates inside our society, the way it works in terms of shaping policy, the way it works in terms of shaping culture, it’s really important that we understand these.\n\nNow, I don’t understand the cheerleading for science as we know it. I guess I’m more of an iconoclast, but I think there has to be, for us to move forward, I think it’s really important that we have some fundamental reality check on just what consciousness is and how much our current understanding of consciousness goes against what is accepted widely, throughout academia, as being human consciousness. So, do you understand my frustration?\n\nJason Louv: Well, I think this is hilarious, because now you’ve got the magic guy arguing for science on a podcast called Skeptiko!\n\nAlex Tsakiris: I know. What’s going on?\n\nJason Louv: Well look, here’s the thing. Okay, is there a friction between science’s current definition of consciousness and what mystics have been telling us for a long period of time? Yes. Is science, to a large degree, run by defense and military contracting? Yes. Is that a problem? Yes. But, what I don’t want to do is make a monolithic statement for all science, as if all science can be represented with one statement because that’s simply not true. There are scientists all over the world working on all different projects and to speak that there’s one monolithic scientific establishment is simply not true, that’s just sloppy thinking.\n\nAlex Tsakiris: Of course not, but it’s sloppy thinking to say it the other way too.\n\nJason Louv: No, it’s not. No, it’s not. What I’m saying is, science is… Okay. What we’re doing, in general, as a culture, is we’re increasing our knowledge and science is one of our tools to do that. Mysticism is another. To go backwards to reject science and to go backwards would be a tremendous civilizational wide disaster and we see the consequence of that type of thinking in our world right now, with people accepting conspiracy theories, fake news, antivaccination stuff, it’s an utter nightmare. All you have to do is go on Facebook.\n\nAlex Tsakiris: I don’t know if that’s going to make any difference, it’s like you said, I don’t understand how a magic guy gets in… You’re a non-conspiratorial, so, were I was going to down is the conspiratorial path. You don’t want to hear that but to suggest that the government control mechanism, CIA, deep state, however you want to put it, hasn’t had a vested interest in steering consciousness in a certain way, in terms of steering academia towards this materialistic science that denies a larger, broader extended consciousness, while at the same time, they were investigating and figuring out how to weaponize consciousness, I think is incredibly naïve and I don’t see it in your world view at all.\n\nJason Louv: Well, that’s because I don’t agree with it.\n\nAlex Tsakiris: You don’t agree with it?\n\nJason Louv: Well, let me ask you this. If that’s true, then why hasn’t…\n\nAlex Tsakiris: You don’t believe history then?\n\nJason Louv: I don’t know. If that’s true, then why has the Trump administration been defunding science and denying science left and right? If anything, the people in power want to deny climate science.\n\nJason Louv: No, no, no, back up. Here’s my position. Science is the greatest light that humanity has ever created. You asked me, how can a magic person say that? I’m a human being and I can…\n\nAlex Tsakiris: I didn’t ask you that question.\n\nAlex Tsakiris: I didn’t ask you that question.\n\nJason Louv: You just did, you just did.\n\nAlex Tsakiris: You’re answering a question that I didn’t ask. I didn’t ask.\n\nJason Louv: Guy, please. You’re interviewing me, let me speak.\n\nAlex Tsakiris: Go back and review the thing. You’ve interrupted me like a million times, so now you can…\n\nAlex Tsakiris: Do you believe in climate change?\n\nAlex Tsakiris: Do you think that climate change is supported by the science?\n\nJason Louv: Listen to me. Listen to me.\n\nAlex Tsakiris: Do you think science supports climate change?\n\nJason Louv: Yes, 99.7% of all NASA scientists…\n\nAlex Tsakiris: That’s the most fake figure in the world. You are…\n\nJason Louv: You’re an idiot. You’re an idiot. You’re an idiot. You’re an idiot. I’m sorry.\n\nJason Louv: I’m sorry, you don’t believe in climate science? NASA, go to a NASA website. This is what is driving our world back to the Dark Ages, this type of thinking, this type of thinking. Conspiratorial. If that was actually true, the government would be funding all of this science, but they’re actually tearing it apart and what’s happening is the world is sliding backwards into ignorance of the type that you’re displaying.\n\nAlex Tsakiris: Because of the facts or global warming?\n\nJason Louv: Look, if you’re going to be an individual who wants to liberate humanity, you will use every tool possible.\n\nRobert Anton Wilson, one of my heroes, thought that you should be able to wear every hat possible, whether that’s magic or science or consciousness and you should be able to go back and forth between then as much as possible. With people like you, I push science, with people who are hard science people, I push consciousness, but right now, you’re just telling me things that are not true and you’re being very combative about it and I’m being combative back because I’m pushing back against statements which are just simply not true.\n\nThis is important, because we live in a post-truth world, which actually means a world full of lies and delusions, misinformation and un-education.\n\nAlex Tsakiris: Have you ever read the study that cited on the NASA website and that was cited by Obama, the 97% consensus? Have you ever read the study, do you know the methodology that was used?\n\nJason Louv: You haven’t even said the name of the study.\n\nAlex Tsakiris: Well, it’s the same study that everybody references, I forget the guy’s name, but do you know…?\n\nJason Louv: You haven’t told me what the study is or even what it says.\n\nAlex Tsakiris: Well, I’ll tell you what it says, but the methodology, which everyone assumes is that they went out and they pooled scientists and they asked them what their view on global warming is, but that’s not the methodology that they used. What they did is they hired a bunch of grad students to serve as science abstracts and then they made a judgement call on whether those abstracts were supportive or non-supportive of their understanding of what global warming was. It was flawed from the beginning and then, in particular, many, many scientists came forward, who were cited in that study and said, “Hey, my paper said the exact opposite of that and yet I was put in this category.”\n\nSo, if you want to go and look at the work of people like, oh what’s her name at Georgia Tech? I can’t think of her name right now, I’m happy to send that to you, bit many people have pulled that apart, it’s just a ridiculous study. It’s a pure example of…\n\nJason Louv: Honestly, I’m going to trust the NASA website and the scientific consensus on this. It’s really non-negotiable, and then somebody being an idiot in this conversation, and frankly I feel like I’m in the content section of a Facebook discussion.\n\nAlex Tsakiris: I can pull up that study if you want, if you want to look at it. I can send it to you afterwards.\n\nJason Louv: Yes, send it to me. We’re out of time, but please, go ahead and send it to me. The reality of climate change is not…\n\nAlex Tsakiris: I’d love to hear your take on vaccines.\n\nAlex Tsakiris: But the name calling Jason, the name calling.\n\nJason Louv: Guy, guy, guy, guy. Look, the liberty of human consciousness is at stake right now.\n\nJason Louv: Humanity going back to the Dark Ages for opinions like this. That’s my point. Anybody who is listening to this conversation, I highly recommend, there’s an audio series called, Your Deceptive Mind by Dr. Steven Novella, which will go through systematically…\n\nAlex Tsakiris: Oh my gosh. Why didn’t you say you were a Steve Novella fan at the beginning? We could have short circuited this whole thing.\n\nAlex Tsakiris: I’ve got three or four interviews with Steve Novella.\n\nSo, this interview has obviously been a train wreck and I’ve held off from jumping in and making any comments, but I did have to jump in here because inside baseball can only go so far, and we were talking about Steve Novella and I realized a lot of people might not know who Dr. Steven Novella is. Who he is, is a Yale University Neurologist and one of the best-known public skeptics. I mean, hardcore skeptic. He does this show, The Skeptics’ Guide to the Universe and everything to this guy is, you know, what they call woo, to these hardcore skeptics is woo. “Spirits? Total woo.” I mean, it isn’t at all within his belief system. Occult, magic, heck, this guy doesn’t believe in free will, he doesn’t believe in consciousness. I always say, the biological robot, meaningless universe, his worldview demands that everything about your minute by minute experience of consciousness is purely the product of your brain, therefore there is no such thing as meaning, there is no such thing as love, connection, all of that stuff. He doesn’t even believe in parapsychology. The debates that I’ve had with him have been about, like Dean Radin’s carefully controlled, multiply replicated, presentiment work, completely denies it, completely misrepresents it and then says that Dean Radin fiddles with the data. The worst of the worst, in terms of hardcore skeptics and this is, I mean, it makes no sense to me. Jason, it’s the self-loathing thing, like “Let’s cozy up with these people that completely hate and stand against everything we’re about. Man, I don’t get that.\n\nGo back and listen to my interviews with him, I think he doesn’t hold up very well, and I don’t think you’ve held up very well either.\n\nJason Louv: I own this stuff. Well, you’ve just been a laughing monkey.\n\nJason Louv: The light of science, intelligence, let there be life. [Unclear 00:32:52], as both the scientists and the alchemists have said. Humanity must be liberated from superstition by knowledge, whether that’s knowledge of the…\n\nAlex Tsakiris: What does Novella think of your…?\n\nJason Louv: Well, he would totally discount it, but I’d love to talk about it with him, but like I said, I’m willing to shift hats. If I’m having this conversation I can wear the skeptic hat. On Skeptiko, I’ve out-skepticed the Skeptiko podcast.\n\nAlex Tsakiris: Well, you don’t understand what Skeptiko is about. I encourage you to get Novella on your show, that’s one I would listen to. That’s one I would listen to, because I’ve spoken with him, you haven’t.\n\nJason Louv: I will see whether he would come on the show.\n\nAlex Tsakiris: I’ve spoken with him. I’ve faced-off with him several times, you haven’t.\n\nJason Louv: Well, I’m sure that went great. I’m sure that went great. I’m sure he loved you.\n\nAlex Tsakiris: Hey, I think we had a mutual respect, that’s why we did multiple shows, but that’s okay. You know what? A lot was revealed, I always learn something. Thanks for coming on.\n\nJason Louv: Alright. Thank you for having me.", "opengraph": {"locale": "en_US", "type": "article", "title": "Jason Louv, A Strange Mix of Scientism and Magick |385| - Skeptiko - Science at the Tipping Point", "description": "Jason Louv has a reputation as a chaos magician, but he’s down with materialistic science-as-we-know-it? photo by: Skeptiko I have an interview coming up in a minute with this guy, Jason Louv about his new book on John Dee and I wanted to give you heads-up because this is, as far as I can remember, the […]", "url": "https://skeptiko.com/jason-louv-strange-mix-of-scientism-and-magick-385/", "site_name": "Skeptiko - Science at the Tipping Point", "article:published_time": "2018-07-24T17:50:46+00:00", "article:modified_time": "2018-07-24T18:16:38+00:00", "image": "https://skeptiko.com/wp-content/uploads/2018/07/385-jason-louv.jpg", "image:width": "400", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["past lives", "parapolitical", "UFO", "atheism", "spirituality", "alien consciousness", "NDE", "psychics/mediums", "psychology", "ET", "telepathy", "religion", "parapsychology", "others", "shamanism", "near-death experience", "psychics & mediums", "occult", "science media", "after death communication", "psi", "buddhism", "consciousness science", "mediumship", "skepticism", "Rupert Sheldrake", "science", "science and religion", "quantum physics", "materialism", "neuroscience", "paranormal", "Global Consciousness Project", "Christianity", "contactee experience", "conspiracy theories", "gnosticism", "evil", "consciousness", "yoga", "remote viewing", "skeptics", "psychic detectives", "OBE", "philosophy"], "tweets": [], "movies": [], "links": ["http://www.skeptiko-forum.com/threads/jason-louv-a-strange-mix-of-scientism-and-magick-385.4180/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/yvonne-kason-nde-awakening-592/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/vincent-tolman-nde-lessons-591/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/bruce-fenton-genetic-seti-590/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/jason-jorjani-does-ai-psi-589/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/dianne-collins-quantum-think-588/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/mary-rodwell-extended-consciousness-hierarchy-587/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/pmh-atwater-nde-reseacher-586/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/shiva-ayyadurai-email-porgrammer-585/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/", "https://skeptiko.com/jason-jorjani-redefining-parapsychology-image-cheapening-584/"], "authors": ["Alex Tsakiris"], "publish_date": "2018-07-24T17:50:46+00:00"}