{"result_id": "274019", "URL": "https://www.snopes.news/2020-05-21-snopes-the-ultimate-fake-fact-checker.html", "timestamp": "2023-04-25 17:09:35 CEST+0200", "meta": {"description": "By now, you’ve hopefully realized that nearly all mainstream news that has to do with safety, health and human rights is fake and sourced by even more fake news. It’s a circle of deception that leads to nowhere, except making all the wrong choices about the important aspects of life. Why is it set up […]", "lang": "en", "keywords": "fact-checker,facts,fake,fake fact check,fake news,fake snopes,hoax,Snopes,snopes fake news,snopes is fake,snopes Leftists,snopes lies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2020-05-21-snopes-the-ultimate-fake-fact-checker.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Snopes, the ultimate FAKE “fact” checker", "cleaned_text": "By now, you’ve hopefully realized that nearly all mainstream news that has to do with safety, health and human rights is fake and sourced by even more fake news. It’s a circle of deception that leads to nowhere, except making all the wrong choices about the important aspects of life. Why is it set up that way? Money. There’s way more money in managing sick Americans than healing them. That’s where Snopes comes in. In order to mislead the masses when they have those moments of second guessing, Snopes is there to reassure you that your biggest mistakes are the right mistakes.\n\nSnopes is a fake fact checker with one goal – ensuring you only find bad advice online about everything that really matters\n\nNot only is Snopes a source of fake stories now, they were once known as the “Urban Legends” reference pages, spreading myths and rumors and pretending to “debunk” truths all over the internet about healthy eating, effective supplements, and even the evidence-based, clinical research and peer-reviewed science behind nutrition. How did the fake fact checker “legend” start? They were the first to call themselves the “online encyclopedia.” That’s how.\n\nA has-been, unpleasant-looking, nerdy ex-couple decided one day in the mid-1990’ to begin making a website that had “answers” to questionable discussions found on line. They even tried to start a TV pilot, but it failed right away. After Snopes failed miserably for several years as the “online encyclopedia,” they hired shills from message boards to help save their website. That must have worked, because a few years later they got bought out by Proper Media, an internet management firm.\n\nThe fake fact checkers began “modernizing” archives (in other words, changing history books to fit a narrative). This was the beginning of “book burning,” but without using fire. Instead you just change what people find online when they search for certain answers, especially that which is already popularly questionable. They even lie about Vietnam. It’s one big disinformation campaign fueled and sourced by more propaganda.\n\nThe end goal is to make money by lying about the most important things people really want to understand in order to be healthy, safe, and independent thinkers.\n\nSnopes main aim is to “confirm legends” by convincing you vaccines are safe and genetically modified food is healthy\n\nThey love to discredit any natural cures and remedies, so that people who are fed up with the failing allopathic (a.k.a. allopathetic) system of slash and burn medical horrors, will turn to the internet to find real answers to their health problems, only to wind up believing Snopes’ lies. It’s a planned vicious cycle, and it’s been around for quite awhile now. Millions of Americans think Snopes gives real advice. Working advice. Not fooling them into being the fools they already are, but forever.\n\nThat’s why millions of Americans can’t figure out how they get cancer, even though they’re eating GMO food at every meal, and then taking experimental chemical concoctions made in laboratories for all their sicknesses (a.k.a. prescription medications).\n\nSnopes references fake news media giants, and they reference Snopes in return, like one big circle jerk of lying morons\n\nYes, Snopes loves CNN, the sleazebag NYT, and “orange man bad” MSNBC. That’s really all you need to know to never trust them with anything, ever. The schmuck shyster and con who thought it all up still runs it from his couch. He’s paid by pharma thugs to continue working as a shill for life, pointing millions of sheeple (about 6 million monthly) towards his deadly cliff of “advice.”\n\nIf you want to believe urban legends about vaccines helping people or prescription drugs being the answer to your health problems, just read Snopes fake encyclopedia answers to your friends, family, neighbors and coworkers. Then your “herd immunity” will be realized when you all go off the health cliff together.\n\nThe Snopes repository of garbage and fecal matter online was intended to deliberately mislead people about important subjects. That’s why Snopes is the original internet troll, because T.R.O.L.L. is an acronym for “The Repository of Lost Legends.” The whole project name is like spitting in the face of their own believers. It’s an internet prank.\n\nIn 2009, FactCheck.org (another fake fact checker monolith) likes how good Snopes had become at lying about political issues and began backing their efforts. Snopes is a far-Left political hack outfit that only applies it’s “debunking standards” to truth news and independent media when their real news affects big pharma or biotech profits.\n\nSnopes accepts funding from known pedophiles (think paranormal-pervert James Randi here) and at least $100,000 from Mark F.B. Satan Zuckerberg, as part of their fake fact-checking “partnership.” Then, Snopes claimed they broke up with Fakebook in February, 2019.\n\nMaybe one day soon they’ll start a “relationship” with some other fake fact checker like NPR, Politifact, or PBS. But for now, they sell a “premium membership” in fake fact checking for people who absolutely LOVE being lied to daily (without ads popping up for your convenience). Are you too suffering from O.M.B.D. – “Orange Man Bad Disease?” Tune your internet dial to HealthFreedom.news for updates on new vaccines that maim and kill humans while spreading disease, all while fake fact checkers tell you they’re “safe and effective!” Hey Snopes, you are now officially debunked as a fact checker. You’re welcome.", "opengraph": {"title": "Snopes, the ultimate FAKE “fact” checker", "type": "article", "url": "https://www.snopes.news/2020-05-21-snopes-the-ultimate-fake-fact-checker.html", "site_name": "Snopes News", "description": "By now, you’ve hopefully realized that nearly all mainstream news that has to do with safety, health and human rights is fake and sourced by even more fake news. It’s a circle of deception that leads to nowhere, except making all the wrong choices about the important aspects of life. Why is it set up […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2020/05/images_fakenews_tvguide.jpg"}, "tags": ["fake news", "facts", "fake fact check", "hoax", "snopes is fake", "Snopes", "fake", "snopes lies", "fake snopes", "fact-checker", "snopes Leftists", "snopes fake news"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2019-02-04-snopes-throws-in-the-towel-with-facebook-fact-checking-after-being-caught-fabricating-lies.html", "https://www.naturalnews.com/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "http://www.truthwiki.org/the-new-york-times/", "https://spectator.org/the-orange-man-bad-disease/", "https://www.naturalnews.com/042602_Obama_administration_national_debt_budget_deficit.html", "http://www.truthwiki.org/james-randi/", "https://www.naturalnews.com/2018-07-05-facebook-bans-the-declaration-of-independence-flags-it-as-hate-speech.html", "https://www.healthfreedom.news/2020-05-17-bill-gates-harmed-killed-coronavirus-vaccines.html", "http://www.truthwiki.org/james-randi/", "https://www.naturalnews.com/2018-07-05-facebook-bans-the-declaration-of-independence-flags-it-as-hate-speech.html", "https://www.healthfreedom.news/2020-05-17-bill-gates-harmed-killed-coronavirus-vaccines.html"], "authors": [], "publish_date": null}