{"result_id": "274010", "URL": "https://www.snopes.news/2021-08-23-snopes-suspends-cofounder-for-mass-plagiarism.html", "timestamp": "2023-04-25 17:09:22 CEST+0200", "meta": {"description": "The last time Snopes Co-Founder David Mikkelson made headlines, he’d allegedly embezzled $98,000, dropped weight, left his health-challenged co-founder wife, and married an actual whore. (Article by Tyler Durden republished from ZeroHedge.com) Five years later, and Mikkelson’s just been suspended by Snopes after BuzzFeed uncovered massive plagiarism – including instructing other Snopes writers to ‘cut-and-paste’ mainstream breaking news stories without attribution, […]", "lang": "en", "keywords": "conspiracy,corruption,David Mikkelson,deception,Fact Check,faked,Journalism,lies,news cartels,plagiarism,Snopes,traitors", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2021-08-23-snopes-suspends-cofounder-for-mass-plagiarism.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Snopes suspends co-founder for mass plagiarism, staff revolts", "cleaned_text": "The last time Snopes Co-Founder David Mikkelson made headlines, he’d allegedly embezzled $98,000, dropped weight, left his health-challenged co-founder wife, and married an actual whore.\n\nFive years later, and Mikkelson’s just been suspended by Snopes after BuzzFeed uncovered massive plagiarism – including instructing other Snopes writers to ‘cut-and-paste’ mainstream breaking news stories without attribution, and then alter them after the fact.\n\nIn total, Mikkelson ‘wrote and published 54 articles with plagiarized material,’ under his own name as well as a pseudonym, and the Snopes byline. In addition, an internal review by the ‘fact-checking’ company identified 140 articles with possible problems.\n\nFormer Snopes managing editor Brook Binkowski told BuzzFeed: “He used to write about topics he knew would get him hate mail under that assumed name. Plus it made it appear he had more staff than he had.”\n\n“He would instruct us to copy text from other sites, post them verbatim so that it looked like we were fast and could scoop up traffic, and then change the story in real time. I hated it and wouldn’t tell any of the staff to do it, but he did it all the time,” she added.\n\nIn one Slack message from January 2016, Mikkelson detailed his strategy for copying and then quickly rewriting articles after publishing. “Usually when a hot real news story breaks (such as a celebrity death), I just find a wire service or other news story about it and publish it on the site verbatim to quickly get a page up. Once that’s done, then I quickly start editing the page to reword it and add material from other sources to make it not plagiarized,” he wrote. In two emails from 2014 and 2015, Mikkelson told staff to “pop over to one of our competitor sites (urbanlegends.com or hoaxslayer.com), pick something out that they’ve recently published that we haven’t covered,” and “rewrite it just enough to avoid copyright infringement.” -BuzzFeed\n\nAccording to two other former employees, “taking credit for other people’s work” was “part of his model.”\n\n“I didn’t come from a journalism background,: he said in a statement. “I wasn’t used to doing news aggregation. A number of times I crossed the line to where it was copyright infringement. I own that.”\n\nIn response to Mikkelson’s transgressions, Snopes staff issued a letter condemning their boss (via BuzzFeed):\n\nWe, the writers of Snopes, feel it is incumbent upon us to clearly and publicly acknowledge that Buzzfeed has discovered incontrovertible evidence that the co-founder and CEO of Snopes, David Mikkelson, has written and published multiple articles which contained sentences taken from other sources without proper attribution. We strongly condemn these poor journalistic practices. No writer participated in this behavior, nor did any editors — Doreen Marchionni, Camille Knox, and David Emery — support or encourage these practices. We have all been held to very high journalistic standards, both by our editors and by our audience. Although none of us was to blame for the actions of Snopes’ co-founder, we empathize with the journalists whose work was appropriated. This simply should never have happened. Under the leadership and guidance of Marchionni, Knox, and Emery, we work hard every day to uphold the highest possible journalistic and ethical standards, and we believe our fact checks, original reporting and investigative work are a testament to those high standards. We are proud of our editors and proud of the work we do.\n\nAs noted in 2016 via iBankCoin, Mikkelson married a [NSFW] part time porn actress, (former?) Snopes.com administrator (spicy!), and sex worker. As in, she had a website devoted to being a whore.\n\nAnd these guys were Facebook ‘fact checkers’ until 2019.\n\nMeanwhile, Snopes raised $1.7 million just a few weeks ago to fight a series of lawsuits from a tech vendor. What a mess.\n\nRead more at: ZeroHedge.com and Deception.news.", "opengraph": {"title": "Snopes suspends co-founder for mass plagiarism, staff revolts", "type": "article", "url": "https://www.snopes.news/2021-08-23-snopes-suspends-cofounder-for-mass-plagiarism.html", "site_name": "Snopes News", "description": "The last time Snopes Co-Founder David Mikkelson made headlines, he’d allegedly embezzled $98,000, dropped weight, left his health-challenged co-founder wife, and married an actual whore. (Article by Tyler Durden republished from ZeroHedge.com) Five years later, and Mikkelson’s just been suspended by Snopes after BuzzFeed uncovered massive plagiarism – including instructing other Snopes writers to ‘cut-and-paste’ mainstream breaking news stories without attribution, […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2021/08/mikkelson1.jpg"}, "tags": ["conspiracy", "Fact Check", "plagiarism", "faked", "Journalism", "deception", "Snopes", "David Mikkelson", "traitors", "lies", "corruption", "news cartels"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/news/2016-12-22/snopes-co-founder-embezzles-98000-drops-weight-leaves-fat-wife-and-marries-actual-wh", "https://www.zerohedge.com/political/snopes-suspends-co-founder-mass-plagiarism-staff-revolts", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson#statement", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson", "https://www.zerohedge.com/news/2016-12-22/snopes-co-founder-embezzles-98000-drops-weight-leaves-fat-wife-and-marries-actual-wh", "https://ibankcoin.com/", "https://ibankcoin.com/zeropointnow/files/2016/12/wedding2.jpg", "https://ibankcoin.com/zeropointnow/files/2016/12/eb3a.jpg", "https://ibankcoin.com/zeropointnow/files/2016/12/young.jpg", "https://ibankcoin.com/zeropointnow/files/2016/12/sdfg.jpg", "https://ibankcoin.com/zeropointnow/files/2016/12/obrynn2.jpg", "https://www.zerohedge.com/news/2019-02-02/snopes-ap-suddenly-quit-facebook-fact-checkers", "https://www.axios.com/snopes-17-million-lawsuits-5ca0486f-177d-4b05-a795-8091fa75b427.html", "https://www.zerohedge.com/political/snopes-suspends-co-founder-mass-plagiarism-staff-revolts", "http://deception.news"], "authors": [], "publish_date": null}