{"result_id": "274003", "URL": "https://www.snopes.news/2016-08-09-snopes-busted-yet-again-for-fabricating-total-lies-in-order-to-cover-for-obamas-money-laundering-crimes.html", "timestamp": "2023-04-25 17:09:17 CEST+0200", "meta": {"description": "Snopes is widely regarding as one of the most reliable fact-checking and myth-busting resources on the internet. When it comes to urban legends, there’s no website that does a better job of providing evidence as to whether or not stories are fact or fiction than Snopes. Unfortunately, the same cannot be said when it comes […]", "lang": "en", "keywords": "barack obama,corruption,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2016-08-09-snopes-busted-yet-again-for-fabricating-total-lies-in-order-to-cover-for-obamas-money-laundering-crimes.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "SNOPES busted yet again for fabricating total lies in order to cover for Obama’s money laundering crimes", "cleaned_text": "SNOPES busted yet again for fabricating total lies in order to cover for Obama’s money laundering crimes\n\nSnopes is widely regarding as one of the most reliable fact-checking and myth-busting resources on the internet. When it comes to urban legends, there’s no website that does a better job of providing evidence as to whether or not stories are fact or fiction than Snopes.\n\nUnfortunately, the same cannot be said when it comes to any political issues. In that realm, Snopes is visibly liberal, constantly taking the side of leftist politicians and actively avoiding the whole truth when it comes to controversies surrounding the Democratic Party. So if you’re getting your “facts” from their website, be prepared to read lie after lie after lie.\n\nMost recently, the website attempted to cover up the truth surrounding the Obama administration paying $400 million to Iran as ransom money for the American citizens being held prisoner.\n\nAccording to Snopes, “The money transfer was the result of a settlement of a long-standing claim at the Iran-U.S. Claims Tribunal in The Hague around the same time that the prisoners were released,” and had nothing to do with paying the ransom of the American hostages.\n\nTo call that comment difficult to believe is a gross understatement. It’s alarmingly convenient that the money transfer occurred at the exact same time that the hostages were released. How anyone could believe that those two things are unrelated is unfathomable — and yet Snopes is denying that there is any correlation there.\n\nAs Conservative Tribune reports, “Here’s the problem: Snopes completely ignores several major factors, including that Iran’s own government insisted that the payment was a ransom for the men.” All evidence points to the exchange of money being ransom pay — but Snopes just can’t admit it.\n\nThey’ve been this way in regards to a number of political issues, though, so it shouldn’t come as much of a surprise, unfortunately.\n\nIf you’re curious as to whether or not an urban legend from the 1960s is based on fact, Snopes is your friend. If you’re trying to confirm political rumors, avoid the website like the plague. There are Facebook memes that are more factually accurate.", "opengraph": {"title": "SNOPES busted yet again for fabricating total lies in order to cover for Obama’s money laundering crimes", "type": "article", "url": "https://www.snopes.news/2016-08-09-snopes-busted-yet-again-for-fabricating-total-lies-in-order-to-cover-for-obamas-money-laundering-crimes.html", "site_name": "Snopes News", "description": "Snopes is widely regarding as one of the most reliable fact-checking and myth-busting resources on the internet. When it comes to urban legends, there’s no website that does a better job of providing evidence as to whether or not stories are fact or fiction than Snopes. Unfortunately, the same cannot be said when it comes […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Barack-Obama2.jpg"}, "tags": ["corruption", "barack obama", "Snopes"], "tweets": [], "movies": [], "links": ["http://rangerorganicemergencyfood.naturalnews.com/RangerOrganicEmergencySurvivalFood.html", "http://www.evil.news", "http://conservativetribune.com/snopes-busted-obamas-lies/?utm_source=Facebook&utm_medium=Huckabee&utm_content=2016-08-06&utm_campaign=manualpost", "http://dailycaller.com/2016/06/17/fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2016-08-09-snopes-busted-yet-again-for-fabricating-total-lies-in-order-to-cover-for-obamas-money-laundering-crimes.html&linkname=SNOPES%20busted%20yet%20again%20for%20fabricating%20total%20lies%20in%20order%20to%20cover%20for%20Obama%E2%80%99s%20money%20laundering%20crimes", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}