{"result_id": "274002", "URL": "https://www.snopes.news/2019-02-04-snopes-throws-in-the-towel-with-facebook-fact-checking-after-being-caught-fabricating-lies.html", "timestamp": "2023-04-25 17:09:16 CEST+0200", "meta": {"description": "Snopes has announced that it is giving up “fact checking” for Facebook as controversy swirls over its handling of the Nathan Phillips case and other high-profile blunders. Of course, that’s not the official reason they’re throwing in the towel. In a statement, they cited limited resources as their primary motivation, saying that manually flagging false […]", "lang": "en", "keywords": "Collapse,deception,Facebook,Fact Check,fact checkers,fake news,Glitch,Journalism,lies,mainstream media,political bias,propaganda,Snopes,Social media,technocrats", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2019-02-04-snopes-throws-in-the-towel-with-facebook-fact-checking-after-being-caught-fabricating-lies.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "SNOPES throws in the towel with Facebook “fact checking” after being caught fabricating LIES and covering for fake news media", "cleaned_text": "SNOPES throws in the towel with Facebook “fact checking” after being caught fabricating LIES and covering for fake news media\n\nSnopes has announced that it is giving up “fact checking” for Facebook as controversy swirls over its handling of the Nathan Phillips case and other high-profile blunders.\n\nOf course, that’s not the official reason they’re throwing in the towel. In a statement, they cited limited resources as their primary motivation, saying that manually flagging false info was simply too big of a task for its team of 16 people.\n\nThe site partnered with Facebook in December 2016 on the pretense of cracking down on fake news like that seen during the presidential election of that year; they made $100,000 for their efforts last year. Facebook uses Snopes’ fact checks to change how its algorithm presents stories to users.\n\nTwo former workers of Snopes, ex-Managing Editor Brooke Binkowski and ex-Fact Checker Kim La Capria, told The Guardian that they got the impression the company did not care about its fact checking partners.\n\nBinkowski said: “They’ve essentially used us for crisis PR. They’re not taking anything seriously. They are more interested in making themselves look good and passing the buck… They clearly don’t care.”\n\nSnopes has been caught in a few unflattering incidents recently. In one high-profile case, they blatantly lied about an American Indian activist named Nathan Phillips. Phillips was thrust in the spotlight after a confrontation between himself and some high school boys went viral. It was said that the boys mobbed him and harassed him when he tried to leave the Indigenous People’s March, even though video evidence shows otherwise.\n\nSome media outlets reported that the man was a Vietnam veteran, but military records proved he was never deployed to Vietnam. Yet somehow Snopes’ team of fact checkers decided to label the idea of Philips falsely claiming to be a Vietnam vet as “unproven.” Even when video evidence proved that Phillips was the instigator of the confrontation, beyond a doubt, they still refused to change their stance.\n\nThey also botched a fact check of a viral meme depicting a picture of President Trump surrounded by lawmakers and others in his administration after the House voted to repeal Obamacare. In the photo, a red X is stamped across 33 people, along with a caption saying, “Everyone with an X has since been voted out of Congress.” The photo, which was shared by a former campaign staffer for Hillary Clinton, was immediately mocked, with Politico’s Jake Sherman calling it “more incorrect than correct.”\n\nEven though the Clinton staffer ultimately acknowledged its inaccuracy, a Snopes fact checker somehow reached the conclusion that it was “true.” The truth is that not everyone with an X was a lawmaker to begin with, but many of those who did have the X on their face did, in fact, win re-election after all.\n\nOn another occasion, they labeled a story by a Christian satire site “false” despite it being an obvious joke; the piece was in the style of The Onion and talked about CNN purchasing washing machines to spin the news. This prompted Facebook to threaten the site by reducing its distribution and removing its ability to monetize and advertise.\n\nSnopes was caught lying and helping cover for fake news media several times, but they’re not the only ones jumping ship at Facebook. The AP, another fact-checking partner of Facebook, is also reportedly pulling out, with the firm confirming it has stopped checking articles and its future relationship is up in the air.\n\nSee Snopes.news for more news about Snopes.", "opengraph": {"title": "SNOPES throws in the towel with Facebook “fact checking” after being caught fabricating LIES and covering for fake news media", "type": "article", "url": "https://www.snopes.news/2019-02-04-snopes-throws-in-the-towel-with-facebook-fact-checking-after-being-caught-fabricating-lies.html", "site_name": "Snopes News", "description": "Snopes has announced that it is giving up “fact checking” for Facebook as controversy swirls over its handling of the Nathan Phillips case and other high-profile blunders. Of course, that’s not the official reason they’re throwing in the towel. In a statement, they cited limited resources as their primary motivation, saying that manually flagging false […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2019/02/Fake-News-Fact-Truth-Myth-Rumor-Fiction.jpg"}, "tags": ["Fact Check", "fake news", "technocrats", "mainstream media", "Collapse", "Journalism", "deception", "Snopes", "political bias", "Social media", "Facebook", "lies", "Glitch", "propaganda", "fact checkers"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/tech/2019/02/01/snopes-quits-as-facebooks-fact-checker-suggests-blacklisting-instead/", "https://newstarget.com/2017-07-31-discredited-fact-checking-propaganda-site-snopes-com-now-begging-for-money-to-avoid-collapse.html", "https://dailycaller.com/2018/12/06/snopes-facebook-google-fact-check/", "http://facebookcollapse.com/", "http://Snopes.news", "https://www.breitbart.com/tech/2019/02/01/snopes-quits-as-facebooks-fact-checker-suggests-blacklisting-instead/", "https://dailycaller.com/2018/12/06/snopes-facebook-google-fact-check/", "https://www.bbc.com/news/technology-47098021", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2019-02-04-snopes-throws-in-the-towel-with-facebook-fact-checking-after-being-caught-fabricating-lies.html&linkname=SNOPES%20throws%20in%20the%20towel%20with%20Facebook%20%E2%80%9Cfact%20checking%E2%80%9D%20after%20being%20caught%20fabricating%20LIES%20and%20covering%20for%20fake%20news%20media", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}