{"result_id": "274033", "URL": "https://www.snopes.news/2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html", "timestamp": "2023-04-25 17:09:46 CEST+0200", "meta": {"description": "Snopes, which will now have the power to declare what news is or is not legitimate on the world’s largest online platform, almost exclusively employs leftists. (Article by Alex Pfeiffer and Peter Hasson, republished from DailyCaller.com) Facebook announced Thursday that mythbusting website Snopes will be one of a few fact-checking organizations allowed to label stories […]", "lang": "en", "keywords": "Facebook,Fact-checking,fake news,freedom,Politfact,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Snopes, which will be “fact-checking” for Facebook, employs leftists almost exclusively", "cleaned_text": "Snopes, which will be “fact-checking” for Facebook, employs leftists almost exclusively\n\nSnopes, which will now have the power to declare what news is or is not legitimate on the world’s largest online platform, almost exclusively employs leftists.\n\nFacebook announced Thursday that mythbusting website Snopes will be one of a few fact-checking organizations allowed to label stories as “fake news.”\n\nAlmost all of the writers churning out fact checks for Snopes have a liberal background, and many of them have expressed contempt for Republican voters. The Daily Caller could not identify a single Snopes fact-checker who comes from a conservative background. Snopes did not respond to a list of questions from TheDC regarding the site’s ideological leaning.\n\nAt least two of the site’s fact-checkers joined Snopes after writing for Raw Story, a far-left publication that describes itself as a “progressive news site that focuses on stories often ignored in the mainstream media.” Several others have demonstrated liberal partisanship.\n\nSnopes managing editor Brooke Binkowski said on Twitter that Brexit supporters were “pandering to racist mouth-breather ‘Britain First’ types.”\n\nSnopes fact-checker Arturo Garcia is an editor-at-large for Raw Story. Garcia is also a managing editor of Racialicious, a pro-Black Lives Matter blog. One of Garcia’s most recent stories at Raw Story was titled “The next time your right-wing uncle tries to ruin the holidays with ‘proof’ of creationism, show him these videos.”\n\nBack when Trump was reportedly considering launching his own media network, Garcia implied that it would be a TV channel for white people, calling it “White Entertainment Television.”\n\nAfter Boston University professor Saida Grundy was criticized for racist tweets in which she called white, college-aged males a “problem population,” Palmo Markus suggested Grundy’s tweets weren’t actually racist because they were directed at white people.\n\nFacebook routinely buried conservative news and topics from trending on the site and artificially made liberal topics part of the national discussion, former Facebook employees admitted last May. TheDC previously reported that the former Facebook trending news team was filled by liberals. It has since automated the Trending Topics section of its page.\n\nFacebook announced Thursday it will use fact-checking organizations that have signed the Poynter Institute’s International Fact Checking Code of Principles. The Associated Press reports that Facebook is currently working with Snopes, ABC News, Factcheck.org and PolitiFact, and that the list could grow.", "opengraph": {"title": "Snopes, which will be “fact-checking” for Facebook, employs leftists almost exclusively", "type": "article", "url": "https://www.snopes.news/2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html", "site_name": "Snopes News", "description": "Snopes, which will now have the power to declare what news is or is not legitimate on the world’s largest online platform, almost exclusively employs leftists. (Article by Alex Pfeiffer and Peter Hasson, republished from DailyCaller.com) Facebook announced Thursday that mythbusting website Snopes will be one of a few fact-checking organizations allowed to label stories […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Mark-Zuckerberg-e1478186143292.jpg"}, "tags": ["Politfact", "fake news", "Snopes", "Facebook", "freedom", "Fact-checking"], "tweets": [], "movies": [], "links": ["http://dailycaller.com/2016/12/16/snopes-facebooks-new-fact-checker-employs-leftists-almost-exclusively/", "/wp-content/uploads/2016/12/snopes-tweet-1.png", "/wp-content/uploads/2016/12/snopes-tweet-2.png", "http://dailycaller.com/2016/12/16/snopes-facebooks-new-fact-checker-employs-leftists-almost-exclusively/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html&linkname=Snopes%2C%20which%20will%20be%20%E2%80%9Cfact-checking%E2%80%9D%20for%20Facebook%2C%20employs%20leftists%20almost%20exclusively", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}