{"result_id": "274001", "URL": "https://www.snopes.news/2017-07-31-discredited-fact-checking-propaganda-site-snopes-com-now-begging-for-money-to-avoid-collapse.html", "timestamp": "2023-04-25 17:09:15 CEST+0200", "meta": {"description": "If Donald Trump’s presidency has taught us anything about the news media, it’s that lying and intentionally spreading propaganda is terrible for ratings. For proof, just look at CNN, the anti-Trump fake news network that has seen their ratings plummet in recent weeks due to their desperate and relentless attempts to advance the phony “Russia […]", "lang": "en", "keywords": "fake news,GoFundMe,left-wing media,mainstream media,media,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-07-31-discredited-fact-checking-propaganda-site-snopes-com-now-begging-for-money-to-avoid-collapse.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Discredited “fact checking” propaganda site SNOPES.com now begging for money to avoid collapse", "cleaned_text": "Discredited “fact checking” propaganda site SNOPES.com now begging for money to avoid collapse\n\nIf Donald Trump’s presidency has taught us anything about the news media, it’s that lying and intentionally spreading propaganda is terrible for ratings. For proof, just look at CNN, the anti-Trump fake news network that has seen their ratings plummet in recent weeks due to their desperate and relentless attempts to advance the phony “Russia collusion” scandal. As a matter of fact, CNN’s ratings have now fallen below reruns of Yogi Bear, as well as various networks such as TLC, FX, the History Channel, the Discovery Channel, ESPN and MSNBC. As classic of a show as Yogi Bear was and still is to this day, let’s be honest – if you’re a national news organization and you can’t even keep up with an animated bear, it might be time to do something different. (RELATED: How CNN poisoned the minds of Americans and destroyed media credibility for a decade)\n\nAnother left wing media outlet that is currently suffering the consequences of spreading fake news is none other than Snopes, which claims on their website to be one of the Internet’s oldest and most popular fact checking sites. Recently, Snopes turned to their fans and followers in a desperate attempt to make money, going so far as to create a GoFundMe page for the purpose of preventing the site from closing its doors for good.\n\n“Snopes.com, which began as a small one-person effort in 1994 and has since become one of the Internet’s oldest and most popular fact-checking sites, is in danger of closing its doors,” reads the GoFundMe page. “So, for the first time in our history, we are turning to you, our readership, for help.”\n\nSnopes then goes on to explain that their website is essentially being held hostage by an outside vendor, preventing them from modifying their site or collecting any ad revenue. “Although we maintain editorial control (for now), the vendor will not relinquish the site’s hosting to our control, so we cannot modify the site, develop it, or – most crucially – place advertising on it,” the post says. “The vendor continues to insert their own ads and has been withholding the advertising revenue from us.”\n\nThe GoFundMe page recommends that people donate $10 to help Snopes survive, “as it is only through your support that Snopes.com can remain the community and resource we all know and love.” At the time this article was written, the GoFundMe campaign had generated $680,158, surpassing the initial goal of $500,000.\n\nPerhaps one of the most laughable things about Snopes is that they actually claim to be a fact-checking website, when in reality they are nothing but a discredited left wing blog that routinely defends liberals and attacks conservatives.\n\nThe primary political fact-checker for Snopes.com is a woman named Kim Lacapria. Prior to her time working for Snopes, Lacapria wrote for Inquisitr, which ironically is known for publishing conspiracies, hoaxes and downright lies. Back in 2015, for instance, Inquisitr published an article claiming that Costco pulled a dinosaur cake design because a Christian mother said it looked demonic, a story that turned out to be utterly and completely false. This is the kind of phony website that Snopes’ political “fact-checker” actually wrote for.\n\nIn the past, Lacapria has also described herself as openly left leaning, and has smeared the Tea Party as “teahadists.” This “fair and balanced” political fact-checker is one of Bill Clinton’s biggest fans, and has accused the Bush administration of being criminally negligent in the September 11 attacks on the World Trade Center and the Pentagon.\n\nPut simply, Snopes is a website that fewer and fewer Americans are seeing as a reliable, trustworthy news source. Just like CNN and several other left wing media outlets, Snopes appears to be circling the drain. As a matter of fact, if it weren’t for their dwindling numbers of fans and followers, it’s likely that Snopes would already be out of money and out of time.", "opengraph": {"title": "Discredited “fact checking” propaganda site SNOPES.com now begging for money to avoid collapse", "type": "article", "url": "https://www.snopes.news/2017-07-31-discredited-fact-checking-propaganda-site-snopes-com-now-begging-for-money-to-avoid-collapse.html", "site_name": "Snopes News", "description": "If Donald Trump’s presidency has taught us anything about the news media, it’s that lying and intentionally spreading propaganda is terrible for ratings. For proof, just look at CNN, the anti-Trump fake news network that has seen their ratings plummet in recent weeks due to their desperate and relentless attempts to advance the phony “Russia […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Fake-News-Website-Artificial-Background-Blogging-Blogs.jpg"}, "tags": ["fake news", "GoFundMe", "mainstream media", "Snopes", "left-wing media", "media"], "tweets": [], "movies": [], "links": ["http://www.trump.news/", "http://www.naturalnews.com/2017-07-10-how-cnn-poisoned-the-minds-of-americans-and-destroyed-media-credibility-for-the-next-decade.html", "https://www.gofundme.com/savesnopes", "http://dailycaller.com/2016/06/17/fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger/", "http://www.rawstory.com/2015/07/story-about-costco-pulling-dinosaur-cake-was-hoax-by-insquisitr-contributor/", "https://www.gofundme.com/savesnopes", "http://dailycaller.com/2016/06/17/fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger/", "http://www.rawstory.com/2015/07/story-about-costco-pulling-dinosaur-cake-was-hoax-by-insquisitr-contributor/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-07-31-discredited-fact-checking-propaganda-site-snopes-com-now-begging-for-money-to-avoid-collapse.html&linkname=Discredited%20%E2%80%9Cfact%20checking%E2%80%9D%20propaganda%20site%20SNOPES.com%20now%20begging%20for%20money%20to%20avoid%20collapse", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}