{"result_id": "274026", "URL": "https://snopes.news/2020-02-01-danger-of-third-parties-fact-checking-our-info.html", "timestamp": "2023-04-25 17:09:40 CEST+0200", "meta": {"description": "It is a dangerous practice: Government, corporations, universities, news outlets and “experts” curating our information so that we cannot access, see or believe that which they determine we should not access, see or believe. (Article by Sharyl Attkisson republished from SharylAttkisson.com) If anyone had suggested to Orwell, or the American founders, that we would invite this […]", "lang": "en", "keywords": "bias,deception,democrats,fact checkers,Fact-checking,government,left cult,lies,manipulation,Orwell,Orwellian,politics,PolitiFact,propaganda,Snopes,thought control,truth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://snopes.news/2020-02-01-danger-of-third-parties-fact-checking-our-info.html", "encoding": "UTF-8"}, "image": null, "domain": "snopes.news", "title": "On the 70th anniversary of Orwell’s death: The danger of third parties “curating” and “fact checking” our info", "cleaned_text": "On the 70th anniversary of Orwell’s death: The danger of third parties “curating” and “fact checking” our info\n\nIt is a dangerous practice: Government, corporations, universities, news outlets and “experts” curating our information so that we cannot access, see or believe that which they determine we should not access, see or believe.\n\nIf anyone had suggested to Orwell, or the American founders, that we would invite this sort of manipulation and control of our information, they wouldn’t have believed it.\n\nThe idea was first introduced on the national stage by President Obama in October of 2016 right before the presidential election. He insisted that somebody needed to step in and “curate” our information in the “Wild, Wild West” internet environment.\n\nNobody had been clamoring for any such thing.\n\nSo the challenge for those who came up with this bright idea– in my opinion in an effort to control news and information– was to convince the public to accept something very un-American: their information being shaped and censored by others.\n\nThis feat was accomplished in concert with the anti-fake news effort, started in September 2016 through a nonprofit called First Draft. (First Draft was funded by Google, owned by Alphabet, run by Eric Schmidt, a major Hillary Clinton funder and supporter.) The anti-fake news effort was also an effort by special interests to step in and control news and internet information.\n\nIn a relatively short period of time, they had us. Curate our information, we cried. Block “untrue” news reports and blogs! Fact check political ads and certain politicians! Remove selected social media accounts! We invited special interests and political players to control our information under the guise of knowing what’s best for us.\n\nNo longer can we bear or do we deserve to hear various views and interpretations of facts. The curators decide which views are right and true They universally declare the others to be debunked or discredited.\n\nNever mind that the appointed curators are advancing their own views or special interests. No matter that the corporations employing the fact checks are looking out for their owners or corporate interests; or currying favor with government regulators— sometimes even doing the government’s bidding.\n\nFrom a pure factual standpoint, government, news outlets, social media and other corporations are hardly parties that should be trusted to oversee “curation” efforts. History is littered with examples of them being wrong, conflicted or providing false information.\n\nOne of the best most recent examples is the now disproven accusation that Donald Trump was working with Russia President Vladimir Putin. The wild conspiracy claims dominated the news for more than two years. The curators told us there was hard evidence. It would all be revealed soon! These views and reports were distributed, unfettered. What was censored and criticized as “debunked” by the curators? Social media, news reports and commentary that correctly questioned the conspiracies and pointed to malfeasance by the intelligence community. In the end, of course, the curators were wrong; the “debunked” skeptics were correct.\n\nA more recent example is the effort by curators to label, as debunked, reporting by Politico and others on Ukraine interference in the 2016 U.S. election. It turns out there are far more supportable facts and admissions in the public record on Ukrainian interference than on Russia interference.\n\nWhat’s more, those who have correctly pointed to Ukraine’s alleged role in 2016 have almost universally acknowledged there was Russia tampering, as well– that both are true. But the curators have falsely framed the facts, claiming that “conspiracy theorists” say Ukraine rather than Russia interfered in the 2016 campaign. In this way, the curators aren’t just curating, they are tampering with the facts. Altering reality. And why wouldn’t they? We have invited them to feel free.\n\nAnd a third example is the stranglehold on information the vaccine industry and their advocates have on information about vaccine side effects and links to autism. I recently reported on a sworn affidavit signed by Dr. Andrew Zimmerman, a world renowned pro-vaccine pediatric neurologist who served as the government’s expert witness in vaccine autism cases. He was, at the time, defending vaccine companies on behalf of the U.S. government.\n\nBut in the affidavit, Dr. Zimmerman said that after initially believing vaccines are not linked to autism, he became aware of advances in science revealing that vaccines do cause autism in rare cases, after all. He goes on to testify that government lawyers from the Department of Justice hid this fact from families and the court, and misrepresented his opinion in cases fought by parents of vaccine-injured autistic children.\n\nPeople are free to dismiss Dr. Zimmerman’s findings, of course, but the fact that he signed the affidavit it is not in dispute and the information should not be censored. However, Facebook’s “science fact checkers” have improperly flagged this reporting as untrue. Either these science experts are proxies for the vaccine industry or are sorely uninformed. Either way, they are not qualified to determine fact vs. fiction on your social media feed. All the while, misleading, incomplete and false information about vaccine safety is routinely promoted as “true.”\n\nWe should remember that the government incorrectly determined security guard Richard Jewell was responsible for the Atlanta Olympic bombing. (He was actually a hero who helped move people away from a suspicious backpack before it exploded.) The FBI falsified the polygraph of a Chinese scientist to make it look like he was a spy. Former Director of National Intelligence James Clapper falsely testified to Congress that there was no mass surveillance on millions of Americans. Social media videos were used out of context to defame a Catholic high school student as if he had aggressively confronted a Native American. Rape allegations in a landmark Rolling Stone article turned out to be untrue. Washington Post Pulitzer Prize winner Janet Cooke had falsified her sourcing. New York Times award winning reporter Jayson Blair plagiarized and faked his stories.\n\nCorporations have been wrong or misled us on information about cigarettes and cancer, food safety, the dangers of Ford Explorers equipped with Firestone tires, x-rays, asbestos, medicine and vaccines pulled off the market for safety reasons and countless other topics. Charities such as the Red Cross have been found guilty of misusing funds and providing false information. Facebook has gotten caught misleading consumers and advertisers. Social media company insiders have blown the whistle on biased and dishonest practices at their firms. Just as concerning– government, corporate, media and other curators sometimes fact check as “incorrect” matters that are simply matters of opinion.\n\nThese are the people we are trusting to be arbiters of what information we should be allowed to see and believe.\n\nWithout alternate information that some of these powerful interests initially claimed to be wrong or “debunked,” the facts might never have been discovered.\n\nSometimes, the reality about serious issues of public importance starts with a single whistleblower, a patient’s story, or a conversation on the internet. When curators have the power to make it where we cannot find this information, the truth risks staying hidden. We would live a controlled, Orwellian existence, knowing only precisely what they wish for us to know, thinking only that which they say is the right way to think, with contrary information dropped down the memory hole like it never even existed.\n\nMy own view is that, in general, information that is not deemed to be illegal should be accessible. Social media already has all kinds of tools to allow users to filter out objectionable posts, if they wish to use them. If people want a vested interest to “fact check” for them, they should be able to opt into that service. But the rest of us should be left alone.\n\nThe magic of the internet is that it puts information in the hands of most anyone rather than just the powerful. Allowing that information to be controlled, manipulated, filtered, improperly discredited or erased is a slippery slope fraught with peril…. and very Orwellian, indeed.", "opengraph": {"title": "On the 70th anniversary of Orwell’s death: The danger of third parties “curating” and “fact checking” our info", "type": "article", "url": "https://www.snopes.news/2020-02-01-danger-of-third-parties-fact-checking-our-info.html", "site_name": "Snopes News", "description": "It is a dangerous practice: Government, corporations, universities, news outlets and “experts” curating our information so that we cannot access, see or believe that which they determine we should not access, see or believe. (Article by Sharyl Attkisson republished from SharylAttkisson.com) If anyone had suggested to Orwell, or the American founders, that we would invite this […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2020/02/T2017-HRR-Fact-checkers-dont-know-facts.jpg"}, "tags": ["Orwell", "government", "manipulation", "Orwellian", "PolitiFact", "left cult", "politics", "deception", "Snopes", "thought control", "truth", "democrats", "lies", "bias", "propaganda", "Fact-checking", "fact checkers"], "tweets": [], "movies": [], "links": ["https://sharylattkisson.com/2020/01/on-the-70th-anniversary-of-orwells-death-the-danger-of-third-parties-curating-and-fact-checking-our-info/", "https://www.bl.uk/people/george-orwell", "https://obamawhitehouse.archives.gov/the-press-office/2016/10/13/remarks-president-opening-remarks-and-panel-discussion-white-house", "https://www.youtube.com/watch?v=-bYAQ-ZZtEU", "https://www.politico.com/story/2017/01/ukraine-sabotage-trump-backfire-233446", "https://sharylattkisson.com/2019/01/dr-andrew-zimmermans-full-affidavit-on-alleged-link-between-vaccines-and-autism-that-u-s-govt-covered-up/", "https://www.cjr.org/the_feature/the_fabulist_who_changed_journalism.php", "https://www.baltimoresun.com/bal-as.blair23-story.html", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&ved=2ahUKEwi_rda2opXnAhVEq1kKHZ0FDUUQFjAAegQIBRAB&url=https://www.washingtonpost.com/technology/2019/07/23/facebook-deceived-users-about-way-it-used-phone-numbers-facial-recognition-ftc-allege-complaint/&usg=AOvVaw06SFyHFXfhHbmXAnAHZOnb", "https://www.niemanlab.org/2019/10/facebook-will-pay-40-million-to-settle-a-lawsuit-claiming-that-it-misled-advertisers-about-the-success-of-video/", "https://www.youtube.com/watch?v=UQcCIzjz9_s", "https://sharylattkisson.com/2020/01/on-the-70th-anniversary-of-orwells-death-the-danger-of-third-parties-curating-and-fact-checking-our-info/"], "authors": [], "publish_date": null}