{"result_id": "274034", "URL": "https://snopes.news/2016-06-27-fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger.html", "timestamp": "2023-04-25 17:09:46 CEST+0200", "meta": {"description": "Popular myth-busting website Snopes originally gained recognition for being the go-to site for disproving outlandish urban legends -such as the presence of UFOs in Haiti or the existence of human-animal hybrids in the Amazon jungle. (Article by Peter Hasson) Recently, however, the site has tried to pose as a political fact-checker. But Snopes’ “fact-checking” looks more like playing defense […]", "lang": "en", "keywords": "Fact Check,hoax", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://snopes.news/2016-06-27-fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger.html", "encoding": "UTF-8"}, "image": null, "domain": "snopes.news", "title": "Fact-Checking Snopes: Website’s Political ‘Fact-Checker’ Is Just A Failed Liberal Blogger", "cleaned_text": "Popular myth-busting website Snopes originally gained recognition for being the go-to site for disproving outlandish urban legends -such as the presence of UFOs in Haiti or the existence of human-animal hybrids in the Amazon jungle.\n\nRecently, however, the site has tried to pose as a political fact-checker. But Snopes’ “fact-checking” looks more like playing defense for prominent Democrats like Hillary Clinton and it’s political “fact-checker” describes herself as a liberal and has called Republicans “regressive” and afraid of “female agency.”\n\nSnopes’ main political fact-checker is a writer named Kim Lacapria. Before writing for Snopes, Lacapria wrote for Inquisitr, a blog that — oddly enough — is known for publishing fake quotes and even downright hoaxes as much as anything else.\n\nWhile at Inquisitr, the future “fact-checker” consistently displayed clear partisanship.\n\nShe described herself as “openly left-leaning” and a liberal. She trashed the Tea Party as “teahadists.” She called Bill Clinton “one of our greatest” presidents. She claimed that conservatives only criticized Lena Dunham’s comparison of voting to sex because they “fear female agency.”\n\nShe once wrote: “Like many GOP ideas about the poor, the panic about using food stamps for alcohol, pornography or guns seems to have been cut from whole cloth–or more likely, the ideas many have about the fantasy of poverty.” (A simple fact-check would show that food stamp fraud does occur and costs taxpayers tens of millions.)\n\nLacapria even accused the Bush administration of being “at least guilty of criminal negligience” in the September 11 attacks. (The future “fact-checker” offered no evidence to support her accusation.)\n\nHer columns apparently failed to impress her readership, oftentimes failing to get more than 10-20 shares.\n\nAfter blogging the Inquisitr, Lacapria joined Snopes, where she regularly plays defense for her fellow liberals.\n\nShe wrote a “fact check” article about Jimmy Carter’s unilateral ban of Iranian nationals from entering the country that looks more like an opinion column arguing against Donald Trump’s proposed Muslim ban.\n\nSimilarly, Lacapria — in another “fact check” article — argued Hillary Clinton hadn’t included Benghazi at all in her infamous “we didn’t lose a single person in Libya” gaffe. Lacapria claimed Clinton only meant to refer to the 2011 invasion of Libya (but not the 2012 Benghazi attack) butoffered little fact-based evidence to support her claim.\n\nAfter the Orlando terror attack, Lacapria claimed that just because Omar Mateen was a registered Democrat with an active voter registration status didn’t mean he was actually a Democrat. Her “fact check” argued that he might “have chosen a random political affiliation when he initially registered.”\n\nLacapria even tried to contradict the former Facebook workers who admitted that Facebook regularly censors conservative news, dismissing the news as “rumors.”\n\nIn that “fact check” article, Lacapria argued that “Facebook Trending’s blacklisting of ‘junk topics’ was not only not a scandalous development, but to be expected following the social network’s crackdown on fake news sites.” The opinion-heavy article was mockingly titled: The Algorithm Is Gonna Get You.\n\nLacapria again played defense for Clinton in a fact check article when she claimed: “Outrage over an expensive Armani jacket worn by Hillary Clinton was peppered with inaccurate details.”\n\nOne of the “inaccurate details” cited by Lacapria was that, “The cost of men’s suits worn by fellow politicians didn’t appear in the article for contrast.” She also argued the speech Clinton gave while wearing the $12,495 jacket, which discussed “raising wages and reducing inequality,” wasn’t actually about income inequality.", "opengraph": {"title": "Fact-Checking Snopes: Website’s Political ‘Fact-Checker’ Is Just A Failed Liberal Blogger", "type": "article", "url": "https://www.snopes.news/2016-06-27-fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger.html", "site_name": "Snopes News", "description": "Popular myth-busting website Snopes originally gained recognition for being the go-to site for disproving outlandish urban legends -such as the presence of UFOs in Haiti or the existence of human-animal hybrids in the Amazon jungle. (Article by Peter Hasson) Recently, however, the site has tried to pose as a political fact-checker. But Snopes’ “fact-checking” looks more like playing defense […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/world-news-daily-report-fake-news.jpg"}, "tags": ["hoax", "Fact Check"], "tweets": [], "movies": [], "links": ["http://www.snopes.com/photos/odd/haitiufos.asp", "http://www.snopes.com/photos/arts/family.asp", "http://dailycaller.com/2016/06/17/fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger/", "http://www.inquisitr.com/670091/retraction-and-apology-to-roger-moore/", "http://www.rawstory.com/2015/07/story-about-costco-pulling-dinosaur-cake-was-hoax-by-insquisitr-contributor/", "http://www.inquisitr.com/402558/scandal-envy-behind-petraeus-drama-allegations-obama-ignored-benghazi/", "http://www.inquisitr.com/132960/good-job-teahadists-obama-advisor-acknowledges-tea-party-downgrade/", "http://www.inquisitr.com/32795/video-hillary-clinton-i-am-the-secretary-of-state-beeotch/", "http://www.inquisitr.com/377938/lena-dunhams-obama-ad-exposes-gops-fear-of-female-agency/", "http://www.inquisitr.com/556746/food-stamps-for-porn-booze-and-guns-ma-republicans-fear-ebt-fraud/", "http://insider.foxnews.com/2016/06/16/7-women-arrested-massive-food-stamp-fraud-scheme", "http://www.miamiherald.com/news/local/community/miami-dade/article77078947.html", "http://www.inquisitr.com/36472/charlie-sheenbarack-obama-fanfic-as-written-by-charlie-sheen/", "http://www.snopes.com/jimmy-carter-banned-iranian-immigrants/", "http://dailycaller.com/2016/03/14/hillary-clinton-we-didnt-lose-a-single-person-in-libya-video/", "http://www.snopes.com/hillary-clinton-benghazi-msnbc/", "http://dailycaller.com/2016/06/14/omar-mateen-was-a-registered-democrat-but/", "https://gizmodo.com/former-facebook-workers-we-routinely-suppressed-conser-1775461006", "http://www.snopes.com/is-facebook-censoring-conservative-news/", "http://dailycaller.com/2016/06/07/hillary-clintons-wore-a-13000-jacket-while-giving-speech-about-inequality/", "http://www.snopes.com/hillary-clinton-armani-jacket/", "http://dailycaller.com/2016/06/17/fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2016-06-27-fact-checking-snopes-websites-political-fact-checker-is-just-a-failed-liberal-blogger.html&linkname=Fact-Checking%20Snopes%3A%20Website%E2%80%99s%20Political%20%E2%80%98Fact-Checker%E2%80%99%20Is%20Just%20A%20Failed%20Liberal%20Blogger", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}