{"result_id": "274023", "URL": "https://www.snopes.news/2018-03-28-left-wing-medias-fact-checkers-are-even-more-biased-than-the-media-outlets-they-represent.html", "timestamp": "2023-04-25 17:09:38 CEST+0200", "meta": {"description": "In theory, media “fact-checkers” are a great idea, but in practice, they’ve become little more than another tool used by the American Pravda media to ‘verify’ and ‘substantiate’ the lies they publish on daily basis. “Fact-checking groups — such as Politifact — routinely cast judgments while failing to disclose their own left-wing bias,” notes the […]", "lang": "en", "keywords": "Alt-Left,American Pravda media,bias,biased,dishonest,fact checkers,fake news,Journalism,left cult,Left-wing,Liars,lies,media", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2018-03-28-left-wing-medias-fact-checkers-are-even-more-biased-than-the-media-outlets-they-represent.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Left-wing media’s “fact-checkers” are even MORE biased than the media outlets they represent", "cleaned_text": "Left-wing media’s “fact-checkers” are even MORE biased than the media outlets they represent\n\nIn theory, media “fact-checkers” are a great idea, but in practice, they’ve become little more than another tool used by the American Pravda media to ‘verify’ and ‘substantiate’ the lies they publish on daily basis.\n\n“Fact-checking groups — such as Politifact — routinely cast judgments while failing to disclose their own left-wing bias,” notes the Media Research Center’s Newsbusters, a fact-checker’s fact-checker.\n\n“Their allies in the media try to cast these groups as neutral third parties when, in fact, they are card-carrying members of the liberal echo chamber,” the site noted further, adding that’s there’s little wonder, then, why a large majority — 62 percent — of American voters believe the Pravda media’s own fact-checkers are indeed biased.\n\n“The Media Research Center is flipping the script on these faux-fact-checkers,” Newsbusters noted. “It’s time to turn the tables and give the public the real facts.”\n\n— Politifacts’ not-so-factual fact-checking on abortions and black deaths. On March 5 Newsbusters took them to task for incorrectly fact-checking Jason Isaac, a Republican congressional candidate in Texas. He declared in a League of Women Voters Guide, “I will work to end abortion, which is the leading cause of death for black Americans and kills as many as 1,000 black babies every day. Politifact judged that “Mostly False.”\n\nHere’s how the site’s checkers justified their ruling: They refused to accept that what’s growing inside a pregnant woman is, in fact, a human baby:\n\nAbortion rights advocates, noting the Supreme Court legalized abortion in every state in 1973, typically refer to unborn fetuses. Also, the CDC doesn’t say abortions kill babies; it defines a “legal induced abortion” as “an intervention performed by a licensed clinician (e.g., a physician, nurse-midwife, nurse practitioner, or physician assistant) that is intended to terminate an ongoing pregnancy.”\n\nFetuses, not babies. An intervention, not the death of an unborn baby. Terminology means everything, doesn’t it? (Related: NYT pushes junk science “racism” study that falsely claims systemic racism causes wealthy black people to lose all their money.)\n\n— When it isn’t botching facts about real stories, Snopes is fact-checking obvious satire. The site “followed other fact-checkers in warning about the Christian satire site Babylon bee,” notes Newsbusters. The fact-checked story? Here’s the headline (and while reading it, ask yourself if you would have clicked on it because you believed it or because you knew it was satire and thought it funny enough to check out): “CNN Purchases Industrial-Sized Washing Machine to Spin News Before Publication.” Snopes urgently described the story as “False.”\n\nOf course it was. After all, everybody knows CNN doesn’t need a washing machine, large or small, to spin the news; it just comes naturally to those hacks.\n\n— Politifact ‘fact-checked’ Hillary Clinton’s campaign book, “What Happened,” and failed to find any falsehoods at all. Not only did the site’s fact-checkers rate nothing in the book as “false” but it never earned any “Pants on Fire” ratings either. Believing Clinton is telling the truth in her tome depends an awful lot on what you personally consider “true” (even if it isn’t).\n\n“This isn’t surprising since the website has only evaluated Hillary once since last November — a ‘Mostly False’ in a complaint about over suppression in Wisconsin in June,” Newsbusters noted.\n\nWhat’s not true about what Hillary has said? That Benghazi was caused by an anti-Muslim video made by an American. That Trump colluded with Russia to steal the election from her (the Clinton campaign, along with the DNC, “colluded” with a British spy to buy Russia-supplied fake ‘dirt’ on Trump). That Trump is “unfit” for office (when she can’t seem to walk anywhere these days without falling down). And my personal favorite: “Trump’s not fit for the office of president.”\n\nGiven the soaring economy, the fact that a North Korean tyrant wants to talk now instead of making war, and everyone who has been taking advantage of America via one-sided trade deals now wants to renegotiate them, I’d rate Clinton’s observation “Pant(suit) on Fire.”\n\nStay current on the day’s REAL news the Pravda media doesn’t want you to see at Censored.news.\n\nJ.D. Heyes is editor of The National Sentinel and a senior writer for Natural News and News Target.", "opengraph": {"title": "Left-wing media’s “fact-checkers” are even MORE biased than the media outlets they represent", "type": "article", "url": "https://www.snopes.news/2018-03-28-left-wing-medias-fact-checkers-are-even-more-biased-than-the-media-outlets-they-represent.html", "site_name": "Snopes News", "description": "In theory, media “fact-checkers” are a great idea, but in practice, they’ve become little more than another tool used by the American Pravda media to ‘verify’ and ‘substantiate’ the lies they publish on daily basis. “Fact-checking groups — such as Politifact — routinely cast judgments while failing to disclose their own left-wing bias,” notes the […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2019/02/FakeNews.jpg"}, "tags": ["fake news", "Liars", "media", "left cult", "Journalism", "American Pravda media", "Left-wing", "dishonest", "Alt-Left", "lies", "bias", "biased", "fact checkers"], "tweets": [], "movies": [], "links": ["https://www.newsbusters.org/blogs/nb/tim-graham/2017/09/16/politifact-fact-checks-hillarys-book-fails-find-false-thing-it", "http://www.politifact.com/texas/statements/2018/mar/02/jason-isaac/jason-isaac-makes-mostly-false-claim-abortion-lead/", "http://newsfakes.com/2018-03-25-nyt-pushes-junk-science-racism-study-that-falsely-claims-systemic-racism-causes-wealthy-black-people-to-lose-money.html", "https://www.snopes.com/fact-check/cnn-washing-machine/", "http://www.mediafactwatch.com/2018-02-19-the-american-pravda-media-isnt-covering-the-trump-russia-collusion-story.html", "http://www.censored.news", "http://www.thenationalsentinel.com/", "https://www.newsbusters.org/blogs/nb/tim-graham/2017/09/16/politifact-fact-checks-hillarys-book-fails-find-false-thing-it", "http://www.mediafactwatch.com/2018-02-19-the-american-pravda-media-isnt-covering-the-trump-russia-collusion-story.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2018-03-28-left-wing-medias-fact-checkers-are-even-more-biased-than-the-media-outlets-they-represent.html&linkname=Left-wing%20media%E2%80%99s%20%E2%80%9Cfact-checkers%E2%80%9D%20are%20even%20MORE%20biased%20than%20the%20media%20outlets%20they%20represent", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}