{"result_id": "274035", "URL": "https://www.snopes.news/2018-06-18-legitimate-news-cnn-washpo-and-nyt-must-be-excluded-for-knowingly-publishing-fake-news.html", "timestamp": "2023-04-25 17:09:49 CEST+0200", "meta": {"description": "There is a major push going on behind the scenes to create a law that would define what a legitimate news organization is and who is and who isn’t verified as a “journalist.” This monopolization of journalism also seeks protections for “legitimate” journalists so they can keep their sources private, but this first amendment protection would not […]", "lang": "en", "keywords": "Alt-Left,bias,CNN,defining journalism,elite media,fake news,Independent journalism,information control,mainstream media,media corporations,media shield laws,msnbc,news cartels,NYT,political agenda,public service,Social media,Suppressed,Washington Post", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2018-06-18-legitimate-news-cnn-washpo-and-nyt-must-be-excluded-for-knowingly-publishing-fake-news.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "If only “legitimate” news organizations are recognized, then CNN, WashPo and NYT must be excluded for knowingly publishing FAKE news", "cleaned_text": "If only “legitimate” news organizations are recognized, then CNN, WashPo and NYT must be excluded for knowingly publishing FAKE news\n\nThere is a major push going on behind the scenes to create a law that would define what a legitimate news organization is and who is and who isn’t verified as a “journalist.” This monopolization of journalism also seeks protections for “legitimate” journalists so they can keep their sources private, but this first amendment protection would not extend to independent journalists who are not verified by the law. A bill proposed by Senator Chuck Schumer seeks to protect journalists, but only those who are verified as legitimate. With this legal maneuver, news organizations that have lost the public’s trust, such as CNN, WashPo, and the NYT, can re-establish themselves as credible sources. The law would make freelance journalism not credible under the eyes of the law. This allows the top media companies to monopolize information and control the narrative.\n\nWith this bill, Congress would essentially be making laws that define what the “press” is, which would do a great disservice to journalism as a whole. Journalism is a public service that can be taken up by anyone who asks questions, researches, collects information, interviews, and publishes their story. With the advent of the internet, independent journalism has exploded, bringing transparency and truth to the world that we once knew. The push to legitimize select “journalists” focuses on parameters such as the wealth of the news organization, a reporter’s salary, the reporter’s education background, their frequency of publication, and other asinine measures that do not equate to good journalism. Those who do not fit the mainstream definition of a journalist would be cast aside under the law, demoted as a fake news publisher or a phony reporter with no real credentials. A journalist should not be defined by where they work, how much they make, but by the importance of the work they are doing.\n\nThe truth is that fake news has been pouring out of the most “legitimate” news organizations in recent years. CNN, WashPo, and NYT lead the way for FAKE news publishing with some of the most biased reporting, baseless claims, and outright lies. If only “legitimate” news organizations are recognized, then CNN, WashPo and NYT should be excluded because they knowingly publish FAKE news, time and time again. The 2017 Fake News awards, compiled by President Trump, give great examples of how CNN, WashPo, and NYT totally twist reality to manipulate readers and push their deranged, leftist, and anti-American agendas. Yet, under proposed bills, it’s these failing entities that will get the red carpet treatment as journalism organizations.\n\nInstead of favoring elite media corporations, Congress needs to focus on protecting journalism as a whole. Any media shield laws should protect all people who engage in journalism, not just a select few. Judges should not have the authority to decide who is a legitimate journalist. There are plenty of fake news journalists working for CNN and WashPo who don’t deserve to be treated any better than others. If anything, they should be held accountable to libel laws when they knowingly publish defamatory pieces, without evidence or reason, to assassinate a person’s character and reputation.\n\nYes, it was a shame that the government harassed journalists who withheld information on the National Security Agency’s domestic surveillance programs, but it’s also a shame that journalists for CNN and WashPo can knowingly publish distorted fake news without any story credentials and then go on to be honored as “legitimate” under the law.\n\nIf Congress is going to designate which organizations are legitimate news publishers, then the U.S. is headed down a slippery slope, where money controls the official story and where the most powerful media elite control what people read, see, and think. When governments or social media platforms such as Facebook designate what is real and what is fake, what is legitimate and what is not, they are only fighting to control the spread of information to ultimately control public opinion, protect the status quo, and enslave your mind.\n\nRead NewsCartels.com for more stories about media monopolism.", "opengraph": {"title": "If only “legitimate” news organizations are recognized, then CNN, WashPo and NYT must be excluded for knowingly publishing FAKE news", "type": "article", "url": "https://www.snopes.news/2018-06-18-legitimate-news-cnn-washpo-and-nyt-must-be-excluded-for-knowingly-publishing-fake-news.html", "site_name": "Snopes News", "description": "There is a major push going on behind the scenes to create a law that would define what a legitimate news organization is and who is and who isn’t verified as a “journalist.” This monopolization of journalism also seeks protections for “legitimate” journalists so they can keep their sources private, but this first amendment protection would not […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/12/Fake-News-Website-Artificial-Background-Blogging-Blogs.jpg"}, "tags": ["information control", "NYT", "media shield laws", "media corporations", "political agenda", "news cartels", "bias", "Independent journalism", "elite media", "public service", "fake news", "mainstream media", "Washington Post", "Suppressed", "Social media", "Alt-Left", "defining journalism", "msnbc", "CNN"], "tweets": [], "movies": [], "links": ["https://www.usnews.com/opinion/articles/2014/04/09/the-senates-media-shield-law-is-toothless-and-arbitrary", "http://CNNsofake.news", "https://gop.com/the-highly-anticipated-2017-fake-news-awards/", "http://wapo.news", "http://censorship.news", "http://NewsCartels.com", "https://www.usnews.com/opinion/articles/2014/04/09/the-senates-media-shield-law-is-toothless-and-arbitrary", "https://gop.com/the-highly-anticipated-2017-fake-news-awards/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2018-06-18-legitimate-news-cnn-washpo-and-nyt-must-be-excluded-for-knowingly-publishing-fake-news.html&linkname=If%20only%20%E2%80%9Clegitimate%E2%80%9D%20news%20organizations%20are%20recognized%2C%20then%20CNN%2C%20WashPo%20and%20NYT%20must%20be%20excluded%20for%20knowingly%20publishing%20FAKE%20news", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}