{"result_id": "274014", "URL": "https://www.snopes.news/2019-10-14-snopes-ignores-facts-push-anti-trump-globalist-agenda.html", "timestamp": "2023-04-25 17:09:31 CEST+0200", "meta": {"description": "It’s getting to the point where you really can’t trust anything published by the so-called “mainstream media” because it is concocted, fabricated narrative, or outright false — and this is especially true when it comes to anti-establishment politicians like President Donald Trump. CNN, The New York Times, the Washington Post, MSNBC, and the broadcast news […]", "lang": "en", "keywords": "academics,brexit,British subjects,deception,EU,Fact Check,fact checkers,fact-checker,fake news,false,globalists,hoax,hypocrisy,left cult,Left-wing,news cartels,President Trump,propaganda,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2019-10-14-snopes-ignores-facts-push-anti-trump-globalist-agenda.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "“Fact-checking” website Snopes throws aside FACTS to push anti-Trump, pro-globalist Left-wing agenda", "cleaned_text": "It’s getting to the point where you really can’t trust anything published by the so-called “mainstream media” because it is concocted, fabricated narrative, or outright false — and this is especially true when it comes to anti-establishment politicians like President Donald Trump.\n\nCNN, The New York Times, the Washington Post, MSNBC, and the broadcast news networks have already tossed aside any semblance of journalistic ethics and integrity they had left in the age of Trump. Anything and everything is fair game when it comes to the ongoing effort by the Marxist Left to get rid of the most pro-America president in generations.\n\nNow, so-called “fact-checking” websites like Snopes have also ditched all remaining vestiges of journalistic integrity, declaring, outright, that even fake news and phony narratives are okay in the Trump era because, you know, he’s such a threat to democracy.\n\nIn a stunning admission (of what we already knew), Snopes reprinted an essay Thursday arguing that Trump and British Prime Minister Boris Johnson are such unique threats to the world that “experts must find new ways to reach people.” Which means that — get this — Trump and Johnson must be “countered by the shared stories, experiences and emotions of real people and how they are affected by the big global issues.”\n\nSnopes has long been accused of lying about ‘facts’ in order to push a Left-wing political narrative. The site refused to correct lies surrounding Native American ‘activist’ Nathan Phillips, who tried to provoke pro-Trump children from a Catholic school in Kentucky, ‘fact-checks’ obvious satire, and covered for Obama’s ransom payment to Iran for American hostages so he could do his bogus “nuclear deal” with the terrorist-sponsoring regime.\n\nAs for the essay Snopes reprinted, it was originally a blog post by Profs. David Knights and Torkild Thanem. First published by The Conservation, Snopes ran it in full.\n\nIf you cherish truth and freedom, your garbage and your viewpoints need to be ‘dismissed’\n\n“Public austerity measures, for example, are not simply about financial facts,” they wrote. “Indeed, when presented merely as economic data, many people can neither identify with nor understand them. Instead, austerity poses problems that compel us to examine how they affect people and families in their daily lives. The experiences of those individuals must be shared.”\n\nBoth academics also made similarly arcane points when discussing Brexit — Britain’s vote to exit the European Union, which was actually decided on in June 2016 but has yet to occur because globalists in that country and in the EU continue to throw up roadblocks.\n\n“Whether examining Brexit, public austerity measures or the effects of climate change, one limitation is that facts and data generated through quantitative social research are presented as if detached from the people they concern as well as those involved in their production,” the authors write. “Far removed from people’s lived experiences, they risk displacing any sense of what it is to be human. As such, they are, perhaps, too easy to dismiss.”\n\nThere you have it. If you were one of the 51.9 percent of British subjects who voted to leave the EU and, you know, have a totally independent country, then you’re not a human so your views should be ‘dismissed.”\n\nNolte writes that it is actually a positive thing that we are seeing columns like this appear and that “fact checkers” like Snopes are providing them with a platform. It’s good to see the ‘enemy’ drop his mask and reveal who he is.\n\nIt’s also important to note that Snopes posted the article without any caveat — that is, without saying something like, ‘Hey, this doesn’t reflect our editorial opinion’ — which further reveals the site’s commitment to propaganda and fabrication over facts that it doesn’t like.\n\nThe problem is, far too many people still believe these people and have no idea what their political objectives are: To undermine our republic and democracy everywhere.\n\nRead more news about Snopes propaganda at Snopes.news.", "opengraph": {"title": "“Fact-checking” website Snopes throws aside FACTS to push anti-Trump, pro-globalist Left-wing agenda", "type": "article", "url": "https://www.snopes.news/2019-10-14-snopes-ignores-facts-push-anti-trump-globalist-agenda.html", "site_name": "Snopes News", "description": "It’s getting to the point where you really can’t trust anything published by the so-called “mainstream media” because it is concocted, fabricated narrative, or outright false — and this is especially true when it comes to anti-establishment politicians like President Donald Trump. CNN, The New York Times, the Washington Post, MSNBC, and the broadcast news […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2019/10/SNOPES-vice-vixen-whores-David-Mikkelson.jpg"}, "tags": ["hoax", "left cult", "deception", "news cartels", "academics", "fact checkers", "EU", "Fact Check", "globalists", "President Trump", "propaganda", "brexit", "fake news", "hypocrisy", "Snopes", "false", "British subjects", "Left-wing", "fact-checker"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/the-media/2019/10/11/nolte-snopes-announces-now-fight-trump-using-feelings-emotion/", "https://www.snopes.com/news/2019/10/10/facts-and-data-arent-enough-to-combat-fake-news/", "https://www.newstarget.com/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "https://www.newstarget.com/2018-03-05-stupid-snopes-fact-checks-satire-article-that-said-cnn-buys-industrial-washing-machine-to-spin-the-news.html", "https://www.newstarget.com/2016-08-09-snopes-busted-yet-again-for-fabricating-total-lies-in-order-to-cover-for-obamas-money-laundering-crimes.html", "https://theconversation.com/fake-news-emotions-and-experiences-not-more-data-could-be-the-antidote-123496", "http://Snopes.news", "https://www.breitbart.com/the-media/2019/10/11/nolte-snopes-announces-now-fight-trump-using-feelings-emotion/", "https://www.newstarget.com/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2019-10-14-snopes-ignores-facts-push-anti-trump-globalist-agenda.html&linkname=%E2%80%9CFact-checking%E2%80%9D%20website%20Snopes%20throws%20aside%20FACTS%20to%20push%20anti-Trump%2C%20pro-globalist%20Left-wing%20agenda", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}