{"result_id": "274013", "URL": "https://snopes.news/2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html", "timestamp": "2023-04-25 17:09:30 CEST+0200", "meta": {"description": "Since the discredited ‘mainstream’ media’s anointed candidate, Democratic presidential nominee Hillary Clinton, lost to GOP nominee Donald J. Trump, those purveyors of fake news and ideologically tainted “reporting” have been pushing a goofy narrative that Russian propaganda fed to hundreds of American news sites sabotaged Clinton’s candidacy. Why, you ask? Well, because Russian President Vladimir […]", "lang": "en", "keywords": "Facebook,fake news,prostitutes,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://snopes.news/2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html", "encoding": "UTF-8"}, "image": null, "domain": "snopes.news", "title": "Facebook to use actual whores to “fact-check” news: SNOPES credibility implodes under shocking revelations", "cleaned_text": "Facebook to use actual whores to “fact-check” news: SNOPES credibility implodes under shocking revelations\n\nSince the discredited ‘mainstream’ media’s anointed candidate, Democratic presidential nominee Hillary Clinton, lost to GOP nominee Donald J. Trump, those purveyors of fake news and ideologically tainted “reporting” have been pushing a goofy narrative that Russian propaganda fed to hundreds of American news sites sabotaged Clinton’s candidacy.\n\nWhy, you ask? Well, because Russian President Vladimir Putin loves Trump and, according to Clinton, has some grudge against her.\n\nSo, even though it was actually Clinton’s campaign that was wholly scripted, based on lies and deception as well as a healthy dose of fake news from her adoring Left-wing media, it has been decided by the ‘powers that be’ alternative news sites and reporting must officially be deemed “fake” and, thus, censored. That’s the only way to explain a post-election decision by social media giants Facebook and Google to begin relying on outside “fact-checkers” to weed out what they consider to be false news and information—even if said reports are actually spot-on.\n\nBut there are already problems with this notion. Never mind that the fact-checking organizations including Snopes.com and Politifact are themselves highly partisan, the former is staffed in part by a woman who admittedly used to sell herself to the highest male bidder, destroying what little credibility the site still had.\n\nAs reported by Mike Adams, the Health Ranger, actual “prostitutes for the Presstitutes” are working at Snopes.com “fact-checking” news for sites like Facebook.\n\n“The propagandizing ‘fact-checking’ website SNOPES is being run by a whore-digger who defrauded the publisher out of $98,000 to hire prostitutes, say now-public divorce documents,” Adams noted, citing the original report in the UK’s Daily Mail. “One of the site’s administrators is an ‘escort porn star,’ and a fact-checker at SNOPES turns out to be a sex blogger named “Vice Vixen dome.”\n\nIndeed, the reports noted further, the entire Snopes.com organization was founded upon an elaborate fraud scheme, with its CEO marrying an international escort worker who traveled the world to have sexual relations with VIP clients who then posted glowing online reviews of why she is such a wonderful choice to be hired as a “lover.”\n\nAnd this is one of the sites that Facebook recently announced it would rely on to “fact-check” news reports to ensure the social media site operates with high standards of integrity and full transparency. But what’s really happening is that Facebook’s decision is nothing short of a thinly-veiled effort to censor independent journalism through the labeling of real news the site just doesn’t like as “fake” news—and with the help of prostitutes-turned-presstitutes.\n\nAs noted by Truthwiki, Snopes.com has regularly labeled legitimate, science-and-study-based reporting about vaccines, GMOs and false flag attacks as “fake” information, while regularly siding with Leftists and liberals, President Obama and the so-called “establishment” on virtually every issue. And while it claims to be a bastion of truth and “factual” referencing, it really functions like just another Left-wing propaganda outlet, declaring liberal garbage to be gospel no matter how demonstrably false and unproven it is. If you are a media outlet or independent scientist who disagrees with the accepted corporate/media/establishment “norm” and “facts,” you are stereotyped as unreliable and discredited, without a shred of evidence or proof to support the Snopes.com claims.\n\nSnopes—and now Facebook—are the sites without credibility\n\nIn this way, Adams noted, Snopes.com is operated much like Politifact, a site also operated by Left-wing “propagandists and mind manipulators.”\n\nAs the Daily Mail notes further:\n\nIt was founded by husband-and-wife Barbara and David Mikkelson, who used a letterhead claiming they were a non-existent society to start their research. Now they are divorced – with Barbara claiming in legal documents he embezzled $98,000 of company money and spent it on ‘himself and prostitutes’.\n\nSnopes.com founder David Mikkelson’s new wife Elyssa Young is employed by the website as an administrator… she has worked as an escort and porn actress and despite claims [that SNOPES] is non-political ran as a Libertarian for Congress on a ‘Dump Bush’ platform. Its main ‘fact checker’ is Kimberly LaCapria, whose blog ‘ViceVixen’ says she is in touch with her ‘domme side’ and has posted on Snopes.com while smoking pot.\n\nFacebook’s entire plan to ‘root out fake news’ reeks of manipulation, propaganda and full-on censorship. And now, it has been completely exposed as being associated with a tawdry, unreliable and wholly discredited “fact-checker” web site as a partner.\n\nJ.D. Heyes is a senior writer for Natural News and News Target, as well as editor of The National Sentinel.", "opengraph": {"title": "Facebook to use actual whores to “fact-check” news: SNOPES credibility implodes under shocking revelations", "type": "article", "url": "https://www.snopes.news/2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html", "site_name": "Snopes News", "description": "Since the discredited ‘mainstream’ media’s anointed candidate, Democratic presidential nominee Hillary Clinton, lost to GOP nominee Donald J. Trump, those purveyors of fake news and ideologically tainted “reporting” have been pushing a goofy narrative that Russian propaganda fed to hundreds of American news sites sabotaged Clinton’s candidacy. Why, you ask? Well, because Russian President Vladimir […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/SNOPES-vice-vixen-whores-David-Mikkelson.jpg"}, "tags": ["fake news", "Snopes", "prostitutes", "Facebook"], "tweets": [], "movies": [], "links": ["http://www.clinton.news/", "http://www.whitehouse.news/", "http://www.cnn.com/2016/12/15/politics/hillary-clinton-john-podesta-russian-hacking/", "http://clinton.news/2016-12-16-hillary-clintons-entire-campaign-was-run-on-fake-news-staged-photo-ops-rigged-debates-puppet-journalists-and-scripted-lines.html", "http://freedom.news/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "http://www.dailymail.co.uk/news/article-4042194/Facebook-fact-checker-arbitrate-fake-news-accused-defrauding-website-pay-prostitutes-staff-includes-escort-porn-star-Vice-Vixen-domme.html", "http://www.truthwiki.org/snopes-snopes-com/", "http://cwclabs.com/Index.html", "http://www.truthwiki.org/politifact-com/", "http://www.naturalnews.com/", "http://www.newstarget.com/", "http://www.thenationalsentinel.com/", "http://freedom.news/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "http://www.dailymail.co.uk/news/article-4042194/Facebook-fact-checker-arbitrate-fake-news-accused-defrauding-website-pay-prostitutes-staff-includes-escort-porn-star-Vice-Vixen-domme.html", "http://clinton.news/2016-12-16-hillary-clintons-entire-campaign-was-run-on-fake-news-staged-photo-ops-rigged-debates-puppet-journalists-and-scripted-lines.html", "http://www.cnn.com/2016/12/15/politics/hillary-clinton-john-podesta-russian-hacking/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html&linkname=Facebook%20to%20use%20actual%20whores%20to%20%E2%80%9Cfact-check%E2%80%9D%20news%3A%20SNOPES%20credibility%20implodes%20under%20shocking%20revelations", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}