{"result_id": "274011", "URL": "https://www.snopes.news/2018-04-27-snopes-caught-being-dishonest-california-bill-seeking-to-criminalize-the-sale-of-bibles.html", "timestamp": "2023-04-25 17:09:29 CEST+0200", "meta": {"description": "In recent days WorldNetDaily reported that Liberty Counsel, a Christian-themed legal assistance group that defends religious and civil rights, warned that a new California bill that has already passed the Assembly would effectively ban the sale of Bibles. The legislation, AB 2943, forbids counselors from telling a gender-confused female that she’s a woman or a […]", "lang": "en", "keywords": "AB 2943,Alt-Left,anti-Christian,Bible,Bible bans,California,Constitutional rights,deception,discrimination,Fact-checking,fake news,far Left,females,insanity,left cult,legislation,LGBTQ ideology,Liberal Mob,Liberty,mainstream media,males,Marxists,propaganda,religious freedom,Snopes,stupid", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2018-04-27-snopes-caught-being-dishonest-california-bill-seeking-to-criminalize-the-sale-of-bibles.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "SNOPES caught being dishonest in its assessment of a California bill seeking to criminalize the sale of Bibles", "cleaned_text": "SNOPES caught being dishonest in its assessment of a California bill seeking to criminalize the sale of Bibles\n\nIn recent days WorldNetDaily reported that Liberty Counsel, a Christian-themed legal assistance group that defends religious and civil rights, warned that a new California bill that has already passed the Assembly would effectively ban the sale of Bibles.\n\nThe legislation, AB 2943, forbids counselors from telling a gender-confused female that she’s a woman or a gender-confused male that he’s a man. Liberty Counsel assessed that the bill “is so far-reaching that it also prohibits printed materials and even books” from saying similar things.\n\nWell, anyone even remotely familiar with the Bible knows that it only recognizes two sexes — male and female — and that it teaches Christians that your sex is determined at birth. If you were born a man you stay a man, and vice-versa for women, today’s sexual confusion notwithstanding.\n\nHow long do you think it will be before the real speech Nazis — California Democrats — ban the Lord’s word because of what the Bible teaches us about sexuality?\n\nThe bill states: “advertising offering to engage in, or engaging in sexual orientation change efforts with an individual” is fraudulent business practice, Liberty Counsel notes.\n\n“If approved, victims of sexual abuse can no longer get counseling if they develop (as often happens) unwanted urges to engage in same-sex behavior or become gender confused,” Liberty Counsel added, noting further that it would “make it unlawful for any person to sell books, including the Bible…that tells them to trust in Jesus Christ to help them overcome same-sex attraction or gender confusion.”\n\nBut Snopes says otherwise.\n\nWND says that it only took the “fact-checker” website, which is known to have a far-Left political bent, to rate such claims as “FALSE.”\n\nWriting at The Federalist, Dr. Robert Gagnon, Ph.D., who was a professor of New Testament at Pittsburgh Theological Seminary, he notes that the Snopes fact-checker uses language and deflection to hide what the legislation will actually do. (Related: Facebook to use actual whores to “fact-check” news: SNOPES credibility implodes under shocking revelations.)\n\n“If you haven’t already lost significant respect for Snopes as an impartial fact-checker, its analysis of a bill that bans all transactions involved in stating Christian beliefs about homosexual behavior should,” he writes.\n\nThe site notes that AB 2943 “does not mention the Bible, Christianity, or religion at all, and any claim that “the legislation would ‘literally’ prohibit the sale of the Bible…is demonstrably false.”\n\nReally? If language in a piece of legislation is written in such an overly broad manner — purposefully — that it could later be construed to include bans on things that are written in the Bible (and thus taught openly, per the First Amendment), why mention specific books and passages?\n\n“Snopes’ insistence that California Assembly Bill 2943 would not result in the Bible being banned in California is akin to Snopes calling ‘demonstrably and clearly false’ the claim that Joseph Stalin killed everyone around him,” wrote Gagnon.\n\n“Indeed, so far as we know, he never personally killed anyone. But he did have a great many people killed (estimates indicate that he was responsible for the deaths of 20 to 25 million people), sent many others to the Gulag, and generally terrorized both his own country and Eastern Europe for decades.”\n\nMeanwhile, Snopes admits that the legislation relates to “gay conversion therapy” and states it’s “not clear whether the text of A.B. 2943 would amount to a blanket prohibition on any and all [Sexual Orientation Change Efforts].”\n\nWhich means that, at some point, the anti-Christian Marxists running the state will get around to banning all materials that dare to mention some obvious physiological truths about the human race: It has two sexes, male and female, and those sexes are determined the moment a baby is conceived.\n\nSnopes is developing quite a reputation — for being just another far-out, uber-Left-wing hack site that is no different than anything else being published by the “mainstream” media.\n\nRead more details about Snopes at Snopes.news.\n\n\n\nJ.D. Heyes is also editor-in-chief of The National Sentinel.", "opengraph": {"title": "SNOPES caught being dishonest in its assessment of a California bill seeking to criminalize the sale of Bibles", "type": "article", "url": "https://www.snopes.news/2018-04-27-snopes-caught-being-dishonest-california-bill-seeking-to-criminalize-the-sale-of-bibles.html", "site_name": "Snopes News", "description": "In recent days WorldNetDaily reported that Liberty Counsel, a Christian-themed legal assistance group that defends religious and civil rights, warned that a new California bill that has already passed the Assembly would effectively ban the sale of Bibles. The legislation, AB 2943, forbids counselors from telling a gender-confused female that she’s a woman or a […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/11/Welcome-To-California-Road-Sign.jpg"}, "tags": ["Liberty", "LGBTQ ideology", "left cult", "deception", "AB 2943", "Bible bans", "males", "females", "discrimination", "Marxists", "Fact-checking", "far Left", "religious freedom", "Bible", "propaganda", "Liberal Mob", "fake news", "stupid", "mainstream media", "anti-Christian", "Snopes", "Constitutional rights", "Alt-Left", "legislation", "insanity", "California"], "tweets": [], "movies": [], "links": ["http://www.wnd.com/2018/04/liberty-counsel-warning-california-about-to-ban-bible-sales/", "https://www.newstarget.com/2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html", "https://www.snopes.com/fact-check/california-bible-ban/", "http://thefederalist.com/2018/04/24/snopes-sneaky-liar-californias-bill-ban-christian-lgbt-talk/", "https://thenationalsentinel.com/2016/12/27/facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations/", "http://Snopes.news", "http://www.thenationalsentinel.com/", "http://www.wnd.com/2018/04/liberty-counsel-warning-california-about-to-ban-bible-sales/", "https://www.newstarget.com/2016-12-20-snopes-which-will-be-fact-checking-for-facebook-employs-leftists-almost-exclusively.html", "http://thefederalist.com/2018/04/24/snopes-sneaky-liar-californias-bill-ban-christian-lgbt-talk/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2018-04-27-snopes-caught-being-dishonest-california-bill-seeking-to-criminalize-the-sale-of-bibles.html&linkname=SNOPES%20caught%20being%20dishonest%20in%20its%20assessment%20of%20a%20California%20bill%20seeking%20to%20criminalize%20the%20sale%20of%20Bibles", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}