{"result_id": "274008", "URL": "https://snopes.news/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "timestamp": "2023-04-25 17:09:20 CEST+0200", "meta": {"description": "Even though it’s now been 100 percent verified that Nathan Phillips, the Native American activist who provoked the Covington Catholic High School boys by banging a drum in one of their faces, did not serve in Vietnam as he’s repeatedly claimed, the fake news “fact-checking” website Snopes continues to claim otherwise. As reported by The […]", "lang": "en", "keywords": "anti-white,Big Tech,Covington,deception,disinfo,Facebook,Fact Check,fake news,Google,Journalism,lies,Misrepresentation,Nathan Phillips,propaganda,racism,search engine,Snopes,Social media,tech giants,Twitter,Vietnam Vet", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://snopes.news/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "encoding": "UTF-8"}, "image": null, "domain": "snopes.news", "title": "SNOPES now a confirmed disinfo propaganda fraud after refusing to correct the facts surrounding fake “Vietnam Vet” Nathan Phillips", "cleaned_text": "SNOPES now a confirmed disinfo propaganda fraud after refusing to correct the facts surrounding fake “Vietnam Vet” Nathan Phillips\n\nEven though it’s now been 100 percent verified that Nathan Phillips, the Native American activist who provoked the Covington Catholic High School boys by banging a drum in one of their faces, did not serve in Vietnam as he’s repeatedly claimed, the fake news “fact-checking” website Snopes continues to claim otherwise.\n\nAs reported by The Daily Caller, Snopes’s “fact-check” page for Nathan Phillips, which asks the question, “Did Nathan Phillips Falsely Claim He Was A Vietnam Veteran?” is still designated as “Unproven,” along with the false claim that Phillips told news outlets “that he was a ‘Vietnam-times’ or ‘Vietnam-era’ veteran.”\n\nOn January 3, Phillips stated unequivocally, “I’m a Vietnam Vet,” adding that he “served in the Marine Corps (from) 72 to 76.” His Facebook page also contains imagery of memorabilia containing the words, “Vietnam War Veteran” – clearly delineating Phillips’ longtime claim that he did, in fact, serve in Vietnam.\n\nWe also now have Phillips’ records, which were bravely dredged up by Former Navy SEAL Don Shipley. These records show that, contrary to an image of a certificate also on Phillips’ Facebook page suggesting that he received a “Medal of Valor,” Phillips was never deployed overseas, and actually went AWOL several times, before eventually becoming a refrigerator repair technician.\n\nAll of this is undeniable, based on the records Shipley and others have unearthed, proving Phillips to be a liar. But Snopes is doubling down on the claim that Phillips never actually claimed to be a Vietnam Vet, and is continuing to try to paint him in a positive light while vilifying the Covington boys.\n\n“Snopes’s fact-check incorrectly labeled it ‘unproven’ that Phillips had falsely claimed to be a Vietnam veteran,” writes Peter Hasson for The Daily Caller. “Snopes declined to change its misleading ruling despite definitive video evidence of Phillips doing exactly that.”\n\nFor more news about how the mainstream media and its lapdog “fact-checking” allies such as Snopes are the number-one purveyors of fake news in 2019, be sure to check out Faked.news.\n\nGoogle, Facebook both caught promoting Snopes’s fake news claim that Phillips didn’t lie about serving in Vietnam – making Snopes’s version of events the TOP search result\n\nAlso complicit in this lying scheme to protect the phony reputation of fake Vietnam Vet Nathan Phillips are none other than Google and Facebook, both of which have propped up Snopes’s “fact-check” lies as the top search item whenever folks try to find out the truth about Phillips.\n\nIn other words, the world’s top search engine and social media platform are continuing to spread fake news about Nathan Phillips being some kind of war hero, when he’s definitively been proven to be a Leftist agitator and racist fraud.\n\nDesperately trying to cover its hide, Snopes did make the following changes to its fact-check page for Phillips:\n\n“It’s difficult to determine at this point whether Phillips has deliberately misrepresented the nature of his service, whether he has been so vague and ambiguous in many of his descriptions (unintentionally or otherwise) that misinterpretations have entered his narrative, or whether he has tried to be accurate but may have just occasionally slipped up in his many, many hours of conversation and sometimes neglected to include the qualifiers about his service that he has used in many other videos and press interviews,” an update to Snopes’s “fact-check” now reads.\n\nBut as pointed out by Hasson, the fact-check isn’t about whether or not Phillips ‘deliberately misrepresented’ his record, it’s about answering the question, “Did Nathan Phillips Falsely Claim He Was A Vietnam Veteran?” – and the answer is yes.\n\n“It’s a fact that Phillips falsely claimed he was a Vietnam veteran,” Hasson states plainly.\n\nRead SNOPES.news for more details on the fake “facts” of this discredited left-wing propaganda organization.", "opengraph": {"title": "SNOPES now a confirmed disinfo propaganda fraud after refusing to correct the facts surrounding fake “Vietnam Vet” Nathan Phillips", "type": "article", "url": "https://www.snopes.news/2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html", "site_name": "Snopes News", "description": "Even though it’s now been 100 percent verified that Nathan Phillips, the Native American activist who provoked the Covington Catholic High School boys by banging a drum in one of their faces, did not serve in Vietnam as he’s repeatedly claimed, the fake news “fact-checking” website Snopes continues to claim otherwise. As reported by The […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2019/01/nathan-phillips-confront-march-for-life.jpg"}, "tags": ["Google", "Journalism", "deception", "lies", "Twitter", "anti-white", "Vietnam Vet", "Fact Check", "Covington", "disinfo", "propaganda", "Big Tech", "fake news", "Nathan Phillips", "tech giants", "Snopes", "Social media", "Facebook", "Misrepresentation", "search engine", "racism"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/news/2019-01-26/snopes-refuses-correct-nathan-phillips-stolen-valor-fact-check-google-facebook", "https://dailycaller.com/2019/01/24/snopes-nathan-phillips-vietnam/", "http://faked.news", "https://www.naturalnews.com/2019-01-24-shady-native-american-hoaxer-nathan-phillips-was-actually-refrigerator-mechanic.html", "https://SNOPES.news", "https://www.zerohedge.com/news/2019-01-26/snopes-refuses-correct-nathan-phillips-stolen-valor-fact-check-google-facebook", "https://dailycaller.com/2019/01/24/snopes-nathan-phillips-vietnam/", "https://www.naturalnews.com/2019-01-24-shady-native-american-hoaxer-nathan-phillips-was-actually-refrigerator-mechanic.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2019-01-30-snopes-now-a-confirmed-disinfo-propaganda-fraud.html&linkname=SNOPES%20now%20a%20confirmed%20disinfo%20propaganda%20fraud%20after%20refusing%20to%20correct%20the%20facts%20surrounding%20fake%20%E2%80%9CVietnam%20Vet%E2%80%9D%20Nathan%20Phillips", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}