{"result_id": "274022", "URL": "https://www.snopes.news/2021-08-17-co-founder-factcheck-site-snopes-suspended-plagiarizing-scandal.html", "timestamp": "2023-04-25 17:09:37 CEST+0200", "meta": {"description": "We’ve told our readers for years that most of the so-called “fact-check” websites are nothing more than left-wing propaganda mills that essentially legitimize information published by the left-wing mainstream media. Now we have additional proof of that. Thanks to an expose by Buzzfeed News (which has been known to tilt left itself), the co-founder of the […]", "lang": "en", "keywords": "David Mikkelson,disinformation,expose,Fact Check,fake news,Journalism,left cult,libtards,lies,news cartels,plagiarism,propaganda,Snopes,stupid,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2021-08-17-co-founder-factcheck-site-snopes-suspended-plagiarizing-scandal.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Co-founder of “fact-check” site Snopes suspended by his own company after being caught in bizarre plagiarizing scandal", "cleaned_text": "Co-founder of “fact-check” site Snopes suspended by his own company after being caught in bizarre plagiarizing scandal\n\nWe’ve told our readers for years that most of the so-called “fact-check” websites are nothing more than left-wing propaganda mills that essentially legitimize information published by the left-wing mainstream media.\n\nNow we have additional proof of that.\n\nThanks to an expose by Buzzfeed News (which has been known to tilt left itself), the co-founder of the original fact-check site, Snopes, has been busted in a massive plagiarism scandal that will all but seal the outlet’s fate as a disinformation operation:\n\nDavid Mikkelson, the co-founder of the fact-checking website Snopes, has long presented himself as the arbiter of truth online, a bulwark in the fight against rumors and fake news. But he has been lying to the site’s tens of millions of readers: A BuzzFeed News investigation has found that between 2015 and 2019, Mikkelson wrote and published dozens of articles containing material plagiarized from news outlets such as the Guardian and the LA Times.\n\nAfter inquiries from BuzzFeed News, Snopes conducted an internal review and confirmed that under a pseudonym, the Snopes byline, and his own name, Mikkelson wrote and published 54 articles with plagiarized material. The articles include such topics as same-sex marriage licenses and the death of musician David Bowie.\n\nDoreen Marchionni, Vice President of Editorial as well as managing editor at Snopes, said she has suspended Mikkelson from writing duties while “a comprehensive internal investigation” is conducted into the allegations. He will remain an officer with the company and a 50-percent shareholder, Buzzfeed News reported.\n\n“Our internal research so far has found a total of 54 stories Mikkelson published that used appropriated material, including all of the stories Buzzfeed shared with us,” Marchionni and Snopes Chief Operating Officer Vinny Green said in a statement.\n\n“Let us be clear: Plagiarism undermines our mission and values, full stop,” Marchionni noted further. “It has no place in any context within this organization.”\n\nOf course not — especially a “fact-check” website.\n\nA letter signed by editors and eight current staff writers added: “We strongly condemn these poor journalistic practices. … we work hard every day to uphold the highest possible journalistic and ethical standards.”\n\nIn the aftermath, Snopes has a lot of clean-up work to do; the editors will be retracting all of the BS stories and will be disabling ads on them. Each story will also be listed with an explanation via ‘editor’s note.’\n\nUnderstand that plagiarizing another writer’s work isn’t just a “lapse in judgment,” it is an intentional act and there are a variety of reasons plagiarists do it.\n\nOne is to make up for a lack of personal writing skills; another might be to sound wiser and more knowledgeable about a subject than the plagiarist really is; still another in this cutthroat 24-7-365 news cycle is speed, and that’s what brought down Mikkelson:\n\nBetween 2015 and 2019, Mikkelson regularly plagiarized reporting from other news outlets in an effort, he said, to scoop up traffic.\n\nIn an interview with BuzzFeed News, Mikkelson attributed this behavior to his lack of formal journalism experience. “I didn’t come from a journalism background,” he said. “I wasn’t used to doing news aggregation. A number of times I crossed the line to where it was copyright infringement. I own that.”\n\nNone of this should surprise anyone, given Mikkelson’s background online, which dates to the early 1990s and the earliest ‘Wild West’ days of the Internet.\n\n“Mikkelson’s alias flies in the face of the site’s mission, once described by the New York Times as ‘a quest to debunk misinformation online,'” Buzzfeed notes.\n\n“It also highlights his penchant for trolling, something he was known for in the early 1990s, when he posted on Usenet forums under the handle ‘snopes.’ At that time, he was so strongly associated with trolling — even tricking advice columnist Ann Landers into running several prank letters — that the practice was sometimes referred to as ‘snoping,'” the outlet continued.\n\nSo, someone who made his name by tricking and trolling suddenly is busted for the most dishonest form of journalism.\n\nWe are not surprised.", "opengraph": {"title": "Co-founder of “fact-check” site Snopes suspended by his own company after being caught in bizarre plagiarizing scandal", "type": "article", "url": "https://www.snopes.news/2021-08-17-co-founder-factcheck-site-snopes-suspended-plagiarizing-scandal.html", "site_name": "Snopes News", "description": "We’ve told our readers for years that most of the so-called “fact-check” websites are nothing more than left-wing propaganda mills that essentially legitimize information published by the left-wing mainstream media. Now we have additional proof of that. Thanks to an expose by Buzzfeed News (which has been known to tilt left itself), the co-founder of the […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2021/08/SNOPES-vice-vixen-whores-David-Mikkelson.jpg"}, "tags": ["plagiarism", "Fact Check", "fake news", "stupid", "left cult", "Journalism", "libtards", "Snopes", "wokies", "David Mikkelson", "expose", "disinformation", "lies", "news cartels", "propaganda"], "tweets": [], "movies": [], "links": ["https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson", "http://snopes.news", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson#statement", "http://www.disinfo.news", "https://www.naturalnews.com/2020-05-21-snopes-the-ultimate-fake-fact-checker.html", "https://www.nytimes.com/2010/04/05/technology/05snopes.html", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson", "https://www.naturalnews.com/2020-05-21-snopes-the-ultimate-fake-fact-checker.html"], "authors": [], "publish_date": null}