{"result_id": "274017", "URL": "https://www.snopes.news/2018-03-05-stupid-snopes-fact-checks-satire-article-that-said-cnn-buys-industrial-washing-machine-to-spin-the-news.html", "timestamp": "2023-04-25 17:09:33 CEST+0200", "meta": {"description": "Here’s more proof that a) liberals have no sense of humor; b) they’re knee-jerk and think with their hearts, not their minds; and c) they are some of the dumbest people you’re ever going to meet. As reported by Paula Bolyard at PJ Media, the speech Nazis at Facebook just threatened a satire site for […]", "lang": "en", "keywords": "Alt-Left,Babylon Bee,Censorship,CNN,demonetization,Facebook,Fact Check,Journalism,left cult,media facts,reduced reach,Snopes,speech Nazis,stupid", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2018-03-05-stupid-snopes-fact-checks-satire-article-that-said-cnn-buys-industrial-washing-machine-to-spin-the-news.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Stupid SNOPES “fact checks” satire article that said CNN buys industrial washing machine to SPIN the news", "cleaned_text": "Stupid SNOPES “fact checks” satire article that said CNN buys industrial washing machine to SPIN the news\n\nHere’s more proof that a) liberals have no sense of humor; b) they’re knee-jerk and think with their hearts, not their minds; and c) they are some of the dumbest people you’re ever going to meet.\n\nAs reported by Paula Bolyard at PJ Media, the speech Nazis at Facebook just threatened a satire site for publishing a satire piece involving CNN that was…satire.\n\nSatire is defined as “Trenchant wit, irony, or sarcasm used to expose and discredit vice or folly; a mode of expression intended to arouse amusement.”\n\nFacebook sent a warning to The Babylon Bee, a Christian-themed satire site, this week after the site’s “independent fact-checkers” at Snopes (yeah, that Snopes) said one of the humorous articles was “false.”\n\nThe warning showed up on the site’s Facebook “Notifications” section; it read:\n\nA page you admin (the Babylon Bee) recently posted the link (CNN Purchases Industrial-Sized Washing Machine To Spin News Before Publication) that contains info disputed by (Snopes.com), an independent fact-checker. Repeat offenders will see their distribution reduced and their ability to monetize and advertise removed.\n\nAdam Ford, who runs the satire site, was left shaking his head.\n\nThe story in question pokes fun at CNN with the headline: “CNN Purchases Industrial-Sized Washing Machine To Spin News Before Publication.” Anyone with even a sliver of a funny bone tucked away behind their appendix would know that it wasn’t a serious news piece, but, alas, the humorless dolts at Snopes had to spell out the obvious.\n\nClaim: CNN invested in an industrial-sized washing machine to help their journalists and news anchors spin the news before publication.\n\n“Although it should have been obvious that the Babylon Bee piece was just a spoof of the ongoing political brouhaha over alleged news media ‘bias’ and ‘fake news,’” explained Snopes, “some readers missed that aspect of the article and interpreted it literally.”\n\nSure. Like the .001 percent of the population that takes Comedy Central’s “The Daily Show” seriously or TheOnion.com, a long-running satire site that recently ran headlines like, “Man Passes Away Surrounded by Knife-Wielding Loved Ones,” and “Dollar Tree To Stop Selling Assault Weapons.”\n\n“What more likely happened is that some trigger-happy activists who don’t appreciate Christian and conservative satires reported The Babylon Bee to Facebook, setting off an investigation by Snopes,” Bolyard noted.\n\nI’d agree with that but also add that the ‘offended’ person doing the reporting was very likely one of CNN’s dwindling number of viewers.\n\nSnopes “fact-checkers” went onto concede that “the site’s footer gives away The Babylon Bee’s nature by describing it as ‘Your Trusted Source for Christian News Satire,’” while explaining further that the site “has been responsible for a number of other (usually religious-themed) spoofs that have been mistaken for real news articles.” (Related: SNOPES caught misleading readers about key facts related to charity funding for John Kerry’s daughter.)\n\nFord told PJ Media that the warning isn’t the first time his site’s been “fact-checked” by Marxist censors at Snopes. “But this is the first time Facebook has used that to threaten us with reduced reach and demonetization,” Ford noted.\n\n“Also, it seems that anyone who clicked on the article got a notice that it was ‘disputed,’” he added.\n\nWell, at least Ford got a notification; The National Sentinel, where I serve as editor-in-chief, had its reach reduced without any notification.\n\nFor his part, Ford took the ‘warning’ in stride, publishing a great piece of follow-up satire with this headline: “Snopes Launches New Website To Fact-Check Snopes Fact Checks.”\n\nHe “reported,” “The new site is called ‘Snopes Snopes,’ and will comb through the original site’s articles in order to label them ‘True,’ ‘False,’ or ‘Clearly Biased,’ assisting readers in discerning fact from fiction on the popular site which claims to debunk urban legends, hoax news stories, and satire.”\n\nToo funny — to everyone but the speech Nazis and haters at Facebook and Snopes, that is. Read Stupid.news for more coverage of raw left-wing stupidity on parade.\n\nJ.D. Heyes is also editor-in-chief of The National Sentinel.", "opengraph": {"title": "Stupid SNOPES “fact checks” satire article that said CNN buys industrial washing machine to SPIN the news", "type": "article", "url": "https://www.snopes.news/2018-03-05-stupid-snopes-fact-checks-satire-article-that-said-cnn-buys-industrial-washing-machine-to-spin-the-news.html", "site_name": "Snopes News", "description": "Here’s more proof that a) liberals have no sense of humor; b) they’re knee-jerk and think with their hearts, not their minds; and c) they are some of the dumbest people you’re ever going to meet. As reported by Paula Bolyard at PJ Media, the speech Nazis at Facebook just threatened a satire site for […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Facebook.jpg"}, "tags": ["Fact Check", "stupid", "Babylon Bee", "media facts", "left cult", "Journalism", "speech Nazis", "Censorship", "Snopes", "CNN", "Alt-Left", "reduced reach", "Facebook", "demonetization"], "tweets": [], "movies": [], "links": ["https://pjmedia.com/faith/facebook-threatens-babylon-bee-cnn-satire-report-snopes-fact-checkers/", "https://www.merriam-webster.com/dictionary/satire", "https://www.newstarget.com/2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html", "https://www.snopes.com/cnn-washing-machine/", "https://TheOnion.com", "https://www.newstarget.com/2017-01-27-snopes-caught-misleading-readers-about-key-facts-related-to-charity-funding-for-john-kerrys-daughter.html", "http://www.thenationalsentinel.com", "https://thenationalsentinel.com/how-to-follow-us/", "http://Stupid.news", "http://www.thenationalsentinel.com/", "http://babylonbee.com/news/snopes-launches-new-website-fact-check-snopes-fact-checks/", "https://thenationalsentinel.com/how-to-follow-us/", "https://www.newstarget.com/2017-01-30-facebook-to-use-actual-whores-to-fact-check-news-snopes-credibility-implodes-under-shocking-revelations.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2018-03-05-stupid-snopes-fact-checks-satire-article-that-said-cnn-buys-industrial-washing-machine-to-spin-the-news.html&linkname=Stupid%20SNOPES%20%E2%80%9Cfact%20checks%E2%80%9D%20satire%20article%20that%20said%20CNN%20buys%20industrial%20washing%20machine%20to%20SPIN%20the%20news", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}