{"result_id": "274006", "URL": "https://www.snopes.news/2017-11-30-about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand.html", "timestamp": "2023-04-25 17:09:19 CEST+0200", "meta": {"description": "In an obscure interview back in 1956, the entertainer Elvis Presley was quoted as saying: “Don’t criticize what you don’t understand, son. You never walked in that man’s shoes.” But But none of Elvis’s many song-writers ever wrote a song that included that wonderful truism. (Article by Dr. Gary G. Kohls republished from GlobalResearch.ca) However, Bob Dylan, in his iconic “The Times […]", "lang": "en", "keywords": "adverse events,Dangerous Medicine,harmful medicine,Medicine,neurotoxicity,toxic chemicals,toxicity,vaccine,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-11-30-about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "About the science of vaccine neurotoxicity: “Don’t criticize what you can’t understand”", "cleaned_text": "About the science of vaccine neurotoxicity: “Don’t criticize what you can’t understand”\n\nIn an obscure interview back in 1956, the entertainer Elvis Presley was quoted as saying: “Don’t criticize what you don’t understand, son. You never walked in that man’s shoes.” But But none of Elvis’s many song-writers ever wrote a song that included that wonderful truism.\n\nHowever, Bob Dylan, in his iconic “The Times They Are A-Changing” (1962), immortalized the phrase. It is not likely that Dylan stole the phrase from one of Presley’s songs because Elvis once admitted: “I’ve never written a song in my life.”\n\nDylan’s poetic truism has always stayed with me. To remind readers of its power, here is the fourth verse of that song:\n\nThere is a surge of anti-intellectualism and anti-science belief systems in the United States. People who know nothing about climate science are ridiculing altruistic climate scientists who know what they are talking about.\n\nRespected, unbiased scientists (those who are not in the back pockets of the fossil fuel and coal industries) are fulfilling their moral duty to warn the rest of us about the imminent danger of potentially unstoppable – and catastrophic – warming of the planet, a reality that could easily make the planet unlivable for animal life in the near future (like the gradually expanding Sahara Desert has been exhibiting for us for years).\n\nUnbiased geological scientists, scholars and assorted well-informed citizen activists (at least those who have not been hired and thus co-opted by Big Mining) understand the potentially catastrophic dangers of sulfide mining that is threatening my home state of Minnesota. These altruistic scientists and citizen activists are being viciously demonized (even with death threats) by some folks who happen to live in the boom-and-bust (non-sulfide) iron ore country that now has commercially-viable copper sulfide ore deposits in the water-rich part of the state.\n\nTruly unbiased geological scientists know what they are talking about when they try to explain to the uninformed that copper appears in nature as a copper sulfide ore which, when ground into the fine powder (that is an essential part of the extraction process) leaves behind many highly poisonous waste metals (including the toxic metals lead, arsenic, cadmium, vanadium, antimony, manganese and mercury) PLUS sulfuric acid when the liquid mine slurry is pumped into the permanently toxic tailings ponds (which will be stored for an eternity in nearby dumps that are just waiting for the inevitable deluge of rain that could melt and burst the earthen dams and permanently destroy the watershed, lakes and inhabited river communities downstream.\n\nSulfuric acid, it needs to be understood, is inevitably formed when waste sulfide tailings are exposed to water and air, thus making any abandoned sulfide mining open pit poisonous to every living thing, especially humans, fish and water birds.\n\nAnd then there is the pure science that is coming from truly unbiased scientists (pharmacological, chemical, medical, neuroscientists, etc) who know what they are talking about when it comes to the obvious dangers of America’s over-vaccination agendas for vulnerable babies, children, soldiers and the elderly.\n\nAnd here is where the CDC, the FDA, the NIH, the IOM, the WHO and various trade associations and Big Pharma lobbying groups (like the AAP, the AMA, the AAFP and even the OB-GYN trade groups) are involved. Whereas these groups hide their financial and professional relationships with Big Pharma, they feel obligated to also hide the many reasons that their unholy alliances with corporate elites have been doing so much damage to their patients, to whom they have pledged to “first do no harm.”\n\nSo the common denominator for the examples listed above (and below) is that those politicians and cunning special interest groups – who have been co-opted and/or duped by well-funded front groups that are denying the unbiased, provably true science and are “criticizing what they don’t understand”.\n\nBelow are a number of other recent publications outlining examples from non-corporate-controlled medical journals that never gets aired in the largely corporate-controlled mainstream print media or discussed in a fair and balanced manner on the largely corporate-controlled television or radio stations.\n\nAny true scientist (or person with an open mind and no conflicts of interest) who values the Precautionary Principle, the Hippocratic Oath and the principle of Fully Informed Consent will surely pause to consider the veracity of the following journal articles that validate (AGAIN) the testimony of the hundreds of thousands of vaccine-injured or vaccine-killed American children and soldiers (especially the parents who now have understandably lost any trust in the medical profession, certain governmental agencies the pharmaceutical industry).\n\nAlso validated are the many researchers that know (and are trying to warn patients) about the many neurotoxic ingredients and contaminants that are in all of the cocktails of intramuscularly-administered infant vaccines – inoculations which are causing (or at least contributing to) the epidemics of childhood and young adult neurodevelopmental disorders that were uncommon prior to America’s over-vaccination era that began with a vengeance after the Reagan administration in 1986 made it illegal for the parents of vaccine-were responsible.\n\nAnd thus, any ethical medical profession, which claims to value the Hippocratic Oath and the Informed Consent principle, should be immediately ordering a moratorium on the current over-vaccination schedules so vigorously promoted and defended by the CDC, the FDA, the AMA, the IOM, and the AAP – until the evidence is fully re-examined by unbiased investigators. Any such re-assessment should obviously involve no Big Pharma shills’ no CDC or FDA or AAP ”experts”; no co-opted pediatricians who benefit financially from over-vaccinating their patients; no academic physicians with financial ties to Big Pharma; no lobbyists;, no politicians who have taken campaign bribes from Big Pharma; no journalists who write pro-vaccine articles;, AND no Big Pharma-paid trolls (such as those that blog at sciencebasedmedicine.org, scienceblogs.com, snopes.com, retractionwatach.com, sciencemag.org, skeptic.com, etc, most of whom seem to be given preferential positions on the first two pages of Google’s search engine when Big Pharma is threatened by unwelcome truth.\n\nIt is a near certainty that the AMA, the AAP, the IOM – and the recent critics of this column’s statements of scientific fact regarding the many dangers of the neurotoxicity of America’s over-vaccination programs – have little or no knowledge of the following research studies that totally debunk their claims that all vaccines are both safe and effective and that Big Medicine and Big Pharma can be trusted to implement their over-vaccination agendas, even to the point of forcibly vaccinating people against their wills.\n\nEvery Human Vaccine Tested Was Contaminated by Unsafe Levels of Metals and Debris Linked to Cancer and Autoimmune Disease, New Study Reports\n\n(Ed note: This article is a commentary on: the International Journal of Vaccines and Vaccination Vol 4 Issue 1, 2017, which was entitled: The author of the study was Antonietta Gatti, PhD and it was published on Jan 23, 2017. The original article can be found at: http://medcraveonline.com/IJVV/IJVV-04-00072.pdf\n\nResearchers examining 44 samples of 30 different vaccines found dangerous contaminants, including in one vaccine and in every single sample tested – except in one animal vaccine.\n\nUsing extremely sensitive new technologies not used in vaccine manufacturing, Italian scientists reported they were “baffled” by their discoveries which included single particles and aggregates of organic debris including red cells of human or possibly animal origin and metals including , that have been linked to autoimmune disease and leukemia.\n\nIn the study, published this week in the International Journal of Vaccines and Vaccination, the researchers led by Antonietta Gatti, of the National Council of Research of Italy and the Scientific Director of Nanodiagnostics, say their results “show the presence of micro- and nano-sized particulate matter composed of inorganic elements in vaccine samples” not declared in the products’ ingredients lists.\n\nparticles were found in the cervical cancer vaccines, Gardasil and Cervarix, for example, and in the seasonal flu vaccine Aggripal manufactured by Novartis as well as in the Meningetec vaccine meant to protect against meningitis C.\n\nSamples of an infant vaccine called Infarix Hexa (against diphtheria, tetanus, pertussis, hepatitis B, poliomyelitis and haemophilus influenzae type B) manufactured by GlaxoSmithKline was found to contain aggregate.\n\nOther metal contaminants included . (alone or in alloy with ) was identified in 25 of the human vaccines from Italy and France that were tested.\n\nGSK’s Fluarix vaccine for children three years and older contained . Similar aggregates to those identified in the vaccines have been shown to be prevalent in cases of leukemia, the researchers noted.\n\nMany of the vaccines contained which, according to the researchers, “can corrode and the corrosion products exert a toxicity affecting the tissues”.\n\nThe researchers supply an image of an area in a drop of Sanofi Pasteur MSD’s Repevax vaccine (diphtheria, pertussis, tetanus, polio combined) “where the morphology of red cells – we cannot tell whether they are human or animal- is clearly visible” along with the presence of “debris” composed of .\n\nFeligen, the only veterinary vaccine tested in the 44 total vaccines sampled, proved to be the only sample free from inorganic contamination.\n\nThe Role of Heavy Metals in Autoimmunity\n\n“The toxic metals cadmium, lead, mercury, and aluminum may interact metabolically with nutritionally essential metals. Iron deficiency increases absorption of cadmium, lead, and aluminum. Cadmium and aluminum interact with calcium. Lead replaces zinc on heme enzymes and cadmium has the potential to replace zinc.”\n\n“…metals have the potential to induce or promote the development of autoimmunity in man. The molecular, biochemical, and cellular events involved in the induction of metal-induced autoimmunity are still unclear. Exposure to heavy metals may result in autoimmune responses to various self-antigens as well as autoimmune diseases.”\n\nFrom the Journal of Translational Science (JTS) – April 24, 2017\n\nPilot Comparative Study on the Health of Vaccinated and Unvaccinated 6- to 12-year old US Children\n\nVaccinated children were significantly more likely than the unvaccinated to have been diagnosed with the following chronic illnesses:\n\n3.7-fold higher odds of any neurodevelopmental disorder (i.e., learning disability, ADHD, or ASD)\n\nNo significant differences were observed with regard to cancer, chronic fatigue, conduct disorder, Crohn’s disease, depression, Types 1 or 2 diabetes, encephalopathy, epilepsy, hearing loss, high blood pressure, inflammatory bowel disease, juvenile rheumatoid arthritis, obesity, seizures, and Tourette’s syndrome.\n\nA cross-sectional study of mothers of children educated at home was carried out in collaboration with homeschool organizations in four U.S. states: Florida, Louisiana, Mississippi and Oregon. Mothers were asked to complete an anonymous online questionnaire on their 6- to 12-year-old biological children with respect to pregnancy-related factors, birth history, vaccinations, physician-diagnosed illnesses, medications used, and health services. NDD, a derived diagnostic measure, was defined as having one or more of the following three closely-related diagnoses: a learning disability, Attention Deficient Hyperactivity Disorder, and Autism Spectrum Disorder. A convenience sample of 666 children was obtained, of which 261 (39%) were unvaccinated.\n\nThe vaccinated were less likely than the unvaccinated to have been diagnosed with chickenpox and pertussis, but more likely to have been diagnosed with pneumonia, otitis media, allergies and NDD. After adjustment, vaccination, male gender, and preterm birth remained significantly associated with NDD.\n\nHowever, in a final adjusted model with interaction, vaccination but not preterm birth remained associated with NDD, while the interaction of preterm birth and vaccination was associated with a 6.6-fold increased odds of NDD (95% CI: 2.8, 15.5).\n\nIn conclusion, vaccinated homeschool children were found to have a higher rate of allergies and NDD than unvaccinated homeschool children. While vaccination remained significantly associated with NDD after controlling for other factors, preterm birth coupled with vaccination was associated with an apparent synergistic increase in the odds of NDD. Further research involving larger, independent samples and stronger research designs is needed to verify and understand these unexpected findings in order to optimize the impact of vaccines on children’s health.\n\nNote in the following two American graphs that deaths from both measles and whooping cough had declined by 98% prior to either a measles or whooping cough vaccine being available, thus exposing the lie that vaccinations deserved the credit for eliminating the threats of childhood infectious diseases. Similar graphs are available for other childhood infectious diseases. The truth is that improved sanitation, nutrition, public health measures, refrigeration, safer drinking water, etc were responsible for the decline in mortality and not the vaccines.\n\nWhat to do if your child dies after a vaccination: A Parent’s Guide\n\nThere are 271 New Vaccines in Big Pharma’s Pipeline: Into Whose Bodies Will They be Injected?\n\n1) The AMA Further Besmirches its Once Honored Reputation in American Medicine and Science (by Scandalously Proclaiming that the Cocktails of Neurotoxic [“Unavoidable Unsafe”] Vaccine Ingredients – Aluminum, Mercury and Live Viruses – Need NOT be Further Investigated by Independent Scientists)!!\n\nBy Dr David Brownstein (excerpts from his “AMA Opposes Vaccine Research – A Reply”)\n\n“The combined and cumulative effects of 55 shots, 209 vaccine antigens, 525 mcg of mercury and 13,425 mcg of aluminum that have been injected into a child by 18 years of age in accordance with the CDC’s 2017 childhood immunization schedule has never been examined. In fact, it has never even been questioned.” – David Brownstein, MD\n\nThe American Medical Association (AMA) has released a position statement that opposes the creation of a new federal commission on vaccine safety whose task is to study the association between autism and vaccines.\n\n“The AMA fully supports the overwhelming body of evidence and rigorous scientific process used by the Advisory Committee on Immunization Practices which demonstrate vaccines are among the most effective and safest interventions to both prevent individual illness and protect the health of the public,” William E. Kobler, MD said in a statement. Dr. Kobler is a member of the AMA Board of Trustees.\n\nAutism is occurring at epidemic rates. We now have over 1,000,000 U.S. children diagnosed with autism. Something in our environment is responsible for causing the autism epidemic. It is not due to genetics. Could it be the increasing numbers of vaccines given to our children? Why wouldn’t any rational person want to study this association? A simple study comparing vaccinated with unvaccinated children could help decide whether vaccines are responsible for causing the autism epidemic. But, the Powers-That-Be, like the AMA, do not want this study done as it may turn their world upside down.\n\nIn response to the AMA edicts supporting more vaccines and stating that no further research is needed, I and my colleagues have released a reply to the AMA letter.\n\nSince 1996, the U.S. Federal Highway Administration (FHWA) has led a concerted effort on driver safety. Its excellent results reduced highway fatalities by 50 percent, per 100,000 licensed drivers, from 23.21 down to 15.26 in 2014.(1)\n\nOver the same period, autism cases per 100,000 have skyrocketed from 2.1 to 25.8 cases, or from 1 in 500 (1995) to 1 in 68 babies born in 2014, more than a seven-fold increase. (2)\n\nIf those statistics aren’t damning enough, for the first time since 1993, U.S. “life expectancy” has declined(3) and a HHS-sponsored study in 2011 reported that nearly 43% of US children (32 million) had at least 1 of 20 chronic health conditions (including the autoimmune epidemic), increasing to 54.1% when overweight, obesity, or being at risk for developmental delays are included.(4)\n\nOf course, we are supposed to believe that the dramatic spike in childhood illness and cases of autism has nothing to do with tripling of the number of vaccines on the CDC’s Childhood Immunization Schedule between 1996 and 2017.(5,6) It should be obvious that such a powerful correlation should be examined. But it is not being investigated.\n\nHow can the FHWA get safety so right, but the three federal agencies tasked with the safeguarding of the health of U.S. citizens—the CDC, the NIH, and FDA—get safety so wrong?\n\nThat begs the question, where is the American Medical Association (AMA) demanding more research to determine why our children are suffering through an autism epidemic?\n\nOne answer: Big Pharma-funded professional organizations, like the AMA and the American Academy of Pediatrics (AAP), have gone to great lengths to ensure that vaccine safety remain in the hands of policymakers (who are largely influenced, either financially by Big Pharma or because of professional loyalty to their subspecialty lobbying groups); they have systematically blocked the efforts of investigations by independent scientists.\n\nDeep Flaws Within the Three Letter Agencies\n\nThe AMA’s view on vaccine safety—that the status quo is fine and needs no changes—runs counter to the evidence. None of the three-letter agencies are capable of ensuring vaccine safety. The entire system of checks and balances has been so upended that safety, quality control, and quality assurance within the U.S. immunization program has been completely compromised. The flaws are so deep and pervasive that nothing short of a total overhaul should be undertaken. Soon, the crumbling edifice of “vaccine safety” will collapse under its own weight. So how can the AMA condone “flawed science” and “political manipulation” at the CDC, the NIH, FDA, and within the IOM? Does the AMA believe the echolalia repetition of “safe and effective” is the same as “science-based evidence?” Why does the AMA continue to condone the CDC’s efforts, even after the domestic (Dr. William Thompson whistleblower(7) and international (Danish scientist Poul Thorsen(8,9) fraudulent science studies have been exposed?\n\nOn June 19, AMA News senior staff writer, Sara Berg, published an Opinion: “AMA backs evidence-based vaccine policy, opposes new commission.”\n\nFor many doctors, lawyers, professionals, advocates, and parents of autistic and chronically ill children, we stand against the AMA and the rest of our severely broken, corrupt system of government organizations. They have done nothing as an entire generation of children has spiraled down in a litany of debilitating illnesses, more than at any time in human history.\n\nVaccines are currently advocated for the elderly, the infirm, all adults, all pregnant women and their fetuses, and all children of all ages, including preemies and micro-preemies. The standards of vaccine safety must be closely examined. Vaccine trials are only interested in the development of an antibody after a muscle has been injected with foreign matter. The combined and cumulative effects of 55 shots, 209 vaccine antigens, 525 mcg of mercury and 13,425 mcg of aluminum that have been injected into a child by 18 years of age in accordance with the CDC’s 2017 childhood immunization schedule has never been examined. In fact, it has never even been questioned.\n\nThe AMA’s blathering that, “physicians remain concerned that the current federal administration may attempt to establish new vaccine policy based on unfounded and unscientific facts” is a red herring. It is meant to distract from the current state of poor health experienced by today’s children.\n\nA new, fully transparent Vaccine Safety Commission must be formed. With nearly 250 vaccines in the developmental pipeline,(11) examining the safety of injections cannot be overstated. The three-letter agencies, which would subvert this effort, are clearly looking through tainted rose-colored glasses intent on protecting the status quo.\n\nWe call on Dr. Kobler and the AMA to a public discussion of, and if necessary, debate on vaccine safety issues.", "opengraph": {"title": "About the science of vaccine neurotoxicity: “Don’t criticize what you can’t understand”", "type": "article", "url": "https://www.snopes.news/2017-11-30-about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand.html", "site_name": "Snopes News", "description": "In an obscure interview back in 1956, the entertainer Elvis Presley was quoted as saying: “Don’t criticize what you don’t understand, son. You never walked in that man’s shoes.” But But none of Elvis’s many song-writers ever wrote a song that included that wonderful truism. (Article by Dr. Gary G. Kohls republished from GlobalResearch.ca) However, Bob Dylan, in his iconic “The Times […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/10/Vaccine-3-Ampoules-Ampule-Background-Biotechnology-Bottle.jpg"}, "tags": ["Medicine", "neurotoxicity", "toxicity", "harmful medicine", "vaccine", "adverse events", "vaccines", "toxic chemicals"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand/5598573", "http://duluthreader.com/articles/2016/12/14/8500_lessons_from_the_most_toxic_open_pit_copper_mine", "http://medicalveritas.org/dirty-vaccines-new-study-reveals-prevalence-of-contaminants/", "http://medcraveonline.com/IJVV/IJVV-04-00072.pdf", "http://www.intmed.ro/attach/rjim/2014/rjim314/art09.pdf", "http://oatext.com/Pilot-comparative-study-on-the-health-of-vaccinated-and-unvaccinated-6-to-12-year-old-U-S-children.php", "http://www.oatext.com/Pilot-comparative-study-on-the-health-of-vaccinated-and-unvaccinated-6-to-12-year-old-U-S-children.php#Article", "http://www.globalresearch.ca/wp-content/uploads/2017/07/deaths-from-vaccines.png", "http://www.globalresearch.ca/wp-content/uploads/2017/07/death-from-vaccines-2.png", "http://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "http://www.globalresearch.ca/wp-content/uploads/2017/07/vaccine-consent-form.jpg", "http://sanevax.org/a-parents-guide-what-to-do-if-your-child-dies-after-vaccination/", "http://www.vaccinationcouncil.org/2011/06/01/vaccines-and-brain-inflammation/", "http://www.greenmedinfo.com/blog/roll-your-sleeves-folks-271-new-vaccines-big-pharma-s-pipeline", "http://blog.drbrownstein.com/", "http://blog.drbrownstein.com/", "https://wire.ama-assn.org/ama-news/ama-backs-evidence-based-vaccine-policy-opposes-new-commission", "https://www.globalresearch.ca/about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand/5598573", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-11-30-about-the-science-of-vaccine-neurotoxicity-dont-criticize-what-you-cant-understand.html&linkname=About%20the%20science%20of%20vaccine%20neurotoxicity%3A%20%E2%80%9CDon%E2%80%99t%20criticize%20what%20you%20can%E2%80%99t%20understand%E2%80%9D", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}