{"result_id": "274030", "URL": "https://www.snopes.news/2017-10-31-nyc-truck-terrorist-anti-american-ideology-left-wing-media-deranged-celebrities.html", "timestamp": "2023-04-25 17:09:43 CEST+0200", "meta": {"description": "I’m saying prayers tonight for all those innocent people in New York who were killed or injured by today’s ISIS terrorism attack. I also wonder at what point the deranged left-wing media will stop denying the existence of radical ISIS terrorism in America. The answer to that, of course, is more sinister than you might […]", "lang": "en", "keywords": "anti-America,hatred,intolerance,ISIS,Left-wing,liberals,mainstream media,NYC,Radicalism,terrorist attack,terrosits", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-10-31-nyc-truck-terrorist-anti-american-ideology-left-wing-media-deranged-celebrities.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "NYC truck terrorist shares the same anti-American ideology as left-wing media outlets and deranged Hollywood celebrities", "cleaned_text": "NYC truck terrorist shares the same anti-American ideology as left-wing media outlets and deranged Hollywood celebrities\n\nI’m saying prayers tonight for all those innocent people in New York who were killed or injured by today’s ISIS terrorism attack. I also wonder at what point the deranged left-wing media will stop denying the existence of radical ISIS terrorism in America.\n\nThe answer to that, of course, is more sinister than you might imagine: The left-wing media refuses to acknowledge the existence of radical ISIS terrorism for the simple reason that ISIS terrorism and left-wing media ideology are practically identical.\n\nWhat deranged terrorist Sayfullo Saipov carried out today in NYC — after being allowed into the United States under Sen. Chuck Schumer’s “Diversity Visa” program — is merely an extension of what Leftists across social media and the mainstream media have been preaching since the day Donald Trump got elected President:\n• The New York Times openly sponsored a public play that depicted the violent assassination of President Trump. And they didn’t see anything wrong with this, either.\n• The Washington Post published an op-ed that called for more violence in the streets to oppose (and eventually overthrow) President Trump.\n• The owner of the Washington Post, Amazon founder Jeff Bezos, openly traffics in (and profits from) Antifa terrorism gear.\n• Encouraged by the deranged left-wing media, America’s universities have now been transformed into terrorist training hubs that recruit, train and deploy active terrorism cells across America.\n• CNN ran a story that appeared to openly encourage someone to assassinate President Trump, hoping that an Obama cabinet member would take over as president.\n• Numerous mainstream media outlets have repeatedly called for a violent uprising against Trump and his supporters.\n• Other mainstream media outlets intentionally stoke hatred and division across America, fanning the flames of violence against innocents.\n• Left-wing icon Kathy Griffin mirrored ISIS terrorism tactics by depicting the bloody, decapitated head of Donald Trump in a sick, deranged photo… and was widely celebrated by many Leftists on social media for doing so.\n• Not long ago, extreme left-wing Hollywood liberal George Clooney donated $1 million to a radical hate group that preaches hatred and intolerance against Christian groups.\n• Fanning the flames even more, Whoopi Goldberg declared that Christians are just as dangerous as radical Muslims, attempting to equate Christians with ISIS terrorism.\n• The extreme anti-American hatred pushed by the left-wing media has already resulted in at least one mass assassination attempt against a Republican congressman.\n• Liberal college students have penned student newspaper articles calling for conservative speakers to be executed in order to silence them before they can utter “offensive” speech. (“Offensive” is defined as anything the students don’t want to hear.)\n• Some student groups are now openly resorting to terror-style tactics to demand concessions from universities, including an end to homework.\n• Left-wing terrorist groups like Antifa are openly calling for extreme acts of violence to be carried out against white people and Trump supporters.\n• Numerous radical left-wing groups repeatedly call for law enforcement officers to be executed, and they achieved precisely this outcome last year in Dallas, Texas.\n• CNN recently labeled 900 conservative organizations — including churches — “hate groups” and effectively called for violence to be committed against their members.\n• The left-wing media systematically attacks America as a racist, unjust nation that must be overthrown, discredit or destroyed from within.\n• The hatred from the Left is so out of control that a pro-Democrat group recently released a campaign ad that depicted white Trump supporters running over Muslims with a pickup truck.\n\nAs I wrote a year ago in an article entitled, “America cannot HEAL until we stop the left wing media HATE“:\n\n[T]he left wing media is now the single greatest cause of psychological stress and mental illness in America. While Hillary Clinton’s campaign slogan was “Stronger Together,” the mainstream media has decided to pursue a campaign of division, sabotage and hate… It’s now obvious to me that America cannot HEAL until we stop the left wing media HATE machine … the presstitutes obediently play their twisted roles in deceiving and psychologically traumatizing American voters to achieve the political goals of their puppet masters.\n\nIf this truck terrorism attack had targeted Trump supporters, Leftists would be celebrating it as a great victory\n\nLet’s be honest about this NYC truck terror attack. If it had taken place in a town full of Trump supporters, many members of the deranged Left in America would be celebrating this attack. Kathy Griffin, after all, already showed the world what she really thinks should happen to Donald Trump and his supporters. She might as well be driving the truck herself:\n\nRemember: Left-wing ideology in America now almost perfectly mirrors the anti-American hatred, viciousness and homicidal intentions that were just demonstrated by a deranged ISIS terrorist who killed innocent people in order to make a political statement. That intention is identical to the philosophy of the political Left in America today which believes in using death, violence, intimidation and bullying to achieve their own political goals (at any cost). Leftism, in other words, has morphed into a kind of cult-like political fundamentalism that abandons logic, reason, ethics and morality to achieve its desired political goals by any means.\n\nIn fact, one such group is literally called “By Any Means Necessary” and is openly calling for an armed communist revolution on U.S. soil to overthrow the Republic, execute all conservatives and install a communist regime to power. This left-wing group, dubbed “BAMN,” simply labels all its political opponents as “fascists” then declared “Kill all the fascists!”\n\nTheir logic, of course, is identical to the logic of the Third Reich.\n\nConclusion: The left-wing media is engaged in “journo-terrorism” … and deranged left-wing cultists have been transformed into violent extremists inspired by ISIS tactics\n\nNearly a year ago, I coined the term “journo-terrorism” to describe the left-wing media’s deliberate effort to push hatred, intolerance and violence across America.\n\nNow, attacks like today’s truck terrorism in NYC show the fruits of the media’s insidious efforts. As I wrote last year:\n\nThese people are, of course, clinically delusional. Their minds have been programmed with so many layers of disinformation and fear that they can no longer recognize the difference between what’s real vs. fiction. They are trapped in a mental prison of fear, carefully constructed by the leftist media for the sole purpose of exerting absolute control over the psychology of the electorate.\n\nLeftists who watch MSNBC, in other words — and Rachel Maddow in particular — have been swept into an orchestrated psyop (psychological operation) that might as well be called “journo-terrorism.”\n\nThe key terrorists in this propaganda assault on the American psyche include not just Rachel Maddow but people like Michael Moore, Anderson Cooper and George Stephanopoulos. Each of these people is, in their own way, simultaneously an info-terrorist and a social engineer.\n\nTheir job in the leftist ecosystem of psychological warfare is to unleash vast fields of mental landmines that innocent American stumble into, setting them off and blasting apart their cognitive constructs. Once the old belief systems are eliminated, new beliefs are inserted through “info-doctrination” — i.e. repeated, daily news streams consisting of fear and lies that create “trigger conditions” in the minds of those being hypnotized.\n\nIt’s fascinating that planting actual land mines on battlefields is often considered a “crime against humanity,” but when journo-terrorists plant cognitive land mines across the psychological battlefield of America, it’s all “fact checked” into reality by Politifact, Snopes or the Washington Post. Suddenly the land mines are perfectly acceptable to the leftists. It is these land minds that are right now responsible for the massive psychological trauma being experienced by the crying, wailing leftists whose brains have been shattered by journo-terrorism from MSNBC, CNN, the NYT, the LA Times and so on.\n\nAccording to the Left, the only thing wrong with the NYC terrorism attack is that it targeted the wrong people\n\nThe left-wing media, of course, doesn’t really want the violence to end at all. They just want it to be redirected at President Trump and his supporters. After all, the Left in America today openly endorses violence, encourages violence, fantasizes about violence — remember Madonna saying she dreamed about blowing up the White House? — and frequently carries out violence against their political enemies. The only thing they really regret about the NYC terrorist attack is that, in their minds, the wrong people were mowed down.\n\nIf the dead had all been Trump supporters, left-wing media reporters would be portraying Sayfullo Saipov as an American hero “victim” who was forced to fight back against the “system of oppression and injustice” that white people have constructed for America, you see. That’s their logic, and that’s how deranged and dangerous the left-wing media has actually become to us all. According to the Left, terrorism tactics are perfectly okay as long as they kill the “right” people, you see.\n\nRead more truth about the Left’s hatred and violence at Intolerance.news.", "opengraph": {"title": "NYC truck terrorist shares the same anti-American ideology as left-wing media outlets and deranged Hollywood celebrities", "type": "article", "url": "https://www.snopes.news/2017-10-31-nyc-truck-terrorist-anti-american-ideology-left-wing-media-deranged-celebrities.html", "site_name": "Snopes News", "description": "I’m saying prayers tonight for all those innocent people in New York who were killed or injured by today’s ISIS terrorism attack. I also wonder at what point the deranged left-wing media will stop denying the existence of radical ISIS terrorism in America. The answer to that, of course, is more sinister than you might […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/terrorists.jpg"}, "tags": ["terrorist attack", "terrosits", "anti-America", "hatred", "mainstream media", "intolerance", "liberals", "Radicalism", "Left-wing", "ISIS", "NYC"], "tweets": [], "movies": [], "links": ["http://www.thegatewaypundit.com/2017/10/breaking-multiple-people-shot-man-runs-pedestrians-nyc-graphic-video/", "http://terrorism.news", "http://www.thegatewaypundit.com/2017/10/manhattan-terrorist-sayfullo-saipov-entered-u-s-chuck-schumers-diversity-visa-program/", "http://www.trump.news/2017-06-15-journo-terrorism-new-york-times-now-openly-sponsoring-a-public-depiction-of-the-assassination-of-president-trump.html", "http://www.trump.news/2017-08-17-start-throwing-rocks-washington-post-op-ed-calls-for-more-violence-in-the-streets-time-to-arrest-washpost-editors.html", "http://intolerance.news/2017-08-30-the-owner-of-the-washington-post-trafficks-in-antifa-hate-gear.html", "https://antifa.news/2017-09-10-americas-universities-now-becoming-terrorist-training-hubs-as-antifa-recruitment-accelerates-on-campus.html", "http://trump.news/2017-01-19-treasonous-fake-news-outlet-cnn-appears-to-encourage-trump-assassination-to-point-out-that-an-obama-cabinet-member-would-take-over-as-president.html", "https://newstarget.com/2017-08-31-why-is-the-mainstream-media-calling-for-even-more-violence-in-the-streets-because-the-left-profits-from-it.html", "https://newstarget.com/2017-08-19-mainstream-media-stoking-hatred-and-division-by-calling-for-more-violence-against-patriotic-americans.html", "http://celebrityreputation.com/2017-06-05-kathy-griffin-joins-long-list-of-deranged-democrats-who-need-to-be-immediately-taken-into-custody-for-psychiatric-evaluation.html", "https://intolerance.news/2017-09-07-george-klooney-just-donated-1-million-to-a-radical-hate-group-that-spreads-hatred-and-false-accusations-worldwide.html", "http://www.celebrityreputation.com/2015-11-23-whoopi-goldberg-says-christians-are-as-dangerous-as-muslims-citing-hitler-as-an-example.html", "https://newstarget.com/2017-06-21-recent-attack-against-republican-congressmen-make-clear-violent-left-is-new-domestic-terrorism-threat-be-aware-be-prepared.html", "http://www.libtards.news/2017-02-08-berkeley-unveils-the-new-dangerous-logic-of-the-deranged-left-if-they-disagree-with-you-they-have-right-to-kill-you.html", "https://www.libtards.news/2017-05-13-black-student-groups-now-resorting-to-terrorism-tactics-to-make-insane-demands-from-university-administrators.html", "https://antifa.news/2017-10-01-antifa-video-footage-kill-zone-murdered.html", "https://www.naturalnews.com/054593_Dallas_police_mass_shooting_leftist_media.html", "http://intolerance.news/2017-08-28-cnn-now-labeling-900-conservative-organizations-hate-groups-thanks-to-radical-left-wing-propaganda-of-the-southern-poverty-law-center.html", "http://www.breitbart.com/big-government/2017/10/31/gillespie-campaign-condemns-sickening-latin-victory-ad-all-out-attack-people-virginia/", "https://www.naturalnews.com/056039_healing_America_left_wing_media_HATE_machine.html", "https://www.naturalnews.com/055998_journo-terrorism_left-wing_media_hypnotic_control.html", "http://Intolerance.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-10-31-nyc-truck-terrorist-anti-american-ideology-left-wing-media-deranged-celebrities.html&linkname=NYC%20truck%20terrorist%20shares%20the%20same%20anti-American%20ideology%20as%20left-wing%20media%20outlets%20and%20deranged%20Hollywood%20celebrities", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}