{"result_id": "274018", "URL": "https://snopes.news/2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html", "timestamp": "2023-04-25 17:09:34 CEST+0200", "meta": {"description": "In an attempt to fulfill their promise made back in December to crack down on so-called “fake news,” Facebook has begun to mark content they deem unsubstantiated as “disputed.” Tech new website Recode reports that these stories will now contain a message saying that the selected article has been disputed by its fact checkers, and […]", "lang": "en", "keywords": "CNN,Facebook,fake news,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://snopes.news/2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html", "encoding": "UTF-8"}, "image": null, "domain": "snopes.news", "title": "Facebook’s “fake news” crackdown is a deliberate attempt to destroy the independent media", "cleaned_text": "Facebook’s “fake news” crackdown is a deliberate attempt to destroy the independent media\n\nIn an attempt to fulfill their promise made back in December to crack down on so-called “fake news,” Facebook has begun to mark content they deem unsubstantiated as “disputed.” Tech new website Recode reports that these stories will now contain a message saying that the selected article has been disputed by its fact checkers, and then subsequently link to articles by Politifact and Snopes.\n\nAccording to Breitbart, in order to flag a story as fake, a user must report it, or Facebook’s algorithm must detect it. The story will then be sent on to at least two fact checking sources who will investigate and determine whether the story is incorrect. If the two fact-checkers agree that the article provides false information, it will get flagged as “disputed,” and there will be a link to an article explaining why. Facebook users who try to share a disputed article are asked if they are sure they want to share it. Stories that have been labeled as disputed will also get pushed down in News Feed.\n\nFacebook insists that articles will not receive the “disputed” label unless two fact-checkers agree, but that provides little relief once you realize who the fact checkers actually are. Most, like ABC News, are part of the establishment “fake news” media. Some are from the George Soros-backed International Fact-Checking Network (IFCN). And last but certainly not least, is liberal attack dog Media Matters founded by David Brock. One must keep in mind that Media Matters continues to use its influence to directly shape the current mainstream media climate. This was further proven in a Fox News interview with former CBS reporter Sharyl Attkisson. (RELATED: Get all the news Google is trying to hide from you at Censored.news.)\n\nThis new labeling program will most certainly be a tool used to silence the independent media. These so-called fact checkers are not shy about their left-leaning political bias and have made it no secret that they believe information should be controlled by a small, select group of media. Meanwhile, the true perpetrators of fake news such as the New York Times, The Washington Post, and CNN will continue to be allowed to lie to the public deliberately despite being caught doing so several times.\n\nWhile the new flag has currently only been rolled out in the U.S., Facebook users around the world should expect to see similar flags shortly. It has been speculated that Germany and France are most likely the next targets as both have contentious elections on the horizon.\n\nFacebook, of course, has declined to comment on the Disputed label or future censoring initiatives.", "opengraph": {"title": "Facebook’s “fake news” crackdown is a deliberate attempt to destroy the independent media", "type": "article", "url": "https://www.snopes.news/2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html", "site_name": "Snopes News", "description": "In an attempt to fulfill their promise made back in December to crack down on so-called “fake news,” Facebook has begun to mark content they deem unsubstantiated as “disputed.” Tech new website Recode reports that these stories will now contain a message saying that the selected article has been disputed by its fact checkers, and […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Mark-Zuckerberg-Facebook-censorship-communism.jpg"}, "tags": ["CNN", "fake news", "Snopes", "Facebook"], "tweets": [], "movies": [], "links": ["http://www.naturalnews.com/2016-12-23-facebook-rolls-out-plans-to-push-gmos-by-marking-anti-gmo-stories-fake-news.html", "http://www.naturalnews.com/2016-12-15-facebook-to-become-left-wing-propaganda-echo-chamber-orwellian-plan-fake-news.html", "https://www.intellihub.com/alert-facebook-implements-internet-censorship-regime-that-is-already-targeting-alternative-media/", "http://www.breitbart.com/tech/2017/03/06/facebook-begins-flagging-fake-news-with-disputed-tag/", "http://www.usatoday.com/story/tech/news/2017/03/06/facebook-begins-flagging-disputed-fake-news/98804948/", "http://censored.news/", "http://www.usatoday.com/story/tech/news/2017/03/06/facebook-begins-flagging-disputed-fake-news/98804948/", "http://www.breitbart.com/tech/2017/03/06/facebook-begins-flagging-fake-news-with-disputed-tag/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html&linkname=Facebook%E2%80%99s%20%E2%80%9Cfake%20news%E2%80%9D%20crackdown%20is%20a%20deliberate%20attempt%20to%20destroy%20the%20independent%20media", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}