{"result_id": "274025", "URL": "https://www.snopes.news/2017-02-14-just-as-snopes-is-run-by-actual-prostitutes-scientific-american-is-now-run-by-industry-whores-shills-and-fraudsters.html", "timestamp": "2023-04-25 17:09:39 CEST+0200", "meta": {"description": "If you wanted to find answers to important questions you have about your health, safety and the environment, would you go downtown and ask a prostitute on the corner? If you wanted to do some quick research about the ingredients in your food or even your medicine, would you ask a drug dealer or a drug […]", "lang": "en", "keywords": "amy harmon,CNN,GMO,GMO labeling,gmo lies,gmo propaganda,gmo toxic,Jon Entine,NYT,PolitiFact,sciam,scientific american,slate,Snopes,washpo", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-02-14-just-as-snopes-is-run-by-actual-prostitutes-scientific-american-is-now-run-by-industry-whores-shills-and-fraudsters.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Just as Snopes is run by actual prostitutes, Scientific American is now run by industry whores, shills and fraudsters", "cleaned_text": "Just as Snopes is run by actual prostitutes, Scientific American is now run by industry whores, shills and fraudsters\n\nIf you wanted to find answers to important questions you have about your health, safety and the environment, would you go downtown and ask a prostitute on the corner? If you wanted to do some quick research about the ingredients in your food or even your medicine, would you ask a drug dealer or a drug addict for their “best recommendations?” So then, why would anyone believe anything ever published by Snopes.com or ScientificAmerican.com, when they employ hucksters, druggies, violent offenders, prostitutes and what Mike Adams, the Health Ranger, refers to as “presstitutes?” The truth is always important, but it’s only powerful if you put it to work, so let’s do just that right now.\n\nNo legitimate research, just a few teams of whores and shills paid by Big Pharma to regurgitate industry-scripted propaganda\n\nWhat’s your slogan if you’re a perpetual liar who relentlessly pushes propaganda in the past, present, and certainly in the upcoming days and years? “Reject a Post Truth World.” Pushing every science hoax available, the illegitimate Scientific American, or “SciAm,” promotes and propagates everything from the completely discredited man-made “global warming” to GMO “sustainability.” It’s just one pathetic lie after another, and they don’t care, because it pays the rent at ScientificAmerican.com, home of the paid shills.\n\nTo the biotechnology giants like Monsanto, Dow Chemical, Bayer, DuPont and Syngenta, “crop science” means evil scientists in laboratories infusing dangerous insecticide genes into plants to kill worms, beetles, bees, butterflies, animals and humans, while saving farmers money. Beyond poisoning the entire planet, GMO crop yields have proven to be a complete and utter failure, and organic crops fair just as well, when all is said and done. Still, that won’t stop the journo-terrorists and biotech media shills that sell it as sustainable, profitable and the best thing since sliced bread.\n\nSnopes.com, just like Scientific American, hires fraudsters to do its dirty work\n\nThere’s nothing in this world like having fraudsters as fact-checkers. Ever since Hitlery Clinton ran for POTUS, Facebook and other social media sites have been filtering out truth news and emboldening fake news, while they fake “fact-check” alternative media by using low-life amateurs and drug addicts to do the job for the elite leftist libtards, who tried so hard to spread their false narrative that it all blew up in their face.\n\nThat’s also exactly what’s happening with GMOs and the genetically modified “Frakenfood” world of information, where everyone in America who cares at all about their health is beginning to realize that everything printed and broadcast by the mass media is a lie, distorted, skewed, tainted, paid-for, scripted and regurgitated by either Big Food or Big Pharma. Even Snopes is run by a low-life who defrauded the publisher out of nearly $100,000 to hire prostitutes.\n\nScientific American hires the bottom-of-the-barrel biotech shills to spread their “science-based” propaganda, and now they’re losing readership by the day.\n\nSnopes and Scientific American have many things in common, besides hiring sellout pharma and biotech shills; they also frequently label truthful reporting on vaccines and GMOs as “false” information, always siding with liberals and the useless Obama regime.\n\nBoth websites function much like Politifact, CNN and the Washington Post (especially Tamar Haspel), as media charlatans who publish anything Monsanto or Merck tells them to publish. They are all liberal propaganda mouthpieces that are falling apart at the seams, as Trump “drains the swamp,” and truth media, like Natural News and Breitbart, becomes the ultimate voice of the people.\n\nThere are so many sellout clones that propagate lies about GMOs that there are just too many to name; however, we wouldn’t be doing the natural health world justice if we didn’t exhume a few top shills from their journalistic graves. Be sure not to put their names in your search engines or you might get a virus. Scientific American thinks these charlatans are the best of the best, because the worst of the worst excel at what they do too.\n\nMichael Specter tops the list for being a GMO-loving media fraudster who jumps from one shill newspaper to the next, starting at WashPo, swinging on over to the New York Times and of course, shilling for the New Yorker, telling the world that GMO labels “make no sense.” Yes, right Michael, it makes no sense to know if there are chemical insecticides and cancer-causing weed-killer formulas both inside and on our produce. Specter fibs for cash, like all the rest of the biotech shills, and says there’s overwhelming “scientific consensus” that GMOs are safe and beneficial, when we all know they are most certainly not. This is not opinion, as mountains of studies now reveal the dangers of consuming chemical pesticides and carcinogenic insecticides. Here are the top 10 studies revealing those dangers.\n\nAnother poser that SciAm idolizes is Amy Harmon, who suddenly became a GMO advocate a few years ago, conspiring with biotech’s top charlatans to promote “high performance plants” (a.k.a. transgenics), as she spits up industry-funded and scripted propaganda under the guise of her Utah country girl persona. Just because you grew up in the wheat fields doesn’t make you a professional or scientific analyst of biotechnology. Harmon exhumes emotions for “human dilemmas” posed by the “advancement of science,” using crafty language and convoluted theories purported as fact. She too pushes the fake “global scientific consensus” that all chemical pesticides are wonderful for human health and that we should basically be drinking Roundup with our dinner because it’s so very safe and beneficial for the environment.\n\nTo the shills and charlatans of biotech at SciAm and Snopes: Keep doing what you’re doing; it’s helping health enthusiasts expose all the nasty facts about GMO\n\nJust as the mass media is falling apart and going bankrupt after “the Donald” victory, so too are the poser websites and newspapers that shill for the chemical agriculture and sick care industries of America. People want the truth, and everybody is getting much better very quickly at sniffing out the fake news. Stay tuned for more shill-exposing hit pieces on SciAm and the dangers of GMO from Natural News. For the actual truth about the dangers of GMO, watch the video below featuring GMO-dangers expert Jeffrey Smith.\n\nBy the way, for real scientific research, check out Science.NaturalNews.com for important news that gets censored by the mass media.", "opengraph": {"title": "Just as Snopes is run by actual prostitutes, Scientific American is now run by industry whores, shills and fraudsters", "type": "article", "url": "https://www.snopes.news/2017-02-14-just-as-snopes-is-run-by-actual-prostitutes-scientific-american-is-now-run-by-industry-whores-shills-and-fraudsters.html", "site_name": "Snopes News", "description": "If you wanted to find answers to important questions you have about your health, safety and the environment, would you go downtown and ask a prostitute on the corner? If you wanted to do some quick research about the ingredients in your food or even your medicine, would you ask a drug dealer or a drug […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/woman-1445917_960_720-e1485842973189.jpg"}, "tags": ["scientific american", "washpo", "PolitiFact", "sciam", "slate", "gmo propaganda", "NYT", "amy harmon", "Snopes", "CNN", "GMO labeling", "GMO", "Jon Entine", "gmo lies", "gmo toxic"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/cocp7utUy64?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/cocp7utUy64?feature=oembed"}], "links": ["http://www.truthwiki.org/snopes-snopes-com/", "http://www.truthwiki.org/jon_entine/", "http://www.truthwiki.org/jon_entine/", "http://www.propaganda.news/", "http://www.truthwiki.org/politifact-com/", "http://www.truthwiki.org/cnn/", "http://www.truthwiki.org/tamar-haspel-washington-post-columnist/", "http://www.newyorker.com/news/daily-comment/problem-g-m-o-labels", "http://www.truthwiki.org/gmo-dangers-research-consensus-cancer/", "http://yournewswire.com/top-10-studies-proving-dangers-of-gmo-food/", "http://www.truthwiki.org/amy-harmon/", "http://www.truthwiki.org/amy-harmon/", "http://www.truthwiki.org/gmo-dangers-research-consensus-cancer/", "http://www.roundup.news/", "http://science.naturalnews.com/", "http://www.truthwiki.org/snopes-snopes-com/", "http://www.truthwiki.org/jon_entine/", "http://www.naturalnews.com/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "http://www.truthwiki.org/politifact-com/", "http://www.truthwiki.org/cnn/", "http://www.truthwiki.org/washington-post/", "http://www.newyorker.com/news/daily-comment/problem-g-m-o-labels", "http://www.truthwiki.org/gmo-dangers-research-consensus-cancer/", "http://yournewswire.com/top-10-studies-proving-dangers-of-gmo-food/", "http://www.truthwiki.org/amy-harmon/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-02-14-just-as-snopes-is-run-by-actual-prostitutes-scientific-american-is-now-run-by-industry-whores-shills-and-fraudsters.html&linkname=Just%20as%20Snopes%20is%20run%20by%20actual%20prostitutes%2C%20Scientific%20American%20is%20now%20run%20by%20industry%20whores%2C%20shills%20and%20fraudsters", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}