{"result_id": "274024", "URL": "https://www.snopes.news/2017-04-13-googles-news-true-or-false-fact-checking-determinations-to-be-made-by-delusional-left-wing-groups-with-a-long-history-of-dishonest-bias.html", "timestamp": "2023-04-25 17:09:39 CEST+0200", "meta": {"description": "Media giant Google now thinks it is large enough to decide which news reports are valid and which are not, so it is implementing “fact-checking labels” to tell readers whether news is “true or false,” The Guardian reports. Here’s how it will work: When a user searches a political subject or phrase, the returns will […]", "lang": "en", "keywords": "Censorship,Facebook,Fact-checking,fake news,Google", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-04-13-googles-news-true-or-false-fact-checking-determinations-to-be-made-by-delusional-left-wing-groups-with-a-long-history-of-dishonest-bias.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Google’s news “true or false” fact checking determinations to be made by delusional Left-wing groups with a long history of dishonest bias", "cleaned_text": "Google’s news “true or false” fact checking determinations to be made by delusional Left-wing groups with a long history of dishonest bias\n\nMedia giant Google now thinks it is large enough to decide which news reports are valid and which are not, so it is implementing “fact-checking labels” to tell readers whether news is “true or false,” The Guardian reports.\n\nHere’s how it will work: When a user searches a political subject or phrase, the returns will focus on news and information that has supposedly been vetted and determined to be true or false, as part of Google’s post-election effort to stop the spread of fake news.\n\n“The fact-checking feature, which was first introduced to Google News in the UK and U.S. in October, will now be displayed as an information box in general search results as well as news search results globally,” The Guardian reported.\n\nAnd just who is Google depending on to ‘fact-check’ news reports? Only some of the most Left-wing organizations known to the media business – organizations that have a demonstrable, chronic anti-liberty, anti-constitutional, anti-conservative bias and who are very often wrong because of their political ideology. (RELATED: Facebook’s “Fake News” Crackdown Is A Deliberate Attempt To Destroy The Independent Media)\n\nAs reported by Breitbart News’ Warner Todd Huston, those “left-of-center gatekeepers” of news honesty include Snopes.com, Politifact, ABC News and The Associated Press. All this really amounts to is the latest effort by media liberals to once again gain control over the daily news narrative – telling Americans what they want them to hear and how they ought to think about and respond to the narrative.\n\nFacebook is jumping on the “fake news” bandwagon too, for that matter, partnering with many of the same organizations as Google. In December, Facebook founder Mark Zuckerberg, a huge supporter of twice-vanquished Hillary Clinton, posted on his account an explanation of why his company is taking its action.\n\n“We’re a new kind of platform for public discourse — and that means we have a new kind of responsibility to enable people to have the most meaningful conversations, and to build a space where people can be informed,” he wrote.\n\nIn a word, bull. “A new kind of responsibility” is nothing more than a euphemism for implementing old-fashioned censorship, in this case of the alternative media that played such an important role in revealing bombshell after bombshell during last year’s election cycle, and then serving as a platform for that news to spread.\n\n“This is a disaster for news coverage,” wrote the Daily Wire’s Ben Shapiro. “It’s an attempt to restore gatekeepers who have a bias as the ultimate arbiters of truth. If these organizations begin questioning articles and penalizing outlets for simple political disagreements rather than outright factual falsities, conservatives will have to go elsewhere for their news.”\n\nAnd that’s precisely what is about to happen: Certain political viewpoints and reporting will be censored via labeling as “fake news” or “false,” even when they’re not. As for those “fact checkers?” Let’s examine them:\n\n— As noted by The Federalist, when ‘fact-checking’ Republican and Democratic figures, the latter fared much better:\n\nWhen fact-checked by PolitiFact, Democrats had an average rating of 1.8, which is between “Mostly True” and “Half True.” The average Republican rating was 2.6, which is between “Half-True” and “Mostly False.” We also checked Republicans without President-elect Donald Trump in the mix and found that 0.8 truth gap narrowed to 0.5.\n\n— Then there are the outright fabrications. As reported by TruthWiki, Snopes was founded and, for the longest time, operated by a married couple who had no particular training, education or experience investigating news reporting:\n\nDavid and Barbara Mikkelson, husband and wife from San Fernando Valley, started their “neutral” blog of shoddy, liberal-bent research over a decade ago, posting time and time again their “final factual words” that aren’t really facts at all. Snopes repeatedly explains away criticisms towards liberal politicians and other leftist public figures while character assassinating conservatives.\n\n— ABC News and The Associated Press fare only slightly better, but both carry the same Left-wing bias in their reporting.\n\nThe point is, Facebook and Google are not out to rid their feeds of so-called “fake news.” They are out to rid their feeds of reporting and political opinion which does not fit their liberal worldview, and in doing so impugning the reporters and editors of those news organizations, period. (RELATED: Beyond Fake News… How Google Just Became FAKE SEARCH By Blacklisting Independent Journalism)\n\nThis has nothing to do with “true or false” and everything to do with blatant censorship.\n\nJ.D. Heyes is a senior writer for NaturalNews.com and NewsTarget.com, as well as editor of The National Sentinel.", "opengraph": {"title": "Google’s news “true or false” fact checking determinations to be made by delusional Left-wing groups with a long history of dishonest bias", "type": "article", "url": "https://www.snopes.news/2017-04-13-googles-news-true-or-false-fact-checking-determinations-to-be-made-by-delusional-left-wing-groups-with-a-long-history-of-dishonest-bias.html", "site_name": "Snopes News", "description": "Media giant Google now thinks it is large enough to decide which news reports are valid and which are not, so it is implementing “fact-checking labels” to tell readers whether news is “true or false,” The Guardian reports. Here’s how it will work: When a user searches a political subject or phrase, the returns will […]", "image": "https://www.snopes.news"}, "tags": ["Google", "fake news", "Censorship", "Facebook", "Fact-checking"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/technology/2017/apr/07/google-to-display-fact-checking-labels-to-show-if-news-is-true-or-false", "http://newsfakes.com/2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html", "http://constitution.com/facebook-use-left-wing-snopes-politifact-factcheck-org-crush-conservative-news-sites/", "http://newsfakes.com", "http://www.dailywire.com/news/11660/facebook-unveils-plan-defeat-fake-news-rely-ben-shapiro", "http://www.truthwiki.org/snopes-snopes-com/", "http://www.corruption.news/2017-02-22-beyond-fake-news-how-google-just-became-fake-search-by-blacklisting-independent-journalism.html", "http://www.thenationalsentinel.com/", "https://www.theguardian.com/technology/2017/apr/07/google-to-display-fact-checking-labels-to-show-if-news-is-true-or-false", "http://constitution.com/facebook-use-left-wing-snopes-politifact-factcheck-org-crush-conservative-news-sites/", "http://www.newsfakes.com/2017-02-14-fake-news-and-fact-checking-how-the-truth-gets-lost.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-04-13-googles-news-true-or-false-fact-checking-determinations-to-be-made-by-delusional-left-wing-groups-with-a-long-history-of-dishonest-bias.html&linkname=Google%E2%80%99s%20news%20%E2%80%9Ctrue%20or%20false%E2%80%9D%20fact%20checking%20determinations%20to%20be%20made%20by%20delusional%20Left-wing%20groups%20with%20a%20long%20history%20of%20dishonest%20bias", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}