{"result_id": "274015", "URL": "https://www.snopes.news/2017-03-14-harvard-joins-fake-news-fight-by-circulating-list-of-web-sites-students-should-avoid.html", "timestamp": "2023-04-25 17:09:32 CEST+0200", "meta": {"description": "Harvard University’s library website published new research guidelines for students that label sites like The Daily Caller and the Drudge Report as being potentially unreliable. The guide is called “Fake News, Misinformation, and Propaganda” and it identifies numerous respectable conservative websites as fake while labeling most of the liberal sites, that have been disproven, as […]", "lang": "en", "keywords": "BuzzFeed,fake news,Harvard,Washington Post", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2017-03-14-harvard-joins-fake-news-fight-by-circulating-list-of-web-sites-students-should-avoid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Harvard joins “fake news” fight by circulating list of web sites students should avoid", "cleaned_text": "Harvard joins “fake news” fight by circulating list of web sites students should avoid\n\nHarvard University’s library website published new research guidelines for students that label sites like The Daily Caller and the Drudge Report as being potentially unreliable. The guide is called “Fake News, Misinformation, and Propaganda” and it identifies numerous respectable conservative websites as fake while labeling most of the liberal sites, that have been disproven, as credible.\n\nThe guide offers students tips on how to spot fake news such as checking to see how the URL ends (if it ends in “.com.co” for example it could be suspicious) and also looking at visual cues like a site’s overuse of all caps and page layout. Students are encouraged to use fact-checking sites like snopes.com and the Washington Post Fact Checker. Melissa Zimdars’ “False, Misleading, Clickbait-y, and Satirical News Sources” article is also listed as a resource. This is the same list that conjured outrage when first released because it catalogs nearly every legitimate conservative-leaning newsgroups alongside actual hoax websites. (RELATED: Get all the news Google is trying to hide from you at Censored.news.)\n\nLiberal media has continued to run with Zimdars fake news list despite the fact that she has no authority to determine what distinguishes news to be fake. Zimdars, a College Assistant Professor for little over a year at Merrimack College, compiled the list because she didn’t approve of the sources her students were citing. In many cases, she has never offered an explanation for why the credibility of some of the webpages on the list are being called into question. That has not stopped Business Insider, The Washington Post, CNN, and now Harvard from running with it and making it gospel.\n\nHarvard’s guidelines also recommend that students download browser plug-ins that will detect websites that may not be a reliable source. These plug-ins flag well-known outlets like The Drudge Report, Breitbart, WND, and even Project Veritas as being unreliable or “clickbait-y.”\n\nThe list does not, however, label Buzzfeed, Wall Street Journal, or the New York Times, all of which are at best biased and at worst flat out lying to readers. This year Buzzfeed was sued by a Russian-tied tech firm for naming them in the unsubstantiated dossier they published about President Trump.\n\nThe fact is fake news does exist, but the lists currently compiled are using bias to take sites that have been proven reliable and label them negatively in an attempt to gain back control of the narrative.\n\nHarvard has made it no secret that conservative views are not accepted on campus. President Richard Nixon used to refer to the school as “the Kremlin on the Charles.” Last year a Harvard law professor called for liberals to begin treating those who subscribe to Christian or conservative beliefs like Nazis.\n\nLong ago Colleges were intended to be a place where ideas and thought were developed, especially over compromise of differing views. Unfortunately, Harvard and many other once-respected schools have allowed only pro-liberal views to be expressed over the years, creating generations of future leaders that are only trained to think one way. Colleges can make all the lists they want, but the truth remains that the independent media is now the most trusted news source while their “fake news” counterpart is holding on for dear life.", "opengraph": {"title": "Harvard joins “fake news” fight by circulating list of web sites students should avoid", "type": "article", "url": "https://www.snopes.news/2017-03-14-harvard-joins-fake-news-fight-by-circulating-list-of-web-sites-students-should-avoid.html", "site_name": "Snopes News", "description": "Harvard University’s library website published new research guidelines for students that label sites like The Daily Caller and the Drudge Report as being potentially unreliable. The guide is called “Fake News, Misinformation, and Propaganda” and it identifies numerous respectable conservative websites as fake while labeling most of the liberal sites, that have been disproven, as […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/Facebook-Fake-News-Label.jpg"}, "tags": ["Washington Post", "BuzzFeed", "fake news", "Harvard"], "tweets": [], "movies": [], "links": ["https://www.campusreform.org/?ID=8895", "http://www.naturalnews.com/2017-03-12-facebooks-fake-news-crackdown-is-a-deliberate-attempt-to-destroy-the-independent-media.html", "http://guides.library.harvard.edu/fake", "http://www.naturalnews.com/2016-12-16-in-the-30s-adolf-hitler-arrested-and-executed-fake-news-journalists-who-rightfully-claimed-jews-were-being-exterminated.html", "http://censored.news/", "http://www.wnd.com/2016/11/meet-leftist-prof-who-wrote-hit-list-of-fake-news-sites/", "http://www.thecrimson.com/article/2000/2/2/what-we-truly-believe-ppharvard-richard/", "http://guides.library.harvard.edu/fake", "http://www.wnd.com/2016/11/meet-leftist-prof-who-wrote-hit-list-of-fake-news-sites/", "http://www.thecrimson.com/article/2000/2/2/what-we-truly-believe-ppharvard-richard/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2017-03-14-harvard-joins-fake-news-fight-by-circulating-list-of-web-sites-students-should-avoid.html&linkname=Harvard%20joins%20%E2%80%9Cfake%20news%E2%80%9D%20fight%20by%20circulating%20list%20of%20web%20sites%20students%20should%20avoid", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}