{"result_id": "274016", "URL": "https://www.snopes.news/2021-08-23-snopes-co-founder-wrote-under-fake-names.html", "timestamp": "2023-04-25 17:09:32 CEST+0200", "meta": {"description": "Evidence has revealed that David Mikkelson – co-founder of the fact-checking site Snopes and supposed “arbiter of truth,” who aggressively attacked Donald Trump and his allies – has consistently engaged in plagiarism and even wrote under an assumed name for an extended period of time. (Article by Catherine Salgado republished from TheNationalPulse.com) BuzzFeed News uncovered the […]", "lang": "en", "keywords": "David Mikkelson,disinfo,Fact Check,Journalism,left cult,lies,plagiarism,propaganda,Snopes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2021-08-23-snopes-co-founder-wrote-under-fake-names.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Snopes co-founder wrote under fake names in now deleted ‘stories’ targeting Trump, Bannon, and more", "cleaned_text": "Snopes co-founder wrote under fake names in now deleted ‘stories’ targeting Trump, Bannon, and more\n\nEvidence has revealed that David Mikkelson – co-founder of the fact-checking site Snopes and supposed “arbiter of truth,” who aggressively attacked Donald Trump and his allies – has consistently engaged in plagiarism and even wrote under an assumed name for an extended period of time.\n\nBuzzFeed News uncovered the evidence that Mikkelson wrote under an assumed identity for Snopes, and plagiarized extensively between 2015 and 2019. Mikkelson claimed to be a “bulwark in the fight against rumors and fake news. But he has been lying to the site’s tens of millions of readers,” noted Buzzfeed. In an internal review prompted by BuzzFeed News’ inquiries, Snopes confirmed Mikkelson wrote and published 54 articles containing plagiarized material from outlets such as Reuters and the Guardian. The articles were published under Mikkelson’s own name, the “Snopes byline,” and a pseudonym, and included topics such as “same-sex marriage licenses.”\n\nSnopes Chief Operating Officer Vinny Green and Snopes VP of Editorial and Managing Editor Doreen Marchionni released a statement saying, “Our internal research so far has found a total of 54 stories Mikkelson published that used appropriated material, including all of the stories Buzzfeed shared with us.” Marchionni, pending “a comprehensive internal investigation,” did suspend Mikkelson from his editorial duties, but Mikkelson still remains an officer of Snopes and a 50 percent shareholder in the company. “Let us be clear: Plagiarism undermines our mission and values, full stop. It has no place in any context within this organization,” Marchionni said.\n\nAll of the articles in question will be retracted and advertising on them disabled, as well as add to each piece an editor’s note of explanation, Snopes told BuzzFeed News. The editorial staff of Snopes also disavowed Mikkelson in a separate statement, which eight current writers of the outlet signed.\n\n“Jeff Zarronandia” wrote at least 23 articles for Snopes, including pieces claiming to disprove accusations against Hillary Clinton, or attacking Donald Trump. Zarronandia had a Twitter profile and a bio claiming he “won the Pulitzer Prize for numismatics in 2006. . .[and] the Distinguished Conflagration Award of the American Society of Muleskinners for 2005.”\n\nThere is in fact no Pulitzer Prize for numismatics and no American Society of Muleskinners, but there is also no Jeff Zarronandia. The former managing editor for Snopes, Brooke Binkowski, said that “Zarronandia” was an alternate name for Mikkelson, and that “He used to write about topics he knew would get him hate mail under that assumed name. Plus it made it appear he had more staff than he had.” There are other trolls on the Snopes site, such as “The Repository of Lost Legends” section, which contains not only fact-checks that are spoofs but also forms the acronym TROLL with its title.\n\nMikkelson told BuzzFeed News that he invented the pseudonym and personality of Zarronandia for a joke deliberately meant to mislead both trolls and those he judged conspiracy theorists in the time leading up to the US presidential election in 2016. Mikkelson called it “kind of a stress-relief thing” and added, “Let’s have some fun and watch these people vent their spleen inventing reasons why this nonexistent persona is biased.” Mikkelson was writing trolling articles under a false name while simultaneously mocking Trump and Trump supporters as conspiracy theorists.\n\nAs Zarronandia, Mikkelson defended Khizr Khan, who gave an anti-Trump speech to the Democratic National Convention in 2016 and was later accused of being on the payroll of the Clinton Foundation. Mikkelson believed that the 2016 election cycle provided many opportunities to “debunk” stories.\n\nSteve Bannon, then campaign strategist for Donald Trump, is specifically mentioned in BuzzFeed’s account of Mickelson’s motives.\n\nThe Zarronandia author page has now been removed from Snopes and the byline replaced with “Snopes staff.”\n\nRead more at: TheNationalPulse.com or Snopes.news", "opengraph": {"title": "Snopes co-founder wrote under fake names in now deleted ‘stories’ targeting Trump, Bannon, and more", "type": "article", "url": "https://www.snopes.news/2021-08-23-snopes-co-founder-wrote-under-fake-names.html", "site_name": "Snopes News", "description": "Evidence has revealed that David Mikkelson – co-founder of the fact-checking site Snopes and supposed “arbiter of truth,” who aggressively attacked Donald Trump and his allies – has consistently engaged in plagiarism and even wrote under an assumed name for an extended period of time. (Article by Catherine Salgado republished from TheNationalPulse.com) BuzzFeed News uncovered the […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2021/08/Fake-News-Truth-Honesty-Corruption-Liar-Nose.jpg"}, "tags": ["plagiarism", "Fact Check", "left cult", "Journalism", "Snopes", "David Mikkelson", "disinfo", "lies", "propaganda"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/breaking/snopes-co-founder-wrote-under-fake-names-in-now-deleted-stories-targeting-trump-bannon-and-more/", "https://www.buzzfeednews.com/article/deansterlingjones/snopes-cofounder-plagiarism-mikkelson", "https://thenationalpulse.com/breaking/snopes-co-founder-wrote-under-fake-names-in-now-deleted-stories-targeting-trump-bannon-and-more/", "http://Snopes.news"], "authors": [], "publish_date": null}