{"result_id": "274007", "URL": "https://www.snopes.news/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "timestamp": "2023-04-25 17:09:20 CEST+0200", "meta": {"description": "The propagandizing “fact-checking” website SNOPES is being run by a whore-digger who defrauded the publisher out of $98,000 to hire prostitutes, say now-public divorce documents. One of the site’s administrators is an “escort-porn star,” and a fact-checker at SNOPES turns out to be a fetish sex blogger named “Vice Vixen domme,” explains the UK Daily […]", "lang": "en", "keywords": "Censorship,David Mikkelson,deviants,Elyssa Young,escort,Facebook,fact checkers,Fact-checking,fetish bloggers,media bias,Presstitutes,prostitutes,Snopes,whores", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.snopes.news/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "encoding": "UTF-8"}, "image": null, "domain": "www.snopes.news", "title": "Prostitutes for the Presstitutes: SNOPES fact-checkers revealed to be actual whores, fraudsters and deviant left-wing fetish bloggers", "cleaned_text": "Prostitutes for the Presstitutes: SNOPES fact-checkers revealed to be actual whores, fraudsters and deviant left-wing fetish bloggers\n\nThe propagandizing “fact-checking” website SNOPES is being run by a whore-digger who defrauded the publisher out of $98,000 to hire prostitutes, say now-public divorce documents. One of the site’s administrators is an “escort-porn star,” and a fact-checker at SNOPES turns out to be a fetish sex blogger named “Vice Vixen domme,” explains the UK Daily Mail. The SNOPES organization, reports the paper, was founded through an elaborate fraud scheme, and its CEO married an international escort worker who traveled the globe to be banged by “VIP” clients who posted glowing online reviews of why she’s such a good choice to be hired as a “lover.”\n\nFacebook recently announced it would rely on SNOPES to “fact-check” news articles to make sure Facebook operated with high integrity standards and full transparency. In reality, the announcement was a thinly-veiled attempt to censor independent journalism by labeling real news “fake news” with the help of all the left-wing (actual) whores and fraudsters at SNOPES.\n\nSNOPES has frequently labeled truthful reporting on vaccines, GMOs and false flag shootings to be “false” information, siding with liberals, President Obama and the corporate establishment on nearly every topic. While claiming it is an arbiter of truth, SNOPES really functions as just another liberal propaganda mouthpiece, declaring left-wing propaganda to be “truthful” while slamming anything that contradicts liberal ideology or Big Government narratives. In this way, SNOPES mirrors Politifact, which is also run by left-wing propagandists and mind manipulators.\n\nSNOPES, “claims to be one of the web’s ‘essential resources’ and ‘painstaking, scholarly and reliable'” says the Daily Mail, which goes on to explain:\n\nIt was founded by husband-and-wife Barbara and David Mikkelson, who used a letterhead claiming they were a non-existent society to start their research. Now they are divorced – with Barbara claiming in legal documents he embezzled $98,000 of company money and spent it on ‘himself and prostitutes’.\n\nSnopes.com founder David Mikkelson’s new wife Elyssa Young is employed by the website as an administrator… she has worked as an escort and porn actress and despite claims [that SNOPES] is non-political ran as a Libertarian for Congress on a ‘Dump Bush’ platform. Its main ‘fact checker’ is Kimberly LaCapria, whose blog ‘ViceVixen’ says she is in touch with her ‘domme side’ and has posted on Snopes.com while smoking pot.\n\nThis montage shows the original SNOPES founders (bottom right) alongside the “Vice Vixen” escort-porn star now working there:\n\n“The CEO of Snopes.com, the fact-checking website that was recently named as one of Facebook’s “fake news” arbiters, has been accused in divorce proceedings of appropriating company funds which he allegedly spent on expensive holidays and prostitutes,” reports Breitbart.com.\n\nThe founders’ names are David Mikkelson and Barbara Mikkelson. Via Breitbart:\n\nBarbara has claimed that her former husband embezzled money from the company. Court documents obtained by the Daily Mail state that Barbara accused David of “raiding the corporate business Bardav bank account for his personal use and attorney fees.” Barbara also claims that David embezzled $98,000 over four years, which “he expended upon himself and the prostitutes he hired.” Barbara claims that David spent $10,000 from their business accounts between April and June of 2016 to fund an expensive 24-day holiday for him and his “girlfriend.”\n\nHere’s a composite of online posts from Elyssa Young, the new bride of David Mikkelson, who also ran an online escort posting. She’s now an administrator at SNOPES, which gives a whole new meaning of “prostitutes” aiding “presstitutes.”\n\nThis divorce document states that SNOPES CEO David Mikkelson embezzled money from the company to hire prostitutes. As shown in the document below, courtesy of UK Daily Mail:\n\n…embezzlement of $98,000 from our company over the course of four years, which were monies he expended upon himself and the prostitutes he hired…\n\nIn addition to marrying an escort service tease, David Mikkelson thinks he should be paid $720,000 a year to run the SNOPES left-wing propaganda website. Via the UK Daily Mail:\n\nDavid wanted his salary raised from $240,000 to $360,000 – arguing that this would still put him below the ‘industry standards’ and that he should be paid up to $720,000 a year.\n\n‘As I said, based on industry standards and our revenues, my salary should be about 2x to 3x what it is now,’ he wrote in an email to Barbara in April 2016. ‘I’ll settle for $360K with the understanding that it’s to be retroactive to the start of the year.’\n\n“According to divorce papers, Snopes co-founder David Mikkelson started taking all sorts of trips around the world to bang whores after that sweet liberal shill money started rolling in,” reports Zero Hedge.\n\n“While engaging in this debauchery, Mikkelson wrote off just about everything as a business expense, embezzling a reported $98,000. The Snopes co-founder has since settled down and married a [NSFW] part time porn actress, Snopes.com administrator (spicy!), and sex worker. As in, she has a website devoted to being a whore.”\n\nLying for the left also turns out to be incredibly profitable. “David kept their joint baseball card collection, a savings account with $1.59 million balance, and other savings worth more than $300,000,” reports the paper.\n\nHere’s a photo of the SNOPES founders posing as complete slobs with their obese cat perched on a couch that looks ripped out of the 1970s. David’s expression almost seems to say, “What I really wanted was some VIP pu##y and all I got was this obese creature annoying the hell out of me… plus a cat!”\n\nSNOPES CEO marries a prostitute who has been banged by men from around the world… is that “diversity?”\n\nSNOPES CEO Mikkelson’s new wife, Elyssa Young, has been banged by so many other paying customers that you can actually find online reviews for her “services.”\n\nThis particular review states that she “travels overseas extensively” and is a great choice “if you seek a lover.”\n\nHiring and marrying actual whores to “services” the presstitutes in the fakestream media is all part of SNOPES’ “diversity” program, according to the CEO. “Our editorial staff is drawn from diverse backgrounds,” Mikkelson told the UK Daily Mail.\n\nIf he means diversity in sexually transmitted diseases, he’s probably right. Can you imagine the vast array of viral populations festering in the crotches of these despicable “fact-checking” sleazebags?\n\nAnother SNOPES fact-checker turns out to be a pot-smoking fetish gear sex blogger who thinks Republicans fear females\n\n\n\nThe bizarre, twisted “diversity” of SNOPES’ staff doesn’t end there. Another SNOPES “fact-checker” named Kim LaCapria is a fetish gear sex blogger, according to Breitbart.com:\n\nWriting under the pseudonym Vice Vixen, Snopes fact-checker Kim LaCapria regularly wrote about sex and fetish gear on her own blog, which was described as a lifestyle blog “with a specific focus on naughtiness, sin, carnal pursuits, and general hedonism and bonne vivante-ery.” LaCapria’s blog often featured reviews of sex toys. One particular review reads, “If you are doing something to your fella, and you apply this to the base of his cash-and-prizes while you carry on, he will scream and perhaps cry.” On another blog, LaCapria once described what she did on her day off, writing that she “played scrabble, smoked pot, and posted to Snopes.” She then added, “That’s what I did on my day ‘on,’ too.”\n\nSnopes “fact-checker” Kim LaCapria claimed on her personal blog that she has “posted to Snopes” after smoking marijuana. As TheDC previously revealed, LaCapria describes herself as “openly left-leaning” and once claimed that Republicans fear “female agency.”\n\nOfficial “fact-checkers” turn out to be steeped in debauchery, betrayal and deviant behavior\n\nWhat’s astonishing in all this is how Facebook has already announced it will rely on SNOPES to “fact-check” news articles. Because SNOPES has long been run by left-leaning liberal propagandists, everyone knows Facebook’s “fact-checking” is really just a new form of censorship to silence independent journalism.\n\nThe fact that left-wing propagandists also happen to be actual whores, and men who marry whores, and people who reportedly embezzle money to hire whores is no surprise to anyone. The political left has descended into cabal of liars, thieves, asshats and intolerant, abusive hate-mongers who have been widely rejected by most of civil society. Revelations about SNOPES only further confirm what we’ve all known about the opinion leaders on the left for quite some time: They’re mostly sick, twisted, mentally ill sociopaths who have no ethics, no morals and no dedication to actual truth. They lie when it’s convenient; they stab each other in the back (feel the Bern!); they have weird sex fetishes (Bill Clinton’s numerous sex assaults on women); they routinely cheat on each other (Bill Clinton is not Chelsea Clinton’s father); and they LIE, LIE, LIE while proclaiming that have a divine monopoly on “truth.”\n\nThat Mark Zuckerberg would appoint these people to “fact-check” Facebook news just makes Zuckerberg a sicko and a psycho. In doing so, he’s in good company with other globalist psychopaths like Jeff Bezos, George Soros, Bill Gates and Ted Turner. Other small-time propagandists who operate with a similar degree of fraud and deception include:\n\n– Jimmy Wales, the founder of Wikipedia who launched the propaganda venture using money earned from being a porn king.\n\n– Jon Entine, a biotech industry propagandist who was exposed by Natural News for being a violent psychopath who physically attacked his wife in front of their own child.\n\n– James “the Amazing” Randi, who was caught on tape soliciting sex acts from young men.\n\nJames Randi, in turn, leads to David Gorski, the discredited “skeptics” blogger and cancer surgeon who has been reported to the FBI for a series of allegations involving the same cancer center where now-imprisoned cancer surgeon Dr. Farid Fata committed widespread criminal fraud by falsely diagnosing patients with cancer so he could profit from “treating” them.\n\nAll these people are leftists. What they have in common is their complete abandonment of truth, ethics and morality in their psychopathic quest for power. They are all willing to lie, cheat, steal, defame, slander or, in some cases, even murder people in order to get their way.\n\nOh wait, let me guess: SNOPES is going to investigate these accusations against SNOPES and proclaim that everything in this story is false. Therefore, all criticism of SNOPES is “fake news” by definition, because the authenticity of the monopolistic arbiter of news can never be questioned, you see.\n\nThe Ministry of Truth is alive and well in America, and it’s run by deviants, traitors and whores. If you believe anything you read on SNOPES, you’re a complete fool.\n\nAll this helps explain why people are ditching Facebook, Google News, CNN, MSNBC and all the corrupt, twisted “mainstream” news sources and turning to independent, alternative news gateways.\n\nTo assist people in finding independent, truthful journalism run by intelligent, ethical people who don’t embezzle money to hire whores, here are several solutions:\n\nCENSORED.news provides a near-real-time update of news headlines from all the popular independent media websites like Breitbart, NaturalNews, Infowars, Zero Hedge, Activist Post and more. (More sites being added soon.)\n\nGoodGopher.com is an independent search engine that searches indy news website. It’s refreshed daily, and you can use it to find breaking news on all the topics that are routinely censored by the mainstream media. Click here to see a real-time search result for “SNOPES Elyssa Young”\n\nFETCH.news brings you real-time news headlines on specific topics from across the independent media. There, you can monitor news feeds covering the DEA, FDA, FBI, CIA and the CDC. Or monitor news on topics like encryption, psychiatry, smart meters, population control or influenza.\n\nAlternativeNews.com brings you real-time news headlines from across the Natural News universe of websites, including NewsTarget.com, Trump.news, TalkNetwork.com and more.\n\nShare.NaturalNews.com is part of the Diaspora open source social network system, which is an uncensored alternative to Facebook. Thousands of former Facebook users have already migrated to Share.NaturalNews.com where every post appears in your feed.\n\nGab.ai is Twitter alternative where content is entirely uncensored. It’s still a relatively small site, but it’s growing rapidly. Find our feeds at Gab.ai/HealthRanger and Gab.ai/NaturalNews", "opengraph": {"title": "Prostitutes for the Presstitutes: SNOPES fact-checkers revealed to be actual whores, fraudsters and deviant left-wing fetish bloggers", "type": "article", "url": "https://www.snopes.news/2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html", "site_name": "Snopes News", "description": "The propagandizing “fact-checking” website SNOPES is being run by a whore-digger who defrauded the publisher out of $98,000 to hire prostitutes, say now-public divorce documents. One of the site’s administrators is an “escort-porn star,” and a fact-checker at SNOPES turns out to be a fetish sex blogger named “Vice Vixen domme,” explains the UK Daily […]", "image": "https://www.snopes.news/wp-content/uploads/sites/393/2018/04/SNOPES-vice-vixen-whores-David-Mikkelson.jpg"}, "tags": ["prostitutes", "media bias", "whores", "Censorship", "Snopes", "deviants", "Elyssa Young", "David Mikkelson", "Presstitutes", "fetish bloggers", "Facebook", "escort", "Fact-checking", "fact checkers"], "tweets": [], "movies": [], "links": ["http://www.dailymail.co.uk/news/article-4042194/Facebook-fact-checker-arbitrate-fake-news-accused-defrauding-website-pay-prostitutes-staff-includes-escort-porn-star-Vice-Vixen-domme.html", "http://www.truthwiki.org/snopes-snopes-com/", "http://www.truthwiki.org/politifact-com/", "http://www.breitbart.com/tech/2016/12/22/snopes-ceo-accused-in-divorce-proceedings-of-embezzling-company-money-to-spend-on-prostitutes/", "http://www.dailymail.co.uk/news/article-4042194/Facebook-fact-checker-arbitrate-fake-news-accused-defrauding-website-pay-prostitutes-staff-includes-escort-porn-star-Vice-Vixen-domme.html", "http://www.zerohedge.com/news/2016-12-22/snopes-co-founder-embezzles-98000-drops-weight-leaves-fat-wife-and-marries-actual-wh", "http://www.breitbart.com/tech/2016/12/22/snopes-ceo-accused-in-divorce-proceedings-of-embezzling-company-money-to-spend-on-prostitutes/", "http://www.trunews.com/article/snopes-founder-spent-fake-news-bucks-on-prostitutes#sthash.mCB40Q25.dpuf", "http://www.truthwiki.org/jeff-bezos-amazon-com/", "http://www.truthwiki.org/george-soros/", "http://www.truthwiki.org/bill-gates-bill-and-melinda-gates-foundation/", "http://www.truthwiki.org/jimmy-wales-wikipedia-founder/", "http://www.naturalnews.com/049422_Jimmy_Wales_Wikipedia_porn_king.html", "http://www.truthwiki.org/jon_entine/", "http://www.naturalnews.com/047665_Jon_Entine_domestic_violence_Forbes.html", "http://www.truthwiki.org/james-randi/", "http://www.naturalnews.com/053882_David_Gorski_James_Randi_Karmanos_Cancer_Center.html", "http://www.truthwiki.org/orac-david-h-gorski/", "http://www.naturalnews.com/053736_Dr_David_Gorski_medical_conspiracy_allegations_Karmanos_Cancer_Center.html", "http://www.truthwiki.org/dr-farid-fata/", "http://www.naturalnews.com/054685_Farid_Fata_Karmanos_Cancer_Center_David_Gorski.html", "http://CENSORED.news", "http://GoodGopher.com", "https://goodgopher.com/SearchResults.asp?query=snopes+Elyssa+Young&pr=GG", "http://FETCH.news", "http://AlternativeNews.com", "http://Share.NaturalNews.com", "http://Gab.ai", "http://Gab.ai/HealthRanger", "http://Gab.ai/NaturalNews", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fsnopesnews%2F2016-12-25-snopes-fact-checkers-actual-whores-david-mikkelson-elyssa-young-presstitutes-fraud.html&linkname=Prostitutes%20for%20the%20Presstitutes%3A%20SNOPES%20fact-checkers%20revealed%20to%20be%20actual%20whores%2C%20fraudsters%20and%20deviant%20left-wing%20fetish%20bloggers", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}