{"result_id": "275018", "URL": "https://southfront.org/the-pentagons-dilemma-the-covid-vaccine-impairs-the-performance-of-u-s-fighting-forces/", "timestamp": "2023-04-25 17:10:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/the-pentagons-dilemma-the-covid-vaccine-impairs-the-performance-of-u-s-fighting-forces/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "The Pentagon’s Dilemma: The Covid Vaccine Impairs the Performance of U.S. Fighting Forces", "cleaned_text": "“Physician and Army Lieutenant Colonel Theresa Long is a rare, courageous truth-teller willing to probably jeopardize a military career for the greater good. To try and steer the Department of Defense to policies that protect military personnel from dangerous and unnecessary COVID vaccines … “. (Joel Hirschhorn, September 2021)\n\nOn August 24, 2021, The Pentagon approved the Pfizer/BioNTech coronavirus vaccine. It is compulsory for all military personnel:\n\n“After careful consultation with medical experts and military leadership, and with the support of the President, I [Lloyd Austin] have determined that mandatory vaccination against coronavirus disease 2019 (COVID-19) is necessary to protect the Force and defend the American people,” (Secretary of Defense Lloyd Austin, memorandum, August 24, 2021, see screenshot below).\n\nWhat careful consultations? With Joe Biden, the Commander in Chief?\n\nVisibly no serious consultations were undertaken.\n\nThe adverse events and injuries pertaining to the Covid vaccine are amply documented: thrombosis, heart attacks, myocarditis, blood clots, neurological impacts.\n\nIndelibly these conditions will affect the performance and capabilities of US fighting forces.\n\nPentagon analysts are mum on the subject, because they are told that the “vaccine is safe”.\n\nBut the vaccine is not safe. Look at the figures:\n\nUSA (December 2020 to end of August 2021. Reported on September 1, 2021: 14,506 Covid-19 injection related deaths and 3,146,691 injuries, (VAERS database).\n\nThe official figures (reported by VAERS) are but a small percentage of the actual figures. Based on historical data (Electronic Support for Public Health–Vaccine Adverse Event Reporting System (ESP:VAERS, p. 6):\n\nWhile we are not in a position to establish precise estimates, we are able to establish an order of magnitude.\n\nMultiply the official figures (registered and recorded) by the relevant parameter to get the REAL NUMBERS of deaths and injuries.\n\n3,146,691 injuries multiplied at least by 10.\n\nThe Pentagon’s Dilemma. Military Capabilities and Performance Impaired by the Covid Vaccine\n\nThe Pentagon vaccine mandate will inevitably impair the capabilities of the US military including Air Force pilots and ground combat forces. The strategic and operational implications are far-reaching.\n\nThis applies to vaccinated pilots at high altitude who may be suffering from a Covid vaccine adverse event, e.g. blood clots.\n\nIn an Affidavit, U.S. Army doctor and specialist in aerospace medicine Lt Col Theresa Long “has made an unprecedented call to Pentagon leaders, asking them to ground all pilots in all services who have gotten a COVID-19 vaccine”.\n\nThe majority of young new Army aviators are in their early twenties. We know there is a risk of myocarditis with each mRNA vaccination. … Additional boaster shots add more risk. … Use of mRNA vaccines in our fighting force presents a risk of undetermined magnitude, …\n\n…Numerous Soldiers and DOD civilians have told me of how they were sick, bed-ridden, debilitated, and unable to work for days to weeks after vaccination. I have also recently reviewed three flight crew members’ medical records, all of which presented with both significant and aggressive systemic health issues. … All three pulmonary embolism events happened within 48 hours of their vaccination.”\n\nThis issue has also been contemplated by civilian airline pilots who face the same predicament.\n\nThe civilian pilots also expressed their concern for the security of passengers. Vaccine related adverse events can occur at 34,000 feet. According to American Airlines pilot Joshua Yoder: “This may be the greatest safety-of-flight issue the airlines have ever faced”:\n\n“What if myocarditis becomes a larger issue, and pilots start to lose their medicals, let’s say three or four years in; it could completely bring the aviation industry to its knees, if they have pilots who can’t pass their medicals in a couple of years. … This may be the greatest safety-of-flight issue the airlines have ever faced, …\n\nLawsuit against U.S. Department of Defense\n\nThe August 24 DoD memorandum was immediately followed by a federal lawsuit filed on August 30 against Defense Secretary Lloyd Austin, Homeland Security Director Xavier Bacerra and U.S. Food and Drug Administration Commissioner Janet Woodcock.\n\nThe suit, filed August 30 in U.S. District Court in Colorado, seeks immediate injunctive relief.\n\nThe two plaintiffs, Daniel Robert, a 33-year-old drill sergeant at Fort Benning Army base in Columbus, Georgia, and Hollie Mulvihill, a 29-year-old staff sergeant at the Marine Corp base in Jacksonville, North Carolina, are asking the court for a temporary restraining order preventing the forced injections before a full hearing can be scheduled. They are ultimately seeking a permanent injunction and declaratory judgment against Biden’s Department of Defense.\n\nThe two defendants represent 220,000 other U.S. military active-duty members who have natural immunity and do not want any of the three synthetic gene-based “vaccines” shot into their bodies. (Leo Hohmann, September 3, 2021)\n\nWhat happens if Joe Biden accepts to implement a Covid-19 Vaccine Exemption for military personnel with a view to avoiding “the health risks” as well as safeguarding the capabilities of Air Force and Army ground force personnel?\n\nFrom a public relations standpoint, that’s the option which Joe Biden would rather want to avoid. It could potentially break the legitimacy of his vaccine mandate applied to civilians. A decision of this nature would also expose the “health risks” related to the Covid vaccine.\n\nOn the other hand, if the vaccine mandate applied to all military personnel continues to be enforced, this could undermine Joe Biden’s credibility as Commander in Chief of US Armed Forces.\n\nWhile the need to ground vaccinated Air Force pilots is real, President Biden would continue to dismiss the occurrence of vaccine related deaths and “adverse events” such as blood clots and myocarditis. He would also ignore how this would affect the performance of vaccinated forces in a war theater or combat zone.\n\nAccording to Time Magazine, the prevalence of unvaccinated US Forces undermines National Security. The unvaxxed are tagged as extremists.\n\n“The first step is for our military leaders to simply convince their troops to get the vaccine. America will be safer and stronger once they do”, says Time Magazine.\n\n“Safer and Stronger”: This is a nonsensical statement.\n\nIt’s the other way round: The vaccine and it’s “adverse events” weaken the performance of the US military.\n\n“Use of mRNA vaccines in our fighting force presents a risk of undetermined magnitude” says Dr. Theresa Long.\n\nHave the strategic and operational implications been analyzed?\n\nMORE ON THE TOPIC:\n• Cali In Khaki: The Australian Defence Force And COVID-19", "opengraph": {"locale": "en_GB", "type": "article", "title": "The Pentagon’s Dilemma: The Covid Vaccine Impairs the Performance of U.S. Fighting Forces", "description": "Written by Prof Michel Chossudovsky. Originally published on Global Research “Physician and Army Lieutenant Colonel Theresa Long is a rare,...", "url": "https://southfront.org/the-pentagons-dilemma-the-covid-vaccine-impairs-the-performance-of-u-s-fighting-forces/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-10-05T15:03:14+00:00", "article:modified_time": "2021-10-05T15:15:49+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/10/Pentagon.jpg", "image:width": "1192", "image:height": "608", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://www.globalresearch.ca/author/michel-chossudovsky", "https://media.defense.gov/2021/Aug/25/2002838826/-1/-1/0/MEMORANDUM-FOR-MANDATORY-CORONAVIRUS-DISEASE-2019-VACCINATION-OF-DEPARTMENT-OF-DEFENSE-SERVICE-MEMBERS.PDF", "https://s4.cdnstatic.space/wp-content/uploads/2021/10/Screen-Shot.webp", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.globalresearch.ca/army-physician-aerospace-medicine-specialist-calls-pentagon-order-all-pilots-received-covid-19-vaccine-grounded/5757418", "https://www.globalresearch.ca/pilot-condemns-united-airlines-mandating-experimental-injection/5753073", "https://childrenshealthdefense.org/wp-content/uploads/colorado-army-lawsuit-vaccine.pdf", "https://www.globalresearch.ca/220000-military-service-members-say-no-biden-forced-covid-injections-file-lawsuit-claiming-already-natural-immunity/5755652", "https://time.com/5952558/military-covid-19-vaccine-misinformation/", "https://southfront.org/biden-overstates-by-700-effectiveness-of-covid-vaccines/", "https://southfront.org/call-in-the-khaki-the-australian-defence-force-and-covid-19/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-10-05T15:03:14+00:00"}