{"result_id": "275035", "URL": "https://southfront.org/the-new-world-order-crisis-and-the-reproduction-of-real-life-food-water-and-energy-three-fundamental-necessities-of-life-in-jeopardy/", "timestamp": "2023-04-25 17:10:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/the-new-world-order-crisis-and-the-reproduction-of-real-life-food-water-and-energy-three-fundamental-necessities-of-life-in-jeopardy/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "The New World Order Crisis and “The Reproduction of Real Life”: Food, Water and Energy. Three Fundamental Necessities of Life in Jeopardy", "cleaned_text": "The scale and complexity of the 2020-2023 Global Economic and Social Crisis far surpasses all previous “depressions” including the 2007-2009 Recession which was categorized as the most serious economic meltdown since the Great Depression of 1929.\n\nWe are currently at the crossroads of the Most Serious Economic and Social Crisis in World History. It is an outright war against all humanity: the Planet’s 8 billion people.\n\nThe current global crisis (2020-2023) –which is ongoing– has literally disrupted and destroyed people’s lives Worldwide in the course of the last three years.\n• the relentless destabilization of the global economy resulting in mass poverty, famines,\n• the destabilization of the Nation State, the destruction of democracy,\n• the hikes in the prices of energy and food,\n• the demise of international diplomacy, the threat of nuclear war.\n\nThe article below was written fifteen years ago in June 2008 at the height of the 2007-2009 Economic Crisis.\n\nThe focus is on “Food, Water and Fuel. Three Fundamental Necessities of Life in Jeopardy”. Needless to say, these concepts have a direct bearing on our understanding of the ongoing 2020-2023 Economic and Social Crisis.\n\nAccess to Food, Water and Energy pertains to the “Reproduction of Real Life” which is the very basis of human civilization.\n\n“Reproduction of Real Life” is not limited to “Basic Human Needs” (e.g. privatization of water, reproduction of the agricultural cycle). It also pertains to the concurrent reproduction of the institutions of civil society including schools and universities, science, knowledge, social and family relations, the structures of the nation state, justice, culture, history, international relations, all of which are currently in jeopardy.\n\nThe article also focusses on the U.S. population control agenda as contained in the National Security Study Memorandum 200 (NSSSM 200) formulated during the Nixon Administration.\n\nThe U.S. Congress set up a Commission on “Population Growth and the American Future”. (See Center for Research on Population and Security).\n\nUnder the helm of Henry Kissinger, the Commission’s unspoken objective was to curb World population with a view to serving US strategic and national security interests.\n\nIt is worth noting that the NSSSM 200 has been the source of inspiration of Klaus Schwab, et al in the formulation of the World Economic Forum’s Depopulation Agenda.\n\nWhat is at stake is a project formulated by the financial elites to undermine the “Reproduction of Real Life”, whereby large sectors of the World population will be precipitated into abysmal poverty and despair.\n\nThree Fundamental Necessities of Life in Jeopardy\n\nThe sugar coated bullets of the “free market” are killing our children. The act to kill is instrumented in a detached fashion through computer program trading on the New York and Chicago mercantile exchanges, where the global prices of rice, wheat and corn are decided upon.\n\nPoverty is not solely the result of policy failures at a national level. People in different countries are being impoverished simultaneously as a result of a global market mechanism. A small number of financial institutions and global corporations have the ability to determine, through market manipulation, the standard of living of millions of people around the World.\n\nWe are at the crossroads of the most serious economic and social crisis in modern history. The process of global impoverishment unleashed at the outset of the 1980s debt crisis has reached a major turning point, leading to the simultaneous outbreak of famines in all major regions of the developing World.\n\nThere are many complex features underlying the global economic crisis pertaining to financial markets, the decline in production, the collapse of State institutions and the rapid development of a profit-driven war economy. What is rarely mentioned in this analysis, is how this global economic restructuring forcibly impinges on three fundamental necessities of life: food, water and fuel.\n\nThe provision of food, water and fuel is a precondition of civilized society: they are necessary factors for the survival of the human species. In recent years, the prices of these three variables has increased dramatically at the global level, with devastating economic and social consequences.\n\nThese three essential goods or commodities, which in a real sense determine the reproduction of economic and social life on planet earth , are under the control of a small number of global corporations and financial institutions.\n\nBoth the State as well as the gamut of international organizations –often referred to as the “international community”– serve the unfettered interests of global capitalism. The main intergovernmental bodies including the United Nations, the Bretton Woods institutions and the World Trade Organizations (WTO) have endorsed the New World Order on behalf of their corporate sponsors. Governments in both developed and developing countries have abandoned their historical role of regulating key economic variables as well as ensuring a minimum livelihood for their people.\n\nProtest movements directed against the hikes in the prices of food and gasoline have erupted simultaneously in different regions of the World. The conditions are particularly critical in Haiti, Nicaragua, Guatemala, India, Bangladesh. Spiraling food and fuel prices in Somalia have precipitated the entire country into a situation of mass starvation, coupled with severe water shortages. A similar and equally serious situation prevails in Ethiopia.\n\nOther countries affected by spiraling food prices include Indonesia, the Philippines, Liberia, Egypt, Sudan, Mozambique, Zimbabwe, Kenya, Eritrea, a long list of impoverished countries…, not to mention those under foreign military occupation including Iraq, Afghanistan and Palestine.\n\nMost of these labourers in Kurigram go hungry in these three months because of sheer unemployment and a rise in the price of essentials\n\nThe provision of food, water and fuel are no longer the object of governmental or intergovernmental regulation or intervention, with a view to alleviating poverty or averting the outbreak of famines.\n\nThe fate of millions of human beings is managed behind closed doors in the corporate boardrooms as part of a profit driven agenda.\n\nAnd because these powerful economic actors operate through a seemingly neutral and “invisible” market mechanism, the devastating social impacts of engineered hikes in the prices of food, fuel and water are casually dismissed as the result of supply and demand considerations.\n\nNature of the Global Economic and Social Crisis\n\nLargely obfuscated by official and media reports, both the ” food crisis” and the “oil crisis” are the result of the speculative manipulation of market values by powerful economic actors.\n\nWe are not dealing with distinct and separate food, fuel and water “crises” but with a global process of economic and social restructuring.\n\nThe dramatic price hikes of these three essential commodities is not haphazard. All three variables, including the prices of basic food staples, water for production and consumption and fuel are the object of a process of deliberate and simultaneous market manipulation.\n\nAt the heart of the food crisis is the rising price of food staples coupled with a dramatic increase in the price of fuel.\n\nConcurrently, the price of water which is an essential input into agricultural and industrial production, social infrastructure, public sanitation and household consumption has increased abruptly as a result of a Worldwide movement to privatize water resources.\n\nWe are dealing with a major economic and social upheaval, an unprecedented global crisis, characterized by the triangular relationship between water, food and fuel: three fundamental variables, which together affect the very means of human survival.\n\nIn very concrete terms, these price hikes impoverish and destroy peoples lives. Moreover, the Worldwide collapse in living standards is occurring at a time of war. It is intimately related to the military agenda. The war in the Middle East bears a direct relationship to the control over oil and water reserves.\n\nWhile water is not at present an internationally trade commodity in the same way as oil and food staples, it is also the object of market manipulation through the privatization of water.\n\nThe economic and financial actors operating behind closed doors:\n\nThe movement in global prices on the New York and Chicago mercantile exchanges bears no relationship to the costs of producing oil. The spiraling price of crude oil is not the result of a shortage of oil. It is estimated that the cost of a barrel of oil in the Middle East does not exceed 15 dollars. The costs of a barrel of oil extracted from the tar sands of Alberta, Canada, is of the order of $30 (Antoine Ayoub, Radio Canada, May 2008)\n\nThe price of crude oil is currently in excess of $120 a barrel. This market price is largely the result of the speculative onslaught.\n\nFuel enters into the production of virtually all areas of manufacturing, agriculture and the services economy.\n\nThe hikes in fuel prices have contributed, in all major regions of the World, to precipitating tens of thousands of small and medium sized businesses into bankruptcy as well as undermining and potentially paralyzing the channels of domestic and international trade.\n\nThe increased cost of gasoline at the retail level is leading to the demise of local level economies, increased industrial concentration and a massive centralization of economic power in the hands of a small number of global corporations. In turn, the hikes in fuel backlash on the urban transit system, schools and hospitals, the trucking industry, intercontinental shipping, airline transportation, tourism, recreation and most public services.\n\nThe rise in fuel prices unleashes a broader inflationary process which results in a compression of real purchasing power and a consequent Worldwide decline in consumer demand. All major sectors of society, including the middle classes in the developed countries are affected.\n\nThese price movements are dictated by the commodity markets. They are the result of speculative trade in index funds, futures and options on major commodity markets including the London ICE, the New York and Chicago mercantile exchanges.\n\nThe dramatic price hikes are not the result of a shortage of fuel, food or water.\n\nThis upheaval in the global economy is deliberate. The State’s economic and financial policies are controlled by private corporate interests. Speculative trade is not the object of regulatory policies. The economic depression contributes to wealth formation, to enhancing the power of a handful of global corporations\n\nAmong the main players in the speculative market for crude oil are Goldman Sachs, Morgan Stanley, British Petroleum (BP), the French banking conglomerate Société Générale, Bank of America, the largest Bank in the US, and Switzerland’s Mercuria. (See Miguel Angel Blanco, La Clave, Madrid, June 2008)\n\nBritish Petroleum controls the London based International Petroleum Exchange (IPE), which is one of the world’s largest energy futures and options exchanges. Among IPE’s major shareholders are Goldman Sachs and Morgan Stanley.\n\nAccording to , Morgan Stanley is one of the main institutional actors in the London based speculative oil market (IPE). According to Société Générale together with Bank of America and Deutsche Bank have been involved in spreading rumors with a view to pushing up the price of crude oil. (See Miguel Angel Blanco, La Clave, Madrid, June 2008)\n\nThe global food crisis, characterized by major hikes in the prices of basic food staples, has spearheaded millions of people around the World into starvation and chronic deprivation.\n\nAccording to the FAO, the price of grain staples has increased by 88% since March 2007. The price of wheat has increased by 181% over a three year period. The price of rice has increased by 50% over the last three months (See Ian Angus, Food Crisis: “The greatest demonstration of the historical failure of the capitalist model”, Global Research, April 2008):\n\nThe price of rice has tripled over a five year period, from approximately 600$ a ton in 2003 to more than 1800$ a ton in May 2008. (see chart below)\n\n“The most popular grade of Thailand rice sold for $198 a ton, five years ago and $323 a ton a year ago. In April 2008, the price hit $1,000. Increases are even greater on local markets — in Haiti, the market price of a 50 kilo bag of rice doubled in at the end of March 2008. These increases are catastrophic for the 2.6 billion people around the world who live on less than US$2 a day and spend 60% to 80% of their incomes on food. Hundreds of millions cannot afford to eat” (Ibid)\n\nThe main actors in the grain market are Cargill and Archer Daniels Midland (ADM). These two corporate giants control a large share of the global grain market. They are also involved in speculative transactions in futures and options on the NYMEX and the Chicago Board of Trade (CBOT). In the US, “the world’s largest grower of GM crops, Cargill, ADM and competitor Zen Noh between them control 81 per cent of all maize exports and 65 per cent of all soyabean exports.” ( Greg Muttitt, Control Freaks, Cargill and ADM, The Ecologist, March, 2001)\n\nSince the early 1980s coinciding with the onslaught of the debt crisis, the gamut of neoliberal macroeconomic policy reforms have largely contributed to undermining local agriculture. Over the last 25 years, food farming in developing countries has been destabilized and destroyed by the imposition of IMF-World Bank reforms.\n\nCommodity dumping of grain surpluses from the US, Canada and the European Union has led to the demise of food self-sufficiency and the destruction of the local peasant economy. In turn, this process has resulted in multibillion dollar profits for Western agribusiness, resulting from import contracts by developing countries, which are no longer able to produce their own food.\n\nThese preexisting historical conditions of mass poverty have been exacerbated and aggravated by the recent surge in grain prices, which have led in some cases to the doubling of the retail price of food staples.\n\nThe price hikes has also been exacerbated by the use of corn to produce ethanol. In 2007, global production of corn was of the order of 12.32 billion bushels of which 3.2 billion were used for ethanol production. Almost 40 percent of corn production in the US will be channeled towards ethanol\n\nCoinciding with the establishment the World Trade Organization (WTO) in 1995, another important historical change has occurred in the structure of global agriculture.\n\nUnder the articles of agreement of the World Trade Organization (WTO)), the food giants have been granted unrestricted freedom to enter the seeds’ markets of developing countries.\n\nThe acquisition of exclusive “intellectual property rights” over plant varieties by international agro-industrial interests, also favors the destruction of bio-diversity.\n\nActing on behalf of a handful of biotech conglomerates GMO seeds have been imposed on farmers, often in the context of “food aid programs”. In Ethiopia, for instance, kits of GMO seeds were handed out to impoverished farmers with a view to rehabilitating agricultural production in the wake of a major drought.\n\nThe GMO seeds were planted, yielding a harvest. But then the farmer came to realize that the GMO seeds could not be replanted without paying royalties to Monsanto, Arch Daniel Midland et al.\n\nThen, the farmers discovered that the seeds would harvest only if they used the farm inputs including the fertilizer, insecticide and herbicide, produced and distributed by the biotech agribusiness companies. Entire peasant economies were locked into the grip of the agribusiness conglomerates.\n\nThe main biotech giants in GMO include Monsanto, Syngenta, Aventis, DuPont, Dow Chemical, Cargill and Arch Daniel Midland.\n\nWith the widespread adoption of GMO seeds, a major transition has occurred in the structure and history of settled agriculture since its inception 10,000 years ago.\n\nThe reproduction of seeds at the village level in local nurseries has been disrupted by the use of genetically modified seeds. The agricultural cycle, which enables farmers to store their organic seeds and plant them to reap the next harvest has been broken. This destructive pattern – invariably resulting in famine – is replicated in country after country leading to the Worldwide demise of the peasant economy.\n\nAt the June 2008 FAO Rome Summit on the food crisis, politicians and economic analysts alike embraced the free market consensus: the outbreak of famines was presented as a result of the usual supply, demand and climatic considerations, beyond the control of policy-makers. “The solution”: channel emergency relief to affected areas under the auspices of the World Food Program (WFP). Do not intervene with the interplay of market forces.\n\nIronically, these ” expert opinions” are refuted by the data on global grain production: the FAO forecasts for world cereal production point to a record output in 2008.\n\nContradicting their own textbook explanations, World prices are, according to the World Bank, expected to remain high, despite the forcasted increased supply of food staples.\n\nState regulation of the prices of food staples and gasoline is not considered an option in the corridors of the FAO and the World Bank. And of course that is what is taught in the economics departments of America’s most prestigious universities.\n\nMeanwhile, local level farmgate prices barely cover production costs, spearheading the peasant economy into bankruptcy.\n\nAccording to UN sources, which vastly underestimate the seriousness of the water crisis, one billion people worldwide (15% of the World population) have no access to clean water “and 6,000 children die every day because of infections linked to unclean water” (BBC News, 24 March 2004)\n\nA handful of global corporations including Suez, Veolia, Bechtel-United Utilities, Thames Water and Germany’s RWE-AG are acquiring control and ownership over public water utilities and waste management. Suez and Veolia hold about 70 percent of the privatized water systems Worldwide.\n\nThe privatization of water under World Bank auspices feeds on the collapse of the system of public distribution of safe tap drinking water:\n\n“The World Bank serves the interests of water companies both through its regular loan programs to governments, which often come with conditions that explicitly require the privatization of water provision…” (Maude Barlow and Tony Clarke, Water Privatization: The World Bank’s Latest Market Fantasy, Polaris Institute, Ottawa, 2004))\n\n“The modus operandi [in India] is clear — neglect development of water resources [under World Bank budget austerity measures], claim a “resource crunch” and allow existing systems to deteriorate.” (Ann Ninan, Private Water, Public Misery, India Resource Center April 16, 2003)\n\nMeanwhile, the markets for bottled water have been appropriated by a handful of corporations including Coca-Cola, Danone, Nestlé and PepsiCo. These companies not only work hand in glove with the water utility companies, they are linked up to the agribusiness-biotech companies involved in the food industry.\n\nTap water is purchased by Coca-Cola from a municipal water facility and then resold on a retail basis. It is estimated that in the US, 40 percent of bottled water is tap water. (See, Jared Blumenfeld, Susan Leal The real cost of bottled water, San Francisco Chronicle, February 18, 2007)\n\nIn India, Coca-Cola has contributed to the depletion of ground water to the detriment of local communities:\n\n“Communities across India living around Coca-Cola’s bottling plants are experiencing severe water shortages, directly as a result of Coca-Cola’s massive extraction of water from the common groundwater resource. The wells have run dry and the hand water pumps do not work any more. Studies, including one by the Central Ground Water Board in India, have confirmed the significant depletion of the water table.\n\nWhen the water is extracted from the common groundwater resource by digging deeper, the water smells and tastes strange. Coca-Cola has been indiscriminately discharging its waste water into the fields around its plant and sometimes into rivers, including the Ganges, in the area. The result has been that the groundwater has been polluted as well as the soil. Public health authorities have posted signs around wells and hand pumps advising the community that the water is unfit for human consumption….\n\nTests conducted by a variety of agencies, including the government of India, confirmed that Coca-Cola products contained high levels of pesticides, and as a result, the Parliament of India has banned the sale of Coca-Cola in its cafeteria. However, Coca-Cola not only continues to sell drinks laced with poisons in India (that could never be sold in the US and EU), it is also introducing new products in the Indian market. And as if selling drinks with DDT and other pesticides to Indians was not enough, one of Coca-Cola’s latest bottling facilities to open in India, in Ballia, is located in an area with a severe contamination of arsenic in its groundwater.(India Resource Center, Coca-Cola Crisis in India, undated)\n\nIn developing countries, the hikes in fuel prices have increased the costs of boiling tap water by households, which in turn favors the privatization of water resources.\n\nIn the more advanced phase of water privatization, the actual ownership of lakes and rivers by private corporations is contemplated. Mesopotamia was not only invaded for its extensive oil resources, the Valley of the two rivers (Tigris and Euphrates) has extensive water reserves.\n\nWe are dealing with a complex and centralized constellation of economic power in which the instruments of market manipulation have a direct bearing on the lives of millions of people.\n\nThe prices of food, water, fuel are determined at the global level, beyond the reach of national government policy. The price hikes of these three essential commodities constitute an instrument of “economic warfare”, carried out through the “free market” on the futures and options exchanges.\n\nThese hikes in the prices of food, water and fuel are contributing in a very real sense to “eliminating the poor” through “starvation deaths”.\n\nThe sugar coated bullets of the “free market” kill our children. The act to kill is instrumented in a detached fashion through computer program trading on the commodity exchanges, where the global prices of rice, wheat and corn are decided upon.\n\n‘The Commission on Population Growth and the American Future’\n\nBut we are not dealing solely with market concepts. The outbreak of famines in different parts of the World, resulting from spiraling food and fuel prices have broad strategic and geopolitical implications.\n\nPresident Richard Nixon at the outset of his term in office in 1969 asserted\n\nHenry Kissinger, who at the time was Nixon’s National Security adviser, directed various agencies of government to jointly undertake “a study of the impact of world population growth on U.S. security and overseas interests.”\n\nIn March 1970, the U.S. Congress set up a Commission on Population Growth and the American Future. (See Center for Research on Population and Security).\n\nThe Commission was no ordinary Task Force. It integrated representatives from USAID, the State Department and the Department of Agriculture with CIA and Pentagon officials. Its objective was not to assist developing countries but rather to curb World population with a view to serving US strategic and national security interests. The Commission also viewed population control as a means to ensuring a stable and secure environment for US investors as well as gaining control over developing countries’ mineral and petroleum resources.\n\nThis Commission completed its work in December 1974 and circulated a classified document entitled\n\nNational Security Study Memorandum 200: Implications of Worldwide Population Growth for U.S. Security and Overseas Interests”\n\nto “designated Secretaries and Agency heads for their review and comments.”\n\nIn November 1975, the report and its recommendations were endorsed by President Gerald Ford.\n\nThe Report focusses strictly on Population Control. The issue of Depopulation is not formally addressed.\n\nThe National Security Study Memorandum 200 (NSSSM 200) does however intimate the following: that in certain countries a recurrence of hunger mines, disease and war could constitute a de facto instrument of population control.\n\n“Accordingly, those countries where large-scale hunger and malnutrition are already present face the bleak prospect of little, if any, improvement in the food intake in the years ahead barring a major foreign financial food aid program, more rapid expansion of domestic food production, reduced population growth or some combination of all three. Worse yet, a series of crop disasters could transform some of them into classic Malthusian cases with famines involving millions of people.\n\nWhile foreign assistance probably will continue to be forthcoming to meet short-term emergency situations like the threat of mass starvation, it is more questionable whether aid donor countries will be prepared to provide the sort of massive food aid called for by the import projections on a long-term continuing basis.\n\nReduced population growth rates clearly could bring significant relief over the longer term…..\n\nIn the extreme cases where population pressures lead to endemic famine, food riots, and breakdown of social order, those conditions are scarcely conducive to systematic exploration for mineral deposits or the long-term investments required for their exploitation.\n\nShort of famine, unless some minimum of popular aspirations for material improvement can be satisfied, and unless the terms of access and exploitation persuade governments and peoples that this aspect of the international economic order has “something in it for them,” concessions to foreign companies are likely to be expropriated or subjected to arbitrary intervention.\n\nWhether through government action, labor conflicts, sabotage, or civil disturbance, the smooth flow of needed materials will be jeopardized.\n\nAlthough population pressure is obviously not the only factor involved, these types of frustrations are much less likely under conditions of slow or zero population growth.”\n\nThe report concludes with a couple of key questions pertaining to the role of food as “an instrument of national power”, which could be used in the pursuit of US strategic interests.\n• “On what basis should such food resources then be provided? Would food be considered an instrument of national power? Will we be forced to make choices as to whom we can reasonably assist, and if so, should population efforts be a criterion for such assistance?\n• Is the U.S. prepared to accept food rationing to help people who can’t/won’t control their population growth?” (Ibid, emphasis added)\n\nIn the words of Henry Kissinger:\n\n“Control oil and you control nations; control food and you control the people.”\n\nCorporate Actors highlighted in this article (among many other important corporate actors)\n\nThe Globalization of Poverty and the New World Order\n\nIn this new and expanded edition of Chossudovsky’s international best-seller, the author outlines the contours of a New World Order which feeds on human poverty and the destruction of the environment, generates social apartheid, encourages racism and ethnic strife and undermines the rights of women. The result as his detailed examples from all parts of the world show so convincingly, is a globalization of poverty.\n\nThis book is a skilful combination of lucid explanation and cogently argued critique of the fundamental directions in which our world is moving financially and economically.\n\nIn this new enlarged edition –which includes ten new chapters and a new introduction– the author reviews the causes and consequences of famine in Sub-Saharan Africa, the dramatic meltdown of financial markets, the demise of State social programs and the devastation resulting from corporate downsizing and trade liberalisation.\n\nMichel Chossudovsky is Professor of Economics at the University of Ottawa and Director of the Centre for Research on Globalization (CRG), which hosts the critically acclaimed website www.globalresearch.ca . He is a contributor to the Encyclopedia Britannica. His writings have been translated into more than 20 languages.\n\nPublished in 11 languages. More than 100,000 copies sold Worldwide.\n\nTO ORDER ONLINE OR MAIL ORDER CLICK HERE\n\nNote: at present. The print version is not available. The pdf version can be ordered online.\n\nMORE ON THE TOPIC:\n• Russia Turned To Creative Diplomacy To Stabilize The Global Food Market", "opengraph": {"locale": "en_GB", "type": "article", "title": "The New World Order Crisis and “The Reproduction of Real Life”: Food, Water and Energy. Three Fundamental Necessities of Life in Jeopardy", "description": "An Outright War against all Humanity: the Planet’s 8 Billion people Written by Prof Michel Chossudovsky. Originally published on GlobalResearch...", "url": "https://southfront.org/the-new-world-order-crisis-and-the-reproduction-of-real-life-food-water-and-energy-three-fundamental-necessities-of-life-in-jeopardy/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2023-03-21T19:48:34+00:00", "article:modified_time": "2023-03-26T19:24:41+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2023/03/food_crisis.jpg", "image:width": "1567", "image:height": "1036", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/food_crisis.jpg", "https://www.globalresearch.ca/author/michel-chossudovsky", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/kissinger.jpg", "https://pdf.usaid.gov/pdf_docs/Pcaab500.pdf", "http://www.population-security.org/mumf-93-01.htm", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/Ethiopia-famine.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/oil_prices_1.png", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/Oil_prices_2.png", "http://www.globalresearch.ca/index.php?context=va&aid=9042", "http://www.globalresearch.ca/index.php?context=va&aid=8836", "http://findarticles.com/p/articles/mi_m2465/is_2_31/ai_71634862", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/rice.png", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/wheat.png", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/corn.png", "http://news.bbc.co.uk/2/hi/africa/4375409.stm", "http://www.globalpolicy.org/socecon/bwi-wto/wbank/2004/01waterpriv.htm", "http://www.indiaresource.org/issues/water/2003/privatewaterpublicmisery.html", "http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2007/02/18/EDG56N6OA41.DTL", "http://www.indiaresource.org/news/2004/1020.html", "http://www.indiaresource.org/news/2003/4725.html", "http://www.indiaresource.org/campaigns/coke/2004/coketwist.html", "http://www.indiaresource.org/news/2004/1045.html", "http://www.indiaresource.org/campaigns/coke/index.html", "https://www.globalresearch.ca/wp-content/uploads/2015/06/kissinger-nixon.jpg", "http://www.population-security.org/mumf-93-01.htm", "https://pdf.usaid.gov/pdf_docs/Pcaab500.pdf", "https://s2.cdnstatic.space/wp-content/uploads/2023/03/kissinger-report.png", "https://pdf.usaid.gov/pdf_docs/Pcaab500.pdf", "https://www.globalresearch.ca/wp-content/uploads/2022/05/kissinger-quote.png", "https://pdf.usaid.gov/pdf_docs/Pcaab500.pdf", "https://store.globalresearch.ca/store/the-globalization-of-poverty-and-the-new-world-order/", "http://globalresearch.ca/articles/ONE311A.html", "http://www.globalresearch.ca/", "https://store.globalresearch.ca/store/the-globalization-of-poverty-and-the-new-world-order/", "https://southfront.org/russia-turned-to-peoples-diplomacy-to-stabilize-the-global-food-market/", "https://southfront.org/embarrassed-truth-behind-the-global-food-war/", "https://southfront.org/baguette-listings-why-food-is-politics/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2023-03-21T19:48:34+00:00"}