{"result_id": "275022", "URL": "https://southfront.org/suicidal-games-tokyos-coronavirus-olympics/", "timestamp": "2023-04-25 17:10:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/suicidal-games-tokyos-coronavirus-olympics/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Suicidal Games: Tokyo’s Coronavirus Olympics", "cleaned_text": "A pandemic crisis. A state of emergency. Overwhelming public opinion bristling with alarm. Notwithstanding these factors, Tokyo is still on track to host the Olympics that was cancelled last year in response to the global pandemic. The first sports team – Australia’s softball crew – has touched down. Is all this folly, bravery or self-interest?\n\nOn a daily basis, the tally of reasons against holding the games grows. Currently, the Japanese capital and nine other regions in the country labour under a declared state of emergency, one that will extend, at the very least, to June 20. Overseas fans have been barred and some 600,000 tickets refunded. Travel warnings have been registered, none more unequivocal than the US State Department’s advisory: “Do not travel to Japan due to COVID-19.” As the grave Prime Minister Yoshihide Suga warned, “The next three weeks are an extremely important period in achieving results in infection prevention and vaccine inoculation, a two-pronged strategy.”\n\nAn important point here is the sheer porcine obstinacy of the administration wonks whose very existence depends on an event that takes place every four years. They form what can only be described as the “show must go on” brigade, given the billions of dollars at stake regarding television rights. These furnish the International Olympic Committee some 75 percent of its income, with the US broadcaster NBC being the major contributor.\n\nThe President of the IOC, Thomas Bach, has shown little concern as to what Japan is facing in terms of public health. “We have to make some sacrifices to make [the games] possible.” World Athletics President and IOC member Sebastian Coe is convinced that competitors will be “hermitically sealed from local people”.\n\nThe IOC vice-president John Coates, filled with the lunatic spirit of the Light Brigade, insists that the games proceed as scheduled. “The Prime Minister of Japan said that to the President of the United States two or three weeks ago,” Coates told reporters after the AOC annual general meeting in Sydney. “He continues to say that to the IOC.” Coates felt that the “playbook” of health regulations covering participants was an adequate “guide for a safe and successful games”.\n\nAdministrators such as Coates have taken it upon themselves to assume some depth of public health knowledge. Regarding the situation in Japan, he was happy to prognosticate. “The numbers [of infections] are very small, particularly amongst the elderly. And so as the vaccine is rolled out in Japan, I think that will improve.” It was incumbent, he urged, that Japanese authorities reassure the public that all was well and that the safety measures were more than adequate.\n\nThe much touted Tokyo 2020 Playbook has had a few iterations. As it stands, an extensive testing regime will be in place both before, during and after the event. Social interaction will be limited. Eating is to take place in designated areas. The use of public transportation and sightseeing is prohibited. Athletes must abide by various rules or be barred from competing: undergo testing at least once every four days, maintain a distance of 6 feet apart, eschew high-fives, hugging or sex. The latter injunction is to read alongside the odd promise to distribute 150,000 free condoms, a classic example of absurd committee logic.\n\nSeiko Hashimoto, President of the Tokyo Olympic organising committee, is almost blithe in assuming that the crisis will plateau. With pandemic restrictions in place, there was an expectation that “the infection situation” would “improve”. “Once the state of emergency is lifted, we will assess how many spectators we can allow in.”\n\nTokyo 2020 CEO Toshiro Muto, in response to objections being levelled at holding the games, considered it “natural” that “different media organisations have different views”. As with other organisers, he felt that the “stringent measures” that had been put in place by national and local governments would improve the situation.\n\nIn the face of all of this is a clamour for the game’s cancellation. This is the position taken by the Japanese paper , an official Games sponsor which has called upon Prime Minister Suga to “make a calm, objective assessment of the situation and make the decision to cancel this summer’s Olympics.” The editors also took issue with the “self-righteous” disposition of Coates and other IOC Committee leaders, rebuking them for being “out of step” with Japanese public opinion. “Saying ‘yes’ without demonstrating any clear grounds for it once again drove the self-righteous image of the IOC.”\n\nOthers have been even more acid in their comments. The chief of the Japanese online retailer Rakuten, Hiroshi Mikitani is baffled by the determination of administrators to proceed with the event. “The fact that we are so late for the vaccinations, it’s really dangerous to host the big international event.” To hold it would be tantamount to staging “a suicide mission”. Chief executive of the Softbank Group, Masayoshi Son, has issued dire warnings about 100,000 people from 200 countries descending “on vaccine-laggard Japan”. The arrival of mutant variants could see the loss of more lives, the need for subsidies and more economic losses. “If we consider what the public has to endure, I think we could have a lot more to lose.”\n\nMost troubling of all for concerned Japanese citizens is the way Suga’s government has ceded authority to the IOC in what can only be regarded as a disgraceful abdication of responsibility. Last month, the prime minister went so far as to defer authority to the sporting body: “the IOC has the authority to decide”. No wonder Bach and Coates are so confident.\n\nDr. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. Email:\n\nMORE ON THE TOPIC:\n• How It All Went Wrong: The Global Response To COVID-19\n• That Old Story: Spying On Friends", "opengraph": {"locale": "en_GB", "type": "article", "title": "Suicidal Games: Tokyo’s Coronavirus Olympics", "description": "Written by Dr. Binoy Kampmark. A pandemic crisis.  A state of emergency.  Overwhelming public opinion bristling with alarm.  Notwithstanding these...", "url": "https://southfront.org/suicidal-games-tokyos-coronavirus-olympics/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-06-03T12:05:38+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/01/GettyImages-1205265714.jpg", "image:width": "1600", "image:height": "1094", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2021/01/GettyImages-1205265714.jpg", "https://www.cntraveler.com/story/tokyo-olympics-foreign-spectators#:~:text=International%20spectators%20will%20not%20be,IPC)%2C%20and%20local%20organizers.", "https://travel.state.gov/content/travel/en/traveladvisories/traveladvisories/japan-travel-advisory.html#:~:text=Do%20not%20travel%20to%20Japan%20due%20to%20COVID%2D19.&text=The%20Centers%20for%20Disease%20Control,U.S.%20citizen%20entry%20into%20Japan.", "https://www.bbc.com/news/world-asia-57277344", "https://www.abc.net.au/news/2021-01-23/lord-sebastian-coe-world-athletics-olympic-games/13084578", "https://www.theguardian.com/sport/2021/may/24/tokyo-olympics-anger-japan-ioc-coronavirus-sacrifices", "https://www.insidethegames.biz/articles/1107862/rakuten-chief-tokyo-2020-suicide-mission#:~:text=Previous%20Next-,Rakuten%20chief%20describes%20Tokyo%202020%20as%20a%20%22suicide%20mission,due%20to%20COVID%2D19%20threat&text=Rakuten%20chief%20executive%20Hiroshi%20Mikitani,organisers%20to%20cancel%20the%20event.", "https://www.abc.net.au/news/2021-05-08/coates-says-opposition-concern-but-tokyo-olympics-will-go-ahead/100126152", "https://olympics.com/tokyo-2020/en/games/tokyo-2020-playbooks/", "https://www.insider.com/tokyo-olympics-athletes-condoms-social-distancing-2021-2", "https://www.bbc.com/news/world-asia-57277344", "https://www.japantimes.co.jp/news/2021/05/26/national/asahi-shimbun-olympic-editorial/#:~:text=The%20Asahi%20Shimbun%20newspaper%2C%20an,months%20before%20the%20opening%20ceremony.", "https://www.japantimes.co.jp/news/2021/05/26/national/asahi-shimbun-olympic-editorial/#:~:text=The%20Asahi%20Shimbun%20newspaper%2C%20an,months%20before%20the%20opening%20ceremony.", "https://www.insidethegames.biz/articles/1107862/rakuten-chief-tokyo-2020-suicide-mission#:~:text=Previous%20Next-,Rakuten%20chief%20describes%20Tokyo%202020%20as%20a%20%22suicide%20mission,due%20to%20COVID%2D19%20threat&text=Rakuten%20chief%20executive%20Hiroshi%20Mikitani,organisers%20to%20cancel%20the%20event.", "https://www.theguardian.com/sport/2021/may/24/tokyo-olympics-anger-japan-ioc-coronavirus-sacrifices", "mailto:bkampmark@gmail.com", "https://southfront.org/how-it-all-went-wrong-the-global-response-to-covid-19/", "https://southfront.org/that-old-story-spying-on-friends/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-06-03T12:05:38+00:00"}