{"result_id": "275033", "URL": "https://southfront.org/ags-slam-white-house-over-multiple-examples-of-big-tech-collusion-to-censor-dissent/", "timestamp": "2023-04-25 17:10:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/ags-slam-white-house-over-multiple-examples-of-big-tech-collusion-to-censor-dissent/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "AGs Slam White House Over Multiple Examples Of Big Tech Collusion To Censor Dissent", "cleaned_text": "At least two state Attorneys General have slammed the White House for colluding with social media companies to censor dissent.\n\nMissouri Attorney General Andrew Bailey highlighted this effort in a Friday Twitter thread, noting how the Biden White House directed Twitter and Facebook to censor Robert Kennedy Jr., Tucker Carlson and Tomi Lahren.\n\nIn another example, YouTube assures a government employee that they use machine learning to ‘reduce the recommendations’ of wrongthink.\n\nMeanwhile, Louisiana AG Jeff Landry slammed the Biden White House over the Tucker Carlson censorship.\n\nLandry shared the document—an email exchange between White House Director of Digital Strategy Rob Flaherty and an unidentified Facebook employee—in a Jan. 7 post on Twitter, with the comment: “Rob Flaherty tells facebook to censor” Tucker Carlson.\n\n“Since we’ve been on the phone—the top post about vaccines today is [T]ucker Carlson saying they don’t work. Yesterday it was Tomi Lehren [sic] saying she won’t take one,” Flaherty reportedly said in the message to the Facebook staffer, whose name and email address have been redacted.\n\n“This is exactly why I want to know what ‘Reduction’ actually looks like—if ‘reduction’ means ‘pumping our most vaccine hesitant audience with [T]ucker Carlson saying it doesn’t work’ then … I’m not sure it’s reduction!” Flaherty continued, per the document shared by Landry.\n\nSignaling action regarding the request, the unidentified Facebook employee then reportedly wrote: “Running this down now.”\n\nThe Epoch Times has reached out with a request for comment to Facebook parent Meta, Fox News Channel, and the White House, but no reply was received by publication.\n\nLandry, together with Missouri Attorney General Eric Schmitt, sued the Biden administration in May 2022 for allegedly pressuring and colluding with social media giants to suppress free speech.\n\nSchmitt on Jan. 5 was sworn in as a U.S. senator and has been replaced in his role as Missouri attorney general by Andrew Bailey.\n\nBailey took to Twitter on Jan. 7 to say that when he took the oath of office, he swore he would protect the Constitution and explained “why.”\n\n“We now have hard evidence that President Biden’s Administration colluded with social media companies to censor differing viewpoints and silence ‘misinformation’ that was later deemed true,” Bailey wrote in a series of posts.\n\nBailey shared a screenshot of an email from White House COVID-19 Digital Director Clarke E. Humphrey to an unidentified Twitter employee with the subject line “Flagging Hank Aaron misinfo” and requesting the Twitter staff to “get moving on the process for having it removed ASAP.”\n\nIn her request, Humphrey provided a link to a Twitter post by Robert F. Kennedy Jr., a known critic of the Biden administration’s narrative on COVID-19 vaccines.\n\nThe offending tweet links to an article on the website of the Children’s Health Defense, an activist group chaired by Kennedy Jr. that left-leaning Wikipedia labels as “one of the main sources of misinformation on vaccines.”\n\nThe article, from Jan. 22, 2021, says Aaron died 18 days after receiving a COVID-19 vaccine of an “undisclosed cause” and cites Kennedy Jr. as saying that his “tragic death is part of a wave of suspicious deaths among elderly closely following administration of COVID vaccines.”\n\nAbout a week later, the Fulton County Medical Examiner released Aaron’s cause of death as “natural causes” and that he didn’t have any COVID-19 symptoms, with his medical history listing prostate issues and hypertension.\n\nBesides requesting action on Kennedy Jr.’s tweet, Humphrey also added a request to “keep an eye out for tweets that fall in this same genre,” per the screenshot shared by Bailey.\n\nThe Epoch Times has reached out to Twitter with a request for comment.\n\n‘The Truth No Longer Matters to the White House’\n\nBailey also shared screenshots of several other messages that he said show collusion between Big Tech and the government to suppress free speech, including another message from Flaherty to an unidentified Facebook employee in which the White House official demands “assurances” that the social media company is taking actions “to ensure you’re not making our country’s vaccine hesitancy problem worse.”\n\n“The truth no longer matters to the White House,” Bailey captioned the post.\n\n“These emails confirm what we’ve known all along,” Bailey wrote. “The Biden Admin. has been colluding with social media companies to stifle opposing voices.”\n\n“I will continue to push back against this blatant attack on the 1st Amendment with every tool at my disposal,” he added.\n\nWith Schmitt gone as attorney general, Bailey has taken his place as a plaintiff in the lawsuit against President Joe Biden, then-White House press secretary Jen Psaki, Dr. Anthony Fauci, and other administration officials.\n\nThe lawsuit claims that Biden and other government officials worked with Big Tech companies like Meta, Twitter, and YouTube to censor conversation around matters relating to everything from COVID-19 and election integrity to the Hunter Biden laptop story, doing so under the guise of battling “misinformation.”\n\nThe two Republican-led states accuse Biden and other officials named in the lawsuit of “falsely” attacking the Hunter Biden laptop story as “disinformation.”\n\nThe story, which was first published by the New York Post in October 2020, detailed the contents of a laptop linked to Hunter Biden, President Joe Biden’s son. The laptop was abandoned in a Delaware computer repair shop and included compromising pictures and emails regarding allegedly corrupt foreign business deals.\n\nTwitter labeled the story as “potentially harmful” and locked the New York Post’s main Twitter account while also blocking Twitter users from publishing the link to the story.\n\nGOP to Investigate ‘Weaponization of the Federal Government’\n\nIt comes as House Republicans have pledged to investigate allegations of collusion between federal agencies and private companies, and to do so, they’re looking to establish a subcommittee on the “weaponization” of the federal government.\n\nMORE ON THE TOPIC:\n• The U.S. Regime Made Me A Non-Person\n• THE TWITTER FILES: How Twitter Rigged The Covid Debate", "opengraph": {"locale": "en_GB", "type": "article", "title": "AGs Slam White House Over Multiple Examples Of Big Tech Collusion To Censor Dissent", "description": "Originally published by ZeroHedge At least two state Attorneys General have slammed the White House for colluding with social media companies...", "url": "https://southfront.org/ags-slam-white-house-over-multiple-examples-of-big-tech-collusion-to-censor-dissent/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2023-01-09T12:18:41+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2023/01/tucker-2.jpg", "image:width": "700", "image:height": "420", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://assets.zerohedge.com/s3fs-public/styles/inline_image_mobile/public/inline-images/tucker%202.jpg?itok=_ZhWU82x", "https://www.zerohedge.com/political/ags-slam-white-house-over-multiple-examples-big-tech-collusion-censor-dissent", "https://twitter.com/AGAndrewBailey/status/1611568546030522370?s=20", "https://www.theepochtimes.com/white-house-pushed-facebook-to-censor-tucker-carlson-on-covid-19-vaccines-ag-landry_4968830.html", "https://www.theepochtimes.com/white-house-pushed-facebook-to-censor-tucker-carlson-on-covid-19-vaccines-ag-landry_4968830.html", "https://twitter.com/AGJeffLandry/status/1611509683818270720?s=20&t=Sqso0aZlPmq_ivDdOilpgQ", "https://www.theepochtimes.com/2-gop-led-states-sue-biden-administration-for-pressuring-and-colluding-with-big-tech-to-censor-free-speech_4449673.html", "https://twitter.com/SenateGOP/status/1611054228092424197?s=20&t=sNOXoxiKCpMThiFDyjJ_1w", "https://twitter.com/AGAndrewBailey/status/1611568518612254722?s=20&t=3BpLOvLQgOqhit7yIGdj8g", "https://twitter.com/AGAndrewBailey/status/1611568520990539776?s=20&t=3BpLOvLQgOqhit7yIGdj8g", "https://twitter.com/AGAndrewBailey/status/1611568529140064256?s=20&t=3BpLOvLQgOqhit7yIGdj8g", "https://twitter.com/RobertKennedyJr/status/1352748139665645569", "https://twitter.com/AGAndrewBailey/status/1611568562048765954?s=20&t=3BpLOvLQgOqhit7yIGdj8g", "https://twitter.com/AGAndrewBailey/status/1611568573603893248?s=20&t=3BpLOvLQgOqhit7yIGdj8g", "https://www.theepochtimes.com/republicans-plan-to-start-a-committee-to-probe-weaponization-of-the-federal-government_4958635.html", "https://www.theepochtimes.com/white-house-pushed-facebook-to-censor-tucker-carlson-on-covid-19-vaccines-ag-landry_4968830.html", "https://southfront.org/the-u-s-regime-made-me-a-non-person/", "https://southfront.org/censorship-prohibits-spreading-truths-and-demands-spreading-lies/", "https://southfront.org/the-twitter-files-how-twitter-rigged-the-covid-debate/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2023-01-09T12:18:41+00:00"}