{"result_id": "275030", "URL": "https://southfront.org/russias-sputnik-v-covid-vaccine-a-surprise-global-hit/", "timestamp": "2023-04-25 17:10:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/russias-sputnik-v-covid-vaccine-a-surprise-global-hit/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Russia's \"Sputnik V\" COVID Vaccine A Surprise Global Hit", "cleaned_text": ", one of the most implicitly pro-western media outlets in existence, has finally admitted, after months of promoting skepticism, that Russian COVID-19 vaccine trail data published by shows that the Kremlin might have a surprise international success. Just days after columnist Thomas Friedman accused President Putin of trusting “what comes out of the ground more than the stuff that might come out of his people’s heads,” Bloomberg reports that 20 countries, including key markets like India and Brazil, are already lining up to buy the vaccine.\n\nWith an efficacy rate above 90%, Russia’s vaccine, developed by the country’s Gamelaya Institute with support from Russia’s sovereign wealth fund, has been found to be more effective than China’s, which is why several countries – including EU member Hungary, are lining up to buy it.\n\nAt least 20 countries have approved the inoculation for use, including European Union member-state Hungary, while key markets such as Brazil and India are close to authorizing it. Now Russia is setting its sights on the prized EU market as the bloc struggles with its vaccination program amid supply shortages. In the global battle to defeat a pandemic that’s claimed 2.3MM lives in little more than a year, the race to obtain vaccines has assumed geopolitical significance as governments seek to emerge from the huge social and economic damage caused by lockdowns imposed to limit the spread of the virus. That’s giving Russia an edge as one of a handful of countries where scientists have produced an effective defense.\n\nThe story quoted the head of the Russian sovereign wealth fund which financed the vaccine project.\n\nRegardless of the success of the vaccine, Bloomberg adds it won’t do much to change Putin’s reputation in the West.\n\nSputnik’s success won’t change hostility toward Putin among Western governments, though it could strengthen Russia’s geopolitical clout in regions such as Latin America, according to Oksana Antonenko, a director at Control Risks consultancy. “With this vaccine, it’s proven itself capable of producing something new that’s in demand around the world,” she said. Production constraints are the biggest challenge facing all manufacturers as global demand far outpaces supply. Russia, pledging free shots for its 146 million population, began output last year and the vaccine is currently being manufactured in countries including India, South Korea and Brazil.\n\nYet, despite Russia’s supervillain status with the US and Europe, frustration with Putin’s tactics has never stopped the EU from buying Russian energy products.\n\nWhy should it stop them from buying the vaccine?\n\nMORE ON THE TOPIC:\n• Main Fields Of AI Application In Armed Forces Of Leading Countries\n• GameStop Or Game Over? Day Traders Take On Wall Street", "opengraph": {"locale": "en_GB", "type": "article", "title": "Russia's \"Sputnik V\" COVID Vaccine A Surprise Global Hit", "description": "Originally appeared at ZeroHedge Bloomberg, one of the most implicitly pro-western media outlets in existence, has finally admitted, after months...", "url": "https://southfront.org/russias-sputnik-v-covid-vaccine-a-surprise-global-hit/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-02-07T08:06:46+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/02/1-10.jpg", "image:width": "1258", "image:height": "846", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://www.zerohedge.com/geopolitical/russias-sputnik-v-covid-vaccine-surprise-global-hit", "https://www.bloomberg.com/news/articles/2021-02-06/putin-s-once-scorned-vaccine-is-now-a-favorite-in-pandemic-fight?srnd=premium&sref=i4qXzk6d", "https://www.nytimes.com/2021/02/02/opinion/vladimir-putin-russia-america.html", "https://www.bloomberg.com/news/articles/2021-02-06/putin-s-once-scorned-vaccine-is-now-a-favorite-in-pandemic-fight?srnd=premium&sref=i4qXzk6d", "https://www.zerohedge.com/s3/files/inline-images/2021-02-06_11-36-24.jpg?itok=VbvwIRSH", "https://www.bloomberg.com/news/articles/2021-02-06/putin-s-once-scorned-vaccine-is-now-a-favorite-in-pandemic-fight?srnd=premium&sref=i4qXzk6d", "https://southfront.org/main-fields-of-ai-application-in-armed-forces-of-leading-countries/", "https://southfront.org/gamestop-or-game-over-day-traders-take-on-wall-street/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-02-07T08:06:46+00:00"}