{"result_id": "275034", "URL": "https://southfront.org/pfizer-employee-stole-12000-files-including-covid-19-vaccine-secrets-lawsuit-claims/", "timestamp": "2023-04-25 17:10:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/pfizer-employee-stole-12000-files-including-covid-19-vaccine-secrets-lawsuit-claims/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Pfizer Employee Stole 12,000 Files Including COVID-19 Vaccine Secrets, Lawsuit Claims", "cleaned_text": "Pfizer claims that a “soon-to-be-former employee” uploaded more than 12,000 files – including “scores” with confidential information – to her personal Google Drive account and other personal devices, a lawsuit from the company claims.\n\nThe company has accused Chun Xiao Li (“Li”) and five potential co-defendants of corporate espionage, saying Li “decided to leave Pfizer for a competitor believed to be Xenocor, Inc.”\n\nWhat’s more, Li apparently gave Pfizer a ‘decoy’ laptop to throw internal investigators off the trail.\n\nHad Ms. Li left Pfizer honorably, she would not be named in this Complaint. But she made a different choice: on her way out the door, she transferred onto personal accounts and devices over 12,000 files, scores of which contain Pfizer confidential and trade-secret information, and tried covering her tracks repeatedly. She went so far as to provide Pfizer’s security team a decoy laptop, leading Pfizer to believe it was the one she used to download the 12,000 files from her Google Drive account. Forensic analyses confirmed it was not, and Ms. Li (or somebody else, including potentially DOES 1-5) likely remains in possession of the actual computer that contains those 12,000 files.\n\nThe lawsuit seeks a temporary restraining order to prevent Li from using, disclosing, transmitting or altering any confidential information she stole, per .\n\nLi’s tenure with Pfizer began in 2006 at their Global Product Development Group in China, before transferring to the company’s La Jolla, California campus in 2016. She had signed a confidentiality agreement as part of her employment.\n\nHer alleged theft was first detected as part of routine tracking of employee activity on company devices in October, when she transferred 12,000 files from her Pfizer laptop, per the complaint.\n\nMORE ON THE TOPIC:\n• Pfizer In Hot Water After Listing Herzliya Medical Center As Located In “Palestine”\n• More And More Deaths Emerge From Pfizer Vaccine ‘Success Story’", "opengraph": {"locale": "en_GB", "type": "article", "title": "Pfizer Employee Stole 12,000 Files Including COVID-19 Vaccine Secrets, Lawsuit Claims", "description": "Originally published on ZeroHedge Pfizer claims that a “soon-to-be-former employee” uploaded more than 12,000 files – including “scores” with confidential information...", "url": "https://southfront.org/pfizer-employee-stole-12000-files-including-covid-19-vaccine-secrets-lawsuit-claims/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-11-25T10:00:27+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/11/pfizer-vax_1.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2021/11/pfizer-vax_1.jpg", "https://www.zerohedge.com/covid-19/pfizer-employee-stole-12000-files-including-covid-19-vaccine-secrets-lawsuit-claims", "https://news.bloomberglaw.com/health-law-and-business/pfizer-says-employee-stole-files-with-covid-vaccine-secrets", "https://www.scribd.com/document/542125876/Document#from_embed", "https://www.scribd.com/user/408250710/Zerohedge-Janitor#from_embed", "https://southfront.org/pfizer-in-hot-water-after-listing-herzliya-medical-center-as-located-in-palestine/", "https://southfront.org/more-and-more-deaths-emerge-from-pfizer-vacine-success-story/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-11-25T10:00:27+00:00"}