{"result_id": "275003", "URL": "https://southfront.org/the-collapse-of-the-covid-narrative-a-brief-strategic-window-to-regain-our-democracies/", "timestamp": "2023-04-25 17:09:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/the-collapse-of-the-covid-narrative-a-brief-strategic-window-to-regain-our-democracies/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "The Collapse of the COVID Narrative: A Brief Strategic Window to Regain Our Democracies", "cleaned_text": "The COVID narrative is falling apart,[i] and the great post-pandemic cover-up has begun.\n\nOn Saturday January 22, 2022, Canada’s Globe and Mail ran a retrospective on the pandemic by well-known psychiatrist and author, Dr. Norman Doidge – entitled “Vaccines are a tool, not a silver bullet.”[ii]\n\nThe next day the article was tweeted to me:\n\nCurious, I read over what turned out to be a 7,113-word limited hangout[iii] justifying the Covid-19 response – and shared Mr. Farquharson’s anger about what had been addressed.\n\nThis may be the first serious media attempt to gloss over mounting evidence that the world was made to endure the prolonged Covid-19 disaster unnecessarily.\n\nWhy did the publish a near book-length rationale[iv] for a two-year horror show in which the media and Big Tech systematically suppressed all expert medical divergence from the official public health narrative?\n\nCoincidentally, the article appeared the same day, January 22, as a two-hour podcast entitled “Collapse of the Public Health Narrative, & the Gathering Storm,” featuring two of the organizers of the Worldwide Freedom March that was to be held the next day in Washington DC.\n\nThese organizers, Dr. Bret Weinstein and Dr. Chris Martenson, are two very concerned evolutionary biologists.\n\nScheduled to speak at the Washington rally were a group of practising, highly successful early treatment doctors – including Dr. Pierre Kory, Dr. Paul Marik, and Dr. Peter McCullough, along with pathologist Dr. Ryan Cole and vaccinologist Dr. Robert W. Malone.\n\nDr. Malone, who holds some of the earliest patents for mRNA technology, had earlier become known to Americans during a drug safety interview with Dr. Weinstein and philanthropist Steve Kirsch in a June 2021 podcast that went viral.[v]\n\nMany Malone interviews followed, and on the last day of 2021 he was heard by 50 million people in a 3-hour interview with Joe Rogan, who is more popular than CNN.\n\nThey discussed one of the most mysterious aspects of the official narrative: why is a cheap, safe, and plentiful early treatment drug like ivermectin, listed by the WHO as an essential medicine, so maligned as “horse paste?” And why, given its strong evidence of efficacy with Covid,[vi] are doctors prevented from prescribing it?\n\nThis growing controversy was threatening to spill over into the mainstream, which needed a famous psychiatrist to cool things down before the Freedom March and the truck convoys began.\n\nWe will turn first to the marathon op-ed, and then to its coincident same-day antithesis, the Weinstein-Martenson podcast.\n\nThe reports that in April 2020 (early in the pandemic), following WHO financier Bill Gates’ emphatic statement that “the that really lets us go back completely to normal and feel good…is to create a vaccine,”\n\n“we put our faith in the vaccines, while other approaches – such as drugs for early treatment, or a role for our natural immunity, or lowering our personal risk factors, for instance – got comparatively less attention.”\n\nIndeed these “other approaches” received virtually no attention. Successful early treatments were entirely suppressed during the eight months the world waited for rushed clinical trials that would usher in the experimental mRNA vaccines by late December 2020.\n\n“Our personal risk factors”, such as obesity and Vitamin D deficiency, which between them were present in at least 78% of US hospitalizations,[vii] were never mentioned by NIH’s Dr. Fauci or the media.\n\nThe vaccines were the only thing that could help us. All we could do was lock down and maintain six feet while we endured the long lonely months of 2020. If we got sick, we were to wait until we couldn’t breathe, then go to emergency.\n\nSo why hasn’t treatment focused more on repurposed drugs?\n\nFirst, because the master narrative, once it took hold, directed our attention away from this possibility. Second, in North America, the first repurposed drug that came to public attention was hydroxychloroquine. When it was endorsed by then-president Donald Trump it became highly politicized. People’s opinions about it often had more to do with their political affiliation than whether they had read any of the (now) 303 studies. Third, agencies that regulate drugs, such as the U.S. Food and Drug Administration and Health Canada, mandate that any drug they evaluate have a sponsor, usually a drug company agreeing to assume liabilities for the drug. It’s an extremely expensive process. If an old, cheap generic drug shows promise for repurposing, it still needs a sponsor to get approved for that. But drug companies have no financial incentive to do so. So usually there are no sponsors, and the drugs languish.\n\nYes, there was indeed a master narrative, managed and policed by the early warning system and an army of vigilante fact-checkers.\n\nBut in other respects, the claims in the paragraph above depart from well-known facts:\n• Public political affiliations have little to do with the WHO/FDA/CDC drug approval process;\n• The FDA regulators had long approved hydroxychloroquine (HCQ) and ivermectin (IVM), both of which have been on the WHO list of essential medicines for decades.\n• There was never any need to approve physician off-label prescriptions for Covid. Instead, the FDA recommended prescribing of hydroxychloroquine to outpatients in June, 2020,[ix]causing untold thousands of deaths while the world awaited the experimental injections.\n• The drugs did not languish. They were actively suppressed by state pharmacy boards, medical regulating bodies, medical journal editors, leading public health agencies, the media, and Big Tech.[x]\n\nThe ’s psychiatrist then devoted 5,000 words to the psychological state of being with the virus – the need to with a weaponized vaccine – rather than allowing natural processes, such as inborn immunity – to heal the 99% of infected under-70-year-olds whose immune systems had worked perfectly well.\n\nTowards the end of the piece, from his January 2022 perspective, Dr. Doidge concludes:\n\n“What is called for is not more scapegoating and coercion, but healing, and more early treatment for both groups, now that we have it…”\n\n…as if thousands of doctors had not been shut down, losing their licenses, and watching patients die unnecessarily for two years for want of hydroxychloroquine or Ivermectin. Professor Paul Marik MD was brought to tears by his frustration during January 2022 testimony.[xi]\n\nNext, the acknowledges the ridicule – [xii] – against the Great Barrington Declaration’s traditional public health wisdom, written by top epidemiologists, to provide focused protection for the vulnerable:\n\nMore and more officials are saying openly what the authors of the Great Barrington Declaration[xiii] (the ridiculed view of 60,000 public health scientists and physician signatories) said some time ago: Our goal is not eradication of the virus, or a one-size-fits-all policy, but lessening of deaths in the vulnerable through focused protection, and focused vaccination. The immunity we have will be a mix of vaccine immunity and natural immunity, depending on the person.”\n\nIt’s been a blow to our Baconian narcissism to be upended by nature these past two years. That thin-skinned Baconian within seems almost offended to admit that protection has come not only from scientific advances, but from natural immunity. Others might see this as a reassuring reminder that natural processes are not always and only the enemy. We shall find out, as we observe the unvaccinated, to what extent natural immunity, accumulating in waves of infection over time, does or does not protect, for the current or future variants.\n\nSo the whole two-year misery was due to narcissistic fallibility. No wonder my Twitter friend was upset.\n\nUrgent, Important Issues the Globe did not Address\n• Unprecedented changes in public health policy: The common cold is usually either a coronavirus or a rhinovirus, and often moves to the lungs as pneumonia. According to the World Health Organization, this particular SARS-2 coronavirus kills only 0.23% of those infected.[xv]\n\nHowever, coronavirus lockdowns are unprecedented. Passports are unheard of. And the words “pandemic,” “vaccine,” and “herd immunity” were redefined to support this global Covid-19 coronavirus policy.[xvi] These aberrations must be reversed to regain standard public health practise.\n• The absolution does not address the of the virus: the US-sponsored gain-of-function research and resulting Wuhan laboratory leak that was confirmed by a startling FOIA document from the US military a week before its article was published.[xvii] Nor does the mention Dr. Anthony Fauci, head of the NIAID research-sponsoring agency, located within the US National Institutes of Health.\n• Nor does the mention the unprecedented numbers of mRNA injection injuries and deaths that have been posted to the US, UK, and EU vaccine adverse reactions databases[xviii] – or the number of world class athletes who have collapsed or died following injection.[xix]\n\nThere are so many omissions and inaccuracies in this easy comfortable acquittal of public health policy that one wonders what is being hidden – was it simply mismanagement, or incompetence, or something more sinister?\n\nOne thing is certain: if we hadn’t been saved from the two-year furor by the relatively gentle omicron variant, which as of January 22, 2022, constituted 99.9% of the circulating strain,[xx] the boosters chasing the variants and the accompanying repressive mandates may have continued indefinitely.\n\nLet us now turn to Dr. Martenson and Dr. Weinstein, who explore the murky underside of this massively coordinated public policy assault on humanity, and why it is essential to identify and investigate its architects – at this particular moment in time, before it gets further glossed over – so that it never happens again.\n\nWho are Dr. Martenson and Dr. Weinstein?\n\nChris Martenson, PhD in pathology/toxicology (Duke), MBA (Cornell), is an economic researcher and futurist specializing in energy and resource depletion, and distillation of the interconnected forces in the Economy, Energy and the Environment. His insights are used by institutions such as the UN, the UK House of Commons and US State Legislatures. [xxii]\n\nBrett Weinstein, PhD in biology (Univ. of Michigan) is a theoretical evolutionary biologist focused on adaptive patterns within complex, dynamic systems, and former professor of evolutionary theory. He has an interest in the evolution of wisdom and moral self-sacrifice. His main focus is on a current path that we will not survive – on “a way of living on the earth that evolved, and if we are to change it, we must take evolution from autopilot and into our own hands.”[xxiii]\n\nWe see that they share not only long-term biology backgrounds, but a strong interest in patterns and interconnections – which gives them mutual perspective as both specialists and generalists.\n\nThe theme is set early in the podcast by Dr. Weinstein: “My sense is that something is over, but something else is about to begin – and I think people need to see it clearly so it doesn’t catch them off guard.”\n\nTheir discussion is informed by the people who have “stared down the stigmas that were thrown at us to enter a much better, smarter conversation than what the public is being exposed to.”\n\nThese people are, among other things, “the global resistance to the fervor for mandates.”\n\nWhat specifically are they resisting?\n\n: “In the resistance movement, everybody knows that all-cause mortality is an important thing that is rarely conveyed” – whereas PCR tests and hospitalization data are notoriously unreliable.\n\n“We know that we want autopsies done, because autopsies tell you something we can’t find out otherwise, and we know that the level of autopsies has been artificially reduced, and that suggests that there is an obvious desire not to know what kind of harm is being done” by the injections.”\n\n: Every single time if there was something favourable that they didn’t like, e.g., the [British] data Dr. John Campbell was talking about where there were 17,300 people in the whole Covid experience, all two years, who had died of Covid specifically, who weren’t burdened with a comorbidity – that came out because of a freedom of information act request. It was shocking. That data had to be pried out – and that should have been put out there and broadcast by that same organization, if they were doing the right thing, but instead they had to pry it out.\n\n: You go looking for something that isn’t consistently wrong – something that is open to various possibilities and you’ll find that that’s a very vibrant discussion – it’s just that the interesting stuff is on the fringe.\n\nWhy? Because it was driven there. Right, the natural people who would be at the head of the conversation of figuring out what’s going on with Covid, and what we should do about it – those people have been driven to the edge. They’ve either been silenced, or they’ve been threatened, or they’ve chosen to self-censor.”\n\nThe Earliest Sign of Trouble with the Narrative\n\nTo an evolutionary biologist, the sudden appearance of a coronavirus that had seemingly skipped many generations of natural mutation to become a highly aggressive zoonosis (animal-to-human disease), raised disturbing questions about a laboratory origin.\n\nThe lab escape idea first gained widespread attention following a long investigation into the circumstantial evidence of SARS-2 gain-of-function research at the Wuhan lab (“Who Opened Pandora’s Box at Wuhan? People or Nature?”) by former author Nicholas Wade in May 2021.[xxiv]\n\nOn January 11, 2022, a Project Veritas FOI request confirmed, from the US military’s DARPA files, “that SARS-CoV-2 matches the SARS vaccine variants the NIH-EcoHealth program was making in Wuhan.”[xxv] This research had been financed by the National Institutes of Health under the leadership of Dr. Anthony Fauci.[xxvi]\n\nDr. Weinstein calls such gain-of-function research – which was made illegal in the US by President Obama in 2014 – “a recipe for disaster.”\n\nHe likened an engineered virus lab escape to the introduction of the mongoose into remote and isolated Hawaii, where it thrived, playing havoc with natural evolution, and threatening birds and wildlife. Similarly, a lab-manufactured virus introduces a menacing evolutionary jump:\n\nYou’re going to create something in a lab and think that you’re its master… you’re just playing with fire – and what’s more you’re not playing with fire in the way that people used to play with fire. They would just blow themselves up.\n\nYou’re talking about the whole world.\n\nSomebody made an error. In fact, people were wise enough to see it coming and they tried to ban this research, but Anthony Fauci decided to override them. That error – Anthony Fauci overriding a gain-of-function research ban – very likely resulted in a particular viral particle escaping off a particular lab bench into a particular human being and then Covid-19. That is the capacity to take a tiny error – literally a microscopic error – and turn it into a global catastrophe.\n\nThat’s the power of the process you’re playing with, and if you don’t respect it we’re going to be facing this again and again…\n\nUnderstanding the laboratory origin of Covid-19 is enormously important for how we go into the future – yet Weinstein said it was very difficult to establish:\n\n“That was a surprise win. I didn’t think we were going to win that…\n\nHaving won it there are now two others: there’s the question of early treatment and there’s the question of vaccine safety and efficacy. If the public wakes up on all three of those fronts, suddenly we know something: that the following systems have completely failed to protect us and in fact have steered us into greater danger: the academy, the press, Big Tech, the public health apparatus, and all of the government structures it is plugged into.\n\nWhat will it will take to put our institutions back on track?\n\nThe story of Ivermectin may be the best clue.\n\nIn March, 2021, a world-class review paper on Ivermectin (IVM) by prominent toxicologist Dr. Jacques Descotes showed that it is among the safest and most well-tolerated drugs ever introduced to the market.[xxvii]\n\nIndeed, penicillin, aspirin, and ivermectin belong to a select group of drugs that has had the greatest beneficial impact on the health and well-being of humanity. All three are of natural origin and all three led to a Nobel Prize.\n\nIvermectin has improved the lives of millions of people since its discovery in 1975. Our environmental biologists were astonished by how it was targeted:\n\n: From a toxicology standpoint, Ivermectin is literally the safest compound I’ve ever looked at; its curve between effective dose and lethal dose is SO wide…in 500 studies zero deaths had ever been ascribed to it.\n\nThen we watched the Pharma campaign come out where all of a sudden it was horse dewormer everywhere because somebody had decided that’s what needed to happen now – some people sat in a room and said, “look we can’t get this on safety – what do we do with this?”\n\nAnd they had enough power to blanket the airwaves, have major articles appear in all the major newspapers, have it show up on CNN, MSNBC, even have the FDA itself tweet out a little “y’all stop taking horse dewormer.” So that’s power.\n\nThe use of this media and Big Tech power to prevent the Front Line COVID-19 Critical Care Alliance (FLCCC, established March 2020)[xxviii] from treating people with Ivermectin has been nothing short of criminal:\n\n: I remember six to eight months ago their FLCCC Facebook page would get taken down; they were getting YouTube strikes left and right and having channels pulled down.\n\nThey were highly qualified medical doctors discussing data. That was it. They weren’t out there railing against Pfizer or anything like that – there was nothing that would rise to libel. They were very careful – and watching that level of friction and hostility that came at them was astonishing. I’d never seen anything like that before.\n\n: That was astonishing in a way I’d never seen it, and there was something just impossible to stomach about watching these obviously highly dedicated people who actually save lives for a living – they do it day in and day out – being treated as if they were UP to something.\n\nIt just couldn’t possibly be more the inverse of what was happening. You had doctors trying to be doctors, trying to sort out a live situation that we’ve all been told is of utmost importance, and being demonized for the effort because their conclusion didn’t match the public health authority, which was obviously wrong – and then to watch the Tech sector leap to attention and start treating them as if these were somehow dangerous monsters.\n\nIt was just such a preposterous show a force on the part of whatever the thing is that is arranging the narrative.\n\nThe broken narrative continues. Why? Because after withholding and suppressing IVM and other life-saving therapies for so long, the health agencies and the media cannot now admit that early treatment works .[xxix] Once the public knows this, all the hospitals will be overwhelmed with lawsuits.\n\nWhat will it Take to Expose and Accept the Truth about Vaccine Injuries?\n\nThe issue of vaccine safety and efficacy was identified above by Dr. Weinstein as the third battle for truth. Officially, vaccine injuries are claimed to be exceedingly rare, so vaccination continues to be rigorously pursued through endless boosters.\n\nIn reality, vaccine injuries are off the charts – that is, according to three DOD whistleblowers who have released medical billing data for 2021 from the US Defense Medical Epidemiology Database.[xxx]\n\nDuring testimony at a Senate hearing on January 24, 2022, the whistleblowers reported a 300% increase in cancers and a 1000% increase in neurological injuries over the 5-year baseline average during 2021, the first year of Covid-19 vaccinations.[xxxi] [xxxii]\n\nRegarding deaths, the CDC’s Vaccine Adverse Effects Reporting System (VAERS) reports Covid-19 vaccines as relating to 78% of all vaccine deaths.\n\nFrom Page 1 of their January 21, 2022 report:\n\nPage 2 of the report shows the comparative death percentages for influenza and measles vaccines, which are also given to millions of people:\n\nMillions also receive mumps, polio, tetanus, and others vaccines:\n\nEarly in 2022, startling news emerged from Indiana, where “we are seeing, right now, the highest death rates we have seen in the history of this business,” OneAmerica CEO Scott Davison reported. The head of OneAmerica insurance said the death rate [for the first mRNA vaccine year, 2021] is up a stunning 40% from pre-pandemic levels among working-age people.”[xxxiii]\n\nMartenson and Weinstein decry suffering from the mRNA injections:\n\nHow awful it must be to be like the mother of Maddie De Garay, Stephanie De Garay,[xxxiv] and know that you were doing the right thing, and then as soon as things went a little wrong, the system basically said we think your daughter’s just nuts, and no support…\n\n: There’s something about watching the gaslighting of the injured…if this was an honest effort to control the pandemic and people had been injured because we had a vaccine that worked but had an unfortunately high price, a certain number of people rolled the dice and it came up bad for them, we would take care of those people.\n\nThe point is, they did this so that we could be safe, and we could go back to life. These would be heroes. We would not be gaslighting them. We would be accepting that they were harmed. They would be getting free care for the rest of their lives for the cost that they paid on the rest of our behalf – and to watch them gaslit tells you what kind of monsters we’re dealing with.\n\nThe other thing that does that for me, is the withdrawal of treatments that work early. You’re going to simultaneously tell us that we have this very dangerous disease as you withdraw therapies in which there is no profit – but that work. That is a level of indifference to human suffering that is almost impossible to imagine…\n\nNo process that is capable of those two things can be defended. It’s not an accident, and there is no decency to it.\n\nThe two doctors next discuss whether our system and its institutions, which “failed across-the-board,” is reformable. How do we organize ourselves, when the crisis has been about money and power, and damning the consequences to human suffering?\n\n: I am certain that the system must be reformed – that’s the only thing we can do. You cannot rebuild the system. You’re going to have to take the edifice and figure out how to make it function in spite of the fact that it is completely riddled with corruption of various kinds.\n\nAs the narrative comes apart, I don’t need to see Fauci punished…he has visited one of the most colossal catastrophes on planet Earth that we have ever seen…What I do need is for him never to be anywhere near control over anything important ever again.\n\nAnd we can say that about many other people whose names we don’t necessarily know who have been integral to the response, which has been so disastrous.\n\nNow we have also learned the names of many people who are willing to stand up to garbage narratives and tell us what we need to know rather than what we want to hear.\n\nSo there is an obvious solution but we’re going to watch everything thrown at the question of how to avoid it; will be thrown at the process of derailing an attempt to simply take the people who make sense and put them in positions where they can do good.\n\nBut there is a bright side:\n\n: I know from long experience that there are three kinds of people in all these systems. Some, not very common, are those who will pursue their own interests, no matter what. There are people who will do the right thing no matter how costly it is to them, also not very common. Then there is the vast middle ground of people who will do what they have to do\n\nbut they might prefer to do the right thing. We can’t spot them because at the moment they are doing the wrong thing. Why? Because they don’t have a better choice.\n\nSo my hope is that if we actually do manage to put decent people with the proper expertise in the roles at the heads of these organizations – yes, they have some bad apples but also a lot of decent people who haven’t been given a decent choice – and that maybe suggests that reform could work…\n\n: The fear that they have been putting out has been very contagious, but I’ve watched the opposite: courage can be just as contagious. And so it’s really important that the people who have that capability to be courageous do so…\n\nWatching somebody like Dr. Pierre Kory, who’s just dripping with integrity…watching what happened when he ripped his mask off in that Senate testimony, and I could just feel the galvanizing effect. I thought wow, that is really impressive and they’re going to come after him, and they did.\n\nThis is the time for us to stand up and stand together as courageously as we can. It is the biggest moment in history I’m aware of, so many things are going to be decided in the next few years.\n\nBack at the beginning of the pandemic, I was asked, “Well, when will be go back to normal,” and I heard myself say, “We’re never going back to normal. This is the biggest thing that’s ever happened on planet Earth.”\n\nThis is a truly global process that has unfolded… Something that can amplify a microscopic error into a global catastrophe, that tells you where we are and how much danger there is…You can’t roll the dice with these processes running loose for very long and have it always come up your way.\n\nThis is telling us that our lives – whether we like it or not – are overlapping a moment on which everything hangs. We are stuck with the responsibility of solving a problem no one has seen before and we have to get it right.\n\nGetting it right means somehow getting the media to stop playing the narrative game – or at least enough of the media to provide an accessible alternative.\n\nMedia Propaganda Must be Identified and Eliminated\n\nThere is no question that the media has been insanely corrupt during the pandemic. Dr. Christian Perronne, who held top positions on vaccine policy for France and the WHO, “pointed to the French government which,” in addition to tens of millions of Euros they give to primary media each year, for two years has given 3 billion Euros to media.”[xxxvii]\n\nA major problem in our relationship with the media is that the difference between and is not understood. Problems have solutions, and can be solved, whereas predicaments have outcomes that require management.\n\nThe media has been relentlessly focusing our attention on problems of often marginal interest to society as a whole, and of moderate importance to our ultimate welfare.\n\nWe do not hear as much news about the predicaments that require concerted, unifying cooperation to address: world poverty and hunger; overfishing and plastic contamination of the rising oceans, land and soil degradation, deforestation, and increasing drought and wildfires. Yet we are collectively responsible for catastrophic neglect in these areas.\n\nIn the grand scheme of things, Covid-19 fits in the category, although it was given a mighty boost by the enormous coordination of media and Big Tech under the umbrella of the “Trusted News Initiative” (TNI) and its early warning system – for which there is a full accounting in the essay cited below:\n\n“An international process of editorial standardization has delivered unprecedented news coverage of the monopolized message:\n\nThe pandemic threatens the survival of all humanity\n\nThere is no therapy to cure the sick\n\nIt is necessary to confine the whole population, and\n\nThe delivery will come only from a vaccine.”\n\nMany people have been dismayed by the singularity of this propaganda.”[xxxviii]\n\nThe TNI rigorously linked government agencies, the corporate media, and the tech companies – who together have given pharmaceutical companies the leverage to censor anyone who raised medical evidence supporting early Covid treatment, or exposing vaccine injuries.\n\nThe public has been so propagandized for two years that its irrational acceptance of insanely contradictory Covid-19 claims has been described by clinical psychologist Dr. Mattias Desmet as a mass psychosis phenomenon[xxxix] – in which an estimated half to two-thirds of the public mind simply will not or cannot question the meandering narrative.\n\nIndeed, most of the public would prefer to believe that their two-year ordeal was caused by an honest response to a natural event, such as the has presented.\n\nSomething has captured our focus and it has mesmerized us into behaving in a way that is actually harming us – and waking up from that is not going to be fun for a lot of people, but the longer you wait the less fun it’s going to be.\n\nThe main point here is we have got to put a stop to this now. The way mass psychosis or formations are stopped is with brave people standing up, and saying, “No. Let’s stop. Just let’s stop.”\n\nOur Opportunity for Future Survival Has a Narrow Window\n\nWe now know that the following systems have completely failed to protect us and in fact have steered us into greater danger: the academy, the press, Big Tech, the public health apparatus.\n\nThat is an amazing across-the-board failure, and no one who is paying attention could possibly look at a failure of all of those things and come away with the impression that anything small could possibly put us back on track.\n\nI don’t know that in our lifetimes we will get a better opportunity to have the conversation we need about civilizational collapse, which is looming, because our systems have stopped doing what they’re supposed to do. So my greatest fear is waking up one day and Biden and Macron and all the other leaders are going say: this is just like the seasonal flu, it’s endemic, we’re done, and let’s move on.\n\nWhy is that a fear? Because it means that we won’t have the accounting that we need – they’ll just try and slide past those failures. I think those failures need to be brought forward…because they’re indicative of a larger system issue.\n\nI think this is one of the most pivotal moments in human history… and the way we begin to address this is we have to have really open honest conversations where no ox is too sacred to gore – everything is on the table. We need all hands on deck…\n\nWhat we have said is, the level of dysfunction in the system will be fatal for humanity in short order. Covid reveals those failures, but the point is somebody has unhooked all of the things that are supposed to allow you to steer the ship back on course and away from the iceberg.\n\nBut sooner or later there will be an emergency of the highest order. It’s not the Covid emergency, but Covid reveals the emergency. Covid, because of the across-the-board failure of everything, reveals the problem. There’s no reason to think we are going to get a better chance in our lifetimes to actually discuss it. The curtain is never going to be pulled this far back again, or if it is it may be too late for the next emergency.\n\nThe next emergency may not be such a survivable one so we have to figure out what’s gone wrong and we have to fix it because our job is to leave the planet intact for future generations. They have to have a decent place to live.\n\nGoing Forward: The Role of Wisdom and Integrity\n\nThe needed transformation is too important to leave to chance. We need to ensure that the kind of people who lead us forward are the high integrity kind, not the kind who do things for themselves.\n\nWe have seen the wisdom of two minds exploring the extent of our failed institutions, and how we must view this moment as a vital demarcation between past and future – a precious window in time – in which to finally address the problems predicaments we have been neglecting.\n\nPerhaps it should begin with recognition of our vulnerability, as Dr. Martenson points out:\n\nThe good news about Covid-19 is that it showed how vulnerable we are, and not just at the level of our biology. It showed how vulnerable we are to propaganda and to being induced to viciousness toward each other, and to demonizing those who are trying to tell us things we need to know.\n\nSo this was a trial run, and if we learned the lesson of it we could come out of it much stronger, but that’s the reason I’m afraid the lesson is going to be buried.\n\nWe cannot bury Covid-19 and go back to normal.\n\nNormal is what caused this pandemic.\n\nWe need the honesty and wisdom and determination to seize this moment, and to make our institutions reform normal.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @globalresearch_crg. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\n[iii] A limited hangout or partial hangout is “spy jargon for a gimmick of the clandestine professionals. When they can no longer rely on a phony cover story to misinform the public, they resort to admitting some of the truth while withholding the key and damaging facts. The public is usually so intrigued by the new information that it never thinks to pursue the matter further.” (https://www.definitions.net/definition/limited+hangout).\n\n[iv] Incredibly, this article is the same length as the May 2020 hit piece (https://www.nytimes.com/2020/05/12/magazine/didier-raoult-hydroxychloroquine.html) on France’s leading microbiologist, Dr. Didier Raoult – who was having encouraging results with the legendary safe drug hydroxychloroquine – and appeared the same week that the published its astonishingly corrupt hit piece on hydroxychloroquine heart toxicity – retracted under massive protest (https://www.palmerfoundation.com.au/global-research-media-sabotage-of-hydroxychloroquine-use-for-covid-19-doctors-worldwide-protest-the-disaster/).\n\n[v] “How to save the world, in three easy steps: Darkhorse Podcast with Robert Malone, Steve Kirsch & Bret Weinstein,” June 2021 (https://open.spotify.com/episode/2GkYPouJqLMnMqDzMsdaeh?si=0424e0517c2f424b&nd=1)\n\n[vii] Berkeley Lovelace Jr. “CDC study finds about 78% of people hospitalized for Covid were overweight or obese,” CNBC, 8 March 2021 (https://www.cnbc.com/2021/03/08/covid-cdc-study-finds-roughly-78percent-of-people-hospitalized-were-overweight-or-obese.html).\n\n[ix] Harvey Risch, “FDA obstruction: Patients die, while Trump gets the blame,” , 19 October 2020 (https://www.washingtonexaminer.com/opinion/fda-obstruction-patients-die-while-trump-gets-the-blame).\n\n[x] See my other articles on these actions at (https://www.globalresearch.ca/author/elizabeth-woodworth).\n\n[xi] “Dr. Brought To Tears As He Recounts Watching His Patients Die When He Wasn’t Allowed To Treat Them,” 24 January 2022 (https://brandnewtube.com/watch/dr-brought-to-tears-as-he-recounts-watching-his-patients-die-when-he-wasn-039-s-allowed-to-treat-t_G2vWLGNseXzVIsC.html). Dr. Marik was professor of medicine and chief of pulmonary and critical care medicine at Eastern Virginia Medical School.\n\n[xii] Oxford Professor of Epidemiology, Dr. Sunetra Gupta, was warned by a BBC producer not to discuss the Great Barrington Declaration just before going on air. Toby Young, “Why can’t we talk about the Great Barrington Declaration?” , 15 October 2020 (https://spectatorworld.com/life/great-barrington-declaration/).\n\n[xvi] Sarah Mae Saliong, “CDC And WHO Redefine ‘Vaccine’ And ‘Herd Immunity’ To Manipulate People Into Getting The Jabs,” , 21 September 2021 (https://www.christianitydaily.com/articles/13341/20210921/cdc-and-who-redefine-vaccine-and-herd-immunity-to-manipulate-people-into-getting-the-jabs.htm).\n\n[xix The Covid World, “A List of World Class Athletes Who Died Or Suffered Severe Injuries After COVID-19 Vaccine,” 7 November 2021 (https://thecovidworld.com/world-class-athletes-who-died-or-suffered-severe-injuries-after-covid-19-vaccine/); “318 Athlete Cardiac Arrests & 178 Deaths in 2021 After COVID Shot,” Belizean Rights and Justice Movement, 17 December 2021, (censored), (https://web.archive.org/web/20220122042215/https://brjm.org/2021/12/318-athlete-cardiac-arrests-after-covid-vax/).\n\n[xxi] “Bret Speaks with Chris Martenson – Collapse of the Public Health Narrative, & the Gathering Storm,” 22 January 2022 (https://www.youtube.com/watch?v=aOT6nzzKrO8&list=PLjQ2gC-5yHEug8_VK8ve0oDSJLoIU4b93&t=5533s).\n\n[xiv] Nicholas Wade, “Origins of COVID-19: Who Opened Pandora’s Box at Wuhan – People or Nature?” , 10 May 2021 (https://science.thewire.in/the-sciences/origins-of-covid-19-who-opened-pandoras-box-at-wuhan-people-or-nature/).\n\n[xxvi] Glen Owen, “REVEALED: U.S. government gave $3.7million grant to Wuhan lab…,” Updated 16 May 2020 (https://www.dailymail.co.uk/news/article-8211291/U-S-government-gave-3-7million-grant-Wuhan-lab-experimented-coronavirus-source-bats.html).\n\n[xxxi] “Ron Johnson – Senate Hearing – COVID-19: A Second Opinion – January 24, 2022” (https://www.youtube.com/watch?v=ciuRLFLoLL0&t=13s) (at 0:35 minutes). Full Hearing at https://www.youtube.com/watch?v=asw_FBipVpg.\n\n[xxxii] Stacey Lennox, “Military Whistleblowers May Blow Up the COVID Vaccine Narrative,” 25 January 2022 (https://pjmedia.com/news-and-politics/stacey-lennox/2022/01/25/military-whistleblowers-may-blow-up-the-covid-vaccine-narrative-n1552966).\n\n[xxxiii] Margaret Menge, “Insurance CEO says deaths up 40% among working age people, and it’s not just COVID,” 1 January 2022 (https://justthenews.com/nation/states/indiana-life-insurance-ceo-says-deaths-are-40-among-people-ages-18-64).\n\n[xxxiv] Tucker Carlson, “Mom details 12-year-old daughter’s extreme reactions to COVID vaccine, says she’s now in wheelchair,” 2 July 2021 (https://www.foxnews.com/media/ohio-woman-daughter-covid-vaccine-reaction-wheelchair). Maddie had volunteered for the Pfizer coronavirus trial and then nearly died.\n\n[xxxv] “Top French vaccine expert: We have flouted science and flouted rights,” , 30 January 2022 (https://www.israelnationalnews.com/news/321386).\n\n[xxxvi] Elizabeth Woodworth, ‘COVID-19 and the Shadowy “Trusted News Initiative”: How it Methodically Censors Top World Public Health Experts Using an Early Warning System,’ 22 January 2022 (https://www.globalresearch.ca/covid-19-shadowy-trusted-news-initiative/5752930).\n\n[xxxvii] “Why People WILLINGLY Give Up Their Freedoms W/ Prof. Mattias Desmet |Mass Formation Psychosis,” 20 October 2021 (https://www.youtube.com/watch?v=IqPJiM5Ir3A). Dr. Mattias Desmet is a Professor of Clinical Psychology at Ghent University in Belgium.\n\nMORE ON THE TOPIC:\n• Artificial Intelligence (AI) And The Covid Pandemic: A “Truth Bomb” Explodes To Illuminate The War On Humanity\n• “Covid Ethnic Cleansing”: The Vaccinated vs. The Unvaccinated: Those Who Refuse The Vaccine And The “Official” Covid-19 Narrative Are Categorized As “Psychopaths”", "opengraph": {"locale": "en_GB", "type": "article", "title": "The Collapse of the COVID Narrative: A Brief Strategic Window to Regain Our Democracies", "description": "Written by Elizabeth Woodworth. Originally published on Global Research Introduction The COVID narrative is falling apart,[i] and the great post-pandemic cover-up...", "url": "https://southfront.org/the-collapse-of-the-covid-narrative-a-brief-strategic-window-to-regain-our-democracies/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2022-02-08T08:30:26+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2020/03/COVID-19.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2020/03/COVID-19.jpg", "https://www.globalresearch.ca/collapse-covid-narrative-brief-strategic-window-regain-democracies/5769531", "https://s4.cdnstatic.space/wp-content/uploads/2022/02/12212.png", "https://www.globalresearch.ca/collapse-covid-narrative-brief-strategic-window-regain-democracies/5769531/screen-shot-2022-02-07-at-3-54-49-pm", "https://www.globalresearch.ca/collapse-covid-narrative-brief-strategic-window-regain-democracies/5769531/screen-shot-2022-02-07-at-3-55-26-pm", "https://www.globalresearch.ca/collapse-covid-narrative-brief-strategic-window-regain-democracies/5769531/screen-shot-2022-02-07-at-3-55-52-pm", "https://www.globalresearch.ca/collapse-covid-narrative-brief-strategic-window-regain-democracies/5769531/screen-shot-2022-02-07-at-3-56-13-pm", "https://brownstone.org/articles/the-covid-narrative-falls-apart-in-south-africa/", "https://www.theglobeandmail.com/opinion/article-vaccines-are-a-tool-not-a-silver-bullet-if-wed-allowed-more-scientific/", "https://www.definitions.net/definition/limited+hangout", "https://www.nytimes.com/2020/05/12/magazine/didier-raoult-hydroxychloroquine.html", "https://www.palmerfoundation.com.au/global-research-media-sabotage-of-hydroxychloroquine-use-for-covid-19-doctors-worldwide-protest-the-disaster/", "https://open.spotify.com/episode/2GkYPouJqLMnMqDzMsdaeh?si=0424e0517c2f424b&nd=1", "https://ivmmeta.com/", "https://www.cnbc.com/2021/03/08/covid-cdc-study-finds-roughly-78percent-of-people-hospitalized-were-overweight-or-obese.html", "https://www.youtube.com/watch?v=M5gJz3PHitE", "https://www.washingtonexaminer.com/opinion/fda-obstruction-patients-die-while-trump-gets-the-blame", "https://www.globalresearch.ca/author/elizabeth-woodworth", "https://brandnewtube.com/watch/dr-brought-to-tears-as-he-recounts-watching-his-patients-die-when-he-wasn-039-s-allowed-to-treat-t_G2vWLGNseXzVIsC.html", "https://spectatorworld.com/life/great-barrington-declaration/", "https://gbdeclaration.org/", "https://pubmed.ncbi.nlm.nih.gov/33716331", "https://www.christianitydaily.com/articles/13341/20210921/cdc-and-who-redefine-vaccine-and-herd-immunity-to-manipulate-people-into-getting-the-jabs.htm", "https://assets.ctfassets.net/syq3snmxclc9/2mVob3c1aDd8CNvVnyei6n/95af7dbfd2958d4c2b8494048b4889b5/JAG_Docs_pt1_Og_WATERMARK_OVER_Redacted.pdf", "https://vaersanalysis.info/", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions", "https://www.ema.europa.eu/en/human-regulatory/overview/public-health-threats/coronavirus-disease-covid-19/treatments-vaccines/vaccines-covid-19/safety-covid-19-vaccines", "https://thecovidworld.com/world-class-athletes-who-died-or-suffered-severe-injuries-after-covid-19-vaccine/", "https://web.archive.org/web/20220122042215/https:/brjm.org/2021/12/318-athlete-cardiac-arrests-after-covid-vax/", "https://covid.cdc.gov/covid-data-tracker/%23variant-proportions", "https://www.youtube.com/watch?v=aOT6nzzKrO8&list=PLjQ2gC-5yHEug8_VK8ve0oDSJLoIU4b93&t=5533s", "https://www.peakprosperity.com/about/", "https://www.edge.org/memberbio/bret_weinstein", "https://science.thewire.in/the-sciences/origins-of-covid-19-who-opened-pandoras-box-at-wuhan-people-or-nature/", "https://assets.ctfassets.net/syq3snmxclc9/2mVob3c1aDd8CNvVnyei6n/95af7dbfd2958d4c2b8494048b4889b5/JAG_Docs_pt1_Og_WATERMARK_OVER_Redacted.pdf", "https://www.dailymail.co.uk/news/article-8211291/U-S-government-gave-3-7million-grant-Wuhan-lab-experimented-coronavirus-source-bats.html", "https://c19ivermectin.com/descotes.html", "https://invest.medincell.com/wp-content/uploads/2021/03/PR_MDCL_safety_ivermectine-50321.pdf%20", "https://covid19criticalcare.com/", "https://c19early.com/", "https://www.theblaze.com/op-ed/horowitz-whistleblowers-share-dod-medical-data-that-blows-vaccine-safety-debate-wide-open", "https://www.youtube.com/watch?v=ciuRLFLoLL0&t=13s", "https://www.youtube.com/watch?v=asw_FBipVpg", "https://pjmedia.com/news-and-politics/stacey-lennox/2022/01/25/military-whistleblowers-may-blow-up-the-covid-vaccine-narrative-n1552966", "https://justthenews.com/nation/states/indiana-life-insurance-ceo-says-deaths-are-40-among-people-ages-18-64", "https://www.foxnews.com/media/ohio-woman-daughter-covid-vaccine-reaction-wheelchair", "https://www.israelnationalnews.com/news/321386", "https://www.globalresearch.ca/covid-19-shadowy-trusted-news-initiative/5752930", "https://www.youtube.com/watch?v=IqPJiM5Ir3A", "https://southfront.org/artificial-intelligence-ai-and-the-covid-pandemic-a-truth-bomb-explodes-to-illuminate-the-war-on-humanity/", "https://southfront.org/covid-ethnic-cleansing-the-vaccinated-vs-the-unvaccinated-those-who-refuse-the-vaccine-and-the-official-covid-19-narrative-are-categorized-as-psychopath/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2022-02-08T08:30:26+00:00"}