{"result_id": "275042", "URL": "https://southfront.org/biden-declares-the-covid-pandemic-is-over-despite-continued-use-in-policies-programs/", "timestamp": "2023-04-25 17:10:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/biden-declares-the-covid-pandemic-is-over-despite-continued-use-in-policies-programs/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Biden Declares The COVID Pandemic \"Is Over\" Despite Continued Use In Policies & Programs", "cleaned_text": "About a year and a half too late to the game, Joe Biden finally admitted in a Sunday broadcast interview with 60 Minutes that the covid pandemic is over, stating:\n\nApparently, in the ever teetering mind of Joe Biden the prevalence of masks was a measure of the prevalence of covid. Of course, this all depends on where in the US or the world you have been living. In red states, masks have been gone for around two years with the majority of people not wearing them. And despite the predictions (and fantasies) of many on the political left, conservatives were not dropping dead in the streets; far from it.\n\nIn fact, red states that ended shutdowns and mandates well ahead of blue states enjoyed far superior economic recovery including superior job and business recovery numbers, and virtually no difference in terms of death and infection rates occurred. In fact, studies now show that there was little to no positive effect made by the covid lockdowns and the usefulness of mask mandates is also in question.\n\nFurthermore, infection and fatality rates for covid began to drop long before the covid mRNA vaccines were introduced widely to the public. The facts and the science show that covid stopped being a major threat not long after it spread to the US. The official median IFR (Infection Fatality Rate) according to dozens of peer reviewed studies stands at mere 0.23%. Meaning, over 99.7% of the population is not under threat from covid.\n\nThe lockdowns didn’t work, but they weren’t needed. The mask mandates didn’t work, but they weren’t needed. And, the rates started dropping dramatically for the original covid strains before even 5% of the US population was vaccinated. All in all, every single government policy that interfered in the lives and freedoms of millions of people ended up being pointless.\n\nBiden’s recent declaration means nothing, because he is in no position to determine the current state of the pandemic. The American people already did that, and we declared the thing over a long time ago.\n\nImmediately after Biden’s remarks, Kentucky Rep. Thomas Massie insisted that the administration should now relinquish all the emergency powers it has grabbed by hyping the threat of the virus.\n\nAdditionally, as Jonathan Turley so coherently explains, the President’s sudden announcement that the pandemic “is over” may have taken some people by surprise, including Administration lawyers still using the pandemic as a basis for policies and programs. This includes a major appellate case this week.\n\nThe Administration relied on the pandemic to justify the massive loan forgiveness program at a cost of as much as $1 trillion. The move will be the subject of challenges and defended under the HEROES Act of 2003 as tied to a national emergency, ”when significant actions with potentially far-reaching consequences are often required.” The pandemic is also being used by states continued crackdowns on those who refuse to get vaccines. New York is moving to fire hundreds of teachers and school administrators. Private companies like T-Mobile are also moving this month to fire unvaccinated workers. The President also heralded the removal of masks recently despite the continues requirement for some schools and other locations under pandemic rules (including at my own George Washington University). While at the Detroit Auto Show, Biden declared “If you notice, no one’s wearing a mask, everybody seems to be in pretty good shape.” Biden’s statement on the end of the pandemic is likely to be cited in a variety of briefs in cases challenging emergency powers and policies used by the Administration. It was just a year ago, in September 2021, that the President imposes such rules to “ensur[e] the health and safety of the Federal workforce and the efficiency of the civil service.” President Biden announced a similar requirement for federal civilian employees. Exec. Order No. 14,043, 86 Fed. Reg. 50,989 (Sept. 14, 2021). One such example could be the appeal now being considered by the United States Court of Appeals for the Fifth Circuit. The issue of the sweeping pandemic authority being claimed by the Biden Administration is now going before the full court in an en banc rehearing. U.S. District Judge Jeffrey Brown previously issued a nationwide injunction against the vaccination mandate in January. That was stayed and has resulted in a series of conflicted moves on appeal. Yet, the Justice Department is still citing the pandemic authority and insisting that “if an employee chooses not to receive a COVID-19 vaccine (and is ineligible for an exception), he simply may no longer be permitted to continue in federal employment, just as an employee would be subject to termination if she chose to stop performing her job or chose to violate workplace policies.” Here is one such recent brief: DOJ Fifth Circuit brief Now the President is declaring that the pandemic is over as the Justice Department is defending pandemic policies in various courts. Even if one were to argue that the policy should be reviewed as supported at the time, the continued viability of the policy can now be questioned in light of the President’s own statements. The President’s comments also highlight the fluidity of pandemic policies. While we often look to the CDC on such status statements, it is the President who ultimately decides federal policies on pandemic measures. If the pandemic “is over,” some may question the continued uncertain status of military personnel and federal employees on vaccine status as well as lingering mask mandates being used in some states and by certain businesses.\n\nWhat we must never forget, however, is how close we came to full-on medical authoritarianism under the supervision of the Biden Administration and men like Anthony Fauci. Numerous agenda driven institutions also pushed hard for the erasure of our freedoms, declaring that we would “never go back to normal again” and that personal liberties had to be sacrificed under the new pandemic construct.\n\nIf Biden’s vaccine passport executive orders had been enforced instead of blocked, rest assured the US would be like China is today – Still dragging out the lockdowns and pretending covid is an ongoing threat. Anyone refusing to vaccinate would have been denied employment and participation in the general economy, essentially starved into compliance or compelled to join black market systems and become criminals. Millions of citizens stood against these orders and won the day, but now we have to reverse course and ensure such an attempt to dismantle our rights never happens again.\n• Fauci “Misled Congress” About Gain-Of-Function Research, But ‘Protected By Biden Admin’; Former CDC Chief Says\n• 21 Million Chinese Decided To Quarantine in Hours Because Of COVID-19\n• The Shanghai “Covid Zero Tolerance Mandate”. Engineered Depression of China’s Economy?", "opengraph": {"locale": "en_GB", "type": "article", "title": "Biden Declares The COVID Pandemic \"Is Over\" Despite Continued Use In Policies & Programs", "description": "Originally published on ZeroHedge About a year and a half too late to the game, Joe Biden finally admitted in...", "url": "https://southfront.org/biden-declares-the-covid-pandemic-is-over-despite-continued-use-in-policies-programs/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2022-09-20T10:53:39+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2022/09/Bidenvax1_0.jpg", "image:width": "500", "image:height": "333", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">With the pandemic officially over, now it’s time to end all vaccine mandates. <a href=\"https://t.co/WnYxfTEykc\">https://t.co/WnYxfTEykc</a></p>\n<p>— Senator Ron Johnson (@SenRonJohnson) <a href=\"https://twitter.com/SenRonJohnson/status/1571674407893929984?ref_src=twsrc%5Etfw\">September 19, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://southfront.org/donate/", "https://s2.cdnstatic.space/wp-content/uploads/2022/09/Bidenvax1_0.jpg", "https://www.zerohedge.com/covid-19/joe-biden-declares-covid-pandemic-over", "https://nypost.com/2022/07/05/red-states-recovered-faster-from-covid-pandemic-than-blue-states-report/", "https://sites.krieger.jhu.edu/iae/files/2022/01/A-Literature-Review-and-Meta-Analysis-of-the-Effects-of-Lockdowns-on-COVID-19-Mortality.pdf", "https://www.bloomberg.com/opinion/articles/2022-02-11/did-mask-mandates-work-the-data-is-in-and-the-answer-is-no", "https://www.sfgate.com/coronavirus/article/bay-area-mask-mandate-results-17271294.php", "https://www.statnews.com/2021/07/12/covid-19-decline-preceded-vaccines-still-need-jabs-finish-the-job/", "https://pubmed.ncbi.nlm.nih.gov/33716331/", "https://t.co/WnYxfTEykc", "https://twitter.com/SenRonJohnson/status/1571674407893929984?ref_src=twsrc%5Etfw", "https://jonathanturley.org/2022/09/19/biden-declares-pandemic-over-despite-continued-use-in-policies-and-programs/", "https://www.foxnews.com/us/hundreds-more-nyc-teachers-aides-fired-not-complying-covid-19-vaccine-mandate-report", "https://www.fiercewireless.com/wireless/unvaccinated-t-mobile-employees-will-be-fired-april-2", "https://mynews4.com/news/coronavirus/court-rehears-fight-over-vaccine-mandate-for-federal-workers-administration-lawyer-blocked-nationwide-by-federal-judge-in-texas-coronavirus-pandemic-covid-19-immunizations", "https://jonathanturley.org/wp-content/uploads/2022/09/DOJ-Fifth-Circuit-brief.pdf", "https://www.technologyreview.com/2020/03/17/905264/coronavirus-pandemic-social-distancing-18-months/", "https://www.healthcaredive.com/news/biden-admin-eyeing-vaccine-passports-onc-head-says/596562/", "https://apnews.com/article/coronavirus-pandemic-business-lifestyle-pandemics-united-nations-f3087866ccdf456976c5c290bba99139", "https://southfront.org/fauci-misled-congress-about-gain-of-function-research-but-protected-by-biden-admin-former-cdc-chief-says/", "https://southfront.org/21-million-chinese-decided-to-quarantine-in-hours-because-of-covid-19/", "https://southfront.org/the-shanghai-covid-zero-tolerance-mandate-engineered-depression-of-chinas-economy/", "https://southfront.org/morbid-matters-estimating-covid-19-mortality/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2022-09-20T10:53:39+00:00"}