{"result_id": "275032", "URL": "https://southfront.org/going-to-court-the-eu-sues-astrazeneca/", "timestamp": "2023-04-25 17:10:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/going-to-court-the-eu-sues-astrazeneca/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Going To Court: The EU Sues AstraZeneca", "cleaned_text": "It has been a relationship of characterised by bitterness and misunderstanding. It began with a poorly negotiated agreement – poor, that is, from the European Union perspective – between Brussels and AstraZeneca for the supply of COVID-19 vaccine doses. Less rigorous in terms of penalties and consequences than the UK-AstraZeneca deal, the EU version was very much the poor cousin, giving the company much latitude in terms of production schedules and delays. While the UK government managed to insert the relevant clause allowing it to terminate the deal and invoke punitive clauses against AstraZeneca, the EU contract makes no mention of it. But in August 2020, little heed to this was paid by EU negotiators, starry-eyed to the company’s promise to supply 300 million doses of their COVID-19 vaccine, with the option of securing a further 100 million. The result was a defanged deal based on gentlemanly promises\n\nDelays and supply problems duly manifested. In January, the drugs company informed the European Commission that it would ship fewer doses to the bloc than was originally promised. “While there is no scheduled delay to the start of shipments of our vaccine should we receive approval in Europe,” stated an AstraZeneca spokesperson, “initial volumes will be lower than originally anticipated due to reduced yields at a manufacturing site within our European supply chain.” Within the first three months, 30 million jabs of the initial 90 million made its way to the EU. Little by way of improvement was shown in the next quarter: 70 million doses from 180 million promised.\n\nThe delays and supply disruptions have resulted in a sluggish immunisation effort in the EU and also done its bit to fray relations between the bloc and the UK. EU officials have looked on, envious and irritated at the UK’s own, comparatively more successful and rapid immunisation campaign.\n\nIt is precisely that latitude of behaviour on the part of the company that is now being challenged in the courts. The European Commission is suing AstraZeneca, arguing that the company has not discharged its obligations under the vaccine supply contract nor possess an appropriate plan for the timely delivery of doses. “Our priority,” wrote Stella Kyriakides, the EU Commissioner for Health and Food Safety, “is to ensure COVID-19 vaccine deliveries take place to protect the health of [EU citizens].”\n\nIn court, the EU’s Rafaël Jafferali submitted that, “We demand deliveries by the end of June and we also demand with immediate effect the use of all plants listed in the contract.” A central contention is that AstraZeneca had preferred not utilising all those mentioned (four are noted, two of which are located in the UK); the EU argument is that the company was under an obligation to use all the plants. Not doing so put it in breach of the contract.\n\nAstraZeneca’s Hakim Boularbah’s submission showed how far apart the parties are in terms of understanding the contract. “There is no obligation to use the factories,” came the argument. The point is crucial, given that the company has only utilised sites in Belgium and the Netherlands, sparing the UK outfits run by Oxford Biomedica and Cobra Biologics. There has also been no resort to the Catalent factory in the United States, mentioned in the contract as a possible “back-up supply site”.\n\nWhatever the merits of the EU’s legal arguments, certain countries within the bloc have been circumspect about dragging the company through the courts. Germany and France have expressed misgivings. As one diplomat explained to , “What can we do in practical terms if AstraZeneca says, ‘Take a closer look at our production sites: We just have no vaccines’?” There were also questions about the enforceability of any ruling. The entire process risks becoming a vacuous display of anger without effect.\n\nThen comes the issue of bad publicity. Reluctance to take COVID-19 vaccines is a prevalent sentiment within the bloc. Reliability and trust is already being tested. A number of EU diplomats worry that the lawsuit may have the effect of further tarnishing a company that is already struggling in terms of its brand.\n\nMuch of this can be put down to the sabotaging efforts of various leaders within the Union itself, not least of all French President Emmanuel Macron, who has found it hard to resist sniping at the AstraZeneca vaccine. At the end of January, he opined that the vaccine was “quasi-effective” for those over 65 years old. The following month, he changed his mind. The result: French confidence in the vaccine, along with a good deal of Europe’s, has been shattered.\n\nThis distinctly sour note continues the profoundly disunited state of affairs in efforts to battle the global pandemic. Vaccine patriotism and parochialism continue to limit access. Pharmaceutical giants continue to maintain IP protections even as they struggle to maintain supply. And the EU’s own measure of competence in negotiations and planning has been found wanting.\n\nDr. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. Email: bkampmark@gmail.com\n\nMORE ON THE TOPIC:\n• The Criminalization Of Big Pharma, mRNA Vaccine Deaths And Injuries. EU Adopts “Digital Vaccine Passport”", "opengraph": {"locale": "en_GB", "type": "article", "title": "Going To Court: The EU Sues AstraZeneca", "description": "Written by Dr. Binoy Kampmark. It has been a relationship of characterised by bitterness and misunderstanding.  It began with a...", "url": "https://southfront.org/going-to-court-the-eu-sues-astrazeneca/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-05-05T19:49:20+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/05/astra-zeneca-22.jpg", "image:width": "1600", "image:height": "900", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2021/05/astra-zeneca-22.jpg", "https://www.politico.eu/article/belgium-was-warned-eus-astrazeneca-contract-lacked-teeth-documents/", "https://ec.europa.eu/commission/presscorner/detail/en/IP_21_302", "https://www.npr.org/sections/coronavirus-live-updates/2021/01/26/960642692/european-union-warns-astrazeneca-over-reduction-in-vaccine-shipments", "https://twitter.com/skyriakideseu/status/1386646730876366850", "https://www.reuters.com/article/instant-article/idINKBN2CF0Q7", "https://www.reuters.com/article/instant-article/idINKBN2CF0Q7", "https://www.politico.eu/article/eu-preparing-legal-case-against-astrazeneca-over-vaccine-shortfalls/", "https://www.politico.eu/article/eu-preparing-legal-case-against-astrazeneca-over-vaccine-shortfalls/", "https://www.bbc.com/news/55919245", "mailto:bkampmark@gmail.com", "https://southfront.org/even-terrorists-dont-want-astrazeneca-vaccine/", "https://southfront.org/the-criminalization-of-big-pharma-mrna-vaccine-deaths-and-injuries-eu-adopts-digital-vaccine-passport/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-05-05T19:49:20+00:00"}