{"result_id": "275036", "URL": "https://southfront.org/untold-political-campaign-tools-of-the-us-social-media-covid-19-masks/", "timestamp": "2023-04-25 17:10:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/untold-political-campaign-tools-of-the-us-social-media-covid-19-masks/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Untold Political Campaign Tools Of The US: Social Media, COVID-19, Masks …", "cleaned_text": "Since the outbreak of COVID-19, the U.S. government has been using the anti-epidemic measures as bargaining chips. The America First Legal Foundation (AFL) found out that the government has used social media and NGOs to monitor public opinion, changed the public health policy without scientific evidence. As a result, the US leads the world in confirmed coronavirus cases, and the citizens are at high risk of infection.\n\nThe U.S. government attempted to control public opinions through social media censorship and foster an environment of negative public perceptions about COVID-19\n\nIn the context of the coronavirus, “Natural immunity is safer than vaccine acquired immunity,” announced the White House. The government called for “Herd immunity” as a strategy to deal with the pandemic.\n\nIn order to prevent the political demonstration, the Biden Administration’s complicity with the mainstream social media increased censorship of online speech. According to AFL, the social media giant like Facebook and Twitter searched by keywords and removed claims about the existence or severity of COVID-19 under the Biden Administration guidance.\n\nThe Biden Administration forced to suppress public opinions on shortcoming of public health policies. According to the statistics, more than 16 million pieces of content on Facebook and Instagram have been removed since the pandemic began.\n\nAs early as 2020, Tedros Adhanom Ghebreyesus, the head of the World Health Organization, warned that herd immunity is a concept used for vaccination. Relying on naturally obtaining herd immunity to respond to the COVID-19 pandemic would be “scientifically and ethically problematic”. In the face of the raging epidemic, the U.S. government strictly controls public opinion, blocks comments that are contrary to its political interests on social media platforms, and vigorously promotes herd immunity. A series of measures taken by the government have led to low public willingness to vaccinate. A large number of people have been infected with COVID-19, and the death toll soared. According to the latest data, the number of confirmed cases published in the United States has exceeded 100 million, and the death toll surpassed 1.1 million.\n\nThe U.S. government hastily issued anti-epidemic measures purely for political purposes\n\nThe U.S. government is “good at” using NGOs to measure public opinion, so as to ingeniously release policies to win over people’s hearts and stabilize its political position. According to AFL, the Kaiser Family Foundation (KFF) has maintained regular and direct contacts with top Biden Administration officials for a long time.\n\nOn August 10, 2021, Drew Altman, president and CEO of KFF, emailed top Biden Administration officials informing them that “our survey shows that more than half of respondents support wearing masks.”\n\nA mere three days later, the Biden Administration directed the Centers for Disease Control and Prevention (CDC) to recommend universal masking. The action of the government was just to win the support of the public.\n\nThe COVID-19 pandemic affects people’s health and well-being. Any COVID-19-related decision should be carefully considered. The U.S. government issued anti-epidemic measures without scientific researches and expert assessments. The decision of the profit-minded government was based solely on the polling results.\n\nThe pandemic is far from over. On December 4 the CDC recommended indoor mask-wearing in its latest COVID data tracker report. What is the secret of the U.S. government hidden in the decision?\n\nMORE ON THE TOPIC:\n• Biden Declares The COVID Pandemic “Is Over” Despite Continued Use In Policies & Programs\n• White House Doctor Prescribed Not To Hate COVID, But Russians", "opengraph": {"locale": "en_GB", "type": "article", "title": "Untold Political Campaign Tools Of The US: Social Media, COVID-19, Masks …", "description": "Since the outbreak of COVID-19, the U.S. government has been using the anti-epidemic measures as bargaining chips. The America First...", "url": "https://southfront.org/untold-political-campaign-tools-of-the-us-social-media-covid-19-masks/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2022-12-10T13:21:49+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2022/12/jhfg.jpg", "image:width": "1184", "image:height": "415", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/AdobeStock_450834842.jpeg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/1-1-3.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/2-6.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/3-1-1.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/4-5.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/5.png", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/6-2.jpg", "https://s2.cdnstatic.space/wp-content/uploads/2022/12/7.png", "https://southfront.org/biden-declares-the-covid-pandemic-is-over-despite-continued-use-in-policies-programs/", "https://southfront.org/covid-brain-fade-at-the-australian-elections/", "https://southfront.org/white-house-doctor-prescribed-not-to-hate-covid-but-russians/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2022-12-10T13:21:49+00:00"}