{"result_id": "275039", "URL": "https://southfront.org/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents/", "timestamp": "2023-04-25 17:10:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Over 50 Biden Administration Employees, 12 US Agencies Involved in Social Media Censorship Push: Documents", "cleaned_text": "The next wave of pressure on the South Front began during the COVID hysteria in 2020, when SF analysts, together with other respected teams, experts and scientists who have not forgotten how to think, consistently promoted objective data on the real state of affairs on the COVID crisis, inspired by global elites. At that time, even before the sanctions were imposed against South Front, all our accounts on YouTube, Facebook, Twitter, etc. were once again deleted. Our accounts on Paypal and other financial platforms controlled by the United States were blocked. This was done without any legal grounds. Platforms like YouTube and Facebook simply sent notifications that accounts were blocked for spreading disinformation about COVID. We defended the point of view of reputable scientists, which indicates that the threat of COVID as a disease was intentionally and significantly exaggerated. At the same time, measures to combat the disease, such as full lockdown or wearing cloth face masks, do not correspond to the level of global threat that the MSM broadcasted. Under the pretext of Covid hysteria, the Washington backstage killed thousands of low-income US citizens without providing quarantine measures. People with any signs of a cold were sent to special medical ‘hangars’ where the infected with various strains of viruses were jointly kept, infecting each other. The elites attempted to eliminate the ‘disturbing’ part of the US socioeconomic system. More than two years have passed since the beginning of the so-called epidemic. Until now, by inertia, they are trying to tell us about the horrors of Covid, but objective analyses show that this virus, which certainly exists and is a threat, it is dangerous only by a dozen or a couple of dozen percent (according to various sources) than the usual flu. The populations of various countries could see this in practice. Thus, this attempt at social engineering, undertaken by the global backstage, failed. Interestingly, after the failure, there was already a non-global and partially successful attempt by the same group of individuals to conduct another case of social engineering. This was the US election 2020. Our fellow-thinkers and the SF Team tried to cover the situation objectively. Unfortunately for the entire Western world, the puppeteers managed to lift the Biden administration, which was completely controlled by them, to power. Perhaps this was the next step after the COVID case in the global strategy. After Biden’s victory, SF was subjected to another attack, which included the first official sanctions. This was long before the beginning of the conflict in Ukraine. An inquisitive reader can find the whole story about this on our website, in the SF Announces section. Global lies always lead to global disappointment. The puppeteers overestimated their ability to control truly independent individuals who appreciate real freedom.\n\nWritten by Zachary Stieber. Originally published by The Epoch Times\n\nMore than 50 officials in President Joe Biden’s administration across a dozen agencies have been involved with efforts to pressure Big Tech companies to crack down on alleged misinformation, according to documents released on Aug. 31.\n\nSenior officials in the U.S. government, including White House lawyer Dana Remus, deputy assistant to the president Rob Flaherty, and onetime White House senior COVID-19 adviser Andy Slavitt, have been in touch with one or more major social media companies to try to get the companies to tighten rules on allegedly false and misleading information on COVID-19, and take action against users who violate the rules, the documents show.\n\nIn July 2021, for instance, after Biden said that Facebook was “killing people” by not combating misinformation effectively, an executive at Meta reached out to Surgeon General Vivek Murthy, a Biden appointee, to say that government and Meta teams met after the remarks “to better understand the scope of what the White House expects from us on misinformation going forward.”\n\nThe same executive later wrote to Murthy saying, “I wanted to make sure you saw the steps we took just this past week to adjust policies on what we are removing with respect to misinformation, as well as steps taken to further address the ‘disinfo dozen,’” including removing pages linked to the group.\n\nThe White House publicly pressured social media companies to take action against a group that officials dubbed the “disinformation dozen,” which a nonprofit claimed were producing the bulk of “anti-vaccine misinformation” on the platforms. Also in July 2021, Murthy said Facebook hadn’t done enough to combat misinformation.\n\nFlaherty, director of digital strategy for the White House, told Slavitt and others in April 2021 that White House staff would be briefed by Twitter “on vaccine misinfo,” with the meeting including “ways the White House (and our COVID experts) can partner in product work,” according to one of the messages.\n\nIn another exchange that year, a Department of Treasury official working on “mis, dis, and mal-information” told Meta workers that the deputy Treasury secretary wanted to talk about “potential influence operations.”\n\nIn a text in February 2021, meanwhile, U.S. Cybersecurity and Infrastructure Security Agency (CISA) Director Jen Easterly wrote to another agency official that she was “trying to get us in a place where Fed can work with platforms to better understand the mis/dis trends so relevant agencies can try to prebunk/debunk as useful.”\n\nThe documents were part of a preliminary production in a lawsuit levied against the government by the attorneys general of Missouri and Louisiana, later joined by experts maligned by federal officials.\n\n“If there was ever any doubt the federal government was behind censorship of Americans who dared to dissent from official Covid messaging, that doubt has been erased,” Jenin Younes, a lawyer with the New Civil Liberties Alliance who is representing some of the plaintiffs in the case, said in a statement. “The shocking extent of the government’s involvement in silencing Americans, through coercing social-media companies, has now been revealed.”\n\nPlaintiffs said the massive pressure campaign amounted to a “Censorship Enterprise” because it involved so many officials and agencies.\n\nGovernment lawyers only identified 45 officials at five agencies—the Department of Homeland Security, CISA, the Centers for Disease Control and Prevention (CDC), the National Institute of Allergy and Infectious Diseases, and Murthy’s office—who communicated with social media companies on misinformation, although documents they produced showed others were involved, including officials at the Census Bureau and the Departments of Treasury and State.\n\nResponses from the Big Tech companies also revealed more officials involved with the effort.\n\nMeta has disclosed that at least 32 federal officials, including top officials at the White House and the Food and Drug Administration, were in communication with it about content moderation. Many of the officials weren’t identified in the response by the government.\n\nYouTube disclosed 11 officials not divulged by the government and Twitter identified nine, including senior officials at the State Department.\n\n“The discovery provided so far demonstrates that this Censorship Enterprise is extremely broad,” plaintiffs said, adding later that “it rises to the highest levels of the U.S. Government, including numerous White House officials.”\n\nAdditionally, the FBI wasn’t identified even though the agency recently said, after Meta CEO Mark Zuckerberg revealed that the bureau reached out before the 2020 election, that it routinely issues communications to social media companies.\n\nMore discovery is needed to uncover the full breadth of the pressure campaign, plaintiffs told the judge overseeing the case.\n\n“When the federal government colludes with Big Tech to censor speech, the American people become subjects rather than citizens,” Louisiana Attorney General Jeff Landry, a Republican, said in a statement. “The [U.S. Department of Justice] must not be allowed to hide behind the veil of executive privilege, especially when there is already compelling evidence that the people’s government colluded with these social media companies to suppress their right of free speech.”\n\nSee all the documents below.\n\nMORE ON THE TOPIC:\n• The Shanghai “Covid Zero Tolerance Mandate”. Engineered Depression of China’s Economy?\n• All Mainstream ‘News’-Media In U.S. Are Propaganda-Agencies", "opengraph": {"locale": "en_GB", "type": "article", "title": "Over 50 Biden Administration Employees, 12 US Agencies Involved in Social Media Censorship Push: Documents", "description": "Comment by the SouthFront Team: The next wave of pressure on the South Front began during the COVID hysteria in...", "url": "https://southfront.org/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2022-09-02T21:38:08+00:00", "article:modified_time": "2022-09-02T21:39:03+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/11/Extensive_Censorship.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s2.cdnstatic.space/wp-content/uploads/2021/11/Extensive_Censorship.jpg", "https://southfront.org/category/sf-announce/", "https://www.theepochtimes.com/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents_4704349.html?welcomeuser=1", "https://www.theepochtimes.com/t-big-tech", "https://www.documentcloud.org/documents/22273648-meta-and-hhs-messages", "https://www.documentcloud.org/documents/22273647-white-house-and-facebook-interactions", "https://www.theepochtimes.com/biden-administration-pushes-social-media-companies-to-combat-covid-19-misinformation_3903450.html", "https://www.theepochtimes.com/surgeon-general-facebooks-efforts-to-combat-alleged-covid-19-misinformation-is-not-enough_3906879.html", "https://www.documentcloud.org/documents/22273723-state-department-emails", "https://www.theepochtimes.com/federal-judge-orders-biden-administration-to-cooperate-in-social-media-collusion-lawsuit_4595222.html", "https://www.theepochtimes.com/great-barrington-declaration-authors-join-lawsuit-against-alleged-government-big-tech-collusion_4640259.html", "https://www.theepochtimes.com/cdc-met-with-big-tech-officials-in-bid-to-tackle-covid-19-misinformation-emails-show_4630326.html", "https://www.theepochtimes.com/fbi-responds-to-zuckerbergs-claim-it-helped-suppress-hunter-biden-laptop-story_4693199.html", "https://southfront.org/the-shanghai-covid-zero-tolerance-mandate-engineered-depression-of-chinas-economy/", "https://southfront.org/morbid-matters-estimating-covid-19-mortality/", "https://southfront.org/all-mainstream-news-media-in-u-s-are-propaganda-agencies/", "https://southfront.org/assad-and-zelenskyy-a-contrast-in-media-coverage/", "https://southfront.org/the-daily-mirror-publishes-fakes/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2022-09-02T21:38:08+00:00"}