{"result_id": "275044", "URL": "https://southfront.org/how-the-u-s-is-trying-to-force-china-to-break-with-russia/", "timestamp": "2023-04-25 17:10:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/how-the-u-s-is-trying-to-force-china-to-break-with-russia/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "How The U.S. Is Trying To Force China To Break With Russia", "cleaned_text": "Before there would be any World War Three between America and China (which would result from America’s officially ending its 1972-initiated “One China Policy” that Taiwan is a part of China), America would first need to isolate Russia by getting China to break with Russia and to come out unequivocally condemning Russia’s “Special Military Operation” in Ukraine and thereby cementing the U.S. control over Ukraine that U.S. President Barack Obama’s Administration had won by his February 2014 successful coup against and taking over Ukraine’s government to turn it intensely hostile towards its neighbor Russia so that America will become able to place its missiles there. The U.S. Government does not want to face a situation in which it would need to conquer both Russia and China simultaneously. It intends to conquer Russia before it conquers China. However, if it decides that that won’t be possible (as now seems likely), then America will switch to taking on China first — and that would mean the U.S. would officially cancel its 1972 One China Policy and commit itself fully to Taiwan’s being a separate and ‘independent’ country that would be 100% dependent upon U.S. military backing — and, essentially, control. (Taiwan would then become far more dependent upon the U.S. than Taiwan ever has been dependent even upon China.) America needs to capture Taiwan in order to provoke China into a war, then win that war, then take up a war against Russia, in order to achieve its goal of becoming the entire world’s dictator. But, right now, America needs to split China away from Russia. The reason for this is that if America doesn’t split them apart, then America won’t be able to win either Russia OR China.\n\nSo: in war, timing is everything, and, in America’s diplomatic preparation for WW III, the plan is to defeat Russia first, and then China; but, if that turns out not to be possible, then America will switch to defeating China first, and then Russia. America is intensifying its plan, to provoke China into a war.\n\nHere is how America’s current stage in its diplomatic preparations leading up to WW III now are proceeding:\n\nOn April 5th, the New York Times, which always reports from the standpoint of, and actually representing, the U.S. Government, headlined a wedge for the U.S. Government to use to pry China’s Government away from Russia: “China’s Ambassador to the E.U. Tries to Distance Beijing From Moscow: The ambassador, Fu Cong, said China was not on Russia’s side in the war in Ukraine. ‘No limit’ is nothing but rhetoric,’ he said, referring to a statement from last year about the countries’ relationship.” It reported that:\n\nE.U. leaders are struggling to balance their deep trade ties with China against American pressure to toughen their policies, especially in light of China’s support for Russia since the war began. China tries to present itself as a mediator, insisting that it respects the territorial integrity of Ukraine while endorsing some of Moscow’s narrative about the war.\n\nHere are a few highlights of the interview:\n\nThe ambassador downplayed Russia and China’s declaration of a “no limits” friendship last year. …\n\nMr. Fu said China was not on Russia’s side on the war and that some people “deliberately misinterpret this because there’s the so-called ‘no limit’ friendship or relationship.”\n\nHe added, “‘No limit’ is nothing but rhetoric.”\n\nOn April 6th, Russia’s RT News (which represents Russia’s Government) headlined “China disavows NYT claim about Russia relations”, and reported:\n\nThe US newspaper [NYT] said Beijing’s envoy downplayed the partnership and tried to distance his country from Moscow\n\n… The Chinese mission to the EU told the Russian news agency TASS that the interview with the NYT was about an hour long and that the highlights printed by the paper failed to properly convey Fu’s words.\n\n“The ambassador stated that some people deliberately misinterpret the Chinese position [on the crisis in Ukraine]. The things that China did and didn’t do since the start of the conflict are known in Europe and the rest of the world,” the news agency quoted the mission as saying on Thursday.\n\nThe diplomat’s office clarified that there was no sense in discussing the meaning of a “no-limits” friendship, and that the term did not imply that China was going to provide military assistance to Russia.\n\nNATO Secretary Jens Stoltenberg has urged China to halt its “growing alignment” with Russia, warning that any military assistance from Beijing to Moscow during the conflict in Ukraine would be a “historic mistake” with major consequences.\n\nSpeaking after the conclusion of a NATO foreign ministers meeting in Brussels on Wednesday, Stoltenberg sounded the alarm over Moscow’s friendly ties with the People’s Republic, insisting Beijing could soon offer weapons to Russia despite its repeated confirmation that it has no plans to do so.\n\n“China refuses to condemn Russia’s aggression… And it props up Russia’s economy,” he claimed, adding “Allies have been clear that any provision of lethal aid by China to Russia would be a historic mistake, with profound implications.”\n\nNATO is controlled by the U.S. Government; and, whenever any NATO member-nation has failed to join in to endorse a position that the U.S. Government requires, dissenting nation(s) has/have ultimately joined in to consent to it and the vote for it was unanimous. Moreover, on April 7th, the South China Morning Post bannered “Europe is ‘counting on China’ to end Russia’s war in Ukraine, leaders tell Xi Jinping in Beijing”, so that it’s not just NATO but the EU that’s threatening China on this. However, the Chinese Government’s official newspaper, Global Times, instead headlined “China-France-EU trilateral talks set right course for ties”, and continued to ignore The West’s demands to capitulate on Ukraine; it reported instead that China’s intention regarding the war in Ukraine is to serve as a “mediator” between The West and Russia on it. In other words: this was the Chinese way to tell The West no — without broadcasting to the public that it had done so.\n\nRight now, America is, in effect, demanding China to go against Russia in Ukraine. If China consents to this, then China will effectively have lost its sovereignty, and America then will become enabled to do anything in Ukraine that it wants to do. Furthermore: America’s taking Taiwan from China then won’t be so important, because America will already have taken control over China. At that stage, there will start, in earnest, an all-out war by the U.S. against Russia. The U.S. ‘defense’ budget will skyrocket, and America will go onto a full-fledged war footing. The U.S. Congress is already preparing legislation to enable that to happen. Furthermore, Russia, for its part, issued on March 31st its major new statement of its guiding ideology, and emphasizes in it that it was arrived at in collaboration with both China and India, and also other nations of the global south.\n\nInvestigative historian Eric Zuesse’s new book, AMERICA’S EMPIRE OF EVIL: Hitler’s Posthumous Victory, and Why the Social Sciences Need to Change, is about how America took over the world after World War II in order to enslave it to U.S.-and-allied billionaires. Their cartels extract the world’s wealth by control of not only their ‘news’ media but the social ‘sciences’ — duping the public.\n\nMORE ON THE TOPIC:\n• CNN Is Alarmed at Americans’ Soaring Distrust of News-Media", "opengraph": {"locale": "en_GB", "type": "article", "title": "How The U.S. Is Trying To Force China To Break With Russia", "description": "Written by Eric Zuesse Before there would be any World War Three between America and China (which would result from...", "url": "https://southfront.org/how-the-u-s-is-trying-to-force-china-to-break-with-russia/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2023-04-07T00:22:36+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2023/04/57oertkr9te.jpg", "image:width": "1030", "image:height": "620", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s2.cdnstatic.space/wp-content/uploads/2023/04/57oertkr9te.jpg", "https://www.google.com/search?client=opera&q=%22Eric+Zuesse%22&sourceid=opera&ie=UTF-8&oe=UTF-8", "https://archive.ph/f63Zk", "https://archive.is/cU1oa", "https://archive.is/kC6mu", "http://www.apple.com/", "http://www.apple.com/", "https://www.nato.int/cps/en/natohq/opinions_213478.htm", "https://archive.is/8fJfg", "https://archive.is/JVFT0", "https://web.archive.org/web/20230406182915/http://dehai.org/dehai/world-news/474369", "https://archive.is/F0zxf", "https://www.amazon.com/dp/1880026082", "https://southfront.org/eric-zuesse-u-s-government-likely-perpetrated-biggest-ever-catastrophic-global-warming-event/", "https://southfront.org/a-huge-difference-between-americas-and-russias-governments/", "https://southfront.org/cnn-is-alarmed-at-americans-soaring-distrust-of-news-media/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2023-04-07T00:22:36+00:00"}