{"result_id": "275002", "URL": "https://southfront.org/the-mrna-vaccines-poisonous-potions-medical-malpractice-or-slow-motion-genocide/", "timestamp": "2023-04-25 17:09:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/the-mrna-vaccines-poisonous-potions-medical-malpractice-or-slow-motion-genocide/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "The mRNA Vaccine’s Poisonous Potions: Medical Malpractice or “Slow Motion Genocide”?", "cleaned_text": "The British Medical Journal [BMJ] announces that the FDA is set to grant full approval to the Pfizer vaccine without public discussion of data:\n\n“Transparency advocates have criticized the US Food and Drug Administration’s (FDA) decision not to hold a formal advisory committee meeting to discuss Pfizer’s application for full approval of its COVID-19 vaccine.”\n\nThe original understanding was to hold a public discussion before approving the experimental mRNA gene therapy, falsely called vaccine, before that inoculation is fully approved as a vaccine.\n\nThe approval of the Pfizer mRNA poison is a perfect precedent for approving all other mRNA poisonous potions – thereby making the attempt at reduction of human life (“depopulation”) on earth official – the eugenists have officially won the race.\n\nAlthough this was predictable, there was hope that counter-voices and real science, as expressed by hundreds and thousands of scientists, might prevail.\n\nSo far, this diabolical agenda is overwhelming. It is overrunning the entire UN system, all 193 UN member countries, and foremost the World Health Organization (WHO), the UN-unit which people hope and trust will defend their interests.\n\nWrong: The WHO was never created to defend the health interests of the people. It was from the beginning, from its inception in 1948, an instrument to control people from a eugenist perspective, as the creation of WHO was a Rockefeller idea. The Rockefellers and Gates are among the world’s foremost protagonists of depopulation.\n\nIn the same vein, rather than an organization that seeks “preventive care”, the WHO was set up from the beginning as a “curative” body, meaning it is promoting pharmaceuticals to heal sick people, rather than preventing people from becoming sick. The curative means, pharmaceuticals, are based on petrochemicals – gradually killing traditional medicine.\n\nWhy? The Rockefellers were the owners of the largest hydrocarbon corporation Standard Oil, established in 1870 by John D. Rockefeller and Henry Flagler. It was broken up in 1911 in the guise of US antitrust regulations, just to be reassembled to become in 1999 ExxonMobile, still the world’s largest Hydrocarbon corporation.\n\nThe creation of WHO, as we see it today, was a brilliant idea – for the interest groups, Rockefellers, Gates, pharma-industry . The brilliance was exacerbated by making WHO a UN body, giving it worldwide authority about matters of health. Unlike other UN agencies which get the bulk of their budgets from the member country quotas, WHO receives 3 to 4 times more funding from the private sector, i.e. mostly pharma-corporations and from the Gates Foundation.\n\nWith this background, it becomes clear what role WHO is playing in the defense of human health.\n\nOne of the strongest programs is vaccination – a pharma bonanza – and also an obscure sector, because under the guise of vaccination in Africa, India and elsewhere, specific vaccination programs have resulted in rendering women infertile. (see this and this. Several other articles about WHO-consented infertility drives by vaccination, were “fact-checked” out of the internet – the usual.\n\nBelow are details on the WHO’s 1993 “Birth Control Vaccine” against Tetanus. Read abstract below\n\nThe Vaccine “CAUSES PREGNANCY HORMONES TO BE ATTACKED BY THE IMMUNE SYSTEM”\n\nLooking at today’s coerced COVID-19 mass vaccination with untested mRNA inoculations, makes the 2014 Kenya “tetanus” sterilization vaccines look like mere trials. They probably were and became precursors to the massive eugenist agenda launched upon the world in late 2019.\n\nThis pathological obscure cult, consisting of the World Economic Forum (WEF), the Gates Foundation, the Johns Hopkins Institute of Health as well as Big Pharma, entities within the UN system and the key international financial institutions, IMF and World Bank, have with on 18 October 2019 in NYC, clearly subscribed to an agenda of “depopulation”.\n\nThere is no doubt about it. This explains the coercive blackmail style pressure to be “vaccinated” worldwide, the vaxx-passes, that eventually will segregate the vaxxed from the un-vaxxed and create a divided society.\n\nFear and the perspective of a ban on societal life for the un-vaxxed is the driving force to increase the level of jabbed people throughout the world to the highest level possible, e.g 80%.\n\nOnce that level has been reached, massive protests from people taking to the streets, won’t matter anymore.\n\nThe inoculated people have already been marked. According to former Pfizer Vice President, top-virologist and chief scientist, Mike Yeadon, most “vaxxed” people will experience devastating impacts on their health after having been injected with the mRNA poison.\n\nOthers, like German Drs. Sucharit Bhakdi and Wolfgang Wodarg, as well Canada’s Dr. Charles Hoffe – and many more – point to a trend in mortality and morbidity for the vaccinated. According to Dr. Bhakdi:\n\n[The COVID injections] are in your bloodstream for at least a week, and they will seep into any organ. And when those [organ] cells then start to make the spike protein themselves, then the killer lymphocytes will also seek and destroy them …\n\nWhat we are witnessing is one of the most fascinating experiments that could lead to massive autoimmune disease. When this will happen, God knows. And what this will lead to, God knows.”\n\nThe mRNA-type injections cause blood clotting, leading eventually to thrombosis. Dr. Hoffe found that 62% of his patients took the mRNA “experimental gene therapy” developed microscopic blood clotting shortly after vaccination. As time goes on, more mRNA-“vaccinated” people may develop similar blood irregularities:\n\n“The blood clots we hear about which the media claim are very rare are the big blood clots which are the ones that cause strokes and show up on CT scans, MRI, etc.\n\nThe clots I’m talking about are microscopic and too small to find on any scan. They can thus only be detected using the D-dimer test.”\n\nThese people have no idea they are even having these microscopic blood clots. The most alarming part of this is that there are some parts of the body like the brain, spinal cord, heart and lungs which cannot re-generate. When those tissues are damaged by blood clots they are permanently damaged.”\n\n“These shots are causing huge damage and the worst is yet to come.”\n\nBelow is his interview, with Laura Lynn Tylor Thompson (also available on Rumble channel).\n\nThus, many of those Pfizer, Moderna and J&J vaccinated patients may die premature deaths – and in many cases tracing death back to the vaccine will be difficult and may most certainly be disguised as resulting from other causes.\n\nSince “vaccination” started on 14 December 2020, double the number of people died from the COVID vaccines than from all vaccinations in the last 30 years together. And this is based only on the reported cases. It is known, especially in the US with the (VAERS), created in 1990, that reporting covers a mere 5% to 10% of all cases.\n\nThis proportion is possibly even lower in the case of COVID-19 vaccination, due to enormous pressure to hide real adverse effects figures, especially deaths, from the public at large. Therefore, the reported figures may only be a fraction of the real cases.\n\nAccording to a study conducted by Harvard Pilgrim Health Care, Inc., based on historical data, fewer than 1% of vaccine related adverse effects are reported. (see Electronic Support for Public Health–Vaccine Adverse Event Reporting System (ESP:VAERS, p. 6).\n\nAccording to the latest figures (from government sources) for the EU, Britain and the US (combined), there are 34,052 Covid-19 injection related deaths and over 5.46 million injuries reported on 1 August 2021\n\nEU/EEA/Switzerland to 31 July 2021 – 20,595 Covid-19 injection related deaths and over 1.94 million injuries, per EudraVigilance Database.\n\nUK to 21 July 2021 – 1,517 Covid-19 injection related deaths and over 1.1 million injuries, per MHRA Yellow Card Scheme.\n\nUSA to 23 July 2021 – 11,940 Covid-19 injection related deaths and over 2.4 million injuries, per VAERS database.\n\nThe “Satanic Cult” of the Ultra Rich\n\nLess than two years ago, who would have thought that a satanic cult of ultra-rich corporate and banking oligarchs, may take over full control of all 193 UN member countries representing close to 8 billion people, with death threats and corruption, executing a plan that threatens the world’s population within the next ten years, coinciding with the infamous UN Agenda 2030.\n\nHardly anybody would have thought that humanity was capable of producing such criminal, sick monsters.\n\nThis is the author’s screenshot view. However, We, the People, are many, and they are few. They know it. That’s why they expediently and with haste.\n\nIf we act, we have to act fast and in solidarity – to stem against this monstrous project – by simply not falling into the trap of complacency, of promises and lies, but actively RESIST now, without hesitation.\n\nThen we have a chance – and not only a chance – to overcome and restore humanity with human values and with a Reset that serves humanity and not the criminal globalist agenda.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nPeter Koenig is a geopolitical analyst and a former Senior Economist at the World Bank and the World Health Organization (WHO), where he has worked for over 30 years on water and environment around the world. He lectures at universities in the US, Europe and South America. He writes regularly for online journals and is the author of Implosion – An Economic Thriller about War, Environmental Destruction and Corporate Greed; and co-author of Cynthia McKinney’s book “When China Sneezes: From the Coronavirus Lockdown to the Global Politico-Economic Crisis” (Clarity Press – November 1, 2020)\n\nHe is a Research Associate of the Centre for Research on Globalization.\n\nMORE ON THE TOPIC:\n• “We Are Confident We Have Found An Effective Low Risk Treatment For COVID, Need Further Scientific Studies To Verify”", "opengraph": {"locale": "en_GB", "type": "article", "title": "The mRNA Vaccine’s Poisonous Potions: Medical Malpractice or “Slow Motion Genocide”?", "description": "Written by Peter Koenig. Originally published on Global Research The British Medical Journal [BMJ] announces that the FDA is set...", "url": "https://southfront.org/the-mrna-vaccines-poisonous-potions-medical-malpractice-or-slow-motion-genocide/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-08-31T12:16:11+00:00", "article:modified_time": "2021-08-31T20:16:58+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2021/08/killer-covid-vaccine-768x612-1.webp", "https://www.globalresearch.ca/author/peter-koenig", "https://www.globalresearch.ca/mass-genocide-coming/5753988", "https://www.bmj.com/content/374/bmj.n2086", "https://www.globalresearch.ca/wp-content/uploads/2021/08/Screen-Shot-2021-08-25-at-15.00.46.png", "https://www.globalresearch.ca/wp-content/uploads/2009/06/113944.jpg", "https://www.scirp.org/journal/paperinformation.aspx?paperid=81838", "https://pubmed.ncbi.nlm.nih.gov/12346214/", "https://www.scirp.org/journal/paperinformation.aspx?paperid=81838", "https://www.scirp.org/journal/paperinformation.aspx?paperid=81838", "https://www.globalresearch.ca/wp-content/uploads/2021/03/event201.png", "https://www.globalresearch.ca/microbiologist-explains-covid-jab-effects/5753710", "https://www.bitchute.com/video/A6GbcUl6blpJ/", "https://rumble.com/vjuhch-canadian-doctor-62-of-patients-vaccinated-for-covid-have-permanent-heart-da.html", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "http://www.amazon.com/Implosion-Economic-Environmental-Destruction-Corporate/dp/059545349X", "https://southfront.org/we-are-confident-we-have-found-an-effective-low-risk-treatment-for-covid-need-further-scientific-studies-to-verify/", "https://southfront.org/wuhans-bat-lady-warns-of-coming-covid-19-mutants/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-08-31T12:16:11+00:00"}