{"result_id": "275008", "URL": "https://southfront.org/russian-sputnik-v-diplomacy-failed-in-iran/", "timestamp": "2023-04-25 17:09:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/russian-sputnik-v-diplomacy-failed-in-iran/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Russian Sputnik V Diplomacy Failed In Iran", "cleaned_text": "Iran is still waiting for Russia to fulfill its obligation supply millions of doses of Sputnik V vaccine as soon as possible. According to the contract signed by the countries last January, 62 million doses should be delivered to the Islamic Republic. 1 million 20 thousand doses have been received by Tehran so far.\n\nOn August 10th, the Iranian Ambassador to Russia Kazem Jalali commented on the issue, expressing his hope that the remaining part of the vaccines should be delivered to Iran as soon as possible. According to his statements, the Iranian officials are still no aware when Iran expects to receive a precious delivery.\n\n“This question should be asked to our Russian colleagues, because what we could do was to sign a contract and ask them to deliver it to our country, and this was done, the contract was concluded by our government. But so far, a small part of the contract has been implemented, and the remaining part has not been implemented, ” the ambassador complained.\n\nJalali highlighted that they hope for Moscow to fix all production and delivery obstacles in faces as soon as possible. According to him, Iran understands that Russia must first strengthen its internal production, so Tehran does not see “evil intentions in this matter.”\n\nIn its comments to the Russian media, the Russian Direct Investment Fund recalled that it had previously reported temporary delays in the delivery of the second component of Sputnik V due to a significant increase in the production capacity. All the delays should be reportedly fixed out in August.\n\nIt is not clear how Moscow will supply 60 million dozes more Iran in two weeks. Even without taking into account other countries waiting for Russian Sputnik V.\n\nMeanwhile, Iranian authorities face the vaccination campaign at risk to fail. According to the report by the Associated Press, by August 11, only three million people out of 80 million were vaccinated, only four percent of the country’s population.\n\nDelays in Russian supplies have a very bad impact on public opinion in Iran.\n\nThe vaccine that should become a good tool for the public diplomacy now has a controversial effect. Moreover, the Iranians remember the refusal of Ali Khamenei, supreme leader of Iran, to accept supplies of Pfizer and AstraZeneca vaccines from the United Kingdom and the United States.\n\nAccording to Johns Hopkins University, since the beginning of the pandemic, more than 4 million people have been contaminated in Iran, 94 thousand people have died.\n\nAt the moment, the Iranian authorities are vaccinating people with four vaccines: the Russian Sputnik V, the Chinese Sinovac, donated by Japan and the UN AstraZeneca, as well as the Iranian COVIran Barakat. Last month, the Russian Direct Investment Fund reported that in addition to the supply of the Russian vaccine, test production of Sputnik V was launched in Iran. Actoverc, one of the leading pharmaceutical companies in Iran, became a partner.\n\nMORE ON THE TOPIC:\n• Does the Virus Exist? The Sars-COV-2 Has Not Been Isolated? “Biggest Fraud In Medical History”\n• Foreign Diplomatic Staff Swarming To Get Vaccinated With Sputnik V In Russia", "opengraph": {"locale": "en_GB", "type": "article", "title": "Russian Sputnik V Diplomacy Failed In Iran", "description": "Iran is still waiting for Russia to fulfill its obligation supply millions of doses of Sputnik V vaccine as soon...", "url": "https://southfront.org/russian-sputnik-v-diplomacy-failed-in-iran/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-08-11T18:34:48+00:00", "article:modified_time": "2021-08-11T18:56:19+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/08/http___com.ft_.imagepublish.prod_.s3.amazonaws.jpg", "image:width": "700", "image:height": "394", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2021/08/http___com.ft_.imagepublish.prod_.s3.amazonaws.jpg", "https://southfront.org/does-the-virus-exist-the-sars-cov-2-has-not-been-isolated-biggest-fraud-in-medical-history/", "https://southfront.org/foreign-diplomatic-staff-swarming-to-get-vaccinated-with-sputnik-v-in-russia/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-08-11T18:34:48+00:00"}