{"result_id": "275041", "URL": "https://southfront.org/the-mauling-of-novak-djokovic/", "timestamp": "2023-04-25 17:10:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/the-mauling-of-novak-djokovic/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "The Mauling of Novak Djokovic", "cleaned_text": "Rarely can the treatment of a grand sporting figure by officialdom have caused such consternation. Novak Djokovic, the tennis World Number One, has always had a tendency to get under skin and constitution, creating a large following of admirers and detractors. But his current treatment by Australian authorities, and his subsequent detention as an unlawful arrival despite being granted a visa to participate in the Australian Open, had the hallmarks of oppression and incompetent vulgarity. In time, it may well also prove to have been another example of provincial opportunism and crass stupidity.\n\nIt all began with the thick cloud of doubt over whether the Serbian tennis star needed to show proof of vaccination or otherwise in entering Australia. The Australian Open had become the first grand slam tennis tournament to require mandatory vaccination for all athletes subject to exemptions. This was a position also taken by the Victorian government. What remained unclear was whether dispensations could be granted, and under what conditions.\n\nDjokovic was always unwilling to reveal his vaccination status. His response to the pandemic has also been patchy, even cavalier. The Adria Tour in June 2020, created as a response to the cancellation of various sporting events, proved disastrous. Organised by the Novak Djokovic Foundation as a “charity tour to help the coronavirus victims”, it saw players, spectators and officials contract COVID-19, including Djokovic himself, resulting in the abandonment of the tournament.\n\nAlong with other tennis players, his application to participate in the Australian tournament, assessed anonymously, was accepted, leading him to confirm his departure for Melbourne earlier this month. Two bodies were involved in conducting the review: Tennis Australia and an independent medical exemption review panel. The Victorian Department of Health confirmed that the exemptions had been granted to those with a “genuine medical condition”.\n\nThe next part of the story is revealing about Australian officialdom. On arriving in Melbourne, Djokovic encountered the nastiness that has made the Australian Border Force famous in celluloid, social media and print. It was all good to have received an exemption from two bodies; but the ABF retained the discretion to ask for further particulars and revoke any visa at their discretion. The Commonwealth, after all, is the final arbiter as to who crosses the border.\n\nA statement by the ABF, never paragons of thoroughness or justice, claimed that “Mr Djokovic failed to provide appropriate evidence to meet the entry requirements to Australia, and his visa has been subsequently cancelled.” In the cobwebbed mind of bureaucratic reasoning, this could mean, and be, anything.\n\nIn the right royal mess that ensued, the Victorian government, on being asked by the federal government to supply evidence of Djokovic’s exemption, declined to sponsor him. Prime Minister Scott Morrison, showing that exemptions are viewed differently depending on which authority in Australia provides them, was satisfied that the right decision had been made. In his particular reasoning, “Rules are rules, especially when it comes to our borders. No one is above these rules. Our strong border policies have been critical to Australia having one of the lowest death rates in the world from COVID, we are continuing to be vigilant.”\n\nHome Affairs Minister Karen Andrews also stated that all arrivals in Australia had to “provide acceptable proof that they cannot be vaccinated for medical reasons”. Absent that, Djokovic “won’t be treated any different to anyone else and he’ll be on the next plane home.” Such words are rich coming from a government addicted to subverting the rule of law, convention and due process.\n\nThe view also went some way in making a mockery of the assessments by both Tennis Australia and the medical review board. As Australia Open director Paul McNamee explained to the ABC, “every player and support member fills in a form, visa 408, and everyone does that, you are guided through it by Tennis Australia, every step of the way, and then you get approval, that is the process.”\n\nMcNamee stressed that Djokovic “was following the rules. You might be angry that he was given an exemption, but players need to have confidence that the rules they abide by going are to be enforced, so if this is something to [do] with the vaccination in the exemption, for me that’s not fair.”\n\nThe legal challenge by Djokovic makes various assertions. The player received, the defence argues, a temporary activity class visa on November 18. Djokovic had tested positive to a PCR test on December 16 and was subsequently granted the exemption. It was then claimed that the Home Affairs Department had sent a note on January 1 informing him that he had met “the requirements for a quarantine-free arrival into Australia”.\n\nThe submission is in stark contrast to correspondence from the Health Department and the Commonwealth. The former’s First Assistant Secretary Lisa Schofield had informed Tennis Australia Chief Executive Craig Tilley that, “People who have previously had COVID-19 and not received a vaccine does are not considered fully vaccinated.” Health Minister Greg Hunt, on following up Schofield’s observations, also confirmed that those who had contracted COVID-19 “within six months and seek to enter Australia from overseas, and have not received two doses of a Therapeutic Goods Administration (TGA)-approved or TGA-recognised vaccine … are not considered fully vaccinated.”\n\nMost tellingly, the Morrison government, and a good number of Fortress Australia types, have made it clear that the very concept of any right of entry, notably during times of emergency such as a pandemic, is irrelevant and has no bearing in a court of law or before any tribunal of justice.\n\nWhile it will be of little comfort to Novak, he should not be surprised that Australian government officials are equally contemptuous of any right of return for Australian citizens, who remain at the mercy of a spray of weak High Court judgments and a total absence of constitutional protection. Tens of thousands have been stranded in other countries since 2020, left at the mercy of menacing poverty, lack of safety, reviled and mocked as disease ridden and undeserving of sanctuary. The Commonwealth and State governments have all done their bit to prevent such returns, imposing onerous requirements and even, in some cases, threatening punitive fines. The Australian passport has become a form of debased coinage.\n\nThe cancellation of Djokovic’s visa also led to another brush with institutional savagery. The tennis player is being detained at Carlton’s Park Hotel, a facility that has been used for refugees more than acquainted with the concentration camp system reserved for “unlawful” naval arrivals. He can at least count himself fortunate not to be rendered to the tropical torture centres of Nauru or Manus Island, two favourite destinations for Canberra’s undesirables.\n\nWhen it comes to Australia’s refugee concentration camp system, celebrity or standing provides little by way of salvation. As former Australian Prime Minister Malcolm Turnbull explained to his counterpart President Donald Trump in discussing a refugee transfer between the countries, Australia would be more than happy to jail Nobel Prize laureates if they did not have the requisite paperwork. “So, we would rather take a not-very-attractive guy that helps you out than to take a Nobel Peace Prize winner that comes by boat.”\n\nIrate detainees, some having been in captivity for almost a decade, have also noted the sudden spike of interest, if only because of the celebrity calibre attention being paid to Djokovic. Protests in Serbia, Montenegro and Australia have taken place. Carlton’s Park Hotel has been the site of a hearty gathering of supporters. Serbian President Aleksandar Vučić has urged that the tennis player not be held “in that infamous hotel”.\n\nThis could but induce sadness on the part of Mehdi Ali, an Iranian immigrant who was fifteen when he sought sanctuary in Australia and is also being held at the Park Hotel. “I’ve been in a cage for 9 years, I turn 24 today, and all you want to talk to me about is [Djokovic],” he tweeted on January 7. “Pretending to care by asking me how I am and then straight away asking questions about Djokovic.”\n\nTo the hosts of an Australian television program , Mehdi did take some heart that attention was finally being showered upon the grim conditions in the detention hotel. Those who “came here for Djokovic … found out about our circumstances and they were shocked.”\n\nThe appeal hearing against the decision by the ABF is taking place today (January 10) where some sense of the brutish nonsense that has transpired may be made. But for the likes of Mehdi, the Djokovic storm, whether it results in him playing or not in Melbourne, will pass. A country filled with the descendants of convicts and their gaolers will continue working to form.\n\nDr. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. Email:\n\nMORE ON THE TOPIC:\n• Pro-Iranian Forces Blew Up Seven US Supply Convoys In Central, Southern Iraq (Videos)", "opengraph": {"locale": "en_GB", "type": "article", "title": "The Mauling of Novak Djokovic", "description": "Written by Dr. Binoy Kampmark Rarely can the treatment of a grand sporting figure by officialdom have caused such consternation. ...", "url": "https://southfront.org/the-mauling-of-novak-djokovic/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2022-01-10T10:50:56+00:00", "article:modified_time": "2022-01-11T19:34:53+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2022/01/Novak-Djokovic-scaled.jpg", "image:width": "2560", "image:height": "1708", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2022/01/Novak-Djokovic-scaled.jpg", "https://www.essentiallysports.com/novak-djokovics-health-update-after-getting-infected-by-coronavirus-atp-tennis-news/", "https://twitter.com/DjokerNole/status/1478319120626196482?s=20", "https://uk.sports.yahoo.com/news/novak-djokovic-granted-medical-exemption-123900638.html?guccounter=1&guce_referrer=aHR0cHM6Ly9kdWNrZHVja2dvLmNvbS8&guce_referrer_sig=AQAAAHE7MkF4u3TPmm1ASb-fZzxjDVeX75jnqBwcqDvIaYDiZPVOiPl8SiPBemYqYZFZLE8wQweHJyBHmn8TiHQQrjPURmu5mujN8QcEre0PLdbAtRNWX6H8A0A2f22xragez3bi1Dl9ujisj2-HP4DWmsPCV66h6FpuGf0wFtmnVZLX", "https://www.abc.net.au/news/2022-01-06/live-novak-djokovic-visa-reactions/100741054#live-blog-post-1207369403", "https://twitter.com/ScottMorrisonMP/status/1478848008363991049", "https://www.abc.net.au/news/2022-01-06/novak-djokovic-the-unlikely-hostage-in-petty-political-saga-/100741720", "https://www.abc.net.au/news/2022-01-06/live-novak-djokovic-visa-reactions/100741054#live-blog-post-1207369680", "https://www.skynews.com.au/australia-news/coronavirus/novak-djokovic-claims-home-affairs-approved-entry-into-australia-in-documents-provided-to-court/news-story/9a0c94bcacc23947203a9362f32a0d54", "https://www.skynews.com.au/australia-news/coronavirus/novak-djokovic-claims-home-affairs-approved-entry-into-australia-in-documents-provided-to-court/news-story/9a0c94bcacc23947203a9362f32a0d54", "https://www.eurekastreet.com.au/article/india-travel-ban--citizenship-comes-a-distant-second-place", "https://www.theguardian.com/us-news/2017/aug/04/what-weve-learned-from-the-trump-turnbull-call-transcript", "https://balkaninsight.com/2022/01/07/protests-in-serbia-montenegro-denounce-djokovics-detention-in-australia/", "https://balkaninsight.com/2022/01/07/protests-in-serbia-montenegro-denounce-djokovics-detention-in-australia/", "https://twitter.com/MehdiAli98/status/1479199639211413506", "https://www.news.com.au/entertainment/tv/current-affairs/its-disgusting-project-hosts-fire-up-after-iranian-immigrant-mehdi-ali-shares-story-of-nine-years-in-australian-detention/news-story/353c629636b3d0eeeb673c1dbc94c20b", "mailto:bkampmark@gmail.com", "https://southfront.org/pro-iranian-forces-blew-up-seven-us-supply-convoys-in-central-southern-iraq-videos/", "https://southfront.org/military-situation-in-kazakhstan-on-january-9-2022-map-update/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2022-01-10T10:50:56+00:00"}