{"result_id": "275029", "URL": "https://southfront.org/biden-plagiarizes-again-after-bloomberg-points-out-virus-plan-is-basically-trumps/", "timestamp": "2023-04-25 17:10:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/biden-plagiarizes-again-after-bloomberg-points-out-virus-plan-is-basically-trumps/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Biden Plagiarizes Again After Bloomberg Points Out Virus Plan Is Basically Trump's", "cleaned_text": "While President Biden has done nothing but disparage President Trump’s COVID-19 vaccination plan – while promising on the campaign trail to ‘introduce his own,‘ it now appears there was no ‘new’ plan whatsoever – and his team is with “modest changes,” according to\n\nBiden has said vaccine distribution was in “worse shape than we anticipated.” White House Chief of Staff Ron Klain said a Trump administration plan “did not really exist.” Adviser Cedric Richmond said they “didn’t leave a plan.” Xavier Becerra, Biden’s choice for health secretary, said it was like taking over a plane in a nosedive. But while Biden’s approach to the virus — frank warnings about the pandemic, mask mandates on federal property — is a reversal from Trump’s policies, his administration’s distribution of vaccines so far looks little different from that of its predecessor. Before Biden was sworn in, vaccines already were being delivered at a pace to meet his goal of 100 million doses in his first 100 days as president. The Biden administration has said they’ll order new doses, but will do so by exercising options in contracts negotiated by the previous administration, which thought it premature to do so. They say they’ll use the Defense Production Act, which Trump used repeatedly. Rather than a total overhaul, they have otherwise made course corrections and modest shifts. Data released Friday by Johnson & Johnson will fuel hopes that a third vaccine soon could hit the U.S. market. –Bloomberg\n\nBiden – who has a history of plagiarism – was essentially lying, especially when one considers the mammoth effort involved in distribution efforts which would make major changes costly and risk setbacks to the program. adds that “some aspects of the program don’t offer much wiggle room to begin with, while the trickiest part are yet to come.”\n\ndoes toss Biden a bone, however, reporting that Trump ‘undercut’ Biden’s efforts to shape the program by delaying the transition while disputing the results of the election. Trump’s team, however, says they had over 300 transition briefings with health officials – which Biden officials claim contained little useful information until just days before the inauguration.\n\nMeanwhile, officials from the Operation Warp Speed – the joint effort between the Trump administration’s Departments of Health and Human Services and DoD, say the partisan sniping from Biden’s team is hurting morale among career staff who are handling the vaccine rollout.\n\n“The transition is happening less well than I, and my team, had been hoping,” said Moncef Slaoui, chief scientific adviser to Operation Warp Speed. “The team doesn’t understand why the Operation is being criticized as it is. It is so unfair and unjustified.”\n\n“If it wasn’t for this Operation, we may not have as many vaccines as we will now.”\n\nAlso pushing back against the Biden team’s besmirchments is Anthony Fauci, the highest-paid employee in the federal government and ongoing COVID-19 advisor to the Office of the President.\n\n“We certainly are not starting from scratch,” Fauci said earlier this month. “It’s taking what’s gone on, but amplifying it in a big way,” he added. Even Biden said that “credit is absolutely due” to the Trump administration for launching the vaccine program.\n\nAccording to , “Biden is endorsing federally run community vaccination centers and mobile clinics,” and will attempt to provide states with a three-week supply, along with an increase in the number of people who can administer it. Trump officials, however, say the limitation is the number of vaccines, not healthcare professionals.\n\nBiden is also focusing on communities of color instead of devoting all resources to first vaccinating essential workers and those at most risk of dying from the virus. According to Biden, communities of color have been disproportionately affected by the virus.\n\nYet, most of the plan remains unchanged .\n\n[T]he biggest pieces of the distribution effort remain unchanged, undercutting claims from some Biden advisers that they inherited no plan. Many of the most stubborn bottlenecks don’t stem from the federal government’s decisions: Companies simply can’t produce vaccines fast enough and supplies are scarce; even if distribution goes smoothly, the administration of doses gets backed up at the local level. “What we’re seeing here is them marching through the playbook of Operation Warp Speed,” added Michael Pratt, a former Health and Human Services official under Trump. “Something cannot simultaneously be a dismal failure and have already accomplished the ‘ambitious goal’ you set.” Nearly every industrialized nation has been beset by vaccine delays. The European Union has moved to restrict vaccine exports. The U.S. has administered 8.3 doses per 100 people, trailing the U.K. and Israel yet outpacing Germany, Canada, France and the EU overall, according to Bloomberg’s Vaccine Tracker. –Bloomberg\n\nThe Biden team has also retained many key Trump personnel, including the co-leader of Operation Warp Speed, General Gustave Perna.\n\nFurthermore, one of Biden’s key tools to move quickly on the virus response is the use of the Defense Production Act to prioritize the availability of certain materials and supplies – which the Trump administration used extensively.\n\n“It is really incorrect to say there was no plan — because we’re already achieving 1.3 million doses in arms per day, which exceeds the first goal President Biden had,” said Brett Giroir, who led the Trump administration’s program to ramp up widespread virus testing.\n\nOne wild card is whether another vaccine will hit the market anytime soon. Late Friday, Johnson & Johnson announced that its single-dose vaccine generated strong protection against COVID-19 in a large, late-stage trial. The company expects it to be ‘quickly brought to market without the missed delivery timelines of the Pfizer shots.’ If authorized for use, the J&J vaccine could allow the Biden team to reach 2 million total doses per day according to a former Trump official.\n\nAnd that’s, the rest of the story…\n\nMORE ON THE TOPIC:\n• Biden Needs War On Iran To Address Internal Crises", "opengraph": {"locale": "en_GB", "type": "article", "title": "Biden Plagiarizes Again After Bloomberg Points Out Virus Plan Is Basically Trump's", "description": "Originally appeared at ZeroHedge While President Biden has done nothing but disparage President Trump’s COVID-19 vaccination plan – while promising...", "url": "https://southfront.org/biden-plagiarizes-again-after-bloomberg-points-out-virus-plan-is-basically-trumps/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-02-01T09:30:50+00:00", "article:modified_time": "2021-02-01T09:31:08+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2019/05/1-13.jpg", "image:width": "665", "image:height": "340", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://www.zerohedge.com/covid-19/biden-plagiarizes-again-after-bloomberg-points-out-virus-plan-basically-trumps", "https://www.voanews.com/covid-19-pandemic/biden-counters-trump-covid-19-vaccine-delivery-plan-his-own", "https://www.bloomberg.com/news/articles/2021-01-29/biden-covid-team-derides-trump-plan-while-borrowing-its-playbook?sref=ZMFHsM5Z", "https://www.zerohedge.com/s3/files/inline-images/sad%20biden_3.jpg?itok=n4ViXrCj", "https://www.bloomberg.com/quote/JNJ:US", "https://www.bloomberg.com/news/articles/2021-01-29/biden-covid-team-derides-trump-plan-while-borrowing-its-playbook?sref=ZMFHsM5Z", "https://www.zerohedge.com/news/2019-06-11/biden-cant-stop-plagiarizing-time-rips-michael-avenatti-slogan?utm_source=dlvr.it&utm_medium=twitter", "https://www.zerohedge.com/political/not-again-joe-biden-accused-plagiarizing-canadian-politician-dnc-speech", "https://www.zerohedge.com/markets/dr-anthony-fauci-highest-paid-employee-entire-us-federal-government", "https://www.bloomberg.com/news/articles/2021-01-28/europe-opens-door-to-vaccine-export-ban-risking-global-backlash", "https://www.bloomberg.com/news/articles/2021-01-29/biden-covid-team-derides-trump-plan-while-borrowing-its-playbook?sref=ZMFHsM5Z", "https://southfront.org/biden-needs-war-on-iran-to-address-internal-crises/", "https://southfront.org/white-house-briefings-for-children-jen-psaki-circles-back/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2021-02-01T09:30:50+00:00"}