{"result_id": "275001", "URL": "https://maps.southfront.org/argentina-the-battle-of-covid-vaccines/", "timestamp": "2023-04-25 17:09:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://southfront.org/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/argentina-the-battle-of-covid-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "maps.southfront.org", "title": "Argentina: The Battle Of COVID Vaccines", "cleaned_text": "Playing a sad tango melody, the 2019 Covid pandemic is sending Argentina and its government into a tailspin. Accusations of corruption in the management of the vaccination campaign, controversies over the supply of medicines, quarrels with pharmaceutical companies and the temptation to sell state property – from the Patagonian glaciers to the military barracks – to sign the necessary contracts to obtain anti-covid vaccines. Someone even proposed to sell the Malvinas Falklands islands to Pfizer in exchange for the supply of vaccines.\n\nArgentina was one of the countries most affected by the pandemic in the world, with health facilities always on the verge of collapsing. In May 2020, the country went into default. It had to renegotiate the debt with the International Monetary Fund and with the proprietary funds of the debt securities (Blackrock and Greylock Capital, above all) again and again. The percentage of people living below the poverty line has reached 44 percent, inflation is traveling at more than 35 percent a year, and the value of the financial market has plummeted to $ 20 billion against an estimate of $ 350 billion in 2018.\n\nWith a mountain of billions to repay to the IMF and private funds, how did Argentina manage to sign the contracts to buy vaccines? Here is the chronicle with the salient facts of Argentina’s crazy vaccine hunt.\n\nOn February 2020, Argentine President Fernandez gave the green light to the Pfizer-Biontech vaccine trial, recruiting nearly 6,000 volunteers and making a network of military hospitals available to the US company. A strategy for obtaining favorable conditions from Pfizer. Fernández hoped to conclude an agreement with the US laboratory to access 3 million doses of the vaccine by the end of 2020. It did not work.\n\nAt that time, the “glaciers” scandal broke out. Jorge Rachid, medical doctor and adviser to the government of the province of Buenos Aires, accuses the pharmaceutical giant Pfizer of having asked the national government for “guarantees” in exchange for the vaccine against Covid-19:\n\nNo denial and no comment came from Pfizer. But the contract with the Argentine government was not signed. Rachid also noted that among the largest shareholders of the pharmaceutical company was the American fund Blackrock, “the same investment fund that tried to block the renegotiation of the Argentine debt “.\n\nThe government of Buenos Aires is forced to choose other vaccines: the Chinese one, the Cuban one and also signs the contract with Astrazeneca. In the background, there remains an attempt to conclude the agreement with Pfizer Biontech.\n\nThe start of the vaccination campaign coincides with yet another political scandal. Health Minister Mario Ginés González García is forced to resign: he allegedly created a VIP lane for members of government parties. In practice, the anti-covid vaccine would have been distributed not with the principles of health protection, but only by favoring the comrades and party friends of the government majority. In mid-February 2021, Ginés González García resigned.\n\nRelations between Pfizer and the Argentine government were discussed again at the end of April 2021. Former Security Minister Patricia Bullrich accuses the government of President Fernandez of having blown up the contract with Pfizer for requesting bribes. Bullrich also launches a shocking proposal: in order to have that US vaccine, the government would have had to sell state property to the pharmaceutical company. Even the Malvinas-Falkland Islands, if they asked.\n\nIt is impossible not to think about what Rachid said at the beginning of the negotiations between Pfizer and the Argentine government. The pharmaceutical company will deny having received requests for bribes from members of the Argentine government. President Fernandez, however, will accuse Pfizer of placing unacceptable conditions for the sale of the vaccine.\n\nMORE ON THE TOPIC:\n• How It All Went Wrong: The Global Response To COVID-19", "opengraph": {"locale": "en_GB", "type": "article", "title": "Argentina: The Battle Of COVID Vaccines", "description": "Written by Piero Messina exclusively for SouthFront. Playing a sad tango melody, the 2019 Covid pandemic is sending Argentina and its...", "url": "https://southfront.org/argentina-the-battle-of-covid-vaccines/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-06-04T04:00:39+00:00", "article:modified_time": "2021-06-03T20:06:30+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/06/2021-06-03_23-01-43.jpg", "image:width": "864", "image:height": "576"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/wp-content/uploads/2021/06/2021-06-03_23-01-43.jpg", "https://southfront.org/suicidal-games-tokyos-coronavirus-olympics/", "https://southfront.org/how-it-all-went-wrong-the-global-response-to-covid-19/"], "authors": [], "publish_date": "2021-06-04T04:00:39+00:00"}