{"result_id": "275025", "URL": "https://southfront.org/military-situation-in-eastern-ukraine-on-december-28-2021-map-update/", "timestamp": "2023-04-25 17:10:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/military-situation-in-eastern-ukraine-on-december-28-2021-map-update/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Military Situation In Eastern Ukraine On December 28, 2021 (Map Update)", "cleaned_text": "Going strictly by the CDC and virus tracker numbers we see that the death rate from Covid-19 is about .4% (.004). We also see that the death rate from the Vaccine is .004% (.00004). This means that the Vaccine death rate is 1% of the death rate of the Covid-19 virus. If the vaccine saves 99 out of every 100 of those who would have died from Covid-19 with only one out of 100 dying then that sounds like a great thing and it makes a vaccine mandate sound like a great thing.\n\nHere lies the problem. The one that the vaccine kills is not necessarily someone who would have died from Covid-19 and could even be someone who has already had Covid-19 and recovered. So in fact to save the 99% of those who would have died from Covid-19 an innocent person has to die when the vaccine is mandated.\n\nBut it gets worse. Even though 65% of the population has been vaccinated the new cases of Covid-19 are spiking above pre vaccine levels. This cannot happen if the vaccine actually worked. So we know that the vaccine kills people meaning it’s not “safe” and we know that the vaccine is not “effective”.\n\nAlso, 80% of deaths from Covid-19 are among those over 65 years of age, though they make up only 16% of the population. If you look at the 5-11 age group you find that more will actually die from the vaccine than from the Covid-19 virus itself. This means that a vaccine mandate would sacrifice the innocent and otherwise healthy young to save the sick and elderly.\n\nIn times past certain people would offer human/child sacrifice to allay their fears of some “god” believing that the sacrifice of one would save the lives of many. Of course we all know that that was a lie and that those people died for no good reason. The very belief that killing and innocent person to save another person is somehow right is ungodly in the first place.\n\nJust like those people of old who sacrificed innocent people to appease their fears because they believed in a lie, so are those today who demand a vaccine mandate. The innocent people who will be sacrificed will have died for no reason and those who live in fear and demand a vaccine mandate will be guilty of murder and human/child sacrifice.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Military Situation In Eastern Ukraine On December 28, 2021 (Map Update)", "description": "DPR forces shelled UAF positions near Maryinka with 120-mm mortar launchers; DPR forces shelled UAF positions near New York with...", "url": "https://southfront.org/military-situation-in-eastern-ukraine-on-december-28-2021-map-update/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2021-12-28T15:38:24+00:00", "article:modified_time": "2021-12-28T15:21:52+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2021/12/28december2021_Eastern_Ukraine_map-scaled.jpg", "image:width": "1591", "image:height": "2560", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-12-28T15:38:24+00:00"}