{"result_id": "275006", "URL": "https://southfront.org/russian-soft-power-in-action-sputnik-v-spread-in-latin-america/", "timestamp": "2023-04-25 17:09:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/russian-soft-power-in-action-sputnik-v-spread-in-latin-america/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "Russian Soft Power In Action: Sputnik V Spread In Latin America", "cleaned_text": "In the midst of the Covid 19 pandemic, the world was launched into accelerated development of a vaccine against the disease. After months of research, some vaccine candidates stood out, including Sputnik V developed by the Russian company Gamaleya.\n\nBut in reality, the Russian vaccine was largely criticized by the mass media. In Latin America, most of them only reproduced statements of the Western corporate media, and were satisfied with that. What did they say? Well, it varied. First, they claimed that there were no real studies and papers. It was a lie, there were papers, they just didn’t ask for them or did not read the reports. Maybe it’s because Western medical science goes through the England magazine The Lancet, and what is not published there, “doesn’t exist.” But this is real, and the Gamaleya company later sent its studies to the WHO and The Lancet, silencing that claim.\n\nThen, the MSM claimed that the Russians are not to be trusted and their vaccine was not really good, it could not be ready so fast. Above all, the local media stated that those in Latin America who were interested in the vaccine, such as Venezuela, Nicaragua or Argentina, only got that vaccine for political reasons and their leaders would not actually do this. It turned out that their leaders did trust and use the vaccine (both Putin`s daughter and Maduro’s son received it), and that in Russia it was applied en masse among the population.\n\nIt was also said a lot: that the Russians accelerated the times to try to be first and compete the West. But the reality is that the developers of the Sputnik V vaccine had announced their schedule since August and September, sticking to it. Not so did the Western pharmaceutical companies, which did cut the time for vaccine development that they had announced… to reach dates close to those of the Sputnik V vaccine.\n\nFinally, the regional media changed their discourse from defamation to disdain and irrelevance.\n\nThey have never addressed the question of why some regional governments chose Pfizer,which is more expensive, with some setbacks during the tests (like all the others), with a “cold chain” that forced to buy special equipment and design an unprecedented regional logistics to maintain those -70ºC needed. No regional media demanded to see the studies of Pfizer, contrary to Gamaleya which reached the government level, where the Russian vaccine was questioned because “they had not seen the studies”, but they had nothing from Pfizer either.\n\nThe general population, as usual, did not get to see any papers or study anywhere, only the “rocket phrases” that the press gave.\n\nWho will receive the Russian Sputnik V vaccine in Latin America?\n\nThere are no secrets, but a lot of misinformation. Let’s start on the safe side.\n\nArgentina receives it, and in order to deliver it quickly, they sent a special plane to Russia. The first batch consisted of 300 thousand vaccines (with 14 million at the beginning of 2021), which leaves the 10,000 that Pfizer sent to Chile as smallfry. Argentina had made a big bet on the Russian option, always defending that studies were reliable, and that they monitored the progress. They also had deals and negotiations with other companies, such as Pfizer and Astrazeneca. There was no deal with the first one, and what was declared by the Argentine government in this regard is very significant:\n\nSuch specific contracts… were they signed by the governments of Chile and Mexico?\n\nIt’s hard to imagine that Venezuela is so poor that could not allocate some funds for import of Sputnik V. More likely, the real reason of continuing negotiations is the desire to manage homeland production of the Russian vaccine that further will be distributed in Venezuela and the entire region. If this assumption is true, Venezuela will probably wait to local vaccine to be ready up to April. Meanwhile, they are likely to have sporadic amounts of Russian vaccine before their production is localized.\n\nVaccines today are in their mass production phase, but the vast majority of doses will go to their original nations and main partners. Almost all the nations of Latin America have turned to the WHO Covax system, which guarantees them access to vaccines at a good price and in a stable supply… within a few months. This is an important factor: many countries do not want to wait, because politically it has a great cost to explain how the rich countries are vaccinated en masse while their countries still have to wait for several months. It has become a matter of prestige to show that they can be vaccinated at the same time as the great powers. For now, Pfizer sends symbolic amounts of the vaccine to countries like Chile and Costa Rica, about 10,000 each. Likewise, Russian production will go first to Russia itself, which greatly needs it, and then to its allies, including Venezuela. In a matter of weeks, production will multiply everywhere.\n\nOther countries that have signed up for the Russian vaccine are Brazil and Mexico. But Mexico is already working with Pfizer vaccine, so it is not in much rush to receive the Russian one, and the date of its arrival is probably related to Pfizer’s ability to to meet the local demand. On the other hand, Peru has no time. Its deals with Pfizer failed (the current government blamed the previous one, and the previous one defends itself saying that “everything was ready to sign”). As they were interested only in that one, it`s not expected to receive vaccines until April, via Covax system. However, as they had made promises to the population, the government is trying to give new impetus to the negotiations for Sputnik V,which was requested directly by departmental governors from all over Peru from the very beginning, being ignored by the central government. There is also an option from Sinopharm, a Chinese company, which was tested in the country and is the most likely candidate for global spread in the short term. Before dealing with Brazil, we will mention Nicaragua and Cuba. The first, talked and promised too much, assuring months ago that production of the Gamaleya vaccine would take place in the country, and then saying, a few days ago, that they are waiting to see which one is the best. As for Cuba, a long-standing Russian ally, it develops its own vaccine and has relatively few cases, so if the virus does not spread in the country, they will wait for their own, called Soberana.\n\nBrazil, is an important and particular case for the Gamaleya’s vaccine. The country was mentioned on multiple occasions as one of the future producers of the vaccine, but the initiative has been boycotted at the highest level, personally by President Bolsonaro. The Brazilian president has always been a great critic of vaccines and the measures taken against the pandemic; he has especially rejected the Chinese ones, but also does not care about those from Russian, betting on the vaccine of Astrazeneca. As the latter has suffered delays, serious setbacks and doubts about its effectiveness, the Brazilian states have negotiated on their own with other companies, both from China and Russia. Specifically, the states of Parana and Bahia have reached deals to buy and produce Sputnik V, but on condition that the final deal depends on the approval and permission by federal government agencies, controlled by Bolsonaro. As the approval does not come out, the entire vaccination process in Brazil is delayed. Although it is expected that the issues will be settled by early February; but in such a case, Sputnik V vaccine will enter into direct competition, with those preferred by other states, such as Sao Paulo, which is trying to do the same deal with Coronavac, a Chinese vaccine, and with the federal government itself, which prefers Western options.\n\nThe Sputnik V vaccine has reached Latin America on a good basis. Now, its use and final market share will depend more than anything on whether Pfizer, on which most of the regional governments, that are politically allied with Washington, bet, can or cannot quickly and constantly meet the local demand. And it will not be easy for them to do so, as they must satisfy the US and European markets with hundreds of millions of doses, so in the short term, they will leave Latin America as before: they will lower their quotas, to keep the deal open. By April, when the Covax plan goes live, bottlenecks will be removed and the list of vaccines will have more titles .\n\nMORE ON THE TOPIC:\n• One Police Officer, Two Attackers Killed In Knife Attack In Chechnya’s Grozny", "opengraph": {"locale": "en_GB", "type": "article", "title": "Russian Soft Power In Action: Sputnik V Spread In Latin America", "description": "DEAR FRIENDS. IF YOU LIKE THIS TYPE OF CONTENT, SUPPORT SOUTHFRONT WORK: PayPal: southfront@internet.ru Donation alerts: https://donationalerts.com/r/southfront Gumroad: https://gumroad.com/southfront Or via: http://southfront.org/donate/ or via: https://www.patreon.com/southfront, BTC: 3Gbs4rjcVUtQd8p3CiFUCxPLZwRqurezRZ,...", "url": "https://southfront.org/russian-soft-power-in-action-sputnik-v-spread-in-latin-america/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2020-12-29T21:16:27+00:00", "article:modified_time": "2021-03-05T19:00:34+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2020/12/s-adb4addf4251314daea016bbb979e1d1f3b87378-1.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2020/12/s-adb4addf4251314daea016bbb979e1d1f3b87378.jpg", "https://donationalerts.com/r/southfront", "https://gumroad.com/southfront", "http://southfront.org/donate/", "https://www.patreon.com/southfront", "https://jhrcronos.weebly.com/", "https://www.marca.com/tiramillas/actualidad/2020/08/27/5f480238e2704e05698b4616.html", "https://www.ntn24.com/america-latina/venezuela/hijo-de-nicolas-maduro-recibe-primera-dosis-de-vacuna-rusa-128842", "https://es-us.finanzas.yahoo.com/noticias/seis-personas-murieron-pruebas-vacuna-221300914.html", "https://s4.cdnstatic.space/wp-content/uploads/2020/12/EYWADp6UYAA-5N_-1.jpg", "https://www.youtube.com/watch?v=BvP8S2AUS9U", "https://www.lanacion.com.ar/politica/gines-gonzales-garcia-pfizer-nos-pidieron-condiciones-nid2541111", "https://s4.cdnstatic.space/wp-content/uploads/2020/12/5feadf3b85f540246a43585b-1.jpg", "https://canaln.pe/actualidad/rusia-le-responde-al-elmer-caceres-pedido-vacunas-contra-coronavirus-n423761", "https://mundo.sputniknews.com/radio_big_bang/202008181092462375-instituto-mechnikov-el-centro-de-vanguardia-que-fabricara-la-vacuna-rusa-en-nicaragua/", "https://www.efe.com/efe/america/sociedad/nicaragua-cuenta-con-107-millones-de-dolares-para-vacuna-contra-la-covid-19/20000013-4409628", "https://sputnikvaccine.com/esp/about-vaccine/", "https://southfront.org/is-the-covid-19-vaccine-trade-war-2020s-final-farewell/", "https://southfront.org/one-police-officer-two-attackers-killed-in-knife-attack-in-chechnyas-grozny/", "https://southfront.org/donate/"], "authors": [], "publish_date": "2020-12-29T21:16:27+00:00"}