{"result_id": "275010", "URL": "https://southfront.org/covid-19-the-fight-for-a-cure-one-gigantic-western-pharma-rip-off/", "timestamp": "2023-04-25 17:10:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://s4.cdnstatic.space/wp-content/uploads/2020/11/SF16.png", "canonical": "https://southfront.org/covid-19-the-fight-for-a-cure-one-gigantic-western-pharma-rip-off/", "encoding": "utf-8"}, "image": null, "domain": "southfront.org", "title": "COVID-19 – The Fight for a Cure: One Gigantic Western Pharma Rip-Off", "cleaned_text": "A few days ago, Dr. Tedros, the Director General of the World Health Organization (WHO) repeated what he said already a few weeks ago, that there are about 20 pharmaceutical laboratories throughout the world that are developing a vaccine for the novel coronavirus, named COVID-19, also called 2019-nCOV, or SARS-CoV-2. For the layman, it is just a stronger mutation of the Severe Acute Respiratory Syndrome (SARS) virus, that broke out in 2002 / 2003, also in China. To be sure, a mutation made in a laboratory. In a US high-security biological warfare laboratory. In other words, both SARS and COVID-19 – among many other bio-war agents – were made in the US.\n\nAnd now, the chaotic western-style race of private corporations for a vaccine wanting to outdo one another, has begun.\n\nWho is first to develop a vaccine? – It’s a fierce competition to establish a patent, a monopoly – for a possibly multi trillion-dollar business. Its western neoliberal capitalism at its very worst – or best, depending on the angle from where one looks.\n\nThere are no words to describe this chaotic fever for profit over human wellbeing. It has nothing to do with health, with healing sick and suffering, possibly dying people. It’s all about money. Hundreds of billions, if not trillion of profit for the pharmaceutical oligarch and their associated research laboratories and enterprises. And even more so, if the WHO-declared “pandemic” (sic) will prompt a forced vaccination campaign, enhanced by military and police surveillance.\n\nLet’s put COVID-19 in context. As of 23 March 2020 (18:33 GMT), and according to WHO statistics, reported worldwide cases are 372,572; deaths 16,313; recovered 101,373 – a death rate of 4.37%. However, these figures must be considered with caution. In many countries, especially developing economies, accurate testing may be a problem. Test kits are often not available, or not reliable. So, may people who go to the doctor with some flu symptoms are possibly falsely diagnosed as COVID-19 victims, as it serves the publicity hype.\n\nMiscalculations and false reporting may even occur in the United States. Mr. Robert Redfield, CEO of the US Center for Disease Control (CDC), testified before Congress that CDC does no longer carry out regular tests, that these were carried out at State-level and only in extreme cases. See also this reference form the LA Times of California measures and directives.\n\nBy comparison, the US CDC estimates that in the 2019 / 2020 flu season in the US alone, some 38 to 54 million people may catch the common flu, and 23,000 to 59,000 may die from it. The vast majority of these deaths will be elderly people above 70-years of age and many of them with pre-health conditions and /or pre-existing respiratory problems. This is pretty much the same disease and death pattern as with COVID-19. Expanding these common flu figures linearly on a worldwide scale would result in hundreds of thousands of flu deaths. In the particularly strong 2017-2018 US flu season, an estimated 60,000 people died from the flu in the US alone. The reader may himself judge whether WHO was justified declaring COVID-19 a “pandemic” — or whether there may have been – just perhaps – another agenda behind it?\n\nThe vaccine that might eventually be applied to COVID-19, may most likely no longer be valid for the next coronavirus outbreak – which, also according to Mr. Redfield, CDC, will most probably occur. A later virus may most certainly have mutated. It’s quite similar to the common flu virus. In fact, the annually reoccurring common flu virus contains a proportion of 10% to 15% (some times more) of coronaviruses.\n\nThe effectiveness of the annual flu vaccines is on average less than 50%, not to mention all the potential harmful side effects, they carry along. COVID-19 is very similar to influenza. Will a corona virus vaccine be equally weak in protecting a potential patient from a future infection?\n\nCooperation instead of competition, doesn’t occur in the west. It’s all profit-driven. With a number of different vaccines from different pharma giants coming on the market, who will tell the patient which one is the best, most suitable for the patient’s condition? It smells like an utter chaotic scam.\n\nThe real question is – are vaccines – or a vaccine – even necessary? Maybe – maybe not. The production of vaccines is pushed for profit motives and for an important political agenda for a New World Order – that has been planned to change human life as we know it, or thought we knew it. See further explanations below.\n\nVaccines don’t heal, they may prevent the virus from hitting as hard as it might otherwise do, or not at all, depending on the age, physical and health condition of a person. Worldwide statistics show that usually a person up to the age of 40 or 50, who is infected by the COVID-19, has none or only slight symptoms, nothing to worry about.\n\nShould symptoms show up, staying home, resting and using traditional, age-old medicine, the same that might be used for the common flu, might be enough to get rid of the virus. This might resolve the disease within one or two weeks. Then, the person will be naturally “vaccinated” against this strand of coronavirus. Elderly people above 65 or 70 may be more at risk and special attention may be in order – separated from crowds, isolation during a two-week quarantine (the incubation period), while the rest of society goes on with life as normal as possible, thereby reducing the huge cost to society.\n\nChina has brought the COVID-19 pandemic under control without a vaccine, but using common sense and traditional, rather inexpensive medication. What are these regular medicines that are effective and have helped to bring COVID-19 under control in China, without a vaccine?\n\nThe “Children’s Health Defense” (the Children’s Defense Fund – CDF), an American NGO, founded 1973 by Robert F. Kennedy, Jr., depicts the current power struggle in France between health official and the country’s leading experts in virology, as representative for the worldwide fight between corporate pharma supported by (bought) governments and international organizations, such as WHO – and renowned scientists. If laid open, it is an eye-opener. See full CDF study.\n\nFrench Professor Didier Raoult, who is one of the world’s top 5 scientists on communicable diseases, argued that the approach of mass quarantine is both inefficient and outdated and that large-scale testing and treatment of suspected cases achieves far better results.\n\nEarly on, Dr. Raoult suggested the use of hydroxychloroquine (Chloroquine or Plaquenil), a well-known, simple, and inexpensive drug, also used to fight Malaria, and that has shown efficacy with previous coronaviruses such as SARS. By mid-February 2020, clinical trials at his institute and in China already confirmed that the drug could reduce the viral load and bring spectacular improvement. The Chinese scientists published their first trials on more than 100 patients and announced that the Chinese National Health Commission would recommend Chloroquine in their new guidelines to treat Covid-19.\n\nIn addition, China and Cuba are working together with the use of Interferon Alpha 2B, a highly efficient anti-viral drug developed in Cuba some 39 years, but little known to the world, because of the US imposed embargo on anything from Cuba. Interferon has also proven to be very effective in fighting COVID-19 and is now produced in a joint-venture in China.\n\nChinese researchers in cooperation with Cuban scientists are also developing a vaccine which may soon be ready for testing. In contrast to the west, working exclusively on profit-motives, the Chinese-Cuban vaccine would be made available at low cost to the entire world.\n\nOther simple, but effective remedies include the use of heavy doses of Vitamin C, as well as Vitamin D3, or more generally the use of Micronutrients essential to infections, include A, B, C, , and E.\n\nAnother remedy that has been used for thousands of years by ancient Chinese, Romans and Egyptians, are Colloidal silver products. They come in forms to be administered as a liquid by mouth, or injected, or applied to the skin. Colloidal silver products are boosting the immune system, fighting bacteria and viruses, and have been used for treating cancer, HIV/AIDS, shingles, herpes, eye ailments, prostatitis – and COVID-19.\n\nYet another simple and inexpensive remedy, to be used in combination with others, is menthol-based “Mentholatum”. It’s used for common flu and cold symptoms. Rubbed on and around the nose, it acts as a disinfectant and prevents germs to enter the respiratory track.\n\nNorthern Italy and New Orleans report that an unusual number of patients had to be hospitalized in Intensive Care Units (ICU) and be put 24×7 on a 90% strength respirator, with some of them remaining unresponsive, going into respiratory failure. The reported death rate is about 40%. The condition is called acute respiratory distress syndrome, ARDS. That means the lungs are filled with fluid. When this description of ARDS episodes applies, Dr. Raoult and other medical colleagues recommend COVID-19 patients to “sleep sitting up” until they are cured. This helps drain the liquid out of the lungs. The method has been known to work successfully since it was first documented during the 1918 Spanish Flu epidemic.\n\nAs you may expect, if you look up any of these alternative cures on internet – internet controlled by Google and the Big Corporatocracy, including the pharmaceuticals, will logically advise you against using them. At best they will tell you that these products or methods have not proven effective, and at worst, that they may be harmful. Don’t believe it. None of these products or methods are harmful. Remember, some of them have been used as natural remedies for thousands of years. And remember, China has successfully come to grips with COVID-19, using some of these relatively simple and inexpensive medications.\n\nUnfortunately, few doctors are aware of these practical, simple and inexpensive remedies. They are safe and more often than not successful. The media, under pressure from the pharma giants and the compliant government agencies, have been requested to censoring such valuable information. The negligence or failure, to make such easily accessible remedies public knowledge is killing people.\n\nNow, let’s cut to the chase, to what’s behind it all – behind the extraordinary monstrous media propaganda hype that is bringing down the entire (western) world’s socioeconomic system, creating untold misery, famine, and death. A misery with suffering potentially by orders of magnitude worse than the Big Depression of 1928 / 1929 and the subsequent years.\n\nIf anybody had any doubts up to now, where the virus originated, the truth was dropped surreptitiously, a slip of the tongue or on purpose, by Secretary of State, Mike Pompeo, when he addressed the Nation on 21 March on COVID-19, he said, “This is not about retribution, we are in a live exercise here…”, meaning military exercise, or a war game.\n\nPresident Trump by Pompeo’s side was whispering, “you should have let us know”. Whatever that means. It’s hard to believe that Mr. Trump didn’t know. But these are the vagaries of American politics, even on a death-serious subject like the new coronavirus breakout. See here with a brief video. See this also.\n\nThis live (military) exercise has unimaginable worldwide implications which may completely transform our lives. It’s economic warfare. Almost every country on this planet is on some kind of a lock-down, a quarantine of sorts for an as of yet undetermined period, with businesses closed, shops and restaurants shot, construction sites halted, people working from home if they can, being in the streets is forbidden, in many countries under police and military surveillance, with cases of people being beaten up and hand-cuffed, if they have no good explanation.\n\nThe President Macron-inspired French police is especially known for its uncontrolled brutality fighting the Yellow Vests. They have already demonstrated their same despise for their fellow citizens, when they are in the streets, even food shopping, without a special permit.\n\nBorders are shot, airlines are grounded, tourism comes to a screeching halt, basically from one day to the other, stranded throughout the world. With a few exceptions, Germany and France are rare ones, they organize return flights for their citizens abroad. Otherwise, with uncertain flight departures, over-booked and over-crowded flights, the stranded tourists have hardly a chance to return home soon.\n\nThe socioeconomic cost is astronomical. In the multi-quadrillion, or quintillion; numbers with so many zeros they make you dizzy. This calamity can only partly be valued with numbers, and not now, as the world’s lock-down continues – with a social cost that cannot be valued. The dive of the stock market by about 30% – a typical bonanza for forward speculators and Big Finance, Big Banking, with multi-trillion-dollar losses for the small investors.\n\nMillions, if not hundreds of millions of small and medium size businesses going broke, unemployment going rampant, in the hundreds of millions, throughout the world, and the poorest of the poor, especially in developing countries, who are either unemployed or survive on small hourly or day-to-day jobs – they have no income, cannot buy the basics for survival – some of them may die from famine, others may commit suicide, others convert to crime. This is Greece by a factor of thousand, or worse.\n\nThen, there is a moral and societal breakdown from a forced quarantine, for which there is no clear end in sight. This creates fear and anxieties, frustration and anger. For many it’s like solitary confinement – all of which is bad for health, and lowers the immune defense system. Just what those who pull the strings want.\n\nSo, whom does this live (military) exercise serve? – First one would assume its destined to break China’s back, as China is the up-and-coming economic power. It is true, China’s economy has suffered enormously, with about 60% to 70% of all production stopped for the first two months this year, the time of the COVID-19 outbreak and peak, meaning a significant plunge of China’s GDP, maybe as much as 40% for January and February 2020.\n\nHowever, China has the corona virus now firmly under control. And China being China, her economy is recovering fast and may soon be back to what it was in December 2019. In fact, despite the significant impact of COVID-19, China’s economy may soon overtake that of the self-styled empire, the United States of America. China’s currency the yuan, is solidly backed by a strong economy and by gold, and is slated to become the world’s chief reserve currency, replacing the US-dollar, which had that role for the last 100 years. When that happens, the US hegemony is doomed.\n\nIt’s more. This attack on China is actually backfiring big time. China is the supply chain for almost everything for the west. To increase corporate profits, the US and other western countries have outsourced almost everything to low-cost labor China. This concerns not only high technology electronics, but also medication and medical equipment. About 80% and ingredients to produce medication come from China. For antibiotics the proportion is about 90%.\n\n With much of Chinese production halted for almost 2 months, the delivery lag is enormous.\n\nA plan has been on the drawing board for the last few years, dictated by the obscure clan, or “Deep Dark State”, and designed by its minions, who expect to be generously rewarded in one way or another. Or, you may put it this way, the absence of punishment and torture is also a form of reward.\n\nFirst, there is an enormous drive towards universal vaccination, because vaccination will be the cornerstone of all that follows, namely a universally imposed electronic identification of every person on the planet. And what is best suited to force down a vaccination program? – A pandemic, of course, with people being made more scared every day. The fear factor is key. It is being increased by a time-undetermined quarantine and by a constant drip-by-drip indoctrination of bad news on the COVID-19 front. Every day the pace of increasing numbers of infected people and those who died, accelerates, increasing fear and anxiety.\n\nThe time will come, when people will literally scream for help. They want a police and military state to protect them – from the virus, I guess – and they want to be vaccinated. They don’t care nor ask what is the cocktail that is being injected in their body and what its long-term implications may be. For example, the vaccination cocktail could serve to reduce women and men’s fertility, or cause long-term neurological defects that can even be passed on to next generations. People with fear just want to sleep at ease, being vaccinated. They don’t care – nor do they want to know – that along with the vaccine could be a nano-chip injected that will contain all their personal data, from health records to bank accounts – and can be electronically remote-controlled.\n\nIt goes without saying, our monetary system is planned to be fully electronic, no more cash – cash is poison – or as WHO’s Director General recently warned, not verbatim, but with that meaning, cash is dangerous for infections, paper money and coins may carry deadly viruses – thereby paving the way for full digitization of our monetary system. This has, indeed, already been tested over the past few years, mainly in Scandinavian countries, where entire department stores refuse to accept cash. In response to the WHO DG’s recommendation, some shops and restaurants in Germany refuse to accept cash.\n\nThe universal vaccination and electronic ID go together and will first be tested in a few developing countries. Bangladesh is one of them. The vaccination program is the platform for the mega-changes the New World Order (NOW), or the One World Order (OWO) wants to bring about. This, in addition to the enormous money-making bonanza.\n\nAn almost unknown agency called Agenda ID2020 is behind all this, monitoring, directing and adjusting the implementation of the various programs – that are supposed to eventually lead to Full Spectrum Dominance. For more details, see also the recent article on the dangers of Agenda ID2020.\n\nBehind this elaborate and complex network of things, appears time and again, one prominent name: Bill Gates, the Bill and Melinda Gate’s Foundation. Bill Gates has been funding vaccination programs in Africa for decades. And Bill Gates and the Rockefellers make no secret that one of their ultimate goal for planet earth is a drastic population reduction.\n\nHow the Vaccination Research and Production is supposed to work.\n\nHow will this elaborate and complex business of creating vaccines and implementing vaccine campaign work? As most official activities that basically are government responsibilities are privatized and outsourced, they become complex, chaotic at times and inefficient. In the case of the west, the US pretends to take the lead, but will also assign responsibilities to European pharma-labs.\n\nThe National Institute of Health (NIH) has overall responsibility for national health research and program implementation. NIH’s Director is Anthony Fauci. The Institute was created in 1955. Under NIH, the National Institute of Allergy and Infectious Diseases (NIAID), one of 27 institutes, reporting to NIH, is responsible for vaccination programs. NIAD’s mission is to conduct basic and applied research to better understand, treat and prevent infectious, immunologic and allergic diseases. NIAD has outsourced the vaccination program to the Coalition for Epidemic Preparedness Innovations (CEPI).\n\nCEPI was formed by the WEF (World Economic Forum) in Davos in January 2017. It was founded by the Bill and Melinda Gates Foundation (BMGF) and the London-based Welcome Trust, created in 1936, but including now as members several European countries and the European Union (EU). The BMGF made a first infusion to CEPI of US$ 460 million. CEPI also receives funding from Norway and India and is also heavily supported by the pharma-industry.\n\nAccording to CEPI’s website, CEPI has appealed for US$ 2 billion to support the development of a vaccine for COVID-19 and to expand the number of vaccine candidates to increase the chances of success and to fund the clinical trials for these candidate vaccines. CEPI’s ambition is to have at least three vaccine candidates, which could be submitted to regulatory authorities for licensing for general use/use in outbreaks.\n\n“Governments around the world will need to invest billions of euros more in coronavirus vaccine development, to take forward some promising candidates that are emerging. – It’s a very risky business – everything is being done in parallel, you’re not building on the expertise of others – but good progress is being made,” said Melanie Saville, director of vaccine research and development at CEPI.\n\nCEPI has already some preselected international pharma corporations to research and work on a COVID-19 vaccine. They include the biotech “Moderna” in Seattle, not far from the Microsoft Headquarters – also a Bill Gates creation; the biotech lab Inovio, the University of Queensland, Australia, and the Germans, BioNTech and CureVac.\n\nFrom the outset it looks that Moderna, CureVac and BioNTech are best suited to produce fast a vaccine, because according to a Health and Science report, published on March 17, 2020, “all three of these firms specialize in messenger RNA (mRNA) therapeutics. These mRNA molecules are used to instruct the body to produce its own immune response to fight a range of different diseases. This type of vaccine can potentially be developed and produced more quickly than traditional vaccines.”\n\nEnters GAVI – the Global Alliance for Vaccines and Immunization has also been created by the Bill and Melinda Gates Foundation. It is a global health partnership of public and private sector organizations, dedicated to “immunization for all”. GAVI is supported by WHO, and needless to say, its main partners and sponsors are the pharma-industry. GAVI has already announced it needs billions of dollars to support its COVID-19 vaccination program. In June 2020, the UK Government will sponsor a donor conference in support of GAVI’s COVID-19 vaccination program, expecting to raise US$ 7.3 billion.\n\nFrom this maze of overlapping organizations, activities and unclear responsibilities, the money-flow is likely going to be a crisscross that nobody can follow. Accountability on a large scale will be lost.\n\nAs to the output – hopefully a vaccine – or several vaccines. For the layman and potential patient, it will be a matter of luck (or bad luck) what cocktail of biological substances will be injected into his or her body. In any case, the long-term outcome, is unpredictable. Remember, Bill Gates has been pursuing during the last fifteen or twenty years his own very special agenda. It is unlikely he will abandon it now. Rather COVID-19 and the ensuing vaccination program will allow him to enhance it.\n\nConcluding – it is amply clear that this is a huge money-making and public-rip-off proposition by the pharma industry. What makes this multi-billion-dollar scam even worse, is that it has an official rubber-stamp, by being supported by western governments and international organizations, foremost WHO, UNICEF and the World Bank.\n\nThis may be the last opportunity for the elite, the 0.1%, to shuffle social capital and worker funded assets from the bottom to the top, before we enter an era of total control through electromagnetic fields (EMF), managed by the minions of the 0.1% and with 5G / 6G technology, where we, the remaining humans may have become mere tele-guided robots.\n\nIt is by now a pipe dream to believe that the world may continue as it did until the end of the last decade. It would be too much of a coincidence that Agenda ID2020 started activating its evil programs exactly at the beginning of the decade 2020. Unfortunately, it is also a far-away dream that China and Cuba could lead the way for finding a cure for the most likely recurring coronavirus in one mutation or another – including but not exclusively, using traditional methods and remedies that have proven successful in the current battle to control COVID-19.\n\nThere are draconian measures on the way, and we may just pray that they fail, or that we, the people, awake in time and in sufficient numbers – a critical mass – and find back to our innermost voice and soul – solidarity for each other that gives us strength to fight this Luciferian monster.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nPeter Koenig is an economist and geopolitical analyst. He is also a water resources and environmental specialist. He worked for over 30 years with the World Bank and the World Health Organization around the world, including in Palestine, in the fields of environment and water. He lectures at universities in the US, Europe and South America. He writes regularly for Global Research; ICH; RT; Sputnik; PressTV; The 21st Century; Greanville Post; Defend Democracy Press, TeleSUR; The Saker Blog, the New Eastern Outlook (NEO); and other internet sites. He is the author of Implosion – An Economic Thriller about War, Environmental Destruction and Corporate Greed – fiction based on facts and on 30 years of World Bank experience around the globe. He is also a co-author of The World Order and Revolution! – Essays from the Resistance. He is a Research Associate of the Centre for Research on Globalization.", "opengraph": {"locale": "en_GB", "type": "article", "title": "COVID-19 – The Fight for a Cure: One Gigantic Western Pharma Rip-Off", "description": "Written by Peter Koenig; Originally appeared at Global Research A few days ago, Dr. Tedros, the Director General of the World Health...", "url": "https://southfront.org/covid-19-the-fight-for-a-cure-one-gigantic-western-pharma-rip-off/", "site_name": "South Front", "article:publisher": "https://www.facebook.com/SouthFrontEnTwo", "article:published_time": "2020-03-25T08:25:51+00:00", "article:modified_time": "2020-03-25T10:55:13+00:00", "image": "https://s2.cdnstatic.space/wp-content/uploads/2020/03/1-100.jpg", "image:width": "1024", "image:height": "675", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Mike Pompeo calls Coronavirus pandemic a Exercise live on CNN\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/3Qscuw_3aUk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/3Qscuw_3aUk?feature=oembed"}], "links": ["https://southfront.org/donate/", "https://s4.cdnstatic.space/wp-content/uploads/2020/03/1-100.jpg", "https://www.globalresearch.ca/covid-19-fight-cure-western-pharma-rip-off/5707360", "https://www.latimes.com/california/story/2020-03-20/coronavirus-county-doctors-containment-testing", "https://childrenshealthdefense.org/news/does-the-coronavirus-pandemic-serve-a-global-agenda/", "https://ussanews.com/News1/2020/03/21/secretary-of-state-mike-pompeo-admits-covid-19-is-a-live-exercise-president-trump-comments-i-wish-you-would-have-told-us/", "https://ednews.net/en/news/politics/421822-coronavirus-prepared-at-the-bio-weapons-laboratory-in-the-us.", "https://www.globalresearch.ca/coronavirus-causes-effects-real-danger-agenda-id2020/5706153", "http://www.amazon.com/Implosion-Economic-Environmental-Destruction-Corporate/dp/059545349X", "http://www.amazon.com/World-Order-Revolution-Essays-Resistance/dp/6027005874", "https://southfront.org/donate/"], "authors": [], "publish_date": "2020-03-25T08:25:51+00:00"}