{"result_id": "277044", "URL": "https://stillnessinthestorm.com/2021/04/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "timestamp": "2023-04-25 17:11:37 CEST+0200", "meta": {"description": "(JD Rucker) We’re being lied to regarding the three “FDA-approved” Covid vaccines. Those who are aware of the situation realize one of the biggest lies being told about them was already highlighted in that first sentence; none of the vaccines have been FDA-approved. But that’s not the only lie. It’s not the biggest lie. It’s not even the most troubling lie.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2021/04/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "Dr. Karladine Graves Delivers a Detailed Explanation about What Makes Covid Vaccines so Dangerous", "cleaned_text": "(JD Rucker) We’re being lied to regarding the three “FDA-approved” Covid vaccines. Those who are aware of the situation realize one of the biggest lies being told about them was already highlighted in that first sentence; none of the vaccines have been FDA-approved. But that’s not the only lie. It’s not the biggest lie. It’s not even the most troubling lie.\n\nRelated Pentagon To Release UFO Evidence: “There Are a Lot More Sightings Than Have Been Made Public”\n\nTo learn more about these vaccines, I had an excellent conversation with Dr. Karladine Graves. She has treated Covid patients since last year, offering proper treatments that focus on the real science behind CoV-SARS-2. She gave us a detailed explanation of the risks associated with all three vaccines and why Americans should avoid them as much as we’re trying to avoid the disease itself.\n\nFirst and foremost, she noted that these “vaccines” are not really vaccines. “Why is the [Covid] vaccine so different from what we used to have to what this new experimental injection is? Because it’s not really a vaccine.”\n\nWhat we’ve used in the past for actual vaccines is to take a “natural virus,” as Dr. Graves put it, and injected it in some safer form into our bodies. This prompted the immune system to launch its defenses so when the full-blown disease entered a body, the mechanisms to fight it would already be in place.\n\n“It’s something that is in nature, that we know that is there, and our body expects it every single day,” she said. “We are bombarded with bacteria and viruses. And our body, our immune system is used to meeting those head-on. And most of the time when we are overwhelmed with something, our bodies take care of it and we don’t even know it.”\n\nThere have been debates about the safety of previous vaccines in the past, so much so that there’s a large movement of “anti-vaxxers” who oppose most if not all forms of vaccinations. There opposition to antibodies is generally based on risks of side-effects with only a small percentage claiming the vaccines do not work at all. The Covid vaccines are different, which is why many people who do not identify as “anti-vaxxers” are concerned about them. Not only are there legitimate safety concerns with the Covid vaccines, but there are also reasons to believe they are being billed as more effective than they truly are.\n\nThe reason for both the dangers and inefficacy of these vaccines comes down to the science behind them, as Dr. Graves explained.\n\n“We have a completely different way now of these injections that have been created by mankind, not nature,” she said. “It seems like when man gets into it, it always gets screwed up.”\n\nShe detailed the three vaccines that are available to most Americans right now and dove into the science behind their creation and implementation. She started with the Pfizer and Moderna vaccines.\n\n“What they have done is, they have taken a piece of genetic material—it’s RNA—and they basically, they have made it so that it is a synthetic. Now, a synthetic to our bodies is not natural. It’s foreign.”\n\nDr. Graves explained it in layman’s terms by comparing the injected materials in the so-called vaccines to eggs.\n\n“The ‘yolk’ part is like the mRNA, messenger. The messenger RNA has a ‘recipe,’ as Dr [Sherri] Tenpenny calls it. I call it like a code. And it is carried with a lipid, and that’s the white part of the egg.\n\n“You have that outer white part and that’s the lipids that’s holding that mRNA in,” she continued. “So, in order to get it transported you have to have the lipids, or the shell, okay. So, you put the shell around it and then you have it encapsulated so to speak.”\n\nWhat Dr. Graves revealed next was shocking. She explained the “shell” if the “egg” is Polyethylene Glycol.\n\n“Now, what amazes me is that these pharmaceuticals know and understand that approximately 70% of the American people have some type of adversity to polyethylene glycol,” she said. “They are allergic to it. And that can of course cause anaphylaxis or a reaction.”\n\nIn the latest episode of NOQ Report, Dr. Graves explains the other aspects of the vaccines that can cause major problems now and in the future. What’s most troubling is that concerted effort by a cabal of forces that include mainstream media, Big Tech, and most in government who are pushing hard on behalf of the pharmaceutical companies to get as many people vaccinated as possible. Any mention of the risks and side-effects associated with them, risks that include death, are not only ignored but suppressed by those trying to vaccinate the whole nation.\n\n“To me these injections are kind of like playing Russian Roulette,” Dr. Graves said. “You never know what’s going to come up; you might get by, you might not. But, there’s no promises.”\n\nWhat the pharmaceutical companies are saying and the arbiters of knowledge are echoing are not completely true. Dr. Graves is not the only doctor calling them out, though you’d be hard pressed to find other doctors who are able to get the truth out because of information suppression.\n\n“Let’s kind of go back and say what the pharmaceuticals are saying is going to happen is that the cells will take up this product,” she said. “This synthetic product that they have placed in the body, and the body is going to make an antibody, and then that antibody is going to trigger the cell to make a protein – it’s going to make a spike protein – but, remember this is not a natural spike protein,” she said.\n\nThe CDC explains it in very safe-sounding terms:\n\nmRNA vaccines are a new type of vaccine to protect against infectious diseases. To trigger an immune response, many vaccines put a weakened or inactivated germ into our bodies. Not mRNA vaccines. Instead, they teach our cells how to make a protein—or even just a piece of a protein—that triggers an immune response inside our bodies. That immune response, which produces antibodies, is what protects us from getting infected if the real virus enters our bodies.\n\nThe problem that they don’t discuss is what concerns many doctors around the world today. The “piece of a protein” referenced in the CDC’s explanation is the very thing that has raised alarm bells in people like Dr. Graves.\n\n“It is a synthetic and the body realizes that this is something that is foreign,” she said. “It’s not of nature and so it’s never been seen before. And so, we are an experiment to see what the body is going to do. Now, the theory is that it will make an antigen, and then it will make this protein, and then this protein is going to make this spike protein.”\n\nIn theory, it could all work. The problem is we have no idea at this point if it will. There’s a reason we went from zero to “vaccines” in such a short period of time. They’ve been working on this for nearly two decades with previous coronavirus strands. What they won’t tell us is that they have never been able to demonstrate through clinical trials that it actually works.\n\nAs Lt. Gen. Tom McInerney has said, doctors who he has talked to, including Dr. Graves, have warned him that there is a danger of how vaccinated people will react to future mutations of the disease. The many concerning reactions we’re seeing with the “vaccines” and Covid-19 may be minimal compared to how vaccinated people will react to future strains. As concerning as the “vaccines” are now, we may just be seeing the tip of the iceberg.\n\nThere are doctors promoting and opposing the vaccines, but today the vast majority of Americans have only heard one side. Why is discourse being suppressed? Isn’t science about challenging premises and testing them?\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Karladine Graves Delivers a Detailed Explanation about What Makes Covid Vaccines so Dangerous", "description": "(JD Rucker) We’re being lied to regarding the three “FDA-approved” Covid vaccines. Those who are aware of the situation realize one of the biggest lies being told about them was already highlighted in that first sentence; none of the vaccines have been FDA-approved. But that’s not the only lie. It’s not the biggest lie. It’s not even the most troubling lie.", "url": "https://stillnessinthestorm.com/2021/04/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2021-04-18T13:01:07+00:00", "article:modified_time": "2021-04-15T13:44:42+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2021/04/Dr.-Karladine-Graves-delivers-a-detailed-explanation-about-what-makes-Covid-vaccines-so-dangerous-1.jpg", "image:width": "800", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["NOQ Report", "Dr. Karladine Graves", "news", "Health", "COVID Vaccines"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F04%2Fdr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous%2F&title=Dr.%20Karladine%20Graves%20Delivers%20a%20Detailed%20Explanation%20about%20What%20Makes%20Covid%20Vaccines%20so%20Dangerous", "https://stillnessinthestorm.com/2021/04/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "https://api.whatsapp.com/send?text=Dr.%20Karladine%20Graves%20Delivers%20a%20Detailed%20Explanation%20about%20What%20Makes%20Covid%20Vaccines%20so%20Dangerous https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F04%2Fdr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F04%2Fdr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous%2F&text=Dr.%20Karladine%20Graves%20Delivers%20a%20Detailed%20Explanation%20about%20What%20Makes%20Covid%20Vaccines%20so%20Dangerous", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F04%2Fdr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous%2F&text=Dr.%20Karladine%20Graves%20Delivers%20a%20Detailed%20Explanation%20about%20What%20Makes%20Covid%20Vaccines%20so%20Dangerous", "https://stillnessinthestorm.com/2021/04/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "https://noqreport.com/author/ijp9mablcm/", "https://stillnessinthestorm.com/2021/04/pentagon-to-release-ufo-evidence-there-are-a-lot-more-sightings-than-have-been-made-public/", "https://noqreport.com/2021/04/07/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "https://noqreport.com/2021/04/07/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/", "https://noqreport.com/author/ijp9mablcm/", "https://personalhealthcarenetwork.us/", "https://podcasts.apple.com/us/podcast/dr-karladine-graves-delivers-detailed-explanation-about/id1509059063?i=1000516123294", "https://noqreport.com/2021/03/30/lt-gen-tom-mcinerney-the-covid-vaccines-are-a-national-security-threat/", "https://goascentnutrition.com/product/d3-k2/?rfsn=6707762.c0318b", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://noqreport.com/2021/04/07/dr-karladine-graves-delivers-a-detailed-explanation-about-what-makes-covid-vaccines-so-dangerous/"], "authors": ["Stillness in the Storm"], "publish_date": "2021-04-18T13:01:07+00:00"}