{"result_id": "277023", "URL": "https://stillnessinthestorm.com/2022/01/vaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated/", "timestamp": "2023-04-25 17:11:11 CEST+0200", "meta": {"description": "(Lance D Johnson) Mandatory masks, quarantines and covid-19 vaccines are becoming a pariah in Denmark, as the “fully vaccinated” make up over 90% of the current “omicron” covid-19 caseload.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2022/01/vaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "Vaccine Damage Now Ubiquitous in Denmark As “Omicron” Hospitalizations Occur Primarily in “Fully Vaccinated”", "cleaned_text": "(Lance D Johnson) Mandatory masks, quarantines and covid-19 vaccines are becoming a pariah in Denmark, as the “fully vaccinated” make up over 90% of the current “omicron” covid-19 caseload.\n\nRelated More Than 3,200 Schools Close This Week Due to Omicron Cases\n\nThe “Omicron” hospitalization rate in Denmark is beginning to exceed the “Delta” hospitalization rate, as vaccine damage becomes ubiquitous in the population. As the “fully vaccinated” make up the vast majority of these new “omicron” cases, there is growing concern that the they are experiencing antibody dependent enhancement and immune depletion, as they rapidly spread new variants.\n\nThe “fully vaccinated” and the “boosted” make up the vast majority of covid cases now\n\nThe government of Denmark has become a medical police state, implementing constraints on the “unvaccinated” to coerce as many people as possible to take part in an ongoing medical experiment. Consequentially, almost every citizen over the age of 50 is now marked as “fully vaccinated.” The young have been coerced to give up their body to this genetic experiment as well. Despite being at negligible risk to a potential covid infection, the vaccination rate for 15–60-year olds is approximately 80 percent. This level of vaccine uptake is unprecedented, historic in its proportions. However, the vaccination rate of the population is not synonymous with true immunization. If the experimental vaccine program worked, then herd immunity would be fully realized by now, with the infectious disease rate rapidly plummeting. However, the opposite is happening, as new surges of covid continue to plague the “fully vaccinated.” In fact, over 90 percent of the omicron cases are in the vaccinated cohort!\n\nOut of the entire population in Denmark, only 17 percent remain untouched by this genetic experiment, mainly because the government has not yet forced parents to give up their young children to the vaccine program. Remarkably, the “unvaccinated” make up only 8.5 percent of the new “omicron” covid cases. Even though the fully vaccinated are spreading this variant all over Denmark and the rest of the world, the unvaccinated seem to be the protected class. According to official infection statistics in the State Serum Institute’s “Report on the omikron variant” for December 18th, the vaccines are negatively impacting infection rates, and the unvaccinated are now the more protected class of people. By not vaccinating, people are 50 percent protected from the latest strain of covid. Natural immunity is obviously working, while the vaccines are interfering with immune responses, damaging herd immunity and causing new public health issues.\n\nSeventy-nine percent of these omicron cases (13,946) are occurring in the “fully vaccinated.” Even those who took a booster shot are succumbing in greater numbers than the “unvaccinated.” The patients who took a booster shot make up 10.8 percent (1,851) of the new cases, while the singly vaccinated group accounts for 1.8 percent (304) of the cases and the “unvaccinated” group make up 8.5 percent (1,454) of the new cases.\n\nDelta and omicron are plaguing Denmark’s “fully vaccinated” as immune depletion from the vaccines becomes obvious\n\n“Omicron” isn’t the only strain that is being sequenced in the fully vaccinated, either. Among Denmark’s heavily vaccinated population, there has been an additional 4,000 cases of delta reported each day since November 22nd. That number has risen to well over 6,000 cases per day in December. During the week of December 10-17, 2021, the Delta hospitalization rate for Denmark was an average of 1.55%, and the Omicron hospitalization rate was an average of 3.71%.\n\nThe covid vaccines are not useful at all, but even worse, they seem to be making covid infections more pervasive in the population, whether it be delta or omicron. If the “fully vaccinated” continue to contract these new strains and spread them among the population, then the vaccine program has proven to weaken the immune system, turning people into covid super spreaders — a reality that everyone feared a year and half ago.\n\nThe vaccine program doesn’t even offer neutral results, like a saline placebo. More people in the “fully vaccinated” cohort are coming down with these new covid infections, proving that the vaccine causes some form of immune depletion or antibody dependent enhancement (ADE). The latest variants have already found a way to evade the innate immune response, an issue that scientists have warned about for over a year. The antibodies generated by the vaccine are non-neutralizing and allow the latest strains to bypass the first lines of defense in the mucous membranes, causing greater viral load and more serious immune challenges over time. This medical malpractice must be stopped\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Damage Now Ubiquitous in Denmark As “Omicron” Hospitalizations Occur Primarily in “Fully Vaccinated”", "description": "(Lance D Johnson) Mandatory masks, quarantines and covid-19 vaccines are becoming a pariah in Denmark, as the “fully vaccinated” make up over 90% of the current “omicron” covid-19 caseload. ", "url": "https://stillnessinthestorm.com/2022/01/vaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2022-01-06T18:05:11+00:00", "article:modified_time": "2022-01-07T17:44:22+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2022/01/Infection-Health-Sick.jpg", "image:width": "1200", "image:height": "676", "image:type": "image/jpeg"}, "tags": ["covid vaccine", "covid-19", "natural news", "news", "Omicron Variant", "vaccine damage"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F01%2Fvaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated%2F&title=Vaccine%20Damage%20Now%20Ubiquitous%20in%20Denmark%20As%20%E2%80%9COmicron%E2%80%9D%20Hospitalizations%20Occur%20Primarily%20in%20%E2%80%9CFully%20Vaccinated%E2%80%9D", "https://stillnessinthestorm.com/2022/01/vaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated/", "https://api.whatsapp.com/send?text=Vaccine%20Damage%20Now%20Ubiquitous%20in%20Denmark%20As%20%E2%80%9COmicron%E2%80%9D%20Hospitalizations%20Occur%20Primarily%20in%20%E2%80%9CFully%20Vaccinated%E2%80%9D https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F01%2Fvaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F01%2Fvaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated%2F&text=Vaccine%20Damage%20Now%20Ubiquitous%20in%20Denmark%20As%20%E2%80%9COmicron%E2%80%9D%20Hospitalizations%20Occur%20Primarily%20in%20%E2%80%9CFully%20Vaccinated%E2%80%9D", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F01%2Fvaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated%2F&text=Vaccine%20Damage%20Now%20Ubiquitous%20in%20Denmark%20As%20%E2%80%9COmicron%E2%80%9D%20Hospitalizations%20Occur%20Primarily%20in%20%E2%80%9CFully%20Vaccinated%E2%80%9D", "https://stillnessinthestorm.com/2022/01/vaccine-damage-now-ubiquitous-in-denmark-as-omicron-hospitalizations-occur-primarily-in-fully-vaccinated/", "https://www.naturalnews.com/author/ljdevon", "https://igorchudov.substack.com/p/denmark-no-vax-is-protective-vax", "https://stillnessinthestorm.com/2022/01/more-than-3200-schools-close-this-week-due-to-omicron-cases/", "https://www.naturalnews.com/2022-01-05-vaccine-damage-ubiquitous-in-denmark-omicron-hospitalizations-fully-vaccinated.html", "https://www.naturalnews.com/2022-01-05-vaccine-damage-ubiquitous-in-denmark-omicron-hospitalizations-fully-vaccinated.html", "https://www.naturalnews.com/author/ljdevon", "https://www.ssi.dk/-/media/cdn/files/covid19/omikron/statusrapport/rapport-omikronvarianten-18122021-wj25.pdf?la=da", "https://www.israelnationalnews.com/news/309762", "https://stillnessinthestorm.com/health/", "https://www.scribd.com/document/519637770/Document", "http://vaccinedamage.news", "https://goascentnutrition.com/product/nootropic-focus-1/?rfsn=6707762.c0318b", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://www.naturalnews.com/2022-01-05-vaccine-damage-ubiquitous-in-denmark-omicron-hospitalizations-fully-vaccinated.html"], "authors": ["Stillness in the Storm"], "publish_date": "2022-01-06T18:05:11+00:00"}