{"result_id": "277009", "URL": "https://stillnessinthestorm.com/2022/01/cdc-study-suggests-unboosted-vaccines-become-worse-than-nothing-against-omicron/", "timestamp": "2023-04-25 17:10:53 CEST+0200", "meta": {"description": "(Greg Piper) Agency confirms \"protection against infection wanes to something undetectable,\" while maintaining that \"we do not see that the risk of infection is increased\" after lapse of protective window.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2022/01/cdc-study-suggests-unboosted-vaccines-become-worse-than-nothing-against-omicron/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "CDC Study Suggests Unboosted Vaccines Become Worse Than Nothing Against Omicron", "cleaned_text": "Two-dose COVID-19 vaccines may after an initial protective window become less effective against symptomatic infection by the Omicron variant than not getting jabbed at all, according to little-noticed findings in a federal study of how well boosters performed against different variants.\n\nThe “adjusted odds ratio” crossed 1 for vaccinated versus unvaccinated individuals 7-10 months after vaccination, according to the “original investigation” by Atlanta-based CDC researchers, published in the Journal of the American Medical Association last week.\n\nThat means the vaccinated were more likely than the unvaccinated to have symptomatic Omicron infections beginning at about the time the former become eligible for boosters. When considering the upper bound of the 95% confidence interval, the disparity emerged two months earlier.\n\nPfizer’s mRNA vaccine performed worse than Moderna’s, the researchers wrote. “The upper bound of the 95% CI was consistently greater than 1 starting at 3 months after second dose” for the former and six months for the latter.\n\nBy contrast, the odds ratios for either vaccine never got close to 1 for the Delta variant, even for the upper bound.\n\nEven as evidence of the short-lived efficacy of the COVID mRNA vaccines continues to mount, federal regulators stepped in Tuesday to block doctors from using monoclonal antibodies to treat COVID patients. The FDA on Monday revoked authorizations for two such treatments against Omicron infections, including the one used by then-President Trump, finding they were “highly unlikely to be active” against the now-dominant variant.\n\nThe little-noticed findings in the JAMA study were highlighted by law professor Todd Zywicki, whose natural immunity lawsuit prompted George Mason University to grant him a medical exemption from its vaccine mandate.\n\n“Still more confirmation that Pfizer and Moderna’s CEOs know what they are talking about when they state that 2 doses of vax provides insignificant (at best) protection against Omicron,” Zywicki tweeted Tuesday.\n\nPfizer CEO Albert Bourla said earlier this month that its vaccine offers “limited if any” protection against Omicron, while Moderna’s preliminary booster data showed “low neutralizing antibody levels” against the variant before boosting.\n\nBoth have promised Omicron-specific vaccines this year. On Tuesday, Pfizer and its German partner BioNTech announced a clinical study of such a vaccine among healthy 18-55 year-olds.\n\nPerhaps the most vaccinated country in the world, Israel, appears poised to double down on boosters after a government advisory committee recommended a fourth dose for all adults, the Associated Press reported Tuesday.\n\nNearly half its population has received at least one booster, and the government started offering a second booster last month to those over 60.\n\nOne Israeli study found increased antibodies but not further protection against Omicron in twice-boosted healthcare workers, while another found such elderly people were “three times more resistant to serious illness” than the single-boosted, the New York Post reported.\n\nOmicron is “not just an incremental shift of a variant, as Delta was from Alpha, but a fundamentally different challenge,” Zywicki wrote in an email. People can “pretend like the vaccines are still providing protection” simply because the variant is relatively milder.\n\nWhile the JAMA study emphasizes the benefits of boosters against Omicron relative to either not getting vaccinated or two doses, researchers conceded that “the higher odds ratios for Omicron suggest less protection for Omicron than for Delta” among the boosted.\n\nThey studied about 23,000 COVID cases, mostly Omicron, among adults who were tested Dec. 10-Jan. 1 by a “national pharmacy-based testing program.” Twice as many controls were used. (Omicron now accounts for nearly 100% of infections.)\n\nMost of the tests were performed in the 25-44 age range, three-quarters were white, and a third “reported underlying health conditions.”\n\nResearchers only counted vaccinated individuals who received the two-dose series at least six months earlier, and boosted individuals who received the third jab at least six months after the second.\n\nThe adjusted odds ratio of symptomatic Omicron infection for boosted versus unvaccinated individuals was 0.33, and for boosted versus two-dose recipients, 0.34. That means three doses corresponded with an “estimated effectiveness” of 67% over no doses, and 66% over two doses.\n\nThe study confirms that “OVERALL vaccine efficacy is zero,” Zywicki told Just the News: The first few months of protection “rapidly approaches zero” around the six-month mark and then goes negative for a few more months.\n\nHe said the JAMA study was the fourth to find “basically this same negative [vaccine efficacy] effect” that he documented in an Epoch Times op-ed on “original antigenic sin.”\n\nZywicki highlighted research from Toronto, California and Denmark that found negative VE starting two to six months after vaccination. The California study was “slippery,” he claimed, because “the authors appear to have simply arbitrarily set a floor of zero vaccine efficacy.”\n\nThe law professor’s “understanding of epidemiology measurement is inadequate,” the California study’s lead author, epidemiologist Hung Fu Tseng, wrote in an email. “[A]lthough the odds ratio can be over 1, and 1-OR could be negative, the VE (or it’s confidence interval) can not be negative. There is no mathematical meaning of a negative percentage.”\n\nThe CDC disputed Zywicki’s interpretation of its JAMA study.\n\n“We see that 2 doses vs. unvaccinated against symptomatic infection with Omicron wanes to a number that is not distinguishable from 0 (i.e., our estimates even when negative are not significantly different from 0),” spokesperson Kristen Nordlund wrote in an email.\n\n“So protection against infection wanes to something undetectable, but we do not see that the risk of infection is increased,” she said. Nordlund also said the adjusted odds ratios were “not distinguishable from each other” because their confidence intervals overlapped.\n\nThis response amazed Zywicki. “[T]he CDC is admitting that vaccine efficacy is indistinguishable from zero from omicron?” he wrote. “Yeah we are going to put people through the risk of adverse side effects for two shots of vaccine that they acknowledge is at best zero in six months?”", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC Study Suggests Unboosted Vaccines Become Worse Than Nothing Against Omicron", "description": "(Greg Piper) Agency confirms \"protection against infection wanes to something undetectable,\" while maintaining that \"we do not see that the risk of infection is increased\" after lapse of protective window.", "url": "https://stillnessinthestorm.com/2022/01/cdc-study-suggests-unboosted-vaccines-become-worse-than-nothing-against-omicron/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2022-01-26T17:52:05+00:00", "article:modified_time": "2022-01-27T14:58:58+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2022/01/GettyImages-1237086663.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["covid vaccine", "cdc", "news", "Just TheNews", "video", "useless vaccine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Here is the Pfizer CEO clip saying his company’s two dose covid vaccine provides “limited, if any” protection against omicron. <a href=\"https://twitter.com/Twitter?ref_src=twsrc%5Etfw\">@twitter</a> needs to explain what the copyright claim is here. Seems to clearly be fair use &amp; it’s obviously very newsworthy: <a href=\"https://t.co/LrbgkPO6PH\">pic.twitter.com/LrbgkPO6PH</a></p>\n<p>— Clay Travis (@ClayTravis) <a href=\"https://twitter.com/ClayTravis/status/1480995190966046725?ref_src=twsrc%5Etfw\">January 11, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The study is framed to show that the boosted (3x) have a lower Omicron Infection rate than the Unvaccinated (11.2% vs 19.9%). While that may be true within the first 30 days, the boosted vaccine immunity wanes quickly as shown in the Denmark study &amp; Israeli data. 2/ <a href=\"https://t.co/X36VLKz9mw\">pic.twitter.com/X36VLKz9mw</a></p>\n<p>— Zinc, D3, &amp; Quercetin | COVID-19 Game Changer (@LukeMor19529310) <a href=\"https://twitter.com/LukeMor19529310/status/1484621068979605508?ref_src=twsrc%5Etfw\">January 21, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://jamanetwork.com/journals/jama/fullarticle/2788485", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-certain-monoclonal-antibodies-treat-covid-19-due-omicron", "https://justthenews.com/politics-policy/coronavirus/fda-halts-use-regeneron-other-monoclonal-antibody-covid-treatment", "https://twitter.com/ToddZywicki/status/1485987634665111555", "https://justthenews.com/politics-policy/coronavirus/professor-granted-vaccine-exemption-after-he-sues-university-recognize", "https://twitter.com/ToddZywicki/status/1485989616582807556", "https://justthenews.com/politics-policy/coronavirus/covid-vaccine-funder-bill-gates-not-impressed-their-performance", "https://s29.q4cdn.com/745959723/files/doc_news/Moderna-Announces-Preliminary-Booster-Data-and-Updates-Strategy-to-Address-Omicron-Variant-2021.pdf", "https://twitter.com/Twitter?ref_src=twsrc%5Etfw", "https://t.co/LrbgkPO6PH", "https://twitter.com/ClayTravis/status/1480995190966046725?ref_src=twsrc%5Etfw", "https://investors.pfizer.com/Investors/News/news-details/2022/Pfizer-and-BioNTech-Initiate-Study-to-Evaluate-Omicron-Based-COVID-19-Vaccine-in-Adults-18-to-55-Years-of-Age/default.aspx", "https://apnews.com/article/coronavirus-pandemic-health-middle-east-israel-49abe016208fbddba59a75f36dc59a3c", "https://nypost.com/2022/01/18/fourth-covid-vaccine-still-doesnt-stop-omicron-israeli-study/", "https://nypost.com/2022/01/24/fourth-shot-enhances-covid-resistance-for-elderly-israel/", "https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://stillnessinthestorm.com/health/", "https://t.co/X36VLKz9mw", "https://twitter.com/LukeMor19529310/status/1484621068979605508?ref_src=twsrc%5Etfw", "https://archive.fo/LxosK#selection-1353.0-1360.0", "https://www.medrxiv.org/content/10.1101/2021.12.30.21268565v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2022.01.07.22268919v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v3.full.pdf"], "authors": ["Stillness in the Storm"], "publish_date": "2022-01-26T17:52:05+00:00"}