{"result_id": "277047", "URL": "https://stillnessinthestorm.com/2021/12/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part/", "timestamp": "2023-04-25 17:11:41 CEST+0200", "meta": {"description": "(Kyle Becker) The Food and Drug Administration’s “full authorization” for the Pfizer-BioNTech vaccine for Covid-19 was announced with a fair amount of hooplah.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2021/12/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "New Evidence Exposes Vaccine ‘Full Authorization’ as a Hoax. But Here’s the Real ‘Nefarious’ Part", "cleaned_text": "(Kyle Becker) The Food and Drug Administration’s “full authorization” for the Pfizer-BioNTech vaccine for Covid-19 was announced with a fair amount of hooplah.\n\nRelated Biden Regime Flies Illegal Immigrants to Pennsylvania Airport, Including Twice on Christmas Day\n\nPresident Joe Biden in August declared that the monumental development meant vaccine mandates should commence in the private sector, government, and U.S. military.\n\n“The FDA has officially approved the Pfizer COVID-19 vaccine,” Biden said. “While all three COVID vaccines have met FDA’s strict standards for emergency use, this FDA approval should give added confidence that this vaccine is safe and effective. If you’re not vaccinated yet, now is the time.”\n\nBiden’s announcement was followed by widespread media coverage that the Pfizer-BioNTech’s “vaccine” had “full” approval in the United States.\n\nBut a closer examination of the “full authorization” documents has some Americans feeling deceived. Jordan Schachtel recently dug into the issue to verify again that Pfizer-BioNTech’s mRNA shot is not being treated like a “fully authorized” vaccine.\n\n“It is absolutely true that there is no FDA approved COVID-19 vaccine available in the United States today, & Pfizer has no plans to make one available any time soon,” Jordan Schachtel pointed out on Twitter. “I fact checked the fact checkers, Big Pharma, & the feds & couldn’t believe what I found. Piece has been updated to reflect that both Pfizer & the feds claim that Comirnaty has the same legal protections as the EUA.”\n\n“Still, they have no explanation why there are 2 distinct products, why 1 is being delivered under EUA, & the fully authorized version can’t be obtained,” he went on. “There are several complex, ongoing legal battles regarding EUA vs full approval protections. What we do know for sure is that there is NO FDA approved shot available in the United States, and Pfizer has no intention of bringing the fully approved product to market here soon.”\n\n“The ‘fact checkers’ gave a voice to both Pfizer and the govt, but did not lend a comment to the individuals and legal groups that litigate with big pharma,” Schachtel added. “The latter group claims the difference between EUA and full approval is very significant. The other side claims otherwise.”\n\nSchachtel recently undertook a fact check that verifies what Becker News found in August.\n\n“I fact checked the fact checkers and couldn’t believe what I found,” Schachtel found in his Substack post. “Despite the corporate press, Big Pharma, and the federal government telling us otherwise, it is absolutely true that there is no FDA approved COVID-19 vaccine available in the United States today. And there are no plans to make one available any time soon.”\n\n“I know it’s hard to believe, but it’s 100% true,” Schachtel goes on. “And this reality hints at an incredible scandal within both Big Pharma and the U.S. Public Health bureaucracy.”\n\n“On August 23, the FDA granted full approval for a COVID-19 vaccine to Pfizer-BioNtech for a specific product sold under the brand name Comirnaty,” he continues. “The landmark moment — the ‘full approval’ endorsement from the FDA — was heralded by the Biden Administration and countless states, and quickly leveraged to coerce millions into taking the shots. This product, Comirnaty, was fully authorized for the ‘prevention of COVID-19 disease in individuals 16 years of age and older’.”\n\n“Yet Comirnaty itself has never made its way into the United States,” Schachtel notes in his December 29 post. “The fully-approved version is nowhere to be found within our borders.”\n\n“A separate product, which remains under emergency use authorization (EUA), is the only ‘Pfizer shot’ available in the United States,” he adds.\n\nCritically, Schachtel provides the latest update to the situation.\n\n”But here’s the issue: they have yet to explain why people stillcan’t get Comirnaty, now 128 days after full approval,” he says. “The CDC continues to confirm that Comirnaty is ‘not orderable at this time.’ Moreover, the CDC currently states that ‘Pfizer does not plan to produce any product with these NDCs (National Drug Codes) and labels over the next few months while EUA authorized product is still available and being made available for U.S. distribution’.”\n\nBecker News can add another bit of evidence that the “fully authorized” announcement was a sham: If there is a “fully authorized” vaccine on the market it is *illegal* for other vaccines to be offered under EUA. This is the federal law. Yet, Moderna & J&J shots can still be taken. Indeed, attorney Robert Barnes is suing the government due to the FDA’s unlawful carve-out for Pfizer in an exception in its Cominarty authorization.\n\nFurthermore, if Pfizer is “fully authorized” why is it still getting EUAs? If one checks the FDA website, one finds that the Pfizer-BioNTech COVID-19 Vaccine was reissued: “Feb 25, May 10, Jun 25, Aug 12, Aug 23, Sep 22, Oct 20, 2021, Oct 29, 2021, Nov 19, 2021, Dec 9, 2021 & Dec 16, 2021).”\n\nJordan Schachtel points to another “nefarious” aspect of the “full authorization” lie: Big Pharma is using children as a “human shield” to protect them from liability.\n\n“Now, here’s where it all gets very nefarious,” he says.\n\n“In order for Pfizer to be granted more robust legal liability protection for their fully authorized Comirnaty shot, they must first secure full approval for the children’s version of their COVID-19 shot. Steve Kirsch has explained this at length last month on his Substack. Additionally, Robert Kennedy Jr mentioned it on a recent podcast with Mikhaila Peterson. I looked into these claims extensively, and they are completely accurate. The National Childhood Vaccine Injury Act (NCVIA), which was passed into law in 1986, provides a legal liability shield to drug manufacturers if they receive full authorization for all ages.”\n\n“Is Pfizer seeking approval for children so that it can protect itself from lawsuits?” he asks. “The company is working with regulators, even clandestinely altering vaccine ingredients (a process that should require them to get full approval for an entirely separate product), in a seeming bid to clear the path to legal indemnity.”\n\nThe entire vaccine rollout has broken the public trust — from the lies about “15 days to stop the spread” to the lie that the COVID vaccine prevents transmission and thereby protects “the public” — the pharmaceutical companies, as well as the Biden administration and its bureaucratic arms, no longer get the benefit of the doubt.\n\nIf the Pfizer-BioNTech vaccine is being treated as a ‘fully authorized’ vaccine, then it should no longer be afforded the protections offered by EUA.\n\nThere is one way the American people can find out for sure: Let the lawsuits begin.\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Evidence Exposes Vaccine ‘Full Authorization’ as a Hoax. But Here’s the Real ‘Nefarious’ Part", "description": "(Kyle Becker) The Food and Drug Administration’s “full authorization” for the Pfizer-BioNTech vaccine for Covid-19 was announced with a fair amount of hooplah.", "url": "https://stillnessinthestorm.com/2021/12/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2021-12-31T16:28:55+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2021/12/Screenshot-12_30_2021-2_33_29-PM-scaled-1.jpg", "image:width": "1024", "image:height": "626", "image:type": "image/jpeg"}, "tags": ["evidence", "news", "hoax", "vaccine", "Authorization", "becker news", "Nefarious"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F12%2Fnew-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part%2F&title=New%20Evidence%20Exposes%20Vaccine%20%E2%80%98Full%20Authorization%E2%80%99%20as%20a%20Hoax.%20But%20Here%E2%80%99s%20the%20Real%20%E2%80%98Nefarious%E2%80%99%20Part", "https://stillnessinthestorm.com/2021/12/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part/", "https://api.whatsapp.com/send?text=New%20Evidence%20Exposes%20Vaccine%20%E2%80%98Full%20Authorization%E2%80%99%20as%20a%20Hoax.%20But%20Here%E2%80%99s%20the%20Real%20%E2%80%98Nefarious%E2%80%99%20Part https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F12%2Fnew-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F12%2Fnew-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part%2F&text=New%20Evidence%20Exposes%20Vaccine%20%E2%80%98Full%20Authorization%E2%80%99%20as%20a%20Hoax.%20But%20Here%E2%80%99s%20the%20Real%20%E2%80%98Nefarious%E2%80%99%20Part", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F12%2Fnew-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part%2F&text=New%20Evidence%20Exposes%20Vaccine%20%E2%80%98Full%20Authorization%E2%80%99%20as%20a%20Hoax.%20But%20Here%E2%80%99s%20the%20Real%20%E2%80%98Nefarious%E2%80%99%20Part", "https://stillnessinthestorm.com/2021/12/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part/", "https://beckernews.com/author/kylebeckereditorgmail-com/", "https://stillnessinthestorm.com/2021/12/biden-regime-flies-illegal-immigrants-to-pennsylvania-airport-including-twice-on-christmas-day/", "https://beckernews.com/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part-43547/", "https://beckernews.com/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part-43547/", "https://beckernews.com/author/kylebeckereditorgmail-com/", "https://beckernews.com/joe-biden-gives-quick-reaction-to-the-fdas-full-authorization-of-covid-vaccines-41041/", "https://beckernews.com/breaking-the-covid-vaccine-has-just-been-fully-authorized-for-use-in-the-united-states-41037/", "https://twitter.com/JordanSchachtel/status/1476367815036837900", "https://beckernews.com/44-new-docs-41120/", "https://dossier.substack.com/p/bait-and-switch-there-remains-no?r=6a3x3&utm_campaign=post&utm_medium=web", "https://stillnessinthestorm.com/health/", "https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html", "https://twitter.com/NoVA_Campaigns/status/1476369394552954886", "https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/emergency-use-authorization#coviddrugs", "https://stevekirsch.substack.com/p/heres-the-real-reason-comirnaty-is", "https://www.youtube.com/watch?v=lkKOt4SYYiY&feature=emb_logo", "https://stillnessinthestore.com/product/its-never-been-about-safety-short-sleeve-t-shirt/", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://beckernews.com/new-evidence-exposes-vaccine-full-authorization-as-a-hoax-but-heres-the-real-nefarious-part-43547/", "https://beckernews.com/wp-content/uploads/2021/12/Screenshot-12_30_2021-2_33_29-PM-scaled.jpg"], "authors": ["Stillness in the Storm"], "publish_date": "2021-12-31T16:28:55+00:00"}