{"result_id": "277028", "URL": "https://stillnessinthestorm.com/2021/07/cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed/", "timestamp": "2023-04-25 17:11:17 CEST+0200", "meta": {"description": "(Mike Adams) Via the words of the CDC’s own director Dr. Rochelle Walensky, the official narrative on vaccines and covid has just self-destructed. While in March of this year, Walenksy had publicly promised that vaccinated people could not spread the virus and infect others, this week she publicly stated that vaccines are failing, and that vaccinated people may now carry higher viral loads than unvaccinated people, contributing to the spread of covid.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2021/07/cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "CDC Confesses: Vaccines Are Failing, the Vaxxed Can Be Super-Spreaders, Demands Return to Mask Mandates for Everyone, Including the Vaxxed", "cleaned_text": "(Mike Adams) Via the words of the CDC’s own director Dr. Rochelle Walensky, the official narrative on vaccines and covid has just self-destructed. While in March of this year, Walenksy had publicly promised that vaccinated people could not spread the virus and infect others, this week she publicly stated that vaccines are failing, and that vaccinated people may now carry higher viral loads than unvaccinated people, contributing to the spread of covid.\n\nRelated Judicial Watch: New Documents Reveal CDC Coordinated with Facebook on COVID Messaging and Alleged “Misinformation”\n\nEven Yahoo News, which typically shills for Big Pharma, could not sugarcoat the devastating narrative shift, reporting:\n\nThe CDC updated its guidelines on Tuesday to recommend masks indoors, even for vaccinated people.\n\n The Delta variant makes it easier for vaccinated people to transmit the virus, the CDC said.\n\n Vaccinated and unvaccinated people infected with Delta may have similar viral loads.\n\nUSA Today was so alarmed by the CDC confession that they tried to memory hole their own reporting which cited NBC News. In a panic, USA Today scrubbed this sentence from their story:\n\nNBC News, citing unnamed officials aware of the decision, reported it comes after new data suggests vaccinated individuals could have higher levels of virus and infect others amid the surge of cases driven by the delta variant of the coronavirus.\n\nThe CDC is currently hiding these data from the public, by the way, most likely because they know that once the data are revealed, any remaining shred of their pro-vaccine narrative will spontaneously collapse.\n\nCDC “confession” just obliterated all the promises made to the vaccinated… now they are slowly realizing they’re the doomed super-spreaders\n\nIn making these public statements, the CDC just admitted that the entire promise that vaccinated people were immune to covid and couldn’t spread it to others just unraveled. Immediately, the CDC demanded that the entire nation revert to neanderthal mask mandates, even for those who have been “fully vaccinated.”\n\nIt begs the question: If the answer isn’t vaccines but rather just wearing masks, then why does America need the CDC in the first place? And since masks actually don’t work to block viral particles that are orders of magnitude smaller than the gaps in the mask threads, then how can masks stop them?\n\nAnd if vaccines aren’t working, then what’s the use of vaccine passports?\n\nThis is all an open admission that the CDC has no tools against covid and that the last 18 months of pro-vaccine promises were nothing but lies and propaganda. Even worse, the entire medical establishment has suppressed the only legitimate solution to this pandemic, which is natural immunity, which can only function effectively when combined with good nutrition and proper supplementation. Yet the one-size-fits-all medical cult system that dominates society today can only see pharmaceuticals and vaccines as possible answers, never nutrition or natural immunity. Therefore, the CDC has nothing left to offer America other than blind obedience to their quack science lies.\n\nBut it’s even worse: CDC director just admitted the vaccines will soon be obsolete\n\nIf you can imagine it, the situation is actually far worse than what’s been covered here so far. In her public confessions this week, CDC director Walensky also admitted that covid is “just a few mutations away” from rendering all existing vaccines completely obsolete. She added:\n\nThe largest concern that I think we in public health and science are worried about is that virus and the potential mutations. We have a very transmissible virus, which has the potential to evade our vaccines in terms of how it protects us from severe disease and death…\n\nSo then, as any rational person might ask, what is the point of taking vaccines in the first place? This is even more alarming when you realize that vaccine-induced “immunity” is now documented to start fading after six weeks. And once the vaccine fades, people become more vulnerable to infections, compared to the unvaccinated or those with natural immunity. That’s why in California right now, the highest count of new covid-19 cases are being recorded in counties with the highest vaccination rates.\n\nSimilarly, in pushing for another moneymaking racket of “booster shots,” vaccine companies are now openly stating that their own vaccines stop working after a few months, hence people will need booster shots to keep the vaccine profits flowing.\n\nActually, it’s worse still: The vaccinated people are the “super-breeders” of covid variants, too\n\nNot only are vaccinated people now the super-spreaders, it also turns out they’re the “super-breeders” of vaccine variants. As vaccine scientist Geert vanden Bossche explains: (emphasis ours)\n\n…[M]ass vaccination promotes natural selection of increasingly vaccine immunity (VI)-escaping variants in the vaccinated part of the population. Taken together, mass vaccination conducted on a background of high infectivity rates enables more infectious, increasingly VI-escaping variants to expand in prevalence. This evolution inevitably results in inclining morbidity rates in both, the non-vaccinated and vaccinated population and precipitates the emergence of circulating viral variants that will eventually fully resist vaccine-mediated immunity (VMI). This is why mass vaccination campaigns should not be conducted during a pandemic of a highly mutable virus, let alone during a pandemic of more infectious variants (unless transmission-blocking vaccines are used!). It is critical to understand that a rapid decline in viral infectivity rates that is not achieved by natural infection but merely results from expedited mass vaccination campaigns will only delay abrupt propagation of emerging, fully vaccine-resistant viral variants and hence, only delay the occurrence of a high wave of morbidity and mortality.\n\nThe “high wave of morbidity and mortality,” it seems, has only just begun.\n\nDr. Robert Malone warns of “worst case scenario” and cites first evidence showing Antibody Dependent Enhancement (ADE) now emerging\n\nOver the next 12 months or so, we are likely going to see a wave of post-vaccine deaths that mirrors the wave of people obtaining vaccines earlier this year. Even Dr. Robert Malone, inventor of the mRNA vaccine technology, warns that the CDC’s admission is essentially a confirmation that Antibody Dependent Enhancement effects have begun.\n\nIn a recent interview with Steve Bannon on War Room Pandemic, Dr. Malone (who is fully pro-vaccine, by the way), stated:\n\nThis is exactly what you would see if antibody dependent enhancement were happening… Pfizer protection is waning at six months. Those who received Pfizer, that are now in the waning phase, seem to be getting infected. This exactly what you would anticipate is the window of greatest susceptibility to antibody dependent enhancement, in this long tapering phase as the vaccine response declines.\n\nThe government is obfuscating what’s happening here. What seems to be rolling out the worst case scenario where the vaccine in the waning phase is causing virus to replicate more efficiently than it would otherwise, which is what we call ADE.\n\nWhen one of the world’s leading pro-vaccine scientists — the inventor of mRNA vaccine technology — steps forward and says the covid vaccines now represent a “worst case scenario,” it’s probably worth paying attention.\n\nI cover all this in much more detail in today’s eye-opening Situation Update podcast via Brighteon.com:\n\nMike Adams (aka the “Health Ranger“) is a best selling author (#1 best selling science book on Amazon.com called “Food Forensics“), an environmental scientist, a patent holder for a cesium radioactive isotope elimination invention, a multiple award winner for outstanding journalism, a science news publisher and influential commentator on topics ranging from science and medicine to culture and politics. Follow his videos, podcasts, websites and science projects at the links below.\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC Confesses: Vaccines Are Failing, the Vaxxed Can Be Super-Spreaders, Demands Return to Mask Mandates for Everyone, Including the Vaxxed", "description": "(Mike Adams) Via the words of the CDC’s own director Dr. Rochelle Walensky, the official narrative on vaccines and covid has just self-destructed. While in March of this year, Walenksy had publicly promised that vaccinated people could not spread the virus and infect others, this week she publicly stated that vaccines are failing, and that vaccinated people may now carry higher viral loads than unvaccinated people, contributing to the spread of covid.", "url": "https://stillnessinthestorm.com/2021/07/cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2021-07-30T15:32:28+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2021/07/HRR-2021-07-29-Situation-Update.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": ["pandemic", "cdc", "natural news", "hoax", "badhealth", "Mask Mandates", "coronavirus", "propaganda", "junk science", "Delta variant", "covid", "vaccine failure", "vaccine wars", "Medical Tyranny", "super spreaders", "badscience", "biowar", "confess", "badmedicine", "vaccines", "fail"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F07%2Fcdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed%2F&title=CDC%20Confesses%3A%20Vaccines%20Are%20Failing%2C%20the%20Vaxxed%20Can%20Be%20Super-Spreaders%2C%20Demands%20Return%20to%20Mask%20Mandates%20for%20Everyone%2C%20Including%20the%20Vaxxed", "https://stillnessinthestorm.com/2021/07/cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed/", "https://api.whatsapp.com/send?text=CDC%20Confesses%3A%20Vaccines%20Are%20Failing%2C%20the%20Vaxxed%20Can%20Be%20Super-Spreaders%2C%20Demands%20Return%20to%20Mask%20Mandates%20for%20Everyone%2C%20Including%20the%20Vaxxed https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F07%2Fcdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F07%2Fcdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed%2F&text=CDC%20Confesses%3A%20Vaccines%20Are%20Failing%2C%20the%20Vaxxed%20Can%20Be%20Super-Spreaders%2C%20Demands%20Return%20to%20Mask%20Mandates%20for%20Everyone%2C%20Including%20the%20Vaxxed", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2021%2F07%2Fcdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed%2F&text=CDC%20Confesses%3A%20Vaccines%20Are%20Failing%2C%20the%20Vaxxed%20Can%20Be%20Super-Spreaders%2C%20Demands%20Return%20to%20Mask%20Mandates%20for%20Everyone%2C%20Including%20the%20Vaxxed", "https://stillnessinthestorm.com/2021/07/cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders-demands-return-to-mask-mandates-for-everyone-including-the-vaxxed/", "https://www.naturalnews.com/author/healthranger", "https://www.msn.com/en-us/health/medical/cdc-data-suggests-vaccinated-don-t-carry-can-t-spread-virus/ar-BB1f8ofp", "https://www.naturalnews.com/2021-07-29-cdc-confesses-covid-vaccines-medical-hoax-higher-viral-loads.html", "https://stillnessinthestorm.com/2021/07/judicial-watch-new-documents-reveal-cdc-coordinated-with-facebook-on-covid-messaging-and-alleged-misinformation/", "https://www.naturalnews.com/2021-07-29-cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders.html", "https://www.naturalnews.com/2021-07-29-cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders.html", "https://www.naturalnews.com/author/healthranger", "https://news.yahoo.com/cdc-says-fully-vaccinated-people-201508057.html", "https://www.naturalnews.com/2021-07-29-usa-today-buries-reporting-vaccinated-spreading-covid.html", "https://www.theepochtimes.com/cdc-director-warns-ccp-virus-may-be-a-few-mutations-away-from-evading-vaccines_3921709.html", "https://stillnessinthestorm.com/health/", "https://www.naturalnews.com/2021-07-28-study-artificial-covid-vaccine-immunity-wanes-weeks.html", "https://www.naturalnews.com/2021-07-28-most-new-coronavirus-cases-california-vaccinated-counties.html", "https://www.naturalnews.com/2021-07-29-biontech-ceo-booster-doses-vaccine-protection.html", "https://seemorerocks.is/vaccine-expert-gives-final-warning-stop-all-mass-covid-vaccinations-immediately-or-face-unleashing-incurable-deadly-unstoppable-wave-of-disease/", "https://www.freshandalive.com/products/appliances-equipment/energy-devices/rest-shield.html?AFFID=406592", "https://www.freshandalive.com/products/appliances-equipment/energy-devices/rest-shield.html?AFFID=406592", "https://www.naturalnews.com/author/healthranger", "http://www.healthranger.com/", "http://foodforensics.com/", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://www.naturalnews.com/2021-07-29-cdc-confesses-vaccines-are-failing-the-vaxxed-can-be-super-spreaders.html", "https://www.naturalnews.com/wp-content/uploads/sites/91/2021/07/HRR-2021-07-29-Situation-Update.jpg"], "authors": ["Stillness in the Storm"], "publish_date": "2021-07-30T15:32:28+00:00"}