{"result_id": "277029", "URL": "https://stillnessinthestorm.com/2022/06/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder/", "timestamp": "2023-04-25 17:11:18 CEST+0200", "meta": {"description": "(Kyle Becker) A British medical research institute has discovered that the Oxford-developed AstraZeneca vaccine, a jab that uses a ‘trojan horse’ delivery system based on a weakened viral strain, is potentially connected to an uptick in a serious neurological disorder called Guillain-Barré syndrome (GBS).", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2022/06/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "Scientists Discover Covid Vaccine’s ‘Trojan Horse’ Delivery May Lead to Serious Neurological Disorder", "cleaned_text": "(Kyle Becker) A British medical research institute has discovered that the Oxford-developed AstraZeneca vaccine, a jab that uses a ‘trojan horse’ delivery system based on a weakened viral strain, is potentially connected to an uptick in a serious neurological disorder called Guillain-Barré syndrome (GBS).\n\nRelated UK Braces For Internet “Blackouts” Due To Coming “Wave Of Bankruptcies”\n\n“Like many vaccines, the Oxford jab uses a weakened chimp adenovirus to deliver the coronavirus spike protein into the body, and scientists have speculated that a reaction to adenovirus may be responsible for the rise in cases,” the Telegraph reported. “Adenovirus usually causes the common cold, but scientists are starting to think it may also mimic human cells in a similar way to [the gastroenteritis bug] Campylobacter, confusing the immune system into attacking the body.”\n\nThe study’s lead author Professor Michael Lunn of the UCL Queen Square Institute of Neurology remarked: “At the moment we don’t know why a vaccine may cause these very small rises in GBS. It may be that a non-specific immune activation in susceptible individuals occurs, but if that were the case similar risks might apply to all vaccine types.”\n\n“It is therefore logical to suggest that the simian adenovirus vector, often used to develop vaccines, including AstraZeneca’s, may account for the increased risk,” he added.\n\n“GBS is a rare condition which causes muscle numbness and pain, and can hinder movement, walking, swallowing and, sometimes, even breathing,” the report adds.\n\nThe AstraZeneca vaccine, which is not approved for use within the United States, is not the only Covid-19 vaccine that has been recently found to be potentially connected to serious side effects.\n\nIn early May, the Food and Drug Administration issued restrictions on the single-shot Johnson & Johnson Covid vaccine due to the possible risk of blood clots.\n\n“The FDA said its analysis had determined that the risk of thrombosis with thrombocytopenia syndrome after the administration of the shot warrants limiting of the authorization,” CNBC reported.\n\n“We recognize that the Janssen COVID-19 Vaccine still has a role in the current pandemic response in the United States and across the global community,” said Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research. “Our action reflects our updated analysis of the risk of TTS following administration of this vaccine and limits the use of the vaccine to certain individuals.”\n\nThe Johnson & Johnson shots are now limited to adults 18 years and older or for whom other COVID-19 vaccines are deemed not accessible or clinically appropriate.\n\nIn April, an MIT study found that there was an increased risk of heart inflammation among 16-39 year-olds in Israel. “COVID-19 vaccination was ‘significantly associated’ with a 25% jump in emergency medical services (EMS) for heart problems in 16-39 year-olds in Israel, whose vaccination rate is among the world’s highest, according to a peer-reviewed study by MIT researchers,” Just the News reported. “While not establishing causal relationships, the findings raise concerns regarding vaccine-induced undetected severe cardiovascular side-effects and underscore the already established causal relationship between vaccines and myocarditis, a frequent cause of unexpected cardiac arrest in young individuals,” the study says. In October 2021, some European countries suspended authorization for Moderna vaccines due to the increased risk of heart inflammation for young persons. A study published in late April based on Moderna’s randomized control trial for its vaccine found that the shot may impair the long-term development and retention of Covid-fighting antibodies. The complex study entitled, “Anti-nucleocapsid antibodies following SARS-CoV-2 infection in the blinded phase of the mRNA-1273 Covid-19 vaccine efficacy clinical trial,” shows that vaccinated individuals had impaired ability to produce specific kinds of Covid-relevant antibodies versus those who were unvaccinated but had natural immunity from prior infections. “These data show that, among the participants with PCR-confirmed Covid-19 disease, anti-N Ab seropositivity [a particular kind of antibody] at a median of 53 days post diagnosis occurred in 40% of the mRNA-1273 vaccine recipients vs. 93% of the placebo recipients,” the study states. Thus, vaccinated individuals had less than half the seropositivity rate as unvaccinated individuals with natural immunity, according to the study. The effect that authors discuss is caused ‘seroconversion,’ meaning the transference of infection to antibody protection in the immune system. “While an increase in seroreversion cannot be ruled out, given the short time frame the more likely explanation is a vaccine-induced reduction in seroconversion,” the authors state. While the medical study is pending peer-review, the test results are sure to fuel controversy over the ongoing ‘booster’ shot push. In late March, the Director for the Centers for Disease Control and Prevention Rochelle Walensky testified that 95% of Americans had some protection to Covid-19. “We also know that in this country because of vaccines because of boosters and because of protection from prior disease, infection-induced immunity (natural immunity) that about 95% of people in this country have some level of protection,” she said.\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Discover Covid Vaccine’s ‘Trojan Horse’ Delivery May Lead to Serious Neurological Disorder", "description": "(Kyle Becker) A British medical research institute has discovered that the Oxford-developed AstraZeneca vaccine, a jab that uses a ‘trojan horse’ delivery system based on a weakened viral strain, is potentially connected to an uptick in a serious neurological disorder called Guillain-Barré syndrome (GBS).", "url": "https://stillnessinthestorm.com/2022/06/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2022-06-09T21:33:45+00:00", "article:modified_time": "2022-06-08T03:14:56+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2022/06/shutterstock_1878856555-810x492-1.jpg", "image:width": "810", "image:height": "492", "image:type": "image/jpeg"}, "tags": ["covid vaccine", "news", "Neurological Disorder", "Scientists", "becker news", "Science"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F06%2Fscientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder%2F&title=Scientists%20Discover%20Covid%20Vaccine%E2%80%99s%20%E2%80%98Trojan%20Horse%E2%80%99%20Delivery%20May%20Lead%20to%20Serious%20Neurological%20Disorder", "https://stillnessinthestorm.com/2022/06/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder/", "https://api.whatsapp.com/send?text=Scientists%20Discover%20Covid%20Vaccine%E2%80%99s%20%E2%80%98Trojan%20Horse%E2%80%99%20Delivery%20May%20Lead%20to%20Serious%20Neurological%20Disorder https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F06%2Fscientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F06%2Fscientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder%2F&text=Scientists%20Discover%20Covid%20Vaccine%E2%80%99s%20%E2%80%98Trojan%20Horse%E2%80%99%20Delivery%20May%20Lead%20to%20Serious%20Neurological%20Disorder", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F06%2Fscientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder%2F&text=Scientists%20Discover%20Covid%20Vaccine%E2%80%99s%20%E2%80%98Trojan%20Horse%E2%80%99%20Delivery%20May%20Lead%20to%20Serious%20Neurological%20Disorder", "https://stillnessinthestorm.com/2022/06/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder/", "https://beckernews.com/author/kylebeckereditorgmail-com/", "https://stillnessinthestorm.com/2022/06/uk-braces-for-internet-blackouts-due-to-coming-wave-of-bankruptcies/", "https://beckernews.com/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder-45143/", "https://beckernews.com/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder-45143/", "https://beckernews.com/author/kylebeckereditorgmail-com/", "https://www.telegraph.co.uk/news/2022/05/28/astrazeneca-vaccine-may-increase-risk-serious-neurological-condition/", "https://www.cnbc.com/2022/05/05/fda-limits-use-of-jjs-covid-19-vaccine-for-adults.html", "https://www.nature.com/articles/s41598-022-10928-z", "https://justthenews.com/politics-policy/coronavirus/mit-study-finds-covid-vaccines-significantly-associated-jump-emergency", "https://www.medrxiv.org/content/10.1101/2022.04.18.22271936v1.full", "https://beckernews.com/edit-walensky-admits-natural-immunity-is-real-95-of-americans-have-some-protection-against-covid-44612/", "https://stillnessinthestore.com/product/love-fully-forgive-completely-unisex-short-sleeve-v-neck-t-shirt/", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://beckernews.com/scientists-discover-covid-vaccines-trojan-horse-delivery-may-lead-to-serious-neurological-disorder-45143/"], "authors": ["Stillness in the Storm"], "publish_date": "2022-06-09T21:33:45+00:00"}