{"result_id": "277007", "URL": "https://stillnessinthestorm.com/2022/02/the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant/", "timestamp": "2023-04-25 17:10:50 CEST+0200", "meta": {"description": "(Kyle Becker) A highly acclaimed professor of medicine at the University of Leeds is touting that recent findings on Covid natural immunity have made the vaccine mandates irrelevant. Furthermore, the mandates are unnecessarily exacerbating labor shortages in the medical field, which is harming patient care.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2022/02/the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "The Lancet Publishes Highly Acclaimed Medical Prof’s Warning That Natural Immunity Has Made Vaccine Mandates Irrelevant", "cleaned_text": "( ) A highly acclaimed professor of medicine at the University of Leeds is touting that recent findings on Covid natural immunity have made the vaccine mandates irrelevant. Furthermore, the mandates are unnecessarily exacerbating labor shortages in the medical field, which is harming patient care.\n\n\n\nRelated You Just Can’t Make This Up… Joe Biden Starts Spouting Off About Russia Invading Ukraine’s Sacred Border Again\n\nThe Lancet letter is attributed to Dr. Dennis G. McGonagle, who is a professor at the Leeds Institute of Rheumatic and Musculoskeletal Medicine at the University of Leeds.\n\nAccording to his university biography, McGonagle is “PhD trained in medicine at University College Dublin and graduated in 1990. He trained in General Medicine and Rheumatology at St James University Teaching Hospital in Dublin and at the Leeds General Infirmary UK. He is currently Professor of Investigative Rheumatology at the NIHR funded Academic Unit for the Musculoskeletal Diseases and Leeds Teaching Hospitals NHS Trust.” He has also received “First class honours in medicine.”\n\nDr. McConagle laid out the recent findings on natural immunity and how they stack up with vaccinated immunity.\n\n“First, it is well established that for single stranded RNA viruses such as influenza, natural immunity after recovery from infection provides better protection than vaccination, which needs to be undertaken annually because of waning vaccine immunity,” the letter reads. “The same has been shown for SARS-CoV-2; in one study, individuals exposed to natural infection were ten-times less likely to be reinfected compared with vaccinated individuals without natural infection (adjusted hazard ratio 0·02, 95% CI 0·01–0·04 for previous infection vs 0·26, 0·24–0·28 for vaccination). Individuals exposed to natural infection were also less likely to be admitted to hospital with COVID-19.”\n\nJohns Hopkins university in January dropped a quiet bombshell about natural immunity that went widely ignored in the mainstream media. Dr. Marty Makary, spearheading a team at Johns Hopkins to do the work the CDC and NIH refused to do, showed that 99% of unvaccinated people known to have Covid infections had robust “natural immunity” that did not diminish for at least 650 days. The letter continues.\n\n“Second, before the COVID-19 pandemic, it was a well-established principle that although systemic vaccination against viral respiratory tract pathogens protects vaccinees against serious infection, these individuals can still transmit virus to non-vaccinated individuals because of a lack of mucosal immunity,” he continued. “Therefore, individuals with immunity resulting from natural infection are probably less likely to transmit the infection to vulnerable patients (who should themselves be vaccinated) compared with those who are vaccinated but not naturally immune. Long-term immunity in the upper airway cannot be directly measured, and serum antibody levels are not a surrogate for mucosal immunity.”\n\nAs reported at Becker News earlier, medical experts have revealed that vaccines not only don’t stop the spread, they cannot stop the spread.\n\n“Vaccines that are injected into the muscle – i.e., the interior of the body – will only induce IgG and circulating IgA, not secretory IgA. Such antibodies cannot and will not effectively protect the mucous membranes from infection by SARS-CoV-2,” the authors Dr. Bhakdi and Dr. Arne Burkhardt conclude. “Thus, the currently observed ‘breakthrough infections’ among vaccinated individuals merely confirm the fundamental design flaws of the vaccines.”\n\nDr. McGonagle continued listing the reasons why vaccinate mandates are irrelevant in light of the prevalence of natural immunity.\n\n“Third, numerous studies have shown that vaccination in individuals with previous natural SARS-CoV-2 infection induces so-called super-immunity (or hybrid immunity)—ie, higher antibody and T-cell responses compared with vaccination alone,” the letter notes. “This concept is often evoked in favour of vaccination, but this super-immune state has no proven long-term clinical correlates, and an increasing number of studies show marginal, if any, additional benefits of vaccination in individuals with natural immunity.”\n\n“Attributing higher serum antibody responses in vaccinated individuals to superiority over natural infection is erroneous, as considerable time might have elapsed since the natural infection with the expected waning of antibody levels,” he continues.\n\nThe professor then highlighted that nations have begun to concede these medical facts, while noting that the vaccine mandates seem to be exacerbating labor shortages.\n\n“In some countries, including Germany, the voices of immunologists around the equivalence of natural immunity to vaccination are at least partly heard, since health-care workers who have recovered from natural SARS-CoV-2 infection are exempt from mandated vaccination for 90 days,” he added. “However, based on the history of viral pneumonia and natural immunity, the scientific basis of this time frame is unclear—arguably it should be indefinite.”\n\n“There is an ongoing shortage of health-care workers in England, which a vaccine mandate would probably exacerbate; indeed, this seems to be the primary factor in the UK government’s reconsideration of the policy,” he added. “A strong component of averting a further crisis in health-care personnel should include making politicians aware of the power of natural immunity in individuals who have recovered from COVID-19.”\n\nInterestingly, the professor has declared previous grants from Pfizer and Janssen.\n\n“I declare grants from Pfizer and Janssen, outside the submitted work,” Dr. McGonagle adds.\n\nA medical expert with integrity? That seems to be all-too-rare nowadays.\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Lancet Publishes Highly Acclaimed Medical Prof’s Warning That Natural Immunity Has Made Vaccine Mandates Irrelevant", "description": "(Kyle Becker) A highly acclaimed professor of medicine at the University of Leeds is touting that recent findings on Covid natural immunity have made the vaccine mandates irrelevant. Furthermore, the mandates are unnecessarily exacerbating labor shortages in the medical field, which is harming patient care.", "url": "https://stillnessinthestorm.com/2022/02/the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2022-02-16T17:05:41+00:00", "article:modified_time": "2022-02-16T17:32:22+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2022/02/Screenshot-2_15_2022-6_01_05-PM-810x379-1.jpg", "image:width": "810", "image:height": "379", "image:type": "image/jpeg"}, "tags": ["covid vaccine", "news", "Natural Immunity", "becker news", "the lancet"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F02%2Fthe-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant%2F&title=The%20Lancet%20Publishes%20Highly%20Acclaimed%20Medical%20Prof%E2%80%99s%20Warning%20That%20Natural%20Immunity%20Has%20Made%20Vaccine%20Mandates%20Irrelevant", "https://stillnessinthestorm.com/2022/02/the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant/", "https://api.whatsapp.com/send?text=The%20Lancet%20Publishes%20Highly%20Acclaimed%20Medical%20Prof%E2%80%99s%20Warning%20That%20Natural%20Immunity%20Has%20Made%20Vaccine%20Mandates%20Irrelevant https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F02%2Fthe-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F02%2Fthe-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant%2F&text=The%20Lancet%20Publishes%20Highly%20Acclaimed%20Medical%20Prof%E2%80%99s%20Warning%20That%20Natural%20Immunity%20Has%20Made%20Vaccine%20Mandates%20Irrelevant", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F02%2Fthe-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant%2F&text=The%20Lancet%20Publishes%20Highly%20Acclaimed%20Medical%20Prof%E2%80%99s%20Warning%20That%20Natural%20Immunity%20Has%20Made%20Vaccine%20Mandates%20Irrelevant", "https://stillnessinthestorm.com/2022/02/the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant/", "https://stillnessinthestorm.com/2022/02/you-just-cant-make-this-up-joe-biden-starts-spouting-off-about-russia-invading-ukraines-sacred-border-again/", "https://beckernews.com/new-the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant-44156/", "https://beckernews.com/new-the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant-44156/", "https://www.thelancet.com/journals/lanrhe/article/PIIS2665-9913(22)00038-8/fulltext#%20", "https://jamanetwork.com/journals/jama/fullarticle/2788894?resultClick=1", "https://beckernews.com/medical-experts-reveal-the-scientific-reason-why-covid-vaccines-cannot-stop-the-spread-or-prevent-infection-43621/", "https://stillnessinthestorm.com/health/", "https://stillnessinthestorm.com/health/", "https://goascentnutrition.com/product/full-spectrum-hemp-oil/?rfsn=6707762.c0318b", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://beckernews.com/new-the-lancet-publishes-highly-acclaimed-medical-profs-warning-that-natural-immunity-has-made-vaccine-mandates-irrelevant-44156/"], "authors": ["Stillness in the Storm"], "publish_date": "2022-02-16T17:05:41+00:00"}