{"result_id": "277001", "URL": "https://stillnessinthestorm.com/2022/05/stunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials/", "timestamp": "2023-04-25 17:10:42 CEST+0200", "meta": {"description": "(JD Heyes) A group of Canadian doctors has painstakingly demonstrated how Pfizer committed monumental fraud in conducting rapid clinical trials of its COVID-19 vaccine as they present evidence refuting nearly all claims that the jab is safer and that getting one reduces the incidence and seriousness of the coronavirus.", "lang": "en", "keywords": "", "favicon": "https://stillnessinthestorm.com/wp-content/uploads/2021/09/favicon-152.png", "canonical": "https://stillnessinthestorm.com/2022/05/stunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials/", "encoding": "UTF-8"}, "image": null, "domain": "stillnessinthestorm.com", "title": "Stunning Video By Canadian Doctors Shows How Pfizer Committed Massive Fraud During Covid-19 Vaccine Trials", "cleaned_text": "(JD Heyes) A group of Canadian doctors has painstakingly demonstrated how Pfizer committed monumental fraud in conducting rapid clinical trials of its COVID-19 vaccine as they present evidence refuting nearly all claims that the jab is safer and that getting one reduces the incidence and seriousness of the coronavirus.\n\nRelated Did You Know that Putin Has Cancer?\n\nThe organization called the Canadian COVID Care Alliance, representing more than 500 independent Canadian doctors, scientists and health care practitioners, presented a 40-minute video and accompanying slide presentation explaining exactly how Pfizer fudged numbers and testing in order to get its shot approved quickly under a program launched by former President Donald Trump, who very likely had no idea what the big pharma giant had done when his administration green-lighted Pfizer’s mRNA vaccine for emergency authorization.\n\nIn short, according to The COVID World, “The full 40-minute video presentation by the group includes PDF slides that show evidence that Pfizer misrepresented data to hide the fact that their COVID injections came with an increased risk of illness and death when compared to the placebo group in their trial.”\n\nThe presentation “explains how Pfizer failed to follow established, high-quality safety and efficacy protocols for vaccine development as everything was done in under a year and animal testing was skipped,” the website adds.\n\nThe organization also highlights how Pfizer allegedly minimized vaccine injury to Maddie de Garay, a teen who was paralyzed from the waist down after she took part in a clinical trial for 12-to-15-year-olds in December 2020, noting that she still requires a wheelchair in order to get around and that she needs a feeding tube more than a year after the trial ended.\n\nThe presentation begins by noting that the best empirical evidence when conducting vaccine and other medicinal trials is “Level 1 evidence,” which is the “gold standard” and the only way that something can actually be proven true. As such, when making public health policy, only Level 1 evidence should be utilized.\n\nBut that wasn’t the case when it came to Pfizer’s vaccine, at least. The company said in its original trial report dated Dec. 31, 2020, after just two months’ worth of randomized testing — the appropriate way to test medication efficacy — that its vaccine had an efficacy rate of 95 percent seven days after the second dose, but further examination found that to be a gross exaggeration.\n\nIn reality, the 95-percent rate reflects “relative risk reduction,” but the “absolute risk reduction,” the more important metric, showed that the vaccine only carried a .84 percent efficacy rate.\n\nHere is a short video that explains the difference:\n\nIn addition, the Canadian organization also broke down Pfizer’s short clinical trial to explain how the pharmaceutical maker fudged the process in order to come up with its inaccurate success rate.\n\nThe group noted that the clinical trial that began in late July 2020 should have featured two evenly divided groups of inoculated and non-vaccinated participants in a blind study — that is, no one in either group was supposed to know who got the vaccine and go was given a placebo. But instead, as the above slide shows, a “crossover” occurred in early 2021 and the placebo group was given “the opportunity to take the inoculation,” with the majority having agreed to do so. At that point, the Canadian group notes, “it’s no longer a randomized control trial,” as the “control group is gone.”\n\nBy 2023, the long-term safety data “that was supposed to be assessed at this point is no longer possible to ascertain as the placebo group crossed over two years previously,” so whatever efficacy data Pfizer claims to have discovered by now is essentially worthless.\n\nTo that point, the company’s most recent report claims an efficacy rate of 91.3 for its vaccine. But there, too, the group found that, when compared to the initial placebo group, there has also been an “increase in illness and death” despite the vaccine, thus, “there is no benefit to a reduction in cases if it comes at the cost of increased sickness and death.”\n\nAnd mind you, all of the Canadian group’s findings come straight from Pfizer‘s own reporting; they are not random conclusions based on hunches or suspicions.\n\nThe group found that Pfizer did not follow established research protocols when conducting its clinical trial. Specifically:\n\n— Emergency use was authorized after only two months’ worth of Phase II/III trials.\n\nAlso, Pfizer used misleading demographics and the wrong target population.\n\n“When designing a trial for the efficacy and safety of a potential treatment, the focus should be on the target population who could most benefit from that treatment,” the group noted. “Instead Pfizer chose participants from younger demographic that would be a) less likely to need a vaccine, b) less likely to suffer an adverse event during a trial, c) more likely to respond well to a vaccine, as the elderly have comparatively poor immune responses.”\n\nThroughout the COVID-19 pandemic, researchers and experts have known that the virus afflicts younger, healthier people far less severely than older people and those with preexisting conditions.\n\nBut while roughly 95 percent of those who have died from COVID-19 had at least one co-morbidity listed as a cause of death — and the average is four co-morbidities — just one-in-five clinical trial participants, or around 21 percent, had a co-existing condition, according to the group.\n\nIn addition, the group found that Pfizer:\n\n— Used wrong clinical endpoints; did not focus on the question “Do people who take the vaccines have less illness and death than those who don’t?”\n\n— There was no testing of spread reduction, so there is no real justification for implementing ‘vaccine passports’.\n\n— “The Pfizer trials DID NOT test all participants for COVID-19,” meaning, “Asymptomatic infection would be missed entirely.”\n\n— The adolescent trial was extremely small and therefore nearly worthless; “Pfizer claimed these were great results, but since adolescents are at statistically 0% risk of death from COVID-19, and very low risk of severe illness, the inoculation is of little benefit to them. Instead, it presents a very real risk of adverse events.”\n\n— The vaccines appear to greatly increase cases of, or risk of, myocarditis.\n\nHere is the full video:\n\nStillness in the Storm Editor: Why did we post this?\n\nThe news is important to all people because it is where we come to know new things about the world, which leads to the development of more life goals that lead to life wisdom. The news also serves as a social connection tool, as we tend to relate to those who know about and believe the things we do. With the power of an open truth-seeking mind in hand, the individual can grow wise and the collective can prosper.\n\nNot sure how to make sense of this? Want to learn how to discern like a pro? Read this essential guide to discernment, analysis of claims, and understanding the truth in a world of deception: 4 Key Steps of Discernment – Advanced Truth-Seeking Tools.\n\nStillness in the Storm Editor’s note: Did you find a spelling error or grammatical mistake? Send an email to corrections@stillnessinthestorm.com, with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at sitsshow@gmail.com. Thank you for reading.", "opengraph": {"locale": "en_US", "type": "article", "title": "Stunning Video By Canadian Doctors Shows How Pfizer Committed Massive Fraud During Covid-19 Vaccine Trials", "description": "(JD Heyes) A group of Canadian doctors has painstakingly demonstrated how Pfizer committed monumental fraud in conducting rapid clinical trials of its COVID-19 vaccine as they present evidence refuting nearly all claims that the jab is safer and that getting one reduces the incidence and seriousness of the coronavirus.", "url": "https://stillnessinthestorm.com/2022/05/stunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials/", "site_name": "Stillness in the Storm", "article:publisher": "https://www.facebook.com/stillnessinthestorm", "article:published_time": "2022-05-16T14:01:32+00:00", "article:modified_time": "2022-05-05T14:38:55+00:00", "image": "https://stillnessinthestorm.com/wp-content/uploads/2022/05/Coronavirus-Covid-19-Pfizer-Vaccine-Syringe-Vial-1.jpg", "image:width": "805", "image:height": "453", "image:type": "image/jpeg"}, "tags": ["covid", "natural news", "news", "vaccine", "canada", "Pfizer", "video"], "tweets": [], "movies": [], "links": ["http://reddit.com/submit?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F05%2Fstunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials%2F&title=Stunning%20Video%20By%20Canadian%20Doctors%20Shows%20How%20Pfizer%20Committed%20Massive%20Fraud%20During%20Covid-19%20Vaccine%20Trials", "https://stillnessinthestorm.com/2022/05/stunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials/", "https://api.whatsapp.com/send?text=Stunning%20Video%20By%20Canadian%20Doctors%20Shows%20How%20Pfizer%20Committed%20Massive%20Fraud%20During%20Covid-19%20Vaccine%20Trials https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F05%2Fstunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials%2F", "https://gab.com/compose?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F05%2Fstunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials%2F&text=Stunning%20Video%20By%20Canadian%20Doctors%20Shows%20How%20Pfizer%20Committed%20Massive%20Fraud%20During%20Covid-19%20Vaccine%20Trials", "https://telegram.me/share/url?url=https%3A%2F%2Fstillnessinthestorm.com%2F2022%2F05%2Fstunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials%2F&text=Stunning%20Video%20By%20Canadian%20Doctors%20Shows%20How%20Pfizer%20Committed%20Massive%20Fraud%20During%20Covid-19%20Vaccine%20Trials", "https://stillnessinthestorm.com/2022/05/stunning-video-by-canadian-doctors-shows-how-pfizer-committed-massive-fraud-during-covid-19-vaccine-trials/", "https://www.naturalnews.com/author/jdheyes", "https://stillnessinthestorm.com/2022/05/did-you-know-that-putin-has-cancer/", "https://www.naturalnews.com/2022-05-01-stunning-video-shows-pfizer-committed-massive-fraud-vaccine-trials.html", "https://www.naturalnews.com/2022-05-01-stunning-video-shows-pfizer-committed-massive-fraud-vaccine-trials.html", "https://www.naturalnews.com/author/jdheyes", "https://stillnessinthestorm.com/health/", "https://thecovidworld.com/shocking-new-video-by-canadian-doctors-reveals-massive-fraud-in-pfizers-clinical-trials/", "https://stillnessinthestorm.com/health/", "https://www.naturalnews.com/2022-01-04-pfizer-ccp-partnership-covid-vaccine-passports-proud.html", "https://stillnessinthestore.com/product/dark-to-light-mental-focus/", "https://stillnessinthestorm.com/2018/10/4-key-steps-of-discernment-advanced-truth-seeking-tools/", "https://www.naturalnews.com/2022-05-01-stunning-video-shows-pfizer-committed-massive-fraud-vaccine-trials.html"], "authors": ["Stillness in the Storm"], "publish_date": "2022-05-16T14:01:32+00:00"}