{"result_id": "280011", "URL": "https://sustainablepulse.com/2013/05/15/author-chris-kanthan-people-are-rising-against-monsanto-all-over-the-world/", "timestamp": "2023-04-25 17:12:05 CEST+0200", "meta": {"description": "Sustainable Pulse Exclusive Interview with Chris Kanthan, author of Deconstructing Monsanto. Chris Kanthan lives in the San Francisco Bay Area, has", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2013/05/15/author-chris-kanthan-people-are-rising-against-monsanto-all-over-the-world/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Author Chris Kanthan: People Are Rising against Monsanto All Over the World", "cleaned_text": "Chris Kanthan lives in the San Francisco Bay Area, has traveled to more than 30 countries, and deeply cares about politics, finance and food. He has degrees in Physics and Engineering with a minor in Economics (and, just for fun, a diploma in Paralegal). He can be reached at [email protected].\n\nWhat started your interest in GMOs and Monsanto?\n\nTo paraphrase the Grateful Dead, it’s been a long strange trip. I used to travel a lot for work, and I found myself carrying a lot of over-the-counter (OTC) medications all the time. Even though I would eat at nice restaurants, my stomach was always upset. I would catch a cold or flu easily, my back would hurt and my stamina was low.\n\nFour years ago, I started doing research on the internet. I started with the mainstream, “official” sites like National Library of Medicine, National Institutes of Health and WebMd. Very soon, I found a lot of strange phenomenon in these sites, especially when it came to plants, vegetables, fruits, herbs and spices. For example, on Turmeric, they quote a report—without a link—where one person might have had a bad reaction to turmeric. Really? I thought I might as well be reading a website on UFOs. Also, for every single plant product, the sites were always quite sure about the side effects, but were never sure about the benefits. Without fail, they had copy pasted the following lines in page after page: More evidence is needed to rate <name of the plant/herb/spice> for these uses. It was clear that the official story that was being fed to us was flawed.\n\nTo make the long story short, I did a lot of research, learned about GMOs and processed food, experimented a lot with food, and within a couple of months, got rid of all my ailments. For example, turmeric replaced my painkillers, and ginger replaced Pepto-Bismol. My immune system is also much stronger now—I haven’t gotten sick in more than three years (no flu vaccines either). In the same time period, I haven’t spent a penny on OTC drugs.\n\nThe next logical question was, if the truth about health can be so simple, why isn’t everybody talking about it? Why aren’t doctors—at least in the U.S.—learning anything about nutrition? That’s what led me to the discovery of how politics and profits have taken over our healthcare system and the food industry. And who sits on the top of the food chain? Monsanto.\n\nFinally, Prop 37 and March against Monsanto helped me connect with some really awesome people. The passion and the dedication of these men and women inspired me to learn and do my part in spreading the message.\n\nYour book Deconstructing Monsanto is based on a conversation between two people – why did you choose this method?\n\nGMO technology is a very difficult topic to read about. I have bought big books on GMO that quickly put me to sleep. Therefore, I wanted to write something that has an easy flow, and feels a little bit like a short story. The conversational style also let me address the questions and objections that many people might have. So far, based on the readers’ feedback, it seems to have worked.\n\nGMO labeling is becoming a serious issue of public interest in the US – is Monsanto worried?\n\nPeople are rising against Monsanto all over the world. Five million Brazilian farmers have sued them and won the first round in the courts. The European Union is taking a strong stance against pesticides. In the U.S., Prop 37 in California came very close to passing; there are GMO bills being considered in states across the U.S., from Vermont to Oregon. More and more people are switching to local, organic food; the number of farmer’s markets across the U.S. is growing rapidly. The social media is energized, brimming with energy, and groups like Sustainable Pulse are striking at the roots of Monsanto. So, yes, Monsanto must be worried!\n\nMonsanto has become a worldwide power, is there really a way of ‘deconstructing’ them?\n\nEven the most powerful corporation has an Achilles heel—it needs customers. For example, if people stopped eating at McDonald’s even for just a month, imagine the effect on McDonald’s shares, supply chain etc. They might even go bankrupt. We have the power, for sure. But we have to educate and mobilize people. The scariest thing is that GMO is unlike any other technology. We are dealing with self-replicating and self-propagating living entities—sort of like a virus. Also, once we have lost certain species of plants or animals, there is no way to get them back. Hence, the urgency to act is upon all of us.\n\nDespite the large amount of scientific research that has been peer-reviewed and published, the Government regulatory bodies have not taken any action, why?\n\nHow can they act when they are filled with former employees of Monsanto? Even if you made a movie about the blatant corruption that is prevalent in the U.S. regulatory bodies, people would laugh it off, saying that it is too far-fetched. Obama has been a huge disappointment in this matter as well. However, the American system is really controlled by corporations these days, and what the politicians can accomplish is very limited. It’s up to the people to get involved and rise up.\n\nHow would you like your writing to change the way people in the US look at their own food system?\n\nThe acronym for what we eat in the U.S. is S.A.D.—Standard American Diet. We eat things that look, smell and taste like food, but they are not really food. Fake food has replaced real food. Our food is deluged with chemicals and “stuff” with no nutritional value. I hope that my book will encourage people to, first of all, avoid GMOs and start eating organic food. But, I also hope that it will encourage people to start on their own personal journeys of discovering the wonders of nature, food and healthy living.\n\nWhat is your personal message to Monsanto?\n\nFigure out a way to make money while making the planet better for your children and grandchildren.", "opengraph": {"locale": "en_US", "type": "article", "title": "Author Chris Kanthan: People Are Rising against Monsanto All Over the World", "description": "Sustainable Pulse Exclusive Interview with Chris Kanthan, author of Deconstructing Monsanto. Chris Kanthan lives in the San Francisco Bay Area, has", "url": "https://sustainablepulse.com/2013/05/15/author-chris-kanthan-people-are-rising-against-monsanto-all-over-the-world/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2013-05-15T14:48:03+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/Egypt.jpg", "image:width": "2048", "image:height": "1536"}, "tags": ["Deconstructing Monsanto", "gmos", "Chris Kanthan", "evidence", "Monsanto", "US", "GMO", "Sustainable Pulse"], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection#2a494258435941181a1a1a6a534b42454504494547", "http://www.nlm.nih.gov/medlineplus/druginfo/natural/662.html", "http://www.carighttoknow.org/", "http://www.march-against-monsanto.com/"], "authors": [], "publish_date": "2013-05-15T14:48:03+00:00"}