{"result_id": "280023", "URL": "https://sustainablepulse.com/2016/09/30/oxitec-admits-gm-mosquitoes-could-result-in-population-boom-of-disease-carrying-asian-tiger-mosquito/", "timestamp": "2023-04-25 17:12:24 CEST+0200", "meta": {"description": "Genetically modified (GM) mosquito company Oxitec has admitted a major risk of its technology – reducing one mosquito species may increase the numbers of", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2016/09/30/oxitec-admits-gm-mosquitoes-could-result-in-population-boom-of-disease-carrying-asian-tiger-mosquito/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Oxitec Admits GM Mosquitoes Could Result in Population Boom of Disease Carrying Asian Tiger Mosquito", "cleaned_text": "Genetically modified (GM) mosquito company Oxitec has admitted a major risk of its technology – reducing one mosquito species may increase the numbers of a second disease-carrying species.\n\nThe information surfaced Friday when four environment and food safety groups including International Center for Technology Assessment, GeneWatchUK, Food and Water Watch and Friends of the Earth released court documents from the Cayman Islands. Oxitec, a subsidiary of Intrexon, applied for trial releases of its GM mosquito, which, according to the new information, would be inefficient and risky.\n\nOxitec previously denied that releasing millions of GE Aedes aegypti mosquitoes, with the aim of suppressing wild mosquito numbers, would result in increased numbers of the Aedes albopictus species (known as the Asian Tiger mosquito). The Aedes albopictus also transmits viral tropical diseases such as dengue and zika, and recently has been shown to be a vector of chikungunya, a devastating and sometimes lethal viral disease. The FDA recently approved trial releases of the GE mosquitoes in Florida.\n\n“These court documents show that Oxitec’s GM mosquito trials are not worth the risk. The State of Florida and its mosquito control boards have in the past effectively controlled disease from multiple mosquito species using much more benign approaches such as vaccines, screens, repellents, larvicides and removing breeding sites like abandoned tires,” said Jaydee Hanson, policy director of the International Center for Technology Assessment.\n\nThis new evidence from the Cayman Islands highlights that Oxitec is aware of a major flaw in its single-species, technological approach to eradicating disease-carrying mosquitoes. Oxitec makes clear that the release of the GE Asian Tiger mosquito Aedes albopictus might be needed if the release of the GE Aedes aegypti results in an increase of the numbers of Asian Tiger mosquitoes. Oxitec’s 2014 application to the Cayman Islands Department of Environment states, “Should Aedes albopictus begin to occupy the Aedes aegypti niche upon reduction in their numbers, a concurrent operation will begin to reduce the numbers of Aedes albopictus”.\n\n“It might be a good business model for a company to sell a technology to reduce one mosquito species, so then they can also sell a technology to deal with the species that replaces it,” said Wenonah Hauter, executive director of Food & Water Watch. “But it’s not worth the effort, expense and potential risk for communities in the U.S. to start down this path.”\n\nAedes albopictus is a more invasive species than Aedes aegypti and can be found in all east coast U.S. states from Maine to Florida, all southern states, most Midwestern states and in the states along the US-Mexico border from Texas west to California.\n\n“Current permits for releases should now be revoked until regulators recognise the downsides of Oxitec’s technology and the need to consider all the impacts on the ecosystem. The consequences of mass releases of GM mosquitoes could be harmful if other disease-carrying mosquito species move in as a result. Risk assessments in Brazil, the Cayman Islands and the USA need to be revised,” said Dr. Helen Wallace, director of GeneWatch UK.\n\nThe company has also previously hid information about the mosquito’s potential to survive. Company data noted that 15 to 18% of its GM mosquitoes survive when fed on cat food containing industrially farmed chicken, which contains the antibiotic tetracycline. Environmental groups have warned that this could lead to the survival and spread of large numbers of GM mosquitoes, when they encounter this common antibiotic in the environment e.g. in discarded takeaways or septic tanks.\n\n“Oxitec has misled the public about the risks. These GM mosquitoes may thrive in the wild or may lead to an increase in more aggressive mosquito populations,” said Dana Perls, senior food and technology campaigner with Friends of the Earth, U.S. “We should be using the least toxic alternatives that don’t have unintended consequences for our environment and health.”\n\nFlorida Keys residents will have a non-binding vote on whether they support the release of Oxitec’s genetically engineered Aedes aegypti mosquitoes on November 8, 2016. A separate but related vote will occur in Key Haven, Florida, where Oxitec has received permission from the Food and Drug Administration to release its GM Aedes aegypti mosquitoes in the first U.S. trial. Residents of Key Haven have strongly opposed the release of these mosquitoes.", "opengraph": {"locale": "en_US", "type": "article", "title": "Oxitec Admits GM Mosquitoes Could Result in Population Boom of Disease Carrying Asian Tiger Mosquito", "description": "Genetically modified (GM) mosquito company Oxitec has admitted a major risk of its technology – reducing one mosquito species may increase the numbers of", "url": "https://sustainablepulse.com/2016/09/30/oxitec-admits-gm-mosquitoes-could-result-in-population-boom-of-disease-carrying-asian-tiger-mosquito/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2016-09-30T11:49:35+00:00", "article:modified_time": "2016-09-30T11:53:48+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2016/09/asiantigermosquito.jpg", "image:width": "620", "image:height": "571"}, "tags": ["information", "Cayman Islands", "Food Water Watch", "risk", "technology", "GM", "Asian Tiger"], "tweets": [], "movies": [], "links": ["https://urldefense.proofpoint.com/v2/url?u=http-3A__link.email.dynect.net_link.php-3FDynEngagement-3Dtrue-26H-3DtiMleQXvuhG3cVWUKKJFwgesMDniOk1PHbBHFzJ47RvswGZJi6d6eYSLN5kaLx-252BBjvOHxN8GsSQ-252BVdEng5TJq-252BGCDCpt1yzRBE-252FJmL5tP2G2qEUQYsOcmA-253D-253D-26G-3D0-26R-3Dhttp-253A-252F-252Fwww.centerforfoodsafety.org-252Ffiles-252F2014-2Dapplication-2Dto-2Ddoe-2D3-5F97611.pdf-26I-3D20160929120008.0000018ca4a3-2540mail6-2D08-2Dewr-26X-3DMHwxMDQ2NzU4OjU3ZWMzODQ4NzNhZjRjNTY5MjU1YTMxYjs-253D-26S-3D7dEZvoNdHI4rA4y1zQmcf7cmyoUwp86GDdbl-2DYIlMBE&d=DQMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=zOqm1df3aheLkzYcO6_4F5kxFZGf07kYZywzSz_h8eg&m=Bvp6-zevi7XzOFEJUTkLl6RllwB4ib8756RCpi5fk_k&s=xChgxq-XvrDjroPN1lzwg2xWr18zeniSi0u5TlcJox0&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__link.email.dynect.net_link.php-3FDynEngagement-3Dtrue-26H-3DtiMleQXvuhG3cVWUKKJFwgesMDniOk1PHbBHFzJ47RvswGZJi6d6eYSLN5kaLx-252BBjvOHxN8GsSQ-252BVdEng5TJq-252BGCDCpt1yzRBE-252FJmL5tP2G2qEUQYsOcmA-253D-253D-26G-3D0-26R-3Dhttp-253A-252F-252Fwww.cdc.gov-252Fzika-252Fvector-252Frange.html-26I-3D20160929120008.0000018ca4a3-2540mail6-2D08-2Dewr-26X-3DMHwxMDQ2NzU4OjU3ZWMzODQ4NzNhZjRjNTY5MjU1YTMxYjs-253D-26S-3Dx-5FUh-2DGUgVWHp3-5FM8r-5FZAiR3dd24-5FqInzfQRGV22mbUU&d=DQMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=zOqm1df3aheLkzYcO6_4F5kxFZGf07kYZywzSz_h8eg&m=Bvp6-zevi7XzOFEJUTkLl6RllwB4ib8756RCpi5fk_k&s=nou5aDf-mt1547jMeHkHFtfrgFc_X77qNorvUhspgOw&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__link.email.dynect.net_link.php-3FDynEngagement-3Dtrue-26H-3DtiMleQXvuhG3cVWUKKJFwgesMDniOk1PHbBHFzJ47RvswGZJi6d6eYSLN5kaLx-252BBjvOHxN8GsSQ-252BVdEng5TJq-252BGCDCpt1yzRBE-252FJmL5tP2G2qEUQYsOcmA-253D-253D-26G-3D0-26R-3Dhttp-253A-252F-252Fwww.foe.org-252Fnews-252Farchives-252F2012-2D01-2Dgenetically-2Dmodified-2Dmosquitoes-2Dsurvival-2Drate-26I-3D20160929120008.0000018ca4a3-2540mail6-2D08-2Dewr-26X-3DMHwxMDQ2NzU4OjU3ZWMzODQ4NzNhZjRjNTY5MjU1YTMxYjs-253D-26S-3Di-5FZvnRgsNvLlQPWM27IyFMMog0-5F-5FVnvNlLmFSc6Fu0M&d=DQMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=zOqm1df3aheLkzYcO6_4F5kxFZGf07kYZywzSz_h8eg&m=Bvp6-zevi7XzOFEJUTkLl6RllwB4ib8756RCpi5fk_k&s=hPrnyfBEg9_Au_MCwb7LSwN_2mSjy0lto7OQ391iPhk&e="], "authors": [], "publish_date": "2016-09-30T11:49:35+00:00"}