{"result_id": "280017", "URL": "https://sustainablepulse.com/2018/05/22/monsanto-in-epic-fail-with-attempted-attack-on-global-glyphosate-study/", "timestamp": "2023-04-25 17:12:15 CEST+0200", "meta": {"description": "The peer-reviewed accepted manuscripts from the pilot phase of the Global Glyphosate Study were revealed last Wednesday in a Press Conference at the", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2018/05/22/monsanto-in-epic-fail-with-attempted-attack-on-global-glyphosate-study/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Monsanto in Epic Fail with Attempted Attack on Global Glyphosate Study", "cleaned_text": "The peer-reviewed accepted manuscripts from the pilot phase of the Global Glyphosate Study were revealed last Wednesday in a Press Conference at the European Parliament.\n\nThe results of the short-term pilot study showed that glyphosate-based herbicides (GBHs) were able to alter certain important biological parameters in rats, mainly relating to sexual development, genotoxicity and the alteration of the intestinal microbiome, at the ‘safe’ level of 1.75 mg/kg/day set by the U.S. Environmental Protection Agency (EPA).\n\nAs is normal practice for Monsanto, their Public Relations department was soon in action to try and crush the scientists involved and the study results, which could cause major damage to the product that supports their whole business model – the glyphosate-based herbicide Roundup.\n\nHowever, this time their PR campaign against the Study was only met with contempt and disdain from journalists, politicians, scientists and the public in countries across Europe.\n\nMonsanto’s epic fail began with their comments in The Guardian newspaper:\n\nScott Partridge, Monsanto’s VP for global strategy told the Guardian: “The Ramazzini Institute is an activist organisation with an agenda that they have not disclosed as part of their crowdfunding efforts. They wish to support a ban on glyphosate and they have a long history of rendering opinions not supported by regulatory testing agencies.”\n\nThere are many things that are ‘interesting’ about Scott Partridge’s comment:\n\nThe excellent Guardian article was mainly discussing a study on the microbiome of the rats, hence the title: “Glyphosate shown to disrupt microbiome ‘at safe levels’, study claims”. This study was actually carried out at Icahn School of Medicine at Mount Sinai in New York on samples provided by The Ramazzini Institute.\n\nThe truth is that Monsanto has never been faced with an independent study on glyphosate and glyphosate-based herbicides, in which multiple Institutions and Universities are involved. They are used to attacking one single scientist or a small institution.\n\nThe Global Glyphosate Study involves The Ramazzini Institute, the University of Bologna (Faculty of Agriculture, Veterinary Science and Biostatistics) the Genoa Hospital San Martino, the Italian National Institute of Health, the Icahn School of Medicine at Mount Sinai in New York and the George Washington University.\n\nMonsanto have now shown that they will struggle to attack this group of well-respected Institutions!\n\nMonsanto’s Mr. Partridge was obviously having a bad day, as he also suggested that “The Ramazzini Institute is an activist organization”. This could not be further from the truth. In fact they are expert scientists who have been protecting public health for over 40 years.\n\nThe activities of the Ramazzini Institute (RI) focus primarily on the experimental identification and quantification of carcinogenic risks and on the evaluation of the efficacy and safety of drug therapies and active ingredients that may be used to prevent the development and/or progression of cancer.\n\nThe Ramazzini Institute’s long-term studies on Formaldehyde, Vinyl Chloride and Benzene, amongst others have led to global regulatory change on these chemicals.\n\nThe RI study design closely mirrors the human condition, in which persons may be exposed to agents in all phases of life for varying lengths of time. A distinctive characteristic of most RI carcinogenicity studies is that rodents are treated from prenatal life and kept under observation until natural death or at least 130 weeks of age. This lifespan protocol is in contrast with most laboratories where rodents are treated starting from adulthood and sacrificed at 110 weeks of age (representing about 2/3 of the lifespan) and corresponding to 60-65 years in humans. This practice means that the researchers miss a significant proportion of cancers induced by early exposure during pregnancy and that might show up in old age.\n\nSorry Mr. Partridge and Monsanto, you cannot change the truth!\n\nEpic Fail #3: Monsanto claims no link between glyphosate and cancer…off topic\n\nMonsanto’s Mr. Partridge continued by telling the Guardian; “All the research to date has demonstrated that there is no link between glyphosate and cancer.”\n\nDoes this not seem to be a bit off topic Mr. Partridge? There is no suggestion in the short-term studies, which he was being asked about, that glyphosate is linked to cancer.\n\nHowever, if Monsanto really want to bring up this topic, we would suggest they have a chat to the International Agency for Research on Cancer (IARC), who classified glyphosate as a “probable human carcinogen” in 2015.\n\nOh…..I forgot they are currently also trying to campaign against IARC too, including an attempt to stop the U.S. government from funding the Agency. I wonder why that is…..\n\nIt is time that we all stop Monsanto in their tracks and support the Global Glyphosate Study, which is being funded by the public worldwide. You can help them by donating here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Monsanto in Epic Fail with Attempted Attack on Global Glyphosate Study", "description": "The peer-reviewed accepted manuscripts from the pilot phase of the Global Glyphosate Study were revealed last Wednesday in a Press Conference at the", "url": "https://sustainablepulse.com/2018/05/22/monsanto-in-epic-fail-with-attempted-attack-on-global-glyphosate-study/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2018-05-21T22:43:59+00:00", "article:modified_time": "2018-05-22T16:02:35+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2015/12/Monsanto.jpg", "image:width": "840", "image:height": "485"}, "tags": ["Epic Fail", "cancer", "European Parliament", "development", "New York", "Scott Partridge", "time"], "tweets": [], "movies": [], "links": ["https://glyphosatestudy.org/global-glyphosate-study-pilot-phase/", "http://web.ep.streamovations.be/index.php/event/stream/20180516-1030-special-presser ", "https://glyphosatestudy.org/press-release/global-glyphosate-study-pilot-phase-shows-adverse-health-effects-at-safe-doses/", "https://www.theguardian.com/environment/2018/may/16/glyphosate-shown-to-disrupt-microbiome-at-safe-levels-study-claims", "https://glyphosatestudy.org/about-us/", "https://usrtk.org/pesticides/how-monsanto-manufactured-outrage-at-iarc-over-cancer-classification/", "https://glyphosatestudy.org/"], "authors": [], "publish_date": "2018-05-21T22:43:59+00:00"}