{"result_id": "280005", "URL": "https://sustainablepulse.com/2015/09/30/american-academy-of-pediatrics-cuts-ties-with-monsanto/", "timestamp": "2023-04-25 17:11:54 CEST+0200", "meta": {"description": "Months ago Mamavation learned that the American Academy of Pediatrics was in a sponsorship relationship with Monsanto, a chemical company and makers of", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2015/09/30/american-academy-of-pediatrics-cuts-ties-with-monsanto/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "American Academy of Pediatrics Cuts Ties with Monsanto", "cleaned_text": "Months ago Mamavation learned that the American Academy of Pediatrics was in a sponsorship relationship with Monsanto, a chemical company and makers of DDT, PCBs, Agent Orange, glyphosate & GMOs. In fact, Monsanto has been deemed the 3rd most hated company in the United States by the Harris Poll this year measuring “reputation quotient” which basically means how people feel about them. Baffled by this relationship, Mamavation founder Leah Segedie contacted the AAP through a close friend and colleague and was put in touch with their Public Affairs team.\n\n“I was completely shocked that the American Academy of Pediatrics, an organization that moms put their trust in at some of the most vulnerable times in their lives was associating with a company that didn’t elicit trust at all. I knew this association was potentially damaging to the AAP and that Monsanto was getting far more out of it than pediatricians ever would. And it puzzled me that this type of unholy alliance would have ever been allowed, so I contacted them and was very honest and candid about what Monsanto represents to moms. And after a couple of months they got back to me right before ShiftCon Social Media Conference so I could announce to the entire eco-wellness blogging community that weekend,” said Ms. Segedie.\n\nMonsanto has seemed to have a bad year. The World Health Organization categorized glyphosate, the active ingredient in Roundup which is sprayed on over 78% of genetically engineered crops and 200 additional crops, a probable carcinogen. And months following that announcement, the California Environmental Protection Agency announced their intention of placing glyphosate on their carcinogen list which means it comes with a Prop. 65 warning on the label. From all of these setbacks, it seems Monsanto has lost control of the political spin. But in our nation’s capital, another battleground has formed. The House has just passed H.R. 1599 dubbed as the “Deny Americans the Right to Know Act” or the DARK Act, which prevents genetically engineered ingredients from ever being labeled by any state in the United States. With Vermont’s labeling laws going into effect next year, this could pose a big problem for mandatory labeling. The U.S. Senate is now considering taking up this issue and no one knows what will happen.\n\nBut Monsanto has not been the only company that has seen controversy this year. The vaccination debate has raged in communities all over the United States after a Measles outbreak in Orange County, California. California also passed legislation forcing children attending public schools to be vaccinated, which has sparked outrage in certain wellness communities and has made AAP very sensitive to anything that would damage their reputation with mothers. “I feel like they are struggling with their image right now and want to show moms they are trustworthy. And they are willing to prove themselves by shedding relationships that may not be helping them. And at the very least, shedding relationships where it’s uneven. Monsanto was definitely getting far more out of that one than they were. I don’t think they struggled with it at all. It may have felt like dumping a bad boyfriend that never calls.”\n\nAnd that wasn’t the only company she expressed concern about, Coca Cola was also a sponsor Segedie had some major reservations about. Coca Cola has given The American Academy of Pediatrics over $3 million dollars over the past 6 years. “Standing next to sugary soda at a time when childhood obesity and Type 2 Diabetes rates were going through the roof seemed oxymoronic at the very least. And during that first meeting, they expressed to me that Coke was gone. That told me right away they were concerned about image and were taking these concerns by mothers VERY seriously.”\n\nThe AAP kept in touch with Ms. Segedie over those months ensuring her that her concerns were being addressed and they were meeting about them behind closed doors. And just before she was about to host the 2nd annual ShiftCon Social Media Conference, she got a phone call from their Public Affairs Team to tell her the good news–the American Academy of Pediatrics is severing ties with Monsanto at the end of the year. “They made sure to tell me right before the conference so I could announce it on the stage to all the eco-wellness and mom bloggers there. I’m overjoyed they made this decision and am very excited to continue this relationship with them. I think we are all turning a corner…pediatricians, moms, food companies and social media. As long as we put our priorities on the health of our children and communities, things are going to keep getting better.”", "opengraph": {"locale": "en_US", "type": "article", "title": "American Academy of Pediatrics Cuts Ties with Monsanto", "description": "Months ago Mamavation learned that the American Academy of Pediatrics was in a sponsorship relationship with Monsanto, a chemical company and makers of", "url": "https://sustainablepulse.com/2015/09/30/american-academy-of-pediatrics-cuts-ties-with-monsanto/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2015-09-30T14:17:23+00:00", "article:modified_time": "2015-09-30T14:23:21+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2015/09/Pediatrician.jpg", "image:width": "640", "image:height": "480"}, "tags": ["AAP", "Monsanto", "crops", "glyphosate", "children", "moms", "United States"], "tweets": [], "movies": [], "links": ["http://www.mamavation.com/2015/09/the-american-academy-of-pediatrics-cuts-ties-with-monsanto.html", "https://www.aap.org/en-us/Pages/Default.aspx", "http://www.monsanto.com/pages/default.aspx", "http://www.mamavation.com/2015/09/the-american-academy-of-pediatrics-cuts-ties-with-monsanto.html", "http://www.mamavation.com/2015/09/the-american-academy-of-pediatrics-cuts-ties-with-monsanto.html", "http://www.shiftconmedia.com/", "http://www.reuters.com/article/2015/03/20/us-monsanto-roundup-cancer-idUSKBN0MG2NY20150320", "http://ecowatch.com/2015/09/08/california-becomes-first-state-to-label-monsantos-roundup-as-a-carcinogen/", "http://civileats.com/2015/07/20/5-things-to-know-about-the-dark-act/", "http://www.cbsnews.com/news/measles-outbreaks-new-york-orange-county-spotlight-risks-even-for-vaccinated/", "http://well.blogs.nytimes.com/2015/09/28/coke-spends-lavishly-on-pediatricians-and-dietitians/?_r=0", "http://www.shiftconmedia.com/"], "authors": [], "publish_date": "2015-09-30T14:17:23+00:00"}