{"result_id": "280021", "URL": "https://sustainablepulse.com/2014/07/08/brazil-announces-dengue-fever-emergency-gm-mosquito-trials-region/", "timestamp": "2023-04-25 17:12:21 CEST+0200", "meta": {"description": "Civil society groups today expressed alarm at an increase in dengue incidence, leading to an emergency decree, in a town in Brazil where releases of genetically modified (GM) mosquitoes are taking place.", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2014/07/08/brazil-announces-dengue-fever-emergency-gm-mosquito-trials-region/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Brazil Announces Dengue Fever Emergency in GM Mosquito Trials Region", "cleaned_text": "Civil society groups today expressed alarm at an increase in dengue incidence, leading to an emergency decree, in a town in Brazil where releases of genetically modified (GM) mosquitoes are taking place.\n\nThe promise was to create genetically modified mosquitoes that would end dengue, but results from field trials conducted in Bahia, Brazil have not been published to date and did not evaluate the relation between Aedes aegypti mosquito populations and the occurrence of dengue [1]. Nevertheless, the Brazilian regulator Comissão Técnica Nacional de Biossegurança (CTNBio) recently gave the green light to the commercialization of the technology proposed by Moscamed Brazil in partnership with the English company Oxitec and the Universidade de São Paulo.\n\nThe Brazilian press had welcomed the new weapon to combat dengue but missed the information that Jacobina’s mayor, a locality where the trials took place, issued a decree in February 2014 renewing the state of emergency “due to the abnormal situation characterized as a biological disaster of dengue epidemic.” [2]. Before that, Moscamed had announced 81% and 100% reduction in the number of Aedes aegypti mosquitoes in at least two localities of Jacobina, claiming that this meant the experiments were a success [3]. According to Oxitec, pilot-scale releases started in the north-west of Jacobina in June 2013 and the programme will roll out across the entire city over two or three years [4].\n\nDuring the evaluation of the commercial application for the release of the GM mosquito, a CTNBio member had presented a report with information questioning the impact of the GM mosquitoes on the incidence of dengue and warning that in some circumstances the releases could make the disease worse, even if the number of wild Aedes aegypti mosquitoes was reduced. The concerns raised did not convince the majority of the Commission. The Brazilian National Agency of Sanitary Vigilance (ANVISA) is now in charge of registering and monitoring the product, which according to the company’s recommendation implies weekly releases of 10 million GM mosquitoes for every 50 thousand inhabitants. Meanwhile, the date of publication of the promised results remains unclear.\n\nBrazilian and international civil society organisations, including AS-PTA, Third World Network, RALLT (Network for a GM Free Latin America) and GeneWatch UK, today called on ANVISA to require Oxitec to publish the results of its experiments in a scientific journal and to cease further experiments and the commercial use of this technology until it has assessed the effects on the incidence of dengue and put an effective monitoring programme for the disease in place.\n\n“CTNBio should review its decision to approve commercialization in light of the reality seen in Jacobina and ask for further serious studies on the full implications of releasing the GM mosquito over the local population” said Gabriel Fernandes, from AS-PTA, Brazil.\n\n“Oxitec is knocking on the doors of many countries, promoting its GM mosquitoes as being able to address the serious threat of dengue. Yet, with no concrete proof that this technology is able to reduce dengue incidence, any approval of the GM mosquitoes would be grossly premature,” said Lim Li Ching, Senior Researcher at Third World Network.\n\n“It is extraordinary that experiments with Oxitec’s GM mosquitoes continue and commercial releases have even been approved without any monitoring of the effect on dengue”, said Dr Helen Wallace, Director of GeneWatch UK “The declaration of a dengue emergency in Jacobina should be a wake-up call for the authorities”.\n\n[1] Reducing the numbers of mosquitoes does not necessarily reduce the incidence of disease as the number of mosquitoes needed to transmit the disease is low. Further, the targetted mosquitoes may simply move to another area and/or a different species of mosquito (Aedes albopictus) which also transmits dengue can move into the area. Complex immune responses to the four types of dengue virus mean that a partial reduction in mosquito numbers can reduce cross-immunity to the different serotypes and increase the number of cases of the severe form of the disease, Dengue Haemorrhagic Fever, which is more likely to be fatal. Success in reducing illness in young children can also mean more delayed and serious cases of dengue. See for example: Thavara, U., Tawatsin, A., & Nagao, Y. (2014). Simulations to compare efficacies of tetravalent dengue vaccines and mosquito vector control. Epidemiology & Infection, 142(06), 1245–1258. journals.cambridge.org/download.php?file=%2FHYG%2FHYG142_06%2FS0950268813001866a.pdf&code=41e23427121b1dfb559d97c60a9e14 6d", "opengraph": {"locale": "en_US", "type": "article", "title": "Brazil Announces Dengue Fever Emergency in GM Mosquito Trials Region", "description": "Civil society groups today expressed alarm at an increase in dengue incidence, leading to an emergency decree, in a town in Brazil where releases of genetically modified (GM) mosquitoes are taking place.", "url": "https://sustainablepulse.com/2014/07/08/brazil-announces-dengue-fever-emergency-gm-mosquito-trials-region/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2014-07-08T14:20:27+00:00", "article:modified_time": "2014-07-08T14:22:53+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2014/01/gm-mosquitoes.jpeg", "image:width": "530", "image:height": "297"}, "tags": ["information", "increase", "today", "Third World Network", "technology", "GM", "Moscamed Brazil"], "tweets": [], "movies": [], "links": ["http://journals.cambridge.org/download.php?file=%2FHYG%2FHYG142_06%2FS0950268813001866a.pdf&code=41e23427121b1dfb559d97c60a9e146d", "http://aspta.org.br/wp-content/uploads/2014/05/Decreto-Jacobina2014.pdf", "http://g1.globo.com/ciencia-e-saude/noticia/2014/04/brasil-libera-producao-de-inseto-transgenico-que-combate-dengue.html", "http://www.oxitec.com/wpcms/wp-content/uploads/OXITEC-Dengue-booklet1.pdf"], "authors": [], "publish_date": "2014-07-08T14:20:27+00:00"}