{"result_id": "280009", "URL": "https://sustainablepulse.com/2013/11/21/uk-government-support-monsanto-civil-groups-eu-court/", "timestamp": "2023-04-25 17:12:02 CEST+0200", "meta": {"description": "The UK Government has confirmed that it will support Monsanto in a European court case brought by European civil society groups.", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2013/11/21/uk-government-support-monsanto-civil-groups-eu-court/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "UK Government Set to Support Monsanto in EU Court", "cleaned_text": "The UK Government has confirmed that it will support Monsanto in a European court case brought by European civil society groups. In a written Parliamentary Answer today, Earl Howe stated that the Government will intervene in the European Court of Justice to support the biotechnology giant, which wishes to import a GMO soy variety called Intacta into the EU for food and feed uses.\n\nCivil society groups (including ENSSER, Testbiotech, the Foundation on Future Farming, and the German Family Farmers Association) filed a lawsuit in March 2013, claiming that the European Food Safety Authority (EFSA) had recommended approval for the “stacked” GMO variety without carrying out proper risk assessments as required by law.\n\nThe variety is a complex one, containing traits for producing its own toxins and also providing resistance the Monsanto’s Roundup herbicide. However, in spite of Intacta’s potential for introducing novel proteins and unique toxic effects into the animal and human food supply, EFSA did not insist on any safety or animal feeding studies prior to approval, so its real health effects are completely unknown.\n\nEcological organizations are also deeply concerned about the new GMO soy, because of its potential for inflicting considerable damage in sensitive ecosystems.\n\nSpeaking on behalf of GM-Free Cymru, Dr Brian John said: “This decision marks the end of the UK Government’s neutral stance on GMOs, which has been maintained for more than 20 years by previous governments. We know that Environment Secretary Owen Paterson has been conducting a one-man campaign of disinformation on GMOs for many months now, flagging up the Government’s support for the biotechnology industry and its complete disregard for the Precautionary Principle. But this is the first time it has got into bed with Monsanto, and has signaled its intent to side with the least-trusted corporation on the planet in a court case brought by citizens’ groups. It is the only member state to have done this — all of the others have decided to keep their distance, for obvious reasons.\n\n“So the Government is going to waste taxpayers money to participate in a court case in support of a hated industrial giant, arguing for the import of a GMO variety that nobody wants and nobody needs. There is great public antipathy towards GMOs in this country, and the Government knows it. We are sure it is also acting against the interests of the devolved administrations of Scotland, Ireland and Wales, all of whom have a much more measured and cautious approach to GMO matters. Finally, and perhaps most outrageously of all, Earl Howe pretends in his Parliamentary Answer that the Government has “a strong interest in the science-based system” when its real objective is to break down the system of science-based GMO assessments and to open the floodgates to untested and dangerous GMO products from the United States in particular.”", "opengraph": {"locale": "en_US", "type": "article", "title": "UK Government Set to Support Monsanto in EU Court", "description": "The UK Government has confirmed that it will support Monsanto in a European court case brought by European civil society groups.", "url": "https://sustainablepulse.com/2013/11/21/uk-government-support-monsanto-civil-groups-eu-court/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2013-11-21T19:22:08+00:00", "article:modified_time": "2013-11-21T20:58:31+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2013/11/Owen-Paterson-008.jpg", "image:width": "460", "image:height": "276"}, "tags": ["EU", "Monsanto", "European", "support", "court", "GMO", "UK"], "tweets": [], "movies": [], "links": ["http://www.gmfreecymru.org/"], "authors": [], "publish_date": "2013-11-21T19:22:08+00:00"}