{"result_id": "280010", "URL": "https://sustainablepulse.com/2015/04/10/brazils-national-cancer-institute-names-gm-crops-as-cause-of-massive-pesticide-use/", "timestamp": "2023-04-25 17:12:03 CEST+0200", "meta": {"description": "After the WHO’s classification of glyphosate as a “probable carcinogen”, Brazil’s cancer institute has condemned GM crops for placing the country in the", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2015/04/10/brazils-national-cancer-institute-names-gm-crops-as-cause-of-massive-pesticide-use/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Brazil’s National Cancer Institute Names GM Crops as Cause of Massive Pesticide Use", "cleaned_text": "After the WHO’s classification of glyphosate as a “probable carcinogen”, Brazil’s cancer institute has condemned GM crops for placing the country in the top ranking globally for pesticide consumption, Claire Robinson reports.\n\nThe release of GM crops in Brazil has helped make it the largest consumer of agrochemicals in the world, according to a hard-hitting new report from Brazil’s National Cancer Institute José Alencar Gomes da Silva (INCA), part of the country’s Ministry of Health.\n\nThe report says that national consumption of agrochemicals is equivalent to 5.2 litres of agrochemicals per year for each inhabitant. Agrochemical sales increased from USD 2 billion in 2001 to 8.5 billion in 2011.\n\nThe report names GM crops as a key cause of the trend: “Importantly, the release of transgenic seeds in Brazil was one of the factors responsible for putting the country in first place in the ranking of agrochemical consumption – since the cultivation of these modified seeds requires the use of large quantities of these products.”\n\nThe report continues: “The cropping pattern with the intensive use of pesticides generates major harms, including environmental pollution and poisoning of workers and the population in general. Acute pesticide poisoning is the best known effect and affects especially those exposed in the workplace (occupational exposure). This is characterized by effects such as irritation of the skin and eyes, itching, cramps, vomiting, diarrhea, spasms, breathing difficulties, seizures and death.\n\n“Already chronic poisoning may affect the whole population, as this is due to multiple exposures to pesticides, that is, the presence of pesticide residues in food and the environment, usually at low doses. Adverse effects of chronic exposure to pesticides may appear long after the exposure, and so are difficult to correlate with the agent. Among the effects that can be associated with chronic exposure to pesticide active ingredients are infertility, impotence, abortions, malformations, neurotoxicity, hormonal disruption, effects on the immune system, and cancer.”\n\nAccording to the report, the most recent results of the Analytical Program on Pesticide Residues of Brazil’s health agency ANVISA revealed samples with pesticide residues above the maximum permissible limit, as well as the presence of chemical substances not authorized for the food in question. It also noted the presence of pesticides that were in the process of being banned by ANVISA or that had never been registered in Brazil.\n\nRegarding sources of exposure, the report says, “It is noteworthy that pesticide residues not only occur in fresh food, but also in many processed food products, such as cookies, chips, breads, breakfast cereals, lasagna, pizza and other ingredients that contain wheat, corn and soybeans, for example. Pesticide traces may still may be present in meat and milk of animals fed with these crops, due to the process of bioaccumulation.\n\n“Therefore, the concern over pesticides must not mean a reduction in the consumption of fruits and vegetables, which are key foods in healthy eating and of great importance in preventing cancer. The main focus must be on combating the use of pesticides, which contaminate all vital resources, including food, soil, water, breastmilk and air. In addition, methods of cultivation free from pesticide use can produce fruits, vegetables and legumes such as beans, with the greatest anticancer potential.”\n\nIn 2012, the report states, INCA organized a seminar on pesticides and cancer in partnership with the National Health Surveillance Agency (ANVISA) and the Oswaldo Cruz Foundation (Fiocruz). The event brought together health professionals, researchers, farmers and consumers to discuss the risks to human health from exposure to pesticides, particularly its relationship with certain types of cancer. And in 2013, together with Fiocruz and Abrasco, INCA signed a declaration warning of the dangers of the pesticide market.\n\nIn that context, INCA says, the purpose of the new report is “to mark the position of the INCA against current pesticide use practices in Brazil and highlight the health risks, particularly with regard to the causes of cancer.” The report’s authors approvingly cite the recent verdict of the World Health Organisation’s cancer agency IARC that glyphosate herbicide is a “probable carcinogen”.\n\nThe report calls for stronger regulation of pesticides and for the development of agroecological alternatives to the dominant pesticide-dependent GMO agricultural model.", "opengraph": {"locale": "en_US", "type": "article", "title": "Brazil’s National Cancer Institute Names GM Crops as Cause of Massive Pesticide Use", "description": "After the WHO’s classification of glyphosate as a “probable carcinogen”, Brazil’s cancer institute has condemned GM crops for placing the country in the", "url": "https://sustainablepulse.com/2015/04/10/brazils-national-cancer-institute-names-gm-crops-as-cause-of-massive-pesticide-use/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2015-04-09T21:03:23+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/gmo-brazil-soybeans.jpg", "image:width": "676", "image:height": "430"}, "tags": ["exposure", "consumption", "human health", "GM", "INCA", "pesticides", "Brazil"], "tweets": [], "movies": [], "links": ["http://gmwatch.org/index.php/news/archive/2015-articles/16067-brazil-s-national-cancer-institute-names-gm-crops-as-cause-of-massive-pesticide-use", "http://www1.inca.gov.br/inca/Arquivos/comunicacao/posicionamento_do_inca_sobre_os_agrotoxicos_06_abr_15.pdf"], "authors": [], "publish_date": "2015-04-09T21:03:23+00:00"}