{"result_id": "280016", "URL": "https://sustainablepulse.com/2018/02/02/rt-americas-lawyer-monsanto-weed-killer-is-killing-humans/", "timestamp": "2023-04-25 17:12:14 CEST+0200", "meta": {"description": "Mike Papantonio and the author Carey Gillam discussed her new book on Thursday, which reveals how Monsanto viciously worked to cover-up the fact that", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2018/02/02/rt-americas-lawyer-monsanto-weed-killer-is-killing-humans/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "RT America’s Lawyer: Monsanto Weed Killer is Killing Humans", "cleaned_text": "Mike Papantonio and the author Carey Gillam discussed her new book on Thursday, which reveals how Monsanto viciously worked to cover-up the fact that their weed-killer could cause cancer, as part of the America’s Lawyer program on RT .\n\nMike Papantonio: The story with Monsanto’s round that begins as early as the 1980s when laboratory tests on glyphosate began to show cellular changes in laboratory animals that should’ve been considered early signals of a relationship clearly to cancer. In fact, in 1985 the EPA determined that glyphosate, which is the primary ingredient in Roundup, needed to be classified as a Class C carcinogen, which meant that it clearly is suggested of a relationship to cancer. But then miraculously for some reason six years later the EPA suddenly changed that classification to something just the opposite. Now they were saying that they were wrong to classify it as a possible carcinogen and that the public had nothing to worry about when using products that contained this chemical. That was their change. Then all of a sudden the laboratory data from the early ’80s that the EPA use to classify glyphosate as cancer suddenly became unavailable to the public. Why? Because Monsanto argued that all the early testing results for this chemical fell under a protection of trade’s secret rule, meaning they didn’t have to share this information with the general public. It was theirs. They were going to keep it quiet.\n\nThe reason that story from the 1980s and 1990s is important is because the same story has played itself out time after time with Monsanto’s Roundup. Studies will show that it causes cancer clearly. Monsanto intervenes and suddenly those same scientific agencies says that there’s no link to cancer whatsoever. The studies weren’t changed because new evidence emerged. They changed because Monsanto wanted to make more money no matter how many lives it cost. It’s been a bunch of lives.\n\nJoining me now to talk about this is Carey Gillam, author of the book Whitewash: The Story of Weed Killer, Cancer, and Corruption of Science. Carey, the big word right there is cancer. It scares the bejesus out of everybody to think that they might be using a weed killer backyard every day that has any propensity to cause any kind of cancer. But I’m looking at the studies and the studies seem a little overwhelming. The World Health Organization comes out and says, “Yeah. This will cause Non Hodgkin’s Lymphoma.” The company’s still doing everything they can to try to say, “No. That’s just not how it is.” What is your take on it, Carey? What is your take on the whole cancer question?\n\nCarey Gillam: Yeah. The cancer question is definitely a big one with this chemical. It’s the most widely used agri-chemical in the world, right? It’s in our water, our food, our own bodies. You’re right the International Agency for Research on Cancer looked at decades of epidemiology and toxicology research and said this looks like a probable human carcinogen with strong ties to Non Hodgkin’s Lymphoma specifically. Monsanto says all of that research is wrong. This international agency is wrong and that this product is among the safest in the world, among the safest for people to use.\n\nMike Papantonio: Basically when I line up the literature and I look at everything, we know in the ’80s we were told by the EPA, “Yeah, this causes cancer.” Then in the ’90s it didn’t cause cancer. In between there you have doctors and scientist after scientist saying, “You know what, it does cause cancer.” You still have the EPA in the back pocket of this company saying, “Ah, well. We don’t have enough information.” You have the U.S. government right there coming to the aid. You have the media that has done such a miserably poor job telling us what is what about this case. Most people don’t understand how dangerous this product is. Why has there been this constant back and forth about Roundup as whether or not its carcinogen or not? What is this back and forth all about?\n\nCarey Gillam: Yeah. So our EPA, our own EPA, toxicologist, you’re right, back in the 1980s look at a mouse study that Monsanto had submitted to it. These mice were showing tumors. These very rare and odd tumors. The mice that received glyphosate. The toxicologist for the EPA said at that time, “Wow. This looks like this stuff could cause cancer.” They were very concerned about it and they wanted to rate it that way. Monsanto pushed back. This was in the ’80s, again, Monsanto pushed back very hard. Ultimately, convinced the EPA to discount what its own toxicologists were telling it and to declare this to be a safe product. This is what you’ve seen over the decades in the ’80s and the ’90s and again and again. Scientists warn about the findings of glyphosate on laboratory animals and epidemiology in human studies of exposure. People have been raising their arms and trying to wave a red flag about this chemical for years in many countries, many scientists around the world. Every time Monsanto has said they’re wrong and sought to discredit the scientists and to discredit the research that is sought to raise an alarm bell around this chemical. They’re still doing it. This has created a debate around the world. Not only in the United States but in Europe and many other countries about how safe or not safe this really is.\n\nMike Papantonio: Well, let me just tell you something, I’ve read your book. It’s excellent. Anybody who wants to know really wants been happening about this has got to read the book Whitewash. I follow your career as far as what you’ve written as a journalists and agriculture. It’s overwhelming. You have the information. You’ve looked at all sides. There aren’t just both sides. You’ve look at all sides here. You’ve concluded a, if I read your book properly, that there’s been a coverup. B, there’s been an attempt by the corporation Monsanto to try to push back on science and actually create their own science to make it look like Roundup is perfectly safe. I think the third part that is so troubling to me is we’ve gotten no help from the EPA and actually telling the truth. What is your take on that? Did I get that right or is it an overstatement?\n\nCarey Gillam: No, you did definitely. I mean, this has been … The way that I’ve described this to people and I was asked to come to Europe and to speak to Parliament about this is deception. That’s what it boils down it. It seems like a pretty strong thing to say, but it is decades of deceptive tactics by this giant chemical company to make billions of dollars, right? To deflect, to harass, to discredit, to suppress any information that would be useful to consumers and useful to these people who are being exposed to this chemical to decide if they want to use it or not, to decide if they want their children playing in a yard that they’ve sprayed with Roundup. People haven’t had that choice really because any information about risk has been hidden while the company has trumpeted and pumped out information about reward. In doing so, they’ve employed multiple strategies. They’ve ghost written certain scientific papers. They’ve trotted out surrogates, both within the EPA and at universities around the country to try to control the public narrative and try to control what the public knows about this and what the public doesn’t.\n\nMike Papantonio: Yeah. Let me be clear about it, when you say ghost writing, what, just so the viewers understanding … That’s where the company writes the article. They put every word in that article. Then they give the article to some cat up at Harvard or Yale or Princeton or wherever. They say, “How would you like to make another $100,000.” “Yeah, I would.” “Okay. Just sign the article that we … Just sign the study that we did that we wrote and make it sound like it’s yours.” Now, this is an organization that’s a master of that. They are the master of ghost writing. Most of the stuff that they’ve turned out about the safety of this has been written by the company, given to a third party, asked that third party to put their name on it, and then told the public that that third part is the one with the opinion.\n\nNow, let me show you something. Here you got the World Health Organization. Okay? This is an organization that for decades has been telling us what will cause cancer and what won’t cause cancer. They come out and they say, “Yeah. Roundup is a probably cancer causer.” So rather than Monsanto saying, “Well, gee. Maybe we ought to warn about that.” Instead what they’re trying to do now is defund the World Health Organization because the World Health Organization said something that’s going to hurt their profits. Give me your take on that.\n\nCarey Gillam: Yeah. I mean, they definitely did. You can see in the documentation that Monsanto anticipated that the World Health Organization’s cancer scientists would find glyphosate to be a probable human carcinogen or a possible. They knew it. They knew the research was out there. They were worried that this would happen, and they laid out a plan to discredit these international cancer scientists before they even met, before the cancer scientists even took a look at glyphosate, before they even declared it a probable human carcinogen. Monsanto was preparing to discredit them. That’s exactly what they’ve been doing since March of 2015 is perpetuating false narratives and efforts to try to tear down this classification. They have got some friendly Republicans on Capitol Hill in Washington D.C. to carry forth that message. They’re looking now at possibly trying to defund IARC. There’s a hearing scheduled for February the sixth to take a look at some of these matters. It’s a really powerful move by a powerful company to try to take on these international cancer scientists.\n\nMike Papantonio: In other words, IARC said, “Yeah. Cut through all the nonsense. We looked at it. Your product causes cancer. It causes a deadly cancer called Non Hodgkin’s Lymphoma. So don’t tell us it doesn’t. Our own scientists looked at it.” Monsanto’s not happy with that because this is a recent finding. So now what they want to do is they want to take their money away.\n\nLet me ask you something. Is it a common practice … Now I’ve handled many, many pharmaceutical cases and environmental cases where we’ve seen this practice takes place where the corporation interferes with the scientific community. The scientific communities trying to say, “Look. Warning. Warning. Warning. This stuff’s dangerous.” The company interferes with the way that that science gets out there. But I got to tell you something. In this case I have never seen so much interference with the dissemination of science that tells a mother that the child should not be playing in the grass after Roundup is sprayed because it will cause cancer or people who work around it every day that if you use this it’s going to cause cancer. That’s really what it’s about. How would you quantify the interference by this company with the scientific community?\n\nCarey Gillam: Yeah. I mean, I certainly don’t have the range of experience I guess with tort causes that you do and chemicals, but of all the different information that’s come out from scientists around the world and different ways that this chemical can be dangerous to people and the environment. I mean, that’s a whole nother realm. But you don’t see any example where Monsanto has said, “Yeah, you’re right. Yeah. Maybe we should take a look at that or maybe we should worry about that.” You don’t see that. You see, “No, they’re wrong.” They discredit them. It’s invalid. Monsanto is right and every independent scientist out there is wrong.\n\nMike Papantonio: Yeah. Carey, keep up the great work. Everybody should read your book. It is a mind blower. When you read this, it’ll scare the bejesus out of you about having Roundup anywhere around your house. Thanks for joining.", "opengraph": {"locale": "en_US", "type": "article", "title": "RT America’s Lawyer: Monsanto Weed Killer is Killing Humans", "description": "Mike Papantonio and the author Carey Gillam discussed her new book on Thursday, which reveals how Monsanto viciously worked to cover-up the fact that", "url": "https://sustainablepulse.com/2018/02/02/rt-americas-lawyer-monsanto-weed-killer-is-killing-humans/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2018-02-02T01:01:18+00:00", "article:modified_time": "2018-02-02T01:02:52+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2018/02/RT.png", "image:width": "900", "image:height": "506"}, "tags": ["cancer", "Monsanto", "glyphosate", "Mike Papantonio Basically", "EPA", "cause", "Roundup"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/hN7w6da0b5Y\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/hN7w6da0b5Y"}], "links": ["https://trofire.com/2018/02/01/monsanto-weed-killer-killing-humans-americas-lawyer/", "https://detoxproject.org/pesticides-in-hair/", "https://detoxproject.org/glyphosate-testing-test-yourself/", "https://detoxproject.org/glyphosate-residue-free/verification-faqs/", "http://detoxproject.org/10-things-you-need-to-know-about-glyphosate/"], "authors": [], "publish_date": "2018-02-02T01:01:18+00:00"}