{"result_id": "280003", "URL": "https://sustainablepulse.com/2013/07/13/the-sinister-monsanto-group-agent-orange-to-genetically-modified-corn/", "timestamp": "2023-04-25 17:11:51 CEST+0200", "meta": {"description": "The Americans do not only spy on governments, authorities and private individuals across the world with the help of their secret services;  they also", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2013/07/13/the-sinister-monsanto-group-agent-orange-to-genetically-modified-corn/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "The Sinister Monsanto Group: ‘Agent Orange’ to Genetically Modified Corn", "cleaned_text": "The Americans do not only spy on governments, authorities and private individuals across the world with the help of their secret services; they also understand how to push forward the global interests of their companies with full force. An impressive example of this is the agriculture giant Monsanto, the leading manufacturer of genetically modified seeds in the world. A glimpse into the world of Monsanto shows that companies which delivered the pesticide ‘Agent Orange’ to the US military in the Vietnam war had close connections with the central power in Washington, with tough people from the field of the US secret services and with private security companies.\n\nIn the global fight against genetic engineering, the US group draws on dubious methods, strange helpers – and the power of Washington. Critics of the group feel they are being spied upon.\n\nThe US group Monsanto is a giant in the agriculture business: and number one in the controversial field of plant genetic engineering. For its opponents, many of whom live in Europe, Monsanto is a sinister enemy. Time and again mysterious things happen, which make the enemy seem yet more sinister.\n\nIn the previous month, the European environmental organisation ‘Friends of the Earth’ and the German Environmental and Nature Protection Association (BUND) wanted to present a study on the pesticide glyphosate in the human body. Weed killers containing glyphosate are the big seller for Monsanto. The company aims for more than two billion dollars turnover for the Roundup product alone. ‘Roundup herbicide’ has a “long history of safe use in more than 100 countries”, Monsanto emphasises.\n\nAs viruses attack their computers, the eco-activists ask themselves: “could we be seeing ghosts?”\n\nHowever, there are studies which show that the product may damage plants and animals and the latest study shows that many large city inhabitants now have the field poison in their bodies, without knowing it. Exactly what the spray can trigger in an organism is, as with so many things in this field, disputed.\n\nTwo days before the study across 18 countries was set to be published, a virus disabled the computer of the main organiser, Adrian Bepp. There was a threat that press conferences in Vienna, Brussels and Berlin would be cancelled. “We panicked”, remembers Heike Moldenhauer from BUND. The environmental activists were under extreme time pressure.\n\nMoldenhauer and her colleagues have widely speculated about the motives and identity of the mysterious attacker. The genetic engineering expert at BUND believes the unknown virus suppliers wanted in particular to “generate confusion”. Nothing is worse for a study than a cancelled press conference: “we did ask ourselves at the time if we were seeing ghosts”, said Moldenhauer.\n\nThere is no evidence that Monsanto was the ghost or had anything to do with the virus. The company does not do things like that. It takes pride in operating “responsibly”: “Today, it is very easy to make and spread all kinds of allegations,” Monsanto claims. They say that “over and over there are also dubious and popular allegations spread, which disparage our work and products and are in no way based on science.”\n\nCritics of the group see things differently. This is due to the wide network Monsanto has developed across the world. There are ties with the US secret services, the US military, with very hard operating private security companies and of course, with the US government.\n\nA conspicuously large number of Monsanto critics report regular attacks by professional hackers. The secret services and military also like to employ hackers and programmers. These specialise in developing Trojans and viruses in order to penetrate foreign computer networks. Whistle-blower Edward Snowden has indicated the connection between intelligence services actions and economic drive. However, this sinister connection has been overshadowed by other monstrosities.\n\nSome powerful Monsanto supporters know a lot about how to carry out a cyber war. “Imagine the internet as a weapon, sitting on the table. Either you use it or your opponent does, but somebody’s going to get killed” said Jay Byrne, the former head of public relations at Monsanto, back in 2001.\n\nCompanies regularly fight with dubious methods to uphold what they see as their right: but friend or foe, him or me – that is fighting talk and in a war, you need allies. Preferably professionals. Such as those from the secret service milieu, for example.\n\nMonsanto contacts are known to the notorious former secret service agent Joseph Cofer Black, who helped formulate the law of the jungle in the fight against terrorists and other enemies. He is a specialist on dirty work, a total hardliner. He worked for the CIA for almost three decades, among other things as the head of anti-terroism. He later became vice president of the private security company Blackwater, which sent tens of thousands of soldiers to Iraq and Afghanistan under US government orders.\n\nInvestigations show how closely connected the management and the central government in Washington are, as well as with diplomatic representatives of the USA across the world. In many instances, Monsanto has operationally powerful assistants. Former Monsanto employees occupy high offices in the USA in government authorities and ministries, industrial associations and in universities; sometimes in almost symbiotic relationships. According to information from the American Anti-Lobby-Organisation, Open Secrets Org, in the past year, 16 Monsanto lobbyists have taken up sometimes high ranking posts in the US administration and even in regulatory authorities.\n\nFor the company, it is all about new markets and feeding a rapidly growing world population. Genetic engineering and patents on plants play a big role here. Over 90 % of corn and soya in the USA is genetically modified. In some parts of the rest of the world the percentage is also growing constantly.\n\nOnly the European markets are at a standstill. Several EU countries have many reservations about the Monsanto future, which clearly displeases the US government administration. In 2009, the German CSU politician, Ilse Aigner, Federal Minister for Food, Agriculture and Consumer Protection, also banned the corn type MON810 from German fields. When she travelled to the USA shortly afterwards, she was approached by her US colleague, Tom Vilsack about Monsanto. The democrat was once governor in the agricultural state of Iowa and distinguished himself early on as a supporter of genetic engineering. The genetic engineering industry elected him as ‘governor of the year’ in 2001.\n\nUnfortunately, there is no recording of the discussion between Vislack and Aigner. It was said to be controversial. A representative for the Federal Government described the tone: there were “huge efforts to force a change in direction of the German government regarding genetic policy.” The source preferred not to mention details the type of “huge efforts” and the attempt “to force” something. That is not appropriate between friends and partners.\n\nThanks to Snowden and Wikileaks, the world has a new idea of how these friends and partners operate where power and money are concerned. The whistle-blowing platform published embassy dispatches two years ago, which also included details about Monsanto and genetic engineering.\n\nFor example, in 2007, the former US ambassador in Paris, Craig Stapleton, suggested the US government should create a penalties list for EU states which wanted to forbid the cultivation of genetically engineered plants from American companies. The wording of the secret dispatch: “Country team Paris recommends that we calibrate a target retaliation list that causes some pain across the EU.” Pain, retaliation: not exactly the language of diplomacy.\n\nMonsanto led the fight to allow the famous genetically engineered corn plant MON810 in Europe with lots of lobbying – the group completely lost the fight. It was even beaten out of the prestigious French and German markets. An alliance of politicians, farmers and clergy rejected genetic engineering in the fields and the consumers do not want it on their plates. But the battle is not over. The USA is hoping that negotiations started this week for a free-trade agreement between the USA and the EU will also open the markets for genetic engineering.\n\nLobbying for your own company is a civic duty in the USA. Even the important of the 16 US intelligence services have always understood their work as being a support for American economic interests on the world markets. They spy on not only governments, authorities and citizens in other countries under the name of the fight against terror, they also support American economic interests, in their own special way.\n\nMonsanto denies the accusations and emphasises that it operates “responsibly”\n\nMore than two decades ago, when Japan was not yet a major economic power, the study ‘Japan 2000’ appeared in the USA, created by the employees of the Rochester Institute of Technology (RIT). Japan, the study read, was planning a kind of world takeover with a ‘reckless trade policy’. The USA would be the losers, stated the study. The national security of the USA was at threat, it continued and the CIA gave the call to war.\n\nAmerica’s economy must be protected from the European’s “dirty tricks”, explained former head of the CIA James Woolsey. This, he maintained, is why the “continental European friends” were spied upon. A clean America.\n\nThe whistle-blower Snowden was once in Switzerland for the CIA and during this time, he reported on which tricks the company was said to have tried in order to win over a Swiss banker to spy on account data. The EU allowed the American services to take a close look at its citizens’ financial business. Allegedly, this was to dry up money sources for terror. The method and purpose are highly dubious.\n\nIn Switzerland, the scene of many earlier espionage novels now plays one of these episodes that make Monsanto especially mysterious and enigmatic: In January 2008, the former CIA agent Cofer Black travelled to Zurich and met Kevin Wilson, at the time Monsanto’s safety officer for global issues. About what did the two men talk? Probably the usual: Opponents, business, mortal enemies.\n\nThe investigative journalist Jeremy Scahill, who wrote the reference work about Blackwater, the company specializing in mercenaries, wrote in the American weekly The Nation in 2010 about the reported strange meeting in Zurich. He had received leaked documents once again. These show: Monsanto wanted to put up a fight. Against activists who destroyed the fields. Against critics, who influenced the mood against the genetic modification company. Cofer Black is the right man for all seasons: “We’ll take off the kid gloves”, he declared after the 11 September terrorist attacks, and tasked his CIA agents in Afghanistan to take out Osama bin Laden: “Get him, I want his head in a box.” However, he also understands a lot about the other secret service business, which operates with publicly available sources. When he meets with the Monsanto safety officer Wilson, Cofer Black is still the Vice (President) at Blackwater, who has the Pentagon, the State Department, the CIA and, of course private companies as customers. However, there was a lot of anxiety in January 2008, because the mercenaries of the security company had shot 17 civilians in Iraq and some Blackwater employees had drawn attention by bribing Iraqi government employees. It just so happened that Cofer Black was at the same time head of the security company Total Intelligence Solutions (TIS), which was a subsidiary of Blackwater, not saddled with the same devastating reputation, however staffed with some excellent and versatile experts.\n\nAccording to their own statements, Monsanto was conducting business with TIS at the time and not with Blackwater. It is without doubt that Monsanto received reports from TIS about the activities of critics. The activities in question were those that would have presented a risk for the company, its employees or its operating business. The information collected ranged from terrorist attacks in Asia to the scanning of websites and blogs. Monsanto emphasizes that TIS only used publicly accessible material when preventing said risk.\n\nThere used to be rumors that Monsanto wanted to take over TIS to mitigate their risk – and there are new rumors these days that the group allegedly is considering a takeover of the company Academi that emerged after a few transformations from the former Blackwater Company. Is anything correct about these rumors? “As a rule we are not disclosing details about our relations with service providers, unless that information is already available to the public,” is the only commentary from Monsanto.\n\nEvery company has its own history, and the history of Monsanto includes a substance, which the turned the company into a demon not only not only for the aging 1968ers: Monsanto was one of the leading manufacturers of the pesticide Agent Orange, which was used until January 1971 by the US military in the Vietnam War. Forests were defoliated by constant chemical bombardment to make the enemy visible. Arable land was poisoned, so that the Vietcong had nothing to eat. In the sprayed areas, the teratogenic effects increased more than ten times. Children were born without noses, without eyes, with hydrocephalus, with facial clefts and the US military stated that the Monsanto agent was as harmless as aspirin.\n\nIs everything allowed in war? Especially in the new fangled cyber war?\n\nIt is already obvious that somebody makes life difficult for Monsanto critics and an invisible hand ends careers. However, who is this somebody? The targets of these attacks are scientists, such as the Australian Judy Carman. Among other things, she has made a name for herself with studies of genetically modified plants. Her publications were questioned by the same professors which also attacked the the studies of other Monsanto critics.\n\nIt does not stop at skirmishes in the scientific community. Hackers regularly target various web pages where Carman publishes her studies and the sites are also systematically observed, at least that is the impression Carman has. Evaluations of IP log files show that not only Monsanto visits the pages regularly, but also various organizations of the U.S. government, including the military. These include the Navy Network Information Center, the Federal Aviation Administration and the United States Army Intelligence Center, an institution of the US Army, which trains soldiers with information gathering. Monsanto’s interest in the studies is understandable, even for Carman. “But I do not understand why the U.S. government and the military are having me observed,” she says.\n\nThe organization GM Watch, known to be critical of gene technology, also experiences strange events. Editor Claire Robinson reports continued hacker attacks on the homepage since 2007. “Every time we increase the page security just a bit, the opposite side increases their tenacity and following are new, worse attacks”, she says. She also cannot believe the coincidences that occur. When the French scientist Gilles Eric Seralini published a controversial study on the health risks of genetically modified maize and glyphosate in 2012, the web site of GM Watch was hacked and blocked. The same repeats when the opinion of the European food inspectorate (EFSA) is added to the site. The timing was skilfully selected in both cases. The attacks took place exactly when the editors wanted to publish their opinion.\n\nIt has not yet been determined who is behind the attacks.\n\nMonsanto itself, as stated, emphasizes that the company operates “responsibly”.\n\nThe fact is, however, that much is at stake for the group. It is about an upcoming bill. Especially about the current negotiations on the free trade agreement. Particularly sensitive is the subject of the agricultural and food industry. The Americans want to open the European markets for previously prohibited products. In addition to genetically engineered plants controversial feed additives and hormone-treated beef are subject of the negotiations. The negotiations will probably extend over several years.\n\nThe Americans want to use the Free Trade Agreement to open the European GMO Market.\n\nThe negotiations will be detailed. Toughness will rule the day. US President Barack Obama has therefore appointed Islam Siddiqui as chief negotiator for agriculture. He has worked for many years for the US ministry of agriculture as an expert. However, hardly anyone in Europe knows: From 2001 to 2008, he represented CropLife America as a registered lobbyist. CropLife America is an important industry association in the United States, representing the interests of pesticide and gene technology manufacturers – including of course Monsanto. “Actually, the EU cannot accept such a chief negotiator because of bias”, says Manfred Hausling, who represents the Green Party in the EU parliament.\n\nEigentlich (In fact). The word Eigentlich (in fact) meant in the Middle High German according to the relevant dictionaries “indentured”, which is not a bad description of the current situation, in particular as the European and German politicians have surprisingly much understanding for the US services who regularly spy on them.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Sinister Monsanto Group: ‘Agent Orange’ to Genetically Modified Corn", "description": "The Americans do not only spy on governments, authorities and private individuals across the world with the help of their secret services;  they also", "url": "https://sustainablepulse.com/2013/07/13/the-sinister-monsanto-group-agent-orange-to-genetically-modified-corn/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2013-07-13T17:15:09+00:00", "article:modified_time": "2013-07-31T14:43:13+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/SZ.gif", "image:width": "436", "image:height": "305"}, "tags": ["agriculture business", "Monsanto", "Genetically Modified", "glyphosate", "US", "Washington", "Judy Carman", "falck", "GMO", "USA", "time"], "tweets": [], "movies": [], "links": ["http://www.sueddeutsche.de/", "http://www.neweuropetranslations.com", "https://www.facebook.com/SustainablePulse", "http://www.gmojudycarman.org"], "authors": [], "publish_date": "2013-07-13T17:15:09+00:00"}