{"result_id": "280022", "URL": "https://sustainablepulse.com/2013/08/01/science-as-social-control-political-paralysis-and-the-genetics-agenda/", "timestamp": "2023-04-25 17:12:23 CEST+0200", "meta": {"description": "Variations in individual “educational attainment” (essentially, whether students complete high school or college) cannot be attributed to inherited", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2013/08/01/science-as-social-control-political-paralysis-and-the-genetics-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Science as Social Control: Political Paralysis and the Genetics Agenda", "cleaned_text": "Variations in individual “educational attainment” (essentially, whether students complete high school or college) cannot be attributed to inherited genetic differences. That is the finding of a new study reported in Science magazine (Rietveld et al. 2013). According to this research, fully 98% of all variation in educational attainment is accounted for by factors other than a person’s simple genetic makeup.\n\nThis implies that most of student success is a consequence of potentially alterable social or environmental factors. This is an important and perhaps surprising observation, of high interest to parents, teachers, and policymakers alike; but it did not make the headlines.\n\nThe likely reason is that the authors of the study failed to mention the 98% figure in the title, or in the summary. Nor was it mentioned in the accompanying press release.\n\nInstead, their discussion and interest focused almost entirely on a different aspect of their findings: that three gene variants each contribute just 0.02% (one part in 5,000) to variation in educational attainment. Thus the final sentence of the summary concluded not with a plea to find effective ways to help all young people to reach their full potential but instead proposed that these three gene variants\n\nThis is as spectacular a misdescription of a scientific finding as is to be found anywhere in the scientific literature. But the question is why? Why did the more than two hundred authors decide to highlight the unimpressive 0.02% and bury the 98%? The easy answer is that the authors are geneticists and that geneticists will not have distinguished careers if variation in genes is irrelevant to health and human achievement. The full answer, however, is considerably more interesting, and much more significant, than simple conflicts of interest.\n\nThe broader explanation, which needs to account, for example, for the fact that Science magazine would publish such a discrepant conclusion, is that the science of human biology is in the grip of hidden political forces. These forces are powerful enough to enable (this and other) comprehensively misrepresented genetic studies to evade the corrective potential of the scientific peer review process, and be published in the foremost journals of science.\n\nHow money and politics can dictate the conclusions of a scientific study\n\nThe easiest starting point to explain this miscarriage of science is to begin with funding. The Rietveld research, we know for a fact, was part of a genetic epidemiology project called the Social Science Genetic Association Consortium (SSGAC). The consortium obtains its money almost entirely from the National Institutes of Health (NIH) and the National Science Foundation, i.e. the US government.\n\nThe self-described funding premise of SSGAC is that:\n\n“for most outcomes in life, over half the resemblance of two biological siblings reared in the same family stems from their genetic similarity” (Benjamin et al. 2012).\n\nIn other words, SSGAC believed even before Rietveld was published that inherited genetic predispositions make the dominant contribution to ones’ lifetime achievements, in education and apparently “most” spheres of human behavior. Consequently, the aim of all its projects is to physically locate these specific genetic factors on human DNA.\n\nBut the actual Rietveld result implies that such genetic predispositions are pretty much irrelevant, at least as far as educational attainment is concerned. Moreover, SSGAC had previously searched for gene variants associated with “general intelligence”, and “economic and political preferences” (such as risk-aversion and trust). For all these traits the search was again unsuccessful; in only one instance did project members find a genetic variant that reached the threshold of statistical significance (which is itself far below what might be considered important as a predisposing factor) (Benjamin et al. 2012; Chabris et al. 2012). Thus we can say that SSGACs’ founding premise is not in alignment with the data.\n\nBut that just brings the question back one stage further: why is the US government funding excessively genetic determinist projects such as this in the first place?\n\nThe probable answer is that the US education system has many problems, which are exemplified by its low rankings on international scales. There is a danger that blame for these problems might be laid at the door of the secretary for education, the administration, or the President. This possibility could be neatly sidestepped, however, if educational attainment was genetically fated.\n\nEssentially the same political logic applies to any human disease or disorder, or even any social complaint. If the disorder, for example autism, can be shown (or even just suggested) to have a partial genetic origin then a barn door is opened for any accused vaccine maker, or polluter, or policymaker, to evade the blame–both legally and in the perception of the public.\n\nThis opportunity within biology to make inequality (not just of wealth) look ‘natural’ has been recognized for a long time. Harvard Geneticist Richard Lewontin summed it up his 1992 book ‘The Doctrine of DNA: Biology as Ideology’:\n\n“The notion that the lower classes are biologically inferior to the upper classes……..is meant to legitimate the structures of inequality in our society by putting a biological gloss on them”\n\nRecognition that this reasoning aligns the interests of both corporations and governments has coincided with the extraordinary funding opportunities for scientists willing to apply DNA analysis and genomic approaches to vast areas of mental and physical health. Precise figures are not available, but over the last fifteen years close to half the budget of the NIH has gone to genetic analysis of human populations. That is likely in excess of $100 billion dollars in the US alone.\n\nThe financial outlay is ongoing: the same SSGAC consortium is also researching the possibility of genetic factors in “subjective well-being” (happiness) and “fertility”. Furthermore, the scope of the search for genetic predispositions is widening. In 2004 science writer John Horgan noted that (unsuccessful) searches have been made for “genes for”\n\nSince he compiled that list the field of “behavioral economics” has been added to the list of genetic searches considered worthy of public support. For example, a 2013 publication in the journal PLOS one (with 68 authors) goes by the title “The Molecular Genetic Architecture of Self-Employment” (van der Loos et al. 2013). Meanwhile, the US National Human Genome Research Institute last year put out a call for evidence asking geneticists to support a search for predispositions to “behavioral adherence” to expert advice (i.e. compliance).\n\nThus there is operating within the disciplines of medicine, public health, social science, and now economics, a research framework that, if successful, would locate the causes of negative human outcomes internally. At fault will be genes and not circumstances. It is an officially sanctioned and scientific version of “blame the victim”.\n\nThree major strands of evidence support this thesis.\n\nBig tobacco and the origins of human genetics\n\nMost directly of all, there is clear evidence that the search for genetic predispositions is the centerpiece of a longterm corporate agenda whose purpose is to sway public opinion. It began in the 1960s with the tobacco industry at a time when smoking was first implicated in lung cancer. The strategic purpose was to deflect the public fear of smoking, minimize the likely policy responses, and eliminate potential legal expenses, by funding, encouraging, and then exploiting, human genetic research. This could be done, so the industry thought, by building from scratch a science of genetic risk factors.\n\nThis agenda operated until the late 1980s when the tobacco industry became politically too controversial for medical organizations to maintain formal relations. According to research by Helen Wallace of the UK non-profit GeneWatch, the tobacco industry by 1994 had awarded around 1,000 researchers £225 million ($370 million) to nurture research in human genetics (Wallace 2009). This tobacco research money was directed in particular to searches for genetic associations with lung cancer.\n\nAs early as 1965, this strategy was sowing uncertainty about the causes of lung cancer. As Dr. George L. Saiger, a consultant paid over $50,000 by the tobacco industry, testified before the US Senate Commerce committee:\n\n“There is strong reason to believe that the constitutional hypothesis fits the evidence appearing in the Report of the Surgeon General’s Committee at least as well as the cigarette hypothesis…”\n\nProof that this statement was part of a conscious program to build the credibility of a “constitutional hypothesis” (i.e. the existence of genetic predispositions to lung cancer) was subsequently confirmed by searches of the Legacy Tobacco Documents (Gundle et al. 2010). These are internal documents of the tobacco industry, now kept by the University of California, San Francisco, that the industry was compelled to release in a lawsuit settlement.\n\nThe tobacco industry also pioneered ‘behavioral genetics’. The idea that even addiction to cigarettes was a genetic phenomenon (and not a characteristic of cigarettes or tobacco) originated with the tobacco industry. The consistent aim behind promoting genetics, according to a memo written by Fred R. Panzer, Vice President of Public Relations for the Tobacco Institute, was to change the focus of attention “from one product to a type of person”.\n\nThe tobacco industry was still actively pursuing the same public relations (PR) strategy when, for example, senior tobacco executives met with geneticist and Nobel Laureate Sydney Brenner in 1988, just a month before he set up the Human Genome Organization (HUGO) (Wallace 2009). HUGO was the organization formed to oversee the Human Genome Sequencing Project.\n\nThe second important point of evidence is that the public interest justification for identifying gene variants is hard to discern. For example, even if predispositions for educational attainment were to be found, it is not clear how public welfare would benefit. For example, it wouldn’t affect at all the need for high quality education, either for individuals found wanting, or for those of average or higher ability. This crucial point is glossed over by proponents of genetic explanations who, according to Chaufan and Joseph (2013), merely assume that genetic knowledge\n\n“will necessarily improve the prediction, diagnosis, prevention, or treatment of common disorders.”\n\nAs these weaknesses have become clearer, it has become more common for public health professionals to question the utility of these studies and argue that, at a minimum:\n\n“advocates of genomic medicine should be much more modest”\n\nabout the likely impacts on public health (Hall, Mathews, and Morley 2010).\n\nThe third reason to suspect that a political and not a scientific agenda underlies the continued push for genetic research is that the money has continued to flow even in the face of a tsunami of evidence against its major predictions. As Hall and colleagues also wrote, geneticists:\n\n“have not identified major susceptibility alleles (gene variants) for most common diseases.” (Hall, Mathews, and Morley 2010).\n\nEven the findings that have been claimed (which are modest) have consistently not stood up to retrospective replication (Ioannidis and Panagiotou 2011). The absence of evidence is now so clear that even leaders in the field of human genetics sometimes find an acknowledgement is necessary (though only in the context of a request for more funding) (Manolio et al. 2009).\n\nAs the evidence for genetic causations has continuously and stubbornly refused to appear, critics have grown bolder. Chaufan and Joseph in 2013 felt confident enough to write:\n\n“these variants have not been found because they do not exist” (Chaufan and Joseph 2013).\n\nIt is important, nevertheless, to acknowledge that there are exceptions. The breast cancer mutations of the BRCA1 gene are one class of exception. But even BRCA1 is an exception that proves the rule. BRCA1 is well known precisely because it remains an almost unique example of a prominent genetic predisposition to a common disease. Yet even BRCA1 is oversold. More than 90% of all breast cancer cases are unrelated to it (Gage et al. 2012).\n\nThe other class of exceptions are those relatively rare disorders for which there is clear evidence of a simple genetic cause. Cystic fibrosis is an example of such a disease; Huntington’s disease is another.\n\nHowever, to return to the main point, for common physical and mental health conditions, such as heart disease, cancer, autism and schizophrenia, the situation has proven very different. The epidemiological and genetic evidence suggests that genetic risk is at most a minor contributing component. For behavioral and economic traits the lack of positive genetic data is even more apparent.\n\nConsequently, an extra-scientific explanation is required to explain why very large sums of taxpayer money have funded human genetic research in the face of such negative results.\n\nIn purely research terms, the search for human genetic predispositions has foundered. Yet this failure has done curiously little to prevent medical and behavioral genetics from being an overwhelming PR success. Thanks to the tobacco industry (joined later by the chemical industry, the food industry, the pharmaceutical industry, all the way to the gambling industry), “genes for” any disease, or talent, or human oddity, is nowadays a standard topic of adult conversation.\n\nThis was not always the case. When the geneticist Mary-Claire King (co-discoverer of the BRCA1 gene) was interviewed recently in New Scientist, she was at pains to remind the interviewer that in the 1980s convincing funders to explore an inherited genetic basis for cancer was exceedingly difficult.\n\n“The main experience of the period was that people completely ignored me” (Powerful genes New Scientist 22 June 2013).\n\nIt is hard to be certain but it is likely that this sea change in public opinion did indeed protect the tobacco industry, which continues to thrive. It also, we have previously argued, played a key role in protecting polluters and politicians of all kinds from facing regulations and responsibility. Much of the explanation for our societies’ generic failure to address social and environmental problems can probably be attributed to the simple overreliance on genetic determinist explanations.\n\nYet beyond the example of BRCA1, few scientists or lay people could name a specific discovery to back up their genetic suppositions. This discrepancy, between the failure of the science program itself and its success as a PR project is truly a sobering testament to the power of modern public relations. It is also an indictment of science journalism and the inadequacy of the science media as a whole.\n\nThe above analysis proposes that it is a mistake to ascribe responsibility for their conclusions solely to authors of papers such as Rietveld et al. Equally culpable is the operating system within which these researchers find themselves. Science magazine and its editors and reviewers, for example, are clearly complicit in publishing misleading conclusions. Funding agencies are complicit in awarding public funds to speculative gene hunting projects at the expense of pressing public health questions. The evidence thus points to a broad system-wide failure.\n\nNot sufficiently understood by outsiders is the fact that most of science is essentially now a top-down project. There persists a romantic notion (retained by many scientists) that science is a process of free enquiry. In this view, the endless grant applications and the requests for applications are merely quality control measures, or irritants imposed by bureaucrats.\n\nBut free enquiry in science is all but extinct. In reality, only a tiny proportion of research in biology gets done outside of straightjackets imposed by funding agencies. Researchers design their projects around funding programs; universities organize their hiring around them, and every experiment is carefully designed to bolster the next grant application.\n\nThe consequences of this dynamic are that individual scientists have negligible power within the system; but more importantly it opens a route by which powerful political or commercial forces can surreptitiously set the science agenda from above.\n\nIn the case of medical genetics that power has been used to deform our understanding of human nature itself. Thus public money has bought not scientific ‘progress’ but the domination of intellectual enquiry by an entirely malevolent project, conceived fully outside of science. This project was intended only to ensure political paralysis and the consolidation of economic power and whatever agenda scientists thought they were following was entirely incidental. What we observe is in fact a full-blown enlightenment malfunction.\n\nNevertheless, despite the almost daily PR barrage of genetic determinist headlines, our fate is not written in our DNA and the state of public understanding can in principle be reversed. The hopeful truth is that there are compelling reasons to remove subsidies for junk food, pesticides from the food and water, toxins from the workplace, and social and economic injustices from society, and that when we do, things will improve.\n\nReferences\n\n Benjamin et al. (2012) The Promises and Pitfalls of Genoeconomics Annual Review of Economics 4: 627-662.\n\n Benjamin D et al. (2012) The genetic architecture of economic and political preferences. Proc. Nat. Acad. Sci. 109: 8026–8031.\n\n Chabris CF, et al. (2012) Most reported genetic associations with general intelligence are probably false positives. Psychol Sci. 23: 1314-23.\n\n Dermitzakis E.T. and Clark A.G. (2009) Life after GWA studies. Science 326: 239-240.\n\n Gage M, Wattendorf D, Henry LR. (2012) Translational advances regarding hereditary breast cancer syndromes. J Surg Oncol. 105: 444-51. doi: 10.1002/jso.21856.\n\n Gundle KR. Dingel, M and Barbara A. Koenig (2010) “To Prove This is the Industry’s Best Hope”: Big Tobacco’s Support of Research on the Genetics of Nicotine. Addiction. 105: 974–983. doi: 10.1111/j.1360-0443.2010.02940.x\n\n Hall WD, Mathews R, Morley KI (2010) Being More Realistic about the Public Health Impact of Genomic Medicine. PLoS Med 7(10): e1000347. doi:10.1371/journal.pmed.1000347\n\n Ioannidis JP and Panagiotou O (2011) Comparison of Effect Sizes Associated With Biomarkers Reported in Highly Cited Individual Articles and in Subsequent Meta-analyses. J. Am. Med. Assoc. 305: 2200-2210.\n\n Chaufan C and Joseph J (2013) The ‘Missing Heritability’ of Common Disorders: Should Health Researchers Care? International Journal of Health Services 43: 281–303\n\n Manolio T. et al. (2009) Finding the missing heritability of complex diseases. Nature 461: 747-753.\n\n Rietveld et al. (2013) GWAS of 126,559 individuals identifies genetic variants associated with educational attainment. Science, 340, 1467-1471, . doi:10.1126/science.1235488\n\n van der Loos MJHM, Rietveld CA, Eklund N, Koellinger PD, Rivadeneira F, et al. (2013) The Molecular Genetic Architecture of Self-Employment. PLoS ONE 8(4): e60542. doi:10.1371/journal.pone.0060542\n\n Wallace H (2009) Big tobacco and the human genome: Driving the scientific bandwagon?Genomics, Society and Policy 5: 1-54.", "opengraph": {"locale": "en_US", "type": "article", "title": "Science as Social Control: Political Paralysis and the Genetics Agenda", "description": "Variations in individual “educational attainment” (essentially, whether students complete high school or college) cannot be attributed to inherited", "url": "https://sustainablepulse.com/2013/08/01/science-as-social-control-political-paralysis-and-the-genetics-agenda/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2013-07-31T21:27:20+00:00", "article:modified_time": "2013-07-31T21:36:29+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/NIH_1.jpg", "image:width": "500", "image:height": "349"}, "tags": ["PLOS", "health", "evidence", "New Scientist", "DNA", "scientific study", "PR"], "tweets": [], "movies": [], "links": ["https://www.sciencemag.org/content/340/6139/1467.short", "http://independentsciencenews.org/health/science-as-social-control-political-paralysis-and-the-genetics-agenda/", "http://www.eurekalert.org/pub_releases/2013-05/nyu-msi052813.php", "https://www.sciencemag.org/", "http://www.ssgac.org/Home.php", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3592970/", "http://www.pnas.org/content/109/21/8026.short", "https://www.ncbi.nlm.nih.gov/pubmed/23012269", "http://www.nbcnews.com/id/40544897/ns/us_news-life/#.Ue_B8lM1bJw", "http://independentsciencenews.org/health/biology-as-ideology-the-doctrine-of-dna/", "http://www.johnhorgan.org/do_our_genes_influence_behavior__43701.htm", "http://www.plosone.org/article/info%3Adoi%2F10.1371%2Fjournal.pone.0060542", "http://ajph.aphapublications.org/doi/abs/10.2105/AJPH.2011.300513", "http://www.hss.ed.ac.uk/genomics/V5N1/documents/Wallace.pdf", "http://www.genewatch.org/", "http://www.hss.ed.ac.uk/genomics/V5N1/documents/Wallace.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2911634/", "http://www.plosmedicine.org/article/info%3Adoi%2F10.1371%2Fjournal.pmed.1000347", "http://www.madinamerica.com/2013/02/five-decades-of-gene-finding-failures-in-psychiatry/", "http://independentsciencenews.org/health/the-great-dna-data-deficit/", "http://www.plosmedicine.org/article/info%3Adoi%2F10.1371%2Fjournal.pmed.1000347", "http://jama.jamanetwork.com/article.aspx?articleid=900417", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2831613/", "http://independentsciencenews.org/wp-content/uploads/2013/05/chaufanjoseph-missing-heritability.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/22441895", "http://www.hss.ed.ac.uk/genomics/V5N1/documents/Wallace.pdf", "http://www.saltinstitute.org/About-salt/Salt-FAQs#Whats-more-important-health-outcomes-or-blood-pressure", "http://www.forbes.com/sites/matthewherper/2012/07/16/three-lessons-from-glaxosmithklines-purchase-of-human-genome-sciences/", "http://www.tandfonline.com/doi/abs/10.1080/03085140701760874#.UfhRClM1bJw", "http://www.newscientist.com/article/dn23708-court-ruling-on-genes-is-a-victory-for-common-sense.html?full=true#.UfffyVM1bJw", "http://independentsciencenews.org/health/the-great-dna-data-deficit/", "http://grants.nih.gov/grants/guide/search_results.htm?year=active&scope=rfa", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3592970/", "http://www.pnas.org/content/109/21/8026.short", "https://www.ncbi.nlm.nih.gov/pubmed/23012269", "https://www.ncbi.nlm.nih.gov/pubmed/22441895", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2911634/", "http://www.plosmedicine.org/article/info%3Adoi%2F10.1371%2Fjournal.pmed.1000347", "http://jama.jamanetwork.com/article.aspx?articleid=900417", "http://independentsciencenews.org/wp-content/uploads/2013/05/chaufanjoseph-missing-heritability.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2831613/", "https://www.sciencemag.org/content/340/6139/1467.short", "http://www.plosone.org/article/info%3Adoi%2F10.1371%2Fjournal.pone.0060542", "http://www.hss.ed.ac.uk/genomics/V5N1/documents/Wallace.pdf"], "authors": [], "publish_date": "2013-07-31T21:27:20+00:00"}