{"result_id": "280020", "URL": "https://sustainablepulse.com/2013/07/26/controversies-over-gmos-in-brazil/", "timestamp": "2023-04-25 17:12:20 CEST+0200", "meta": {"description": "In practice, the advantages of GMOs have been shown to be weak or even misleading in the US, Argentina and Canada. Naturally, the situation repeats itself", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2013/07/26/controversies-over-gmos-in-brazil/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Controversies over GMOs in Brazil", "cleaned_text": "In practice, the advantages of GMOs have been shown to be weak or even misleading in the US, Argentina and Canada. Naturally, the situation repeats itself in Brazil.\n\nThe argument that world hunger will be overcome by productivity gains offered by genetic engineering remains an unfulfilled promise. In these 20 years of development of transgenics, almost all of GMOs involve Bt and herbicide-tolerant (HT) technologies, which are not designed to achieve productivity gains.\n\nThe massive use of herbicides with the same active ingredient is causing the emergence and expansion in the number of resistant weeds. This calls for new applications of pesticides and applications of different herbicides. As the grains fall into the crop fields during harvest, the corn itself becomes a weed in subsequent GM soybean and cotton crops sown in the same area. This requires additional applications of narrow leaf herbicides.\n\nThe same occurs with soybean (requiring application of broadleaf herbicides in corn fields). In a rotation of crops involving crops of cotton and soybeans, this solution is not feasible. To solve this problem, the solution is to hand-weed the unwanted plants or hasten the release of new genetically modified plants. As companies tend to prefer the second option, varieties of corn and soybeans with tolerance gene to the herbicide 2,4-D are under evaluation by CTNBio. The new generation of GMOs will bring massive applications of 2,4 D – an extremely toxic herbicide.\n\nThe growth in the number of resistant worms that do not die after eating Bt corn and Bt cotton, the emergence of new pests, and the increase in the number of insect pests that were of minor importance and that now cause serious damage, point towards a reduction in the effectiveness of this technology. There are records of important corn pests migrating to other crops and vice versa. Grubs, bugs and aphids are causing unprecedented damage in corn, soybeans and cotton and the emergence of pests which were not registered in Brazil (case of Helicoverpa armigera) has required new and larger applications of insecticides.\n\nRecently, the government the authorized the import and application of emamectin benzoate – a product that [Brazilian health surveillance agency] ANVISA has condemned as neurotoxic. MAPA [ministry of agriculture] wants the state departments to be responsible for the application. So far, only Bahia, where crop losses exceeded USD 1 billion, seems willing to assume this responsibility. Again, if this product is applied by aircraft, some problems may appear in the future – including in children not yet born.\n\nIn addition to the elements discussed above, we should consider the illegality of all GMOs marketed in Brazil. This illegality is associated with the breach of legal norms. Fundamentally, it should be said that none of the cases so far approved by CTNBio incorporates studies required by the legal norms.\n\nGM rice will soon be back on the agenda of CTNBio. It was not approved because the company, in the face of pressure from Brazilian rice farmers, withdrew the request for commercialization. Regardless of the technical arguments, the decision was made on the basis of commercial issues. The European market rejects GM rice and the impossibility of segregation in Brazil would undermine exports. The process is waiting until in order to avoid the risk of shortages, the EU will allow GM rice to be consumed.\n\nThe GM bean was approved based on studies with insufficient emphasis on nutritional aspects. Just 10 rats that ate GM feed with beans for a few weeks were evaluated. As revealed by the dissenting opinion, only three mice were dissected. The problems that have been identified require further studies, but were assumed to be irrelevant.\n\nRegarding GM vaccines, we do not have any kind of monitoring, so we do not know what is happening.\n\nRegarding GM mosquitoes, there are field trials in neighborhoods of cities in the northeast. Little is known about the development of these tests.\n\nConsumption may be causing health problems for the following reasons:\n\n– In GM Bt crops there are herbicide residues in unknown amounts – but all [industry] tests presented to CTNBio involved the intake of grains that had not received applications of the pesticides that justified their creation;\n\n– Long-term impacts are not evaluated. All tests submitted for evaluation CTNBio examine short-term reactions. The longest is 90 days – not allowing the identification of cumulative damage;\n\n– Acute toxicity tests involving proteins associated with transgenes are not performed with the existing proteins in plants. The tests are performed with an “almost equivalent” protein extracted from bacteria, not with the proteins produced in GM plants as a result of the genetic modification. The two proteins (from GM plants and bacteria) have the same amino acid sequence but have different properties. In the case of Bt protein, the protein in the [natural soil] bacterium only becomes active in the gut of insects, whereas in corn, it is toxic at all times in all parts of the plant.\n\nGM plants containing the Bt protein differ from non-GM plants:\n\n– Independent studies indicate a higher lignin content in GM plants. Therefore, they take longer to decompose in the soil. The insecticidal protein remain active in the soil for a variable time. In clay soils this can be up to 230 days. There are no convincing studies examining impact on soil insects.\n\n– Some studies on insects that act as predators of other insects are conducted on an insect of […] a genus that does not exist in Brazil. There are differences in the composition of GM plants for some elements and some amino acids. These differences may have an impact on feed formulation. In the case of at least one cotton, there is a higher content of gossypol. Gossypol alters sperm production, reduces fertility in males and is present in the seeds used for animal feed in the northeast.\n\n– Studies show impacts on ladybugs that prey on aphids and some beetles that act in the recycling of nutrients – which does not happen in unmodified corn.\n\nBrief summary highlighting the main points of this article:\n\nThe promises of increased productivity, as an element to overcome world hunger, lower environmental impact (with reduced use of pesticides), to protect human and animal health as a result of scientific and rigorous processes have not yet been fulfilled. The promises of GMOs that tolerate drought and acid or saline soils, that are qualitatively superior, have also not been fulfilled. The available GMOs merely expand and consolidate the oligopolistic processes of seeds and pesticides markets. There is a significant reduction in the number of companies, narrowing the range of varieties offered and the biodiversity. The number of pests and adventitious plants that are difficult to control is growing; the degree of toxicity and hazard of pesticides associated with the planting of GMOs is increasing.\n\nThe standards are not being met, the restrictions established for contamination control are ineffective, and coexistence with traditional crops has proven impractical. Family farmers are losing control and mastery over knowledge, seeds and traditional technologies, which were socially constructed and historically adapted to different environments. A good part of the evaluations in Brazil, attesting to consumer safety and the environment, are weak and inadequate. This can be verified by examination of the processes contributing to the deliberations, with arguments exposed in contradictory opinions, which are public and available in CTNBio.\n\nA new variety of corn GM was released in mid June 2013. Many of the arguments presented in the opinions were insufficiently supported by data to certify the environmental and nutritional safety of the GM maize. This is also valid for most GMOs grown in Brazil and can be summarized as follows:\n\n– Insufficient studies, which were drafted by the interested parties [GM developer companies] – most of the arguments presented are contained in the company’s own technical reports\n\n– Studies that are inadequate, short-term, and supported by poorly documented statistical methods.\n\n– Toxicological assessments involving only acute tests, which are performed with proteins extracted from bacteria and not from the GM plant. Evaluation of grain consumption, feed and fodder involving herbicide tolerant technology, which only exists in association with the associated herbicides, is performed in the absence of pesticides – falsifying, through the tests, the situation encountered in the real world. The findings are unrepresentative, there is an insufficient number of repetitions, and data changes are not justified. In many cases, these changes increased the probability of Type II error (not finding differences where they exist) and favour a finding of the safety of the GM plant (its equivalence with unmodified parent variety). Reviews of insect populations are performed improperly, neglecting the ecological importance of the same. As an example, consider the lists based on simple counts, where predators and pests are considered as identical importance (in these lists, the genus Helicoverpa caterpillar assumes the same value as an earwig of the Doru genus, although the earwig consumes up to two dozen of the caterpillars per day).\n\n– Circumstances where the studies submitted by the companies show significant differences between test and control (from the perspective of the statistical tests used by proponents) are discarded on the grounds of biological irrelevance (unproven) or with the argument that they are due to other factors.\n\n– Contempt for the standards of CTNBio, such as non-presentation of long-term studies for two generations with animals consuming the GMO in question. Non-submission of studies with pregnant animals. Non-submission of studies in all biomes. Non-submission of information on herbicide use in nutritional studies, failure to submit data on [pesticide] residues in the grain, failure to present studies on non-target organisms in regions where GM plants are grown; failure to submit studies of impacts on aquatic environments.\n\n– Failure to provide the data required for a discussion of the results presented. CTNBio’s assessments are based on average data submitted by the companies. In many cases, these averages involve data on crops and second [late-season] crops obtained in different regions. This composition increases the variance of the resulting datasets and inflates the possibility of false negatives – situations in which differences are not noticed but do in fact exist, and would be perceived in the data that is individualised (for certain crops or second crops, in different regions). When requested, the original data are not available.", "opengraph": {"locale": "en_US", "type": "article", "title": "Controversies over GMOs in Brazil", "description": "In practice, the advantages of GMOs have been shown to be weak or even misleading in the US, Argentina and Canada. Naturally, the situation repeats itself", "url": "https://sustainablepulse.com/2013/07/26/controversies-over-gmos-in-brazil/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2013-07-26T15:14:27+00:00", "article:modified_time": "2013-07-26T15:27:01+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/GMO-Brazil-3-57192471-676x430.jpg", "image:width": "676", "image:height": "430"}, "tags": ["Brazil", "problem 2c", "crops", "Leonardo Melgarejo", "GM", "pesticides", "GMO", "corn"], "tweets": [], "movies": [], "links": ["http://www4.planalto.gov.br/consea/noticias/imagens-1/melgarejo"], "authors": [], "publish_date": "2013-07-26T15:14:27+00:00"}