{"result_id": "280013", "URL": "https://sustainablepulse.com/2015/01/05/u-s-hospitals-expose-critically-ill-children-harmful-glyphosate-herbicides/", "timestamp": "2023-04-25 17:12:08 CEST+0200", "meta": {"description": "In a new round of testing commissioned by Moms Across America, the world’s number one herbicide, glyphosate, has been discovered in PediaSure Enteral Nutritional Drink, which is widely used by hospitals in the U.S. for children who are in need of nutrition in intensive care.", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2015/01/05/u-s-hospitals-expose-critically-ill-children-harmful-glyphosate-herbicides/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "U.S. Hospitals Expose Critically Ill Children to Harmful Glyphosate Herbicides", "cleaned_text": "In a new round of testing commissioned by Moms Across America, the world’s number one herbicide, glyphosate, has been discovered in PediaSure Enteral Nutritional Drink, which is widely used by hospitals in the U.S. for children who are in need of nutrition in intensive care.\n\nMoms Across America Founder Zen Honeycutt stated Monday; “It is appalling that our health care providers have been led to believe this feeding liquid is safe. Our children and loved ones believe that our health institutions are supporting their immune system and recovery, instead they are being fed a liquid which contains a herbicide that could be seriously damaging their health.”\n\nThe PediaSure Enteral Nutritional Drink tested contains GM maize (GM corn syrup) and GM soya, both of which are sprayed with glyphosate-based herbicides (these include Monsanto’s ‘RoundUp’ herbicide), during the growing season and at harvest as a drying agent.\n\nFrom the 20 samples collected 6 were found to contain ‘high’ levels of glyphosate – over 75 ug/l, which was the minimum detection level of the ELISA assay used. The testing was completed at Microbe Inotech Labs, St. Louis, Missouri.\n\n“As a mother I am very disturbed by these results. Working as a paediatric Physical Therapist I met children with feeding issues who depend on tube feedings for their entire lives. Children who experience trauma and are recovering from car accidents, shootings, cancers, surgeries and other illnesses may require these tube feedings for days, weeks, or years. I have long questioned the nutritionally poor and inflammatory ingredients in these feedings but am devastated to find out that they are contaminated with poison. Our most vulnerable children, and our children healing from overwhelming trauma, deserve better.” Sarah Cusack, MPT, CHHC told Moms Across America.\n\nThis new testing is the latest to raise awareness regarding the ubiquitous and harmful nature of glyphosate-based pesticides. It follows the first ever pilot biosurvey on glyphosate in the breast milk of American women, commissioned by Moms Across America and Sustainable Pulse in 2014, which found ‘high’ levels in 3 out of the 10 samples tested. The shocking results pointed to glyphosate levels building up in women’s bodies over a period of time, which has until now been refuted by both global regulatory authorities and the biotech industry.\n\nThe glyphosate testing commissioned by Moms Across America and Sustainable Pulse also analysed 35 urine samples and 21 drinking water samples from across the US and found levels in urine that were over 10 times higher than those found in a similar survey done in the EU by Friends of the Earth Europe in 2013.\n\n“The more data produced regarding the levels of glyphosate in our food, water and medicines the better. Even though this testing is not validated it does give a strong clue as to how ubiquitous glyphosate is in the U.S. food supply system. The question the EPA, USDA and all regulatory bodies worldwide should be asking themselves is are they willing to risk public health by relying on short-term industry sponsored safety studies on glyphosate and all other pesticides. It is time for the regulators to support long-term independent science to determine just how damaging glyphosate pesticides are for this and future generations. While these studies are being completed all glyphosate-based herbicides should be removed from the shelves,” Sustainable Pulse Director Henry Rowlands concluded.", "opengraph": {"locale": "en_US", "type": "article", "title": "U.S. Hospitals Expose Critically Ill Children to Harmful Glyphosate Herbicides", "description": "In a new round of testing commissioned by Moms Across America, the world’s number one herbicide, glyphosate, has been discovered in PediaSure Enteral Nutritional Drink, which is widely used by hospitals in the U.S. for children who are in need of nutrition in intensive care.", "url": "https://sustainablepulse.com/2015/01/05/u-s-hospitals-expose-critically-ill-children-harmful-glyphosate-herbicides/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2015-01-05T19:02:52+00:00", "article:modified_time": "2015-01-05T23:46:19+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2015/01/child-hospital.jpg", "image:width": "992", "image:height": "559"}, "tags": ["health", "GI", "children", "glyphosate", "GM", "pesticides", "time"], "tweets": [], "movies": [], "links": ["http://www.momsacrossamerica.com/glyphosate_found_in_feeding_tube_liquid"], "authors": [], "publish_date": "2015-01-05T19:02:52+00:00"}