{"result_id": "280014", "URL": "https://sustainablepulse.com/2018/02/16/glyphosate-residues-discovered-in-almond-milk-bread-and-veggie-burgers/", "timestamp": "2023-04-25 17:12:10 CEST+0200", "meta": {"description": "New laboratory testing commissioned by Moms Across America has shown the presence of the world's most used herbicide - glyphosate - in almond milk,", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2018/02/16/glyphosate-residues-discovered-in-almond-milk-bread-and-veggie-burgers/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Glyphosate Residues Discovered in Almond Milk, Bread and Veggie Burgers", "cleaned_text": "New laboratory testing commissioned by Moms Across America has shown the presence of the world’s most used herbicide – glyphosate – in almond milk, vegetarian burgers, bread and Skippy’s “100% Natural” peanut butter and Lipton’s “100% Natural” Mint and Green tea.\n\nThe new round of testing follows on from similar testing commissioned by Moms Across America on popular U.S. orange juice brands in 2017, which showed levels of between 4.3 ppb and 26.05 ppb of glyphosate in brands such as Tropicana and Minute Maid.\n\nThe new batch testing results showed that conventional almond milk contained glyphosate at a level of 0.87 ppb and certified organic almond milk contained 0.07 ppb. The batch bread testing showed a range of glyphosate residues from 6.47 ppb to 140 ppb. Conventional veggie burgers batch testing revealed 52.20 ppb of glyphosate. Certified organic veggie burgers contained 3.27 ppb.\n\n“100% Natural” Skippy peanut butter was found to contain 11.71 ppb of glyphosate residue and “100% Natural” Lipton Tea was found to contain 108.90 ppb and Lipton’s “100% Natural” Green Tea contained 208.29 ppb.\n\nIn November Moms Across America, led by Founder Zen Honeycutt, announced a nationwide campaign to ban glyphosate herbicides in all fifty states in the U.S.\n\nAll 50 state governors are being petitioned by moms and supporters through Change.org and local state residents from each state are launching a mail-in campaign today requesting meetings with their governors.\n\nHoneycutt stated, “Now is the time. Our country is in an unaffordable and tragic public health crisis. Toxic chemicals have been shown to contribute to or cause many of these health issues, especially for our children. It’s time for our states to take actions that our EPA is not willing to take. They can, must and we believe, will protect our citizens from irreparable harm. It’s just a matter of which state will be the first to ban glyphosate?”", "opengraph": {"locale": "en_US", "type": "article", "title": "Glyphosate Residues Discovered in Almond Milk, Bread and Veggie Burgers", "description": "New laboratory testing commissioned by Moms Across America has shown the presence of the world's most used herbicide - glyphosate - in almond milk,", "url": "https://sustainablepulse.com/2018/02/16/glyphosate-residues-discovered-in-almond-milk-bread-and-veggie-burgers/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2018-02-15T23:22:30+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2018/02/almond-milk.jpg", "image:width": "1100", "image:height": "734"}, "tags": ["health", "Natural Lipton Tea", "Natural Green Tea", "Natural Skippy", "EPA", "Moms Across America", "time"], "tweets": [], "movies": [], "links": ["https://detoxproject.org/pesticides-in-hair/", "https://detoxproject.org/glyphosate-testing-test-yourself/", "https://detoxproject.org/glyphosate-residue-free/verification-faqs/", "http://detoxproject.org/10-things-you-need-to-know-about-glyphosate/", "https://www.change.org/search?q=ban%20glyphosate"], "authors": [], "publish_date": "2018-02-15T23:22:30+00:00"}