{"result_id": "280008", "URL": "https://sustainablepulse.com/2020/10/20/eu-moves-towards-a-toxic-free-future-with-new-restrictions-on-harmful-chemicals/", "timestamp": "2023-04-25 17:12:00 CEST+0200", "meta": {"description": "Last week, the European Commission adopted the EU Chemicals Strategy for Sustainability. The Strategy is the first step towards a zero pollution ambition", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2020/10/20/eu-moves-towards-a-toxic-free-future-with-new-restrictions-on-harmful-chemicals/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "EU Moves Towards a Toxic-Free Future with New Restrictions on Harmful Chemicals", "cleaned_text": "Last week, the European Commission adopted the EU Chemicals Strategy for Sustainability. The Strategy is the first step towards a zero pollution ambition for a toxic-free environment announced in the European Green Deal.\n\nThe EC Strategy will boost innovation for safe and sustainable chemicals, and increase protection of human health and the environment against hazardous chemicals. This includes prohibiting the use of the most harmful chemicals in consumer products such as toys, childcare articles, cosmetics, detergents, food contact materials and textiles, unless proven essential for society, and ensuring that all chemicals are used more safely and sustainably.\n\nChemicals Strategy fully recognises the fundamental role of chemicals for human well-being and for the green and digital transition of European economy and society. At the same time it acknowledges the urgent need to address the health and environmental challenges caused by the most harmful chemicals. In this spirit, the Strategy sets out concrete actions to make chemicals safe and sustainable by design and to ensure that chemicals can deliver all their benefits without harming the planet and current and future generations.\n\nThis includes ensuring that the most harmful chemicals for human health and the environment are avoided for non-essential societal use, in particular in consumer products and with regard to most vulnerable groups, but also that all chemicals are used more safely and sustainably. Several innovation and investment actions will be foreseen to accompany the chemicals industry through this transition. The Strategy also draws the attention of Member States to the possibilities of the Recovery and Resilience Facility to invest in the green and digital transition of EU industries, including in the chemical sector.\n\nIncreasing protection of health and the environment\n\nThe Strategy aims to significantly increase the protection of human health and the environment from harmful chemicals, paying particular attention to vulnerable population groups. Flagship initiatives include in particular:\n• Phasing out from consumer products, such as toys, childcare articles, cosmetics, detergents, food contact materials and textiles, the most harmful substances, which include among others endocrine disruptors, chemicals that affect the immune and respiratory systems, and persistent substances such as per- and polyfluoroalkyl substances (PFAS), unless their use is proven essential for society;\n• Minimising and substituting as far possible the presence of substances of concern in all products. Priority will be given to those product categories that affect vulnerable populations and those with the highest potential for circular economy;\n• Addressing the combination effect of chemicals (cocktail effect) by taking better account of the risk that is posed to human health and the environment by daily exposure to a wide mix of chemicals from different sources;\n• Ensuring that producers and consumers have access to information on chemical content and safe use, by introducing information requirements in the context of the Sustainable Product Policy Initiative.\n\nMaking chemicals safer and more sustainable is a continued necessity as well as a great economic opportunity. The Strategy aims to capture this opportunity and enable the green transition of the chemicals sector and its value chains. As far as possible, new chemicals and materials must be safe and sustainable by design i.e. from production to end of life. This will help avoid the most harmful effects of chemicals and ensure the lowest possible impact on climate, resource use, ecosystems and biodiversity. The Strategy envisages the EU industry as a globally competitive player in the production and use of safe and sustainable chemicals. The actions announced in the Strategy will support industrial innovation so that such chemicals become the norm on the EU market and a benchmark worldwide. This will be done mainly by:\n• Developing safe-and-sustainable-by-design criteria and ensuring financial support for the commercialisation and uptake of safe and sustainable chemicals;\n• Ensuring the development and uptake of safe and sustainable-by-design substances, materials and products through EU funding and investment instruments and public-private partnerships;\n• Considerably stepping up enforcement of EU rules both at the borders and in the single market;\n• Putting in place an EU research and innovation agenda for chemicals, to fill knowledge gaps on the impact of chemicals, promote innovation and move away from animal testing;\n• Simplifying and consolidating the EU legal framework – e.g. by introducing the ‘One substance one assessment’ process, strengthening the principles of ‘no data, no market’ and introducing targeted amendments to REACH and sectorial legislation, to name a few.\n\nThe Commission will also promote safety and sustainability standards globally, in particular by leading by example and promoting a coherent approach aiming that hazardous substances that are banned in the EU are not produced for exports.\n\nExecutive Vice-President for the European Green Deal Frans Timmermans said: “The Chemicals Strategy is the first step towards Europe’s zero pollution ambition. Chemicals are part and parcel of our daily life, and they allow us to develop innovative solutions for greening our economy. But we need to make sure that chemicals are produced and used in a way that does not hurt human health and the environment. It is especially important to stop using the most harmful chemicals in consumer products, from toys and childcare products to textiles and materials that come in contact with our food”.\n\nCommissioner for the Environment, Oceans and Fisheries Virginijus Sinkevicius said: “We owe our well-being and high living standards to the many useful chemicals that people have invented over the past 100 years. However, we cannot close our eyes to the harm that hazardous chemicals pose to our environment and health. We have come a long way regulating chemicals in the EU, and with this Strategy we want to build on our achievements and go further to prevent the most dangerous chemicals from entering into the environment and our bodies, and affecting especially the most fragile and vulnerable ones.”\n\nCommissioner for Health and Food Safety Stella Kyriakides said: “Our health should always come first. That is exactly what we have ensured in a Commission flagship initiative such as the Chemical Strategy. Chemicals are essential for our society and they must be safe and sustainably produced. But we need to be protected from the harmful chemicals around us. This Strategy shows our high level of commitment and our determination to protect the health of citizens, across the EU.”\n\nIn 2018, Europe was the second biggest producer of chemicals (accounting for 16.9% of sales). Chemical manufacturing is the fourth largest industry in the EU, directly employing approximately 1.2 million people. 59% of chemicals produced are directly supplied to other sectors, incl. health, construction, automotive, electronics, and textiles. Global chemicals production is expected to double by 2030, and the already widespread use of chemicals is likely to also increase, including in consumer products.\n\nThe EU has a sophisticated chemicals legislation, which has generated the most advanced knowledge base on chemicals in the world and set up scientific bodies to carry out the risk and hazard assessments of chemicals. The EU has also managed to reduce the risks to people and the environment for certain hazardous chemicals like carcinogens.\n\nYet, EU’s chemicals policy needs to be further strengthened to take into account the latest scientific knowledge and citizens concerns. Many chemicals can harm the environment and human health, including future generations. They can interfere with ecosystems and weaken human resilience and capacity to respond to vaccines. Human biomonitoring studies in the EU point to a growing number of different hazardous chemicals in human blood and body tissue, including certain pesticides, biocides, pharmaceuticals, heavy metals, plasticisers and flame retardants. Combined prenatal exposure to several chemicals has led to reduced foetal growth and lower birth rates.\n\nCommunication on Chemicals Strategy for Sustainability: Towards a toxic-fee environment\n\nQuestions and Answers on Chemicals Strategy for Sustainability", "opengraph": {"locale": "en_US", "type": "article", "title": "EU Moves Towards a Toxic-Free Future with New Restrictions on Harmful Chemicals", "description": "Last week, the European Commission adopted the EU Chemicals Strategy for Sustainability. The Strategy is the first step towards a zero pollution ambition", "url": "https://sustainablepulse.com/2020/10/20/eu-moves-towards-a-toxic-free-future-with-new-restrictions-on-harmful-chemicals/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2020-10-20T16:52:17+00:00", "article:modified_time": "2020-10-20T16:57:07+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2020/10/toxic-free-EU.png", "image:width": "626", "image:height": "391"}, "tags": ["chemicals", "EU", "toxic free"], "tweets": [], "movies": [], "links": ["https://ec.europa.eu/environment/strategy/chemicals-strategy_en", "https://ec.europa.eu/info/strategy/priorities-2019-2024/european-green-deal_en", "https://detoxproject.org/testing/pesticides-in-hair/", "https://ec.europa.eu/environment/strategy/chemicals-strategy_en", "https://ec.europa.eu/commission/presscorner/detail/en/qanda_20_1840", "https://ec.europa.eu/commission/presscorner/detail/en/fs_20_1846"], "authors": [], "publish_date": "2020-10-20T16:52:17+00:00"}