{"result_id": "280007", "URL": "https://sustainablepulse.com/2018/04/20/california-defeats-monsanto-in-court-to-list-glyphosate-as-probable-carcinogen/", "timestamp": "2023-04-25 17:11:58 CEST+0200", "meta": {"description": "A California Appellate Court sided with the State of California and Center for Food Safety (CFS) on Thursday, affirming that Monsanto's glyphosate", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2018/04/20/california-defeats-monsanto-in-court-to-list-glyphosate-as-probable-carcinogen/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "California Defeats Monsanto in Court to List Glyphosate as Carcinogen", "cleaned_text": "A California Appellate Court sided with the State of California and Center for Food Safety (CFS) on Thursday, affirming that Monsanto’s glyphosate pesticide can be listed as a known carcinogen under Proposition 65.\n\nMonsanto’s lawsuit challenged the 2015 announcement by California’s Office of Environmental Health Hazard Assessment (OEHHA) that it intended to list glyphosate, the active ingredient in Monsanto’s herbicide, Roundup, under California’s landmark Proposition 65.\n\nProposition 65 requires notification and labeling of all chemicals known to cause cancer, birth defects or other reproductive harm, and prohibits their discharge into drinking waters of the state. CFS intervened in the case, defending the listing of glyphosate as a carcinogen and the public’s right to know when it is being exposed to cancer-causing chemicals.\n\n“This is a huge win for all Californians—and a huge loss for Monsanto—as it upholds our right to protect ourselves and our environment from unnecessary and unwanted exposure to the dangerous chemical, glyphosate,” said Adam Keats, senior attorney at CFS.\n\nGlyphosate is a broad spectrum herbicide that is widely used in agriculture, parks, home gardens, and residential landscapes. It is the most heavily used pesticide in the world, in large part due to the proliferation of Monsanto’s genetically engineered Roundup Ready crops that are resistant to glyphosate.\n\nIn 2015, the International Agency for Research on Cancer (IARC) of the World Health Organization (WHO) concluded that glyphosate is “probably carcinogenic.” California subsequently issued the notice of intent to list glyphosate as a Proposition 65 chemical based on the IARC finding. Under Proposition 65, no person in the course of doing business may knowingly or intentionally expose any individual to a chemical known to the state to cause cancer or reproductive toxicity without first giving a clear and reasonable warning. The discharge of such chemical into a source of drinking water is prohibited. With today’s court ruling, these protections will now be required for glyphosate products.\n\n“All California consumers have the right to know that glyphosate is considered a probable carcinogen, and Proposition 65 ensures that the public obtains that knowledge,” concluded Rebecca Spector, West Coast Director at Center for Food Safety. “We are pleased that the California Appellate Court prevented Monsanto’s attempt to keep the public in the dark about potential hazards from their products.”", "opengraph": {"locale": "en_US", "type": "article", "title": "California Defeats Monsanto in Court to List Glyphosate as Carcinogen", "description": "A California Appellate Court sided with the State of California and Center for Food Safety (CFS) on Thursday, affirming that Monsanto's glyphosate", "url": "https://sustainablepulse.com/2018/04/20/california-defeats-monsanto-in-court-to-list-glyphosate-as-probable-carcinogen/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2018-04-20T08:58:38+00:00", "article:modified_time": "2018-06-04T11:58:31+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2018/04/California1.jpg", "image:width": "600", "image:height": "452"}, "tags": ["Monsanto", "cancer", "glyphosate", "California Appellate Court", "products", "CFS", "Roundup Ready"], "tweets": [], "movies": [], "links": ["http://www.courts.ca.gov/opinions/documents/F075362.PDF", "https://oehha.ca.gov/proposition-65/crnr/notice-intent-list-tetrachlorvinphos-parathion-malathion-glyphosate", "https://detoxproject.org/testing/pesticides-in-hair/", "https://detoxproject.org/glyphosate-residue-free/verification-faqs/", "http://detoxproject.org/10-things-you-need-to-know-about-glyphosate/"], "authors": [], "publish_date": "2018-04-20T08:58:38+00:00"}