{"result_id": "280012", "URL": "https://sustainablepulse.com/2018/08/11/monsanto-loses-landmark-roundup-cancer-trial-set-to-pay-usd-280-million-in-damages/", "timestamp": "2023-04-25 17:12:06 CEST+0200", "meta": {"description": "Monsanto has lost a landmark cancer trial in San Francisco and has been ordered by the Judge to pay over USD 289 Million in total damages to the former", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2018/08/11/monsanto-loses-landmark-roundup-cancer-trial-set-to-pay-usd-280-million-in-damages/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Monsanto Loses Landmark Roundup Cancer Trial, Set to Pay USD 289 Million in Damages", "cleaned_text": "Monsanto has lost a landmark cancer trial in San Francisco and has been ordered by the Judge to pay over USD 289 Million in total damages to the former school groundskeeper Dewayne Johnson, a California father who has non-Hodgkin’s lymphoma, which was caused by Monsanto’s glyphosate-based weedkiller Roundup.\n\nJohnson, a father of three and former school groundskeeper, who doctors say may have just months to live, was the first person to take Monsanto to trial over allegations that the chemical sold under the Roundup brand causes cancer. About 4,000 other people in the U.S. claim in lawsuits they were sickened by Roundup.\n\nJohnson’s attorneys said he was diagnosed with non-Hodgkins Lymphoma after spraying the glyphosate-based Roundup weed killer for two and a half years.\n\nMonsanto is responsible for Dewayne “Lee” Johnson’s illness, suffering and reduced life expectancy because of the cancer-causing nature of its product, glyphosate-based weedkiller Roundup, the San Francisco Superior Court jury determined on Friday. The jury deliberated for three days after a four-week trial.\n\nThe damages included $2.3 million in economic losses, $37 million for pain and emotional distress and $250 million in punitive damages. The punitive damages were based on the jury’s unanimous finding that Monsanto had “acted with malice or oppression” toward Johnson.\n\nJohnson has undergone chemotherapy and is considering a bone-marrow transplant. One of his doctors testified that Johnson is unlikely to survive until 2020.\n\nThe verdict sends a message that Monsanto “acted with reckless disregard for human health,” said attorney Robert F. Kennedy Jr., a member of Johnson’s trial team. “It’s a strong message to the boardroom of Bayer/Monsanto that it’s got to change.”\n\nGlyphosate, the world’s leading herbicide, was classified as a probable human carcinogen in 2015 by the International Agency for Research on Cancer, an arm of the World Health Organization. Monsanto, now a subsidiary of Bayer, held the initial patent and remains the leading distributor.\n\nCo-lead trial counsel Brent Wisner said today’s verdict was a result of newly-revealed, confidential company documents.\n\n“We were finally able to show the jury the secret, internal Monsanto documents proving that Monsanto has known for decades that glyphosate and specifically Roundup could cause cancer. Despite the Environmental Protection Agency’s failure to require labeling, we are proud that an independent jury followed the evidence and used its voice to send a message to Monsanto that its years of deception regarding Roundup is over and that they should put consumer safety first over profits.”\n\nDamaging Evidence Presented in Johnson Trial Could Hurt Monsanto in Future Roundup Cancer Litigation\n\nFor years Monsanto has claimed that there is no evidence that Roundup causes cancer, yet a mountain of testimony and documents was admitted during the trial. Johnson’s attorneys proved through testimony from Monsanto’s witnesses that company employees “ghostwrote” scientific articles and paid outside scientists to publish the articles in their name.\n\nInternal documents revealed that a scientific advisor hired by Monsanto told the company that past testing for Roundup was insufficient because glyphosate, the active ingredient in Roundup, was tested in isolation without the other chemical ingredients that make up the Roundup formulation.\n\n“Many of these confidential Monsanto documents were unsealed for the first time,” said co-lead counsel David Dickens. “They show that Monsanto knew that its testing was insufficient and that there was a synergistic effect when glyphosate is combined with surfactants which help the glyphosate penetrate both plant and animal cell walls.”\n\nIn other now-public documents, Monsanto employees reacted to California EPA’s listing of glyphosate as a carcinogen by calling Californians “liberals and morons,” overwhelming Monsanto like a “zombie movie” that they had to take out one at a time starting with the 2016 presidential election.\n\nJury Heard Heart-Wrenching Testimony from the Johnson Family on the Effects of Non-Hodgkin’s Lymphoma Caused by Roundup Exposure\n\nIn addition to hearing from expert witnesses, the jury listened to heart-wrenching testimony from Lee Johnson and his wife, Araceli.\n\nAraceli recalled for the jury the many sleepless nights Lee spent crying in bed when his children were not around. “He tried to hide it, and I think he tried to show that he was strong,” she said. “He tried to be positive; he wanted to be…for us and the kids.”\n\nAfter her husband began chemotherapy, Araceli took a second job working 14-hour days to help pay the family’s rising medical bills while still driving her two sons an extra 45 minutes to Napa Valley School District in hopes of providing them better educational opportunities.\n\nWhen Lee took the stand, he told the jury how scared and confused he was after receiving the news that he had cancer. He also described the times he contacted Monsanto to see if the skin lesions he developed were related to his use of Roundup. When he did not hear back from the company, he continued to use the herbicide.\n\nMost notably, Johnson testified that he would never have used Roundup if he had known of the dangers, and accused Monsanto of concealing Roundup’s safety risks to continue profiting from its billion-dollar herbicide.\n\n“I never would’ve sprayed that product on school grounds or around people if I knew it would cause them harm,” Johnson said during emotional testimony. “It’s unethical. It’s wrong. People don’t deserve that.”\n\nA team of lawyers from three law firms represented Mr. Johnson in this trial: The Miller Firm, LLC of Orange, Virginia, Baum, Hedlund, Aristei & Goldman, P.C. of Los Angeles and Audet & Partners LLP of San Francisco. These firms represent thousands of Roundup cancer plaintiffs across the nation.\n\nThe firms are nationally known and handle complex product liability cases, among others, and hold leadership positions in the federal and California state Monsanto Roundup litigation.\n\nThe next Roundup cancer trial against Monsanto is also a state case and is scheduled to occur in October in St. Louis, Missouri. Now that the judge in the federal multi-district litigation (based in U.S. District Court for the Northern District of California in San Francisco), has accepted several of the plaintiffs’ experts to testify, trial dates for the federal bellwether cases should be announced in the next couple of months.", "opengraph": {"locale": "en_US", "type": "article", "title": "Monsanto Loses Landmark Roundup Cancer Trial, Set to Pay USD 289 Million in Damages", "description": "Monsanto has lost a landmark cancer trial in San Francisco and has been ordered by the Judge to pay over USD 289 Million in total damages to the former", "url": "https://sustainablepulse.com/2018/08/11/monsanto-loses-landmark-roundup-cancer-trial-set-to-pay-usd-280-million-in-damages/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2018-08-10T22:31:17+00:00", "article:modified_time": "2018-08-11T22:04:22+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2018/06/Dewayne.jpg", "image:width": "2000", "image:height": "1049"}, "tags": ["glyphosate trial", "Monsanto", "glyphosate", "cancer trial", "Monsanto cancer", "Dewayne Johnson", "Roundup trial"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/um00x2ElTWs?ecver=1\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/um00x2ElTWs?ecver=1"}], "links": ["https://detoxproject.org/certification/glyphosate-residue-free/", "https://detoxproject.org/testing/glyphosate-test-home-food/", "https://detoxproject.org/testing/pesticides-in-hair/", "https://sustainablepulse.com/2016/03/08/whos-cancer-agency-publishes-clear-qa-on-glyphosate/", "https://www.baumhedlundlaw.com/toxic-tort-law/monsanto-roundup-lawsuit/dewayne-johnson-v-monsanto-company/#exhibits", "https://sustainablepulse.com/2017/05/19/us-court-documents-show-monsanto-manager-led-cancer-cover-up-for-glyphosate-and-pcbs/#.W24cudUzbIU", "https://oehha.ca.gov/proposition-65/crnr/glyphosate-listed-effective-july-7-2017-known-state-california-cause-cancer", "https://sustainablepulse.com/2015/03/26/who-glyphosate-report-ends-thirty-year-cancer-cover-up/#.W24dWtUzbIV", "https://www.baumhedlundlaw.com/pdf/monsanto-documents/Monsanto-CA-State-Court-Johnson-Complaint.pdf", "https://millerfirmllc.com/", "https://www.baumhedlundlaw.com/toxic-tort-law/monsanto-roundup-lawsuit/", "http://audetlaw.com/"], "authors": [], "publish_date": "2018-08-10T22:31:17+00:00"}