{"result_id": "280006", "URL": "https://sustainablepulse.com/2015/07/14/food-disaster-republicans-stomp-on-gmo-labeling/", "timestamp": "2023-04-25 17:11:56 CEST+0200", "meta": {"description": "With no debate and only a voice vote, the U.S. House of Representatives Committee on Agriculture today (July 14, 2015) passed out of committee H.R. 1599,", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2015/07/14/food-disaster-republicans-stomp-on-gmo-labeling/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "Food Disaster: Republicans Stomp on GMO Labeling", "cleaned_text": "With no debate and only a voice vote, the U.S. House of Representatives Committee on Agriculture today (July 14, 2015) passed out of committee H.R. 1599, a bill to preempt states’ rights to label GMOs. Within hours, it was announced that the bill will go straight to the House floor, as early as next week, with no vote in the Energy and Commerce Committee.\n\nIf we don’t stop it in the House next week, the fight to stop this this “Mother of All Monsanto Protection Acts” will take place next in the U.S. Senate, before summer’s end.\n\nIn his opening statement this morning, Committee Chairman Rep. K. Michael Conaway (R-Texas) (who shortly after today’s vote said he will co-sponsor H.R. 1599) couldn’t have sounded more like a Monsanto employee if he’d tried. Conaway nailed the biotech industry’s favorite talking points and mistruths, beginning with this one:\n\nIn testimony before this Committee, multiple representatives of the food and agricultural sectors commented on the cost burden that would be placed on our food system if we were to allow the 50 States, more than 3000 counties and nearly 20,000 towns and cities in the United States to establish their own laws regulating interstate commerce.\n\nTime and again, independent experts have stated that the cost of labeling GMO foods and ingredients, to manufacturers, retailers and consumers, would be negligible here in the U.S., just as it has been in the more than 60 countries that already require labeling. GMO labels are costless, as pointed out in this Washington Post article. Companies regularly update their food packaging as they come up with new designs or marketing strategies.\n\nAnd then there was the ultimate lie about GMOs, that they have been “proven safe:”\n\nWe all recognize that the overwhelming consensus within the science community is that these biotech products are safe. We likewise understand that each and every biotech product in the marketplace today has been reviewed thorough a voluntary food safety consultation process at the Food and Drug Administration.\n\nWrong. Ever since GMOs were introduced into the food system in the 1990s, without adequate, independent, pre-market safety testing, there have been scientists and studies and mounds of anecdotal evidence suggesting they are unsafe. The American Medical Association believes GMO foods should be subjected to pre-market safety testing. And there is surely no consensus, as hundreds of scientists worldwide have confirmed, on the safety of GMOs that have already been approved. That is a flat-out lie.\n\nConaway spoke instead about the U.S. Food & Drug Administration’s “voluntary food safety consultation process” as if that were a valid means of proving safety.\n\nGlaringly absent from Conaway’s statement was any mention of the toxic chemicals used to grow GMO crops, and allowed to remain as residue on GMO foods. Not one word was spoken about the World Health Organization’s recent determination that glyphosate, the chemical used on more than 80 percent of GMO crops, is a probably human carcinogen.\n\nNone of these statements, coming from a lawmaker with ties to Big Ag, were particularly surprising. But what should concern any consumer ,voter, citizen or just plain common-sense thinking human being, is that Conaway’s statement clearly focused on how to promote the profits of corporations, rather than on how to protect people from foods that have not been proven safe, and the arsenal of toxic chemicals used to grow them. It was all about “marketing,” and how we need a government program for food producers who want to voluntarily label their products as GMO-free, or containing GMOs.\n\nUSDA’s Agricultural Marketing Service has long been in the business of assisting producers to develop programs and tools to take advantage of market opportunities. The Biotechnology, Horticulture and Research Subcommittee recently examined the programs of the Agricultural Marketing Service. The Subcommittee concluded that the agency has the resources and expertise to develop and administer a robust marketing program for those wishing to notify consumers of the presence or absence of genetically engineered ingredients in their food products. What the agency doesn’t have is the law to make it work uniformly across the country like we did 25 years ago when we passed the Organic Foods Production Act.\n\nNot one word on the devastation to the environment. Not one word on how chemical-intensive, fossil-fuel-intensive industrial agriculture is one of the largest contributors, if not the largest contributor, to global warming—and how if we don’t fix this system, we can’t be serious about averting a climate disaster.\n\nAs Pope Francis said recently, on the topic of genetic engineering and its use of toxic pesticides:\n\nIt creates a vicious circle in which the intervention of the human being to solve a problem often worsens the situation further. For example, many birds and insects die out as a result of toxic pesticides created by technology, they are useful to agriculture itself, and their disappearance will be compensated with another technological intervention that probably will bring new harmful effects… looking at the world we see that this level of human intervention, often in the service of finance and consumerism, actually causes the earth we live in to become less rich and beautiful, more and more limited and gray, while at the same time the development of technology and consumerism continues to advance without limits.\n\nH.R. 1599 is an assault on consumer rights, an assault on democracy and states’ rights. And if passed, it will only escalate the assault on our health, and the health of Planet Earth.\n\nPlease help us continue to fight this disastrous and undemocratic piece of legislation.", "opengraph": {"locale": "en_US", "type": "article", "title": "Food Disaster: Republicans Stomp on GMO Labeling", "description": "With no debate and only a voice vote, the U.S. House of Representatives Committee on Agriculture today (July 14, 2015) passed out of committee H.R. 1599, ", "url": "https://sustainablepulse.com/2015/07/14/food-disaster-republicans-stomp-on-gmo-labeling/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2015-07-14T20:44:33+00:00", "article:modified_time": "2015-07-14T21:23:33+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2015/07/Pompeo.jpg", "image:width": "775", "image:height": "518"}, "tags": ["vote", "today", "GMO Labeling", "products", "World Health Organization", "technology", "Food Drug Administration"], "tweets": [], "movies": [], "links": ["https://www.organicconsumers.org/campaigns/millions-against-monsanto/act-now-states%E2%80%99-rights-label-gmos-danger", "http://www.alternet.org/food/republicans-stomp-gmo-labeling", "https://agriculture.house.gov/opening-statements/opening-statement-chairman-k-michael-conaway-committee-agriculture-business-0", "http://www.washingtonpost.com/blogs/fact-checker/wp/2015/04/06/would-gmo-labeling-requirement-cost-500-more-in-groceries-per-family-a-year/", "http://www.ama-assn.org/resources/html/PolicyFinder/policyfiles/HnE/H-480.958.HTM", "http://www.enveurope.com/content/pdf/s12302-014-0034-1.pdfon%20safety", "http://www.thelancet.com/journals/lanonc/article/PIIS1470-2045%2815%2970134-8/fulltext", "https://www.opensecrets.org/politicians/summary.php?cid=N00026041#fundraising", "https://www.organicconsumers.org/essays/climate-catastrophe-surviving-21st-century-ronnie-cummins-and-will-allen", "https://sustainablepulse.com/2015/06/16/pope-francis-slams-gmos-and-pesticides-for-environmental-and-social-damage/", "https://www.organicconsumers.org/campaigns/millions-against-monsanto/act-now-states%E2%80%99-rights-label-gmos-danger"], "authors": [], "publish_date": "2015-07-14T20:44:33+00:00"}