{"result_id": "280015", "URL": "https://sustainablepulse.com/2015/12/16/us-congress-blocks-gmo-labeling-dark-act/", "timestamp": "2023-04-25 17:12:12 CEST+0200", "meta": {"description": "Center for Food Safety today praised the US Congress for not including a policy rider in the must-pass federal omnibus spending bill that would have", "lang": "en", "keywords": "", "favicon": "https://sustainablepulse.com/wp-content/uploads/SP_logo3_128.png", "canonical": "https://sustainablepulse.com/2015/12/16/us-congress-blocks-gmo-labeling-dark-act/", "encoding": "UTF-8"}, "image": null, "domain": "sustainablepulse.com", "title": "US Congress Blocks GMO Labeling DARK Act", "cleaned_text": "Center for Food Safety today praised the US Congress for not including a policy rider in the must-pass federal omnibus spending bill that would have blocked states from implementing mandatory genetically engineered (GE) food labeling laws.\n\nThree states, Connecticut, Maine and Vermont, have passed such laws, with Vermont’s slated be to be the first to go into effect in July 2016. All three democratically passed laws would have been nullified, while any future state GE labeling legislation would have been preempted. Over 30 states have introduced bills to labeling GE foods in just the past few years.\n\n“We are very pleased that Congress has apparently decided not to undermine Americans’ right to know about the food the purchase and feed their families,” said Andrew Kimbrell, executive director of Center for Food Safety. “Adding a rider to the budget bill that would nullify state laws requiring labeling and even forbidden federal agencies from mandating labeling would have been profoundly undemocratic and nothing short of legislative malfeasance. We will remain vigilant over the coming days and into the next legislative session to ensure our right to know is protected.”\n\nIn July, the House of Representatives passed H.R. 1599, dubbed by opponents the “Denying Americans the Right to Know (DARK) Act,” which preempts state and local authority to label and regulate GE foods. Instead, the bill sought to codify a voluntary labeling system approach, block FDA from ever implementing mandatory GE food labeling, and allow food companies to continue to make misleading “natural” claims for foods that contain GE ingredients. The Senate chose not to take up that bill, despite heavy pressure from the food and biotechnology industries.\n\nAnti-labeling interests then began pushing for the inclusion of the preemption rider in the must pass spending bill. Numerous Senators vocally opposed the inclusion of the preemption rider, successfully keeping it out of the bill. In particular, Senators Blumenthal (D-CT), Markey (D-MA), Sanders (D-VT), Leahy (D-VT), Reed (D-RI), Heinrich (D-NM), Warren (D-MA), Tester (D-MT), Merkley (D-OR), Boxer (D-CA) and Booker (D-NJ) led a Dear Colleague letter opposing the rider. Senate Appropriations Committee Vice Chairwoman Mikulski (D-MD) also worked to keep the rider out.\n\n“In the absence of federal leadership, states have led the way by passing legislation intended to prevent consumer deception and give consumers the right to know,” said Kimbrell. “We thank those Members of Congress, as well as the thousands of Americans who contacted their Senators recently, for preventing this grossly unethical rider from seeing daylight.”\n\nThe omnibus spending bill does include language directing the Food and Drug Administration (FDA) to develop guidelines for mandatory labeling of GE salmon and prevent its sale until such labeling is in effect.\n\n​”As of right now, the newly approved GE salmon could be deceptively marketed as ‘Atlantic salmon’ to consumers. We are pleased the Senate had the wisdom to include language to correct this so that consumers are not denied important information,” said Jaydee Hanson, senior policy analyst at Center for Food Safety.\n\nBy an overwhelming margin, American voters say consumers should have the right to know if their food is genetically modified, with 89 percent in support of mandatory GE labeling, according to a new national poll. Nearly the same number of consumers would like to see the labels in an easy to read format.\n\nCenter for Food Safety supports bipartisan legislation introduced by Senator Boxer and Representative DeFazio called the Genetically Engineered Food Right-to-Know Act, which would require that food manufacturers label foods that contain genetically modified ingredients. This common sense bill would guarantee all Americans the right to know what is in their foods while respecting the need by companies for a uniform, federal standard.", "opengraph": {"locale": "en_US", "type": "article", "title": "US Congress Blocks GMO Labeling DARK Act", "description": "Center for Food Safety today praised the US Congress for not including a policy rider in the must-pass federal omnibus spending bill that would have", "url": "https://sustainablepulse.com/2015/12/16/us-congress-blocks-gmo-labeling-dark-act/", "site_name": "Sustainable Pulse", "article:publisher": "https://facebook.com/SustainablePulse/", "article:author": "https://www.facebook.com/SustainablePulse/", "article:published_time": "2015-12-16T20:37:38+00:00", "article:modified_time": "2015-12-16T20:38:08+00:00", "image": "https://sustainablepulse.com/wp-content/uploads/2015/12/US-Congress-680x352.jpg", "image:width": "680", "image:height": "352"}, "tags": ["GE", "Jaydee Hanson", "Food Safety", "Andrew Kimbrell", "Dear Colleague", "Numerous Senators", "legislation"], "tweets": [], "movies": [], "links": ["http://www.centerforfoodsafety.org/issues/976/ge-food-labeling/state-labeling-initiatives", "http://www.centerforfoodsafety.org/issues/976/ge-food-labeling/press-releases/3994/house-of-representatives-ignores-will-of-the-people-in-passage-of-anti-labeling-dark-act", "http://www.centerforfoodsafety.org/press-releases/4131/fda-approves-first-genetically-engineered-animal-for-human-consumption-over-the-objections-of-millions", "http://www.centerforfoodsafety.org/issues/976/ge-food-labeling/press-releases/4150/new-poll-nearly-nine-in-10-americans-want-labels-on-gmo-food"], "authors": [], "publish_date": "2015-12-16T20:37:38+00:00"}