{"result_id": "281029", "URL": "https://swprs.org/more-injections-more-infections/", "timestamp": "2023-04-25 17:13:12 CEST+0200", "meta": {"description": "Do covid vaccinations drive covid infections?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/more-injections-more-infections/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "More Injections, More Infections?", "cleaned_text": "One year ago, in July 2021, some independent covid analysts noted that in Europe, countries with high covid vaccination rates had much higher covid infection rates than countries with low vaccination rates. They proposed that covid vaccinations might perhaps drive covid infections.\n\nYet this was not the case. Instead, the European delta wave simply followed the typical respiratory virus regional pattern, moving from Western Europe to Eastern Europe, and Western Europe happened to have higher covid vaccination rates than Eastern Europe. Indeed, just a few weeks later covid infections peaked in Eastern Europe at even higher levels than in Western Europe.\n\nTo make the false correlation work, the analysts at the time had to ignore several Eastern European countries with high vaccination rates – notably Hungary, Poland and the Czech Republic – as these countries had the same low infection rates as other Eastern European countries.\n\nIn the US, the delta summer wave started in southern states with rather low vaccination rates, and some journalists were quick to claim low vaccination rates were driving infections. When infections moved north, these journalists fell silent or invoked seasonality.\n\nOne year later, the “more injections, more infections” hypothesis is back. Indeed, both in the US and in Europe, there is once again a correlation between higher vaccination rates and higher infection rates, even within some countries. Is negative vaccine effectiveness finally a reality?\n\nThis time around, the situation is a bit more complex. As the European chart above shows, the typical west-east pattern is still at play: the two high-infection outliers, Denmark and Portugal, are typical European covid forerunners (they already “survived” the latest omicron wave); in contrast, the low-infection low-vaccination outliers are again all in Eastern Europe and they are yet to see the latest omicron wave. Hungary is once again breaking the correlation.\n\nBut there are three additional aspects that must be taken into account: first, countries with high vaccination rates tend to be richer and tend to test more; second, vaccinated and boosted people tend to test more than unvaccinated “honey badgers”; and third, vaccinated and boosted people are protected against infection for some months, but then “catch up” with already recovered people, who enjoy a much more durable protection.\n\nIf these factors are taken into account, the seemingly negative vaccine effectiveness disappears. The best place to study this is Denmark, which provides test-adjusted infection rates per age group and vaccination status in non-recovered people (see charts below). But even in places like Israel and Britain, as soon as one adjusts for test rates, the correlations disappear (see below).\n\nIn Germany, it was noted that in late June and early July, four eastern German states had both lower infection rates and lower vaccination rates. Yet these states had higher infection (and death) rates during previous covid waves (delta and omicron), and by mid-July, the striking geographic correlation had already started to disappear. Nevertheless, all of this data confirms that after a few months, vaccine effectiveness is indeed approaching zero.\n\nThere have also been claims that countries with high vaccination rates are seeing ever higher infection waves, whereas this is supposedly not the case in countries with low vaccination rates (e.g. in South Africa). But this assertion – to the extent it is correct – doesn’t prove negative vaccine effectiveness, either.\n\nBy late 2021, countries with low vaccination rates – e.g. in Eastern Europe, Latin America, or Africa – had already much higher population infection rates (50%-80%) than countries with high vaccination rates (e.g. in Western Europe, East Asia, Australia and New Zealand; 0%-40%).\n\nIndeed, already a year ago SPR could predict that the pandemic would turn into a “pandemic of the vaccinated”, as unvaccinated recovered people enjoyed a very robust protection against reinfection, whereas vaccinated people were faced with rapidly waning protection against infection. Only the synthetic and immune-escaping omicron variant has managed to significantly increase reinfections in recovered people and forestall the “pandemic of the vaccinated”.\n\nThus, even strong omicron waves in Asian and Western countries do not indicate negative vaccine effectiveness. There is one exception to this, though: vaccinating into an emerging or ongoing covid wave really appears to increase infections (and even deaths), possibly because in many people covid vaccination causes a transient immune suppression lasting about a week. Two classic examples of this “post-vaccination peak” effect have been vaccination forerunners Israel and Chile.\n\nFinally, there have also been claims, based on data from the Netherlands and from the Canadian province of Manitoba, that covid vaccines provide negative protection against severe disease (i.e. they increase hospitalizations). But this is not the case, either.\n\nIn the case of Manitoba, the data was from May, when there were essentially no infections and vaccine effectiveness naturally converges towards zero. In the case of the Netherlands, the raw data was not adjusted for already recovered people; even so, the Dutch data still showed a 75% booster effectiveness against severe covid (but no effectiveness one year after two doses).\n\nA truly negative vaccine effectiveness would require some kind of permanent immune suppression or immune disregulation that causes infection or severe disease at lower viral loads than normal. While antigenic imprinting (OAS) is real – both in vaccinated and in previously infected people – there is currently no evidence that this has led to negative protection (though it could happen).\n\nIn conclusion, there is still no evidence of true negative vaccine effectiveness, neither against infection nor against severe disease. However, because of rapid immunity waning and testing effects, covid cases are higher in vaccinated than in already recovered people.\n\nMoreover, because of the older age of vaccinated and boosted people, and because of the limited effectiveness of vaccines against severe disease (50%-80% rather than 95%), the vast majority of hospitalized covid patients are indeed vaccinated/boosted people (see charts below).\n\nTaken together, it may appear as if covid vaccines are a complete failure, even though this is still not the case. Nevertheless, outside of actual high-risk groups – i.e. people at high risk of severe acute covid – covid vaccines really show no benefit, but may cause some serious adverse events.\n\nA) Booster rate by 01/2022 vs. cases in 2022 (correlation)\n\nB) Booster rate by 01/2022 vs. test positivity (no correlation)\n\nA) Lower infection rates in four eastern German states. These states had higher infection rates in previous waves, and the effect started to disappear by mid-July. In terms of deaths, eastern Germany is still worse off than western Germany (details).\n\nA) Vaccination rate per age group. Above 65, the booster rate (dark blue) is almost 100%.\n\nB) PCR test rates per vaccination status: Boosted people (green) and vaccinated people (blue) tend to test more than unvaccinated people (orange).\n\nC) Test-adjusted infection rates: No significant differences in people aged 6 to 60. Above 60, the booster rate is almost 100%. Note that these charts exclude recovered people.\n\nD) Hospitalization rates per vaccination status (relative and absolute). 1) A recent booster dose still provides protection, but in people younger than 60, absolute protection becomes very small; 2) because of their age, most hospitalized patients are boosted (green).", "opengraph": {"locale": "en_US", "type": "article", "title": "More Injections, More Infections?", "description": "Do covid vaccinations drive covid infections?", "url": "https://swprs.org/more-injections-more-infections/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-07-31T17:08:33+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/europe-vaccination-cases-2022.jpg?fit=1200%2C670&ssl=1", "image:width": "1200", "image:height": "670", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/europe-vaccination-cases-2022.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/more-injections-more-infections/", "https://www.facebook.com/share.php?u=https://swprs.org/more-injections-more-infections/", "https://t.me/share/url?url=https://swprs.org/more-injections-more-infections/", "https://swprs.org/delta-europe-vaccination/", "https://swprs.org/the-nine-great-covid-mysteries/#6-coronavirus-transmission-large-scale", "https://swprs.org/delta-europe-vaccination/#update-september-2021", "https://swprs.org/delta-europe-vaccination/", "https://swprs.org/delta-europe-vaccination/#update-september-2021", "https://twitter.com/holmenkollin/status/1547991506039889922#m", "https://twitter.com/holmenkollin/status/1547991506039889922#m", "https://www.youtube.com/watch?v=4r7wHMg5Yjg", "https://covid19danmark.dk/#testjusteret-smittetal-opdelt-p%C3%A5-vaccinationsstatus", "https://twitter.com/OS51388957/status/1549735752279511040#m", "https://www.eugyppius.com/p/robert-koch-institut-appears-to-agree", "https://interaktiv.tagesspiegel.de/lab/karte-sars-cov-2-in-deutschland-landkreise/", "https://twitter.com/holmenkollin/status/1547995770682429441#m", "https://swprs.org/studies-on-covid-19-lethality/", "https://swprs.org/die-gefahrlichen-geimpften/", "https://swprs.org/the-power-of-natural-immunity/", "https://swprs.org/secrets-of-the-pandemic/", "https://swprs.org/covid-vaccines-and-cancer/", "https://swprs.org/israel-highest-infection-rate-in-the-world/", "https://dailysceptic.org/2022/07/11/chile-higher-vaccination-rate-than-uk-large-spike-in-excess-mortality/", "https://dailysceptic.org/2022/07/16/vaccine-effectiveness-turns-negative-against-serious-disease-and-death-data-from-the-netherlands-and-canada-show/", "https://www.gov.mb.ca/health/publichealth/surveillance/covid-19/index.html", "https://www.rivm.nl/covid-19-vaccinatie/bescherming-coronavaccins-tegen-ziekenhuisopname/booster-en-herhaalprik-bij-ouderen-nodig-om-bescherming-op-peil-te-brengen", "https://en.wikipedia.org/wiki/Original_antigenic_sin", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/covid-vaccine-adverse-events/", "#annex-1-israel", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/israel-third-dose-infections.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/israel-third-dose-test-pos.png?ssl=1", "#annex-2-germany", "https://interaktiv.tagesspiegel.de/lab/karte-sars-cov-2-in-deutschland-landkreise/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/germany-east-west-rki.webp?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/germany-states-cases.jpg?ssl=1", "#annex-3-denmark", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/dk-vaccination-rates-age-groups.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/dk-test-rate-age-vaccination.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/dk-test-adjusted-infections.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/dk-hosp-vaccination-absolute.png?ssl=1", "#see-also", "https://swprs.org/the-nine-great-covid-mysteries/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/vaccines-successes-and-controversies/", "https://twitter.com/intent/tweet?url=https://swprs.org/more-injections-more-infections/", "https://www.facebook.com/share.php?u=https://swprs.org/more-injections-more-infections/", "https://t.me/share/url?url=https://swprs.org/more-injections-more-infections/"], "authors": [], "publish_date": null}