{"result_id": "281043", "URL": "https://swprs.org/omicron-update/", "timestamp": "2023-04-25 17:13:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/omicron-update/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Omicron Neutralization Update", "cleaned_text": "Important new data on Omicron neutralization in vaccinated vs. recovered people.\n\nProfessor Alex Sigal of the African Health Research Institute in Durban, South Africa, has presented the first data on Omicron neutralization in Pfizer vaccine study participants, both with and without previous infection (see preprint study).\n\nAs the figure above shows, Omicron neutralization in vaccinated people without prior infection (red) decreased to very low levels (a 41-fold decline compared to the initial Wuhan D614G variant). In contrast, neutralization in previously infected plus vaccinated people (green) remained relatively high and is “likely to confer protection from severe disease”, according to the authors.\n\nRecovered people without vaccination have not been considered in this study, but previous studies found no significant benefit of vaccination in recovered people. Moreover, a recent Dutch study found that “in contrast to vaccine-induced immunity, no increased risk for reinfection with Beta, Gamma or Delta variants relative to Alpha variant was found in individuals with infection-induced immunity.”\n\nRegarding the new Omicron study, three additional aspects are noteworthy:\n\n1) The plasma of vaccinated people was taken on average just 12 days post-vaccination, i.e. at the point of highest antibody levels and neutralization effectiveness (see table below). In people vaccinated months ago, neutralization may no longer be detectable (see updates below).\n\n2) In previously infected people, the plasma was taken a full 417 days post-infection and 27 days post-vaccination, on average (see table below). Despite this, previously infected people still had much higher neutralization levels.\n\n3) In this Pfizer vaccine study, previously infected people had been infected during the first South African wave, which was dominated by the initial Wuhan D614G variant without any antibody escape mutations. However, the second South African wave was dominated by the Beta variant, which features both a class 1 (K417N) and a class 2 (E484K) antibody escape mutation (see table below). Thus, people previously infected with the Beta variant are likely to have even stronger protection against Omicron, which features escape mutations against antibody classes 1, 2, and 3.\n\nThis extra-protection may also apply to people in Latin America who were previously infected with the Gamma (Brazilian) variant, but not to people in the US and in Europe who were infected with the Wuhan/D614G (2020), Alpha (spring 2021) or Delta (summer 2021) variant.\n\nIn addition, previously infected people may benefit from mucosal and T-cell immunity, which could not be taken into account in the current South African study, either. While it has been reported that PCR-positive hospitalizations in South Africa are currently increasing again, it should be noted that a full 76% of these patients were in fact hospitalized not due to covid.\n\nThere have been reports that Omicron might be milder than previous variants. While this would be fantastic news, one should take into account that these reports are based primarily on 1) people in South Africa, most of whom already have natural immunity from previous infection (60% to 80% of the population; only 25% vaccination rate), and 2) non-elderly people (e.g. travelers), in whom covid has always been rather mild anyway (despite relentless propaganda to convince you otherwise).\n\nThe question of disease severity can only really be answered once Omicron reaches high-risk groups. In general, the fact that Omicron is able to displace Delta (even in Europe) indicates that Omicron is currently at least as transmissible as Delta, which in turn requires rather high peak viral loads and infectiousness. Unless other mutations reduce host impact, this would not indicate lower virulence. Instead, it is reasonable to assume that virulence may be similar to previous variants.\n\nIn conclusion, unless Omicron turns out to be much milder than previous variants, it is evident that current covid vaccines will have to be updated. The fact that current vaccines are no longer effective against Omicron (based on EUA standards) also means that any existing “vaccine passport” schemes and vaccine mandates have become obsolete and have to be suspended immediately.\n\nUltimately, only widespread natural immunity will be able end the covid pandemic. The fact that millions of “unvaccinated” people are currently being threatened with losing their jobs, regardless of their actual immunity status, can only be described as a crime against humanity. Moreover, the fact that young people have been pressured to take an experimental – and now ineffective – vaccine, against a virus that poses very little risk to them, can only be described as a major medical crime.\n\nFinally, the arrival of immune-escape variants once again highlights the importance of early outpatient treatment of high-risk covid patients, regardless of their vaccination status.\n\nUpdate I: A new German analysis confirms 0% neutralization six months after vaccination with Astra-Zeneca, Biontech or Moderna, and only 25% three months after a Biontech booster (vs. 95% against Delta). Furthermore, available monoclonal antibodies show no effectiveness against Omicron.\n\nUpdate II: A new Swedish Omicron neutralization study in 17 previously-infected hospital workers and 17 recent blood donors in Stockholm found that neutralization was only about 7-fold lower compared to the original Wuhan variant. Given that Stockholm has an infection rate of about 75%, this study again confirms the robust protective effect of naturally-acquired immunity.\n\nUpdate III: Many news reports argue that the South African, Swedish and German Omicron neutralization studies appear to contradict each other. But as the analysis above shows, this is not the case: rather, the studies differ in terms of previous infections (yes/no) and date of plasma sample (shortly after vaccination vs. six months after vaccination).\n\nUpdate IV: Independent genetic researchers note that the Omicron variant, with its many spike protein mutations, might in fact have escaped from the Durban lab in South Africa, which has been involved in immune escape and serial passaging cell culture experiments for quite some time.\n\nUpdate V: A 40-fold reduction in neutralization is not equivalent to a 40-fold reduction in vaccine effectiveness. However, previous studies have shown that “neutralizing antibody levels are highly predictive of immune protection from symptomatic SARS-CoV-2 infection”. Based on the available data, one can estimate that the current Pfizer vaccine will achieve an effectiveness against symptomatic infection of at most 30%. Effectiveness against severe disease may or may not be higher. In the worst case, non-neutralizing antibodies might even enhance infection (ADE).\n• The return of the flu", "opengraph": {"locale": "en_US", "type": "article", "title": "Omicron Neutralization Update", "description": "Important new data on Omicron neutralization in vaccinated vs. recovered people.", "url": "https://swprs.org/omicron-update/", "site_name": "Swiss Policy Research", "article:modified_time": "2021-12-09T20:31:33+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/omicron-neutralization-data-sigal.png?fit=1135%2C535&ssl=1", "image:width": "1135", "image:height": "535", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/omicron-neutralization-data-sigal.png?ssl=1", "https://t.me/share/url?url=https://swprs.org/omicron-update/", "https://twitter.com/intent/tweet?url=https://swprs.org/omicron-update/", "https://www.facebook.com/share.php?u=https://swprs.org/omicron-update/", "https://www.documentcloud.org/documents/21150195-medrxiv-2021-267417v1-sigal", "https://www.documentcloud.org/documents/21150195-medrxiv-2021-267417v1-sigal", "https://www.medrxiv.org/content/10.1101/2021.06.01.21258176v3", "https://www.medrxiv.org/content/10.1101/2021.11.24.21266735v1", "https://www.cidrap.umn.edu/news-perspective/2021/12/report-south-africas-omicron-hot-spot-spurs-cautious-optimism", "https://brownstone.org/articles/hospitals-should-hire-not-fire-nurses-with-natural-immunity/", "https://swprs.org/on-the-treatment-of-covid-19/", "https://twitter.com/CiesekSandra/status/1468465347519041539", "https://twitter.com/BenjMurrell/status/1468341478363746310", "https://swprs.org/studies-on-covid-19-lethality/", "https://twitter.com/ydeigin/status/1467006051358810112", "https://www.nature.com/articles/s41591-021-01377-8", "https://en.wikipedia.org/wiki/Antibody-dependent_enhancement", "#figures", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/omicron-sigal-data.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/11/coronavirus-variants-antibody-classes-escape-november-2021.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/omicron-calculated-antibody-binding-bloom.jpg?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/neutralization-protection.png?ssl=1", "#see-also", "https://swprs.org/omicron-hits-the-mutation-jackpot/", "https://swprs.org/the-return-of-the-flu/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://t.me/share/url?url=https://swprs.org/omicron-update/", "https://twitter.com/intent/tweet?url=https://swprs.org/omicron-update/", "https://www.facebook.com/share.php?u=https://swprs.org/omicron-update/"], "authors": [], "publish_date": null}