{"result_id": "281042", "URL": "https://swprs.org/the-wef-and-the-pandemic/", "timestamp": "2023-04-25 17:13:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/the-wef-and-the-pandemic/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "The WEF and the Pandemic", "cleaned_text": "How is the Davos World Economic Forum involved in the coronavirus pandemic?\n\nThe Davos World Economic Forum (WEF) is a premier forum for governments, global corporations and international entrepreneurs. Founded in 1971 by engineer and economist Klaus Schwab, the WEF describes its mission as “shaping global, regional and industry agendas” and “improving the state of the world”. According to its website, “moral and intellectual integrity is at the heart of everything it does.”\n\nThe WEF has been involved in the coronavirus pandemic in several ways.\n\nFirst, the WEF was, together with the Gates Foundation, a sponsor of the prescient “Event 201” coronavirus pandemic simulation exercise, held in New York City on October 18, 2019 – the same day as the opening of the Wuhan Military World Games, seen by some as a possible “ground zero” of the global pandemic.\n\nSecond, the WEF has been a leading proponent of digital biometric identity systems, arguing that they will make societies and industries more efficient, more productive and more secure. In July 2019, the WEF started a project to “shape the future of travel with biometric-enabled digital traveler identity management”. In addition, the WEF collaborates with the ID2020 alliance, which is funded by the Gates and Rockefeller foundations and runs a program to “provide digital ID with vaccines”. In particular, ID2020 sees the vaccination of children as “an entry point for digital identity.”\n\nThird, WEF founder Klaus Schwab is the author of the book COVID-19: The Great Reset, published in July 2020, which argues that the coronavirus pandemic can and should be used for an “economic, societal, geopolitical, environmental and technological reset”, including, in particular, advancing global governance, accelerating digital transformation, and tackling climate change.\n\nFinally, the WEF has been running, since 1993, a program called “Global Leaders for Tomorrow”, rebranded, in 2004, as “Young Global Leaders”. This program aims at identifying, selecting and promoting future global leaders in both business and politics. Indeed, quite a few “Young Global Leaders” have later managed to become Presidents, Prime Ministers, or CEOs (see below). In a speech in 2017, WEF founder Klaus Schwab described this process as “penetrating the Cabinets”.\n\nDuring the coronavirus pandemic, several WEF Global Leaders and Global Shapers (a junior program of the Global Leaders) have played prominent roles, typically promoting zero-covid strategies, lockdowns, mask mandates, and ‘vaccine passports’. This may have been a (largely failed) attempt to protect public health and the economy, or it may have been an attempt to advance the global transformation agenda outlined above, or perhaps both.\n\nIn this regard, some notable Young Leaders include Jeffrey Zients (US White House Coronavirus Response Coordinator), Stéphane Bancel (CEO of Moderna), Jeremy Howard (founder of influential lobby group “Masks for All”), Leana Wen (zero-covid CNN medical analyst), Eric Feigl-Ding (zero-covid Twitter personality), Gavin Newsom (Governor of California, selected in 2005), Devi Sridhar (British zero-covid professor), Jacinda Ardern (Prime Minister of New Zealand), Greg Hunt (Australian Health Minister and former WEF strategy director), French President Emanuel Macron, Austrian Chancellor Sebastian Kurz, German Chancellor Angela Merkel (selected in 1993), German Health Minister Jens Spahn, and former British Prime Minister Tony Blair (a leading proponent of ‘global vaccine passports’). Canadian Prime Minister Justin Trudeau has been a WEF keynote speaker.\n\nTo get a full overview of their members, see Global Leaders for Tomorrow and Young Global Leaders on WikiSpooks (a Wiki focusing on covert power structures) as well as the official Young Global Leaders website. For an overview of some notable members in politics and the media, see below.\n\nIn conclusion, the Davos World Economic Forum has indeed been involved in the strategic management of the coronavirus pandemic, with a major emphasis on using the pandemic as a catalyst for digital transformation and the global introduction of digital identity systems.\n\nDigital Identity: The 2018 vision of the World Economic Forum\n\nAn overview of some WEF Young Global Leaders (2005-2021) and Global Leaders for Tomorrow (1993-2003) in politics and the media. The list is not exhaustive.\n\nSources: Global Leaders for Tomorrow and Young Global Leaders on WikiSpooks.\n\nCalifornia Governor Gavin Newsom (selected in 2005), Pete Buttigieg (Presidential candidate in 2020, Secretary of Transportation since 2021, selected in 2019), Chelsea Clinton (Clinton Foundation board member), Huma Abedin (Hillary Clinton aide, selected in 2012), Nikki Haley (US ambassador to the UN, 2017-2018), Samantha Power (US ambassador to the UN, 2013-2017, USAID Administrator since 2021), Ian Bremmer (founder of Eurasia Group), Bill Browder (initiator of the Magnitsky Act), Jonathan Soros (son of George Soros), Kenneth Roth (director of “Human Rights Watch” since 1993), Paul Krugman (economist, selected in 1995), Lawrence Summers (former World Bank Chief Economist, former US Treasury Secretary, former Harvard University President, selected in 1993), Alicia Garza (co-founder of Black Lives Matter, selected in 2020), Stéphane Bancel (Moderna CEO), Jeffrey Zients (White House Coronavirus Response Coordinator, selected in 2003).\n\nCNN host Fareed Zakaria (2001), CNN anchor Anderson Cooper (2008), CNN chief medical correspondent Sanjay Gupta (2010), Andrew Ross Sorkin (New York Times, 2007), Thomas Friedman (New York Times, 1995), George Stephanopoulos (ABC News, 1993), Lachlan Murdoch (CEO of Fox Corporation, 1997), Maria Bartiromo (Fox Business).\n\nMicrosoft founder Bill Gates (1993), former Microsoft CEO Steven Ballmer (selected in 1995), Amazon founder Jeff Bezos (1998), Google co-founders Sergey Brin and Larry Page (2002/2005), former Google CEO Eric Schmidt (2001-2017, selected in 1997), Wikipedia co-founder Jimmy Wales (2007), PayPal co-founder Peter Thiel (2007), eBay co-founder Pierre Omidyar (1999), Facebook founder and CEO Mark Zuckerberg (2009), Facebook COO Sheryl Sandberg (2007), Google Jigsaw CEO Jared Cohen (2014).\n\nNotes: US congresswoman Tulsi Gabbard and US entrepreneur Elon Musk were nominated as WEF Young Global Leaders but apparently never participated in the program (1, 2).\n\nProfessor Devi Sridhar (a leading ‘zero covid’ proponent, selected in 2020/21), former British Prime Ministers Tony Blair and Gordon Brown (both selected in 1993), BBC World Service journalist Dawood Azami, Lynn Forester de Rothschild (co-owner of The Economist), Nathaniel Rothschild (son of Lord Rothschild), historian Niall Ferguson (selected in 2005), William Hague (Foreign Secretary, 2010-2014), Charles Allen (CEO of ITV, 2004-2007; Chairman of EMI, 2008-2010).\n\nNew Zealand Prime Minister Jacinda Ardern (since 2017, selected in 2014) and Australian Health Minister Greg Hunt (selected in 2003; former WEF strategy director).\n\nIn a speech in 2017, WEF founder Klaus Schwab mentioned Canada as an example of how the WEF “penetrated the Cabinets” and said that Canadian Prime Minister Justin Trudeau and “more than half of his Cabinet” were Young Global Leaders (1:08:30), but this may have been an exaggeration.\n\nJustin Trudeau has been a WEF keynote speaker, but he is not a confirmed Young Global Leader. Confirmed Young Global Leaders in his Cabinets since 2015 include Deputy PM Chrystia Freeland (selected in 2001; former managing director of Reuters and a member of the WEF Board of Trustees), Minister of Foreign Affairs Mélanie Joly (2016), President of the Treasury Board Scott Brison (2005), Minister of Immigration Sean Fraser (2022), and Minister of families Karina Gould (2020).\n\nOther Cabinet members were speakers at the annual WEF meeting in Davos. Mark Carney, former Governor of the Bank of Canada, is a member of the WEF Board of Trustees. Dominique Anglade, member of the Quebec Parliament, is also a Young Global Leader (2014).\n\nChancellor Angela Merkel (selected in 1993, 12 years before becoming Chancellor), current Health Minister Jens Spahn and former Health Ministers Philipp Roesler and Daniel Bahr, current co-chair of the Green Party and failed Chancellor candidate Annalena Baerbock (selected in 2020), former co-chair of the Green Party Cem Özdemir (selected in 2002), media mogul and Axel Springer CEO Mathias Doepfner (selected in 2001), talk show host Sandra Maischberger, late Foreign Minister and Vice Chancellor Guido Westerwelle (1997), former German President Christian Wulff (selected in 1995, 15 years before becoming President), Reto Francioni (former CEO of Deutsche Boerse).\n\nEU Commission Presidents Jose Manuel Barroso (2004-2014, selected in 1993) and Jean-Claude Juncker (2014-2019, selected in 1995), French President Emanuel Macron (since 2017, selected in 2016), former French President Nicolas Sakozy (2007-2012, selected in 1993), Austrian Chancellor Sebastian Kurz, former Italian Prime Minister Matteo Renzi (2014-2016, selected in 2012), former Spanish Prime Ministers José Maria Aznar (1996-2004, selected in 1993) and José Luis Zapatero (2004-2011, selected in 2001), Klaus Regling (CEO of the European Financial Stability Mechanism), Belgian Prime Minister Alexander de Croo (since 2020, selected in 2015), Guy Verhofstadt (former Belgian Prime Minister, Chair of the Brexit Steering Group), Danish Minister for the Environment Lea Wermelin, Finnish Prime Minister Sanna Marin, former Finnish Prime Minister Alexander Stubb, and Mark Leonard (founding director of the Soros-funded European Council on Foreign Relations).\n\nNatalie Rickli (Director of Health of the Canton of Zurich, selected in 2012), former Presidents of the Swiss National Council Christa Markwalder (selected in 2011) and Pascale Bruderer-Wyss (selected in 2009), Geneva politician Pierre Maudet (selected in 2013), NZZ media group CEO Felix R. Graf (selected in 2007), former Swiss Justice Minister Ruth Metzler (selected in 2002), former Swiss television CEO Roger de Weck (2011-2017, selected in 1994), former UBS CEOs Peter Wuffli (selected in 1994) and Marcel Rohner (selected in 2003), former Credit Suisse CEO Tidjane Tiam (1998), Swiss tennis player Roger Federer (selected in 2010), Patrick Chappatte (2006; news media cartoonist).\n\nIn a speech in 2017, WEF founder Klaus Schwab mentioned Russian President Vladimir Putin as a Young Global Leader, but Putin is not mentioned on any archived member list of the Global Leaders. Putin was attending a 1992 WEF meeting in St. Petersburg, where he was head of the Committee for External Relations of the Mayor’s Office at the time.\n\nRussian entrepreneur Pavel Durov, founder of social media platforms VKontakte and Telegram, was mentioned on the WEF website as a Young Global Leader in 2017, but he is not listed (anymore) in the official Young Global Leaders membership directory.\n\nKirill Dmitriev (CEO of the Russian Direct Investment Fund) and Tigran Khudaverdian (Deputy CEO of IT company Yandex) are confirmed WEF Young Global Leaders from Russia. Furthermore, Herman Gref, CEO and Chairman of Russian Sberbank, was a member of the WEF Board of Trustees, but was removed in March 2022 after Russia invaded Ukraine.\n\nCrown Princess Victoria of Sweden, Crown Prince Haakon of Norway, Crown Prince Fredrik of Denmark, Prince Jaime de Bourbon de Parme (Netherlands), Queen Rania of Jordan, Princess Reema Bint Bandar Al-Saud, Queen Lalla Salma of Morocco, King Wangchuck of Bhutan.\n\nThe 2005 WEF Young Global Leaders Nomination Committee consisted primarily of major media publishers and editors, including Arthur Sulzberger and Steve Forbes (USA); James Murdoch, Jonathan Rothermere and Tom Glocer (UK); Arnaud Lagardère (France); Mathias Doepfner and Hubert Burda (Germany); Michael Ringer (Switzerland); and Carl-Johan Bonnier (Sweden).\n• Was the mother of WEF founder Klaus Schwab a member of the Rothschild dynasty? No.\n• Was the father of Klaus Schwab a high-ranking National Socialist or Wehrmacht general? No.\n• Was the founding of the WEF an initiative of the US Council on Foreign Relations? Possible.\n• Is Canadian Prime Minister Justin Trudeau the son of Fidel Castro? Possible. (more)\n\n2) Edward Snowden warning of the “destruction of rights” (March 2020)", "opengraph": {"locale": "en_US", "type": "article", "title": "The WEF and the Pandemic", "description": "How is the Davos World Economic Forum involved in the coronavirus pandemic?", "url": "https://swprs.org/the-wef-and-the-pandemic/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-12-27T10:00:39+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/10/klaus-schwab-wef-2014.jpg?fit=1300%2C729&ssl=1", "image:width": "1300", "image:height": "729", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"736\" height=\"414\" src=\"https://www.youtube.com/embed/-pcQFTzck_c?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/-pcQFTzck_c?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"736\" height=\"414\" src=\"https://www.youtube.com/embed/NXyzpMDtpSE?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/NXyzpMDtpSE?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/10/klaus-schwab-wef-2014.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/the-wef-and-the-pandemic/", "https://www.facebook.com/share.php?u=https://swprs.org/the-wef-and-the-pandemic/", "https://t.me/share/url?url=https://swprs.org/the-wef-and-the-pandemic/", "https://www.weforum.org/about/world-economic-forum", "https://www.centerforhealthsecurity.org/event201/", "https://www.nzherald.co.nz/world/covid-19-coronavirus-allegations-of-first-superspreader-event-occurred-at-wuhan-military-games-in-october-2019/45ILL7HBJGKJ5WYC4SFUZWZEFA/", "https://www.weforum.org/agenda/archive/digital-identity", "https://www.biometricupdate.com/201907/wttc-and-world-economic-forum-partner-to-share-information-and-promote-biometric-travel", "https://id2020.org/certification", "https://www.biometricupdate.com/201909/id2020-and-partners-launch-program-to-provide-digital-id-with-vaccines", "https://medium.com/id2020/immunization-an-entry-point-for-digital-identity-ea37d9c3b77e", "https://www.weforum.org/agenda/2020/06/now-is-the-time-for-a-great-reset/", "https://www.younggloballeaders.org/", "https://youtu.be/AoBRnrtX9U4?t=4105", "https://masks4all.co/about-us/", "https://reason.com/2021/09/10/cnn-leana-wen-unvaccinated-travel-outdoor-ban/", "https://twitter.com/DrEricDing", "https://en.wikipedia.org/wiki/Devi_Sridhar", "https://wikispooks.com/wiki/Greg_Hunt", "https://www.thelondoneconomic.com/politics/tony-blair-says-global-vaccine-passports-are-inevitable-and-invaluable-220609/", "https://www.weforum.org/people/justin-trudeau", "https://wikispooks.com/wiki/WEF/Global_Leaders_for_Tomorrow", "https://wikispooks.com/wiki/WEF/Young_Global_Leaders", "https://www.younggloballeaders.org/community", "#digital-identity-the-2018-vision-of-the-world-economic-forum", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/10/wef-digital-identity-diagram-2018.png?ssl=1", "#wef-young-global-leaders", "https://wikispooks.com/wiki/WEF/Global_Leaders_for_Tomorrow", "https://wikispooks.com/wiki/WEF/Young_Global_Leaders", "#united-states", "https://swprs.org/the-magnitsky-act-movie/", "https://pamho.medium.com/tulsi-gabbard-and-the-world-economic-forum-the-whole-story-4fca2e9fbf7d", "https://twitter.com/elonmusk/status/1606559431881285632#m", "#great-britain", "#australia-and-new-zealand", "https://wikispooks.com/wiki/Greg_Hunt", "#canada", "https://youtu.be/AoBRnrtX9U4?t=4105", "https://www.weforum.org/people/justin-trudeau", "https://www.weforum.org/about/leadership-and-governance", "https://www.weforum.org/agenda/authors/mark-carney/", "#germany", "#european-union", "https://ecfr.eu/council/#council-members", "#switzerland", "https://en.wikipedia.org/wiki/Patrick_Chappatte", "#russia", "https://youtu.be/AoBRnrtX9U4?t=4105", "https://www3.weforum.org/docs/WEF_First40Years_Book_2010.pdf#page=124", "https://web.archive.org/web/20170629170213/https://widgets.weforum.org/ygl-2017/", "https://www.younggloballeaders.org/community", "https://web.archive.org/web/20220221173606/https://www.weforum.org/agenda/authors/herman-gref", "#royals", "#2005-ygl-nomination-committee", "https://web.archive.org/web/20051029192824/younggloballeaders.org/scripts/page8094.html", "#fact-checks", "https://checkyourfact.com/2022/01/28/fact-check-klaus-schwab-mother-rothschild/", "https://www.newsweek.com/fact-check-was-davos-founder-klaus-schwabs-father-hitlers-confidant-1710381", "https://unlimitedhangout.com/2022/03/investigative-reports/dr-klaus-schwab-or-how-the-cfr-taught-me-to-stop-worrying-and-love-the-bomb/", "https://medium.com/@leibowitt/of-course-fidel-castro-is-justin-trudeaus-dad-nobody-has-debunked-anything-4db6fc8a9042", "https://gummibear737.substack.com/p/deep-dive-is-fidel-castro-the-father", "#video-annex", "#1-bill-gates-demanding-digital-immunity-proof-in-march-2020-source", "https://www.youtube.com/watch?v=JDjw8-3VZp8", "#2-edward-snowden-warning-of-the-destruction-of-rights-march-2020", "#3-the-chinese-social-credit-system-may-2019", "#further-reading", "https://unlimitedhangout.com/2020/04/investigative-series/all-roads-lead-to-dark-winter/", "#see-also", "https://swprs.org/the-vaccine-passport-agenda/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://swprs.org/covid-vaccine-adverse-events/", "https://twitter.com/intent/tweet?url=https://swprs.org/the-wef-and-the-pandemic/", "https://www.facebook.com/share.php?u=https://swprs.org/the-wef-and-the-pandemic/", "https://t.me/share/url?url=https://swprs.org/the-wef-and-the-pandemic/"], "authors": [], "publish_date": null}