{"result_id": "281020", "URL": "https://swprs.org/how-real-is-2022-excess-mortality/", "timestamp": "2023-04-25 17:13:01 CEST+0200", "meta": {"description": "How real is reported excess mortality in 2022, and what may be causing it?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/how-real-is-2022-excess-mortality/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "How Real Is 2022 Excess Mortality?", "cleaned_text": "How real is reported excess mortality in 2022, and what may be causing it?\n\nIn several countries there have been reports of mysterious excess mortality since early 2022 not explained by official covid deaths. Possible explanations include unreported omicron deaths, European heat wave deaths, covid health sequelae, lockdown-related healthcare disruptions, vaccine-related deaths, but also statistical artifacts due false baselines and predictions.\n\nIn the following brief analysis, several key countries and aspects will be reviewed.\n\nIn a previous analysis, it was shown that supposed “record excess mortality” in European children was neither an omicron apocalypse nor a vaccine massacre, but a simple EuroMomo baseline mistake. Choosing the correct baseline, there has been no 2022 excess mortality among European children at all, despite omicron infections and covid vaccination.\n\nFigure: No excess mortality among European children in 2022 (more).\n\nIn Switzerland, several major news outlets recently reported that there was mysterious “record summer excess mortality” for “eleven weeks in a row”. Yet a look at Swiss mortality per age group shows that with the exception of the 85+ age group, there has been no excess mortality at all; in fact, in people younger than 65, mortality has been below average (see chart below).\n\nThe excess mortality in very senior citizens (85+) coincided with three heat waves between June and August and an omicron wave that stretched from June to August. There were also a few booster vaccinations between June and August that reached about 3% of the population.\n\nWhy did Swiss media think that there was record excess mortality in the entire 65+ age group? Because the Swiss Federal Office of Statistics assumed that after the covid pandemic, fewer people than normal would die, and so they lowered the mortality baseline and interpreted normal mortality as excess mortality. But this assumption may not necessarily be justified (see discussion below).\n\nSwitzerland is an interesting case because it’s the only country that primarily used the high-dosed Moderna mRNA vaccine (two thirds Moderna, one third Pfizer), with three doses of Moderna equaling nine doses of Pfizer in terms of the amount of mRNA. Thus, the fact that there has been no excess mortality in people below 65 or even 75 in 2022 is quite reassuring.\n\nFigure: Swiss mortality per age group (2015-2022). Compare to official BFS chart.\n\nEast Asian countries are important points of reference because they had little or no covid in 2020 and 2021, but high vaccination rates and strong omicron waves in 2022. How does excess mortality look like in these countries?\n\nThe following charts show reported covid deaths (black) and actual excess deaths (red) in Japan, South Korea, Taiwan, and Singapore. These charts reveal that:\n• There were no or few excess deaths in 2020 and 2021, and excess deaths were occurring in parallel with covid outbreaks (mostly delta outbreaks in 2021).\n• There is no significant excess mortality linked to vaccination and booster campaigns in 2021, even though some cases of post-vaccination deaths were reported.\n• There is significant excess mortality in parallel to strong omicron waves in 2022.\n• Already during previous covid outbreaks, and especially during recent omicron waves, there was significant under-reporting of covid-related deaths.\n\nThis pattern speaks against large-scale vaccine-related mortality and in favor of significant omicron mortality, including unaccounted-for omicron-related deaths.\n\nIndeed, Japan recently confirmed that about 90% of omicron deaths – mostly among senior citizens – didn’t develop fatal pneumonia, but instead died of pre-existing health conditions that worsened during the omicron infection. Many of these deaths were not recorded as omicron deaths.\n\nSimilary, Singapore reported that “the gap between official death toll and estimated excess deaths can be explained by deaths in patients recently infected with COVID-19 in the past 90 days. In a secondary analysis of persons without recent infection, no additional excess deaths were found.”\n\nSome British statistics appear to show that there have been almost 20,000 mysterious excess deaths since the spring of 2022. But a look at English mortality per age group shows that in people above 65, mortality has been mostly normal, with the exception of a small uptick in people 85+ in July that coincided with a record heat wave in Britain (see chart below).\n\nHowever, in people aged 15-64, mortality does seem to have run a bit high since June. A closer look shows that it is people aged 45 to 64 in England, but not in Scotland, that have been dying at somewhat elevated rates since June. Intriguingly, already in 2020 and 2021, this age group was showing excess mortality in England, in contrast to most other European countries.\n\nThus, this phenomenon may be an English peculiarity, possibly linked to the situation in the English healthcare system. At any rate, a British analyst previously noted that overall British excess mortality in 2022 largely disappears if adjustment for ageing and the correct mortality baseline are applied.\n\nThe United States has suffered about 1.2 million excess deaths since January 2020, driven mostly by covid, but also by a record increase in drug overdoses.\n\nThe mortality analysis per age group shows that the US experienced a severe omicron wave in early 2022, but since then, mortality has mostly normalized in most age groups. A notable exception is the 15 to 64 age group, which continues to show above-average mortality. This raises some serious questions in terms of drug overdoses or healthcare disruptions. In recent months, the 85+ age group also does seem to show some elevated mortality.\n\nIn the Netherlands, there have also been reports of unusual excess mortality in recent months. A closer look at mortality per age group shows that true excess mortality has been limited to the 80+ age group, and within that age group, to nursing home residents (see charts below), although mortality in the 65 to 80 age group is also running somewhat above average.\n\nIn 2022, the Netherlands experienced two heat waves in July and August, and three omicron waves: two strong ones in February and March and a weaker one in July. In addition, between February and August 2022, the Netherlands administered booster vaccinations to about 5% of the population.\n\nImportantly, the Netherlands and many other Western countries stopped mass-testing in early 2022, and test positivity rates have since strongly increased to up to 70%, which means that there is significant under-reporting of covid cases and likely also of covid deaths (as in Asia).\n\nFigure: Dutch Mortality per age group (left) and in care homes (right).\n\nSpain saw a very large omicron wave in January 2022 that caused some excess mortality especially in senior citizens. Since then, Spain experienced three additional excess mortality peaks in May, June, and July/August. These peaks were most pronounced in very senior citizens (85+), but they were also visible in younger age groups.\n\nSpain had three major heat waves in June, July and August, and two smaller omicron waves that peaked in May and July. These events may likely explain most of the 2022 excess mortality peaks. There was a booster campaign from January to February (20% of the population), but between March and August, only about 5% of the population received a booster vaccine.\n\nExcess mortality in Germany is very difficult to estimate due to various special factors (e.g. national-socialist baby boom 90 years ago, war deaths 80 years ago, massive immigration since 2015). For instance, the WHO initially calculated a higher 2020/21 excess mortality in Germany than in Britain, but then had to lower the German value by a factor of two.\n\nIn their latest update, the German Office of Statistics noted that there was some excess mortality in the months of June, July and August 2022 (see chart below). They noted that the peak was in the last week of July, which was also the peak of the heat wave and and the peak of (registered) omicron deaths. These two aspects may explain large parts of German excess mortality.\n\nIn addition, between March and August 2022, Germany administered booster vaccinations to about 10% of its population.\n\nAustralia has seen significant excess mortality in 2022, driven mostly by three large omicron waves peaking in January, April/May, and July. In October/November 2021 there was already a smaller delta wave in parts of Australia.\n\nDoes Australian excess mortality in 2022 prove that mRNA covid vaccines failed? Not really, because covid vaccines were not developed against the omicron variant; rather, the omicron variant was likely developed – as part of vaccine research – to achieve maximum immune escape. In addition, very senior citizens and obese people – i.e. those most at risk of covid – unfortunately show the weakest response to covid vaccination (and vaccination in general).\n\nNevertheless, since 2020 Australia still has suffered five times fewer covid deaths than Britain or the United States, though mainly by avoiding the early hard-hitting coronavirus variants.\n\nFigure: Australian mortality until May 2022 (July/August peak not yet shown)\n\nSeveral large studies have shown that people who survived severe or even moderate covid experience significantly elevated morbidity (health issues) and mortality in the months and years after the acute disease. Thus, it is to be expected that mortality may remain elevated after covid infections, especially among senior citizens.\n\nSome studies on post-covid morbidity and mortality:\n\nThere have also been reports of a dramatic increase in cancer deaths in 2022, but this is not currently backed by the data; rather, it looks like cancer deaths continue to follow their linear pre-pandemic upward trend (see US chart below).\n\nBritish mortality data doesn’t show increased cancer deaths in 2022, either, though some experts suspect they could emerge later on. In addition, one may wonder if there shouldn’t be fewer cancer deaths than normal, given the many previous covid deaths in senior citizens.\n\nShould there be fewer deaths than normal?\n\nAs stated above, the Swiss Federal Office of Statistics assumed that because of previous covid deaths, there should be fewer deaths than normal in the summer of 2022. But this assumption is not necessarily justified.\n\nThose covid victims who had already been in their very last weeks or months of life (e.g. in nursing homes, up to 50% of all covid deaths) were “missing” in mortality statistics immediately after a covid wave; in Switzerland, this was in May 2020, in February 2021 and in February 2022.\n\nThose unfortunate covid victims who died from covid many years before their natural life expectancy (e.g. a 65-year-old with obesity or other major risk factors) won’t be missing in mortality statistics until many years later.\n\nBut those covid victims who were in their last year or years of life will not necessarily be missing in the summer after a covid wave; more likely, they will be missing in the next winter season.\n\nIndeed, after a strong flu season, one does not usually see negative excess mortality during summer, but instead a weak flu season in the following winter (see chart below).\n\nThus, the assumption that a severe covid wave in winter would result in below-average mortality in summer is not necessarily justified, and can lead to “phantom excess mortality”.\n\nFigure: English weekly mortality since 1992. Note that after a strong flu wave, mortality in summer is not lower, but the flu wave in the next winter is often (but not always) weaker.\n\nOverall, it looks like excess mortality in 2022 is primarily a combination of large omicron waves, European heat waves, and “phantom excess mortality” due to false baselines. Actual excess mortality has affected primarily the most senior citizens (80+ in Western Europe).\n\nHowever, in places like the United States and England, there seems to be a real above-average mortality in age groups below 65, which could point to lockdown-related healthcare disruptions or, in the US, a continued drug overdose crisis. The possibility of covid health sequelae shouldn’t be disregarded, either, as several studies found increased mortality after severe covid.\n\nNevertheless, vaccine-related short-term and long-term excess deaths remain a possibility. For instance, doctors in Canada and in Germany reported severe cardiovascular reactions after booster shots in nursing home residents. Switzerland and other countries saw unexplained excess deaths during the booster campaign last winter (but it could have been unregistered covid deaths).\n\nIn addition, covid vaccines can cause a broad spectrum of non-lethal adverse events, including neurological, immunological and cardiovascular adverse events. But as shown above, in most Western countries there has been no excess mortality in children and in adults below 65 (or even 75) in 2022, which speaks against significant vaccine-related excess deaths.\n\nYou have been reading: How real is 2022 excess mortality?\n\n An analysis by Swiss Policy Research.", "opengraph": {"locale": "en_US", "type": "article", "title": "How Real Is 2022 Excess Mortality?", "description": "How real is reported excess mortality in 2022, and what may be causing it?", "url": "https://swprs.org/how-real-is-2022-excess-mortality/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-09-19T10:14:52+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/global-excess-deaths-economist.jpg?fit=1559%2C589&ssl=1", "image:width": "1559", "image:height": "589", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/global-excess-deaths-economist.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/how-real-is-2022-excess-mortality/", "https://www.facebook.com/share.php?u=https://swprs.org/how-real-is-2022-excess-mortality/", "https://t.me/share/url?url=https://swprs.org/how-real-is-2022-excess-mortality/", "#european-children", "https://swprs.org/good-news-eu-kids-mortality-remains-normal/", "https://swprs.org/good-news-eu-kids-mortality-remains-normal/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/euromomo-0-14-adjusted-mortality-groundwater-2.jpg?ssl=1", "#switzerland", "https://www.20min.ch/story/3000-todesfaelle-mehr-als-erwartet-uebersterblichkeit-gibt-raetsel-auf-655376235646", "https://wetteralarm.ch/blog/sommer_2022.html", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=asc&pickerMetric=location&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ECHE", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Vaccine+booster+doses&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ECHE", "https://www.20min.ch/story/das-sind-moegliche-gruende-fuer-die-hohe-uebersterblichkeit-649048244966", "https://www.covid19.admin.ch/en/vaccination/persons?vaccPersonsRel=abs", "https://www.bfs.admin.ch/bfs/en/home/statistics/health/state-health/mortality-causes-death.assetdetail.23366493.html", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/switzerland-mortality-piani-1.jpg?ssl=1", "#asian-countries", "https://www.coronaheadsup.com/asia/japan/japan-far-higher-ratio-of-people-dying-after-moderate-covid-infections/", "https://www.moh.gov.sg/docs/librariesprovider5/resources-statistics/reports/report-on-excess-mortality-during-the-covid-pandemic-18sep2022.pdf", "https://github.com/dkobak/excess-mortality/tree/main/img/tracking", "https://swprs.org/how-real-is-2022-excess-mortality/japan-mortality/", "https://swprs.org/how-real-is-2022-excess-mortality/south-korea-mortality/", "https://swprs.org/how-real-is-2022-excess-mortality/taiwan-mortality/", "https://swprs.org/how-real-is-2022-excess-mortality/singapore-mortality/", "#great-britain", "https://dailysceptic.org/2022/09/08/excess-non-covid-deaths-hit-16600-in-18-weeks-as-investigators-ask-is-it-vaccine-or-virus/", "https://www.euromomo.eu/graphs-and-maps/", "https://dailysceptic.org/2022/08/29/is-there-an-excess-deaths-crisis-in-england", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/england-mortality-piani.jpg?ssl=1", "#united-states", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/us-mortality-piani.jpg?ssl=1", "#the-netherlands", "https://www.cbs.nl/en-gb/news/2022/36/again-excess-mortality-in-all-weeks-but-lower-in-august", "https://www.dutchnews.nl/news/2020/08/its-official-the-netherlands-is-gripped-by-a-heatwave-that-could-last-eight-days/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ENLD", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Vaccine+booster+doses&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ENLD", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=asc&pickerMetric=location&Metric=Share+of+positive+tests&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ENLD", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/netherlands-mortality-age-groups.jpg?ssl=1", "#spain", "https://en.wikipedia.org/wiki/2022_European_heat_waves#Spain", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7EESP", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Vaccine+booster+doses&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=%7EESP", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/spain-mortality-age-groups.jpg?ssl=1", "#germany", "https://swprs.org/the-lockdown-skeptics-at-the-who/", "https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Sterbefaelle-Lebenserwartung/sterbefallzahlen.html", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Vaccine+booster+doses&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=%7EDEU", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/germany-mortality-2022.jpg?ssl=1", "#australia", "https://www.stopgof.com/english/omicron-origin/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&facet=none&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=AUS%7EGBR%7EUSA", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/All-deaths-COVID-19-infections-Australia-31-May-2021-29-May-2022-vs-baseline-benchmarks.png?ssl=1", "#post-covid-deaths", "https://www.nature.com/articles/s41586-021-03553-9", "https://www.frontiersin.org/articles/10.3389/fmed.2021.778434/full", "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1003871", "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004052", "#cancer-deaths", "https://www.covid-datascience.com/post/evaluating-claims-of-excess-cancer-deaths-in-the-usa-during-the-pandemic", "https://dailysceptic.org/2022/09/08/excess-non-covid-deaths-hit-16600-in-18-weeks-as-investigators-ask-is-it-vaccine-or-virus/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/usa-cancer-deaths-morris.webp?ssl=1", "#should-there-be-fewer-deaths-than-normal", "https://github.com/dkobak/excess-mortality/blob/main/img/tracking/Switzerland.png", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/uk-mortality-1992.png?ssl=1", "#conclusion", "https://westphaliantimes.com/canadian-province-stops-giving-boosters-to-elders-who-have-had-covid-in-the-past-due-to-severe-life-threatening-side-effects/", "https://www1.wdr.de/nachrichten/ruhrgebiet/probleme-nach-drittimpfung-bei-senioren-100.html", "https://github.com/dkobak/excess-mortality/blob/main/img/tracking/Switzerland.png", "https://swprs.org/covid-vaccine-adverse-events/", "#references", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://www.economist.com/graphic-detail/coronavirus-excess-deaths-estimates", "https://www.euromomo.eu/graphs-and-maps/", "#see-also", "https://swprs.org/studies-on-covid-19-lethality/", "https://swprs.org/obesity-and-the-pandemic-new-insights/", "https://swprs.org/why-covid-19-is-a-strange-pandemic/", "https://twitter.com/intent/tweet?url=https://swprs.org/how-real-is-2022-excess-mortality/", "https://www.facebook.com/share.php?u=https://swprs.org/how-real-is-2022-excess-mortality/", "https://t.me/share/url?url=https://swprs.org/how-real-is-2022-excess-mortality/"], "authors": [], "publish_date": null}