{"result_id": "281023", "URL": "https://swprs.org/vaccine-passport-agenda/", "timestamp": "2023-04-25 17:13:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/vaccine-passport-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "The \"Vaccine Passport\" Agenda", "cleaned_text": "SPR and other independent geopolitical analysts have been arguing since the early days of the coronavirus pandemic that the pandemic might be used as a pretext or catalyst to impose a global digital biometric identity system, introduced as “vaccine passports”, that may later be expanded into a Chinese-style “social credit” population control system.\n\nIn particular, NSA whistleblower Edward Snowden warned already back in March 2020 of the “permanent destruction of rights” and the creation of an “architecture of oppression”. Japan-based geopolitical analyst, James Corbett, highlighted the fact that governments around the world have been busy building extensive technical infrastructure that is unlikely to get dismantled anytime soon.\n\nWhile “vaccine passports” have of course been entirely ineffective and indeed counterproductive at the medical level, this doesn’t really matter at the strategic level, if their primary strategic purpose is to introduce QR-based or even RFID-based identity systems that may later be linked to other personal health and financial data as well as to digital currencies and payment systems.\n\nIndeed, in February 2021, digital identity lobby group ID2020, funded by the Gates Foundation and the Rockefeller Foundation, created the “Good Health Pass” collaboration that currently includes 125 member corporations from the fields of technology, health, transport and payment systems. In September, the collaboration urged US President Biden in an open letter to “recognize the need for verifiable digital health passes as a precursor to large scale vaccination and testing mandates.”\n\nIn August, the WHO published a document, sponsored by the Gates Foundation and the Rockefeller Foundation, detailing technical specifications for the global implementation of “vaccine certificates”, as outlined already back in March 2020 by Bill Gates himself. Of note, the five WHO project managers developing the technical specifications previously worked for the Gates Foundation or the Rockefeller Foundation or for other projects funded by one of these foundations.\n\nFrench government and defense industry contractor, Thales Group, described “vaccine passports” as “a precursor to digital ID wallets, offering citizens unparalleled convenience and security.”\n\nIn the European Union, which had been planning the introduction of “vaccine passports” since 2018, EU Commission president von der Leyen argued that the EU “must consider mandatory covid vaccinations”, despite the fact that EMA still hasn’t fully approved the vaccines, and the use of all of these vaccines has already been suspended or restricted in several countries over safety concerns.\n\nIn general, the fact that millions of “unvaccinated employees” are threatened with losing their jobs – regardless of their actual immunity status and the fact that natural immunity provides far better protection than vaccination – is another indication that strategic objectives appear to be more important than actual medical or epidemiological considerations. For instance, English care homes recently had to suspend 50,000 unvaccinated employees, jeopardizing the care of 30,000 residents.\n\nThe global nature of this campaign might explain why even in a country like Sweden, which has managed the coronavirus pandemic without any major restrictions, the government in November suddenly decided to introduce “vaccine passes” for some indoor events (even excluding recovered people). In fact, Sweden might quickly turn from a bastion of lockdown resistance into a pioneer of “more secure and easier” RFID-based identity systems (i.e. implantable microchips).\n\nFinally, the Russian Federation, seen by some as a geopolitical alternative to the Western system, is also rapidly moving towards vaccine mandates and national QR “health passes”. The main difference appears to be that in Russia, vaccine certificates are more likely to be fake – despite the fact that Russia has already reached a total pandemic excess mortality of about one million people.\n\nOverall, it looks like many governments are focused not primarily on a rational and evidence-based response to the pandemic, but on maintaining the narrative of a heroic fight against the pandemic and “the unvaccinated” – a narrative that may later be written into history books. The digital identity agenda is using this “public health” narrative as a shield to neutralize or break resistance.\n\nNevertheless, in many countries significant civilian, political or legal resistance has formed against the introduction of vaccine mandates and “vaccine passports”. Many Western countries have been seeing some of the largest political protests in decades, though often ignored, downplayed or vilified by corporate and government-controlled media (see social media channels below).\n\nHowever, in contrast to general strikes or civilian “color revolutions”, mere protests have often been rather ineffective politically. In fact, an Australian professor, writing on the Global Agenda blog of the World Economic Forum, recommended framing “vaccine passports” as “freedom passes” to “divide the opposition” while simply ignoring “noisy protestors” (the article was later removed).\n\nIn some countries, though, opposition to vaccine mandates or “vaccine passports” has reached the highest political or judicial sphere. Some notable examples include the United States, Canada, Spain, Switzerland, some Eastern European countries, and Brazil.\n\nIn the US, federal judges have blocked or suspended four of five national vaccine mandates that would have affected federal employees, government contractors, companies with more than 100 employees, and most healthcare workers. In addition, several US states have prohibited the use of “vaccine passports”. On the other hand, states like New York have enacted far-reaching vaccine mandates, and foreign national air travelers to the US are required to be “fully vaccinated”.\n\nIn Canada, the Premier of Ontario had to rescind a vaccine mandate for healthcare workers, admitting that it would have resulted in the “potential departure of tens of thousands of health-care workers.” On the other hand, the Canadian government recently made “full vaccination” a mandatory requirement for all air and rail travel (beginning at age 12) – again ignoring the medical evidence that vaccination simply doesn’t prevent infection and transmission.\n\nIn Spain, federal courts have rejected several proposals to introduce regional or national “vaccine passports”, calling them “ineffective and unconstitutional”. Spanish courts also declared the 2020 lockdowns as unconstitutional and ordered the government to return all fines to citizens. However, some regional “covid passport” schemes have recently been approved by Spanish courts.\n\nIn Switzerland, there recently was a national referendum on “covid passports”. While citizens below 40 mostly rejected them, citizens over 65 overwhelmingly supported them, having been told by the government that they would help protect them. Thus, the new law was accepted by 62% overall.\n\nIn some Eastern European countries, interest in covid vaccines was so low that governments had to suspend their vaccination campaigns, despite some of the highest covid death rates in the world. In Croatia, 2500 former military and policemen have formed a “volunteer battalion”, to “send a message to the ruling party that they oppose vaccine passports.” (video)\n\nIn Brazil, president Bolsonaro appears to strongly oppose “covid passports”, having described them as a “leash” and adding that “I would rather die than lose my freedom.” However, it looks like Bolsonaro has limited influence over some major cities like Rio de Janeiro, which have decided to introduce a vaccine mandate for various places, including tourist attractions.\n\nOverall, it seems evident that this is a fight not over some public health policy technicalities, but over fundamental political conceptions and the future of Western and indeed global society.\n\nDoes the “vaccine passport” strategic agenda indicate that the coronavirus pandemic itself is in fact a pre-planned “plandemic”, engineered simply to enforce global biometric identity systems while claiming to protect citizens from a virus? From a purely scientific perspective, this indeed remains a distinct possibility. The genetic evidence shows that the novel coronavirus is likely lab-engineered (about 90% probability). Such a lab-related scenario is consistent with either a Chinese lab leak (similar to many previous lab leaks), or with a premeditated release disguised as a Chinese lab leak (similar to the 2001 “anthrax letter” operation, already linked to covid), or some combination thereof.\n• The WEF and the Pandemic", "opengraph": {"locale": "en_US", "type": "article", "title": "The \"Vaccine Passport\" Agenda", "description": "\"Vaccine passports\": saving or enslaving humanity?", "url": "https://swprs.org/vaccine-passport-agenda/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-03-21T14:31:44+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/10/panic-totalitarianism-1.png?fit=960%2C450&ssl=1", "image:width": "960", "image:height": "450", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/share/url?url=https://swprs.org/the-covid-vaccine-war/", "https://twitter.com/intent/tweet?url=https://swprs.org/the-covid-vaccine-war/", "https://www.facebook.com/share.php?u=https://swprs.org/the-covid-vaccine-war/", "https://swprs.org/facts-about-covid-19-archive/#covid-19-and-mass-surveillance", "https://www.youtube.com/watch?v=NXyzpMDtpSE", "https://www.youtube.com/watch?v=-pcQFTzck_c", "https://www.youtube.com/watch?v=du5k1BrG8eE", "https://www.corbettreport.com/digitalid/", "https://www.newsweek.com/leaked-uk-government-doc-claims-vaccine-passports-could-actually-cause-covid-spread-1642685", "https://www.newsweek.com/people-get-microchips-implanted-that-include-vaccine-records-amid-new-covid-restrictions-1655916", "https://www.goodhealthpass.org/members", "https://www.goodhealthpass.org/advocay", "https://www.who.int/publications/i/item/WHO-2019-nCoV-Digital_certificates-vaccination-2021.1", "https://www.youtube.com/watch?v=JDjw8-3VZp8", "https://twitter.com/machtwach/status/1453442774133616641", "https://twitter.com/ThalesDigiSec/status/1425351446573297667", "https://off-guardian.org/2020/05/22/report-eu-planning-vaccination-passport-since-2018/", "https://www.theguardian.com/world/2021/dec/01/eu-must-consider-mandatory-covid-jabs-says-von-der-leyen", "https://www.bloomberg.com/news/articles/2021-10-08/iceland-joins-nordic-peers-in-halting-moderna-covid-vaccinations", "https://www.riotimesonline.com/brazil-news/modern-day-censorship/taiwan-suspends-pfizers-second-dose-covid-vaccine-for-adolescents-over-heart-risks/", "https://www.nakedcapitalism.com/2021/10/things-are-getting-messy-in-draghis-italy.html", "https://swprs.org/the-power-of-natural-immunity/", "https://www.theguardian.com/world/2021/nov/10/care-homes-in-england-set-to-lose-50000-staff-as-covid-vaccine-becomes-mandatory", "https://www.thelocal.se/20211117/analysis-will-sweden-introduce-covid-vaccine-passes/", "https://www.newsweek.com/people-get-microchips-implanted-that-include-vaccine-records-amid-new-covid-restrictions-1655916", "https://edwardslavsquat.substack.com/p/i-believe-we-are-facing-an-evil-that", "https://www.stripes.com/theaters/europe/2021-06-27/moscow-virus-fake-vaccine-certificates-1860606.html", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://www.youtube.com/channel/UCA2jUUNoi3vNuTOaiNDLOsA/videos", "https://archive.md/j12Vc", "https://twitter.com/kerpen/status/1468280247766462479", "https://www.beckershospitalreview.com/digital-transformation/vaccine-passports-10-states-with-bans-limitations-green-lights.html", "https://metro.co.uk/2021/12/06/new-york-city-vaccine-mandate-announced-for-private-sector-employers-15724602/", "https://travel.state.gov/content/travel/en/international-travel/emergencies/covid-19-faqs-for-travel-to-the-us-information.html", "https://toronto.ctvnews.ca/doug-ford-refuses-to-make-covid-19-vaccines-mandatory-for-ontario-s-hospital-workers-1.5650760", "https://news.yahoo.com/covid-19-canada-travel-rules-vaccination-193502546.html", "https://www.medrxiv.org/content/10.1101/2021.11.12.21265796v1", "https://www.thelocal.es/20210819/why-has-the-covid-health-pass-for-daily-affairs-been-rejected-in-spain-and-not-elsewhere-in-europe/", "https://apnews.com/article/coronavirus-pandemic-europe-health-spain-59be7c26d2a76255119743f23541d310", "https://www.euroweeklynews.com/2021/09/14/supreme-court-authorises-the-use-of-covid-passports-in-galician-hotels-and-nightlife/", "https://medicalxpress.com/news/2021-11-swiss-vote-covid-restrictions-infections.html", "https://www.euronews.com/2021/06/08/why-did-romania-s-vaccination-campaign-derail-after-a-successful-start", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://twitter.com/echo_chamberz/status/1463332843438821379", "https://archive.ph/20211218065025/https://finance.yahoo.com/video/covid-passport-leash-says-brazils-162511146.html", "https://www.msn.com/en-us/money/other/rio-defies-bolsonaro-joins-cities-with-vaccine-passport-mandate/ar-AAOSTyc", "#covid-a-plandemic", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/#a-previous-pandemics-and-epidemics", "https://covertactionmagazine.com/2021/09/10/anthrax-attacks-directed-against-public-officials-following-9-11-had-all-the-markings-of-a-false-flag-operation/", "https://unlimitedhangout.com/2020/04/investigative-series/all-roads-lead-to-dark-winter/", "#international-protests", "https://swprs.org/civil-rights-and-the-pandemic/", "#video-annex", "#1-bill-gates-digital-immunity-proof-march-2020", "https://www.youtube.com/watch?v=JDjw8-3VZp8", "#2-edward-snowden-an-architecture-of-oppression-march-2020", "https://www.vice.com/en/article/bvge5q/snowden-warns-governments-are-using-coronavirus-to-build-the-architecture-of-oppression", "#3-bio-security-state-james-corbett-and-robert-f-kennedy-jr-nov-2021", "https://www.corbettreport.com/the-real-anthony-fauci-with-robert-f-kennedy-jr-video/", "#4-the-chinese-social-credit-system-may-2019", "https://www.youtube.com/watch?v=NXyzpMDtpSE", "#5-austria-every-citizen-can-be-checked-at-any-time-nov-2021", "#6-italy-the-super-green-pass-december-2021", "https://twitter.com/wakeupfromcovid/status/1469232166857056257", "#7-canada-investing-1-billion-into-health-pass-infrastructure", "#8-victoria-a-vaccinated-economy-dan-andrews-september-2021", "#9-the-week-in-melbourne-18-september-2021", "#10-robert-f-kennedy-jr-in-switzerland-november-2021", "https://childrenshealthdefense.eu/eu-issues/message-de-robert-f-kennedy-jr-the-swiss-people-have-the-right-and-the-responsibility-to-stand-up-for-democracy/", "#see-also", "https://swprs.org/the-wef-and-the-pandemic/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://t.me/share/url?url=https://swprs.org/the-covid-vaccine-war/", "https://twitter.com/intent/tweet?url=https://swprs.org/the-covid-vaccine-war/", "https://www.facebook.com/share.php?u=https://swprs.org/the-covid-vaccine-war/"], "authors": [], "publish_date": null}