{"result_id": "281011", "URL": "https://swprs.org/covid-vaccines-facts-fears-fraud/", "timestamp": "2023-04-25 17:12:51 CEST+0200", "meta": {"description": "Facts, fears, and fraud concerning covid vaccines and the pandemic.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-facts-fears-fraud/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: Facts, Fears, Fraud", "cleaned_text": "Facts, fears, and fraud concerning covid vaccines and the pandemic.\n\nThere are three main perspectives to view the covid pandemic and covid vaccines. The official narrative proposes a natural zoonotic pandemic and a rational public health response. But SARS-2 clearly wasn’t a natural virus and the global response broke all the rules of public health.\n\nThe radical “counter narrative” proposes that SARS-2, the covid vaccines, or both, were in fact “bioweapons” to target geopolitical enemies or achieve global depopulation. But SARS-2 and covid vaccines clearly weren’t “bioweapons” and didn’t achieve global depopulation at all.\n\nThe third narrative proposes that SARS-2 was a flu-like synthetic pandemic pathogen and the global pandemic response is to be seen as a biodefense live exercise. In this view, both the SARS-2 RNA virus and the novel mRNA vaccine platform were likely developed by the same actors.\n\nIn this third view, people the world over, whether panicking or countering panic, whether enforcing or resisting “measures”, were essentially unwitting participants in a global biosecurity exercise. Moreover, both covid victims and vaccine victims are to be seen as “collateral damage”.\n\nSPR will soon provide another comprehensive update on the SARS-2 origins question. Until then, it may be helpful to remember that claims by US intelligence or a former British intelligence chief, involved in deceptions from Iraq to “Russiagate”, are often more of a red flag than a revelation.\n\nFigure: The novel Furin Cleavage Site (FCS) in SARS-CoV-2.\n\nAs shown in previous analyses, covid vaccination of senior citizens strongly reduced covid mortality and all-cause mortality and improved or even restored life expectancy in 2021, despite the onslaught of three additional covid waves (1x alpha and 2x delta).\n\nMost recently, data provided by the British Office of National Statistics once again showed that vaccination was linked to markedly lower covid and all-cause mortality in all age groups. The advantage largely disappeared by late 2022, when most people were already immune (or dead) anyway. Non-covid mortality was also lower in vaccinated people, which is likely due to a combination of the “healthy user effect” and protection against severe covid (see chart below).\n\nA Qatar study previously reviewed all deaths that occurred within 30 days of vaccination and found 22 deaths in 2.5 million people that were likely caused by the vaccine, a risk of 1 in 100,000 (mostly heart deaths). Meanwhile, an Italian retrospective study of 300,000 people confirmed that over a period of 18 months, vaccinated people had a lower all-cause death rate than unvaccinated people.\n\nNevertheless, vaccine protection even against severe disease declined within six to twelve months in 2021, and in 2022 omicron largely bypassed vaccine protection. As was shown in previous analyses, excess mortality in 2022 was driven primarily by multiple strong omicron waves hitting the elderly. Indeed, in many high-income countries 80% to 99% of all covid infections occurred in 2022.\n\nFor young and healthy people, the overall impact of covid vaccination has always been negative. For senior citizens and other high-risk groups, the overall impact of vaccination remains clearly positive and would only turn negative if major “unforeseen” long-term health impacts materialize.\n\nSee also: Covid Vaccines: Vaccines or Gene Therapy? (SPR)\n\nIn a previous analysis, it was shown that countries that experienced strong covid waves in 2020, such as the United States, saw an increase in cardiovascular deaths in 2020 (due to unrecognized covid deaths or heart deaths caused by covid infection). This increase was then stopped by mass vaccination in 2021, which is consistent with the fact that vaccination reduced severe cases of covid:\n\nFigure: Infections (grey), vaccinations (green), and heart deaths (red) in the US (Pienaar)\n\nIn contrast, countries with little covid in 2020 and 2021 and high vaccination rates in 2021, such as Germany, saw stable rates of heart attacks in both 2020 and 2021:\n\nIndeed, both before and after vaccination, excess heart deaths were driven by covid infections, not by vaccination:\n\nFigure: Covid deaths (red) and heart deaths by age group in the USA, 2020-2022 (Pienaar)\n\nThis effect of respiratory virus infections driving heart deaths is already well-known from influenza, as the following chart shows:\n\nFigure: Hearth deaths (black) and influenza/pneumonia deaths in the USA (Pienaar).\n\nThe situation is different if we consider not heart attacks but heart inflammation (myocarditis), a major adverse event of mRNA covid vaccines especially in young males. The following chart shows a substantial rise in German adolescents hospitalized with myocarditis (several hundred in total) that coincides precisely with vaccination and booster campaigns in 2021.\n\nAdditional data shows that this increase really only affected people up to about 40 years of age. In older people, myocarditis was linked to covid infection, not to vaccination.\n\nNew Swedish data shows the exact same effect: in young people, there was no increase in myocarditis caused by covid, but there was a substantial increase caused by vaccination.\n\nA Swedish researcher calculated that for male adolescents, the risk of hospitalization due to vaccine-induced myocarditis was about 1 in 2000, while the overall risk (including outpatients) was almost 1 in 1000 (a figure estimated by SPR already back in 2021). This figure still doesn’t include subclinical cases without a diagnosis.\n\nNote that Swedish data shows no increase in myocarditis among young females and among older adults (over 40), nor does it show an increase in mortality, not even in young males (although some sudden cardiac deaths may have occurred). However, the real question is if these vaccine-induced heart injuries will impact long-term heart health and life expectancy.\n\nThe situation concerning cerebrovascular disease and strokes is quite similar to the situation concerning cardiovascular disease.\n\nCountries that had significant levels of covid in 2020 saw an increase in stroke-related hospitalizations and deaths, especially among males, but a stabilization or decrease following vaccination in 2021 (e.g. in the United States and in Scotland). Other countries saw stable rates of stroke-related hospitalizations and deaths in both 2020 and 2021 (e.g. Germany and Switzerland as well as Austria and Canada). Australia, with almost no covid prior to 2022, saw stable rates in 2020 and 2021 followed by a small spike during a massive omicron wave in early 2022.\n\nOne British analysis claimed to have found a 25% increase in stroke-related hospitalizations in England following the mass vaccination campaign in early 2021. The data appears to have been stitched together from different sources and is not readily reproducible. If the increase is real, it should be analyzed per age group and in relation to the AstraZeneca vaccine.\n\nIndeed, just as Israel was the “test lab” for the Pfizer mRNA vaccine, Britain was the “test lab” for the AstraZeneca adenovector DNA vaccine. About two thirds of initial vaccinations in Britain, but only 7% in the EU, used AstraZeneca. Many other countries either never approved the vaccine (e.g. Switzerland) or restricted its use in March 2021 due to cerebrovascular adverse events.\n\nThese adverse events consisted mostly of so-called cerebral sinus venous thrombosis (SVT) in young people, especially in young females. This risk signal is clearly visible in the data of other countries that used much fewer AstraZeneca doses than Britain.\n\nAs the following chart shows, Germany recorded several hundred additional hospitalizations due to SVT during vaccination and booster campaigns in 2021. Many of the patients were females of young and medium age; some of them died while others may have suffered long-term brain injury.\n\nThus, once again, we see a protective effect of vaccination in senior citizens (by reducing severe cases of covid and covid complications), but a substantial increase in severe adverse events in young people, who didn’t even need covid vaccination anyway.\n\nBirth rates decreased substantially in 2022 in many Western and Asian countries (-5% to -15%), as first noted by SPR back in June 2022. In total, there were about 100,000 “missing babies”.\n\nThe “lockdown-only” explanation is contradicted by the case of no-lockdown Sweden (-8.4%). The “mRNA infertility” explanation is contradicted by high-vaccination countries that saw no unusual decline in fertility, such as Belgium, France, Spain, Portugal, Italy, the US, Australia, New Zealand, Israel, and Chile (see chart below). Some of these countries saw “lockdown babies” in 2021, so the relevant comparison is to births in 2020.\n\nThere is clear evidence mRNA vaccines impact the menstrual cycle, but there is no evidence mRNA vaccines impact sperm quality. There is no evidence of a substantial increase in late-term stillbirths (0.5% of all pregnancies); if anything, mRNA vaccines might have impacted conception or early miscarriages (20% of all pregnancies and sometimes unnoticed).\n\nThere is also clear evidence a covid infection increases the risk of miscarriage, but a “covid-only” explanation is contradicted by high-covid countries such as the US and the southern European countries that saw no unusual decline in births in 2022 (see chart below).\n\nThus, the best explanation probably remains the strong decrease in new marriages in 2020 and 2021 (-10% to -50% per country, including -25% in Sweden), combined with additional aspects such as the rate of extramarital births (10% in Greece to 60% in France) and the rate of second and third children per marriage. Data from countries like the US should be analyzed per region and ethnic group.\n\nShockingly, Pfizer never completed its vaccine trial in pregnant women, while the results of the Moderna vaccine trial in pregnant rodents were not very encouraging, to say the least. Thus, a worst-case scenario reminiscent of the Thalidomide scandal still cannot be fully excluded.\n\nIn February 2023, major German newspaper Die Welt (The World) was perhaps the first old-school newspaper to have covered the serious irregularities that occurred during the original Pfizer covid vaccine trials: “Covid vaccines: The many irregularities of the Pfizer trial”. SPR and other independent publications covered most of these cases already in 2021 and 2022.\n\nIn particular, the newspaper covered the important case of then 35-year-old Augusto Roux, who suffered a serious case of vaccine myocarditis that was written off as a supposed covid case and “anxiety” by the principal investigator at the infamous Buenos Aires military hospital. The Buenos Aires site managed 6,000 of the 40,000 Pfizer phase III vaccine trial participants.\n\nThe newspaper also mentioned two participants whose deaths shortly after vaccination (due to a stroke and a cardiac arrest, respectively) were recorded as “unrelated”. In addition, the newspaper mentioned the important and tragic case of then 12-year-old Maddie De Garay, who suffered a life-altering injury that was recorded as “stomach pain” by trial investigators.\n\nFinally, the newspaper noted that Pfizer excluded five times more people from the vaccine group than from the control group of the supposedly “double-blinded” trial. This rather shady fact was already highlighted by BMJ associate editor Dr. Peter Doshi back in early 2021.\n\nThe vaccine trials of AstraZeneca and Johnson&Johnson also showed a few serious neurological and cardiovascular adverse events that were deemed “unrelated” but in fact were almost certainly related to the covid vaccine.\n\nThus, most of the adverse events now visible in real-world data were probably already visible during the trials in 2020 but were ignored or even suppressed by manufacturers or regulators. Furthermore, a review by US advocacy group React19 found that about a third of 120 vaccine injuries reported to the CDC VAERS database didn’t receive a registration ID or were deleted.\n\nThe reality is that many large pharmaceutical corporations have a staggering criminal record and many drug regulators and health authorities have been compromised by “Big Pharma” lobbyists.\n\nAs but one example, in February legendary Danish medical researcher Peter C. Gøtzsche showed that most types of chemotherapy against cancer are probably useless (or worse).\n\nWHO and the “Next Pandemic”\n\nIn January and February, a WHO working group held several closed-door meetings in Geneva to discuss revisions to the WHO International Health Regulations. The US and its EU allies proposed several changes aimed at giving the WHO – whose main sponsors are the US, Britain, Germany and the Gates Foundation – more power to “manage the next pandemic”.\n\nThere was hardly any media reporting on these important meetings, but it looks like China, Russia and many developing countries, fearing a kind of “health imperialism”, rejected most of the changes. The working group has now “agreed on a way forward”, according to the WHO.\n\nMeanwhile, the US government is apparently preparing a bilateral agreement with the WHO to set a precedent, and work on a WHO “pandemic treaty” continues. Work on digital biometric vaccination passports, identity systems and payment systems continues unabated, too.\n\nFigure: The WHO working group on International Health Regulations (February 2023)\n\nThe overall conclusion remains unchanged: vaccinating senior citizens was right; vaccinating young and healthy people was wrong; pressuring people into vaccination was criminal; omicron degraded vaccine protection after just one year; the value of additional “boosters” remains questionable; and potential long-term health effects of vaccination need to be monitored closely.\n\nMany skeptics have substantially underestimated the health impact of covid and omicron on the elderly and other high-risk groups, and, perhaps because of this, they have significantly under­estimated vaccine protection and overestimated vaccine-related mortality. Indeed, quite a few covid skeptics have themselves become fearmongers comparable to the covid alarmists before them.\n\nOn the other hand, one may have to ask if global mass vaccination during an ongoing pandemic really is the smartest strategy, given the many uncertainties linked to novel vaccines and the rapid spread and evolution of many respiratory viruses. The development of safe, effective and affordable treatment options, targeted at high-risk groups, might be a more promising strategy.\n\nYou have been reading: Covid Vaccines: Facts, Fears, Fraud.\n\n An analysis by Swiss Policy Research.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: Facts, Fears, Fraud", "description": "Facts, fears, and fraud concerning covid vaccines and the pandemic.", "url": "https://swprs.org/covid-vaccines-facts-fears-fraud/", "site_name": "Swiss Policy Research", "article:modified_time": "2023-03-07T14:08:24+00:00", "image": "https://swprs.org/wp-content/uploads/2023/01/pure-bloods-garrison.jpg", "image:width": "1536", "image:height": "1101", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/pure-bloods-garrison.jpg?ssl=1", "#covid-public-health-bioweapon-or-biodefense-exercise", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://swprs.org/pandemics-and-propaganda/", "https://swprs.org/studies-on-covid-19-lethality/", "https://brownstone.org/articles/vaccine-harms-are-biodefense-plans-collateral-damage/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/08/covid-fcs-insertion-sherlock.jpeg?ssl=1", "#all-cause-mortality-and-life-expectancy", "https://swprs.org/covid-vaccines-reality-check-iii/", "https://swprs.org/covid-vaccines-and-all-cause-mortality/#annex-life-expectancy-changes-in-2020-and-2021", "https://twitter.com/VictimOfMaths/status/1628371901381808129", "https://www.nature.com/articles/s41467-022-35653-z", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9861956/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/covid-vaccines-reality-check-iii/", "https://swprs.org/covid-vaccines-vaccines-or-gene-therapy/", "https://twitter.com/VictimOfMaths/status/1628371901381808129", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/ons-all-cause-age-groups-angus.jpg?ssl=1", "#myocarditis-and-cardiovascular-disease", "https://swprs.org/covid-vaccines-reality-check-iii/#athlete-deaths-and-cardiac-deaths", "https://twitter.com/PienaarJm/status/1614016881806958592#m", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/us-cardiac-deaths-vaccinationn-pienaar.png?ssl=1", "https://twitter.com/MeowMuhCow/status/1601356167569059841", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/de-herzinfarkt-2019-2022-inek-muh.png?ssl=1", "https://twitter.com/PienaarJm/status/1626499301474967552", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/covid-driving-heart-deaths-usa-pienaar.png?ssl=1", "https://twitter.com/PienaarJm/status/1627034971645923328", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/flu-heart-deaths-pienaar.jpg?ssl=1", "https://twitter.com/MeowMuhCow/status/1591562930285432832", "https://twitter.com/MeowMuhCow/status/1627098498763223040", "https://twitter.com/MeowMuhCow/status/1591562930285432832", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/germany-myocarditis-vaccination-10-17.jpg?ssl=1", "https://twitter.com/dobssi/status/1625834521814831105#m", "https://twitter.com/dobssi/status/1625834521814831105", "https://twitter.com/dobssi/status/1624079579794092039", "https://twitter.com/dobssi/status/1625834521814831105", "https://twitter.com/dobssi/status/1625834521814831105", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/sweden-myocarditis-males-10-29.jpg?ssl=1", "#strokes-and-cerebrovascular-disease", "https://twitter.com/COVIDData3/status/1628527178995445760", "https://publichealthscotland.scot/publications/scottish-stroke-statistics/scottish-stroke-statistics-year-ending-31-march-2022/", "https://www-genesis.destatis.de/genesis//online?operation=table&code=23211-0001&bypass=true&levelindex=1&levelid=1677870554590#abreadcrumb", "https://www.bfs.admin.ch/bfs/de/home/statistiken/kataloge-datenbanken/daten.assetdetail.23750495.html", "https://statistik.at/statistiken/bevoelkerung-und-soziales/bevoelkerung/gestorbene/todesursachen", "https://yourhealthsystem.cihi.ca/epub/?language=en", "https://twitter.com/JohannaSzabo1/status/1536668369817980929", "https://publichealthscotland.scot/publications/scottish-stroke-statistics/scottish-stroke-statistics-year-ending-31-march-2022/", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/scotland-cerebrovascular-mortality-2012-2022.jpg?ssl=1", "https://dailysceptic.org/2023/02/28/nhs-stroke-consultations-shoot-up-by-25-since-vaccine-rollout/", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer", "https://www.businessinsider.com/astrazeneca-covid-vaccine-countries-suspend-denmark-thailand-batch-blood-clots-2021-3", "https://twitter.com/MeowMuhCow/status/1580491287697899520", "https://twitter.com/MeowMuhCow/status/1580491287697899520", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/de-sinusvenenthrombosen-impfung-inek-astra-muh.webp?ssl=1", "#birth-rates-and-miscarriages", "https://twitter.com/BirthGauge/status/1616599342357291008", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/covid-vaccination-and-pregnancy/", "https://swprs.org/birth-rates-vaccinations-marriages/", "https://maryannedemasi.substack.com/p/exclusive-whatever-happened-to-pfizers", "https://maryannedemasi.substack.com/p/exclusive-whatever-happened-to-pfizers", "https://swprs.org/vaccines-successes-and-controversies/#b8-drug-safety-thalidomide-still-with-us-2019", "https://twitter.com/BirthGauge/status/1616599342357291008", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/Fm9P-kTWIAE-NVb.png?ssl=1", "https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Marriage_and_divorce_statistics", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/eu-marriages-eurostat.jpg?ssl=1", "#vaccine-trial-fraud", "https://archive.ph/axhKy", "https://jackanapes.substack.com/p/is-subject-12312982-the-key-to-proving", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-trials-adverse-events-shots-fda-eua-documents/", "https://www.c19vaxreactions.com/real-video-stories.html", "https://swprs.org/covid-vaccine-adverse-events/#safety-signals-during-vaccine-trials", "https://time.com/5947134/astrazeneca-covid-vaccine-stopped/", "https://react19.org/vaers-audit/", "https://kanekoa.substack.com/p/pfizers-history-of-fraud-corruption", "https://freewestmedia.com/2021/04/11/european-medicines-agency-essentially-a-lobbying-outfit-for-big-pharma/", "https://www.scientificfreedom.dk/2023/02/04/should-i-get-chemotherapy-for-cancer-probably-not/", "https://swprs.org/covid-vaccine-adverse-events/", "https://davidhealy.org/disappeared-in-argentina/", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/augusto-pollack.png?ssl=1", "#who-and-the-next-pandemic", "https://norberthaering.de/macht-kontrolle/ihr-review-committee-final-report/", "https://www.weforum.org/agenda/2020/04/who-funds-world-health-organization-un-coronavirus-pandemic-covid-trump/", "https://norberthaering.de/macht-kontrolle/ihr-review-committee-final-report/", "https://healthpolicy-watch.news/countries-agree-on-process-to-amend-international-health-regulations-governing-pandemics/", "https://dailysceptic.org/2023/02/20/u-s-government-negotiates-deal-to-give-who-authority-over-u-s-pandemic-policies/", "https://www.who.int/news/item/30-03-2021-global-leaders-unite-in-urgent-call-for-international-pandemic-treaty", "https://www.biometricupdate.com/", "https://healthpolicy-watch.news/countries-agree-on-process-to-amend-international-health-regulations-governing-pandemics/", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/03/IHR-working-group-meeting-Feb-2023-0.jpeg?ssl=1", "#conclusion", "#see-also", "https://swprs.org/pandemics-and-propaganda/", "https://swprs.org/the-face-mask-folly-in-retrospect/", "https://swprs.org/vaccines-successes-and-controversies/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-facts-fears-fraud/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-facts-fears-fraud/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-facts-fears-fraud/"], "authors": [], "publish_date": null}