{"result_id": "281039", "URL": "https://swprs.org/vaccine-failure-not-really/", "timestamp": "2023-04-25 17:13:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/vaccine-failure-not-really/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "\"Vaccine failure\"? Not really.", "cleaned_text": "Are covid vaccines “failing”? Well, not really.\n\nPlease note: This is not a recommendation for or against covid vaccination.\n\nIn a recent article, US author and independent covid analyst, Alex Berenson, argued that covid vaccines are failing and have already lost much of their effectiveness. He arrives at this conclusion because of the strong increase in covid infections and the increase in hospitalizations in multiple countries hit by the Indian coronavirus variant. Nevertheless, his analysis is not correct.\n\nThe neutralizing antibody response and the effectiveness of vaccines against the original coronavirus variants (the Wuhan and British variants, in particular) remain as high as ever. In other words, the vaccines have not lost their original effectiveness, as determined by trials, at all.\n\nIt is important to recall that vaccine trials were not designed to measure effectiveness against “covid infections” (as the author writes in his article), but against “symptomatic covid”. Real-world evidence later showed that covid vaccines were also very effective against severe disease and death.\n\nThis was best illustrated not by countries that vaccinated into the winter wave (like Israel and the UK), as the decrease of the winter wave in January and February was primarily seasonal (indeed, it occurred simultaneously in countries with a very low vaccination rate, like South Africa).\n\nInstead, it was best illustrated by European countries that had already vaccinated their senior citizens when the British variant hit them in spring. In these countries, hospitalizations and deaths remained much lower despite infection rates as high as in winter (see chart below).\n\nIn June and July, the Indian variant (Delta) started to hit European countries and drive infections up again: first in the UK, Russia, Portugal and Israel, and then in other European countries and the USA. Due to several key mutations in the spike protein, the Indian variant achieves partial immune escape and therefore lowers vaccine effectiveness somewhat (as do the Brazilian and S. African variants).\n\nHowever, even against the Indian variant, covid vaccines continue to remain quite effective in preventing hospitalization and death: in countries with a low vaccination rate, such as Russia and several Asian countries (e.g. Indonesia), covid deaths driven by the Indian variant have already reached all-time records, whereas in countries with a high vaccination rate (e.g. the UK, Israel and Portugal), hospitalizations and deaths have remained at a very low level (see chart above).\n\nThe author tries to argue that this is only because of a lag between infections and hospitalizations, but this is not the case: as in the spring wave in Europe, hospitalizations and deaths in the vaccinated population really do remain at a much lower level (see charts above and below). Interestingly, the author mostly avoids showing absolute numbers of hospitalizations and deaths and instead uses relative increases, which may appear high precisely because they refer to very low values.\n\nBut why do hospitalizations and deaths not remain at zero? For several reasons: vaccination rates even in senior citizens are not 100%; vaccine effectiveness even against the original variant was never 100%; in people over 80 (especially nursing home residents, who were excluded from vaccine trials), vaccine effectiveness was always significantly lower (due to so-called immunosenescence); and the Indian variant achieves additional partial immune escape against existing vaccines.\n\nNevertheless, both in the European spring wave (British variant) and in the current summer wave (Indian variant), vaccines have drastically reduced hospitalizations and deaths and have not “failed” at all (again, compare deaths in the UK and Russia; true Russian death figures are even higher). Moreover, due to routine testing, not all PCR-positive hospitalizations are “due to covid”.\n\nThe author further argues that Delta is not to blame because infections in India are already down by 90%, despite a low vaccination rate. But this argument does not apply, either: the Indian covid wave in April and May reached enormous proportions, with excess deaths of more than one million. The fact that it ended due to local and seasonal effects doesn’t contradict vaccine effectiveness at all.\n\nBut why are covid vaccines so poor at preventing infections? Most likely because they are really poor at achieving mucosal immunity (IgA), as opposed to serological immunity (IgG, i.e. antibodies in the blood). In fact, natural infection appears to achieve better mucosal protection than vaccination does. Because of this, “vaccination passes” make no medical sense; their only purpose could be political.\n\nFinally, the author argues that vaccine trials could at least exclude antibody-dependent disease enhancement (ADE). But unfortunately, this is not correct, either. ADE can occur if neutralizing antibody levels are low and non-neutralizing antibody levels are high. In this case, non-neutralizing antibodies might (!) enhance infection and disease. In the notorious case of dengue fever, for instance, ADE occurs because there are already several virus variants circulating.\n\nVaccine trials could not rule out this effect because they achieved very high levels of neutralizing antibodies against the original coronavirus variant. But ADE might (!) still occur with future variants that achieve full immune escape (i.e. not before next winter). However, it could likely be prevented by “booster shots” that provide updated neutralizing antibodies…\n\nIn conclusion, vaccines have not, so far, “failed” in very significantly reducing severe disease, hospitalization and death. Instead, the coronavirus has achieved partial immune evasion, an effect already well known from seasonal influenza viruses. But since coronaviruses do not show antigenic shift, the hope is that Sars-Cov-2 will exhaust its possible escape mutations rather soon.\n\nThe bigger concern really is the cardiovascular safety of covid vaccines, especially if repeated booster shots should become necessary against new immune-evasive variants, or if, in the worst case, antibody dependent disease enhancement should set in. From a civil rights perspective, an even bigger concern is the implementation of authoritarian digital biometric “vaccine passports”.\n\nUS author Alex Berenson has advanced several new arguments:\n• Claim: “Delta is simply milder.” False: In countries with a low vaccination rate, Delta covid deaths have reached all-time record levels (starting with India and Russia); if anything, Delta may be more severe. Only vaccine protection makes Delta look milder in Western countries.\n• Claim: “Israel confirmed vaccine failure.” False: The article actually states: “While the spike in daily cases continues, the increase in serious morbidity has remained limited.”\n• Claim: “Protection against severe illness is just a theory.” False: In all countries with a high vaccination rate, hospitalizations and deaths have remained low (as they did in spring).\n• Claim: “Infections only increase in highly vaccinated countries.” False: They increase wherever Delta has established itself (starting in India, with a low vaccination rate).\n• Claim: “Immune escape is not due to Delta, vaccines are simply failing after 3 months.” False: Antibody response remains as high as ever, immune escape is due to Delta.\n• Claim: “Hospitalizations in the UK are higher now than a year ago, so vaccines failed.” False: Infections a year ago were at a minimum, but infections now are at a new maximum, because the Delta variant is the first to achieve a summer wave, independent of the vaccination rate.\n\nTo reiterate: Covid vaccines provide very low protection against infection and infectiousness (hence “certificates” make no medical sense); provide reduced protection against disease caused by Delta; will provide even lower protection against future immune-escape variants, or may make disease even worse (ADE); but right now, offer still significant protection against severe disease and death.\n\nThe following chart shows hospitalizations by age group in Switzerland. The difference between the orange curve (40-59) and the red curves (60-79 and 80+) in the second and third waves indicates vaccine effectiveness in age groups 60+, who got vaccinated already in early 2021.\n\nFigure 2: Impact of Delta variant on infections in Europe\n\nThe impact of the Indian variant on infections in European countries since June/July. For instance, the Netherlands (turquoise) saw a Wuhan variant wave from November to January, a British variant wave in March/April, and an almost vertical Indian variant wave since early July.\n\nDelta deaths in some Southeast Asian countries with a low vaccination rate.\n\nCoronavirus variants and their immune-escape mutations. Read more about this topic.", "opengraph": {"locale": "en_US", "type": "article", "title": "\"Vaccine failure\"? Not really.", "description": "Are covid vaccines \"failing\"? Well, not really.", "url": "https://swprs.org/vaccine-failure-not-really/", "site_name": "Swiss Policy Research", "article:modified_time": "2021-07-21T06:51:19+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/02/pfizer-rna-vaccine.jpg?fit=958%2C548&ssl=1", "image:width": "958", "image:height": "548", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/07/delta-portugal-russia-england-israel.png?ssl=1", "https://t.me/share/url?url=https://swprs.org/vaccine-failure-not-really/", "https://twitter.com/intent/tweet?url=https://swprs.org/vaccine-failure-not-really/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccine-failure-not-really/", "https://alexberenson.substack.com/p/vaccines-reasons-for-concern-part", "https://www.nytimes.com/2021/06/28/health/coronavirus-vaccines-immunity.html", "https://alexberenson.substack.com/p/vaccines-reasons-for-concern-part", "https://www.bmj.com/content/371/bmj.m4037", "https://www.timesofisrael.com/pfizer-vaccine-96-7-effective-at-preventing-covid-deaths-israeli-data-shows/", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/#comparison-decrease-in-covid-deaths", "https://swprs.org/vaccines-the-tip-of-the-iceberg/#foobox-2/0/switzerland-hospitalizations-age-groups-may-2021.png", "https://swprs.org/the-indian-variant-summer-wave/", "https://swprs.org/coronavirus-variants-what-next/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=~IDN", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=GBR~RUS~PRT", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=GBR~RUS~PRT~ISR", "https://alexberenson.substack.com/p/vaccines-reasons-for-concern-part", "https://swprs.org/the-vaccine-conundrum/", "https://swprs.org/coronavirus-variants-what-next/", "https://swprs.org/covid-19-mortality-overview/#a-excess-mortality-per-country", "https://www.newsweek.com/studies-suggest-child-hospitalization-numbers-covid-are-inflated-1592911", "https://alexberenson.substack.com/p/vaccines-reasons-for-concern-part", "https://www.economist.com/asia/2021/06/12/more-evidence-emerges-of-indias-true-death-toll-from-covid-19", "https://www.frontiersin.org/articles/10.3389/fimmu.2020.611337/full", "https://www.israelnationalnews.com/News/News.aspx/309762", "https://swprs.org/the-failure-of-vaccine-passports/", "https://alexberenson.substack.com/p/vaccines-reasons-for-concern-part", "https://pubmed.ncbi.nlm.nih.gov/33194810/", "https://swprs.org/coronavirus-variants-what-next/", "https://www.cdc.gov/flu/about/viruses/change.htm", "https://swprs.org/coronavirus-variants-what-next/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/the-vaccine-passport-agenda/", "https://twitter.com/AlexBerenson/status/1416074419152343042", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=IDN~THA~MMR~KHM~RUS", "https://twitter.com/AlexBerenson/status/1416080392306712579", "https://www.jpost.com/breaking-news/for-first-time-since-march-855-new-coronavirus-cases-in-israel-674084", "https://twitter.com/AlexBerenson/status/1416079138813775877", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=GBR~RUS~PRT~ISR", "https://twitter.com/AlexBerenson/status/1416052638899130374", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=IDN~THA~MMR~KHM~RUS", "https://twitter.com/AlexBerenson/status/1416080392306712579", "https://www.nytimes.com/2021/06/28/health/coronavirus-vaccines-immunity.html", "https://swprs.org/coronavirus-variants-what-next/", "https://twitter.com/AlexBerenson/status/1416108851565408261", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=~GBR", "https://swprs.org/the-indian-variant-summer-wave/", "#figure-1-vaccine-effectiveness", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/05/switzerland-hospitalizations-age-groups-may-2021.png?ssl=1", "#figure-2-impact-of-delta-variant-on-infections-in-europe", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/07/delta-infections-europe.png?ssl=1", "#figure-3-delta-deaths-in-some-southeast-asian-countries", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/07/delta-deaths-asian-countries.png?ssl=1", "#figure-4-coronavirus-immune-escape-variants", "https://swprs.org/coronavirus-variants-what-next/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/07/coronavirus-escape-mutations.png?ssl=1", "#figure-5-rna-vaccines-reduced-neutralization-against-variants", "https://www.cell.com/cell/fulltext/S0092-8674(21)00298-1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/03/pfizer-moderna-variants-neutralization-cell.png?ssl=1", "#see-also", "https://swprs.org/us-vaccine-deaths-increasing-rapidly/", "https://swprs.org/coronavirus-variants-what-next/", "https://swprs.org/the-indian-variant-summer-wave/", "https://t.me/share/url?url=https://swprs.org/vaccine-failure-not-really/", "https://twitter.com/intent/tweet?url=https://swprs.org/vaccine-failure-not-really/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccine-failure-not-really/"], "authors": [], "publish_date": null}