{"result_id": "281006", "URL": "https://swprs.org/birth-rates-vaccinations-marriages/", "timestamp": "2023-04-25 17:12:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/birth-rates-vaccinations-marriages/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines and Fertility (II)", "cleaned_text": "Is the drop in birth rates since early 2022 due to a decline in marriages?\n\nBack in June, SPR provided a first comprehensive analysis of the sudden decline in birth rates since early 2022. The analysis discussed several potential behavioral and biological causes, including the start of covid mass vaccinations in the general population exactly nine months earlier.\n\nThe decline is really quite dramatic, with almost 100,000 “missing babies” so far in 2022 in Europe alone. Countries like Germany have seen a decline in births of about 10%, while Taiwan has recently reported a decline of almost 30% compared to the previous year.\n\nFor some, it was already clear that only covid vaccines could have caused this decline in births – either inadvertently or as part of a nefarious ‘global depopulation agenda’ – while others were certain that covid vaccines could absolutely not be the cause.\n\nIn reality, the situation has remained really quite ambiguous, with intriguing arguments and counter-arguments on both sides of the debate. Moreover, behavioral and biological factors do not have to exclude each other.\n\nOn the behavioral side, one of the strongest argument to have emerged is the massive decline in marriages in 2020, by about 25% in the European Union overall and by up to almost 50% in some countries (see charts below). In 2021, it looks like in many countries, marriages remained at the same low level as in 2020 or decreased even a bit further.\n\nSuch a massive decline in marriages in 2020 and 2021 could plausibly explain the observed decline in births in 2022, in whole or at least in part. One may also presume that dating decreased to a similar extent as marriages did in response to the pandemic and prolonged restrictions on social life.\n\nNevertheless, there remain some open questions and challenges to this explanation:\n• Why did births only drop in 2022 and not earlier? It could be argued that in 2021 the overall birth rate was being “padded” by an increase in second and third babies from already existing couples (“lockdown babies”), while the number of firstborns may already have decreased.\n• A few countries, such as Hungary, saw no decrease in marriages in 2020 (or even a small increase), yet Hungary is still experiencing a dramatic decline in births since early 2022 (by about 10% overall and by about 20% in Budapest). It could be argued that newlywed couples decided to postpone pregnancy due to economic uncertainty or other factors.\n• Other countries, such as France, Spain and Portugal, saw a severe decline in marriages in 2020 (by 35% to 45%), but no decline or even a small increase in births since early 2022. However, some of these countries had a lower birth rate already in early 2021 (e.g. France), or they may have seen an increase in second and third babies from existing couples. There is also the possibility of more extramarital births (already 62% in France).\n• Sweden, without a lockdown, still saw a 25% decrease in marriages in 2020 and a 6% to 10% decrease in births since early 2022. However, Sweden did have some restrictions on events and gatherings and may also have been affected by economic and psychological uncertainty.\n• New Zealand saw a “normal” linear decrease in marriages from 2018 to 2020 and has so far seen no decline in births in 2022, but rather a whopping 10% increase. It could be argued that there was perhaps not much else to do in New Zealand during the last two years, although it should be noted that mass vaccination in New Zealand began only in autumn 2021.\n\nIn sum, it appears that the decline in marriages and dating, perhaps together with economic and psychological factors, might help explain the subsequent drop in births.\n\nIf so, the decline in births may have been unavoidable to some extent (as the case of Sweden without a lockdown shows), but it may also be seen as a result of misguided policy, unnecessary panic and tragic overreaction. For instance, during the 1968/69 Hong Kong flu pandemic, close to half a million people attended the famous Woodstock festival.\n\nIf the decline in births is due to a decline in marriages and dating, one may hope to see an eventual though not immediate rebound in births, unless the economic situation continues to deteriorate.\n\nThere is also the possibility that some women, knowing that they would soon get vaccinated, decided to delay pregnancy. Such a scenario might explain the 9-month delay in a more direct way. In this case, too, one would expect to see a rebound of the birth rate within a few months.\n\nNevertheless, the currently available data does not yet rule out a vaccine-related effect on fertility and births. While SPR has already debunked the recent Israeli “sperm study”, the widespread post-vaccination menstrual disorders continue to remain unexplained, and it is well established that covid vaccination can in some cases harm or kill unborn or breastfeeding babies, but it remains unknown how frequently this has occurred.\n\nFor instance, Germany saw a 3% increase in live births in 2021, but an 8% increase in stillbirths. In contrast, Scotland saw no increase in stillbirths, but did see an unexplained increase in neonatal deaths. However, the real question is if covid vaccines have any impact on conception and on miscarriages (up to 20% of all pregnancies, often undetected).\n\nPreferably, these questions would have been answered prior to mass vaccination of pregnant women and young people, which in any event has only increased their overall health risks.\n• Severe decreases in birth rates could be due to preliminary data.\n• Germany reports an unprecedented 6% decline in abortions in 2021. While some interpret this as evidence for vaccine-induced infertility, the more likely explanation is a lockdown-related decrease in dating and casual sex.\n• Sweden has officially acknowledged a “drastic decline” in births in 2022.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines and Fertility (II)", "description": "Is the drop in birth rates since early 2022 due to a decline in marriages?", "url": "https://swprs.org/birth-rates-vaccinations-marriages/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-09-18T16:33:55+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/covid-vaccine-pregnancy.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/eu-marriages-eurostat.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/birth-rates-vaccinations-marriages/", "https://www.facebook.com/share.php?u=https://swprs.org/birth-rates-vaccinations-marriages/", "https://t.me/share/url?url=https://swprs.org/birth-rates-vaccinations-marriages/", "https://swprs.org/covid-vaccines-and-fertility/", "https://twitter.com/BirthGauge/status/1543376177657692161#m", "https://www.ris.gov.tw/app/en/2121?sn=22189412", "https://lostintranslations.substack.com/p/the-wedding-crasher", "https://twitter.com/BirthGauge/status/1543376177657692161#m", "https://frenchglimpses.com/2022/03/04/historic-drop-in-the-birth-rate-in-france/", "https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Marriage_and_divorce_statistics#A_rise_in_births_outside_marriage", "https://www.stats.govt.nz/topics/marriages-civil-unions-and-divorces", "https://www.dailymail.co.uk/news/article-8320761/Woodstock-occurred-Hong-Kong-flu-pandemic-killed-1-million-people-worldwide-100-000-Americans.html", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/covid-vaccine-adverse-events/#b-menstrual-disorders-miscarriages-birth-defects", "https://swprs.org/covid-vaccine-adverse-events/#b-menstrual-disorders-miscarriages-birth-defects", "https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Geburten/Tabellen/lebendgeborene-gestorbene.html", "https://twitter.com/scojw/status/1545335466739761152#m", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/coronavirus-september-update/", "https://de.statista.com/statistik/daten/studie/232/umfrage/anzahl-der-schwangerschaftsabbrueche-in-deutschland/", "https://igorchudov.substack.com/p/new-data-from-germany-births-and", "https://www.dn.se/sverige/barnafodandet-minskar-drastiskt-i-ar/", "#figures", "#1-international-birth-rates-in-2022-vs-2021", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/birth-data-2022-july.png?ssl=1", "#2-switzerland-covid-vaccination-and-monthly-live-births-2016-2022", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/06/switzerland-vaccination-births-2016-2022-realdatahero.jpg?ssl=1", "#3-germany-monthly-birth-rate-2010-22-expectation-red-and-actual-blue", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/06/de-geburten-ruckgang-12y.png?ssl=1", "#4-marriage-rate-in-the-european-union", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/eu-marriages-eurostat.jpg?ssl=1", "#5-marriage-rates-in-eu-countries", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/07/marriages-europe-2017-2020.png?ssl=1", "#see-also", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/the-face-mask-folly-in-retrospect/", "https://swprs.org/vaccines-successes-and-controversies/", "https://twitter.com/intent/tweet?url=https://swprs.org/birth-rates-vaccinations-marriages/", "https://www.facebook.com/share.php?u=https://swprs.org/birth-rates-vaccinations-marriages/", "https://t.me/share/url?url=https://swprs.org/birth-rates-vaccinations-marriages/"], "authors": [], "publish_date": null}