{"result_id": "281025", "URL": "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "timestamp": "2023-04-25 17:13:07 CEST+0200", "meta": {"description": "Are covid vaccines the biggest success or the biggest scandal in the history of medicine?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines and All-Cause Mortality", "cleaned_text": "Are covid vaccines the biggest success or the biggest scandal in the history of medicine?\n\nPrevious SPR analyses provided a comprehensive overview of vaccine effectiveness and vaccine adverse events as well as of infection-induced natural immunity. These analyses showed that covid vaccines 1) provide a very high, but rapidly declining protection against covid infection and severe disease; 2) are linked to a significant risk of cardiovascular and neurological adverse events; 3) confer less durable protection than natural immunity.\n\nTaken together, it was clear, already in mid-2021, that covid vaccination was indicated only for people at significant risk of severe acute covid (due to their age or health), and that vaccine mandates and “vaccine passports” had no medical or epidemiological justification, not even for healthcare workers.\n\nWhile covid vaccines have dramatically reduced covid mortality (albeit not permanently), the more important question arguably is if covid vaccines have also reduced all-cause mortality, and if so, to what extent. This question will be discussed in the following sections.\n\nThe most objective way to evaluate the impact of covid vaccination on all-cause mortality is the measurement of changes in national life expectancy. Such an analysis was performed by a German-British study recently published in the scientific journal Nature Human Behaviour. The study results show that covid vaccination rates, especially in senior citizens (60+), were very strongly associated with an improvement in life expectancy in 2021 (see chart above).\n\nAfter a substantial drop in life expectancy in 2020, many Western populations could stabilize, increase or even fully recover their life expectancy in 2021, despite the onslaught of three vicious covid waves (an alpha wave in early spring and two delta waves in autumn and early winter).\n\nHowever, three things could go wrong during covid vaccination campaigns, and these three factors largely explain why some countries had a rather disappointing covid experience in 2021, despite seemingly high vaccination rates:\n\nFirst, some countries achieved quite high vaccination rates overall, but lower vaccination rates among the elderly. The best known example is Hong Kong (30% vaccination rate among the elderly), but the same issue affected Lithuania, Hungary, Poland and some other Eastern European countries (see vaccination rates by age group).\n\nSecond, some countries had an unfortunate timing, as vaccination occurred during or only after a covid wave. For instance, vaccination forerunners Israel and Britain vaccinated during an alpha wave in early 2021. Several Eastern European countries started mass vaccination only in spring, during or already after a severe alpha wave.\n\nThird, some countries achieved high vaccination rates in spring, but low booster rates in autumn, or the timing of booster vaccinations was unfortunate. For instance, Slovakia had a booster rate of just 3% prior to the delta wave. Israel administered booster doses in parallel to an early delta summer wave.\n\nThe following chart shows changes in life expectancy in 2021 (compared to 2020) and vaccination rates among people 80+ by September 2021. The stabilization or recovery of life expectancy in the midst of a pandemic is a highly remarkable medical achievement.\n\nFigure: Changes in life expectancy in 2021 vs. vaccination rate among 80+ by September 2021.\n\nSince 2020, covid has been a leading cause of death in many countries. Among senior citizens, covid accounted for up to 20% of all deaths. Thus, if covid vaccines were 100% effective against covid death, they could theoretically reduce all-cause mortality by up to 20%.\n\nGlobally, covid has caused about 20 million deaths since 2020, including over one million deaths each in the United States and in Russia. Outside of nursing homes, elderly people faced a covid lethality of about 1% to 3%; in nursing homes, covid lethality was about 20% to 30%.\n\nIn practice, measuring the impact of vaccination on all-cause mortality is notoriously difficult, due to differences in age and health of vaccinated vs. unvaccinated people, indirect effects of vaccination, and many competing causes of death among the elderly (e.g. someone may be protected against the flu but then die of another virus or of heart disease).\n\nNevertheless, several studies have already tried to investigate the correlation between covid vaccination and all-cause mortality in 2021 and 2022. These were retrospective observational studies that cannot prove causality, but that may nevertheless offer some useful preliminary insights.\n\nFor instance, a US study by the Florida Department of Health found that in people over 60, all-cause mortality was (at least) 3% lower within one month of vaccination. The same study found that cardiac deaths, but not all-cause deaths, were elevated among young people (18 to 40) within one month of vaccination.\n\nAnother US study compared excess mortality among registered voters of the two major US political parties in Florida and Ohio before and after covid vaccines became available. Although this study wasn’t directly about vaccination, it is known that by late 2021, voters of one of these parties had a vaccination rate of over 90%, while voters of the other party had a vaccination rate below 60%.\n\nThe study found that before vaccination, age-adjusted excess mortality among the second group was already about 20% higher (perhaps due to differences in health), but this difference increased to a full 150% after vaccines became available (see chart below). In all likelihood, this astounding difference was primarily due to delta deaths in unvaccinated people.\n\nA Swedish study compared all-cause mortality in elderly people (80+ or care home residents) who had or had not received a fourth covid vaccine dose in early 2022 (i.e., during omicron). This study found that in elderly people who had received a forth dose, all-cause mortality over 5 months was 30% to 40% lower (in care homes) or even 50% to 70% lower (in people over 80).\n\nMost likely, these very high differences were influenced by the fact that people closest to death no longer received a fourth vaccine dose. Nevertheless, the study found that both the time since the third vaccination and the time since the fourth vaccination influenced the differences, indicating a true all-cause mortality benefit, possibly in the range of 10% to 20% (based on the difference between early and late differences).\n\nA Hungarian study compared all-cause mortality in vaccinated and unvaccinated people during and after the strong Hungarian alpha wave in the spring of 2021. This study found that all-cause mortality in vaccinated people was about 50% lower than in unvaccinated people. Once again, this difference could be influenced by confounding variables and by increased post-covid mortality in unvaccinated people (see next section).\n\nAnother Hungarian study compared all-cause mortality during the second wave (before vaccination) and the third wave (after vaccination) per age group. This study found that, in people over 65, all-cause mortality was significantly lower in the third wave compared to the second wave, whereas in younger people, all-cause mortality was the same or higher. This again indicates a protective effect of covid vaccines against all-cause mortality.\n\nOverall, the available evidence indicates that in 2021, covid vaccination reduced both covid mortality and all-cause mortality, which is consistent with the changes in life expectancy.\n\nFigure: Excess mortality by political party in Florida and Ohio.\n\nThe analysis above has shown that, in 2021, covid vaccination reduced both covid mortality and all-cause mortality and increased life expectancy, unless vaccination rates among the elderly were low or the timing was unfortunate. The recovery of life expectancy in the midst of a pandemic is a major medical success, even if the pandemic itself was almost certainly a man-made catastrophe.\n\nHowever, the immune-escaping omicron variant, which emerged in late 2021, has reduced both peak effectiveness and durability of covid vaccine protection (but note that there is still no evidence of “negative vaccine effectiveness”). In addition, numerous studies have shown that covid vaccines can cause serious and fatal cardiovascular adverse events.\n\nThis raises the question if in 2022 and beyond, the impact of covid vaccines on all-cause mortality and life expectancy might turn negative, that is, vaccine-related deaths might outweigh any reduction in covid mortality, especially since there is already widespread natural immunity in most populations and omicron has an inherently lower death rate than previous variants.\n\nIndeed, it has been observed that in 2022, many countries have been recording an unexplained “non-covid” excess mortality. However, a closer inspection shows that in most countries, excess deaths are still following covid infections (even if mass testing was halted), and they are usually limited to senior citizens (65+ or even 75+), while mortality below 65 has remained normal. Two notable exceptions are the United States (possibly due to the opioid crisis) and the United Kingdom (especially England, possibly due to the NHS crisis or population accounting issues).\n\nFurthermore, numerous studies have shown that morbidity and mortality remain increased in people who survived moderate or severe covid. Thus, it appears likely that excess mortality in 2022 is mainly due to several large omicron waves and elevated post-covid mortality in senior citizens (see chart below). If so, covid vaccination would still be protective against both covid mortality and all-cause mortality, but future studies will have to verify this.\n\nNevertheless, it is known that the nanolipids used in mRNA vaccines can be toxic if administered repeatedly (which is one reason why mRNA therapeutics failed in the past), and they can cause widespread biodistribution of coronavirus spike protein in the body, which in turn can cause local inflammation that can damage blood vessels and organs. The big question is how widespread and how severe such unintended vaccine effects really are. The long-term safety of the mRNA genetic technology itself remains largely unknown, too (but cancer rates haven’t increased so far).\n\nIn conclusion, the mass vaccination of young and healthy people up to about 40 years was clearly a mistake (or even medical misconduct). The vaccination of people at significant risk of severe covid was a major medical success in 2021, despite timing issues and rapidly declining protection. In the omicron era, vaccination still seems to provide a mortality benefit to people at high risk of severe covid, but the long-term mortality impact of covid vaccination remains rather uncertain.\n\nMeanwhile, several Nordic countries limited additional booster vaccinations mainly to people over 50 or even over 65, while the New York Supreme Court decided that the NYC vaccine mandate for city employees was “arbitrary, capricious, unconstitutional, and not about safety and public health”, ordering NYC to rehire and pay back wages to unvaccinated employees.\n\nFigure: Excess deaths and reported covid deaths still run in parallel (Austria).\n\nAnnex: Life expectancy changes in 2020 and 2021", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines and All-Cause Mortality", "description": "Are covid vaccines the biggest success or the biggest scandal in the history of medicine?", "url": "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-11-02T07:29:28+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/excess-deaths-economist-october-2022.jpg?fit=1566%2C859&ssl=1", "image:width": "1566", "image:height": "859", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/excess-deaths-economist-october-2022.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-and-all-cause-mortality/", "#introduction", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/the-power-of-natural-immunity/", "https://swprs.org/covid-vaccines-the-good-the-bad-the-ugly/", "#1-covid-vaccines-and-life-expectancy", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/life-expectancy-vaccination-rate-nature.webp?ssl=1", "https://www.nature.com/articles/s41562-022-01450-3", "https://swprs.org/coronavirus-the-hong-kong-experience/", "https://ourworldindata.org/grapher/covid-fully-vaccinated-by-age", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/vaccination-rate-80plus-life-expectancy-2021.png?ssl=1", "#2-covid-vaccines-and-all-cause-mortality", "https://www.healthsystemtracker.org/brief/covid-19-leading-cause-of-death-ranking/", "https://datavisualizations.heritage.org/public-health/covid-19-deaths-by-age/", "https://swprs.org/covid-19-mortality-overview/", "https://swprs.org/studies-on-covid-19-lethality/", "https://pubmed.ncbi.nlm.nih.gov/19625341/", "https://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-analysis.pdf", "https://www.nber.org/system/files/working_papers/w30512/w30512.pdf", "https://www.brookings.edu/blog/fixgov/2021/10/01/for-covid-19-vaccinations-party-affiliation-matters-more-than-race-and-ethnicity/", "https://www.nber.org/system/files/working_papers/w30512/w30512.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9277096/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9277096/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9319484/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9303845/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/florida-ohio-dem-rep-excess-deaths-vaccination.jpg?ssl=1", "#3-outlook-the-omicron-era", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/more-injections-more-infections/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/how-real-is-2022-excess-mortality/", "https://swprs.org/how-real-is-2022-excess-mortality/#post-covid-deaths", "https://swprs.org/covid-vaccine-adverse-events/#q-booster-toxicity", "https://swprs.org/covid-vaccine-adverse-events/#v-histopathological-findings", "https://swprs.org/how-real-is-2022-excess-mortality/#cancer-deaths", "https://covexit.substack.com/p/norway-age-65", "https://news.yahoo.com/york-supreme-court-orders-nyc-174624343.html", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/austria-excess-covid-deaths-omicron.png?ssl=1", "#annex-life-expectancy-changes-in-2020-and-2021", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/life-expectancy-changes-2020-2021-schoeley.webp?ssl=1", "#related", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/obesity-and-the-pandemic-new-insights/", "#see-also", "https://swprs.org/covid19-facts/", "https://swprs.org/face-masks-evidence/", "https://swprs.org/the-propaganda-pandemic/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-and-all-cause-mortality/"], "authors": [], "publish_date": null}