{"result_id": "281016", "URL": "https://swprs.org/covid-vaccines-and-cancer/", "timestamp": "2023-04-25 17:12:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-and-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines and Cancer", "cleaned_text": "Please note: No medical advice; patients are asked to consult a doctor.\n\nCan covid vaccines cause cancer? In some cases, the answer appears to be yes. To be sure, there is no evidence that covid vaccines themselves are carcinogenic (i.e. cancer-causing). However, it has been shown that in up to 50% of vaccinees, covid vaccines can induce a temporary immune suppression or immune dysregulation (lymphocytopenia) that may last about a week or possibly longer.\n\nIn addition, covid mRNA vaccines have been shown to “reprogram” (i.e. modify) adaptive and innate immune responses and, in particular, to downregulate the so-called TLR4 pathway, which is known to play an important role in the immune response to infections and cancer cells.\n\nThus, if there already is a tumor somewhere – known or unknown –, or if there is a predisposition to some type of cancer, such a state of vaccine-induced immune suppression or immune dysregulation might potentially trigger sudden tumor growth and cancer in the weeks following vaccination. Of note, lymphocytopenia has also been frequently observed in cases of severe covid.\n\nAt the immunological level, a similar mechanism appears to be triggering the post-vaccination reactivation of latent virus infections, most notably VZV (i.e. shingles), but also EBV (Epstein-Barr) and HPV. The vaccine-induced temporary immune suppression is also a likely factor contributing to the post-vaccination spike in coronavirus infections, observed in many countries.\n\nThe extent of the vaccine-induced tumor growth and cancer issue remains uncertain – it might be very rare – but there are already a few thousand such case reports in the notoriously incomplete official adverse event reporting systems and in vaccine-related online patient groups, although some of these cases may certainly be coincidental or even due to lockdown-related delayed diagnosis.\n\nIn August, US clinical pathologist Dr. Ryan Cole described a significant increase in certain types of cancer (e.g. endometrial cancer) since the beginning of the covid mass vaccination campaign (see video excerpt below; full video here). More recently, German pathologists also noted the issue of post-vaccination immune dysregulation and sudden tumor growth in some patients.\n\nIn addition to the already well-established cardiovascular adverse events – such as blood clots, strokes, heart muscle inflammation and menstrual disorders – several auto-immune diseases have also been linked to covid vaccines, including neuro-inflammatory conditions such as Guillain-Barré syndrome and multiple sclerosis (MS), which may be caused by antigenic cross-reactivity.\n\nPost-vaccination hearing loss and tinnitus have recently been covered by ABC News. As for pregnant women, while many ‘health authorities’ recommend that they get vaccinated, the actual Pfizer vaccine trial in pregnant women continues to be delayed for lack of participants. Meanwhile, the US VAERS reporting system counts already more than 2,000 post-vaccination miscarriages.\n\nIn children, it was thought that vaccination would prevent covid-related pediatric inflammatory multi-system syndrome (PIMS). Instead, it turned out that covid vaccines may themselves trigger PIMS, which is most likely caused by an immune reaction to the spike protein. Vaccine-induced PIMS was first noticed in Israel and has recently been confirmed by EMA, the EU Medicines Agency.\n\nThe benefit of covid vaccination in children is so uncertain that vaccine trials had to switch from relevant endpoints (i.e. reduction in disease or death) to dubious proxy indicators like “antibody response”. Meanwhile, a recent US study found that in healthy male adolescents, the risk of post-vaccination myocarditis is about five times higher than the risk of covid hospitalization.\n\nA recently published study in mice found that if mRNA vaccine gets into a vein, the heart muscle absorbs the mRNA, starts producing coronavirus spike protein, gets attacked by the immune system, and develops inflammation and cell damage (i.e. myocarditis). This is likely what happens in humans, too, if the vaccine accidentally gets injected into a blood vessel instead of muscle cells.\n\nHaven’t official vaccine trials shown that covid vaccines are safe, though? The answer is no. In fact, several serious adverse events were already observed during covid vaccine trials, but were discarded as “unrelated”. In addition, the Pfizer vaccine trial excluded five times more people from the vaccine group than from the control group. In the Pfizer vaccine trial for adolescents, as 12-year-old girl suffered permanent paralysis, but Pfizer reported her case merely as “abdominal pain”.\n\nAs for the potential risk of vaccine-induced antibody-dependent disease enhancement (ADE), there continues to be no real-world evidence for this effect, but several molecular simulation studies found that future variants of the Delta strain might potentially trigger ADE (i.e. non-neutralizing antibodies enhancing viral infection, as was the case with vaccines against SARS-1 and dengue).\n\nThe best channel to study case reports of covid vaccine adverse events is “Covid Vaccine Injuries” (18+). However, the well-informed reader should also study a website called “Sorry Antivaxxer”, which documents vaccine skeptics (or even virus skeptics) who died from covid.\n\nData from Israel shows that covid vaccines provide no durable protection against infection, while protection against severe disease decreases from about 95% to about 50% within half a year. Thus, people at high risk of severe covid should in any case consider early treatment options, including monoclonal antibodies. Once in severe condition, covid treatment becomes much more difficult.\n\nIsrael and some other countries have already started “booster vaccinations”, but important safety questions remain: according to an Israeli report, one percent of people sought medical help due to side effects of the third vaccine dose; in a German retirement home, 10% of people suffered serious adverse events after the third vaccine dose and two people (of 90) had to be resuscitated.\n\nSpeaking of Israel, an Israeli civil rights group has recently produced an important one-hour documentary called “The Testimonies Project”, detailing serious covid vaccine injuries based on interviews with Israeli citizens and their relatives (see video below). Globally, covid vaccines may already have killed or severely injured more than 100,000 people.\n\nGiven the lack of vaccine protection against infection and transmission, as well as the rather concerning safety profile, it is clear that there is no medical, ethical or epidemiological justification for covid vaccine mandates or “vaccine passports”. Indeed, the WHO regional director for Europe recently acknowledged that covid vaccines won’t be able to suppress the virus.\n\nThus, the pandemic will end as usual: through widespread and durable natural immunity. In the best case, covid vaccines may help mitigate initial infections in high-risk groups.\n\nYou have been reading: Covid Vaccines and Cancer.\n\n An analysis by Swiss Policy Research.\n\n“I’m honestly just waiting for the third dose to end it.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines and Cancer", "description": "A brief update on covid vaccine adverse events.", "url": "https://swprs.org/covid-vaccines-and-cancer/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-01-23T20:18:45+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/09/covid-vaccine-breast-cancer-h.png?fit=1437%2C865&ssl=1", "image:width": "1437", "image:height": "865", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/09/covid-vaccine-breast-cancer-h.png?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-and-cancer/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-and-cancer/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8379763/", "https://www.nature.com/articles/s41586-020-2639-4/figures/5", "https://europepmc.org/article/PPR/PPR334978", "https://onlinelibrary.wiley.com/doi/10.1002/jcp.30166", "https://swprs.org/covid-vaccine-adverse-events/#cancer", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7305732/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/t-cell-lymphoma-booster.jpg?ssl=1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8379763/", "https://swprs.org/covid-vaccine-adverse-events/#shingles", "https://dailysceptic.org/2021/04/24/new-oxford-study-confirms-spike-in-infections-following-vaccination/", "https://www.youtube.com/watch?v=WR-pqrMWu3E", "https://openvaers.com/covid-data", "https://t.me/s/covidvaccineinjuries/", "https://www.brighteon.com/b22a9872-c1ed-43d6-b8c9-369f8c9065d4", "https://pathologie-konferenz.de/en/", "https://www.brighteon.com/b22a9872-c1ed-43d6-b8c9-369f8c9065d4", "https://leadstories.com/hoax-alert/2021/09/fact-check-dermopathologist-does-not-present-data-for-claim-pfizer-vaccine-weakens-immune-system.html", "https://swprs.org/covid-vaccine-adverse-events/#miscarriages", "https://swprs.org/covid-vaccine-adverse-events/#gbs", "https://swprs.org/covid-vaccine-adverse-events/#ms", "https://www.frontiersin.org/articles/10.3389/fimmu.2020.617089/full", "https://swprs.org/covid-vaccine-adverse-events/#tinnitus", "https://www.wsj.com/articles/pfizer-study-of-covid-19-vaccine-in-pregnant-women-delayed-by-slow-enrollment-11632310283", "https://swprs.org/covid-vaccine-adverse-events/#miscarriages", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/misc-and-covid19-rare-inflammatory-syndrome-in-kids-and-teens", "https://www.israelnationalnews.com/News/News.aspx/296876", "https://www.israelnationalnews.com/News/News.aspx/296876", "https://www.ema.europa.eu/en/news/meeting-highlights-pharmacovigilance-risk-assessment-committee-prac-30-august-2-september-2021", "https://www.statnews.com/2021/09/20/pfizer-covid-19-vaccine-children/", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927", "https://healthpolicy-watch.org/astrazeneca-oxford-university-suspend-covid-19-vaccine-trial-to-investigate-potential-severe-adverse-reaction/", "https://www.verywellhealth.com/tinnitus-covid-vaccine-side-effect-5184272", "https://blogs.bmj.com/bmj/2021/01/04/peter-doshi-pfizer-and-modernas-95-effective-vaccines-we-need-more-details-and-the-raw-data/", "https://www.skirsch.com/covid/VRBPAC.pdf#page=21", "https://defyccc.com/some-papers-about-enhancing-antibodies/", "https://t.me/s/covidvaccineinjuries/", "https://www.sorryantivaxxer.com/", "https://swprs.org/covid-vaccines-a-shot-in-the-dark/", "https://swprs.org/on-the-treatment-of-covid-19/", "https://www.jpost.com/breaking-news/coronavirus-in-israel-14-infected-7-days-after-booster-out-of-422k-676172", "https://www1.wdr.de/nachrichten/ruhrgebiet/probleme-nach-drittimpfung-bei-senioren-100.html", "https://www.vaxtestimonies.org/en/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/the-vaccine-passport-agenda/", "https://medicalxpress.com/news/2021-09-vaccines-pandemic.html", "https://swprs.org/the-power-of-natural-immunity/", "#covid-vaccines-the-testimonies-project", "https://www.vaxtestimonies.org/en/", "#resources", "https://t.me/s/covidvaccineinjuries/", "https://openvaers.com/covid-data", "https://www.sorryantivaxxer.com/", "#see-also", "https://swprs.org/covid-vaccines-a-reality-check/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/vaccines-successes-and-controversies/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-and-cancer/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-and-cancer/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-and-cancer/"], "authors": [], "publish_date": null}