{"result_id": "281036", "URL": "https://swprs.org/covid-vaccines-a-reality-check-ii/", "timestamp": "2023-04-25 17:13:19 CEST+0200", "meta": {"description": "Cutting through the covid vaccine hysteria.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-a-reality-check-ii/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: A Reality Check (II)", "cleaned_text": "The most recent international covid vaccine scare was caused by a presentation of German insurance data that seemingly showed an enormous increase in “sudden deaths” in 2021. Vaccine skeptics immediately blamed the covid vaccine, while covid fanatics argued that the increase was caused by the virus and vaccination actually helped limit the increase.\n\nAs was the case many times during the last three years, both sides were wrong: the data provided by the insurance company to a German politician was filtered and grouped in a misleading way. The actual data shows that there was no increase at all in sudden deaths. The recently released federal mortality statistics shows no increase in sudden deaths, either.\n\nFigures: Sudden deaths in Germany: false data (left) and correct data (right).\n\nA previous scare was about a supposed massive increase in European child mortality in 2022. Once again, vaccine skeptics believed this was clear proof of mRNA mass murder, while covid fanatics were convinced it was an omicron apocalypse in unvaccinated children. In reality, it was a simple EuroMomo baseline mistake, as SPR revealed in September. Nevertheless, some vaccine deaths among adolescents (especially males) did occur, and vaccinating healthy children against covid was a harebrained idea anyway.\n\nEast Asian countries are a very important control and comparison group because they had almost no covid prior to 2022 but at the same time achieved very high vaccination and booster rates.\n\nAs the charts below show, East Asian countries in 2021 had no major excess mortality (red) that is not readily explained by limited covid outbreaks (black). One exception seems to be Taiwan in November/December 2021, but the massive Taiwanese booster drive came only in January/February 2022 and was not linked to any excess mortality at all.\n\nEurope: No Excess Mortality Below 65 or even 75\n\nAnother important fact is that in most European and indeed Western countries, there has been no excess mortality in 2022 in people younger than 65 or even 75. To verify this, one can use the visualization tool of the Human Mortality Database (as reference level, one should choose “week-specific trends”, not “week-specific averages”) or the EuroMomo dashboard.\n\nTwo notable exceptions are the United States and England (but not Scotland). In the United States, excess mortality below 65 is affecting mostly males, which could point to an ongoing drug overdose, suicide and homicide crisis. England (but not Scotland) already showed unusual excess mortality in the 40 to 65 age group in 2020 and 2021. This might be related to a sharp rise in alcohol deaths, South Asian immigrants (who are more prone to severe covid), NHS issues, or something else.\n\nFigure: No excess mortality in the 0-64 age group in Switzerland (TA/BFS)\n\nThe situation is very different in senior citizens, who have indeed experienced significant excess mortality throughout 2022. What has been driving this excess mortality?\n\nFirst of all, it is clear that peaks in excess mortality occurred in parallel to the four or even five large omicron waves in 2022, as shown in the chart below.\n\nIndeed, in many Western countries, about 80% of all covid infections since 2020 have been omicron infections in 2022. As most countries discontinued covid mass testing outside of hospitals in 2022, many omicron deaths may no longer be counted as such.\n\nImportantly, these mortality peaks occurred regardless of whether or not there was a simultaneous booster drive: for instance, Switzerland had essentially no booster drives during the first three omicron waves, while the autumn booster drive came only after the omicron wave and was not associated with any excess mortality.\n\nThe reality is that the omicron variant, although milder than previous variants, can still easily kill elderly people, simply because it’s a novel virus that can overtax their immune system. This was first shown in Hong Kong, which experienced record excess mortality during its first omicron wave in February 2022. Vaccine protection against omicron will be discussed below.\n\nHowever, even after deducting mortality peaks driven by omicron infections, there remains residual excess mortality in senior citizens in most Western countries. How is this to be explained?\n\nThe most likely explanation is that these are post-covid deaths, as several studies have shown that elderly people who survived covid, with or without hospitalization, have a markedly increased risk of subsequent hospitalization and death. An additional explanation could be post-lockdown deaths due to missed prevention and treatment of some other diseases, as well as summer heat waves.\n\nBut in addition to these factors, covid vaccines might also contribute to increased long-term mortality, especially due to potential cardiovascular injuries (see below). Unfortunately, there are not yet any studies on long-term all-cause mortality in vaccinated vs. unvaccinated people.\n\nHowever, it is clear that covid vaccines are still protective against severe covid (see below) and that they dramatically reduced all-cause mortality in 2021. Indeed, in many countries they fully restored life expectancy despite the onslaught of three covid waves (one alpha and two delta).\n\nWhat About Countries With Low Vaccination Rates?\n\nSome vaccine skeptics have argued that countries with low vaccination rates have had no excess mortality in 2022, which would indicate that excess mortality in “mRNA countries” is in fact driven by deadly mRNA covid vaccines.\n\nFirst of all, the above statement is not correct: many low-vaccination countries had significant excess mortality in early 2022 during initial omicron waves (e.g. Romania and Bulgaria). Knowing this, some vaccine skeptics simply decided to measure excess mortality only since April when calculating their “correlations”.\n\nBut it is true that since spring, omicron no longer achieved any major excess mortality in most low-vaccination countries. The most likely explanation for this phenomenon is that these countries had much higher infection and death rates in 2020 and 2021 and, thus, people who were at risk of fatal covid are already dead.\n\nIn contrast, countries that enjoyed strong vaccine protection in 2021 (against alpha and delta) are now catching up (to some extent) due to omicron deaths. But since omicron is milder than previous variants, the overall excess mortality in high-vaccination countries is still lower than in low-vaccination countries (e.g. it is still negative in New Zealand).\n\nThe same effect can be seen in Nordic countries: despite a very high vaccination and booster rate, Sweden saw no excess mortality in 2022, while its Nordic neighbors – Denmark, Norway and Finland – saw significant excess deaths in 2022 (see chart below).\n\nOnce again, the difference is that Sweden had quite high infection and death rates in 2020 and 2021, while the other Nordic countries – thanks to early border controls – largely avoided major covid waves prior to late 2021, but are now catching up with Sweden.\n\nMany vaccine skeptics have argued that even if covid vaccines were effective in 2021, they have clearly and totally failed in 2022. But this is not correct, either.\n\nFirst of all, covid vaccines weren’t designed against omicron to begin with; rather, omicron is most likely another synthetic virus that was designed to achieve maximum vaccine escape (perhaps as part of vaccine research in a well-known South African lab). In a sense, omicron is almost a new virus that has caused a second pandemic after the initial covid pandemic.\n\nBut even so, recent covid vaccination is still about 50% to 80% protective against covid hospitalization, according to the latest data from Britain and Denmark, and previous data from East Asian countries. Then again, this protection is very short-lived and not relevant for people who already had omicron or who aren’t at risk of severe covid anyway.\n\nWithout the synthetic omicron variant, the delta variant would likely have been followed by a kind of delta+ variant with much higher lethality and lower vaccine escape than omicron. In this case, the mortality difference between vaccinated and unvaccinated people, and between countries with high and low vaccination rates, would have been even sharper.\n\nA classic argument of vaccine and virus skeptics in countries like Germany is this: there was no excess mortality in 2020, some excess mortality in 2021 and even more excess mortality in 2022, which proves that the pandemic was a hoax and the vaccines are deadly.\n\nBut the reality is this: in countries like Germany and Canada, covid spread in 2020 was still less than 5% (while the flu was displaced); in 2021, delta killed mostly unvaccinated people; and in 2022, omicron achieved partial vaccine escape and record infection rates.\n\nGlobally, covid has killed about 20 million people, including over one million people in the United States and in Russia. However, because covid deaths were mostly very old, and because vaccine protection kicked in in 2021, many younger people didn’t notice anything unusual.\n\nBack in June, SPR first highlighted the remarkable decline in birth rates observed in many countries since early 2022. SPR discussed both biological factors and social factors as possible explanations.\n\nIn particular, covid vaccines have been shown to impact female menstruation cycles (but not male sperm quality). On the other hand, there was a major decline in marriages in 2020 and 2021 in many countries, and some couples may have decided to delay procreation due to economic factors or ongoing vaccination campaigns. In addition, the difference between preliminary birth data and final birth data may be substantial in some countries.\n\nThe strongest argument against a vaccine-related biological effect on fertility is the fact that some high-vaccination countries have reported increasing, stable, or “normally decreasing” birth rates in 2022 (e.g. France, Portugal, Spain, Italy, the US, New Zealand, Israel and Chile; see chart below). The strongest argument against a purely lockdown-related effect is the fact that even Swedish births are down by almost 8%.\n\nThere are currently several hundred thousand “missing babies” in Europe and Asia. It will be very important to study this topic in detail in 2023 as soon as final numbers are available.\n\nFigure: Changes in birth rates in 2022\n\nA recently published study by highly respected German pathologist Peter Schirmacher investigated the cause of death of 25 people who died suddenly and unexpectedly shortly after vaccination. The study found that in about 30% of these cases, the covid vaccine was the likely cause of death.\n\nIn most of these cases, Schirmacher found clear signs of severe vaccine-induced heart inflammation. These people died on average just two days after vaccination, and their average age was 58 (46-75), significantly older than the “young males” at highest risk of vaccine-induced myocarditis.\n\nBut overall, even professor Schirmacher, who had access to the entire pathological federal state registry of Baden-Wurttemberg (11 million people), found at most 10 cases of “sudden and unexpected” deaths shortly after vaccination that were clearly caused by the vaccine.\n\nAnother recent study, run by the University Hospital of Basel in Switzerland, found that about 3% of 800 people who had received a high-dosed Moderna booster vaccine showed somewhat elevated blood markers consistent with “transient mild cardiac injury” (mostly without any symptoms).\n\nTaken together, the Schirmacher study and the Basel study once again raise the all-important question of just how widespread and how severe such cardiovascular injuries really are among vaccinated and boosted people, and what this means for their long-term health.\n\nNevertheless, as shown above, there is currently no excess mortality in people under 65, and excess deaths in senior citizens are driven primarily by covid infections.\n\nIn contrast to the serious scientific studies mentioned above, a viral vaccine-skeptic online movie, produced by a US radio personality and former bounty hunter, turned out to be utter nonsense.\n\nThe movie not only promoted false data on mortality, births and miscarriages, but also claimed to show “vaccine-induced blood clots” that were, in fact, normal post-mortem blood coagulation effects in refrigerated corpses. The movie even claimed to show footage of vaccine-related cardiac arrests and heart surgery that was, in reality, footage from before the pandemic.\n\nIt is difficult to know if this and similar productions are just amateurish attempts at criticizing covid vaccines, or sensationalist clickbaiting, or some type of disinformation operation to discredit serious vaccine skeptics and justify censorship campaigns.\n\nAs the Schirmacher study and other evidence shows, some people, including young and healthy people, did in fact “die suddenly” due to covid vaccination. Moreover, covid vaccines have caused numerous non-lethal cardiovascular, neurological and immunological adverse events.\n\nIn sum, a sound covid vaccination strategy would have been really simple: only people at significant risk of covid hospitalization or covid death should have been vaccinated. In addition to vaccination, early outpatient treatment should always have been a priority.\n\nSuch a strategy would have been sensible already at the very beginning of the global vaccination campaign, and it became the only legitimate approach by the time Israel confirmed loss of protection against infection and transmission in early summer 2021, before most other countries even started mass vaccinating young adults and children.\n\nVaccinating young and healthy people was likely medical misconduct, and pressuring people into vaccination by cutting off their access to leisure activities, education or work was likely a serious human rights violation that should be met with legal action wherever possible.\n\nGoing forward, a careful comparison of long-term morbidity and mortality in vaccinated and unvaccinated people of all age groups will be most important, while short-term alarmism, especially over non-existing issues, is unlikely to be helpful.\n\nYou have been reading: Covid Vaccines: A Reality Check (II)\n\n An analysis by Swiss Policy Research.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: A Reality Check (II)", "description": "Cutting through the covid vaccine hysteria.", "url": "https://swprs.org/covid-vaccines-a-reality-check-ii/", "site_name": "Swiss Policy Research", "article:modified_time": "2023-01-04T11:13:23+00:00", "image": "https://swprs.org/wp-content/uploads/2022/12/pfizer-biontech-vaccine-revenue.jpg", "image:width": "1908", "image:height": "1146", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/pfizer-biontech-vaccine-revenue.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-a-reality-check-ii/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-a-reality-check-ii/", "#germany-no-spike-in-sudden-deaths", "https://dailysceptic.org/2022/12/13/sudden-deaths-explode-in-germany-after-vaccine-rollout-new-insurance-data-show/", "https://www.zi.de/presse/presseinformationen/13-dezember-2022", "https://twitter.com/FrankfurtZack/status/1603735934909939717#m", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/sudden-deaths-germany-kbv-data.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/sudden-deaths-germany-true-data-zi-e1671093312839.png?ssl=1", "#europe-no-increase-in-child-mortality", "https://swprs.org/good-news-eu-kids-mortality-remains-normal/", "https://www.hartgroup.org/recent-deaths-in-young-people-in-england-and-wales/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/euromomo-0-14-adjusted-mortality-groundwater-2.jpg?ssl=1", "#east-asia-no-excess-mortality-during-vaccination", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&uniformYAxis=0&pickerSort=asc&pickerMetric=location&Metric=Vaccine+doses&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ETWN", "https://github.com/dkobak/excess-mortality/tree/main/img/tracking", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/Japan.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/South-Korea.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/Singapore.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/Taiwan.png?ssl=1", "#europe-no-excess-mortality-below-65-or-even-75", "https://mpidr.shinyapps.io/stmortality/", "https://www.euromomo.eu/graphs-and-maps/", "https://twitter.com/VictimOfMaths/status/1582377908860960768#m", "https://interaktiv.tagesanzeiger.ch/2020/covid-19-ausbruch-im-vergleich/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/swiss-mortality-2020-2022.jpg?ssl=1", "#senior-citizens-what-is-causing-excess-mortality", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&uniformYAxis=0&pickerSort=asc&pickerMetric=location&Metric=Vaccine+doses%2C+cases%2C+ICU+patients%2C+and+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=%7ECHE", "https://swprs.org/coronavirus-the-hong-kong-experience/", "https://swprs.org/how-real-is-2022-excess-mortality/#post-covid-deaths", "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/10/austria-excess-covid-deaths-omicron.png?ssl=1", "#what-about-countries-with-low-vaccination-rates", "https://github.com/dkobak/excess-mortality/blob/main/img/tracking/Romania.png", "https://github.com/dkobak/excess-mortality/blob/main/img/tracking/Bulgaria.png", "https://www.hartgroup.org/country-comparison-of-deaths/", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/bulgaria-germany-excess-deaths.jpg?ssl=1", "#nordic-countries-catch-up-effect", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/nordic-countries-excess-mortality.jpg?ssl=1", "#omicron-no-vaccine-failure", "https://www.stopgof.com/english/omicron-origin/", "https://twitter.com/freja_kirsebom/status/1600848122086711296#m", "https://files.ssi.dk/covid19/tendensrapport/rapport/ugentlige-tendenser-covid19-andre-luftvejs-uge48-2022-e9i2", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/deutschland-wieviele-hatten-corona/", "https://swprs.org/why-the-flu-has-disappeared/", "https://swprs.org/covid-and-reality/#figure-vaccine-protection-against-death", "https://www.economist.com/graphic-detail/coronavirus-excess-deaths-estimates", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/11/coronavirus-variants-antibody-classes-escape-november-2021.png?ssl=1", "#birth-rate-decline-biological-or-social-factors", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/covid-vaccines-and-fertility/", "https://swprs.org/birth-rates-vaccinations-marriages/", "https://swprs.org/coronavirus-september-update/", "https://twitter.com/BirthGauge", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/birth-data-october-2022.png?ssl=1", "#german-pathologists-fatal-vaccine-myocarditis", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://www.unibas.ch/de/Aktuell/News/Uni-Research/Voruebergehende-milde-Herzmuskelzellschaeden-nach-Booster-Impfung.html", "https://swprs.org/covid-vaccines-the-next-vioxx/", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/392_2022_2129_Figa_HTML.webp?ssl=1", "#died-suddenly-movie-stewed-nonsense", "https://dailysceptic.org/2022/11/23/died-suddenly-is-typical-trash-from-stew-peters/", "https://twitter.com/Doctor_Eric_B/status/1596974902526889984", "https://twitter.com/Doctor_Eric_B/status/1595882368380047360", "https://www.factcheck.org/2022/12/scicheck-died-suddenly-pushes-bogus-depopulation-theory/", "https://twitter.com/thereal_truther/status/1586431003312107522", "https://twitter.com/Doctor_Eric_B/status/1595882368380047360", "https://swprs.org/covid-vaccine-adverse-events/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/blood-clots-antemortem-postmortem.jpg?ssl=1", "#conclusion", "https://swprs.org/on-the-treatment-of-covid-19/", "https://swprs.org/covid-vaccines-the-good-the-bad-the-ugly/", "#see-also", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/covid19-facts/", "https://swprs.org/the-face-mask-folly-in-retrospect/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-a-reality-check-ii/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-a-reality-check-ii/"], "authors": [], "publish_date": null}