{"result_id": "281018", "URL": "https://swprs.org/covid-vaccines-reality-check-iii/", "timestamp": "2023-04-25 17:12:59 CEST+0200", "meta": {"description": "Covid vaccines: mass extinction or mass psychosis?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-reality-check-iii/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: Reality Check (III)", "cleaned_text": "In a previous covid vaccine reality check, it was shown that:\n• there was no spike in “sudden deaths” in Germany or elsewhere in 2021;\n• there was no spike in European child mortality in 2022 (Euromomo baseline mistake);\n• vaccination of senior citizens reduced all-cause mortality and restored life expectancy in 2021, despite three covid waves (1x alpha and 2x delta);\n• East Asian countries, with (almost) no covid prior to omicron, saw no excess mortality during record vaccination and booster campaigns in 2021;\n• most Western countries saw no excess mortality among working age people in 2021 and 2022; exceptions include the US (obesity, drug overdose deaths) and England (various factors).\n• both in Western countries and in Asia, excess mortality among senior citizens in 2022 ran in parallel to multiple omicron waves, regardless of vaccination drives.\n• countries that enjoyed few infections or high vaccine protection prior to omicron were to some extent catching up in terms of covid infections and deaths in 2022;\n• there is still no “negative vaccine effectiveness”: vaccines retain about 50% short-term protection against omicron, but natural immunity is far superior;\n• birth rates declined in many, but not in all, high-vaccination countries in 2022, but so did new marriages in 2020/2021 and birth rates in no-lockdown Sweden;\n• autopsy studies and cardiac studies confirmed vaccine-induced cardiovascular injuries and a post-vaccination risk of sudden cardiac death of 1 in 100,000.\n• young and healthy people not at risk of severe covid didn’t benefit from vaccination, but were exposed to significant vaccine-related health risks;\n• there is not yet any evidence of increased cancer rates post vaccination.\n\nIn a previous analysis, it was shown that in 2021, there was a very strong relationship between high vaccination and booster rates in senior citizens and reduced all-cause mortality as well as restored life expectancy. How did this relationship look in 2022 during the omicron era?\n\nThe results are in and they show two major effects (left chart below): first, even in 2022, high vaccination rates were still associated with lower excess death rates; second, countries that had almost no covid prior to omicron were catching up in terms of covid deaths in 2022: this effect was strongest in East Asian countries and in Nordic countries (excluding Sweden).\n\nContrary to widespread belief, English age-adjusted excess mortality in 2022 was rather low (more on this later). In contrast, the United States had rather high excess mortality in 2022: the main reasons for this likely are rather low vaccination rates among the elderly, high obesity rates, and the drug overdose crisis (over 100,000 deaths per year).\n\nIn terms of total pandemic excess mortality (2020-2022, right chart below), it turns out that countries that largely avoided pre-omicron covid infections and that achieved high vaccination rates among the elderly fared best. For instance, New Zealand apparently still has negative total excess mortality since 2020 (but has paid a high price in terms of prolonged isolation).\n\nAt the other end of the scale, Bulgaria, Serbia and Russia lost almost one percent of their entire population to covid, due to low elderly vaccination rates and devastating alpha and delta waves. The intriguing case of Sweden will be discussed in the next section.\n\nFigures: Age-standardized excess mortality in 2022 (left) and since 2020 (right). (Collyer)\n\nThe above charts appear to show that no-lockdown Sweden had one of the lowest excess mortality rates both in 2022 and overall during the pandemic. Supporters of the “Swedish way” obviously love these figures, while lockdown supporters don’t want to talk about them.\n\nBut the truth is that these figures cannot be correct. For some reason Sweden had a major baby bust 80 years ago (from 1920 to 1935, see the blue line in this chart). Because of this, the Swedish mortality rate has been in non-linear decline in recent years and most mortality models underestimate true Swedish excess mortality.\n\nIn this case, it is more appropriate to compare official PCR covid deaths (see chart below). This comparison shows that Sweden has achieved an average mortality result: clearly better than the US, Britain and Italy, but similar to Germany and Austria.\n\nOther Nordic countries, East Asian countries, and New Zealand and Australia continue to have lower covid death rates, mostly due to early border controls and, in East Asia, perhaps ethnic or metabolic differences (i.e. extremely low obesity rates).\n\nMoreover, the median age in Sweden (41 years) is similar to the one in Britain (40.6) but markedly lower than in Austria (45), Italy (46), and Germany (48).\n\nThus, there really was no “Swedish mortality miracle”. Nevertheless, in terms of overall public health and social impact, the Swedish strategy certainly was a success, surpassed almost only by countries that achieved early border controls and high vaccination rates (unlike e.g. Hong Kong).\n\nFigure: PCR covid deaths in Sweden and other Western countries (OWD)\n\nIn most Western countries, working age people didn’t experience excess mortality in 2022 (nor in 2021 and 2020, for that matter), but senior citizens and the elderly suffered substantial excess mortality in 2022. In a previous analysis, it was shown that elderly excess deaths followed omicron waves, but in many countries, this is no longer apparent because costly and useless PCR mass testing was stopped in early 2022.\n\nHowever, some countries publish more useful SARS-2 wastewater data. For example, US wastewater data, shown below, illustrates three important findings: first, both before and after the arrival of omicron, excess deaths (red) follow covid infections (blue); second, covid infections (blue) in 2022 were higher than ever before; and third, actual covid infections (blue) in 2022 were much higher than reported PCR cases (green).\n\nTaken together, omicron infections, both detected and undetected, remain by far the best explanation for elderly excess mortality in 2022.\n\nEngland: Keep Calm and Carry On?\n\nAs the age-adjusted excess mortality chart above showed, England actually performed pretty well in 2022. This was to be expected because England already had high covid death rates in 2020 and achieved high vaccination rates in 2021.\n\nNevertheless, major British media outlets report that England suffered record excess mortality in 2022 and the NHS healthcare system is close to collapsing. How is this discrepancy to be explained?\n\nDue to population ageing, England has been recording increasing annual deaths ever since 2010 and the NHS is certainly approaching its breaking point. At the same time, the British Office for National Statistics (ONS) for some reason keeps using an outdated average mortality baseline that strongly exaggerates actual excess mortality (see chart below).\n\nDespite a stop in mass testing, English wastewater data shows that ever since the delta wave in mid-2021, England has had constantly high levels of covid infections, explaining continued excess deaths among the elderly. In addition, ever since 2020 England has seen unusual excess mortality in the 40 to 65 age group. The cause of this is not entirely clear but it might be due to obesity, alcohol deaths, or more severe covid outcomes among South Asian immigrants.\n\nIn recent months, two more studies appeared to show “negative vaccine effectiveness” (increased risk of infection or death) but actually didn’t.\n\nA Cleveland Clinic study appeared to show that the risk of infection increases with the number of vaccine shots (see stunning graph below). In reality, the study showed recent vaccination was still about 30% protective against infection, but highly vaccinated people had lower infection rates in the past and are now rapidly catching up compared to already recovered (or dead) people.\n\nThe second study, by Indiana University, once again confirmed that infection rates in vaccinated people were higher than in people with natural immunity (as known since mid-2021), but it also confirmed that vaccination significantly reduced the risk of all-cause hospitalization and death (as shown by many other studies).\n\nStill, it is a reality that the immune-evasive (and likely synthetic) omicron variant largely bypassed vaccine protection and basically caused a second global pandemic.\n\nFigure: More injections, more infections? No: impact of natural immunity (MDX)\n\nIn early January 2023, a letter by a US cardiologist and noted covid vaccine skeptic went viral on social media. The letter claimed that, compared to previous years, athlete cardiac arrests and sudden cardiac deaths dramatically increased in 2021.\n\nBut the letter compared strictly defined athlete cardiac arrests in previous years to a list of all-cause athlete deaths in 2021. According to Dr. Jonathan Drezner, director of the UW Medicine Center for Sports Cardiology at the University of Washington, in 2021 and 2022 there was “no uptick in sudden cardiac arrest or death in athletes due to COVID-19 or from COVID vaccinations. This is total misinformation.”\n\nNevertheless, the full data and serious studies on this topic have yet to be published. It is clear that covid vaccination did cause heart inflammation and possibly heart injury in some athletes. Data from Israel, Germany and other countries also confirms a notable increase in mostly young patients hospitalized with myocarditis.\n\nBut if one considers cardiovascular deaths overall, US data actually shows that both in young adults (18-39) and in the population as a whole, cardiovascular deaths strongly increased in 2020 during the initial covid surge, but this increase was stopped by the vaccine roll-out in early 2021 (see chart below).\n\nThis is consistent with the fact that severe covid increases the risk of cardiovascular death, while vaccination reduces the risk of severe covid. German data also shows that heart deaths were driven by covid waves, not by vaccination. In the US, there are about 350,000 sudden cardiac deaths each year or almost 1,000 per day.\n\nIn Canada, a viral story claimed “80 doctors died suddenly after vaccination”. But an analysis of these cases showed that two thirds of them were over 80 and many others died in accidents, by suicide, from cancer, or from other pre-existing health issues.\n\nThen again, a recently published study from Taiwan found that among 5,000 double-vaccinated senior high school students, about 20% had at least one “cardiac symptom” (mostly chest pain or palpitations), 1% had an abnormal ECG, and 5 students had diagnosed myocarditis or arrhythmia. A US study found “markedly elevated levels” of “circulating spike protein” in young adults who developed post-vaccination myocarditis.\n\nData released in Israel shows that already in late February 2021, Israeli health authorities informed the European Medicines Agency EMA about “40 cases of myocarditis”, but the public wasn’t told about this until several months later.\n\nTaken together, people not at risk of severe covid should never have been vaccinated against covid, as emphasized by SPR already back in early 2021 (based on early Israeli data). On the other hand, in people at risk of severe covid, vaccination appears to have prevented both covid deaths and cardiovascular deaths caused by covid.\n\nFigure: Vaccination and cardiovascular deaths in the USA, 18-39 and all ages (Pienaar)\n\nIn 2021, SPR published one of the first reports on the question of a potential link between covid vaccination and cancer. At the time, this was based on just a few published case studies and additional “anecdotal reports” of sudden (re-)emergence of aggressive cancer shortly after vaccination or booster vaccination.\n\nIn recent weeks, British oncology professor, Dr. Angus Dalgleish, reported that he had observed “five to eight” cases of “aggressive cancer” that appeared shortly after covid vaccine boosters, and that he has since been “contacted daily by doctors from far and wide who are seeing the same but not being listened to.”\n\nCovid vaccines are known to induce transient immune suppression in about half of all people. Booster vaccination was found to cause lymphadenopathy (swollen lymph nodes) in about 5% to 10% of all recipients. The long-term health impact of nanolipids (known to be pro-inflammatory) and of modified mRNA itself remains largely unknown. Another recent study detected vaccine spike protein within herpes zoster skin lesions.\n\nNevertheless, mortality statistics have not yet shown any increase in cancer deaths (but this could be due to covid-linked mortality displacement), and so far not a single study has found any increase in cancer rates after covid vaccination. High-quality long-term observational studies will be needed to properly answer this question.\n\nAnother recent covid vaccine scare was caused by two immunological papers that found that after two or three mRNA vaccine doses, there was a switch in SARS-2 antibodies from pro-inflammatory IgG subclasses (1 to 3) to the less inflammatory subclass 4. Vaccine skeptics argued that this indicated “immune tolerance” similar to allergy shots and will make covid worse in vaccinated and boosted people.\n\nSerious immunologists agree that the IgG4 switch is a noteworthy finding. However, the most likely explanation is simply that the immune system is reducing the inflammatory response to limit cellular damage caused by the immune response itself. Indeed, the IgG4 switch was observed after breakthrough infections, too, and the neutralizing capacity of antibodies remains unchanged. It would be interesting to know if the IgG4 switch is also observed in unvaccinated people after 2 to 3 infections.\n\nMeanwhile, in a commentary in the New England Journal of Medicine, legendary US vaccine advocate Paul Offit acknowledged that due to immune imprinting, new bivalent booster vaccines were no better than initial vaccines at increasing neutralizing antibodies, and that boosting young and healthy people really makes no sense anymore.\n\nFigure: Two and three vaccine doses remained highly protective against severe covid.\n\nIn 2021, a California entrepreneur, substack author and noted covid vaccine skeptic offered a dozen bets on covid-related topics. Most of these bets were solid and he would easily win them. But one of the bets was weak and he would lose it: he claimed covid vaccines had cost more lives in the US in 2021 than they had saved (bet #6).\n\nIn reality, covid vaccines saved several hundred thousand lives in the US in 2021, and low US vaccination rates alone cost about 300,000 lives up to April 2022. By dissuading high-risk people from getting vaccinated, amateur vaccine skeptics likely contributed to the death of tens of thousands of people in the United States alone.\n\nIn terms of vaccine deaths, a large study from Qatar recently published in Nature Communications found covid vaccines likely caused 22 deaths in about 2.5 million vaccinated people within one month of vaccination, a rate of 1 per 100’000 people. The cause of death typically was sudden cardiac death within days of vaccination.\n\nExtrapolated to the US, this would translate into a few thousand short-term vaccine deaths, which is bad enough, of course (and doesn’t include potential long-term effects).\n\nUnfortunately for the California entrepreneur, an Israeli entrepreneur recently accepted his vaccine bet. The California entrepreneur first tried to cancel the bet (“nobody was interested”). He then tried to change the rules until the bet was no longer winnable. But it didn’t work, and the California entrepreneur is likely going to lose half a million dollars.\n\nMore generally, while Substack appears to be an excellent platform for publishing and funding independent journalism, the scientific quality of many Substacks focused on covid and covid vaccines is rather low, and Substack authors who would like to gain paying subscribers may be tempted to publish ever more extreme claims (a kind of “Substack syndrome”). Readers should carefully choose whom to follow and always actively check counter-arguments.\n\nThe Gates Confession, PfizerGate, and More\n\nIn a recent interview, US vaccine investor Bill Gates acknowledged “the three problems of (mRNA) vaccines”: “We also need to fix the three problems of [mRNA] vaccines. The current vaccines are not infection blocking. They’re not broad, so when new variants come up you lose protection, and they have very short duration, particularly in the people who matter, which are old people.” Nevertheless, Gates believes that “within a decade, we will have a toolset against respiratory pandemics that will be excellent.”\n\nUS billionaire and Twitter owner, Elon Musk, recently stated on Twitter: “I had major side effects from my second booster shot. Felt like I was dying for several days. Hopefully, no permanent damage, but I don’t know. () And my cousin, who is young & in peak health, had a serious case of myocarditis. Had to go to the hospital. () I had original C19 before vaccines came out and it was basically a mild cold. Then had J&J vaccine with no bad effects, except my arm hurt briefly. First mRNA booster was ok, but the second one crushed me. () It was required to visit Tesla Giga Berlin. Not my choice.”\n\nIn Israel, professor Shmuel C. Shapira, the former head of the Israel Institute for Biological Research, stated: “I was wrong 3 times: Taking the first mRNA shot. Taking the second mRNA shot. And again taking the third mRNA shot. Unfortunately, irreversible mistakes. () But sometimes even people who understand are swayed by pressures. This is an honest attempt to explain.”\n\nIn the US, a Pfizer research director was caught in an undercover operation by Project Veritas admitting that Pfizer was performing (or considering) “SARS-2 mutation experiments”. While a spectacular catch, the information is not really surprising as vaccine developers obviously have to anticipate future mutations. Nevertheless, it is quite possible that omicron (or even the Wuhan virus) emerged in exactly such a type of experiment.\n\nMeanwhile, WHO members met in January to update the WHO International Health Regulations and confer more power to the WHO to “manage the next pandemic”, and at the recent World Economic Forum, “Young Global Leader” Tony Blair called for a “digital infrastructure” to monitor “who is vaccinated and who is not” for the “vaccines that will come down the line”.\n\nThe overall conclusion remains unchanged: vaccinating senior citizens was right; vaccinating young and healthy people was wrong; pressuring people into vaccination was criminal; omicron degraded vaccine protection after just one year; the value of additional “boosters” remains questionable; and potential long-term health effects of vaccination need to be monitored closely.\n\nFigure: Initial covid death rates by age group, with and without nursing homes (more)\n\n∗∗∗\n\n You have been reading: Covid Vaccines: Reality Check (III)\n\n An analysis by Swiss Policy Research.\n• “An AstroTurf case of shallow roots being quick and easy to transplant.”\n• “A really mature and balanced analysis of covid and vaccines. Highly recommended.”\n• “Swiss Policy Research was there for me from the beginning but I’m still waiting for all those who dismissed it as misinformation and propaganda to apologize for ignoring and criticizing me for passing on what I learned from it.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: Reality Check (III)", "description": "Covid vaccines: mass extinction or mass psychosis?", "url": "https://swprs.org/covid-vaccines-reality-check-iii/", "site_name": "Swiss Policy Research", "article:modified_time": "2023-02-28T08:02:42+00:00", "image": "https://swprs.org/wp-content/uploads/2023/01/pure-bloods-garrison.jpg", "image:width": "1536", "image:height": "1101", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/pure-bloods-garrison.jpg?ssl=1", "#review-previous-vaccine-reality-check", "https://swprs.org/covid-vaccines-a-reality-check-ii/", "#excess-mortality-in-2022", "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://twitter.com/dobssi/status/1618646938345418753", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://twitter.com/dobssi/status/1618646938345418753", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/2022-excess-mortality-collyer.jpg?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/pandemic-excess-mortality-2023-collyer.jpg?ssl=1", "#no-swedish-mortality-miracle", "https://commons.wikimedia.org/wiki/File:Demographic_change_in_Sweden_1735-2000.png", "https://swprs.org/obesity-and-the-pandemic-new-insights/", "https://www.worlddata.info/average-age.php", "https://swprs.org/coronavirus-the-hong-kong-experience/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=AUT%7ESWE%7EDEU%7EGBR%7ENOR%7EDNK%7EFIN%7EUSA%7EITA%7ENZL%7EJPN", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/sweden-comparison.jpg?ssl=1", "#elderly-excess-deaths-still-driven-by-covid", "https://swprs.org/covid-vaccines-a-reality-check-ii/#foobox-6/0/austria-excess-covid-deaths-omicron.png?ssl=1", "https://biobot.io/data/", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/usa-excess-deaths-covid-wastewater-superposition.jpg?ssl=1", "#england-keep-calm-and-carry-on", "https://news.sky.com/story/excess-deaths-reach-highest-level-since-pandemic-peak-how-much-are-nhs-failings-to-blame-12780446", "https://twitter.com/PaulMainwood/status/1611284403191414789", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsregisteredweeklyinenglandandwalesprovisional/latest", "https://www.gov.uk/government/publications/monitoring-of-sars-cov-2-rna-in-england-wastewater-monthly-statistics-15-july-2020-to-30-march-2022/emhp-wastewater-monitoring-of-sars-cov-2-in-england-15-july-2020-to-30-march-2022#regional-average-concentration-of-sars-cov-2-rna-in-wastewater-1-june-2021-to-30-march-2022", "https://twitter.com/VictimOfMaths/status/1582377908860960768", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/monthlymortalityanalysisenglandandwales/latest", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/england-deaths-trend.jpg?ssl=1", "#negative-vaccine-effectiveness", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1", "https://ajph.aphapublications.org/doi/10.2105/AJPH.2022.307112", "https://swprs.org/the-power-of-natural-immunity/", "https://swprs.org/covid-vaccines-and-all-cause-mortality/", "https://www.stopgof.com/english/omicron-origin/", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/cleveland-clinic-study.jpg?ssl=1", "#athlete-deaths-and-cardiac-deaths", "https://www.revolver.news/2023/01/holy-smokes-dr-mccullough-claims-1598-suffered-cardiac-arrest-since-vaccination-compared-to-1101-in-prior-38-years/", "https://www.al.com/news/2023/01/false-claims-covid-vaccines-linked-to-athletes-cardiac-arrests-comes-from-blog-its-not-real-research.html", "https://www.al.com/news/2023/01/false-claims-covid-vaccines-linked-to-athletes-cardiac-arrests-comes-from-blog-its-not-real-research.html", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://twitter.com/david_shuldman/status/1612455980897386496", "https://twitter.com/PienaarJm/status/1614016881806958592#m", "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0279333", "https://twitter.com/Jean__Fisch/status/1612799454037348352", "https://twitter.com/nickmmark/status/1538267653457883137", "https://globalnews.ca/news/9405373/covid-conspiracy-theory-doctors-canada/", "https://link.springer.com/article/10.1007/s00431-022-04786-0", "https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.122.061025", "https://twitter.com/YaffaRaz/status/1601704498136641536", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://twitter.com/PienaarJm/status/1614016881806958592#m", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/us-cardiac-deaths-vaccinationn-pienaar.png?ssl=1", "#covid-vaccines-and-cancer", "https://swprs.org/covid-vaccines-and-cancer/", "https://dailysceptic.org/2023/01/06/top-cancer-expert-aggressive-cancers-appearing-after-vaccine-boosters-not-a-coincidence/", "https://dailysceptic.org/2023/01/26/the-disastrous-covid-vaccines-risk-tarring-all-vaccines-with-the-same-brush/", "https://swprs.org/covid-vaccines-and-cancer/", "https://swprs.org/covid-vaccine-adverse-events/#r-lymphadenopathy", "https://joomi.substack.com/p/how-mature-is-lnp-technology", "https://t.me/DrJohnB/1686", "https://twitter.com/thereal_truther/status/1608694460824825856", "https://swprs.org/covid-vaccine-adverse-events/", "https://twitter.com/thereal_truther/status/1608694460824825856", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/us-cancer-deaths-realtruther.jpg?ssl=1", "#the-igg4-switch-an-immunological-trainwreck", "https://alexberenson.substack.com/p/very-urgent-do-covid-mrna-vaccines", "https://twitter.com/Marc_Veld/status/1607380758670331906#m", "https://twitter.com/johnjljacobs/status/1606375708384759809#m", "https://nitter.it/kischober/status/1606002981513662478#m", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/covid-vaccine-switzerland.jpg?ssl=1", "#the-500000-vaccine-bet", "https://stevekirsch.substack.com/p/1m-bet-rules", "https://www.theatlantic.com/health/archive/2022/12/covid-deaths-anti-vaccine-republican-voters/672575/", "https://www.theatlantic.com/health/archive/2022/12/covid-deaths-anti-vaccine-republican-voters/672575/", "https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001173", "https://www.nature.com/articles/s41467-022-35653-z", "https://blog.rootclaim.com/rootclaim-accepts-500000-challenge-on-covid-vaccine-safety-efficacy/", "https://stevekirsch.substack.com/p/a-500k-debate-did-the-covid-vaccine", "https://swprs.org/covid-and-reality/#case-study-unreported-truths", "https://www.bbc.com/travel/article/20200902-the-grim-truth-behind-the-pied-piper", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/12/pied-piper.jpg?ssl=1", "#the-gates-confession-pfizergate-and-more", "https://dossier.substack.com/p/bill-gates-concludes-that-mrna-shots", "https://www.coronaheadsup.com/health/vaccine/elon-musk-i-had-major-side-effects-from-my-second-booster-shot/", "https://www.coronaheadsup.com/coronavirus/israeli-head-of-biological-research-i-was-wrong-three-times-when-i-was-vaccinated/", "https://www.zerohedge.com/political/directed-evolution-pfizer-rd-exec-says-covid-19-created-wuhan-cash-cow-company", "https://www.stopgof.com/english/omicron-origin/", "https://www.snopes.com/fact-check/who-ihr-amendments/", "https://twitter.com/disclosetv/status/1616139662405271575", "#conclusion", "https://swprs.org/studies-on-covid-19-lethality/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/covid-ifr-belgium-nursing-homes-comparison-molenberghs.png?ssl=1", "#what-readers-say", "#annex-vaccine-protection", "https://i0.wp.com/swprs.org/wp-content/uploads/2023/01/who-vaccine-meme.jpg?ssl=1", "#see-also", "https://swprs.org/pandemics-and-propaganda/", "https://swprs.org/the-face-mask-folly-in-retrospect/", "https://swprs.org/covid19-facts/"], "authors": [], "publish_date": null}