{"result_id": "281035", "URL": "https://swprs.org/coronavirus-september-update/", "timestamp": "2023-04-25 17:13:18 CEST+0200", "meta": {"description": "New insights into the coronavirus pandemic.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/coronavirus-september-update/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Coronavirus September Update", "cleaned_text": "New insights into the coronavirus pandemic.\n\n“Baby bust”: was it an illusion?\n\nBack in June and July, SPR covered the apparent drop in births observed in many countries about nine months after mass vaccination, discussing both potential behavioral and biological causes. While it has been clear that 2022 birth data was still preliminary, it looked like this wasn’t sufficient to explain the massive decline in births reported in many countries.\n\nBut an SPR reader was able to retrieve preliminary Swiss birth data from previous years, which revealed that the difference between preliminary 2022 data and preliminary 2020/21 data was only about 5%, not 13%, and it largely disappeared by June 2022 (see chart below).\n\nThis smaller decrease might be explained by a decline in marriages and dating in 2020 and 2021, and by recently vaccinated women (and women planning to get vaccinated soon) having avoided pregnancy in the spring and summer of 2021 (thus explaining the nine-month delay).\n\nNevertheless, considering widespread post-vaccination menstrual disorders and anecdotal reports of post-vaccination miscarriages, a vaccine effect still cannot be fully excluded.\n\nThe British Daily Sceptic has reviewed the very important question of where lockdowns and fast-tracked vaccines really came from, making some surprising discoveries about the roles of the WHO, a WEF-linked Italian think tank, and the mysterious social media lockdown campaign.\n\nIn a fascinating interview with Current Affairs, US professor Jeffrey Sachs, chairman of the Lancet Covid Commission, reveals how Pentagon contractor and WIV collaborator, Peter Daszak, managed to completely subvert the Lancet task-force investigating the origins of SARS-CoV-2.\n\nGiven the genetic evidence, the lab origin of SARS-CoV-2 is a near certainty. Desperate attempts by a small group of biodefense researchers to revive the long-debunked “animal market theory” have failed resoundingly. The only remaining questions are: was this virus created in China or in the US, and was it released accidentally or deliberately.\n\nAlthough rarely discussed, the 2009 swine flu virus, which caused the bogus “swine flu pandemic”, was an engineered virus, too. The 1977 “Russian flu” emerged from vaccine trials in the USSR, and the current omicron virus most likely emerged from covid vaccine research in South Africa.\n\nThus, the last four global virus pandemics were most likely man-made.\n\nNew omicron booster vaccines have become available in many countries, though with very limited data on safety and effectiveness. Based on current evidence, such booster vaccines really only make sense for people at high risk of severe omicron disease (and without previous omicron infection). The new vaccines will still not prevent infection, though.\n\nMeanwhile, Israeli whistleblowers have revealed that the Israeli Ministry of Health – on whose vaccination data other health authorities have relied to some extent – suppressed or minimized booster adverse events, including the types, duration and severity of adverse events. For instance, they downplayed menstrual disorders by relating them to vaccinations in both men and women.\n\nSimilarly, a study led by British Medical Journal senior editor Peter Doshi found that in Pfizer and Moderna covid vaccine trials, serious vaccine adverse events of special interest – such as acute inflammation of the heart, brain, or liver, coagulation disorders (e.g. blood clots) or neurological disorders – occurred in 1 in 800 people, a really rather high rate of serious adverse events.\n\nCovid vaccines continue to provide some benefit to high-risk groups even against omicron (although they weren’t designed against omicron), but for healthy and lean people below 40 or, since omicron, even 50 or 60, covid vaccination probably wasn’t worth the risks, especially since vaccination doesn’t reduce the risk of mild/moderate covid or true long covid after mild infection.\n\nAny remaining vaccination mandates or booster mandates are obviously nonsensical or indeed criminal and should trigger legal action. Nevertheless, the WHO, the OECD, the EU, the UK, and several other countries and entities continue advancing digital “vaccine passports” and “health passports” as a precursor to digital biometric identity and payment systems.\n\nFigure: Covid vaccines are still effective against severe disease and death\n\nSeveral European countries have experienced continued excess mortality since the spring of 2022. Although confirmed covid deaths account only for part of this excess mortality, a temporal analysis of covid infections and excess deaths shows that unaccounted-for omicron infections among very senior citizens are likely the main driver behind this excess mortality.\n\nOther drivers likely include health sequelae of severe previous covid infections, post-lockdown health effects (e.g. due to missed medical checkups and treatment), the European heat wave in July and August, and possibly vaccine and booster-related deaths (especially due to cardiovascular effects). But in no way can the entire recent excess mortality be attributed to vaccine reactions.\n\nFor instance, German researchers found that there was almost no excess mortality in Germany in 2020, but significant excess mortality in 2021, especially in middle age groups. The explanation for this pattern is not that covid was a hoax and the people were then killed by the vaccines; rather, the German population infection rate in 2020 was still less than 5%, and in 2021 middle-aged unvaccinated people with risk factors were killed by the two covid delta waves.\n\nIn contrast, there is still no excess mortality among European children and adolescents (age group 0-14); rather, childhood mortality in 2020 and 2021 was lower than usual because there were fewer accidents and other childhood diseases were displaced by the novel coronavirus.\n\nFigure: European excess mortality by region (March 2020 to July 2022). In Lithuania, total excess mortality is high despite an overall high vaccination rate, because the vaccination rate in senior citizens was lower than in most other European countries, causing a severe delta wave.\n\nEven though the average age of covid deaths was very high (over 80 in Western Europe), the covid pandemic still had a notable impact on life expectancy. In the US, in particular, life expectancy dropped sharply between 2019 and 2021, from about 79 years to just 76 years, the lowest in 25 years. The main causes were covid deaths and an increase in drug overdoses, according to the CDC.\n\nMany Eastern European countries saw a similar decrease in life expectancy, whereas most Western European countries saw a smaller decrease and a recovery already in 2021. Many East Asian countries didn’t see an impact on life expectancy until the omicron wave in 2022.\n\nThe US may have been affected in a particularly severe way due to very high obesity rates (which both aggravate covid and reduce vaccine effectiveness), low vaccination rates in some high-risk groups during the delta wave, and easy access to lethal synthetic opioids.\n\nLoss of life expectancy due to covid (and lockdowns) is comparable to some flu epidemics in the 1920 and 1930s, whereas loss of life expectancy during the 1918/1919 flu pandemic was about 5 to 10 times higher, due to a much lower average age of flu deaths (20 to 30 years).\n\nAustralia and New Zealand: Success or Failure?\n\nIn August, US professor and Great Barrington Declaration co-author, Jay Bhattacharya, argued that “ultimately, New Zealand’s Zero Covid strategy was immoral, incoherent and a grand failure”. But is such a harsh judgement really justified?\n\nIn early 2020, it made sense for places like New Zealand and Australia to close their borders and try to keep the novel virus out, as they had done during previous flu pandemics. They could hope to gain time and possibly get access to treatments or vaccination, especially since both countries have high-risk populations due their very high obesity rates.\n\nEven brief preemptive lockdowns may have made sense in order to disrupt any undetected early transmission (while borders were already closed). Yet the Australian state of Victoria, and its capital city Melbourne in particular, have shown that just one or two mistakes (in a quarantine hotel) were sufficient to trigger an out-of-control regional infection wave. Thus, the “Australian way” simply wasn’t an option for most other countries.\n\nThe fact that vaccination campaigns in Australia and New Zealand started half a year later than in Europe and the US may have been due to global vaccine access priority considerations.\n\nAlready in mid-2021 it was clear – based on Israeli data – that Australia and New Zealand would get swamped with coronavirus as soon as they would open their borders. Yet they could still hope that prior vaccination would drastically reduce severe and fatal cases of covid.\n\nThe unexpected emergence, in late 2021, of the synthetic omicron variant decreased both vaccine protection but also covid severity. The end result is that Australia has suffered significant excess mortality in 2022, though overall still about four times less than Britain and about six times less than the United States since 2020. New Zealand performed even better.\n\nThis result has been achieved by avoiding the fierce early coronavirus waves (Wuhan, Alpha, Delta) and by providing some vaccine protection to senior citizens and other risk groups.\n\nOn the other hand, Australia invested about $2 billion dollars in mostly unused “quarantine camps”, and the economic performance of Australia and New Zealand during the pandemic was mediocre at best (mainly due to the collapse of tourism, which may have been unavoidable).\n\nIn addition, Australia – and especially Melbourne – has seen some of the worst civil rights violations among Western countries during the pandemic (see video: A week in Melbourne, 18+). Many citizens were not allowed to leave the country or even to return from abroad for almost two years.\n\nConcerning the Great Barrington Declaration itself, it should be noted that “focused protection” really wasn’t achieved anywhere in the world: the higher infection rates in the general population were, the higher deaths among risk groups were (including in nursing homes). Only early treatment (ignored in most countries) and then vaccination (forced upon the entire population in many countries) could provide a kind of “focused protection”.\n\nChina continues to impose devastating lockdowns on some of its megacities. Since late August, China locked down over 70 cities, including 15 provincial capitals, with a combined population of over 300 million people.\n\nRegardless of any political considerations, to truly grasp the reality of the Chinese “zero-covid strategy”, SPR recommends the eye-opening Twitter video channel of “Songpinganq” (18+).\n\nIn a newly published study, Swiss researchers found that severe covid, but not influenza or bacterial pneumonia, is characterized by an auto-immune IgA attack against so-called pulmonary surfactant proteins, which keep the lungs flexible and allow for easy breathing.\n\nBecause of this, covid treatments that prevent or reduce the hyper-inflammatory auto-immune response, or that improve blood flow in the lungs, may be helpful even if they do not directly target viral replication. (Read more: Severe covid as a post-viral auto-immune attack).\n\nIn this regard, a new study of ivermectin, an antiparasitic drug with known anti-inflammatory and anti-asthma properties, found that patients with severe covid showed significantly improved blood oxygenation within 24 to 48 hours after treatment with ivermectin.\n\nThis latest ivermectin study should obviously be replicated by other research groups to verify the validity of the results, but at any rate it is simple and solid study designs like this that really make sense when investigating covid treatments. (Read more: The Ivermectin Debate).\n\nThe SPR overview of WEF Young Global Leaders in politics and the media is now available as an updated stand-alone article and includes new sections on Russian members and royal members. WEF Young Global Leaders have played a very prominent role in the technocratic global (mis-)management of the coronavirus pandemic and the push for “vaccine passports”.\n\nThe new overview features several “fact checks” on some controversial questions: WEF founder Klaus Schwab is not related to the Rothschilds or to a German Wehrmacht general, but Canadian Prime Minister Justin Trudeau really may be the son of late Cuban leader Fidel Castro.\n\nMost importantly, however, there is credible evidence that the founding of the WEF in 1971 may have been a CFR/CIA Cold War initiative to improve the image of ‘capitalism’ (similar to the left-wing “Congress for Cultural Freedom”, later exposed as a CIA platform). If so, the WEF Young Global Leaders may have to be seen as CFR/CIA-selected political and economic leaders.\n\nNew investigations have revealed that the novel, sexually transmissible type of monkeypox first emerged in Nigeria as early as 2017. For several years, this novel type of monkeypox circulated among mostly gay men in western Africa, before it achieved an unprecedented global outbreak in the spring of 2022, likely via several large European gay festivals.\n\nIt is still unclear why sexually transmissible monkeypox emerged in Nigeria in 2017. It could have been a natural development, or mutations in the context of HIV hyper-mutation drug trials, or even virological research “in a US-funded biolab in Nigeria” (as the Russians, of course, have proposed).\n\nIn many European countries and in the US, daily new monkeypox infections are already decreasing, whereas in Latin America, daily new infections are still increasing. It’s quite possible that monkeypox will remain circulating as a sexually transmitted disease primarily among gay men, who continue to account for about 99% of all monkeypox infections.\n\nYou have been reading: Coronavirus September Update.\n\n An analysis by Swiss Policy Research.", "opengraph": {"locale": "en_US", "type": "article", "title": "Coronavirus September Update", "description": "New insights into the coronavirus pandemic.", "url": "https://swprs.org/coronavirus-september-update/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-09-10T05:51:21+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/dilbert-pandemic-prevention.jpg?fit=900%2C280&ssl=1", "image:width": "900", "image:height": "280", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/dilbert-pandemic-prevention.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/coronavirus-september-update/", "https://www.facebook.com/share.php?u=https://swprs.org/coronavirus-september-update/", "https://t.me/share/url?url=https://swprs.org/coronavirus-september-update/", "#baby-bust-was-it-an-illusion", "https://swprs.org/birth-rates-vaccinations-marriages/", "https://swprs.org/birth-rates-vaccinations-marriages/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/covid-vaccination-and-pregnancy/", "https://www.bfs.admin.ch/bfs/de/home/statistiken/kataloge-datenbanken/tabellen.assetdetail.22804223.html", "https://www.bfs.admin.ch/bfs/de/home/aktuell/neue-veroeffentlichungen.assetdetail.21044585.html", "https://www.bfs.admin.ch/bfs/de/home/statistiken/bevoelkerung/geburten-todesfaelle.assetdetail.23226318.html", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/switzerland-births-provisional.jpg?ssl=1", "#coronavirus-origins", "https://dailysceptic.org/2022/08/22/where-lockdowns-and-fast-tracked-vaccines-came-from/", "https://www.currentaffairs.org/2022/08/why-the-chair-of-the-lancets-covid-19-commission-thinks-the-us-government-is-preventing-a-real-investigation-into-the-pandemic", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://ayjchan.medium.com/evidence-for-a-natural-origin-of-covid-19-no-longer-dispositive-after-scientific-peer-review-af95b52499e1", "https://therequestor.substack.com/p/is-wuhan-a-red-herring", "https://unlimitedhangout.com/2020/04/investigative-series/all-roads-lead-to-dark-winter/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/#a-previous-pandemics-and-epidemics", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/#a-previous-pandemics-and-epidemics", "https://www.stopgof.com/english/omicron-origin/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/08/covid-fcs-insertion-sherlock.jpeg?ssl=1", "#covid-vaccines", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-09-01/06-COVID-Miller-508.pdf", "https://dailysceptic.org/2022/09/04/serious-vaccine-side-effects-covered-up-by-israeli-government-leaked-video-reveals/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://ourworldindata.org/covid-deaths-by-vaccination#switzerland", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/post-acute-covid-long-covid/", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/covid-vaccine-switzerland.jpg?ssl=1", "#mystery-excess-mortality-in-2022", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2022-01-01..2022-09-01&uniformYAxis=0&pickerSort=asc&pickerMetric=location&Metric=Cases+and+deaths&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=PRT%7ECHE%7ENLD", "https://www.researchgate.net/publication/362777743_Excess_mortality_in_Germany_2020-2022", "https://swprs.org/deutschland-wieviele-hatten-corona/", "https://swprs.org/good-news-eu-kids-mortality-remains-normal/", "https://news.yahoo.com/lithuanian-government-proposes-paying-over-135240466.html", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/europe-excess-deaths-regions-kobak-july-2022.jpg?ssl=1", "#impact-on-life-expectancy", "https://swprs.org/studies-on-covid-19-lethality/#age", "https://www.statnews.com/2022/08/31/u-s-life-expectancy-drops-sharply-the-second-consecutive-decline/", "https://twitter.com/rpezer1/status/1549453730206072834#m", "https://www.covid-datascience.com/post/evaluating-usa-state-level-excess-death-levels-vs-total-vaccination-rates-during-the-pandemic", "https://swprs.org/covid-19-mortality-overview/#b-impact-on-life-expectancy", "https://swprs.org/covid-versus-the-flu-revisited/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/life-expectancy-usa-peers-2019-2021.jpg?ssl=1", "#australia-and-new-zealand-success-or-failure", "https://www.spiked-online.com/2022/08/07/zero-covid-has-cost-new-zealand-dearly/", "https://swprs.org/obesity-and-the-pandemic-new-insights/", "https://quillette.com/2021/02/15/do-lockdowns-work-only-if-you-lock-the-borders-down-too/", "https://www.news.com.au/national/victoria/news/60-minutes-australia-inside-victorias-massive-hotel-quarantine-bungle/news-story/7af3b9cfd4c3de024954350f4388397a", "https://swprs.org/israel-highest-infection-rate-in-the-world/", "https://www.stopgof.com/english/omicron-origin/", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "//www.dailymail.co.uk/news/article-11011881/Australias-2BILLION-Covid-quarantine-facility-white-elephants-unlikely-used.html", "https://twitter.com/jhnhellstrom/status/1369258618248429572", "https://archive.ph/20220202053402/https://www.economist.com/finance-and-economics/which-economies-have-done-best-and-worst-during-the-pandemic/21806917", "https://swprs.org/civil-rights-and-the-pandemic/#melbourne", "https://ltccovid.org/2022/02/22/international-data-on-deaths-attributed-to-covid-19-among-people-living-in-care-homes/", "https://swprs.org/on-the-treatment-of-covid-19/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/melbourne-beach-arrest-september-2020.webp?ssl=1", "#china-lockdowns", "https://edition.cnn.com/2022/09/05/china/china-covid-lockdown-74-cities-intl-hnk/index.html", "https://twitter.com/songpinganq", "#covid-disease-and-treatment", "https://www.atsjournals.org/doi/abs/10.1164/rccm.202201-0011OC", "https://swprs.org/severe-covid-a-post-viral-autoimmune-attack/", "https://www.mdpi.com/2673-8449/2/3/15/htm", "https://swprs.org/the-ivermectin-debate/", "#wef-young-global-leaders", "https://swprs.org/the-young-global-leaders-of-the-davos-world-economic-forum-wef/", "https://swprs.org/the-young-global-leaders-of-the-davos-world-economic-forum-wef/#fact-checks", "https://swprs.org/the-young-global-leaders-of-the-davos-world-economic-forum-wef/#fact-checks", "#monkeypox", "https://swprs.org/monkeypox-natural-outbreak-or-engineered-bioterrorism/#august-2022", "https://swprs.org/monkeypox-natural-outbreak-or-engineered-bioterrorism/#august-2022", "https://ourworldindata.org/explorers/monkeypox?facet=none&pickerSort=desc&pickerMetric=total_confirmed_by_confirmation&hideControls=true&Metric=Confirmed+cases&Frequency=7-day+average&Relative+to+population=true&country=ESP%7EPRT%7EGBR%7EOWID_WRL%7EDEU%7ENLD%7EBEL%7EFRA%7ECAN%7EITA%7EUSA%7EBRA%7EARG", "https://www.cidrap.umn.edu/news-perspective/2022/08/monkeypox-cases-reach-7500-us-99-cases-males", "#see-also", "https://swprs.org/covid19-facts/", "https://swprs.org/the-nine-great-covid-mysteries/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://twitter.com/intent/tweet?url=https://swprs.org/coronavirus-september-update/", "https://www.facebook.com/share.php?u=https://swprs.org/coronavirus-september-update/", "https://t.me/share/url?url=https://swprs.org/coronavirus-september-update/"], "authors": [], "publish_date": null}