{"result_id": "281037", "URL": "https://swprs.org/the-covid-vaccine-war-ii/", "timestamp": "2023-04-25 17:13:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/the-covid-vaccine-war-ii/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "The \"Vaccine Passport\" Agenda (II)", "cleaned_text": "New developments concerning “vaccine passports”, vaccine mandates, and protests against them – an updated international overview.\n\nBack in March 2020, “the world’s most powerful doctor” (Politico), pandemic strategist and major WHO donor, Bill Gates, announced that the coronavirus pandemic “can only be ended” by “vaccinating almost the entire world” and by “introducing digital immunity certificates”. At the time, Gates also believed that the global spread of the coronavirus could be limited to “less than one percent” of the population by imposing lockdowns and “contact tracing” (see video).\n\nAll of Bill Gates’ predictions and recommendations turned out to be wrong (and highly destructive), but it is obvious that national governments continue to follow and enforce this strategy regardless, while billionaire-funded international industry collaborations such as ID2020 and “Good Health Pass” are planning the introduction of cross-border digital biometric identity systems.\n\nIn the meantime, it has become broadly accepted that the novel coronavirus was almost certainly engineered as part of US-Chinese dual-use virological research, a scenario that is consistent with either an accidental lab leak (in Wuhan or the US) or a deliberate release (similar to the 2001 anthrax letters, already linked to covid). The estimated global pandemic mortality currently stands at close to 20 million people, affecting primarily the elderly and people with metabolic preconditions.\n\nChina has now become the only country in the world to still pursue a “zero covid” policy. It does so at an enormous cost, shutting down entire mega cities upon first confirmed infections, transporting tens of thousands or even hundreds of thousands of citizens into make-shift quarantine camps, and running a large-scale, all-encompassing QR code population control system.\n\nAt this point, it looks like “admitting defeat” in the battle against the virus could be a bigger threat to the Chinese government than the virus itself (especially since the emergence of omicron). It is not really clear what the Chinese endgame is, but the impact on global trade could be very significant.\n\nTo get a look behind the curtain of official state propaganda, see the eye-opening Twitter video channel of “Songpinganq” (16+, includes some disturbing footage). To learn more about the Chinese digital “social credit” system, see this 5-minute report by France24.\n\nThe Russian parliament is in the process of passing a federal law implementing a national QR code “vaccination certificate” system, but has repeatedly postponed adoption of the law due to “strong public opposition” and “new challenges” posed by omicron. Among advanced industrial countries, Russia continues to have by far the lowest vaccination rate (about 50% of the total population).\n\nAfter India, Russia has become the second country in the world to reach a total pandemic excess mortality of 1 million deaths (an excess of about 30% compared to normal two-year mortality and about 0.7% of the total population; the median age of death is about 73 years, i.e. close to life expectancy). The total Russian infection rate is probably close to 80% by now.\n\nTo get an insider’s perspective on covid-related developments in Russia, see the substack of “Edward Slavsquat”, a former editor at the state-run Russia Today (RT) international news network.\n\nSweden has shown that, for most countries, a patient-focused, no-lockdown approach to the pandemic has been best; Sweden has experienced an excess mortality of about 12%, which is similar to or lower than in demographically comparable countries, such as Germany (10%), Switzerland (16%), Austria (19%) and the Netherlands (19%).\n\nNevertheless, the Swedish government has also used the pandemic to grant itself far-reaching “emergency powers” and, against all epidemiological evidence, it has recently started to mandate “vaccine passes” for several public venues and events, excluding both recovered and tested people.\n\nTo get a no-nonsense insider’s perspective on developments in Sweden, see The end of Sweden’s unique approach?, written by a German expatriate living there since 2003.\n\nIn Israel, criticism of national vaccination and booster mandates is increasingly being depicted as a “national security offense” by both the government and parts of the media (see this thread by an Israeli lawyer and leading civil rights activist). On the other hand, senior medical figures have begun to publicly ask the government to halt its repressive policies.\n\nFor instance, the director of the largest Israeli hospital told the government to stop its “insane test and quarantine policy”, as omicron no longer posed a major challenge to hospitals. An open letter by Tel Aviv University professor Ehud Qimron, sharply criticizing unscientific and inhumane pandemic policies, has already been read by more than 5 million people in 16 languages.\n\nBack in October, Israel was the first country to “deactivate” the “vaccine passports” of one million citizens without a “booster shot”, a policy since copied by several other countries.\n\nIn the United States, the question of “vaccine mandates” and “vaccine passports” has now reached the Supreme Court. The current US Administration initially issued five different vaccine mandates: for health care workers, businesses with more than 100 employees, federal contractors, federal employees, and the military.\n\nIn two recent decisions, the US Supreme Court blocked the federal “vaccine or test” mandate for businesses with more than 100 employees (OSHA mandate), but approved a mandate for most health care workers (CMS mandate).\n\nRegarding the OSHA business mandate, the Supreme Court argued that it was a “significant encroachment into the lives – and health – of a vast number of employees” that “cannot be undone at the end of the workday”, and that covid should be seen as a “day-to-day danger” similar to “any number of communicable diseases” and not as a “work-related danger or occupational hazard”.\n\nRegarding the CMS health care worker mandate, the Supreme Court argued (falsely) that this was about ensuring that “the health care providers who care for Medicare and Medicaid patients protect their patients’ health and safety”, despite the fact that covid vaccines don’t prevent or even just reduce infection and transmission.\n\nThe US Supreme Court has not yet reviewed the federal contractor mandate, but this mandate has already been blocked by several lower courts and is unlikely to be supported by the Supreme Court, according to legal experts. In contrast, the mandate for federal employees and the military has not yet been successfully challenged in courts. (Update: A federal judge in Texas issued a nationwide injunction blocking the mandate for federal employees.)\n\nIn addition to federal mandates, several states, including New York and California, and several major cities, including Boston, Philadelphia, New York City, San Francisco and Los Angeles, have imposed far-reaching vaccination requirements. Foreign national air travelers to the US are also required to be “fully vaccinated”. Some major US corporations have also announced vaccination requirements, while others, including some airlines, had to backtrack after worker protests and walkouts.\n\nFurthermore, over 400 colleges and universities are requiring vaccines or even boosters for students to attend in-person classes, a policy that can really only be described as a major medical crime, given the very unfavorable risk/benefit profile in this age group.\n\nOn the other hand, over 20 US states – most of them apparently governed by the same political party – have prohibited any use of “vaccination certificates” (see this overview). Legal experts said that the recent Supreme Court approval of the CMS health care worker mandate will likely supersede state orders blocking such mandates, but the Governor of Florida has already contradicted this, stating that Florida “will not enforce” a federal mandate and will not serve as the “biomedical police” of the federal government.\n\nOf note, while the FDA formally approved the Pfizer Comirnaty vaccine back in September to enable vaccination mandates in the first place, the approved vaccine isn’t actually available in the US (or anywhere else), and US citizens continue to receive the “emergency use only” Pfizer vaccine with essentially no product liability (but the same ingredients).\n\nSee also: ‘Cloak and dagger’ military-intelligence outfit at center of US digital vaccine passport push (The Grayzone, October 2021)\n\nThe situation in Great Britain remains somewhat confusing. England, Scotland and Wales have all implemented “vaccine certificates” for various public venues and have threatened to fire tens of thousands of unvaccinated employees (regardless of their actual immunity status). In September, Great Britain announced to join the EU vaccine passport scheme. On the other hand, the British health secretary recently promised to “scrap domestic covid passes” by the end of January.\n\nIn December, EU Commission President Ursula von der Leyen said that the EU should consider mandatory covid vaccination – despite the fact that full approval by the European Medicines Agency is still outstanding–, and several EU countries are indeed moving in this direction.\n\nAustria was the first country to announce a population-wide vaccination mandate as of February, but they have since postponed it due to “technical issues”. The Austrian law foresees high quarterly fines for people refusing to get vaccinated.\n\nGermany is discussing a vaccination mandate, but the initial timeline had to be postponed. Several critics of the government policy, including a leading professor of virology, lost their jobs or got investigated by German police. Major independent news outlets had their social media or video channels suspended. In both Germany and Austria, a military general is coordinating the national “crisis response” and vaccination policy.\n\nItaly has recently imposed a vaccination mandate for people over 50 and a “vaccine certificate” called “super green pass” for many daily activities.\n\nIn France, President Macron (a WEF Young Leader) announced that he wants to “piss off” unvaccinated citizens by “limiting access to key aspects of life in the country”. Despite Macron’s “best efforts”, France is currently reporting one of the highest infection rates in the entire world – together with Pfizer pioneer Israel, zero-covid model Australia, and Ireland.\n\nIn Belgium, the Prime Minister (also a WEF Young Leader) recently flip-flopped and announced that he was considering a vaccination mandate, too.\n\nIn Spain, courts have approved “covid passes” in some regions and for some activities, but have blocked them in other regions (see this overview).\n\nAll of the European countries rely on the EU digital vaccine certificate platform, which has been in the making for several years already and which is seen by some as a precursor to an EU digital biometric identity system.\n\nAustralia has also imposed “vaccine certificates” and, in some states, “lockdowns for the unvaccinated”. In addition, the notorious Australian “quarantine camps” have been activated. All of these “measures” are of course ineffective and so former “zero covid” champion Australia is currently reporting one of the highest infection rates in the world.\n\nTo top it all off, Australia recently granted but then canceled an entry visa to recovered, but unvaccinated tennis player Novak Djokovic, while three vaccinated players have already dropped out of the tournament with “chest issues” and others have since tested positive. The Australian health minister is a WEF Young Leader and a former WEF strategy director.\n\nIn Canada, citizens can no longer use trains and planes or even leave the country without being “fully vaccinated”. In the United Arab Emirates, citizens are no longer allowed to leave the country without having received a “booster shot”. Kenya also introduced far-reaching “vaccine certificates”, despite a very high infection rate and a very low vaccination rate.\n\nObviously, none of the policies described above have any medical or epidemiological justification whatsoever. Instead, the coronavirus might be seen as a kind of invisible but omnipresent “terror threat”, similar to earlier supposed “terror threats”, that “requires” persistent government action and control to “protect the population”. Pandemic strategist Bill Gates already warned of future “smallpox terror attacks” and called for the creation of a “billion-dollar pandemic task force”.\n\nNumerous countries are seeing some of the largest protests in decades against vaccination mandates and vaccination passports. In Germany, for instance, there are currently more than 1,000 weekly protests with a total of about 300,000 to 500,000 participants. In Bulgaria, protestors recently tried to storm the parliament – for real, unlike the FBI-run January 6 “Storming of the US Capitol”.\n\nTo get an overview of ongoing global protests, see the following dedicated social media channels and the 5-minute video compilation below.\n\nYou have been reading: The “Vaccine Passport” Agenda (II).\n\n An analysis by Swiss Policy Research.\n• The WEF and the Pandemic", "opengraph": {"locale": "en_US", "type": "article", "title": "The \"Vaccine Passport\" Agenda (II)", "description": "New developments concerning \"vaccine passports\", vaccine mandates, and protests against them – an updated international overview.", "url": "https://swprs.org/the-covid-vaccine-war-ii/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-03-02T07:20:26+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/gates-federer-nadal-noah-february-2020-cut.png?fit=1125%2C899&ssl=1", "image:width": "1125", "image:height": "899", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/gates-federer-nadal-noah-february-2020-cut.png?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/the-covid-vaccine-war-ii/", "https://www.facebook.com/share.php?u=https://swprs.org/the-covid-vaccine-war-ii/", "https://t.me/share/url?url=https://swprs.org/the-covid-vaccine-war-ii/", "#general-considerations", "https://www.politico.eu/article/bill-gates-who-most-powerful-doctor/", "https://www.youtube.com/watch?v=JDjw8-3VZp8", "https://www.youtube.com/watch?v=JDjw8-3VZp8", "https://www.goodhealthpass.org/advocay", "https://www.biometricupdate.com/202111/cross-border-digital-id-is-coming-mastercard-plans-to-supply-infrastructure", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://covertactionmagazine.com/2021/09/10/anthrax-attacks-directed-against-public-officials-following-9-11-had-all-the-markings-of-a-false-flag-operation/", "https://unlimitedhangout.com/2020/04/investigative-series/all-roads-lead-to-dark-winter/", "https://swprs.org/covid-19-mortality-overview/", "#china", "https://twitter.com/songpinganq", "https://twitter.com/songpinganq", "https://www.youtube.com/watch?v=NXyzpMDtpSE", "#russia", "https://www.reuters.com/world/europe/russia-postpones-second-reading-draft-law-covid-19-qr-codes-2022-01-14/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=asc&pickerMetric=location&Metric=People+vaccinated&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=RUS~USA~GBR~European+Union~IND~CHN", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://edwardslavsquat.substack.com/p/i-believe-we-are-facing-an-evil-that", "#sweden", "https://swprs.org/judgment-day-sweden-vindicated/", "https://github.com/dkobak/excess-mortality#excess-mortality-during-the-covid-19-pandemic", "https://multipolar-magazin.de/artikel/the-end-of-sweden-s-unique-approach", "https://multipolar-magazin.de/artikel/the-end-of-sweden-s-unique-approach", "#israel", "https://twitter.com/GalG____/status/1480835205686509568", "https://twitter.com/DrEliDavid/status/1482399658102202370", "https://swprs.org/professor-ehud-qimron-ministry-of-health-its-time-to-admit-failure/", "https://www.i24news.tv/en/news/israel/1632818865-israelis-without-booster-vaccine-will-lose-green-pass", "#united-states", "https://www.hklaw.com/en/insights/publications/2022/01/us-supreme-court-stays-osha-vaccine-mandate-but-allows-enforcement", "https://www.hklaw.com/en/insights/publications/2022/01/us-supreme-court-stays-osha-vaccine-mandate-but-allows-enforcement", "https://www.cbsnews.com/news/judge-blocks-biden-federal-worker-vaccine-mandate/", "https://www.cnet.com/health/biden-covid-vaccine-mandate-which-us-workers-will-need-vaccination-proof/", "https://travel.state.gov/content/travel/en/international-travel/emergencies/covid-19-faqs-for-travel-to-the-us-information.html", "https://web.archive.org/web/20220314120205/https://thecovidworld.com/name-shame-companies-discriminating-against-their-unvaccinated-employees/", "https://www.cnet.com/health/biden-covid-vaccine-mandate-which-us-workers-will-need-vaccination-proof/", "https://swprs.org/covid-vaccines-a-reality-check/", "https://ballotpedia.org/State_government_policies_about_vaccine_requirements_(vaccine_passports)", "https://www.beckershospitalreview.com/legal-regulatory-issues/desantis-casts-aside-cms-vaccine-rule-for-hospitals.html", "https://swprs.org/pfizer-fda-95-deception/", "https://thegrayzone.com/2021/10/26/cloak-dagger-military-intelligence-digital-vaccine-passport/", "#great-britain", "https://www.theguardian.com/world/2021/nov/10/care-homes-in-england-set-to-lose-50000-staff-as-covid-vaccine-becomes-mandatory", "https://www.telegraph.co.uk/global-health/science-and-disease/uk-brink-joining-eu-passport-scheme-sources-confirm-nhs-system/", "https://dailysceptic.org/2022/01/14/covid-passes-to-be-scrapped-within-two-weeks/", "#european-union", "https://www.theguardian.com/world/2021/dec/01/eu-must-consider-mandatory-covid-jabs-says-von-der-leyen", "https://www.reuters.com/world/europe/austria-announce-details-planned-covid-19-vaccine-mandate-2021-12-09/", "https://abcnews.go.com/Health/wireStory/parties-german-vaccine-mandate-months-pass-82161028", "https://www.rnd.de/politik/universitaet-halle-alexander-kekule-wehrt-sich-gegen-vorlaeufige-dienstenthebung-DX6YKCNHUNAQPOHYGZDKUNJHAM.html", "https://corona-transition.org/der-wissenschaftler-prof-stefan-hockertz-hat-deutschland-verlassen", "https://meedia.de/2022/01/12/youtube-muss-kanal-von-achse-des-guten-wieder-freischalten/", "https://www.welt.de/vermischtes/article236042762/Corona-General-Breuer-stellt-Novavax-Impfstoff-bis-Ende-Januar-in-Aussicht.html", "https://www.cbsnews.com/news/covid-19-vaccine-italy-requirement-50/", "https://swprs.org/the-wef-and-the-pandemic/", "https://www.thelocal.fr/20220104/macron-causes-stir-as-he-vows-to-pss-off-frances-unvaccinated/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=desc&pickerMetric=new_cases_smoothed_per_million&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=IRL~FRA~AUS~ISR", "https://swprs.org/the-wef-and-the-pandemic/", "https://ostbelgiendirekt.be/de-croo-nicht-gegen-impfpflicht-306313", "https://english.elpais.com/society/2021-12-01/covid-passports-in-spain-a-region-by-region-breakdown-of-where-they-are-required-and-for-which-activities.html", "https://off-guardian.org/2020/05/22/report-eu-planning-vaccination-passport-since-2018/", "#australia", "https://townhall.com/tipsheet/madelineleesman/2022/01/08/australian-politician-imposes-lockdown-on-unvaccinated-residents-work-is-not-a-n2601564", "https://swprs.org/meanwhile-in-australia/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&facet=none&pickerSort=desc&pickerMetric=new_cases_smoothed_per_million&Metric=Confirmed+cases&Interval=7-day+rolling+average&Relative+to+Population=true&Color+by+test+positivity=false&country=IRL~FRA~AUS~ISR", "https://freewestmedia.com/2022/01/10/three-players-drop-out-of-australian-open-with-chest-issues-while-djokovic-awaits-his-fate/", "https://swprs.org/the-wef-and-the-pandemic/", "#other-countries", "https://nypost.com/2021/08/13/canada-to-require-covid-19-vaccine-for-plane-train-ship-travelers/", "https://www.washingtonpost.com/world/2022/01/03/uae-coronavirus-booster-shot-foreign-travel/", "https://www.enca.com/news/kenya-bans-unvaccinated-public-places-covid-cases-soar", "#coronavirus-as-a-terror-threat", "https://swprs.org/preview-staged-terrorism-the-evidence/", "https://www.itv.com/news/2021-11-03/bill-gates-warns-of-smallpox-terror-attacks-in-bid-for-pandemic-prevention-funds", "https://multipolar-magazin.de/artikel/300000-gegen-impfpflicht", "https://twitter.com/BananaMediaQ/status/1481304163766128640", "https://www.revolver.news/2021/12/damning-new-details-massive-web-unindicted-operators-january-6/", "https://twitter.com/BananaMediaQ", "https://twitter.com/AnonymeCitoyen", "https://gettr.com/user/nicoleelisei", "https://twitter.com/risemelbourne", "https://twitter.com/RadioGenova", "https://twitter.com/efenigson", "#see-also", "https://swprs.org/the-wef-and-the-pandemic/", "https://swprs.org/covid-vaccines-a-reality-check/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://twitter.com/intent/tweet?url=https://swprs.org/the-covid-vaccine-war-ii/", "https://www.facebook.com/share.php?u=https://swprs.org/the-covid-vaccine-war-ii/", "https://t.me/share/url?url=https://swprs.org/the-covid-vaccine-war-ii/"], "authors": [], "publish_date": null}