{"result_id": "281030", "URL": "https://swprs.org/covid-vaccines-a-reality-check/", "timestamp": "2023-04-25 17:13:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-a-reality-check/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: A Reality Check", "cleaned_text": "The latest unbiased facts on covid vaccine safety and effectiveness.\n\nPlease note: No medical advice; patients are asked to consult a doctor.\n\nDuring 2021, covid vaccines may have saved several hundred thousand lives by mitigating the impact of the covid waves in spring (Alpha), summer (Delta) and early winter (also Delta). This can easily be seen by comparing countries with a high vaccination rate to countries with a low vaccination rate (e.g. Western Europe to Eastern Europe), or by comparing the impact of covid waves before and after vaccination in countries with a high vaccination rate (see chart below).\n\nImportantly, prior to the winter wave of 2021/22, only about 20% to 50% of people in Western Europe and most US states had developed natural (i.e. infection-acquired) immunity against covid. In Latin America, parts of Africa (including South Africa) and parts of Asia (e.g. India), about 50% to 80% had developed natural immunity. In some of these regions, the displaced flu has already returned.\n\nHowever, covid vaccine protection turned out to be waning rather quickly: prior to the most recent immune-evasive mutation (omicron), protection against infection and transmission decreased to zero within about half a year, whereas protection against severe disease and death in senior citizens decreased from about 95% to about 50% within 6 to 9 months (see next chart).\n\nWith omicron, protection against symptomatic infection has been reduced to just a few weeks, while protection against severe disease remains uncertain. Fortunately, there are indications that omicron really is somewhat milder than previous variants, even in people without prior infection. Never­the­less, omicron highlights the inherent limitations of a global vaccination campaign.\n\nStudies that claimed more durable vaccine protection typically combined several time frames (e.g. January to August instead of just August) or age groups (vaccine protection is more durable in younger people, but their covid risk is also much lower). An example of the latter is the Qatar study, whose participants had a median age of just 31 years; in participants older than 60, protection against severe disease had fallen to 60% within 7 months, but this was only shown in the annex.\n\nVaccine protection against infection and severe disease (all age groups):\n\nSince autumn 2021, several countries reported a negative vaccine effectiveness against infection, that is, vaccinated people had a higher infection rate than unvaccinated people. In countries like the UK, negative vaccine effectiveness reached up to minus 100% in some age groups (i.e. vaccinated people had double the infection rate compared to unvaccinated people; see next chart). In response, several countries simply stopped publishing this somewhat embarrassing data.\n\nThe most likely explanation for this observation is a catch-up effect: for several months after vaccination, vaccinated people had a lower infection rate than unvaccinated people. As a result, there were more “recovered” people among the unvaccinated than among the vaccinated. Once vaccine protection had declined, infections among vaccinated people started catching up.\n\nA more troubling explanation for negative vaccine effectiveness against infection, proposed by some skeptics, would be some kind of negative immune effect. For instance, it is known that covid vaccination can cause a temporary immune suppression (lymphocytopenia) that can last for up to a week and possibly longer, and that likely plays a role in the well-documented post-vaccination spike in coronavirus infections. It is also known that vaccinated people, once infected, develop only a partial immune response (no anti-N antibodies), which might increase their risk of re-infection.\n\nHowever, data from the UK and elsewhere shows that a vaccine booster dose temporarily restores vaccine protection against infection, although again only for a few months, or even just a few weeks against the immune-evasive omicron variant (see chart below). Nevertheless, this temporarily restored protection appears to support the “catch-up hypothesis”.\n\nClaims of negative vaccine effectiveness against severe disease and death (i.e. covid vaccines making covid worse), promoted by some hardcore vaccine skeptics, have currently no basis in reality (they were based on statistical effects and age-group differences).\n\nHowever, such a negative effectiveness, which would point to antibody-dependent disease enhancement (ADE) or negative antigenic priming (OAS), cannot be totally ruled out against future coronavirus variants, due to the short-term nature of covid vaccine trials.\n\nCovid vaccines have been shown to cause, in “rare cases”, severe and fatal cardiovascular, neurological, immunological and metabolic adverse events (see an updated overview of severe covid vaccine adverse events). More recently, covid vaccines have been associated with various auto-immune diseases, tumor growth and cancer, and new-onset diabetes and diabetic ketoacidosis.\n\nThe US VAERS system currently shows about 20,000 post-vaccination deaths, of which about 10,000 from the US itself. Previous studies showed that passive surveillance systems (like VAERS) capture only about 5% to 20% of adverse events, while a recent study found that about 80% of post-vaccination deaths reported to VAERS had plausibly been caused by covid vaccines.\n\nThus, it is conceivable that covid vaccines may already have caused, or triggered, about 100,000 deaths globally. The WHO VigiAccess database, which combines several national databases, currently shows about 3 million reported covid post-vaccination adverse events, of which about 85,000 severe adverse events and close to 20,000 deaths (more on excess mortality below).\n\nWhile covid itself primarily affects senior citizens and other high-risk groups, covid vaccine injuries may affect anybody, including young and healthy people and even people who already had covid, sometimes without even noticing it (about 30% of infections remain asymptomatic). Thus, the recommendation and decision to vaccinate against covid should reasonably be age and risk-based.\n\nPost-vaccination deaths reported to the US VAERS system since 1990:\n\nConcerning heart inflammation (myocarditis and pericarditis), a recent comprehensive analysis by researchers at the University of Oxford found that in males between 16 and 39 years of age, the risk of myocarditis after vaccination was significantly higher than after coronavirus infection (see next chart). In particular, this was the case after the second and third dose of the Pfizer mRNA vaccine, after the first and second dose of the high-dosed Moderna mRNA vaccine, and even after the second dose of the AstraZeneca DNA vaccine.\n\nSince covid vaccines provide no significant protection against “long covid” (which requires only a mild infection), one may conclude that for healthy and lean adolescents and adults below the age of 40, especially males, the risk/benefit ratio of covid vaccines looks rather unfavorable. Indeed, this is also the conclusion that Dr. Doran Fink, deputy director of the US FDA vaccines division, appears to have reached during a recent advisory committee hearing (at 6h28m30s).\n\nIf subclinical (i.e. unrecognized) cases of myocarditis are taken into account, the risk of myocarditis after two-dose mRNA vaccination in young males reaches about 1 in 1000, a figure confirmed by recent studies from Hong Kong and from Ontario (table 3). In this regard, Austrian pharmacology professor Dr. Hartmut Glossmann, one of the most cited Austrian scientists in the world, described the vaccination of young people as “the biggest medical scandal” he has ever witnessed.\n\nIn a recent letter to the British Medical Journal, a group of doctors, including Dr. Peter Gøtzsche, wrote: “For young age groups, in whom covid-related morbidity and mortality is low, and for those who have had covid infection already, and appear to have longstanding immunological memory, the harms of taking a vaccine are almost certain to outweigh the benefits to the individual, and the goal of reducing transmission to other people at higher risk has not been demonstrated securely.”\n\nMyocarditis hospitalizations after covid vaccination vs. infection in young males:\n\nMyocarditis after covid vaccines (red, 2021) and flu vaccines (blue, all years), by age:\n\nIndeed, the issue of post-vaccination heart inflammation appears to be closely linked to the unprecedented increase in heart problems, sudden cardiac arrest and even sudden cardiac death observed in athletes during recent months. The online platform Good Sciencing has compiled a comprehensive list that includes already 580 athlete collapses and 360 athlete deaths, showing a strong increase since about May 2021. In recent weeks, several top players per week have been affected, some of whom had to end their career (see image at the top of this analysis).\n\nThe Wikipedia list of “association footballers who died while playing” currently shows 21 players who died in 2021, which is about two to three times as many as in previous years.\n\nFrom a medical perspective, there are two conceivable explanations for this observation. The first explanation is that most of these athletes had recently been vaccinated and had a subclinical (unnoticed) acute heart inflammation when they collapsed while exercising. The solution to this is to pause exercising for a few weeks after vaccination, which is indeed recommended in some countries.\n\nThe more troubling explanation – a kind of “canary in the coal mine” scenario – would be that many of these athletes had been vaccinated months ago and developed chronic heart damage that caused heart failure or sudden cardiac arrest during high-intensity exercise. Previous cell culture and animal studies showed that the coronavirus spike protein alone, which is produced by covid vaccines, can severely damage heart muscle cells and endothelial cells (i.e. veins and arteries).\n\nIf this is the case, it is likely that many more people (i.e. non-athletes) may be affected by this issue and may develop acute heart problems or other cardiovascular issues later on (e.g. when exercising or simply climbing stairs). The solution to this would be to absolutely avoid intravenous vaccine injection, or indeed to stop covid vaccinations in the general population altogether.\n\nAs a matter of fact, there are already quite a few “anecdotal” cases of young and healthy people who suffered a stroke or other cardiovascular issues several months after vaccination (see e.g. here and here). German pathologists who investigated 15 post-vaccination deaths found “clear evidence of vaccine-induced autoimmune-like pathology in multiple organs.”\n\nAlready, several countries have stopped DNA adenovector vaccines (J&J, AstraZeneca) due to blood clotting issues, while several other countries stopped the high-dosed Moderna mRNA vaccine due to the increased risk of myocarditis in young people (especially males). Even the second dose of the Pfizer mRNA vaccine has been stopped for adolescents in some Asian countries.\n\nThe Canadian province of Quebec decided to stop booster vaccinations of senior citizens who had previously been infected after an increase in life-threatening booster vaccine reactions had been observed (previously also reported in Germany and in Israel). In general, it is known that covid vaccine-related risks increase with additional doses, and the mRNA lipid nano-particles themselves are known to cause toxicity if injected repeatedly over several months or years. Even US vaccine expert and FDA advisor Dr. Paul Offit spoke out against “boosting everyone”.\n\nConcerning children younger than 12, several countries (e.g. Finland) decided against a general recommendation to vaccinate them, while some other countries (e.g. the USA) approved a low-dose Pfizer mRNA vaccine for this age group. By early December, about 5 million US children aged 5 to 11 had received a first dose of the Pfizer vaccine (i.e. about 20% of children in this age group).\n\nThe US VAERS system currently shows about 7000 reported adverse events in children aged 5 to 11, including a few hundred serious adverse events, such as myocarditis, stroke, allergic reactions and neurological disorders (see this compilation). Given under-reporting and reporting backlogs, the true figure of serious vaccine adverse events in young children may already be in the thousands.\n\nNevertheless, the US CDC director recently argued that she has “not yet seen any safety signal”; previously, an FDA advisory committee member acknowledged that “we’re never going to learn about how safe this vaccine is [in children] unless we start giving it.”\n\nMeanwhile, the risk of severe covid in children has turned out to be even lower than previously thought, as at least one quarter of US coronavirus-positive child deaths were shown to be entirely unrelated to covid. Indeed, in US male adolescents, there were about ten times more suicides than covid deaths in 2020.\n\nConcerning post-vaccination miscarriages, still births and birth defects, a recent analysis of British data found an increase in still births of 33% in vaccinated women, and in an open letter, Austrian midwives described an apparent increase in “miscarriages, preterm labor, early preterm rupture of membranes, vaginal bleeding, preterm birth, growth retardation and seizures.”\n\nThe US VAERS system currently counts about 3,500 post-vaccination miscarriages, and tens of thousands of British women have reported post-vaccination menstrual disorders. There are also several “anecdotal” reports of possibly vaccine-related birth defects, especially concerning cardiac anomalies and pulmonary hemorrhage (bleeding lungs), but no reliable statistical evidence yet.\n\nIn Scotland, an investigation has been launched to determine the cause of a significant increase in deaths of newborns during September. Besides the vaccination of pregnant women, a simultaneous RSV respiratory virus summer wave might also be a possible explanation.\n\nFinally, several countries have recorded an unexplained excess mortality in the wake of covid mass vaccination campaigns. This was first noticed in Israel in the spring of 2021 (in parallel to a “murky wave of heart attacks”). Over the summer, Britain recorded several thousand non-covid excess deaths, mainly due to cardiovascular events. Moreover, Britain recorded excess deaths in adolescent males, but not females, in parallel to the vaccination campaign in this age group (see next chart).\n\nSince September, Germany has been recording an unexplained and unprecedented non-covid excess mortality of several thousand people. More recently, Spain has been reporting a similar unexplained excess mortality. In Switzerland, using mainly the high-dosed Moderna vaccine, a significant non-covid excess mortality has been recorded in parallel to the ongoing booster campaign.\n\nNevertheless, this excess mortality effect is not observed in every country (e.g. not in Nordic countries) and may be due to factors other than vaccination (e.g. pandemic and lockdown-related effects). For instance, in the US, drug overdose deaths and teen suicides have reached record levels.\n\nOn the other hand, there are also cases of noted vaccine skeptics (or even virus skeptics) that later died of covid, as the website Sorry Antivaxxer shows. Besides a certain age, the most apparent commonality of these cases seems to be obesity, a known covid risk factor in the non-elderly population. Whether vaccination would have saved them remains an open question, of course.\n\nSince covid vaccines do not confer meaningful protection against infection and transmission, and the risk of severe covid is very low for large parts of the general population, “vaccine passports” and covid vaccine mandates have no medical or epidemiological justification.\n\nIndeed, countries and US states using “vaccine passports”, such Israel, France, Italy and New York, have recently reported record new coronavirus infection rates.\n\nThus, pressuring people into getting vaccinated (e.g. through a “no jab, no job” scheme) must be seen as a major medical crime and a crime against humanity, especially given the ignored superiority of natural immunity and well-documented vaccine-related health risks, as described above.\n\nInstead, it appears plausible that “vaccine passports” are being promoted primarily for strategic purposes, as a precursor to digital biometric identity systems (read more).\n\n1) In 2021, covid vaccines likely saved several hundred thousand lives, but they may also have caused or triggered about 100,000 deaths and many more injuries globally.\n\n2) Covid vaccine protection, initially very high, decreases substantially within about half a year and it collapsed against the immune-evasive, but apparently milder omicron variant.\n\n3) The risk of covid vaccine injuries increases with additional booster doses, and several countries have already suspended various covid vaccines partially or completely.\n\n4) For healthy and lean adults below 40 years of age, as well as for healthy children and adolescents, the risk/benefit ratio of covid vaccination does not appear to be favorable.\n\n5) “Vaccination passports” and covid vaccination mandates have no medical or epidemio­logical justification. Coercing people into getting vaccinated must be seen as a crime against humanity.\n\n6) Ultimately, the covid pandemic will be ended not by vaccination, which cannot prevent transmission, but by widespread natural immunity, already achieved in several parts of the world.\n\nVideo: “March of the Vaccine Dead” in Parma, Italy (November 2021)\n\nSome critics argue or suspect that covid vaccines may in fact be part of a global depopulation agenda, orchestrated by billionaires like Bill Gates in order to meet challenges posed by dwindling natural resources, climate change and the fourth industrial revolution.\n\nSuch a vaccine-related depopulation agenda could be achieved by either increasing global mortality (e.g. via heart disease) or by reducing global female (or male) fertility.\n\nWith regards to the former, if covid vaccines should turn out to dramatically increase the long-term risk of cardiovascular disease and heart failure, this could indeed increase global mortality, even in non-senior citizens, but it may primarily increase morbidity (i.e. disease).\n\nWith regards to the latter, it is true that “birth-control vaccines” exist (they produce antibodies against pregnancy hormones). Furthermore, there are credible reports that in 2014, three biochemistry labs in Nairobi found such anti-fertility components in the tetanus vaccine administered as part of a WHO vaccination campaign in Kenya (see ‘fact check’).\n\nCurrently, there is evidence that covid vaccines may impact menstruation and possibly pregnancy and neonatal health (if vaccinated during pregnancy), but there is not yet any evidence that covid vaccines permanently impact female (or male) fertility.\n\nSimilarly, there is clear evidence that covid vaccines increase the short-term risk of cardiovascular adverse events (see above), but there is not yet solid evidence that they may have a long-term impact on cardiovascular health, although this cannot be excluded.\n\n2) Are covid vaccines “vaccines”? Or “gene therapy”? Or both?\n\nAre covid vaccines “vaccines”? Yes, because they induce an antibody immune response.\n\nBut didn’t the Merriam-Webster dictionary have to change its definition of “vaccine” in January 2021 to include covid vaccines? Yes, but their previous definition was outdated and wrong: it referred to a “preparation of killed microorganisms, living attenuated organisms, or living fully virulent organisms”, which didn’t include toxoid vaccines (like the tetanus vaccine) or protein-based vaccines (like the hepatitis B vaccine) or of course mRNA or DNA vaccines (like some of the covid vaccines).\n\nBut covid vaccines don’t provide lasting protection, so aren’t they more of a drug than a vaccine? The flu vaccine and some other vaccines don’t provide lasting protection, either. The “vaccine” definition is about the mode of action, not about the medical success.\n\nAre covid mRNA and DNA vaccines “gene therapy”? Yes, mRNA and DNA vaccines have always been regarded as an application of gene therapy, simply because they are based on genetic technology (DNA or mRNA). The European Union even had to suspend some of its GMO regulations to fast-track covid vaccine development and manufacturing.\n\nIf covid vaccines are gene therapy, do they alter the human genome? They are not intended to do so. In fact, gene therapy as a whole initially consisted primarily of “gene replacement therapy”, not “gene editing therapy”: a “defective gene” (e.g. in case of cancer) is being replaced by providing the cell with a functioning gene copy as DNA (which is then translated into RNA) or directly as mRNA (which is then translated into protein), without editing the human genome. Only more recent technologies like CRISPR have made it possible to directly edit the human genome.\n\nHowever, although not intended, both mRNA and DNA vaccines (and the coronavirus itself) could, under certain circumstances, insert genetic material into the human genome, but this has not yet been shown to actually happen with covid vaccines.\n\nIn conclusion, covid vaccines are both vaccines and gene therapy, but are not intended to alter the human genome, and so far haven’t been shown to alter the human genome.\n• The Return of the Flu", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: A Reality Check", "description": "The latest unbiased facts on covid vaccine safety and effectiveness.", "url": "https://swprs.org/covid-vaccines-a-reality-check/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-02-01T13:55:49+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/soccer-players-heart.webp?fit=1024%2C777&ssl=1", "image:width": "1024", "image:height": "777", "image:type": "image/webp"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/soccer-players-heart.webp?ssl=1", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-a-reality-check/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-a-reality-check/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-a-reality-check/", "#covid-vaccine-effectiveness", "https://www.euronews.com/2021/11/25/vaccination-rollout-in-europe-saved-nearly-half-a-million-lives-who-and-ecdc-say", "https://swprs.org/studies-on-covid-19-lethality/#seroprevalence", "https://swprs.org/studies-on-covid-19-lethality/#seroprevalence", "https://swprs.org/the-return-of-the-flu/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/vaccination-cases-deaths-jbm.jpg?ssl=1", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v1", "https://swprs.org/omicron-in-the-spotlight/", "https://www.nejm.org/doi/full/10.1056/NEJMoa2114114", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/vaccine-effectiveness-sweden-norstroem.jpg?ssl=1", "https://dailysceptic.org/2021/12/24/vaccine-effectiveness-drops-to-minus-75-in-18-29-years-olds-as-omicron-slices-through-vaccine-protection-and-booster-effect-starts-to-wear-off/", "https://www.nau.ch/politik/bundeshaus/bag-erfasst-zahl-der-impfdurchbruche-nicht-mehr-66027382", "https://swprs.org/covid-vaccines-and-cancer/", "https://www.youtube.com/watch?v=WR-pqrMWu3E", "https://www.journalofinfection.com/article/S0163-4453(21)00394-7/fulltext", "https://dailysceptic.org/2021/12/24/vaccine-effectiveness-drops-to-minus-75-in-18-29-years-olds-as-omicron-slices-through-vaccine-protection-and-booster-effect-starts-to-wear-off/", "https://leadstories.com/hoax-alert/2021/11/fact-check-vaccinated-english-under-60-are-not-dying-at-twice-the-rate-of-unvaccinated-english-under-60.html", "https://en.wikipedia.org/wiki/Antibody-dependent_enhancement", "https://en.wikipedia.org/wiki/Original_antigenic_sin", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/negative-vaccine-effectiveness-uk.png?ssl=1", "#vaccine-injuries", "https://swprs.org/covid-vaccine-adverse-events/", "https://openvaers.com/covid-data", "https://pubmed.ncbi.nlm.nih.gov/16689555/", "https://www.researchgate.net/publication/352837543_Analysis_of_COVID-19_vaccine_death_reports_from_the_Vaccine_Adverse_Events_Reporting_System_VAERS_Database_Interim_Results_and_Analysis", "https://sciencefiles.org/2021/12/22/erkrankungen-nach-covid-19-impfung-nehmen-massiv-zu-2-841-988-gemeldete-nebenwirkungen/", "https://sciencefiles.org/2021/12/22/vaccine-watch-83-785-schwere-erkrankungen-nach-covid-19-impfung-gentherapie/", "https://swprs.org/solving-the-covid-mystery/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/openvaers-deaths-december-2021.png?ssl=1", "https://twitter.com/TracyBethHoeg/status/1475160169076047872", "https://www.researchsquare.com/article/rs-1062160/v1", "https://youtu.be/WFph7-6t34M?t=23315", "https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/6445179", "https://www.medrxiv.org/content/10.1101/2021.12.02.21267156v1", "https://respekt.plus/2021/10/08/schreiben-an-die-med-uni-innsbruck-teil-3/", "https://www.nature.com/articles/s41591-021-01630-0", "https://www.bmj.com/content/375/bmj.n2957/rr-1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/myocarditis-young-males-vaccines-covid.jpg?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/myocarditis-covid-flu-vaccine-1.jpg?ssl=1", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://en.wikipedia.org/wiki/List_of_association_footballers_who_died_while_playing", "https://www.jpost.com/health-and-wellness/health-ministry-to-consider-asking-newly-vaccinated-to-avoid-working-out-681317", "https://www.livescience.com/coronavirus-may-dice-heart-muscle-fibers-cells.html", "https://www.salk.edu/news-release/the-novel-coronavirus-spike-protein-plays-additional-key-role-in-illness/", "https://t.me/s/covidvaccineinjuries/4205", "https://t.me/s/covid_vaccine_injuries/14920", "https://doctors4covidethics.org/on-covid-vaccines-why-they-cannot-work-and-irrefutable-evidence-of-their-causative-role-in-deaths-after-vaccination/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/athlete-collapses-deaths-chart-2021-2-0129.jpg?ssl=1", "https://www.syracuse.com/coronavirus/2021/12/which-covid-vaccine-is-best-cdc-recommends-pfizer-moderna-over-johnson-johnson.html", "https://www.bmj.com/content/375/bmj.n2477", "https://www.taiwannews.com.tw/en/news/4340862", "https://westphaliantimes.com/canadian-province-stops-giving-boosters-to-elders-who-have-had-covid-in-the-past-due-to-severe-life-threatening-side-effects/", "https://www1.wdr.de/nachrichten/ruhrgebiet/probleme-nach-drittimpfung-bei-senioren-100.html", "https://www.statnews.com/2016/09/13/moderna-therapeutics-biotech-mrna/", "https://nymag.com/intelligencer/2021/12/omicron-dr-paul-offit-is-skeptical-of-boosters-for-all.html", "https://www.reuters.com/world/europe/finland-limit-childrens-covid-19-vaccines-high-risk-households-2021-12-02/", "https://www.voanews.com/a/us-campaign-to-vaccinate-young-children-off-to-sluggish-start/6348655.html", "https://openvaers.com/openvaers", "https://twitter.com/Lilith_Assyria/status/1471834089623855114", "https://twitter.com/VPrasadMDMPH/status/1471535992976789504", "https://townhall.com/tipsheet/scottmorefield/2021/10/26/fda-panel-member-were-never-gonna-learn-about-how-safe-the-vaccine-is-until-we-start-giving-it-n2598090", "https://threadreaderapp.com/thread/1471283482563424259.html", "https://twitter.com/TracyBethHoeg/status/1474150680151486468", "https://swprs.org/covid-vaccination-and-pregnancy/", "https://swprs.org/covid-vaccination-and-pregnancy/", "https://openvaers.com/covid-data", "https://www.bmj.com/content/374/bmj.n2211", "https://t.me/s/covidvaccineinjuries/1504", "https://twitter.com/Dr_ScottMc/status/1450747846970548226", "https://www.heraldscotland.com/news/19726487.investigation-launched-abnormal-spike-newborn-baby-deaths-scotland/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/scotland-neonatal-deaths.jpg?ssl=1", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://news.yahoo.com/analysis-thousands-more-usual-dying-170117640.html", "https://www.hartgroup.org/recent-deaths-in-young-people-in-england-and-wales/", "https://www.destatis.de/EN/Themes/Society-Environment/Population/Deaths-Life-Expectancy/mortality.html", "https://www.larazon.es/salud/20211212/nkv2kteiuffqdhcq7og3mjkj4y.html", "https://coronagate.blog/2021/12/16/haben-die-booster-impfungen-in-der-schweiz-bereits-1000-tote-verursacht/", "https://www.euromomo.eu/graphs-and-maps/", "https://twitter.com/TracyBethHoeg/status/1474150680151486468", "https://www.medrxiv.org/content/10.1101/2021.12.23.21268284v1", "https://www.sorryantivaxxer.com/", "https://swprs.org/obesity-and-the-pandemic-update/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/germany-destatis-2021-en.png?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/15-19-boys-to-wk-42-with-three-rollout-bars.jpg?ssl=1", "#vaccine-passports", "https://swprs.org/israel-highest-infection-rate-in-the-world/", "https://swprs.org/the-power-of-natural-immunity/", "https://swprs.org/the-vaccine-passport-agenda/", "#conclusion", "#covid-vaccine-safety-resources", "https://openvaers.com/covid-data", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://t.me/s/covidvaccineinjuries/", "https://swprs.org/covid-vaccine-adverse-events/", "https://www.sorryantivaxxer.com/", "#video-cardiac-arrests-in-athletes", "#video-18-neurological-vaccine-adverse-events", "#video-march-of-the-vaccine-dead-in-parma-italy-november-2021", "https://web.archive.org/web/20220314120205/https://thecovidworld.com/italy-holds-march-of-the-vaccine-dead-to-remember-those-killed-by-the-covid-19-vaccine/", "#postscript", "https://www.sciencedirect.com/science/article/pii/0264410X89900431", "https://www.scirp.org/Journal/PaperInformation.aspx?PaperID=81838", "https://www.snopes.com/fact-check/tetanus-vaccine-sterilization/", "https://swprs.org/covid-vaccine-adverse-events/#b-menstrual-disorders-miscarriages-birth-defects", "https://www.reddit.com/r/conspiracy/comments/owpy8d/merriamwebsters_changing_the_definition_of_vaccine/", "https://en.wikipedia.org/wiki/Tetanus_vaccine", "https://en.wikipedia.org/wiki/Hepatitis_B_vaccine", "https://www.swfinstitute.org/news/83947/covid-mrna-vaccines-are-a-form-of-gene-therapy", "https://medium.com/swlh/mrna-therapy-a-new-form-of-gene-medicine-5d859dadd1e", "https://geneticliteracyproject.org/2020/07/17/european-union-suspends-some-gmo-regulations-to-fast-track-covid-19-vaccine/", "https://en.wikipedia.org/wiki/Gene_therapy", "https://www.medpagetoday.com/special-reports/exclusives/92632", "#see-also", "https://swprs.org/the-vaccine-passport-agenda/", "https://swprs.org/the-return-of-the-flu/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-a-reality-check/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-a-reality-check/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-a-reality-check/"], "authors": [], "publish_date": null}