{"result_id": "281001", "URL": "https://swprs.org/covid-vaccines-the-next-vioxx/", "timestamp": "2023-04-25 17:12:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-the-next-vioxx/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: The Next Vioxx?", "cleaned_text": "Shocking new data on covid vaccine and booster safety out of Israel and Germany – will covid vaccines overtake Vioxx and thalidomide as the largest ever drug scandal?\n\nAlready back in August 2021, Israeli health authorities published preliminary booster safety data showing that a full one percent of people, i.e. one in one hundred, had to “seek medical help” due to booster side effects. But two weeks ago, the Israeli Ministry of Health (MoH) published a new report that provides much more detailed, and much more disturbing, data on booster side effects.\n\nThe original MoH report, published in Hebrew on February 10, was translated into English on February 15 by a retired Israeli medical professor and several volunteers. On February 18, Dr. Josh Guetzkow, a senior lecturer at Hebrew University of Jerusalem, published a first detailed analysis of the report on his Substack.\n\nIn contrast to passive reporting systems like the US VAERS system, which typically cover only a fraction of actual side effects, the Israeli report is based on an active survey that directly asked booster recipients about any side effects they may have experienced.\n\nSpecifically, the report is based on a professional telephone survey, conducted between 19 September and 25 October 2021, that covered a representative, random sample of 2049 people, stratified by age group and gender, out of about 3 million people who had received a booster dose three to four weeks earlier. Such a sample size should be sufficient to achieve a margin of error of about 2.5% at a 95% confidence interval. The survey excluded, in particular, people who had already recovered from covid.\n\nAmong other findings, the Israeli survey shows that:\n• Two thirds of the respondents (66%) reported at least one side effect within three to four weeks after the booster (women: 75%).\n• Close to one third of respondents (29%) reported that they had “difficulty performing daily activities” due to the booster side effects (women: 51%).\n• Close to one in three hundred respondents (0.3%) reported actual hospitalization (i.e. not just medical care) as a result of the side effects.\n• Nearly 10% of women under the age of 54 reported disruptions to their menstrual cycle after the booster. Half of these women reported ongoing menstrual symptoms in a follow-up survey two to three months after the initial survey.\n• 5.5% of the respondents reported chest pain (women: 7%), and 4.2% reported enlarged lymph nodes (i.e. lymphadenopathy; women: 6%).\n• One person reported confirmed post-booster myocarditis (heart inflammation); assuming this was a male person in the youngest of the three age groups of the survey (18-39), one in about 350 young males (0.3%) would be affected.\n• Close to 5% reported neurological problems (women: 6.9%), including Bell’s palsy (i.e. facial paralysis; 0.5%), eye disorders (0.5%), memory issues (0.4%), hearing issues (0.4%), convulsions (0.2%), and loss of consciousness (0.2%).\n• Close to 4% reported allergic reactions (women: 5.3%), including a rash, itching, difficulty breathing, and swelling of the face or throat.\n• About 25% of people with pre-existing auto-immune disorders, depression or anxiety reported a worsening of their symptoms following the booster.\n• 5% to 10% of people with diabetes, hypertension, and lung & heart disease also reported a worsening of their condition.\n• Finally, 0.2% of respondents reported an outbreak of herpes simplex (women: 0.4%), and 0.2% of respondents reported an outbreak of herpes zoster (i.e. shingles; women: 0.3%).\n\nNext, Dr. Guetzkow compared these values with data from the US VAERS system to calculate the so-called under-reporting factor (URF) and to estimate the actual number of booster side effects in the United States. Previous studies (prior to the covid pandemic) found that passive reporting systems covered only about 5% to 10% of actual side effects (including severe side effects), which suggested an under-reporting factor of 10 to 20.\n\nBut based on the Israeli survey, Dr. Guetzkow found a US VAERS under-reporting factor of about 120 for hospitalizations; about 400 for shingles; about 700 for convulsions or seizures; about 3,000 for Bell’s palsy; and about 6,000 for enlarged lymph nodes.\n\nIn the United States, about 90 million booster doses had been administered by early February 2022, about 50 million of which were from Pfizer. Based on the Israeli data, this means that booster vaccinations alone may have caused about: 130,000 cases of herpes zoster (shingles); 180,000 cases of herpes simplex; 180,000 cases of convulsions/seizures; 270,000 hospitalizations; 300,000 cases of hearing disorders; 500,000 cases of vision disorders; 500,000 cases of Bell’s palsy; 500,000 cases of difficulty breathing; 2.8 million cases of menstrual changes; 3.7 million cases of enlarged lymph nodes; and 4.9 million cases of chest pain.\n\nWhile these values may seem extremely high, they are generally consistent with other known data. For instance, the Pfizer booster trial found enlarged lymph nodes in 5.2% of recipients (the Israeli survey found 4.2%); the CDC V-Safe survey found that 0.9% of recipients of a Pfizer booster sought medical care (similar to the Israeli data); and a British survey found 20% of women reported menstrual changes after vaccination with AstraZeneca (the Israeli survey found 10%).\n\nThe Israeli survey covered a random, representative sample, but the absolute numbers were quite low for some of the symptoms (0.1% = 2 people) and well within the margin of error of about 2.5%. Nevertheless, the fact that all of these symptoms were found in a survey of about 2,000 people indicates that many of these severe symptoms occur at a frequency of about 1 in 1,000, while menstrual issues occur at a frequency of about 1 in 10 after a Pfizer booster vaccine.\n\nIn an additional analysis based on recently released data from an Israeli hospital system, Dr. Guetzkow found that vaccinated pregnant women had a 34% higher rate of abortion, miscarriage and stillbirth compared to unvaccinated women, with a major peak in May 2021, when the rate was 44% in vaccinated women vs. 9% in unvaccinated women. This data is consistent with British data, which also showed an increase of 33%. In particular, covid vaccines have been found to cause, in ‘rare cases’, blood clots, brain and lung bleeds, heart anomalies and severe allergic reactions in unborn babies as well as in newborn babies exposed to the vaccine via breast milk.\n\nFigure: Estimated number of side effected in the US based on Israeli survey.\n\nMeanwhile, new official vaccine safety data from Germany paints a similarly disturbing picture. On February 21, the CEO of German health insurer BKK ProVita wrote an open letter to the president of the German vaccine regulator (PEI), noting that, based on their insurance data, 4% to 5% of all German covid vaccine recipients had sought medical care due to vaccine side effects (i.e. 2.5 to 3 million people), which would indicate an under-reporting factor of at least 10. The health insurance CEO called this a “strong warning signal” that required immediate action.\n\nSimilarly, a comparison between reported post-vaccination deaths and expected background mortality also indicates an under-reporting factor of about 10 to 100 in the official, but passive, German vaccine adverse event reporting system.\n\nBut even based on official (unadjusted) data, there are already about 30,000 severe adverse events and about 2,200 post-vaccination deaths in Germany (which, in reality, could easily be 300,000 severe events and about 20,000 post-vaccination deaths). In addition, 3% of all reported cases (i.e. 7,300 people) developed chronic health injuries after vaccination.\n\nThere are about 2,000 reported cases of post-vaccination heart inflammation (which, in reality, could easily be 20,000), 1% of whom died, 3% of whom suffered chronic heart damage, and 65% of whom had not yet fully recovered (at the time of reporting).\n\nMost concerningly of all, in children aged 12 to 17, there were 3200 reported side effects, including about 150 cases of heart inflammation, 10 cases of chronic health injury, and 8 deaths (which, in reality, might be 80). Thus, in German adolescents, there are now officially more deaths linked to covid vaccines (8) than linked to covid itself (5). Moreover, in recent weeks there have been more adolescents 12-17 who needed ICU care after covid vaccination than after covid itself.\n\nIn addition, official German vaccine safety data shows about 500 cases of adverse events in children younger than 12, including about 100 cases in children younger than 5 (which have not yet received covid vaccines). According to German authorities, 20 of these young children were exposed to the vaccine via breast milk. The other 80 cases were not specified; they may have been exposed via breast milk, during pregnancy, or via unauthorized vaccination.\n\nBased on the data discussed above, it increasingly looks like covid vaccines, despite their short-term effectiveness against severe covid, might turn into the largest drug scandal in medical history, potentially dwarfing both the Vioxx scandal and the thalidomide (contergan) scandal.\n\nVioxx was an anti-inflammatory drug produced by Merck as a painkiller against arthritis, migraine and menstrual cramps. It was approved by the US FDA in 1999, prescribed to over 80 million people globally, but withdrawn in 2004 after it became publicly known that Vioxx dramatically increased the risk of heart attack and stroke. According to official data, Vioxx may have caused over 50,000 premature deaths in the US alone, but according to an excess mortality analysis, it may have killed up to 500,000 people over 5 years. During lawsuits, it was shown that Merck knew about the cardiovascular risks of Vioxx early on but didn’t inform regulators, doctors and patients.\n\nThalidomide, also known as contergan, was a drug used as a tranquilizer for pregnant women in the 1960s. Thalidomide is estimated to have caused over 10,000 birth defects, including about 4,000 neonatal deaths, causing the largest pregnancy-related drug scandal and the “biggest man‐made medical disaster ever” (see this video).\n\nBased on currently available data, covid vaccines could easily dwarf both the Vioxx scandal and the thalidomide/contergan scandal. One major difference is that Vioxx and thalidomide were only used to alleviate pain, not to save lives, whereas covid vaccines may have prevented, in 2021, about one million covid deaths in Europe and the US.\n\nHowever, strong covid vaccine protection, even against severe disease, is lasting only about half a year (similar to flu vaccines), while vaccine adverse events increase with each additional dose. Outside of senior citizens and other high-risk groups, vaccine-related deaths may already exceed covid-related deaths, as the German data shows. Moreover, there are already several hundred vaccine-linked deaths in international athletes (mostly due to cardiac arrest or stroke).\n\nPrior to omicron, one could argue that vaccination rates were much higher than infection rates in most Western countries, but in many age groups, this is no longer the case.\n\nFigure: Vioxx may have caused up to half a million premature US deaths over 5 years.\n\nThe Israeli survey and the detailed German data paint a very disturbing picture of covid vaccine and booster safety. In particular, it appears that the under-reporting issue in passive reporting systems, such as the US VAERS system, is far more serious than previously assumed and may easily range from a factor of 10 to a factor of 100 or even 1,000.\n\nOverall, it appears that in young and healthy adults and in healthy children, covid vaccines may already have caused far more damage, and deaths, than covid itself. Thus, covid vaccination should likely be restricted to covid high-risk groups, or perhaps even be stopped altogether in favor of state-of-the-art early treatment of high-risk patients.\n\nGeneral covid vaccination of entire populations, and especially forced vaccination of young adults and children (e.g. via “no jab, no job” and “no jab, no school” schemes), may well turn out to be the largest scandal, or indeed crime, of modern medicine.\n\nThroughout the global covid vaccination campaign, Israel has been a pivotal country as it was leading that campaign: Israel completed the initial vaccination drive (first and second dose) by March 2021, four months ahead of all other countries (including the UK). Israel was also the first Western country to introduce the infamous “covid passport”.\n\nBy late March, SPR first highlighted a small but disturbing non-covid excess mortality signal in Israeli mortality data, in parallel to a “murky wave of heart attacks” confirmed by local doctors. The signal first showed up in senior citizens and later in young people. At the time, SPR recommended health authorities urgently investigate the cause of this excess mortality signal before continuing vaccination outside of high-risk groups. This was three months before Israeli and US health authorities would acknowledge that covid vaccines may cause heart inflammation and strokes.\n\nIn May, most scientists still assumed that covid vaccines provided long-term immunity against coronavirus infection and disease and that Israel was the first country to have suppressed the covid pandemic. Yet by June/July, with the arrival of the Delta variant, Israeli data showed that protection against infection and transmission had dropped to near-zero levels within just half a year. By that time, SPR could already predict the collapse of the entire “covid passport” system.\n\nIn June/July, there was still hope that covid vaccine protection against severe disease and death would hold up. But by July/August, official Israeli data, hardly reported in any Western media, showed that protection against severe disease in senior citizens had dropped from 95% to just 50% – an increase in residual risk by a factor of 10 – within about half a year. In response, Israel started its booster campaign and SPR predicted a “booster panic” in Europe and the US within a few months. SPR also warned that adverse events would likely increase with each additional vaccine dose.\n\nBy early September, Israel reached the highest infection rate in the entire world, likely driven, in part, by the booster campaign itself (due to the post-vaccination infection spike). Moreover, Israeli data showed that recovered people had far better protection than vaccinated people. At that point, SPR forecast a “pandemic of the vaccinated” and predicted that a booster shot in August would likely not be sufficient to get through an upcoming winter wave. And indeed, with the arrival of the Omicron variant in December 2021, Israel launched its fourth vaccine shot for high-risk groups and some health care workers.\n\nThus, every single time Israeli health authorities vaccinated right into an ongoing covid wave (Alpha, Delta and Omicron), something that should have been avoided at all cost.\n\nWhy did Israel, of all places, choose to be the world’s vaccine “test lab”? It looks like this was a personal decision by then Israeli Prime Minister, Benjamin Netanyahu, who faced a pivotal election in March 2021 and a trial over various corruption allegations, and who personally knew Jewish Pfizer CEO, Albert Bourla (who later received several Israeli/Jewish awards). Netanyahu may have hoped that being first to “end the pandemic” might “boost” his political position.\n\nFigure 1: Vaccination progress in Israel and other countries.\n\nA woman describing the situation in Israel in April 2021 (5 minutes; full video).\n\nAn Israeli documentary on covid vaccine injuries (1 hour; The Testimonies Project).", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: The Next Vioxx?", "description": "Shocking new data on covid vaccine and booster safety out of Israel and Germany – will covid vaccines overtake Vioxx and thalidomide as the largest ever drug scandal?", "url": "https://swprs.org/covid-vaccines-the-next-vioxx/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-03-04T17:18:39+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/covid-vaccines-freaking-miracle.jpg?fit=1600%2C900&ssl=1", "image:width": "1600", "image:height": "900", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/covid-vaccines-freaking-miracle.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-the-next-vioxx/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-the-next-vioxx/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-the-next-vioxx/", "#israeli-booster-safety-data", "https://www.jpost.com/breaking-news/coronavirus-in-israel-14-infected-7-days-after-booster-out-of-422k-676172", "https://galileoisback.substack.com/p/translated-israeli-moh-survey-of", "https://galileoisback.substack.com/p/translated-israeli-moh-survey-of", "https://jackanapes.substack.com/p/the-israeli-ministry-of-health-actually-db7", "https://www.checkmarket.com/sample-size-calculator/", "https://jackanapes.substack.com/p/the-israeli-ministry-of-health-actually-db7", "https://jackanapes.substack.com/p/the-israeli-ministry-of-health-actually-db7", "https://swprs.org/covid-vaccine-adverse-events/#causality-and-under-reporting", "https://jackanapes.substack.com/p/the-israeli-ministry-of-health-actually-db7", "https://swprs.org/covid-vaccine-adverse-events/#r-lymphadenopathy", "https://jackanapes.substack.com/p/still-births-miscarriages-and-abortions", "https://swprs.org/covid-vaccination-and-pregnancy/", "https://swprs.org/covid-vaccine-adverse-events/#b-menstrual-disorders-miscarriages-birth-defects", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/israel-booster-survey-us-events.png?ssl=1", "#german-vaccine-safety-data", "https://www.berliner-zeitung.de/news/impffolgen-krankenkasse-bkk-schreibt-brief-an-paul-ehrlich-institut-li.213676", "https://corona-blog.net/2022/02/20/17-sicherheitsbericht-des-pei-mit-verkuerztem-erhebungszeitraum-ueber-2-200-myokarditiden-durch-muttermilch-betroffene-babys/", "https://corona-blog.net/2022/02/20/17-sicherheitsbericht-des-pei-mit-verkuerztem-erhebungszeitraum-ueber-2-200-myokarditiden-durch-muttermilch-betroffene-babys/", "https://corona-blog.net/2022/02/20/17-sicherheitsbericht-des-pei-mit-verkuerztem-erhebungszeitraum-ueber-2-200-myokarditiden-durch-muttermilch-betroffene-babys/", "https://multipolar-magazin.de/artikel/impfung-schadet-jugendlichen", "https://corona-blog.net/2022/02/20/17-sicherheitsbericht-des-pei-mit-verkuerztem-erhebungszeitraum-ueber-2-200-myokarditiden-durch-muttermilch-betroffene-babys/", "https://swprs.org/covid-vaccine-adverse-events/#b-menstrual-disorders-miscarriages-birth-defects", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/bkk-insurance-letter.png?ssl=1", "#covid-vaccines-vioxx-thalidomide", "https://wikispooks.com/wiki/Vioxx", "https://wikispooks.com/wiki/Vioxx", "https://en.wikipedia.org/wiki/Thalidomide_scandal", "https://swprs.org/vaccines-successes-and-controversies/#b8-drug-safety-thalidomide-still-with-us-2019", "https://www.ecdc.europa.eu/en/news-events/who-ecdc-nearly-half-million-lives-saved-covid-19-vaccination", "https://swprs.org/covid-vaccines-a-reality-check/", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/vioxx-half-a-million-deaths-week.png?ssl=1", "#conclusion", "https://swprs.org/on-the-treatment-of-covid-19/", "https://swprs.org/covid-vaccine-adverse-events/", "#addendum-the-israeli-vaccination-tragedy", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://swprs.org/covid-vaccines-the-good-the-bad-the-ugly/", "https://swprs.org/the-failure-of-vaccine-passports/", "https://swprs.org/covid-vaccines-a-shot-in-the-dark/", "https://swprs.org/covid-vaccines-a-shot-in-the-dark/", "https://swprs.org/israel-highest-infection-rate-in-the-world/", "https://swprs.org/the-power-of-natural-immunity/", "https://jewishcontributions.com/infotables/covid/", "#figure-1-vaccination-progress-in-israel-and-other-countries", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/09/israel-early-vaccination-aran.jpg?ssl=1", "#figure-2-post-vaccination-increase-in-non-covid-deaths-65", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/04/israel-mortality-65plus-weekly-cbs-april-28.png?ssl=1", "#figure-3-increase-in-all-cause-deaths-in-young-israelis", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/israel-20-29-deaths-increase-petrou.jpg?ssl=1", "#video-1-the-vaccine-passport-in-israel-april-2021", "https://www.bitchute.com/video/ze8R2zOmaF7C/", "#video-2-the-testimonies-project", "https://www.vaxtestimonies.org/en/", "#see-also", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/covid-vaccines-a-reality-check/", "https://swprs.org/vaccines-successes-and-controversies/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccines-the-next-vioxx/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccines-the-next-vioxx/", "https://t.me/share/url?url=https://swprs.org/covid-vaccines-the-next-vioxx/"], "authors": [], "publish_date": null}