{"result_id": "281024", "URL": "https://swprs.org/covid-vaccines-vaccines-or-gene-therapy/", "timestamp": "2023-04-25 17:13:06 CEST+0200", "meta": {"description": "Are covid vaccines \"vaccines\"? Or \"gene therapy\"? Or both?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccines-vaccines-or-gene-therapy/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: Vaccines or Gene Therapy?", "cleaned_text": "Are covid vaccines “vaccines”? Or “gene therapy”? Or both?\n\nAre covid vaccines “vaccines”? Yes, because they induce an antibody immune response.\n\nBut didn’t the Merriam-Webster dictionary have to change its definition of “vaccine” in January 2021 to include covid vaccines? Yes, but their previous definition was outdated and wrong: it referred to a “preparation of killed microorganisms, living attenuated organisms, or living fully virulent organisms”, which didn’t include toxoid vaccines (like the tetanus vaccine) or protein-based vaccines (like the hepatitis B vaccine) or of course mRNA or DNA vaccines (like some of the covid vaccines).\n\nBut covid vaccines don’t provide lasting protection, so aren’t they more of a drug than a vaccine? The flu vaccine and some other vaccines don’t provide lasting protection, either. The “vaccine” definition is about the mode of action, not about the medical success.\n\nAre covid mRNA and DNA vaccines “gene therapy”? Yes, mRNA and DNA vaccines have always been regarded as an application of gene therapy, simply because they are based on genetic technology (DNA or mRNA). The European Union even had to suspend some of its GMO regulations to fast-track covid vaccine development and manufacturing.\n\nIf covid vaccines are gene therapy, do they alter the human genome? They are not intended to do so. In fact, gene therapy as a whole initially consisted primarily of “gene replacement therapy”, not “gene editing therapy”: a “defective gene” (e.g. in case of cancer) is being replaced by providing the cell with a functioning gene copy as DNA (which is then translated into RNA) or directly as mRNA (which is then translated into protein), without editing the human genome. Only more recent technologies like CRISPR have made it possible to directly edit the human genome.\n\nHowever, although not intended, both mRNA and DNA vaccines (and the coronavirus itself) could, under certain circumstances, insert genetic material into the human genome, but this has not yet been shown to actually happen with covid vaccines.\n\nIn conclusion, covid vaccines are both vaccines and gene therapy, but are not intended to alter the human genome, and so far haven’t been shown to alter the human genome.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: Vaccines or Gene Therapy?", "description": "Are covid vaccines \"vaccines\"? Or \"gene therapy\"? Or both?", "url": "https://swprs.org/covid-vaccines-vaccines-or-gene-therapy/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-11-30T13:05:14+00:00", "image": "https://swprs.org/wp-content/uploads/2022/11/mrna-vaccines.jpg", "image:width": "1000", "image:height": "528", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/11/mrna-vaccines.jpg?ssl=1", "https://www.reddit.com/r/conspiracy/comments/owpy8d/merriamwebsters_changing_the_definition_of_vaccine/", "https://en.wikipedia.org/wiki/Tetanus_vaccine", "https://en.wikipedia.org/wiki/Hepatitis_B_vaccine", "https://www.swfinstitute.org/news/83947/covid-mrna-vaccines-are-a-form-of-gene-therapy", "https://medium.com/swlh/mrna-therapy-a-new-form-of-gene-medicine-5d859dadd1e", "https://geneticliteracyproject.org/2020/07/17/european-union-suspends-some-gmo-regulations-to-fast-track-covid-19-vaccine/", "https://en.wikipedia.org/wiki/Gene_therapy", "https://www.medpagetoday.com/special-reports/exclusives/92632", "#see-also", "https://swprs.org/vaccines-successes-and-controversies/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/covid19-facts/"], "authors": [], "publish_date": null}