{"result_id": "281004", "URL": "https://swprs.org/vaccines-the-tip-of-the-iceberg/", "timestamp": "2023-04-25 17:12:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/vaccines-the-tip-of-the-iceberg/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccines: The Tip of the Iceberg", "cleaned_text": "The latest on covid vaccine safety and effectiveness.\n\nSPR carefully distinguishes between short-term and long-term safety, short-term and long-term effectiveness, age- and sex-specific aspects, and medical and political questions. Some people might prefer a simpler, more black-and-white assessment, but this would not reflect complex reality.\n• The updated chart above shows the previously reported post-vaccination increase in Israeli 65+ all-cause mortality, based on official data up to April 4. There appears to be a complete media blackout on this issue, both inside and outside of Israel, despite the fact that an Israeli hospital director described a “murky wave of heart attacks” in March. However, in late April Israeli authorities announced an investigation into cases of post-vaccination heart inflammation and heart attacks, primarily in young adults, where the issue is much harder to explain away. In the US, too, multiple cases of heart inflammation and heart attacks after mRNA vaccines have already been reported in young adults. The independent Israeli People’s Committee gathered data on about 320 post-vaccination deaths and about 2500 serious adverse events until early May.\n• In the USA and Europe, official reporting systems currently show about 10,000 post-vaccination deaths. Based on official case reports, some of these deaths were clearly unrelated to the vaccine, but many were clearly caused or triggered by the vaccine. Moreover, due to considerable under-reporting and reporting backlog, the real number could be significantly higher. While this is still a small number compared to the 1.3 million official covid deaths and the 150 million fully vaccinated people, it is not a trivial number.\n• Health authorities and the media primarily focus on the issue of post-vaccination cerebral venous thrombosis (CVT, blood clots in the brain), simply because CVT is such a rare condition that the post-vaccination increase cannot be explained away statistically. However, CVTs are really just ‘the tip of the iceberg’, whereas the ‘invisible’, but much larger iceberg of post-vaccination adverse events consists primarily of severe and fatal cardiac (heart inflammation, heart attack), cardiovascular (blood clots, internal bleeding) and neurological events. Since the background rate of these conditions is much higher, vaccine-related events are easier to disregard.\n• Several countries have already suspended or stopped adenovector-based covid vaccines (AstraZeneca and J&J), arguing that ‘the risks outweigh the benefits’, especially for young people, and referring to CVTs only (the tip of the iceberg), not cardiac and cardiovascular events in general (the iceberg). In fact, AstraZeneca recently and officially acknowledged that thrombo­cyto­penia (low blood platelet count due to an autoimmune reaction) is a ‘frequent vaccine adverse event (1% to 10%)’, even though it wasn’t detected during the vaccine trial.\n• There is still no reliable data on the long-term safety of covid vaccines nor on their safety in children and adolescents. Nevertheless, several countries have already announced ‘booster shots’ and the vaccination of children. This is despite the fact that data from Israel and the UK has shown that the vaccination of adults is sufficient to suppress the epidemic, simply because children are not drivers of Sars-CoV-2 infections. Thus, the only (medical) rationale for vaccinating low-risk children, adolescents and young adults could be the risk of long covid and PIMS (the latter is about 0,02%; however, PIMS might also occur in response to vaccination).\n• In the US, about 10% of vaccinated people have declined the second vaccine dose, likely due to serious adverse events after the first dose. In many Western countries, vaccination rates seem to level off at about 50% to 70% of the adult population.\n• To review personal case reports of severe and fatal covid vaccine adverse events, see Covid Legal USA and the Nashville collection. In the US, there have already been several reports of post-vaccination deaths of healthy adolescents and young adults. Facebook deleted a group with 120,000 members reporting and discussing covid vaccine adverse events.\n• There are also several reports of peculiar post-vaccination deaths of celebrities, such as box legend Marvin Hagler (66), rap legend DMX (50, heart failure), NBC legal analyst Midwin Charles (47), cybersecurity expert Dan Kaminsky (42, diabetic ketoacidosis), comedian El Risitas (65, heart failure, had preconditions), or fashion designer Alber Elbaz (59). In the case of fully-vaccinated Elbaz, it was reported that he got infected with the ‘South African’ coronavirus variant.\n• More than ten years after the very mild 2009 “swine flu pandemic”, several countries are still paying millions of dollars in new compensations to victims of the swine flu vaccine, which caused incurable narcolepsy in several hundred children – a fact concealed at the time for almost a year.\n\nUS NIH commercials for the 1957 Asian influenza vaccination campaign:\n\nA vaccine may be not particularly safe (compared to the highest medical standards) and still be quite effective, at least in the short term. This seems to be the case for most experimental covid vaccines.\n• The decrease in covid infections in many US states and European countries since late winter or early spring was driven not primarily by vaccination campaigns, but by seasonal effects and other epidemic dynamics (both of which are well-known but poorly understood). This is shown by the fact that infections decreased simultaneously and to a similar extent in countries with a rather low vaccination rate, such as South Africa, the Ukraine, Moldova and Albania.\n• Population-wide data from the UK and Israel were quite difficult to interpret, as these countries were running their vaccination campaigns in parallel to an ongoing infection wave. As a matter of fact, their decrease in infections wasn’t any faster than in some countries with a low or very low vaccination rate, such as Portugal and South Africa. However, since about mid-April, the infection rates in Israel and the UK have indeed been lower than in most other countries.\n• Despite these uncertainties, independent cohort studies do confirm a (short-term) vaccine effectiveness after the second dose of about 90% in people up to 70 years of age and about 65% in care home residents (in the case of the Pfizer vaccine and in terms of infections). The protection against (severe) disease and death may be even higher.\n• Moreover, European countries that started their vaccination campaign prior to the spring wave confirm a very good protective effect even in people over 80. For instance, the chart below shows that in Switzerland, hospitalizations in April of people aged 40 to 59 reached almost the level of the second wave, whereas hospitalizations remained much lower in people aged 60 to 79 and especially in people 80+, who had been vaccinated first (orange curve vs. red curves).\n• In contrast, multiple countries and several studies have confirmed that the mass vaccination campaign can itself ignite or boost an infection wave, an effect first described by SPR in February. Most recently, this was observed in the Seychelles, the country with the highest vaccination rate in the world, that entered into another lockdown (“despite” a mask mandate). Most likely, this effect is a combination of the vaccination campaign spreading the virus (even into high risk groups), and people exposing themselves to higher risks prior to full protection.\n• Given this risk of a post-first-dose infection spike, early and prophylactic treatment protocols are still relevant, even – or especially – during vaccination campaigns.\n• A Swedish study found that compared to vaccination, a prior infection protects just as well, or even somewhat better, against a new Sars-CoV-2 infection (91% vs. 86%). This may be due to the fact that an infection appears to convey ‘broader’ immunity than spike protein based vaccines.\n\nAn Israeli lawyer describes the situation in Israel: “We live under increasing coercion, discrimination, marking and division into two civil societies according to the ‘green mark (pass)’. Basic activities such as work, education, health and recreation have become a luxury for only vaccinated people. And even then, only temporary.” The Israeli lawyer believes that “Israel is the ‘pilot’ that should serve as an example and justification for the whole world. If they convince the general public that there is ‘success’ here, it will be done all over the world and then it will get worse for all of us.”\n\nDr Peter McCullough on covid vaccines and covid early treatment. Dr McCullough is a cardiologist, medical professor and Vice Chief of Internal Medicine at Baylor University Medical Center, Texas A&M University. He is lead author of a landmark paper on covid early treatment, has treated numerous covid patients, and has had covid himself. (Video duration: 30 minutes)", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines: The Tip of the Iceberg", "description": "The latest on covid vaccine safety and effectiveness.", "url": "https://swprs.org/vaccines-the-tip-of-the-iceberg/", "site_name": "Swiss Policy Research", "article:modified_time": "2021-05-15T06:51:39+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/04/israel-mortality-65plus-weekly-cbs-april-28.png?fit=1064%2C611&ssl=1", "image:width": "1064", "image:height": "611", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "700", "height": "394", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/SuXnju6KNHM?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/SuXnju6KNHM?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/04/israel-mortality-65plus-weekly-cbs-april-28.png?ssl=1", "#preface", "#a-vaccine-safety", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://www.reuters.com/world/middle-east/israel-examining-heart-inflammation-cases-people-who-received-pfizer-covid-shot-2021-04-25/", "https://twitter.com/TomSchuIz/status/1387409305574514694", "https://www.the-people-committee.com/%D7%93%D7%95-%D7%97-%D7%AA%D7%95%D7%A4%D7%A2%D7%95%D7%AA-%D7%9C%D7%95%D7%95%D7%90%D7%99", "https://swprs.org/covid-rna-vaccines-deaths/", "https://twitter.com/the_Arkivist/status/1385722193527468036", "https://www.channelnewsasia.com/news/world/covid-19-astrazeneca-vaccine-nerve-disorder-guillain-barre-14763778", "https://swprs.org/covid-rna-vaccines-deaths/#updates", "https://www.pei.de/SharedDocs/Downloads/DE/newsroom/veroeffentlichungen-arzneimittel/rhb/21-04-13-covid-19-vaccine-astrazeneca.pdf", "https://swprs.org/covid-and-kids-the-evidence/", "https://swprs.org/post-acute-covid-long-covid/", "https://swprs.org/covid-and-kids-the-evidence/", "https://www.nytimes.com/2021/04/25/business/covid-vaccines-second-doses.html", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=total_vaccinations_per_hundred&Metric=People+vaccinated&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=ISR~USA~GBR", "https://thecovidblog.com/", "https://t.me/s/covidvaccineinjuries/", "https://thecovidblog.com/2021/05/05/kamrynn-thomas-16-year-old-wisconsin-girl-dead-11-days-after-experimental-pfizer-mrna-shot/", "https://reclaimthenet.org/facebook-removes-covid-19-vaccine-victims-group/", "https://nypost.com/2021/03/16/marvelous-marvin-hagler-did-not-die-after-covid-19-vaccine-wife/", "https://www.snopes.com/fact-check/dmx-covid-vaccine-heart-attack/", "https://thecovidblog.com/2021/04/07/midwin-charles-47-year-old-cnn-msnbc-legal-analyst-dead-one-month-after-experimental-mrna-shot/", "https://thecovidblog.com/2021/04/27/dan-kaminsky-42-year-old-cybersecurity-expert-dead-11-days-after-second-pfizer-vaxxed-tweet/", "https://popculture.com/celebrity/news/el-risitas-comedian-known-spanish-laughing-guy-meme-dead-65/", "https://www.timesofisrael.com/alber-elbaz-top-israeli-fashion-icon-and-ex-lanvin-director-dies-of-covid/", "https://swprs.org/vaccines-successes-and-controversies/#b3-the-swine-flu-profiteers-arte-2009", "https://www.irishexaminer.com/news/courtandcrime/arid-40283993.html", "https://www.bmj.com/content/362/bmj.k3948", "#b-vaccine-effectiveness", "https://twitter.com/Humble_Analysis/status/1389123310663835650", "https://lockdownsceptics.org/2021/05/07/study-claims-pfizer-vaccine-is-95-effective-in-over-65s-but-should-that-be-74/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&pickerSort=asc&pickerMetric=location&Metric=Confirmed+deaths&Interval=7-day+rolling+average&Relative+to+Population=true&Align+outbreaks=false&country=USA~GBR~ISR~PRT~ZAF", "https://www.medrxiv.org/content/10.1101/2021.03.08.21252200v1", "https://threadreaderapp.com/thread/1386179473524019204.html", "https://swprs.org/can-covid-vaccinations-drive-covid-deaths/", "https://www.bloomberg.com/news/articles/2021-05-04/world-s-most-vaccinated-nation-reintroduces-curbs-as-cases-surge", "https://swprs.org/on-the-treatment-of-covid-19/", "https://www.medrxiv.org/content/10.1101/2021.04.20.21254636v1", "https://www.nature.com/articles/s41590-021-00923-3", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/05/switzerland-hospitalizations-age-groups-may-2021.png?ssl=1", "#c-political-aspects", "https://twitter.com/GalGur_/status/1387377770137858057", "#video-dr-peter-mccullough-on-covid-vaccines-and-early-treatment", "https://linkinghub.elsevier.com/retrieve/pii/S0002934320306732", "https://rumble.com/vgjw85-covid-shot-killing-large-numbers-warns-top-covid-doctor-peter-mccullough.html", "#see-also", "https://swprs.org/the-vaccine-passport-agenda/", "https://swprs.org/covid-rna-vaccines-deaths/", "https://swprs.org/vaccines-successes-and-controversies/"], "authors": [], "publish_date": null}