{"result_id": "281008", "URL": "https://swprs.org/covid-and-reality/", "timestamp": "2023-04-25 17:12:49 CEST+0200", "meta": {"description": "Why have so many people, including many skeptics, lost touch with reality during the covid pandemic? Plus: more \"unreported covid truths\" that are not really true.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-and-reality/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid and Reality", "cleaned_text": "Why have so many people, including many skeptics, lost touch with reality during the covid pandemic? Plus: more “unreported covid truths” that are not really true.\n\nDuring the coronavirus pandemic, a vast number of people, likely more than 95% of the global and Western population, appear to have lost touch with reality at some point.\n\nThis is obviously true for people who followed official guidelines and narratives. These hapless people really were misled from start to finish: on coronavirus origins (“animal market”), on coronavirus lethality in the general population (100x overestimation), on lockdowns (“two weeks to flatten the curve”), on face masks (“80% fewer infections”), on schools and children (“drivers of the pandemic”), on mass testing (“test, test, test”), on vaccine protection (“fully vaccinated”), on vaccine side effects (myocarditis, stroke and more), on vaccine passports (“the only way out of the pandemic”), on covid treatment (ventilators, remdesivir, paxlovid), and on several other issues.\n\nBut it is also true for many covid skeptics. There were quite a few skeptics who denied the existence of SARS-CoV-2, or didn’t believe it was a novel virus, or thought they simply rebranded the flu, or denied there was a pandemic and excess mortality, or who denied vaccine protection against severe disease and death, or denied the reality of “long covid”, or who greatly exaggerated vaccine side effects (“global depopulation”), or overstated early treatment benefits (“crushing the curve”), or believed in some other weird ideas (e.g. 5G radiation causing covid).\n\nThere were also some people who wanted to be “centrists” – a political rather than a scientific position – which in practice meant calling the lab leak hypothesis a “conspiracy theory”, largely ignoring the very real vaccine safety issues, and not questioning the push for “vaccine passports”.\n\nWhat caused this widespread loss of reality? Several factors may have been at play:\n• Abstract nature of a pandemic: In contrast to other natural disasters, a viral pandemic is a rather abstract and ‘invisible’ issue, and important aspects remain unresolved even today.\n• Propaganda campaigns: Many governments launched massive propaganda campaigns, reminiscent of wartime propaganda, that for many people were very hard to resist.\n• Politicization: Many aspects of the pandemic became highly politicized, and political considerations often superseded scientific and rational considerations.\n• Psychological pressure: Both the pandemic itself and the political and media response to it created enormous medical, economic and social fears that impeded rational analysis.\n• Contradictions: There were many seemingly contradictory aspects that were difficult to reconcile (e.g. vaccines both save and kill people; masks work in a lab but not in practice).\n• Financial aspects: The pandemic generated billions of dollars in revenue in the vaccine, testing and PPE industries and millions of dollars in book sales, subscriptions and donations.\n\nWhile traditional media outlets were mostly unhelpful as a guide through the pandemic, the situation with independent media and social media was more complex: on the one hand, they successfully challenged many misleading official narratives, but on the other hand, they also amplified a lot of questionable information and fears (“bioweapon”, “vaccine holocaust”, etc.).\n\nFurthermore, independent authors may fall prey to a powerful effect called “audience capture”.\n\nMany governments and social media platforms responded with large online censorship campaigns, as recently revealed in the United States, but this was an obviously misguided and unjustified policy. Ultimately, only an open and fact-based debate can help resolve fundamental questions, but then again, not everybody may be interested in such a debate.\n\nWith close to half a million Twitter followers and close to a quarter-million Substack subscribers, the author of “Unreported Truths” – a former New York Times journalist and book author – has been one of the most prominent and most vocal covid contrarians in the United States.\n\nAfter briefly panicking in the spring of 2020, the author quickly adopted a more skeptical and more realistic position on key questions such as lockdowns, schools and masks. Yet with the advent of covid vaccines, the author increasingly lost touch with reality: in a previous analysis, it was shown that most of his covid and vaccine-related claims in 2021 were no longer correct.\n\nFor instance, in order to argue that covid vaccines were ineffective even against severe disease, the author had to falsely assume that the delta variant was milder than previous variants. Later, the author falsely suggested that covid vaccines weren’t vaccines and that infections were increasing only in countries with high vaccination rates.\n\nThis trend continued in 2022, with almost every single Substack post on covid, covid vaccines, long covid and related topics having been incorrect or misleading, as the following brief review shows.\n• In a recent post, the author claimed British data showed booster vaccines increased the risk of hospitalization in people aged 40-74; but only high-risk people were eligible for the spring booster, and in people over 75, the booster reduced the risk of hospitalization by 75%.\n• In another post, the author suggested the temporary decline in births in some countries was caused by covid vaccines; in reality, it was almost certainly caused by behavioral factors (fewer new marriages and delayed pregnancies during vaccination campaign).\n• In another post, the author claimed “long covid” was just a “social construct”; but this was a mis­inter­pre­tation of an immunological study that actually found “long covid” biomarkers.\n• In another post, the author suggested European excess mortality in 2022 was mostly due to mRNA vaccines; in reality, it was almost entirely due to omicron waves and heat waves.\n• In another post, the author claimed that “Paxlovid works but vaccines don’t” against severe covid. This was based on a misleading Paxlovid PR study that exaggerated covid deaths in vaccinated people without Paxlovid by using a biased selection of 1,000 out of 100,000 patients. In reality, Paxlovid has been shown to be largely ineffective in vaccinated people.\n• In another post, the author suggested covid vaccination was increasing mortality in New Zealand. In this case, he falsely invoked the “healthy vaccinee effect”; in fact, people vaccinated against covid tend to be less healthy, not more healthy, than unvaccinated people.\n• In another post, the author claimed that data from the Canadian province of Manitoba showed zero vaccine effectiveness against hospitalization; but the data referred to the month of May, when there were essentially no covid infections in Manitoba.\n• In another post, the author claimed data from the Netherlands showed negative vaccine effectiveness against hospitalization; but the data was not adjusted for previous infections and actually showed continued (booster) vaccine effectiveness.\n• In another post, the author argued that the US funeral business was “doing great” in the first quarter of 2022 and that it “wasn’t because of covid”; but US excess mortality in early 2022 was almost entirely due to large omicron waves.\n• In another post, the author suggested that British Columbia removed vaccine data because it showed negative vaccine protection; but the vaccine data wasn’t age-adjusted.\n• In another post, the author claimed that an Israeli study showed mRNA vaccines reduce sperm count for five months; but the Israeli study didn’t show this at all.\n• In another post, the author claimed that a Dutch preprint showed that mRNA vaccination was linked to “increases in overall deaths”; but the paper didn’t adjust for age and health status.\n• In another post, the author claimed Australian mortality data showed mRNA vaccines had failed; but excess mortality in Australia is still six times lower than in the US, and covid vaccines weren’t developed against the omicron variant to begin with.\n• In another post, the author claimed that a woman with obvious “long covid” (loss of smell, breathing problems) didn’t have “long covid” as she initially had a negative PCR test.\n• In another post, the author claimed excess mortality in some European countries was increasing due to mRNA vaccination; but it was increasing due to large omicron waves.\n• In another post (“urgent”), the author claimed the absence of anti-N antibodies showed that covid vaccines “hurt long-term immunity”; but anti-N antibodies aren’t neutralizing antibodies, and children often do not develop anti-N antibodies, either.\n• In another post, the author claimed that ivermectin failed in the Together trial; but the treatment group had markedly lower hospitalization and death rates, and the lead investigator stated that there was “a clear signal that ivermectin works in COVID patients”.\n• In another post the author misinterpreted influenza mortality and influenza vaccine statistics.\n• In another post the author claimed European data showed covid vaccines had “negative effectiveness”; but he didn’t take into account previous infections and testing bias.\n• In another post the author claimed South Korea and Hong Kong showed covid vaccines had negative effectiveness; but he ignored previous infections and vaccination rates per age group. In fact, data from Hong Kong and South Korea confirms vaccine effectiveness.\n\nIn essence, the author of “Unreported Truths” would like to prove, in a myriad of ways, a set of covid-related hypotheses that simply aren’t true, and hence cannot be proven. Nevertheless, the questions of long-term covid vaccine safety and effectiveness remain of paramount importance.\n\nVaccine protection against covid death in Switzerland. April 2021 was alpha variant; September and December 2021 were delta variant; January, March and July 2022 were omicron variants.\n• How effective are covid vaccines, really?", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid and Reality", "description": "Why have so many people, including many skeptics, lost touch with reality during the covid pandemic? Plus: more \"unreported covid truths\" that are not really true.", "url": "https://swprs.org/covid-and-reality/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-09-23T19:58:44+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/covid-toilet-paper.jpg?fit=976%2C549&ssl=1", "image:width": "976", "image:height": "549", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/covid-toilet-paper.jpg?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-and-reality/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-and-reality/", "https://t.me/share/url?url=https://swprs.org/covid-and-reality/", "https://archive.ph/20200830045016/https://www.telegraph.co.uk/news/2020/08/20/uk-public-believe-coronavirus-death-toll-100-times-higher-really/", "https://swprs.org/the-propaganda-pandemic/", "https://swprs.org/the-face-mask-folly-in-retrospect/", "https://www.youtube.com/watch?v=XX2RpY_dj9Y", "https://www.theepochtimes.com/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents_4704349.html", "#case-study-unreported-truths", "https://twitter.com/AlexBerenson", "https://swprs.org/unreported-truths/", "https://swprs.org/unreported-truths/", "https://swprs.org/unreported-truths/", "https://alexberenson.substack.com/p/do-boosters-save-people-from-getting", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1101870/vaccine-surveillance-report-week-35.pdf#page=47", "https://alexberenson.substack.com/p/more-frightening-news-about-fertility", "https://swprs.org/coronavirus-september-update/#baby-bust-was-it-an-illusion", "https://alexberenson.substack.com/p/long-long-long-covid/", "https://twitter.com/virusesimmunity/status/1557391752889307138", "https://alexberenson.substack.com/p/another-week-with-deaths-far-above", "https://swprs.org/how-real-is-2022-excess-mortality/", "https://alexberenson.substack.com/p/paxlovid-works-the-vaccines-dont", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-stops-enrollment-paxlovid-trial-standard-risk-population-2022-06-14/", "https://alexberenson.substack.com/p/do-people-under-30-die-at-above-normal", "https://dailysceptic.org/2022/02/09/why-the-healthy-vaccinee-effect-is-a-myth-and-cannot-explain-the-spikes-in-deaths-at-the-time-of-the-vaccine-rollout/", "https://alexberenson.substack.com/p/stunning-official-canadian-data-show/", "https://alexberenson.substack.com/p/no-mrna-covid-vaccines-do-not-offer", "https://alexberenson.substack.com/p/the-funeral-business-is-doing-great/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=2020-03-01..latest&uniformYAxis=0&pickerSort=asc&pickerMetric=location&Metric=Cases+and+deaths&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=%7EUSA", "https://alexberenson.substack.com/p/more-disappearing-covid-vaccine-data", "https://alexberenson.substack.com/p/another-conspiracy-theory-comes-true-e41", "https://swprs.org/covid-vaccines-and-fertility/", "https://alexberenson.substack.com/p/urgent-new-paper-suggests-covid-mrna/", "https://alexberenson.substack.com/p/we-need-to-talk-about-australia/", "https://alexberenson.substack.com/p/yep-another-classic-case-of-long?s=r", "https://alexberenson.substack.com/p/urgent-death-rates-are-soaring-again", "https://swprs.org/how-real-is-2022-excess-mortality/", "https://alexberenson.substack.com/p/urgent-the-most-powerful-evidence", "https://www.nature.com/articles/s41590-020-00826-9", "https://alexberenson.substack.com/p/ivermectin-fails-again?s=r", "https://swprs.org/the-ivermectin-debate/#update-april-2022", "https://alexberenson.substack.com/p/influenza-virus-gonna-virus?s=r", "https://alexberenson.substack.com/p/the-covid-vaccine-era-is-ending-already?s=r", "https://swprs.org/more-injections-more-infections/", "https://alexberenson.substack.com/p/the-light-at-the-end-of-the-mrna/", "https://swprs.org/coronavirus-the-hong-kong-experience/", "#figure-vaccine-protection-against-death", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/09/covid-vaccine-switzerland.jpg?ssl=1", "#see-also", "https://swprs.org/the-propaganda-pandemic/", "https://swprs.org/how-effective-are-covid-vaccines-really/", "https://swprs.org/covid-vaccine-adverse-events/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-and-reality/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-and-reality/", "https://t.me/share/url?url=https://swprs.org/covid-and-reality/"], "authors": [], "publish_date": null}