{"result_id": "281041", "URL": "https://swprs.org/vaccine-myocarditis-mystery-solved/", "timestamp": "2023-04-25 17:13:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/vaccine-myocarditis-mystery-solved/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Vaccine Myocarditis: Mystery Solved?", "cleaned_text": "A Brazilian investigator may have identified the mechanism driving mRNA vaccine myocarditis. And the US CDC finally acknowledges the strongly increased risk in young males.\n\n\n\nWhat is causing post-vaccination myocarditis, and why does it affect primarily young adults, especially young males and athletes? It has been speculated that in young males, muscle blood flow may be higher, which may cause higher biodistribution of vaccine mRNA or spike protein. The mRNA or spike protein may then be absorbed by the heart muscle and cause inflammation.\n\nBut Brazilian investigator Flavio Cadegiani, who previously looked into the role of androgens (male sexual hormones) in covid, recently proposed a new and highly intriguing theory: Based on autopsy findings, Cadegiani noted that post-vaccination myocarditis appears to be very similar not to typical myocarditis (e.g. viral myocarditis), but rather to adrenergic myocarditis or catecholamine-mediated stress cardiomyopathy (i.e. heart muscle injury caused by catecholamines).\n\nCatecholamines are a group of hormones that include, most notably, dopamine, adrenaline and noradrenaline. These hormones drive the “fight-or-flight response”, and their concentration is highest in young adults, especially in young males and athletes. Cadegiani notes that the adrenal glands (located on top of the kidneys) are amongst the tissues with highest production of spike protein from mRNA covid vaccines, which can cause local inflammation and may lead to a “catecholamine storm”, which is known to have a toxic stress effect on heart muscle cells.\n\nPrior to covid mRNA vaccinations, this type of heart injury was seen almost exclusively in patients with a rare tumor of the adrenal gland (called pheo-chromo-cytoma). Cadegiani suspects that mRNA vaccination is more likely to affect adrenal glands than a mild coronavirus infection, especially in young and healthy adults.\n\nCadegiani (February 2022): Catecholamines are the key trigger of mRNA SARS-CoV-2 and mRNA COVID-19 vaccine-induced myocarditis and sudden deaths. (ResearchGate)\n\nIn a newly published study covering data from 40 US health care systems and about 15 million people, the US CDC purports to show that “the risk for cardiac complications was significantly higher after SARS-CoV-2 infection than after mRNA COVID-19 vaccination for both males and females in all age groups”, which “supports the continued use of recommended mRNA COVID-19 vaccines among all eligible persons aged ≥5 years.”\n\nBut the actual data provided by the CDC tells a very different story.\n\nFirst, the US CDC confirms that among males aged 12 to 17, the rate of diagnosed myocarditis or pericarditis after the second vaccine dose is 1 in 4,500 to 1 in 2,700, and in males aged 18 to 29, the rate is 1 in 15,000 to 1 in 6,600.\n\nThese values are significantly higher than anything previously acknowledged by the CDC, but they still only include cases diagnosed by a doctor or in a hospital. If undiagnosed and unrecognized (subclinical) cases of myocarditis and pericarditis are taken into acccount, the rate will likely reach about 1 in 1,000 in young males. Even an undiagnosed case of myocarditis can turn out to be fatal, as the many recent cases of athletes with sudden cardiac arrest have shown.\n\nHowever, the CDC argues that the risk of diagnosed myocarditis and pericarditis is still higher after SARS-CoV-2 infection, viz. 1 in 2,000 to 1 in 1,500 in males aged 12 to 17, and 1 in 1,800 to 1 in 1,000 in males aged 18 to 29. But previous studies, both in the US and in Europe, have already shown that the incidence of myocarditis remained normal or even below average during major covid waves in 2020 and early 2021 and only increased during vaccination campaigns in 2021 (see chart below).\n\nSo what did the CDC get wrong? It’s a classic mistake (or trick): while the CDC speaks of “SARS-CoV-2 infections”, they in fact only captured positive tests and only within the health care system (i.e. at a doctor’s office or in a hospital). SARS-CoV-2 infections were not captured “if testing occurred in homes, schools, community sites, or pharmacies”, or, one may add, if no testing at all occurred. Thus, the CDC captured only a fraction of actual infections (perhaps 10% or even less), and they likely captured only the most severe infections (i.e. young adults who visited a doctor or a hospital).\n\nBut the CDC made another basic mistake: not only is the risk of myocarditis/pericarditis after vaccination in young males higher than after infection (as already shown by several other studies), but vaccination doesn’t prevent infection, either, and there is still no evidence that vaccination reduces the risk of post-infection myocarditis in young adults. In other words, the risk after vaccination simply adds to the already existing risk after infection.\n\nTo make matters even worse, the CDC study considered only the first two doses of covid vaccination, whereas some US colleges and universities have already mandated a third dose for their students, adding even more risk. In fact, a booster dose may well increase the total risk of myocarditis and pericarditis to more than 1 in 1,000 in otherwise perfectly healthy young males. And as a recently published cardiac MRI study has shown, heart abnormalities in adolescents with mRNA vaccine myocarditis may persist for at least several months.\n\nThus, based on the currently available evidence, covid vaccination is really only appropriate in people at significant risk of severe acute covid, whereas the forced vaccination of young and healthy adults and children may constitute the largest medical scandal, or medical crime, in modern history.\n\nFigure: Myocarditis and Covid Vaccination in the Western US\n• How the CDC fooled the world", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Myocarditis: Mystery Solved?", "description": "A Brazilian investigator may have identified the mechanism driving mRNA vaccine myocarditis. And the US CDC finally acknowledges the strongly increased risk in young males.", "url": "https://swprs.org/vaccine-myocarditis-mystery-solved/", "site_name": "Swiss Policy Research", "article:modified_time": "2022-04-12T12:10:38+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2022/04/mrna-myocarditis-cadegiani.png?fit=1195%2C856&ssl=1", "image:width": "1195", "image:height": "856", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2022/04/mrna-myocarditis-cadegiani.png?ssl=1", "https://twitter.com/intent/tweet?url=https://swprs.org/vaccine-myocarditis-mystery-solved/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccine-myocarditis-mystery-solved/", "https://t.me/share/url?url=https://swprs.org/vaccine-myocarditis-mystery-solved/", "#what-is-causing-vaccine-myocarditis", "https://www.researchgate.net/publication/358834540_Catecholamines_are_the_key_trigger_of_mRNA_SARS-CoV-2_and_mRNA_COVID-19_vaccine-induced_myocarditis_and_sudden_deaths_a_compelling_hypothesis_supported_by_epidemiological_anatomopathological_molecular", "https://en.wikipedia.org/wiki/Pheochromocytoma", "https://www.researchgate.net/publication/358834540_Catecholamines_are_the_key_trigger_of_mRNA_SARS-CoV-2_and_mRNA_COVID-19_vaccine-induced_myocarditis_and_sudden_deaths_a_compelling_hypothesis_supported_by_epidemiological_anatomopathological_molecular", "#new-cdc-study-on-myocarditis", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7114e1.htm", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://jamanetwork.com/journals/jama/fullarticle/2782900", "https://www.reuters.com/business/healthcare-pharmaceuticals/cdc-reports-fewer-covid-19-pediatric-deaths-after-data-correction-2022-03-18/", "https://twitter.com/TracyBethHoeg/status/1475160169076047872", "https://www.verywellhealth.com/colleges-booster-covid-5214189", "https://www.jpeds.com/article/S0022-3476(22)00282-7/fulltext#%20", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7114e1.htm", "#figure-myocarditis-and-covid-vaccination-in-the-western-us", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/04/myocarditis-jama-letter.png?ssl=1", "#see-also", "https://swprs.org/vaccine-victims-recent-high-profile-cases/", "https://swprs.org/covid-vaccine-adverse-events/", "https://swprs.org/the-us-cdc-science-or-politics/", "https://twitter.com/intent/tweet?url=https://swprs.org/vaccine-myocarditis-mystery-solved/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccine-myocarditis-mystery-solved/", "https://t.me/share/url?url=https://swprs.org/vaccine-myocarditis-mystery-solved/"], "authors": [], "publish_date": null}