{"result_id": "281002", "URL": "https://swprs.org/vaccines-successes-and-controversies/", "timestamp": "2023-04-25 17:12:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/vaccines-successes-and-controversies/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Vaccines: Successes and Controversies", "cleaned_text": "A. Documentaries about the success of vaccines\n\nA1. The Polio Story: The Vaccine That Changed the World (BBC, 2015)\n\nSummary: “It was 1952, and polio gripped the world in fear. There was no known cause, no cure and no help in sight for parents desperate to protect their children. Across the ocean, eager to beat the potentially fatal condition, polio-afflicted President Roosevelt inspired the American public to send in their dimes to fund research. In just a few years Joseph Salk, an ambitious 33-year-old scientist working from his basement lab in Pittsburgh, would bring infantile paralysis to its knees and change the course of medical history. Bill Gates is interviewed along with a number of world-renowned experts and survivors to tell the extraordinary story of how Dr Salk and the legendary ‘march of dimes’ came together to help conquer polio.”\n\nCriticism: On the pesticides/polio hypothesis, see section B6 below.\n\nSummary: “The greatest scientist of the 20th century, and no one knows his name. This documentary tells the inspiring story of Dr. Maurice Hilleman, a man with a singular, unwavering focus: to eliminate the diseases of children. From his poverty-stricken youth on the plains of Montana, he came to prevent pandemic flu, invent the measles-mumps-rubella (MMR) vaccine, and develop the first-ever vaccine against human cancer.\n\nResponsible for more than half of the vaccines children receive today, he is credited with saving more than eight million lives every year. Now through exclusive interviews with Dr. Hilleman and his peers, rare archival footage, and 3-D animation, this film puts a human face to vaccine science, revealing the character that drove this bold, complex, and heroic man.”\n• From Jenner to Wakefield: The long shadow of the anti-vaccination movement (Gresham College, 2011, 60 minute lecture) “ In 1998 a medical furore broke out when The Lancet published an article by Andrew Wakefield questioning the benefits of the MMR vaccination which was being given unquestioningly to children throughout the UK. Coming 202 years after the first vaccination by Edward Jenner, which led to the eradication of smallpox throughout the world, this recent incident is only the latest in a long history of questioning the benefits of vaccination.”\n• The Silent Invader (Westinghouse, 1957, 30min) “ This film discusses how the United States is preparing for an outbreak of Asian influenza. Prominent physicians and the head of the US Public Health Service address types of influenza, the nature of the virus, mortality rates, spread patterns, vaccines, the physician’s responsibility, and medical advice for people who fall ill.”\n• Mission, Measles: The Story of a Vaccine (Merck and USPHS, 1964, 20min) “This documentary details the history of the highly contagious virus that causes measles and the development of the measles vaccine in the 1950s and early 1960s. The pharmaceutical company Merck with help from the U.S. Public Health Service produced the film.”\n\nSummary: “Vaccines have changed the world, largely eradicating a series of terrible diseases, from smallpox to polio to diphtheria, and likely adding decades to most of our life spans. But despite the gains — and numerous scientific studies indicating vaccine safety — a growing movement of parents remains fearful of vaccines. And in some American communities, significant numbers of parents have been rejecting vaccines altogether, raising new concerns about the return of vaccine-preventable diseases like measles and whooping cough.”\n\nSummary: “Remember the swine flu scare of 1976? That was the year the U.S. government told us all that swine flu could turn out to be a killer that could spread across the nation, and Washington decided that every man, woman and child in the nation should get a shot to prevent a nation-wide outbreak, a pandemic. Well, 46 million of us obediently took the shot, and now 4,000 Americans are claiming damages from Uncle Sam amounting to three and a half billion dollars because of what happened when they took that shot. By far the greatest number of the claims – two thirds of them are for neurological damage, or even death, allegedly triggered by the flu shot.”\n\nSummary: “The current [2009] wave of influenza is scaring people around the world. The virus of subtype A/H1N1 – better known as swine flu – is spreading rapidly. In June, the World Health Organization (WHO) intensified its warning of a pandemic and declared the highest alert level. Since then, the health authorities in all countries have been trying to control the spread.\n\nHundreds of millions of euros are being made available for medicines and vaccines. Tax money has probably never been spent so quickly and unchecked as in the fight against the new flu virus. Has a mass hysteria gripped us or is the new flu really a deadly threat? In either case, there are tangible interests at stake. More and more scientists are criticizing the actions of the authorities.”\n• Why the WHO faked a pandemic (Michael Fumento, Forbes, 2010, archived)\n• Pandemrix vaccine: why was the public not told of early warning signs? (BMJ, 2018)\n• From where did the 2009 ‘swine flu’ virus emerge? (Virology Journal, 2009)\n\nB4. Vaxxed I: From Cover Up To Catastrophe (2016)\n\nSummary: “An investigation into how the CDC, the government agency charged with protecting the health of American citizens, destroyed data on a 2004 study that showed a link between the MMR vaccine and autism. This alarming deception has contributed to the skyrocketing increase of autism, potentially the most catastrophic epidemic of our lifetime.”\n• The Wakefield Case: Where is The Real Fraud? (Mazzucco, 30 min., 2021)\n• Criticism: A critical review of the documentary and its claims (Wikipedia)\n\nSummary: “An exploration into a possible link between various vaccinations and illness, injury, and death.”\n\nSee also: Vaxxed vs. Unvaxxed – The Science (Children’s Health Defense, 2020)\n\nCriticism: A critical review of the documentary and its claims (Guardian)\n\nA presentation on the DDT/polio hypothesis by Dr. Suzanne Humphries (2013, 40 min.).\n• DDT and the Rise and Fall of Polio (Marco Caceres, Vaccine Reaction, 2015)\n\nSummary: “In his latest ground-breaking book, Peter C. Gotzsche exposes the pharmaceutical industries and their charade of fraudulent behaviour, both in research and marketing where the morally repugnant disregard for human lives is the norm. He convincingly draws close comparisons with the tobacco conglomerates, revealing the extraordinary truth behind efforts to confuse and distract the public and their politicians.”\n\nB8. [Drug safety] Thalidomide: Still with us (2019)\n\nSummary: “Thalidomide – known as Contergan in Germany – is still being used as a drug. This, even after the medication caused thousands of birth defects six decades ago. The German pharmaceutical company Grünenthal marketed thalidomide world-wide starting in 1957. Pregnant women used the sleeping pill, which had been deemed so harmless it was available over the counter in Germany. Yet the drug proved damaging to embryos and caused serious birth defects. Estimates are that the drug caused thousands of deformities and an unknown number of stillbirths, until it was taken off the market at the end of 1961 when the links became clear.”\n• Documentary: TrustWHO (2018, Franck/Schlottmann, 90 minutes): “The World Health Organization (WHO) was founded with the aim of building a healthier future for everyone. It’s the body we rely on to resolve all public health crises, but can it be trusted? This powerful investigative doc uncovers an alarming picture of corruption and opacity as filmmaker Lilian Franck asks whether the organisation can be trusted to keep the public healthy.”\n• Book: The Truth About the Drug Companies: How They Deceive Us and What to Do About It (Marcia Angell, former editor of the New England Journal of Medicine, 2004) “During her two decades at The New England Journal of Medicine, Dr. Marcia Angell had a front-row seat on the appalling spectacle of the pharmaceutical industry. She watched drug companies stray from their original mission of discovering and manufacturing useful drugs and instead become vast marketing machines with unprecedented control over their own fortunes.”\n• Article: Deadly Immunity (Robert F. Kennedy Jr., Salon, 2005; archived) “When a study revealed that mercury in childhood vaccines may have caused autism in thousands of kids, the government rushed to conceal the data — and to prevent parents from suing drug companies for their role in the epidemic.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines: Successes and Controversies", "description": "Documentaries about the biggest successes and the most controversial aspects of vaccines.", "url": "https://swprs.org/vaccines-successes-and-controversies/", "site_name": "Swiss Policy Research", "article:modified_time": "2023-03-31T06:56:53+00:00", "image": "https://swprs.org/wp-content/uploads/2020/12/1957-flu-vaccine.jpg", "image:width": "1200", "image:height": "675", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/351212072\" width=\"736\" height=\"414\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"/>", "src": "https://player.vimeo.com/video/351212072"}, {"embed_type": "iframe", "provider": "youtube", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"736\" height=\"414\" src=\"https://www.youtube.com/embed/VPOrnU3ImxI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/VPOrnU3ImxI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "vimeo", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/403175258\" width=\"736\" height=\"414\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"/>", "src": "https://player.vimeo.com/video/403175258"}, {"embed_type": "iframe", "provider": "youtube", "width": "736", "height": "414", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"736\" height=\"414\" src=\"https://www.youtube.com/embed/dozpAshvtsA?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/dozpAshvtsA?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://twitter.com/intent/tweet?url=https://swprs.org/vaccines-successes-and-controversies/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccines-successes-and-controversies/", "https://swprs.org/vaccines-successes-and-controversies/#a-documentaries-about-the-success-of-vaccines", "https://swprs.org/vaccines-successes-and-controversies/#b-documentaries-about-vaccine-safety-concerns", "https://swprs.org/vaccines-successes-and-controversies/#c-additional-documentaries-and-books", "#a-documentaries-about-the-success-of-vaccines", "#a1-the-polio-story-the-vaccine-that-changed-the-world-bbc-2015", "#a2-hilleman-a-perilous-quest-to-save-the-worlds-children-2016", "https://archive.org/details/hilleman--a-perilous-quest-to-save-the-worlds-children", "#a3-historical-documentaries", "https://www.youtube.com/watch?v=YFauihFXKHk", "https://www.youtube.com/watch?v=19GO1OnoeFI", "https://www.c-span.org/video/?458170-2/mission-measles-story-vaccine", "#b-documentaries-about-vaccine-safety-concerns", "#b1-the-vaccine-war-pbs-2010-2015", "https://www.pbs.org/wgbh/frontline/film/vaccines/", "#b2-1976-swine-flu-pandemic-vaccine-injuries-cbs-1979", "https://www.history.com/news/swine-flu-rush-vaccine-election-year-1976", "https://archive.org/details/60-minutes-swine-flu", "#b3-the-swine-flu-profiteers-arte-2009", "https://www.bitchute.com/video/BXS82N8q6sPE/", "https://web.archive.org/web/20201011163656if_/https://www.forbes.com/2010/02/05/world-health-organization-swine-flu-pandemic-opinions-contributors-michael-fumento.html", "https://www.bmj.com/content/362/bmj.k3948", "https://link.springer.com/article/10.1186/1743-422X-6-207", "#b4-vaxxed-i-from-cover-up-to-catastrophe-2016", "https://archive.org/details/vaxxed-from-cover-up-to-catastrophe-2016-1080p", "https://childrenshealthdefense.org/news/deadly-immunity-government-cover-mercuryautism-scandal/", "https://tube.childrenshealthdefense.eu/videos/watch/b391b491-6720-4d58-a0ce-3551215e194c", "https://en.wikipedia.org/wiki/Vaxxed", "#b5-vaxxed-ii-the-peoples-truth-2019", "https://archive.org/details/vaxxed-2-the-peoples-truth", "https://childrenshealthdefense.org/wp-content/uploads/Vaxxed-Unvaxxed-Parts-I-XI.pdf", "https://www.theguardian.com/us-news/2019/oct/31/vaxxed-2-movie-sequel-release-fears-propaganda", "#b6-the-ddt-polio-controversy", "https://thevaccinereaction.org/2015/07/ddt-and-the-rise-and-fall-of-polio/", "https://whale.to/vaccine/west5a.html", "https://www.bmj.com/content/344/bmj.e2398/rr/578260", "https://nextnature.net/story/2014/how-modern-sanitation-gave-us-polio", "https://sciencebasedmedicine.org/wrong-about-polio-a-review-of-suzanne-humphries-md-and-roman-bystrianyks-dissolving-illusions-part-1-the-short-version/", "#b7-drug-safety-big-pharma-as-organized-crime-2015", "http://library.lol/main/5E2A4759A08AA7A495ADBA45CE1923AE", "https://odysee.com/@snakeoil:4/Dr-Peter-G%C3%B8tzsche-Big-Pharma-practices-Organized-Crime:3?r=7SH3pgmTc48QxbCGVSuSP76afAoid5Wq", "#b8-drug-safety-thalidomide-still-with-us-2019", "https://web.archive.org/web/20191210054224/https://www.youtube.com/watch?v=nc3nHrDEWs4", "#b9-german-documentaries", "https://www.youtube.com/watch?v=JtbqwZFCJfo", "https://www.youtube.com/watch?v=TmOMFnxi-i4", "https://www.youtube.com/watch?v=T0Xt3Igpllg", "https://www.youtube.com/watch?v=wvTEHtJ7ZqM", "#c-additional-documentaries-and-books", "https://www.bitchute.com/video/y8MfHar0JPCD/", "https://b-ok.cc/book/1182976/b56ae4", "https://childrenshealthdefense.org/news/deadly-immunity-government-cover-mercuryautism-scandal/", "#see-also", "https://swprs.org/the-hiv-aids-controversy/", "https://swprs.org/on-the-origin-of-sars-coronavirus-2/", "https://swprs.org/wikipedia-propaganda-operation/", "https://twitter.com/intent/tweet?url=https://swprs.org/vaccines-successes-and-controversies/", "https://www.facebook.com/share.php?u=https://swprs.org/vaccines-successes-and-controversies/"], "authors": [], "publish_date": null}