{"result_id": "281017", "URL": "https://swprs.org/covid-vaccine-adverse-events/", "timestamp": "2023-04-25 17:12:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/swprs.org/wp-content/uploads/2020/08/cropped-swiss-policy-research-logo.png?fit=32%2C32&ssl=1", "canonical": "https://swprs.org/covid-vaccine-adverse-events/", "encoding": "UTF-8"}, "image": null, "domain": "swprs.org", "title": "Covid Vaccine Adverse Events", "cleaned_text": "A) Neurological disorders; B) Menstrual disorders, miscarriages, birth defects; C) Heart inflammation, heart attacks, cardiac arrest; D) Blood clots and strokes; E) Severe skin reactions; F) Eye disorders and blindness; G) Bell’s palsy (facial paralysis); H) Shingles and other virus reactivations; J) Tinnitus, hearing loss, dizziness and vertigo; K) Anaphylactic shock; L) Tumor growth and cancer; M) Appendicitis; N) Children: PIMS, myocarditis, blood clots; O) Diabetes and diabetic ketoacidosis; P) Other autoimmune diseases; Q) Booster toxicity; R) Lymphadenopathy; S) Organ failure; T) “Long Covid”; U) Creuzfeldt-Jakob disease (CJD); V) Histopathological findings; A1) Safety signals; A2) Causality and Under-Reporting; A3) Excess mortality; A4) Case reports; A5) Videos\n\nCovid vaccinations have been associated with several neuro-inflammatory and neuro-degenerative disorders, including Guillain-Barré syndrome (GBS), multiple sclerosis (MS, new-onset or relapse), transverse myelitis (TM), and acute disseminated encephalomyelitis (ADEM).\n\nNeurological auto-immune reactions may be due to antigenic cross-reactivity and typically occur within days or weeks of vaccination. Symptoms vary and may include muscle weakness and paralysis, tremors and seizures, as well as cognitive issues (see video below).\n\nBy November 2021, about 2000 cases of post-vaccination GBS had been reported to the US VAERS systems and about 500 cases had been reported to the British MHRA system. Back in 1976, the US swine flu vaccination campaign was stopped due to an increased risk of GBS.\n\nSee also: Studies and case reports (TG)\n\nUS authorities have argued that covid vaccines “appear to be completely safe for pregnant women” (NIH) and “are thought not to be a risk to lactating people or their breastfeeding babies” (CDC). However, the US VAERS system counts already more than 3,000 post-vaccination miscarriages, and it has been known since March 2021 that covid vaccines, or the spike protein they produce, may get into breast milk and sicken or kill a baby (e.g. by causing internal bleeding or allergic reactions).\n\nIn addition, by September 2021, more than 30,000 British women had reported post-vaccination menstrual disorders, such as excessive bleeding, and several cases of post-vaccination birth defects, including cardiac anomalies or pulmonary hemorrhage, have been reported.\n\nIn Scotland, an investigation has been launched into a spike in deaths among newborn babies. Of note, the Pfizer vaccine trial in pregnant women continues to be delayed for “lack of participants”. Regarding female fertility, it is too early to know if covid vaccines might have any impact.\n\nIn March 2021, Israel first reported a “murky wave of heart attacks” and an increase in post-vaccination all-cause mortality. In June, the Israeli Ministry of Health confirmed that covid mRNA vaccines may cause heart inflammation (myocarditis) and heart attacks, especially in young people. In September, a US study showed that in healthy male adolescents, the risk of post-vaccination myocarditis is about five times higher than the risk of covid hospitalization.\n\nIn young males, the risk of post-vaccination myocarditis may reach about 1 in 1000 (including subclinical cases). In October, several Nordic countries partially or fully halted the use of the high-dosed Moderna mRNA vaccine due to the elevated risk of myocarditis. In November, Taiwan suspended the second dose of the Pfizer vaccine in adolescents.\n\nPost-vaccination myocarditis may also affect athletes and may lead to sudden cardiac arrest. Since the beginning of the covid vaccination campaign, several hundred professional athletes collapsed or died from cardiac arrest or heart attacks. In several countries, cases of myocarditis have significantly increased during covid vaccination campaigns. Myocarditis, even if “mild” (i.e. self-limiting), may cause long-term heart issues.\n\nA study in mice found that if mRNA vaccine gets into a vein, the heart muscle absorbs the mRNA, starts producing coronavirus spike protein, gets attacked by the immune system, and develops inflammation and cell damage (i.e. myocarditis). This is likely what happens in humans, too, if the vaccine accidentally gets injected into a blood vessel instead of muscle cells.\n\nSee also: Athlete cardiac arrests (overview) and Cardiac Arrest in Athletes (TG)\n\nVaccine-induced myocarditis has also affected children and adolescents.\n\nBlood clots, stroke and pulmonary embolism continue to be major covid vaccine adverse events, especially after adenovector covid vaccines (AstraZeneca, Johnson&Johnson). In response, several countries have suspended the use of adenovector covid vaccines altogether or in non-senior citizens, in whom the risk is most pronounced.\n\nIn April 2021, AstraZeneca acknowledged that up to 10% of people receiving their covid vaccine may develop transient thrombocytopenia (low blood platelet count), which, in severe cases, may turn into thrombotic thrombocytopenia and increased risk of blood clots.\n\nLife-threatening blood clots have also affected professional athletes and have caused pulmonary embolism (blood clots in the lung) and cerebral bleeding. A 44-year-old BBC moderator died due cerebral bleeding caused by the AstraZeneca vaccine. Several cases of leg amputations due to vaccine-induced blood clots have also been reported (see image below).\n\nOf note, the risk of blood clots may increase during air travel. British Airways confirmed the death of three of their pilots, aged 30 to 55, without disclosing their cause of death or vaccination status. A German Lufthansa First Officer collapsed during a flight from Spain to Germany.\n\nThere are also ‘anecdotal’ reports of unusual cardiovascular complications several months after vaccination, raising the question of potential long-term cardiovascular damage: for instance, six months after vaccination, a healthy 13-year-old boy had a fatal cardiac arrest, a healthy 15-year-old girl had a fatal brain aneurysm, and a healthy ~35-year-old woman had a life-threatening stroke.\n\nThe following figure shows a brain MRI of a vaccine-induced cerebral sinus venous thrombosis and cerebral hemorrhage (brain bleed) in a 32-year-old woman (more):\n\nSkin reactions have been reported quite frequently after covid vaccinations. They include various types of rashes and eczema, chronic hives, but also immune responses affecting blood vessels in the skin (eryhtema multiforme or thrombotic thrombocytopenic purpura).\n\nRead more: COVID-19 Vaccines and the Skin (Dermatlogic Clinics)\n\nCovid vaccines may lead to bleeding and inflammation in the eyes and, in severe cases, to retinal detachment and blindness. In the UK, several hundred cases of post-vaccination blindness have been reported. In the US, about 2,500 reports to the VAERS system mention post-vaccination blindness. There are also reports of post-vaccination eye disorders affecting the eye lens (e.g. cataract), but the causality is currently less clear in these cases.\n\nBell’s palsy is a unilateral facial paralysis that may last for up to six months. By December 2021, about 12,000 cases of post-vaccination Bell’s palsy had been reported to the US VAERS system, but the real number of cases is likely in the tens of thousands.\n\nReports of post-vaccination shingles (i.e. varicella zoster virus reactivation) have been quite frequent: by December 2021, about 11,000 cases of post-vaccination shingles had been reported to the US VAERS system (the true figure may be close to 100,000).\n\nVaricella zoster virus reactivation may occur due to temporary vaccine-induced immune suppression (lymphocytopenia); about 20% of shingles patients develop a type of long-lasting neurological pain called postherpetic neuralgia (PHN).\n\nThe vaccine-induced reactivation of other latent virus infections, including human papilloma virus (HPV) and Epstein-Barr virus (EBV), has also been reported.\n\nSee also: Shots and shingles: What do they tell us? (Doctors for Covid Ethics)\n\nNew onset of tinnitus is a rather frequently reported adverse event of covid vaccines: by December 2021, about 16,000 cases of post-vaccination tinnitus had been reported to the US VAERS system. In addition, several thousand cases of deafness or sudden hearing loss have been reported.\n\nOf note, the Johnson & Johnson covid vaccine clinical trial had already included six cases of post-vaccination tinnitus, but the US FDA later ruled that they were ‘unrelated to the shot’. Vaccine-induced tinnitus may be caused by neuro-inflammation or blood vessel disorders, such as endothelial dysfunction.\n\nIn addition to tinnitus, there are also numerous reports of post-vaccination dizziness and vertigo, which may be due to immune reactions affecting the vestibular system in the inner ear.\n\nCovid vaccinations can cause a potentially life-threatening anaphylactic (allergic) shock. People affected by an anaphylactic shock typically collapse shortly after vaccination. By December 2021, about 8,500 cases of anaphylaxis had been reported to the US VAERS system. According to studies, anaphylaxis is more frequent after covid vaccines compared to other vaccines.\n\nVideo: An anaphylactic shock immediately after covid vaccination (more):\n\nWhile there is no evidence that covid vaccines themselves are carcinogenic (i.e. cancer-causing), it has been shown that covid vaccines can cause a temporary immune suppression (lymphocytopenia) in up to 50% of people, which in turn might, in some cases, influence tumor growth (similar to the reactivation of varicella zoster virus, described above).\n\nIn official adverse event reporting systems and in vaccine-related online patient groups, there are already several thousand case reports of sudden post-vaccination tumor growth and cancer, even in young people, although some of these cases may certainly be coincidental.\n\nBy December 2021, post-vaccination appendicitis had been mentioned in about 1,000 reports to the US VAERS system. According to the US CDC, “the most common serious adverse events in the vaccine [trial] group which were numerically higher than in the placebo group were appendicitis, acute myocardial infarction, and cerebrovascular accident.” Appendicitis might occur due to vaccine-induced immune suppression or due to vaccine-induced mesenteric venous micro-thrombosis.\n\nCovid vaccination was thought to prevent pediatric inflammatory multi-system syndrome (PIMS), a rare condition associated with covid in children. Instead, it turned out that covid vaccines may themselves trigger PIMS, which is most likely caused by an immune reaction to the spike protein. Vaccine-induced PIMS was first noticed in Israel and was later confirmed by EMA.\n\nBy December 2021, the US VAERS system had received several hundred reports of post-vaccination heart inflammation and even strokes in children 5 to 17 years old. Some of these children had already recovered from mild or even asymptomatic covid prior to their vaccination.\n\nIn a letter to the British Medical Journal, a group of doctors wrote: “For young age groups, in whom covid-related morbidity and mortality is low, and for those who have had covid-19 infection already, and appear to have longstanding immunological memory, the harms of taking a vaccine are almost certain to outweigh the benefits to the individual, and the goal of reducing transmission to other people at higher risk has not been demonstrated securely.”\n\nIn October 2021, a Chinese study published in Nature Cell Discovery first reported a “consistent increase” in post-vaccination blood sugar levels (HbA1c) lasting several months. Blood sugar levels peaked about one month after vaccination and reached prediabetic levels in about 30% of previously healthy participants. In addition, the study also found consistent alterations in serum sodium and potassium levels, coagulation profiles, and renal functions.\n\nIn September 2021, a US study reported several cases of post-vaccination hyperglycemic emergencies, including hyperglycemic syndrome and diabetic ketoacidosis. The first widely reported case of a post-vaccination death due to diabetic ketoacidosis was 42-year-old cyber security expert Dan Kaminsky in April 2021.\n\nIn addition to neurological autoimmune diseases described above, covid vaccines have already been linked to several other new-onset autoimmune diseases, including, in particular, autoimmune hepatitis (i.e. chronic liver inflammation) and rheumatoid arthritis. According to a US study, up to 20% of people with pre-existing rheumatic disease experienced acute disease flares after covid vaccination.\n\nSee also: Studies and case reports (TG)\n\nSeveral covid vaccine vaccine adverse events, including cardiovascular adverse events, have been shown to be dose-dependent. Thus, they are more likely to occur after the high-dosed Moderna vaccine compared to the lower-dosed Pfizer vaccine (100μg vs. 30μg mRNA), and they are more likely to occur after the second or third dose compared to the first dose.\n\nIn December 2021, the Canadian province of Quebec decided to stop booster vaccinations of senior citizens who had previously been infected after an increase in life-threatening booster vaccine reactions had been observed (previously also reported in Germany and in Israel). It is also known that mRNA lipid nano-particles themselves can cause toxicity if injected repeatedly over several months or years.\n\nLymphadenopathy (i.e. swollen lymph nodes, typically in an armpit) has been reported frequently after covid vaccination, in particular after booster vaccinations: for instance, it was reported in 0.4% of people after the second Pfizer dose, but in 5.2% of people after the third Pfizer dose and in about 10% of people after the third Moderna dose (TGA).\n\nAustralian immunology researcher Joanna Groom stated that the increased occurrence of lymphadenopathy after the booster dose may be due to “hyper-proliferation of effector immune cells” and “additional inflammation” due to a “much shorter delay” between covid vaccinations compared to annual flu vaccines.\n\nPost-vaccination lymphadenopathy is usually benign and typically resolves after about three weeks, but its medical significance is not yet fully understood. The size of swollen lymph nodes can vary from pea-sized to egg-sized.\n\nIn some cases, covid vaccines may lead to organ failure within hours or days of vaccination. See this case report of a young Australian nurse who received the Astra-Zeneca covid vaccine and developed life-threatening kidney and liver failure (requiring emergency dialysis), followed by hearing loss, POTS (a blood circulation and heart rate disorder), MCAS (an immune disorder), neurological disorders and post-traumatic stress disorder (PTSD).\n\nIn general, vaccination cannot prevent “long covid”, as vaccination cannot prevent infection and mild covid (which is sufficient to trigger long covid). According to a US study, vaccination reduced the risk of developing long covid symptoms by only 13%. Furthermore, covid vaccination may itself cause long covid symptoms, likely due to an immune reaction to the coronavirus spike protein.\n\nThere is currently some preliminary evidence that in very rare cases, covid mRNA vaccines may cause Creuzfeldt-Jakob disease (CJD), a fatal degenerative brain disorder (a type of prion disease), within weeks of vaccination.\n\nIn May 2021, a 64-year-old woman from Florida developed CJD after her second Pfizer vaccine and died within three months. In France, about 20 cases of post-vaccination CJD have become known, mainly after the Pfizer vaccine.\n\nIn November 2021, French virologist Jean-Luc Montagnier warned that CJD could be a serious covid vaccine adverse event. In March 2021, Jose Baselga, a senior executive at AstraZeneca, died of CJD (it is not known if Baselga was already vaccinated).\n\nGerman pathologists Prof. Dr. Arne Burkhardt and Prof. Dr. Walter Lang studied tissues of two dozen people who had died after vaccination. Using state-of-the-art immunohistological technology, Prof. Burkhardt and Prof. Lang detected vaccine-induced spike protein in the endothelium of blood vessels up to at least four months after vaccination. Furthermore, they found that the spike protein triggered severe inflammation that caused endothelial damage in blood vessels and inflammation of the heart, lungs, brain, spleen and other organs.\n\nSeveral serious adverse events were already observed during official covid vaccine trials, but were discarded as “unrelated”. An editor of the British Medical Journal noted that the Pfizer vaccine trial had excluded, without explanation, five times more people from the vaccine group than from the control group. In the Pfizer vaccine trial for adolescents, as 12-year-old girl suffered permanent paralysis, but Pfizer reported her case merely as “abdominal pain”.\n\nSome post-vaccination injuries may be unrelated to the vaccination. However, in the US, about 50% of post-vaccination deaths occurred in people who became ill within 48 hours of being vaccinated. Furthermore, a systematic analysis found that even in senior citizens, about 85% of post-vaccination deaths reported to VAERS were plausibly caused by the covid vaccine.\n\nA large 2006 meta-study found that reporting systems of drug adverse events typically cover only about 5% to 20% of all adverse events experienced by drug recipients (under-reporting). Thus, reported adverse events may have to be multiplied by a factor of 5 to 20 to get actual adverse events.\n\nA representative German INSA survey of 1,004 vaccinated people found that 15% self-reported “strong adverse events”, 44% self-reported “mild adverse events”, and 40% reported “no adverse events”; strong adverse events were more common among younger people: in people below 40 years, 23% self-reported “strong adverse events”.\n\nIn an open letter published in October 2021, Dr. Hartmut Glossmann – professor of Pharmacology, one of Austria’s most cited scientists in the world, founder of the first Austrian Drug Commission and long-time editor of a German pharmaceutical publication – described covid vaccines as “the biggest drug scandal” he has ever witnessed.\n\nRead more: Covid Vaccines: The Next Vioxx? (March 2022)\n\nIn numerous countries, an unexplained non-covid excess mortality was observed during and after vaccination and booster campaigns, both in senior citizens and in young (especially male) people. In many cases, a parallel increase in cardiovascular deaths was reported (e.g. heart attacks, strokes and cardiac arrests).\n\nExamples include Israel; Great Britain and especially British male teens (who face the highest risk of myocarditis); many other European countries, including Germany and Switzerland and Iceland; and both New Zealand and Australia. In the USA, non-covid excess mortality increased for various reasons (e.g. drug overdoses, homicides etc.).\n\nTo study case reports of vaccine-related deaths and injuries, see:\n\nTo study cases of vaccine skeptics dying of covid, see “Sorry Antivaxxer”.\n\nThere have been a record number of professional and amateur athletes suffering a cardiac arrest or heart attack in 2021, typically within weeks of vaccination (5-minute compilation).\n\n“Hearing without listening”: At FDA hearing on coronavirus vaccine, the chair cut off questions and limited debate. (One minute video, The Defender)\n\nAn Israeli documentary on covid vaccine injuries (1 hour; source: The Testimonies Project).", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccine Adverse Events", "description": "An overview of severe covid vaccine adverse events.", "url": "https://swprs.org/covid-vaccine-adverse-events/", "site_name": "Swiss Policy Research", "article:modified_time": "2023-01-29T11:52:40+00:00", "image": "https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/gbs-covid-vaccine.png?fit=1920%2C1080&ssl=1", "image:width": "1920", "image:height": "1080", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/gbs-covid-vaccine.png?ssl=1", "https://t.me/share/url?url=https://swprs.org/covid-vaccine-adverse-events/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccine-adverse-events/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccine-adverse-events/", "#contents", "#a-neurological-disorders", "https://link.springer.com/article/10.1007/s00415-021-10780-7", "https://en.wikipedia.org/wiki/Guillain-Barr%C3%A9_syndrome", "https://en.wikipedia.org/wiki/Multiple_sclerosis", "https://www.statnews.com/2020/09/09/astrazeneca-covid19-vaccine-trial-hold-patient-report/", "https://en.wikipedia.org/wiki/Acute_disseminated_encephalomyelitis", "https://www.frontiersin.org/articles/10.3389/fimmu.2020.617089/full", "https://openvaers.com/covid-data", "https://yellowcard.ukcolumn.org/yellow-card-reports#[object%20Object]", "https://swprs.org/guillain-barre-syndrome-after-covid-vaccination/", "https://t.me/s/DrJohnB/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/09/covid-vaccine-multiple-sclerosis.jpg?ssl=1", "#b-menstrual-disorders-miscarriages-birth-defects", "https://directorsblog.nih.gov/2021/06/01/covid-19-vaccines-safe-effective-for-pregnant-women-two-studies-confirm/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://openvaers.com/covid-data", "https://t.me/s/covidvaccineinjuries/368", "https://www.bmj.com/content/374/bmj.n2211", "https://t.me/s/covidvaccineinjuries/1504", "https://twitter.com/Dr_ScottMc/status/1450747846970548226", "https://www.heraldscotland.com/news/19756029.scotland-neonatal-deaths-spike-not-linked-covid-mothers-babies/", "https://www.wsj.com/articles/pfizer-study-of-covid-19-vaccine-in-pregnant-women-delayed-by-slow-enrollment-11632310283", "https://www.sciencedirect.com/science/article/pii/S0890623821000800", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/baby-ttp-vaccine.png?ssl=1", "#c-heart-inflammation-heart-attacks-cardiac-arrest", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://www.bloomberg.com/news/articles/2021-06-02/israel-finds-probable-link-between-pfizer-shot-and-myocarditis", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://www.medrxiv.org/content/10.1101/2021.12.02.21267156v1", "https://medicalxpress.com/news/2021-10-iceland-halts-moderna-jabs-heart-inflammation.html", "https://www.taiwannews.com.tw/en/news/4340862", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://jamanetwork.com/journals/jama/fullarticle/2782900", "https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.121.056583", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "https://t.me/s/CardiacArrestSports", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/soccer-players-heart.webp?ssl=1", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/06/pfizer-myocarditis.png?ssl=1", "#d-blood-clots-and-strokes", "https://abcnews.go.com/Business/wireStory/germany-suspends-astrazeneca-vaccine-amid-clotting-concerns-76466092", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8313538/", "https://t.me/s/covidvaccineinjuries/366", "https://t.me/s/covidvaccineinjuries/370", "https://www.theguardian.com/media/2021/may/27/bbc-presenter-lisa-shaw-died-of-blood-clot-after-astrazeneca-jab-family-says", "https://web.archive.org/web/20220314120205/https://thecovidworld.com/a-list-of-people-who-had-their-leg-amputated-after-receiving-covid-19-vaccine/", "https://www.reuters.com/article/factcheck-coronavirus-aviation/fact-check-british-airways-is-not-in-crisis-talks-with-the-government-over-vaccinated-pilots-idUSL2N2NZ1ZO", "https://mentourpilot.com/lufthansa-first-officer-collapses-on-flight-attendant/", "https://t.me/s/covid_vaccine_injuries/14920", "https://twitter.com/JeanRees10/status/1479566734768095235", "https://t.me/s/covidvaccineinjuries/4205", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/11/covid-vaccine-leg-amputations.webp?ssl=1", "https://t.me/s/DrJohnB/703", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/09/covid-vaccine-cerebral-sinus-venous-thrombosis-woman-32.jpg?ssl=1", "#e-severe-skin-reactions", "https://t.me/s/covidvaccineinjuries/1453", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8525834/", "https://www.sciencedirect.com/science/article/pii/S073386352100053X", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/08/covid-vaccine-skin-rash.jpg?ssl=1", "#f-eye-disorders-and-blindness", "https://yellowcard.ukcolumn.org/yellow-card-reports#[object%20Object]", "https://openvaers.com/covid-data/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/08/covid-vaccine-eye-bleeding.jpg?ssl=1", "#g-bells-palsy-facial-paralysis", "https://www.mayoclinic.org/diseases-conditions/bells-palsy/symptoms-causes/syc-20370028", "https://t.me/s/covidvaccineinjuries/", "#h-shingles-and-other-virus-reactivations", "https://openvaers.com/covid-data/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8228758/", "https://www.drpawluk.com/blog/pemf-device-therapy-to-reduce-pain-during-and-after-shingles/", "https://doctors4covidethics.org/shots-and-shingles-what-do-they-tell-us/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/10/post-vaccine-shingles-2.png?ssl=1", "#j-tinnitus-hearing-loss-dizziness-and-vertigo", "https://openvaers.com/covid-data", "https://openvaers.com/covid-data/covid-full-data", "https://www.verywellhealth.com/tinnitus-covid-vaccine-side-effect-5184272", "https://www.mayoclinic.org/diseases-conditions/tinnitus/symptoms-causes/syc-20350156", "https://t.me/s/covidvaccineinjuries/", "https://web.archive.org/web/20220314120205/https://thecovidworld.com/tens-of-thousands-of-americans-are-suffering-from-hearing-problems-after-the-covid-19-vaccine/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/08/pfizer-tinnitus.jpg?ssl=1", "#k-anaphylactic-shock", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7002e1.htm", "https://openvaers.com/covid-data/", "https://jamanetwork.com/journals/jama/fullarticle/2777417", "https://t.me/s/covidvaccineinjuries/", "#l-tumor-growth-and-cancer", "https://swprs.org/covid-vaccines-and-cancer/", "https://swprs.org/covid-vaccines-and-cancer/", "https://openvaers.com/covid-data", "https://t.me/s/covidvaccineinjuries/2344", "https://swprs.org/covid-vaccines-and-cancer/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/t-cell-lymphoma-booster.jpg?ssl=1", "#m-appendicitis", "https://openvaers.com/covid-data/covid-full-data", "https://www.cdc.gov/vaccines/covid-19/info-by-product/pfizer/reactogenicity.html", "#n-children-pims-myocarditis-blood-clots", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/misc-and-covid19-rare-inflammatory-syndrome-in-kids-and-teens", "https://www.israelnationalnews.com/News/News.aspx/296876", "https://www.israelnationalnews.com/News/News.aspx/296876", "https://www.ema.europa.eu/en/news/meeting-highlights-pharmacovigilance-risk-assessment-committee-prac-30-august-2-september-2021", "https://openvaers.com/openvaers", "https://healthimpactnews.com/2021/7-year-old-girl-has-stroke-and-brain-hemorrhage-7-days-after-pfizer-covid-19-shot/", "https://www.bmj.com/content/375/bmj.n2957/rr-1", "https://twitter.com/Lilith_Assyria/status/1471834089623855114", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/children-post-vaccination-deaths.jpg?ssl=1", "#o-diabetes-and-diabetic-ketoacidosis", "https://www.nature.com/articles/s41421-021-00329-3", "https://academic.oup.com/jes/article/5/11/bvab141/6375389", "https://thecovidblog.com/2021/04/27/dan-kaminsky-42-year-old-cybersecurity-expert-dead-11-days-after-second-pfizer-vaxxed-tweet/", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/11/covid-vaccination-blood-glucose.png?ssl=1", "#p-other-autoimmune-diseases", "https://www.sciencedirect.com/science/article/pii/S0896841121001499", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8516724/", "https://www.the-rheumatologist.org/article/patients-with-rheumatic-disease-may-experience-flares-after-sars-cov-2-vaccination/", "https://t.me/s/DrJohnB", "https://i0.wp.com/swprs.org/wp-content/uploads/2021/12/covid-vaccine-autoimmune-hepatitis.jpg?ssl=1", "#q-booster-toxicity", "https://westphaliantimes.com/canadian-province-stops-giving-boosters-to-elders-who-have-had-covid-in-the-past-due-to-severe-life-threatening-side-effects/", "https://www1.wdr.de/nachrichten/ruhrgebiet/probleme-nach-drittimpfung-bei-senioren-100.html", "https://www.statnews.com/2016/09/13/moderna-therapeutics-biotech-mrna/", "https://twitter.com/JeanRees10/status/1478926295593590786", "#r-lymphadenopathy", "https://www.drugs.com/cg/lymphadenopathy.html", "https://www.tga.gov.au/periodic/covid-19-vaccine-weekly-safety-report-06-01-2022#booster-doses-", "https://www.news.com.au/lifestyle/health/bizarre-covid19-booster-shot-side-effect-explained/news-story/bf9e18f359fc318d26eaba97b8ef5707", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7994368/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/lymphadenopathy.jpg?ssl=1", "#s-organ-failure", "https://t.me/s/anastaci91/5092", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/01/astrazeneca-organ-failure-1.png?ssl=1", "#t-long-covid", "https://www.researchsquare.com/article/rs-1062160/v1", "https://www.science.org/content/article/rare-cases-coronavirus-vaccines-may-cause-long-covid-symptoms", "#u-creuzfeldt-jakob-disease-cjd", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://twitter.com/Marc_Doyer/status/1484631838316535817", "https://must-news.com/uncategorized/luc-montagnier-warns-of-the-next-danger-from-vaccines-prion-disease/", "https://www.oncozine.com/jose-baselga-a-leading-cancer-researcher-dies-at-61/", "#v-histopathological-findings", "https://swprs.org/covid-vaccine-injuries-the-german-pathologists-findings/", "https://swprs.org/covid-vaccine-injuries-the-german-pathologists-findings/", "https://swprs.org/covid-vaccine-injuries-the-german-pathologists-findings/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/03/reutlingen-spike-protein-endothelium.jpg?ssl=1", "#safety-signals-during-vaccine-trials", "https://www.verywellhealth.com/tinnitus-covid-vaccine-side-effect-5184272", "https://blogs.bmj.com/bmj/2021/01/04/peter-doshi-pfizer-and-modernas-95-effective-vaccines-we-need-more-details-and-the-raw-data/", "https://www.skirsch.com/covid/VRBPAC.pdf#page=21", "#causality-and-under-reporting", "https://openvaers.com/covid-data/mortality", "https://www.researchgate.net/publication/352837543_Analysis_of_COVID-19_vaccine_death_reports_from_the_Vaccine_Adverse_Events_Reporting_System_VAERS_Database_Interim_Results_and_Analysis", "https://pubmed.ncbi.nlm.nih.gov/16689555/", "https://reitschuster.de/post/exklusiv-umfrage-zeigt-wie-haeufig-starke-impfnebenwirkungen-wirklich-sind/", "https://respekt.plus/2021/10/08/schreiben-an-die-med-uni-innsbruck-teil-3/", "https://swprs.org/covid-vaccines-the-next-vioxx/", "#excess-mortality-during-vaccination-campaigns", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://swprs.org/israel-why-is-all-cause-mortality-increasing/", "https://dailysceptic.org/2022/02/09/why-the-healthy-vaccinee-effect-is-a-myth-and-cannot-explain-the-spikes-in-deaths-at-the-time-of-the-vaccine-rollout/", "https://dailysceptic.org/2022/01/20/sajid-javid-must-halt-child-vaccination-immediately-and-investigate-the-cause-of-the-spike-in-child-deaths/", "https://dailysceptic.org/2022/01/25/why-are-deaths-in-europe-soaring-when-covid-isnt-to-blame/", "https://coronakriseblog.wordpress.com/2022/02/09/corona-unbeachtete-korrelationen-und-scheinkorrelationen/", "https://swprs.org/die-schweiz-im-corona-delirium/", "https://dailysceptic.org/2022/01/13/covid-vaccines-one-death-per-8000-people-in-iceland-serious-adverse-events-800-fold-higher-than-with-earlier-vaccine-withdrawn-on-safety-grounds/", "https://hatchardreport.com/relationship-between-covid-19-vaccination-and-all-cause-mortality/", "https://nickholt.substack.com/p/covid-19-vaccine-roll-out-and-excess", "https://www.usmortality.com/", "https://i0.wp.com/swprs.org/wp-content/uploads/2022/02/british-male-teens-deaths.png?ssl=1", "#case-reports", "https://t.me/s/covidvaccineinjuries/", "https://openvaers.com/openvaers", "https://www.direktdemokratisch.jetzt/impfopfer-archiv/", "https://www.sorryantivaxxer.com/", "#video-cardiac-arrests-in-athletes", "https://swprs.org/covid-vaccine-athlete-collapses-and-deaths/", "#video-how-covid-vaccines-got-approved", "https://childrenshealthdefense.org/defender/how-fda-approved-pfizer-covid-vaccine-warp-speed/", "#video-the-testimonies-project", "https://www.vaxtestimonies.org/en/", "#related", "https://swprs.org/vaccines-successes-and-controversies/", "#see-also", "https://swprs.org/face-masks-evidence/", "https://swprs.org/studies-on-covid-19-lethality/", "https://swprs.org/covid19-facts/", "https://t.me/share/url?url=https://swprs.org/covid-vaccine-adverse-events/", "https://twitter.com/intent/tweet?url=https://swprs.org/covid-vaccine-adverse-events/", "https://www.facebook.com/share.php?u=https://swprs.org/covid-vaccine-adverse-events/"], "authors": [], "publish_date": null}