{"result_id": "282034", "URL": "https://talknetwork.com/2017-02-01-vaccine-fraud-the-undeniable-truth-exposed.html", "timestamp": "2023-04-25 17:13:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "vaccines,gardasil,mmr,vaccines", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://talknetwork.com/2017-02-01-vaccine-fraud-the-undeniable-truth-exposed.html", "encoding": "UTF-8"}, "image": null, "domain": "talknetwork.com", "title": "Vaccine fraud – The undeniable truth exposed", "cleaned_text": "In 2015, 91.5 percent of all children in the United States between the ages of 19 and 35 months received the MMR vaccine, while 84.2 percent were immunized for diphtheria, tetanus and pertussis. Meanwhile, many natural health experts continue to sound the alarm on the dangers of vaccines and their toxic additives – and maintain that they are neither effective nor safe.\n\nChemical violence and vaccine fraud being played on the American people. On the next NaturalNews Talk Hour, Jonathan Landsman and Suzanne Humphries, MD – board-certified internist and vaccine safety expert – will talk about the shocking consequences of vaccinations. Drawing on her extensive medical background (and experience), Dr. Humphries will clarify many vaccine misconceptions, expose the unspoken flaw of ‘herd immunity,’ and show us how to truly protect our health. (don’t miss this special show)\n\nTo hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts!\n\nAccording to Dr. Humphries, medical schools don’t educate doctors about the contents, dangers, effectiveness or necessity of vaccines – while the general public continues to be misinformed, frightened and “tricked” into getting vaccinated. With this level of misinformation on both sides, says Dr. Humphries, “informed consent” becomes impossible.\n\nMeanwhile, comprehensive scientific studies on the safety of vaccines are sorely lacking. In fact, no placebo-controlled safety study of the MMR vaccine exploring possible neurological and autoimmune outcomes has ever been done in humans. Making matters worse, some studies have used “false placebos” – in which another vaccine is utilized as the control placebo (not the sterile solution that would constitute a true placebo). And, shockingly, most vaccines have never even undergone a cancer risk assessment of any kind.\n\nQuite frankly, the lack of safety studies – and the use of untested vaccines – is deeply troubling and one that Dr. Humphries says violates the Nuremberg Code of “informed and unambiguous” consent.\n\nTo hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts.\n\nVaccines not only rob people of the ability to develop their own natural immunity, says Dr. Humphries, but the very act of being vaccinated can alter the immune system so that the individual becomes more susceptible to other infectious diseases.\n\nIn addition, vaccinations can cause repeated, chronic inflammation – triggering allergies and autoimmune problems.\n\nVaccinations can be particularly dangerous in infancy, because the process disrupts the “anti-inflammatory phenotype” that is essential to proper development of the immune system. Being vaccinated “derails” this system, forcing an unnatural and untimely immune response, reports Dr. Humphries.\n\nFinally, Dr. Humphries points to the constant tinkering with vaccines as proof of their inefficacy. “Now we have ‘new and improved’ Gardasil… and a new pertussis vaccine. (But) …no vaccine has ever been shown to do what it’s predicted to do.”\n\nDon’t become a victim of this form of ‘chemical violence,’ be sure to join us for an enlightening and empowering show about our health.\n\nThis week’s guest: Suzanne Humphries, M.D., board-certified in internal medicine and an expert on vaccine safety issues\n\nDiscover the truth about vaccines – including the shocking reality about their effectiveness – Sun. Feb 5\n\nSuzanne Humphries, MD holds certification from the American Board of Internal Medicine, and specializes in internal medicine and nephrology. A conventionally-trained doctor as well as a holistic health consultant, she brings her own experiences and research to bear on the study of vaccines and their consequences.\n\nDr. Humphries became interested in vaccine injuries when she witnessed them among her own patients – and saw them met with indifference by mainstream medicine. She is the author of Dissolving Illusions: Diseases, Vaccines and the Forgotten History and Rising from the Dead.\n\nTo hear this FREE show – visit http://www.naturalhealth365.com/free-shows and enter your email address for show details plus some great gifts.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2017/02/vaccines.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.naturalhealth365.com/free-shows", "http://www.naturalhealth365.com/free-shows", "http://www.naturalhealth365.com/free-shows", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2017-02-01-vaccine-fraud-the-undeniable-truth-exposed.html&linkname=Vaccine%20fraud%20%E2%80%93%20The%20undeniable%20truth%20exposed", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2017-02-01T23:21:05+00:00"}