{"result_id": "282004", "URL": "https://www.talknetwork.com/2019-01-22-left-wing-media-run-by-actual-demon-possessed-anti-human-evil-entities-watch-this-stunning-mini-documentary.html", "timestamp": "2023-04-25 17:13:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,christianity,christians,church,death,demonic,demonic possession,demons,destruction,evil,genocide,god,humanity,humans,journalists,news media,possession,satan,satanism,twisted", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2019-01-22-left-wing-media-run-by-actual-demon-possessed-anti-human-evil-entities-watch-this-stunning-mini-documentary.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Left-wing media run by actual demon-possessed anti-human EVIL entities… watch this stunning mini-documentary", "cleaned_text": "If you’re wondering why the left-wing media is infused with absolute evil, a seething, anti-human hatred of life, truth, healthy babies and human liberty, the answer is far larger than what you might have supposed. An increasing number of so-called “journalists” working for the anti-human media are actually demon-possessed entities working to destroy human life, Christianity and belief in God.\n\nBeyond a mere political war, we are engaged in a spiritual war of cosmic importance, as pure evil has taken over nearly the entire left-wing media, government bureaucracies, universities and public schools, Hollywood and the pop culture media, and even the ranks of “science” and medicine.\n\n“They first cropped up seemingly out of nowhere about six years ago, adorned in black capes with curved devil horns affixed to their heads, holding posters and black American flags as they shouted ‘Hail, Satan’ on the steps of government institutions,” reports the UK Daily Mail in a story documenting the rise of Satanism in America.\n\n“And they were growing, exponentially. Since The Satanic Temple’s founding in 2012, the organization has increased from a handful of members to tens of thousands, with chapters all over the US and the globe, from Stockholm to London and Los Angeles to Texas.”\n\nSatanism is on the rise in the United States and around the world. Human-looking entities that were born as humans and previously possessed human souls are now entirely possessed by demonic spirits working to serve their dark lord Satan.\n\n“The next thing I came to understand was they weren’t pretending to be Satanists to make a political point. They were Satanists,” says one observer quoted in the story. Read how Satanists define their movement:\n\nTo us, Satan is the symbol that best suits the nature of we who are carnal by birth – people who feel no battles raging between our thoughts and feelings, we who do not embrace the concept of a soul imprisoned in a body. He represents pride, liberty, and individualism – qualities often defined as Evil by those who worship external deities, who feel there is a war between their minds and emotions.\n\nSatan worshipers are now running the pop culture of America, where everything from Superbowl half-time shows to star-studded music videos now features overt Satanic imagery and symbolism as a form of mass indoctrination. These Satanists relish evil and the destruction of all that is good.\n\nHow to spot a demon in human form – watch the powerful video mini-documentary exclusively on Brighteon.com\n\nHow can you tell the difference between an actual human being with a divine soul vs. a human vessel that has been occupied and taken over by a demonic dark spirit?\n\nIn the following mini-documentary, I explain how you can “spot a demon” in human form.\n\nSome of the more obvious signs are that demons in human form relish the thought of murdering babies (abortion), injecting people with vaccines made from aborted human babies (aborted human fetal tissue is one of the primary ingredients used in modern vaccines), attacking Christians and seeking harm upon children through toxic medicine, physical violence (the recent Covington Catholic School hoax) and mental indoctrination.\n\nThe goal of the Satanists is to attack all human vessels and possess them with demonic spirits by driving out divine human souls.\n\nThis war is already well under way. Many of the “people” you meet in society today are no longer humans on the inside. They are literal demon souls that have possessed and now operate human bodies like biological puppets. These demonic entities appear human, but answer only to Satan. They operate at the highest levels of society, having infiltrated politics, media, entertainment, finance, science, medicine and even organized religion.\n\nWhen you see people celebrating abortion and “shouting” praise for the murder of unborn babies, rest assured you are looking at a demon spirit which has possessed and taken over a human body. They are anti-human for the simple reason that they are not human themselves. Their goal is the complete destruction of humankind and all divine life on planet Earth.\n\nWatch my truly horrifying mini-documentary here to learn more:\n\nSee more stunning Counterthink videos at Counterthink.com.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2019/01/Satan-Demon-Hell.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-6616577/The-rise-Satanism-America-members-dont-ACTUALLY-worship-devil-push-activism.html", "http://Brighteon.com/5992042412001", "http://Counterthink.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2019-01-22-left-wing-media-run-by-actual-demon-possessed-anti-human-evil-entities-watch-this-stunning-mini-documentary.html&linkname=Left-wing%20media%20run%20by%20actual%20demon-possessed%20anti-human%20EVIL%20entities%E2%80%A6%20watch%20this%20stunning%20mini-documentary", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2019-01-22T11:52:03+00:00"}