{"result_id": "282042", "URL": "https://www.talknetwork.com/2018-10-24-deep-state-rolls-out-staged-bomb-attack-on-cnn-headquarters.html", "timestamp": "2023-04-25 17:13:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,alex jones,cnn,deep state,elections,false-flag,globalism,infowars,mid-terms,pipe bombs,terrorism,violence", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-10-24-deep-state-rolls-out-staged-bomb-attack-on-cnn-headquarters.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Deep state rolls out staged “bomb” attack on CNN headquarters, just as Mike Adams and Alex Jones publicly predicted on multiple video broadcasts", "cleaned_text": "Exactly as publicly predicted by myself and Alex Jones, the anti-American globalists are now running pipe bombs false flags against CNN. This is not merely similar to what we publicly predicted would take place before the mid-term elections; it is exactly what we publicly predicted would take place. We even named CNN as the most likely target to be selected by the globalist operatives running the operation.\n\n“CNN’s New York Headquarters Evacuated After Suspicious Package Found,” reports Mediaite.com. Similar “pipe bombs” were also reportedly mailed to Barack Obama, Hillary Clinton and George Soros. “The CNN bureau at Columbus Circle in new York City was evacuated Wednesday morning after mailroom workers found a suspicious device,” reports The Gateway Pundit. “The bomb scare comes on the heels of suspected IEDs mailed to the home former President Obama in Washington, D.C. and the New York state homes of former President Clinton Clinton and major Democratic Party donor George Soros this morning.”\n\nA coordinated false flag bombing to be blamed on Trump supporters in order to alter the outcome of the mid-term elections\n\nThis is precisely what I have publicly predicted would take place right before the mid-term elections: A coordinated false flag bombing of the left-wing media and left-wing political leaders. It’s blatantly obvious that the globalist democrats are sending these packages to themselves, knowing the media will blame Trump supporters, Alex Jones, conservatives and gun owners.\n\nWhat you are witnessing is the very definition of a media-run false flag event, where the media itself gets targeted so that the same media can hysterically report that it’s under attack because President Trump is whipping up “hate” against the media.\n\nYou can see proof of our predictions below:\n\nNaturalNews.com, August 10, 2018: “Censorship PURGE points to imminent false flag violence before mid-term elections… bigger than 9/11?”\n\nFrom time to time, I join the Alex Jones Show broadcast, often to chime in on food science, nutrition and liberty issues. In multiple broadcasts this year, Alex and I discussed the coming false flag attacks and predicted how they would be false flag attacks to be blamed on Alex Jones.\n\nThe false flag bombings of the media were EASY to predict\n\nThese obvious false flag “pipe bomb” events showcase the stunning desperate of the left-wing media and its globalist controllers. It also reveals that they now believe they are going to lose the mid-term elections, otherwise they would not have invoked this desperate measure.\n\nImportantly, the mailing of these “suspicious packages” is just the very beginning of this false flag rollout. If this narrative gets sufficient traction, the same operatives will likely escalate this to active bombings of CNN or social media tech giants.\n\nIn fact, in my Health Ranger Report podcasts, I have repeatedly predicted that false flag attacks would specifically target CNN. Here are just a few links to hear it for yourself:\n\nPlot to ELIMINATE TRUMP about to be triggered\n\nSee more news at FalseFlag.news.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/10/CNN-Bomb-Woman.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.mediaite.com/tv/breaking-cnns-new-york-headquarters-evacuated-after-suspicious-package-found/", "https://www.thegatewaypundit.com/2018/10/cnn-new-york-city-bureau-evacuated-after-suspicious-device-found/", "https://www.naturalnews.com/2018-08-10-censorship-purge-imminent-false-flag-violence.html", "http://counterthink.com/2018-08-10-censorship-purge-points-to-imminent-false-flag-violence.html", "http://Brighteon.com/5852933806001", "http://falseflag.news", "http://brighteon.com/channel/hrreport", "https://www.brighteon.com/5821684760001", "https://www.brighteon.com/5813873328001", "https://www.brighteon.com/5815976775001", "http://FalseFlag.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-10-24-deep-state-rolls-out-staged-bomb-attack-on-cnn-headquarters.html&linkname=Deep%20state%20rolls%20out%20staged%20%E2%80%9Cbomb%E2%80%9D%20attack%20on%20CNN%20headquarters%2C%20just%20as%20Mike%20Adams%20and%20Alex%20Jones%20publicly%20predicted%20on%20multiple%20video%20broadcasts", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-10-24T11:01:35+00:00"}