{"result_id": "282001", "URL": "https://www.talknetwork.com/2018-10-08-the-carbonaro-effect-reveals-fake-news-media-junk-science.html", "timestamp": "2023-04-25 17:13:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,brainwashing,carbonaro effect,fake news,fake science,hidden camera,magic,michael carbonaro,social engineering", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-10-08-the-carbonaro-effect-reveals-fake-news-media-junk-science.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "The Carbonaro Effect: Magician reveals how fake news media indoctrinates the gullible masses with junk science", "cleaned_text": "Although this is not the intention of the show, a fascinating hidden camera magic TV show called The Carbonaro Effect inadvertently reveals how the fake news media indoctrinates the gullible masses into believing really big lies.\n\nThe Carbonaro Effect is syndicated by TruTV, and it features a talented young magician named Michael Carbonaro. You can watch some clips from his show at this link. It has recently been picked up by Netflix, so you can also watch episodes there.\n\nUnlike most “magic” shows where talented magicians perform magic in front of people who fully expect to be dazzled by apparent magic, Michael Carbonaro performs magic that’s presented as “normal” reality. In other words, he performs astonishing feats of sleight of hand, but then acts surprised when observers express astonishment at what they just witnessed. In most of his bits, he tries to convince the observers that what they just witnessed was completely normal (and even commonplace).\n\nHe accomplishes this through the application of social engineering strategies.\n\nHow “social engineering” achieves mind control for the gullible masses\n\n“Social engineering” describes the application of verbal strategies designed to invoke the innate social conformity desires of sheeple (i.e. people who don’t think for themselves but who want to fit in with the crowd). Nearly all people are actually sheeple. Very few individuals are willing to question a “consensus” put forth by others, even if that consensus is obviously false or violates the laws of physics.\n\nFor example, consider how many people are absolutely convinced that flu shots always work and are backed by exhaustive scientific trials, even when flu shot insert sheets openly admit the vaccines have been subject to no clinical trials whatsoever and aren’t backed by any clinical evidence of efficacy.\n\nAs revealed in this Natural News investigation, for example, the Flulaval vaccine insert sheet admits there are “no controlled trials demonstrating a decrease in influenza.” Yet people believe flu shots work because they are told they work by a “consensus” of other people who have been tricked into believing a falsehood.\n\nExploiting this psychological phenomenon, Michael Carbonaro pulls off apparent magical feats (levitation of objects, “compressing” glass bottles, shrinking dogs to one inch thick, etc.) and then explains to the observer that this is completely normal and probably based on some really cool science.\n\nCarbonaro then explains how it works by spewing science-sounding babble, often citing, “negative ions” or “high altitude packaging” or “memory fibers” or whatever science-sounding explanation comes to mind.\n\nHilariously, the people always nod their head in agreement, as if the “negative ions” explains levitating objects. They buy the bulls##t!\n\nWatch my full analysis of Michael Carbonaro, social engineering and fake news. I’ve posted this one-hour video analysis that gets deep into the explanation of how “reality” is shaped by fake news institutions to make nearly everyone believe utterly false things:\n\nCarbonaro inadvertently reveals how the fake news media sells its “big lies” to the gullible public\n\nThe “Carbonaro Effect” reveals exactly how the New York Times, Washington Post and CNN push totally fake news narratives like the “Russians stole the election” nonsense. It’s also how the LGBT community pushes its hilarious fake science that claims babies are “born genderless” and then are randomly “assigned” a gender at birth. This also explains how LGBT groups are now pushing the total fake science narrative that claims men can get pregnant, men have periods and men needs tampons in restrooms on college campi.\n\nIt’s all rooted in totally fake science that’s reinforced by social consensus. If enough people appear to agree with something — even if that thing violates the laws of physics or biology — most “sheeple” will fall right into line and believe it. If you walk around a college campus and scream, “The Earth is flat!” you will be chided as a loon. But if you say, “Men can magically change into women,” you will be embraced and probably given some sort of award.\n\nOn his show, Michael Carbonaro gets people to believe things that are impossible, such as witnessing mummified Egyptian cats springing to life, or fitting 20 hamburgers and a large drink inside a small paper bag that gets compressed to less than an inch thick. Yet despite the impossibility of what they are witnessing, many of the observers featured in the show readily accept that what they are seeing is REAL.\n\nIn another episode, Carbonaro actually convinces a small crowd of people that a living duck is actually an animatronic robot. Yes, they believe they are watching a robotic duck as it walks around, scratches its feathers and reacts to the world. (As a side note, we disagree with Carbonaro’s abuse of animals for his tricks. Through some of his illusions, he confines animals in very small spaces, or bends their necks sideways like he did for the duck illusion. Hopefully he will think twice about using animals in future illusions…)\n\nThis is how the “global warming” BIG LIE is pushed\n\nNow you can clearly see how the global warming / climate change “big lie” is pushed. It’s rooted in utter scientific nonsense such as the deranged assertion that “carbon dioxide is a pollutant” that harms the planet. In reality, of course, carbon dioxide is the single most important life-giving nutrient for plants, and as CO2 rises in the atmosphere, rainforests, flowers and food crops flourish. This is irrefutable science to anyone who understands photosynthesis.\n\nYet, through social engineering fake news tactics, the entire media establishment has managed to convince most people that the most important “greening” nutrient in the world — CO2 — is dangerous and deadly and must be eliminated from the atmosphere.\n\nIf CO2 were eliminated from the atmosphere, by the way, nearly all life on planet Earth would collapse, including human life. The entire global ecosystem would implode and die.\n\nYet through the use of social engineering a fake science “sleight of mind” tactics, people are readily indoctrinated to believe exactly the opposite… that the planet will be destroyed if we don’t eliminate all carbon dioxide! The lunatics running the climate change hoax have actually declared “war on carbon,” even though carbon is the element of life out of which all humans, animals, plants and insects are built. A war on carbon is a war on humanity, since every human being is made from carbon.\n\nInterestingly, Michael Carbonaro himself may not even be aware that he may have been placed under the influence of the “Carbonaro Effect” when it comes to fake science narratives like climate change or flu shots. In exactly the same way Carbonaro is performing “sleight of mind” magic on his audience, the globalist-run media establishment is carrying out much more sinister sleight of mind magic on everybody else, including Michael Carbonaro.\n\nIt’s one thing to master the art of fooling others. It’s an entirely different level of mastery to realize when you’re being fooled yourself. The climate change scam is one of the greatest “mentalist” illusions ever pulled off in the history of human civilization.\n\nSome of the “really big lies” that are routinely pushed by establishment science and media include:\n• Scientific materialism as the only phenomenon that explains the nature of reality.\n• The complete denial of the existence of consciousness in animals.\n• The absurd but widespread denial among doctors and the FDA that nutrition can prevent disease. (For starters, it is a simple scientific fact that vitamin C cures scurvy and vitamin D cures rickets, but no one is allowed to say such things without being derided as a heretic.)\n• The false assertion that the cancer industry wants to cure cancer rather than profit from its continuation.\n• The decades-long NASA cover-up about the existence of microbial life on Mars, proven by mass spec tests carried by the 1976 Viking lander. Dr. Gil Levin should have gone down in history alongside Einstein, but today nobody knows his name.\n• The complete Big Pharma hoax that claims every living person needs to take statin drugs in order to prevent cardiovascular disease. This is a complete hoax that has already fallen apart, much like the “Hormone Replacement Therapy” fiasco that ended up giving millions of women cancer.\n\nTo see more examples of the “big lies” getting exposed by independent journalism, read these websites:\n\nAnd check out the Carbonaro Effect on TruTV or Netflix. It’s really an eye-opener.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/10/Michael-Carbonaro.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.trutv.com/shows/the-carbonaro-effect/index.html", "https://www.trutv.com/shows/the-carbonaro-effect/index.html#clips", "http://flushot.news", "https://www.naturalnews.com/048422_flu_shot_scientific_fraud_controlled_trials.html", "http://Brighteon.com/5846070285001", "http://washingtonposted.news", "http://CNNsofake.news", "http://www.climate.news", "https://www.naturalnews.com/2018-09-06-dr-gil-levins-nasa-experiment-found-proof-of-life-on-mars-in-1976.html", "http://Science.news", "http://Medicine.news", "http://Food.news", "http://Health.news", "http://Climate.news", "http://Pollution.news", "http://Vaccines.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-10-08-the-carbonaro-effect-reveals-fake-news-media-junk-science.html&linkname=The%20Carbonaro%20Effect%3A%20Magician%20reveals%20how%20fake%20news%20media%20indoctrinates%20the%20gullible%20masses%20with%20junk%20science", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-10-08T13:00:08+00:00"}