{"result_id": "282023", "URL": "https://www.talknetwork.com/2018-08-06-environmental-journalists-are-so-stupid-they-dont-even-know-plants-get-carbon-from-carbon-dioxide.html", "timestamp": "2023-04-25 17:13:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,botany,carbon,carbon dioxide,ecology,environ,environmentalists,herbicides,journalism,pesticides,real science,reporters,science", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-08-06-environmental-journalists-are-so-stupid-they-dont-even-know-plants-get-carbon-from-carbon-dioxide.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Environmental journalists are so stupid, they don’t even know plants get carbon from carbon dioxide", "cleaned_text": "While conducting research for a stunning science news story that reveals the total news fakery of Reuters, Common Dreams, AlterNet, Huffington Post and even the UK Guardian, I came to the startling realization that establishment media journalists are scientifically illiterate beyond anything I had imagined.\n\nMany of them have no idea what molecules are made of. Vitamin C, for example, is synthesized by plants out of just three elements: Hydrogen, Oxygen and Carbon. There’s nothing else in vitamin C other than these three elements.\n\nHere’s the vitamin C molecule mapped out, in case you’re curious:\n\nIn case you’re not a chemist, the “H” stands for Hydrogen, the “O” stands for Oxygen, and all the intersections of the black lines are Carbon elements. (Carbon is so common in organic chemistry that it’s not even labeled.) The double lines are double bonds.\n\nPlants, of course, synthesize vitamin C out of H, O and C. This is why citrus fruit contains vitamin C. It’s made by the plant. Plants also make thousands of other phytonutrients out of carbon dioxide, sunlight and water, which is why plants are so medicinal and nutritious. (Humans can’t make their own vitamin C, but dogs can, which is why dogs don’t need to eat oranges to prevent scurvy.)\n\nSo where do plants (like orange trees) get the carbon to make vitamin C?\n\nBelieve it or not, almost nobody in the realm of mainstream journalism seems to know. It’s a big mystery to them. They’re totally clueless.\n\nIn reality, nearly all the carbon used by plants comes from the carbon dioxide in the atmosphere. Without carbon dioxide, nearly all plant life would die, the food web would collapse and human civilization would be made extinct.\n\nYet insane, deranged “environmental” journalists continue to openly argue for the complete elimination of all carbon, waging a “war on carbon” in some sort of ignorant suicide march toward oblivion. If you ask a typical media journalist, “Where do plants get the carbon they need to manufacture leaves, stems, seeds, fruit, bark and other structures?” nearly all journalists will have no idea. That’s because they’ve all been absurdly taught that carbon is a “pollutant,” and so they parrot the lie like the clueless, illiterate morons they are.\n\nThe war on carbon is a war on LIFE\n\nNot surprisingly, scientifically illiterate journalists who call themselves “environmentalists” have declared a “war on carbon.” They are trying to eliminate all carbon from the atmosphere — an act that would turn Earth into a deathscape, with no humans surviving. This is literally what journalists push for because they are stupid beyond comprehension. “Too stupid to even be considered human,” as I explain in my video below, because to be human means you must have some higher form of cognitive function still working.\n\nSee more uncensored Counterthink videos at Brighteon.com/channel/counterthink", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/08/Plant-Water-New-Growth-Seedling-Concept-Life.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2018-08-05-fake-news-exposed-media-attacks-trump-over-pesticides-and-gmos-on-wildlife-refuges.html", "http://carbondioxide.news", "http://Brighteon.com/channel/counterthink", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-08-06-environmental-journalists-are-so-stupid-they-dont-even-know-plants-get-carbon-from-carbon-dioxide.html&linkname=Environmental%20journalists%20are%20so%20stupid%2C%20they%20don%E2%80%99t%20even%20know%20plants%20get%20carbon%20from%20carbon%20dioxide", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-08-06T11:13:02+00:00"}