{"result_id": "282020", "URL": "https://www.talknetwork.com/2018-08-27-you-now-have-a-platform-are-you-posting-to-real-video-yet.html", "timestamp": "2023-04-25 17:13:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,censorship,free speech,freedom,globalists,liberty,monopolists,real video,speech", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-08-27-you-now-have-a-platform-are-you-posting-to-real-video-yet.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "You now have a platform for questioning the establishment: Are you posting to Brighteon.com yet?", "cleaned_text": "Well over 20,000 videos have been posted to Brighteon.com so far, and the site is now serving nearly 5 million video minutes per week. As evil tech censorship accelerates to the point of online fascism, we have the platform that protects free speech and gives you a voice.\n\nIt’s called Brighteon.com, and you can create your own video channel and post there for free. Over 400 new channels are being created there each day. Join at this link to start your own channel.\n\nBrighteon.com protects your freedom to speak, with few restrictions. So far, we’ve only banned videos that blatantly ripped off copyrighted content, doxxed private citizens or promoted Satan worship. We’ve also been forced to restrict certain videos from certain countries due to local laws (such as laws against blasphemy). Aside from that, Brighteon.com now hosts tens of thousands of videos on a vast array of topics, covering a broad spectrum of online free speech.\n• No tracking of end users / no “profiling” like Google and YouTube\n• Videos are easily embedded into web pages, shared online or linked to\n• 100% free from globalist control; no investors, no sellouts, no\n\nBecause of the Brighteon.com commitment to protecting speech — including speech that some might find “offensive” — it’s becoming the destination for video debates on controversial topics, including geoengineering, vaccines, censorship, artificial intelligence, transgenderism and natural medicine.\n\nWe have now entered the “Dark Ages” of internet censorship\n\nWe are all right now living through the “Dark Ages” of internet censorship. Shadow banning and outright de-platforming have driven nearly all independent websites to near-zero referral traffic from search engines and social media. The tech monopolists have declared war on human freedom and human knowledge, and they are committed to stamping out all speech that challenges the corrupt status quo. (What Google, Facebook, YouTube and Twitter are doing to free speech today is far worse than anything Adolf Hitler did to censor information.)\n\nAlarmingly, Leftists are cheering the march of online fascism, believing they are somehow ferreting out “hate speech” when, in reality, they are constructing an online fascism mental prison for themselves. (Beware those who cheer for censorship or book burning… no good can come of it.)\n\nIn today’s censorship-heavy tech ecosystem, it’s rare to find any technology platform that has the courage to tolerate actual free speech. Intolerant libtards run cyber-bullying campaigns against all the platforms, screaming, “How dare you host a video on _____.” (Insert your favorite politically incorrect topic.)\n\nBut at Brighteon.com, we believe public debate and free speech is worth protecting… even if we don’t agree with every point of view expressed on our platform.\n\nHere’s a taste of some of the variety you’ll find on Brighteon.com. Be sure to create your own channel by joining here.\n\nHow the cancer industry deceives you with cancer drugs:\n\nSee more than 20,000 other videos at Brighteon.com.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/08/Enlightenment-Freedom-Happy.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/dashboard/requestInvitation", "https://www.brighteon.com/dashboard/requestInvitation", "http://Brighteon.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-08-27-you-now-have-a-platform-are-you-posting-to-real-video-yet.html&linkname=You%20now%20have%20a%20platform%20for%20questioning%20the%20establishment%3A%20Are%20you%20posting%20to%20Brighteon.com%20yet%3F", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-08-27T13:21:00+00:00"}