{"result_id": "282014", "URL": "https://www.talknetwork.com/2018-10-16-team-humanity-is-winning-front-lines-fight-for-human-freedom.html", "timestamp": "2023-04-25 17:13:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,censorship,facebook,fake science,free speech,freedom,globalism,globalists,google,humanity,journalism,liberty,team humanity,tech giants,tyranny", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-10-16-team-humanity-is-winning-front-lines-fight-for-human-freedom.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Team Humanity is WINNING: Mike Adams reports from the front lines of the fight for human freedom", "cleaned_text": "The forces of globalism are in their last, desperate retreat. But they’re fighting like mad to defeat humanity and enslave the human race… and they are fearsome villains who will stop at nothing to maintain their monopoly of power.\n\nThe upcoming mid-term elections are pivotal for the future of our world. A win for Democrats means the end of human freedom and a global descent into authoritarian tyranny, where the tech giants determine what thoughts are allowed to be uttered, and evil government regimes criminalize and execute their political opponents. This is a future run by Google, Facebook, Zuckerberg, Hillary Clinton, Nancy Pelosi and Barack Obama. (If you love Nancy Pelosi, vote Democrat this November.)\n\nA defeat of the Democrats means Team Humanity survives to keep fighting for human freedom. With the U.S. House and Senate remaining in Republican hands, President Trump will replace Jeff Sessions and aggressively pursue criminal indictments of hundreds (if not thousands) of deep state traitors who have conspired with globalists to destroy America from within. The horrific crimes of Hillary Clinton, James Comey and other deep state traitors will be exposed, tech giants will be forced to stop censoring independent media, and the last remaining shreds of credibility for the left-wing fake news media will collapse.\n\nIn many ways, however, we’ve already won. “Team Humanity” is rising, and together, we’ve already exposed the utter lies and deceptions of the corporate-run media, the lawless FBI, the fake science institutions and the evil tech giants. Humanity has awakened, and we now have the knowledge to defeat evil and restore human liberty for generations to come.\n\nSee more human freedom videos at Brighteon.com.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/10/Team-Humanity-Hands-In.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://techgiants.news", "http://freedom.news", "http://Brighteon.com/5849223294001", "http://Brighteon.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-10-16-team-humanity-is-winning-front-lines-fight-for-human-freedom.html&linkname=Team%20Humanity%20is%20WINNING%3A%20Mike%20Adams%20reports%20from%20the%20front%20lines%20of%20the%20fight%20for%20human%20freedom", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-10-16T11:11:55+00:00"}