{"result_id": "282030", "URL": "https://www.talknetwork.com/2018-10-09-message-to-brett-kavanaugh-from-mike-adams-defend-health-freedom.html", "timestamp": "2023-04-25 17:13:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,big pharma,bill of rights,brett kavanaugh,chemotherapy,constitution,dangerous medicine,food freedom,freedom,health freedom,health ranger,liberty,medical police state,mike adams,scotus,supreme court,tyranny,vaccines", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-10-09-message-to-brett-kavanaugh-from-mike-adams-defend-health-freedom.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "A message to Brett Kavanaugh from Mike Adams: Defend our health freedom and food freedom from industry tyrants", "cleaned_text": "With Brett Kavanaugh now confirmed as a U.S. Supreme Court Justice, it’s important to remind him about some crucial issues that matter to us all.\n\nThe Bill of Rights describes individual liberties, but it fails to elucidate protections of medical freedom and food freedom.\n\nOne of the signers of the Declaration of Independence, Benjamin Rush, had pushed for a health freedom amendment in the Bill of Rights, but his efforts did not succeed. No one at the time could have imagined a tyrannical medical regime forcing risky interventions such as chemotherapy or vaccines onto the masses without informed consent.\n\nAs a result, we now live under a system of monopoly medicine and dictatorial food control laws that have seen people arrested and imprisoned in California for merely milking cows and selling the fresh milk to happy customers.\n\nI’ve posted a video appeal to Brett Kavanaugh, congratulating him on his appointment to the U.S. Supreme Court and reminding him that individual liberty must encompass more than First Amendment and Second Amendment rights. The fundamental human right to say “no” to a toxic medical intervention must also be protected. And the right to grow food in your own yard needs to be enshrined in U.S. Supreme Court precedent.\n\nBrett Kavanaugh has a brilliant mind, and he was falsely smeared and slandered by a deep state operation involving Sen. Feinstein, Sen. Booker and a complicit left-wing media spewing carefully crafted fiction. I believe surviving that attempted character assassination attempt has awakened him to the reality of the extreme dangers of dishonest, powerful government. The Brett Kavanaugh who was sworn in yesterday is, I believe, a changed man from the Brett Kavanaugh of just one month ago.\n\nHe has now personally experienced the maliciousness of all-powerful government and how completely innocent people can be framed, accused and smeared without a shred of evidence. Once you experience that, you can never go back to trusting government monopoly power.\n\nRead more news about health freedom at HealthFreedom.news.\n\nSoon we’re also launching a news site covering Kavanaugh’s decisions at Kavanaugh.news.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/10/Brett-Kavanaugh-Sworn-In.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.ushistory.org/Declaration/signers/rush.html", "https://www.naturalnews.com/034892_Benjamin_Rush_medical_freedom_Constitution.html", "http://firstamendment.news", "http://secondamendment.news", "http://Brighteon.com/5846491207001", "http://HealthFreedom.news", "http://Kavanaugh.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-10-09-message-to-brett-kavanaugh-from-mike-adams-defend-health-freedom.html&linkname=A%20message%20to%20Brett%20Kavanaugh%20from%20Mike%20Adams%3A%20Defend%20our%20health%20freedom%20and%20food%20freedom%20from%20industry%20tyrants", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-10-09T11:24:31+00:00"}