{"result_id": "282016", "URL": "https://talknetwork.com/2017-03-30-bulletproof-brain-health-ranger-lecture-reveals-secrets-protect-your-brain-from-aluminum-and-mercury-in-mandatory-vaccines.html", "timestamp": "2023-04-25 17:13:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,aluminum,brain function,bulletproof brain,health ranger,ingredients,lecture,mercury,msg,removal,vaccine ingredients", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://talknetwork.com/2017-03-30-bulletproof-brain-health-ranger-lecture-reveals-secrets-protect-your-brain-from-aluminum-and-mercury-in-mandatory-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "talknetwork.com", "title": "BULLETPROOF BRAIN: Health Ranger lecture reveals secrets of protecting your brain from aluminum and mercury in mandatory vaccines", "cleaned_text": "The medical tyranny of the State is completely out of control, and we have now reached the point where the corrupt vaccine industry has successfully turned government goons into medical rapists who violate the bodies of children and adults with government-mandated injections of toxic heavy metals, aborted fetal tissue, foreign DNA from diseased animals and much more (all those really are ingredients used in vaccines today).\n\nNow, in a medical science public education breakthrough, technology exists to eliminate mercury and aluminum from your body using natural, low-cost substances. Once ingested, these substances follow the laws of physics, chemistry and physiology to rapidly eliminate toxic metals from your body, saving your brain from vaccine damage.\n\nToday, I’m releasing a 45-minute lecture and slide show that reveals exactly what these substances are. I do not sell these substances, by the way, but you can readily find them at health food stores and sometimes even growing wild near streams. As a research scientist with two U.S. government issued patents on the removal of toxic elements from the human body, I am uniquely qualified to understand and explain this technology to help save lives (and brains) from the toxic effects of vaccines. See my U.S. patent on Cesium Eliminator at this link, and see my patent on Heavy Metals Defense at this link.\n\nWatch my full lecture now at the Natural News Summits website (scroll down to see the video lecture).\n\nThis amazing herb combines with aluminum in your blood to allow your kidneys to filter aluminum out of your body\n\nOne of these astonishing natural substances revealed in the video lecture is a wild growing herb — largely considered an “invasive weed” around the world — that unleashes a water-soluble molecule which binds with aluminum in your blood to form hydroxyaluminosilicates.\n\nThese hydroxyaluminosilicates are easily filtered out of your blood by your kidneys, allowing you to urinate out the excess aluminum, removing it from your blood and protecting your brain from all the risks of aluminum exposure, which include Alzheimer’s and dementia.\n\nLearn exactly what this herb is (and where to get it) in my full, free lecture at Natural News Summits.\n\nMercury elimination can also be accelerated through the intake of targeted nutritional supplements that substantially enhance the body’s natural mercury elimination processes.\n\nSome people are nutritionally depleted or genetically predisposed to poor mercury elimination. It is these people who tend to be more easily damaged by vaccines, suffering long-term neurological damage, seizures, comas or autism. The UK government, for example, recently paid out tens of millions of dollars in damage awards to a huge number of families whose children were brain damaged by the GlaxoSmithKline swine flu vaccine.\n\nWhat’s especially empowering to realize is that you can pre-load your body with nutrients that speed the elimination of mercury removal even before you’re forced to take a vaccine shot at gunpoint. When tyrannical government goons demand that you either be injected with their toxic cocktail of poison or lose your job — or even lose your children to the state! — you are sometimes put in a position where you have to take the shot or risk destroying your livelihood. In those situations, there are at least things you can do to dramatically reduce your risk of being seriously harmed by vaccines. Although these strategies can’t reduce your risk to zero, they can offer significant protection from vaccine damage.\n\nThese nutrients are named in my bonus lecture video / slide show found right now at Natural News Summits (scroll down the page for the video).\n\nWhile you’re there, don’t forget to register for the upcoming docu-series The Truth About Vaccines, produced by Ty Bollinger, which reveals the explosive truth about vaccine ingredients, health risks, ethical violations, fraudulent science and lots more.\n\nI’m one of 60 people interviewed for the documentary series, and because I’ve been running an ISO-accredited science lab for more than three years, my own knowledge of vaccine composition, heavy metals contaminants and vaccine health risks.\n\nCheck it all out right now at Natural News Summits. Scroll down to watch the bonus conference video near the bottom of the page.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2017/07/Bulletproof-Brain-1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.google.com/patents/US9526751", "https://www.google.com/patents/US9439939", "http://naturalnewssummits.com", "http://naturalnewssummits.com", "http://www.naturalnews.com/051622_swine_flu_vaccine_brain_damage_GlaxoSmithKline.html", "http://naturalnewssummits.com", "http://go.thetruthaboutvaccines.online/?a_aid=1587332&a_bid=62acb2d5", "http://vaccines.news", "http://naturalnewssummits.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2017-03-30-bulletproof-brain-health-ranger-lecture-reveals-secrets-protect-your-brain-from-aluminum-and-mercury-in-mandatory-vaccines.html&linkname=BULLETPROOF%20BRAIN%3A%20Health%20Ranger%20lecture%20reveals%20secrets%20of%20protecting%20your%20brain%20from%20aluminum%20and%20mercury%20in%20mandatory%20vaccines", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2017-03-30T11:36:04+00:00"}