{"result_id": "282005", "URL": "https://www.talknetwork.com/2018-08-08-horrifying-truth-democrats-promising-win-november.html", "timestamp": "2023-04-25 17:13:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "apple,arts & culture,central banks,civil unrest,climate change,collapse,community,computing & internet,conspiracy,constitution & bill of rights,corporations,corruption,crime,crime,culture & society,currency & debt,current events,cyber warfare,deception,depopulation,donald trump,economic collapse,elections,facebook,fascism,fascism,freedom,fundamental rights,future,genocide,google,government,health freedom,history,human rights,illegal immigration,immigration,jihad,liberty,lies,mainstream media,military-industrial complex,mind control programs,national security,philosophy,police state,policing,political correctness,politics,politics,propaganda,prophecy,scientific dictatorship,slavery,social media,survival,taxes,totalitarianism,trump,twitter,vaccines,war,youtube,authoritarian,communism,democratic party,democrats,elections,elizabeth warren,fiat currency,free market,free speech,freedom,globalism,gun control,ice,illegal aliens,illegal immigration,internet censorship,left cult,midterm elections,mike adams,november,open borders,police,police officers,priority,prisons,private property,socialism,suicide,taxes,traitors,treason,vaccinations", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-08-08-horrifying-truth-democrats-promising-win-november.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "The horrifying truth of what Democrats are promising to do if they win in November – WATCH at Brighteon.com", "cleaned_text": "Mike Adams, the Health Ranger, recently put together a list of the 10 things that Democrats are promising to do if they win the midterm elections this fall – and all of them will lead to the total destruction of our country.\n\nHere’s the list, as revealed in a clip he put together for Brighteon.com:\n\n1) Elizabeth “Fauxcahontas” Warren wants to raise your taxes to 50 percent of your income. “They think it’s bad for you to keep more of your own money,” warns Adams.\n\n2) Democrats want to “open up the borders of the country and flood America with illegal aliens who will be granted the right to vote, and who will also, of course, enjoy all of the entitlements that states like California want to give out to them,” warns Adams, noting that they also want to abolish Immigration and Customs Enforcement (ICE).\n\n“Democrats literally wants anyone who shows up to become an American,” he says. “Why is it that Democrats believe that nobody should have to follow the rules?”\n\n3) Shutting down all of the prisons is another Democrat agenda, presumably to build their own base of voters.\n\n“This is insanity,” says Adams. “As much as we have a lot of prosecutorial abuse within our prison system … by and large, prisons are filled with guilty people. Prisons are created so violent people don’t go running around murdering you and your children.”\n\n4) Democrats want to eliminate all private property and businesses, and convert the country in a socialist “utopia.” They also want to eliminate all profits, as well as the free market system at large.\n\n“This is what Venezuela did, by the way, and check out what happened to them,” explains Adams. “If you think starvation is awesome, vote Democrat this fall.”\n\n5) While we’re at it, let’s get rid of all nations and convert to globalism. This is another plank of the Democratic Party, which hates national sovereignty because it precludes their efforts to control everything and everyone.\n\nThey want “global gun control, global vaccinations, global psychiatric medication for children, global bans on vitamin C, massive cell phone tower radiation, global control of the gold supply, global fiat enslavement,” and so much more, says Adams.\n\n“Globalism is a poison for humanity; but Democrats love globalist ideas,” Adams adds, warning as well about the fake agreements and treaties about climate change that, because Congress won’t approve them, are completely useless.\n\n“They literally hate America,” says Adams about the Democrats.\n\n6) Full authoritarian censorship of the internet is another Democratic plan, including the seizure of domain names.\n\n“There is not a single person on the left who has spoken out against this,” says Adams about the recent pulling of conservative content from YouTube, Facebook, Spotify, and other tech platforms.\n\n“They don’t believe in free speech. They don’t believe in debate,” he adds about the Democratic mindset.\n\n7) President Trump will be thrown into prison if Democrats win – or worse.\n\n“They’re saying that he’s a spy now, and that he’s committing treason,” Adams says.\n\n8) Democrats are eager to go to war with Russia, which means the nukes will start flying if they win.\n\n“They don’t want peace; they want war with Russia,” says Adams about the Left. “Anyone who seeks peace with Russia is called a traitor or a treasonous betrayer of America. When did the Left start loving nukes all of a sudden?”\n\n9) Patriots, Trump supporters, and anyone who doesn’t agree with the leftist agenda will become a target of violence if the Democrats win.\n\n“If you vote for Democrats, you are committing suicide,” warns Adams. “You are voting for the destruction of your life.”\n\n10) Finally, Democrats want to shut down the police because they hate cops, law, order, and common decency.\n\nBe sure to watch the full video at Brighteon.com.\n\n .", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/08/charlottesville-antifa-supremacists.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/5815764742001", "https://www.naturalnews.com/2018-07-05-left-wing-agenda-now-becomes-clear-the-complete-elimination-of-prisons-borders-profits.html", "http://libtards.news", "https://www.brighteon.com/5815764742001", "https://www.brighteon.com/5815764742001", "https://www.naturalnews.com/2018-07-05-left-wing-agenda-now-becomes-clear-the-complete-elimination-of-prisons-borders-profits.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-08-08-horrifying-truth-democrats-promising-win-november.html&linkname=The%20horrifying%20truth%20of%20what%20Democrats%20are%20promising%20to%20do%20if%20they%20win%20in%20November%20%E2%80%93%20WATCH%20at%20Brighteon.com", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-08-08T23:29:21+00:00"}