{"result_id": "282027", "URL": "https://www.talknetwork.com/2019-02-14-microwave-glyphosate-health-ranger-releases-lab-test-results.html", "timestamp": "2023-04-25 17:13:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,chemistry,cwc labs,glyphosate,goodfood,goodhealth,goodscience,health ranger,herbicide,lab testing,lab tests,mass spec,microwave,mike adams,real science,scientific testing", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2019-02-14-microwave-glyphosate-health-ranger-releases-lab-test-results.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Can you microwave away glyphosate? Health Ranger releases surprising results from glyphosate experiment at CWC Labs", "cleaned_text": "Can you microwave away glyphosate? Various rumors across ‘net have proposed many ideas about eliminating glyphosate — a cancer-causing weed killer herbicide — from food or beverages. Some of those ideas include using Apple Cider Vinegar or microwaving your food to destroy the glyphosate molecule. But do these methods really work?\n\nAs CWC Labs is the only independent mass spec laboratory in the world that conducts “open source” glyphosate experiments for the public good, we decided to set up an experiment involving microwaving glyphosate-infused water to see what would happen.\n\nWe recently published results of another experiment that tested the glyphosate removal capabilities of popular water filters. Those findings have been widely shared, and we’ve already decided to expand our testing to a larger selection of water filters.\n\nOur full video on the glyphosate microwaving experiment has now been released (see below), and it shows the surprising results from this seemingly simple experiment. The findings are incredibly surprising and will shock most observers.\n\nTo conduct the experiment, we diluted industrial-strength glyphosate into water to create a concentration solution of 2 ppm (2 ug / ml). This “mother” solution was then poured into 50 ml vials, then microwaved using a 700-watt consumer-grade microwave appliance for various durations of time with the vial lids off. The microwave durations were:\n\nThe resulting water was then analyzed via triple-quad mass spec analysis (LC-MS-MS) to quantitate the remaining glyphosate concentration.\n\nA clear pattern emerged from the experiment, as detailed in the video below.\n\nHere’s the YouTube rendition of this video, at least until YouTube bans the channel (because YouTube and Google are intensely evil and routinely censor independent science in order to protect the profits of Monsanto and Bayer):\n\nShocking results reveal that microwaving glyphosate-contaminated water INCREASES the concentration of glyphosate\n\nAs the video reveals, the longer the water was microwaved, the higher the glyphosate concentration became!\n\nIn this chromatogram, the lower red peak shows the original concentration of glyphosate in the starting water, and the highest red peak shows the resulting concentration of glyphosate, following 4 minutes of microwaving:\n\nIt turns out that microwaving glyphosate-contaminated foods or beverages actually increases the concentration of glyphosate.\n\nThis result is not surprising, knowing the chemistry of glyphosate: (C3H8NO5P)\n\nHere’s how glyphosate looks in a 3D model:\n\nAlmost nobody is testing their products for glyphosate contamination\n\nDespite the extreme toxicity of glyphosate, almost nobody is testing their products for glyphosate contamination. The Health Ranger Store is expanding glyphosate testing to all in-house products and already displays “Glyphosate Testing” certifications on dozens of health products, including organic turmeric extract, non-GMO vitamin C, clean chlorella superfood, colloidal silver mouthwash and much more.\n\nTo support our ongoing mission to conduct important science experiments for the public good, consider purchasing superfoods, nutritional supplements, storable foods and green living products at the Health Ranger Store, where routine tests include heavy metals (ICP-MS), microbiology (e.coli, salmonella, etc.), glyphosate (LC-MS-MS) and an increasing number of pesticide and herbicides. We are using the world’s best science to bring you the world’s cleanest foods and supplements. Our slogan, in fact, is, “Healing the world through clean food.”\n\nAmazon.com and Whole Foods do not conduct glyphosate testing on the products they sell. That’s why Whole Foods products routinely carry glyphosate, a simple, irrefutable fact we are already confirming in our lab.\n\nHow you can help spread the truth about glyphosate\n\nNatural News, CWC Labs and the Health Ranger are carrying out 15 more experiments on glyphosate, publishing all results for free to the public. You can help spread the word about these incredibly important findings that help protect public health by:\n• Posting links to our videos and articles in your own blogs, videos or articles\n\nWe thank you for your support! There’s a whole lot more fascinating science yet to come… (you’ll be surprised what we’re testing next…)\n\nWhere to learn more about glyphosate science\n\nGet frequent news updates on glyphosate at Glyphosate.news.\n\nRead about organophosphates and other toxic pesticides at Pesticides.news.\n\nView all Natural News channel videos at this link on Brighteon.com.\n\nHear Health Ranger podcasts on science, culture, economics and philosophy at HealthRangerReport.com. (Warning: Politically incorrect content that may trigger weak-minded snowflakes.)\n\nStay up-to-date on Health Ranger science experiments and published results at HealthRangerScience.com.\n\nIf you’re interested in the results of the glyphosate water filter lab tests, you can watch that video here:", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2019/02/Glyphosate-microwave-lab-test-cwc-labs.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/_AUaIqtdlO0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/_AUaIqtdlO0?feature=oembed"}], "links": ["http://glyphosate.news", "http://cwclabs.com", "http://glyphosate.news/2019-02-12-glyphosate-water-filter-lab-test-results-released-by-natural-news.html", "http://Brighteon.com/5999307007001", "http://evilbayer.com", "http://healthrangerstore.com", "https://www.healthrangerstore.com/products/organic-turmeric-gold-2oz", "https://www.healthrangerstore.com/products/health-rangers-nutrition-rescue-non-gmo-vitamin-c-60-caps-600mg-each", "https://www.healthrangerstore.com/collections/supplements-2/products/clean-chlorella-200mg-400-tablets", "https://www.healthrangerstore.com/collections/colloidal-silver-mouthwash", "https://www.brighteon.com/5999307007001", "http://Glyphosate.news", "http://Glyphosate.news", "http://Pesticides.news", "https://www.brighteon.com/channel/naturalnews", "http://HealthRangerReport.com", "http://HealthRangerScience.com", "http://CWClabs.com", "http://Brighteon.com/6001296356001", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2019-02-14-microwave-glyphosate-health-ranger-releases-lab-test-results.html&linkname=Can%20you%20microwave%20away%20glyphosate%3F%20Health%20Ranger%20releases%20surprising%20results%20from%20glyphosate%20experiment%20at%20CWC%20Labs", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2019-02-14T12:33:30+00:00"}