{"result_id": "282002", "URL": "https://www.talknetwork.com/2018-11-01-health-ranger-describes-the-universal-solution-to-hate-speech-tribalism-censorship-racism-and-violence.html", "timestamp": "2023-04-25 17:13:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,censorship,consciousness,free speech,free will,freedom,god,hate speech,human beings,liberty,peace,races,racism,religion,spirituality,tribalism,violence", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-11-01-health-ranger-describes-the-universal-solution-to-hate-speech-tribalism-censorship-racism-and-violence.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Health Ranger describes the universal solution to hate speech, tribalism, censorship, racism and violence", "cleaned_text": "There is a universal solution for ending “hate speech,” tribalism, racism and violent rhetoric while protecting free speech, but the solution requires a fundamental shift in the way we think about conscious beings.\n\nWith all the censorship that’s now targeting alternative voices and platforms, many dishonest people on the political Left are claiming that free speech is to blame for hateful rhetoric. In truth, Leftists are themselves the worst bigots of all when they fail to recognize the existence of human consciousness which gives rise to free will and the underlying principles of individual liberty. By denying the existence of the human soul, the “dehumanize” everyone and reduce every living, conscious person to an assumed automaton with no innate human rights or human dignity.\n\nThe solution to solving tribalism and hate speech is not found in censoring specific voices but in uplifting those who are ignorant so that they recognize the existence of consciousness in others… and especially in those who may appear different from themselves. Racism is irrational fear of those who appear different on the outside, even when all conscious beings are made of the same stuff on the inside.\n\nWhen I recently said that “Jews have a right to exist,” the extreme hatred and threats directed against me underscored the root of the problem in our world: Extreme ignorance, dissociation and fear of those who appear to be different (in their skin color, religion, race, sexual orientation, etc.). But such fears are born solely out of ignorance, which means they can be resolved through education and knowledge. Yet it is the evil tech giants who are spearheading the throttling of human knowledge through extreme censorship that targets the political enemies of the Left, further exacerbating tribalism and the demand for political conformity via authoritarianism.\n\nThus, Google, Facebook, YouTube and Twitter are actually escalating ignorance, violence and hatred even as they absurdly claim to be silencing it. Unless this is reversed, things will continue to spiral toward extreme hatred, to the point where the number of physical (kinetic) attacks will skyrocket, even while those who push the violence claim to be calling for peace.\n\nWatch my full video statement for further details on all this, including the real answer to hate speech, tribalism, racism and violence:\n\nSee more Counterthink videos at Brighteon.com/channel/counterthink", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/11/Consciousness-Against-Hate.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://censorship.news", "http://techgiants.news", "http://Brighteon.com/5856112611001", "http://Brighteon.com/channel/counterthink", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-11-01-health-ranger-describes-the-universal-solution-to-hate-speech-tribalism-censorship-racism-and-violence.html&linkname=Health%20Ranger%20describes%20the%20universal%20solution%20to%20hate%20speech%2C%20tribalism%2C%20censorship%2C%20racism%20and%20violence", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-11-01T09:58:25+00:00"}