{"result_id": "282043", "URL": "https://www.talknetwork.com/2017-07-05-egyptian-study-confirms-autism-is-caused-by-mercury-in-vaccines-video.html", "timestamp": "2023-04-25 17:13:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "collapse,corporations,deception,harmful medicine,health,health freedom,human rights,liberty,medicine,vaccines,autism,deception,egyptian,heavy metals,medicine,mercury,study,toxic,vaccines", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2017-07-05-egyptian-study-confirms-autism-is-caused-by-mercury-in-vaccines-video.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "Egyptian study links mercury exposure to autism symptoms; mercury in vaccines remains an exposure vector for children (Video) (CORRECTION AND UPDATE)", "cleaned_text": "Editor’s note: After an internal review of this post, we have determined the author reached an unjustified conclusion about the Egyptian study. While the study did established an observed link between mercury exposure and autism symptoms, and while mercury-containing vaccines are one vector that can expose children to mercury (dental amalgams being another primary vector), the Egyptian study did not explicitly state or prove that mercury from vaccines caused autism, even though that explanation is a reasonable and factually-supported explanation given the fact that mercury is still found in vaccines administered to children. See this Natural News article for proof from the government of California. The Egyptian study, however, did not state that conclusion.\n\nThus, the correct title for this article probably should have been, “Egyptian study links mercury exposure to autism symptoms; mercury in vaccines remains an exposure vector for children,” which is what it has now been updated to reflect. The original title was “Egyptian study confirms autism is caused by mercury in vaccines,” which is an incorrect conclusion. We are including both the original and updated title here in the interests of full transparency. We regret the error. The original story appears below, uncorrected, but should of course be read within the context of this editor’s note which clarifies the issues covered by the study. Notably, the Egyptian study most certainly lends credence to the connection between mercury and autism, regardless of the exposure routes.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2017/10/Vaccine-Child-Doctor-Flu-Needle-Pharmacy-Defense-e1495178415647.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/052142_flu_shots_mercury_in_vaccines_California_child_safety_laws.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2017-07-05-egyptian-study-confirms-autism-is-caused-by-mercury-in-vaccines-video.html&linkname=Egyptian%20study%20links%20mercury%20exposure%20to%20autism%20symptoms%3B%20mercury%20in%20vaccines%20remains%20an%20exposure%20vector%20for%20children%20%28Video%29%20%28CORRECTION%20AND%20UPDATE%29", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2017-07-05T12:07:10+00:00"}