{"result_id": "282012", "URL": "https://www.talknetwork.com/2018-04-09-california-state-senator-who-pushed-vaccine-mandate-now-seeks-to-criminalize-fake-news.html", "timestamp": "2023-04-25 17:13:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,authoritarianism,badmedicine,badscience,california,fake news,first amendment,free speech,richard pan,social media,thought crimes,tyranny", "favicon": "wp-content/themes/multinews-child/images/favicon.ico", "canonical": "https://www.talknetwork.com/2018-04-09-california-state-senator-who-pushed-vaccine-mandate-now-seeks-to-criminalize-fake-news.html", "encoding": "UTF-8"}, "image": null, "domain": "www.talknetwork.com", "title": "California state senator who pushed vaccine mandate now seeks to CRIMINALIZE “fake news” about medicine, politics and government", "cleaned_text": "In the latest stunning assault on the freedom to think, California state senator Richard Pan — known as the “Mercury Joker” super villain for pushing mandatory vaccines into law via SB 277 — now wants to criminalize all bloggers and independent journalists who dare question the official narratives on vaccines, medicine, politics and government.\n\nThe quest for absolute authoritarian control never seems to end with these left-wing zealots. And California looks more and more like North Korea with each new law. (Is Richard Pan the long-lost cousin of Kim Jong-Un?)\n\nEver seeking to limit public debate, crush independent journalism and control all speech, Richard Pan has a new thought control bill entitled, “SB1424 Internet: social media: false information: strategic plan.” While the title seems to target social media websites, the language of the bill clearly applies the law to all blogs, news websites, video sites and podcasts. From the proposed law itself:\n\nAs used in this section, “social media” means an electronic service or account, or electronic content, including, but not limited to, videos, still photographs, blogs, video blogs, podcasts, instant and text messages, email, online services or accounts, or Internet Web site profiles or locations.\n\n“It’s a free speech killer,” writes independent journalist Jon Rappoport for NoMoreFakeNews.com. “If it passes, agencies of the California government will develop numerous regulations for enforcement, including penalties for ‘speech criminals.'”\n\n1984 has arrived: Independent journalists are the new “speech criminals” in California\n\nCalifornia is rapidly collapsing into an authoritarian medical police state run by insane, power-hungry left-wing bureaucrats who fleece their own citizens while handing out hundreds of billions of dollars worth of entitlements to illegals in order to win votes and stay in power. As Wayne Allen Root writes:\n\nWhile California accounts for 12% of America’s population, it accounts for one third of America’s welfare checks. California leads the country in food stamp use. California has more people on welfare than most countries around the world… California is now home to 22% of this nation’s homeless population… California leads the nation in debt. Total state and local debt is almost $1.5 trillion… The income taxes, business taxes, sales taxes and gas taxes are all the highest in the nation. Why do you think that is? To pay the enormous costs of illegal immigration. To pay for the education costs, healthcare costs, police, courts, lawyers, prisons, and hundreds of different welfare programs for millions of California’s illegal aliens and struggling legal immigrants too.\n\nNow, to make sure that no one criticizes the deranged lunatics running Collapsifornia — with forced vaccine injections, confiscatory taxes and endless state-run propaganda — Richard Pan wants to turn independent journalists into “speech criminals.”\n\nSoon, you won’t be able to criticize the vaccine industry in California without going to prison or having your website seized. That’s because California will claim that any article opposing the “official” narrative on vaccines is, by definition, “fake news.” And since fake news will soon be criminalized in California, you will be arrested, indicted, convicted and imprisoned for merely uttering a scientific truth such as, “California still injects children with flu shots containing the neurotoxic heavy metal mercury.” Even though this is an openly admitted fact coming right out of the California government itself, it opposes the official vaccine narrative which falsely claims all mercury has been removed from vaccines. Thus, you will go to jail.\n\nIn case you believe there are too many websites and blogs based in California to enforce a new draconian law, let me explain how the game works. Behind closed doors, the state government would decide to focus on a few big issues. For example, gun control, vaccines, and immigration. Enforcement agencies would go after the biggest Internet operations expressing politically unacceptable points of view on those subjects. At first. A spread of smaller operations would feel the heat later.\n\nSo-called fact checkers would come from government supported groups who agree with Official Positions. In other words, they wouldn’t be fact checkers at all. They would be prime news fakers.\n\nWhen it comes to the issue of vaccines, for example, they would cite the notoriously biased “experts” at the Centers for Disease Control, never mentioning that the CDC buys and sells $4 billion of vaccines a year.\n\nIf you post a video that claims illegal immigrants are destroying California, you will go to jail\n\nIllegal immigration is gutting California, turning it into a collapsing totalitarian police state populated by impoverished masses and ruled by the wealthy elite. (That’s the perfect utopia, according to left-wing elitists.) But if you dare point out how open borders policies are destroying the once-great state of California, you might be arrested and thrown in prison if Richard Pan gets his way.\n\nIt makes me wonder: How much authoritarianism will Californians put up with, exactly? The state has already taken away their medical freedom (SB 277 vaccine mandate) and food freedom (people are arrested for selling raw milk). Will the people of California allow these insane tyrants like Richard Pan to take away their freedom to speak, too?\n\nIf the people of California don’t mount a massive uprising against this totalitarian law, there’s no hope for the state. Perhaps we should build a wall around the West Coast and isolate it from the rest of America, lest we all become contaminated with whatever insidious mind virus has infected the left-wing lunatics in Sacramento, San Francisco and Los Angeles. They pose a danger not merely to their own fellow citizens but to the country as a whole. After all, California encourages illegals to vote in elections that determine members of Congress in Washington. And they vote on policies that impact us all. With California now representing the interests of illegals rather than its own citizens — and seeking to criminalize “fake news” in an effort to outlaw non-conformist views — it’s clear the state has become a very real danger to the future of our Republic.\n\nNot that California’s government tyrants care. Even as their state is collapsing under their authoritarian rule, they are actively seeking ways to expand the tyranny by essentially establishing a California Ministry of Truth.\n\nAll those who oppose California’s official insanity will be locked up, shut down and silenced. So instead of gaining the favor of voters based on merit and reason, California will simply criminalize all opposition to state propaganda, just like we see happening in Communist China or North Korea. This is how totalitarians operate: They silence their opposition. They jail them. They demonetize them and they demonize them. All in the name of “equality,” hilariously.\n\nWebsites like InfoWars and NaturalNews could be required to carry “California warning labels” on pages served to California residents\n\nDid you know that California recently demanded coffee makers add cancer warnings to labels of coffee products? According to California, because roasted coffee contains at least one molecule of acrylamide, all coffee must be branded “cancer-causing.” The junk science insanity of this demand is mind-numbing in its stupidity and arrogance. Yet, at the same time, California won’t require GMOs to be labeled, nor glyphosate residues to be labeled on other foods.\n\nIf SB1424 passes, it could require warning labels on all web pages served to California residents. As Rappoport suggests, such a warning label might be something along the lines of, “I am making a debatable assertion and I must warn you that official experts strenuously disagree with me, and furthermore, the California Fact Checkers United, a division of Merck-Snopes Thought Police, has determined that my assertion is groundless and harmful to children’s health…”\n\nIndeed, any article that dares question the corrupt status quo on topics that matter to the authoritarian state — climate change, psychiatric drugs, illegal immigration, gun control, abortion — could be “regulated” by California so that only official opinions are allowed to be published or heard.\n\nYouTube, Google, Facebook and Twitter are practically at this point already, as they’re aggressively censoring all voices and channels that disagree with the totalitarian Left Cult. That’s why I’m launching Brighteon.com as a free speech alternative to YouTube. (Go there now to request your own video channel. It launches July 4th.)\n\nJust yesterday, Facebook informed Diamond and Silk that they were being banned because some authoritarian at Facebook decided their videos were “unsafe to the community.”\n\nThe speech police are coming for YOU\n\nRichard Pan is an authoritarian tyrant who belongs behind bars, not in the state Senate. People like him should be marched out of the Capitol building in handcuffs, charged with actively violating the basic human rights of California’s citizens who demand health freedom, food freedom and the freedom to speak without being criminalized by a deranged, power-hungry state that actively plots against its own American citizens.\n\nSuddenly, the people of California are waking up and realizing why Natural News, InfoWars and Jon Rappoport have been warning you about this all along: The tyrants are going to criminalize your ability to speak, read or think. It’s no longer just some theoretical warning: IT’S HERE NOW. Welcome to the California Ministry of Truth, run by the Mercury Joker, Richard Pan, a lunatic, sociopathic prostitute of the vaccine cartels and a betrayer of humankind.\n\nYesterday, I hosted the Alex Jones Show for InfoWars with a special emphasis on free speech. Viewers said this was the most powerful and important broadcast I’ve ever done. I titled it, “Tech overlords initiate online ethnic cleansing.” Watch the full video here and share with everyone you know.", "opengraph": {"image": "http://talknetwork.com/wp-content/uploads/sites/75/2018/12/Richard-Pan-1.jpg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/DiamondandSilk?ref_src=twsrc%5Etfw\">@DiamondandSilk</a>: \"If a privately owned bakery has to go against their Christian values to bake a cake, then Mark Zuckerberg is going to have to suck it up buttercup and allow Diamond and Silk to speak our truth.\" <a href=\"https://t.co/LnukaSjwD4\">pic.twitter.com/LnukaSjwD4</a></p>\n<p>— Fox News (@FoxNews) <a href=\"https://twitter.com/FoxNews/status/982980884348395520?ref_src=twsrc%5Etfw\">April 8, 2018</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/fv-3ndxBf9c?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/fv-3ndxBf9c?feature=oembed"}], "links": ["http://www.truthwiki.org/richard-pan-senator-of-california/", "https://www.naturalnews.com/050714_Richard_Pan_Mercury_Joker_super_villain.html", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180SB1424", "https://jonrappoport.wordpress.com/2018/04/09/california-bill-would-shut-down-free-speech/", "https://www.naturalnews.com/2018-04-08-why-california-is-collapsing-into-a-liberal-sthole-wayne-allen-root-sounds-off.html", "http://collapsifornia.com", "http://vaccines.news", "https://www.naturalnews.com/052142_flu_shots_mercury_in_vaccines_California_child_safety_laws.html", "https://www.naturalnews.com/050668_Richard_Pan_SB_277_referendum_California_law.html", "https://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html", "http://glyphosate.news", "http://leftcult.com", "http://Brighteon.com", "http://www.thegatewaypundit.com/2018/04/diamond-and-silk-if-a-private-bakery-has-to-go-against-their-christian-values-to-bake-a-cake-then-zuckerberg-has-to-allow-us-to-speak-our-truth-video/", "https://twitter.com/DiamondandSilk?ref_src=twsrc%5Etfw", "https://t.co/LnukaSjwD4", "https://twitter.com/FoxNews/status/982980884348395520?ref_src=twsrc%5Etfw", "http://Censorship.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftalknetwork%2F2018-04-09-california-state-senator-who-pushed-vaccine-mandate-now-seeks-to-criminalize-fake-news.html&linkname=California%20state%20senator%20who%20pushed%20vaccine%20mandate%20now%20seeks%20to%20CRIMINALIZE%20%E2%80%9Cfake%20news%E2%80%9D%20about%20medicine%2C%20politics%20and%20government", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2018-04-09T10:43:55+00:00"}