{"result_id": "283004", "URL": "https://www.technocracy.news/unvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too/", "timestamp": "2023-04-25 17:14:11 CEST+0200", "meta": {"description": "If you thought that only the \"vaccinated\" are being tracked for things like a \"vaccine passport\", you are sadly mistaken. Medical Technocrats slipped in medical record codes for those who skipped the mRNA shot or were only partially \"vaccinated\". All medical personnel are required to ask you (under penalty) for your vaxx status, and will dutifully enter it into your medical record.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/unvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Unvaccinated Or Partially Vaccinated? The Feds Are Specifically Tracking You, Too!", "cleaned_text": "> The U.S. government has secretly been tracking those who didn’t get the COVID jab, or are only partially jabbed, through a previously unknown surveillance program designed by the U.S. National Center for Health Statistics (NCHS), a division of the Centers for Disease Control and Prevention\n\n> The program was implemented April 1, 2022, and adopted by most medical clinics and hospitals across the U.S. until January 2023\n\n> Under this program, doctors at clinics and hospitals have been instructed to ask patients about their vaccination status, which is then added to their electronic medical records as a diagnostic code, known as ICD-10 code, so that they can be tracked inside and outside of the medical system\n\n> These new ICD-10 codes are part of the government’s plan to implement medical tyranny using vaccine passports and digital IDs\n\n> They’re also tracking noncompliance with all other recommended vaccines using new ICD-10 codes, and have implemented codes to describe WHY you didn’t get a recommended vaccine. They’ve also added a billable ICD code for “vaccine safety counseling”\n\nAs recently discovered and reported by Dr. Robert Malone,1 the U.S. government has secretly been tracking those who didn’t get the COVID jab, or are only partially jabbed, through a previously unknown surveillance program designed by the U.S. National Center for Health Statistics (NCHS), a division of the Centers for Disease Control and Prevention.\n\nThe program was implemented April 1, 2022,2 but didn’t become universally adopted by most medical clinics and hospitals across the U.S. until January 2023.\n\nUnder this program, doctors at clinics and hospitals have been instructed to ask patients about their vaccination status, which is then added to their electronic medical records as a diagnostic code, known as ICD-10 code, without their knowledge or consent so that they can be tracked — not just within the health care system but outside of it as well.\n\nThe new International Classification of Diseases (ICD) codes were introduced during the September 14-15, 2021, ICD-10 Coordination and Maintenance Committee meeting. The ICD committee includes representatives from the Centers for Medicare and Medicaid Services (CMS) and the NCHS.3\n\nBelow is a screenshot of page 194 of the agenda4 distributed during that meeting. According to the NCHS, “there is interest in being able to track people who are not immunized or only partially immunized,” and they figured out a way to do just that, by adding new ICD-10 codes.\n\nAs you can see below, ICD-10 code Z28.310 identifies those who have not received a COVID jab and Z28.311 identifies those who are not up-to-date on their shots.\n\nTracking Unjabbed Is Part of the Biosecurity Agenda\n\nWhy do they want to track the unvaccinated? For what purpose? The short answer: to facilitate the implementation of vaccine passports. As noted by Malone:5\n• The government will not restrict your travel, airlines will.\n• The government will not restrict your travel, other nations will.\n• The government will not restrict your travel, auto rental companies will.\n• The government will not restrict your travel, public transport will.\n• The government will not restrict your travel, private companies will.”\n\nThe ICD codes were created by the World Health Organization, and doctors — with the exception of those in private practice who don’t accept insurance — are required to use these codes to describe a patient’s condition and the care they received during their visit.\n\nAs noted by Malone,7 the fact that the ICD system is run by the WHO is an important detail, as this means the WHO had to authorize the CDC to add these new codes. The implication is that these codes may be in use internationally and we just don’t know it yet.\n\nThe codes are entered into your electronic health record and used by insurance companies for billing purposes. They’re also used by statisticians who track and analyze national and global disease trends such as cancer and heart disease rates over time.\n\nOver the past decade, these statistical analyses have gotten easier to do, thanks to the transition into electronic record keeping. In the U.S., the ICD coding system has been fully integrated into the electronic health record system since 2012.\n\nWithin the ICD-10 codes, there’s a category called ICD-10-CM,8,9 and this is the category the CDC is now using to track the unvaccinated with specific codes for “Unvaccinated for COVID-19”10 and “Partially Vaccinated For COVID-19.”11\n\nSince there’s no billing or payment involved with being unvaccinated, and since being unvaccinated is extremely unlikely to be part of your disease profile, there’s no valid reason to record anyone’s vaccine refusal. It’s also a violation of medical privacy, as the records can be accessed by a variety of individuals and not just your personal doctors.\n\nAs noted by Malone, a person’s decision to get a vaccine or not is a private matter, and your privacy rights are enshrined in the Privacy Act of 1974. However, during the COVID pandemic, medical privacy rights have been repeatedly violated and broken.\n\nChildren’s’ vaccination statuses were shared with schools and employers were granted the “right” to know the jab status of their employees. Private venues were even permitted to demand proof of vaccination status — all this without a single word of the law having been revoked or amended.\n\nIf you need proof that these codes will be used for reasons unrelated to your health, consider this: They’re also using codes to describe WHY you didn’t get the primary series or stopped getting boosters. Those codes are listed in the screenshot below, under Z28.3 Underimmunization Status.12\n\nThe use of “delinquent immunization status” under code Z28.39 also tells us something about where this is all headed. “Delinquent” means being “neglectful of a duty” or being “guilty of an offense.” Is refusing boosters a criminal offense? Perhaps not today, but some day, it probably will be.\n\nAll Missed Vaccinations Will Be Tracked\n\nAnother tipoff that these codes are part and parcel of the biosecurity control grid is the fact that code Z28.39 — “Other underimmunization status”13 — is to be used “when a patient is not current on other, non-COVID vaccines.” As detailed on the American Academy of Family Physicians website:14\n\n“The Centers for Disease Control and Prevention (CDC) and the Centers for Medicare & Medicaid Services have announced three new diagnosis codes, including two for COVID-19 immunization status …\n\nAccording to ICD-10-CM guidelines,15 clinicians may assign code Z28.310, ‘Unvaccinated for COVID-19,’ when the patient has not received a dose of any COVID-19 vaccine.\n\nClinicians may assign code Z28.311, ‘Partially vaccinated for COVID-19,’ when the patient has received at least one dose of a multi-dose COVID-19 vaccine regimen, but has not received the doses necessary to meet the CDC definition of ‘fully vaccinated’ at the time of the encounter … New code Z28.39 is for reporting when a patient is not current on other, non-COVID vaccines.”\n\nIn other words, they have already begun tracking ALL of your vaccinations, not just the COVID shot, and they can use the Z28.3 sub-codes to identify why you refused a given vaccine.\n\nVaccine Passports Are a Fait Accompli — Unless We Act Now\n\n“The administrative state is busy building a vaccine passport system that will be active before most Americans are aware of what is being done to them. No one is going to knock on your door asking for your vaccine status because they already know …\n\nThey don’t need approval from Congress or the courts because we have given them the information through our health care providers. The CDC is the governmental organization tasked with tracking vaccine status on individuals.\n\nThey already have the records, as well as updated booster information. They just need to tweak a definition here and there, or get President Biden to keep the COVID-19 public health emergency in place indefinitely and the vaccine passports will be a fait accompli.”\n\nYou Can Now Be Billed for Immunization Safety Counseling\n\nAs if all of that weren’t tyrannical enough, they’ve also added a billable ICD-10 code for “immunization safety counseling.” That’s right. If you’ve decided you’re not willing to partake in the mRNA experiment, or you just don’t think you need some other vaccine that’s recommended, your doctor can bill your insurance for regurgitating the WHO’s vaccine propaganda.\n\nThis may become more or less automatic because, again, they have codes identifying whether you declined the COVID jab and/or any other vaccine, and for each vaccine refusal, there’s a code detailing why you declined it. “Belief or group pressure” is one of those, and you can bet that code, Z.28.1, will automatically qualify you for immunization safety counseling, whether you want it or not.\n\nThey also intend to indoctrinate your children, and make you pay for it. The immunization safety counseling code, Z71.85, was described in the September 2021 issue of the American Academy of Pediatrics (AAP) Pediatric Coding Newsletter. You have to be a member to read the entire article, but here’s the publicly available preview:17\n\nAs physicians and other qualified health care professionals field increasing numbers of concerns about immunization safety, International Classification of Diseases, 10th Revision, Clinical Modification (ICD-10-CM) offers a new code, Z71.85, for identifying immunization safety counseling as a reason for an encounter provided on or after October 1, 2021.\n\nUse this code when reporting counseling provided to patients and caregivers who are vaccine hesitant, wish to follow an alternative immunization schedule, or otherwise require time spent in counseling at lengths beyond that typical of routine immunization counseling.\n\nCode Z71.85 may be reported to indicate the principal or first-listed reason for an encounter or as a secondary reason.\n\nDocumentation of time spent in preventive medicine counseling and separate time spent in immunization administration counseling should be explicit in the encounter note to support that the preventive medicine counseling was significant and separately identifiable.”\n\nIn related news, in early February 2023 it was revealed that New York City teachers who did not get the jab were “flagged” with a “problem code” in their personnel files, triggering their fingerprints to be sent to the FBI and the New York Criminal Justice Services.18\n\nThe purpose of this is unclear, but former public school teacher Michael Kane, founder of Teachers for Choice, believes “that unvaccinated NYC educators were being set up to be viewed as ‘right-wing extremists’ or even ‘terrorists.’”\n\nKane was among those who got fired for refusing the COVID jab. The revelation that teachers’ fingerprints were illegally entered into not just one, but two, criminal databases “are certain to open up a new round of lawsuits,” Kane writes.\n\nKnowing all of this, what can you do about it? How do we stop this madness? Here are a few suggestions:\n\n1. Demand Congress finish what the Senate started by declaring the public health emergency over and done with. January 17, 2023, HR 382, a bill “To terminate the public health emergency declared with respect to COVID-19” was referred to the House Committee on Energy and Commerce. This bill must be passed.\n\n2. Contact your Congressional representative and let them know you:\n• Support the Select Subcommittee on the Weaponization of the Federal Government’s investigation.\n• Want Congress to reject all attempts by the administrative state, the United Nations, the WHO, Health and Human Services (HHS) and the Biden Administration to require a vaccine passport or a digital ID.\n• Expect them to work to ensure the freedom of travel for all citizens.\n• Expect them to protect all rights to privacy, including and especially medical privacy, and since these new ICD-10 codes are in violation of your right to privacy, you want them to take immediate action to ensure the codes are revoked.\n\nWith respect to what you can do to protect your medical privacy on a personal level, keep in mind that independent doctors are not required to use ICD codes unless they accept insurance. So, by choosing a doctor who is in private practice, you can avoid getting tagged and trapped in the system.", "opengraph": {"locale": "en_US", "type": "article", "title": "Unvaccinated Or Partially Vaccinated? The Feds Are Specifically Tracking You, Too!", "description": "If you thought that only the \"vaccinated\" are being tracked for things like a \"vaccine passport\", you are sadly mistaken. Medical Technocrats slipped in medical record codes for those who skipped the mRNA shot or were only partially \"vaccinated\". All medical personnel are required to ask you (under penalty) for your vaxx status, and will dutifully enter it into your medical record.", "url": "https://www.technocracy.news/unvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Total Surveillance Society", "image": "https://www.technocracy.news/wp-content/uploads/2023/02/no-vaccine-get-lost.webp", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2023/02/no-vaccine-get-lost.webp", "image:width": "1600", "image:height": "900", "image:alt": "unvaccinated", "image:type": "image/webp", "article:published_time": "2023-02-17T09:05:46-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Funvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too%2F&text=Unvaccinated%20Or%20Partially%20Vaccinated%3F%20The%20Feds%20Are%20Specifically%20Tracking%20You%2C%20Too%21", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Funvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too%2F", "https://parler.com/new-post?message=Unvaccinated%20Or%20Partially%20Vaccinated%3F%20The%20Feds%20Are%20Specifically%20Tracking%20You%2C%20Too%21&url=https%3A%2F%2Fwww.technocracy.news%2Funvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Funvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too%2F&text=Unvaccinated%20Or%20Partially%20Vaccinated%3F%20The%20Feds%20Are%20Specifically%20Tracking%20You%2C%20Too%21", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Funvaccinated-or-partially-vaccinated-the-feds-are-specifically-tracking-you-too%2F&title=Unvaccinated%20Or%20Partially%20Vaccinated%3F%20The%20Feds%20Are%20Specifically%20Tracking%20You%2C%20Too%21", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=43767", "https://rwmalonemd.substack.com/p/new-diagnosis-codes-for-covid-19", "https://www.cms.gov/files/document/mm12578-april-2022-update-medicare-severity-diagnosis-related-group-ms-drg-grouper-and-medicare-code.pdf", "https://www.cms.gov/medicare/coding/icd10/icd-10-coordination-and-maintenance-committee-meetings", "https://www.cdc.gov/nchs/icd/sept2021-topicpacket.pdf", "https://medlineplus.gov/ency/article/001929.htm", "https://www.healthcare-brew.com/stories/2022/10/26/what-are-icd-10-codes", "https://nationalfile.com/exclusive-the-federal-government-is-tracking-unvaccinated-people-who-go-to-the-doctor-and-to-the-hospital-due-to-cdc-designed-surveillance-program/", "https://www.icd10data.com/ICD10CM/Codes/Z00-Z99/Z20-Z29/Z28-/Z28.310", "https://www.icd10data.com/ICD10CM/Codes/Z00-Z99/Z20-Z29/Z28-/Z28.311", "https://nakedemperor.substack.com/p/z28310-the-code-designated-for-the", "https://www.icd10data.com/ICD10CM/Codes/Z00-Z99/Z20-Z29/Z28-/Z28.39", "https://rwmalonemd.substack.com/p/new-diagnosis-codes-for-covid-19", "https://ftp.cdc.gov/pub/Health_Statistics/NCHS/Publications/ICD10CM/2022/10cmguidelines-FY2022-April%201%20update%202-3-22.pdf", "https://publications.aap.org/codingnews/article-abstract/16/12/5/92474/Reporting-Encounters-for-Immunization-Safety?redirectedFrom=fulltext", "https://teachersforchoice.org/2023/02/09/fingerprints-of-unvaccinated-nyc-teachers-flagged-to-fbi/", "https://www.Mercola.com", "https://www.technocracy.news/what-will-you-do-when-the-feds-come-knocking/", "https://www.technocracy.news/vaccinated-suffering-5x-to-25x-more-risk-of-heart-inflammation-than-unvaccinated/", "https://www.technocracy.news/uk-post-vaccinated-covid-death-rate-surpasses-non-vaccinated-covid-deaths/", "https://www.technocracy.news/find-out-if-google-is-tracking-you-with-new-floc-system/", "https://www.technocracy.news/estate-planning-nightmare-death-benefits-might-be-denied-if-you-die-from-covid-without-being-vaccinated/", "https://www.technocracy.news/technocrats-send-message-you-will-never-be-fully-vaccinated/", "https://www.technocracy.news/fauci-you-use-lockdowns-to-get-people-vaccinated/", "https://www.technocracy.news/what-happens-if-you-refuse-vaccinated-blood/"], "authors": [], "publish_date": "2023-02-17T09:05:46-07:00"}