{"result_id": "283001", "URL": "https://www.technocracy.news/failure-7-in-10-vaccinated-cdc-employees-got-covid/", "timestamp": "2023-04-25 17:14:01 CEST+0200", "meta": {"description": "The CDC admits that it learned about Pfizer's 95% efficacy claim from a... press release issued by Pfizer? This bogus figure then led the CDC into completely false policies and guidelines that virtually destroyed a huge swath of American society and businesses. Is CDC as culpable as Pfizer? Will either stand trial? Not likely.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/failure-7-in-10-vaccinated-cdc-employees-got-covid/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Failure: 7 in 10 ‘Vaccinated’ CDC Employees Got COVID", "cleaned_text": "The CDC admits that it learned about Pfizer’s 95% efficacy claim from a… press release issued by Pfizer? This bogus figure then led the CDC into completely false policies and guidelines that virtually destroyed a huge swath of American society and businesses. Is CDC as culpable as Pfizer? Will either stand trial? Not likely. ⁃ TN Editor\n• None Freedom of Information Act (FOIA) data reveal 70% of vaccinated U.S. Centers for Disease Control and Prevention employees got breakthrough COVID infections in August 2021\n• None March 3, 2022, CDC director Dr. Rochelle Walensky gave a presentation at Washington University, during which she admitted that she had learned about the Pfizer shot’s 95% effectiveness from CNN, which was based on a press release from Pfizer\n• None Walensky claims she was unaware the shots might lose effectiveness over time. Yet scientists around the world have long known that coronaviruses are very prone to mutation, and mutations are known to affect a vaccine’s effectiveness\n• None Walensky has also accused the public of believing that “science is black and white” when, in fact, “science is gray.” Meanwhile, anyone who has held an opinion that differs from the mainstream narrative has been censored to stifle scientific debate, and Walensky has never spoken out against this effort to prevent a “black and white” presentation of science\n• None Walensky has also publicly discredited the Vaccine Adverse Event Reporting System (VAERS), which is coadministered by the FDA and the CDC. VAERS reveals the COVID jabs are the most dangerous vaccines ever created\n\nFebruary 2, 2022, the Informed Consent Action Network (ICAN) filed a Freedom of Information Act (FOIA) request1 with the U.S. Centers for Disease Control and Prevention, requesting records showing “the number of COVID-19 infections, and of those, the number of breakthrough infections” among CDC employees in August 2021.\n\nBreakthrough infections refer to infections that occur in those who have received one or more COVID jabs. March 28, 2022, ICAN issued a legal update,2 stating they had received an official response,3 showing approximately 70% of all COVID-19 cases among CDC employees in August 2021 occurred among “vaccinated” employees.\n\nFollowing are the official numbers for June, July and August 2021, listed in the FOIA response:4\n\n“Now, we don’t know the percent of CDC employees that were vaccinated as of August 2021, but if the CDC’s vaccination rate reflects that of adults in the United States, it was far less than 70%.\n\nBut even if more than 70% of CDC employees were vaccinated, the fact that by the end of Summer 2021, 70% of its COVID-19 positive employees were vaccinated should have been a shocking figure and should have served as a wake-up call to the CDC about the failure of these vaccines to prevent infection.”\n\nAccording to ICAN, the CDC’s response included “a whole bunch of caveats, meaning, ‘cover your butt’ excuses” for why the breakthrough infections rate was so high, including that many CDC employees were telecommuting at the time and not required to report their vaccination status and/or any test results.\n\nAccording to U.S. Sen. Bill Cassidy, who questioned CDC director Dr. Rochelle Walensky about the percentage of vaccinated CDC employees during a November 4, 2021, Senate hearing (above), an estimated 75% of CDC employees were working remotely during the pandemic.\n\nWalensky claimed she did not know the true number, and the FOIA response also did not specify how many were actually working remotely. Either way, “These excuses are unpersuasive,” ICAN says, adding:6\n\n“There is no reason to believe that CDC employees would not disclose their vaccination status. There is also no reason to believe those vaccinated would be more likely to report being COVID-19 positive. If anything, those vaccinated would have been less likely to report being COVID-19 positive given that, as the CDC itself says, ‘persons who have been vaccinated are possibly less likely to get tested.’”\n\nInterestingly, March 3, 2022 — the same day the CDC replied to ICAN’s FOIA request for data on breakthrough infections among CDC employees — Walensky gave a presentation to medical students at Washington University during which she admitted that she had learned about the Pfizer shot’s effectiveness from CNN.7\n\nCNN’s report, in turn, was based on a press release from Pfizer, which stated that the jab was 95% effective. Walensky was not told, she said, that the shots might lose effectiveness over time (and a short amount of time, at that).\n\nThese are truly shocking admissions. Writing in The Disinformation Chronicle, investigative journalist Paul Thacker discussed the timeline of events that led to Walensky believing the Pfizer vaccine was 95% effective.8\n\nHe concluded Walensky was likely referring to a November 18, 2020, CNN report9 by Maggie Fox and Amanda Sealy, who appear to have done little to augment the story after pulling information from a Pfizer press release published the same day.10\n\nSo, what we have here is a remarkable instance where a story in CNN, regurgitated from a press release, appears to have influenced Walensky’s thinking about the injections and the future guidance from the CDC. As noted by Thacker:11\n\n“The Pfizer press release … became CDC pandemic policy … [Y]ou rarely get such direct evidence of a corporation influencing federal policy by laundering their press release through media outlets like CNN. Further, republishing press releases seems a pervasive practice in how the media covers COVID-19 vaccines — meaning, they don’t do much reporting. This has been obvious since late 2020.”\n\nDoes the CDC Rely on Science at All?\n\nWalensky’s apparent ignorance about the potential for waning effectiveness is equally shocking. Scientists around the world have long known that coronaviruses are very prone to mutation, and mutations are known to affect a vaccine’s effectiveness.\n\nNearly every scientist in the world expected the virus to mutate, because that’s what viruses do. Yet Walensky did not consider this possibility,12 despite having been a professor of medicine at Harvard Medical School with years of experience dealing with viruses.13\n\nEven those with no expertise in virology suspected mutations might impact the shot’s effectiveness. For example, two days after Walensky’s speech at Washington University, former New York Times reporter Alex Berenson wrote,14 “She’s right. Nobody could possibly have known variants might be a problem.”\n\nUnderneath, he reposted a tweet dated January 20, 2021, in which he had stated, “Spoiler alert: the vaccines probably don’t work against at least one new variant and they’re going to want you to get vaccinated again next fall.”\n\nBy August, Twitter had permanently banned Berenson for “repeated violations of our COVID-19 misinformation rules.”15 Ironically, the tweet that put Twitter over the edge compared the COVID jab to a “‘therapeutic’ with a limited window of efficacy …” — a statement that I and many other experts would agree is 100% factual and true.\n\nDuring her Washington University appearance, Walensky also alluded to people in the media who “reject evidence,” saying,16 “There are a lot of people who are using their voice that may or may not be helpful for public health,” and that this “decreases public health in general.” For this reason, “we have to be clear” about our messaging, she added.\n\nHowever, Walensky’s admissions during that talk really make one wonder who is making our public health decisions, and why. It’s difficult to imagine that one of the largest and most powerful health care agencies in the U.S. is led by a director who is basing her decisions on CNN reports and drug company press releases — and by doing so, is misleading the public. Consider that during this talk, she:\n• Admitted learning about the Pfizer 95% efficacy — information which was then used to formulate CDC guidelines — from a CNN report, which was nothing more than a republished press release from Big Pharma.\n• Claimed the CDC is transparently publishing data in a “pedal-to-the-metal” scenario even though The New York Times, only days earlier, had revealed the CDC is withholding crucial data from the public.\n• Claimed “no one told her” that the virus might mutate and render the vaccine ineffective, yet during a Pfizer earnings call, held February 2, 2021, a financial analyst was astute enough to ask Pfizer how the 95% efficacy rate might change in light of mutations.\n\nWalensky also accused the public of believing that “science is black and white,” when in fact, “science is gray.” Meanwhile, anyone who has held an opinion that differs from the mainstream narrative has been censored and fake “fact-checked” so the debate over science would never see the light of day. Walensky has never spoken out against this effort to prevent a “black and white” presentation of science.\n\nHer colleague, Dr. Anthony Fauci — who as director of the National Institutes of Allergy and Infectious Diseases has been the face of COVID-19 for the White House — has even gone on record claiming that HE is the science, and that attacking his recommendations is an attack on science itself.21 Walensky, for some reason, never corrected him either.\n\nWalensky Has Tried to Undermine Confidence in VAERS\n\nWalensky has also publicly discredited the Vaccine Adverse Event Reporting System (VAERS), which is coadministered by the FDA and her own agency, the CDC.22 During her January 11, 2022, testimony before the Senate,23 Walensky stated that any death after a vaccine could be reported to VAERS.\n\nSpecifically, she used the example of an individual who gets vaccinated and then gets hit by a car and dies. She clearly implied that such a death would be recorded in VAERS and logged as an adverse reaction to the vaccine. But this is patently false.\n\nFirst of all, adverse events are not automatically reported and, certainly, obvious accidents are not entered into the system as a suspected vaccine side effect.\n\nAs reported by Health Impact News,24 there are about 18 reports in VAERS that include “road traffic accident,” but most if not all relate to an adverse event, such as a heart attack, occurring while driving. They were not hit by someone else and then entered into the system. As noted by Pam Long in a January 12, 2022, Twitter thread:25\n\n“If anyone in public health utters ‘a person can get hit by a car & report their death to VAERS’ you need stop them, in any public meeting, and demand they explain what motive would a physician have to inflate VAERS reports with car accidents or any unrelated mortality?\n\nDespite Walensky’s & Fauci’s cliché testimony to Congress, not one person ‘got hit by a car’ & reported their own death to VAERS as a vaccine injury. Most reports are filed by medical professionals, using diagnostic language about drug reactions.”\n\nVAERS was designed and created as an early warning system, and it works well for that. While it’s true that anyone can file a report, it’s time-consuming, requires knowledge of medical details that a patient oftentimes won’t have, and there are penalties for filing a false report. There’s absolutely no reason to suspect, let alone assume, that people are filing false reports just to make the shots look bad.\n\nThe fact of the matter is that VAERS is showing the COVID shots are the most dangerous vaccines ever created. It’s hard to imagine why Walensky would want to undermine confidence in this system — unless she wants everyone to simply ignore the warning signals it’s giving us.\n\nDuring the November 4, 2021, Senate hearing, featured in the video at the top of this article, Cassidy also highlighted another area where the CDC has acted as if it’s intentionally disregarding basic science, namely that of natural immunity.\n\nCassidy cited research showing 92% of those who recover from COVID have T-cells, B-cells and antibodies that provide robust immunity for at least six to eight months. Yet the CDC has refused to acknowledge natural immunity, saying those who recover still need to get a COVID shot.\n\nCassidy noted that the CDC has access to tens of thousands of electronic health records (EHRs) and patient identifiable data as to who tested positive and had symptomatic infection. With that data, they could easily confirm or disprove claims that natural infection confers adequate protection against reinfection. And, if confirmed, those who have had symptomatic infection could then be excluded from vaccine mandates.\n\nSo, why has the CDC not done any prospective studies when they have patient identifiable EHRs that they can use to precisely determine who gets reinfected and who doesn’t? According to Cassidy, the only reason we don’t know whether natural immunity is as good as the COVID jab is “because we decided not to look.”\n\nWalensky’s replies to Cassidy’s questions are as telling as the admissions in her Washington University presentation. There’s an awful lot she and the CDC apparently don’t know, including core basics.\n\nCan a virus mutate? Walensky “wasn’t told” it could and therefore didn’t think it would. Can a mutation affect the effectiveness of the jab? Walensky wasn’t aware of such a possibility and CDC recommendations have reflected that ignorance.\n\nHow many CDC personnel are working remotely? She has no idea. How many of the CDC’s employees have been jabbed? She has no clue. Why has basic research not been done to determine whether natural immunity is as adequate as the jab? She provides some circular argument about not having unbiased correlative data, even though Cassidy just told her how the data they already have could be used to find this answer.\n\nShe pats herself on the back for her agency’s transparency, while evidence is presented showing the CDC is intentionally withholding crucial vaccine data. She says science is a gray zone while simultaneously accusing people of spreading misinformation when they don’t agree with her.\n\nShe lies about the types of adverse events that are reported to VAERS in what appears to be a blatant effort to undermine this valuable safety tool, and admits to making public health decisions based on Pfizer press releases instead. The fact that 7 in 10 vaccinated CDC employees got breakthrough infections didn’t even clue Walensky in to the possibility that the COVID jab might be useless.\n\nOn a side note, more evidence of this was recently revealed by Princess Cruises, which reported an outbreak onboard the Ruby Princess in March 2022, despite a 100% vaccination rate among both crew and passengers, plus proof of a negative COVID test prior to boarding.26\n\nJust how are we supposed to trust the CDC when they seemingly know nothing about anything that matters, don’t follow the science, and protect Big Pharma to the point of undermining confidence in their own safety tools? I’ll let you be the judge.", "opengraph": {"locale": "en_US", "type": "article", "title": "Failure: 7 in 10 ‘Vaccinated’ CDC Employees Got COVID", "description": "The CDC admits that it learned about Pfizer's 95% efficacy claim from a... press release issued by Pfizer? This bogus figure then led the CDC into completely false policies and guidelines that virtually destroyed a huge swath of American society and businesses. Is CDC as culpable as Pfizer? Will either stand trial? Not likely.", "url": "https://www.technocracy.news/failure-7-in-10-vaccinated-cdc-employees-got-covid/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Corrupt Data", "image": "https://www.technocracy.news/wp-content/uploads/2022/04/Dr.-Rochelle-Walensky.webp", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/04/Dr.-Rochelle-Walensky.webp", "image:width": "835", "image:height": "516", "image:alt": "COVID", "image:type": "image/webp", "article:published_time": "2022-04-05T07:30:19-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.technocracy.news/wp-content/uploads/2022/04/Screen-Shot-2022-04-05-at-7.13.57-AM.png"], "authors": [], "publish_date": "2022-04-05T07:30:19-07:00"}