{"result_id": "283024", "URL": "https://www.technocracy.news/world-bank-creates-1-billion-fund-for-vaccine-passports/", "timestamp": "2023-04-25 17:15:01 CEST+0200", "meta": {"description": "Global Technocrats, all unelected and unaccountable, are bent on creating vaccine passports. There is no discussion with nation-states or actual citizens who will be forced into taking the passports. A universal digital ID is the Holy Grail of Technocracy because it will enable a \"Skynet\" system of total control. The World Bank's backing guarantees that Central Bank Digital Currency will be tightly coupled with vaccine passports.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/world-bank-creates-1-billion-fund-for-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "World Bank Creates $1 Billion Fund For Vaccine Passports", "cleaned_text": "While the World Health Organization pushes ahead with plans to enact a new or revised international pandemic preparedness treaty, the World Bank and other organizations are advancing new vaccine passport regimes.\n\nThe World Health Organization (WHO) is moving ahead with plans to enact a new or revised international pandemic preparedness treaty, despite encountering setbacks earlier this summer after dozens of countries, primarily outside the Western world, objected to the plan.\n\nA majority of WHO member states on July 21, during a meeting of WHO’s Intergovernmental Negotiating Body (INB), agreed to pursue a legally binding pandemic instrument that will contain “both legally binding as well as non-legally binding elements.”\n\nSTAT News described the agreement, which would create a new global framework for responding to pandemics, as “the most transformative global health call to action since [the] WHO itself was formed as the first specialized United Nations agency in 1948.”\n\nMeanwhile, the World Economic Forum, African Union and World Bank — which created a $1 billion fund for “disease surveillance” and “support against the current as well as future pandemics” — are developing their own pandemic response mechanisms, including new cross-country vaccine passport frameworks.\n\nWHO’s ‘pandemic treaty’: what’s been proposed and what would it mean?\n\nOngoing talks to formulate a new or revised “pandemic treaty” are building on the existing international framework for global pandemic response, the WHO’s International Health Regulations (IHR), considered a binding instrument of international law.\n\nOn Dec. 1, 2021, in response to calls from various governments for a “strengthened global pandemic strategy” and signaling the urgency with which these entities are acting, the WHO formally launched the process of creating a new treaty or amending the IHR, during Special Session — only the second in the organization’s history\n\nDuring the meeting, held May 10-11, WHO’s 194 member countries unanimously agreed to launch the process, which previously had been discussed only informally.\n\n“Kickstart a global process to draft and negotiate a convention, agreement or other international instrument under the Constitution of the World Health Organization to strengthen pandemic prevention, preparedness and response.”\n\nThe IHR, a relatively recent development, were first enacted in 2005, in the aftermath of SARS-CoV-1.\n\nThe IHR legal framework is one of only two binding treaties the WHO has achieved since its inception, the other being the Framework Convention on Tobacco Control.\n\nThe IHR framework already allows the WHO director-general to declare a public health emergency in any country, without the consent of that country’s government, though the framework requires the two sides to first attempt to reach an agreement.\n\nThe proposals for a new or revised pandemic treaty, put forth at the special ministerial session of the WHO in May, would “somewhat” strengthen the WHO’s pandemic-related powers, including establishing a “Compliance Committee” that would issue advisory recommendations for states.\n\nHowever, according to the Daily Sceptic, while the IHR is already legally binding, the amendments proposed in May would not strengthen existing legal obligations or requirements:\n\n“The existing treaty regulations, like all (or most) international law, do not actually compel states to do anything other than talk to the WHO and listen to it, and neither do they specify sanctions for non-compliance; almost all their output is advice.\n\n“The proposed amendments don’t alter that. They don’t allow the WHO unilaterally to impose legally binding measures on or within countries.”\n\nThe Daily Sceptic noted one of the risks stemming from the negotiations for a new or updated treaty include the potential codification of “the new lockdown orthodoxy for future pandemics,” which would “replace the sound, science-based, pre-COVID recommendations” previously in place.\n\nAccording to Dr. Joseph Mercola, such a treaty would grant the WHO “absolute power over global biosecurity, such as the power to implement digital identities/vaccine passports, mandatory vaccinations, travel restrictions, standardized medical care and more.”\n\nMercola also questioned a “one-size-fits-all approach to pandemic response,” pointing out that “pandemic threats are not identical in all parts of the world. In his view, he said, “the WHO is not qualified to make global health decisions.”\n\nSimilar concerns contributed at least in part to opposition against the proposals presented at the special ministerial session, during which a bloc of mostly non-Western countries, including China, India, Russia and 47 African nations, prevented an agreement from being finalized.\n\nAlthough no final agreement was achieved at the May meeting, consensus was reached to organize a new special ministerial session of the WHO later this year, possibly after the WHO’s World Health Assembly, scheduled for Nov. 29 through Dec. 1, Reuters reported.\n\nMxolisi Nkosi, South Africa’s ambassador to the UN, told the WHO’s annual ministerial assembly the new special session would “consider the benefits for such a convention, agreement or other international instrument.”\n\n“Probably the most important lesson COVID-19 has taught us is the need for stronger and more agile collective defences against health threats as well as for building resilience to address future potential pandemics.\n\n“A new pandemic treaty is central to this.”\n\nAt the time, the U.K.’s ambassador to the UN, Simon Manley, addressing the lack of an immediate agreement and the consensus to hold a new meeting, tweeted “negotiations may take time, but this is a historic step towards global health security.”\n\nThe INB, at its meeting held in Geneva July 18-21, also agreed with this view, reaching a consensus that its members will work on finalizing a new legally binding international pandemic agreement by May 2024.\n\nAs part of this process, the INB will meet again in December and will deliver a progress report to the 76th World Health Assembly of the WHO in 2023.\n\nAccording to the WHO, “Any new agreement, if any when agreed by Member States, is drafted and negotiated by governments themselves, [which] will take any action in line with their sovereignty.”\n\nThe WHO further claims that “governments themselves will determine actions under the accord while considering their own national laws and regulations.”\n\nThe Biden administration expressed broad support for a new or updated pandemic treaty, with the U.S. heading previous negotiations on this issue, along with the European Commission, via its president Ursula von der Leyen, who, as previously reported by The Defender, is also a strong proponent of vaccine passports and mandatory COVID-19 vaccination.\n\nAn analysis by the Alliance for Natural Health International speculated that any final agreement may simply strengthen the existing IHR or, alternatively, may involve an amendment to the WHO’s constitution — or both.\n\nJust two days after the July 21 INB agreement, Tedros Adhanom Ghebreyesus, the WHO’s director-general, tweeted:\n\n“I’m pleased that alongside the process of negotiating a new [international] accord on pandemic preparedness & response, WHO’s Member States are also considering targeted amendments to the [IHR], incl. ways to improve the process for declaring a [public health emergency of international concern, or PHEIC].”\n\nIn the same Twitter thread, he also declared the ongoing monkeypox outbreak “a public health emergency of international concern,” one “that is concentrated among men who have sex with men, especially those with multiple sexual partners.”\n\nNotably, the WHO director-general overruled an expert panel that was divided over whether to classify the outbreak as a global public health emergency.\n\nWith this declaration, three “global health emergencies” are now in place, as determined by the WHO: COVID-19, monkeypox and polio.\n\nWhile the WHO and global governments weigh plans for an updated or new pandemic treaty, other organizations are moving forward on vaccine passport technologies and partnerships.\n\nOn July 8, the Organisation for Economic Cooperation and Development (OECD), composed of many of the world’s industrialized nations, announced it would promote the unification of the different vaccine passport systems currently in use around the world.\n\nThirty-six countries and international organizations participated in a July meeting with the goal of “creating a multilateral framework for establishing a global vaccine passport regime,” according to Nick Corbishley of Naked Capitalism.\n\nThe development is a continuation of efforts involving the WHO to harmonize global vaccine passport regimes.\n\nIn February, the WHO selected Germany’s T-Systems as an “industry partner to develop the vaccination validation service,” which would enable “vaccination certificates to be checked across national borders.”\n\nT-Systems, an arm of Deutsche Telekom, was previously instrumental in developing the interoperability of vaccine passport systems in Europe.\n\nAlso in July, 21 African governments “quietly embraced” a vaccine passport system, which in turn would also be interlinked with other such systems globally.\n\nOn July 8, which is also Africa Integration Day, the African Union and the Africa Centers for Disease Control launched a digital vaccine passport valid throughout the African Union, describing it as “the e-health backbone” of Africa’s “new health order.”\n\nThis follows the development in 2021, of the Trusted Travel platform, now required by several African countries, including Ethiopia, Kenya, Togo and Zimbabwe, and air carriers such as EgyptAir, Ethiopian Airlines and Kenya Airways, for both inbound and outbound travel.\n\nBeyond Africa, Indonesia, which currently holds the rotating presidency of the G20, is conducting “pilot projects” that would bring about the interoperability of the various digital vaccine passport systems currently in use globally. The project is expected to be completed by November, in time for the G20 Leaders’ Summit.\n\nNaked Capitalism highlighted the role of South African company Cassava Fintech in the efforts to develop an interoperable vaccine passport for all of Africa.\n\nA subsidiary of African telecommunication company Econet, Cassava initially developed the “Sasail” app, which the company described as Africa’s first “global super app” that combines “social payments” with the ability to send and receive money and pay bills, chat with others and play games.\n\nCassava and Econet entered into a strategic partnership with Mastercard, “to advance digital inclusion across Africa and collaborate on a range of initiatives, including expansion of the Africa CDC TravelPass.”\n\nAs previously reported by The Defender, Mastercard supports the Good Health Pass vaccine passport initiative that is also backed by the ID2020 alliance and endorsed by embattled former U.K. prime minister Tony Blair.\n\nMastercard has also promoted technology that can be embedded into the DO Card, a credit/debit card that keeps track of one’s “personal carbon allowance.”\n\nID2020, founded in 2016, claims to support “ethical, privacy-protecting approaches to digital ID.” Its founding partners include Microsoft, the Rockefeller Foundation, Accenture, GAVI-The Vaccine Alliance (itself a core partner of the WHO), UNICEF, the Bill & Melinda Gates Foundation and the World Bank.\n\nMastercard’s top two stockholders are Vanguard and BlackRock, which hold significant stakes in dozens of companies that supported the development of vaccine passports or implemented vaccine mandates for their employees. The two investment firms also hold large stakes in vaccine manufacturers, including Pfizer, Moderna and Johnson & Johnson.\n\nMastercard provides funding for the World Bank’s Identity for Development (ID4D) Program, which “focuses on promoting digital identification systems to improve development outcomes while maintaining trust and privacy.”\n\nThe Center for Human Rights and Global Justice at the New York School of Law recently described the ID4D program, which touts its alignment with the UN’s Sustainable Development Goals (SDGs) , as one which could pave the way to a “digital road to hell.”\n\nAccording to the center, this would occur through the prioritization of “economic identity” and the use of an infrastructure that has “been linked to severe and large-scale human rights violations” in several countries.\n\nMastercard is also active in Africa through its joint initiative with another fintech (financial technology) company, Paycode, to “increase access to financial services and government assistance for remote communities across Africa” via a biometric identity system containing the data of 30 million individuals.\n\nThe World Bank in late June announced the creation of a fund that will “finance investments in strengthening the fight against pandemics” and “support prevention, preparedness and response … with a focus on low- and middle-income countries.”\n\nThe fund was developed under the lead of the U.S., Italy and current G20 president Indonesia, “with broad support from the G20,” and will be active later this year.\n\nIt will provide more than $1 billion in funding for areas such as “disease surveillance” and “support against the current as well as future pandemics.”\n\nThe WHO is also a “stakeholder” in the project and will provide “technical expertise,” according to WHO’s director-general.\n\nThe agreement follows a 2019 strategic partnership between the UN and the World Economic Forum, to “accelerate” the implementation of the UN’s 2030 Agenda for Sustainable Development and its SDGs.\n\nAlthough the agreement has recently circulated on social media, it was announced in June 2019, prior to the COVID-19 pandemic. It encompasses six areas of focus, including “health” and “digital cooperation.”\n\nIn terms of health, the agreement purports that it will “support countries [sic] achieve good health and well-being for all, within the context of the 2030 Agenda, focusing on key emerging global health threats that require stronger multistakeholder partnership and action.”\n\nIn turn, the “digital cooperation” promoted by the agreement will purportedly “meet the needs of the Fourth Industrial Revolution while seeking to advance global analysis, dialogue and standards for digital governance and digital inclusiveness.”\n\nHowever, despite rhetoric preaching “inclusiveness,” individuals and entities that have refused to go along with applications such as vaccine passports have faced repercussions in their personal and professional lives.\n\nSuch was the example of a Canadian doctor who was fined $6,255 in June over her refusal to use the country’s ArriveCAN health information app — which is being investigated over privacy concerns — to enter the country.\n\nDr. Ann Gillies said she was fined when re-entering Canada after attending a conference in the U.S.\n\nAndrew Bud, the CEO of biometric ID company iProove, a U.S. Department of Homeland Security contractor, described vaccine certificates as driving “the whole field of digital ID in the future,” adding they are “not just about COVID [but] about something even bigger” and that “once adopted for COVID [they] will be rapidly used for everything else.”", "opengraph": {"locale": "en_US", "type": "article", "title": "World Bank Creates $1 Billion Fund For Vaccine Passports", "description": "Global Technocrats, all unelected and unaccountable, are bent on creating vaccine passports. There is no discussion with nation-states or actual citizens who will be forced into taking the passports. A universal digital ID is the Holy Grail of Technocracy because it will enable a \"Skynet\" system of total control. The World Bank's backing guarantees that Central Bank Digital Currency will be tightly coupled with vaccine passports.", "url": "https://www.technocracy.news/world-bank-creates-1-billion-fund-for-vaccine-passports/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Vaccine Passports", "updated_time": "2022-08-13T08:04:47-07:00", "image": "https://www.technocracy.news/wp-content/uploads/2022/08/Screen-Shot-2022-08-12-at-7.55.20-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/08/Screen-Shot-2022-08-12-at-7.55.20-AM.png", "image:width": "1588", "image:height": "888", "image:alt": "world bank", "image:type": "image/png", "article:published_time": "2022-08-12T08:12:57-07:00", "article:modified_time": "2022-08-13T08:04:47-07:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">2️⃣ Second resolution – led by 🇬🇧 🇨🇱 🇪🇺 with 60+ co-sponsors – calls for discussions on a <a href=\"https://twitter.com/hashtag/PandemicTreaty?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">#PandemicTreaty</a> to start later this year.</p><p>Negotiations may take time, but this is a historic step towards global health security.</p><p>(3/4)</p><p>— Simon Manley (@SimonManleyFCDO) <a href=\"https://twitter.com/SimonManleyFCDO/status/1397186144543166472?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">May 25, 2021</a></p></blockquote>"], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fworld-bank-creates-1-billion-fund-for-vaccine-passports%2F&text=World%20Bank%20Creates%20%241%20Billion%20Fund%20For%20Vaccine%20Passports", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fworld-bank-creates-1-billion-fund-for-vaccine-passports%2F", "https://parler.com/new-post?message=World%20Bank%20Creates%20%241%20Billion%20Fund%20For%20Vaccine%20Passports&url=https%3A%2F%2Fwww.technocracy.news%2Fworld-bank-creates-1-billion-fund-for-vaccine-passports%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fworld-bank-creates-1-billion-fund-for-vaccine-passports%2F&text=World%20Bank%20Creates%20%241%20Billion%20Fund%20For%20Vaccine%20Passports", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fworld-bank-creates-1-billion-fund-for-vaccine-passports%2F&title=World%20Bank%20Creates%20%241%20Billion%20Fund%20For%20Vaccine%20Passports", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=41637", "https://dailytelegraph.co.nz/news/watch-who-pandemic-treaty-back-to-the-drawing-board-after-russia-china-african-countries-raise-serious-concerns/", "https://apps.who.int/gb/inb/", "https://www.devex.com/news/majority-of-who-member-states-want-legally-binding-pandemic-instrument-103669", "https://www.statnews.com/2022/08/03/inching-closer-to-an-essential-global-pandemic-treaty/", "https://www.france24.com/en/live-news/20220701-world-bank-creates-fund-to-better-prevent-respond-to-pandemics", "https://childrenshealthdefense.org/defender/corporate-vaccine-mandates-passports-blackrock-vanguard/", "https://www.who.int/health-topics/international-health-regulations#tab=tab_1", "https://www.gov.uk/government/publications/international-health-regulations-2005-uk-national-focal-point-communications-protocol", "https://www.who.int/news/item/30-03-2021-global-leaders-unite-in-urgent-call-for-international-pandemic-treaty", "https://www.who.int/news/item/01-12-2021-world-health-assembly-agrees-to-launch-process-to-develop-historic-global-accord-on-pandemic-prevention-preparedness-and-response", "https://www.who.int/europe/about-us/governance/regional-committee/special-session-of-the-who-regional-committee-for-europe", "https://www.anhinternational.org/news/the-who-pandemic-treaty-a-backdoor-to-global-governance/", "https://www.consilium.europa.eu/en/press/press-releases/2021/05/20/eu-supports-start-of-who-process-for-establishment-of-pandemic-treaty-council-decision/", "https://www.who.int/publications/i/item/9789241580496", "https://dailysceptic.org/2022/05/11/the-biggest-global-power-grab-we-have-seen-in-our-lifetimes-how-serious-is-the-threat-from-the-who-pandemic-treaty/", "https://fctc.who.int/who-fctc/overview", "https://dailysceptic.org/2022/05/11/the-biggest-global-power-grab-we-have-seen-in-our-lifetimes-how-serious-is-the-threat-from-the-who-pandemic-treaty/", "https://dailysceptic.org/2022/05/11/the-biggest-global-power-grab-we-have-seen-in-our-lifetimes-how-serious-is-the-threat-from-the-who-pandemic-treaty/", "https://dailysceptic.org/2022/05/11/the-biggest-global-power-grab-we-have-seen-in-our-lifetimes-how-serious-is-the-threat-from-the-who-pandemic-treaty/", "https://dailysceptic.org/2022/05/11/the-biggest-global-power-grab-we-have-seen-in-our-lifetimes-how-serious-is-the-threat-from-the-who-pandemic-treaty/", "https://childrenshealthdefense.org/defender/pandemic-treaty-world-health-organization-cola/", "https://www.youtube.com/watch?v=q1OxAxIuVNU&ab_channel=TheHill", "https://dailytelegraph.co.nz/news/watch-who-pandemic-treaty-back-to-the-drawing-board-after-russia-china-african-countries-raise-serious-concerns/", "https://www.reuters.com/business/healthcare-pharmaceuticals/consensus-reached-year-end-talks-pandemic-treaty-south-africa-2021-05-25/", "https://www.reuters.com/business/healthcare-pharmaceuticals/consensus-reached-year-end-talks-pandemic-treaty-south-africa-2021-05-25/", "https://twitter.com/SimonManleyFCDO/status/1397186144543166472", "https://twitter.com/hashtag/PandemicTreaty?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/SimonManleyFCDO/status/1397186144543166472?ref_src=twsrc%5Etfw", "https://www.who.int/news/item/21-07-2022-pandemic-instrument-should-be-legally-binding--inb-meeting-concludes", "https://www.who.int/news/item/21-07-2022-pandemic-instrument-should-be-legally-binding--inb-meeting-concludes", "https://www.who.int/news/item/21-07-2022-pandemic-instrument-should-be-legally-binding--inb-meeting-concludes", "https://www.who.int/news/item/21-07-2022-pandemic-instrument-should-be-legally-binding--inb-meeting-concludes", "https://geneva.usmission.gov/2021/12/01/u-s-statement-on-world-health-assembly-special-session/", "https://geneva.usmission.gov/2021/12/01/u-s-statement-on-world-health-assembly-special-session/", "https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_21_6423", "https://childrenshealthdefense.org/defender/greece-covid-vaccine-mandate-senior-citizens/", "https://www.anhinternational.org/news/the-who-pandemic-treaty-a-backdoor-to-global-governance/", "https://twitter.com/WHO/status/1550848707737931777", "https://twitter.com/WHO/status/1550848707737931777", "https://childrenshealthdefense.org/defender/monkeypox-health-emergency-fda-kids-vaccines/", "https://www.swissinfo.ch/eng/who-chief-overrules-panel-to-call-monkeypox-global-emergency/47775614", "https://www.statnews.com/2022/08/03/inching-closer-to-an-essential-global-pandemic-treaty/", "https://www.efe.com/efe/espana/politica/espana-y-la-ocde-impulsan-unificacion-de-certificados-covid-en-el-mundo/10002-4847183", "https://childrenshealthdefense.org/defender/us-developing-vaccine-passport-system/", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.telekom.com/en/media/media-information/archive/covid-19-who-commissions-t-systems-648634", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.bbc.com/pidgin/articles/c80w27r8xkno", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://africacdc.org/trusted-travel/", "https://g20.org/g20-presidency-of-indonesia/", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.nakedcapitalism.com/2022/07/21-african-countries-just-quietly-embraced-vaccine-passports.html", "https://www.sasai.global/about-sasai/", "https://www.cassavatechnologies.com/sasai-fintech-and-mastercard-partners/", "https://newsroom.mastercard.com/mea/press-releases/london-econet-group-and-mastercard-to-collaborate-on-fintech-solutions-for-covid-19-response-in-africa/", "https://childrenshealthdefense.org/defender/us-developing-vaccine-passport-system/", "https://id2020.org/", "https://www.goodhealthpass.org/", "https://www.theguardian.com/politics/2022/jan/07/petition-to-revoke-tony-blairs-knighthood-hits-1m-signatures", "https://childrenshealthdefense.org/defender/personal-carbon-allowances-surveillance-capitalism/", "https://www.dezeen.com/2019/05/03/doconomy-climate-change-credit-card/", "https://childrenshealthdefense.org/defender/personal-carbon-allowances-surveillance-capitalism/", "https://id2020.org/", "https://id2020.org/alliance", "https://childrenshealthdefense.org/defender/rockefeller-foundation-reset-the-table-covid-food-shortage-crisis/", "https://childrenshealthdefense.org/defender/digital-surveillance-motive-behind-vaccinate-kids/", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-astrazeneca-vaccine-killed-shri-hitesh-kadve/", "https://money.cnn.com/quote/shareholders/shareholders.html?symb=MA&subView=institutional", "https://childrenshealthdefense.org/defender/corporate-vaccine-mandates-passports-blackrock-vanguard/", "https://id4d.worldbank.org/", "https://www.nakedcapitalism.com/2022/06/nyu-law-school-raises-alarm-on-large-scale-human-rights-violations-of-global-digital-identity-programs.html", "https://childrenshealthdefense.org/defender/digital-road-digital-id-systems-human-rights-violations/", "https://newsroom.mastercard.com/mea/press-releases/14429/", "https://www.france24.com/en/live-news/20220701-world-bank-creates-fund-to-better-prevent-respond-to-pandemics", "https://www.france24.com/en/live-news/20220701-world-bank-creates-fund-to-better-prevent-respond-to-pandemics", "https://www.weforum.org/press/2019/06/world-economic-forum-and-un-sign-strategic-partnership-framework/", "https://weforum.box.com/s/rdlgipawkjxi2vdaidw8npbtyach2qbt", "https://mobile.twitter.com/caelorumangelus/status/1549123326244798466", "https://www.weforum.org/focus/fourth-industrial-revolution", "https://reclaimthenet.org/doctor-is-fined-for-refusing-to-use-canadas-vaccine-passport/", "https://reclaimthenet.org/canadas-vaccine-passport-faces-federal-privacy-investigation/", "https://www.lifesitenews.com/news/canadian-doctor-fined-6000-for-refusing-to-use-travel-app-says-medical-history-none-of-feds-business/", "https://twitter.com/sikhfortruth/status/1496098251661000709", "https://childrenshealthdefense.org/defender/who-global-pandemic-treaty-world-bank-vaccine-passports/", "https://www.technocracy.news/mark-zuckerberg-torches-wealth-down-100-billion-in-year-10-billion-in-one-day/", "https://www.technocracy.news/kaboom-texas-bans-vaccine-passports/", "https://www.technocracy.news/7-key-reasons-why-vaccine-passports-are-a-dangerous-idea/", "https://www.technocracy.news/vaccine-passports-have-arrived-in-new-york/", "https://www.technocracy.news/china-seeks-to-run-global-database-for-vaccine-passports/", "https://www.technocracy.news/technocrat-vaccine-passports-will-inflict-economic-social-carnage/", "https://www.technocracy.news/vaccine-id-passports-merging-your-digital-identity-onto-the-blockchain/", "https://www.technocracy.news/ibm-colluded-with-hitler-now-leads-in-making-vaccine-passports/"], "authors": [], "publish_date": "2022-08-12T08:12:57-07:00"}