{"result_id": "283006", "URL": "https://www.technocracy.news/cdc-withheld-troves-of-critical-data-to-suppress-vaccine-hesitancy/", "timestamp": "2023-04-25 17:14:12 CEST+0200", "meta": {"description": "Americans should be demanding that the CDC be abolished for its role in stampeding unsuspecting Americans into accepting unapproved, experimental drugs. They didn't want to give fuel to vaccine skeptics, anti-vaxxers or advocates for true informed consent.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/cdc-withheld-troves-of-critical-data-to-suppress-vaccine-hesitancy/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "CDC Withheld Troves Of Critical Data To Suppress 'Vaccine Hesitancy'", "cleaned_text": "Americans should be demanding that the CDC be abolished for its role in stampeding unsuspecting Americans into accepting unapproved, experimental drugs. They didn’t want to give fuel to vaccine skeptics, anti-vaxxers or advocates for true informed consent.\n\n> Malone is calling on Americans to demand the full COVID-19 data from the CDC and FDA, and for those in government who have lied to the American people to be held legally accountable\n\n> The CDC didn’t publish the data over concerns that it would be “misinterpreted,” but the only way the data could be interpreted as ineffective is if they show the shots don’t work\n\n> The CDC published data on boosters’ effectiveness in adults under 65, but didn’t include data for 18- to 49-year-olds, “the group least likely to benefit from extra shots”\n\n> Data such as U.S. hospitalizations for COVID-19 according to age, race and injection status have been collected by the CDC for more than a year but most of it hasn’t been made public\n\nIf you’ve felt like crucial data about COVID-19 have been missing since the start of the pandemic, it’s not in your head. An exposé by The New York Times has revealed that the U.S. Centers for Disease Control and Prevention has actually been collecting data all along — it just hasn’t published most of it.1\n\nData such as U.S. hospitalizations for COVID-19 according to age, race and injection status would have certainly been of interest to a large portion of the U.S. population. The CDC has been collecting such data for more than a year but hasn’t made the bulk of it public, the Times reported. What else has the CDC been keeping from the public?\n\nFor one thing, data on the effectiveness of COVID-19 boosters are missing. While the CDC published data on boosters’ effectiveness in adults under 65, this didn’t include data for 18- to 49-year-olds, a sizeable percentage of the population that also — coincidentally? — is “the group least likely to benefit from extra shots,” the Times pointed out.2\n\nCDC Has Released ‘Only a Fraction’ of Its COVID Data\n\nAccording to CDC spokeswoman Kristen Nordlund, the agency hasn’t released all of the data “because basically, at the end of the day, it’s not yet ready for prime time.”3 But, the Times reported, “Another reason is fear that the information might be misinterpreted, Ms. Nordlund said.”4\n\nAmong the additional data that the CDC kept quiet was wastewater data, which can give insight into COVID-19 case numbers in different areas. The CDC only recently released a wastewater data dashboard, even though certain states and cities have been providing such data to them since the pandemic began.5 Reportedly, several sources told the Times that the CDC “has published only a tiny fraction of the data it has collected.”\n\nAs the Times put it, the CDC’s refusal to post pertinent data left state and local health departments at a disadvantage:\n\n“Much of the withheld information could help state and local health officials better target their efforts to bring the virus under control. Detailed, timely data on hospitalizations by age and race would help health officials identify and help the populations at highest risk.\n\nInformation on hospitalizations and death by age and vaccination status would have helped inform whether healthy adults needed booster shots. And wastewater surveillance across the nation would spot outbreaks and emerging variants early.”\n\nThe Times spoke with public health experts who said they had begged the CDC to release this type of COVID-19 data for two years and were “stunned” when they found out the agency had it all along.\n\nThe rational conclusion is that, had the data revealed what the CDC wanted, it would have released it. In their official reasoning, however, Nordlund said the data represents only 10% of the U.S. population, using that as an argument for why they didn’t release it. “But the CDC has relied on the same level of sampling to track influenza for years,” the Times pointed out. Further, it noted:7\n\n“[T]he C.D.C. has been routinely collecting information since the Covid vaccines were first rolled out last year, according to a federal official familiar with the effort. The agency has been reluctant to make those figures public, the official said, because they might be misinterpreted as the vaccines being ineffective.”\n\nMisinterpreted? “Let’s be clear,” Steve Kirsch, executive director of the Vaccine Safety Research Foundation wrote.8 “The only way the vaccine data could be interpreted as ineffective by us ‘misinformation spreaders’ is if the data shows the vaccines don’t work … The truth is the data didn’t support their narrative so they hid it. Do you think they would hide the data if it showed the vaccines worked? Of course not!”\n\nIn short, he wrote, the “CDC admits it withheld data from the public because they didn’t want to create vaccine hesitancy.”9 Transparency with data is key to building public trust and fostering open scientific debate, not to mention making sound public health guidelines. We now know the CDC has been hiding data, likely because its numbers don’t support the story they’ve been churning. The Gateway Pundit wrote:10\n\n“So much for the bogus lie that has been pushed by public health officials for months, claiming that breakthrough infections weren’t being tracked at all. The medical elites just decided to hide the data because it didn’t fit the approved narrative, and, naturally, blamed the potential for ‘misinformation’ as justification for the coverup.”\n\nIn a tweet, Dr. Nicole Saphier, with the Memorial Sloan Kettering Cancer Center, shared her dismay in finding out that the CDC has been actively censoring which data to share with the public:11\n\n“The CDC’s response when questioned about their withholding of Covid data and lack of transparency is essentially “we don’t trust you to be able to understand the truth.” The condescension is palpable. The wheels are finally coming off.”\n\nIt’s not only in the U.S. that health officials are cherry-picking data to support one agenda. Public Health Scotland (PHS) announced in February 2022 that it would stop publishing COVID-19 death and hospitalization data according to injection status. Like the CDC, their reasoning was concern that the data would be misrepresented by anti-vaxxers.12\n\nThe thing about data is, however, that it doesn’t lie — assuming it’s presented in full, unadulterated form. The only way such data could increase concerns about the safety and effectiveness of COVID-19 shots is if it showed that they’re ineffective and unsafe.\n\nNow, instead of publishing full data for the public to analyze and have informed consent, the CDC plans to “do a lot more on the vaccine effectiveness side and try and make people understand how effective the vaccine is.”13 It’s this type of unified front across the globe that has many patriots, including former BlackRock portfolio manager Edward Dowd, calling foul. He said:14\n\n“The responses from governments to this virus that doesn’t kill 99.9% of us makes no sense. And they’re all unified in their determination to put in these systems — these digital vaccination/passport systems. They’re all globally synced. They all want us to get these jabs, and it’s too unified. I suspect there’s a problem coming down the road.”\n\nDr. Robert Malone, inventor of the mRNA and DNA vaccine core platform technology, believes that the CDC withholding evidence about COVID-19 shot safety is scientific fraud.15 He is calling on Americans to demand the full COVID-19 data from the CDC, and for the U.S. Food and Drug Administration and those in government who have lied to the American people to be held legally accountable:16\n\n“If the CDC released the age stratified data for COVID, it would be clear that a vaccine for most Americans is not necessary. If the vaccine risk ratio of those vaccinated and hospitalized were published for Omicron — it would be clear that the vaccine benefit is not observed.\n\nThe FDA have not revealed what the efficacy of the boosters for children is. They have not released the safety data. They have withheld the safety data on the vaccines for children and adults.\n\nThis must stop. We are deep into outright Scientific Fraud territory. Let’s remember where this started … We have been manipulated from the VERY start of this pandemic. The government has been deciding what has been written, removed, censored by media and the big tech giants. This is propaganda.”\n\nEven Dr. Yvonne Maldonado, chair of the American Academy of Pediatrics’s (AAP) Committee on Infectious Diseases, told The New York Times that they had been asking the CDC for data on children hospitalized with COVID-19, such as the proportion who have underlying medical conditions. On an information call with the CDC, they were told the data were unavailable.17\n\nAAP also tried to find out from the CDC on multiple occasions how contagious people are five days after COVID-19 symptoms begin, to no avail, only to find out the information from a New York Times article they tracked down in December 2021. “They’ve known this for over a year and a half, right, and they haven’t told us,” she told the Times. “I mean, you can’t find out anything from them.”18\n\nShould US Encourage Booster Shots for Children?\n\nMalone is among those who have called COVID-19 injection mandates “completely unjustified” for children19 and recommends that youth who have received COVID-19 injections have their heart checked for damage,20 given the real risk of myocarditis and heart damage.\n\nThe U.S. is also an outlier globally in recommending that children ages 12 years and older should not only get COVID-19 shots but also a booster shot.21 While many countries are urging caution in COVID-19 shots and boosters for children, the CDC is moving full steam ahead, all while hiding data that could help U.S. parents make an informed decision for their children.\n\nIn the video above, author David Zweig explains that he interviewed a member of the CDC’s advisory committee and learned that a primary motivation for the agency recommending COVID-19 shots to kids isn’t to prevent severe illness, but to prevent mild or even asymptomatic infection. What’s more, an official told him that even this would likely only be beneficial for around two months, before the antibody boost begins to wane.22\n\nData presented at the meeting also showed that for young males, the shots increased the risk of injection-induced myocarditis enough so that it canceled out any benefit in avoiding hospitalizations from COVID-19. “So we have to really think through whether this is a worthwhile endeavor, and certainly one that should be mandated,” Zweig said.\n\nInterestingly, the CDC officials spent one hour of the meeting discussing whether they should use the word “may” or “should” when it comes to recommending COVID-19 shots for children, and they settled on “should.” This term, Zweig said, is what can ultimately lead to mandates as the next step.23\n\nGiven the bombshell news that the CDC has been hiding COVID-19 data from the American people, parents and individuals must look beyond these official sources in their search for the truth. As Kirsch put it, “Let’s be clear. The CDC hid the data because the data proves they were lying to us. That’s the real reason. If the data was favorable, I guarantee you, they would be releasing it.”24", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC Withheld Troves Of Critical Data To Suppress 'Vaccine Hesitancy'", "description": "Americans should be demanding that the CDC be abolished for its role in stampeding unsuspecting Americans into accepting unapproved, experimental drugs. They didn't want to give fuel to vaccine skeptics, anti-vaxxers or advocates for true informed consent.", "url": "https://www.technocracy.news/cdc-withheld-troves-of-critical-data-to-suppress-vaccine-hesitancy/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Censorship", "image": "https://www.technocracy.news/wp-content/uploads/2020/04/CDC-headwuarters.jpg", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2020/04/CDC-headwuarters.jpg", "image:width": "1280", "image:height": "860", "image:alt": "CDC", "image:type": "image/jpeg", "article:published_time": "2022-03-01T08:19:25-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://archive.is/gpt9W", "https://stevekirsch.substack.com/p/cdc-admits-it-withheld-data-from", "https://www.thegatewaypundit.com/2022/02/cdc-officials-admit-agency-withheld-critical-covid-information-public-including-data-breakthrough-infections-fears-vaccine-hesitancy/", "https://twitter.com/NBSaphierMD/status/1495475546104508416", "https://www.glasgowtimes.co.uk/news/19931641.covid-data-will-not-published-concerns-misrepresented-anti-vaxxers/", "https://zeeemedia.com/interview/edward-dowd-former-blackrock-portfolio-manager-pfizer-fda-fraud-financial-collapse-imminent/", "https://rwmalonemd.substack.com/p/we-the-people-demand-to-see-the-data", "https://www.youtube.com/watch?v=9jMONZMuS2U", "https://rumble.com/vtx0go--watch-live-candace-owens-with-dr.-robert-malone-pt.-2-9pm-est.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/children-teens.html", "https://rumble.com/vtqzyw-debate-should-the-us-encourage-covid-19-booster-shots-for-children.html", "https://rumble.com/vtqzyw-debate-should-the-us-encourage-covid-19-booster-shots-for-children.html"], "authors": [], "publish_date": "2022-03-01T08:19:25-07:00"}