{"result_id": "283012", "URL": "https://www.technocracy.news/technocracy-how-vaccine-mandates-became-a-political-weapon/", "timestamp": "2023-04-25 17:14:27 CEST+0200", "meta": {"description": "Although this article focuses on the current Administration, it is a global strategy employed by Technocrats around the world. Surely the injections have a separate but related purpose, using governments to enforce dystopian policies is clearly observed. When their usefulness is over, these same governments will be thrown under the Technocrat bus.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/technocracy-how-vaccine-mandates-became-a-political-weapon/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Technocracy: How Vaccine Mandates Became A Political Weapon", "cleaned_text": "Just before Christmas, as the Omicron surge was picking up steam, White House coronavirus response coordinator Jeffrey Zients issued a remarkable statement. He began by reassuring “the vaccinated” that “you’ve done the right thing, and we will get through this”, but followed this optimistic bromide with a dose of fire and brimstone: “For the unvaccinated, you’re looking at a winter of severe illness and death for yourselves, your families, and the hospitals you may soon overwhelm.”\n\nThis rhetoric seemed unlikely to spook any of the vaccine-hesitant into getting jabbed. After all, they have already been exposed to plenty of dire warnings about the virus, and are unlikely to be receptive to the admonitions of an administration they have already ignored. Rather, the real addressees of Zients’s sermon were the vaccinated, who could assure themselves that they are on the side of the good.\n\nEarly in the Covid era, many believed the virus had made clear that “we’re all in this together”. The pandemic, we were told, would instil a sense of collective responsibility premised on our biological interconnectedness. Yet the reality, starkly revealed by Zients’s proclamation, is that we have entered a new age of biopolitical balkanisation, evident not only in the drastic policy divergence between red and blue states but also in the latter’s attempts to exclude the unvaccinated from public life.\n\nZients’s boss, Joe Biden, campaigned on the idea that technocratic competence and faith in expertise would end the pandemic. He also promised to scale back the culture wars of the Trump era. “We can,” he said in his inaugural address, “join forces, stop the shouting, and lower the temperature.” This may have been standard political pablum, but it reflected a genuine hope that a less divisive — even pleasantly boring — four years might follow the tumultuous Trump era.\n\nInstead, a year into the Biden administration, we have seen a ratcheting up of the propagandistic weaponisation of “science” and a series of self-inflicted blows to the credibility of experts. Much has been said about the CDC’s inconsistent messaging, and during the current Omicron surge, as during previous surges, the administration has been criticised both for being overly aggressive and overly timid. But underlying these inconsistencies is a new mode of liberal technocratic governance, driven by moralising fervour and partisan animus rather than calm neutrality and rational calculation.\n\nThis new strategy of rule places Biden’s administration in contrast with Barack Obama’s, in which he served as Vice President. Although the soaring rhetoric of his 2008 campaign sometimes suggested otherwise, Obama was motivated by a conviction that competent management, not visionary speeches, could unite the nation. The former law professor’s wonkish impulses and academic connections led him to the burgeoning field of behavioural economics, in particular the work of his erstwhile University of Chicago colleague Cass Sunstein, who served as his regulatory tsar between 2009 and 2012.\n\nSunstein pioneered the approach known as the “nudge”, which gave the title to the 2008 book he co-authored with Richard Thaler. Instead of mandating or proscribing behaviours, Sunstein suggested, governments might alter “choice architecture” to tacitly incentivise desired behaviours and discourage undesired ones. An oft-cited instance is making opt-in the default on certain decisions, like signing up for retirement contributions or the organ donor registry. These apparently small changes, “nudgers” believed, could re-engineer mass behaviour in a prosocial direction. Sunstein and Thaler, David V. Johnson notes, claimed to have “found the Golden Mean between Reagan free-market conservatism and FDR state-guided liberalism”. Their ideas had a natural appeal to a president who had promised to overcome the divisions between red and blue America.\n\nDuring his second term, Obama signed an executive order committing the government to “using behavioural science insights” and launched a Social and ‘Behavioral Science Team’ that put “nudge theory” into practice. The results of these initiatives were modest. For example, the administration attempted to use text message reminders to increase college matriculation among low-income high school graduates. Such efforts, a reminder of the pre-2016 period when tinkering around the edges of the possible was still seen as a noble and vital mode of governance, seem quaint today.\n\nIn his writings, Sunstein directly contrasts nudge-type efforts with mandates, and argues the former are preferable because they are “choice-preserving”. For example, making green energy preferences on utilities the default option predisposes consumers towards environmentally favourable choices, but still gives them an escape. To those chafing against Covid mandates, this “libertarian paternalism” might seem preferable to the current style of Democratic governance.\n\nBut behavioural economics also received its share of criticisms at the peak of its influence. Critics argued that nudge-type policies are often attempts to bypass collective deliberation on issues of common concern. Yet this was one of the sources of their appeal: after the 2010 midterms, the White House faced a hostile Congress that thwarted Obama’s ambitions. For an executive boxed in in this way, as Johnson remarked in the final months of the administration, “a nudge can secure policy success without requiring Congressional approval”.\n\nIn the Covid era, the Biden administration and its state-level allies have made a hard pivot away from the nudge approach towards an embrace of mandates. The presumed justification for this shift is that the severity of the Covid crisis required more drastic measures. But something else differentiates Covid technocracy from its predecessors: a remarkable incuriosity about whether the strictures it imposes actually work. This incuriosity has become all the more glaring in recent weeks, as Omicron has brought cases to unprecedented levels in cities like New York, where both vaccine passports and mask mandates are in effect.\n\nThe nudge approach, on the other hand, is at least ostensibly outcome-oriented: it assesses interventions on the basis of their measurable impact. So one of the problems with mandates, from the nudgers’ perspective, is that they risk conflating intention and outcome. Mandates are often difficult to enforce and generate backlashes, and thus may prove counterproductive. But they may remain in force, despite failing to achieve their objectives, because they demonstrate a moral commitment to a desired aim.\n\nAnd as Zients’s holiday announcement demonstrated, when mandates fail to achieve the desired results, it is the fault of those who don’t follow the rules, not those who imposed them. A more empirical approach would treat the reality of noncompliance as part of what needs to be measured in order to assess the efficacy of a proposed policy. But such a strategy would imply that the technocrats themselves, rather than the anti-vaxxers or anti-maskers, should be held accountable for policy failures. Small wonder it has fallen out of favour.\n\nBefore last year it might have seemed obvious that the guiding ethos of technocracy was cold utilitarian calculus, but in the past two years it has become something like the opposite: moral fervour. Various factors brought about this shift, but the reaction of the technocrats and their constituency to Trump, with his “war on the administrative state” and love of the “poorly educated”, was arguably the crucial one. Tinkering behind the scenes, as was favoured in the Obama era, was no longer a viable approach for a class that felt its interests threatened.\n\nEarly on in the pandemic, the writer Alex Hochuli described the pandemic as “technocracy’s end-of-life rally”. At least temporarily, it had put the experts maligned over the previous half-decade back in the drivers’ seat. But the populist fervour that had driven the Trump movement re-energised itself in reaction to lockdowns and mask and vaccine mandates. Initially, this seemed to place the technocrats in an unassailable position, since they could impugn their allies as aiders and abettors of disease and death.", "opengraph": {"locale": "en_US", "type": "article", "title": "Technocracy: How Vaccine Mandates Became A Political Weapon", "description": "Although this article focuses on the current Administration, it is a global strategy employed by Technocrats around the world. Surely the injections have a separate but related purpose, using governments to enforce dystopian policies is clearly observed. When their usefulness is over, these same governments will be thrown under the Technocrat bus.", "url": "https://www.technocracy.news/technocracy-how-vaccine-mandates-became-a-political-weapon/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Government", "image": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-14-at-9.45.31-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-14-at-9.45.31-AM.png", "image:width": "1444", "image:height": "814", "image:alt": "Technocracy", "image:type": "image/png", "article:published_time": "2022-01-14T09:46:12-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Ftechnocracy-how-vaccine-mandates-became-a-political-weapon%2F&text=Technocracy%3A%20How%20Vaccine%20Mandates%20Became%20A%20Political%20Weapon", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Ftechnocracy-how-vaccine-mandates-became-a-political-weapon%2F", "https://parler.com/new-post?message=Technocracy%3A%20How%20Vaccine%20Mandates%20Became%20A%20Political%20Weapon&url=https%3A%2F%2Fwww.technocracy.news%2Ftechnocracy-how-vaccine-mandates-became-a-political-weapon%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Ftechnocracy-how-vaccine-mandates-became-a-political-weapon%2F&text=Technocracy%3A%20How%20Vaccine%20Mandates%20Became%20A%20Political%20Weapon", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Ftechnocracy-how-vaccine-mandates-became-a-political-weapon%2F&title=Technocracy%3A%20How%20Vaccine%20Mandates%20Became%20A%20Political%20Weapon", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=39307", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/12/17/press-briefing-by-white-house-covid-19-response-team-and-public-health-officials-74/", "https://damagemag.com/2020/05/08/technocracys-end-of-life-rally/", "https://damagemag.com/2020/05/08/technocracys-end-of-life-rally/", "https://damagemag.com/2020/05/08/technocracys-end-of-life-rally/", "https://www.cnn.com/2021/12/17/health/us-coronavirus-friday/index.html", "https://damagemag.com/2020/05/08/technocracys-end-of-life-rally/", "https://unherd.com/2022/01/how-vaccine-mandates-became-a-political-weapon/", "https://www.technocracy.news/covid-became-excuse-to-run-statewide-surveillance-programs/", "https://www.technocracy.news/mexico-became-largest-user-of-worlds-most-notorious-spy-tool/", "https://www.technocracy.news/us-army-is-building-the-worlds-most-powerful-laser-weapon/", "https://www.technocracy.news/pegasus-unveiled-the-cyber-surveillance-weapon-of-scientific-dictatorship/", "https://www.technocracy.news/internet-shutdown-emerging-as-authoritarian-weapon-of-choice/", "https://www.technocracy.news/new-navy-weapon-can-stop-you-from-talking/", "https://www.technocracy.news/wood-on-free-speech-the-weapon-to-fight-scientific-dictatorship/", "https://www.technocracy.news/how-technocrats-turned-your-face-into-a-weapon-of-war/"], "authors": [], "publish_date": "2022-01-14T09:46:12-07:00"}