{"result_id": "283030", "URL": "https://www.technocracy.news/humans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines/", "timestamp": "2023-04-25 17:15:18 CEST+0200", "meta": {"description": "DARPA is the Technocrat/Transhumanist dark arm of the military/biodefense industry. mRNA \"vaccines\" were initially considered for military use against biowarfare, but Moderna was used to test the concept on the entire global population. The results have been disastrous but leaders refuse to stop the injections. The cozy relationship between DARPA and Moderna needs to be blown wide open.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/humans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Humans as Bioreactors: How DARPA pioneered the idea behind mRNA vaccines", "cleaned_text": "A nucleic acid vaccine is a vaccine that uses gene delivery methods, such as lipid nanoparticles or viral vectors, to deliver some quantity of either DNA or RNA into a cell. The cell’s own machinery, in the form of RNA polymerases and ribosomes, uses these nucleic acids as instructions to synthesize proteins. In the case of a nucleic acid vaccine, the protein in question is usually one of the structural proteins of a virus, with the aim of generating an antibody response against that specific protein, but this isn’t the only type of product that nucleic acid transfection can produce. Gene transfection into cells can, in fact, make those cells produce any kind of protein, with the right instructions, including monoclonal antibodies, designer receptors, anything imaginable.\n\nIn the case of the COVID-19 vaccines, the media and the medical establishment tried getting around this by arguing that since the vaccines did not change the recipient’s DNA, that meant that they weren’t gene therapy. The introduction of foreign nucleic acids into the body to generate foreign proteins is, by definition, gene therapy, regardless of whether or not the subject’s own genes are changed by it. DNA and RNA are genetic material, and if the immune system catches a cell producing non-human proteins, some seriously bad things will happen to that cell.\n\nUnlike a virus, which only binds to specific host factors expressed by specific cell lines and is endocytosed in those specific cells, cationic lipids, like the LNPs used in mRNA vaccines, are capable of transfecting basically any type of cell with instructions to make proteins. LNPs were investigated for many years as a means of delivering Alzheimer’s drugs to the brain, because theyreadily bypass the blood-brain barrier.\n\nWhen the thing being delivered is a toxin, like SARS-CoV-2 Spike, however, there are serious consequences.\n\nMDPI – A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against COVID-19\n\nThe current report presents the case of a 76-year-old man with Parkinson’s disease (PD) who died three weeks after receiving his third COVID-19 vaccination. The patient was first vaccinated in May 2021 with the ChAdOx1 nCov-19 vector vaccine, followed by two doses of the BNT162b2 mRNA vaccine in July and December 2021. The family of the deceased requested an autopsy due to ambiguous clinical signs before death. PD was confirmed by post-mortem examinations. Furthermore, signs of aspiration pneumonia and systemic arteriosclerosis were evident. However, histopathological analyses of the brain uncovered previously unsuspected findings, including acute vasculitis (predominantly lymphocytic) as well as multifocal necrotizing encephalitis of unknown etiology with pronounced inflammation including glial and lymphocytic reaction. In the heart, signs of chronic cardiomyopathy as well as mild acute lympho-histiocytic myocarditis and vasculitis were present. Although there was no history of COVID-19 for this patient, immunohistochemistry for SARS-CoV-2 antigens (spike and nucleocapsid proteins) was performed. Surprisingly, only spike protein but no nucleocapsid protein could be detected within the foci of inflammation in both the brain and the heart, particularly in the endothelial cells of small blood vessels. Since no nucleocapsid protein could be detected, the presence of spike protein must be ascribed to vaccination rather than to viral infection. The findings corroborate previous reports of encephalitis and myocarditis caused by gene-based COVID-19 vaccines.\n\nThere has been a major push for the adoption of nucleic acid vaccine tech in prior years, largely hidden from the public eye. In order to begin tracing it out, one must simply perform date range searches for the years prior to 2020, for nucleic acid vaccines. The cheerleaders of this technology immediately reveal themselves.\n\nmRNA vaccines represent a promising alternative to conventional vaccine approaches because of their high potency, capacity for rapid development and potential for low-cost manufacture and safe administration. However, their application has until recently been restricted by the instability and inefficient in vivo delivery of mRNA. Recent technological advances have now largely overcome these issues, and multiple mRNA vaccine platforms against infectious diseases and several types of cancer have demonstrated encouraging results in both animal models and humans. This Review provides a detailed overview of mRNA vaccines and considers future directions and challenges in advancing this promising vaccine platform to widespread therapeutic use.\n\nDuring the last two decades, there has been broad interest in RNA-based technologies for the development of prophylactic and therapeutic vaccines. Preclinical and clinical trials have shown that mRNA vaccines provide a safe and long-lasting immune response in animal models and humans. In this review, we summarize current research progress on mRNA vaccines, which have the potential to be quick-manufactured and to become powerful tools against infectious disease and we highlight the bright future of their design and applications.\n\nInternational Journal of Nanomedicine – Development of nucleic acid vaccines: use of self-amplifying RNA in lipid nanoparticles\n\nSelf-amplifying RNA or RNA replicon is a form of nucleic acid-based vaccine derived from either positive-strand or negative-strand RNA viruses. The gene sequences encoding structural proteins in these RNA viruses are replaced by mRNA encoding antigens of interest as well as by RNA polymerase for replication and transcription. This kind of vaccine has been successfully assayed with many different antigens as vaccines candidates, and has been shown to be potent in several animal species, including mice, nonhuman primates, and humans. A key challenge to realizing the broad potential of self-amplifying vaccines is the need for safe and effective delivery methods. Ideally, an RNA nanocarrier should provide protection from blood nucleases and extended blood circulation, which ultimately would increase the possibility of reaching the target tissue. The delivery system must then be internalized by the target cell and, upon receptor-mediated endocytosis, must be able to escape from the endosomal compartment into the cell cytoplasm, where the RNA machinery is located, while avoiding degradation by lysosomal enzymes. Further, delivery systems for systemic administration ought to be well tolerated upon administration. They should be safe, enabling the multiadministration treatment modalities required for improved clinical outcomes and, from a developmental point of view, production of large batches with reproducible specifications is also desirable. In this review, the concept of self-amplifying RNA vaccines and the most promising lipid-based delivery systems are discussed.\n\nEstablishing the effective use of ‘naked’ nucleic acids as vaccines would undoubtedly be one of the most important advances in the history of vaccinology. While nucleic acids show much promise for use as vaccine vectors in experimental animals, not a single naked nucleic acid vector has been approved for use in humans. Indeed, data from human clinical trials is scant: nucleic acid vaccines have not been clearly demonstrated to have any convincing efficacy in the prevention or treatment of infectious disease or cancer. Here we illustrate possible mechanisms underlying effective nucleic acid vaccination. We focus on progress that has been made in the improvement of their function. Additionally, we identify promising new strategies and try to forecast future developments that could lead to the real success of nucleic acid vaccines in the prevention and treatment of human disease.\n\nCell Press Molecular Therapy – Self-Amplifying RNA Vaccines Give Equivalent Protection against Influenza to mRNA Vaccines but at Much Lower Doses\n\nNew vaccine platforms are needed to address the time gap between pathogen emergence and vaccine licensure. RNA-based vaccines are an attractive candidate for this role: they are safe, are produced cell free, and can be rapidly generated in response to pathogen emergence. Two RNA vaccine platforms are available: synthetic mRNA molecules encoding only the antigen of interest and self-amplifying RNA (sa-RNA). sa-RNA is virally derived and encodes both the antigen of interest and proteins enabling RNA vaccine replication. Both platforms have been shown to induce an immune response, but it is not clear which approach is optimal. In the current studies, we compared synthetic mRNA and sa-RNA expressing influenza virus hemagglutinin. Both platforms were protective, but equivalent levels of protection were achieved using 1.25 μg sa-RNA compared to 80 μg mRNA (64-fold less material). Having determined that sa-RNA was more effective than mRNA, we tested hemagglutinin from three strains of influenza H1N1, H3N2 (X31), and B (Massachusetts) as sa-RNA vaccines, and all protected against challenge infection. When sa-RNA was combined in a trivalent formulation, it protected against sequential H1N1 and H3N2 challenges. From this we conclude that sa-RNA is a promising platform for vaccines against viral diseases.\n\nAgain and again, the same properties are touted; easy, rapid, cost-effective development and manufacture. Plug in a gene sequence for the targeted antigen and away you go.\n\nNaturally, the military would be interested in this technology for quickly vaccinating large populations of people against bioweapons ahead of pandemic spread, because it offers the potential for rapid development and deployment of countermeasures in a wartime scenario with equally rapid-developed bioweapons being flung all over the place.\n\nADEPT is a DARPA program that began in 2012. The acronym stands for Autonomous Diagnostics to Enable Prevention and Therapeutics. PROTECT is a sub-program of ADEPT, and it stands for Prophylactic Options to Environmental and Contagious Threats.\n\nSome quick searches reveal presentation slides about the project:\n\nRapid, distributed diagnostics, vaccines, and therapeutics brought to the warfighter.\n\nPROTECT provides prophylactic protection against disease by treating people with nucleic acid constructs that encode protective monoclonal antibodies.\n\nDARPA pioneered the use of the body as a bioreactor to produce prophylactic antibodies to protect against biothreats\n\nApparently, the goal of ADEPT: PROTECT was to come up with nucleic acid delivery systems that encoded monoclonal antibodies (or mAbs) against specific pathogens that may be used in biowarfare, such as Influenza, Smallpox, SARS, Chikungunya, Rabies, Anthrax bacteria, and even Ricin, nerve agents, and prions.\n\nAntibodies are the means by which the adaptive immune system tags things for destruction and disposal. They lock over the surface proteins of pathogens and guide inactivated viruses and bacteria into leukocytes, encourage complement activation, and so on. Monoclonal antibodies are essentially copies of one specific kind of antibody, for therapeutic use. This differs slightly from how mRNA vaccines have ended up being used; generating the target antigen protein instead, and letting the body manufacture antibodies against it.\n\nIn DARPA’s own words, they partnered with Moderna to produce mRNA-1944, a nucleic acid-encoded mAb against chikungunya:\n\nIn fact, DARPA openly brag on Twitter that Moderna’s mRNA vaccine tech – and, by extension, mRNA-1273, was a product of ADEPT:\n\nWhat’s really going on, here? Why haven’t the media extensively covered the military think tank side of all of this, as well as DARPA’s enduring partnership with Moderna?\n\nModerna failed to disclose federal funding for vaccine patent applications, advocates say\n\nAn advocacy group has asked the Department of Defense to investigate what it called “an apparent failure” by Moderna (MRNA) to disclose millions of dollars in awards received from the Defense Advanced Research Projects Agency in patent applications the company filed for vaccines.\n\nIn a letter to the agency, Knowledge Ecology International explained that areview of dozens of patent applications found the company received approximately $20 million from the federal government in grants several years ago and the funds “likely” led to the creation of its vaccine technology. This was used to develop vaccines to combat different viruses, such as Zika and, later, the virus that causes Covid-19.\n\nIn arguing for an investigation, the advocacy group maintained Moderna is obligated under federal law to disclose the grants that led to nearly a dozen specific patent applications and explained the financial support means the U.S. government would have certain rights over the patents. In other words, U.S. taxpayers would have an ownership stake in vaccines developed by the company.\n\nThere is an extensive paper trail, here, one that shows that Moderna is just another front in the Biodefense Mafia. The media, with few exceptions, are largely silent on this matter.\n\nIf we are at war – and at this point, only an idiot would fail to see that we are – then who fired the first shot? Why are world leaders so tight-lipped about all of this? Well, it’s simple, really.\n\nThe reason why you have been kept in the dark is because you are the target of a globe-spanning military operation, with population reduction, mass surveillance, tyrannical control of people’s movements, and the destruction of human autonomy through implanted technology as its end goal.\n\nIn all of the affluent nations operating under the globalist managerial rules-based order of private-public partnerships, NGOs, and supranational organizations, the only real threats to the ruling class are resurgent nationalism, populism, and traditionalism, because these things invariably lead to protectionist economic policies that divert resources away from the already magnificently wealthy ruling class and towards the middle.\n\nPopulism is only a problem for the rich and powerful if there are people to embody it. No people, no problem. Hence the reliance on bioweapons and poisonous vaccines. The Neo-Malthusian ruling class want to kill off insolent, rebellious, resource-overconsuming plebeians, keep the valuable infrastructure intact, and profit off of it, after they corral just enough survivors to keep their global consumerist orgy going.\n\nThey aren’t even discreet about it. They openly revel in their extraordinarily grandiose ideas.\n\nThese people want to control you, and if they can’t control you, then they want to replace you with someone they can. The word for this condition is megalomania.\n\n: a mania (see MANIA sense 2a) for great or grandiose performancean outburst of wildly extravagant commercial megalomania The Times Literary Supplement (London)\n\n: a delusional mental illness that is marked by feelings of personalomnipotence and grandeur\n\nWe must throw all of our energy into exposing these people and dismantling their tyrannical institutions. As they have clearly violated the social contract and are scrambling desperately to conceal that fact, there is no point whatsoever in obeying them. Their authority is now illegitimate.\n\nWe have every right to defend ourselves and our kin from murderous despots who plot against us in the dark.", "opengraph": {"locale": "en_US", "type": "article", "title": "Humans as Bioreactors: How DARPA pioneered the idea behind mRNA vaccines", "description": "DARPA is the Technocrat/Transhumanist dark arm of the military/biodefense industry. mRNA \"vaccines\" were initially considered for military use against biowarfare, but Moderna was used to test the concept on the entire global population. The results have been disastrous but leaders refuse to stop the injections. The cozy relationship between DARPA and Moderna needs to be blown wide open.", "url": "https://www.technocracy.news/humans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Genetic Engineering", "image": "https://www.technocracy.news/wp-content/uploads/2022/10/Screen-Shot-2022-10-13-at-9.06.36-PM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/10/Screen-Shot-2022-10-13-at-9.06.36-PM.png", "image:width": "1386", "image:height": "874", "image:alt": "DARPA", "image:type": "image/png", "article:published_time": "2022-10-13T21:11:46-07:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">For past several years, DARPA has been pioneering a powerful new type of countermeasure against infectious disease called gene-encoded antibodies. They work by providing cells with genetic instructions for producing one or more highly protective antibodies against a given threat. <a href=\"https://t.co/h2gz8fuOXJ\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/h2gz8fuOXJ</a></p><p>— DARPA (@DARPA) <a href=\"https://twitter.com/DARPA/status/1093271185159266304?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">February 6, 2019</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Via the ADEPT program, DARPA was an early investor in Moderna's  mRNA therapeutics &amp; vaccines. The company announced today their experimental coronavirus vaccine, built in part on this groundbreaking work, is nearly 95% effective at preventing illness: <a href=\"https://t.co/OCi5MEQiVg\" rel=\"nofollow\" target=\"_blank\">https://t.co/OCi5MEQiVg</a></p><p>— DARPA (@DARPA) <a href=\"https://twitter.com/DARPA/status/1328362213686513665?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">November 16, 2020</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Yuval Noah Harari, historian, futurist, and World Economic Forum (WEF) adviser, said,</p><p>“We just don’t need the vast majority of the population” in the early 21st century …..  Making human labor economically and militarily “redundant.”</p><p>\"Useless eaters\" to be culled…. <a href=\"https://t.co/iekSBeL67a\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/iekSBeL67a</a></p><p>— Zaid Hamid (@ZaidZamanHamid) <a href=\"https://twitter.com/ZaidZamanHamid/status/1560007193835016192?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">August 17, 2022</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe title=\"Yuval Noah Harari: Workplace Automation &amp; the &quot;Useless Class&quot;\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/OMDlfNWM1fA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/OMDlfNWM1fA?feature=oembed"}], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fhumans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines%2F&text=Humans%20as%20Bioreactors%3A%20How%20DARPA%20pioneered%20the%20idea%20behind%20mRNA%20vaccines", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fhumans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines%2F", "https://parler.com/new-post?message=Humans%20as%20Bioreactors%3A%20How%20DARPA%20pioneered%20the%20idea%20behind%20mRNA%20vaccines&url=https%3A%2F%2Fwww.technocracy.news%2Fhumans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fhumans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines%2F&text=Humans%20as%20Bioreactors%3A%20How%20DARPA%20pioneered%20the%20idea%20behind%20mRNA%20vaccines", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fhumans-as-bioreactors-how-darpa-pioneered-the-idea-behind-mrna-vaccines%2F&title=Humans%20as%20Bioreactors%3A%20How%20DARPA%20pioneered%20the%20idea%20behind%20mRNA%20vaccines", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=42270", "https://substack.com/redirect/75fcad2c-94ab-423e-8025-ebafae426bcb?r=i14cc", "https://substack.com/redirect/11a33e37-8120-4bb7-86ca-6d9c8da3fa12?r=i14cc", "https://substack.com/redirect/1d49333a-9a65-4800-ab88-0ee271110894?r=i14cc", "https://substack.com/redirect/17528270-0ae0-4635-a449-724545e3b9e2?r=i14cc", "https://substack.com/redirect/b16e072a-25f6-4783-accb-868ddf7ca330?r=i14cc", "https://substack.com/redirect/70cd3387-262f-4890-8523-997b2f76c06d?r=i14cc", "https://substack.com/redirect/9898c7f1-c2f2-41a6-9839-2440aef44774?r=i14cc", "https://substack.com/redirect/04cbffb4-9e0c-4bca-8b68-3a9cb69c3d39?r=i14cc", "https://substack.com/redirect/5b4a78b4-cb0b-4d1a-a62e-a4e557c175e9?r=i14cc", "https://substack.com/redirect/94c2da34-c580-4eed-b18e-77911472c353?r=i14cc", "https://substack.com/redirect/d319de9f-99e0-49ab-9873-fefd5815462a?r=i14cc", "https://t.co/h2gz8fuOXJ", "https://twitter.com/DARPA/status/1093271185159266304?ref_src=twsrc%5Etfw", "https://t.co/OCi5MEQiVg", "https://twitter.com/DARPA/status/1328362213686513665?ref_src=twsrc%5Etfw", "https://substack.com/redirect/8cf2f0bf-5aa3-4734-99f7-c3acc4e751e8?r=i14cc", "https://substack.com/redirect/e201525a-ee64-44e3-b82f-7687a9134b70?r=i14cc", "https://substack.com/redirect/a6643cbb-2b8d-443f-838f-a88def6c1cca?r=i14cc", "https://substack.com/redirect/1a583467-eefc-4a95-ac94-c1dade2738fb?r=i14cc", "https://t.co/iekSBeL67a", "https://twitter.com/ZaidZamanHamid/status/1560007193835016192?ref_src=twsrc%5Etfw", "https://substack.com/redirect/267b560d-f670-4de5-bc7e-85259c7dea59?r=i14cc", "https://substack.com/redirect/969991e8-17f4-4bc4-92bd-928464b31e9b?r=i14cc", "https://substack.com/redirect/d3e937fd-5e52-4817-86f6-66d390c0c22d?r=i14cc", "https://substack.com/redirect/4fba4e6c-54d0-47f4-bdfa-38705bcf623b?r=i14cc", "https://substack.com/redirect/fedc356d-8797-4236-b231-4d168dbd9f83?r=i14cc", "https://substack.com/redirect/4e0be61a-ef85-4850-aeb3-3eb925c092b9?r=i14cc", "https://substack.com/redirect/4a20ccb0-c1f4-4eb4-96d8-3ee501d767fe?r=i14cc", "https://substack.com/redirect/5240812c-2391-4ff8-a434-3383c1079b61?r=i14cc", "https://substack.com/redirect/9c3ac7a2-fcf4-4f1f-b9db-3ba952be497e?r=i14cc", "https://substack.com/redirect/5527a8b6-c660-486a-9456-50b0e16d1c74?r=i14cc", "https://iceni.substack.com/p/humans-as-bioreactors?utm_source=substack&utm_medium=email", "https://www.technocracy.news/7-key-reasons-why-vaccine-passports-are-a-dangerous-idea/", "https://www.technocracy.news/facebook-engineers-we-have-no-idea-where-we-keep-all-your-personal-data/", "https://www.technocracy.news/hohmann-technocrats-float-idea-of-digital-families-to-plug-declining-population/", "https://www.technocracy.news/vaccines-4eva-flatten-the-curve-with-endless-vaccines/", "https://www.technocracy.news/covid-mrna-vaccines-kick-off-planetary-genetic-overwrite/", "https://www.technocracy.news/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "https://www.technocracy.news/mit-scientist-mrna-vaccines-worse-than-the-disease/", "https://www.technocracy.news/us-government-paid-news-media-1-billion-for-propaganda-to-promote-vaccines/"], "authors": [], "publish_date": "2022-10-13T21:11:46-07:00"}