{"result_id": "283038", "URL": "https://www.technocracy.news/g20-signs-declaration-for-international-vaccine-passport/", "timestamp": "2023-04-25 17:15:39 CEST+0200", "meta": {"description": "It's not about health. It's about control. Absolute control. \"Your papers, please.\" Anyone who does not want to receive mRNA-based injections that Pfizer admits was never tested for transmission of a virus, is grounded from international travel. Nations will the adopt the same passport for domestic travel on airplanes, trains, busses, automobiles.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/g20-signs-declaration-for-international-vaccine-passport/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "G20 Signs Declaration for International Vaccine Passport", "cleaned_text": "Anyone who disagrees with them is an “enemy of the state” — they being “the state” or, more accurately, the Deep State, the hidden power behind the apparent power of official government. Who are the members of this cabal? There’s no official membership list, but over time many of the individual players have become discernible. The globalist cabal includes but is not limited to government heads, bankers and members of nongovernmental organizations (NGO’s) and liberal think tanks around the world. One way in which the cabal hides its undemocratic influence is by having its members in dozens of different organizations. When several organizations agree on an issue, it makes it appear as though there’s a majority view, a consensus. But in reality, it’s the same small group of individuals asserting their agenda. The G20, a group of 19 nations — including the U.S. — plus the European Union, recently held their annual business meeting (B20) in Bali, Indonesia, where they declared that digital vaccine passports, standardized by the World Health Organization, will be part of international pandemic prevention and response moving forward.1\n\n“We support continued international dialogue and collaboration on the establishment of trusted global digital health networks as part of the efforts to strengthen prevention and response to future pandemics, that should capitalize and build on the success of the existing standards and digital COVID-19 certificates.”\n\nThe rule for standardized international vaccine passports will reportedly be introduced as a revision to the international health regulations during the next World Health Assembly in Geneva.5\n\nWhat this means is that when the next pandemic is declared, only those who have this digital health certificate will be allowed to move about freely and travel internationally. And, of course, only those who have been appropriately tested and/or vaccinated will have a valid passport.\n\nIn addition to adopting an international digital vaccine passport, the G20 recommendations also include the creation of guidelines for a globally coordinated response to crises, “enhanced by a technology-enabled ‘always-on’ global health infrastructure,” and a mutual recognition of COVID-19 vaccines made by G20 members.\n\nSchwab Tells Us What the G20 Are All About\n\nAside from key government leaders, high-profile globalists such as Schwab were also in attendance at the G20 meetings. In his B20 keynote address, Schwab highlighted the cabal’s agenda and goals:6\n\n“What we have to confront is a deep, systemic and structural re-structuring of our world … [The] world will look differently after we have gone through this transition process.”\n\nPart of that worldwide restructuring of society that the WEF, the G20 and many other organizations are working in lockstep to achieve is the implementation of a global vaccine passport, which all of the G20 members have now agreed to. In the case of the U.S., President Biden signed the declaration despite the promises made by his White House COVID-19 Response Team leader, Jeff Zients, who in April 2021 stated:7\n\n“Let me be clear that the government is not now, nor will we be supporting a system that requires Americans to carry a credential. There’ll be no federal vaccination database, no federal mandate requiring everyone to obtain a single vaccination credential.”\n\nf you’re a rational person, you’re probably thinking, “But wait, the COVID jabs don’t prevent infection or spread, so there’s no basis for vaccine passports anymore.” Indeed, this fact has now been established many times over. This alone proves beyond a shadow of a doubt that COVID vaccine passports have nothing to do with public health or safety.\n\nTheir purpose is not to prevent or contain pandemics. They’re a control mechanism,8 and a really important one. Vaccine passports are THE gateway to complete, totalitarian control of the populations of the world. The globalist cabal desperately needs everyone to have this passport, because the entire control grid around a person gets tied together by it. This is why fighting for informed consent is so crucial.\n\nBut how is the G20 getting around the obvious fact that the COVID passports are useless for their stated purpose? They ignore it, and instead stress that everyone also needs a digital identity, and this digital COVID certificate does both.\n\nOutside their own circle, this rationale makes no sense whatsoever, but as noted by Dutch legal philosopher Eva Vlaardingerbroek, the fact that vaccine passports are sold based on a fraudulent premise is now “so obvious that they’ve thrown logic out the window.”9\n\nTheir decisions make no sense, and they have no intention of making them sensible. They’re banking on being able to entrap us in their control system, at which point they’ll be able to tell you the moon is made of cheese and you’ll have no way of correcting them without losing everything.\n\nDigital Identity Is Total Surveillance to Control You\n\n“In August, 2021, the World Health Organization (WHO) published a 99-page guide book11 on the implementation of digital documentation of COVID-19 certificates, aka vaccine passports, stating that ‘a health pass based solely on individual vaccination status may increase the risk of disease spread.’\n\nThis is because the COVID-19 ‘vaccines’ were never proven to prevent transmission nor infection, and it recently came to light in the European Parliament that Pfizer never even tested its product for stopping transmission. Despite this knowledge being publicly available, the B20 is still recommending proof of vaccination as a means to travel …\n\nVaccine passports, by their very nature, serve as a form of digital identity, according to the World Economic Forum (WEF). A digital identity encompasses everything that makes you unique in the digital realm, and it is a system that can consolidate all of your most personal intimate data, including which websites you visit, your online purchases, health records, financial accounts, and who you’re friends with on social media …\n\n[D]igital identity schemes can give governments and corporations the power to incentivize, coerce, or otherwise manipulate human behavior under a system of social credit. Digital identities can be used to determine what products, services, and information are available to us, and they can certainly be used by public and private entities to deny us that access.”\n\nIn March 2021, Naomi Wolf, author of “The End Of America,” warned that accepting digital ID will be the end of all freedom:13,14\n\n“I cannot say this forcefully enough: This is literally the end of human liberty in the West if this plan unfolds as planned … Vaccine passports sound like a fine thing if you don’t know what those platforms can do.\n\nI’m CEO of a tech company, I understand what this platform does. It’s not about the vaccine, it’s not about the virus, it’s about data. And once this rolls out you don’t have a choice about being part of the system. What people have to understand is that any other functionality can be loaded onto that platform with no problem at all.”\n\nLiberty Counsel Founder and Chairman Mat Staver has also issued a warning, saying:15\n\n“Digital health or vaccine passports along with tracking and tracing apps present a serious threat to freedom. Vaccine passports and tracking apps are about collecting data and control. The vaccine passport is being promoted worldwide to limit a person’s ability to leave home, work, shop, dine, travel, attend a public event, or even worship.\n\nCOVID is being used to advance this dangerous threat to freedom. We must never accept vaccine passports or tracking apps as the new normal. The implications for freedom are significant.”\n\nVaccine Passports Are Gateway for Complete Financial Control\n\nWhen vaccine passports first became a topic of international discussions, many of us saw the writing on the wall and warned that such an implementation would become a tool for complete financial and physical control, and would automatically eliminate basic human rights and freedoms.\n\nAt the time, we were labeled crazy conspiracy theorists, but it didn’t take long before our worst fears were confirmed. Your vaccine passport will be your digital identity (as confirmed by the WEF), and to that digital identity they plan to add a programmable central bank digital currency (CBDC) and a social credit score. These plans are not a conspiracy theory. They’re out in the open.\n\nWhen you add all of those ingredients together — vaccine requirements for maintaining a valid passport, a digital identity, a social credit score and programmable CBDCs — you end up with a control grid that will eliminate your freedom to live life according to your own desires.\n\nEven your diet can then be dictated by these megalomaniacs. They’re hell-bent on eliminating your ability to eat meat, for example. The whole world, especially the Western world, must transition to insect protein, they say. Meanwhile, you will not find meal worms and crickets on the menus at their globalist gatherings.16 No, insect protein is for the expendables.\n\nOnce vaccine passports/digital identity and CBDCs are in place, the global cabal will be able to control your physical movements, behaviors and purchases based on how well you conform to their ideals, no matter how irrational, immoral, unethical, unfair or dangerous those may be. As reported by The Daily Sceptic:17\n\n“It’s seemed evident for a while that the current fiat monetary system is, at best, unstable. At worst, it’s a Ponzi scheme whose time has expired. If that’s the case, I suspect the central bankers and 0.1% know this and might be prepared to usher in the new system before the old one collapses on itself — even as they loot it on the way down with the most significant wealth transfer in human history.\n\nTo anyone who pays attention to these trends, it seems evident that Central Bank Digital Currency (CBDC) will be that new system. Every indication is that CBDC’s arrival is imminent. [November 15, 2022], several global banks announced a partnership with the New York Federal Reserve to pilot digital dollars18,19 …\n\nFrom my vantage point, it’s impossible to overstate the risk presented by CBDC. Whether it’s a utopian vision based on good intentions or a sinister plot to crush our sovereignty, the result may be the same: control. A Central Bank Digital Currency has all the downsides of fiat money, plus the added layers of surveillance and programmability overseen by the state.\n\nSo many people on Team Reality have likely felt like dissidents over the last few years simply for challenging anything beyond the herd mentality … Imagine a monetary system with features baked-in to socially engineer how we live. For example:\n\nIf there’s a silver lining in all of this, it’s that the globalist cabal — the “deep state” that pulls the strings of governments around the world, the hidden power that is making decisions that are devastating for the entire world — overplayed their hand during COVID, exposing their heinous ideologies and plans for all the world to see. As noted by Maajid Nawaz in an interview this past summer (video above): “When dogma defines your behavior you’re no longer looking at reality … so you’re going to be less pragmatic … That leaves serious blind spots. You end up not seeing reality for what it is, and that is why they ended up overplaying their hand. They’re not looking to reality, they’re looking to their dream, their ideal, which is actually a nightmare. One great thing that happened during COVID is they overplayed their hand. They exposed themselves … There’s now very little doubt, among those who have heard of the World Economic Forum, that it’s attempting to influence how we do government and politics … Why do we have an unelected bureaucrat, and a foreign one at that, telling us how to live our lives …? It doesn’t make sense. But then we go further. Why do they all seem to be beholden to this unelected foreign bureaucrat? Why do they all appear to be doing this man’s bidding? … Why can’t they just say no?” As noted by Nawaz, the government leaders who are not saying no to Schwab for some reason cannot say no, likely because they’ve been compromised. Compromising and blackmailing officials on behalf of the globalist cabal was Jeffrey Epstein’s specialty, and there’s no reason to assume their secrets died with him. Those with cleaner records may have been threatened into compliance. I would add a third possibility, and that is that they’re in on it because they share the globalists ideals, which include not only top-down authoritarianism but also transhumanism and eugenics. A fourth possibility is self-preservation. They may simply want to secure their own position within the ruling echelon in the new world of “have it alls” and “have nothings.” We Now Know What They’re Capable Of Whatever the incentive, the problem they now all face is the fact that they’ve prematurely exposed themselves and their plans. They’ve also exposed how far they’re willing to go. For example, we know they’re willing to seize your bank account and close down your ability to transact over something as minor as making a donation to a cause they don’t like or posting “wrong”-think on social media — and that’s without the benefit of CBDCs! So, they’ve already shown us what they WILL do once CBDCs are in place. The only difference is that penalties can then be automated. Is this a world you want to live in? Is this what you want for your children and grandchildren? If not, it’s your duty to be the resistance. Adults today are the last generation that will be able to prevent this global tyranny. If we do nothing, our children will be ensconced in a digital prison they won’t be able to break free from. So, we cannot leave it to them. It’s up to us. So, when CBDCs are rolled out, we must reject them, no matter how inconvenient that might be. When vaccine passports are rolled out, we must reject them, despite the limitations that might bring. In 2021, countless people were coerced into taking the jabs because they wanted to travel, fearing travel bans for the unvaccinated would be permanent. Well, they weren’t, because enough people pushed back. We may have to endure limitations if we refuse the coming international vaccine passport, but if enough people around the world refuse, the system won’t work, and those limitations will prove to be temporary. The only way any of the globalists plans can become permanent is if we do as we’re told and go along with them.", "opengraph": {"locale": "en_US", "type": "article", "title": "G20 Signs Declaration for International Vaccine Passport", "description": "It's not about health. It's about control. Absolute control. \"Your papers, please.\" Anyone who does not want to receive mRNA-based injections that Pfizer admits was never tested for transmission of a virus, is grounded from international travel. Nations will the adopt the same passport for domestic travel on airplanes, trains, busses, automobiles.", "url": "https://www.technocracy.news/g20-signs-declaration-for-international-vaccine-passport/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Vaccine Passports", "image": "https://www.technocracy.news/wp-content/uploads/2021/05/vaccine-passport.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2021/05/vaccine-passport.png", "image:width": "2000", "image:height": "1335", "image:alt": "G20", "image:type": "image/png", "article:published_time": "2022-11-30T08:25:56-07:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The global palace coup.</p><p>We literally SPELLED it out for everyone – step by step – with Rogan at the end of Jan 2022 (censored for 3 weeks)</p><p>WAKE UP ! <a href=\"https://t.co/GBmMHe0WLA\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/GBmMHe0WLA</a> <a href=\"https://t.co/uotr9H2DrZ\" rel=\"nofollow\" target=\"_blank\">https://t.co/uotr9H2DrZ</a></p><p>— أبو عمّار (@MaajidNawaz) <a href=\"https://twitter.com/MaajidNawaz/status/1593181668353146880?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">November 17, 2022</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe title=\"Ron Paul: The WEF wants to tell you what&#x2019;s right and wrong\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/DzjhyFO8jWw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/DzjhyFO8jWw?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe title=\"Viral transmission not tested in Pfizer trials\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/J6VbI8gOnUM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/J6VbI8gOnUM?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe title=\"This Is A Global Palace Coup | The Delingpod Live with Maajid Nawaz\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/-Ef1q75tsdY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/-Ef1q75tsdY?feature=oembed"}], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fg20-signs-declaration-for-international-vaccine-passport%2F&text=G20%20Signs%20Declaration%20for%20International%20Vaccine%20Passport", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fg20-signs-declaration-for-international-vaccine-passport%2F", "https://parler.com/new-post?message=G20%20Signs%20Declaration%20for%20International%20Vaccine%20Passport&url=https%3A%2F%2Fwww.technocracy.news%2Fg20-signs-declaration-for-international-vaccine-passport%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fg20-signs-declaration-for-international-vaccine-passport%2F&text=G20%20Signs%20Declaration%20for%20International%20Vaccine%20Passport", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fg20-signs-declaration-for-international-vaccine-passport%2F&title=G20%20Signs%20Declaration%20for%20International%20Vaccine%20Passport", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=42868", "https://takecontrol.substack.com/p/green-agenda", "https://t.co/GBmMHe0WLA", "https://t.co/uotr9H2DrZ", "https://twitter.com/MaajidNawaz/status/1593181668353146880?ref_src=twsrc%5Etfw", "https://takecontrol.substack.com/p/one-nation-under-blackmail", "https://takecontrol.substack.com/p/blackrock-gates-big-tech-ownership", "https://sociable.co/government-and-policy/g20-who-vaccine-passports-digital-identity-b20/", "https://www.b20indonesia2022.org/view-doc-b20/final_communique/AXPIDTWB", "https://sociable.co/government-and-policy/g20-promotes-vaccine-passports-future-pandemic-response/", "https://kiowacountypress.net/content/world-leaders-sign-declaration-adopt-vaccine-passports-international-travel", "https://sociable.co/government-and-policy/covid-vaccine-passports-increase-risk-disease-spread-gates-rockefeller-who/", "https://www.youtube.com/watch?app=desktop&v=9NMGag1iuYw", "https://www.who.int/publications/i/item/WHO-2019-nCoV-Digital_certificates-vaccination-2021.1", "https://www.realclearpolitics.com/video/2021/03/29/naomi_wolf_mandatory_vaccine_passport_could_lead_to_end_of_human_liberty_in_the_west.html", "https://rwmalonemd.substack.com/p/global-news-a-global-passport-for", "https://lc.org/newsroom/details/111722-world-leaders-agree-to-implement-vaccine-passports-1", "https://twitter.com/BernieSpofforth/status/1593158578071736320", "https://dailysceptic.org/2022/11/18/cbdc-how-covid-became-the-path-to-global-financial-surveillance/", "https://watcher.guru/news/global-banks-partner-with-new-york-fed-for-12-week-digital-dollar-pilot", "https://cointelegraph.com/news/ny-fed-launches-12-week-cbdc-pilot-program-with-major-banks", "https://articles.mercola.com/sites/articles/archive/2022/11/30/g20-signs-declaration-vaccine-passport.aspx?ui=f1108e89bede503d38ea525ba1a61606abdbe3e84a4dd429bcc8b9086ec00bba&sd=20200809&cid_source=dnl&cid_medium=email&cid_content=art1HL&cid=20221130&cid=DM1296582&bid=1657862159", "https://www.technocracy.news/insane-g20-calls-for-vaccine-passports-on-all-future-international-travel/", "https://www.technocracy.news/declaration-of-international-medical-crisis-due-to-death-and-diseases-co-related-to-covid-19-vaccines/", "https://www.technocracy.news/scottish-governments-vaccine-passport-app-sends-private-data-to-amazon-microsoft/", "https://www.technocracy.news/the-government-intel-agencies-behind-digital-vaccine-passport-ids/", "https://www.technocracy.news/mercola-global-vaccine-passport-will-be-required-for-travel/", "https://www.technocracy.news/smartphone-apps-under-development-for-global-vaccine-passport/", "https://www.technocracy.news/eu-to-implement-block-wide-vaccine-passport-standard/", "https://www.technocracy.news/vaccine-passport-rebellion-youre-not-going-to-brand-us/"], "authors": [], "publish_date": "2022-11-30T08:25:56-07:00"}