{"result_id": "283021", "URL": "https://www.technocracy.news/mercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail/", "timestamp": "2023-04-25 17:14:53 CEST+0200", "meta": {"description": "Whether intentional or not, data is suggesting that mRNA vaccines and boosters are inducing \"acquired immunodeficiency syndrome\" that may leave a large segment of society dependent on additional shots to provide protection against further diseases. Medical Technocrats who have brought this scourge upon humanity must be held accountable.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/mercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Mercola: COVID Jabs Are Creating 'Vaccine Addicts' As Immune Systems Fail", "cleaned_text": "At this stage in the game, it’s apparent that the COVID jab no longer works. Many health officials and world leaders are even openly acknowledging that the COVID shots cannot end the pandemic and that we must learn to live with the virus. A major driver for this U-turn in the pandemic narrative is the emergence of the Omicron variant which, by mid-January 2022, accounted for 99.5% of all COVID cases in the U.S.1 The infection, which is far milder than previous ones, is ripping through populations, leaving natural herd immunity in its wake. Despite that, vaccine makers are still hard at work to produce an Omicron-specific injection.2 Pfizer has promised to have one ready by March 2022.3 The question is why, seeing how by the time the shot is released, just about everybody will have been exposed. If natural herd immunity is already maxed out, what good could a “vaccine” possibly do? As Dr. William Moss, executive director of the International Vaccine Access Center at the Johns Hopkins Bloomberg School of Public Health told CNBC,4 “An omicron-targeted vaccine was needed in December [2021]. It still could be valuable but I do think in many ways, it’s too late.” Dr. Shaun Truelove, an infectious disease epidemiologist at Johns Hopkins Bloomberg School of Public Health and a member of a team of researchers who make COVID projections, agreed, saying, “Given how quickly this [variant] is happening, [the targeted vaccine] may not matter because everybody’s going to be infected.”5 Pfizer CEO Albert Bourla even admits he doesn’t know “whether or not the new vaccine is needed or how it could be used,” CNBC reports. January 25, 2022, Pfizer and Moderna announced they’ve started enrolling adults, 18 to 55, for trials on an Omicron-specific jab in the U.S. and South Africa.6 Pfizer will evaluate safety, tolerability and immune response in 1,420 volunteers,7 some of whom will have received two doses while others will have received three already. A third cohort will be unvaccinated (although one wonders where they’ll get those from). Moderna has also joined the pointless race to produce an Omicron booster,8 although it’s doubtful they’ll be able to produce one any faster than Pfizer. Moderna CEO Stéphane Bancel told CNBC that a fourth COVID jab also may be on the horizon, “as the efficacy of boosters will likely decline over time.”9 It’s unclear what strain that fourth shot would target. For a preview of what’s in store after third and fourth booster shots, all we have to do is look at Israel, where more than 250,000 fourth doses had already been given by early January 2022. According to CNBC:10 “Early data from Israel shows that a fourth dose does increase antibody levels, says Dr. David Hirschwerk, infectious disease specialist and medical director at Northwell Health’s North Shore University Hospital.” What CNBC neglects to note is that, after the rollout of a fourth dose, Israel now has the highest COVID case rate per capita of any country in the world since the beginning of the pandemic. Looking at a Reuters graph11 of Israel’s seven-day average case rate, something absolutely abnormal appears to have happened in mid-January 2022, as the line shoots straight upward, hitting an all-time high of 75,603 new infections per day on January 24, 2022. This, despite 74% of the population having received at least one dose, 67% having received two doses, and 56% having received at least one booster, as of January 25, 2022.12 What Does It Mean To Be ‘Fully Vaxxed’? While the pandemic narrative has recently shifted, and rather dramatically, with some leaders openly speaking out against boosters without getting canceled or censored, it seems clear that we’re not out of the woods yet when it comes to COVID shots. Vaccine makers clearly aim to make the COVID shot, at bare minimum, an annual injection.13 In the meantime, the definition of what it means to be “fully vaccinated” against COVID keeps shifting. At the beginning of 2021, many people undoubtedly got their primary series (two shots of Pfizer or Moderna, or a single jab in the case of AstraZeneca and Janssen) thinking life would be easier that way. Being “fully vaccinated,” they wouldn’t be inconvenienced by vaccine passport restrictions and mandates. Well, that fantasy only lasted a few months. Now, those who got the first required series find themselves in the unwelcome position of being among the “unvaccinated” again unless they submit to a third jab. As explained by U.S. Centers for Disease Control and Prevention director Dr. Rochelle Walensky during a recent press briefing:14 “What we’re really working to do is pivot the language to make sure everyone is up to date with their COVID-19 vaccines as they personally could be, should be, based on when they got their last vaccine. If you’ve recently gotten your second dose but you’re not eligible for a booster, you’re up-to-date. If you’re eligible for a booster and you haven’t gotten it, you’re not up-to-date and you need to get your booster.” It’s only a matter of time before those with three jabs will be “unvaccinated” unless they submit to a fourth, and so on, ad nauseum. An as-yet unanswered question is how many mRNA injections can a person survive? Considering the injection causes your body to produce toxic spike protein in uncontrolled amounts, it seems reasonable to assume there’s a tolerance limit, although that limit may vary from person to person. There’s really no telling how many people are one shot away from a crippling side effect or sudden death. As reported by The Exposé,15 January 22, 2022, government data from around the world suggest people who have received at least two shots are now showing signs of serious immune system degradation. According to that report, data from Australia, the U.S., Canada, Scotland and England clearly show “that their vaccinated populations immune system capability has been decimated when compared to the not-vaccinated population.” For starters, Omicron cases are rising far more rapidly and readily among the fully jabbed and boosted than among the unvaxxed. So, the vaccine passports holders are 2.2x more likely to spread COVID than the unvaxxed who are denied vaccine passports and locked up in detention centers. ~ The Exposé In Australia, the fully jabbed are 2.2 times more likely to catch COVID than the unvaccinated. “So, the vaccine passports holders are 2.2x more likely to spread COVID than the unvaxxed who are denied vaccine passports and locked up in detention centers,” The Exposé dryly notes. Several studies have also shown the effectiveness of the jab wanes incredibly rapidly. And, disturbingly, it doesn’t peter out at zero. Immunity goes negative, meaning the fully vaxxed and boosted rapidly become MORE prone to COVID infection than they ever were before. In the U.S., a study16 on 780,225 U.S. veterans found the effectiveness of the jab dropped precipitously over six months:\n• Janssen dropped from 86.4% effectiveness at the outset to 13.1% in the sixth month A Canadian study17 found vaccine effectiveness started declining sharply within as little as the second week after the second jab. By the sixth month after the second jab, the blood of 70% of nursing home residents had “very poor ability to neutralize the coronavirus infection in laboratory experiments.” In the U.K., government data “show a clear linear fall-off in vaccine efficiency at an average rate of 4.8% per week for the over 18s,” The Exposé reports,18 and by the time you get past Week 9 after jab No. 2, effectiveness starts going negative. “Doubly vaxxed (unboosted) people in the U.K. have now (as of January 2022) run right out of immune system efficiency against both Delta and Omicron when compared to unvaccinated people,” The Exposé writes. The question is whether or not there might be a point at which the immune system stops deteriorating. As of now, we don’t know. Using data from five UK HSA COVID-19 Vaccine Surveillance Reports, The Exposé created the following graph, illustrating “the overall immune system performance among all age groups in England over the past five months.”\n\n“What we can see from the above is that the immune system performance for adults aged between 18 and 59 has deteriorated to the worst levels yet since they were given the COVID-19 vaccine.\n\nWhilst the immune system performance of everyone over the age of 60 has deteriorated dramatically following receipt of the booster shot, but not yet to the level seen between week 37 and week 40. The over 70’s have however seen the most dramatic fall in immune system performance between month 4 and month 5 alongside 18-29-year-olds.\n\nThe 55% boost to the immune systems of the over 80’s given by the boosters between month 3 and month 4 has all but deteriorated between month 4 and month 5. Their immune system is performing 1% better than it was in month 3 but still 54% worse than their unvaccinated counterparts.\n\nThe 73% boost to the immune systems of the 70-79-year-olds given by the boosters between month 3 and month 4 has also all but deteriorated between month 4 and month 5. Their immune system is performing 10% better than it was in month 3 but still 63% worse than their unvaccinated counterparts.\n\nThe minor boost however, given to the immune systems of everyone between the age of 30 and 59 by the boosters between month 3 and 4 has been completely decimated by the following month, whilst 18-29-year-olds have seen a 60% decline in their immune system performance between months 4 and 5.”\n\nAre Double- and Triple-Jabbed People at Risk for VAIDS?\n\nBy now you may be wondering whether this negative effectiveness could be indicative of something far worse than just being more prone to Omicron infection. The Exposé20 believes the double- and triple-jabbed may actually have vaccine-acquired immunodeficiency syndrome or VAIDS, similar to AIDS.\n\nWhile I think it’s still too early to come to a definitive conclusion, former Pfizer vice president Michael Yeadon has made a similar statement.21 In a December 6, 2021, article on americasfrontlinedoctors.org, Yeadon is quoted saying:22\n\n“If immune erosion occurs after two doses and just a few months, how can we exclude the possibility that effects of an untested ‘booster’ will not erode more rapidly and to a greater extent?”\n\nThe article goes on to cite a Lancet preprint23 that compared outcomes among “vaccinated” and unvaccinated Swedes over the course of nine months. As in other studies, they found that protection against symptomatic COVID rapidly declined, and by six months’ post-jab, “some of the more vulnerable vaccinated groups were at greater risk than their unvaccinated peers.”\n\n“Doctors are calling this phenomena in the repeatedly vaccinated ‘immune erosion’ or ‘acquired immune deficiency,’ accounting for elevated incidence of myocarditis and other post-vaccine illnesses that either affect them more rapidly, resulting in death, or more slowly, resulting in chronic illness,” the Frontline Doctors explain.24\n\nThe article also cites an August 2021 report from Scotland,25 which found those who had received the jab were 3.3 times more likely to die from COVID infection than the unvaccinated — a finding that certainly blows a huge hole in the claim that the jab prevents serious illness and death even if you do get symptomatic infection.\n\nThe Daily Mail at the end of November 2021 also reported that weekly ICU admissions of “most vulnerable patients” had risen by 50% in the two preceding months, and that 1 in 28 ICU patients had conditions affecting their immune system. Blood cancer patients and organ transplant patients made up a bulk of this group.26\n\nWhile the Daily Mail blamed the unusually high rate of admissions of immunocompromised patients on the government’s failure to roll out booster shots fast enough to counteract waning immunity, this is incredibly short-sighted. As noted by America’s Frontline Doctors, the shots are creating “vaccine addicts,” in the sense that their immune system won’t be able to ward off COVID without them. However, it’s still a losing venture, as each shot only worsens the immune erosion.\n\nIn the final analysis, it looks as though many may indeed end up being just one shot away from VAIDS as they continue to chase protection from an ever-mutating coronavirus.\n\nThe Daily Mail article tells the story of a transplant patient who was desperate to get his booster, knowing he was at high risk for COVID complications. It took three weeks, but he finally got his third shot. The very next day — THE NEXT DAY — he developed “a blinding headache, nausea and dizziness. A lateral flow test was positive and a follow-up PCR test confirmed that he had caught COVID.”\n\nBut rather than realizing he’s a victim of that third shot, the man is irrationally convinced that had he just gotten the third dose sooner, he wouldn’t have gotten COVID at all. Sadly, people like these will likely die from their “COVID jab addiction.” In closing, The Exposé writes:27\n\n“Acquired immunodeficiency syndrome is a condition that leads to the loss of immune cells and leaves individuals susceptible to other infections and the development of certain types of cancers. In other words, it completely decimates the immune system.\n\nTherefore, could we be seeing some new form of COVID-19 vaccine induced acquired immunodeficiency syndrome? Only time will tell, but judging by the current figures it looks like we will only need to wait a matter of weeks to find out.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Mercola: COVID Jabs Are Creating 'Vaccine Addicts' As Immune Systems Fail", "description": "Whether intentional or not, data is suggesting that mRNA vaccines and boosters are inducing \"acquired immunodeficiency syndrome\" that may leave a large segment of society dependent on additional shots to provide protection against further diseases. Medical Technocrats who have brought this scourge upon humanity must be held accountable.", "url": "https://www.technocracy.news/mercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Health Systems", "image": "https://www.technocracy.news/wp-content/uploads/2022/02/Acquired-immunodeficiency-syndrome-AIDS.jpeg", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/02/Acquired-immunodeficiency-syndrome-AIDS.jpeg", "image:width": "800", "image:height": "544", "image:alt": "Mercola", "image:type": "image/jpeg", "article:published_time": "2022-02-01T07:45:31-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail%2F&text=Mercola%3A%20COVID%20Jabs%20Are%20Creating%20%27Vaccine%20Addicts%27%20As%20Immune%20Systems%20Fail", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fmercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail%2F", "https://parler.com/new-post?message=Mercola%3A%20COVID%20Jabs%20Are%20Creating%20%27Vaccine%20Addicts%27%20As%20Immune%20Systems%20Fail&url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail%2F&text=Mercola%3A%20COVID%20Jabs%20Are%20Creating%20%27Vaccine%20Addicts%27%20As%20Immune%20Systems%20Fail", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-covid-jabs-are-creating-vaccine-addicts-as-immune-systems-fail%2F&title=Mercola%3A%20COVID%20Jabs%20Are%20Creating%20%27Vaccine%20Addicts%27%20As%20Immune%20Systems%20Fail", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=39472", "https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://www.cnbc.com/2022/01/10/omicron-vaccine-coming-in-march-experts-warn-it-could-be-too-late.html", "https://nypost.com/2022/01/25/pfizer-biontech-start-clinical-trial-for-omicron-vaccine/", "https://www.zerohedge.com/covid-19/pfizer-launches-trials-new-omicron-vaccine-cases-continue-slump", "https://www.cnn.com/2022/01/25/health/pfizer-biontech-omicron-vaccine-trial/index.html", "https://www.cnbc.com/2021/11/28/moderna-says-an-omicron-variant-vaccine-could-be-ready-in-early-2022.html", "https://archive.is/iC6iJ", "https://archive.is/mBJBG#selection-5063.0-5063.6", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-ceo-sees-annual-covid-vaccine-rather-than-frequent-boosters-2022-01-22/", "https://www.axios.com/the-shifting-definition-of-fully-vaccinated-9c5f763f-66c6-41a5-8266-79450f017843.html", "https://dailyexpose.uk/2022/01/22/vaccinated-usa-aussie-canada-brits-germans-developing-ade/", "https://www.science.org/doi/10.1126/science.abm0620", "https://medicalxpress.com/news/2021-09-vaccinated-covid-immunity-months-pfizer.html", "https://americasfrontlinedoctors.org/news/post/vaccine-acquired-immune-deficiency-syndrome-vaids-we-should-anticipate-seeing-this-immune-erosion-more-widely/", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://jeffreydachmd.com/wp-content/uploads/2021/08/Public-Health-Scotland-21-08-04-covid19-publication_report.pdf", "https://www.dailymail.co.uk/health/article-10224691/Has-jab-farce-landed-hundreds-intensive-care.html", "https://www.technocracy.news/military-creating-ai-weapons-systems-to-be-set-loose-to-slaughter/", "https://www.technocracy.news/how-masks-have-worn-down-childrens-immune-systems/", "https://www.technocracy.news/legal-bombshell-over-45000-americans-may-have-died-from-covid-19-jabs/", "https://www.technocracy.news/cdc-declares-it-has-no-record-of-naturally-immune-transmissions-of-covid-19/", "https://www.technocracy.news/vaccines-fail-singapore-cases-rise-despite-80-vaccine-rate/", "https://www.technocracy.news/who-creating-digital-wallet-to-store-vaccination-certifications/", "https://www.technocracy.news/epic-fail-covid-vaccines-do-not-impact-infection-rates/", "https://www.technocracy.news/harsh-lockdowns-in-uk-fail-to-curtail-covid-19-infections/"], "authors": [], "publish_date": "2022-02-01T07:45:31-07:00"}