{"result_id": "283003", "URL": "https://www.technocracy.news/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "timestamp": "2023-04-25 17:14:09 CEST+0200", "meta": {"description": "Prion disease is the animal equivalent of Bovine Spongiform Encephalopathy (BSE), or Mad Cow Disease. It destroys brain tissue, is degenerative, transmissible and fatal. As such,  gene therapy shots have the potential to be a deadly bio-weapon.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Study: mRNA-Based Vaccines And The Risk Of Prion Disease", "cleaned_text": "Vaccines have been found to cause a host of chronic, late developing adverse events. Some adverse events like type 1 diabetes may not occur until 3-4 years after a vaccine is administered [1]. In the example of type 1 diabetes the frequency of cases of adverse events may surpass the frequency of cases of severe infectious disease the vaccine was designed to prevent.\n\nGiven that type 1 diabetes is only one of many immune mediated diseases potentially caused by vaccines, chronic late occurring adverse events are a serious public health issue.\n\nThe advent of new vaccine technology creates new potential mechanisms of vaccine adverse events. For example, the first killed polio vaccine actually caused polio in recipients because the up scaled manufacturing process did not effectively kill the polio virus before it was injected into patients. RNA based vaccines offers special risks of inducing specific adverse events.\n\nOne such potential adverse event is prion based diseases caused by activation of intrinsic proteins to form prions. A wealth of knowledge has been published on a class of RNA binding proteins shown to participating in causing a number of neurological diseases including Alzheimer’s disease and ALS. TDP-43 and FUS are among the best studied of these proteins [2].\n\nThe Pfizer RNA based COVID-19 vaccine was approved by the US FDA under an emergency use authorization without long term safety data. Because of concerns about the safety of this vaccine a study was performed to determine if the vaccine could potentially induce prion based disease.\n\nPfizer’s RNA based vaccine against COVID-19 was evaluated for the potential to convert TDP-43 and or FUS to their prion based disease causing states. The vaccine RNA was analyzed for the presence of sequences that can activate TDP-43 and FUS. The interaction of the transcribed spike protein with its target was analyzed to determine if this action could also activate TDP-43 and FUS.\n\nAnalysis of the Pfizer vaccine against COVID-19 identified two potential risk factors for inducing prion disease is humans. The RNA sequence in the vaccine [3] contains sequences believed to induce TDP-43 and FUS to aggregate in their prion based conformation leading to the development of common neurodegerative diseases.\n\nIn particular it has been shown that RNA sequences GGUA [4], UG rich sequences [5], UG tandem repeats [6], and G Quadruplex sequences [7], have increased affinity to bind TDP-43 and or FUS and may cause TDP-43 or FUS to take their pathologic configurations in the cytoplasm. In the current analysis a total of sixteen UG tandem repeats (ΨGΨG) were identified and additional UG (ΨG) rich sequences were identified.\n\nTwo GGΨA sequences were found. G Quadruplex sequences are possibly present but sophisticated computer programs are needed to verify these.\n\nThe spike protein encoded by the vaccine binds angiotensin converting enzyme 2 (ACE2), an enzyme which contains zinc molecules [8]. The binding of spike protein to ACE2 has the potential to release the zinc molecule, an ion that causes TDP-43 to assume its pathologic prion transformation [9].\n\nThere is an old saying in medicine that “the cure may be worse than the disease.” The phrase can be applied to vaccines. In the current paper the concern is raised that the RNA based COVID vaccines have the potential to cause more disease than the epidemic of COVID-19.\n\nThis paper focuses on a novel potential adverse event mechanism causing prion disease which could be even more common and debilitating than the viral infection the vaccine is designed to prevent. While this paper focuses on one potential adverse event there are multiple other potential fatal adverse events as discussed below.\n\nOver the last two decades there has been a concern among certain scientists that prions could be used as bioweapons. More recently there has been a concern that ubiquitous intracellular molecules could be activated to cause prion disease including Alzheimer’s disease, ALS and other neurodegenerative diseases.\n\nThis concern originates due to potential for misuse of research data on the mechanisms by which certain RNA binding proteins like TDP-43, FUS and others can be activated to form disease causing prions. The fact that this research, which could be used for bioweapons development, is funded by private organizations including the Bill and Melinda Gates Foundation, and Ellison Medical Foundation [2] without national/international oversight is also a concern.\n\nIn the past, for example, there were prohibitions for publishing information pertaining to construction of nuclear bombs.\n\nPublished data has shown that there are several different factors that can contribute to the conversion of certain RNA binding proteins including TDP-43, FUS and related molecules to their pathologic states. These RNA binding proteins have many functions and are found in both the nucleus and the cytoplasm. These binding proteins have amino acid regions, binding motifs that bind specific RNA sequences.", "opengraph": {"locale": "en_US", "type": "article", "title": "Study: mRNA-Based Vaccines And The Risk Of Prion Disease", "description": "Prion disease is the animal equivalent of Bovine Spongiform Encephalopathy (BSE), or Mad Cow Disease. It destroys brain tissue, is degenerative, transmissible and fatal. As such,  gene therapy shots have the potential to be a deadly bio-weapon.", "url": "https://www.technocracy.news/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Health Systems", "image": "https://www.technocracy.news/wp-content/uploads/2021/04/prion-disease.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2021/04/prion-disease.png", "image:width": "1024", "image:height": "695", "image:alt": "Vaccines", "image:type": "image/png", "article:published_time": "2021-04-15T07:33:39-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fstudy-mrna-based-vaccines-and-the-risk-of-prion-disease%2F&text=Study%3A%20mRNA-Based%20Vaccines%20And%20The%20Risk%20Of%20Prion%20Disease", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fstudy-mrna-based-vaccines-and-the-risk-of-prion-disease%2F", "https://parler.com/new-post?message=Study%3A%20mRNA-Based%20Vaccines%20And%20The%20Risk%20Of%20Prion%20Disease&url=https%3A%2F%2Fwww.technocracy.news%2Fstudy-mrna-based-vaccines-and-the-risk-of-prion-disease%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fstudy-mrna-based-vaccines-and-the-risk-of-prion-disease%2F&text=Study%3A%20mRNA-Based%20Vaccines%20And%20The%20Risk%20Of%20Prion%20Disease", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fstudy-mrna-based-vaccines-and-the-risk-of-prion-disease%2F&title=Study%3A%20mRNA-Based%20Vaccines%20And%20The%20Risk%20Of%20Prion%20Disease", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=36068", "https://principia-scientific.com/covid-19-rna-based-vaccines-and-the-risk-of-prion-disease/", "https://www.technocracy.news/mit-scientist-mrna-vaccines-worse-than-the-disease/", "https://www.technocracy.news/study-unvaccinated-had-lower-hospitalizations-lower-rates-of-severe-disease/", "https://www.technocracy.news/rfk-jr-vaccines-did-not-save-the-world-by-eliminating-infectious-disease-mortality/", "https://www.technocracy.news/study-social-isolation-increases-risk-of-death-from-all-causes-by-50/", "https://www.technocracy.news/moderna-launches-another-mrna-based-injection-targeting-rsv/", "https://www.technocracy.news/vaccines-4eva-flatten-the-curve-with-endless-vaccines/", "https://www.technocracy.news/lockdowns-worse-than-the-disease-hurt-most-vulnerable/", "https://www.technocracy.news/pcr-tests-are-used-to-cause-disease-panic/"], "authors": [], "publish_date": "2021-04-15T07:33:39-07:00"}