{"result_id": "283042", "URL": "https://www.technocracy.news/mercola-how-to-fight-vaccine-mandates-and-passports/", "timestamp": "2023-04-25 17:15:51 CEST+0200", "meta": {"description": "The world is fed up with Technocrat/Transhumanist assaults and is fighting back on every continent. The agenda to destroy society and our economic system is becoming more clear by the day and people are starting to see it as an existential threat to civilization, which indeed it is.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/mercola-how-to-fight-vaccine-mandates-and-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Mercola: How to Fight Vaccine Mandates and Passports", "cleaned_text": "The world is fed up with Technocrat/Transhumanist assaults and is fighting back on every continent. The agenda to destroy society and our economic system is becoming more clear by the day and people are starting to see it as an existential threat to civilization, which indeed it is. ⁃ TN Editor > Around the world, huge numbers of people are protesting vaccine mandates and passports > New York City has seen large protests in the wake of its vaccine requirement for restaurants and other public venues. Among those protesting are firefighters, first responders, correctional officers, police officers and sanitation workers > Among city sanitation workers, 38% remain unvaccinated. Unless they’re fully “vaccinated” by November 1, 2021, they face being placed on unpaid leave. While catastrophic, losing half the sanitation department may also force New York to rethink its ill-advised mandate > While there’s no one-size-fits-all solution, some general suggestions can be made. Available solutions can be divided into four main categories: legal challenges, workarounds that don’t require you to face the issue head-on, protests and demonstrations, and mass noncompliance > Mass noncompliance is the only strategy that can save us in the long run\n\nAround the world, huge numbers of people are protesting vaccine mandates and passports. In mid-September 2021, Italy became the first European country to announce the implementation of mandatory COVID-19 health passes (so-called “Green Pass”) for all workers, both public and private.\n\nThe Italian mandate took effect October 15, 2021. Under the new rules, any Italian who does not have a Green Pass is forced into unpaid leave and risks fines of up to 1,500 euros (approximately $1,750). Massive demonstrations are also taking place in The Netherlands, Switzerland, Luxembourg, Greece, Romania, Slovenia, Australia and France.\n\nEven in Israel, mass protests are now taking place as it was announced Israelis will lose their health pass privileges unless they get a third booster shot six months after their second dose.\n\nNew York City has also seen large protests in the wake of its vaccine requirement for restaurants and other public venues. Among those protesting are firefighters, first responders, correctional officers, police officers and sanitation workers.\n\nThe New York City police union, the Police Benevolent Association, recently sued the city over its COVID jab mandate, saying it opposes any mandate that does not allow police officers to undergo weekly testing in lieu of getting the shot.\n\nAs of mid-October 2021, an estimated 30% of the New York police department remained unvaccinated.1 Unless they’re fully “vaccinated” by November 1, 2021, they all face being placed on unpaid leave. In all, about 46,0002 New York city workers stand before this difficult choice: get the risky jab or lose their job.\n\nAmong city sanitation workers, 38% remain unvaccinated.3 We’ve already seen how mass walkouts can change things. For example, in mid-October 2021, Southwest Airlines did a sudden U-turn, reversing its strict get jabbed or get lost policy.4\n\nSouthwest is now urging unvaccinated employees to apply for an exemption, which the airline will do its best to approve. In cases where an exemption is not approved, Southwest has promised to provide other accommodation, such as weekly testing, which is not an option under Biden’s mandate.\n\nNow, imagine what halving the sanitation department in New York City would do. I predict a few weeks of letting trash pile up might soften the mayor’s stance on the mandate.\n\nIt would be even more catastrophic — and more likely to end the mandate — were the remaining vaccinated sanitation workers to walk off the job in solidarity. After all, whether you decided to get the initial jab or not, the vaccine mandate is a direct attack on your personal freedom and liberty.\n\nUnless you’re willing to give up all personal autonomy to the government, you have to say no to this clear authoritarian overreach, because it’s only going to get worse from here. There really is no telling what you’ll have to submit yourself to next in order to keep your “privileges,” which now include having a job.\n\nThe Global Threat of Vaccine Mandates and Passports\n\nIn the video above, investigative reporter James Corbett of The Corbett Report Solution Watch explores how we can thwart the threat of vaccine mandates and passports. As noted by Corbett, this threat is worldwide.\n\nThere’s not a nation in the world that can expect to not face vaccine mandates and passports, for the simple reason that the passports are a foundational part of the new economic control system that is being rolled out.\n\nSo, while it appears people have successfully pushed back in some areas — including the U.K., which recently announced it would scrap the passport requirement for restaurants and other public venues, and in Florida, where Gov. Ron DeSantis is calling on businesses to pay for adverse reactions if they mandate the shot (see his speech below) — we must remain vigilant, not let up, and not give an inch.\n\nWe’ve repeatedly seen how government officials have said there are no plans for vaccine mandates or passports, only to turn on a dime days or weeks later. It seems they’re all using the same playbook: First, put people’s minds at ease, and then pull the rug out — over and over again.\n\nHow to Thwart the Threat of Vaccine Mandates and Passports\n\nWhile there’s no one-size-fits-all solution, some general suggestions can be made. Corbett divides the available solutions into four main categories:\n\n1.Legal challenges to the vaccine mandates — A variety of legal resources can be found on The Corbett Report’s September Open Thread.5 A thread by HomeRemedySupply, in particular, contains a long list of legal resources for Americans looking to combat vaccine mandates, including vaccine exemption documents and much more. The Corbett Report show notes6 also list a variety of resources. Another resource is The Solari Report, where you can download a variety of forms, including: a. A family financial disclosure form, to ensure that a vaccine injury or death does not translate into financial destruction of the whole family b. An employer disclosure form that informs your employer of the many laws and ethical principles they are breaking and demands they take financial responsibility for any injury you might incur as a result of their mandate c. A school disclosure form that informs the school of the many laws and ethical principles they are breaking and demands they take financial responsibility for any injury you might incur as a result of their mandate d. A notice of parental authority form, which parents can use to notify relevant parties that they do not consent to their child being vaccinated without their written informed consent Another type of legal challenge you can pursue is that of religious and medical exemptions. Just keep in mind that while this might temporarily save the livelihoods of some, it does virtually nothing to protect you or anyone else from tyranny in the long term. And, as noted by Corbett, even the Amish have had religious exemptions denied by bureaucrats who say they don’t think the Amish have a strongly held religious conviction against vaccination. If you know anything about Amish who choose not to vaccinate, you know what a ridiculous statement that is, but at the end of the day, these are the kinds of people making the decisions. 2.Workarounds that don’t necessitate facing the problem head-on — This includes setting up a network of likeminded people to create parallel economies and resources,7 and getting involved in local politics, your children’s school board and so on, where you can apply pressure and affect change from the inside. You can also sign petitions, such as the British togetherdeclaration.org.8 3.Peaceful protests and demonstrations — As mentioned earlier, there are mass protests taking place all over the world. Keep in mind that this strategy requires patience and above all persistence. Doing it once or twice will accomplish little. The French have been taken to the streets by the hundreds of thousands every weekend for months. Our leaders are clearly not easily or rapidly swayed by these displays of solidarity but, over time, peaceful protests can be effective. 4.The ultimate solution: noncompliance — At the end of the day, the most effective long-term solution is mass noncompliance, “ignoring the rulers out of existence,” to quote Arizona Dara, featured in Corbett’s report. It’s important to realize that it’s not our politicians who are running the show. They’re foot soldiers for unnamed, unelected globalists, which is why fighting in the political arena is unlikely to eliminate this threat over the long term. As noted by Corbett, the technocrat globalists that are the real string pullers are only able to do what they do because people tend to just go along with it. It’s that simple. If enough people don’t comply, their plans fall apart. If millions of people refuse to comply with the mandates and the passports and then sue their employers when they’re fired, if millions force the establishment to go through that hassle, the establishment will eventually cave. As noted by Corbett, it would become mathematically impossible for them to enforce the tyranny. Ultimately, that’s how we win. As noted by Corbett, the technocrat globalists that are the real string pullers are only able to do what they do because people tend to just go along with it. It’s that simple. If enough people don’t comply, their plans fall apart. If millions of people refuse to comply with the mandates and the passports and then sue their employers when they’re fired, if millions force the establishment to go through that hassle, the establishment will eventually cave. As noted by Corbett, it would become mathematically impossible for them to enforce the tyranny. Ultimately, that’s how we win.\n\nTo learn more about the scheme behind vaccine passports, read Jeremy Loffredo’s and Max Blumenthal’s article, “Public Health or Private Wealth? How Digital Vaccine Passports Pave Way for Unprecedented Surveillance Capitalism.”9 As noted in that article:\n\n“The titans of global capitalism are exploiting the Covid-19 crisis to institute social credit-style digital ID systems across the West.\n\nThe death by starvation of Etwariya Devi, a 67-year-old widow from the rural Indian state of Jharkhand, might have passed without notice had it not been part of a more widespread trend.\n\nLike 1.3 billion of her fellow Indians, Devi had been pushed to enroll in a biometric digital ID system called Aadhaar in order to access public services, including her monthly allotment of 25kg of rice.\n\nWhen her fingerprint failed to register with the shoddy system, Devi was denied her food ration. Throughout the course of the following three months in 2017, she was repeatedly refused food until she succumbed to hunger, alone in her home.\n\nPremani Kumar, a 64-year-old woman also from Jharkhand, met the same demise as Devi, dying of hunger and exhaustion the same year after the Aadhaar system transferred her pension payments to another person without her permission, while cutting off her monthly food rations.\n\nA similarly cruel fate was reserved for Santoshi Kumari, an 11-year-old girl, also from Jharkhand, who reportedly died begging for rice after her family’s ration card was canceled because it had not been linked to their Aadhaar digital ID.\n\nThese three heart-rending casualties were among a spate of deaths in rural India in 2017 which came as a direct result of the Aadhaar digital ID system.\n\nWith over one billion Indians in its database, Aadhaar is the largest biometric digital ID program ever constructed. Besides serving as a portal to government services, it tracks users’ movements between cities, their employment status, and purchasing records. It is a de facto social credit system that serves as the key entry point for accessing services in India …\n\nFor those yearning for an end to pandemic-related restrictions, credential programs certifying their vaccination against Covid-19 have been marketed as the key to reopening the economy and restoring their personal freedom. But the implementation of immunity passports is also accelerating the establishment of a global digital identity infrastructure.”\n\nMake no mistake, vaccine passports are the precursor to digital ID wallets, as noted by the military surveillance firm Thales.10 Of course, it’s sold as something that will provide you with superior convenience, but as the three stories above show, it doesn’t always work, and even when it does, it turns you into a slave in a system that profits from surveilling everything you do.\n\nThe system also gives unelected globalists — the richest of the rich — the power to cut your access to funds, health care, travel, food or anything else whenever they please. Bill Gates, the World Health Organization, the Rockefellers, the World Bank and the World Economic Forum are just some of the people and organizations that are behind this global enslavement agenda.\n\nDon’t fall for altruistic language spouted by these people. It’s nothing but PR to cover their profit motives. In the real world, digital ID systems have proven disastrous for the average person, resulting in marginalization and death.\n\nIn India, a random sampling of 18 villages that had implemented compulsory biometric authentication at rationing stations showed a shocking 37% of people were unable to get their food rations for one reason or another.11 So much for convenience. Imagine having to rely on a system like that for everything in your life — your food, your health care, your education, your banking and everyday purchases.\n\nAs noted by Canadian immunologist and geneticist Sir John Bell,12 the COVID-19 medical system can easily be repurposed for other ailments and health goals as well. Any number of other vaccinations could be mandated, and without having those logged in your passport, there goes your freedom yet again.\n\nAny number of drugs could be required to maintain a valid passport. They could put every adult over 40 on mandatory statin treatment, for example, as a public health measure.\n\nJust how much freedom are you willing to lose? Don’t think for a minute that it’ll all end once you get fully vaccinated against COVID-19. Sooner or later, everyone will have to make a choice: freedom or slavery. There’s no middle ground anymore.", "opengraph": {"locale": "en_US", "type": "article", "title": "Mercola: How to Fight Vaccine Mandates and Passports", "description": "The world is fed up with Technocrat/Transhumanist assaults and is fighting back on every continent. The agenda to destroy society and our economic system is becoming more clear by the day and people are starting to see it as an existential threat to civilization, which indeed it is.", "url": "https://www.technocracy.news/mercola-how-to-fight-vaccine-mandates-and-passports/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Pandemic", "image": "https://www.technocracy.news/wp-content/uploads/2021/11/Screen-Shot-2021-11-02-at-7.20.16-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2021/11/Screen-Shot-2021-11-02-at-7.20.16-AM.png", "image:width": "1054", "image:height": "650", "image:alt": "vaccine", "image:type": "image/png", "article:published_time": "2021-11-02T07:21:08-07:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">NOW – Large protest against vaccine mandates in New York City.<a href=\"https://t.co/2zvqrlZIhE\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/2zvqrlZIhE</a></p><p>— Disclose.tv (@disclosetv) <a href=\"https://twitter.com/disclosetv/status/1452691549020737542?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\">October 25, 2021</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe title=\"DeSantis Calls On Businesses To Pay For Adverse Reactions To Vaccine If They Mandate It\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/AQgzcHQc0F0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/AQgzcHQc0F0?feature=oembed"}], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-how-to-fight-vaccine-mandates-and-passports%2F&text=Mercola%3A%20How%20to%20Fight%20Vaccine%20Mandates%20and%20Passports", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fmercola-how-to-fight-vaccine-mandates-and-passports%2F", "https://parler.com/new-post?message=Mercola%3A%20How%20to%20Fight%20Vaccine%20Mandates%20and%20Passports&url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-how-to-fight-vaccine-mandates-and-passports%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-how-to-fight-vaccine-mandates-and-passports%2F&text=Mercola%3A%20How%20to%20Fight%20Vaccine%20Mandates%20and%20Passports", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fmercola-how-to-fight-vaccine-mandates-and-passports%2F&title=Mercola%3A%20How%20to%20Fight%20Vaccine%20Mandates%20and%20Passports", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=38567", "https://t.co/2zvqrlZIhE", "https://twitter.com/disclosetv/status/1452691549020737542?ref_src=twsrc%5Etfw", "https://home.solari.com/forms/", "https://archive.md/gwP9o", "https://apnews.com/article/coronavirus-pandemic-health-police-new-york-new-york-city-9b0f72ad57fc9264794fcd45eb10dde2", "https://www.ny1.com/nyc/all-boroughs/coronavirus/2021/10/21/new-york-city-vaccine-mandate-nyc-covid-ed-grayson-sanitation-department-reaction", "https://therightscoop.com/southwest-reverses-course-on-vaccine-mandate-penalties/", "https://www.corbettreport.com/september-open-thread-2/", "https://www.corbettreport.com/solutionswatch-vaccinemandates/", "https://www.corbettreport.com/how-to-meet-like-minded-people-solutionswatch/", "https://togetherdeclaration.org/", "https://thegrayzone.com/2021/10/19/health-wealth-digital-passports-surveillance-capitalism/", "https://twitter.com/thalesdigisec/status/1425351446573297667?lang=ca", "https://www.economist.com/by-invitation/2021/10/21/sir-john-bell-on-reusing-covid-19-medical-systems-for-other-health-goals?utm_campaign=editorial-social&utm_medium=social-organic&utm_source=twitter", "https://www.technocracy.news/legal-melee-over-half-of-states-vow-to-fight-bidens-vaccine-mandates/", "https://www.technocracy.news/vaccine-passports-adopted-by-a-barrage-of-new-countries-and-airlines/", "https://www.technocracy.news/stunning-uk-reversal-scraps-vaccine-passports-lockdowns-and-pcr-tests/", "https://www.technocracy.news/revealed-propaganda-template-for-vaccine-passports/", "https://www.technocracy.news/7-key-reasons-why-vaccine-passports-are-a-dangerous-idea/", "https://www.technocracy.news/vaccine-passports-have-arrived-in-new-york/", "https://www.technocracy.news/china-seeks-to-run-global-database-for-vaccine-passports/", "https://www.technocracy.news/technocrat-vaccine-passports-will-inflict-economic-social-carnage/"], "authors": [], "publish_date": "2021-11-02T07:21:08-07:00"}