{"result_id": "283037", "URL": "https://www.technocracy.news/court-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america/", "timestamp": "2023-04-25 17:15:36 CEST+0200", "meta": {"description": "America was warned by top medical professionals, scientists and even TN that these shots were harming millions of people in America and around the world. The truth will now come out and all who took mRNA shots must strive to rebuild their immune system and detox their bodies. The long-term effects will take a huge toll.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/court-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Court Orders CDC to Release Data Showing 18 Million Vaccine Injuries in America", "cleaned_text": "America was warned by top medical professionals, scientists and even TN that these shots were harming millions of people in America and around the world. The truth will now come out and all who took mRNA shots must strive to rebuild their immune system and detox their bodies. The long-term effects will take a huge toll. Note that “800,000 hospitalizations out of 10 million people? That’s an 8% hospitalization rate. It means that as many as 18 million of the 230 million people who received at least one shot may have been hospitalized with an adverse reaction. “⁃ TN Editor\n\nMore than 18 million people were injured so badly by their first COVID shot from Pfizer or Moderna that they had to go to the hospital. That’s according to the CDC’s own internal data, which a court just ordered the federal agency to release to a watchdog group.\n\nInstead of alerting the public to the incredible dangers of these shots and completely shutting down Joe Biden’s mass vaccination mandates, the CDC covered up the info until it was forced to release. Everyone in a position of authority at the CDC should be fired for this. What good is a “public health” agency if it fails to alert the public that 8% of vaccine recipients are being hospitalized?\n\nThe CDC started a vaccine monitoring program back at the very beginning of the COVID shot rollout in December of 2020. You might remember it. The program was called V-safe. People were asked to install the V-safe app on their smartphones and then self-report if they have any negative effects from the experimental mRNA shots, which were released to the public under an Emergency Use Authorization from the FDA.\n\nA lot of people were eager to help, because world governments had scared many folks very badly over the virus. Many thought that the COVID shots were a medical miracle in late 2020. So, more than 10 million people downloaded V-safe on their smartphones, and then proceeded to get vaccinated.\n\nThat’s a huge sample size for a medical study. With 10 million people participating in the V-safe self-reporting system, it gives us an extremely accurate statistical model to use when studying the 230 million Americans who have had at least one COVID shot.\n\nThe CDC tracked data in the V-safe program for the first 18 months of the vaccine’s public availability, up through July of this year. But then, strangely, the CDC never published any data from V-safe. We couldn’t see it. We just had to trust the CDC, which had been caught lying repeatedly.\n\nThe CDC’s main webpage about the mRNA COVID shots still says, to this very day, “COVID-19 vaccines are safe, effective and free.” That’s the very first sentence on the website. Safe and effective! That’s been the CDC’s position for the entire time. The vaccines are safe, and they cannot hurt you.\n\nIf that’s true, then why wouldn’t the CDC release the data until a court ordered it to do so following a lawsuit by the Informed Consent Action Network (ICAN)? The data speaks for itself.\n\nOf the 10 million people who participated in V-safe – again, a massive sample size – 3.3 million reported Adverse Health Impacts (AHIs) immediately after their first vaccination. That’s 33% or one-in-three. Of those 3.3 million people, 1.2 million reported that they were unable to perform daily activities for a time after vaccination. 1.3 million reported getting so sick from the shots that they had to miss school or work. And about 800,000 reported being hospitalized by their COVID vaccination.\n\nThat last figure is the most worrisome. 800,000 hospitalizations out of 10 million people? That’s an 8% hospitalization rate. It means that as many as 18 million of the 230 million people who received at least one shot may have been hospitalized with an adverse reaction.\n\nA study published in June of 2021 by the National Institutes of Health – where Tony Fauci works – found that the hospitalization rate from COVID-19 for the total population was 2.1%. If you are under the age of 40, the hospitalization rate from COVID-19 is just 0.4%.\n\nFor the shots, the hospitalization rate has been 8%.\n\nYOU ARE 4 TIMES AS LIKELY TO BE HOSPITALIZED BY THE VACCINES THAN BY COVID ITSELF, NO MATTER WHAT AGE GROUP YOU ARE IN.\n\nYOU ARE 20 TIMES AS LIKELY TO BE HOSPITALIZED BY THE SHOTS IF YOU ARE UNDER AGE 40 THAN BY COVID ITSELF.\n\nYou can read the NIH-published study HERE.\n\nICAN has set up a website where you can finally view the CDC’s V-safe data online. The data was released on October 3, 2022, under a court order. You can see the data for yourself HERE.\n\nThe CDC has been lying to the American people about the vaccines all this time. There need to be legal consequences for this. Public trials and long jail sentences are necessary for anyone at the CDC who participated in this cover-up.", "opengraph": {"locale": "en_US", "type": "article", "title": "Court Orders CDC to Release Data Showing 18 Million Vaccine Injuries in America", "description": "America was warned by top medical professionals, scientists and even TN that these shots were harming millions of people in America and around the world. The truth will now come out and all who took mRNA shots must strive to rebuild their immune system and detox their bodies. The long-term effects will take a huge toll.", "url": "https://www.technocracy.news/court-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Propaganda", "updated_time": "2022-10-15T20:23:52-07:00", "image": "https://www.technocracy.news/wp-content/uploads/2022/10/Screen-Shot-2022-10-14-at-6.20.13-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/10/Screen-Shot-2022-10-14-at-6.20.13-AM.png", "image:width": "1794", "image:height": "948", "image:alt": "CDC", "image:type": "image/png", "article:published_time": "2022-10-14T06:27:43-07:00", "article:modified_time": "2022-10-15T20:23:52-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fcourt-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america%2F&text=Court%20Orders%20CDC%20to%20Release%20Data%20Showing%2018%20Million%20Vaccine%20Injuries%20in%20America", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fcourt-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america%2F", "https://parler.com/new-post?message=Court%20Orders%20CDC%20to%20Release%20Data%20Showing%2018%20Million%20Vaccine%20Injuries%20in%20America&url=https%3A%2F%2Fwww.technocracy.news%2Fcourt-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fcourt-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america%2F&text=Court%20Orders%20CDC%20to%20Release%20Data%20Showing%2018%20Million%20Vaccine%20Injuries%20in%20America", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fcourt-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america%2F&title=Court%20Orders%20CDC%20to%20Release%20Data%20Showing%2018%20Million%20Vaccine%20Injuries%20in%20America", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=42274", "https://pubmed.ncbi.nlm.nih.gov/33729203/", "https://www.icandecide.org/v-safe-data/", "https://www.americanlibertyreportnews.com/articles/court-orders-cdc-to-release-data-showing-18-million-vaccine-injuries-in-america/", "https://www.technocracy.news/shock-european-union-reports-1-5-million-vaccine-injuries-15472-deaths/", "https://www.technocracy.news/soaring-european-union-reports-1-9-million-vaccine-injuries-20595-deaths/", "https://www.technocracy.news/cdc-tracked-millions-of-phones-to-surveil-covid-lockdown-orders/", "https://www.technocracy.news/cdc-data-vaccine-injury-reports-top-50000-at-vaers/", "https://www.technocracy.news/cdc-withheld-troves-of-critical-data-to-suppress-vaccine-hesitancy/", "https://www.technocracy.news/privacy-concerns-cdcs-relentless-quest-for-data-on-vaccine-recipients/", "https://www.technocracy.news/uk-gives-police-access-to-dept-of-health-data-to-enforce-self-isolation-orders/", "https://www.technocracy.news/vax-damage-26-6-million-injured-1-36-million-disabled-300k-excess-deaths/"], "authors": [], "publish_date": "2022-10-14T06:27:43-07:00"}