{"result_id": "283020", "URL": "https://www.technocracy.news/red-states-quietly-adopting-national-vaccine-passport/", "timestamp": "2023-04-25 17:14:50 CEST+0200", "meta": {"description": "While the all-distracting war rages in Ukraine, Technocrats at home are sneaking in a system of national vaccine passports with the disingenuous carrot that \"Having digital access to personal health records empowers the individual.\"", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/red-states-quietly-adopting-national-vaccine-passport/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Red States Quietly Adopting National Vaccine Passport", "cleaned_text": "While the all-distracting war rages in Ukraine, Technocrats at home are sneaking in a system of national vaccine passports with the disingenuous carrot that “Having digital access to personal health records empowers the individual.” The polar opposite is true. The data collectors are empowered while those from whom the data is extracted are tracked, analyzed and manipulated. It is likely not state legislatures letting this in, but rather the state governors and their respective health departments. ⁃ TN Editor\n\nven as the omicron variant loosens its grip on the world, destinations continue to require travelers to show proof of vaccination. And, increasingly, a paper CDC vaccination card is not cutting it.\n\nWhile the United States government has not issued a federal digital vaccine pass, a national standard has nevertheless emerged. To date, 21 states, the District of Columbia and Puerto Rico offer accessibility to the SMART Health Card, a verifiable digital proof of vaccination developed through the Vaccination Credential Initiative (VCI), a global coalition of public and private stakeholders including Microsoft, Salesforce, Oracle, the Mayo Clinic and other health and tech heavyweights.\n\nAnd very soon, at least four more states will be rolling out access to SMART Health Cards. “We’ve seen a notable uptick in states that have officially launched public portals where individuals can get verifiable vaccination credentials in the form of SMART Health Cards with a QR code,” says Dr. Brian Anderson, co-founder of the VCI and chief digital health physician at MITRE.\n\nThere is already an impressively widespread availability of SMART Health Cards in the U.S. More than 200 million Americans can now download, print or store their vaccination records as a QR code. When the QR code is pulled up, only the individual’s name, date of birth and vaccination information is visible. No other medical information or personal data is shared. This code is also digitally signed to ensure that the card was issued from a verified location and to prevent forgery.\n\nFor individuals, the benefits of having access to personal digital vaccine record is three-fold. First, it’s a huge plus for travel in the U.S. and abroad.\n\nMany indoor cultural attractions and performance venues in the U.S. require proof of vaccination. “We believe it gives people peace of mind when the folks around them are unlikely to be contagious,” says Gus Warren, CEO of Bindle, a health verification app that allows venues to verify the vaccination status of patrons.\n\nBindle’s growing list of clients spans more than 30 states, from blue strongholds like California and New York to red leaners like Texas, Florida, Arkansas, Missouri and Georgia. At the Kennedy Center in Washington, D.C., for example, there’s a Bindle lane that offers fastpass-like efficiency in scanning QR codes from a number of vaccine verification platforms used around the world.\n\n“The SMART Health Card is such an important development and the Vaccine Credential Initiative has been phenomenal in getting this out there,” says Warren, noting that while Bindle recognizes several interoperable standards, the SMART Health Card has emerged as the most important. “Absolutely, it has become the standard across the U.S. and North America.”\n\n“And at an international level, we are continuing to see intense interest in a coordinated international approach,” says Anderson. “And that has not diminished at all. I think quite the opposite.”\n\nTo wit: Every Canadian province has now adopted SMART Health Card verification, as has Aruba, the Cayman Islands, Singapore and Japan. And in Africa, the SMART Health Card has rolled out in Kenya and Rwanda, just the first of 32 African countries in the “Smart Africa” alliance to adopt a digital-first approach to healthcare records.\n\nThe second argument for adopting a digital vaccine verification system is the one swaying red-state governors: Having digital access to personal health records empowers the individual.\n\nMore than a dozen states have launched their own SMART Health Card-based portals. At least seven others — including Arizona, Mississippi and West Virginia — have turned to a third-party, MyIRMobile, to issue SMART Health Cards. Minnesota has chosen Docket, another third-party option.\n\nMost right-leaning states offering SMART Health Cards do it quietly, without any fanfare. But big red South Carolina expects to roll out a portal for SMART Health Cards by the end of March, reports Politico.\n\n“This isn’t a passport,” South Carolina’s director of immunizations told Politico. “This is essentially a Covid card that people get at their convenience because it’s their record.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Red States Quietly Adopting National Vaccine Passport", "description": "While the all-distracting war rages in Ukraine, Technocrats at home are sneaking in a system of national vaccine passports with the disingenuous carrot that \"Having digital access to personal health records empowers the individual.\"", "url": "https://www.technocracy.news/red-states-quietly-adopting-national-vaccine-passport/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Total Surveillance Society", "image": "https://www.technocracy.news/wp-content/uploads/2022/03/smart-cards.jpeg", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/03/smart-cards.jpeg", "image:width": "960", "image:height": "782", "image:alt": "vaccine", "image:type": "image/jpeg", "article:published_time": "2022-03-01T07:26:53-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fred-states-quietly-adopting-national-vaccine-passport%2F&text=Red%20States%20Quietly%20Adopting%20National%20Vaccine%20Passport", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fred-states-quietly-adopting-national-vaccine-passport%2F", "https://parler.com/new-post?message=Red%20States%20Quietly%20Adopting%20National%20Vaccine%20Passport&url=https%3A%2F%2Fwww.technocracy.news%2Fred-states-quietly-adopting-national-vaccine-passport%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fred-states-quietly-adopting-national-vaccine-passport%2F&text=Red%20States%20Quietly%20Adopting%20National%20Vaccine%20Passport", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fred-states-quietly-adopting-national-vaccine-passport%2F&title=Red%20States%20Quietly%20Adopting%20National%20Vaccine%20Passport", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=39759", "https://smarthealth.cards/", "https://vci.org/", "https://www.mitre.org/", "https://joinbindle.com/learnmore/", "https://smarthealth.cards/en/issuers.html", "https://myirmobile.com/signin/", "https://docket.care/", "https://www.politico.com/newsletters/future-pulse/2022/02/23/red-states-putting-their-stamp-on-vaccine-passports-00010875", "https://www.forbes.com/sites/suzannerowankelleher/2022/02/24/national-vaccine-quietly-rolled-out/?sh=65852b706be6", "https://www.technocracy.news/hohmann-red-and-blue-states-getting-ugly-over-contact-tracing/", "https://www.technocracy.news/cant-hear-you-public-buses-across-country-quietly-adding-microphones-to-record-passenger-conversations/", "https://www.technocracy.news/legal-melee-over-half-of-states-vow-to-fight-bidens-vaccine-mandates/", "https://www.technocracy.news/smartphone-apps-under-development-for-global-vaccine-passport/", "https://www.technocracy.news/scottish-governments-vaccine-passport-app-sends-private-data-to-amazon-microsoft/", "https://www.technocracy.news/mercola-global-vaccine-passport-will-be-required-for-travel/", "https://www.technocracy.news/eu-to-implement-block-wide-vaccine-passport-standard/", "https://www.technocracy.news/vaccine-passport-rebellion-youre-not-going-to-brand-us/"], "authors": [], "publish_date": "2022-03-01T07:26:53-07:00"}