{"result_id": "283010", "URL": "https://www.technocracy.news/the-real-agenda-behind-vaccine-passports/", "timestamp": "2023-04-25 17:14:21 CEST+0200", "meta": {"description": "The Technocrat mindset is this: What cannot be identified and monitored cannot be controlled. This is the main point of vaccine passports, which have nothing to do with controlling the spread of disease, but rather are about controlling YOU!", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/the-real-agenda-behind-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "The Real Agenda Behind Vaccine Passports", "cleaned_text": "One day, when I was out of state, I ventured into a veterinarian’s office with my dog. Despite his need for immediate attention, the vet refused to see him without vaccination records to show he was “up-to-date” on his rabies shot. Weeks later I attempted to bring him to a dog groomer to have his nails trimmed and was faced with the same issue – no entry. When I returned back home, I had high hopes of taking my dog to a new 20-acre dog park, only to find that it required an annual pass for access, which of course was not possible without proof of the rabies shot. Sound familiar? What the corrupt establishment has done to our animals is what they are now rolling out for humans through the vaccine ID passport, only with far greater repercussions and control because they are heading straight for your bank account.\n\nA Quick Dose of Reality You Can Relate To: The System Has Already Been Tested\n\nJust a few years after the rabies immunization for dogs became available, in 1983 they released the movie “Cujo” that had Americans scared half to death of their dog becoming rabid and turning on them. Let’s put aside “rabies” for one moment and look at the system that billionaire funders of big pharma and policymakers quickly put into place. They made the vaccine mandatory, assigned an ID tag that dogs must wear, stored the information and address of the dog and its owner in a database, informed healthcare, retail, park services, and businesses that they should not provide services to those without this ID. If one doesn’t abide by this law, the owner can be fined, dog quarantined and force-vaccinated.\n\nThe system they are creating for human beings has long been tested on pet owners of dogs, and most dogs are even chipped. It is also being run through the livestock industry via RFID tags, which Corey’s Digs previously reported on. They want every living being tracked and controlled because ultimately, we are all livestock to them. Just as they are running obedience training PreK-Adult throughout the entire education system and beyond, they are doing the same obedience training through vaccine ID passports.\n\nNow I know what you’re thinking. “But, but, rabies is truly dangerous and life threatening, making these laws justifiable.” As far back as 2008, a study showed that half of the puppies and kittens in the U.S. were not even being vaccinated at all, and trends have shown that more and more people have either completely stopped the rabies shot or are not doing follow-up shots because studies have proven that one shot provides immunization for up to 6 years, not just 3 years. There are over 90 million dogs inhabiting 63 million households in the U.S. with only 60-70 annually contracting rabies. According to the CDC, wild animals that carry rabies, such as bats, raccoons, skunks, and foxes, account for 5,000 annual cases in the U.S., with just 60-70 dogs contracting it. Of those dogs who contract it, there is less than 1 dog bite of humans annually. In a 58-year stretch, between 1960-2018, there have only been 127 cases of humans contracting rabies, of which 70% were from bat bites.\n\nSo I ask, if nearly half the country has limited or forgone the rabies shot for their dog, do these numbers above reflect a significant risk? This isn’t to say that pet owners should forgo the rabies shot altogether, but if they choose that option, should there be a law in place that bans them from access to healthcare and other services for their dog? Should their be fines, quarantines, and forced vaccination? They have tested this system on pet owners for years, and half the U.S. population willingly went along with this without even questioning it. Sound familiar?\n\nWhereas, there are some states allowing for a Titer test to determine if there are still antibodies in the dog to forgo a follow-up rabies shot, that option is scarce. And whereas, there are scientific studies proving it provides much longer immunity, states and establishments don’t seem to be taking that scientific evidence into account. Meanwhile, adverse events, and in some cases death, after receiving the rabies jab have become a grave concern for pet owners, leaving them feeling backed in a corner, much like the Covid-19 jab mandates.\n\nWhen we take a look at Covid cases, it is the same pattern, only on a grander scale and with a much less life-threatening issue, with the main difference being the complete and utter exaggeration of the “virus” and case counts. So are lockdowns, mask mandates, mandatory jabs and boosters, vaccine ID passports being the only way in to restaurants and businesses, and mass scale data collection, justifiable, or have they done far more harm than good?\n\nThey are treating you like a dog, and they didn’t even show dogs the respect they deserve. You are nothing more than livestock to them. Do you want to be treated this way? Do you want your entire existence and that of your children’s to be controlled? Dogs may not be able to fight back, but we sure can.\n\nResearchers at NIAID, under the supervision of Dr. Anthony Fauci, seem to have had no problem with force-injecting 44 beagle puppies with an experimental drug and severing their vocal cords so they wouldn’t have to hear them bark in pain, all before killing and dissecting them. Does this sound like humane people? Do you believe a dog is any different than a human to them, when they have treated humans in the same way by keeping prophylaxis treatment to Covid, neglecting cancer patients of their treatment by closing off access to hospitals, and leaving the elderly to die alone?\n\nIn the World Economic Forum’s ‘Identity in a Digital World: A new chapter in the social contract,’ they have illustrated what the digital identity will look like in our everyday lives on page 10, Figure 1, for the entire world – a contract that you had no say in. Corey’s Digs has reproduced this chart above to avoid their stringent copyright issues, that makes it quite apparent that they absolutely do not want this information circulated, despite their insistence that they are creating this for the betterment of humanity, while building a “social contract” FOR you.\n\nWhat does this look like in action? One example of how the digital identity (all part in parcel with the vaccine ID passport), is the state of Illinois’ diagram of an “entitlements digital currency” benefit program for food stamps that incorporates “smart contracts” with “healthy eating tokens.” Notice that once you have been verified with your digital identity, you are given a benefit wallet that connects to smart contracts, and if you should ever try to purchase food items that do not fall into their determined “healthy food” category, you won’t be able to purchase it. Surely they are just looking out for your health.\n\nWhat this really shows is their ability to block access to anything they don’t wish you to purchase or have access to. Once all banks are connected into this digital identity (vaccine ID passport) system, they will be able to control your spending on everything. What happens if you do not get the Covid jab or booster? Every area of your life, included in the digital identity diagram above, will be controlled through this system. All data on your life will be stored within your digital identity. They sell this enslavement system as “convenience” and “equity,” while ensuring you that “you’ll own nothing and you’ll be happy.”\n\nAnother example is the NHS Covid-19 app being rolled out in the UK. As covered in Corey’s Digs report on the top Covid passports being implemented, the NHS app was created by Entrust, owned by the Quandt family, who has quite a dark history, works with IBM and Microsoft AWS, develops biometric technology, and is deeply involved with blockchain. According to the UK government, who has ­contracted with Entrust, the NHS app will store information such as race, political opinions, religious or philosophical beliefs, trade union membership, and sex life and orientation, in addition to Covid jab status and test results. They state that the “central system” only processes the data concerning health. Meanwhile, they are working on formalizing legislation by April 2022 for a “digital identity” which has already been beta tested, and may include attributes such as your NHS number, bank account number, insurance number, personal contact info, children, place of employment, etc. This “digital identity” will tie into your “right to work” and “right to rent.” Canada, Australia, and several other countries have been moving full speed ahead on the “digital identity / vaccine ID passports” agenda as well.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Real Agenda Behind Vaccine Passports", "description": "The Technocrat mindset is this: What cannot be identified and monitored cannot be controlled. This is the main point of vaccine passports, which have nothing to do with controlling the spread of disease, but rather are about controlling YOU!", "url": "https://www.technocracy.news/the-real-agenda-behind-vaccine-passports/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Technocracy", "image": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-06-at-9.36.46-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-06-at-9.36.46-AM.png", "image:width": "1200", "image:height": "682", "image:alt": "vaccine", "image:type": "image/png", "article:published_time": "2022-01-06T09:37:21-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gab.com/compose?url=https%3A%2F%2Fwww.technocracy.news%2Fthe-real-agenda-behind-vaccine-passports%2F&text=The%20Real%20Agenda%20Behind%20Vaccine%20Passports", "https://mewe.com/share?link=https%3A%2F%2Fwww.technocracy.news%2Fthe-real-agenda-behind-vaccine-passports%2F", "https://parler.com/new-post?message=The%20Real%20Agenda%20Behind%20Vaccine%20Passports&url=https%3A%2F%2Fwww.technocracy.news%2Fthe-real-agenda-behind-vaccine-passports%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fwww.technocracy.news%2Fthe-real-agenda-behind-vaccine-passports%2F&text=The%20Real%20Agenda%20Behind%20Vaccine%20Passports", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.technocracy.news%2Fthe-real-agenda-behind-vaccine-passports%2F&title=The%20Real%20Agenda%20Behind%20Vaccine%20Passports", "https://www.technocracy.news?print-my-blog=1&post-type=post&statuses%5B%5D=publish&rendering_wait=0&post_page_break=1&columns=1&font_size=normal&image_size=medium&links=include&show_site_title=1&show_site_tagline=1&show_site_url=1&show_date_printed=1&show_title=1&show_url=1&show_date=1&show_categories=1&show_featured_image=1&show_content=1&pmb_f=pdf&pmb-post=39206", "https://www.coreysdigs.com/technology/the-global-landscape-on-vaccine-id-passports-part-2-how-your-digital-identity-is-moving-to-the-blockchain-for-full-control-over-humans/", "https://www.coreysdigs.com/health-science/usda-hitting-food-supply-chain-with-cattle-surveillance-and-a-level-4-animal-disease-laboratory/", "https://www.coreysdigs.com/education-system/alert-2030-psychological-agenda-obedience-training-for-prek-adults-already-global-with-billions-in-funding-for-full-control-part-1-introduction/", "https://news.wisc.edu/low-vaccination-rate-of-u-s-puppies-and-kittens-poses-larger-risks/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC7088826/", "https://www.statista.com/statistics/198100/dogs-in-the-united-states-since-2000/", "https://www.cdc.gov/rabies/location/usa/index.html", "https://www.cdc.gov/rabies/location/usa/index.html", "https://www.coreysdigs.com/health-science/covid-19-pt-2-cdcs-new-pic-and-the-hidden-data/", "https://www.rubio.senate.gov/public/_cache/files/9177caa4-1667-4da8-a4c3-bb1bb53232e7/7950F904D150A48A9FDF31490EA0A423.21.10.29-senators-paul-marshall-cotton-rubio-braun-collins-letter-to-niaid-about-beagle-experiments.pdf", "https://www3.weforum.org/docs/WEF_INSIGHT_REPORT_Digital%20Identity.pdf", "https://www2.illinois.gov/sites/doit/Strategy/Documents/BlockchainTaskForceFinalReport020518.pdf", "https://www.coreysdigs.com/technology/the-global-landscape-on-vaccine-id-passports-part-3-the-key-implementers-of-your-digital-identity-onto-the-blockchain/", "https://www.gov.uk/government/publications/nhs-covid-19-app-privacy-information/nhs-covid-19-app-our-processing-of-special-categories-of-personal-data", "https://www.gov.uk/government/publications/uk-digital-identity-attributes-trust-framework-updated-version/uk-digital-identity-and-attributes-trust-framework-alpha-version-2", "https://www.gov.uk/government/publications/digital-identity-document-validation-technology-idvt/identity-document-validation-technology-in-the-right-to-work-and-right-to-rent-schemes-and-dbs-pre-employment-checking-accessible-version", "https://www.retailcouncil.org/coronavirus-info-for-retailers/vaccination-requirements-by-province/", "https://www.uwa.edu.au/news/Article/2021/September/Vaccine-passports-are-coming-to-Australia-How-will-they-work-and-what-will-you-need-them-for", "https://www.coreysdigs.com/health-science/22-ways-to-stop-vaccine-id-passports-in-2022-and-why-we-must/", "https://www.technocracy.news/eric-schmidt-the-real-brains-behind-bidens-science-office/", "https://www.technocracy.news/uk-rolling-out-vaccine-stamps-for-passports-in-2021/", "https://www.technocracy.news/kaboom-texas-bans-vaccine-passports/", "https://www.technocracy.news/7-key-reasons-why-vaccine-passports-are-a-dangerous-idea/", "https://www.technocracy.news/vaccine-passports-have-arrived-in-new-york/", "https://www.technocracy.news/china-seeks-to-run-global-database-for-vaccine-passports/", "https://www.technocracy.news/technocrat-vaccine-passports-will-inflict-economic-social-carnage/", "https://www.technocracy.news/global-rollout-of-digital-passports-with-vaccine-history-tied-to-personal-ids/"], "authors": [], "publish_date": "2022-01-06T09:37:21-07:00"}