{"result_id": "283032", "URL": "https://www.technocracy.news/epic-fail-covid-vaccines-do-not-impact-infection-rates/", "timestamp": "2023-04-25 17:15:24 CEST+0200", "meta": {"description": "Any evidence that mass inoculation inhibits infection rates has disappeared, yet an abundance of evidence has surfaced that people are dying from the shots all around the world. Worse, there is still no talk among Technocrats of halting this monstrous experiment on humanity. Only citizens can crush their vacuous narrative.", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/epic-fail-covid-vaccines-do-not-impact-infection-rates/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Epic Fail: COVID 'Vaccines' Do Not Impact Infection Rates", "cleaned_text": "Any evidence that mass inoculation inhibits infection rates has disappeared, yet an abundance of evidence has surfaced that people are dying from the shots all around the world. Worse, there is still no talk among Technocrats of halting this monstrous experiment on humanity. Only citizens can crush their vacuous narrative. ⁃ TN Editor\n\n> Research shows increases in COVID-19 cases are completely unrelated to levels of vaccination in 68 countries worldwide and 2,947 counties in the U.S.\n\n> The data from U.S. counties showed similar trends, with new COVID-19 cases per 100,000 people being “largely similar” regardless of the vaccination rate\n\n> Of the five U.S. counties with the highest vaccination rates — ranging from 84.3% to 99.9% fully vaccinated — four are on the U.S. Centers for Disease Control and Prevention’s “high transmission” list, while 26.3% of the 57 counties with “low transmission” had vaccination rates under 20%\n\n> Iceland and Portugal, both of which have more than 75% of their populations fully vaccinated, have more COVID-19 cases per 1 million people than Vietnam and South Africa, where only 10% or so of their populations are fully vaccinated\n\n> CDC data show rates of hospitalization for severe illness among the fully vaccinated went from 0.01% in January 2021 to 9% in May 2021, and deaths went from 0% to 15.1%. If the shots actually worked, these rates should have remained near zero\n\nConsidering the scale of the mass vaccination campaign against COVID-19, if the shots were working as advertised, we’d have vaccine-induced herd immunity already. As of October 28, 2021, 6.94 billion doses of COVID-19 jabs had been administered, equating to 49% of the world population having received at least one dose.1\n\nAdd to that the fact that we have widespread natural immunity, and COVID-19 really ought to be a non-issue at this point. Rarely does a pandemic last more than 18 months. Still, COVID-19 allegedly persists. Clearly, the mass injection effort isn’t working.\n\nA study2 published in the European Journal of Epidemiology at the end of September 2021 confirms this, showing that increases in COVID-19 cases (i.e., positive cases based on PCR testing) are completely unrelated to levels of vaccination in 68 countries worldwide. Ditto for 2,947 counties in the U.S. In the Peak Prosperity video above, Chris Martenson, Ph.D., reviews the details of this paper.\n\nData Show the COVID Jabs Have No Impact on Infection Rates\n\nWhile the official COVID narrative continues to blame the ongoing pandemic on the unvaccinated, data show that areas with high vaccination rates, like Israel, continue to have significant COVID-19 spread. As noted by S.V. Subramanian, from the Harvard Center for Population and Development Studies and a colleague in the European Journal of Epidemiology:3\n\n“Vaccines currently are the primary mitigation strategy to combat COVID-19 around the world. For instance, the narrative related to the ongoing surge of new cases in the United States (US) is argued to be driven by areas with low vaccination rates.\n\nA similar narrative also has been observed in countries, such as Germany and the United Kingdom. At the same time, Israel that was hailed for its swift and high rates of vaccination has also seen a substantial resurgence in COVID-19 cases.”\n\nUsing data available as of September 3, 2021, from Our World in Data for cross-country analysis, and the White House COVID-19 Team data for U.S. counties, the researchers investigated the relationship between new COVID-19 cases and the percentage of the population that had been fully vaccinated.\n\nSixty-eight countries were included. Inclusion criteria included second dose vaccine data, COVID-19 case data and population data as of September 3, 2021. They then computed the COVID-19 cases per 1 million people for each country, and calculated the percentage of population that was fully vaccinated.\n\nAccording to the authors, there was “no discernable relationship between percentage of population fully vaccinated and new COVID-19 cases in the last seven days.” If anything, higher vaccination rates were associated with a slight increase in cases. According to the authors:4\n\n“[T]he trend line suggests a marginally positive association such that countries with higher percentage of population fully vaccinated have higher COVID-19 cases per 1 million people.”\n\nAs noted by Martenson, this flies in the face of the official narrative, which claims the shots are highly effective at preventing symptomatic infection. Wikipedia goes so far as to claim “A COVID-19 vaccine is a vaccine intended to provide acquired immunity against COVID-19,”5 when in fact it does no such thing at all.\n\nEven the developers admit the shot cannot prevent infection. It only reduces symptoms of infection. That just goes to show how utterly unreliable Wikipedia is. It’s biased to the point of being disinformation.\n\nIf there were any doubt for the need to seriously question the worldwide mass injection campaign, this should put it to rest: Iceland and Portugal, both of which have more than 75% of their populations fully vaccinated, have more COVID-19 cases per 1 million people than Vietnam and South Africa, where only 10% or so of their populations are fully vaccinated.6\n\nIsrael is another example. With more than 60% of its population fully vaccinated, it had the highest number of COVID-19 cases per 1 million people in the seven days leading up to September 3, 2021.7\n\nThe data from U.S. counties showed similar trends, with new COVID-19 cases per 100,000 people being “largely similar” regardless of the vaccination rate. “I’m pretty sure this is not how it’s supposed to be working,” Martenson says.\n\nHe points out that President Biden recently issued a statement saying health care workers need to be fully vaccinated because then they “cannot transmit COVID-19 to patients.” “That doesn’t make sense though,” Martenson says, “because here we’re not seeing that association, which ought to be, the more vaccinated [a population is], the lower the transmission rate.”\n\nThe authors of the study further note there’s no evidence at all that cases are declining as vaccination rates rise. “There also appears to be no significant signaling of COVID-19 cases decreasing with higher percentages of population fully vaccinated,” they write.8\n\nNotably, out of the five U.S. counties with the highest vaccination rates — ranging from 84.3% to 99.9% fully vaccinated — four were on the U.S. Centers for Disease Control and Prevention’s “high transmission” list. Meanwhile, 26.3% of the 57 counties with “low transmission” had vaccination rates under 20%.\n\nThe study even accounted for a one-month lag time that could occur among the fully vaccinated, since it’s said that it takes two weeks after the final dose for “full immunity” to occur. Still, “no discernable association between COVID-19 cases and levels of fully vaccinated” was observed.9\n\nThe study summed up several reasons why the “sole reliance on vaccination as a primary strategy to mitigate COVID-19” should be reevaluated. For starters, the jab’s effectiveness rapidly wanes.\n\nA report from Israel’s Ministry of Health showed that Pfizer-BioNTech’s injection went from a 95% effectiveness in December 2020, to 64% in early July 2021 and 39% by late July, when the Delta strain became predominant.10,11\n\n“A substantial decline in immunity from mRNA vaccines six months post immunization has also been reported,” the researchers noted, adding that even severe hospitalization and death from COVID-19, which the jabs claim to offer protection against, have dramatically increased.\n\nU.S. Centers for Disease Control and Prevention data show rates of hospitalization for severe illness among the fully vaccinated went from 0.01% in January 2021 to 9% in May 2021, and deaths went from 0% to 15.1%.12,13 If the shots work as advertised, why are these rates rising? They should have remained near zero.\n\nThe researchers also noted that immunity derived from the Pfizer-BioNTech vaccine is not as strong as immunity acquired through recovery from the COVID-19 virus.14 For instance, a retrospective observational study published August 25, 2021, revealed that natural immunity is superior to immunity from COVID-19 jabs. According to the authors of that study:15\n\n“… natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity.“\n\nThe fact is, while breakthrough cases continue among those who have gotten COVID-19 injections, it’s extremely rare to get reinfected by COVID-19 after you’ve already had the disease and recovered.\n\nThis was demonstrated in an Irish study,16 which looked at data from 615,777 people who had recovered from COVID-19, with a follow-up of more than 10 months. The absolute reinfection rate ranged from 0% to 1.1%, while the median reinfection rate was just 0.27%.17,18,19 As noted by the authors, “Reinfection was an uncommon event … with no study reporting an increase in the risk of reinfection over time.”\n\nAnother study revealed similarly reassuring results. It followed 43,044 SARS-CoV-2 antibody-positive people for up to 35 weeks, and only 0.7% were reinfected. When genome sequencing was applied to estimate population-level risk of reinfection, the risk was estimated at 0.1%.20\n\nAfter seven months, there still was no indication of waning immunity. According to the authors of that study: “Reinfection is rare. Natural infection appears to elicit strong protection against reinfection with an efficacy >90% for at least seven months.”21\n\nAll Risk and No Reward\n\nThe purpose of informed consent is to give people all of the available data related to a medical procedure so they can make an educated decision before consenting. In the case of the COVID-19 jab, very little data were initially available, given their emergency authorization.\n\nHowever, as serious side effects became increasingly apparent, attempts to share them publicly were silenced. Medical professionals and scientists were censored and deplatformed simply for sharing well-founded concerns.\n\nIn August 2021, a large study from Israel22 revealed that the Pfizer COVID-19 mRNA jab is associated with a threefold increased risk of myocarditis,23 leading to the condition at a rate of 1 to 5 events per 100,000 persons.24 Other elevated risks were also identified following the COVID-19 jab, including lymphadenopathy (swollen lymph nodes), appendicitis and herpes zoster infection.25\n\nDr. Peter McCullough, an internist, cardiologist and epidemiologist, is among those who have warned that COVID-19 injections are not only failing, but putting lives at risk.26 According to McCullough, by January 22, 2021, there had been 186 deaths reported to the Vaccine Adverse Event Reporting System (VAERS) database following COVID-19 injection — more than enough to reach the mortality signal of concern to stop the program.\n\n“With a program this size, anything over 150 deaths would be an alarm signal,” he said. The U.S. “hit 186 deaths with only 27 million Americans jabbed.” McCullough believes if the proper safety boards had been in place, the COVID-19 jab program would have been shut down in February 2021 based on safety and risk of death.27\n\nHowever, by intentionally suppressing information, the media and Big Tech have made informed consent impossible. You simply cannot make an informed decision when only one side is allowed to speak and share information. Making matters worse, there’s evidence that the agencies we depend on to ensure drug safety and safeguard public health are manipulating statistics and carrying on their own cover-up to boost vaccine uptake.\n\nNow, with data showing no difference in rates of COVID-19 cases among the vaxxed and unvaxxed, it appears more and more likely that the injections have a high level of risk with very little reward, especially among younger people, whose risk of serious COVID-19 infection is vanishingly small.\n\nDue to the risk of myocarditis, Britain’s Joint Committee on Vaccination and Immunization (JCVI) recommended against COVID-9 injections for healthy 12- to 15-year-olds.28\n\nMeanwhile, the U.S. FDA not only gave the green light to teens but also OK’d the Pfizer shot to children aged 5 to 11,29 despite strong objections from qualified doctors and scientists. As reported by The Defender:30\n\n“Experts raised concerns over the lack of safety and efficacy data presented by Pfizer for use of its COVID vaccine in younger children, and they pointed to increasing safety signals based on reports to the Vaccine Adverse Event Reporting System (VAERS). They also questioned the need to vaccinate children — whose risk of dying from COVID is “almost nil” — at all.\n\nAccording to Dr. Meryl Nass, member of the Children’s Health Defense Scientific Advisory Panel, Pfizer once again did not use all of the children who participated in the trial in their safety study.\n\n‘Three thousand children received Pfizer’s COVID vaccine, but only 750 children were selectively included in the company’s safety analysis,’ Nass said. ‘Studies in the 5-11 age group are essentially the same as the 12-15 group.\n\nIn other words, equally brief and unsatisfying, with inadequate safety data and efficacy data, with no strong support for why this type of immuno-bridging analysis is sufficient … All serious adverse events were considered unrelated to the vaccine’ …\n\nDr. Jessica Rose, viral immunologist and biologist, told the panel EUA of biological agents requires the existence of an emergency and the nonexistence of alternate treatment. ‘There is no emergency and COVID-19 is exceedingly treatable,’ Rose said.\n\nIn a peer-reviewed study31 co-authored by Rose, myocarditis rates were significantly higher in people 13 to 23 years old within eight weeks of the COVID vaccine rollout. In 12- to15-year-olds, Rose said, reported cases of myocarditis were 19 times higher than background rates …\n\nRose said tens of thousands of reports have been submitted to VAERS for children ages 0 to 18. Rose explained: ‘In this age group, 60 children have died — 23 of them were less than 2 years old.\n\nIt is disturbing to note that ‘product administered to patient of inappropriate age’ was filed 5,510 times in this age group. Two children were inappropriately injected, presumably by a trained medical professional, and subsequently died.'”\n\nIn an October 20, 2021, article,32 Paul Elias Alexander, Ph.D., a former assistant professor of evidence-based medicine and research methods, called the plan to vaccinate young children “absolutely reckless” and “dangerous based on lack of safety data and poor research methodology.”\n\nWe’ve also discovered that the FDA is ignoring and burying data on children who were seriously injured in the vaccine trials,33 which further erodes confidence in what little trial data there is. Meanwhile, data suggest no child has died from COVID-19 who did not have a serious underlying health condition. Alexander reviews that data in his article.\n\nMaking matters more problematic, there’s evidence suggesting the shots are driving the creation of mutations resulting in variants with enhanced infectivity and antibody-evading capabilities. Aside from waning effectiveness, this helps explain why rates of serious infection among the fully vaccinated keep rising.\n\nFor example, a study34 posted August 23, 2021, on the preprint server bioRxiv warned the Delta variant “is posed to acquire complete resistance to wild-type spike vaccines.”\n\nAccording to the authors, when four common mutations were introduced into the receptor binding domain of the Delta variant, Pfizer vaccine antibodies could no longer neutralize the virus. They also found it had enhanced infectivity. This could essentially turn into a worst-case scenario that sets up those who have received the Pfizer shots for more severe illness when exposed to the virus.\n\nA Delta variant with three of the four mutations has already emerged,35 which suggests it’s only a matter of time before a fourth mutation develops, at which point the virus would be completely resistant to the Pfizer jab.\n\nMany have in fact warned about immune escape due to the pressure being placed upon the COVID-19 virus during mass vaccination.36 Another study37 — this one based on a mathematical model — found that a worst-case scenario can develop when a large percentage of a population is vaccinated but viral transmission remains high.\n\nThis represents the prime scenario for the development of resistant mutant strains,38 and that’s precisely the situation the U.S. and many other parts of the world are in right now. It’s time to acknowledge that the COVID shots aren’t the answer. Natural immunity is. As the European of Journal of Epidemiology researchers noted:39\n\n“Stigmatizing populations can do more harm than good. Importantly, other non-pharmacological prevention efforts (e.g., the importance of basic public health hygiene with regards to maintaining safe distance or handwashing, promoting better frequent and cheaper forms of testing) needs to be renewed in order to strike the balance of learning to live with COVID-19 in the same manner we continue to live a 100 years later with various seasonal alterations of the 1918 Influenza virus.”\n\nDo Your Own Risk-Benefit Analysis\n\nIndeed, at this point, we know there’s no reason to fear COVID-19. Overall, its lethality is on par with the common flu.40,41,42,43,44 Provided you’re not in a nursing home or have multiple comorbidities, your chances of surviving a bout of COVID-19 is 99.74%, on average.45 It truly doesn’t get much better than that, unless you expect mankind to suddenly achieve immortality.\n\nShould you develop symptoms, remember there are several effective early treatment protocols to choose from, such as the Frontline COVID-19 Critical Care Alliance I-MASK+46 protocol, the Zelenko protocol,47 and nebulized peroxide, detailed in Dr. David Brownstein’s case paper48 and Dr. Thomas Levy’s free e-book, “Rapid Virus Recovery.” Whichever treatment protocol you use, make sure you begin treatment as soon as possible, ideally at first onset of symptoms.\n\nThe reported rate of death from COVID-19 shots in the national Vaccine Adverse Events Reporting System (VAERS), on the other hand, exceeds the reported death rate of more than 70 vaccines combined over the past 30 years, and if you are injured by a COVID shot and live in the U.S., your only recourse is to apply for compensation from the Countermeasures Injury Compensation Act (CICP).49\n\nCompensation from CICP is very limited and hard to get. In its 15-year history, it has paid out just 29 claims, fewer than 1 in 10.50,51,52 You only qualify if your injury requires hospitalization and results in significant disability and/or death, and even if you meet the eligibility criteria, it requires you to use up your private health insurance before it kicks in to pay the difference.\n\nThere’s no reimbursement for pain and suffering, only lost wages and unpaid medical bills. This means a retired person cannot qualify even if they die or end up in a wheelchair. Salary compensation is of limited duration, and capped at $50,000 a year, and the CICP’s decision cannot be appealed.\n\nTo get an idea of what the real-world risks actually are, consider reviewing some of the cases reported to nomoresilence.world, a website dedicated to giving a voice to those injured by COVID shots.\n\nLastly, if you or a head of your household is considering the jab, review the family financial disclosure form created by The Solari Report, for the purpose of ensuring that an adverse event or death does not translate into financial destruction for the entire family.", "opengraph": {"locale": "en_US", "type": "article", "title": "Epic Fail: COVID 'Vaccines' Do Not Impact Infection Rates", "description": "Any evidence that mass inoculation inhibits infection rates has disappeared, yet an abundance of evidence has surfaced that people are dying from the shots all around the world. Worse, there is still no talk among Technocrats of halting this monstrous experiment on humanity. Only citizens can crush their vacuous narrative.", "url": "https://www.technocracy.news/epic-fail-covid-vaccines-do-not-impact-infection-rates/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Pandemic", "image": "https://www.technocracy.news/wp-content/uploads/2021/11/wheels-off-the-bus.jpeg", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2021/11/wheels-off-the-bus.jpeg", "image:width": "1137", "image:height": "640", "image:alt": "COVID", "image:type": "image/jpeg", "article:published_time": "2021-11-11T08:19:41-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://rvr.medfoxpub.com/", "https://nomoresilence.world/", "https://home.solari.com/forms/", "https://ourworldindata.org/covid-vaccinations?country=USA", "https://link.springer.com/article/10.1007/s10654-021-00808-7#Sec4", "https://en.wikipedia.org/wiki/COVID-19_vaccine", "https://www.cnbc.com/2021/07/23/delta-variant-pfizer-covid-vaccine-39percent-effective-in-israel-prevents-severe-illness.html", "https://blogs.bmj.com/bmj/2021/08/23/does-the-fda-think-these-data-justify-the-first-full-approval-of-a-covid-19-vaccine/?utm_source=twitter&utm_medium=social&utm_term=hootsuite&utm_content=sme&utm_campaign=usage", "https://fm.cnbc.com/applications/cnbc.com/resources/editorialfiles/2021/07/30/CDC_slides.pdf", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8209951/pdf/RMV-9999-e2260.pdf", "https://www.theblaze.com/op-ed/horowitz-israeli-government-data-shows-natural-immunity-from-infection-much-stronger-than-vaccine-induced-immunity#toggle-gdpr", "https://newsrescue.com/delta-variant-natural-immunity-700-greater-protection-than-shot-data-from-israeli-govt-shows/", "https://www.medrxiv.org/content/10.1101/2021.01.15.21249731v1", "https://www.nejm.org/doi/full/10.1056/NEJMoa2110475?query=featured_home", "https://www.medpagetoday.com/infectiousdisease/covid19vaccine/94213", "https://www.nejm.org/doi/full/10.1056/NEJMoa2110475?query=featured_home", "https://www.bitchute.com/video/BxME0RDJ61S9/", "https://www.bitchute.com/video/BxME0RDJ61S9/", "https://www.yahoo.com/news/uk-advisers-decide-against-covid-144132705.html", "https://www.zerohedge.com/covid-19/fda-panel-votes-favor-pediatric-pfizer-covid-19-vaccine?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+zerohedge%2Ffeed+%28zero+hedge+-+on+a+long+enough+timeline%2C+the+survival+rate+for+everyone+drops+t", "https://childrenshealthdefense.org/defender/fda-endorses-pfizer-covid-vaccine-children/?utm_source=salsa&eType=EmailBlastContent&eId=eff7f043-13ae-4afc-80bb-76e5996c583a", "https://pubmed.ncbi.nlm.nih.gov/34601006/", "https://brownstone.org/articles/dear-pfizer-leave-the-children-alone/", "https://aaronsiri.substack.com/p/fda-buries-data-on-seriously-injured?justPublished=true", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1.full", "https://www.nature.com/articles/s41598-021-95025-3?utm_medium=affiliate&utm_source=commission_junction&utm_campaign=3_nsn6445_deeplink_PID100052172&utm_content=deeplink", "https://archive.is/IWWCC", "https://www.acpjournals.org/doi/10.7326/M20-5352", "https://www.breitbart.com/politics/2020/05/07/doctor-to-senators-coronavirus-fatality-rate-10-to-40x-lower-than-estimates-that-led-to-lockdowns/", "https://www.hsgac.senate.gov/imo/media/doc/Testimony-Atlas-2020-05-06.pdf", "https://www.hsgac.senate.gov/imo/media/doc/Testimony-Ioannidis-2020-05-06.pdf", "https://covid19criticalcare.com/i-mask-prophylaxis-treatment-protocol/i-mask-protocol-translations/", "https://faculty.utrgv.edu/eleftherios.gkioulekas/zelenko/index.html", "https://thepowerofozone.com/wp-content/uploads/2020/07/Dr.-David-Brownstein-Covid.pdf", "https://crsreports.congress.gov/product/pdf/LSB/LSB10584", "https://www.lifesitenews.com/news/hundreds-awaiting-a-decision-from-the-govts-stingy-vaccine-injury-compensation-program", "https://www.insurancejournal.com/news/national/2020/08/14/579150.htm", "https://www.insurancejournal.com/news/national/2020/12/29/595414.htm"], "authors": [], "publish_date": "2021-11-11T08:19:41-07:00"}