{"result_id": "283008", "URL": "https://www.technocracy.news/paypal-terminates-service-for-nonprofits-fighting-vaccine-mandates/", "timestamp": "2023-04-25 17:14:18 CEST+0200", "meta": {"description": "Technocracy's coup d'état expands as Big Tech financial companies like Paypal drop organizations who oppose the Technocrat narrative. Banks have also joined the purge as well: all of Mike Lindell's business banking accounts were summarily terminated last week by the Heartland Financial Minnesota Bank & Trust", "lang": "en", "keywords": "", "favicon": "https://www.technocracy.news/wp-content/uploads/2017/12/tn-globe-only-for-youtube-100x100.png", "canonical": "https://www.technocracy.news/paypal-terminates-service-for-nonprofits-fighting-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "www.technocracy.news", "title": "Paypal Terminates Service For Nonprofits Fighting Vaccine Mandates", "cleaned_text": "Technocracy’s coup d’état expands as Big Tech financial companies like Paypal drop organizations who oppose the Technocrat narrative. Banks have also joined the purge as well: all of Mike Lindell’s business banking accounts were summarily terminated last week by the Heartland Financial Minnesota Bank & Trust. ⁃ TN Editor\n\n> Instead of ignoring, fearing or abandoning information that is being targeted with censorship, use censorship as a cue or guide that you should delve more deeply into the topic at hand to reveal the underlying truth\n\n> PayPal is actively researching transactions that fund hate groups, antigovernment organizations and extremists; it’s unclear, however, how they define these terms or the groups that fall under them\n\n> December 21, 2021, after business hours, PayPal notified the National Vaccine Information Center that it would no longer process donations from their supporters — effective immediately\n\nPayPal is the latest tech giant to join the censorship game, shutting down its services for a variety of nonprofit organizations that are working to stop injection mandates.\n\nThis increasingly orchestrated attack has targeted the National Vaccine Information Center (NVIC), the Front Line COVID-19 Critical Care Alliance (FLCCC), Organic Consumer’s Association (OCA) and many others — and should send a chill down the spine of anyone who values the freedom upon which the U.S. was founded.\n\nPowerful forces are at play, and Big Tech is among them, working to suppress, discredit and silence certain science, speech and viewpoints. “No longer is there any doubt,” investigative journalist Sharyl Attkisson reported, “that vaccine industry interests and other corporate and political interests are pulling the strings so that Big Tech moves to squash scientific views, studies, scientists, and opinions that are contrary to the narrative.”1\n\nDecember 21, 2021, after business hours, PayPal notified NVIC that it would no longer process donations from their supporters — effective immediately. “In essence,” NVIC wrote in a news release, “PayPal wants to control your choices and tell you which nonprofit charities you may and may not support. Pay Pal’s sudden and unexplained action against our donors comes in the middle of our annual end-of-year fundraising campaign.”2\n\nPayPal’s attack against them is the culmination of Big Tech’s attempts to silence the nonprofit. After NVIC held its Fifth International Public Conference on Vaccination — Protecting Health & Autonomy in the 21st Century — in October 2020, they were increasingly targeted by mainstream media and a “political operative in the U.K.” During 2021, they were eliminated from Facebook, Instagram, Twitter and YouTube — yet their resolve to share the truth hasn’t wavered.\n\nThe same is true following PayPal’s announcement that they had cancelled NVIC’s account. It didn’t stop NVIC — the nonprofit simply secured a new secure platform for donations. They announced December 24, 2021:3\n\n“Just as we pivoted in early 2021 to establish our presence on new social media platforms, NVIC has quickly established a secure alternative to PayPal for processing your credit card donations … NVIC is being heavily censored because we have spoken the truth about vaccination, health and autonomy for 40 years.\n\nWhile big tech and the forced vaccination lobby put out a steady supply of authoritarian propaganda promoting fear and hatred of those who engage in rational thinking, NVIC will continue to defend the legal right to make voluntary choices about vaccination without being punished for the choice made as we move forward with our mission to prevent vaccine injuries and deaths through public education and defend the informed consent ethic.”\n\nThe press following PayPal’s cancellation worked against the tech giant, as it prompted NVIC supporters to help in response. As Attkisson explained:4\n\n“The National Vaccine Information Center (NVIC) is one of the many fact-based advocacy groups that has suffered under the heavy hand of censorship from Big Tech acting on behalf of pharmaceutical/government/corporate interests. But victory can be found in a strategy that turns the censorship on its head.\n\nIf Americans can use censorship as a cue or guide to seek more information about that topic, person, or study, they defeat the intent of the censors.\n\nAfter NVIC was dumped from PayPal so that donations from supporters could not be processed during a crucial fundraising campaign, the nonprofit announced it had established a presence on an alternative fundraising platform. And the American people responded. NVIC has announced receiving substantial donations and support on the new platform, in part due to the attention the PayPal censorship gave to the issue.”\n\nIn October 2021, self-proclaimed “media watchdog” group Media Matters accused PayPal and GoFundMe of “hosting crowdfunding campaigns for organizations that spread harmful COVID-19 misinformation.”5\n\nSome of the organizations mentioned in the article include the Front Line COVID-19 Critical Care Alliance (FLCCC), America’s Frontline Doctors and Children’s Health Defense, which have been speaking out about early COVID-19 treatments and red flags about censorship since the beginning of the pandemic.\n\nDefining them as “groups known for spreading medical misinformation,” the article, which itself is spreading misinformation, then calls out PayPal’s policies that do not allow users to “provide false, inaccurate or misleading information,” among others.6\n\nIn short, people and organizations are being censored, deplatformed and banned from social media and payment processing platforms for the crime of spreading “misinformation,” the meaning of which can change from day to day and from platform to platform.\n\nIn July 2021, Reuters also reported that PayPal planned to research transactions that fund hate groups, anti-government organizations and extremists. It’s unclear, however, how they define these terms or the groups that fall under them.7\n\nIt’s a modern-day witch hunt, whereby the U.S. Department of Homeland Security even lists promulgating “false narratives” around COVID-19 as a top national security threat, which basically puts a “domestic terrorist” target on the backs of those of us who have been identified as the most prolific “superspreaders” of COVID-19 misinformation, whatever that “misinformation” happens to be.\n\nIn the case of OCA, which was also suddenly dropped by PayPal, it was said that they violated the company’s “acceptable use” policies. In a message to their subscribers and donors, OCA put it bluntly: “We are under attack.” They continued:8\n\n“Last week PayPal, our credit card processor for hundreds of thousands of dollars in donations, (and recurring donations) cut off all of our accounts (OCA, Regeneration International, and Citizens Regeneration Lobby) with no notice, claiming that we were violators of PayPal’s “acceptable use” policies.\n\nThis outrageous attack on OCA’s fundraising is similar to the intimidation and censorship carried out by other Silicon Valley giants such as Facebook, who have threatened to cut off OCA and Millions Against Monsanto from our two million social media followers, unless we stop talking about the origins, nature, virulence, prevention, and treatment of COVID-19.\n\nSubsequently we have been forced to put out two different versions of our weekly newsletter, Organic Bytes, one uncensored for our subscribers, one censored for distribution on social media. Needless to say OCA will not back down from our investigative reporting, our denunciations of corporate and government corruption and crime, and our truth-telling regarding genetic engineering and COVID-19.\n\nWe are exploring litigation against PayPal with lawyers and allied organizations who support free speech and truth-telling.”\n\nLike NVIC, OCA wasn’t deterred by PayPal’s act of censorship; they simply switched to another credit card processor to continue on with their mission, despite the ongoing attempts at government intimidation and Big Tech censorship.\n\nMany may not be aware of the close ties between PayPal’s early employees, who came to be known as the “PayPal Mafia,” and big names in the tech industry today. As reported by Insider, “The payments company — launched as Confinity in 1998 by Peter Thiel, Max Levchin, and Luke Nosek — grew to become a Silicon Valley giant.\n\nIt was acquired by eBay in 2002 for $1.5 billion in a deal that altered Silicon Valley history and helped spawn the careers of some of tech’s most famous names.”9 This includes:10\n• Palantir — This data analytics software company was founded by Thiel in 2003; the idea came from his experiences with credit card fraud at PayPal.\n• Affirm — This company allows people shopping online to pay for products over time using an instant line of credit. It was founded in 2013 by Max Levchin, one of PayPal’s cofounders.\n• YouTube — YouTube founders Steve Chen and Chad Hurley worked at PayPal during its early days.\n• SpaceX — Elon Musk’s banking company X.com merged with Thiel’s company Confinity to become PayPal in 2001. Not only is Musk a former PayPal CEO, but he made $165 million when PayPal sold, which was used to start SpaceX.\n• LinkedIn — LinkedIn’s founder, Reid Hoffman, was a former executive vice president at PayPal.\n\nPayPal terminating nonprofits is only the tip of the iceberg when it comes to Big Tech and its censorship of the information you see daily on the internet. Efforts to shut down public discussions and information are in full force, while Big Tech is also actively manipulating what you can and can’t see online, to the extent that they can alter perceptions of reality.\n\nZachary Vorhies, a former senior software engineer at Google and Google’s YouTube, uncovered more than 950 pages of confidential Google documents showing a plan to re-rank the entire internet based on Google’s corporate values, using machine learning to intervene for “fairness.”\n\nHe resigned in June 2019 and turned over the documents to the Department of Justice, then released them to the public via Project Veritas to expose Google’s censorship activities.11 Susan Wojcicki, the CEO of YouTube, made pushing down “fake news” and increasing “authoritative news” sound like a good thing, Attkisson reported,12 but when Vorhies looked at Google’s design documents, the fake news they were censoring wasn’t really fake.\n\n“I was apolitical,” he said, “but I started to think, is this really fake news? Why are they defining it as fake news in order to justify censorship?” Part of this involved Google’s efforts at social reconstruction to correct “algorithmic unfairness,” which could be any algorithm that reinforces existing stereotypes.\n\nCould objective reality be algorithmically unfair? Google says yes. Vorhies used the example of doing a Google search for CEOs, and the images returned included mostly men. Although it’s reality, this could be considered algorithmically unfair and, according to Google, justifies intervention in order to fix it. He also uses the example of the autofill search recommendations that pop up if you do a Google search.\n\nAutofill is what happens when you start typing a search query into a search engine and algorithms kick in to offer suggestions to complete your search. If you type “men can,” you may get autofill recommendations such as “men can lactate” and “men can get pregnant,” or “women can produce sperm” — things that represent an inversion of stereotypes and a reversal of gender roles.\n\nWe’ve been led to believe that whatever the autofill recommendations are is what most people are searching for — Google has stated that the suggestions given are generated by a collection of user data — but that’s not true, at least not anymore.\n\nFLCCC Was Also Canceled by PayPal\n\nIn another example of Big Tech and PayPal’s overreach, they also shut down FLCCC’s donation platform October 15, 2021, “in violation of PayPal’s Acceptable Use Policy.”13 “Big tech must think we’re having a big impact,” FLCCC tweeted. “We are.”14 But again, it’s not only PayPal — this is an orchestrated effort by Big Tech, in concert with government, media, intelligence agencies and other forces. As FLCCC reported:15\n\n“These attacks join LinkedIn and Vimeo, which removed our accounts, and YouTube, which began taking down our testimonial videos months ago. The powerful forces of Big Tech, Big Pharma, government, health authorities, and mainstream media continue to suppress us. There is nothing false in anything that we post.\n\nThis is an attack on our ability to fundraise, our free speech, and our efforts to share effective, safe COVID-19 prevention and treatment protocols to help people around the world stay out of the hospital — and to save precious lives impacted by this dangerous virus.”\n\nWhat can you do? Fight back against the heavy hand of censorship by beating them at their own game. Instead of ignoring, fearing or abandoning the information that is being targeted with censorship, do as Attkisson suggested — use censorship as a cue or guide that you should delve more deeply into the topic at hand to reveal the underlying truth.", "opengraph": {"locale": "en_US", "type": "article", "title": "Paypal Terminates Service For Nonprofits Fighting Vaccine Mandates", "description": "Technocracy's coup d'état expands as Big Tech financial companies like Paypal drop organizations who oppose the Technocrat narrative. Banks have also joined the purge as well: all of Mike Lindell's business banking accounts were summarily terminated last week by the Heartland Financial Minnesota Bank & Trust", "url": "https://www.technocracy.news/paypal-terminates-service-for-nonprofits-fighting-vaccine-mandates/", "site_name": "Technocracy News", "article:publisher": "https://www.facebook.com/TechnocracyRising/", "article:author": "https://www.facebook.com/Patwood", "article:section": "Censorship", "image": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-18-at-8.39.10-AM.png", "image:secure_url": "https://www.technocracy.news/wp-content/uploads/2022/01/Screen-Shot-2022-01-18-at-8.39.10-AM.png", "image:width": "1464", "image:height": "812", "image:alt": "paypal", "image:type": "image/png", "article:published_time": "2022-01-18T08:39:50-07:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://sharylattkisson.com/2022/01/censored-national-vaccine-information-center-2/", "https://www.nvic.org/NVIC-Vaccine-News/December-2021/paypal-stops-nvic-donations.aspx", "https://sharylattkisson.com/2022/01/censored-national-vaccine-information-center-2/", "https://www.mediamatters.org/coronavirus-covid-19/paypal-and-gofundme-are-hosting-crowdfunding-campaigns-organizations-spread", "https://www.reuters.com/business/finance/paypal-research-blocking-transactions-that-fund-hate-groups-extremists-2021-07-26/", "https://www.organicconsumers.org/newsletter/resolution-and-regeneration/we-are-under-attack", "https://www.businessinsider.com/tech-companies-founded-by-paypal-mafia-full-list-2020-10#secretive-data-company-palantir-was-founded-in-part-by-peter-thiel-paypals-cofounder-1", "https://www.projectveritas.com/news/zach-vorhies-google/", "http://fullmeasure.news/news/full-episodes/full-measure-january-10-2021-cover-story-big-tech-whistleblower", "https://twitter.com/covid19critical/status/1449177199001673734?lang=en", "https://mailchi.mp/flccc.net/flccc-under-attack-by-big-tech-paypal-and-facebook-i8fkgwpqjp"], "authors": [], "publish_date": "2022-01-18T08:39:50-07:00"}