{"result_id": "285011", "URL": "https://www.theautomaticearth.com/tag/mrna/", "timestamp": "2023-04-25 17:16:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/mrna/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "mRNA Archives", "cleaned_text": "“What we shouldn’t do now is inflame the situation further through saber-rattling and warmongering. Whoever believes that a symbolic tank parade on the alliance’s eastern border will bring security is mistaken.”\n\nWestern leaders privately told Ukrainian President Volodymyr Zelensky that Ukraine can not win the war against Russia and that it should begin peace talks with Moscow this year in exchange for closer ties with NATO. The private communications are at odds with public statements from Western leaders who routinely say they will continue to support Ukraine for as long as it takes until it achieves victory on the battlefield. The Wall Street Journal, which reported on the private remarks to Zelenksy, said:“The public rhetoric masks deepening private doubts among politicians in the U.K., France and Germany that Ukraine will be able to expel the Russians from eastern Ukraine and Crimea, which Russia has controlled since 2014, and a belief that the West can only help sustain the war effort for so long, especially if the conflict settles into a stalemate, officials from the three countries say. ‘We keep repeating that Russia mustn’t win, but what does that mean? If the war goes on for long enough with this intensity, Ukraine’s losses will become unbearable,’ a senior French official said. ‘And no one believes they will be able to retrieve Crimea.’ French President Emmanuel Macron and German Chancellor Olaf Scholz told Zelensky at an Élysée Palace dinner earlier this month that he must consider peace talks with Moscow, the Journal reported. According to its source, the newspaper quoted Macron as telling Zelensky that “even mortal enemies like France and Germany had to make peace after World War II.” Macron told Zelensky “he had been a great war leader, but that he would eventually have to shift into political statesmanship and make difficult decisions,” the newspaper reported. At the Munich Security Conference last week, Gen. Petr Pavel, the Czech Republic’s president-elect and a former NATO commander, said: “We may end up in a situation where liberating some parts of Ukrainian territory may deliver more loss of lives than will be bearable by society. … There might be a point when Ukrainians can start thinking about another outcome.” Even when he was a NATO commander Pavel was a realist in regard to Russia. During controversial NATO war games with 31,000 troops on Russia’s borders in 2016 — the first time in 75 years that German troops had retraced the steps of the Nazi invasion of the Soviet Union — Pavel dismissed hype about a Russian threat to NATO. Pavel, who was chairman of NATO’s military committee at the time, told a Brussels press conference that, “It is not the aim of NATO to create a military barrier against broad-scale Russian aggression, because such aggression is not on the agenda and no intelligence assessment suggests such a thing.” The German foreign minister at the time, Frank-Walter Steinmeier, also embraced realism towards Russia, saying: “What we shouldn’t do now is inflame the situation further through saber-rattling and warmongering. Whoever believes that a symbolic tank parade on the alliance’s eastern border will bring security is mistaken.”\n\n“..an Associated Press-NORC poll conducted in late January showed that less than half of US adults (48%) still agreed with sending weapons to Kiev. Just 26% said Washington should continue to play a “major role” in the conflict.”\n• Fewer Americans Think That Ukraine Is Winning – Rasmussen (RT)\n\nWhere would we be without John Bolton?\n\n“It has become a feature of Western commentary on China to say that its rise is a concern and a threat.”\n• Anti-China Rhetoric Is Off the Charts in Western Media (Nair)\n\nTypically, the negative stories adhere to three core ideas, which inform the unspoken guidelines within these press rooms when it comes to reporting on China. First is the belief that China is a threat to the world and that this belief must be relentlessly reinforced at every available opportunity. How and why China is a threat is never explored; such is the deep-rooted and almost religious nature of the belief. Sound arguments do not matter. The basic tenets of good journalism are ignored when it comes to a China story. There is no need to explain or give evidence of why China is a global threat. Left ignored is the plentiful evidence that shows China is not a global threat – even if one can point to mistakes and overreach in certain areas. China has not invaded any country in decades, or imposed sanctions that have devasted the lives of millions in poor countries, unlike the West, led by the United States. Second is that China must be linked to every possible global event that affects the West. This provides an opportunity for the West to bash China while simultaneously burnishing its own credentials as the supposed arbiters of what is right and wrong in international relations. From the pandemic to the Russia-Ukraine war to carbon emissions; from rising sea levels to the scramble for rare earths; from the building of infrastructure in Africa to the production of vaccines – there must be an angle to demonize the country and instill fear in Western nations (and beyond). Indeed, media outlets are reverting to the “yellow peril” of the late 1800s. There is no subtle and nuanced approach to instilling fear like this. It is full-on and very often blatantly racist – but it is now acceptable for one to be racist about the Chinese in Western media, despite the fact that Black-White relations are very carefully described. The third part of this phenomenon, which is surprisingly not challenged by liberal readers of mainstream media, is the sentiment that everything must be done – even illegal and unfair methods – to arrest the rise of China. Never mind the rights of hundreds of millions of Chinese to have a better life after a century of poverty and deprivation. Headline after headline that capture this sentiment have normalized the view that there is a need to curb the rise of China, and that this is a legitimate geopolitical objective. There is no explanation about why or if it is even morally acceptable. It has become a feature of Western commentary on China to say that its rise is a concern and a threat. With this assumption unassailably in place, the West has the right to galvanize – and even bully – its allies and ask the absurd question, “what should be done about China’s rise?” – as if China does not have the right to carve its own place in the new world.\n\n“The same way that Fauci was supposed to be protecting us from viruses and then funded gain of function research, Victoria Nuland was supposed to be our chief diplomat with respect to Russia and Eastern Europe and what did she do instead? She ginned up this conflict.”\n\n“In 1714 Tsar Peter I opened a window on Europe. Russia never closed it. But in 2014 the West did.”\n• For the First Anniversary: 24 February 2023 (Batiushka)\n\nFour Christmases ago an ex-British ambassador to a certain European country asked me why the excellent relations between the West and Russia of the 1990s (when he was an ‘attache’ in the British Embassy in Moscow) had so regrettably dissolved. I answered him simply: ‘Because the arrogant West spat in Russia’s face’. He had not been expecting that answer and the only reply of the old spy was astounded silence. I maintain its truth. In 1714 Tsar Peter I opened a window on Europe. Russia never closed it. But in 2014 the West did. The bad news was that Russia was sick for 300 years with an obsession with the setting sun of the Western world, the Abendland, the Evening land, as the Germans rightly have it. The good news is that Russia is recovering from this obsession, because in 2014 it turned eastwards with its other head, to the rising sun. In 2014 Russia turned eastwards because the arrogant West had spat in its face. And, unsurprisingly, it found daybreak in the east much more pleasant than nightfall. Russia very quickly made friends with China, India, Brazil, South Africa and Iran – to name but a few. In fact, Russia very quickly made friends with seven-eighths of the world, where its real friends had been all along. As President Putin said in his speech of 21 February, Russia is ‘an ancient, independent and quite distinct Civilisation’. Therefore, just because arrogant Europe spat in its face, Russia does not now have to face an identity crisis. It has refound its identity in being what it is, Northern Eurasia. It no longer has to pretend to be only the Western half of itself, it has reclaimed the double-headed eagle which faces both East and West. But this does mean that the rest of Europe has to face an identity crisis. And this is serious. For it. Because, having renounced its Civilisation, it has lost its identity. And because without Russia, Europe cannot survive. Why else did the US try to destroy and substitute for Ukrainian Civilisation? It was in order to cut little Kiev off from its Russian child, who had become much greater than Kiev, just as it tried to cut off little Europe from Russia, that had become much greater than it. Why else did the US blow up Nordstream? It was to cut off the small north-western peninsula of Eurasia from the other half of Europe and so from all Eurasia, so as to make it a fully dependent invalid of the US. As we have said a multitude of times, Russia only ever had three aims in this conflict: the Demilitarisation and Denazification of the territory at present known as the Ukraine and the Liberation of the territory at present known as the Donbass. Demilitarisation. Denazification. Liberation. Three words. It is not the tens of thousands of words of the EU directive on the regulatory height of forklift truck seats. (I used to know the author). What has happened after a year is that through Western foolishness the territory to be demilitarised and denazified, the Ukraine, has had to be expanded, and the territory to be liberated, the Donbass, has had to be expanded. As a result of ever-escalating Western aggression and its supply of ‘long-range weapons’, Russia has now had to go further ‘to repel the menace from our borders’. (I quote from President Putin’s same speech). In other words, the Demilitarisation and Denazification of the Ukraine has become the Demilitarisation and Denazification of all Europe, for Europe has been Ukrainianised. It was its own choice. And the Liberation of the Donbass has become the Liberation of all the Ukraine, for the Ukraine has been Donbassised. It was its own choice.\n\n“..the so-called ‘Western world’ is just a small part of the international community, about 15% of the planet’s population. A rich, over-satiated but still a minority..”\n• Russia Confronted With Whole Empire Of Diverse Enemies – Medvedev (TASS)\n• Biden Team Has ‘Deeply Rooted Hatred For Russia’ – US Congressman (RT)\n\n“..giving rise to the theory that the purpose of the Defense Department is to spend a lot of money, and not necessarily to win wars.”\n• What the America got Wrong (Observer R)\n\nGoing forward it seems past time to consider some significant deficiencies that have become evident in the American quest to remain a great or the greatest military power. Many of these elements have been brought forward recently in pubic discussions and are important considerations in terms of weapons and military force. The US has continued to procure weapons that many critics perceive as not suited for the modern age, or that are simply obsolete. These weapons are generally very expensive and prevent funds from being shifted to better uses. The usual examples are aircraft carriers, stealth fighter planes, littoral combat ships, and so forth. Instead, the US should have switched funding and effort into hypersonic missiles, electronic warfare, air defense systems, and perhaps more advanced submarines. Thus, the US really does have a “missile gap” to contend with. The bad name that air defense got with the “Star Wars” episode under President Reagan delayed work in that area for many years. Now it appears that at least one foreign country, Russia, is considerably ahead of the US in air defense equipment. In addition, long ago the US set up approximately 800 military bases around the world. These bases were useful in the days of gunboat diplomacy and when US hegemony required extensive preparation for military action anywhere around the globe. Then and now these bases require a lot of manpower and funding to operate, but it is not clear that they serve an essential purpose in this age. Other countries have taken up the chore of fighting pirates and bombing terrorist dens. The US effort could be greatly scaled back. The US system for developing new weapons and producing weapons has suffered from not “getting the biggest bang for the buck.” It is often pointed out that the US spends on weapons many times what other countries do, but does not seem to get any more or better weapons as a result. Probably the entire system needs to be rethought. One option would be to go back to having the military run some of its own factories, as in the days of armories. Perhaps a bit of government ownership would provide some competition which is sorely lacking now. The politicians even require the military buy weapons it does not want—essentially giving rise to the theory that the purpose of the Defense Department is to spend a lot of money, and not necessarily to win wars.\n\n“Hallstein had accompanied Hitler in his state visit to Mussolini in Italy and had established the framework of the notorious ‘axe’ Hitler-Mussolini. Later he set up the legal framework for the ‘new European order’, now renamed ‘European Union’..”\n\n‘Collaboration’ is a word of easy etymological determination. It derives from Latin, meaning ‘to work together’. Historically, ‘collaboration’ referred to the medieval meaning of “shared possessions acquired through work by a married couple.” However, in France, during the German occupation in WW2, it assumed the significance of ‘cooperating with the enemy’. And as if to ensure that the new WW2 meaning could not be confused with the original, the term ‘collaborator’ was shrunk into the shorter and disparaging-sounding word ‘collabo’. The lexical metamorphosis began on October 24, 1940 when, in the little town of Montoire-sur-le-Loire, a meeting was held at the railway station between Adolf Hitler and Marshall Petain, president of France. A historical photo shows Petain shaking Hitler’s hand. A transcription of the actual conversation is not available, but six days later, Petain, in a radio speech delivered while sitting by his fireplace, gave the French a status report on the situation. It is during this broadcast that he used the term ‘collaboration,’ in a significantly historical paragraph: “It is a matter of honor, in order to maintain French unity, a unity spanning ten centuries – and in the context of a constructive new European Order – that today I have begun on a path of collaboration” (with Germany). One important consideration. As a matter of principle and action, ‘collaboration’ was an integral foundation of Petain’s philosophy, in relation to the ‘new European order’ spoken-of in his radio address. Meaningfully, Petain’s words ‘new European order’ are omitted from French history texts in schools, referring to that period and event. Why? Because, in the sanctioned interpretation of history, it was/is important to emphasize Petain’s submission (to Germany) rather than collaboration. Which, more objectively, at least in my view, should have been called ‘modus vivendi’ – a sentence whose flavor of neutrality and antiquity, would better represent the condition when people who declared a war on an enemy and lost it, attempt to survive in objectively critical circumstances. Still, given the aftermath of WW2 and the strongly promoted implementation of the European Union, Petain’s ‘new European order’ returned a few years later under a new flag and – we may add – with a vengeance. Ever since, implicitly, explicitly, officially and unofficially the ‘new European order’ has been imposed, not to say forced-upon the seemingly complacent, compliant, beguiled, gullible, undisturbed and unruffled Europeans. Furthermore, given that the tale of history cannot be told without (often) strategic and convenient omissions, a curious reader may be interested in another remarkably curious piece of news, usually (or strategically) omitted. One important protagonist in the establishment of the current European Union was Walter Hallstein, a jurist most close to Hitler during the regime. Hallstein had accompanied Hitler in his state visit to Mussolini in Italy and had established the framework of the notorious ‘axe’ Hitler-Mussolini. Later he set up the legal framework for the ‘new European order’, now renamed ‘European Union’, including the structure of what would become the ‘Treaty of Rome’ of 1957. Equally, Walter Hallstein became the first president of the CEE Commission (Commission Economique pour l’Europe). In other words he was a pedigreed Nazi, though he successfully managed to hide it.\n\n“Do you suppose Mr. Zelensky still has the prosecutor’s files in his possession?”\n• The World Has Enough Trouble (Kunstler)\n\nThe USA is falling apart from a combination of mismanagement, malice, and negligence. Our economy is a tottering scaffold of Ponzi schemes. Our institutions are wrecked. The government lies about everything it does. The news industry ratifies all the lying. Our schoolchildren can’t read or add up a column of numbers. Our food is slow-acting poison. Our medical-pharma matrix has just completed the systematic murder and maiming of millions. Our culture has been reduced to a drag queen twerk-fest. Our once-beautiful New World landscape is a demolition derby. Name something that hasn’t been debauched, perverted, degenerated, or flat-out destroyed. And so, the “Joe Biden” show is busy ginning up nuclear war hysteria because that’s all it has left for manipulating public emotion. The Covid-19 derangement lost its mojo in 2022 and the population has only just begun to grok the all-causes death disaster underway courtesy of Pfizer and Moderna (and the CDC with the FDA). Did you notice, by the way, that the CDC just added those unapproved, still-experimental shots to the childhood vaccine schedule, considered official “guidance” that is followed by virtually every school system in America. Rochelle Walensky did that despite massive evidence that the “vaccines” damage children’s hearts, nervous systems, reproductive systems, and immune systems? Do you know why Ms. Walensky did that? Because adding the mRNA shots to the childhood schedule supposedly confers permanent immunity from legal liability for the drug companies, even after the current emergency use authorization (EUA) runs out. The catch to that cozy arrangement is if there was any fraud committed on the public in the release and administration of those products, the companies lose their immunity and can be sued until there is nothing left of them but the paperclips. Plus, the executives may be liable for criminal prosecution. Hard time. One Brook Jackson, a technician involved in the sketchy Pfizer drug trials, and who directly witnessed the procedural violations as they occurred, is currently suing Pfizer under the False Claims Act (31 U.S. Code § 3729) saying that the company defrauded the government. Pfizer’s lawyers have asked the judge to dismiss the case on the grounds, they said in court, that, “We did not defraud the government. We delivered the fraud that the government ordered.” So now, millions of schoolchildren in this land will be subject to compulsory harmful mRNA shots in order to cover the Pharma companies’ multi-billion-dollar asses. Doesn’t that sum up our national predicament nicely? Way to go, Rochelle. Don’t think nobody noticed. It’s also worth pondering whether we are neck-deep in the Ukraine morass because Volodymyr Zelensky is blackmailing “Joe Biden” over the mysterious Biden Family business operations that took place there directly following the US-orchestrated Maidan revolution that overthrew Ukraine President Viktor Yanukovich in 2014. Remember “The Big Guy’s” earnest efforts to get rid of the Ukrainian state prosecutor who was looking into the affairs of the Burisma gas company that invited Hunter Biden and his associate Devon Archer onto the board of directors. Of all people in Western Civ… these two Americans… with no knowledge of or experience in the natgas industry. Weird, a little bit. Do you suppose Mr. Zelensky still has the prosecutor’s files in his possession?\n\n“Only a year later, Moscow finally realized that this was not a Special Military Operation, but a full-fledged war.”\n\nA year has passed since the start of Russian Special Military Operation in Ukraine. It began precisely as a Special Military Operation, it is clear today that Russia has found itself in a full-fledged and difficult war. The war not so much with Ukraine – as a regime, not with a people (hence the demand for political denazification was put forward initially), but first of all with the “collective West”, that is, in fact, with the NATO bloc (except for the special position of Turkey and Hungary, seeking to remain neutral in the conflict – the remaining NATO countries take part in the war on the side of Ukraine one way or another). This year of war shattered many illusions that all sides of the conflict had. The West, hoping for the effectiveness of an avalanche of sanctions against Russia and its almost complete cut-off from the part of the world economy, politics, and diplomacy controlled by the United States and its allies, did not succeed. The Russian economy has held its own, there have been no internal protests, and Putin’s position has not only not wavered, but has only grown stronger. Russia could not be coerced into stopping military operations, attacking Ukraine’s military-technical infrastructure, or withdrawing decisions to annex new entities. There was no uprising of the oligarchs, whose assets were seized in the West, either. Russia survived, even though the West seriously believed that it would fall. From the very beginning of the conflict, Russia, realizing that relations with the West were crumbling, made a sharp turn toward non-Western countries – especially China, Iran, Islamic countries, but also India, Latin America and Africa – clearly and contrastingly declaring its determination to build a multipolar world. In part, Russia before tried already to strengthen its sovereignty, but with hesitation, not consistently, constantly returning to attempts to integrate itself into the global West. Now this illusion has finally dissipated, and Moscow simply has no way out but to plunge headlong into building a multipolar world order. It has already achieved certain results, but here we are at the very beginning of the way. However, in Russia itself, everything did not go the way it was supposed to. Apparently, the plan was not to wait for Ukraine to attack Donbass and then Crimea, which was being prepared during the Minsk agreements with the active support of the globalist elites of the West – Soros, Nuland, Biden himself and his cabinet – but to strike a swift and deadly preemptive blow against Ukraine, rush to besiege Kiev and force Zelensky’s regime to capitulate. After that, Moscow planned to bring a moderate politician (someone like Medvedchuk) to power, and begin to restore relations with the West (as it happened after the reunification with Crimea). No significant economic, political, or social reforms were planned. Everything was supposed to remain exactly as before. However, it all went very wrong. After the first real successes, huge miscalculations in the strategic planning of the entire operation became apparent. The peaceful mood of the army, the elite, and society, unprepared for a serious confrontation – neither with the Ukrainian regime, nor with the collective West – had its impact on the development of the situation. The offensive stalled, encountering desperate and fierce resistance from an adversary with unprecedented support from the NATO military machine. The Kremlin probably did not take into account either the psychological readiness of the Ukrainian Nazis to fight to the last Ukrainian, or the scale of Western military aid. In addition, we did not take into account the effects of eight years of intensive propaganda, which forcibly inculcated Russophobia and extreme hysterical nationalism in Ukrainian society day in and day out. While in 2014, the overwhelming majority of eastern Ukraine (Novorossiya) and half of Central Ukraine were positively disposed toward Russia, although not as radically as residents of Crimea and Donbass, in 2022 this balance has changed. The level of hatred toward Russians has significantly increased, and pro-Russian sympathies have been violently suppressed, often through direct repression, violence, torture and beatings. In any case, Moscow’s active supporters in Ukraine became passive and intimidated, while those who hesitated before sided finally with Ukrainian neo-Nazism, encouraged in every possible way by the West (I think for purely pragmatic and geopolitical purposes). Only a year later, Moscow finally realized that this was not a Special Military Operation, but a full-fledged war.\n\n“I am planning to meet with Xi Jinping,” Zelensky said without saying when or where. “This will be important for world security.”\n• Ukraine Sees Some Value In Chinese Peace Plan (Le Monde)\n\nUkrainian President Volodymyr Zelensky on Friday, February 24, gave credit to a 12-point peace plan put forward by China as the war between Russia and his country entered a second year, adding Beijing’s interest was “not bad” and might be useful in isolating Moscow. “Our task is to gather everyone to isolate the one,” Zelensky told reporters during a news conference marking the first anniversary of the Russian invasion. “China has shown its thoughts. I believe that the fact that China started talking about Ukraine is not bad. But the question is what follows the words. The question is in the steps and where they will lead to,” Zelensky said, adding he was planning to meet with Chinese President Xi Jinping. “I am planning to meet with Xi Jinping,” Zelensky said without saying when or where. “This will be important for world security.” China called for a cease-fire and peace talks between Ukraine and Russia in a vaguely worded proposal released on Friday that analysts said was unlikely to deliver results. Beijing claims to have a neutral stance in the war that began a year ago but has also said it has a “no limits friendship” with Russia and has refused to criticize Moscow’s invasion of Ukraine or even refer to it as an invasion. It has accused the West of provoking the conflict and “fanning the flames” by providing Ukraine with defensive arms. Zelensky said there were points in the Chinese proposals that he agreed with and “those that we don’t.” He also said he was doing “everything possible” to prevent China from arming Russia. “I really want to believe that China will not supply weapons to the Russian Federation… It is point number one,” Zelensky said. He also said that he wanted to “believe that China will be on the side of the just world, which means, on our side.” Russia’s Foreign Ministry also welcomed China’s peace plan and said it remains open to political and diplomatic efforts. The plan released by China’s Foreign Ministry mainly reiterated long-held positions. It calls for the “sovereignty, independence and territorial integrity of all countries” to be respected but does not say what will happen to the territory Russia has occupied since the invasion. It also calls for an end to “unilateral” sanctions on Russia, indirectly criticizes the expansion of the NATO alliance and condemns threats of nuclear force. Speaking after China issued the paper, but without referring to it, Zhanna Leshchynska with the Ukrainian embassy in Beijing said her country does not want peace at any price. We will not agree to anything that keeps Ukrainian territories occupied and puts our people at the aggressor’s mercy,” Leshchynska told a gathering at the European Union mission to China.\n\n“..recognition of the new territorial realities that have developed as a result of the people’s right to self-determination, the demilitarization and denazification of Ukraine, as well as the elimination of all threats emanating from its territory.”\n\nNo, we are not involved..\n• UK Sets Up Secret Task Force To Purchase Ammunition For Ukraine (RT)\n\n“So if you see spike protein on its own, that means it’s vaccine; if you see spike protein and nucleocapsid protein, that means it’s natural viral infection..”\n• Hard Evidence in New Study: Brain, Heart Damage Caused by mRNA Vaccine\n\n“..many politicians and pundits are using this false constitutional claim to defend potentially unconstitutional actions by the government..”\n\nAuthor Salman Rushdie, still recovering from the latest assassination attempt, once said freedom of speech must include “the freedom to offend” or “it ceases to exist.” Rushdie has risked his very life to support that principle after being put under a death threat by Iran’s then-Supreme Leader Ayatollah Ruhollah Khomeini in 1989 for allegedly insulting Islam. Recently, when Secretary of State Antony Blinken responded to the attack on Rushdie, he notably attacked the role of hate speech as one of “the pernicious forces that seek to undermine these rights.” It was a curious spin. Rushdie has fought limitations on speech and was himself accused of a type of hate speech toward Islam. Due to his alleged blasphemy, his accusers declared not just his right to speech but his right to life as forfeit. The use of Rushdie to further calls to curtail hate speech may be bizarre but it is not surprising. There is a concerted effort by the Biden administration and many Democrats to censor anything deemed hateful on the internet and social media. That was evident at the start of a recent House hearing on the government’s role in censoring citizens on social media. As one of the witnesses, I was taken aback by the opening statement of the committee’s ranking Democrat, Del. Stacey Plaskett (D-V.I.). Besides opposing an investigation into the role of the FBI and other agencies in such censorship, Plaskett declared that “I hope that [all members] recognize that there is speech that is not constitutionally protected,” and then referenced hate speech as an example. Hate speech is indeed a scourge in our nation, but it is also protected under our Constitution. Yet many politicians and pundits are using this false constitutional claim to defend potentially unconstitutional actions by the government. Recently, Sen. Ben Cardin (D-Md.), who is a lawyer, said that “if you espouse hate … you’re not protected under the First Amendment.” Former Democratic presidential candidate Howard Dean declared the identical position: “Hate speech is not protected by the First Amendment.” Even some dictionaries now espouse this false premise, defining “hate speech” as “Speech not protected by the First Amendment, because it is intended to foster hatred against individuals or groups based on race, religion, gender, sexual preference, place of national origin, or other improper classification.” It is not an argument that improves with repetition. Yet, there have been calls to ban hate speech for years. Even former journalist and Obama State Department official Richard Stengel has insisted that while “the First Amendment protects the ‘thought that we hate’ … it should not protect hateful speech that can cause violence by one group against another. In an age when everyone has a megaphone, that seems like a design flaw.” Actually, It is not a design flaw but the very essence of the Framers’ design. The First Amendment does not distinguish between types of speech, clearly stating: “Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.”\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "mRNA Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/mrna/", "site_name": "The Automatic Earth"}, "tags": ["Black Sea", "Transnistria", "myocarditis", "Saudi", "CDC", "EU", "spike protein", "vaccine deaths", "SCO", "SCOTUS", "Hungary", "Civil War", "Canada", "WHO", "Sy Hersh", "Putin", "evil", "Nordstream", "Brazil", "Xi Jinping", "offensive", "coup", "Taibbi", "Wagner", "Zelensky", "Trump", "funeral directors", "Milley", "Valdai", "Luhansk", "FBI", "Hunter Biden", "Lysychansk", "The Coming Storm", "Assange", "endocrine disruptors", "Met Museum", "F-16", "Türkiye", "tanks", "G7", "Bolton", "hybrid war", "Denmark", "climate", "social media history", "mining", "immunization", "Azov", "NATO", "Hillary", "Queen", "adverse events", "Jan 6", "mRNA", "balloon", "Elon Musk", "Medvedev", "Malone", "China", "Bezos", "Twitter", "Biden", "Kharkov", "CIA", "Alfa Bank", "Moldova", "The West", "winning", "Article 51", "sanctions", "cheat sheet", "hate speech", "Nuland", "SMO", "Cassidy", "Baerbock", "coal", "Robby Mook"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The war in Ukraine began a year ago today, on February 24, 2022, when the Russian military rolled across the eastern border of the country. But in many ways, the Russian invasion of Ukraine was the endpoint of a much longer story. <a href=\"https://t.co/BtbJvCgWKl\">pic.twitter.com/BtbJvCgWKl</a></p>\n<p>— Tucker Carlson (@TuckerCarlson) <a href=\"https://twitter.com/TuckerCarlson/status/1629338697161113600?ref_src=twsrc%5Etfw\">February 25, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">How the US media used to report on Ukraine <a href=\"https://twitter.com/hashtag/Donbass?src=hash&amp;ref_src=twsrc%5Etfw\">#Donbass</a> <a href=\"https://t.co/SALrCoaBrI\">pic.twitter.com/SALrCoaBrI</a></p>\n<p>— CraptainFreedom (@CraptnFreedom) <a href=\"https://twitter.com/CraptnFreedom/status/1628853142329896960?ref_src=twsrc%5Etfw\">February 23, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Woody Harrelson hosted Saturday Night Live and used his opening monologue to criticize Big Pharma's response to COVID-19:</p>\n<p>\"The biggest drug cartels in the world get together and buy up all the media and all the politicians and force all the people in the world to stay locked in… <a href=\"https://t.co/3elrFv53GW\">https://t.co/3elrFv53GW</a> <a href=\"https://t.co/i0PfNrlcGd\">pic.twitter.com/i0PfNrlcGd</a></p>\n<p>— kanekoa.substack.com (@KanekoaTheGreat) <a href=\"https://twitter.com/KanekoaTheGreat/status/1629724451234549761?ref_src=twsrc%5Etfw\">February 26, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/4Jhxf8zUI0\">pic.twitter.com/4Jhxf8zUI0</a></p>\n<p>— David Wolfe (@DavidWolfe) <a href=\"https://twitter.com/DavidWolfe/status/1629397609688465408?ref_src=twsrc%5Etfw\">February 25, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I sat across from Dr. James Thorp as he gave this testimony live in D.C. at the expert panel convened by <a href=\"https://twitter.com/SenRonJohnson?ref_src=twsrc%5Etfw\">@SenRonJohnson</a>—yet every time I re-watch it, I still can’t believe this harm is allowed to continue. God help us all. <a href=\"https://twitter.com/jathorpmfm?ref_src=twsrc%5Etfw\">@jathorpmfm</a>  <a href=\"https://t.co/6r5GgAoDUR\">pic.twitter.com/6r5GgAoDUR</a></p>\n<p>— TexasLindsay™ (@TexasLindsay_) <a href=\"https://twitter.com/TexasLindsay_/status/1629602645026414593?ref_src=twsrc%5Etfw\">February 25, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.britishmuseum.org/collection/object/W_EPH-ME-1089", "https://consortiumnews.com/2023/02/25/western-leaders-privately-say-ukraine-cant-win-the-war/", "https://www.azerbaycan24.com/en/fewer-americans-perceive-that-ukraine-is-winning-poll/", "https://www.azerbaycan24.com/en/ukraine-most-threatened-by-china-bolton/", "https://thediplomat.com/2023/02/anti-china-rhetoric-is-off-the-charts-in-western-media/", "https://www.azerbaycan24.com/en/elon-musk-calls-2014-ukraine-regime-change-a-coup/", "https://thesaker.is/for-the-first-anniversary-24-february-2023/", "https://tass.com/politics/1581499", "https://www.azerbaycan24.com/en/biden-team-has-deeply-rooted-hatred-for-russia-us-congressman/", "https://thesaker.is/what-the-america-got-wrong/", "https://thesaker.is/putins-collaborators-and-distant-echoes-of-ww2/", "https://kunstler.com/clusterfuck-nation/the-world-has-enough-trouble/", "https://english.almayadeen.net/articles/analysis/from-special-operation-to-full-scale-war", "https://www.lemonde.fr/en/international/article/2023/02/24/ukraine-sees-some-value-in-chinese-peace-plan_6017181_4.html", "https://www.azerbaycan24.com/en/russia-comments-on-china-s-ukraine-roadmap/", "https://www.azerbaycan24.com/en/media-uk-sets-up-secret-task-force-to-purchase-ammunition-for-ukraine/", "https://www.theepochtimes.com/health/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine_5074383.html", "https://thehill.com/opinion/judiciary/3873943-yes-hate-speech-is-constitutionally-protected/", "https://t.co/BtbJvCgWKl", "https://twitter.com/TuckerCarlson/status/1629338697161113600?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Donbass?src=hash&ref_src=twsrc%5Etfw", "https://t.co/SALrCoaBrI", "https://twitter.com/CraptnFreedom/status/1628853142329896960?ref_src=twsrc%5Etfw", "https://t.co/3elrFv53GW", "https://t.co/i0PfNrlcGd", "https://twitter.com/KanekoaTheGreat/status/1629724451234549761?ref_src=twsrc%5Etfw", "https://consortiumnews.com/2023/02/25/western-leaders-privately-say-ukraine-cant-win-the-war/", "https://consortiumnews.com/2023/02/25/western-leaders-privately-say-ukraine-cant-win-the-war/", "https://www.azerbaycan24.com/en/fewer-americans-perceive-that-ukraine-is-winning-poll/", "https://www.azerbaycan24.com/en/fewer-americans-perceive-that-ukraine-is-winning-poll/", "https://www.azerbaycan24.com/en/ukraine-most-threatened-by-china-bolton/", "https://www.azerbaycan24.com/en/ukraine-most-threatened-by-china-bolton/", "https://thediplomat.com/2023/02/anti-china-rhetoric-is-off-the-charts-in-western-media/", "https://thediplomat.com/2023/02/anti-china-rhetoric-is-off-the-charts-in-western-media/", "https://www.azerbaycan24.com/en/elon-musk-calls-2014-ukraine-regime-change-a-coup/", "https://www.azerbaycan24.com/en/elon-musk-calls-2014-ukraine-regime-change-a-coup/", "https://thesaker.is/for-the-first-anniversary-24-february-2023/", "https://thesaker.is/for-the-first-anniversary-24-february-2023/", "https://tass.com/politics/1581499", "https://tass.com/politics/1581499", "https://www.azerbaycan24.com/en/biden-team-has-deeply-rooted-hatred-for-russia-us-congressman/", "https://www.azerbaycan24.com/en/biden-team-has-deeply-rooted-hatred-for-russia-us-congressman/", "https://thesaker.is/what-the-america-got-wrong/", "https://thesaker.is/what-the-america-got-wrong/", "https://thesaker.is/putins-collaborators-and-distant-echoes-of-ww2/", "https://thesaker.is/putins-collaborators-and-distant-echoes-of-ww2/", "https://kunstler.com/clusterfuck-nation/the-world-has-enough-trouble/", "https://kunstler.com/clusterfuck-nation/the-world-has-enough-trouble/", "https://english.almayadeen.net/articles/analysis/from-special-operation-to-full-scale-war", "https://english.almayadeen.net/articles/analysis/from-special-operation-to-full-scale-war", "https://www.lemonde.fr/en/international/article/2023/02/24/ukraine-sees-some-value-in-chinese-peace-plan_6017181_4.html", "https://www.lemonde.fr/en/international/article/2023/02/24/ukraine-sees-some-value-in-chinese-peace-plan_6017181_4.html", "https://www.azerbaycan24.com/en/russia-comments-on-china-s-ukraine-roadmap/", "https://www.azerbaycan24.com/en/russia-comments-on-china-s-ukraine-roadmap/", "https://www.azerbaycan24.com/en/media-uk-sets-up-secret-task-force-to-purchase-ammunition-for-ukraine/", "https://www.azerbaycan24.com/en/media-uk-sets-up-secret-task-force-to-purchase-ammunition-for-ukraine/", "https://www.theepochtimes.com/health/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine_5074383.html", "https://t.co/4Jhxf8zUI0", "https://twitter.com/DavidWolfe/status/1629397609688465408?ref_src=twsrc%5Etfw", "https://twitter.com/SenRonJohnson?ref_src=twsrc%5Etfw", "https://twitter.com/jathorpmfm?ref_src=twsrc%5Etfw", "https://t.co/6r5GgAoDUR", "https://twitter.com/TexasLindsay_/status/1629602645026414593?ref_src=twsrc%5Etfw", "https://www.theepochtimes.com/health/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine_5074383.html", "https://thehill.com/opinion/judiciary/3873943-yes-hate-speech-is-constitutionally-protected/", "https://thehill.com/opinion/judiciary/3873943-yes-hate-speech-is-constitutionally-protected/", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}