{"result_id": "285043", "URL": "https://www.theautomaticearth.com/2021/11/its-time-to-dump-pfizer/", "timestamp": "2023-04-25 17:16:45 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/11/its-time-to-dump-pfizer/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "It's Time To Dump Pfizer", "cleaned_text": "It’s time for the world to come to its senses. Maybe Omicron is a good guide for doing that. Because it shows how something that is not a threat at all, as far as anyone knows from evidence, can still be blown out of all proportions in order to manipulate behavior. Kind of a mini version of the past 2 years, a play within a play.\n\nFor the past year, we have increasingly given our trust -and money- to Pfizer et al, to save us from the terrible virus. Many millions of people have been injected with their vaccines, and they have failed spectacularly. Of course, since Pfizer, and the governments they signed production and distribution contracts with, have captured the media almost 100%, you won’t read or hear about it, but it’s there for everyone to see in this US graph:\n\nUS COVID Deaths In 2021 Have Surpassed 2020’s Total\n\nIn 2020, no American was vaccinated. In 2021, 60% of them were. If the vaccines had been effective, that should have meant 60% fewer positive tests, hospitalizations, and certainly deaths, or if not 60%, at least a substantial percentage. But the opposite happened: Covid deaths went up, and not a little bit. Between mid August and mid November 2021, they increased some … 60%.\n\nThat is all you need to know. The vaccines do not work. And not just “not as advertized”, they do not work at all. Granted, there appears to be a 2-3 month window in which they suppress something in the virus, but 2-3 months is not nearly enough to be labeled a “vaccine”. And the “something” may well be just an accumulation of binding antibodies that turn against the “patient”‘s immune system, certainly when boosters are applied.\n\nOf course the media, politics and industry claim it’s because “the unvaccinated act as reservoirs of the virus” (someone actually said that), and it’s because of Delta. But no separate vaccine was ever launched for Delta, and the boosters people get now are the same substance that they claim made boosters necessary in the first place. The Science.\n\nForget it all. The vaccines don’t work, and we need to move on. But we can’t. Because our “leaders” signed deals with Pfizer et al that gave the latter complete immunity from any harm caused by their vaccines, and -more importantly- made it illegal to use, promote, research, any other drugs that could have worked against Covid. And those deals still stand now that the vaccines have failed.\n\nRobert Bridge is one of the few people who addressed this issue in The EU Is Not Revealing The Details Of Its Contracts With Vaccine Makers. Why?, which details the fruitless efforts from European parliamentarians (!) to see the contracts signed by Brussels and Pfizer et al. They failed.\n\nStill think the vaccines work? That maybe they don’t prevent transmission or infection, but at least they prevent severe disease and hospitalization? I personally don’t see how that can be enough to threaten forced vaccination, get people boosted, have toddlers injected, but yeah, that’s just me. But prevent severe disease and hospitalization? They don’t even do that. If only.\n\nInstead, the vaccines make people more likely to be infected, and to transmit the disease, to have severe disease, and to die. I know that’s 180º different from what you hear every single grinding day, but hey, you yourself fed your body and your life to the machine, not me.\n\nThe summary of the analysis states: Excess mortality can be found in all 16 states. The number of Covid deaths reported by the RKI in the period under review consistently only represents a relatively small part of the excess mortality and above all cannot explain the critical issue:\n• The higher the vaccination rate, the higher the excess mortality. The most direct explanation is:\n• Complete vaccination increases the likelihood of death. Of course, more indirect explanations are possible:\n• The higher the proportion of old people, the higher the vaccination rate and excess mortality. Therefore, the vaccination rate and excess mortality also correlate. (This explanation is not very plausible, however, as the proportion of old people would have to have changed significantly between 2016-2020 on the one hand and 2021 on the other.)\n• Higher vaccination rates are achieved through increased stress and anxiety in the country concerned, and the latter lead to higher numbers of deaths. [..] The correlation coefficient is +0.31. In the eyes of the two scientists this is “astonishingly high”. Especially since the sign is wrong. Actually, we expect a different relationship: the more vaccinations, the lower the mortality. After all, the intention of the “vaccination” is to protect people. Now the connection is positive: “The excess mortality increases with the increase in the vaccination rate”. This requires urgent clarification, demand the two statisticians.\n\nOfficial UK Data Says COVID Infection Rates Higher in Vaxxed Than Unvaxxed\n\nIn every age group over 30 in the UK, the rates of Covid infection per 100,000 are now higher among the vaxxed than the unvaxxed. Indeed, in the cohorts aged between 40 and 79, infection rates among the vaccinated are more than twice as high as among the unvaccinated. PHE’s fruitlessly rechristened body, the UK Health Security Agency, frantically clarifies that the data ‘should not be used to estimate vaccine effectiveness’, a caveat which I include for the sake of accuracy. But the differences in the infection rates are drastic enough for you to draw your own conclusions.” Shriver then summarizes how that data demolishes the reason for implementing vaccine passport schemes. “Gatekeeping of pleasure palaces promotes the wrong impression — statistically, the lie — that the unvaccinated riff-raff exiled to the pavement pose a far graver threat of communicable disease than the diners in the nearby banquette who, like you, have righteously got the shot. In truth, the double-jabbed airline passenger in 24A can be just as risky a seat-mate as the great unwashed banished from the flight.” Meanwhile, the Times reports the results of another study which “found the double-jabbed are just as likely to pass on Covid-19 as unvaccinated people.” After Public Health England published the data, government bureaucrats begin to panic that people would use it to suggest vaccines were not that effective. Office for Statistics Regulation director Ed Humpherson called an urgent meeting with U.K. Health Security Agency during which he worried about the data having “the potential to mislead.” “We noted that these data have been used to argue that vaccines are ineffective,” Humpherson subsequently wrote.\n\nVaccinated Up To 9x More Likely To Be Hospitalized Than Unvaccinated\n\nA concerned Physician Assistant, Deborah Conrad, convinced her hospital to carefully track the Covid-19 vaccination status of every patient admitted to her hospital. The result is shocking. As Ms. Conrad has detailed, her hospital serves a community in which less than 50% of the individuals were vaccinated for Covid-19 but yet, during the same time period, approximately 90% of the individuals admitted to her hospital were documented to have received this vaccine. These patients were admitted for a variety of reasons, including but not limited to COVID-19 infections. \n\n Even more troubling is that there were many individuals who were young, many who presented with unusual or unexpected health events, and many who were admitted months after vaccination. [..] here’s the part Aaron didn’t point out that needs to be stated very clearly: The only way you can get those numbers is if vaccinated people are 9 times more likely to be hospitalized than unvaccinated; It is mathematically impossible to get to those numbers any other way. Period. Full stop. This is known as an “inconvenient truth.”\n\nNot clear yet? You think these people are all lying, while your politicians, media, Pfizer and Fauci all speak the truth and nothing but the truth?\n\nLet’s try Dr. Geert VanDen Bossche, who’s been warning for over a year about mass vaccination breeding mutations. Hello, Omicron. Geert is more pessimistic than ever. He thinks even people who were not vaccinated, or ever had Covid, are at risk from the mutations caused by the vaccines.\n\nMy Opinion On The New African Variants\n\nThere are three ways in which people can die (and/or get sick) in relation to Covid19.\n\nWe need to say not WITH Covid, but OF Covid. Recent Italian research indicated that only 1% of what is currently labeled a Covid death actually died from it, the rest all have comorbidities (sometimes 5,6) that make that label impossible to assign.\n\n2/ Die of the absence of prophylactics, early treatment\n\nAs I said above, the contracts “we” signed with Pfizer et al make it illegal to use, promote, research, any other drugs that could have worked against Covid. Because if anything would work, that would endanger the Emergency Use Authorization the vaccines operate under. Covid is the only disease where people with symptoms are told to go home and not come back until they need to be put on an intubator.\n\nMeanwhile, just about everybody in the Northern hemisphere has Vitamin D levels that are far too low for their immune systems to work properly where and when needed. There is for instance the German study that suggests Mortality Rate Close to Zero Could Theoretically Be Achieved With [Sufficient Vitamin D]. As I said before, “I think that may be a bit much, I always conservatively said boosting vit. D levels can save the first 50%, zinc (+ quercetin) the next 25%, and then ivermectin can get you close to zero.”\n\nBut zinc and ivermectin, and quercetin, and hydroxychloroquine, and 100 other repurposed drugs, have all been swept under various carpets, and the highly skilled doctors who promote prophylactic, early treatment, or treatment protocols that involve them have been banned, censored, fired, sued, etc.\n\nWhen I see a graph like this one, from WHO EU, proclaiming many lives were saved by the vaccines, I have 2 questions: 1/ What data is this based on?, and 2/ How many lives were lost to the lack of prophylactics and early treatment? Wait, there’s a third question: how many lives will be lost to the vaccines?\n\nThe big unknown. But not entirely. Through adverse reactions registration systems like VAERS in the US, even though they are notorious for catching only between 1% and 10% of events, we know that 100s of thousands of people have died from the vaccines, and millions have had severe adverse effects, often diminishing their lives to a shadow of what they once were. Myocarditis is just one example.\n\nBut it’s what lies ahead that is more worrisome. The spike proteins that all popular vaccines induce in your body, can last inside you for a long time, and bond with your binding antibodies, which is where an auto-immune disease starts. Your immune system may be strong enough to ward of the first 1 or 2 shots, but once you move into the booster phase, the odds turn against you.\n\nIf you get a booster shot after 6 months (or 8, or 4, or 2), your body is prepared for the spike protein attack. Unfortunately, it may well end up helping the attackers, in some form of Antibody Dependent Enhancement (ADE), a form of auto-immune.\n\nWhen you get the next booster, and the next, and be sure you will be told to get it, remember the vaccines only “work” for 2-3 months, the autoimmune risk continues to increase. That is also true if there is ever a Omicron vaccine, or pill, or whatever; it’s still all spike proteins.\n\nDo you understand yet why vaccine mandates make no sense at all, at least not from a health point of view? They only serve the interests of Pfizer, and in their wake, your politicians and media.\n\nWe have one option left only: get rid of Pfizer, the vaccines, the mandates, the entire circus. It has failed spectacularly, and lost us millions of people and productive lives. Time’s up. This is our moment.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "It's Time To Dump Pfizer - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2021/11/its-time-to-dump-pfizer/", "site_name": "The Automatic Earth", "article:published_time": "2021-11-29T18:58:09+00:00", "article:modified_time": "2021-11-29T18:58:15+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2018/11/Christ_in_the_WildernessIvan_Kramskoy1920.jpg"}, "tags": ["prophylactics", "excess mortality", "autoimmune", "vaccines", "Pfizer", "spike protein", "failure", "contracts", "early treatment"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Christ_in_the_Desert", "https://www.zerohedge.com/markets/us-covid-deaths-2021-have-surpassed-2020s-total-despite-vaccines-treatments", "https://www.rt.com/op-ed/539201-eu-vaccines-contracts-secret-mep/", "https://reitschuster.de/post/bundeslaender-mit-hoher-impfquote-haben-hoechste-uebersterblichkeit/", "https://summit.news/2021/11/19/official-public-health-england-data-says-covid-infection-rates-higher-in-vaxxed-then-unvaxxed/", "https://stevekirsch.substack.com/p/everyone-missed-this-one-vaccinated", "https://www.voiceforscienceandsolidarity.org/scientific-blog/my-opinion-on-the-new-african-variants", "https://pubmed.ncbi.nlm.nih.gov/34684596/", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-11-29T18:58:09+00:00"}