{"result_id": "285023", "URL": "https://www.theautomaticearth.com/tag/eua/", "timestamp": "2023-04-25 17:16:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/eua/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "EUA Archives", "cleaned_text": "The autoimmunity issue comes to the foreground.\n\nSucharit Bhakdi, MD and Arne Burkhardt, MD. [..] a written summary of Dr. Bhakdi’s and Dr. Burkhardt’s presentations at the Doctors for COVID Ethics symposium that was live-streamed by UKColumn on December 10th, 2021.\n• Covid Vaccines: Why They Cannot Work, And Their Causative Role In Deaths (D4CE)\n• Calls for New Medical Approaches to Mute Autoimmunity Must Be Addressed (PR)\n\nPathogenic priming, as originally described, is the act of exposing people (or animals) to epitopes that match human proteins, leading to the inducement of autoreactogenic antibodies that attack tissues anywhere in the body. I described pathogenic priming in April, 2020 and predicted that tissues across the body could become afflicted due to exposure to COVID-19 proteins. Evidence is mounting that points to pathogenic priming contributing morbidity and mortality among the vaccinated, including\n• Increased all-cause mortality\n• Histopathological evidence of autoimmunity across various organs. An important message, with data, came to me today on one of my many email threads. I am sharing this on Popular Rationalism with permission Ronald Kostoff, who fowarded the analysis below. [..] Commenting on the above, Ronald wrote: “If the autopsy findings are confirmed by other pathologists with additional samples, and if they are combined with the findings of Dr. Hoffe (>60% inoculant recipients have elevated D-dimer tests and evidence of clotting) and Dr. Cole (increase in cancers after inoculation, including twenty-fold increase in uterine cancer), we are seeing a disaster of unimaginable proportions. The conclusion (if supported by further data) is that essentially EVERY inoculant recipient suffers damage, with more damage after each shot. The damage could be cumulative, and the shots may be synergistic. Given the seriousness of the types of damage (autoimmune diseases, cancer, re-emergent dormant infections, clotting/strokes, cardiac damage, etc.), these effects will translate into lifespan reduction, which should be counted as deaths from the inoculations. So, in the USA, where ~200M people have been fully inoculated, the number of deaths will not be the 10,000 or so reported in VAERS, or 500,000-1,000,000 scaled-up deaths from VAERS, but could be closer to tens of millions (or more) when the inoculation effects play out! What the above three findings (Burkhart, Hoffe, Cole, and I suspect many others who have not yet come forward) show is that the post-inoculation effects are not rare events (as reported by the media-gov’t), but are in actuality frequent events. They may be, in fact, universal, with different degrees of severity and damage for each recipient. The question is whether it is possible to reverse these inoculation-based adverse events. Can the innate immune system be fully restored? Can the microclotting be reversed? Can the autoimmunity be reversed? There is a wide spectrum of opinions on whether this is possible, none of which is overly convincing. Are we headed for the situation where the ~30% unvaxxed will be devoting their lives to operating whatever is left of the economic infrastructure and serving as caretakers for the vaxxed? The above sounds extreme, and maybe when more data are gathered from myriad credible sources the results and conclusions may change, but right now the above data seem to synchronize with the demonstrated underlying mechanisms of damage. Additionally, we seem to be doubling down on inoculations, with fourth booster being proposed for Israel, and UK suggesting quarterly boosters.”\n\n“I have always said that mass vaccination would cause more infectious variants to expand in prevalence and become dominant.”\n• In Reply To The Facebook Factcheck On My Dana Loesch Interview (Vanden Bossche)\n\nFacebook wrote that my predictions of an ever-evolving virus, pressured by an ever-expanding population-level immune pressure caused by mass vaccination are wrong. I have always said that mass vaccination would cause more infectious variants to expand in prevalence and become dominant. Making it impossible for mass vaccination fanatics to ‘stay ahead of the virus’ as they always claim. The consecutive dominance of alpha, beta, gamma, delta and, more recently, the omicron variant is merely proof that my predictions have come true. Even though the highly infectious Omicron does not seem to be highly virulent, there can be no doubt that continued mass vaccination campaigns that will soon use updated boosters against Omicron are at high risk of provoking ADE (antibody-dependent enhancement of disease) and will thereby dramatically enhance the incidence of severe disease in vaccinees. I have explained this in my most recent video message to the WHO, urging them not to allow vaccination against Omicron. (Second call to WHO: Please, don’t vaccinate against Omicron) Damania’s comments on my scientific analysis and predictions have already been proven void. Furthermore, arguments he’s been trying to tease out from experts, like Paul Offit, have been seamlessly refuted in my interview with Del Bigtree (Geert Vanden Bossche Warns of Covid-19 Vaccination Catastrophe). Damania obviously has a big mouth, but has never been responsive to engaging in an open scientific debate, while being heavily paid to spout misinformation and misinterpretations on the evolutionary dynamics of this pandemic. Of which he clearly doesn’t understand due to his limited knowledge of virology, immunology and vaccinology. “Separating the wheat from the chaff” (Some guidance to separating the wheat from the chaff) is, therefore, a ‘must read’ for all those who are trying to find credible information enabling them to make informed decisions about their own health and that of their children. In that regard, cheap and hollow one-liners like those uttered by Damania are clearly not very helpful.\n• Pfizer Antiviral Pill Could Be Risky With Other Widely Used Medications (Hill)\n\nThe Food and Drug Administration (FDA) recently authorized two antiviral pills, one from Pfizer and one from Merck, making them the first at-home treatment for COVID-19 that has been touted as a game changer in the fight against the pandemic. However, experts told NBC News that the pills will require careful monitoring by doctors and pharmacists. While Pfizer’s Paxlovid has been authorized for use in children 12 and over with underlying health conditions including heart disease or diabetes, a component of the antiviral cocktail could have serious and life- threatening interactions with drugs including blood thinners, statins and depressants, NBC reported. “Some of these potential interactions are not trivial, and some pairings have to be avoided altogether,” Peter Anderson, a professor of pharmaceutical sciences at the University of Colorado told NBC News. “Some are probably easily managed. But some we’re going to have to be very careful about,” he added. In a statement to The Hill, a Pfizer spokesperson said, “The potential for drug-drug interactions (DDI) for Paxlovid was examined in a series of in vitro studies, as well as clinical DDI studies.” The spokesperson further elaborated on the antiviral pill and said that Paxlovid is comprised of the active protease inhibitor Nirmatrelvir, as well as a low-dose of 100 mg of Ritonavir. “Its effect on drug metabolism may result in drug interactions, and some drugs may be contra-indicated. However, in light of the fact that Paxlovid has a short duration of treatment of five days, combined with a low dose of Ritonavir of 100 milligrams, we believe that healthcare professionals should find most DDIs to be generally manageable,” the statement reads. “The product’s emergency use authorization fact sheets include information on drug interactions and contraindications. Healthcare providers should consider the potential for drug interactions prior to and during PAXLOVID therapy and review concomitant medications during PAXLOVID therapy,” the spokesperson added.\n\n“We think that the documentation basis is really, really flimsy. We are afraid that we will have to use a remedy that is ineffective at best and, at worst, jeopardises people’s treatment..”\n• Danish Doctors Decry Merck’s COVID Pills, Refuse to Use Them (Sp.)\n\nDenmark has recently become the first EU country to approve a new COVID-19 treatment by the US pharmaceutical company Merck, but the decision has run into difficulties as the country’s general practitioners refuse to prescribe the treatment due to insufficient knowledge of how it works, calling it ineffective and potentially even harmful. The Danish Society for General Practice (DSAM), which is the professional community of general practitioners, has criticised the National Board of Health for its recommendations concerning COVID-19 treatment. Earlier, the Danish Health and Medicines Authority has approved the US drugmaker Merck’s anti-COVID pill molnupiravir, which also goes by the name Lagevrio, to treat at-risk patients with symptoms, making Denmark the first EU country to do so. So far, 50,000 pills have been purchased. Explaining their reluctance to administer it, DSAM’s COVID-19 spokesman Anders Beich cited the drug’s poor documentation. “We think that the documentation basis is really, really flimsy. We are afraid that we will have to use a remedy that is ineffective at best and, at worst, jeopardises people’s treatment,” he told Danish Radio. According to him, patients may receive proper treatment too late. “There is a tendency to believe that once you have received your treatment, you will do well. It may be that both doctor and patient think that now the patient is in treatment. But if the treatment is ineffective, then you will waste time, and there is a risk that the disease will get worse without action being taken,” Beich mused. The same criticism was echoed by Danish Medicines Agency, an independent council that makes recommendations to the regions on the use of various drugs. “We already have treatments that work for the group of patients where the pill is intended for use. Treatments that work much better and are documented much better than this pill,” chairman Steen Werner Hansen said. “So in the worst case, this would prevent some patients from getting a relevant treatment,” he concluded.\n\nI am not a fan of melatonin, but others are.\n\nJustification and Objectives: the serious health, social and economic consequences of COVID-19 have forced an urgent search for preventive methods, such as vaccines, among others, and therapeutic methods that could be alternatives to the drugs currently used. In this sense, it must be accepted that one of the most recommended has been the administration of melatonin. The present study proposes to carry out a systematic review of its possible role in the treatment and/or prevention of COVID-19. Material and methods: a systematic review of the literature related to the prevention of COVID-19 through the administration of melatonin was carried out, following the sequence proposed by the Prisma Declaration regarding the identification and selection of documents, using the specialized health databases Trip Medical Database, Cochrane Library, PubMed, Medline Plus, BVS, Cuiden and generic databases such as Dialnet, Web of Science and Google Scholar for their retrieval. Appropriate inclusion and exclusion criteria are described for the articles assessed. The main limitation of the study has been the scarcity of works and the lack of defining a specific protocol in terms of dosage and administration schedule. Results: once the selection process was completed, and after an in-depth critical analysis, 197 papers were selected, and 40 of them were finally used. The most relevant results were: (1) melatonin prevents SARS-CoV-2 infection, (2) although much remains to be clarified, at high doses, it seems to have a coadjuvant therapeutic effect in the treatment of SARS-CoV-2 infection and (3) melatonin is effective against SARS-CoV-2 infection. Discussion: until group immunization is achieved in the population, it seems clear that we must continue to treat patients with SARS-CoV-2 infection, and, in the absence of a specific and effective antiviral therapy, it is advisable to continue researching and providing drugs that demonstrate validity based on the scientific evidence. In this regard, we believe that the available studies recommend the administration of melatonin for its anti-inflammatory, antioxidant, immunomodulatory, sleep-inducing, CD147, Mpro, p65 and MMP9 protein suppressing, nephrotoxicity-reducing and highly effective and safe effects. Conclusions: (1) melatonin has anti-inflammatory, antioxidant, immunomodulatory, and Mpro and MMP9 protein-inhibitory activity. (2) It has been shown to have a wide margin of safety. (3) The contributions reviewed make it an effective therapeutic alternative in the treatment of SARS-CoV-2 infection. (4) Further clinical trials are recommended to clearly define the administration protocol.\n\n“In some instances, the virus stayed in “regions throughout the brain” for up to 230 days following symptom onset.”\n\n“You could draw blood and actually see the blood clotting very quickly in the tubes..”\n\n“Since those early days, the disease seems to have changed considerably. We don’t see the high rates of blood clotting anymore..”\n\nDr. Pierre Kory is one of the leaders in the movement to provide early treatment for COVID infection. Kory is a critical care physician (ICU specialist), triple board certified in internal medicine, critical care and pulmonary medicine, and is part of the Frontline COVID-19 Critical Care Alliance (FLCCC), which was among the first to publish COVID treatment guidance. Kory spent most of his career at the Beth Israel Medical Center in Manhattan, New York, where he helped run the intensive care unit. He also had a busy outpatient practice. About six years ago, he was recruited to the University of Wisconsin Medical Center in Milwaukee, Wisconsin, where he led the critical care service. “When COVID hit, I was in a leadership position,” he says. “I resigned, because of the way they were handling the pandemic.” University of Wisconsin Medical Center, like most hospitals across the U.S., insisted on providing supportive care only, and Kory refused to remain in a leadership position under those circumstances. Patients were, for the first time in modern medical history, told to just suffer at home until they were near death, then go to the hospital where they were placed on deadly ventilator treatment. “I knew there was a variety of treatments that we could use [yet] we were using nothing,” he says. Doctors were even told to not use anticoagulants, even though blood clotting was “through the roof” in many patients. “You could draw blood and actually see the blood clotting very quickly in the tubes,” he says. Since those early days, the disease seems to have changed considerably. We don’t see the high rates of blood clotting anymore, for example, which is good news. But for some reason, from the very start, “they were literally telling us that we needed randomized controlled trials to do anything,” Kory says, and to this day, health authorities are refusing to acknowledge any treatment protocol outside of the drug remdesivir, and COVID vaccins. “People were dying, [yet] all of my ideas were getting shouted down. My superiors were showing up [to my clinical meetings] and getting me to stand down, because I was entertaining the idea that we should do this, that and the other thing, and they didn’t want anything to be done. And so, I said, ‘I’m done.’ I resigned mid-April 2020. I then went to New York for five weeks and ran my old ICU in New York.” In May 2020, Kory testified before the U.S. Senate, stressing how critical it was to use steroids during the hospital phase of this infection. At that time, he was still employed by the University of Wisconsin. His resignation date had not yet happened, and they “were livid that I was speaking in public, giving my opinion.” This is remarkable, because when you’re an expert in a field, “you’re actually responsible to share your insight and expertise,” Kory says. “Yet they were very unhappy that I was doing that.” Seven weeks later, Kory was vindicated when the British Recovery trial results came out, showing the benefits of corticosteroids. Since then, steroids have become part of standard of care in the hospital phase. Steroids are an effective tool for reducing inflammation in general, but they appear particularly important for advanced COVID infection. I had a close friend who contracted a very serious case of COVID-19 and kept worsening despite taking everything I suggested. He knew Dr. Peter McCullough, so he texted him and was told to add prednisone and aspirin to his current regimen. As soon as he took the prednisone, he started getting better. As explained by Kory, this is a common experience. Importantly, the evidence shows that when used early, during mild infection, corticosteroids do more harm than good. But once you are entering into moderate illness, as soon as you start to see lung dysfunction or the need for oxygen, steroids are critical and are clearly lifesaving.\n\n“And Dr. Fauci is beseeching the twice-vaxxed to go get boostered? Is he determined to wreck absolutely every immune system in the land?”\n\nReality is penetrating the fog and fury of propaganda spewed out over cable-TV news in what may be the last desperate full-out campaign to sell “vaccines” to the credulous. Omicron is a bust, despite the shrieking about overstuffed hospitals (they’re not) in The New York Times. Just as there is a crack-up boom in the final stage of a financial crisis, there is a climactic surge of hysteria in the Covid-19 war against Western Civ. Now, Dr. Anthony Fauci is pushing proof-of-vaxx for US air travel because, “[a] vaccine requirement for a person getting on the plane is just another level of getting people to have a mechanism that would spur them to get vaccinated…” he laid it out on ABC News’s This Week show Sunday with Jonathan Karl. Monday morning on NPR, Dr. Fauci was beating the drum about the unvaxxed being a menace to society as maxi-spreaders of omicron. Is it possible he hasn’t heard that the vaxxed are catching it at a greater rate despite their vaxxes than the unvaxxed? Do you know why? Because their previous vaxxes have de-tuned their immune systems, that’s why. By the way, so far, one death has been attributed to omicron in the US — and even that case is a muddle. And Dr. Fauci is beseeching the twice-vaxxed to go get boostered? Is he determined to wreck absolutely every immune system in the land? Kind of looks that way, a little bit. I confess I am torn between two views of this fiasco. The first is that the notoriously incompetent Dr. Fauci and his colleagues (read RFK, Jr.s book) simply blundered through the Covid-19 disaster making a series of reckless choices, and about halfway through the crisis made the dastardly decision to cover-up their errors by doubling and tripling down on these mistakes. For instance, the policy to suppress and ban cheap and effective treatments that would have un-horsed their stupendously profitable “vaccines” from the emergency use authorization that got the mRNA cocktails into the public’s arms without proper testing. Some months down the road we will learn that this Fauci combine caused millions of people to die unnecessarily both from treatments withheld and from the adverse effects of vaxxes themselves. The other view — that is becoming ever-harder to disregard — is that the Covid-19 pandemic was a deliberate program by a gang of powerful international adventurers to install a regime of surveillance and extreme control over formerly free citizens — all in the service of “re-setting” the ailing global financial system, reducing the population of elder pensioners to relieve the West’s payment obligations, and stifling industrial economies as a cure for climate change. It has sounded a little preposterous to me that such manifest evil, as otherwise seen only in James Bond movies and newsreels of the Nazis, could actually be true.\n• Pfizer Still Distributes Covid Vaccine Version Not Fully Approved By FDA (JTN)\n\nDespite there being no chemical or ethical differences between Comirnaty and Pfizer-BioNTech, however, the FDA acknowledges the two “are legally distinct.” The agency explained in a statement to the Ohio Star that statutory authorities governing EUAs and biologics license applications, which are necessary for official FDA approval, “provide different legal requirements.” Those requirements, such as more paperwork for a full approval, mean the two products are labeled differently. Labeling differences, while important for the company, mean little in practice for those receiving the vaccine, explained Riley. But legal differences between the EUA-sanctioned and FDA-approved vaccines have potentially significant implications for vaccine mandates. The Department of Defense, for example, mandates that service members become fully vaccinated against COVID-19 but directs that only FDA-approved vaccines be used for mandatory vaccination. (Service members may also volunteer to receive a EUA vaccination to meet the requirement.) And in Ohio, a recently signed law states that “a public school or state institution of higher education shall not … require an individual to receive a vaccine for which the [FDA] has not granted full approval.” Such measures have led to debates over the precise nature of the legal differences between the two types of vaccines — and whether FDA approval should legally be a limitation for vaccine mandates. R. Davis Younts, an attorney based in Lemoyne, Penn., who represents dozens of clients resisting vaccine mandates, said the government can’t compel people to take vaccines that have only been authorized under EUA. “Government agencies do not have the legal authority to mandate any of the EUA vaccines,” Younts told Just the News. He explained how Section 564 of the Federal Food, Drug, and Cosmetic Act requires that vaccine recipients must be informed of “the option to accept or refuse” the product. Younts, focusing on military personnel, added that, in order to make an EUA drug mandatory, the president must issue a waiver under a certain federal statute. That statute states, “Administration of a product authorized for emergency use under section 564 … to members of the armed forces” requires informed consent absent a determination by the president that “complying with such requirement is not in the interests of national security.”\n\nThe guidance just changes every day, on the fly.\n\nU.S. health officials on Monday cut isolation restrictions for asymptomatic Americans who catch the coronavirus from 10 to five days, and similarly shortened the time that close contacts need to quarantine. Centers for Disease Control and Prevention officials said the guidance is in keeping with growing evidence that people with the coronavirus are most infectious in the two days before and three days after symptoms develop. The decision also was driven by a recent surge in COVID-19 cases, propelled by the omicron variant. Early research suggests omicron may cause milder illnesses than earlier versions of the coronavirus. But the sheer number of people becoming infected — and therefore having to isolate or quarantine — threatens to crush the ability of hospitals, airlines and other businesses to stay open, experts say. CDC Director Rochelle Walensky said the country is about to see a lot of omicron cases. “Not all of those cases are going to be severe. In fact many are going to be asymptomatic,” she told The Associated Press on Monday. “We want to make sure there is a mechanism by which we can safely continue to keep society functioning while following the science.” Last week, the agency loosened rules that previously called on health care workers to stay out of work for 10 days if they test positive. The new recommendations said workers could go back to work after seven days if they test negative and don’t have symptoms. And the agency said isolation time could be cut to five days, or even fewer, if there are severe staffing shortages. Now, the CDC is changing the isolation and quarantine guidance for the general public to be even less stringent. The change is aimed at people who are not experiencing symptoms. People with symptoms during isolation, or who develop symptoms during quarantine, are encouraged to stay home. The CDC’s isolation and quarantine guidance has confused the public, and the new recommendations are “happening at a time when more people are testing positive for the first time and looking for guidance,” said Lindsay Wiley, an American University public health law expert. Nevertheless, the guidance continues to be complex.\n\nBetween heaven and Earth, where do aliens fit in? That’s the question that NASA hopes theologians at the Center for Theological Inquiry (CTI) in Princeton, New Jersey, can answer, in a recent effort to understand how humans will react to news that intelligent life exists on other planets. University of Cambridge religious scholar Rev. Dr. Andrew Davison, who also holds a doctorate in biochemistry from Oxford, is one of the 24 theologians enlisted to help with the project, the Times UK reported last week. In a recent statement on the University of Cambridge’s Faculty of Divinity blog, Davison says his research so far has already seen “just how frequently theology-and-astrobiology has been topic in popular writing” during the previous 150 years. Davison’s upcoming book, “Astrobiology and Christian Doctrine,” due out in 2022, according to the Times, will cover part of CTI and NASA’s joint spiritual exploration, in which his “most significant question” is how theologians would respond to the notion “of there having been many incarnations [of Christ]” in the universe, he added in the blog post. This is the latest dispatch to come in a partnership between the US space agency and the religious institute. In 2014, NASA awarded CTI a $1.1 million grant to study worshippers’ interest in and openness to scientific inquiry called the Societal Implications of Astrobiology study. Studies have shown links between religiosity and belief in extraterrestrial intelligence. Research published in 2017 found that people with a strong desire to find meaning, but a low adherence to a particular religion, are more likely to believe aliens exist — indicating that faith in either theory may come from the same human impulse. With NASA’s support, CTI’s director Will Storrar said they’d hoped to see “serious scholarship being published in books and journals” to come out on the subject, answering to the “profound wonder and mystery and implication of finding microbial life on another planet.” According to the Times, Davison’s book notes that a “large number of people would turn to their religions traditions for guidance” if extraterrestrials were found, and what that means “for the standing and dignity of human life.”\n\nA virus so strong that it can get past 3 vaccines but can’t get past your paw patrol mask.\n\nBeing in a minority, even in a minority of one, did not make you mad. There was truth and there was untruth, and if you clung to the truth even against the whole world, you were not mad.\n\n – George Orwell, 1984\n\nBilly Connolly – Politically correct – Was it something I said?\n\n\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "EUA Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/eua/", "site_name": "The Automatic Earth"}, "tags": ["Morales", "Big Pharma", "taxes", "FDA", "COVID", "myocarditis", "Einstein", "Wall Street", "pericarditis", "Pfizer", "technology", "Merck", "aliens", "unvaccinated", "secrecy", "vaccinated", "thrombosis", "Nuremberg Code", "mutation", "Biden", "smart money", "politicians", "spike proteins", "Flatland", "bodies", "experiment", "Delta", "EUA", "spike protein", "dimensions", "immune system", "virus", "melatonin", "testing", "fluvoxamine", "Molnupiravir", "Omicron", "Big Tech", "antiviral pills", "brain", "immune escape", "science", "triple mutant", "Vietnam", "politics", "ivermectin", "doctors", "censorship", "experts", "social media", "Facebook", "media", "India", "Fraud", "Abbott", "abortions", "insurance", "HCQ", "children", "transmission", "Moderna", "Edward Dowd", "Russiagate", "vaccines", "Wuhan", "autoimmunity", "lockdowns", "mRNA", "booster"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">They lied. <a href=\"https://t.co/ohuuwg13VX\">https://t.co/ohuuwg13VX</a></p>\n<p>— Jordan Schachtel @ dossier.substack.com (@JordanSchachtel) <a href=\"https://twitter.com/JordanSchachtel/status/1472773369921744899?ref_src=twsrc%5Etfw\">December 20, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"There is no vaccine that you put into your muscle that can ever protect you against an infection of the respiratory tract… anyone who says otherwise is either ignorant or he's lying.\"</p>\n<p>Full video: <a href=\"https://t.co/ebMjzAk2Aq\">https://t.co/ebMjzAk2Aq</a>… <br/> <a href=\"https://t.co/PeOiEnf93X\">pic.twitter.com/PeOiEnf93X</a></p>\n<p>— Taylor Hudak (@_taylorhudak) <a href=\"https://twitter.com/_taylorhudak/status/1475460061988278290?ref_src=twsrc%5Etfw\">December 27, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The booster shot was never about reducing symptoms.</p>\n<p>The booster shot was about trying to maintain the lie that the vaccine could prevent people from contracting and spreading COVID.</p>\n<p>That lie was the basis for all vaccine mandates, and it completely disintegrated this month.</p>\n<p>— Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1475442806021840899?ref_src=twsrc%5Etfw\">December 27, 2021</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gc0fkYQVZtI\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/gc0fkYQVZtI"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JGxzbUX-q4U\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/JGxzbUX-q4U"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OfkpK4yExHY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/OfkpK4yExHY"}], "links": ["https://artschaft.wordpress.com/2018/08/22/diego-velazquez-the-spinners-1655-1660/", "https://doctors4covidethics.org/on-covid-vaccines-why-they-cannot-work-and-irrefutable-evidence-of-their-causative-role-in-deaths-after-vaccination/", "https://popularrationalism.substack.com/p/as-evidence-of-pathogenic-priming", "https://www.voiceforscienceandsolidarity.org/scientific-blog/in-reply-to-the-facebook-factcheck-on-my-dana-loesch-interview", "https://www.rt.com/news/544528-israel-booster-dose-omicron/", "https://thehill.com/policy/healthcare/public-global-health/587334-pfizer-antiviral-pill-could-be-risky-with-other-widely", "https://sputniknews.com/20211227/danish-doctors-decry-mercks-covid-pills-refuse-to-use-them-1091826558.html", "https://www.mdpi.com/1467-3045/44/1/3", "https://www.rt.com/news/544493-covid-spreads-through-body/", "https://www.theepochtimes.com/outpatient-treatments-for-covid-19-reviewed_4177734.html", "https://kunstler.com/clusterfuck-nation/stop-and-assess-2/", "https://justthenews.com/politics-policy/health/pfizer-continue-distributing-version-covid-19-vaccine-not-fully-approved-fda", "https://apnews.com/article/coronavirus-pandemic-science-business-health-rochelle-walensky-d7d609c9c01e200d250df7ca7282c9d6", "https://nypost.com/2021/12/27/nasa-hired-24-theologians-to-study-reaction-to-aliens-book/", "https://t.co/ohuuwg13VX", "https://twitter.com/JordanSchachtel/status/1472773369921744899?ref_src=twsrc%5Etfw", "https://doctors4covidethics.org/on-covid-vaccines-why-they-cannot-work-and-irrefutable-evidence-of-their-causative-role-in-deaths-after-vaccination/", "https://t.co/ebMjzAk2Aq", "https://t.co/PeOiEnf93X", "https://twitter.com/_taylorhudak/status/1475460061988278290?ref_src=twsrc%5Etfw", "https://doctors4covidethics.org/on-covid-vaccines-why-they-cannot-work-and-irrefutable-evidence-of-their-causative-role-in-deaths-after-vaccination/", "https://popularrationalism.substack.com/p/as-evidence-of-pathogenic-priming", "https://popularrationalism.substack.com/p/as-evidence-of-pathogenic-priming", "https://www.voiceforscienceandsolidarity.org/scientific-blog/in-reply-to-the-facebook-factcheck-on-my-dana-loesch-interview", "https://www.voiceforscienceandsolidarity.org/scientific-blog/in-reply-to-the-facebook-factcheck-on-my-dana-loesch-interview", "https://www.rt.com/news/544528-israel-booster-dose-omicron/", "https://twitter.com/RepThomasMassie/status/1475442806021840899?ref_src=twsrc%5Etfw", "https://www.rt.com/news/544528-israel-booster-dose-omicron/", "https://thehill.com/policy/healthcare/public-global-health/587334-pfizer-antiviral-pill-could-be-risky-with-other-widely", "https://thehill.com/policy/healthcare/public-global-health/587334-pfizer-antiviral-pill-could-be-risky-with-other-widely", "https://sputniknews.com/20211227/danish-doctors-decry-mercks-covid-pills-refuse-to-use-them-1091826558.html", "https://sputniknews.com/20211227/danish-doctors-decry-mercks-covid-pills-refuse-to-use-them-1091826558.html", "https://www.mdpi.com/1467-3045/44/1/3", "https://www.mdpi.com/1467-3045/44/1/3", "https://www.rt.com/news/544493-covid-spreads-through-body/", "https://www.rt.com/news/544493-covid-spreads-through-body/", "https://www.theepochtimes.com/outpatient-treatments-for-covid-19-reviewed_4177734.html", "https://www.theepochtimes.com/outpatient-treatments-for-covid-19-reviewed_4177734.html", "https://kunstler.com/clusterfuck-nation/stop-and-assess-2/", "https://kunstler.com/clusterfuck-nation/stop-and-assess-2/", "https://justthenews.com/politics-policy/health/pfizer-continue-distributing-version-covid-19-vaccine-not-fully-approved-fda", "https://justthenews.com/politics-policy/health/pfizer-continue-distributing-version-covid-19-vaccine-not-fully-approved-fda", "https://apnews.com/article/coronavirus-pandemic-science-business-health-rochelle-walensky-d7d609c9c01e200d250df7ca7282c9d6", "https://apnews.com/article/coronavirus-pandemic-science-business-health-rochelle-walensky-d7d609c9c01e200d250df7ca7282c9d6", "https://nypost.com/2021/12/27/nasa-hired-24-theologians-to-study-reaction-to-aliens-book/", "https://nypost.com/2021/12/27/nasa-hired-24-theologians-to-study-reaction-to-aliens-book/", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}