{"result_id": "285018", "URL": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-30-2023/", "timestamp": "2023-04-25 17:16:19 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-30-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle January 30 2023", "cleaned_text": "Ha ha ha! Boris misses the spotlight, he wants to feel important. It’s a fine line between important and impotent.\n\nVladimir Putin threatened to assassinate Boris Johnson in the run-up to the Ukraine war, it emerged last night. The former prime minister said the Russian leader had bragged it would ‘take only a minute’ to kill him with a missile after he warned him to abandon his plans to attack Ukraine. The astonishing threat was made in February last year after Mr Johnson visited Kyiv to assure Ukraine president Volodymyr Zelensky that Britain would back his country if Russia invaded. Mr Johnson said that on his return, he had ‘a very long, most extraordinary call’ with Putin. At the time, the Russian president was publicly denying that he planned to invade Ukraine, despite massing tens of thousands of troops on its borders. Mr Johnson told him that war would be an ‘utter catastrophe’ and trigger unprecedented Western sanctions. \n\n He played down the prospect of Ukraine joining Nato, given the opposition from members such as France and Germany, but warned that war could galvanise support behind Kyiv and would result in ‘more Nato, not less Nato’ on Russia’s borders. Mr Johnson said: ‘He said, “Boris, you say that Ukraine is not going to join Nato any time soon… what is any time soon?” And I said, “Well, it’s not going to join Nato for the foreseeable future. You know that perfectly well”. ‘He sort of threatened me at one point and said, “Boris, I don’t want to hurt you, but with a missile it would take only a minute”.. ‘I think from the very relaxed tone that he was taking, the sort of air of detachment that he seemed to have, he was just playing along with my attempts to get him to negotiate.’ The revelation comes in a BBC documentary series called Putin v the West, which is due to be broadcast tonight.\n\n“Empires in terminal decline leap from one military fiasco to the next.”\n• Ukraine: The War That Went Wrong (Chris Hedges)\n\nEmpires in terminal decline leap from one military fiasco to the next. The war in Ukraine, another bungled attempt to reassert U.S. global hegemony, fits this pattern. The danger is that the more dire things look, the more the U.S. will escalate the conflict, potentially provoking open confrontation with Russia. [..] NATO military commanders understand that the infusion of these weapons systems into the war will not alter what is, at best, a stalemate, defined largely by artillery duels over hundreds of miles of front lines. The purchase of these weapons systems — one M1 Abrams tank costs $10 million when training and sustainment are included — increases the profits of the arms manufacturers. The use of these weapons in Ukraine allows them to be tested in battlefield conditions, making the war a laboratory for weapons manufacturers such as Lockheed Martin. All this is useful to NATO and to the arms industry. But it is not very useful to Ukraine. The other problem with advanced weapons systems such as the M1 Abrams, which have 1,500-horsepower turbine engines that run on jet fuel, is that they are temperamental and require highly skilled and near constant maintenance. They are not forgiving to those operating them who make mistakes; indeed, mistakes can be lethal. The most optimistic scenario for deploying M1-Abrams tanks in Ukraine is six to eight months, more likely longer. If Russia launches a major offensive in the spring, as expected, the M1 Abrams will not be part of the Ukrainian arsenal. Even when they do arrive, they will not significantly alter the balance of power, especially if the Russians are able to turn the tanks, manned by inexperienced crews, into charred hulks. So why all this infusion of high-tech weaponry? We can sum it up in one word: panic. Having declared a de facto war on Russia and openly calling for the removal of Vladimir Putin, the neoconservative pimps of war watch with dread as Ukraine is being pummeled by a relentless Russian war of attrition. Ukraine has suffered nearly 18,000 civilian casualties (6,919 killed and 11,075 injured). It has also seen around 8 percent of its total housing destroyed or damaged and 50 percent of its energy infrastructure directly impacted with frequent power cuts. Ukraine requires at least $3 billion a month in outside support to keep its economy afloat, the International Monetary Fund’s managing director recently said. Nearly 14 million Ukrainians have been displaced — 8 million in Europe and 6 million internally — and up to 18 million people, or 40 percent of Ukraine’s population, will soon require humanitarian assistance. Ukraine’s economy contracted by 35 percent in 2022, and 60 percent of Ukrainians are now poised to live on less than $5.5 a day, according to World Bank estimates.\n\n“..the extent of NATO allies’ indirect involvement in the war is breathtaking in scope..”\n• Is The Mood Shifting In Washington? (Livshitz)\n\nThe RAND Corporation, a highly influential elite national security think tank funded directly by the Pentagon, has published a landmark report stating that prolonging the proxy war is actively harming the US and its allies and warning Washington that it should avoid “a protracted conflict” in Ukraine. The report has an unequivocal title, “Avoiding a long war: US policy and the trajectory of the Russia-Ukraine conflict,” which provides a strong indication as to its contents. It starts by stating that the fighting represents “the most significant interstate conflict in decades, and its evolution will have major consequences” for Washington, which includes US “interests” being actively harmed. The report makes it very clear that while Ukrainians have been doing the fighting, and their cities have been “flattened” and “economy decimated,” these “interests” are “not synonymous” with Kiev’s. The US ending its financial, humanitarian and particularly military support promptly would cause Ukraine to completely collapse, and RAND cites several reasons why doing so would be sensible, not least because a Ukrainian victory is regarded as both “improbable” and “unlikely,” due to Russian “resolve,” and its military mobilization having “rectified the manpower deficit that enabled Ukraine’s success in the Kharkiv counteroffensive.” From the perspective of US “interests,” RAND warns that while the Kremlin has not threatened to use nuclear weapons, there are “several issues that make Russian use of nuclear weapons both a plausible contingency Washington needs to account for and a hugely important factor in determining the future trajectory of the conflict.” The think tank believes the Biden administration “has ample reason to make the prevention of Russian use of nuclear weapons a paramount priority.” In particular, it should seek to avoid a “direct nuclear exchange” with Moscow, a “direct conflict with Russia”, or wider “NATO-Russia war.” On the latter point, RAND worries that US general Mark Milley’s demand that the conflict stay “inside the geographical boundaries of Ukraine” is on the verge of being disrespected, as “the extent of NATO allies’ indirect involvement in the war is breathtaking in scope,” including “tens of billions of dollars’ worth of weapons and other aid” and “tactical intelligence, surveillance and reconnaissance support,” along with “billions of dollars monthly in direct budgetary support to Kiev.”\n• Scholz Says He Will Continue Telephone Talks With Putin (TASS)\n\n“Sevim Dagdelen has been a member of Germany’s parliament, the Bundestag, since 2005. She is the spokeswoman for the Die Linke (Left Party) parliamentary group on the Bundestag’s Committee on Foreign Affairs, a deputy member of the Defense Committee, and spokeswoman for international policy and disarmament.”\n\nI would like to deal in my talk with the following questions: How can the origins of this war be explained? What are the global effects of the war, particularly on countries of the Global South that are not involved in the war but are severely affected by its consequences? What ways could there be to resolve this conflict, and what prospects could there be for a world order based on peaceful coexistence and fairness?The war in Ukraine has set humanity back several years, if not decades, on this path. Against this backdrop, I would like to deal in my talk with the following questions: How can the origins of this war be explained? What are the global effects of the war, particularly on countries of the Global South that are not involved in the war but are severely affected by its consequences? What ways could there be to resolve this conflict, and what prospects could there be for a world order based on peaceful coexistence and fairness? My initial hypothesis comprises three parts. Firstly, the proxy war in Ukraine is indicative of an attempt by the United States to preserve its absolute global predominance in the twilight of a unipolar age. An elementary part of this strategy has been the US quest since the end of the Cold War to prevent the creation of a common security system in Europe that includes Russia. The resultant war is therefore partly due to the inability of Europe and the EU, because of the political rule of a comprador bourgeoisie, to cast off their dependence on the United States and to pursue a sovereign policy attuned to the interests of their own population, a policy aimed at peace, stability, and prosperity. Secondly, the war against Russia, which is being waged primarily on the economic front, is also an inwardly targeted social assault. In Europe, the senseless economic war is tantamount to economic self-amputation, and is conducive to a shift in the balance of power within the Western alliance in favor of the United States. The unprecedented militarization in the context of the mobilization against Russia is also being accompanied by a massive bottom-up redistribution of wealth within NATO countries. While low-earners despair of meeting the rocketing cost of energy and food because of the economic sanctions, the energy companies are reaping billions in windfall profits. Thirdly, in the hegemonic conflict with Russia, the West is holding the countries of the Global South hostage, and so is increasingly isolating itself.\n\n“How can the world’s largest economic power say that it has no milk for children after President Biden announced $40 billion to buy arms meant for the war in Ukraine?”\n\nAnd still no inquiry?\n\nThe Biden crime family made millions in Ukraine performing nefarious and criminal activities including espionage. TGP reported on Thursday that the Bidens were using classified information to the benefit of the Hunter Biden family business. Miranda Devine provided one email that appeared to include classified material from the US government. TGP determined that this information from the 22-point email came from the US State Department and it was classified. This email included this classified information and Hunter had no security clearance or reason to have this information. This was not the first time Hunter Biden had access to classified information. Today we have another email showing more Biden family crimes. A second email on Hunter’s laptop shows that Hunter Biden had access to classified information and used it to the Biden family’s financial advantage. The Biden’s were asked to obtain visas for Burisma executives to travel to the US in early November of 2015. In a response to the request, Hunter Biden and Devon Archer reached out to a friend with ties to the US Deep State, John Sandweg. John Sandweg worked as the Acting Director of U.S. Immigration and Customs Enforcement from August 2013 to February 2014. Sandweg had a short tenure working in this role for the Obama administration. Sandweg was happy when the Biden gany replaced the Trump administration and expressed his happiness that habitual liar Alejandro Mayorkas was taking over Homeland Security. John Sandweg, a former Homeland Security Department official in the Obama administration, said his former colleagues still in government told him there is a hopeful atmosphere as Trump officials made way for their Biden replacements. “I’ve never seen anything like it,” said Sandweg. “There is a very palpable sense of excitement that [DHS Secretary-designate Alejandro] Mayorkas is coming back. It’s not tied to policy or politics. It’s a management and leadership issue.” In the email string below taken from the Hunter laptop, Sandweg emailed Eric Schwerin at Rosemont Seneca (Hunter Biden’s firm) on November 2, 2015. Sandveg relayed information on one of the individuals from Burisma for whom Hunter was trying to get a visa for was Mr. Zlochevskyi. Sandweg in his email says that he obtained a search:”…from the Department of Homeland Security and Customs databases did not reveal any prohibitions on Mr. Zlochevskyi ability to enter the United States. Unfortunately, after receiving the initial report, I suspected that the individual I asked to run the search only queried DHS/Customs databases and not State Department databases. As such, I asked another individual to query both databases. This search revealed the cancellation of the visa and the legal basis for the cancellation.” Sandweg includes two attachments, one of which is labeled “Zlochevski Visa Denial”. Schwerin shared this information with Burisma, Hunter, and Devon Archer. Here are the problems with what was revealed in this email.\n• Sandweg worked for Homeland Security and Customs last in 2014 and this email was from November 2015.\n• Sandweg obtains information from the Department of Homeland Security and Customs databases which he should not have access to. He may have a security clearance but this would not grant him access to the systems. The information that he obtained on the visa application denial is classified.\n• Sandweg shares the classified visa information with Hunter’s firm which is not a government agency.\n• Hunter’s firm shares the classified information that he never should have had with Burisma, a foreign company – this is espionage.\n\n“We have seen this movie before..”\n\n“..if you can rule from the shadows, you save yourself a lot of hassles and, if things really go bad, you may avoid most of the blame..”\n• How to Create your own Shadow Government (Ugo Bardi)\n\nNot long ago, a friend of mine explained to me that he was completely sure that our elites are not just evil, but they actually practice worship of an evil deity called “Baphomet.” I must admit that I was skeptical, even though he showed me an image found somewhere in the dark web, purportedly showing the hierarchy of the worshiping organization. Yet, after some mulling over, I came to think that there is something in this idea. Much more than it would seem at first sight. Of course, I understand that you are probably already moving your mouse to click away from this page. But, if you don’t succumb to the anti-conspiracy memes implanted in your brain, let me try to explain what I have in mind. I am not saying that Baphomet could exist for real (but, who knows?) but, in our times, when politicians “create their own reality,” astral entities such as Baphomet may have assumed a memetic consistency that makes him (?) a force to be reckoned with. An AI called “Baphomet” could actually be worshiped. Suppose you want to build a shadow government to take control of the state. It is a good idea for several reasons, the main one being that, not having to report to anyone or justify what you are doing, you can do a lot of evil things that normal governments have a harder time doing. Then, if you can rule from the shadows, you save yourself a lot of hassles and, if things really go bad, you may avoid most of the blame. But how to create such a hidden government? There have been historical cases of governments dominated by an “éminence grise,” someone who has a great influence on the leader(s). One is that of the Roman philosopher, Lucius Annaeus Seneca, said to have been the actual ruler of the Roman Empire as long as he could control his pupil, Emperor Nero. Unfortunately for Seneca, Nero eventually decided that he wanted to rule alone and got rid of his old master by ordering him to commit suicide. That’s typical: the shadow leader gets older with time, while the young leader becomes bolder and more experienced. The end of the story is obvious. So, if you want to build a working shadow government you need to do much more than have an old man whispering words of wisdom in the ear of the leader. You need a hidden structure that controls all the layers of the apparent government. It needs to be a true alternate government, even though hidden from sight. But how could such a structure be created? How could it function? What could give it the power to operate? Let’s see if we can learn from one of the first known attempts in this sense: the Knights Templar.\n\n“There are other vaccines that are far more effective. There are countries with lower vaccination rates that bore [the pandemic] just fine,”\n\n – Shapira\n\nProfessor Shmuel Shapira, M.D., MPH, who served as the Director General of the Israel Institute for Biological Research (IIBR) between 2013 and 2021, is one of thousands of renowned scientists who have raised serious concerns with COVID-19 mRNA vaccines. The COVID-19 pandemic marked the first time in history when renowned vaccine experts, developers, scientists and doctors were ridiculed and labelled as “anti-vaxxers” en masse. [..] Shapira is also the former head developer of Israel’s experimental coronavirus vaccine. He played a central role in the original development of Israel’s BriLife COVID-19 vaccine. It was a protein based live virus vaccine, not an mRNA shot. The IIBR was tapped early in the pandemic, in February 2020, to develop a vaccine and seemed to be making significant progress until efforts were slowed and Israel launched its mass vaccination campaign with the Pfizer-BioNTech shot last December. The vaccine was eventually scraped, and ever since he has been quite critical about mRNA based COVID-19 vaccines. Despite having been vaccinated himself, Shapira feels that he and many others were coerced, pressured, and forced to take the jab. Lest we forget, many people lost their ability to work, put food on the table, pay their bills, travel, and more for choosing not to get vaccinated. According to Shapira, the approval and distribution of COVID-19 mRNA vaccines was not done from a place of ‘good’ and with the intention to serve others, but rather to “rake in billions.” He stated that they are “mediocre” vaccines and calling them even moderately effective is “pretty generous.” Last May, Shapira stepped down from the directorship of the Biological Institute in a surprise turn of events that cast doubt on the future of the local inoculation venture. In a new book, he claimed that heavy government interference, unexplained regulatory delays, and some level of “sabotage” were also at play.\n\n“The appearance is of something generally raising the likelihood of death, or equivalently, reducing life expectancy.”\n\nDeaths continue to run at extraordinary levels in England and Wales. In the week ending January 13th 2023 there were 17,381 deaths, which is 2,837 or 19.5% above the five-year average. This is despite the five-year average having risen due to the early 2021 Covid wave. Compared to the pre-pandemic five-year average of 13,822 it is 3,559 or 25.7% above average. There were 922 deaths with Covid registered on the death certificate, of which 654 were registered as due to Covid as underlying cause. This leaves 2,183 excess deaths from a different underlying cause. Since the wave of excess non-Covid deaths began in April the total now stands at 34,691. [..] It’s clear, however, that these correlations with booster rollouts are far from determinative of the overall shape of the curve. In particular, deaths remained high during the summer and have spiked over the winter, despite few boosters being delivered in those periods. The Health Advisory and Recovery Team (HART) has noted this week that high-level mortality data like these do not contain an “obvious smoking gun” pointing to vaccines causing high numbers of deaths specifically during the vaccination campaigns. Rather, the excess deaths are broadly spread throughout the year. The appearance is of something generally raising the likelihood of death, or equivalently, reducing life expectancy. The lack of correlation with vaccination programmes has led some to question the role that vaccines are playing in driving the excess deaths and advance arguments in support of other possible explanations, such as Long Covid, the NHS crisis and the legacy of lockdown including missed treatment. While some of these other contributors may be valid, it would be wrong to rule out a role for the vaccines simply on the basis of a lack of correlation with vaccination campaigns. This is because the mechanisms by which a vaccine may injure a person are not fully understood, and those for which understanding is more developed, such as auto-immune reactions due to the persistence of spike protein in the blood and organs, give plenty of scope for a delayed effect. In particular, we should note that many of the excess deaths are related to the heart and circulatory system, and the vaccines are known to increase the risk of such deaths.\n\nDuring 2022 births per 100,000 women 18-45 yo in Sweden have declined progressively, reaching the lowest levels -12.7% and -11.5% in October and November, respectively. For the year, the average was -8.6% compared to same period in 2020-2021. Swedish birth rates have followed a declining trend over the last century. Exceptional negative or positive changes (plus or minus 6% over the birth rate from the preceding year) have occurred, for example following the significant peak in the 1920s and after baby booms in the 1940s, 1960s and 1990s. Except for 1922, however, there has never been such a sharp decline in birth rate over a single year as occurred in 2022. \n\n In contrast to the alarming trend in the birth rates is Sweden’s excess mortality data that shows overall lack of excess deaths post vax rollout despite very high uptake. However, in my opinion, the graphs in this dataset are a bit bizarre – why are 70-79 and 50-59 age groups exhibiting completely opposite trends (and so are the 80+) from the rest of the population? It should be noted that Sweden is exhibiting same alarming birth rate declines starting 9 months after the rollout of the vaxxes as the rest of Europe and other countries with high uptakes of the miracle juice. Why their mortality data is so different – I have no idea. Speculations include manipulated death statistics (not out of the question) and the possibility of different formulations applied in particular countries.\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle January 30 2023 - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-30-2023/", "site_name": "The Automatic Earth", "article:published_time": "2023-01-30T10:32:46+00:00", "article:modified_time": "2023-01-30T10:33:00+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/04/CharlesCamoinVillageStreetInCollioure1912.jpg"}, "tags": ["excess deaths", "Hunter Biden", "shadow government", "Baerbock", "birth rates", "FDA", "Boris Johnson", "Debt Doom Loop", "proxy war", "male fertility"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Jefferey Jaxen on Rep. Louie Gohmert Filing Bill H.R.9366 to Finally Hold Pharma Accountable </p>\n<p>“[It] amends the Public Health Service Act to hold vaccine manufacturers liable for those injuries caused by the vaccine”<a href=\"https://twitter.com/JeffereyJaxen?ref_src=twsrc%5Etfw\">@JeffereyJaxen</a> <a href=\"https://twitter.com/replouiegohmert?ref_src=twsrc%5Etfw\">@replouiegohmert</a> <a href=\"https://twitter.com/delbigtree?ref_src=twsrc%5Etfw\">@delbigtree</a> <a href=\"https://twitter.com/HighWireTalk?ref_src=twsrc%5Etfw\">@HighWireTalk</a> <a href=\"https://t.co/wirT1icKPt\">pic.twitter.com/wirT1icKPt</a></p>\n<p>— Chief Nerd (@TheChiefNerd) <a href=\"https://twitter.com/TheChiefNerd/status/1619098490084413440?ref_src=twsrc%5Etfw\">January 27, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">ORBAN: We have made it clear that Hungary's security comes first, and therefore Hungary is not at war with anyone. We want a ceasefire and peace talks.<br/> <a href=\"https://t.co/7SGux75XDq\">pic.twitter.com/7SGux75XDq</a></p>\n<p>— The_Real_Fly (@The_Real_Fly) <a href=\"https://twitter.com/The_Real_Fly/status/1619800015106605056?ref_src=twsrc%5Etfw\">January 29, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The US and EU have pressured Latin America to send weapons and military equipment to Ukraine.</p>\n<p>Brazil, Colombia, and Argentina refused, instead calling for peace.</p>\n<p>Many other left-wing governments in the region did the same, staying neutral.</p>\n<p>More here: <a href=\"https://t.co/bnVOY6qqlS\">https://t.co/bnVOY6qqlS</a> <a href=\"https://t.co/quZn1BwMiw\">pic.twitter.com/quZn1BwMiw</a></p>\n<p>— Ben Norton (@BenjaminNorton) <a href=\"https://twitter.com/BenjaminNorton/status/1619820033617838081?ref_src=twsrc%5Etfw\">January 29, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Have you ever seen a jump like this? <a href=\"https://t.co/svXi3poeGe\">pic.twitter.com/svXi3poeGe</a></p>\n<p>— Gabriele Corno (@Gabriele_Corno) <a href=\"https://twitter.com/Gabriele_Corno/status/1619605384121012224?ref_src=twsrc%5Etfw\">January 29, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Crows can problem solve AND get frustrated when the problem solving is too hard</p>\n<p>[source 1: <a href=\"https://t.co/jX05P4E6LS\">https://t.co/jX05P4E6LS</a>] <br/>[source 2: <a href=\"https://t.co/iTM2MQvocg\">https://t.co/iTM2MQvocg</a>]<a href=\"https://t.co/BTs6njmCaG\">pic.twitter.com/BTs6njmCaG</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1619784216862158849?ref_src=twsrc%5Etfw\">January 29, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.flickr.com/photos/32357038@N08/4196631796", "https://www.dailymail.co.uk/news/article-11690521/Vladimir-Putins-threat-kill-Boris-Johnson-run-Ukraine-war.html", "https://chrishedges.substack.com/p/ukraine-the-war-that-went-wrong", "https://www.azerbaycan24.com/en/as-the-pentagon-s-favorite-think-tank-calls-for-a-swift-end-to-the-ukraine-conflcit-is-the-mood-shifting-in-washington/", "https://tass.com/world/1568553", "https://geopoliticaleconomy.com/2023/01/28/german-lawmaker-us-proxy-war-russia-ukraine-eu/", "https://geopoliticaleconomy.com/2023/01/29/latin-america-ukraine-weapons-brazil-colombia-argentina/", "https://www.thegatewaypundit.com/2023/01/exclusive-second-hunter-biden-email-laptop-classified-information-uncovered-coming/", "https://quoththeraven.substack.com/p/a-debt-doom-loop-is-now-fully-engaged", "https://www.senecaeffect.com/2023/01/ho-to-create-your-own-shadow-government.html", "https://www.theepochtimes.com/mkt_app/fda-sued-for-withholding-covid-19-vaccine-safety-analyses_5017378.html", "https://tpulse.substack.com/p/former-head-of-israels-defense-ministrys", "https://dailysceptic.org/2023/01/27/deaths-running-26-above-pre-pandemic-levels-and-the-vaccines-remain-a-leading-suspect/", "https://pure-fertility.com/en/impfnebenwirkung-unfruchtbarkeit-neue-deutsche-studie/", "https://sashalatypova.substack.com/p/the-link-between-the-massive-drop", "https://twitter.com/JeffereyJaxen?ref_src=twsrc%5Etfw", "https://twitter.com/replouiegohmert?ref_src=twsrc%5Etfw", "https://twitter.com/delbigtree?ref_src=twsrc%5Etfw", "https://twitter.com/HighWireTalk?ref_src=twsrc%5Etfw", "https://t.co/wirT1icKPt", "https://twitter.com/TheChiefNerd/status/1619098490084413440?ref_src=twsrc%5Etfw", "https://www.dailymail.co.uk/news/article-11690521/Vladimir-Putins-threat-kill-Boris-Johnson-run-Ukraine-war.html", "https://www.dailymail.co.uk/news/article-11690521/Vladimir-Putins-threat-kill-Boris-Johnson-run-Ukraine-war.html", "https://chrishedges.substack.com/p/ukraine-the-war-that-went-wrong", "https://chrishedges.substack.com/p/ukraine-the-war-that-went-wrong", "https://www.azerbaycan24.com/en/as-the-pentagon-s-favorite-think-tank-calls-for-a-swift-end-to-the-ukraine-conflcit-is-the-mood-shifting-in-washington/", "https://www.azerbaycan24.com/en/as-the-pentagon-s-favorite-think-tank-calls-for-a-swift-end-to-the-ukraine-conflcit-is-the-mood-shifting-in-washington/", "https://tass.com/world/1568553", "https://tass.com/world/1568553", "https://geopoliticaleconomy.com/2023/01/28/german-lawmaker-us-proxy-war-russia-ukraine-eu/", "https://t.co/7SGux75XDq", "https://twitter.com/The_Real_Fly/status/1619800015106605056?ref_src=twsrc%5Etfw", "https://geopoliticaleconomy.com/2023/01/28/german-lawmaker-us-proxy-war-russia-ukraine-eu/", "https://geopoliticaleconomy.com/2023/01/29/latin-america-ukraine-weapons-brazil-colombia-argentina/", "https://t.co/bnVOY6qqlS", "https://t.co/quZn1BwMiw", "https://twitter.com/BenjaminNorton/status/1619820033617838081?ref_src=twsrc%5Etfw", "https://geopoliticaleconomy.com/2023/01/29/latin-america-ukraine-weapons-brazil-colombia-argentina/", "https://www.thegatewaypundit.com/2023/01/exclusive-second-hunter-biden-email-laptop-classified-information-uncovered-coming/", "https://www.thegatewaypundit.com/2023/01/exclusive-second-hunter-biden-email-laptop-classified-information-uncovered-coming/", "https://quoththeraven.substack.com/p/a-debt-doom-loop-is-now-fully-engaged", "https://quoththeraven.substack.com/p/a-debt-doom-loop-is-now-fully-engaged", "https://www.senecaeffect.com/2023/01/ho-to-create-your-own-shadow-government.html", "https://www.senecaeffect.com/2023/01/ho-to-create-your-own-shadow-government.html", "https://www.theepochtimes.com/mkt_app/fda-sued-for-withholding-covid-19-vaccine-safety-analyses_5017378.html", "https://www.theepochtimes.com/mkt_app/fda-sued-for-withholding-covid-19-vaccine-safety-analyses_5017378.html", "https://tpulse.substack.com/p/former-head-of-israels-defense-ministrys", "https://tpulse.substack.com/p/former-head-of-israels-defense-ministrys", "https://dailysceptic.org/2023/01/27/deaths-running-26-above-pre-pandemic-levels-and-the-vaccines-remain-a-leading-suspect/", "https://dailysceptic.org/2023/01/27/deaths-running-26-above-pre-pandemic-levels-and-the-vaccines-remain-a-leading-suspect/", "https://pure-fertility.com/en/impfnebenwirkung-unfruchtbarkeit-neue-deutsche-studie/", "https://pure-fertility.com/en/impfnebenwirkung-unfruchtbarkeit-neue-deutsche-studie/", "https://sashalatypova.substack.com/p/the-link-between-the-massive-drop", "https://sashalatypova.substack.com/p/the-link-between-the-massive-drop", "https://t.co/svXi3poeGe", "https://twitter.com/Gabriele_Corno/status/1619605384121012224?ref_src=twsrc%5Etfw", "https://t.co/jX05P4E6LS", "https://t.co/iTM2MQvocg", "https://t.co/BTs6njmCaG", "https://twitter.com/Rainmaker1973/status/1619784216862158849?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2023-01-30T10:32:46+00:00"}