{"result_id": "285044", "URL": "https://www.theautomaticearth.com/2021/06/the-ethics-of-child-vaccinations/", "timestamp": "2023-04-25 17:16:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/06/the-ethics-of-child-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The Ethics of Child Vaccinations", "cleaned_text": "We’ve been talking a lot lately at the Automatic Earth about programs to vaccinate children. It’s one more thing that people appear to blindly accept as necessary and beneficial to our societies. While the only consideration really should be how beneficial it is to the children themselves. Most people here, at least, seem to agree on that. But that’s just here.\n\nThe US, Germany, Canada, and soon France and Spain all have plans, some already have been rolled out, to carpet bomb the virus by going after their children, and there is no doubt many more countries will follow their example.\n\nSince we know there is no medical reason to do so, we must ask what the ethical and legal aspects tell us. And I can’t find those. How and why can you justify injecting people against something that is no threat to them, with a substance that potentially is a much worse threat?\n\nI dug up a graph again that I posted in April, which spells out the Covid risk for all age groups, including children:\n\nIf your chance of survival is 99.99996%, there is no risk. And you don’t need to be inoculated. That would -at best- be equivalent to keeping your kids home 24/7 because you are afraid of what might happen in traffic, or in social life with other kids, or some bogeyman. The risk is never zero, but close enough that we do not act on it, and call it common sense.\n\nThe arguments that are usually used are that 1) kids must be jabbed to protect others around them, and 2) that the vaccines have been tested and proven safe. Obviously, 1) is very curious, and never been used before, and 2) is simply a lie: vaccines need years of testing for side effects, not months, and certainly not weeks, as is now the case for the effects on children.\n\nThe “testing” is simply that if not too many people drop dead after 5 minutes, well, then it must be safe, as institutions like the European Medicines Agency solemnly declare. Completely ignoring potential long term effects, something that seems essential in mRNA “vaccines” because of their potential effects on fertility etc. We just don’t know, but we should before applying the substances. There’s a reason none of the vaccines have been approved.\n\nAs for that alleged safety, this is from the European version of the American VAERS system:\n\n1,5 million adverse reactions, and those are just the ones that have been reported. Now, I don’t know how many people in Europe have been inoculated, but I bet you this is not a 99.99996% success story. The numbers of deaths are not, either.\n\nSo I was happy to see some actual common sense reported in a Dutch paper today (Google translated), where the Health Council in the Netherlands injects at least some nuance into the debate. For kids with underlying conditions, like severe obesity or lung- and heart problems, some protection might make sense. I still wouldn’t go with mRNA vaccines, I would use ivermectin instead, but I get the reasoning somewhat.\n\nHealth Council: Vaccinate Children From 12 Years Old With Medical Risk Against Corona\n\nThe Health Council advises the cabinet to vaccinate children from the age of 12 with a medical risk against the corona virus. Vaccinating all children in that age group, as is done in Germany, France and the US, for example, is not yet on the agenda. An opinion on this will follow in a few weeks. The current advice concerns children aged 12 to 17 who are annually invited for the flu shot and children with severe obesity. According to the Health Council, vaccination of these children provides significant health benefits, because they run a high risk of a serious course of Covid-19. According to chairman Bart-Jan Kullberg, that risk is twice as high as in healthy children. The corona pandemic also indirectly has a major impact on children at medical risk. To avoid the risk of contamination, for example, they do not go to school or social activities. The Health Council also takes this ‘social-emotional impact’ into account. The council cannot estimate the number of children involved. “It concerns, for example, children with a heart or lung disease. There are also many small groups with a rare condition. General practitioners and paediatricians have a good picture of these groups,” says Kullberg. An advice on vaccinating healthy children will only follow in a few weeks. The vast majority of children do not or hardly get sick after a corona infection. So far, almost 280,000 children in the Netherlands are known to have been infected. Usually they had only mild symptoms, such as a cold and cough. In the age group 0-12 years, 379 children were hospitalized. In the 13-17 age group, there have been 101 since September. A total of three children have died; all three had an underlying condition. Last month, the European Medicines Agency (EMA) gave the green light for the use of the Pfizer vaccine in children from 12 years of age. More and more countries are also vaccinating all healthy children over the age of 12 to slow down the spread of the coronavirus. Vaccinating children from the age of 12 against the coronavirus can make a significant contribution to curbing the pandemic, OMT chairman Jaap van Dissel already suggested last weekend. According to him, it reduces the reproductive value (R) of the virus in winter by as much as this. about 15 percent. “That can be important to keep the spread low during that period as well.” In Germany, for example, teenagers will be vaccinated from next Monday, in France from mid-June and in Spain from mid-August. The US and Canada have been at it for weeks. Vaccinating healthy children, who themselves hardly run the risk of becoming seriously ill after a corona infection, requires a ‘broader medical, epidemiological, ethical and legal consideration’, according to the Health Council. “It also depends on the phase of the pandemic,” Kullberg said. Because the number of infections is currently falling sharply and more than a million adults are now vaccinated every week, there is no reason to make that decision hastily, he says.\n\nNow, mind you, that is the same country that admitted depriving children of their freedom, their development, and normal lives, in order to manipulate their parents. Talk about ethics. As I said a few days ago, “Holland closed schools not to protect children, but to make parents stay home. Think about how crazy that is.”\n\nThe Netherlands Used Children As A Weapon In The Fight Against Corona\n\nDue to the Dutch corona policy to close schools and thus keep parents at home, children have been used as a means to fight the epidemic. Our cabinet receives that hard slap on the fingers today in the annual worldwide children’s rights report, the KidsRights Index. According to the makers, the Netherlands has set a very bad example internationally, by not even trying to keep schools open safely. With all the consequences that entails for the mental health of our youth. The corona guidelines from the UN Committee on the Rights of the Child have also been neglected. Youth has not been given any priority in Dutch policy, it sounds. Statements by corona minister Hugo de Jonge, dated mid-December 2020, are presented as proof. Then De Jonge indeed mentioned on television as the reason why the cabinet decided to close the schools, that parents with children sitting at home will therefore start working from home more quickly. When parents take their children to school, that is another moment of contact, De Jonge explained at the time. “And we also learned from the first wave, when the schools were also closed, that the fact that primary education does not provide physical education also ensures that parents adhere better to another advice, namely: work from home as much as possible. ”, said the minister at the time. “Children’s rights have been put in second place by the cabinet during corona time,” Marc Dullaert, founder of the international children’s rights organization KidsRights, now told this site. “They were the ankle bracelet for parents. These had to be kept at home in order to effectively fight the epidemic. At the expense of their mental health.” In the first phase, when everyone was looking for the right approach, this was understandable according to Dullaert. ,,But De Jonge’s statements came at a time when it was really no longer acceptable, in the second phase. And other countries – such as Belgium and Sweden – have done everything they can to keep the schools open, so there were alternatives on the table.”\n\nStaying on topic, I liked this from the Conservative Woman site in Britain, with perhaps the best argument against child vaccination: “The sooner most of us are exposed to it, ideally in childhood, the sooner it will cease to be a major problem..”\n\nWhy Subject Our Children To The Risk Of Death From Vaccination?\n\nAll non-corrupted scientific commentators have known from the very start that this pandemic only ends one way: SARS-CoV-2 is going to become an endemic virus. It will always be with us. The sooner most of us are exposed to it, ideally in childhood, the sooner it will cease to be a major problem. High-risk individuals can choose to take a vaccine. Ivermectin and vitamin D can be used to prevent infection and treat confirmed cases. As we have seen, the argument that children must take vaccines so that we can achieve herd immunity is utterly false. Only those completely ignorant of virology and immunology would even attempt to make it. That brings us back to the original argument for vaccinating children against Covid: to protect them from the severe disease. If this is the only reason to vaccinate children, there is only one calculation that parents should make: Is the risk from Covid greater than the risk from the vaccine? The present Covid vaccines being administered in the West are based on experimental technologies that are being used under emergency use authorisations (EUAs). Full safety studies will not be completed until 2023. The Covid vaccines were all created in the last year and we have no medium-term or long-term data on them. We don’t know if they will have an effect on children’s reproductive organs and fertility. We don’t know if they will produce auto-immune diseases. And we don’t know if they will lead to ADE (antibody-dependent enhancement) upon re-exposure to the virus (causing more severe illness). We do know that the vaccines produce a range of cardiovascular and neurological events including strokes, myocarditis, pericarditis and paralysis in a significant number of people. In the small US state of Connecticut at least 18 children and young adults have come down with myocarditis, an extremely serious and sometimes fatal condition involving inflammation of the heart muscle (and they’ve only just started vaccinating children there). The Israel Ministry of Health has reported that the incidence of myocarditis for vaccine recipients is between 1 in 3,000 and 1 in 6,000 in young men. In Canada (population 38 million) only 11 children have died from Covid since the start of the pandemic. In the UK (pop 68 million) 32 children have died. It is nearly certain that all of them had one or more severe comorbidities. The fact is, most children brush off Covid without even knowing they’ve had it. For all intents and purposes, Covid poses zero risk to healthy children.\n\nA number of school leaders have swung into action following the approval of the vaccination of children against Covid (a disease which almost all children aren’t at risk from) using the Pfizer vaccine (trials of which only included 1,134 children). It wasn’t very long ago that the establishment line was: if you don’t get a Covid vaccine, you are selfish. Even the Queen (disappointingly) joined in with this line [..]. But now, adult advisers to the Government suggest that children should be vaccinated not to protect children but to protect…themselves. Professor Anthony Harnden, the Deputy Chairman of the Government’s Joint Committee on Vaccination and Immunisation, says: \n\n ‘I think the vast majority of benefit won’t be to children, it will be an indirect benefit to adults in terms of preventing transmission and protecting adults who haven’t been immunised, for whatever reason haven’t responded to the vaccine and therefore that presents quite a lot of ethical dilemmas as to whether you should vaccinate children to protect adults.’ He notes that children themselves are ‘in the main’ not at risk from Covid. Over half of the adult population has been fully vaccinated (with seventy-five per cent having received at least one dose of a vaccine) and Covid deaths, while still exaggerated, have flattened. There is no reason to vaccinate most children and, given the potential side effects, many not to do so. If the Government bottles it on the vaccination of children, it is they who are being selfish.\n\nThe reactions to the virus are many times more dangerous than the virus itself. Because the reactions have been amplified by fear. Time to shake it off. But for that to happen, we need politics and media to change, because they’re doing the amplifying. Problem is, fear sells.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Ethics of Child Vaccinations - The Automatic Earth", "description": "Willem de Kooning Woman 1969     We’ve been talking a lot lately at the Automatic Earth about programs to vaccinate children. It’s one more thing that people appear to blindly accept as necessary and beneficial to our societies. While the only consideration really should be how beneficial it is to the children themselves. Most", "url": "https://www.theautomaticearth.com/2021/06/the-ethics-of-child-vaccinations/", "site_name": "The Automatic Earth", "article:published_time": "2021-06-09T15:02:16+00:00", "article:modified_time": "2021-06-09T15:08:23+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/04/WillemDeKooningWoman1969.jpg"}, "tags": ["survival", "children", "carpet bombing", "risk", "Netherlands", "safe", "vaccines", "corona", "fear", "fertility", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.gwarlingo.com/2012/the-gwarlingo-index/willem-de-kooning-woman-1969/", "https://www.ad.nl/binnenland/gezondheidsraad-vaccineer-kinderen-vanaf-12-jaar-met-medisch-risico-tegen-corona~aa808d93/", "https://www.ad.nl/nieuws/internationaal-rapport-nederland-gebruikte-kinderen-als-middel-in-strijd-tegen-corona~a599eaf9/", "https://www.conservativewoman.co.uk/why-in-gods-name-subject-our-children-to-the-risk-of-death-from-vaccination/", "https://www.bournbrookmag.com/home/whos-selfish-now", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-06-09T15:02:16+00:00"}