{"result_id": "285049", "URL": "https://www.theautomaticearth.com/2021/08/stop-mass-vaccination-now/", "timestamp": "2023-04-25 17:16:51 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/08/stop-mass-vaccination-now/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Stop Mass Vaccination Now!", "cleaned_text": "We’ve been saying this for months now, in many variations, but the mass vaxx programs just continue. And that has to stop. We need to save lives not take them. And yes, the vaxxers have managed to propagandize -almost- everyone into believing the exact opposite of what is happening: you now believe that mRNA substances save lives.\n\nProblem may be that they do, but only for a few weeks or months, and then you need another booster, while in the meantime, your body is filling up with cytotoxic spike proteins. The vaccines don’t kill the virus, they leave it alive while enhancing your body’s protection against it a bit, and for a short time.\n\nWhether that means you should label them “non-sterilizing vaccines” or not vaccines at all is something I get tired of discussing, because that merely distracts from the main issue: these things have not been properly tested while they’re very invasive and long-lasting, and therefore potentially very dangerous.\n\nOne of the biggest dangers is that they trigger the virus into mutating. That’s what “non-sterilizing vaccines” do. Months ago, Geert VandenBossche started warning about this, many other doctors and medical specialists have followed, but they all get banned and deleted and censored. Never state the obvious!\n\nPerhaps the No. 1 peril behind mRNA substances is something many of the same doctors warn about, an emerging auto-immune disease called antibody-dependent enhancement (ADE), which emerged through years of trials of these same substances in labs and animal tests, all of which were conveniently stricken from the propaganda record. But they still exist.\n\nHere’s another graph. I have these graphs and articles every single day here at the Automatic Earth. And I don’t go out looking for them, they come to me. This one shows that Covid variants began after vaccinations started. No surprise here, it’s predictable and was predicted that the virus would react this way. If you don’t kill it, but you do challenge it, it mutates into a form that the vaccine can’t harm.\n\nAnd then you can repeat-jab all you want with boosters that inject another 14,000 trillion cytotoxic (yes that means they kill your cells) spike proteins per jab into a patient victim’s body, but that can only lead to another jab x months down the road, because the virus is not being killed.\n\nIf you have a 5, even a 3-year-old kid, explain this and ask them. They will get it right much more often than all your experts and politicians and pharma salesmen. And it’s getting tiresome having to talk about this all the time, just because those are the people who have a stranglehold on the media and get to define there what “the Science” is. While in reality they’re just killing people. But we can’t say that, can we?\n\nI like this graph from nextstrain.org. They have a grant from the Gates foundation, and I hope for them, after seeing this, that that’s not their main grant. Because this graph exposes everything wrong with the mass vaccination surge. All variants of any consequence have appeared ONLY as a reaction to the vaccines. As we said, and many others with us did, first of all Geert VandenBossche. Here is what inevitably happens, in living color:\n\nAnd there IS a different way, whether they want to hide or ban or delete it or not. Another little graph just from today, like the one above. Again, I get things like this every single day. Read the Automatic Earth daily, and you will find out how and why.\n\nIndia’s most populous state, Uttar Pradesh, with 230 million inhabitants, started distributing ivermectin to all its people on May 14.\n\nHere is what happened. When it did at first we thought it was solely a sign that the Delta variant was especially harmless. We now think perhaps that is not the only reason. The ivermectin program was announced on May 12, when the vaccination rate was 2.8%. That rules out vaccines as a factor, entirely.\n\nEven if those rates have increased a little; they’re still today just 9%. If any part of the US or Europe had that rate, Fauci et al would be screaming blue murder.\n\nBefore they announced the ivermectin plan, Uttar Pradesh was at over 30,000 cases per day:\n\nYesterday, they had 26 (I read 19 in another source, but hey…)\n\nAs for deaths, the numbers are a bit less spectacular, they never got to “great heights”, but they’re clear nonetheless.\n\nAnd yesterday they had 1.\n\nComparison: Uttar Pradesh is 20 times the size of Greece population wise, and 2/3 of the US. Greece yesterday had over 4,200 new cases vs Uttar Pradesh’s 26, and today had 25 new deaths vs Uttar Pradesh’s 1.\n\nThis is the umpteenth time I’ve been saying the same thing, always trying to find new ways and angles to say it. The vaccines are not safe, they are very dangerous both short term and especially long term (ADE). A single mRNA shot triggers your body to produce 14,000 trillion spike proteins, that don’t just disappear, or stay in the injection spot, they move through your body, which also gets triggered to keep producing them.\n\nThen antibody-dependent enhancement (ADE) appears. Antibodies that are supposed to get rid of the spike proteins, instead bind to them and help them invade your cells. Which then either get killed and/or turn into factories to produce more spike proteins. Which have been registered as long as 6 months after injection time. In many of the tests I referred to earlier that involved ADE, all test animals were wiped out.\n\nCount your blessings. All our responses to Covid, lockdowns, masks, you name it, have one thing in common: they are one-dimensional. The mRNA vaccines are not just the cherry on the 1 dimension cake, they are our crowning achievement in utter stupidity. We could be Uttar Pradesh. But we are not, and we have only ourselves to blame for that. Your government? Yeah, idiots. Their experts? Utter fools. But in the end it’s you yourselves. It’s your responsibility to look out for your kids and loved ones, not your government’s.\n\nHere, again, is the article about how Uttar Pradesh turned to ivermectin. Maybe you should too.\n\nIvermectin Tablets To Be Distributed Among Uttarakhand Residents\n\nThe Uttarakhand government will be distributing Ivermectin, an antiparasitic drug, among the residents of the state as a preventive medicine against the spread of COVID-19, a senior official said. The Uttarakhand government’s announcement comes after Goa and Karnataka issued similar directions. The decision was taken on the recommendation of the state-level clinical technical committee, an order issued by Chief Secretary Om Prakash to all district magistrates said. The panel has recommended the Ivermectin tablet as “mass chemoprophylaxis” to effectively control the surge of COVID-19 infection apart from the vaccination drive, the order said. The 12 mg tablets of the drug will be distributed in a kit to all families through the health department and district magistrates, the order said. Usually, Ivermectin tablets have to be taken by adults and those above 15 years twice daily for three days after breakfast and dinner. One person will thus need six tablets and a family of four will need 24 tablets. Hence, each kit will contain two dozen tablets, the order said. Children between 10-15 years will take only one tablet daily whereas those aged between 2 to 10 years can be administered the drug only after doctor’s advice. The tablet cannot be given to children below two years, pregnant women and those suffering from liver diseases, it said. The kit will come with directions on how to consume the medicine and dosage for different age groups. Information related to the daily distribution of the kits should be sent to the state nodal officer, the order said. Goa Health Minister Vishwajit Rane had on Monday said all people above 18 years will be given Ivermectin drug irrespective of their coronavirus status to bring down the number of deaths due to the viral disease. Rane had said that people will be given Ivermectin 12 mg for five days as expert panels from the UK, Italy, Spain and Japan have found a statistically significant reduction in mortality, time to recovery and viral clearance in COVID-19 patients treated with this medicine. On Tuesday, Karnataka Deputy Chief Minister and state’s COVID task force head CN Ashwath Narayan said 10 lakh (1 lakh=100,000) Ivermectin tablets have been procured and their supply will begin on May 14. It has been further decided to procure 25 lakh tablets and make them available in all hospitals across the state, he said. Medical experts, however, have questioned the efficacy of the five-day duration of the drug regimen announced by Goa government saying the treatment should not be given for a short period but ideally be continued till the pandemic is brought under control.\n\nStop mass vaccination NOW. Before millions of people are killed. That is a risk that is much higher than that of more contagious but less severe mutations such as delta. Against which down the line no booster can protect you no matter what. We are not faster than a virus is. We can only hope to be smarter. But 20 months in, we look like utter utter fools.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Stop Mass Vaccination Now! - The Automatic Earth", "description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/08/stop-mass-vaccination-now/", "site_name": "The Automatic Earth", "article:published_time": "2021-08-18T18:35:54+00:00", "article:modified_time": "2021-08-18T18:52:14+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/07/TamayoHowlingDog1960.jpg"}, "tags": ["Uttar Pradesh", "Fauci", "ivermectin", "vaccines", "idiots", "India", "fools"], "tweets": [], "movies": [], "links": ["https://art.famsf.org/rufino-tamayo/perro-aullando-howling-dog-1961683", "https://www.oneindia.com/india/covid-19-ivermectin-tablets-to-be-distributed-among-uttarakhand-residents-3258254.html", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-08-18T18:35:54+00:00"}