{"result_id": "285031", "URL": "https://www.theautomaticearth.com/2022/02/omicron-is-the-best-vaccine/", "timestamp": "2023-04-25 17:16:34 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2022/02/omicron-is-the-best-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Omicron is the Best Vaccine", "cleaned_text": "Omicron is the best vaccine available. You can pick between BA.1 and BA.2. That allows us to do a little overview, also because “new“ findings have come out recently. New only in the sense that the media now report on them for the first time, not because we didn’t already know.\n\nThen again, how would YOU know, if not through Joe Rogan, and his recent guests Dr. Malone and Dr. Mc Cullough, and websites like Peak Prosperity and the Automatic Earth? Media capture has been pretty total for 2 years, because 1/ bad news sells better than good news, and 2/ Big Pharma owns the discussion, through its ownership of media and medical “experts”.\n\nThat’s all about to change. Omicron can -and will- still be sold as a potentially devastating disease, but if the numbers don’t add up, people will stop listening and reading. So the media’s hands will be forced. The treatment of Joe Rogan is only the culmination of that, of so many voices since early 2020, and it’s good it led to him.\n\nBecause Joe doesn’t care, he’s bigger than all of the media assembling against him, and he did nothing but give some people a voice and a space that were being ostracized -and still are, maybe even more-, and Spotify is a Sweden-based company, which not many will be able to touch.\n\nYeah, yeah, Neil Young, Joni, Streisand, they’re all in Biden and Pelosi’s age-range, but do you think many people will care who are not over 70, if and when Omicron keeps on lowering death numbers? Or are they more likely to side with Canadian truckers and their ideas of freedom?\n\nWill Justin send the army to “take care” of the protests? You would almost hope so. I don’t think he’s stupid enough, not even him, but he’s in an ugly spot. All he would have had to do is go talk to them, but then that’s the overriding theme here, isn’t it, to not talk, let alone discuss?\n\nThe idea has been all along to NOT talk to Dr. Malone and Dr. Mc Cullough, or Joe Rogan, or anyone else who doesn’t toe the Pfizer line. And at some point, like when people realize Omicron is the best vaccine available, all that’s left is to enforce mandates with police or armed forces. As I said, you’d almost hope they do it. The “let them eat cake” moment.\n\nI saw this pic yesterday of a headline from German TV channel NTV, which says Pfizer will sue Denmark for loosening its vaccine mandate, because fewer people will get jabbed, and that means less profit. How much of this will we see?\n\nBack to reality: We have found (or rather, seen confirmed) in the last 2 weeks or so that:\n\n1/ Masks don’t work. The CDC admitted that the cloth masks they recommended for 2 years have no effect whatsoever. But along their own lines of “evidence”, neither do surgical masks, which have holes 1000x bigger than a virus particle. N95 masks could work to some extent, but only if they’re fitted perfectly, by a professional, every time they’re worn.\n\nMaybe the fact that the US government, and CDC and FDA, waited 2 years in promoting them tells you the whole story. And yes, P100 masks might work to some extent, but at that point we might as well go for full-blown gas-masks. In short, face masks “for Covid” have been as entirely useless as they have been completely destructive, in the lives of all of us, but in particular our children.\n\nBut the masks still haven’t been as big a disaster as:\n\n2/ Lockdowns don’t work. For 2 years running, all the media and their loyal followers have been citing the CDC, FDA and Johns Hopkins University. But now that Johns Hopkins releases a report that says lockdowns prevented only 0.2% of potential deaths, crickets are a very popular life form all of a sudden. What’s not to love? But yeah, we get it, good news doesn’t sell. In the same vein, an “imminent” Russian invasion of Ukraine, tanks in the streets of Kyiv, gets a lot more clickbait than “nah, all quiet on the eastern front”.\n\nBut the lockdowns haven’t been as big a disaster as (we’re working up to a climax here):\n\n3.1/ The vaccines were never needed.\n\nThe way to create demand for them was to prohibit all other substances that could have saved millions of lives in prophylaxis or early treatment. As I’ve said repeatedly, I think vitamin D could have prevented 50% of all infections and deaths, zinc could have taken care of the next 25%, and for the remaining quarter an entire scala of repurposed drugs, ivermectin, HCQ, fluvoxamine, melatonin, aspirin etc. would have been enough.\n\nYou don’t have to aim for zero. Bring the numbers down by 50-75-90%, and any reason to lock down or wear masks is gone. Pfizer needed to ban all these substances, and ban the possible news coverage of their potential, to get an EUA for its vaccine. And that’s why they were all swept under the carpet. Thing is, there are millions of dead bodies under that carpet, too.\n\nBut not only were they never needed:\n\nTo be honest: what we know in early February 2022 is that yes, they do seem to “work” for a few months, we’re not exactly sure how or how long. That should never be a question about a vaccine, however, and if it is, call it something else. Moreover, as far as they “work”, they do that by -trying to- take over control from your immune system, which you cannot survive without. Your best option today is to have an immune system strong enough to fight off the vaccine, which is as insane as it sounds. A booster 3rd or 4th or 12th shot will work for even less time, and in the meantime you run the risk of spike proteins lingering and gathering in all of your organs, including your heart and brain. For the rest of your life.\n\nThe main issue about mRNA vaccines is not even the scores of vaxxed young athletes dropping dead, or the elevated numbers of 10-15 year olds who have myocarditis, devastating as they are; it’s the long-term consequences, never tested for. I’ve been reading a lot about mRNA and cancer recently. Because I see it pop up all over.\n\nThis will not affect everyone. Some of us have robust immune systems. But those that do not, due to age, obesity, you name it, will see the negative effects of spike proteins and other vaccine “by-products”. Not all in the same way, and not all to the same degree. And not all at the same time either. But you’re still all unleashing (cyto-) toxic elements into your body, your bloodstream, your organs.\n\nYou’re unleashing more of them with each next shot, or booster, into a body whose immune system has ever less defense against the invading toxic elements. Because your immune system may have “learned” to defend itself against these elements, but then the jabs add ever more of them, and the original antigenic sin kicks in for real. Until the immune system is overwhelmed and gives up.\n\nSo why the shots, and the boosters? It doesn’t appear to have much to do with logic. In Britain, Covid is already less threatening than the flu. You may argue that this is due to the vaccines, but how realistic is that given we know their efficacy drops so fast you need a booster every few months?\n\nWhereas, if you catch Omicron, and many “Experts” now state that we will all catch it at some point (or more than once), the amount of toxic elements entering your body is manageable. Sure, you may need to boost your immune system, lose weight, change your diet, but how could that ever be a bad thing?\n\nStill, if you combine vitamin D with zinc and perhaps IVM, your chances look much better than with 3-4-5-6 boosters. But, you know, if that’s what you want, go for it. Ditto for face masks, and lockdowns, etc. But with what we know today, there is no reason why anyone should dictate any of these things to you. You’re not any safer because of them.\n\nThe main difference appears to be that you, the vaxxed/boosted, have a lot more to be wary about for the rest of your life, 30-40-50 years, from “vaccines” that were poorly tested, and not at all tested for that sort of timespan.\n\nOmicron is a one-off that appears to protect you from all -or most- previous and future Covid variants. The vaccines are geared towards one older variant only, which hardly exists anymore. I won’t advice anyone to get Omicron, but if given the choice between Omicron and Comirnaty, is the choice really that clear?\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Omicron is the Best Vaccine - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2022/02/omicron-is-the-best-vaccine/", "site_name": "The Automatic Earth", "article:published_time": "2022-02-05T14:52:07+00:00", "article:modified_time": "2022-02-05T15:00:53+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2022/01/AlmaTademaWomen_of_Amphissa1887.jpg"}, "tags": ["Comirnaty", "zinc", "flu", "Joe Rogan", "vitaminD", "COVID", "media capture", "ivermectin", "facemasks", "Pfizer", "vaccines", "experts", "lockdowns", "Trudeau", "Omicron"], "tweets": [], "movies": [], "links": ["https://commons.wikimedia.org/wiki/File:Women_of_Amphissa.jpg", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2022-02-05T14:52:07+00:00"}