{"result_id": "285017", "URL": "https://www.theautomaticearth.com/2023/02/debt-rattle-february-12-2023/", "timestamp": "2023-04-25 17:16:18 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2023/02/debt-rattle-february-12-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle February 12 2023", "cleaned_text": "Original title: “Serbia may soon be forced to sanction Russia – Vucic”. The smaller countries that have independent ideas, Serbia, Croatia, Austria, Hungary, are vassals to their allies.\n\nVucic’s main message: “The fighting to date will feel like “almost nothing, compared to what’s coming..” And then watch Gonzalo’s tweet. The US has sent Samantha Power to Budapest to trip Orban. A literal power game.\n• Serbian President Sees “Major Escalation” In Ukraine Over Next 6 Months (RT)\n\nThe moment is approaching when Serbia will have no choice but to give in to Western demands to sanction its ally Russia, Serbian President Aleksandar Vucic has said. In an interview with Prva broadcaster on Friday, Vucic said he expects “a major escalation” in the conflict in Ukraine over the next six months. The fighting to date will feel like “almost nothing, compared to what’s coming,” he warned. This situation “will affect our country as the pressure on Belgrade, in terms of its relations with Russia, will become two or three times tougher – despite already being very strong now,” the president said. Sanctioning Moscow over its military operation in Ukraine and recognizing the independence of the breakaway province of Kosovo have been singled out by Brussels as key conditions for Belgrade’s bid to join the EU. Vucic, who has been rejecting both demands for months, now says the moment may eventually come when Belgrade would have to join the EU’s curbs on Moscow. “Let us push like this as long as we can, I will know when the moment is right, and I will not hide anything from people. That moment [when Serbia sanctions Russia] has been approaching for a long time, I am afraid that it’s not even months away,” he said. The Serbian president revealed that he used to believe that the West, which is backing the Kiev government with weapons, funds and intelligence, was getting the upper hand in Ukraine. However, “at this moment, it’s no longer entirely clear who is winning in Ukraine,” he added. Moscow’s chances of succeeding have been boosted by the fact that there is now “unity” among the Russian people regarding the conflict, especially after the announcement by Berlin and some other countries last month that German-made Leopard tanks would be supplied to Kiev, he said. According to Vucic, it’ll be “difficult” for Serbia no matter who prevails in Ukraine. “The West doesn’t want a country allied with Russia in the middle of Europe. On the other hand, Russia doesn’t want to lose everything it has in the Balkans,” he said. That’s why Belgrade remains among the few international players who speak about the need for a diplomatic solution to the crisis, but “no one is allowed to mention peace anymore,” he stated.\n\n“..the notion that Serbia should “break completely with Russia,” and “throw out Dostoyevsky, Tchaikovsky and Tolstoy” is equally absurd. “That can’t be Serbia, we have to take care of the soul of our people..”\n\nSerbia will not jump on the Russia-bashing bandwagon and cancel the country’s culture, President Aleksandar Vucic has told media. He explained that preserving the Russian classics in the public domain is as important as guarding national financial interests. In an interview with Serbia’s Prva news channel broadcast on Friday, Vucic acknowledged that his country largely depends on the West in terms of investment. For this reason, the president noted, those who call on Belgrade to cut these ties “don’t know how the country works.” Vucic went on to argue that the notion that Serbia should “break completely with Russia,” and “throw out [novelist] Dostoyevsky, [composer] Tchaikovsky and [writer] Tolstoy” is equally absurd. “That can’t be Serbia, we have to take care of the soul of our people,” the president clarified. Last month, during a press conference in the Russian embassy in Belgrade, President Vladimir Putin’s special envoy on international cultural cooperation, Mikhail Shvydkoy, announced that Belgrade and Moscow were discussing holding a year of cultural exchange in 2024. Several renowned Russian musicians will visit Serbia already this year. On top of that, a meeting of Russian and Serbian academia is also in the pipeline, Shvydkoy revealed.Following the start of Russia’s military operation against Ukraine in late February 2022, a number of European cultural venues have canceled the staging of artworks which have Russian origins and have also barred some Russian performers who have refused to denounce Moscow’s actions. Certain politicians in the EU have also spoken in favor of such bans. As recently as early January, Lithuanian culture minister Simonas Kairys spoke in favor of a “mental quarantine” on Russian culture, claiming the latter is being used by Moscow as a “weapon.” Earlier, the Cardiff Philharmonic Orchestra in Wales erased music by Russian composer Pyotr Tchaikovsky from a concert program, while Britain’s Royal Opera House called off a tour by the Bolshoi Ballet. Netflix, in turn, put on hold the production of ‘Anna K,’ an adaptation of Leo Tolstoy’s novel ‘Anna Karenina’. Commenting on these tendencies, Russian President Vladimir Putin has drawn parallels between Western efforts to cancel Russian culture to the Nazi practice of book burning.\n\n“..an inconvenient narrative arises, the government and lemmings in the media slander it as false and dangerous, and, months later, the dispute in question turns out to be true..”\n\nWednesday morning, Seymour Hersh published “How America Took Out The Nord Stream Pipeline.” The Nord Stream 1 and 2 Pipelines exploded in September 2022. The Nord Stream 1 has delivered natural gas from Russia to Europe for over a decade, and Russia was developing the Nord Stream 2 at the time. Outlets like The New York Times called the explosions “a mystery.” The sabotage presented a major energy crisis for the United States’ European allies. Europe imports nearly 40% of its gas from Russia, and the Nord Stream 1 was responsible for delivering approximately one third of that supply. Now, Hersh reports that “the United States executed a covert sea operation” with Navy divers to sabotage Russia’s pipelines with explosives. For a less obsequious press corps, this should have been an easy story to crack. In the weeks leading up to Russia’s invasion of Ukraine in 2022, President Biden announced his intention to act against the pipelines in the event of war. “If Russia invades… there will be no longer a Nord Stream 2,” he told reporters. “We will bring an end to it.” “How will you do that exactly?” a reporter asked. “I promise you we will be able to do it,” President Biden said with a slight smile. Under Secretary of State for Political Affairs Victoria Nuland was equally as explicit. “I want to be very clear to you today,” she told reporters in January 2022. “If Russia invades Ukraine, one way or another Nord Stream 2 will not move forward.” In September, Russian President Vladimir Putin blamed “Anglo-Saxons” in the West for “terror attacks” on the pipelines. “Those who profit from it have done it,” Putin told the press. President Biden chastised Putin’s accusation for “pumping out disinformation and lies.” “Just don’t listen to what Putin’s saying,” Biden added. “What he’s saying we know is not true.” White House National Security spokeswoman Adrienne Watson backed up Biden’s claim, referring to Putin’s accusation as “Russia’s disinformation.” Russia’s U.N. ambassador also implied that the United States had been involved in the sabotage. Richard Mills, U.S. deputy ambassador to the U.N., responded by calling the claims “conspiracy theories and disinformation.” Despite the Commander and Chief’s explicit announcement that he would take action against the Nord Stream pipeline, a credulous press corps has dutifully parotted government talking points that accusations of western involvement in the sabotage are “baseless” “misinformation,” “disinformation,” and “conspiracy theories.” This all follows a similar pattern to the informational warfare of the Covid era: an inconvenient narrative arises, the government and lemmings in the media slander it as false and dangerous, and, months later, the dispute in question turns out to be true (or at least highly plausible). Arguments over natural immunity, vaccine efficacy, masks, the lab leak hypothesis, school shutdowns, lockdowns, and the scientific basis of social distancing are just a few examples that followed this cycle of reporting. This was the same pattern as The New York Post’s coverage of the Hunter Biden laptop. Now, at hearings to investigate corruption that implicated Big Tech, intelligence officials, and the federal government, Raskin and his cohorts return to their familiar censorship ploys. For censors, augmentation of power, not truth, remains the chief objective. To achieve this goal, they conflate dissent with domestic terrorism.\n\nNot every point is equally strong.\n• Who Benefitted From This Chaos? (Tucker)\n\nLet’s just go through the list of beneficiaries I first compiled two years ago. 1. The tech companies that became so enraptured with the digital world—and we can include online retailers in this—that they forgot all the people who cannot and do not want to live entirely outside the physical world. To be sure, many of these high flying companies are now coming back to earth thanks to higher interest rates. Even Zoom may be falling on hard times. To which I say: Schadenfreude. 2. The pharmaceutical companies with hundreds of billions of investment in labs and distribution circles that wanted to ply their wares in the midst of emergencies, in addition to the PCR testing industry, not to mention mask and ventilator makers and so many other grifting companies in this space. They not only gain from tremendous subsidies and indemnification from damages; they even got governments to conscript their customer base. 3. Public health intellectuals, who for at least a decade and a half had fallen for the romance of computer modeling, were itching to try out a new method for disease mitigation. They must have gotten quite a kick out of watching the experiment tried out in real time. Speaking of: we haven’t heard from these people in a very long time. They seem conveniently very quiet. Notice how the prophets of doom who were all over the news three years ago, with their magic ability to see the future with precision, have completely vanished? 4. The mega-billionaire Bill Gates found himself vexed by computer viruses that were wrecking his Windows operating system and thereby developed a passion for blocking viruses in general, while failing to understand the difference between biology and computer hardware. He seems to have done very well for himself, not only with his investments but now with his new book telling us how he will single-handedly change the path of the global climate. 5. Government officials certainly had a field day trying out new uses of power. My goodness, they even got their mitts on social media, scripting who gets to speak and who cannot. The national security state hasn’t had this much fun since the Cold War. It was, in short, the most successful ramp up of government power the world over in modern times or maybe ever. Disease panic proved more advantageous to them than ever war and economic depression. 6. Media companies, who live on clicks and know with certainty that public panic is the best way to guarantee consumer attention, did especially well, given that millions were locked at home with nothing else to do. Talk about a captive audience! 7. The Chinese government, which was supremely annoyed at the Trump administration’s trade policies, successfully trolled the West into believing that China nixed the virus through totalitarian controls. It can now brag to have scripted the pandemic response for the whole world, and is now goading the World Health Organization into doing ever more of it. 8. Rabid opponents of the Trump administration, who had failed to wreck it through accusations of Russian collusion and then impeachment over a phone call to Ukraine, finally turned to creating tremendous social, economic, and political chaos by massively overblowing the severity of a widespread viral pathogen, which itself became a metaphor for the political infection they believed afflicted the country. This was the final undoing of the administration, much to the celebration of his political opponents. 9. School teachers’ unions that have been wanting to strike for years in order to extract pay and benefits from the taxpayer, worried that doing so would turn their public against them; for them, lockdowns were the perfect excuse to find another way. They abandoned their jobs and got paid anyway. Then they tried to make the racket last as long as possible. 10. A ruling-class population that has lost touch with people who cannot live on their computers, had become increasingly detached from the flow of life as it exists in the physical world, utterly failed to empathize with the suffering of others under lockdown. But they rather warmed up to the mess they had created because it meant they could make the big bucks while never changing out of their PJs.\n\nWar OF terror vs war ON terror.\n\n“A positive screamer is that Hersh – rather, his key source – had the MI6 completely vanish from the narrative..”\n• The War of Terror of a Rogue Superpower: Cui Bono? (Escobar)\n\nWhen it comes to the Global South, what the Hersh report imprints is Rogue Superpower, in giant blood red letters, as state sponsor of terrorism. Everyone with a brain already knew the Empire did it. Now Seymour Hersh’s bombshell report not only details how Nord Stream 1 and 2 were attacked, but also names names: from the toxic Straussian neoliberal-con trio Sullivan, Blinken and Nuland all the way to the Teleprompter Reader-in-Chief. Arguably the most incandescent nugget in Hersh’s narrative is to point ultimate responsibility directly at the White House. The CIA, for its part, gets away with it. The whole report may be read as the framing of a scapegoat. A very fragile, shoddy scapegoat – what with those classified documents in the garage, the endless stares into the void, the cornucopia of incomprehensible mumbling, and of course the whole, ghastly, years-long family corruption carousel in and around Ukraine, still to be completely unveiled. Hersh’s report happened to pop up immediately after the deadly earthquakes in Turkey/Syria. This is an investigative journalism earthquake in itself, straddling over fault lines and revealing countless open air fissures, nuggets of truth gasping for air amidst the rubble. But is that all there is? Does the narrative hold from start to finish? Yes and no. First of all, why now? This is a leak – essentially from one Deep State insider, Hersh’s key source. This 21st century “Deep Throat” remix may be appalled at the toxicity of the system, but at the same time he knows that whatever he says, there will be no consequences. Cowardly Berlin – ignoring the nuts and bolts of the scheme all along – will not even squeak. After all the Green gang has been ecstatic, because the terror attack has thoroughly advanced their medieval de-industrialization agenda. In parallel, as an extra bonus, all the other European vassals receive further confirmation this is the fate that awaits them if they don’t follow His Master’s Voice. Hersh’s narrative frames the Norwegians as the essential accessory to terror. Hardly surprising: NATO’s Jens “Peace is War” Stoltenberg has been a CIA asset for perhaps half a century. And Oslo of course had its own motives to be part of the deal; to collect loads of extra cash selling whatever spare energy it had for desperate European customers. A little narrative problem is that Norway, unlike the U.S. Navy, still does not have any operational P-8 Poseidon. What was clear at the time is that an American P-8 was commuting back and forth – with mid-air refueling – from the U.S. to Bornholm island. A positive screamer is that Hersh – rather, his key source – had the MI6 completely vanish from the narrative. SVR, Russian intel, had focused like a laser on MI6 at the time, as well as the Poles. What still cements the narrative is that the combo behind “Biden” provided the planning, the intel and coordinated the logistics, while the final act – in this case a sonar buoy detonating the C4 explosives – may have been perpetrated by the Norwegian vassals. The problem is the buoy may have been dropped by an American P-8. And there’s no explanation of why one of the sections of Nord Stream 2 escaped intact.\n\n“..talks that should be based on the existing reality..”\n• Russia Ready For Talks With Ukraine, With No Preconditions – Deputy FM (TASS)\n\nIs Russia pushing Zakharova forward? See her a lot.\n\nBaerbock swallowed her words. “..if you are hypocritical again, you are making an irreparable mistake this time,” Zakharova wrote..”\n\n“There was a [malicious] intent that dealt a blow to global security..”\n• IMF To Meet Ukraine Officials In Warsaw Next Week (R.)\n\n“..if there’s a war to be fought, she wants to be the one with her finger on that proverbial trigger.”\n\nFormer Democratic US Representative Tulsi Gabbard has continued her long-running feud with Hillary Clinton following the ex-Secretary of State’s recent visit to India. She told Fox News that the trip served little purpose, and shows that former presidential candidate is a “dangerous character” who is “envious” of Joe Biden. Clinton arrived in India on February 5, visiting salt pan workers in Gujarat where she announced a $50-million initiative intended to empower women and communities to fight against climate change. However, Gabbard – who left the Democrat Party last year – has since said that Clinton’s visit to drum up support for alternative clean energy shows that she still covets diplomatic authority and is “envious” of Joe Biden’s presidency. “Her desire to be commander-in-chief that she’s had for a very long time has nothing to do with ensuring the safety and security of the American people,” Gabbard said on FOX News’ ‘Jesse Watters Primetime’ show Thursday. “It has everything to do with the fact that if there’s a war to be fought, she wants to be the one with her finger on that proverbial trigger.” She added that she believes Biden to be “channelling her warmongering ways.” Clinton has previously referred to Gabbard as a “Russian asset,” which prompted the former Hawaii Democrat to launch a defamation lawsuit. Gabbard also stated that Clinton’s visit to India did nothing to address India’s more pressing issues, such as tensions with its neighbor Pakistan, and that its only benefit was to increase her own public profile. “This is what makes her such a dangerous character,” Gabbard said. “She feels that she’s not accountable to anyone because she’s not suffering those consequences.” While in India, Clinton said that the country was ideally positioned to implement clean energy methods, which, she claimed, would increase economic growth. She referenced solar power facilities at a salt pan farm she’d visited in Surendranagar as evidence of this. Clinton also used the visit to praise self-employed Indian women who have chosen to work in roles such as street vendors, farmers and laborers.\n\n“While some like McCaskill yell “Russians!” others use more modern labels, such as “conspiracy theorists.” That notably includes the FBI itself..”\n\nIn my testimony, I warned that this was reminiscent of the McCarthy period where the FBI played a role in the establishment of blacklists for socialist, communists, and others. I encouraged Congress not to repeat its failures from the 1950s by turning a blind eye to such abuse. This view was amplified by former Rep. Tulsi Gabbard, who became persona non grata for her anti-war sentiments in Congress. She was later labeled a “Russian asset” by Hillary Clinton, who has refused to support that scurrilous claim of a former member. For years, the Democrats pushed a Russian collusion theory that collapsed. It was later disclosed that the Clinton campaign hid and then lied about funding the infamous Steele Dossier. Nevertheless, people like Carter Page were falsely accused of being Russian agents and critics labeled as Russian apologists. Ironically, the FBI was warned that the dossier appeared to be the result of Russian disinformation and relied on a presumed Russian agent. If anything, my warning of McCarthy-like attacks and measures seemed to be taken more as a suggestion than an admonition by some. Yet soon after the end of the hearing, MSNBC contributor and former Sen. Claire McCaskill appeared on MSNBC to denounce the member witnesses (Sen. Chuck Grassley, Sen. Ron Johnson, and former Rep. Gabbard) as “Putin apologists” and Putin lovers. She exclaimed, “I mean, look at this, I mean, all three of those politicians are Putin apologists. I mean, Tulsi Gabbard loves Putin.” (For the record, she also attacked me as not being “a real lawyer.”) [..] In the 1950s, it was easy for politicians to avoid discussing underlying views by just labeling their opponents as fellow travelers. We are watching the same use of personal attacks today as a way to evade the troubling disclosures in the Twitter Files. While some like McCaskill yell “Russians!” others use more modern labels, such as “conspiracy theorists.” That notably includes the FBI itself. When criticized for the role FBI agents played in secretly targeting citizens for censorship, the FBI called critics “conspiracy theorists . . . feeding the American public misinformation.”\n\nRoger Stone did a lot of research on the topic for his book.\n\nBritish Prime Minister Rishi Sunak has privately asked members of his cabinet to work out ways of rebuilding connections with the EU that had been severed after Brexit in 2020, government sources have told Bloomberg. Plans are currently being put together at 10 Downing Street to boost ties between London and Brussels in such areas as defense, migration and the economy, including trade, energy and international standards, the agency reported on Saturday. According to British ministers, diplomats and officials, who all spoke on condition of anonymity, the rapprochement is being prepared in order to compensate for the fallout of the conflict between Russia and Ukraine, in which London positions itself among the prime backers of the Kiev authorities. In the coming days, Sunak’s government is hoping to announce a solution to the longstanding dispute with the EU over post-Brexit trading arrangements for Northern Ireland. London’s plan is to capitalize on this development and make it the basis for further improving ties with the 27-member bloc. Bloomberg pointed out that by moving in this direction, the PM is risking causing anger among the anti-EU lawmakers from his ruling Conservative Party. Another challenge for Sunak would be overcoming the skepticism of European leaders, who got tired of top British politicians using the bloc as a “punch bag for their domestic audience” since the Brexit vote in 2016, it added. One of the sources assured Bloomberg that the alleged turn towards Europe didn’t mean that Brexit was a mistake but was merely a reflection of the changing geopolitical situation. According to another official, Sunak’s subordinates were able to persuade the Prime Minister, who has been in office since late October, that in the current reality of “a more dangerous world, rising authoritarianism and protectionism,” closer cooperation with allies was absolutely essential for the UK. Achieving this would require Britain to give up on its “madman strategy” of resisting the EU, in favor of a stable relationship with the bloc as critical friends, he said. By standing together, London and Brussels would be able to withstand economic turbulence and threats posed by Russia and China more effectively, the source explained.\n\nTriangular impossible object, devised in the 1950s by Lionel Penrose and his son, Nobel Prize-winning mathematician Sir Roger Penrose\n\n https://twitter.com/i/status/1624400863732047873\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle February 12 2023 - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2023/02/debt-rattle-february-12-2023/", "site_name": "The Automatic Earth", "article:published_time": "2023-02-12T09:58:11+00:00", "article:modified_time": "2023-02-12T09:58:40+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/05/CaveOfSwimmers6000BCE.jpg"}, "tags": ["Tulsi Gabbard", "superpower", "red scare", "Trump", "Baerbock", "cui bono", "preconditions", "Vucic", "censorship", "smear", "Zakharova", "Orban"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">After the earthquake in Hatay, Turkey a 30-meter-deep rift was formed along the fault. Olive groves were split in two</p>\n<p>[source (TR): <a href=\"https://t.co/w21YpmKRUI\">https://t.co/w21YpmKRUI</a>]<a href=\"https://t.co/g1RHkJDGfq\">pic.twitter.com/g1RHkJDGfq</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1624452369348952066?ref_src=twsrc%5Etfw\">February 11, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">REGIME CHANGE COMING IN HUNGARY</p>\n<p>She’s setting up the mechanisms to overthrow Viktor Orban—“Pro-democracy Non-Government Organizations” which are actually CIA contractors to recruit agents provocateurs.</p>\n<p>Soon there’ll be riots in Budapest. You watch—they always do the same thing. <a href=\"https://t.co/qAWwTAS2dP\">https://t.co/qAWwTAS2dP</a></p>\n<p>— Gonzalo Lira (@GonzaloLira1968) <a href=\"https://twitter.com/GonzaloLira1968/status/1624571026658017280?ref_src=twsrc%5Etfw\">February 12, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">10 Feb<br/>China's Mao Ning: \"The Nord Stream gas pipelines are vital transnational infrastructure. The explosions had a serious impact on global energy markets and the environment. If Hersh is telling the truth…US owes the world a responsible explanation.\" <a href=\"https://t.co/t0AUETRxDl\">https://t.co/t0AUETRxDl</a> <a href=\"https://t.co/2MfdXB36ef\">pic.twitter.com/2MfdXB36ef</a></p>\n<p>— the Lemniscat (@theLemniscat) <a href=\"https://twitter.com/theLemniscat/status/1624314833142272003?ref_src=twsrc%5Etfw\">February 11, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">NASA only uses 15 digits of π for calculating interplanetary travel. At 40 digits, you could calculate the circumference of a circle the size of the visible universe with an accuracy that'd fall off by less than the diameter of a single hydrogen atom <a href=\"https://t.co/iXpDgL03r5\">https://t.co/iXpDgL03r5</a> <a href=\"https://t.co/HybLJHW2X1\">pic.twitter.com/HybLJHW2X1</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1624438116949041152?ref_src=twsrc%5Etfw\">February 11, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">What a Wonderful World <a href=\"https://t.co/WvBX6199o7\">pic.twitter.com/WvBX6199o7</a></p>\n<p>— Gabriele Corno (@Gabriele_Corno) <a href=\"https://twitter.com/Gabriele_Corno/status/1624332788626255872?ref_src=twsrc%5Etfw\">February 11, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://en.wikipedia.org/wiki/Cave_of_Swimmers", "https://www.azerbaycan24.com/en/serbia-may-soon-be-forced-to-sanction-russia-vucic/", "https://www.azerbaycan24.com/en/serbia-responds-to-cancel-russian-culture-calls/", "https://brownstone.org/articles/censorship-covid-war-more/", "https://www.theepochtimes.com/who-benefitted-from-this-chaos_5048566.html", "https://thesaker.is/the-war-of-terror-of-a-rogue-superpower-cui-bono/", "https://tass.com/military-operation-in-ukraine/1575101", "https://tass.com/politics/1575263", "https://tass.com/politics/1575221", "https://tass.com/politics/1575265", "https://www.reuters.com/world/europe/imf-meet-ukraine-officials-warsaw-next-week-source-2023-02-10/", "https://www.azerbaycan24.com/en/tulsi-gabbard-slams-dangerous-clinton-following-india-trip/", "https://nypost.com/2023/02/10/twitter-censorship-is-the-modern-day-red-scare/", "https://rogerstone.substack.com/p/trump-and-epstein-the-recycled-smear", "https://www.azerbaycan24.com/en/uk-has-secret-plans-for-eu-bloomberg/", "https://stevekirsch.substack.com/p/new-paper-an-estimated-13-million", "https://t.co/w21YpmKRUI", "https://t.co/g1RHkJDGfq", "https://twitter.com/Rainmaker1973/status/1624452369348952066?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/serbia-may-soon-be-forced-to-sanction-russia-vucic/", "https://t.co/qAWwTAS2dP", "https://twitter.com/GonzaloLira1968/status/1624571026658017280?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/serbia-may-soon-be-forced-to-sanction-russia-vucic/", "https://www.azerbaycan24.com/en/serbia-responds-to-cancel-russian-culture-calls/", "https://www.azerbaycan24.com/en/serbia-responds-to-cancel-russian-culture-calls/", "https://brownstone.org/articles/censorship-covid-war-more/", "https://brownstone.org/articles/censorship-covid-war-more/", "https://www.theepochtimes.com/who-benefitted-from-this-chaos_5048566.html", "https://www.theepochtimes.com/who-benefitted-from-this-chaos_5048566.html", "https://thesaker.is/the-war-of-terror-of-a-rogue-superpower-cui-bono/", "https://thesaker.is/the-war-of-terror-of-a-rogue-superpower-cui-bono/", "https://tass.com/military-operation-in-ukraine/1575101", "https://tass.com/military-operation-in-ukraine/1575101", "https://tass.com/politics/1575263", "https://t.co/t0AUETRxDl", "https://t.co/2MfdXB36ef", "https://twitter.com/theLemniscat/status/1624314833142272003?ref_src=twsrc%5Etfw", "https://tass.com/politics/1575263", "https://tass.com/politics/1575221", "https://tass.com/politics/1575221", "https://tass.com/politics/1575265", "https://tass.com/politics/1575265", "https://www.reuters.com/world/europe/imf-meet-ukraine-officials-warsaw-next-week-source-2023-02-10/", "https://www.reuters.com/world/europe/imf-meet-ukraine-officials-warsaw-next-week-source-2023-02-10/", "https://www.azerbaycan24.com/en/tulsi-gabbard-slams-dangerous-clinton-following-india-trip/", "https://www.azerbaycan24.com/en/tulsi-gabbard-slams-dangerous-clinton-following-india-trip/", "https://nypost.com/2023/02/10/twitter-censorship-is-the-modern-day-red-scare/", "https://nypost.com/2023/02/10/twitter-censorship-is-the-modern-day-red-scare/", "https://rogerstone.substack.com/p/trump-and-epstein-the-recycled-smear", "https://rogerstone.substack.com/p/trump-and-epstein-the-recycled-smear", "https://www.azerbaycan24.com/en/uk-has-secret-plans-for-eu-bloomberg/", "https://www.azerbaycan24.com/en/uk-has-secret-plans-for-eu-bloomberg/", "https://stevekirsch.substack.com/p/new-paper-an-estimated-13-million", "https://www.researchgate.net/publication/368389701_Age-stratified_COVID-19_vaccine-dose_fatality_rate_for_Israel_and_Australia", "https://stevekirsch.substack.com/p/new-paper-an-estimated-13-million", "https://t.co/iXpDgL03r5", "https://t.co/HybLJHW2X1", "https://twitter.com/Rainmaker1973/status/1624438116949041152?ref_src=twsrc%5Etfw", "https://t.co/WvBX6199o7", "https://twitter.com/Gabriele_Corno/status/1624332788626255872?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2023-02-12T09:58:11+00:00"}