{"result_id": "285022", "URL": "https://www.theautomaticearth.com/2021/07/the-safe-vaccines/", "timestamp": "2023-04-25 17:16:24 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/07/the-safe-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The \"Safe\" Vaccines", "cleaned_text": "Time to take a closer look at how safe the Covid vaccines actually are, you know, the ones every politician, “expert” and media figure says are “safe”. This is not that easy to find out, because it’s not something the media report on. That is, they report these things are safe, and if they are not, they don’t report that. We are living under a system of censorship that has not even that slowly crept up on us, and people mostly appear to be fine with that. Maybe that’s because they don’t recognize it for what it is.\n\nI was thinking about this when I saw a tweet by Robert Malone, pioneer/inventor of mRNA technology, who said:\n\nOf course in this case, what happens with trust in public health is the same as what happens with trust in media, they’re all in it together, supporting the same narrative, and since those same media would have to report on the safety of ivermectin and the not-so safety of the genetic vaccines, and don’t, who would know? It will take a lot of deaths and other forms of misery before they would feel obliged to publicly contradict themselves on the topic.\n\nFor now, it all looks like a closed circuit. Which includes the vast majority of politicians and experts, who get their news, info and opinions from the same media that everyone else gets them from. The experts have access to “expert media”, but what’s the difference if and when publications like the Lancet also bury reports on the lab leak theory etc.? Top it all off with social media bans and deletions and Bob’s your uncle.\n\nStill, we can try. There are registration systems for adverse effects of vaccines, legal obligations, the EudraVigilance in the EU (which I’ll leave alone for now) , VAERS in the US, and MHRA/Yellow Card in the UK. They all come with a major caveat, as described by Daily Exposé:\n\nIn other words: multiply all numbers below by a factor of 10. It’s not just the doctors and nurses, it’s everyone: it’s difficult to fill in the questionnaires in these systems, and when people are sick after a vaccination, they will often feel they have more important things to do. Obviously, reporting a death is not the same as reporting a headache, but many a doctor will be tempted to put a death down to something other than a vaccine. That’s today’s “climate”.\n\nThe Daily Exposé went through the latest MHRA report. I selected a few of their findings, but left out the facial paralysis and Bell’s palsy cases:\n\nUK Gov. release 23rd report on Adverse Reactions to the Covid-19 Vaccines\n• Up to 30 June 2021, the MHRA had received Yellow Card reports of 399 cases of major thromboembolic events (blood clots) with concurrent thrombocytopenia (low platelet counts) in the UK following vaccination with COVID-19 Vaccine AstraZeneca. Thirty six of the 399 reports have been reported after a second dose. Of the 399 reports, 207 occurred in women, and 189 occurred in men aged from 18 to 93 years. The overall case fatality rate was 18% with 71 deaths, five of which occurred after the second dose.\n• Up to and including 30 June 2021, we have received 74 reports of myocarditis and 50 reports of pericarditis following use of the Pfizer/BioNTech vaccine, as well as one report each of viral pericarditis, infective pericarditis and Streptococcal endocarditis. For the COVID-19 Vaccine AstraZeneca there have been 60 reports of myocarditis and 98 reports of pericarditis following vaccination up to and including 30 June 2021 as well as four reports for viral pericarditis and endocarditis, two reports for endocarditis bacterial and one report for viral myocarditis. There have been seven reports of myocarditis, six reports of pericarditis and one report of endocarditis following use of COVID-19 Vaccine Moderna up to the same date.\n• There have also been 6,310 reports of Lymphadenopathy as an adverse reaction to the pfizer mRNA jab. This is a condition that results in a terrible skin rash, unexplained weight loss, an enlarged spleen (the organ that filters the blood) and fever and night sweats.\n• Next up is cardiac disorders, of which the Pfizer jab has caused 3,158 resulting in 77 deaths. 29 of these deaths occurred due to the 77 cases of cardiac arrest reported as adverse reactions to the Pfizer jab. But there is also another condition with concerning numbers – Tachycardia.Tachycardia is an extremely high heart rate that occurs without explanation. There have been 530 cases of tachycardia reported to the MHRA due to the Pfizer jab as of the 30th June 2021.\n• All in all there have been 8,318 cardiac disorders reported to the MHRA as adverse reactions to the AstraZeneca jab as of the 30th June 2021, this has sadly resulted in 136 deaths.\n• There have also been 36 reports of haemorrhagic stroke resulting in 5 deaths, 98 reports of subarachnoid haemorrhage resulting in 5 deaths, and 116 reports of ischaemic stroke resulting in 4 deaths.\n• There have been 149 reported cases of cerebral haemorrhage due to the AstraZeneca jab, sadly resulting in 40 deaths. As well as 33 cases of cerebral thrombosis resulting in 2 deaths. But the highest amount of strokes to occur is a cerebrovascular, of which there have been 1,021 resulting in 39 deaths.\n• The next adverse reaction is a little strange when taken out of context, but it isn’t so strange when you look at the numbers of brain haemorrhages to have occurred due to both jabs. As the next two adverse reactions we are about to list can result as complications of these haemorrhages occurring – Deafness and Blindness.\n• As of June 30th there have been 140 reports of people going deaf as a result of the Pfizer / BioNTech mRNA gene therapy, this is a 180% increase on the number reported as of the 5th April 2021. As of June 30th there have been 320 reports of people going deaf as a result of the AstraZeneca jab. This is a 170% increase on the number reported as of the 5th April 2021. As of June 30th there have been 66 reports of people going blind as a result of the Pfizer / BioNTech mRNA gene therapy, this is 175% increase on the number reported as of the 5th April 2021. As of June 30th there have been 253 reports of people going blind as a result of the AstraZeneca jab. This is a 188% increase on the number reported as of the 5th April 2021.\n• In all there have been 450 deaths among the 236,555 adverse reactions to the Pfizer mRNA vaccine reported to the MHRA Yellow Card scheme as of the 30th June 2021. The AstraZeneca jab has had 960 deaths among 775,940 adverse reactions reported to the MHRA Yellow Card scheme as of the 30th June 2021. There have also been 6 deaths among the 22,191 adverse reactions to the Moderna jab, and 24 deaths among the 2,690 adverse reactions reported where the brand of vaccine was not specified. This means that as of 30th June 2021 the Covid-19 vaccines have caused 1,037,376 adverse reactions and 1,440 deaths..\n\nThen there’s the VAERS numbers in the US. Note that while the UK numbers are mostly totals for the epidemic, US numbers are more reported in weekly segments. Last week, July 2-9, 2,063 people died from getting a vaccine. Sure, the numbers are low compared to that of vaccinations, but at 2,000 deaths in one week it becomes impossible to talk about “extremely rare”. Especially when these numbers are hugely underreported ones.\n\n\n\n click to enlarge in new tab\n\nNote: the number of vaccinations per week fell a lot, from 23 million in early May to 4 million in early July.\n\nCurious: in the first two weeks of June we see 700 deaths per week, second two weeks: just over 100 deaths per week. I don’t know why that is. And then of course it became 800+ deaths and now 2,000+. Why? What happened?\n\nI must confess that when reading the numbers, and thinking about them, I find it very hard not to see the people who’ve taken a vaccine, because their doctor or their government said so, and told them it was safe, and who then come away with a permanent heart condition or who are blind for the rest of their lives. It makes it hard to write an article like this, it kind of cuts off my tongue.\n\nIt’s not up to me to tell people to either take a vaccine or not, but I can tell you to please think about the risks and benefits. These things are not 100% safe. And you deserve to be informed about that.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The \"Safe\" Vaccines - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/07/the-safe-vaccines/", "site_name": "The Automatic Earth", "article:published_time": "2021-07-11T18:18:46+00:00", "article:modified_time": "2021-07-11T18:18:50+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/06/JohnFalterTheWindyCity1946.jpg"}, "tags": ["pandemic", "hemmorage", "Moderna", "AstraZeneca", "deaf", "heart conditions", "safe", "Pfizer", "blind"], "tweets": [], "movies": [], "links": ["https://www.saturdayeveningpost.com/2018/03/march-winds/cover_9460323/", "https://dailyexpose.co.uk/2021/07/10/what-have-they-done-uk-gov-release-23rd-report-on-adverse-reactions-to-the-covid-19-vaccines/", "https://autoearth.wpenginepowered.com/wp-content/uploads/2021/07/2063VaccineDeaths900.jpg", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-07-11T18:18:46+00:00"}