{"result_id": "285015", "URL": "https://www.theautomaticearth.com/tag/stroke/", "timestamp": "2023-04-25 17:16:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/stroke/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "stroke Archives", "cleaned_text": "Good thing Moderna is preparing a 3-shot vaccine against this harmless variant. Pfizer can’t be far behind.\n• WHO: No Deaths Reported as a Result of Omicron Variant to Date (ET)\n\nThe World Health Organization (WHO) has informed The Epoch Times that it has not documented any deaths from the Omicron variant of the CCP (Chinese Communist Party) virus, which causes COVID-19. According to the WHO, “for Omicron, we have not had any deaths reported, but it is still early in the clinical course of disease and this may change.” When reached for comment by The Epoch Times, the Centers for Disease Control and Prevention (CDC) sent its report on the Omicron variant in the United States from Dec. 1 through 8. It shows that there were no documented deaths from Omicron during that period. The WHO’s latest weekly epidemiological update for Dec. 7 showed that all 212 Omicron cases documented across eighteen European Union (EU) countries were either mild or asymptomatic. \n\n “While South Africa saw an 82 percent increase in hospital admissions due to COVID-19 (from 502 to 912) during the week 28 November–4 December 2021, it is not yet known the proportion of these with the Omicron variant,” the report noted. Omicron has also been detected in the United States, first in California and later in Colorado, New York, Maryland, Utah, and many other states. The first American patient with the variant was identified in San Francisco, testing positive for COVID-19 on Nov. 29 after returning from a trip to South Africa on Nov. 22. Yet the California Department of Public Health has confirmed to the Los Angeles Times that the variant was present in wastewater as early as Nov. 25.\n\nInteresting take. “Vaccination will be given only with the consent of the person to be vaccinated after the information provided.”\n\nJapan announces that public and private sectors can not discriminate against those who refuse the experimental mRNA gene therapy injections. Japan is now labeling Covid “vaccines” to warn of dangerous and potentially deadly side effects such as myocarditis. In addition, the country is reaffirming its commitment to adverse event reporting requirements to ensure all possible side effects are documented. These efforts from Japan’s health authority are in stark contrast to the deceptive measures taken by other countries to coerce citizens into taking the injection, downplaying side effects, and discouraging proper adverse event reporting. Additionally, Japan is emphasizing informed consent and bodily autonomy. Until the coronavirus pandemic, the concept of “informed consent” was considered sacred to healthcare professionals in the West. Japan is particularly raising concerns about the risks of myocarditis in young men injected with Pfizer or Moderna’s gene–therapy treatment. The country is enforcing a strict legal reporting requirement of side effects that must take place within 28 days of the injections. Three Covid-19 gene-therapy treatments are currently offered in Japan. They include the Pfizer/BioNTech (Comirnaty) and Takeda’s Moderna formulation. The product descriptions state that “this product contains an additive that has never been used in a vaccine before.” Furthermore, the pharmaceutical companies urge you to consult your doctor about the additive if you plan to be injected with it. In addition to the Pfizer and Moderna gene-therapies, Vaxzevria (formerly AstraZeneca) is also administered in Japan. However, Japan only recommends it to people 40-year-old and over. Reference is also made to the new type of additive in the Vaxzevria injections. Japan’s Ministry of Health of health website encourages citizens to receive the “vaccine”; however, they stress it is not mandatory, “Although we encourage all citizens to receive the COVID-19 vaccination, it is not compulsory or mandatory. Vaccination will be given only with the consent of the person to be vaccinated after the information provided.” In addition, the government recommends those who are considering taking the shot carefully consider both its effectiveness and side effects. “Please get vaccinated of your own decision, understanding both the effectiveness in preventing infectious diseases and the risk of side effects. No vaccination will be given without consent.” Furthermore, they stress that businesses do not force employees to receive the experimental gene therapy. Nor should employees discriminate against those who refuse the injections,\n\n“These concerns are particularly acute in the case of children, who may well be exposed to the risk of very serious illness in the future, if vaccination permanently misdirects their immune system.”\n• Original Antigenic Sin: a Very Serious Reason to Stop Mass Vaccination (Eu.)\n\nThe severity of Corona infection varies wildly across the population. Children have generally mild or asymptomatic infections, while adults having a wide range of responses. Everyone always assumed that cross-immunity was part of the answer to this conundrum. The problem, is that it is shaping up to be a not very reassuring part of that answer. The untrained, innate non-specific immune response of children looks more and more like a big part of the reason they are spared severe infection. Adults with immune systems tightly calibrated to the common human coronaviruses , meanwhile, often have more severe symptoms. They suffer from Original Antigenic Sin. Over 4.2 billion people across the earth have received at least one dose of vaccine against SARS-2. \n\n The majority of these vaccines have elicited antibodies only against an early form of the spike protein that is no longer in circulation. This would seem to be one reason why many western countries with high vaccination rates appear to have locked themselves into an indefinite phase of heightened SARS-2 transmission. In the United Kingdom, 96% of adults have antibodies to the spike protein – most of these first acquired by vaccination. Shortly after they concluded their vaccination campaign, cases skyrocketed, and they have remained high ever since. Original Antigenic Sin is a real phenomenon. It seems not only to permanently influence the immune response to the spike protein itself, but also to inhibit the development of antibodies to other SARS-2 proteins.\n\n“Frequent re-exposure solves the problem of a rapidly evolving virus by updating our immune system.”\n• The Manufactured Illusion of an Unprecedented Virus (Ruechel)\n\nFrequent re-exposure solves the problem of a rapidly evolving virus by updating our immune system to recognize and neutralize closely related variants before we lose all our protective immunity from a previous infection. As long as the interval between exposures is not too long, you will still have cross-reactive immunity from your last exposure to protect you during your next “update”. Re-infection does not necessarily mean you will get sick. As long as it happens while you still have partial cross-reactive immunity, your “update” might be mild or you may not get any symptoms at all. In other words, we have to stop thinking of our immune systems as mere protective shields. They are much more than that. We need to remind ourselves that our immune systems are self-improving protective shields that need frequent exercise in order to maintain and update their skillset to keep up with an evolving enemy. The propaganda during Covid has not denied this fact, it has merely distorted it to the point where many people have lost faith in their immune systems, have become terrified about every “variant of concern”, and have become fixated on vaccines as the only path to salvation. Fear doesn’t just blind us to what is standing before our eyes. It also makes us doubt our own senses and forget our long-established understanding of the world. Frequent re-exposure is nature’s solution to booster shots. Vaccine boosters make more sense for diseases in which re-exposure is so rare that immunity wears off entirely before you are likely to get a natural update. It’s worth reminding ourselves that there are over 200 respiratory viruses that cause colds and flus and yet, despite the fact that they are permanently circulating in our communities, we do not get sick with dozens and dozens of colds and flus every year. Although we won’t be exposed to every single one of these 200 viruses every single year, we will cross paths with many of them. But as long as our immune systems have not been weakened by some serious pre-existing health condition (i.e. obesity, cancer, HIV, etc.) or by lifestyle choices that temporarily suppress our immune systems (i.e. poor sleep, lack of exercise, vitamin C or D deficiencies, stress, depression, isolation, etc.), most of these “updates” will merely be mild or asymptomatic infections because our immune systems encounter them so often.\n\nWhy did we ever allow this to be questioned, let alone denied?\n• Natural Immunity Protects Better Against Infection Than the Pfizer Vaccine (DS)\n\nAt the end of August, a study was published showing that natural immunity provides much better protection against infection than the Pfizer vaccine. It was described by UCL’s Francois Balloux as “a bit of a bombshell”. Subsequent studies have compared natural and vaccine-induced immunity at the cellular level. One found that infection-induced antibodies “exhibited superior stability and cross-variant neutralisation breadth” than vaccine-induced antibodies, suggesting that people who’d already been infected had better immunity against the then-novel Delta variant. However, as I noted in my write-up of the “bombshell” study, its findings still needed to be replicated. After all, certain datasets or methods of analysis can sometimes yield quirky results, which don’t survive independent empirical tests. Encouragingly, the findings now have been replicated – by another team of Israeli researchers, using a different dataset. In the latest study, Yair Goldberg and colleagues tracked all the individuals in their dataset (of people in Israel) who had tested positive or received two doses of the Pfizer vaccine before 1st July, 2021. They then compared the number of infections in previously infected versus vaccinated individuals from August to September of 2021. The researchers also examined the number of infections among those with so-called ‘hybrid immunity’ – i.e., previously infected individuals who got vaccinated. For each of the three groups, they counted the number of infections and the number of days ‘at risk’ (i.e., the total number of people multiplied by the number of days on which they were ‘at risk’ of becoming infected). Adjustments were made for age, sex, ethnicity, calendar week and a measure of risk exposure. Results are shown in the chart below. Each bar corresponds to the infection rate per 100,000 ‘risk days’. The reason the researchers used ‘risk days’, rather than just ‘people’, is that the composition of each group changed over time. For example, some previously infected people chose to get vaccinated. Notice that the labels for the horizontal bars are not the same for each group. Since we want to compare apples with apples, look at the bars labelled “Recovered 6–8 months” and “Vaccinated 6–8 months”. This comparison shows that, 6–8 months after the corresponding event, infection rates were more than six times higher among vaccinated individuals – 89 per 100,000 versus only 14 per 100,000 among previously infected individuals.\n\n“There are teachers who call children individually and ask them about their vaccination status: those who are vaccinated receive applause, those who do not have to justify themselves.”\n\n“It seems as if it has been forgotten that the vulnerable group does not sit in kindergartens and schools.”\n• The Social Division Has Long Since Reached Schools (Welt)\n\nHardly anything is discussed as emotionally as concerns about children in the pandemic. The reasons for this could not be more different, there is only consensus that almost all parents feel abandoned by politics. Although the previous plans of the traffic light parties no longer provide for nationwide school closings, regionally these will also be possible in the future. Conditions that include alternating and distance lessons as well as distance rules are not expressly excluded. In some federal states, compulsory attendance has already been lifted and the first schools have been closed again.Many parents are now ready to accept further measures if only the educational institutions remain open this winter. At the same time, scenes are playing out in schools that would have sparked an outcry from society before the pandemic. There are boards with the vaccinated on one side and the non-vaccinated on the other, who then have to undergo regular tests in front of the assembled class. There are teachers who call children individually and ask them about their vaccination status: those who are vaccinated receive applause, those who do not have to justify themselves. Adolescents remind their classmates of their “social responsibility” by mistakenly assuming that it is they who have a responsibility for adult society, not for them. The social division has long since reached schools. This is certainly not the case in all schools, but unfortunately they are not isolated cases either. The medical benefit of the vaccination for 12 to 17-year-olds is given, but limited, as Stiko member Rüdiger von Kries recently emphasized in an interview with Bayerischer Rundfunk. Most young people are – and rightly so – not afraid of infection. Nevertheless, many would like to be vaccinated: because they want to live their youth, want to evade the pressure exerted on them and avoid the requirements that apply to those who have not been vaccinated. The Standing Vaccination Commission (Stiko) generally recommends vaccinating children and adolescents from the age of 12 against Covid-19, but has explicitly opposed vaccination for children and adolescents to participate in education, culture and other social activities is made dependent. So it says in the recommendation. But politics, with its sometimes disproportionate measures against this age group, prevents their social participation. So 2G is spreading even further for this age group. Children and adolescents from 12 (or 16) years of age no longer have access to public facilities in many places, regardless of their negligibly low risk of developing a serious disease. Von Kries calls such an obligation “simply absurd”. And now that the European Medicines Agency (EMA) has approved the vaccine for children under the age of 12, it must be feared that the younger ones will face the same threat. A fact-based classification on the basis of scientific evidence no longer seems possible. The parents’ trust in political decisions for the benefit of adolescents has been lost. It seems as if it has been forgotten that the vulnerable group does not sit in kindergartens and schools.\n\nGoogle translate. Note the neat trick: much of the correspondence is done with text messages, like Whats App. Which are not archived (“by their nature short-lived”), and therefore don’t exist, officially. Handy when an FOIA request comes in. Click here for the uncensured 104-page contract.\n\nThe European Commission does not want to make possible agreements between Ursula von der Leyen and the pharmaceutical giant Pfizer transparent. This emerges from a response from the Commission to the EU ombudswoman Emily O’Reilly, which netzpolitik.org has now published. Specifically, it is about messages that the EU Commission President is said to have exchanged directly with Pfizer CEO Albert Bourla in order to thread a vaccine deal. The New York Times reported on the existence of the news in April. The deal involved 1.8 billion doses from Pfizer-BioNTech. The billion dollar deal for the vaccine was agreed this spring, when the great majority of Europeans were still unvaccinated, via the short official channel in calls and messages directly between Ursula von der Leyen and Albert Bourla, according to the report of the renowned US newspaper . The “text messages” referred to there can mean both SMS and messages via messengers such as Signal or WhatsApp. Its vaccine Comirnaty makes the consortium of Pfizer and the German company BioNTech the most important vaccine supplier to the EU. But how it sets prices for its vaccines and which countries are preferred for delivery remains in the dark, according to an investigative research by the Financial Times. “How Pfizer is exercising its newfound power – and what the company is planning next – he is keeping top secret.” Despite criticism from MPs and NGOs who are calling for more transparency in EU billion-dollar deals, the EU Commission does not want to give any insight into the purchase of vaccines. As with contracts with other manufacturers, the Commission has disclosed a preliminary agreement and a purchase agreement for its business with Pfizer, but essential details such as the delivery price and liability issues have been blacked out in these. Not only the contracts, even the initiation of the business remains in the dark. The EU Commission rejected a request for freedom of information from netzpolitik.org on the news between Commission chief Von der Leyen and Pfizer boss Bourla in July: “No documents could be found that fall within the scope of your request,” says the Answer by the Secretary-General of the Commission, Ilze Juhansone. In this case, netzpolitik.org lodged a complaint with the ombudswoman O’Reilly. As a result, there was recently a virtual meeting between seven top officials: from the Commission and five from the Ombudsman. In it, the Commission set out in detail how it deals with SMS or messenger services such as WhatsApp and Signal. Such messages are “by their nature short-lived” and are therefore neither used in formal decision-making nor do they produce binding commitments by the institution. As a result, SMS or messenger messages have never been filed in the Commission’s archive system.\n\nFor a six-month booster shot. What happens when that is changed to three months? Automatic update?\n• Pentagon Considering Covid Booster Mandate For All Troops (AT)\n\n“..more and more forces and equipment are being accumulated on the line of contact in the Donbass, supported by an increasing number of Western instructors.”\n\nThe Pentagon has disclosed details of the shipment of anti-tank missile systems and projectiles supplied to Kiev, as Moscow grows increasingly concerned about the prospect of a full-blown conflict in Ukraine’s Donbass region. In a statement received by Russian news outlet TASS on Thursday, Pentagon spokesman Lieutenant Colonel Anton Semelroth said that “the $60 million package… included 30 Javelin command and control launchers, as well as 180 missiles.” According to him, the rocket launchers were delivered to Ukraine on October 23. “In 2021, the US allocated more than $450 million in aid to Ukraine for security tasks as part of our continued commitment to support the country’s ability to defend its sovereignty and territorial integrity,” the spokesman added. Semelroth’s comments come amid warnings from Moscow over tensions in the war-torn region close to Russia’s borders. Last week, Russian Foreign Minister Sergey Lavrov said that “more and more forces and equipment are being accumulated on the line of contact in the Donbass, supported by an increasing number of Western instructors.” At the end of November, the top diplomat said that claims Ukraine’s troops had deployed American-made Javelin rocket launchers were a matter of grave concern and could lead to a full-blown offensive in the war-torn region. “In recent weeks, we have seen a stream of consciousness from the Ukrainian leadership – especially when it comes to the military – that is excessively inflamed and dangerous,” Lavrov said. Just hours before, the head of Ukraine’s military intelligence service, Kirill Budanov, revealed that advanced US-made Javelin systems had been tested by Ukraine’s troops and were being used by soldiers in the Donbass. Russia’s ambassador in Washington, Anatoly Antonov, warned the White House earlier in November that supplying Ukraine with deadly armaments could diminish hopes for peace in the region, stating that Moscow believes “another opportunity to encourage Kiev to stop the war has been missed.”\n\n“The op-ed concludes by advising Sullivan to weigh his words carefully going forward and not to “have a big mouth,” lest he “create more embarrassment” for the US.”\n• Chinese State-Run Media Says Beijing Ready To Use Force Against US (RT)\n\nA Chinese state-run media outlet has warned Washington that Beijing will not hesitate to strike US forces should they try to prevent China’s reunification with Taiwan, as promised recently by a top American official. The Global Times picked up on National Security Advisor Jake Sullivan’s statement on Tuesday, in which he said that the US was “going to take every action that we can take, from the point of view of both deterrence and diplomacy” to prevent a scenario where China takes over Taiwan militarily. The message was echoed the same day by Secretary of State Antony Blinken, who warned China that a military scenario vis-a-vis Taiwan would be a “very serious mistake.” However, the Chinese outlet surmised that Sullivan’s assurances should not be construed as a “manifesto of US policy,” as the “US simply cannot build a deterrent to prevent the Chinese mainland from carrying out reunification by force when necessary.” The op-ed goes on to claim that Washington does not really have the “will to defend Taiwan at all costs.” The article takes a yet more bellicose turn when it says it is “credible” that US troops, should they come to Taiwan’s rescue, would be “heavily attacked” by the People’s Liberation Army if “reunification by force” does happen. The Global Times predicts Sullivan would be likely to “recall or downplay” his statement later, since the “US cannot afford” to defend Taiwan “at the cost of a deadly war.” The op-ed warns that “reunification by force will definitely happen” unless Washington convinces Taiwan authorities to accept the concept of ‘one country, two systems’ and engage with mainland China “on the path of peaceful reunification.” The article blames Taiwan’s ruling Democratic Progressive Party, which came to power in 2016, for the escalation, adding that the situation has possibly already gone beyond the point of no return. The op-ed concludes by advising Sullivan to weigh his words carefully going forward and not to “have a big mouth,” lest he “create more embarrassment” for the US.\n\nThis happened on October 27. The High Court, when reading its verdict this week, undoubtedly knew about it.\n\nJeffrey Sterling @S_UnwantedSpy: “I can guarantee that in a US prison he would not receive medical attention. It took the attention of a US senator for me to receive proper medical attention. #Assange won’t have that “assurance”.\n• Julian Assange Has Had A Stroke In Belmarsh Prison (DM)\n\nJulian Assange has had a stroke in Belmarsh Prison, his fiancee Stella Moris revealed last night. The WikiLeaks publisher, 50, who is being held on remand in the maximum-security jail while fighting extradition to America, was left with a drooping right eyelid, memory problems and signs of neurological damage. He believes the mini-stroke was triggered by the stress of the ongoing US court action against him, and an overall decline in his health as he faces his third Christmas behind bars. It happened at the time of a High Court appearance via video link from Belmarsh in October. A ‘transient ischaemic attack’ – the interruption of the blood supply to the brain – can be a warning sign of a full stroke. Assange has since had an MRI scan and is now taking anti-stroke medication. Ms Moris, 38, a lawyer, said: ‘Julian is struggling and I fear this mini-stroke could be the precursor to a more major attack. It compounds our fears about his ability to survive the longer this long legal battle goes on. ‘It urgently needs to be resolved. Look at animals trapped in cages in a zoo. It cuts their life short. That’s what’s happening to Julian. The never-ending court cases are extremely stressful mentally.’ She said he was kept in his cell for long periods and was ‘short of fresh air and sunlight, an adequate diet and the stimulus he needs’. Assange faced a major legal setback on Friday when the High Court overturned a judgment made this year preventing extradition to the US to face charges under the US Espionage Act. His lawyers successfully argued he would be kept in conditions in the US that could lead to a serious risk of suicide. The High Court reversed the earlier ruling after the US government offered assurances about his potential imprisonment. But Ms Moris said: ‘I believe this constant chess game, battle after battle, the extreme stress, is what caused Julian’s stroke on October 27. He was feeling really unwell, far too ill to follow the hearing, and he was excused by the judge but could not leave the prison video room. ‘It must have been horrendous hearing a High Court appeal in which you can’t participate, which is discussing your mental health and your risk of suicide and in which the US is arguing you are making it all up. ‘He had to sit through all this when he should have been excused. He was in a truly terrible state. His eyes were out of synch, his right eyelid would not close, his memory was blurry.’\n\nWhere does goverment money come from? A very revealing video from Canada.\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "stroke Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/stroke/", "site_name": "The Automatic Earth"}, "tags": ["EU", "stroke", "Original Antigenic Sin", "myocarditis", "Von der Leyen", "China", "Pfizer", "Ukraine", "Assange", "Japan", "Omicron"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Covid Vaccine Propaganda Exposed. Why did so many blindly get vaccinated without thinking? Popular culture, media, celebrities, politicians, athletes, social media creators, emotional appeals, &amp; slogans. Spread fear, then offer the solution to freedom &amp; getting your life back. <a href=\"https://t.co/xK3fUhlfyE\">pic.twitter.com/xK3fUhlfyE</a></p>\n<p>— FreeThinkerFitness (@FreeThinkerFit) <a href=\"https://twitter.com/FreeThinkerFit/status/1469774542906167298?ref_src=twsrc%5Etfw\">December 11, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">In Germany, children are being forced “to go to the front of the class and state their vaccination status daily. Those who are vaccinated are applauded, those who are not have to explain why they are not.”<a href=\"https://t.co/k9nmI4Smx4\">pic.twitter.com/k9nmI4Smx4</a></p>\n<p>— Michael P Senger (@MichaelPSenger) <a href=\"https://twitter.com/MichaelPSenger/status/1469731322830544897?ref_src=twsrc%5Etfw\">December 11, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I asked 10 top government officials where government money comes from.</p>\n<p>Do you think they had an answer? <a href=\"https://t.co/0x3OcfURiq\">pic.twitter.com/0x3OcfURiq</a></p>\n<p>— pierrepoilievre (@PierrePoilievre) <a href=\"https://twitter.com/PierrePoilievre/status/1468594502080237568?ref_src=twsrc%5Etfw\">December 8, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://en.wikipedia.org/wiki/Outskirts_of_Paris_(Van_Gogh)", "https://www.theepochtimes.com/mkt_morningbrief/no-confirmed-omicron-deaths-so-far-who-cdc_4150331.html", "https://rwmalonemd.substack.com/p/vaccine-nation-forever-moderna-announces", "https://rairfoundation.com/alert-japan-places-myocarditis-warning-on-vaccines-requires-informed-consent/", "https://eugyppius.substack.com/p/original-antigenic-sin-is-a-real", "https://www.juliusruechel.com/2021/12/a-half-truth-is-whole-lie-omicron.html", "https://dailysceptic.org/2021/12/10/another-study-finds-that-natural-immunity-protects-better-against-infection-than-the-pfizer-vaccine/", "https://www.welt.de/debatte/kommentare/article235387210/Corona-Die-Spaltung-der-Gesellschaft-ist-in-den-Schulen-angekommen.html", "https://netzpolitik.org/2021/informationsfreiheit-von-der-leyen-verweigert-auskunft-ueber-angebliche-sms-zu-milliardendeal-mit-pfizer/", "https://www.armytimes.com/news/pentagon-congress/2021/12/10/pentagon-considering-covid-booster-mandate-for-all-troops/", "https://www.rt.com/russia/542840-ukraine-delivery-american-rockets/", "https://www.rt.com/news/542900-china-military-scenario-taiwan-america/", "https://www.dailymail.co.uk/news/article-10300037/Julian-Assange-stroke-Belmarsh-prison-Fianc-e-blames-extreme-stress.html", "https://t.co/xK3fUhlfyE", "https://twitter.com/FreeThinkerFit/status/1469774542906167298?ref_src=twsrc%5Etfw", "https://www.theepochtimes.com/mkt_morningbrief/no-confirmed-omicron-deaths-so-far-who-cdc_4150331.html", "https://www.theepochtimes.com/mkt_morningbrief/no-confirmed-omicron-deaths-so-far-who-cdc_4150331.html", "https://rwmalonemd.substack.com/p/vaccine-nation-forever-moderna-announces", "https://rwmalonemd.substack.com/p/vaccine-nation-forever-moderna-announces", "https://rairfoundation.com/alert-japan-places-myocarditis-warning-on-vaccines-requires-informed-consent/", "https://rairfoundation.com/alert-japan-places-myocarditis-warning-on-vaccines-requires-informed-consent/", "https://eugyppius.substack.com/p/original-antigenic-sin-is-a-real", "https://eugyppius.substack.com/p/original-antigenic-sin-is-a-real", "https://www.juliusruechel.com/2021/12/a-half-truth-is-whole-lie-omicron.html", "https://www.juliusruechel.com/2021/12/a-half-truth-is-whole-lie-omicron.html", "https://dailysceptic.org/2021/12/10/another-study-finds-that-natural-immunity-protects-better-against-infection-than-the-pfizer-vaccine/", "https://dailysceptic.org/2021/12/10/another-study-finds-that-natural-immunity-protects-better-against-infection-than-the-pfizer-vaccine/", "https://www.welt.de/debatte/kommentare/article235387210/Corona-Die-Spaltung-der-Gesellschaft-ist-in-den-Schulen-angekommen.html", "https://t.co/k9nmI4Smx4", "https://twitter.com/MichaelPSenger/status/1469731322830544897?ref_src=twsrc%5Etfw", "https://www.welt.de/debatte/kommentare/article235387210/Corona-Die-Spaltung-der-Gesellschaft-ist-in-den-Schulen-angekommen.html", "https://gboulianne.files.wordpress.com/2021/12/contrat-ue-pfizer-non-censure.pdf", "https://netzpolitik.org/2021/informationsfreiheit-von-der-leyen-verweigert-auskunft-ueber-angebliche-sms-zu-milliardendeal-mit-pfizer/", "https://netzpolitik.org/2021/informationsfreiheit-von-der-leyen-verweigert-auskunft-ueber-angebliche-sms-zu-milliardendeal-mit-pfizer/", "https://www.armytimes.com/news/pentagon-congress/2021/12/10/pentagon-considering-covid-booster-mandate-for-all-troops/", "https://www.armytimes.com/news/pentagon-congress/2021/12/10/pentagon-considering-covid-booster-mandate-for-all-troops/", "https://www.rt.com/russia/542840-ukraine-delivery-american-rockets/", "https://www.rt.com/russia/542840-ukraine-delivery-american-rockets/", "https://www.rt.com/news/542900-china-military-scenario-taiwan-america/", "https://www.rt.com/news/542900-china-military-scenario-taiwan-america/", "https://www.dailymail.co.uk/news/article-10300037/Julian-Assange-stroke-Belmarsh-prison-Fianc-e-blames-extreme-stress.html", "https://www.dailymail.co.uk/news/article-10300037/Julian-Assange-stroke-Belmarsh-prison-Fianc-e-blames-extreme-stress.html", "https://t.co/0x3OcfURiq", "https://twitter.com/PierrePoilievre/status/1468594502080237568?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}