{"result_id": "285028", "URL": "https://www.theautomaticearth.com/2021/10/the-vaxx-is-dead-now-what/", "timestamp": "2023-04-25 17:16:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/10/the-vaxx-is-dead-now-what/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The Vaxx is Dead. Now What?", "cleaned_text": "Pfizer Covid Jab ‘90% Effective Against Hospitalisation For At Least 6 Months’, says a recent Guardian headline. Do you remember 1 year ago or so, when these things were first reported on? We were told things like 95% effective against infection, nobody talked about hospitalization, and nobody ever mentioned a time limit.\n\nI’m not sure if they are just moving goalposts or if maybe a whole new and different game has been started, but those changes in wording are stark. Effectively, we’ve been sold one narrative for a year and are now finding out that it was never true. It’s just that the propagandists, like the Guardian, are not yet ready to catch up with the changes. Here’s thinking that will change.\n\nMeanwhile, a few billion people have been injected with substances that essentially don’t do what we were told they would. As for the effectiveness against hospitalization, that’s murky at best. For instance because in the US, as of August 7th 60% of hospitalizations were among fully-vaccinated individuals. But protection vs severe disease is the last leg the vaccine fanatics have to stand on, and they will protect that leg with all they got. Until they no longer can.\n\nAnd even this article admits “Effectiveness against all Covid infections fell from 88% within a month of having two doses to 47% after six months..” OK, so after 6 months they’re useless. You wouldn’t get a EUA for 47%. But what do things look like after 3 months?\n\nAs you can see, things already get worse after a few weeks. Let’s be generous and say the substances are “effective” for 3 months. Of course, minus the first two weeks, when they are known to increase infection risk. That leaves 10 weeks of “effectiveness”. And after 6 months there’s nothing left. Says even Reuters.\n\nCovid Vaccine Antibody Levels Drop ‘Nearly 10-Fold’ After About Six Months\n\nA preliminary study this week claimed to have found a steep reduction in the number of coronavirus-fighting antibodies in patients roughly half a year after they received the COVID-19 vaccine. Researchers “analyzed blood samples from 46 healthy, mostly young or middle-aged adults after receipt of the two doses and again six months after the second dose,” Reuters reported this week. The study indicated that “vaccination with the Pfizer-BioNtech vaccine induces high levels of neutralizing antibodies against the original vaccine strain, but these levels drop by nearly 10-fold by seven months,” two of the researchers told the news wire. \n\n The study, which has not yet been certified by peer review, comes amid growing talk of the possible need for a booster shot of the COVID-19 vaccine to ensure a robust immune response. The study determined that “administering a booster dose at around 6 to 7 months following the initial immunization will likely enhance protection against SARS-CoV-2 and its variants.”\n\nEnhance protection? Or kill it? You be the judge. The Exposé looked at the latest report available from the UK Health Security Agency, which has recently replaced Public Health England. Its conclusion:\n\nThe efficacy of all available vaccines combined is as low as – 85.71% within the 40-49 age group, and as high as – 3.4% in the 30-39 age group. This shows that the Covid-19 vaccines are making people more susceptible to catching Covid-19, rather than preventing cases of Covid-19 by the claimed 95%. By combining the numbers provided for all age groups over the age of 30, we have been able to calculate an average vaccine effectiveness of – 47.69%, and we’re definitely seeing this in the number of confirmed cases by vaccination status. \n\n Between week 36 and week 39 of 2021 there were 41,149 confirmed Covid-19 cases in the unvaccinated over 30’s, 14,649 confirmed cases in the partly vaccinated over 30’s, and a frightening 243,373 confirmed cases in the fully vaccinated over 30’s. The new UK Health Security Agency report proves without a shadow of a doubt that the Covid-19 vaccines do not work, and actually make the recipients worse.\n\nSo, as I asked, now what? For the moment, the push for the vaccines is only getting stronger. People are being fired left right and center, including long term and dedicated health care professionals. Freedoms and rights continue to be taken away, and increasingly so. But people will start to see some of the real numbers, no matter how hard you try to hide them.\n\nSo as a politician or media person, you better try and stay ahead of the game. A huge number of people have died because, in order to get the authorizations for the vaccines, all prophylactics and early treatments had to be banned. And now the vaccines begin to actively kill many more. There is no way you can keep that hidden. And there’s no way you can keep pushing the vaccines when they kill those who are inoculated.\n\nIn many countries, the campaigns for booster shots are getting fired up. They will only make things worse, and fast. Ever more people will become spike protein factories, as their immune systems are no longer capable of dealing with the increasing amounts of spikes their own bodies produce. While the time the boosters provide “protection” will shorten. If you get a booster today, you’re likely to need another one around Christmas.\n\nIf I were a politician, I would be getting very worried about this. And I would probably look for someone to blame it all on, so I don’t get blamed myself. Maybe I would say Pfizer and Moderna have misled me, or my own experts. But I wouldn’t wait till fingers inevitably begin to point in my direction. Just saying.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaxx is Dead. Now What? - The Automatic Earth", "description": "René Magritte Pandora’s box 1951     Pfizer Covid Jab ‘90% Effective Against Hospitalisation For At Least 6 Months’, says a recent Guardian headline. Do you remember 1 year ago or so, when these things were first reported on? We were told things like 95% effective against infection, nobody talked about hospitalization, and nobody ever", "url": "https://www.theautomaticearth.com/2021/10/the-vaxx-is-dead-now-what/", "site_name": "The Automatic Earth", "article:published_time": "2021-10-08T13:38:47+00:00", "article:modified_time": "2021-10-08T13:38:55+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2018/08/MagrittePandorasBox1951.jpg"}, "tags": ["prophylactics", "Moderna", "politicians", "effective", "hospitalizations", "vaccines", "Pfizer", "vaxx", "media", "boosters", "early treatment"], "tweets": [], "movies": [], "links": ["https://artgallery.yale.edu/collections/objects/51863", "https://www.theguardian.com/world/2021/oct/05/pfizer-covid-jab-90-effective-against-hospitalisation-for-at-least-6-months", "https://justthenews.com/politics-policy/coronavirus/report-covid-vaccine-antibody-levels-drop-nearly-10-fold-after-about", "https://theexpose.uk/2021/10/08/latest-ukhsa-report-shows-covid-vaccines-negative-efficacy-minus-86-percent/", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-10-08T13:38:47+00:00"}