{"result_id": "285046", "URL": "https://www.theautomaticearth.com/2023/03/debt-rattle-march-14-2023/", "timestamp": "2023-04-25 17:16:47 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2023/03/debt-rattle-march-14-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle March 14 2023", "cleaned_text": "TUCKER: Should the United States support regime change in Russia?\n\n TRUMP: No. We should support regime change in the United States, that’s far more important.\n\nIschinger wants a “peace process” led by only one side of the conflict: US, UK, Germany and France. WTF?\n\nThere are currently no conditions for a peace settlement in Ukraine, meaning Russia has no other option but to keep fighting, Kremlin spokesman Dmitry Peskov has argued. “The absolute priority for us remains and will always remain reaching the goals that we’ve set for ourselves. At this point in time, they can only be achieved through military means,” the official told journalists on Monday. Peskov was reacting to an article penned by veteran German diplomat Wolfgang Ischinger, who served as chair of the Munich Security Conference for over a decade. In a piece published by the Der Tagesspiegel daily on Sunday, Ischinger urged Western leaders to “start thinking about a peace process now” and create a special political contact group for the Ukraine conflict. “In addition to arms deliveries and financial support, we have to offer perspectives to the growing chorus of questions by critics,” he argued. According to Ischinger’s proposal, the contact group would be led by the US, UK, Germany and France, with other nations and international organizations, including NATO, forming an “outer circle” of participants to lend legitimacy to any draft documents. The group’s task would be to prepare a ceasefire agreement and other paperwork to form the backbone for a post-conflict period. It would work alongside the so-called Ramstein Group, which funnels Western military aid to Ukraine. Ischinger stressed that the new initiative would not put pressure on Ukraine to negotiate. The veteran German diplomat suggested a list of questions that the group would ask themselves, including: “Should a ceasefire agreement be endorsed by the UN Security Council?”, “Will there be a demilitarized buffer zone?”, and “Should the people in Crimea hold a referendum to decide who they belong to?”. Kiev has declared the full return of territories it claims as Ukrainian as a precondition for peace talks. Its national security council has also banned talks with Russia for as long as President Vladimir Putin remains in office. Moscow has argued that the Ukrainian government has effectively made peace talks impossible, and that Kiev has adopted its stance based on orders from the US, which is aiming to inflict a strategic defeat on Russia.\n\n“Unfortunately, they are all already dead or wounded..”\n• Doubts In Ukraine About Readiness To Mount Offensive -WaPo (RT)\n\nKiev’s forces have been so “degraded” by a year of fighting against Russia that some Ukrainian officials doubt their ability to execute a planned spring offensive, the Washington Post has reported. The conflict has taken many of the most seasoned Ukrainian troops, with the arrival of inexperienced draftees changing the profile of the country’s military, the US paper pointed out on Monday. US and European officials have estimated that up 120,000 Ukrainian soldiers have been killed or wounded since the launch of Russia’s military operation last February, it added. Kiev keeps information abouts losses secret, even from its Western backers. “Unfortunately, they are all already dead or wounded,” a battalion commander in Ukraine’s 46th Air Assault Brigade, identified only by his call sign, Kupol, told the paper about his experienced troops. And the poorly trained rookies that he’s been getting recently “just drop everything and run” as soon as the battle begins, the commander added. Another problem faced by Ukrainian troops is a shortage of ammunition, including artillery shells and mortar bombs, the Washington Post said, citing those fighting on the ground. “You’re on the front line. They’re coming toward you, and there’s nothing to shoot with,” Kupol said, describing the situation. “We don’t have the people or weapons,” an unnamed senior Ukrainian government official told the paper. He explained that casualties incurred by the side mounting an offensive are usually two or three times higher than on the defending side. “We can’t afford to lose that many people,” the official added. “If you have more resources, you more actively attack. If you have fewer resources, you defend more. We’re going to defend. That’s why if you ask me personally, I don’t believe in a big counteroffensive for us. I’d like to believe in it, but I’m looking at the resources and asking, ‘With what?’ Maybe we’ll have some localized breakthroughs,” the source said. The official called the number of tanks promised to Kiev by the US and its allies “symbolic,” while some of other officials who talked to the paper didn’t believe that Western weapons would be able to reach the frontline in time. The newspaper also cited a US official, who said that – despite some gains on the battlefield recently – ammunition, manpower and motivation problems were even worse on the Russian side. However, no facts were provided to back this claim. As for Ukraine, the stakes will be “particularly high” in the coming months as Kiev’s Western supporters watch to see if the country can reclaim the initiative, the Washington Post noted.\n\nZelensky wants to meet with Xi. He will not like that.\n• Xi Jinping Plans To Visit Moscow As Early As Next Week (TASS)\n\n“..this scenario would seem plausible only to people who “cannot think logically.”\n• Germany Is Not An Independent Nation – Patrushev (RT)\n\nGermany is facing an inevitable economic decline after losing its access to Russian energy, but cannot do anything about it because it is not a sovereign nation, the secretary of the Russian National Security Council has claimed. “Germany tried for many years to build its economy on a combination of cheap Russian energy and advanced German technologies. Like no one else, it realizes that the terrorist attack against the [Nord Stream pipelines] will definitely cause the German economy to decline further,” Nikolay Patrushev said in an interview published in Argumenti i Fakti newspaper on Monday. The advantages that German businesses enjoyed by getting access to Russian fuel has long irritated the governments of the US and the UK, he continued. But Berlin is not at liberty to continue cooperating with Moscow, “because the German nation is not independent.” “Washington imposes on Berlin its economic and environmental agenda and keeps a 35,000-strong military force on its soil. For years, the White House controlled [former chancellor] Angela Merkel, and now it forces the German leadership to side with the version of the pipeline sabotage that is advantageous to the US authorities,” Patrushev said, describing America’s treatment of Germany as “humiliating.” The remarks were part of Patrushev’s comments on the sabotage of the undersea pipelines, which were built to supply Germany with Russian natural gas. The Nord Stream links were ruptured by powerful explosions last September in what Russia has called a blatant terrorist attack. A series of articles published by Western media this month claimed that Western intelligence services believe that a “pro-Ukrainian group” not associated with any government was behind the attack. Patrushev argued that, considering the training and equipment that such a complicated operation required, this scenario would seem plausible only to people who “cannot think logically.”\n\n“Berlin is well aware that close economic cooperation between Germany and Russia has never satisfied Washington and London..”\n\nMoscow insists that an objective international investigation with its participation should be carried out on the Nord Streams sabotage. The one-sided versions being heard now do little to explain anything, Russian Security Council Secretary Nikolay Patrushev said. “I emphasize that any accusations that are not supported by the results of an impartial investigation cannot be trusted. Therefore, Moscow insists on an objective investigation with the participation of Russia and other interested countries. Without this, voicing one-sided subjective versions of the terrorist attack does not explain anything,” he told the Argumenty i Fakty weekly on Monday. According to Patrushev, Russia still did not know for certain who was behind the terrorist attacks at the Nord Stream gas pipelines, and the country has not been included in the investigation of this “unprecedented terrorist act”. He stressed that the situation was also complicated by the planting of a fake leak published without any reference to the real source. “Resolving to cover up the true patrons of the crime, the pro-government Anglo-Saxon media, following orders from above, laid the blame on a certain group of Ukrainian terrorists. In essence, they once again pointed to the terrorist nature of the current Kiev regime. At the same time, the authors of the information campaign thought that no one would object to this version,” the Russian Security Council Secretary stressed. In his opinion, the idea that the US and the UK were not involved in the terrorist attack “is obviously driven by the calculation that the audience lacks the ability to think logically, including the method of denial.” “Since newspapers are emotionally claiming that the act of sabotage was carried out by a group of Ukrainian terrorists, the question to ask is whether such a group exists at all and if it’s capable of doing such things. It’s no secret that activities like this require special ops units that are properly trained and equipped,” Patrushev noted. According to the security chief, the US and England certainly have such capabilities. Other NATO countries also use combat swimmers for sabotage tasks but only “with the consent and support of the country that determines the main agenda for NATO,” the official explained. Patrushev also suggested considering who benefited from the attack. “Were the blasts advantageous for Ukraine or Germany? Kiev neither lost nor gained anything from the gas pipeline destruction. Moreover, such an act is not advantageous for the Zelensky regime, which actually begs Berlin to give more military and other aid, and has no use for such an act,” he said. Germany, who for many years has been trying to build its economy based on a combination of cheap energy resources from Russia and advanced German technology, knows better than anyone else that the attack on the pipeline would definitely lead the economy of Germany to a further decline, added the Secretary of the Security Council of the Russian Federation. “At the same time, Berlin is well aware that close economic cooperation between Germany and Russia has never satisfied Washington and London,” he recalled. Along with that, Patrushev pointed out that it has long been clear that today’s German state was not independent: Washington imposed its economic and environmental policy on Berlin and kept a 35,000-strong military contingent on its territory. “It is known that for many years the White House controlled [former German Chancellor] Angela Merkel, and today it is forcing the German leadership to go along with the US authorities’ version of the pipeline sabotage. Perhaps that is why [German Chancellor Olaf] Scholz was urgently summoned to Washington for a meeting with [US President Joe] Biden. By doing so, the US continues to humiliate Germany, showing it its place,” he concluded.\n\nWe’re working on it. But other than 30,000 Poles, which other country is ready to send troops?\n\n“.. In October 2016, Ukraine’s new authorities stripped Yanukovich of the title of president..” That’s 2,5 years after the coup.\n• ‘Yanukovich Case’ Tantamount To Kiev’s Confession Of Coup – Former PM (TASS)\n\nThe Kiev regime’s charges against the ex-president of Ukraine, Viktor Yanukovich, of illegal border crossing and incitement to desertion are tantamount to a confession a coup d’état was staged in Ukraine in 2014, Ukraine’s former prime minister Nikolay Azarov (2010-2014) said on Monday. “In any unclear situation in Ukraine the Kiev regime blames Yanukovich. It is alleged that on February 23, Yanukovich fled Ukraine and encouraged about 20 of his guards, who were members of the state bodyguard service, to emigrate. What idiot has concocted this case?! First, they themselves were yelling at the top of their lungs that Yanukovich had quit on his own and left the territory of Ukraine on February 21. Now they themselves have admitted that Yanukovich was on the territory of Ukraine on February 21, which means that there was no quitting on his part,” Azarov he wrote on his page on a social network. The former prime minister urged Ukrainians to independently assess the inconsistency of the Kiev regime’s actions. On March 10, the Office of Ukraine’s Prosecutor-General announced that a district court in Kiev would hold hearings in absentia on the case of illegal border crossing and incitement to desertion against Yanukovich. The other defendant in this case is Konstantin Kobzar, the former chief of the head of state’s bodyguards. According to investigators, on February 23, 2014, Yanukovich and Kobzar illegally crossed the Russian-Ukrainian border twice and smuggled at least 20 people across it. On the same day, if the Prosecutor General’s Office is to be believed, Yanukovich, while staying on the territory of a military unit of Russia’s Black Sea Fleet in Sevastopol, was “instigating” his bodyguards commit desertion. Yanukovich served as Ukraine’s president from 2010 to 2014. During the coup d’état in February 2014, he was essentially ousted from office by force and, faced with a threat to his personal safety, had to flee the country. In October 2016, Ukraine’s new authorities stripped Yanukovich of the title of president, and a month later launched criminal proceedings against him in absentia on charges of treason. In 2019, a court in Kiev sentenced Yanukovich in absentia to 13 years in prison.\n\n“Miller’s hidden messages reveal casual discussions among the FBI regarding the monitoring of codefendant Rehl’s trial strategy, Rehl’s defenses and ‘interesting’ points, and ways the government can get around Rehl’s defenses..”\n\n“We will have a great depression far bigger and more powerful than that of 1929. As proof, the banks are already starting to collapse!!!”\n• US Heading For Another Great Depression – Trump (TASS)\n\n“..the interest rate hikes that Mr. Powell spoke of so confidently only days ago just got stashed into his folder labeled “Fuggeddabowdit.”\n\nSince banks today exist in a vast matrix of interconnected obligations — promises to pay this-and-that — fear grows that the rot from one bank, such as SVB, will infect many other banks that are no longer able to keep their promises about paying this-and-that, leading to a daisy-chain of things not getting paid. For an economy, that’s about the same as the blood ceasing to circulate in a body. The practice in situations such as this (say, as in 2008-09) is for the governing authorities — who supposedly rule over the banking world like gods — to rush to rescue these outfits with “liquidity,” money (or representations of it) as required to re-balance things, or, maybe provide the impression of re-balancing until something else can be figured out. The Jupiter and Minerva of American banking, Jay Powell and Janet Yellen, were faced with just that sort of call for divine intervention over the weekend as fear seeped into every nook and crevice of the money world that wealth was flaring away in the long-feared-of conflagration out of the dumpster banking had become. Sunday morning, Ms. Yellen told CBS News “bailouts, no way” but by the afternoon Mr. Powell cried “bailouts, way,” and they had to get their story straight. They offered up $25-billion to bail out depositors for a smoldering system that will arguably require a trillion dollars or more of liquidity to quench the spreading fires. One thing looks for sure: the interest rate hikes that Mr. Powell spoke of so confidently only days ago just got stashed into his folder labeled “Fuggeddabowdit.” So, the campaign to control inflation must now yield to the urgent need to create a whole lot of money to spray over those fires. You may have noticed that the value of your money has been slip-sliding away the past year or so. Peanut butter at five bucks a jar, and all. The situation at hand kind of guarantees that we’ll be seeing a whole lot more of that. And then the gods of money will have lost control of the interest rate console altogether. No more tweaking the broken knobs. More inflation will prompt US treasury paper holders to dump what they can while there’s still some value to retrieve. But the US has to issue more debt for all the bail-outs and theoretical buyers of new debt will perforce bid up the rates to keep up with inflation… and yet the US can’t possibly bear the burden of paying higher interest on its debt. Looks like the business model for running the USA is breaking down before our eyes.\n\n“What was featured in the stupidity of 2008? Allowing banks to run with no reserves..”\n• Sorry, No Empathy, No Bailouts And YES I MEAN IT (Denninger)\n\nThe so-called “Chief Risk Officer” at SVB had a masters in….. public administration. Anyone care to bet if she passed any form of advanced mathematics — you know, like for example Calculus or Statistics? Do you think she understood exponents and why this graph made clear that concentration of risk and duration was stupid and likely to blow up in everyone’s face — including hers? How about Bill Ackman and the others on the Internet screaming for a bailout? How about the CFOs of public companies like Roku that stuck several hundred million dollars in said bank? Was it not widespread public knowledge (and available to anyone who took 15 minutes to do research, which you’d think someone would do before putting a hundred million bucks somewhere) that this institution was chock-full of VC-funded startup companies which, historically fail 90% of the time and their debt becomes impaired or even worthless? Where are the indictments for fiduciary malfeasance among these people? It takes a literal five minutes with Excel to prove to yourself that if debt is rising faster than GDP no matter the interest rate eventually the interest payments on that debt will exceed all of the economy. This of course is impossible because you cannot use over 100% of anything as its not there, but long before you reach that point you’re going to have trouble putting food on the table, fuel in the vehicle and paychecks are going to bounce. It was for this reason that one of the first sections in my book Leverage, written after the 2008 blowup which I chronicled and laid bare upon the table featured exactly this chart. The last bit of insanity was just 15 years ago by my math. Did we fix it? No. What was featured in the stupidity of 2008? Allowing banks to run with no reserves. Who did that? Ben Bernanke, who got it into the TARP bill that eventually passed and which I reported on at the time. It accelerated that which was already going to happen because Congress is full of people who think trees grow to the moon, leverage is never bad and exponents are a suggestion. Oh by the way, your local Realtor thinks so to as does, apparently, the former SVB “risk officer” who, it is clear, didn’t understand exponents — or didn’t care. The simple reality is that it must always cost to borrow money in real terms. This means the rate of interest must be positive in said real terms, which means across the curve rates must be higher than inflation — again, in real terms, not in “CPI” which has intentional distortions in it such as “Owner’s Equivalent Rent” when you’re not renting a house, you’re buying it. Had said “CPI” actually had home prices in it then it would have shown a doubling in many markets in that section of the economy over the last three years. In other words housing alone would have resulted in a roughly 10% per year inflation rate, plus all the other increases, which means the Fed Funds rate should have been 300bips or so beyond that all the way back to 2020 — which would put Fed Funds at about 13% for the last three years. It isn’t of course but if it had been then all those “housing price increases” would not have happened at all. Incidentally even today the Fed Funds rate is below inflation and thus the crazy is still on.\n\n“We were mistreated by dumb bureaucrats, not by the minions of evil deities..”\n• Are The Evil Gods Returning? Or Is Evil Is Inside Us? (Ugo Bardi)\n\n[..] sometimes you have the sensation that something truly evil is moving in the world. Naomi Wolf expressed the idea most clearly in a recent post of hers. I could not explain the way the Western world simply switched from being based at least overtly on values of human rights and decency, to values of death, exclusion and hatred, overnight, en masse — without reference to some metaphysical evil that goes above and beyond fallible, blundering human agency. … “What we have lived through since 2020 is so sophisticated, so massive, so evil, and executed in such inhumane unison, that it cannot be accounted for without venturing into metaphysics. Something else, something metaphysical, must have done that. And I speak as a devoted rationalist.” Lately, I’ve been thinking along similar lines. I even argued that worshiping the evil deity Baphomet could be a good idea for really nasty people who want to dominate the world. Overall, though, I think it is not the right explanation. No matter how inexplicable the rise of evil can look, it is still something that comes from inside us, not from the outside. Evil is us, eventually. The recent release of the “Lockdown Files” in Britain supports this idea. These files contain the messages sent and received by Matt Hancock, the British Secretary of State for Health and Social Care during the lockdown period in Britain. In these messages, Hancock doesn’t sound evil. He just writes as if he cared only about himself, and his personal prestige. He wanted to “own the exit,” and he didn’t care about the British people, whom he evidently considered a band of morons. We were mistreated by dumb bureaucrats, not by the minions of evil deities. Now, I have a stated policy that I call the “Grokking Strategy” that consists in listening to everyone and trusting no one. So, I am perfectly willing to consider the hypothesis that the Hancock files are a psyop designed to divert the public’s attention away from the hidden forces that governed the reaction to the pandemic. On the whole, though, I think these files are genuine. They make sense, and they also match other examples of the same kind. For instance, we recently saw similar leaks of messages sent and received by the Italian equivalent of Hancock, Mr. Roberto Speranza, Minister of Health of the Italian government during the lockdown period. We can’t swear on the authenticity of these leaked messages, but they fit with the personality of Mr. Speranza. Like Hancock, he was clearly trying to “own the exit.” In late 2020, he published an autobiographical book designed to show how he had been valiantly fighting the virus and eventually had succeeded in squashing it. The book was quietly removed from the market when it turned out that the pandemic was not over. Now a printed copy is a rare collector’s item.\n\nThe Matt Taibbi and Michael Shellenberger hearing was unreal.\n• House Dems Use Hearing to Attack Both Free Speech and a Free Press (Turley)\n\n“At long last, have you left no sense of decency?” Those words were first asked by lawyer Joseph Welch in his confrontation with Sen. Joseph McCarthy (R-Wis.) during the Senate’s infamous Army-McCarthy hearings. This week, nearly 70 years later, Welch’s words seem more relevant than ever after House Democrats savaged two journalists who attempted to explain a government effort to censor citizens. It was only the latest of a series of hearings in which FBI agents and other whistleblowers, experts and journalists have been personally attacked for raising free-speech concerns. Last week’s hearing showed definitively that we live in a post-decency era. The latest attacks came as journalists Matt Taibbi and Michael Shellenberger testified about breaking the “Twitter Files” story, detailing how the FBI and other agencies secretly sought to censor or ban citizens from social media. In her opening statement, Delegate Stacey Plaskett (D-Virgin Islands), the ranking member of the House Judiciary subcommittee, attacked them as “so-called journalists” and said they were “a direct threat” to the safety of others by reporting the censorship story. Taibbi pushed back, saying that “I’m not a ‘so-called’ journalist” and giving a brief description of his award-winning career at Rolling Stone magazine and other publications. Yet other committee members also attacked the honesty of the two journalists. And after failed efforts to claim they were Elon Musk’s corrupt “scribes,” or limited by him in their investigations, the committee members attacked their ethics. The witnesses were attacked on everything but their choice of socks. Rep. Debbie Wasserman Schultz (D-Fla.) even claimed that “being a Republican witness today certainly casts a cloud over your objectivity.” When Wasserman Schultz impugned the two journalists’ honesty and ethics, she immediately “reclaimed (her) time” to prevent them from defending themselves. When the subcommittee chair gave them a chance to answer her claims, Wasserman Schultz and her Democratic colleagues objected that a witness was allowed to defend himself after being blocked from doing so. In an earlier attack, Rep. Stephen Lynch (D-Mass.) prevented Taibbi from answering a question and dismissed his effort to defend his position, saying: “This is how it works now. I’ll ask the question and you try to provide an answer if you can.”\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle March 14 2023 - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2023/03/debt-rattle-march-14-2023/", "site_name": "The Automatic Earth", "article:published_time": "2023-03-14T09:20:06+00:00", "article:modified_time": "2023-03-14T09:20:50+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/09/LouisAnquetinGirlreadingNewspaper1890.jpg"}, "tags": ["coup", "evil", "Taibbi", "Trump", "Nordstream", "Xi Jinping", "Jan 6", "mRNA", "offensive"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"My colleague over there says we saved a million lives with these vaccines. That is utter and complete nonsense. These vaccines saved no one. Across the world the most highly vaccinated countries had the worst case fatality rate.\"<br/>-Dr. Pierre Kory, Wisconsin testimony <a href=\"https://t.co/jNJLIybvgl\">pic.twitter.com/jNJLIybvgl</a></p>\n<p>— Vaccine Safety Research Foundation (@VacSafety) <a href=\"https://twitter.com/VacSafety/status/1635258324592754691?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">When Fauci came into office in 1968 about 6% of Americans had chronic disease including obesity, neurological, allergic, and auto-immune diseases. By 1986, 11.8% of children had chronic diseases. By 2006, that number had risen to 64%.  That’s Fauci’s track record. </p>\n<p>He claims… <a href=\"https://t.co/AYUBl0aB6W\">pic.twitter.com/AYUBl0aB6W</a></p>\n<p>— ⚡️THOR⚡️ the Deplorable 🇺🇸 (@ThorDeplorable) <a href=\"https://twitter.com/ThorDeplorable/status/1634898813855866881?ref_src=twsrc%5Etfw\">March 12, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/RobertKennedyJr?ref_src=twsrc%5Etfw\">@RobertKennedyJr</a> tells <a href=\"https://twitter.com/jimmy_dore?ref_src=twsrc%5Etfw\">@jimmy_dore</a>: \"Trump got in there and said I'm going to get rid of the swamp. He asked me to be on a vaccine safety commission. When that news got out, Pfizer gave him $1 million for his inaugural party, and he appointed two of Pfizer's lobbyists, Scott… <a href=\"https://t.co/qavCdjUafs\">https://t.co/qavCdjUafs</a> <a href=\"https://t.co/Y5aWcNxg0V\">pic.twitter.com/Y5aWcNxg0V</a></p>\n<p>— kanekoa.substack.com (@KanekoaTheGreat) <a href=\"https://twitter.com/KanekoaTheGreat/status/1635418049187840001?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Trump was exactly right about what would happen to the country if Biden became president. <a href=\"https://t.co/xgYaeQ44j3\">pic.twitter.com/xgYaeQ44j3</a></p>\n<p>— MAZE (@mazemoore) <a href=\"https://twitter.com/mazemoore/status/1635334104039432192?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The United States cannot defeat Russia, and NATO will NOT survive! </p>\n<p>Former U.S. military advisor, 🇺🇸Colonel Douglas McGregor: Russia is not Serbia. Russia is not Iraq. We are not going to defeat Russia. Russia will have its way in Ukraine. Russia will destroy the Ukrainian… <a href=\"https://t.co/SKme3QbB6N\">pic.twitter.com/SKme3QbB6N</a></p>\n<p>— dana (@dana916) <a href=\"https://twitter.com/dana916/status/1635321905426178058?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"nl\" dir=\"ltr\">Ik kreeg weer beelden én tekst en uitleg toegestuurd vanuit Japan, door <a href=\"https://twitter.com/You3_JP?ref_src=twsrc%5Etfw\">@You3_JP</a> inzake de extreme oversterfte in Japan.</p>\n<p>Mr. Yanagase Hirofumi stelt in de 'House of Councillors' vragen over de oversterfte en legt een verband met de COVID-19 vaccins.<a href=\"https://t.co/NniFp1qScw\">pic.twitter.com/NniFp1qScw</a></p>\n<p>— Niemands Knegt (@NiemandsKnegt) <a href=\"https://twitter.com/NiemandsKnegt/status/1635368249943814144?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/DowdEdward?ref_src=twsrc%5Etfw\">@DowdEdward</a>: The Employed Population Has Basically Been Poisoned</p>\n<p>\"So what we're seeing is, basically, since the release of the vaccines, a huge increase in the disability rates of particularly the employed of the country, and the numbers just keep getting worse and worse.\" <a href=\"https://t.co/wmdVbRyf3L\">pic.twitter.com/wmdVbRyf3L</a></p>\n<p>— The Vigilant Fox 🦊 (@VigilantFox) <a href=\"https://twitter.com/VigilantFox/status/1635330030845980673?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The seeds of these wild oats each have two bristles called awns. Once the seeds fall to the ground their awns help them do something truly extraordinary…they walk</p>\n<p>[full video, BBC Earth: <a href=\"https://t.co/eiDs3Mo3nU\">https://t.co/eiDs3Mo3nU</a>]<a href=\"https://t.co/5DhstVPU4q\">pic.twitter.com/5DhstVPU4q</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1635239512459853824?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Good Morning from the Golden Retriever Channel.  Big and tiny friends- start sweet fun. Who said good things don't come in small packages🤷‍♀️<a href=\"https://twitter.com/hashtag/dogsarefamily?src=hash&amp;ref_src=twsrc%5Etfw\">#dogsarefamily</a> <a href=\"https://twitter.com/hashtag/katsaretoo?src=hash&amp;ref_src=twsrc%5Etfw\">#katsaretoo</a> <a href=\"https://twitter.com/hashtag/cutenessoverload?src=hash&amp;ref_src=twsrc%5Etfw\">#cutenessoverload</a> <br/>(Retriever.society IG)<a href=\"https://twitter.com/hashtag/goodmorningtwitterworld?src=hash&amp;ref_src=twsrc%5Etfw\">#goodmorningtwitterworld</a> <a href=\"https://t.co/DgBsLJfddl\">pic.twitter.com/DgBsLJfddl</a></p>\n<p>— Golden Retriever Channel (@GoldretrieverUS) <a href=\"https://twitter.com/GoldretrieverUS/status/1635226717806813185?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Incredible though it may seem now here’s how virtually no-one at Paramount had faith in THE GODFATHER (1972), Coppola, Brando, Pacino, it being set in the 1940’s or even New York as the location. </p>\n<p>Thank god the NON-Creative bean counter execs lost out.</p>\n<p> <a href=\"https://t.co/CwRImmBqgH\">pic.twitter.com/CwRImmBqgH</a></p>\n<p>— Michael Warburton (@MichaelWarbur17) <a href=\"https://twitter.com/MichaelWarbur17/status/1635278640505290756?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">A black heron using its wings like an umbrella, creating shade to attract fish, a behavior known as “canopy feeding”. <a href=\"https://t.co/tLbctyArpG\">pic.twitter.com/tLbctyArpG</a></p>\n<p>— Buitengebieden (@buitengebieden) <a href=\"https://twitter.com/buitengebieden/status/1635389480390782976?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Building a small cave shelter in the woods.  The simple life 🌲🌲 <a href=\"https://t.co/aOIOO1JSKb\">pic.twitter.com/aOIOO1JSKb</a></p>\n<p>— H0W_THlNGS_W0RK (@HowThingsWork_) <a href=\"https://twitter.com/HowThingsWork_/status/1635389575119147009?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.tate.org.uk/art/artworks/anquetin-girl-reading-a-newspaper-n03690", "https://www.azerbaycan24.com/en/kremlin-explains-its-only-option-in-ukraine/", "https://www.azerbaycan24.com/en/doubts-in-ukraine-about-readiness-to-mount-offensive-washington-post/", "https://tass.com/world/1587701", "https://www.azerbaycan24.com/en/germany-is-not-an-independent-nation-moscow/", "https://tass.com/politics/1587711", "https://www.azerbaycan24.com/en/hungarian-defense-minister-europe-can-send-troops-to-ukraine/", "https://tass.com/world/1587723", "https://www.theepochtimes.com/jan-6-attorney-alleges-fbi-criminally-altered-evidence-requests-special-master-review-of-leaked-messages_5117377.html", "https://tass.com/world/1587683", "https://kunstler.com/clusterfuck-nation/money-troubles/", "https://market-ticker.org/akcs-www?post=248301", "https://www.senecaeffect.com/2023/03/are-evil-gods-returning-or-is-evil-is.html", "https://jonathanturley.org/2023/03/13/post-decency-politics-house-democrats-used-a-hearing-to-attack-both-free-speech-and-a-free-press/", "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "https://t.co/jNJLIybvgl", "https://twitter.com/VacSafety/status/1635258324592754691?ref_src=twsrc%5Etfw", "https://t.co/AYUBl0aB6W", "https://twitter.com/ThorDeplorable/status/1634898813855866881?ref_src=twsrc%5Etfw", "https://twitter.com/RobertKennedyJr?ref_src=twsrc%5Etfw", "https://twitter.com/jimmy_dore?ref_src=twsrc%5Etfw", "https://t.co/qavCdjUafs", "https://t.co/Y5aWcNxg0V", "https://twitter.com/KanekoaTheGreat/status/1635418049187840001?ref_src=twsrc%5Etfw", "https://t.co/xgYaeQ44j3", "https://twitter.com/mazemoore/status/1635334104039432192?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/kremlin-explains-its-only-option-in-ukraine/", "https://t.co/SKme3QbB6N", "https://twitter.com/dana916/status/1635321905426178058?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/kremlin-explains-its-only-option-in-ukraine/", "https://www.azerbaycan24.com/en/doubts-in-ukraine-about-readiness-to-mount-offensive-washington-post/", "https://www.azerbaycan24.com/en/doubts-in-ukraine-about-readiness-to-mount-offensive-washington-post/", "https://tass.com/world/1587701", "https://tass.com/world/1587701", "https://www.azerbaycan24.com/en/germany-is-not-an-independent-nation-moscow/", "https://www.azerbaycan24.com/en/germany-is-not-an-independent-nation-moscow/", "https://tass.com/politics/1587711", "https://tass.com/politics/1587711", "https://www.azerbaycan24.com/en/hungarian-defense-minister-europe-can-send-troops-to-ukraine/", "https://www.azerbaycan24.com/en/hungarian-defense-minister-europe-can-send-troops-to-ukraine/", "https://tass.com/world/1587723", "https://tass.com/world/1587723", "https://www.theepochtimes.com/jan-6-attorney-alleges-fbi-criminally-altered-evidence-requests-special-master-review-of-leaked-messages_5117377.html", "https://www.theepochtimes.com/jan-6-attorney-alleges-fbi-criminally-altered-evidence-requests-special-master-review-of-leaked-messages_5117377.html", "https://tass.com/world/1587683", "https://tass.com/world/1587683", "https://kunstler.com/clusterfuck-nation/money-troubles/", "https://kunstler.com/clusterfuck-nation/money-troubles/", "https://market-ticker.org/akcs-www?post=248301", "https://market-ticker.org/akcs-www?post=248301", "https://www.senecaeffect.com/2023/03/are-evil-gods-returning-or-is-evil-is.html", "https://www.senecaeffect.com/2023/03/are-evil-gods-returning-or-is-evil-is.html", "https://jonathanturley.org/2023/03/13/post-decency-politics-house-democrats-used-a-hearing-to-attack-both-free-speech-and-a-free-press/", "https://jonathanturley.org/2023/03/13/post-decency-politics-house-democrats-used-a-hearing-to-attack-both-free-speech-and-a-free-press/", "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "https://twitter.com/You3_JP?ref_src=twsrc%5Etfw", "https://t.co/NniFp1qScw", "https://twitter.com/NiemandsKnegt/status/1635368249943814144?ref_src=twsrc%5Etfw", "https://twitter.com/DowdEdward?ref_src=twsrc%5Etfw", "https://t.co/wmdVbRyf3L", "https://twitter.com/VigilantFox/status/1635330030845980673?ref_src=twsrc%5Etfw", "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "https://t.co/eiDs3Mo3nU", "https://t.co/5DhstVPU4q", "https://twitter.com/Rainmaker1973/status/1635239512459853824?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/dogsarefamily?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/katsaretoo?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/cutenessoverload?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/goodmorningtwitterworld?src=hash&ref_src=twsrc%5Etfw", "https://t.co/DgBsLJfddl", "https://twitter.com/GoldretrieverUS/status/1635226717806813185?ref_src=twsrc%5Etfw", "https://t.co/CwRImmBqgH", "https://twitter.com/MichaelWarbur17/status/1635278640505290756?ref_src=twsrc%5Etfw", "https://t.co/tLbctyArpG", "https://twitter.com/buitengebieden/status/1635389480390782976?ref_src=twsrc%5Etfw", "https://t.co/aOIOO1JSKb", "https://twitter.com/HowThingsWork_/status/1635389575119147009?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2023-03-14T09:20:06+00:00"}