{"result_id": "285009", "URL": "https://www.theautomaticearth.com/forums/topic/debt-rattle-march-31-2023/page/2/", "timestamp": "2023-04-25 17:16:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/forums/topic/debt-rattle-march-31-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle March 31 2023", "cleaned_text": "I have been rather skeptical of the current media narrative of the Ukraine running out of cannon fodder. Right now many Ukrainian soldiers are currently on leave/vacation. That doesn’t sound like a shortage of cannon fodder. The last Ukrainian mobilization supposedly raised 500,000 new cannon fodder. So if the Ukraine only loses 500 soldiers a day, it would take the Russians another 3 years to destroy them all. The Ukraine still has another 3 to 4 million men left to mobilize. The US is planning for a very long war. They have been very busy repainting national guard military equipment from desert tan to summer green/olive colors and then shipping to US coastal ports. They have even been taking US 9military museum artillery piece5s too. Until the mud dries up, there will be no spring offensive. Wagner forces are now using over a meter long 120 mm laser guided mortars. This has greatly reduced the use of both dumb mortar and artillery shells while getting the job done. These new mortar shells can even hit military vehicles safely hiding behind buildings. Ukrainians are doing a really good job of messing up Elon Musk’s Skylink terminals, that cost more in the Ukraine than in the Eu. They buy units in the EU, then try returning them to get their money back. They send them to the Ukraine where hapless buyers then discover they don’t work. Ukrainian corruption still works outside of the Ukraine for Ukrainians!\n\n“Antibody Dependent Enhancement (ADE) which explains why boosted patients are 50 per cent more likely to catch Covid after their vaccination than those who refuse.” — “the booster is worse than no vaccine at all as it induces T-cell suppression and antibody class switching which is why I and my colleagues throughout the world are seeing an explosive rise of cancer relapses in boosted cancer patients.” — “there are more Yellow Cards for Covid vaccines than all the other vaccines over 50 years.” — Angus Dalgleish is a UK Oncology Consultant at St Thomas Hospital in London\n\nThe whole Ukronazi Clusterfuck and it ‘escalating to tactical nuclear weapons’ hinges on whether you believe there is any integrity left in the Military Industrial Mafia who would flat out refuse to launch them if given an order by the Presidementia OR the Pentagon’s Joint Chiefs of Staff. If you don’t have any faith there are some ‘White Hats’ left in the Empire of Lies military:\n\n \n\n You Are Dead Meat Cause the Blood Drinking Satanists piloting the plane are phucking psycho. They have no reverse gear, only the double-down compulsive gambler thing. They are as bad if not worse than drug addicts At least most junkies just end up killing themselves and we’re done with them. Gambling addicts bankrupt themselves, then steal from their families, bankrupt them, their parents, their children, their aunts, uncles and cousins, then eventually their friends. Then finally for not paying off their gambling debt, they get a bullet to the head and a shallow grave in the woods. Let’s hope they get their spot in the woods soon. Cookies ‘Fuck the EU’ Nuland, this one’s for you!\n\nMy understanding is the guy trains female weight lifters and did this FOR his students. The comments are horrifying, hilarious, thoughtful. Better than the article itself. A sample I love it. Just curb-stomp every actual female sports record into the dirt. This is the end result of the Feminist movement. Are you happy, ladies? Did you get everything that you struggled so hard for? Sure while thousands of female athletes have trained throughout high school, college and some even into the Olympics only to look down the swim lane and see a burly guy with a **** in his swimsuit. Think about the message of defeatism you’d be sending to all those aspiring young women. You clearly don’t have children otherwise you’d get it. Women (esp. young single women) are largely to blame for this mess. They are one of the most reliable (D) voting blocks. As I search all of my pockets I realize I have basically zero fvcks to give. I hope more men like this step up until there are no biological women left in “women’s sports”. It becomes obvious that if we are all to become equals, all competition needs to end. There used to be a name for that type of system… what was it again? He is using sarcasm to make a point. He made the whole world laugh at Canadian liberals, and he risked his job to do that. Previously he had complained that these liberals are destroying women’s sports in Canada and no one listened. We were promised the Jetsons and we got the Flintstones. Now you know why we never see time travelers PUT THE WEIGHTS IN THE ARTICLE FOR GOODNESS SAKES. Journalism is dead. It was in kilograms. Nobody could understand.\n\nThe small banks are also relatively sound, but due to the basic structure, ANY raise in rates MUST destroy them all. They will only go bust if they have to sell those bonds. While they don’t have to sell them, the loss is just a number on their books. Of course it should impact their margin calls – don’t know how that works for regional retail banks. Anyway, the whole idea seems to be to prevent the banks from having to sell, thereby putting off the day of truth when the rubber hits the road and the bonds are worth even less and the collapse is even faster. Avoid the sell.\n\nWe can examine the Western Empire at every level of its operational identity, from the finest grain legal detail of economic practices and accounting , to the broadest brush generalization about “how do you feel about the direction our society is currently heading”. No matter which institution you examine, or the level of detail at which you examine it, the answer comes back the same. It is catastrophically failing at every level . . . . EXCEPT one. Luckily that one metric is the most important one. It is the one on which all of the others will be ultimately determined. It is the the measure of the number of people newly waking up to increased states of awareness, in comparison to the number going back to sleep. I see fewer sleepers, and more wakers.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle March 31 2023 - The Automatic Earth", "description": "Pablo Picasso Dora Maar au chat 1941   • NYT: Donald Trump Has Been Indicted (Techno Fog) • The Impact of Sanctions on the De-Dollarization of In[See the full post at: Debt Rattle March 31 2023]", "url": "https://www.theautomaticearth.com/forums/topic/debt-rattle-march-31-2023/", "site_name": "The Automatic Earth"}, "tags": ["#132487", "#132494", "#132492", "3 weeks, 3 days ago", "#132484", "#132493", "#132480", "#132485", "#132490", "#132486", "#132491", "#132482", "#132488", "#132489", "#132483", "←", "1", "#132495"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The BBC suddenly cares if you were damaged by, or died from, an <a href=\"https://twitter.com/hashtag/AstraZeneca?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\">#AstraZeneca</a> jab.🤔 Not long ago they were safe and effective, how strange .. <a href=\"https://twitter.com/hashtag/BBCLookNorth?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\">#BBCLookNorth</a> <a href=\"https://twitter.com/hashtag/Covid19UK?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\">#Covid19UK</a> <a href=\"https://twitter.com/hashtag/Covid19Vaccine?src=hash&amp;ref_src=twsrc%5Etfw\" rel=\"nofollow\">#Covid19Vaccine</a> <a href=\"https://t.co/WB2ABW1Gtp\" rel=\"nofollow\">pic.twitter.com/WB2ABW1Gtp</a></p>\n<p>— Covid &amp; Globe Apostate (@darkagenda) <a href=\"https://twitter.com/darkagenda/status/1640625929390026752?ref_src=twsrc%5Etfw\" rel=\"nofollow\">March 28, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">WAR ON HUMANITY: Bill Gates, Anthony Fauci, Tedros Ghebreyesus, Alex Azar, Ralph Baric, Peter Daszak, Drosten, Klaus Schwab, Rockefellers, Rothschilds, the DOD and others, declared war on humanity through a fraudulent pandemic to force inject the world with a lethal injection.… <a href=\"https://t.co/D4QUp5OFt2\" rel=\"nofollow\">pic.twitter.com/D4QUp5OFt2</a></p>\n<p>— Truth Justice ™ (@SpartaJustice) <a href=\"https://twitter.com/SpartaJustice/status/1641542674841731072?ref_src=twsrc%5Etfw\" rel=\"nofollow\">March 30, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "695", "height": "391", "embed_code": "<iframe loading=\"lazy\" title=\"Dirty Harry   Do You Feel Lucky Punk\" width=\"695\" height=\"391\" src=\"https://www.youtube.com/embed/abmULTYJJEg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/abmULTYJJEg?feature=oembed"}], "links": ["https://www.theautomaticearth.com/forums/users/wes/", "https://www.theautomaticearth.com/forums/users/germ/", "https://www.conservativewoman.co.uk/dystopian-world-of-the-preening-vaccine-mongers/", "https://www.theautomaticearth.com/forums/users/germ/", "https://twitter.com/hashtag/AstraZeneca?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/BBCLookNorth?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Covid19UK?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Covid19Vaccine?src=hash&ref_src=twsrc%5Etfw", "https://t.co/WB2ABW1Gtp", "https://twitter.com/darkagenda/status/1640625929390026752?ref_src=twsrc%5Etfw", "https://www.theautomaticearth.com/forums/users/germ/", "https://www.theautomaticearth.com/forums/users/germ/", "https://www.theautomaticearth.com/forums/users/germ/", "https://t.co/D4QUp5OFt2", "https://twitter.com/SpartaJustice/status/1641542674841731072?ref_src=twsrc%5Etfw", "https://www.theautomaticearth.com/forums/users/oroboros/", "https://www.theautomaticearth.com/forums/users/aspnaz/", "https://www.youtube.com/watch?v=Rh2UDLolwH4", "https://www.theautomaticearth.com/forums/users/jb-hb/", "https://www.zerohedge.com/markets/bearded-male-powerlifter-self-identifies-woman-protest-destroys-womens-powerlifting-record", "https://www.theautomaticearth.com/forums/users/oroboros/", "https://www.theautomaticearth.com/forums/users/jb-hb/", "https://www.theautomaticearth.com/forums/users/aspnaz/", "https://www.theautomaticearth.com/forums/users/jb-hb/", "https://www.theautomaticearth.com/forums/users/dbentonsmith/", "https://www.theautomaticearth.com/forums/users/mr-house/", "https://www.zerohedge.com/political/google-co-founder-sergey-brin-other-billionaires-slapped-subpoenas-epstein-lawsuit", "https://www.theautomaticearth.com/forums/users/wes/"], "authors": [], "publish_date": null}