{"result_id": "285019", "URL": "https://www.theautomaticearth.com/tag/vaccine-genocide/", "timestamp": "2023-04-25 17:16:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/vaccine-genocide/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "vaccine genocide Archives", "cleaned_text": "“..if I had to guess, the stock market is going to fall apart in the next week or two.”\n• World War III to Sweep Vaccine Genocide Under the Rug (VF)\n\nNow, with an open Twitter and COVID-19 vaccine compliance down to only 16%, something else appears to be on the horizon — and that something else is World War III. From The Post Millennial: “On Monday, Ukrainian President Volodymyr Zelensky said that if China were to ally itself with Russia in the ongoing war in Ukraine, it would mark the start of World War III. “If China allies itself with Russia, there will be a world war, and I do think China is aware of that,” he stated. Zelensky’s comments came the same day Joe Biden made a surprise visit to Kyiv and pledged another $500 million in aid and further sanctions on Russia. On Monday night, former congresswoman Tulsi Gabbard responded to Zelenksy’s comments saying, “He [Zelenksy] is doing everything he can to bring us [The United States] and NATO into this war.” \n\n Former President Trump on Tuesday released a video expressing, “World War III has never been closer than it is right now.” “These people have been seeking confrontation for a long time, much like the case in Iraq and other parts of the world. And now, we’re teetering on the brink of World War III.” And Luke Rudkowski asked, “Can we please stop racing towards World War III?” in response to a Feb 21 The New York Times piece:\n\n“World War III solves a lot of issues (for the perpetrators),” attested former Blackrock portfolio manager Edward Dowd.“Why is our administration insanely running into a World War III situation?” Dowd asked. He answered, “And I suspect — I’m a cynical guy — that World War III solves a lot of issues: solves the sovereign debt crisis and solves the vaccine murder that’s gone on — wipes a bunch of stuff off the map — and directs everyone’s attention to a world war.” Edward expressed that he hopes he’s wrong, but that scenario is “definitely in play. And the capital markets may be starting to sniff this out.” \n\n He elaborates. “The U.S. Dollar in a World War III situation would go up quite a bit. And the dollar, the DXY, the basket of currencies, bottomed about two weeks ago and is starting to go up. We think it put in a very significant bottom.” But Edward Dowd is not so optimistic about the stock market’s future. “The stock market is on razor’s edge right now. I don’t like to make predictions, but if I had to guess, the stock market is going to fall apart in the next week or two.”\n\n“What Mr. Putin has just told us is that the Kremlin now considers nuclear use condition #2 to be true, today..”\n\nOn Tuesday, February 21st President Putin gave a speech that was expected to be very significant. After it was delivered, however, most pundits said he didn’t say anything we didn’t already know. Most of them focused on his announcement of the withdrawal from the START II treaty. However, he said something far more significant. What Mr. Putin said, when read through the lens of international law, should be chilling to the West. We would do well to remember that Mr. Putin majored in international law. His speech made a legal case against NATO. First he listed, by my count, 30 different ways in which the Western nations have attacked Russia. These included the expansion of NATO to Russia’s borders, support of terrorists in Russia, economic war, terrorist sabotage of the Nordstream Pipeline, financing of the coup and war in Ukraine, directly assisting Ukraine to attack targets in Russia including Russia’s nuclear bombers, and plotting to destroy and partition Russia into pieces. Nestled in the middle of these was an important statement. “This means they plan to finish us once and for all. In other words, they plan to grow a local conflict into a global confrontation. This is how we understand it and we will respond accordingly, because this represents an existential threat to our country.” Putin’s choice of words is extremely significant in light of Russian nuclear doctrine, which states that nuclear weapons could be used by Russia “in response to the use of nuclear and other types of weapons of mass destruction against it or its allies, and also in case of aggression against Russia with the use of conventional weapons when the very existence of the state is threatened.” Among the 30 points of evidence of the American war on Russia, Mr. Putin listed several cases of American use of conventional weapons against Russian territory through Ukraine as the thinly veiled proxy, and stated that this represents an “existential threat to [the Russian State].” What Mr. Putin has just told us is that the Kremlin now considers nuclear use condition #2 to be true, today. This statement was accompanied by two related actions. The day before the speech Russia tested a Sarmat II ICBM. And at the end of the speech, Mr. Putin announced that Russia shall immediately withdraw from the START II treaty, which limits the number and range of their nuclear missiles. These three statements and events together should tell the collective West that Russia has just said “Get off my porch!”, and cocked the forty-five. This doesn’t mean that Russia is going to strike the USA tomorrow morning. But, we are definitely now teetering on the cliff’s edge of nuclear war.\n\n“Even before the start of the SMO, there were negotiations…on the supply of air defense systems… We remember Kyiv’s attempts to obtain nuclear weapons.”\n\nRussian President Vladimir Putin’s much awaited address to the Russian Federal Assembly on Tuesday should be interpreted as a tour de force of sovereignty.The address, significantly, marked the first anniversary of Russia’s official recognition of the Donetsk and Luhansk People’s Republics, only a few hours before 22 February, 2022. In myriad ways, what happened a year ago also marked the birth of the real, 21st century multipolar world. Then two days later, Moscow launched the Special Military Operation (SMO) in Ukraine to defend said republics. Cool, calm, collected, without a hint of aggression, Putin’s speech painted Russia as an ancient, independent, and quite distinct civilization – sometimes following a path in concert with other civilizations, sometimes in divergence. Ukraine, part of Russian civilization, now happens to be occupied by western civilization, which Putin said “became hostile to us,” like in a few instances in the past. So the acute phase of what is essentially a war by proxy of the west against Russia takes place over the body of Russian civilization. That explains Putin’s clarification that “Russia is an open country, but an independent civilization – we do not consider ourselves superior but we inherited our civilization from our ancestors and we must pass it on.” A war dilacerating the body of Russian civilization is a serious existential business. Putin also made clear that “Ukraine is being used as a tool and testing ground by the west against Russia.” Thus the inevitable follow-up: “The more long-range weapons are sent to Ukraine, the longer we have to push the threat away from our borders.” Translation: this war will be long – and painful. There will be no swift victory with minimal loss of blood. The next moves around the Dnieper may take years to solidify. Depending on whether US policy continues to cleave to neo-con and neoliberal objectives, the frontline may be displaced to Lviv. Then German politics may change. Normal trade with France and Germany may be recovered only by the end of the next decade. All that brings us to the games played by the Empire of Lies. Says Putin: “The promises…of western rulers turned into forgery and cruel lies. The west supplied weapons, trained nationalist battalions. Even before the start of the SMO, there were negotiations…on the supply of air defense systems… We remember Kyiv’s attempts to obtain nuclear weapons.” Putin made it clear, once again, that the element of trust between Russia and the west, especially the US, is gone. So it’s a natural decision for Russia to “withdraw from the treaty on strategic offensive weapons, but we don’t do it officially. For now we are only halting our participation to the START treaty. No US inspections in our nuclear sites can be allowed.”\n• Russia Sees Events In Ukraine As War With West For Survival – Envoy (TASS)\n\n“Our opponents have not yet gotten over their futile illusions of defeating a nuclear power..”\n• Talks Should Be Held With Washington, Not Kiev – Russian UN Envoy (TASS)\n\nIn way over his head.\n\nNATO Secretary General Jens Stoltenberg has claimed that China is preparing to step up its support for Russia, saying the People’s Republic may seek to back Moscow’s efforts in Ukraine. Beijing rejected the charge, calling it “groundless speculation.” Speaking to the Associated Press for an interview on Wednesday, Stoltenberg was asked whether the US-led military bloc had seen any indication that China might provide weapons or other assistance to Russia. “We have seen some signs that they may be planning for that, and of course NATO allies, the United States, have been warning against it because this is something that should not happen,” he said, insisting Beijing must not take any role in the conflict in Ukraine. The NATO chief went on to argue that the alliance is “no party” to the hostilities, even while stressing that it would support Kiev for “as long as it takes” in order to “ensure that Ukraine prevails.” China was quick to respond to Stoltenberg’s comments, with Foreign Ministry spokesman Wang Wenbin stating that his country “stands on the side of peace” in regard to Ukraine, while accusing the NATO head of “smears” and “groundless speculation.” “It is a known fact that NATO countries, including the US, are the biggest source of weaponry for the battlefield in Ukraine, yet they keep claiming that China may be supplying weapons to Russia,” Wang told reporters during a Wednesday press briefing. “This is a familiar trick used and exposed soon after the Ukraine crisis broke out.” The spokesman added that while NATO claims to be a “regional defensive alliance,” it has frequently “ignored others’ security concerns” and “constantly sought to reach beyond its traditional defense zone.” Officials in Washington and other Western countries have also alleged that China could soon boost assistance for Russia, with US Secretary of State Antony Blinken recently warning such support would be a “serious problem.” An unnamed European official reached by the AP claimed to have “unambiguous” intelligence showing that Beijing is considering supplying weapons, but said it is unclear whether any decision had been made. To date, officials have provided no evidence to support the allegations. Beijing has refused to condemn Moscow’s military action in Ukraine and continues to keep good ties with the Russian Federation. Last week, Chinese State Councilor Wang Yi announced that the People’s Republic was working on a peace proposal to end the conflict, but the details of the plan have yet to be revealed. While Wang visited the Russian capital for a meeting with President Vladimir Putin on Wednesday, the proposal was not discussed, according to Foreign Ministry spokeswoman Maria Zakharova.\n\n“It was a secret war within a secret war,” Hersh wrote, adding that at least two Navy SEALs were wounded on these missions, and received the Medal of Honor in secret.” Six decades before Norway helped the CIA destroy the Nord Stream gas pipelines, it gave the agency heavily-armed boats that it used to target North Vietnam, investigative journalist Seymour Hersh wrote on Wednesday. Norway’s involvement in this secret war was deeper than previously reported, Hersh claimed. Hersh, a Pulitzer Prize-winning investigative journalist, claimed earlier this month that the CIA sabotaged the Nord Stream lines on President Joe Biden’s orders. The Norwegian Secret Service and Navy reportedly helped CIA divers choose the correct spot to plant the explosives, and ferried the Americans out on a boat to the location, near Denmark’s Bornholm island in the Baltic Sea. Explaining why the US chose Norway as its partner in destroying the Russia-to-Germany gas lines, Hersh said on Wednesday that the “Norwegian Navy has a long and murky history of cooperation with American intelligence.” Historical reports show that Norway sold a number of fast attack boats to the US Navy, which were used by the CIA to conduct clandestine attacks along the North Vietnamese coast. By 1964, prior to the US’ official entry into the Vietnam war, at least two Norwegian sailors had confessed to taking part in these raids, while unconfirmed reports claimed that Norwegian officers and crew manned some of these boats. However, according to Hersh’s source “within the intelligence community,” the CIA was given more boats than previously reported. Manned and captained by Norwegian sailors, these vessels carried US Navy SEALs to missions against “far more aggressive targets that included heavily defended North Vietnamese radar facilities.” While the CIA’s previously reported clandestine attacks were controlled by the American command in Saigon, these more aggressive missions were commanded by the Joint Chiefs of Staff in Washington. “It was a secret war within a secret war,” Hersh wrote, adding that at least two Navy SEALs were wounded on these missions, and received the Medal of Honor in secret. “This bit of top secret and heretofore unknown history raises, to this reporter, an obvious question: what else do we not know about the secret operation in Norway that led to the destruction of the pipelines?” Hersh concluded. The Biden administration has described Hersh’s reporting on the Nord Stream explosions as “utterly false and complete fiction.” Moscow considers the destruction of Nord Stream an act of “terrorism,” and Russia’s ambassador to the UN, Vassily Nebenzia, argued this week that Hersh’s reporting was “more than a smoking gun” suggesting US involvement. Prior to Hersh’s initial article, Russian President Vladimir Putin blamed the explosions on the West, arguing that the US in particular benefited from the attack due to its position as a supplier of LNG to Europe. No, this will not go away. The West is opposed to a transparent investigation into the attack on the Nord Stream pipelines, Russian presidential spokesman Dmitry Peskov said on Wednesday. Earlier this week, Moscow’s ambassador to the UN, Vassily Nebenzia, argued that evidence of Washington’s involvement was “more than a smoking gun.” Peskov claimed that “the need for a thorough and transparent investigation” contrasted with the aims of Western countries that would rather let the mystery go unsolved. “We see a brick wall of unwillingness from the collective West [for a transparent investigation]. Quite the opposite, we see their desire to avoid the question and gradually let it fade away into the sand,” he added. Peskov insisted the incident should be classified as “a terrorist attack towards energy infrastructure, critically important for the European continent.” According to the Kremlin spokesman, those suspicions were backed by “some surprisingly rather detailed investigations towards who was behind the sabotage.” Nord Stream comprised a set of two 1,200km natural gas pipelines stretching along the bottom of the Baltic Sea between Russia and Germany. On September 26, 2022, the pipelines were rocked by a series of underwater explosions. The incident occurred in the international waters and shut off the supply of natural gas to Germany. The blasts occurred during widespread discussions about limiting gas shipments from Russia to Europe as a response to the conflict in Ukraine. Earlier this month, Pulitzer Prize-winning journalist Seymour Hersh claimed the sabotage was a “covert sea operation” planned and executed by the US with assistance from Norway. The reporter cited an anonymous source “with direct knowledge of the operational planning.” The US denied those claims, with White House National Security Council spokeswoman Adrienne Watson calling them “utterly false and complete fiction.” Denmark, Germany, and Sweden are currently investigating the incident. Peskov called Russia’s exclusion from their ongoing probe detrimental to “establishing the truth and determining responsibility.” On Tuesday, the Russian and Chinese ambassadors to the UN demanded a transparent international investigation into the matter. \"Sweden has perhaps the most to tell the world about the [Nord Stream] crime scene, which its divers investigated. Yet instead of sharing this information globally, Sweden has kept the results of its investigation secret…\" pic.twitter.com/1R4zGwKeA8 They await the official presentation. Russian Foreign Minister Sergey Lavrov and Chinese State Councilor Wang Yi did not discuss Beijing’s yet-to-be-unveiled peace proposal for the ongoing conflict between Moscow and Kiev, the ministry spokeswoman, Maria Zakharova, told reporters on Wednesday. “Our Chinese partners explained their thoughts on the root causes of the Ukrainian crisis, as well as their approaches to its political resolution,” she said. The official added “there were no talks of any specific ‘plan’.” Wang first mentioned his “peace proposal” at the Munich Security Conference last week. “We will put forth China’s position on the political settlement of the Ukraine crisis,” the diplomat announced. Wang warned that he knew that “some forces might not want to see peace talks materialize” without naming any party in particular. Chinese Foreign Ministry spokesman Wang Wenbin also commented on the peace proposal at the Monday press briefing. “The international community is fully aware who is calling for dialogue and striving for peace, and who is fanning the flames and stoking confrontation,” the diplomat said. He then encouraged the US to “seriously reflect on the role it has played” in the Ukrainian conflict so far. On Tuesday, Chinese Ambassador to the UN Zhang Jun said that a “position paper” with China’s consistent views on the conflict would be released “within days.” Ukrainian President Vladimir Zelensky commented on the plan during a press conference on Tuesday, saying that he had his own “peace formula” supported by a large number of states. Zelensky was apparently referring to the so-called ‘10-point peace plan’ that was presented by him at the G20 summit in November. Russian President Vladimir Putin said on Wednesday that Moscow anticipated a visit by Chinese President Xi Jinping once Beijing had completed items on its domestic agenda. “We assume that we will realize our plans regarding face-to-face meetings, which will give an additional boost to our relations,” Putin added. He hanged AND shot himself. And then ate the gun? “Ammunition and a gun case were found in Middleton’s vehicle — but the weapon itself never turned up.” The sheriff’s report on the disturbing scene where a top Bill Clinton advisor with ties to Jeffrey Epstein was found shot and hanged from a tree has finally been released, prompting sleuths to question why the death was ruled a suicide. Mark Middleton, 59, was a special advisor to the former president in the 1990s, authorizing Epstein’s visits to the White House seven out of the 17 times the infamous pedophile met with top government officials there. Additionally, he was also on the flight logs of Epstein’s private jet. According to the Perry County sheriff’s office, Middleton was found dead on May 7, 2022 with a gunshot wound to his chest and an extension cord tying his neck to a tree in Perryville, Arkansas. \n\n As obtained by the Daily Mail, Sheriff’s Deputy Jeremy Lawson’s firsthand report on the mysterious death claims that “I could see what at first appeared to be a man sitting near a tree, as my eyes focused better, I could see a rope of some type going from the tree limb to the male.” Middleton’s body was found at the Heifer Ranch, after worker Samantha McElroy called police after finding Middleton’s abandoned black BMW SUV at the property. “I could see that he had a gunshot wound to the chest and that he had a knot tied in an extension cord that was around his neck and it was attached to the limb directly above him,” Lawson added. Ammunition and a gun case were found in Middleton’s vehicle — but the weapon itself never turned up. Despite the confusing details of the case, Sheriff Scott Montgomery said Middleton had apparently shot himself in the chest with a shotgun and also somehow hung himself, reported the Arkansas Times. According to the outlet, the late presidential advisor’s family said he “was being treated for depression” before his death. Despite unsealing the sheriff deputy’s report nine months after Middleton’s death, Circuit Judge Alice Gray granted a request from his family to keep the crime scene photos sealed. “The Court finds that since Mr. Middleton’s death, the Middletons have been harassed by individuals with outlandish, hurtful, unsubstantiated, and offensive conspiracy theories regarding Mr. Middleton, his death, and his family, which have caused the Middletons immense harm and anguish,” the decision reads. \n\n “These same individuals have indicated and communicated that they will attempt to obtain the File, including Media Content depicting Mr. Middleton’s body and the scene of his death, by way of an Arkansas Freedom of Information Act (“FOIA”) request,” the judge continued. “The purpose of this Order is to prevent further irreparable injury to the Middletons.” Middleton left the White House in February 1995. The following year, a White House investigation determined that he had “abused his access to impress business clients” leading him to be “barred from the executive mansion without senior approval,” reported the Daily Mail. He has denied those accusations. “..Western capitalist ideology has been so successful in setting material, technological progress as the criterion of “a new civilisation”..”\n• The Crusades of the Virtuous (Hoppe) The cultural hegemony of the unipolar power is particularly visible in its media events: “international” festivals, extravaganzas, gala ceremonies, etc. A glaring example of this is the tireless and desperate placement of the sniffling buffoon Zelensky at almost all the recent “cultural” events… be they the film festivals of Cannes, Venice, Berlin, ceremonies such as the Golden Globe Awards, the Grammys or music festivals such as Glastonbury. Zelensky has now become the obligatory sprig of parsley for every neoliberal dish. A brand has been created of him. He is probably the most widely seen public figure in the world today. He is the icon of the times: a pathetic, empty puppet, pumped with unlimited cash and drugs, posing as an endearing emissary of the world’s conscience. His most recent video appearance at the grand inauguration of the Berlin Film Festival was met with cheers and standing ovations by the entire audience whose applause remained throughout his speech … especially when he declared: “Culture chooses a side when it decides to speak out against evil… and it takes a side when it remains silent and in fact helps the evil.” One of the “highlights” of this self-righteous festival so far is a documentary on Zelensky made by Sean Penn entitled “Superpower”. At the end of its premiere the audience once again rose obsequiously to its feet to give both Penn and his collaborators a standing ovation. Just three years ago the Berlinale greeted war criminal Hillary Clinton as a star. This year’s Berlinale rolled the red carpet out for NATO with full condemnation of their enemies Russia, Iran, China and Belarus; even the mascot – the Berlinale bear – appeared in sky blue and yellow, the Ukrainian national colours. [..] Outside the grand “Berlinale Palast”, climate activists had glued themselves to the legendary Red Carpet. Two days later the same carpet welcomed a silent protest featuring sombre-looking expatriate Iranian actresses in support of the regime-change activists in Iran entitled “Women Life Freedom”. With the exception of Sean Penn’s eulogy of the Ukraine and its jester, there is little press coverage of the films at the festival… Will any be remembered in the future as noteworthy works of art? Because Western capitalist ideology has been so successful in setting material, technological progress as the criterion of “a new civilisation” and in commoditising virtues and morals all over the world, it has become a creed for many to follow… It sets global dictates and trends (e.g.: global warming, gender fluidity, cancel culture, re-adaptations of history, colour revolutions, etc.). And, in the absence of spirituality, many people follow these global trends and dictates religiously in order to secure an “identity” in the modern world. \n\n Unusual friendship between a female grey wolf and a male brown bear. They were spotted every night for 10 days straight, spending several hours together between 8pm to 4am. They would even share food together \n\n The Alpine Ibex’s preferred habitat is the rocky region along the snow line above alpine forests, where it occupies steep, rough terrain at elevations of 1,800 to 3,300 \n\n This couple of sea urchins was discovered by a research vessel near New Caledonia at a depth of 300 m. Photo Steve Jurvetson. Fractals are everywhere. Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "vaccine genocide Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/vaccine-genocide/", "site_name": "The Automatic Earth"}, "tags": ["existential", "excess deaths", "vaccine genocide", "WWIII", "suicide", "Nordstream", "Sy Hersh", "Putin speech"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Tens of thousands of pounds of goods, food, water being delivered to the people of East Palestine, Ohio right now before Trump’s visit. </p>\n<p>Trump paid for all of it. </p>\n<p>Number of goods delivered from the Biden Administration: 0. <a href=\"https://t.co/QQADqZl9Uy\">pic.twitter.com/QQADqZl9Uy</a></p>\n<p>— Benny Johnson (@bennyjohnson) <a href=\"https://twitter.com/bennyjohnson/status/1628469529327071234?ref_src=twsrc%5Etfw\">February 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Dr. Michael Yeadon, ex vice-president Pfizer: We're at the door fo hell <a href=\"https://t.co/FgbVmM6ubH\">pic.twitter.com/FgbVmM6ubH</a></p>\n<p>— Wittgenstein (@backtolife_2023) <a href=\"https://twitter.com/backtolife_2023/status/1628494164437487619?ref_src=twsrc%5Etfw\">February 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Former US Army Colonel Douglas MacGregor says NATO is deeply divided. <a href=\"https://t.co/utHX371AG6\">pic.twitter.com/utHX371AG6</a></p>\n<p>— Hassan Mafi ‏ (@thatdayin1992) <a href=\"https://twitter.com/thatdayin1992/status/1628405054603657217?ref_src=twsrc%5Etfw\">February 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Jeffrey Sachs at UNSC on Nord Stream sabotage</p>\n<p>\"Sweden has perhaps the most to tell the world about the [Nord Stream] crime scene, which its divers investigated. Yet instead of sharing this information globally, Sweden has kept the results of its investigation secret…\" <a href=\"https://t.co/1R4zGwKeA8\">pic.twitter.com/1R4zGwKeA8</a></p>\n<p>— Consortium News (@Consortiumnews) <a href=\"https://twitter.com/Consortiumnews/status/1628429892579893250?ref_src=twsrc%5Etfw\">February 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/M0dmmMf12d\">pic.twitter.com/M0dmmMf12d</a></p>\n<p>— David Wolfe (@DavidWolfe) <a href=\"https://twitter.com/DavidWolfe/status/1628300721929191426?ref_src=twsrc%5Etfw\">February 22, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mj7mauNj8DY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/mj7mauNj8DY"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/odALIkEHesE\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/odALIkEHesE"}], "links": ["https://en.wikipedia.org/wiki/Knossos", "https://dailyclout.io/world-war-iii-appears-imminent-as-the-establishment-attempts-to-sweep-vaccine-genocide-under-the-rug/", "https://thesaker.is/the-dire-significance-of-putins-feb-21-speech/", "https://thecradle.co/article-view/21772/putins-civilizational-speech-frames-conflict-between-east-and-west", "https://tass.com/politics/1580725", "https://tass.com/politics/1580755", "https://www.azerbaycan24.com/en/nato-head-issues-warning-to-china/", "https://www.azerbaycan24.com/en/nord-stream-investigator-recalls-hidden-history-of-us-norway-covert-ops/", "https://www.azerbaycan24.com/en/moscow-takes-aim-at-west-over-nord-stream-sabotage/", "https://www.azerbaycan24.com/en/russia-and-china-didn-t-discuss-beijing-s-peace-plan-moscow/", "https://thepostmillennial.com/epstein-linked-clinton-advisor-allegedly-hanged-himself-from-tree-after-shooting-himself-in-chest-with-shotgun", "https://thesaker.is/the-crusades-of-the-virtuous/", "https://t.co/QQADqZl9Uy", "https://twitter.com/bennyjohnson/status/1628469529327071234?ref_src=twsrc%5Etfw", "https://t.co/FgbVmM6ubH", "https://twitter.com/backtolife_2023/status/1628494164437487619?ref_src=twsrc%5Etfw", "https://t.co/utHX371AG6", "https://twitter.com/thatdayin1992/status/1628405054603657217?ref_src=twsrc%5Etfw", "https://dailyclout.io/world-war-iii-appears-imminent-as-the-establishment-attempts-to-sweep-vaccine-genocide-under-the-rug/", "https://dailyclout.io/world-war-iii-appears-imminent-as-the-establishment-attempts-to-sweep-vaccine-genocide-under-the-rug/", "https://thesaker.is/the-dire-significance-of-putins-feb-21-speech/", "https://thesaker.is/the-dire-significance-of-putins-feb-21-speech/", "https://thecradle.co/article-view/21772/putins-civilizational-speech-frames-conflict-between-east-and-west", "https://thecradle.co/article-view/21772/putins-civilizational-speech-frames-conflict-between-east-and-west", "https://tass.com/politics/1580725", "https://tass.com/politics/1580725", "https://tass.com/politics/1580755", "https://tass.com/politics/1580755", "https://www.azerbaycan24.com/en/nato-head-issues-warning-to-china/", "https://www.azerbaycan24.com/en/nato-head-issues-warning-to-china/", "https://www.azerbaycan24.com/en/nord-stream-investigator-recalls-hidden-history-of-us-norway-covert-ops/", "https://www.azerbaycan24.com/en/nord-stream-investigator-recalls-hidden-history-of-us-norway-covert-ops/", "https://www.azerbaycan24.com/en/moscow-takes-aim-at-west-over-nord-stream-sabotage/", "https://t.co/1R4zGwKeA8", "https://twitter.com/Consortiumnews/status/1628429892579893250?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/moscow-takes-aim-at-west-over-nord-stream-sabotage/", "https://www.azerbaycan24.com/en/russia-and-china-didn-t-discuss-beijing-s-peace-plan-moscow/", "https://www.azerbaycan24.com/en/russia-and-china-didn-t-discuss-beijing-s-peace-plan-moscow/", "https://thepostmillennial.com/epstein-linked-clinton-advisor-allegedly-hanged-himself-from-tree-after-shooting-himself-in-chest-with-shotgun", "https://thepostmillennial.com/epstein-linked-clinton-advisor-allegedly-hanged-himself-from-tree-after-shooting-himself-in-chest-with-shotgun", "https://thesaker.is/the-crusades-of-the-virtuous/", "https://thesaker.is/the-crusades-of-the-virtuous/", "https://t.co/M0dmmMf12d", "https://twitter.com/DavidWolfe/status/1628300721929191426?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}