{"result_id": "285029", "URL": "https://www.theautomaticearth.com/2020/12/95-vaccine-efficacy-not-so-fast/", "timestamp": "2023-04-25 17:16:32 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime, election time, all the time. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2020/12/95-vaccine-efficacy-not-so-fast/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "95% Vaccine Efficacy? Not So Fast", "cleaned_text": "A -short- look at how vaccine makers like Pfizer and Moderna get to claim a 90% or even 95% efficacy for their products, with the help of regular Automatic Earth commenter Doc Robinson (not a medical doctor) and his quotes from the British Medical Journal (BMJ). The way the companies report their efficacy may be normal in their circles, but will, in the “normal” world, be experienced as confusing if not outright misleading.\n\nWhat they do -simplified-, let’s take the Pfizer report, is they have 20,000 volunteers who get a vaccine, in this case 8 are infected, and that gives a result of -well- over 90% efficacy. But that is largely meaningless, because it appears to assume that all remaining 19,992 volunteers would have gotten infected if not for the vaccine.\n\nTo give this meaning, the world of science has long insisted on control groups (placebo groups), in this case also 20,000 strong, who don’t get a vaccine. If you know how many in that group are infected, you know -much better- hoe effective the vaccine is. Turns out, in the control group 86 out of 20,000 were infected. More than 8, but much less than 20,000. 19,914 unvaccinated people never got infected.\n\nThe 90%-95% numbers “measure” relative risk reduction. The absolute risk reduction is completely different. In the Pfizer case, 99.57% of the unvaccinated people did not become infected, while 99.96% of the vaccinated people did not become infected. Therefore, the absolute risk reduction is 99.96% – 99.57% = 0.39%. While there remain many questions swirling around the mid- to long term effects of taking the vaccine.\n\nYou would think this is the most relevant information out there for those thinking about being vaccinated or not, and not the 95% relative risk reduction. But the latter info is what is reported. And sure, it sounds much better.\n\nHere are a few excerpts from British Medical Journal pieces as Doc Robinson selected them earlier this week:\n\n“…leading both companies to claim around 95% efficacy. Let’s put this in perspective. First, a relative risk reduction is being reported, not absolute risk reduction, which appears to be less than 1%. Second, these results refer to the trials’ primary endpoint of covid-19 of essentially any severity, and importantly not the vaccine’s ability to save lives, nor the ability to prevent infection, nor the efficacy in important subgroups (e.g. frail elderly). Those still remain unknown. Third, these results reflect a time point relatively soon after vaccination, and we know nothing about vaccine performance at 3, 6, or 12 months, so cannot compare these efficacy numbers against other vaccines like influenza vaccines (which are judged over a season). Fourth, children, adolescents, and immunocompromised individuals were largely excluded from the trials, so we still lack any data on these important populations. I previously argued that the trials are studying the wrong endpoint, and for an urgent need to correct course and study more important endpoints like prevention of severe disease and transmission in high risk people. Yet…”\n\nModerna’s phase III trial has shown that, so far, the vaccine is 94.5% effective. (Mahase, BMJ 2020;371:m4471, November 17) As with the Pfizer vaccine news release, few numbers are provided, but we can approximate the absolute risk reduction for a vaccinated individual and the Number Needed To Vaccinate (NNTV): There were 90 cases of Covid-19 illness in a placebo group of 15,000 (0.006) and 5 cases in a vaccine group of 15,000 (0.00033). This yields an absolute risk reduction of 0.00567 and NNTV = 176 (1/0.00567). \n\n There were 11 severe illnesses, all in the placebo group, for an absolute risk reduction of 0.00073 and NNTV = 1370. So to prevent one severe illness 1370 individuals must be vaccinated. The other 1369 individuals are not saved from a severe illness, but are subject to vaccine adverse effects, whatever they may be and whenever we learn about them… Shouldn’t absolute risk reduction be reported so individuals can make fully informed decisions about vaccinations?\n\nSome questions about the effectiveness of the Pfizer and Moderna vaccines, from the British Medical Journal BMJ. The “absolute risk reduction” is relatively small and is being downplayed by the vaccine manufacturers. This is a calculation of how much the vaccine reduces the likelihood that a person would become infected.\n\nFor example, if a non-vaccinated person has a 50% chance of becoming infected with a disease, and a vaccinated person has a 10% chance, then the “absolute risk reduction” would be 40%. The absolute risk reductions for the Covid-19 vaccines from Pfizer and Moderna are estimated to be less than 1%.\n\nFor the Pfizer vaccine, it’s only about 0.4% reduction. For the Moderna vaccine, it’s only about 0.6% reduction in the risk of having a detectable infection (and less than 0.1% reduction in the risk of getting a “severe” infection).\n\nThus, for the Moderna vaccine “to prevent one severe illness 1370 individuals must be vaccinated. The other 1369 individuals are not saved from a severe illness, but are subject to vaccine adverse effects, whatever they may be and whenever we learn about them.”\n\n94 cases in a trial that has enrolled about 40,000 subjects: 8 cases in a vaccine group of 20,000 and 86 cases in a placebo group of 20,000. This yields a Covid-19 attack rate of 0.0004 in the vaccine group and 0.0043 in the placebo group. Relative risk (RR) for vaccination = 0.093, which translates into a “vaccine effectiveness” of 90.7% [100(1-0.093)]. This sounds impressive, but the absolute risk reduction for an individual is only about 0.4% (0.0043-0.0004=0.0039). \n\n The Number Needed To Vaccinate (NNTV) = 256 (1/0.0039), which means that to prevent just 1 Covid-19 case 256 individuals must get the vaccine; the other 255 individuals derive no benefit, but are subject to vaccine adverse effects, whatever they may be and whenever we learn about them……We’ve already heard that an early effect of the vaccine is “like a hangover or the flu.” Will vaccinees who are later exposed to coronaviruses have more severe illness as a result of antibody-dependent enhancement of infection (ADEI), a known hazard of coronavirus vaccines? Is there squalene in the Pfizer vaccine? If so, will vaccinees be subject to autoimmune diseases, like Gulf War Syndrome and narcolepsy that have been associated with the adjuvant?\n\nWhen Pfizer said its vaccine may be “more than 90% effective” this meant that during the vaccine trial, 8 people (out of 20,000) in the vaccinated group became infected, while 86 people (out of 20,000) in the placebo group became infected, giving an effectiveness of 90.7% (based on the relative risk reduction, not the absolute risk reduction). If 80% of these trial participants were already immune prior to this trial, then the non-immune people would be 20% (or 4,000 in each group), and the “effectiveness” based on relative risk reduction to the non-immune people would still be 90.7%.\n\nImagine a vaccine trial where the entire population of the United States participates, with half the people getting the vaccine and half getting a placebo. If only 86 unvaccinated people (out of 165 million unvaccinated) become infected, while 8 vaccinated people (out of 165 million vaccinated) become infected, then the trial result would still be “more than 90% effective” even though the infection rates are such a tiny percentage of the population.\n\nTo me, these are the more relevant numbers coming out of that Pfizer trial:\n\n 99.57% of the unvaccinated people did not become infected.\n\n 99.96% of the vaccinated people did not become infected.\n\n Absolute risk reduction = 99.96% – 99.57% = 0.39%\n\nErgo, to reduce our risk of getting infected by 0.4% or 0.6%, we will now all have to be vaccinated and carry vaccination passports with us if we want to be part of “regular” society, even as the Pfizer CEO himself admitted the company has no idea whether being vaccinated provides us with any protection from infecting others. Excuse me?\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site.\n\nClick at the top of the sidebars for Paypal and Patreon donations. Thank you for your support.\n\nSupport the Automatic Earth in virustime, election time, all the time. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "95% Vaccine Efficacy? Not So Fast - The Automatic Earth", "description": "Support the Automatic Earth in virustime, election time, all the time. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2020/12/95-vaccine-efficacy-not-so-fast/", "site_name": "The Automatic Earth", "article:published_time": "2020-12-06T14:13:18+00:00", "article:modified_time": "2020-12-06T14:13:21+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/12/GiorgiodeChiricoPiazzaDItalia1913-650.jpg"}, "tags": ["Covid19", "Moderna", "control group", "vaccines", "Pfizer", "absolute risk reduction", "placebo", "relative risk reduction"], "tweets": [], "movies": [], "links": ["https://www.wikiart.org/en/giorgio-de-chirico/piazza-d-italia-1913", "https://www.theautomaticearth.com/2020/12/pcr-tests-and-covid-vaccines-are-useless/#post-66273", "https://blogs.bmj.com/bmj/2020/11/26/peter-doshi-pfizer-and-modernas-95-effective-vaccines-lets-be-cautious-and-first-see-the-full-data/", "https://www.theautomaticearth.com/2020/12/pcr-tests-and-covid-vaccines-are-useless/#post-66306", "https://www.bmj.com/content/371/bmj.m4471/rr-0", "https://www.theautomaticearth.com/2020/12/pcr-tests-and-covid-vaccines-are-useless/#post-66306", "https://www.bmj.com/content/371/bmj.m4347/rr-4", "https://www.theautomaticearth.com/2020/12/pcr-tests-and-covid-vaccines-are-useless/#post-66409", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2020-12-06T14:13:18+00:00"}