{"result_id": "285013", "URL": "https://www.theautomaticearth.com/tag/vaccine-injury-payouts/", "timestamp": "2023-04-25 17:16:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/vaccine-injury-payouts/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Vaccine Injury Payouts Archives", "cleaned_text": "Bank accounts have already been frozen and people have been arrested, under the Emergencies Act. Which the House of Commons and the Senate must vote on first. If they vote it down, it’s null and void. But then the damage will have been done.\n• Civil Liberties Group Files Court Action Against Use of Emergencies Act (CP)\n\nThe federal government faced a constitutional challenge Thursday over its historic invocation of the Emergencies Act, as police began to move on protesters with large trucks paralyzing the heart of the national capital. Prime Minister Justin Trudeau said using the emergencies law was a measure of last resort to bring an end to the illegal and undemocratic blockades that had harmed Canadians for nearly three weeks. He made the remarks during debate in the House of Commons over his government’s decision to use the law for the first time since its introduction in 1988. The Conservatives accused the prime minister of failing to try to de-escalate the conflict before turning to emergency powers. Trudeau said using the act was not the first, second or even third choice of the government. “We did it to protect families and small businesses, to protect jobs and the economy,” the prime minister said. “We did it because the situation could not be dealt with under any other law in Canada.” Hours later, the federal government was told it would face court action over its decision, as the Canadian Civil Liberties Association announced it was seeking a judicial review of the government’s invocation of the act. The group said at a Toronto news conference it did not want to minimize the effects of the protests across the country, but added it was unclear that the demonstrations endanger the lives, health or safety of Canadians so seriously that they constitute a national emergency. “The government has brought in an extreme measure that should be reserved for national emergencies, a legal standard that has not been met. Emergency powers cannot and must not be normalized,” said Noa Mendelsohn Aviv, the civil liberties association’s executive director. Police deal with complex law-enforcement issues every day and have cleared multiple border blockades across the country without emergency powers, the association said. The group’s criminal justice director, Abby Deshman, said the Emergencies Act orders do not apply only in Ottawa and actually affect the rights of every Canadian. The group believes the measures are clearly unconstitutional and it will be asking the courts to step in to defend the rule of law and the constitutional rights of all people across the country, she said. “Local police across this country have cleared several highly disruptive border blockades and are successfully managing numerous other protesters in communities across the country, all without emergency powers,” Deshman said. Through the Emergencies Act, new powers have been granted to freeze bank accounts of protest participants and bar people from assembling in specific places or joining protests that threaten trade, critical infrastructure, individuals or property. It is also now illegal to bring children to within 500 metres of the blockades or provide supplies or property to participants. The new powers took effect earlier this week but the House of Commons and the Senate must both vote to confirm use of the emergencies law. The House debate will continue through the weekend and Monday with a vote planned for 8 p.m. ET that day. If the motion fails, the act will be suspended immediately. [..] Deputy Prime Minister Chrystia Freeland said at a news conference bank accounts had already been frozen and more will be put on hold in the coming days. But she refused to say how many, or even declare if accounts could be frozen for people who aren’t participating in the blockade but who donated to the convoy’s various online fundraisers.\n\n“..this exemption requires a ministerial invitation and had been “rarely used.”\n\nUnvaccinated truckers bringing COVID-19 vaccines and medical devices into Canada to combat the pandemic are exempt from testing and quarantine requirements at the border, a government order says. The exemption is due to the “urgent public health necessity” of the supplies they are transporting, Health Canada states. The government has given exemptions from testing and quarantine rules for certain people crossing the border into Canada to help tackle the COVID-19 pandemic. They include unvaccinated and vaccinated people invited by the health minister to help with the COVID-19 “response.” A spokeswoman for Health Canada said in a statement that this exemption requires a ministerial invitation and had been “rarely used.” She said it had been used, for example, to help with the supply of ventilators. The exemption is one of a number set out in an order-in-council published last month that outlines decisions made by cabinet, such as regulations or appointments. Drivers dropping off students on either side of the U.S.-Canada border at a college, school or university are also exempt from quarantine and testing requirements, the order says. The order makes clear that unvaccinated truckers are not exempt from the testing and quarantine requirement in other circumstances. They must obtain a pre-arrival COVID-19 test, quarantine and undergo COVID-19 molecular testing in Canada. The restrictions on unvaccinated cross-border truckers have caused much political debate in Canada and are ostensibly a major sticking point for the protesters camped outside Parliament Hill. But the order reveals that unvaccinated truckers can avoid the border requirements if they are transporting medical supplies, including products with a drug identification number, such as medications and vaccines authorized for use in Canada.\n\n“It is only the state’s power that saves and secures. And since only the state can save, it is the only legitimate source of authority..”\n• Canada Reveals the Core Conflict of Our Age (McGrogan)\n\nJustin Trudeau’s confrontation with the Canadian truckers may be the single most significant event of the Covid pandemic – not because of its eventual outcome, whatever that may be, but because of what it symbolises. It captures, in perfect microcosm, the tensions between the competing imperatives of the age: freedom versus security; the rule of law versus flexible ‘responsive’ governance; the priorities of the workers versus those of the Zooming bourgeoisie; the need for real-world human interaction and belonging versus the promises of splendid online isolation; the experiences of the common man, who knows where it hurts, versus those of the professional expert class, who know nothing that cannot be expressed as a formula. More than all of that, though, it gives us a lens through which to view a much deeper, much older conflict of much larger scope – one which underlies not just the struggles of the Covid age, but of modernity itself. On the one hand, the state, which seeks to make all of society transparent to its power. On the other, alternative sources of authority – the family, the church, the community, the firm, the farm, and the human individual herself. For centuries, the state has waged a quiet war against those competitors, and bent them to its will. It has done this not through conspiracy or deliberate strategy but merely through the single-minded pursuit, across generation after generation of political leaders, of one goal: legitimacy. Governments and other state organs derive their legitimacy, and therefore their positions of rulership, from convincing the population that they are necessary. They do this by suggesting that without their intervention, things will go badly; left to their own devices, ordinary people will suffer. The family, the church, the community, the firm, the farm, the human individual – these are inadequate to the task of securing human well-being. That task, only the state is equipped to achieve, for only the state can keep the population educated, healthy, safe, prosperous and satisfied. Since this is the case, only the state is fit to deploy power – and only those who govern the state are fit to rule. The logic of this argument is writ large, of course, in the Covid response across the developed world. What will keep us ‘safe?’ Certainly not traditional sources of succour, such as the church or the family. Certainly not individual people, who cannot be trusted to behave responsibly or assess risks for themselves. No – it is only the state, first with its lockdowns, then with its social distancing, its mask mandates, its vaccine programs, and lately its vaccine mandates and ‘passports.’ It is only the state’s power that saves and secures. And since only the state can save, it is the only legitimate source of authority – along, of course, with its leaders.\n\n“I think that the truckers, when they hit the Capitol, may well wake up a large number of our representatives and senators that are kind of a little bit asleep right now,” Malone said.\n• American Truckers to Drive From California to DC in ‘The People’s Convoy’ (ET)\n\nCalifornia truckers fed up with the federal government’s endless emergency powers mandating masks and vaccines are gearing up for what they hope will become a Canadian-style “freedom convoy” to Washington, D.C., and are set to roll on Interstate 40 heading east from Barstow on Feb. 23. A national group, called The People’s Convoy, is organizing the truckers who will hit the road for the nation’s capital city to demand the Emergency Powers Act be lifted, ending the mandates, according to Chris Marston, chairman of the American Foundation for Civil Liberties, a non-profit that advocates for civil liberties issues and is helping coordinate the trucker’s protest. Though previous news reports stated the convoy wouldn’t depart California until March 7, organizers now say the convoy will leave earlier than planned. “Freedoms can’t wait,” Marston told The Epoch Times. The group said it is calling on the American people to join the “call to freedom” in the spirit of “our brave and courageous neighbors to the north—our Canadian brothers and sisters who led the charge.” The Freedom Convoy in Canada has captured international attention the last handful of weeks as hundreds of truckers have parked in protest outside Parliament in Ottawa, the nation’s capital, demanding Prime Minister Justin Trudeau’s resignation and an end to mask and vaccine mandates. A map of the convoy’s expected route will be posted to the group’s website, Maureen Steele, a The People’s Convoy organizer, said Feb. 16 on “War Room,” a streaming political talk show and podcast hosted by former Donald Trump advisor Steve Bannon. To ensure donations for the truckers won’t be frozen or routed to other causes—a problem the Canadian truckers encountered with the crowdsourcing platform GoFundMe—The People’s Convoy is taking donations directly on their website. Peter Navarro, Trump’s former economic adviser—and a regular on Bannon’s show—praised Canadian truckers for leading the charge against what he called government tyranny. “They are like the Boston Tea Party. They’re the fountainhead of a worldwide movement, which is basically on the right side of both science and economics. And we have to thank those Canadian truckers,” Navarro said. Dr. Robert Malone, a virologist, immunologist, and inventor of mRNA vaccines, who has been an outspoken critic of the federal government’s handling of the pandemic and mandates, also suggested on the show that Washington may soon see a new kind of “woke”—that supporters have called an “awakening.” “I think that the truckers, when they hit the Capitol, may well wake up a large number of our representatives and senators that are kind of a little bit asleep right now,” Malone said.\n\n“..Trump-hater John Brennan actually briefed President Barack Obama in July 2016 that Clinton had signed off on a proposal to vilify Trump by “stirring up a scandal claiming interference by the Russian security service.”\n• ‘Russiagate’ Is Indeed Worse Than Watergate (Malic)\n\nOn Friday, Durham filed an innocuously-titled Motion to Inquire into Potential Conflicts of Interest in the Sussmann case. The 13-page document pointed out that the legal firm representing Sussmann – Latham & Watkins LLP – previously represented his firm of Perkins Coie, its former partner Marc Elias, and the Clinton campaign, all in dealings with the Durham investigation. So far, so boring – except that the filing also lays out the role of a tech company that exploited access to Trump Tower, another Trump-owned building, a “healthcare provider,” and even “the Executive Office of the President of the United States” (EOP) in order to “mine Internet data to establish ‘an inference’ and ‘narrative’ tying then-candidate Trump to Russia.” While the Durham documents do not name the company or the executive, they have since been identified by the New York Times as Neustar and Rodney Joffe, respectively. Durham says Neustar was hired by the Obama administration to “access and maintain dedicated servers for the EOP as part of a sensitive arrangement whereby it provided DNS resolution services,” and had access to these servers since at least 2014. Recall that Sussmann was accused of “coordinating” the tech company’s work with the Clinton campaign, including feeding the Alfa Bank story to the FBI. He allegedly also leaked the story to the press, which then ran multiple articles about the FBI investigation – which were promoted by Clinton herself as well as her aide Jake Sullivan, now President Joe Biden’s national security adviser. According to Durham, Sussmann also packaged the false Alfa Bank story with another claim that came from Joffe and Neustar – that Trump and his aides used “Russian-made wireless phones” at the White House – and fed it to the CIA, on February 9, 2017, almost three weeks into Trump’s presidency. Durham “identified no support for these allegations” by Joffe. Now, the FBI is not supposed to spy on Americans without a warrant, while the CIA is not supposed to spy on US soil at all. So how did these two agencies respond to these attempts to weaponize them for political purposes? Well, we know that the FBI was instrumental in the ploy to pressure Trump’s national security adviser Michael Flynn to resign over allegedly lying about his perfectly legitimate conversations with the Russian ambassador to the US. As for the CIA, its then-director and confirmed Trump-hater John Brennan actually briefed President Barack Obama in July 2016 that Clinton had signed off on a proposal to vilify Trump by “stirring up a scandal claiming interference by the Russian security service.” Three days later, the FBI opened a probe dubbed “Crossfire Hurricane” – targeting not Clinton, but Trump.\n\nSame MO as the adverse effects registration sites:\n\n“..very complicated and very hard to navigate, particularly if you’re suffering an adverse health effect..”\n\nAustralians who experienced adverse reactions to Covid-19 vaccines have started receiving compensation, local media reported on Wednesday, though the number of people applying to the scheme is far lower than expected. Figures from Australia’s Health Department show that less than 10% of the more than 10,000 people who registered their interest in the government scheme before December have submitted claims. The no-fault indemnity scheme grants people a one-off payment ranging from AU$1,000 (US$720) to AU$20,000 (US$14,400) for lost wages or other expenses if they suffered bad reactions to Covid-19 vaccines. The conditions for application include having spent at least one night in hospital and having suffered at least AU$1,000 (US$720) in economic losses. Services Australia has received 861 applications – including death claims – as of February 9, a Health Department spokesman told news.com.au. One case has been paid but 11 have already been withdrawn, they added. The authorities have requested further information from 225 claimants. A total of 849 “remain under consideration.” “With the indemnity scheme having only been opened for a short period of time, information on eligible claims and payment amounts is still being assessed,” the spokesman said. Shine Lawyers’ head of medical negligence, Clare Eves, said the number of claimants was “disappointing” and attributed some blame to the complex nature of the scheme’s application process. The website the government had set up was “very complicated and very hard to navigate, particularly if you’re suffering an adverse health effect,” she said. As of February 6, Australia’s medicines regulator had registered a total of 108,000 total reports of adverse reactions, most of which were minor, believed to be as a result of receiving a Covid-19 vaccine. Nearly 51.2 million total doses have been administered.\n• Kulldorff: ‘Science and Public Health Are Broken’ (ET)\n\nDr. Martin Kulldorff is one of the most qualified public health pandemic experts in the United States. To the narrative-shapers, he’s a pariah. As a prominent epidemiologist and statistician, Kulldorff has worked on detecting and monitoring infectious disease outbreaks for two decades. His methods are widely used around the world and by almost every state health department in the United States, as well as by hundreds of people at the Centers for Disease Control and Prevention (CDC). Kulldorff has also worked on vaccine safety for decades, developing globally used methods for monitoring adverse reactions in new vaccines. His résumé on the Food and Drug Administration (FDA) website is 45 pages long and includes a list of 201 peer-reviewed published journal papers. His work has been cited more than 27,000 times. Since 2003, Kulldorff worked at Harvard Medical School, first as an associate professor of population medicine and later as a professor of medicine. In November, Harvard and Kulldorff abruptly parted ways. Kulldorff prefers to keep the reasons private, but it’s hard to ignore that he placed himself in the crosshairs of the pandemic narrative early on in the “15 days to slow the spread” lockdown and has since paid the price. It’s quite something for a public health scientist at the top of his game to admit that “both science and public health are broken.” “For some reason, a public official narrative was established, and you weren’t allowed to question it—which, of course, is very detrimental, both to the pandemic and how to deal with the pandemic, because you have to have a vibrant discussion to figure out how best to deal with these things,” he told The Epoch Times. The Swedish native said he tried to point out in March 2020 that there was a very steep age gradient on mortality for COVID-19, the disease caused by the SARS-CoV-2 virus. Kulldorff said he attempted to publish a paper both in U.S. medical journals and mainstream newspapers stating that while anyone could contract the virus, the focus should be on protecting the elderly and those at high risk. His paper was knocked back from all directions.\n\nRobert F. Kennedy, Jr.’s record-smashing bestseller, “The Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health,” demolishes the public images — piously promoted by corporate media — of Dr. Anthony Fauci and Bill Gates. Unfortunately, however, you won’t be able to read a review of Kennedy’s book in major media. That’s because the corporate establishment has circled the wagons to censor it — by pretending it doesn’t exist. But it does exist. The book surged to #1 on Amazon.com even before it hit the bookstores, and it swept the bestseller lists of the New York Times, The Wall Street Journal, USA TODAY and Publishers Weekly — none of which will even mention that the book was published, let alone review it. \n\n It seems we are witnessing a mind-boggling first in U.S. book publishing history — when the hottest runaway bestseller of the season can’t even get its name mentioned in any major newspaper, TV or cable news program anywhere in the 50 states. Say hello to a new kind of suppression: censorship by oblivion — brazen, vicious, ugly and cowardly. This type of censorship subverts your right to make up your own mind after hearing both sides of a controversy. Instead, it simply labels the side it doesn’t like as “misinformation” and keeps you from hearing it at all. Astonishingly, given how much establishment firepower was lined up to crush this book, it is not working. Against all odds, the disturbing portrait Kennedy paints in “The Real Anthony Fauci” led the book to sell a record-breaking 110,000 copies in its first week. Through word of mouth, sales have reached more than 900,000 copies.\n\n“Biden made this commitment to Putin during the telephone call of Dec. 3..”\n\nAt yesterday’s press conference, Chancellor Scholz at times played straight man for Putin, calling the announcement of the Russian troop pullback a “good signal” and agreeing that diplomatic options are “far from exhausted”, as Russian Foreign Minister Sergei Lavrov had reported to Putin on Monday. Here’s what’s important (and was given appropriate prominence in AP’s reporting). Putin at the presser with Scholz: “… as [Lavrov] reported yesterday, the [US and NATO] responses still contain a number of considerations that we are not only ready to discuss but that we have actually suggested to our partners over the years. I am referring to our proposals on European security, certain weapons systems, notably, intermediate and shorter-range missiles, and military transparency. We are ready to continue this joint work. … \n\n So far, the NYT has omitted that statement by Putin, which, coming yesterday together with the troop pullback, is highly significant. That the Times “forgot” to include it is yet another sign that even the most sensible, rudimentary negotiations on key matters of concern to Russia will be resisted tooth and nail by the MICIMATT (Military-Industrial-Congressional-MEDIA-Academia-Think-Tank) complex in which the NYT is right there in the middle, the fulcrum – the key “M.” Still, some Times editor apparently insisted on slipping in the important acknowledgment by Mr. Biden today that: “Neither the US or NATO have missiles in Ukraine. We do not, do not have plans to put them there as well.” [Emphasis added.] Biden made this commitment to Putin during the telephone call of Dec. 30 that Putin had urgently requested. It amounts to a major concession and enabled Moscow to conclude that at least one or two of Biden’s retinue – or Biden himself – have their heads screwed on right.\n\nTry not to laugh..\n• Harris Flies To Europe To Help Secure Ukraine Border, Biden Stays Behind (NYP)\n\n“[Banca D’Italia] can also continue to absorb debt, say, an additional €500 billion euros, and then revalue gold times ten.”\n\nWhen the gold price rises the value of the gold on the asset side of a central bank’s balance sheet increases. At the same time, on the liability side of the balance sheet an equal increase will be recorded in what is referred to as a “revaluation account.” A gold revaluation account, which effectively has no limit, registers the unrealized gains on gold. An example: the German central bank owns 3,359 tonnes of gold, which was purchased for €8 billion euros. Currently the gold is worth €173 billion euros, creating a gold revaluation account of €165 billion euros (173 – 8).* While researching this subject I asked the German central bank (the Bundesbank, or “BuBa” in short) if it’s possible to use gold’s revaluation account to write off bad debt. I tend to aim such questions at the Bundesbank because they always respond very quickly. I’m aware that Italy’s government debt is the elephant in the room, but these countries are part of the same monetary union and Germany is the main guarantor of the E.U. Recovery Fund (Next Generation EU). BuBa replied that according to the prevailing accounting rules any unrealized gains in gold can only be used for unrealized losses in gold, not for losses in assets such as U.S. dollars or European bonds. [..] They could have just said no, but they didn’t. They replied that, “at this stage, we prefer not to speculate” about changing the accounting rules and revalue gold to write off bad debt. Meaning, they don’t rule out this possibility. Also note, BuBa writes that “in general” the accounting rules are set “by the ECB Governing council in accordance with the limits set by the European Treaties.” Implying that there are exceptions. Why did BuBa write this to me? Possibly, this was a signal for the market to revalue gold, saving BuBa the hassle of doing it themselves (printing money to buy gold). As a reminder, former Bundesbank President Jens Weidmann wrote in 2018 that gold is “the bedrock of stability for the international monetary system.” A comment that is anything but discouraging investors from buying gold and driving up its price. Weidmann added that gold is a “major anchor underpinning confidence in the intrinsic value of the Bundesbank’s balance sheet.” If gold is underpinning confidence in BuBa’s balance sheet, why wouldn’t it underpin confidence in investors’ balance sheets? It’s impossible to furnish the Italian government substantial debt relief without revaluing gold. Italy’s government debt is €2.7 trillion euros, of which is €600 billion euros is held by the Italian central bank (Banca D’Italia, or BDI). BDI’s gold revaluation account is currently over €100 billion euros, so the gold price has to be multiplied by approximately five for BDI to be able to write off its domestic government bonds. Though, BDI can also continue to absorb debt, say, an additional €500 billion euros, and then revalue gold times ten.\n\nIt used to be that everything gives you cancer. Now, everything gives you blood clots.\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Injury Payouts Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/vaccine-injury-payouts/", "site_name": "The Automatic Earth"}, "tags": ["Russiagate", "Vaccine Injury Payouts", "Emergencies Act", "People’s Convoy", "RFK jr", "Ukraine", "gold", "Trudeau"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">We don’t need the MSM…the sleeping leviathan known as Wall Street is waking up…money talks…BS propaganda walks. <a href=\"https://t.co/Txq2TletCr\">pic.twitter.com/Txq2TletCr</a></p>\n<p>— Ed ☯️Free Thinker &amp; Oracle (@DowdEdward) <a href=\"https://twitter.com/DowdEdward/status/1494520230055268352?ref_src=twsrc%5Etfw\">February 18, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Jon and <a href=\"https://twitter.com/owenslindsay1?ref_src=twsrc%5Etfw\">@owenslindsay1</a> talk about how corporate greed is driving the inflation crisis, and about the dirty, dirty deeds that go down in earnings calls. <a href=\"https://t.co/wOaps6pxO9\">pic.twitter.com/wOaps6pxO9</a></p>\n<p>— The Problem With Jon Stewart (@TheProblem) <a href=\"https://twitter.com/TheProblem/status/1494303116136701957?ref_src=twsrc%5Etfw\">February 17, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.wikiart.org/en/pablo-picasso/untitled-1937-8", "https://www.cp24.com/news/pm-says-emergencies-act-is-last-resort-civil-liberties-group-files-court-action-1.5785372", "https://www.thecountersignal.com/news/ottawa-police-may-euthanize-truckers-pets-as-punishment", "https://torontosun.com/news/national/unvaccinated-truckers-delivering-vaccines-covid-devices-exempt-from-border-rules", "https://brownstone.org/articles/society-vs-state-canada-reveals-the-core-conflict-of-our-age/", "https://www.theepochtimes.com/california-truckers-to-let-freedom-roll-in-peoples-convoy-to-d-c_4283423.html", "https://www.rt.com/news/549580-durham-investigation-russiagate-trump/", "https://www.rt.com/news/549686-australia-covid19-vaccine-injury-payouts/", "https://www.theepochtimes.com/exclusive-former-harvard-prof-martin-kulldorff-science-and-public-health-are-broken_4270247.html", "https://childrenshealthdefense.org/defender/rfk-jr-the-real-anthony-fauci-record-smashing-bestseller/", "https://original.antiwar.com/mcgovern/2022/02/15/ukraine-invasion-scheduled-for-wednesday-canceled/", "https://nypost.com/2022/02/17/kamala-harris-flies-to-europe-to-secure-ukraine-border/", "https://thegoldobserver.substack.com/p/german-central-bank-doesnt-rule-out?r=16jfi", "https://t.co/Txq2TletCr", "https://twitter.com/DowdEdward/status/1494520230055268352?ref_src=twsrc%5Etfw", "https://www.cp24.com/news/pm-says-emergencies-act-is-last-resort-civil-liberties-group-files-court-action-1.5785372", "https://www.cp24.com/news/pm-says-emergencies-act-is-last-resort-civil-liberties-group-files-court-action-1.5785372", "https://www.thecountersignal.com/news/ottawa-police-may-euthanize-truckers-pets-as-punishment", "https://www.thecountersignal.com/news/ottawa-police-may-euthanize-truckers-pets-as-punishment", "https://torontosun.com/news/national/unvaccinated-truckers-delivering-vaccines-covid-devices-exempt-from-border-rules", "https://torontosun.com/news/national/unvaccinated-truckers-delivering-vaccines-covid-devices-exempt-from-border-rules", "https://brownstone.org/articles/society-vs-state-canada-reveals-the-core-conflict-of-our-age/", "https://brownstone.org/articles/society-vs-state-canada-reveals-the-core-conflict-of-our-age/", "https://www.theepochtimes.com/california-truckers-to-let-freedom-roll-in-peoples-convoy-to-d-c_4283423.html", "https://www.theepochtimes.com/california-truckers-to-let-freedom-roll-in-peoples-convoy-to-d-c_4283423.html", "https://www.rt.com/news/549580-durham-investigation-russiagate-trump/", "https://www.rt.com/news/549580-durham-investigation-russiagate-trump/", "https://www.rt.com/news/549686-australia-covid19-vaccine-injury-payouts/", "https://www.rt.com/news/549686-australia-covid19-vaccine-injury-payouts/", "https://www.theepochtimes.com/exclusive-former-harvard-prof-martin-kulldorff-science-and-public-health-are-broken_4270247.html", "https://www.theepochtimes.com/exclusive-former-harvard-prof-martin-kulldorff-science-and-public-health-are-broken_4270247.html", "https://childrenshealthdefense.org/defender/rfk-jr-the-real-anthony-fauci-record-smashing-bestseller/", "https://childrenshealthdefense.org/defender/rfk-jr-the-real-anthony-fauci-record-smashing-bestseller/", "https://original.antiwar.com/mcgovern/2022/02/15/ukraine-invasion-scheduled-for-wednesday-canceled/", "https://original.antiwar.com/mcgovern/2022/02/15/ukraine-invasion-scheduled-for-wednesday-canceled/", "https://nypost.com/2022/02/17/kamala-harris-flies-to-europe-to-secure-ukraine-border/", "https://nypost.com/2022/02/17/kamala-harris-flies-to-europe-to-secure-ukraine-border/", "https://thegoldobserver.substack.com/p/german-central-bank-doesnt-rule-out?r=16jfi", "https://thegoldobserver.substack.com/p/german-central-bank-doesnt-rule-out?r=16jfi", "https://twitter.com/owenslindsay1?ref_src=twsrc%5Etfw", "https://t.co/wOaps6pxO9", "https://twitter.com/TheProblem/status/1494303116136701957?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}