{"result_id": "285041", "URL": "https://www.theautomaticearth.com/2021/09/five-alarm-fire/", "timestamp": "2023-04-25 17:16:44 CEST+0200", "meta": {"description": "Support the Automatic Earth", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/09/five-alarm-fire/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Five Alarm Fire", "cleaned_text": "We’ve been following, and reporting on, the travels and travails of mankind in virustime every single day for 20 months now, we’ve see our share of lies, denial, ignorance and incompetence. But there are still things that knock me off my feet. And it’s not even the sudden horse dewormer campaign the media started against ivermectin, that’s merely a surprise, as in: why now? Oh right, Joe Rogan is more popular than all of you put together…\n\nAnyone who still believes a single thing either their governments or their media say is a fool on a hill. But not a lonely fool, it’s getting crowded on those hills. And we can ask ourselves how we got here till the cows have been home, fed and watered and out to pasture again, but it’s a little late for that now. We swallowed it all, and we continue to do so.\n\nStill, as I said, there are some things left. The British Heart Foundation is a 60-year old reputable non-profit that spends some £100 million a year funding cardiovascular research by scientists around the UK. They are currently funding over 1000 research projects. One of those projects took place, or maybe is ongoing, at the University of Bristol. On August 28 2021, the British Heart Foundation published an article on this research.\n\nIt should have raised alarms all over the world, but it’s absolute crickets. It may not help that author Jennifer Mitchell herself doesn’t appear to understand the impact of what was found. She leaves the impression that this is mainly about the heart, and about Covid, while the implications are far more wide-reaching. She does mention that the problem is “all over the body”, but stops there.\n\nAll “vaccines” used in the west, Pfizer, Moderna, AstraZeneca and Janssen, work by inducing your cells to produce spike proteins, “found on the surface of Covid-19 virus”, 1 of 30 proteins contained in the coronavirus that causes Sars-Cov-2. These spike proteins bind to cells called pericytes, says the research, “which triggers a cascade of changes which disrupt normal cell function, and lead to the release of chemicals that cause inflammation.” “Even when the protein was no-longer attached to the virus.” Still don’t hear the five-alarm bells and see the red lights flashing?\n\nCovid-19 Spike Protein Binds To And Changes Cells In The Heart\n\nThe spike protein found on the surface of Covid-19 virus cells causes changes to cells in the small blood vessels of the heart, according to research we funded presented at the European Society of Cardiology Congress. Researchers from the University of Bristol have found that the spike protein binds to cells called pericytes which line the small vessels of the heart. This binding triggers a cascade of changes which disrupt normal cell function, and lead to the release of chemicals that cause inflammation. This happened even when the protein was no-longer attached to the virus. There is some previous evidence to suggest that the spike protein can remain in the blood stream after the virus has gone and travel far from the site of infection. In this study, researchers only studied pericytes from the small blood vessels within the heart. However, pericytes are found within small blood vessels all over the body, including in the brain and central nervous system. This latest finding may start to help explain the effect of the virus on organs away from the site of the Covid-19 infection. Researchers took small vessel cells from the heart and exposed them to the spike protein. They found that the spike protein alone was enough to disrupt normal cell function, and lead to the release of chemicals that cause inflammation. They then blocked the CD147 receptor and found that this prevented the spike protein from causing some of the changes to the cells. However, the inflammation continued. Now the researchers hope to find out if a drug blocking CD147 in humans can help to protect people from some of the complications arising from Covid-19. Professor James Leiper, our Associate Medical Director, said: “Covid-19 has presented an unprecedented challenge for the cardiovascular research community. There is still a lot that is unknown relating to how the virus can impact our health in the long term, but this research brings us one step closer to better understanding how Covid-19 affects the heart and circulatory system and may ultimately lead to new ways to protect the heart.\n\nMaybe the British Heart Foundation, and Jennifer Mitchell, and the University of Bristol simply don’t know that the vaccines induce your cells to produce spike proteins. Maybe they don’t know about micro blood clots. Maybe they are all just happily vaccinated. Maybe they only think in terms of the heart, and they don’t care about the brain and central nervous system. But even is that is all true, someone else must have picked this up, someone who understand what it means.\n\nThe spike proteins travel all through your body, through all your blood vessels, stick to their linings, and cause inflammation there. How would you like it if that happens to your brain, your heart, your lungs, your central nervous system? With no virus around? Remember, spike proteins are cytotoxic, they kill cells and/or turn them into spike protein factories, possibly for a long time. You don’t want these things in your body.\n\nYet, we inject millions of people every day with them, many two or even three times, and say this will make them safe. What do you think?\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Five Alarm Fire - The Automatic Earth", "description": "Support the Automatic Earth", "url": "https://www.theautomaticearth.com/2021/09/five-alarm-fire/", "site_name": "The Automatic Earth", "article:published_time": "2021-09-03T14:05:04+00:00", "article:modified_time": "2021-09-03T14:09:35+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/08/PaulKleeSicilianLandscape1924.jpg"}, "tags": ["brain", "pericytes", "heart", "inflammation", "vaccines", "spike protein", "British Heart Foundation", "central nervous system"], "tweets": [], "movies": [], "links": ["https://collection.barnesfoundation.org/objects/6499/Sicilian-Landscape-(Sicilische-Landschaft)/", "https://www.bhf.org.uk/what-we-do/news-from-the-bhf/news-archive/2021/august/covid-19-spike-protein-binds-to-and-changes-cells-in-the-heart", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-09-03T14:05:04+00:00"}