{"result_id": "285034", "URL": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-3-2023/", "timestamp": "2023-04-25 17:16:36 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-3-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle January 3 2023", "cleaned_text": "I already saw a lot of articles about vaccine risks last night, before Damar Hamlin collapsed on the field on live TV. When you combine that collapse with the new Rasmussen poll out yesterday, that says “More Than 1-in-4 Think Someone They Know Died From COVID-19 Vaccines”, and “49% of American Adults believe it is likely that side effects of COVID-19 vaccines have caused a significant number of unexplained deaths..”, we may be looking at an awakening. A large part of that 49% now think they know what happened with Hamlin. Try cover that up.\n\n“CPR was administered for 9 minutes. Normal is 3 to 5 minutes. After 10 minutes you’re basically dead.”\n• Damar Hamlin Is Not Expected To Make A Full Recovery (Kirsch)\n\nUpdate 11:20pm: It was announced in the hospital parking lot that Hamlin is not expected to make a full recovery. Hamlin was vaccinated. The Buffalo Bills is a 100% vaccinated team. I also got a Twitter DM from someone who knows this for a fact who asked that I not disclose his identity. This is a shame since we know know, thanks to my readers, that there is no death benefit to the COVID vaccines. Update 7:39pm: This was called “unprecedented” on ESPN. Hamlin has been intubated and currently listed in critical condition. All the announcers said they’d never seen it in the NFL. This was a joint decision by both the NFL and the players to stop the game. This is unprecedented. One of my nurse friends wrote, “How often has a young healthy football player that didn’t take that hard of a hit had a heart attack or stroke.” CPR was administered for 9 minutes. Normal is 3 to 5 minutes. After 10 minutes you’re basically dead. McCullough said that we will not know for 24 hours whether he will bounce back. He could make a full recovery. Dr. Peter McCullough just wrote me (7:54pm): “I watched the play live both as a fan and a cardiologist and I saw blunt neck and chest trauma, a brief recovery after the tackle and then a classic cardiac arrest. I have communicated to one of the most experienced trainers in the world and we agree that it was a cardiac arrest in the setting of a big surge of adrenalin. If Damar Hamlin indeed took one of the COVID-19 vaccines, then subclinical vaccine-induced myocarditis must be considered in the differential diagnosis. We have been told he was successfully defibrillated on the field and has been intubated and is not spontaneously breathing which is consistent with anoxic encephalopathy. The nation prays for his complete recovery.” Peter got it right…. 3 hours after he said that, the Buffalo Bills confirmed he was correct: Note that McCullough originally speculated that the injury that Buffalo Bills safety Damar Hamlin was due to commotio cordis (a phenomenon in which a sudden blunt impact to the chest causes sudden death in the absence of cardiac damage). The time delay from the hit until he collapsed is expected in commotio cordis. Peter believes that the ventricular tachycardia and ventricular fibrillation could have been set up by the vaccine if he took it. Hamlin was shocked back to rhythm. He now has anoxic encephalopathy. He’s in critical condition at the hospital. If you think the vaccines are safe, this article is very troubling. Therefore, it is viewed as “inappropriate.” If you think the vaccines are not safe, this article is confirming and people have no objection. Interesting, isn’t it? It now appears that, if Hamlin was vaccinated (which we all believe is highly likely but we don’t have the evidence to say he was), the vaccine likely played a very major role in his injury until proven otherwise. However, I believe it is highly unlikely that there will be a proper autopsy where they examine Damar Hamlin’s heart tissue similar to what they did in the Schwab study. In America, we do not want to know what kills people. This is why there are virtually never any autopsies after someone dies post-vaccine, even if they die less than 24 hours after the jab. So deaths like this will continue because people don’t want to upset the government safe and effective narrative.\n\nThe Rasmussen survey is here. Since it is a endless litany of numbers and percentages, I go with a write-up by the Substack A Midwestern Doctor.\n\n“49% of American Adults believe it is likely that side effects of COVID-19 vaccines have caused a significant number of unexplained deaths, including 28% who think it’s Very Likely”.\n• The American Public is Extremely Worried About the Vaccines (MWD)\n\nThe results of each of these questions have profound implications for the general public losing its trust in the mainstream narrative. The second is particularly important: 28% know someone directly they believe died from a vaccine. Even if the correlation is false (although I believe it is the opposite as many of the deaths are not recognized), 28% of the population believing the government and every authority they were raised their life to trust would push something this dangerous onto them shatters the institutional trust our entire society is built upon. Put differently, this is not a problem more propaganda can solve or half-hearted pseudo-apologies like Emily Oster’s disingenuous plea for amnesty or Peter Hotez’s “apology” that followed him being called out for his egregious conduct with the vaccines. At this point in time, the major challenge our movement is facing is bridging the gap from the evidence of harm (there is far more than enough data to end this program) to persuading the public that this data matters and the vaccines need to be pulled. This is why Rasmussen’s survey results so important, as they illustrate that gap is beginning to be overcome. When it comes to ending these mandates, how the vaccines are perceived by the public is the most important thing and what politicians will listen to. [..] One of the interesting things about today’s poll was how each demographic answered: For example, when asked if they knew someone who they suspected had died from the vaccine, 33% of Democrats said yes, while 26% of both Republicans and those who were not affiliated with either party said yes. Rasmussen argues this (along with many other demographic response rates) suggests the poll’s results were valid, and explained this result being due Democrats, while being less likely to want to acknowledge a vaccine injury, likely knowing far more people who were vaccinated, and thus being exposed to a higher rate of deaths.\n\nAgain, let’s hope Florida stays the course.\n\n“My goal is to illustrate the complete breakdown of the previously known to be rigorous ethical drug development process..”\n• Did Pfizer Perform Safety Testing for mRNA Vaccine in Preclinical Studies? (SL)\n\nThe cursory nature of the entire preclinical program for mRNA injections conducted by Pfizer can be briefly summarized as “we did not find any safety signals because we did not look for them”. The omissions of standard safety studies and glaring scientific dishonesty in the studies that were performed are so obvious that they cannot be attributed to the incompetence of the manufacturers and regulators. Rather, the questions of fraud and willful negligence should be raised. The focus of my review was the scope and adequacy of the program of non-clinical assessment for a novel gene therapy “vaccine” with a brief discussion of relevant regulatory frameworks. I did not dive deeply into the results of specific animal studies. My goal is to illustrate the complete breakdown of the previously known to be rigorous ethical drug development process, as well as the shocking negligence on the part of the regulatory agencies that are supposed to keep the pharmaceutical manufacturers honest. It turns out that both the regulators and the manufacturers were highly dishonest and pushed an entirely novel technology and product on millions of people without a single well designed toxicology assessment. In summary, I have identified the following: Finding 1: Pfizer’s program did not include a comprehensive end-to-end test of all components as well as the final chemical entity of the mRNA product. The studies included in the FDA approval package were for a variety of versions of the product with no comparability assessments, thus no comprehensive assessment of the product safety can be made. Finding 2: The toxicity/safety pharmacology of the Covid 19 vaccine’s active ingredient (mRNA BNT162b2) was never evaluated! Finding 3: Pfizer claimed absence of potential for “vaccine-elicited disease enhancement” based on studies of an animals that did not get sick from Sars-Cov-2. Finding 4: CDC, FDA and Pfizer lied about “vaccine staying in the injection site” – the injected substance is carried by the LNPs all over the body and into all organs. Finding 5: Pfizer waived major categories of safety testing for their product altogether using self-serving interpretation of WHO recommendations from 2005. Finding 6: Both FDA and Pfizer knew about major toxicities associated with gene therapy class of medicines, and therefore cannot claim lack of anticipatory knowledge of these risks.\n\n“..they KNOW they will eventually be caught. That’s not a concern for them because their goal of getting as many men, women, and children jabbed as many times as possible cannot be reversed by the truth coming out..”\n• Expect Three Things From Government to Cover Up Vaxx-Weakened Immunity (Rucker)\n\nAfter two years of completely controlling the Covid “vaccine” narrative and gaslighting the people into thinking they were “safe and effective,” an avalanche of news has been coming out lately that is prompting more people to ask questions. While most “normies” are still in the dark because they’re getting their news from corporate media, a small but growing number of them are waking up to the fact that they’ve been conned. While there’s still a huge leap to be made between getting people to ask questions and making them believe this is a worldwide depopulation and control agenda, the interim goal of getting them to stop getting more jabs is a worthy accomplishment. This is why we post articles and do videos on a constant basis to give people the ammunition they need to stir more of the masses to enlightenment. We need to hand out as many “vaccine red pills” as we can. Unfortunately, the powers-that-be are aware they’re losing bits of control over the narrative so we fully expect them to fight back tooth-and-nail in 2023. They will continue to use propaganda and censorship through corporate media and Big Tech, but they realize even in those controlled venues they have challenges. Therefore, they are in the process of engaging in three variations of their current strategy to keep the con going as long as possible. It’s important to note that they KNOW they will eventually be caught. That’s not a concern for them because their goal of getting as many men, women, and children jabbed as many times as possible cannot be reversed by the truth coming out. Just because someone becomes aware that the jabs are harming them doesn’t mean they can go get themselves unjabbed. The powers-that-be know they cannot hide the truth forever, so they are working to subvert the truth and distort it in ways that will continue to serve their goals even after the masses finally wake up. The first step is already happening. Rather than deny that people’s immune systems are weakening and many are dying suddenly with no viable explanation, they’re acknowledging the deaths but offering alternative reasons.. For example, the American Heart Association released a “study” last August that claimed increased cases of Myocarditis in children is due to Covid-19 itself, not the vaccines. It’s an extremely dishonest report from the AHA for multiple reasons, not the least of which is that if someone is jabbed AND had Covid, those Myocarditis cases are counted as caused by Covid. Then, there’s the fact that they do not count Myocarditis cases that were discovered more than 28-days after getting jabbed.\n\n“..the study found vector DNA in the sciatic nerves, bone marrow, livers, lungs, and spleens of the mice following vaccination.”\n\nAstraZeneca study finds vector DNA in the sciatic nerve, bone marrow, liver, lungs, and spleen of vaccinated mice. Because AstraZeneca’s COVID-19 vaccine is not licensed in the United States, all documents within the FDA’s possession concerning this vaccine are exempt from disclosure. This means that anyone who received an AstraZeneca COVID-19 vaccine cannot – and might not ever be able to – access any of the data concerning the vaccine from the US government. Not satisfied by this complete lack of transparency, ICAN, through its attorneys, submitted an information request to the United Kingdom’s FDA equivalent – the Medicines and Healthcare Products Registry Agency (MHRA) — in April 2022 seeking information relating to its authorization of the AstraZeneca COVID-19 vaccine, as well as that relating to its authorization of the Janssen, Moderna, and Pfizer COVID-19 vaccines. MHRA’s initial response was to threaten to deny ICAN’s request but, after ICAN pushed back and, in the case of the AstraZeneca vaccine, narrowed the scope of the request to seven specific items related to safety testing, MHRA dropped its objection. MHRA recently provided 166 pages of records containing the studies MHRA relied on to authorize AstraZeneca’s COVID-19 vaccine. One of these studies investigated biodistribution of the AstraZeneca vaccine, meaning where it goes in the body after injection, in mice. This study revealed that the viral vector DNA did not remain localized in the injection site but instead migrated to other organs. Disturbingly, the study found vector DNA in the sciatic nerves, bone marrow, livers, lungs, and spleens of the mice following vaccination. The study documents further revealed that, in early 2021, AstraZeneca was forced to amend its data sheet for the vaccine after concluding that there may have been a causal association between the vaccine and serious hypersensitivity including anaphylaxis. Another perhaps unsurprising revelation was the inclusion of disclaimer that a number of vulnerable populations, such as pregnant and lactating women and immunocompromised persons, were excluded from pre-market human safety studies. In its Marketing Authorization Application, AstraZeneca stated that because these populations were excluded from the studies, the safety of the vaccine in these groups was unknown. This also led the UK’s Joint Committee on Vaccination and Immunization (JCVI) to recommend against the AstraZeneca vaccine for pregnant women – a sentiment that was echoed in the UK’s vaccination schedule guide, commonly referred to as the “Green Book.”\n\nCovid is not the concern, the vaccines are. And Israel is the test lab for those.\n• Israel to Declare Covid Pandemic Over, Downgrade It to Flu Status (YW)\n\nRogan O’Handley @DC_Draino: “Remember when Biden got the Ukrainian prosecutor fired for investigating Hunter/Burisma? Well on Dec. 27 the USVI AG filed a lawsuit against JPMorgan for helping Jeffrey Epstein. Biden flew to USVI & the AG was fired days later.”\n• Virgin Islands AG Loses Her Job Days After Suing JPMorgan Over Epstein (L&C)\n\n“Berlin will continue to refrain from any “ill-considered unilateral moves..”\n\n“Between February and May, it is likely that both parties will realize “that they are getting stuck..”\n\nI don’t think so. Not both parties.\n\nA senior German Army officer and former Commander of Allied Joint Force Command Brunssum, General Hans-Lothar Domröse, has predicted that the Russia-Ukraine conflict will run into a stalemate and some sort of a ceasefire will be reached by summer. “I expect a standstill in early summer,” Domröse told the newspapers of the German Funke media group on Sunday, arguing that by such time, both sides will feel that continued fighting is “no longer of any use.” Between February and May, it is likely that both parties will realize “that they are getting stuck,” the former general said, adding that this will be the moment to begin ceasefire negotiations. “We will have a truce sometime in 2023,” Domröse predicted, cautioning that this would not mean an immediate lasting peace. “A ceasefire means: We stop shooting,” he said, but negotiations are “likely to take a long time.” Regarding the current state of the conflict, Domröse said that Russia has the advantage of having “more tanks and more missiles,” while Kiev is “absolutely dependent” on Western arms supplies. “It’s hard for me to imagine Ukraine regaining [the Russian-held territories] completely – even if the West supplies the heavy weapons that are required, especially tanks and artillery,” he added. Since the start of Russia’s military campaign in Ukraine last February, Germany, along with most other Western nations, has been supplying Ukraine with weapons. However, Chancellor Olaf Scholz has been reluctant to supply Leopard 2 battle tanks to Kiev, arguing that since no other nation has yet sent such modern weaponry, Germany should not blaze a trail. The general claimed that if “we take our responsibility seriously, we must provide [Kiev] with the heavy weapons” before its stockpiles run dry, because it could take well over a month from the government’s decision to have Leopard 2 tanks on the ground in Ukraine. “At some point Ukraine will have lost its last tank, then it will need supplies. And at some point there will be a ceasefire, then Ukraine will also need further support and weapons,” Domröse said. “It is high time that the European countries that have Leopard tanks now form a coalition of the willing and deliver together in a coordinated manner.” Moscow has consistently argued that Western weapons deliveries to Ukraine only serve to prolong the conflict. It has also warned that NATO member states are getting increasingly involved in the hostilities, which could potentially lead to an all-out military confrontation between the bloc and Russia. The general acknowledged that the only way to end the conflict is through a negotiated agreement acceptable to both sides, suggesting that a possible solution could be for Zelensky to waive Kiev’s demand to immediately integrate Crimea into Ukraine and instead agree to a “transition period” of 50 years. However, the Kremlin previously called such proposals a non-starter, insisting that if Ukraine wants peace it should take into account “the new realities,” referring to the four former Ukrainian regions that voted to join Russia last fall, after Crimea did the same in 2014 following a coup in Kiev.\n\nThe only question in approval rating is the Duma.\n\n“You see, Putin can’t handle tough questions. Oops!! Wait a minute. We have breaking news. Turns out that Putin held a 48 minute press conference three days before Western Christmas..”\n\nAs someone who played a minuscule role in a CIA information operation that targeted Soviet military operations in Afghanistan in November 1985, I feel somewhat qualified to comment on the mammoth propaganda campaign the United States and Europe have unleashed on Russia. I have never seen anything so perverse and so dishonest. Let me give you a recent example. Remember this recent “news” headline? “DUCKING FOR COVER: ‘SICKLY’ PUTIN CANCELS BIGGEST SPEECH OF HIS LIFE AS FIRST RUSSIAN STATE OF NATION SINCE INVASION IS MYSTERIOUSLY AXED” https://www.thesun.co.uk/news/20827701/putin-sick-russian-speech-ukraine-invasion This was courtesy of the UK’s SUN. Lacking any reliable source, The SUN opted for speculation: “VLADIMIR Putin has cancelled his state of the nation address fuelling rumours he is in hiding from the Russian people and could be in failing health. Putin’s spokesman finally confirmed the speech – which would be one of biggest in Vlad’s life – will not go ahead before the New Year. . . . It comes after the mad tyrant also cancelled his end of year press conference and his annual hockey game.” Got it? Putin is either deathly ill — suffering from Parkinsons, cancer, Irritable Bowel, etc. — or deathly afraid of having to explain the ass whooping that Ukraine is delivering to Russia. You see, Putin can’t handle tough questions. Oops!! Wait a minute. We have breaking news. Turns out that Putin held a 48 minute press conference three days before Western Christmas (does this count as “end of the year”?): It would appear that Putin delights in trolling the Western pundits and media. Does Putin look like a man suffering from some devastating illness? Does he give off the vibe of a guy who cannot control his bowels and is called Mr. Poopy Pants behind his back? Joe Biden could not pull this off even if he consumed Zelensky’s weekly dose of cocaine. Putin is coherent and in command of facts. It would be one thing if the Western propaganda effort was focused solely on ridiculing and trying to foment opposition inside Russia to Vladimir Putin. But it is not. Western propaganda is demonizing all things Russian — e.g., literature, art, chess, sports figures, and actors and actresses. This approach is not creating a reservoir of good will towards the West. Just the opposite. It is fortifying Russian nationalism and solidifying support for Putin.\n\n“I hope it’s not too impertinent to suppose that the January 6 Riot was engineered by our government to embarrass and punish its political opponents..”\n\nNext Mr. Wray has to answer for the FBI’s infiltration of social media. How did the top lawyer at the FBI, Jim Baker, come to be employed as the right-hand to Twitter’s chief censor, Vijaya Gadde? How did all those former FBI agents land at the company along with Jim Baker, and what did Mr. Wray have to do with the FBI demands to censor news and persons on matters of critical national importance such as vaccine safety and election fraud? How did more than a hundred former federal agents land on Facebook, Google, and other platforms? How did Mr. Wray decide to shut down the avenues of the First Amendment to the Constitution? Next up: Attorney General Merrick Garland. On what grounds are pre-trial January 6 Riot suspects being held in the decrepit DC federal lockup without bail on rinky-dink charges two years after the event? How does that square with American due process of law? What did he know about the existence of the Hunter Biden laptop and the evidence it contained? What is he doing about it? How did Mr. Garland happen to target for prosecution parents protesting school board policies on race and sexual matters? Of course, Mr. Garland is going to evade answering by using the ploy that all these questions “pertains to ongoing investigations.” Mr. Jordan had better hire a gutsy chief counsel with some brains to penetrate that bodyguard of lies. If the Special Subcommittee on the January 6 Riot is disbanded, turn the matter over to the Andy Biggs’ Subcommittee on Crime, Terrorism, and Homeland Security. Let’s hear from Nancy Pelosi’s staff as to why her office (of the Speaker) turned down offers from the Trump White House for national guard protection that day. Let’s also hear from the then-chief of the Capitol Police, Steven Sund, who resigned from that job two days later — in consternation or disgrace? Bring back Mr. Wray and Mr. Garland. How many federal agents were circulating in the crowd the night before and on the day of the January 6 riot? Why was one Ray Epps never indicted for his much-recorded incitements to enter the Capitol? Who opened the magnetically-locked doors from the inside of the building? Stuff like that. What was the decision process for not charging officer Michael Byrd in the shooting death of Ashli Babbitt? I hope it’s not too impertinent to suppose that the January 6 Riot was engineered by our government to embarrass and punish its political opponents — taking advantage of the First Amendment “right of the people peaceably to assemble, and to petition the government for a redress of grievances,” which was what that crowd had come to do in Washington DC that day.\n\nThe only reason they can keep up this story is that the other side has been imprisoned and silenced.\n\nIn a new firsthand account of the frantic efforts of Capitol Police officers to protect Congress and themselves from an armed mob on Jan. 6, 2021, the department’s former chief blames cascading government failures for allowing the brutal melee. The federal government’s multibillion-dollar security network, built after 9/11 to gather intelligence that could warn of a looming attack, provided no such shield on Jan. 6, former Capitol Police chief Steven A. Sund writes in a new book. The FBI, the Department of Homeland Security and even his own agency’s intelligence unit had been alerted weeks earlier to reams of chilling chatter about right-wing extremists arming for an attack on the Capitol that day, Sund says, but didn’t take the basic steps to assess those plots or sound an alarm. Senior military leaders, citing political or tactical worries, delayed sending help. And, Sund warns in “Courage Under Fire,” it could easily happen again. Many of the factors that left the Capitol vulnerable remain unfixed, he said. The Washington Post obtained an advance copy of the book, which will be published Tuesday. In his account, Sund describes his shock at the battle that unfolded as an estimated 10,000 protesters inflamed by President Donald Trump’s rally earlier in the day broke through police lines and punched, stabbed and pepper-sprayed officers, outnumbering them “58 to 1.” Sund said his shock shifted to agony as he unsuccessfully begged military generals for National Guard reinforcements. Though they delayed sending help until it was too late for Sund’s overrun corps, he says that he later discovered that the Pentagon had rushed to send security teams to protect military officials’ homes in Washington, none of which were under attack. Sund reserves his greatest outrage for those Pentagon leaders, recounting a conference call he had with two generals about 2:35 p.m., 20 minutes after rioters had broken into the Capitol and as Vice President Mike Pence and other lawmakers scurried to hiding places. Sund writes that Lt. Gen. Walter Piatt told him he didn’t like the optics of sending uniformed Guard troops to the Capitol but could allow them to replace police officers at roadside checkpoints. Listening incredulously and trying to explain that he needed help to save officers’ lives, Sund said, he felt both “nauseated” and “mad as hell.” “It’s a response I will never forget for the rest of my life,” Sund writes. While on the call, Sund recalls hearing the frantic voice of an officer being broadcast into the command center: “Shots fired in the Capitol, shots fired in the Capitol.” Sund’s anger boiled over and he shouted the report of gunfire into the conference call: “Is that urgent enough for you now?” Then Sund hung up to deal with this new crisis.\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle January 3 2023 - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-3-2023/", "site_name": "The Automatic Earth", "article:published_time": "2023-01-03T10:00:06+00:00", "article:modified_time": "2023-01-03T10:00:26+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/01/ToulouseLautrecPortrait-of-vincent-van-gogh-1887.jpg"}, "tags": ["Comer", "DeSantis", "ceasefire", "Israel", "cover up", "Pfizer", "Jan 6", "GMO", "Damar Hamlin", "escalation"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The First Amendment was a victory for ALL humanity. In 2020, I EXPOSED the entire Government &amp; Big Tech Censorship Infrastructure in a Federal lawsuit.  </p>\n<p>An interviewer asked: “Are you  afraid they might kill you?”</p>\n<p>I asked HIM, “What IS the PURPOSE of Life?”</p>\n<p>Happy New Year. <a href=\"https://t.co/OWEsjg1dhH\">pic.twitter.com/OWEsjg1dhH</a></p>\n<p>— Dr.SHIVA Ayyadurai, MIT PhD. Inventor of Email (@va_shiva) <a href=\"https://twitter.com/va_shiva/status/1609548321965604865?ref_src=twsrc%5Etfw\">January 1, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Dr. Bowden says If it wasnt for the FDA hundreds of thousands of Americans would still be alive today <a href=\"https://t.co/ASpfNie3XF\">pic.twitter.com/ASpfNie3XF</a></p>\n<p>— No Amnesty 2023 (@Petersparrot) <a href=\"https://twitter.com/Petersparrot/status/1609198532669640704?ref_src=twsrc%5Etfw\">December 31, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Michael Flynn today gave his assessment of Ukraine: “Russia has achieved all of their objectives, and they’re now exposing .. bio labs that have been in there sponsored by the US. The guy that just showed up to speak to our Congress in a sweatsuit should’ve been thrown out.” <a href=\"https://t.co/4RMYZcDgif\">pic.twitter.com/4RMYZcDgif</a></p>\n<p>— Ron Filipkowski (@RonFilipkowski) <a href=\"https://twitter.com/RonFilipkowski/status/1609953715573903360?ref_src=twsrc%5Etfw\">January 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Why have the <a href=\"https://twitter.com/hashtag/USA?src=hash&amp;ref_src=twsrc%5Etfw\">#USA</a> and <a href=\"https://twitter.com/hashtag/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine</a> always opposed <a href=\"https://twitter.com/hashtag/Russian?src=hash&amp;ref_src=twsrc%5Etfw\">#Russian</a> resolutions at the U.N. against the \"glorification of <a href=\"https://twitter.com/hashtag/Nazism?src=hash&amp;ref_src=twsrc%5Etfw\">#Nazism</a>\"? This RT doco on the history of fascism, now widely banned on US channels, explains why. Short excerpt below, full doco here: <a href=\"https://t.co/74RX6FoTzu\">https://t.co/74RX6FoTzu</a> <a href=\"https://t.co/TSQckif74j\">pic.twitter.com/TSQckif74j</a></p>\n<p>— tim anderson (@timand2037) <a href=\"https://twitter.com/timand2037/status/1609433322119110656?ref_src=twsrc%5Etfw\">January 1, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The side of the Green movement the climate change fanatics aren’t excited about you seeing. </p>\n<p> <a href=\"https://t.co/hz3VqFIXVP\">pic.twitter.com/hz3VqFIXVP</a></p>\n<p>— Kevin Dalton (@KevinForBOS) <a href=\"https://twitter.com/KevinForBOS/status/1609254788356804608?ref_src=twsrc%5Etfw\">December 31, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Melibe viridis is a carnivorous sea slug with a gelatinous vacuum cleaner for a head. 😮 <a href=\"https://t.co/STJbC1e2c4\">pic.twitter.com/STJbC1e2c4</a></p>\n<p>— H0W_THlNGS_W0RK (@HowThingsWork_) <a href=\"https://twitter.com/HowThingsWork_/status/1609703285044174848?ref_src=twsrc%5Etfw\">January 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Incredible that such sophisticated structure, biological technology and beauty happened “randomly.”</p>\n<p>😅 <a href=\"https://t.co/4fDfE6grHy\">pic.twitter.com/4fDfE6grHy</a></p>\n<p>— Erwan Le Corre (@ErwanLeCorre) <a href=\"https://twitter.com/ErwanLeCorre/status/1609964527394902017?ref_src=twsrc%5Etfw\">January 2, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.wikiart.org/en/henri-de-toulouse-lautrec/portrait-of-vincent-van-gogh-1887", "https://stevekirsch.substack.com/p/what-caused-damar-hamlins-injury", "https://amidwesterndoctor.substack.com/p/the-american-public-is-extremely", "https://newspunch.com/gov-desantis-were-suing-big-pharma-for-killing-americans-with-their-covid-shots/", "https://sashalatypova.substack.com/p/did-pfizer-perform-safety-testing", "https://jdrucker.substack.com/p/as-vaxx-weakened-immunity-explodes", "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "https://www.theyeshivaworld.com/news/headlines-breaking-stories/2152771/about-time-israel-to-declare-covid-pandemic-over-downgrade-it-to-flu-status.html", "https://www.msn.com/en-us/news/crime/virgin-islands-attorney-general-loses-her-job-days-after-suing-jpmorgan-chase-in-connection-with-the-jeffrey-epstein-probe/ar-AA15THZZ", "https://www.azerbaycan24.com/en/german-mp-warns-against-unimaginable-escalation/", "https://www.azerbaycan24.com/en/ex-nato-general-predicts-ukraine-ceasefire/", "https://intellinews.com/putin-s-approval-rating-ends-2022-at-81-boosted-by-support-for-the-war-in-ukraine-265628/", "https://sonar21.com/is-western-propaganda-failing/", "https://kunstler.com/clusterfuck-nation/questions-and-answers-2/", "https://www.stripes.com/theaters/us/2023-01-01/fbi-dhs-pentagon-capitol-riot-8609065.html", "https://safety4sea.com/turkey-ban-genetically-modified-grains/", "https://t.co/OWEsjg1dhH", "https://twitter.com/va_shiva/status/1609548321965604865?ref_src=twsrc%5Etfw", "https://t.co/ASpfNie3XF", "https://twitter.com/Petersparrot/status/1609198532669640704?ref_src=twsrc%5Etfw", "https://stevekirsch.substack.com/p/what-caused-damar-hamlins-injury", "https://stevekirsch.substack.com/p/what-caused-damar-hamlins-injury", "https://www.rasmussenreports.com/public_content/politics/public_surveys/died_suddenly_more_than_1_in_4_think_someone_they_know_died_from_covid_19_vaccines", "https://amidwesterndoctor.substack.com/p/the-american-public-is-extremely", "https://amidwesterndoctor.substack.com/p/the-american-public-is-extremely", "https://newspunch.com/gov-desantis-were-suing-big-pharma-for-killing-americans-with-their-covid-shots/", "https://newspunch.com/gov-desantis-were-suing-big-pharma-for-killing-americans-with-their-covid-shots/", "https://sashalatypova.substack.com/p/did-pfizer-perform-safety-testing", "https://sashalatypova.substack.com/p/did-pfizer-perform-safety-testing", "https://jdrucker.substack.com/p/as-vaxx-weakened-immunity-explodes", "https://jdrucker.substack.com/p/as-vaxx-weakened-immunity-explodes", "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "https://www.theyeshivaworld.com/news/headlines-breaking-stories/2152771/about-time-israel-to-declare-covid-pandemic-over-downgrade-it-to-flu-status.html", "https://www.theyeshivaworld.com/news/headlines-breaking-stories/2152771/about-time-israel-to-declare-covid-pandemic-over-downgrade-it-to-flu-status.html", "https://www.msn.com/en-us/news/crime/virgin-islands-attorney-general-loses-her-job-days-after-suing-jpmorgan-chase-in-connection-with-the-jeffrey-epstein-probe/ar-AA15THZZ", "https://www.msn.com/en-us/news/crime/virgin-islands-attorney-general-loses-her-job-days-after-suing-jpmorgan-chase-in-connection-with-the-jeffrey-epstein-probe/ar-AA15THZZ", "https://www.azerbaycan24.com/en/german-mp-warns-against-unimaginable-escalation/", "https://www.azerbaycan24.com/en/german-mp-warns-against-unimaginable-escalation/", "https://www.azerbaycan24.com/en/ex-nato-general-predicts-ukraine-ceasefire/", "https://t.co/4RMYZcDgif", "https://twitter.com/RonFilipkowski/status/1609953715573903360?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/ex-nato-general-predicts-ukraine-ceasefire/", "https://intellinews.com/putin-s-approval-rating-ends-2022-at-81-boosted-by-support-for-the-war-in-ukraine-265628/", "https://intellinews.com/putin-s-approval-rating-ends-2022-at-81-boosted-by-support-for-the-war-in-ukraine-265628/", "https://sonar21.com/is-western-propaganda-failing/", "https://twitter.com/hashtag/USA?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Ukraine?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Russian?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Nazism?src=hash&ref_src=twsrc%5Etfw", "https://t.co/74RX6FoTzu", "https://t.co/TSQckif74j", "https://twitter.com/timand2037/status/1609433322119110656?ref_src=twsrc%5Etfw", "https://sonar21.com/is-western-propaganda-failing/", "https://kunstler.com/clusterfuck-nation/questions-and-answers-2/", "https://kunstler.com/clusterfuck-nation/questions-and-answers-2/", "https://www.stripes.com/theaters/us/2023-01-01/fbi-dhs-pentagon-capitol-riot-8609065.html", "https://www.stripes.com/theaters/us/2023-01-01/fbi-dhs-pentagon-capitol-riot-8609065.html", "https://safety4sea.com/turkey-ban-genetically-modified-grains/", "https://safety4sea.com/turkey-ban-genetically-modified-grains/", "https://t.co/hz3VqFIXVP", "https://twitter.com/KevinForBOS/status/1609254788356804608?ref_src=twsrc%5Etfw", "https://t.co/STJbC1e2c4", "https://twitter.com/HowThingsWork_/status/1609703285044174848?ref_src=twsrc%5Etfw", "https://t.co/4fDfE6grHy", "https://twitter.com/ErwanLeCorre/status/1609964527394902017?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2023-01-03T10:00:06+00:00"}