{"result_id": "285030", "URL": "https://www.theautomaticearth.com/2021/04/18-reasons-i-wont-be-getting-a-covid-vaccine/", "timestamp": "2023-04-25 17:16:32 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/04/18-reasons-i-wont-be-getting-a-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "18 Reasons I Won't Be Getting a Covid Vaccine", "cleaned_text": "A friend sent me a link to this piece today, and I thought I’d share the entire thing instead of just linking to it. There are many questions about the Covid “vaccines”, and they must be asked. As someone said, we simply cannot afford to shut down either questions or dissenting voices. But there are plenty attempts to do just that.\n\nThis article was written by a man named Christian Elliot, who appears to be a health nerd/coach and “question asker”, mid-40s, 4 young kids; there’s little else I can tell you about him. Other than he asks the right questions, and they should be answered. Christian’s site is DeconstructingConventional.com.\n\nHe uses more space(s) than I usually do, but I don’t feel like going through the whole source code, so here goes:\n\nHere are the reasons I’m opting out of the covid vaccine.\n\nThe only industry in the world that bears no liability for injuries or deaths resulting from their products, are vaccine makers.\n\nFirst established in 1986 with the National Childhood Vaccine Injury Act, and reinforced by the PREP Act, vaccine makers cannot be sued, even if they are shown to be negligent.\n\nThe covid-vaccine makers are allowed to create a one-size-fits-all product, with no testing on sub-populations (i.e. people with specific health conditions), and yet they are unwilling to accept any responsibility for any adverse events or deaths their products cause.\n\nIf a company is not willing to stand behind their product as safe, especially one they rushed to market and skipped animal trials on, I am not willing to take a chance on their product.\n\n#2: THE CHECKERED PAST OF THE VACCINE COMPANIES\n\nThe four major companies who are making these covid vaccines are/have either:\n• Never brought a vaccine to market before covid (Moderna and Johnson & Johnson).\n\nModerna had been trying to “Modernize our RNA” (thus the company name)–for years, but had never successfully brought ANY product to market–how nice for them to get a major cash infusion from the government to keep trying.\n\nIn fact, all major vaccine makers (save Moderna) have paid out tens of billions of dollars in damages for other products they brought to market when they knew those products would cause injuries and death–see Vioxx, Bextra, Celebrex, Thalidomide, and Opioids as a few examples.\n\nIn case it hasn’t sunk in, let me reiterate…3 of the 4 covid vaccine makers have been sued for products they brought to market even though they knew injuries and deaths would result.\n• in 1995, 1996, 2001, 2010, 2011, 2016, 2019 (For what it’s worth, J&J’s vaccine also contains tissues from aborted fetal cells, perhaps a topic for another discussion)\n• Pfizer has the distinction of the biggest criminal payout in history. They have lost so many lawsuits it’s hard to count. You can check out their rap sheet here . Maybe that’s why they are demanding that countries where they don’t have liability protection put up collateral to cover vaccine-injury lawsuits.\n• Astra Zeneca has similarly lost so many lawsuits it’s hard to count. Here’s . Here’s …you get the point. And in case you missed it, the company had their covid vaccine suspended in over concerns of blood clots, and they completely botched their meeting with the FDA with numbers from their study that didn’t match.\n• Oh, and apparently J&J (whose vaccine is approved for “Emergency Use” in the US) and Astrazenca (whose vaccine is not approved for “Emergency Use” in the US), had a little mix up in their ingredients …in 15 million doses. Oops.\n\nLet me reiterate this point:\n\nWhere else in life would we trust someone with that kind of reputation?\n\nTo me that makes as much sense as expecting a remorseless, abusive, unfaithful lover to become a different person because a judge said deep down they are a good person.\n\nHere’s another reason why I don’t trust them.\n\n#3: THE UGLY HISTORY OF ATTEMPTS TO MAKE CORONAVIRUS VACCINES\n\nThere have been many attempts to make viral vaccines in the past that ended in utter failure, which is why we did not have a coronavirus vaccine in 2020.\n\nIn the 1960’s, scientists attempted to make an RSV (Respiratory Syncytial Virus) vaccine for infants.\n\n, they skipped animal trials because they weren’t necessary back then.\n\nIn the end, the vaccinated infants got much sicker than the unvaccinated infants when exposed to the virus in nature, with 80% of the vaccinated infants requiring hospitalization, and two of them died .\n\nAfter 2000, scientists made many attempts to create coronavirus vaccines.\n\nFor the past 20 years, all ended in failure because the animals in the clinical trials got very sick and many died, just like the children in the 1960’s.\n\nYou can read a summary of this history/science .\n\nOr if you want to read the individual studies you can check out these links:\n• In 2005 and became sick and more susceptible to coronaviruses after being vaccinated\n• In 2012 the became sick and died. And in mice and ferrets developed lung disease.\n• In 2016 also produce lung disease in mice.\n\nThe typical pattern in the studies mentioned above is that the children and the animals produced beautiful antibody responses after being vaccinated.\n\nThe manufacturers thought they hit the jackpot.\n\nThe problem came when the children and animals were exposed to the wild version of the virus.\n\nWhen that happened, an called Antibody Dependent Enhancement (ADE) also known as Vaccine Enhanced Disease (VED) occurred where the immune system produced a “cytokine storm” (i.e. overwhelmingly attacked the body), and the children/animals died.\n\nIn other words, never before has any attempt to make a coronavirus vaccine been successful, nor has the gene-therapy technology that is mRNA “vaccines” been safely brought to market, but hey, since they had billions of dollars in government funding, I’m sure they figured that out.\n\nExcept they don’t know if they have…\n\n#4: THE “DATA GAPS” SUBMITTED TO THE FDA BY THE VACCINE MAKERS\n\nWhen vaccine makers submitted their papers to the FDA for the Emergency Use Authorization (Note: An EUA is not the same as a full FDA approval), among the many “Data Gaps” they reported was that they have nothing in their trials to suggest they overcame that pesky problem of Vaccine Enhanced Disease.\n\nThey simply don’t know–i.e. they have no idea if the vaccines they’ve made will also produce the same cytokine storm (and deaths) as previous attempts at such products.\n\n“Previous attempts to develop an mRNA-based drug using lipid nanoparticles failed and had to be abandoned because when the dose was too low, the drug had no effect, and when dosed too high, the drug became too toxic. An obvious question is: What has changed that now makes this technology safe enough for mass use?”\n\nIf that’s not alarming enough, here are other gaps in the data–i.e. there is no data to suggest safety or efficacy regarding:\n• Anyone younger than age 18 or older than age 55\n• No data on transmission of covid\n• No data on preventing mortality from covid\n• No data on duration of protection from covid\n\nHard to believe right?\n\nIn case you think I’m making this up, or want to see the actual documents sent to the FDA by Pfizer and Moderna for their Emergency Use Authorization, you can check out , or respectively. The data gaps can be found starting with page 46 and 48 respectively.\n\nFor now let’s turn our eyes to the raw data the vaccine makers used to submit for emergency use authorization.\n\n#5: NO ACCESS TO THE RAW DATA FROM THE TRIALS\n\nWould you like to see the raw data that produced the “90% and 95% effective” claims touted in the news?\n\nBut they won’t let us see that data.\n\nAs pointed out in , something about the Pfizer and Moderna efficacy claims smells really funny.\n\nDid they fail to do science in their scientific study by not verifying a major variable?\n\nCould they not test those “suspected but unconfirmed” cases to find out if they had covid?\n\nWhy not test all 3,410 participants for the sake of accuracy?\n\nCan we only guess they didn’t test because it would mess up their “90-95% effective” claims?\n\nWould it not be prudent for the FDA, to expect (demand) that the vaccine makers test people who have “covid-like symptoms,” and release their raw data so outside, third-parties could examine how the manufacturers justified the numbers?\n\nI mean it’s only every citizen of the world we’re trying to get to take these experimental products…\n\nWhy did the FDA not require that? Isn’t that the entire purpose of the FDA anyway?\n\nSeems like it.\n\nObviously, with products that have only been on the market a few months, we have no long-term safety data.\n\nIn other words, we have no idea what this product will do in the body months or years from now–for ANY population.\n\nGiven all the risks above (risks that ALL pharmaceutical products have), would it not be prudent to wait to see if the worst-case scenarios have indeed been avoided?\n\nWould it not make sense to want to fill those pesky “data gaps” before we try to give this to every man, woman, and child on the planet?\n\nWell…that would make sense, but to have that data, they need to test it on people, which leads me to my next point…\n\nWhat most who are taking the vaccine don’t know is that because these products are still in clinical trials, anyone who gets the shot is now part of the clinical trial.\n\nThey are part of the experiment.\n\nThose (like me) who do not take it, are part of the control group.\n\nTime will tell how this experiment works out.\n\nBut, you may be asking, if the vaccines are causing harm, wouldn’t we be seeing that all over the news?\n\nSurely the FDA would step in and pause the distribution?\n\nWell, if the adverse events reporting system was working, maybe things would be different.\n\nAccording to (at the commission of our own government), less than 1% of all adverse reactions to vaccines are actually submitted to the National Vaccine Adverse Events Reports System (VAERS) – read page 6 at the link above.\n\nWhile the problems with VAERS have not been fixed (as you can read about in this letter to the CDC ), at the time of this writing over 2,200 deaths from the current covid vaccines, as well as close to 60,000 adverse reactions.\n\nAnd those numbers don’t include (what is currently) .\n\nIf those numbers are still only 1% of the total adverse reactions (or .8 to 2% of what published recently in the JAMA found), you can do the math, but that equates to somewhere around 110,000 to 220,000 deaths from the vaccines to date, and a ridiculous number of adverse reactions.\n\nBet you didn’t see that on the news.\n\nThat death number would currently still be lower than the 424,000 deaths from medical errors that happen every year (which you probably also don’t hear about), but we are not even six months into the rollout of these vaccines yet.\n\nIf you want a deeper dive into the problems with the VAERS reporting system, you can , or\n\nBut then there’s my next point, which could be argued makes these covid vaccines seem pointless…\n\n#9: THE VACCINES DO NOT STOP TRANSMISSION OR INFECTION\n\nAren’t these vaccines supposed to be what we’ve been waiting for to “go back to normal”?\n\nWhy do you think we’re getting all these conflicting messages about needing to practice social distancing and wear masks AFTER we get a vaccine?\n\nIf you don’t believe me, I refer you again to the papers submitted to the FDA I linked to above.\n\nThe primary endpoint (what the vaccines are meant to accomplish) is to lower your symptoms.\n\nSounds like just about every other drug on the market right?\n\nThat’s it…lowering your symptoms is the big payoff we’ve been waiting for.\n\nDoes that seem completely pointless to anyone but me?\n• It can’t stop us from spreading the virus.\n• It can’t stop the virus from infecting us once we have it.\n• To get the vaccine is to accept all the risk of these experimental products and the best it might do is lower symptoms?\n\nHeck, there are plenty of other things I can do to lower my symptoms that don’t involve taking what appears to be a really risky product.\n\nNow for the next logical question:\n\nIf it indeed reduces symptoms, anyone who gets it might not even know they are sick and thus they are more likely to spread the virus, right?\n\nFor what it’s worth, I’ve heard many people say the side effects of the vaccine (especially the second dose) are worse than catching covid.\n\nI can’t make sense of that either.\n\nKeep wearing your mask and social distancing…\n\nAnd continue to be able to spread the virus.\n\n#10: PEOPLE ARE CATCHING COVID AFTER BEING FULLY VACCINATED\n\nYou get vaccinated and you still catch covid.\n• It’s happening in several other states too .\n• It happened to 80% of 35 nuns who got the vaccine in Kentucky . Two of them died by the way.\n\nIn reality, this phenomenon is probably happening everywhere, but those are the ones making the news now.\n\nGiven the reasons above (and what’s below), maybe this doesn’t surprise you, but bummer if you thought the vaccine was a shield to keep you safe.\n\nThat was never the point.\n\nIf are going to delay or skip the vaccine…maybe they aren’t wowed by the rushed science either.\n\nMaybe they are watching the shady way deaths and cases are being reported…\n\n#11: THE OVERALL DEATH RATE FROM COVID\n\nAccording to the CDC’s own numbers, covid has a 99.74% survival rate.\n\nWhy would I take a risk on a product, that doesn’t stop infection or transmission, to help me overcome a cold that has a .26% chance of killing me–actually in my age range is has about a .1% chance of killing me (and .01% chance of killing my kids), but let’s not split hairs here.\n\nWith a bar (death rate) that low, we will be in lockdown every year…i.e. forever.\n\nBut wait, what about the 500,000 plus deaths, that’s alarming right?\n\nSomething smells really funny about this one.\n\nNever before in the history of death certificates has our own government changed how deaths are reported.\n\nWhy now, are we reporting everyone who dies with covid in their body, as having died of covid, rather than the co-morbidities that actually took their life?\n\nUntil covid, all coronaviruses (common colds) were never listed as the primary cause of death when someone died of heart disease, cancer, diabetes, auto-immune conditions, or any other major co-morbidity.\n\nThe disease was listed as the cause of death, and a confounding factor like flu or pneumonia was listed on a separate line.\n\nTo bloat the number even more, both the W.H.O. and the C.D.C. changed their guidelines such that those who are (but were never confirmed) of having died of covid, are also included in the death numbers.\n\nIf we are going to do that then should we not go back and change the numbers of all past cold and flu seasons so we can compare apples to apples when it comes to death rates?\n\nAccording to , (scroll down to the section “Comorbidities and other conditions”) only 6% of the deaths being attributed to covid are instances where covid seems to be the only issue at hand.\n\nIn other words, reduce the death numbers you see on the news by 94% and you have what is likely the real numbers of deaths from just covid.\n\nEven if is correct and covid-19 was a lab-enhanced virus (see Reason #14 below), a .26% death rate is still in line with the viral death rate that circles the planet ever year.\n\nI’d really love to trust him, but besides the fact that he hasn’t treated one covid patient…you should probably know…\n\n#13: FAUCI AND SIX OTHERS AT NIAID OWN PATENTS IN THE MODERNA VACCINE\n\nThanks to the Bayh-Dole Act, government workers are allowed to file patents on any research they do using tax payer funding.\n\nTony Fauci owns over 1,000 patents (see this video for more details , including patents being used on the Moderna vaccine…which he approved government funding for.\n\nIn fact, the NIH (which NIAID is part of) of Moderna’s vaccine.\n\nDoes anyone else see this as a MAJOR conflict of interest, or criminal even?\n\nI say criminal because there’s also this pesky problem that makes me even more distrustful of Fauci, NIAD, and the NIH in general.\n\n#14: FAUCI IS ON THE HOT SEAT FOR ILLEGAL GAIN-OF-FUNCTION RESEARCH\n\nIt’s where scientists attempt to make viruses gain functions–i.e. make them more transmissible and deadlier.\n\nSounds at least a touch unethical, right?\n\nHow could that possibly be helpful?\n\nOur government agreed, and banned the practice.\n\nSo what did the Fauci-led NIAID do?\n\nThey pivoted and (in coronaviruses no less) to China–to the tune of a $600K grant.\n\nYou can see more details, including the important timeline of these events in this .\n\nMr. Fauci, you have some explaining to do…and I hope the cameras are recording when you have to defend your actions.\n\nFor now, let’s turn our attention back to the virus…\n\nNot only does the virus (like all viruses) continue to mutate, but according to world-renowned vaccine developer Geert Vanden Bossche (who you’ll meet below if you don’t know him) it’s mutating about every 10 hours.\n\nHow in the world are we going to keep creating vaccines to keep up with that level of mutation?\n\n\n\n Might that also explain why fully vaccinated people are continuing to catch covid?\n\nWhy, given that natural immunity has never ultimately failed humanity, do we suddenly not trust it?\n\nWhy, if I ask questions like the above, or post links like what you find above, will my thoughts be deleted from all major social media platforms?\n\nThat brings me to the next troubling problem I have with these vaccines.\n\nI can’t help but get snarky here, so humor me.\n\nHow did you enjoy all those nationally and globally-televised, robust debates put on by public health officials, and broadcast simultaneously on every major news station?\n\nWasn’t it great hearing from the best minds in medicine, virology, epidemiology, economics, and vaccinology from all over the world as they vigorously and respectfully debated things like:\n• How to screen for susceptibility to vaccine injury\n\nWasn’t it great seeing public health officials (who never treated anyone with covid) have their “science” questioned?\n\nWasn’t it great seeing the FDA panel publicly grill the vaccine makers in prime time as they stood in the hot-seat of tough questions about products of which they have no liability?\n\nOh, wait…you didn’t see those debates?\n\nNo, you didn’t…because they never happened.\n\nWhat happened instead was heavy-handed censorship of all but one narrative.\n\nWhen did the first amendment become a suggestion?\n\nIt’s the FIRST amendment Mark–the one our founders thought was most important.\n\nWith so much at stake, why are we fed only one narrative…shouldn’t many perspectives be heard and professionally debated?\n\nWHAT HAS HAPPENED TO SCIENCE?\n\nWhat has happened to the scientific method of always challenging our assumptions?\n\nWhat happened to lively debate in this country, or at least in Western society?\n\nWhy did anyone who disagrees with the WHO, or the CDC get censored so heavily?\n\nIs the science of public health a religion now, or is science supposed to be about debate?\n\nIf someone says “the science is settled” that’s how I know I’m dealing with someone who is closed minded.\n\nBy definition science (especially biological science) is never settled.\n\nIf it was, it would be dogma, not science.\n\nOK, before I get too worked up, let me say this…\n\nI WANT TO BE A GOOD CITIZEN\n\nIf lockdowns work, I want to do my part and stay home.\n\nIf masks work, I want to wear them.\n\nIf social distancing is effective, I want to comply.\n\nBut, if there is evidence they don’t ( ), I want to hear that evidence too.\n\nIf highly-credentialed scientists have different opinions, I want to know what they think.\n\nI want a chance to hear their arguments and make up my own mind.\n\nI don’t think I’m the smartest person in the world, but I think I can think.\n\nMaybe I’m weird, but if someone is censored, then I REALLY want to hear what they think.\n\nTo all my friends who don’t have a problem with censorship, will you have the same opinion when what you think is censored?\n\nIs censorship not the technique of dictators, tyrants, and greedy, power-hungry people?\n\nIs it not a sign that those who are doing the censoring know it’s the only way they can win?\n\nWhat if he pleaded for an open-scientific debate on a global stage?\n\nWould you want to hear what he has to say?\n\nWould you want to see the debate he’s asking for?\n\n#17: THE WORLD’S LEADING VACCINOLOGIST IS SOUNDING THE ALARM…\n\nHere is what may be the biggest reason this covid vaccine doesn’t make sense to me.\n\nWhen someone who is very pro-vaccine, who has spent his entire professional career overseeing the development of vaccines, is shouting from the mountaintops that we have a major problem, I think the man should be heard.\n\nIn case you missed it, and in case you care to watch it, , explaining:\n• Why the covid vaccine may be putting so much pressure on the virus that we are accelerating it’s ability to mutate and become more deadly.\n• Why the covid vaccines may be creating vaccine-resistant viruses (similar to anti-biotic resistant bacteria).\n• Why, because of previous problems with Antibody Dependent Enhancement, we may be looking at a mass casualty event in the next few months/years.\n\nIf you want to see/read about a second, and longer, interview with Vanden Bossche, where he was asked some tough questions, you can .\n\nIf half of what he says comes true, these vaccines could be the worst invention of all time.\n\nIf you don’t like his science, take it up with him.\n\nBut I can also speak to covid personally.\n\nIt was a nasty cold for two days:\n\nIt was weird not being able to smell anything for a couple days.\n\nA week later, coffee still tasted a little “off.”\n\nNow it appears (as it always has) that I have …\n\n…not something likely to wear off in a few months if I get the vaccine.\n\nIn my body, and my household, covid is over.\n\nIn fact, now that I’ve had it, there is evidence the covid vaccine might actually be more dangerous for me.\n\nThat is not a risk I’m willing to take.\n\nThe above are just my reasons for not wanting the vaccine.\n\nMaybe my reasons make sense to you, maybe they don’t.\n\nWhatever does makes sense to you, hopefully we can still be friends.\n\nI for one think there’s a lot more that we have in common than what separates us.\n• We all want to live in a world of freedom.\n• We all want to do our part to help others and to live well.\n• We all want the right to express our opinions without fearing we’ll be censored or viciously attacked.\n• We all deserve to have the access to the facts so we can make informed decisions.\n\nAgree or disagree with me; I’ll treat you no differently.\n\nYou’re a human just as worthy of love and respect as anyone else.\n\nFor that I salute you, and I truly wish you all the best.\n\nIf so, feel free to share.\n\nIf not, feel free to (kindly) let me know what didn’t make sense to you and I’d be happy to hear your thoughts too.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "18 Reasons I Won't Be Getting a Covid Vaccine - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/04/18-reasons-i-wont-be-getting-a-covid-vaccine/", "site_name": "The Automatic Earth", "article:published_time": "2021-04-18T11:35:26+00:00", "article:modified_time": "2021-04-18T11:35:31+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/04/GustavKlimtLitzlbergamAttersee1914.jpg"}, "tags": ["informed consent", "Christian Elliot", "VAERS", "vaccine makers", "transmission", "Moderna", "Fauci", "COVID", "infection", "vaccine", "Pfizer", "liability"], "tweets": [], "movies": [], "links": ["https://commons.wikimedia.org/wiki/File:Gustav_Klimt_-_Litzlberg_am_Attersee.jpg", "https://www.deconstructingconventional.com/post/18-reason-i-won-t-be-getting-a-covid-vaccine", "https://childrenshealthdefense.org/defender/johnson-johnson-why-trust-vaccine/", "https://www.mp-22.com/vax", "https://www.wionews.com/world/how-pfizer-tried-to-bully-argentina-and-brazil-in-exchange-for-vaccines-366037", "https://www.justice.gov/opa/pr/pharmaceutical-giant-astrazeneca-pay-520-million-label-drug-marketing", "https://www.reuters.com/article/us-astrazeneca-texas-lawsuits-idUSKBN1KT0Q9", "https://www.businessinsider.com/astrazeneca-covid-vaccine-countries-suspend-denmark-thailand-batch-blood-clots-2021-3?op=1", "https://thehighwire.com/videos/astrazeneca-vaccine-falls-from-grace/", "https://childrenshealthdefense.org/defender/johnson-johnson-astrazeneca-covid-vaccine-ingredient-mix-up/", "https://www.nature.com/articles/s41579-020-00462-y#Sec11", "https://www.nature.com/articles/s41579-020-00462-y#Sec11", "https://www.frontiersin.org/articles/10.3389/fmicb.2018.02991/full", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC525089/", "https://www.nature.com/news/2005/050110/full/050110-3.html#ref-CR1", "https://www.pnas.org/content/102/3/797", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3335060/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3335060/", "https://www.tandfonline.com/doi/full/10.1080/21645515.2016.1177688?scroll=top&needAccess=true", "https://science.sciencemag.org/content/303/5660/944.abstract", "https://www.statnews.com/2017/01/10/moderna-trouble-mrna/", "https://articles.mercola.com/sites/articles/archive/2021/02/10/nanoparticles-in-moderna-vaccine.aspx", "https://www.fda.gov/media/144245/download", "https://www.fda.gov/media/144434/download", "https://blogs.bmj.com/bmj/2021/01/04/peter-doshi-pfizer-and-modernas-95-effective-vaccines-we-need-more-details-and-the-raw-data/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bmj%2Fblogs+%28Latest+BMJ+blogs%29&g=w_bmj-com", "https://www.icandecide.org/wp-content/uploads/2020/12/Lazarus-report.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/Letter-to-Dr.-Walensky-re-anaphylaxis.pdf", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS[]=Bell%27s+palsy+%2810004223%29&SYMPTOMS[]=Facial+discomfort+%2810083537%29&SYMPTOMS[]=Facial+dysmorphism+%2810016045%29&SYMPTOMS[]=Facial+nerve+disorder+%2810061457%29&SYMPTOMS[]=Facial+neuralgia+%2810061594%29&SYMPTOMS[]=Facial+palsy+%2810016060%29&SYMPTOMS[]=Facial+paralysis+%2810016062%29&SYMPTOMS[]=Facial+paresis+%2810051267%29&SYMPTOMS[]=Facial+spasm+%2810063006%29&VAX=COVID19", "https://jamanetwork.com/journals/jama/fullarticle/2777417", "https://childrenshealthdefense.org/defender/vaccine-injury-reporting-systems-utterly-inadequate/", "https://childrenshealthdefense.org/defender/covid-vaccine-injuries-vaers-cdc/?utm_source=salsa&eType=EmailBlastContent&eId=9af36675-e8d3-4040-a6be-abcb46990996", "https://www.theepochtimes.com/over-100-fully-vaccinated-people-in-washington-state-test-positive-for-covid-19_3757218.html", "https://www.theepochtimes.com/long-island-woman-tests-covid-19-positive-after-taking-second-vaccine-shot_3757019.html", "https://www.deadlinedetroit.com/articles/27635/updated_vaccinated_oakland_county_woman_gets_covid_michigan_identifies_145_others", "https://www.theepochtimes.com/3-fully-vaccinated-hawaii-residents-test-positive-for-covid-19_3745456.html", "https://childrenshealthdefense.org/defender/states-report-covid-cases-fully-vaccinated/", "https://www.lifesitenews.com/news/several-nuns-die-after-taking-first-shot-of-covid-vaccine", "https://www.washingtonpost.com/business/2020/11/21/vaccines-advocates-nurses-doctors-coronavirus/", "https://www.who.int/classifications/classification-of-diseases/emergency-use-icd-codes-for-covid-19-disease-outbreak", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://thehighwire.com/videos/covid-origin-controversy-reignited/", "https://childrenshealthdefense.org/defender/truth-rfk-jr-naomi-wolf-constitutional-rights/?utm_source=salsa&eType=EmailBlastContent&eId=26b5c090-223d-4d5d-9526-e0f692535e8c", "https://www.axios.com/moderna-nih-coronavirus-vaccine-ownership-agreements-22051c42-2dee-4b19-938d-099afd71f6a0.html", "https://www.dailysignal.com/2021/04/06/fauci-must-explain-why-oversight-bypassed-for-funding-to-wuhan-lab-congressman-says/", "https://www.bitchute.com/video/4u7rt61YeGox/", "https://www.washingtontimes.com/news/2021/feb/17/mark-zuckerberg-violating-own-policy-early-vaccine/", "https://thewallwillfall.org/2020/06/23/masks-dont-work-a-review-of-science-relevant-to-covid-19-social-policy/", "https://www.youtube.com/watch?v=ZJZxiNxYLpc&t=2128s", "https://www.youtube.com/watch?v=ZJZxiNxYLpc&t=2128s", "https://www.youtube.com/watch?v=ZJZxiNxYLpc&t=2128s", "https://childrenshealthdefense.org/defender/interview-rob-verkerk-vanden-bossche-mass-covid-vaccinations/", "https://pubmed.ncbi.nlm.nih.gov/33408181/", "https://childrenshealthdefense.org/defender/scientists-challenge-health-officials-on-vaccinating-covid/?utm_source=salsa&eType=EmailBlastContent&eId=f9f42235-fc83-4837-a2e2-c8362cc97140", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-04-18T11:35:26+00:00"}