{"result_id": "285035", "URL": "https://www.theautomaticearth.com/forums/users/noirette/replies/page/17/", "timestamp": "2023-04-25 17:16:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/forums/users/noirette/replies/page/17/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Page 17 – The Automatic Earth", "cleaned_text": "Ilargi wrote: ..it’s also that the volunteers who work in the kitchen get even more of a sense of pride and self-worth from doing something that really changes human lives. Don’t underestimate the loss of pride, of having a goal in life, there are so many facets to this, of not being able to do your job for 5 months. And then to be able to contribute to helping the neediest people in your society, it gains a whole new meaning. I volunteer 2 mornings a week for a large ‘religious’ charity. All the those who work there are either: volunteers – ppl sent by social services (paid a bit by them, to get experience, learn stuff, be someone, etc.) – properly paid employees (e.g. truck driver, cleaner, decorator, seamstress, accountant) – ppl working part-time for reduced pay (because they get a state stipend for disability for ex.) – other. A big crowd, from a ret. prof (much respected), to a girl ‘say’ from the gutter. Sometimes there is some uneasiness …but Swissie culture is good at overcoming class / educ. distinctions. All are committed to raking in as much as possible to give to the disadvantaged, the shared goal works (more or less…) And “goals in life” (see Ilargi)… yes… The sad story of the day, is the ret. prof, aged about 80, who was previously complaining about not having his vax appointment honored (some screw-up?) got it, then drove home, arriving there, got out of his car, passed out, fell down, was found by passers-by, and hasn’t been back since… though reportedly he is ‘doing OK.’ Working for an entity that considers that everything done must be for profit is not only destructive of society, but sears the soul (as seeing or not the soul of Putin etc. was a topic previous) of those who are coerced or forced, thru lack of alternatives, to participate in it.\n\nRe. comparisons between industry funded / vs not so medical research .. recommended: Epistemic Corruption, the Pharmaceutical Industry, and the Body of Medical Science by Sergio Sismondo, Department of Philosophy, Queen’s University, Kingston, ON, Canada Paper is short, gives some review of previous attempts. quote: My focus here is on how the pharmaceutical industry corrupts medical science. -> that the ‘conflict of interest’ concerns / shows of clean hands are really facticious -> that much of the industry clinical research trials are ‘farmed out’ to contract research orgs – this part is the meat of the paper A point he might have made but did not (see e) .. in the paper) is that somehow it has become widley accepted and shrilly touted that there is a **gold standard** in med. res. i.e. the double-blind w. placebo trial. Some ‘methods’ are superior to others, are the tops! —BS. Different questions / problems / potential ‘scientific’ support for practices, call for different research approaches, methods, it all depends on many factors, and all have contstraints on them, e.g. ethical, theoretical, etc. etc. — This attitude serves to decry purely observational studies, which are just as good. (Other point which I may tackle later.) The nitty-gritty is that such trials are very expensive to run, and Big-Med-Pharma can afford it, while others either can’t or consider them not needed, useless, or a waste. (More pointless endavours, jobs, etc.) (Natch cheating even in such supposed ‘rigorous’ efforts is easily accomplished.) I think it was madamski who ironically wrote “Science following the Science” or something like that, it made me laugh, but it is so apt. Here we see that certain interests define what “The Science” should aspire to, or be, or display itself as, as engineered by powerful moneyed interests, Big Corps, and by extension, their paid-up politicians.\n\nI am having trouble in understanding why Biden was appointed President. I can only see this event as a strong indicator of the weakening and coming effritement, slow shattering, splintering, degrading, of the Pax Americana, of the USA as a dominant power, or even, in some time, of the USA as a viable, cohesive entity. // Taking it for granted that the election was stolen and Biden was chosen by a DNC cabal – see all the other candidates quitting – / by the PTB / aka Deep State / some combo / or all. // 1. Biden is the perfect puppet, as he doesn’t understand what is going on. US presidents are all puppets in a way, since Bush J., just to quote an arbitrary point (as in other countries as well), the trick is to find one who looks good. But, Biden presents a decrepit, abysmal, public face, doing *irreparable* harm to the USA’s image. Similarly, the idea that “the aim is for Biden to die / quit and Harris to become President” is lame, this can be accomplished with any President. Moreover what would be the advantage of having Harris as Prezzie? Just another puppet and not competent.. loathed by many…> It all seems like a shoot-yourself in the foot exercise. In the ROW, all important ppl, pols, etc. know that Biden is a senile basket case, not even a real person .. (Medicos consider his being hoisted to the post elder abuse.) The Biden – Russia, Blinken – China events show that expressed resistance to and disdain of the US has risen, and cynical triumphant laughter from round-about is echoing loudly. 2. Is the aim WW3? A blundering idiot Prez. and crossed signals provoke growing animosity – Russia, Russia, Russia, bis repetita, resistance to China’s rise and development, etc. Which then goes ka-blooie…and most of us die. Yet, in the US some survive, etc. Heh sounds like future-fic. If so, this isn’t well thought-out. 3. Might certain factions desire a break-up of the USA to return power to more local forces? Leading to some split-ups, aka secessions, the US states? For more control? 4. A few powerful ppl hope for tremendous financial returns. That is a constant, but what they do / how etc. is another story.\n\nIs it that my left leaning friends were always this credulous? Is it just because so many are stuck in these digital media bubble silos that surround our minds in cottony propaganda? Because we are not interacting face to face and it this is preventing many from obtaining accurate bearings on what is going on in the world? – phoenix voice. If by left-leaning one means, in the US, voting Dem, or being a “progressive”, ppl who might consider for ex. the Obama admin not ‘left enough’ etc., or being a Bernie Bro, angry at how he was treated .. In France, as the similarities are striking, adhering to the Socialist Party, having voted for Hollande (Socialist) as opposed to Sarkozy (who was supposedly ‘right wing’) — In fact the both were centrists but colored their positions to appeal to different demographic groups, then: These left-leaning ppl are, yes, credulous in the sense that they believe, or pretend to believe, adhere to, the touted facts, stances, opinions, positions, of the lefter faction within the ‘allowed’ politics in the US and France. They belong to, or aspire to join, or feel they truly desperately need to embrace the ethos of the 20%, of – not the richest as that metric is often used – but the 20% who occupy positions of expertise and power. E.g. sitting on decision nodes, important position in Gvmt. in education, health, working in the MSM and molding opinions, being a U prof, an expert in some kinda science, or demonstrating special gifts in the various arts, etc. Their main motivation is to be part of the professional-managerial class (PMC, as opposed to ‘workers’ lowly types, deplorables..), with vociferous hangers-on (spouses for ex.), or wanting to sell to those who can pay. (Hot Art, etc.) Their status, with the attendant super perks, monetary and other, is attained, or should be awarded! they feel! .. Because of moral criteria, ethical probity, political correct vision, a genuine caring for ‘lower groups.’ Therefore, they use preachy wide-eyed posturing that appears to favor the oppressed, the victims of society (it is necessary to perpetually invent new ones..!) without ever having any impact whatsoever, for ex. on Black ppl being imprisoned for minor drug / other offenses… or the Prison Industry as a whole. They are hypocrites, aren’t ‘left,’ in the old sense of ppls control of production, worker’s rights, care for the weak (helping families, med care needed, education, advancing society, dealing with x y z…) They have zero interest in an egalitarian society, they just want to climb up the ladder to join the Tops, and be pandered to, admired. They thus support Big Pharma, the MIC, the Banks (Obama was a champ on that score) and ally with the neo-cons, etc. or whomever is killing efficiently. The ‘right’ in this frame is another story – less hypocritical.\n\nThe vaccination of children and v. young people contra-covid is totally crazy and beyond the pale (see upstateNYer, Doc Robinson, others, in previous thread.) What has happened with the Pfizer, Moderna, vaccines shows there is a breakdown between ‘official’ – Gvmt. produced so to speak – advisories, and what happens on the ground. For ex. the UK advisory for the Pfizer jab stated clearly that, It is unknown whether /vaccine/ has an impact on fertility. (For men and women) Safety for under-16 not demonstrated.. and more …laid out pretty clearly… On the ground, the advisories are not followed because of hype and propaganda for the VAX which works via ascarcity thus desirable model as well as the ‘emulation model, popular movie stars, fantastic ppl, take the vax, some saintly women are even willing to die from it, and so on. Just like the ads strategy used for ex. for expensive handbags (some models from Vuitton) and watches (Rolex top of range..) These AD methods are used because they are the only way of by-passing the Gvmt. official strictures, not that those are in fact ‘independent’ or ‘rigorous’ or ‘best science’ etc. Many of them have been corrupted by corporare funds and the attendant melding of corps – “humanitarian” – other, ex. UN orgs – and State, and are on the take / have thru corruption become completely incompetent. Still, these various instituted bodies are obliged to pretend, and display a weak, imho unconvincing, version of ‘clean hands’ and “fulfilling our mandate.” Pregnant women should not be vaxxed, but on the ground, they are, and are mighty proud, and that is all fine with >> the MSM, others, nobody objects. So part of all that swampy mess is that if the VAX promotes health and Proteks (sic!) it must also be good for our little kiddies, who should be allowed to ‘get’ it, but, for their safety, you never know, we will test it first!\n\nData is hard to find, one has to get around a ‘page doesn’t exist’ thingie. Links in a 2nd post. From the French Public Health site. Nos. are cumulative to 5 March (or noted if different) *All are certainly undercounts; the report does not warn about this.* *this is jabs and not ppl fully vaccinated, fully vaxxed maybe about 5% of the population* For just one week, last week in Feb, 29% serious, 71% not serious. *the no. is not given, I’m peering at a shoddy chart* *Vaxxed, from other stats, is 60% women and 40% men, as the group ‘working in med / health / old ppls homes etc. are predominantly F. Still .. ?* *As the huge majority of ppl vaxxed have been elderly, this shows that relatively ‘younger’ ppl experience more serious side effects. All the F stats have been very reticent re. age-groups, and this info is often missing, or obfuscated somehow. For ex, in the report summarized here, no “effects” / the deaths are detailed by age.* Serious effects of ‘special interest’ – implying not all are listed – total on the list is 834: 54 hemorragic disease (idk what exactly this refers to) *this cat. appears as the last entry on the table, it is not a total, but a separate category.* (very sneaky) peculiarly Diabetes is on the list (9)! The list is incomplete because accompanying text mentions zona (shingles) while stating “most cases weren’t serious” (91 cases.) High blood pressure is also mentioned but not on the list. So the F official site logs 217 deaths as directly caused by the Pfizer vax. Implied as well is the Pfizer vax causes Covid-19, if only in a very few cases. I have never seen such a mess in F. stats. The F. are good at math, good at stats, and many of the d-bases and Gvmt. reports on all kinds of topics are well done, or OK, acceptable, and can be downloaded, checked, etc. Caveats are regularly in the prelude, introduction. E.g. employment (in all its forms), leukemia cases, prisoners, etc. Naturally, many damning or sensitive numbers / topics are simply not published, the control is tight.\n\nA general question for those of us who live in Europe is why there’s no promotion of alternatives to vaccines at all? If I even mention this kind of thing to friends and colleagues then they roll their eyes, call me a “wappie” (a Dutch colloquial term for a conspiracy theorist) and the conversation is shut down. The so-called rich Western countries (EU, USA..) have suffered big time from COV-19. Demographic reasons: 1) Far more older ppl, e.g. over 80, vulnerable / many with underlying conditions, 2) More obese ppl, 3) Societal, more consumption, more moving around, more crowds, more ‘lotsa contacts’ as in partying in discos, etc. A short list, one could go on. What also counts is Health Authorities (Ministers, Advisors, > their directives, etc.) who are incompetent and arrogant with it. Ex. Macron and his ex-Health Minister Buzyn, Boris Johnson and Neil Ferguson. These ‘leaders’, plus their previous incarnations, have been running ‘Austerity’ on health services since the nineties if not before. They themselves know they can pay for their own health care, and ‘smart technology’ and ‘just in time’ and ‘wonderful new scientific advances’ will be ‘innovative’ and … will do the job. What the job is remains unspecified. The Gov. top dogs, EU, are in lien with Big Pharma, and even subservient to it. Because they are lackeys to Mega Corps, in a general way, and Pharma is of course a fantastic money maker, it occupies a no. 1 spot on the Podium. (Many will pay their last cent and go into enormous debt to save a loved one.) The links between Pharma Cos, health personnel – Docs, Hospitals, makers of equipment, etc. – Lobbyists who are well paid – the Parasites on the system (Insurance Cos. for ex.) and elected representatives (corrupted), plus Organisations like GAVI, the Wellcome Trust, the Gates Foundation, are very consequent, robust, and together they steer what happens. The MSM, the easily accessible media, supports the powerful, and of course prioritize fear, anxiety, as that awards them profits (views, clicks, ads, donations, etc.) They serve, and align with, the ppl behind the scenes who are directing, if confusedly. The top dogs in “W” countries, hard-hit, and facing unwelcome difficulties (finances, disruptions, loss of income, trade, energy questions, etc.), put their efforts behind vaccines, which would “solve” all in one stroke, while also feeding their 5-star club-member, Big Pharma. Deaths of old people and others are not a consideration. The handmaiden MSM supports all this 100% and will not give any space to any alternative voices, while ridiculing and mocking anybody for what they imagine or claim to be total loopy BS. Danish citizens who watch TV can only dismiss any questions or objections to the MSM mantras as coming from ‘conspiracy theorists,’ crazy people.", "opengraph": {"locale": "en_US", "type": "website", "site_name": "The Automatic Earth"}, "tags": ["Debt Rattle March 19 2021", "Debt Rattle March 28 2021", "#71689", "Debt Rattle March 13 2021", "#71106", "Treat Your Own COVID", "#70484", "Debt Rattle March 25 2021", "#70477", "#70574", "#70575", "#70476", "#70572", "#70480", "#70901", "Debt Rattle March 10 2021", "#70483", "#71390", "#71391", "ONLY", "Debt Rattle February 8 2021", "#70790", "Debt Rattle March 24 2021", "#71035", "#70902", "#69446", "Debt Rattle March 8 2021", "Debt Rattle March 7 2021", "#69435", "Debt Rattle February 6 2021", "Debt Rattle March 18 2021", "#71442", "#71033", "#70573", "#71688", "Covid Rattle March 4 2021", "Debt Rattle March 3 2021", "#71758", "Debt Rattle March 21 2021", "#71389", "#70632", "Debt Rattle March 5 2021", "#70486", "#70965", "Automatic Earth in Athens Spring 2021", "#71760", "Mass Vaccination Amidst A Pandemic Creates An Irrepressible Monster", "#71503", "#70487", "#70635", "#71860", "#71531", "#71388", "#70966", "#71917", "Emergency vs Humanity", "#69384", "#71759", "#70749", "#70488"], "tweets": [], "movies": [], "links": ["https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://doi.org/10.3389/frma.2021.614013", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://bit.ly/3sk9isK", "https://www.rferl.org/a/putin-denounces-eu-confrontational-stance/31163983.html", "http://russiepolitics.blogspot.com/2021/03/conversation-poutine-michel-lue-veut.html#more", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.lejdd.fr/Societe/vaccin-contre-le-covid-19-quest-ce-que-le-consentement-4015419", "https://apnews.com/article/europe-spain-europe-coronavirus-pandemic-coronavirus-vaccine-d22a37f7e33ff198833d5fceace3e20e", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.lejdd.fr/Societe/vaccin-contre-le-covid-19-quest-ce-que-le-consentement-4015419", "https://apnews.com/article/europe-spain-europe-coronavirus-pandemic-coronavirus-vaccine-d22a37f7e33ff198833d5fceace3e20e", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://bit.ly/3l4nuTU", "https://www.theautomaticearth.com/forums/users/noirette/", "https://be.linkedin.com/in/geertvandenbossche", "https://www.theautomaticearth.com/forums/users/noirette/", "https://ansm.sante.fr/S-informer/Actualite/Point-de-situation-sur-la-surveillance-des-vaccins-contre-la-COVID-193", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.sciencemag.org/news/2021/03/international-megatrial-coronavirus-treatments-standstill", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://bbc.in/2NSNeGJ", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.ukcolumn.org/article/why-there-correlation-between-vaccine-rollout-and-increased-covid–19-mortality", "https://www.theautomaticearth.com/forums/users/noirette/", "https://bit.ly/30a1ywS", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.documentcloud.org/documents/6981198-", "https://www.theautomaticearth.com/forums/users/noirette/", "https://swprs.org/covid-19-virus-origin-the-mojiang-miners/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://jacobinmag.com/2021/02/finland-vaccine-covid-patent-ip", "https://www.theautomaticearth.com/forums/users/noirette/", "https://tapnewswire.com/2021/03/who-insider-blows-whistle-on-gates-and-gavi-video/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://www.theautomaticearth.com/forums/users/noirette/", "https://bit.ly/3jspHb0"], "authors": [], "publish_date": null}