{"result_id": "285024", "URL": "https://www.theautomaticearth.com/tag/vaccine-injured/", "timestamp": "2023-04-25 17:16:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/vaccine-injured/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "vaccine injured Archives", "cleaned_text": "\n• Russia And China Haven’t Even Started To Ratchet Up The Pain Dial (Escobar)\n\nA case can be made that Putin and Russia’s Security Council are implementing a tactical trifecta that has reduced the collective West to an amorphous bunch of bio headless chickens. The trifecta mixes the promise of negotiations – but only when considering Russia’s steady advances on the ground in Novorossiya; the fact that Russia’s global “isolation” has been proved in practice to be nonsense; and tweaking the most visible pain dial of them all: Europe’s dependence on Russian energy. The main reason for the graphic, thundering failure of the G20 Foreign Ministers summit in Bali is that the G7 – or NATOstan plus American colony Japan – could not force the BRICS plus major Global South players to isolate, sanction and/or demonize Russia. On the contrary: multiple interpolations outside of the G20 spell out even more Eurasia-wide integration. Here are a few examples. The first transit of Russian products to India via the International North-South Transportation Corridor (INSTC) is now in effect, crisscrossing Eurasia from Mumbai to the Baltic via Iranian ports (Chabahar or Bandar Abbas), the Caspian Sea, and Southern and Central Russia. Crucially, the route is shorter and cheaper than going through the Suez Canal. In parallel, the head of the Iranian Central Bank, Ali Salehabadi, confirmed that a memorandum of interbank cooperation was signed between Tehran and Moscow. That means a viable alternative to SWIFT, and a direct consequence of Iran’s application to become a full BRICS member, announced at the recent summit in Beijing. The BRICS, since 2014, when the New Development Bank (NDB) was founded, have been busy building their own financial infrastructure, including the near future creation of a single reserve currency. As part of the process, the harmonization of Russian and Iranian banking systems is inevitable. Iran is also about to become a full member of the Shanghai Cooperation Organization (SCO) at the upcoming summit in Samarkand in September. In parallel, Russia and Kazakhstan are solidifying their strategic partnership: Kazakhstan is a key member of BRI, EAEU and SCO. India gets even closer to Russia across the whole spectrum of trade – including energy. And next Tuesday, Tehran will be the stage for a crucial face-to-face meeting between Putin and Erdogan. Isolation? Really?\n\nRussia state TV is kind of wild, and not the Kremlin.\n• Russia State TV: War Will Expand To Poland If US Continues To Arm Ukraine (NYP)\n\n“All these weapons land in southern Poland” “..we have no idea where they go, where they are used or even if they stay in the country.”\n• NATO and EU Sound Alarm Over Risk Of Ukraine Weapons Smuggling (FT)\n\nNato and EU states are pushing for better tracking of weapons supplied to Ukraine in response to fears that criminal groups are smuggling them out of the country and on to Europe’s black market. Since Russia launched its war against Ukraine, western states have pledged more than $10bn in military support, from portable rocket launchers and armoured vehicles to rifles and vast amounts of ammunition. A number of Nato member states are discussing with Kyiv some form of tracking system or detailed inventory lists for weapons supplied to Ukraine, two western officials briefed on the talks told the Financial Times. Ukraine’s government is setting up a more extensive weapons monitoring and tracing system with the help of western countries, a third person familiar with the situation said. \n\n “All these weapons land in southern Poland, get shipped to the border and then are just divided up into vehicles to cross: trucks, vans, sometimes private cars,” said one of the western officials. “And from that moment we go blank on their location and we have no idea where they go, where they are used or even if they stay in the country.” The potential for US weapons sent to Ukraine to fall into the wrong hands is “among a host of considerations” given the “challenging situation” on the ground in the country, said Bonnie Denise Jenkins, US under secretary for arms control and international security, on Tuesday. s“The US very seriously takes our responsibility to protect American origin defence technologies and prevent their diversion or illicit proliferation,” Jenkins told reporters in Brussels, adding that the US was in “continued contact” with Kyiv on the issue.\n\nThe west accelerates its own demise.\n• The International Political Debacle: The Unipolar System Is Crumbling (Wilbert)\n\nThe multipolar world was going to emerge one way or another, but the mistakes of the Western leaders accelerated a process that would still take some years, and it can’t cope since it governs for less than 1 billion people (G7 population). And Operation Z in Ukraine was the trigger for a lack of diplomatic tact and will to war that even caused Ukraine’s allied leaders to fall, such as Boris Johnson. The bankruptcy of Europe was also imminent, since the various economic dependencies, including on Russian gas, prove that the continent, despite being so-called First World, was unable to generate an economy based on a real production of resources. And all attempts to escape from this dependency would lead to at least 10 years of pipeline works and economic agreements-treaties between other countries and them. So it’s not like it was easy either to have prevented what was predestined to happen, but it could have been delayed if there was the right diplomacy, since the war was avoidable. But how? Simple. I’ll explain. What was Putin’s key argument? “Ukraine cannot join NATO!” And what could the West have done? Generated a document in multilateral coordination with the appropriate entities recognizing that the security of Russia, a member of the UN Security Council, was an important issue and Ukraine would not join the Atlanticist military alliance. Or: they could put 50,000 or 100,000 troops inside Kiev to stand up to the Russians since Biden shortly before the Special Military Operation began, acknowledged that Putin would “invade Ukraine,” so they knew the risks. But they did neither. They wanted this war but it is not going as planned because the political debacle is happening, with the leaders who support the Atlanticist platforms falling away little by little, leaving the enthusiasts of the multipolar world standing like Putin and Xi Jinping in their proper nuclear strongholds. Moreover, it is interesting to note how parts of the Global South opposed the various diplomatic and economic sanctions on Russia, showing that they were unwilling to continue functioning as American semi-colonies in diplomatic and other matters. It was inevitable that a totally new world would emerge out of the totally destroyed old world, because that is the natural way of what comes after destruction: reconstruction or new construction. And that is what is happening to the world at present, in that we see prominent leaders being murdered in the open or resignations due to inability of governance, clear signs of destruction. And after the destruction will come the construction, of which we don’t know what it will look like yet, but the first bricks have already been laid.\n\n“Volcker was jacking rates into a planet with about $200T LESS debt.”\n• The Fed’s Financial Nuke Will Obliterate The Global Economy (McDonald)\n\nWe are living in a period of mass “Jonestown” economic delusion. Just twenty months ago – central bankers were offering to buy nearly every junk bond known to mankind, dramatically distorting the “true cost of capital.” All the way from crypto to emerging markets – it was a moral hazard overdose. Everyone on earth was borrowing money at fantasy-land bond yields. Now, the Fed is promising endless rate hikes and $1T of balance sheet reduction onto a planet with emerging market and Euro-zone credit markets in flames. Listen, all I have is an economics degree from the University of Massachusetts, but after having spent the last 20 years trading bonds professionally and embarking on a 20k feet deep autopsy on the largest bank failure of all time – from my seat the current Fed agenda is sheer madness and will be outed very soon. The true cost of capital was distorted for so long, we now have hundreds of academics– clueless to the underlying serpent inside global markets. When the 6 foot seven, Paul Volcker walked the halls of the Marriner S. Eccles Building of the Federal Reserve Board in Washington, our planet embraced about $200T LESS debt than we are staring down the barrel at today. Please call out the risk management imbeciles that make any reference of “Powell to Volcker.” In 2021, global debt reached a record $303T, according to the Institute of International Finance, a global financial industry association. This is a FURTHER jump from record global debt in 2019 of $226T, as reported by the IMF in its Global Debt Database. Volcker was jacking rates into a planet with about $200T LESS debt. Please call out the risk management imbeciles that make any reference of Powell to Volcker. Many economists in 2022 are highly delusional – a very dangerous group indeed. When you hike rates aggressively with a strong dollar you multiply interest rate risk, which was already off the charts coming from such a low 2020 base in terms of yield – it’s a convexity nightmare. Interest rate hikes today – hand in hand with a strong U.S. Dollar – carry 100x the destructive power than the Carter – Reagan era. At the same time, you add lighter fluid on to the credit risk fire in emerging markets with a raging greenback. Global banks have to mark to market most of these assets. If global rates reset higher and stay at elevated levels, the sovereign debt pile is in gave danger. The response to Lehman and Covid crisis squared (see above) has left a mathematically unsustainable bill for follow on generations. The Fed CANNOT hike rates aggressively into this mess without blowing up the global economy. We are talking about mass – Jonestown delusion on roids. Then Covid-19 placed a colossal leverage cocktail on top. Emerging and frontier market countries currently owe the IMF over $100B. U.S. central banking policy + a strong USD is vaporizing this capital as we speak. A dollar screaming higher with agricultural commodities – priced globally in dollars – is a colossal tax on emerging market countries – clueless academics at the Fed are exporting inflation into countries that can least afford it.\n• Letter To My Friends From America (Faina Savenkova)\n\nTwo events have recently occurred in the world. In America – in the suburbs of Chicago – people died during the celebration of Independence Day. And during these three days, 5 children died from artillery shelling of Ukraine in the Donbass – in Donetsk and Makeyevka. A 10-year-old girl was torn apart by an incoming Ukrainian shell. According to the data and evidence collected by the Russian Foundation for Combating Repression, the Ukrainian military was given direct orders to use weapons to kill against civilians of Donbass. Here are the proofs of that https://fondfbr.ru/en/articles/sergey-yudayev-en/ But did American journalists notice this? No. I can understand why America mourns the dead on Independence Day. But at the same time, she stubbornly does not want to see what Ukraine is doing. I live in Donbass, and after the murder of children with weapons supplied by you and Europe, probably, should hate you and rejoice that the Lord punishes those because of whom our children die. But I am Russian and I have been living in the war for eight years now. I understand what death is, so I don’t feel anger and hatred. And I grieve with you for the dead. Human life is priceless, and murder is always terrible, because it is impossible to bring back those who have been lost, it is impossible to drown out this pain. Just as it is impossible to isolate yourself from the war, because the war, in which your government is no less to blame than the rest, will surely return to you. I am very sorry that many in America do not know that it all started 8 years ago. And Ukraine is killing civilians, destroying our cities, killing children. But it is unlikely that your politicians pay attention to this. They are ready to fight to the last Ukrainian and, apparently, believe that they will defeat Russia in a nuclear war. It won’t be like that. I would like you to understand that war is bad, as well as the killing of innocent people. I hope that all this will end soon, and humanity will once again understand the value of life and a peaceful future, and Russia and America will be friends.\n\nThe quiet last few days will make Rutte think he’s winning. But the farmers will be back; they know it’s now or never.\n\nThe farmers are simply the easiest target. If nitrogen is the problem, force people to fly and drive 30% less. Much more effective. But that costs votes.\n• Climate Mandates Imposed on Dutch Farmers Will Ruin Their Livelihoods (ET)\n\nThe livelihoods of Dutch farmers are under attack due to the Dutch government’s proposed nitrogen policy, which could necessitate the mass slaughter of livestock and potentially shut down almost a third of the country’s farms. If this policy is implemented, it will have “major security consequences, not just for the Netherlands, but for all of Europe and the world,” said Michael Yon, a war correspondent who has recently arrived in the Netherlands to report on the ground from the Dutch farmers’ protests. The Netherlands is a small country in Europe with a population of 17 million people, but it is the second-largest food exporter in the world, Yon said in a recent interview for EpochTV’s “Crossroads” program. “They have the most efficient farmers in the world.” In 2021, the Netherlands’s coalition government proposed slashing livestock numbers in the country by 30 percent to meet nitrogen greenhouse gas emission targets. The country has already implemented stringent restrictions on new construction, intending to curb nitrogen emissions. Dutch bank Rabobank has argued that those new hurdles have slowed home building in the Netherlands, intensifying a housing shortage in the densely populated coastal nation. On June 10, Christianne van der Wal, the Dutch Minister for Nitrogen and Nature Policy, unveiled a plan to reduce nitrogen emissions in the Netherlands, according to a statement by the U.S. Department of Agriculture. “The Dutch Provinces are responsible for developing corresponding measures to reach the nitrogen emission reductions between 12 and 70 percent, depending on the area,” the statement said. “Farmers in some provinces will be particularly hard hit … and the Dutch government acknowledged ‘there is not a future for all {Dutch} farmers within [this] approach.’” The Netherlands Chamber of Commerce says that nitrogen environmental pollution comes from burning fossil fuels but also from manure produced by livestock and fertilizers used in farming. It is estimated that to implement the proposed plan, farmers would need to reduce their cattle herds by 30 percent, according to Barron’s. But Yon said Dutch farmers are not polluting the environment and that they’ve been farming the land for thousands of years. Nitrogen is being labeled as a pollutant and used as a decoy by the World Economic Forum (WEF) to put the farmers out of business and control the food supply, Yon said. [..] Dutch farmers and truckers realize that their government is following the recommendations of the WEF, which has been trying to take their land and control their food supply, Yon said. “If you control the food supply, you control that population completely,” he said. Dutch farmers are very educated, and they are both businesspeople and farmers, Yon said. They know that if they lose, they will lose their livelihood, and the consequences of their loss will be felt for many generations, he said. “The farmers are rising up. They know they’re going to be put out of business … which would put all of Europe on its knees, foodwise,” Yon said.\n\n“..twice as much now, and three times at the end of the summer.”\n\nHousehold energy costs could triple in Germany as Russian gas supplies dwindle, officials in the sector said, and one company representative raised the possibility of social unrest unless there was a cap on prices. In an interview with the RND newspaper group published on Thursday, Klaus Mueller, head of the Federal Network Agency regulator urged consumers to reduce consumption and set aside money. And in an interview with Reuters, the head of the municipal works of Chemnitz, one of the 900 city-owned public companies that are a major part of Germany’s energy landscape, went further. “We must help average households and set an upper limit for energy costs,” Roland Warner said, warning that annual bills of 1,500 euros could rise to 4,700 euros in October. “If we get social unrest the state won’t be able to cope.” Energy minister Robert Habeck has in the past rejected calls for state price caps, saying the state cannot fully offset increased prices and that attempting to do so would send the wrong signal about the need to conserve energy. After prospering from cheap Russian gas for decades, Europe’s largest economy is facing a crunch as Russia dials back supplies. Western governments say Moscow is retaliating against sanctions imposed over its invasion of Ukraine, but Moscow blames technical problems. Some analysts warn that public backing for a tough line against Moscow could weaken further if living standards decline. A Forsa poll published on Wednesday found that support for a boycott of Russian gas – a major source of finance for what Moscow calls its “special operation” in Ukraine – had fallen from 44% of respondents six weeks ago to just 32% now. With spot prices soaring, Mueller warned that end-consumers rolling over their fixed-term contracts now would find themselves paying twice as much now, and three times at the end of the summer. “Some prices on exchanges are up sevenfold,” said Mueller. “It’s not all going to come through immediately, and won’t be fully passed on, but it’s going to have to be paid eventually,” he said.\n\nThe hashtag #vaccineinjured trended on Twitter late Wednesday after GBN, a British news channel, aired a special on those who said their lives were upended after taking the COVID-19 vaccine. Some of these individuals held up photos of loved ones they said died after taking the vaccine, or said they suffered from an adverse reaction. The show was intended to shed light on these cases and criticized social media platforms for silencing them. The COVID-19 vaccine’s effectiveness could drop to about 20 percent a few months after the booster shot is administered, according to an Italian review of COVID studies. “Booster doses were found to restore the VE [vaccine effectiveness] to levels comparable to those acquired soon after administration of the second dose; however, a fast decline of booster VE against Omicron was observed, with less than 20% VE against infection and less than 25% VE against symptomatic disease at 9 months from the booster administration,” the authors wrote in the paper. The study found that two doses of the COVID-19 vaccine were less than 5 percent effective at preventing a symptomatic infection with the Omicron variant, which is famous for evading the immune defense system. Three doses were up to about 22 percent effective at preventing symptomatic infection. A recent Pew Research poll found a dramatic shift in the trust Americans have in health officials after more than two years of dealing with the COVID-19 outbreak. The survey found that President Joe Biden has lost public support in his handling of the outbreak. The survey pointed out that about 65 percent of Americans said they were confident in his ability to deal with the virus at the beginning of his presidency. The survey now says 56 percent of Americans believe he is doing a “fair or poor job” in handling the outbreak. Just 43 percent polled said he is doing an excellent job.\n\n900 a week in the UK alone.\n• UK Excess Deaths Not From Covid Approach 9,000 in Last 10 Weeks (DS)\n• Doctors Push Hard for Child Vaccination Despite Their Own Research (BI)\n\nAccording to a study recently published in the Paediatric Infectious Disease Journal, the risk of COVID-19 to children is truly minuscule. The study tracks the outcomes for Icelandic children with a positive COVID-19 test, covering all the children who tested positive during the study period. It concludes that out of the 1,749 children tracked, none had severe symptoms and no child needed hospitalisation. A fifth of the children showed no symptoms. It is curious, then, that when Icelandic health authorities decided to offer COVID-19 vaccination to 5-11 year-old children earlier this year, two of the four study authors were among the most vocal advocates of the policy. At the time, the health risks related to COVID-19 vaccines were becoming increasingly clear, with the rate of reported serious adverse effects in Iceland 75-fold the rate for flu vaccines in 2019. The French Medical Academy had recommended against vaccinating healthy young children, Swedish authorities had decided not to offer them vaccination and the JCVI had recommended against it. But Icelandic authorities decided to go ahead with an organised campaign. Earlier, the study’s lead researcher, Dr. Valtyr Thors, a prominent paediatrician, had said vaccination was not needed for young children, but in January 2022 he suddenly reversed his opinion and strongly recommended vaccination to “protect children against infection and serious illness”. At that time, the Omicron variant had already taken over in Iceland, and numbers showed vaccine protection against infection to be zero or negative. Late December 2021, another author, paediatrician Dr. Asgeir Haraldsson, Professor of Medicine at the University of Iceland, said five to 10 out of every thousand healthy children would need hospitalisation after COVID-19 infection and strongly recommended vaccination, claiming both Delta and Omicron variants posed a considerably higher threat to children than previous variants. The study shows only 12% of infections among children occured in school. However, in late 2021 the importance of keeping schools open was repeatedly mentioned as an additional justification for the vaccination of children. In December 2021, Dr. Thors claimed infections in schools were a major problem and Chief Epidemiologist Dr. Thorolfur Gudnason suggested lifting quarantine requirements for vaccinated children under 16, while keeping them in place for the unvaccinated.\n• Federal Judge Orders Biden Admin to Cooperate in Social Media Collusion Lawsuit (ET)\n\nA federal judge ordered the Biden administration on July 12 to comply with information requests in a lawsuit brought by Missouri and Louisiana officials about alleged federal government collusion with social media companies to suppress important news stories in the name of fighting so-called misinformation. The lawsuit could help bring to light the Biden administration’s behind-the-scenes efforts to discourage the dissemination of information related to the advent of the virus that causes the disease COVID-19 and the ongoing Hunter Biden laptop scandal, according to Eric Schmitt, Missouri’s Republican attorney general. Supporters of former President Donald Trump claim that if the story about the laptop belonging to the president’s troubled son hadn’t been suppressed, President Joe Biden would have lost the 2020 presidential election. Republicans say the laptop provides evidence of the son’s misbehavior and of the Biden family’s corruption. Facebook and Twitter infamously restricted the distribution of information related to the computer’s contents. Biden supporters claimed the story was manufactured by the Russian government as disinformation. Social media also suppressed numerous stories related to the origins of COVID-19, possible medical treatments to prevent, treat, or cure the disease, and discussions about government and corporate policies implemented to deal with the virus, many of which curbed personal freedoms. Many government and corporate employees have been fired in the pandemic era for refusing to take government-approved vaccines, which they say have limited effectiveness and potentially severe side effects. The lawsuit could also provide fodder for Republicans who promise multiple investigations into government wrongdoing should they retake Congress in the November elections. Among the defendants are President Joe Biden, his former White House press secretary Jen Psaki, Department of Homeland Security Secretary Alejandro Mayorkas, former Disinformation Governance Board executive director Nina Jankowicz, and Anthony Fauci, chief medical adviser to the president and director of the National Institute of Allergy and Infectious Diseases. According to court documents, the states allege that the administration “colluded with and/or coerced social media companies to suppress disfavored speakers, viewpoints, and content on social media platforms by labeling the content ‘disinformation,’ ‘misinformation,’ and ‘malinformation.’” The states “allege the suppression of disfavored speakers, viewpoints, and contents constitutes government action and therefore violates Plaintiff States’ freedom of speech in violation of the First Amendment to the United States Constitution.”\n\nA federal appeals court has rejected a bid by Monsanto owner Bayer AG to head off claims brought by cancer victims alleging that Monsanto failed to warn them of the risks of Roundup. In a decision handed down Tuesday, the 11th U.S. Circuit Court of Appeals ruled that a “failure to warn claim” brought against Monsanto in Georgia by Roundup user John Carson is not preempted by requirements under the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA) as lawyers for Monsanto, and its owner Bayer, have argued. Bayer has sought — and now failed — in multiple courts to find backing for its argument that it should be protected from allegations that Monsanto failed to warn users of a cancer risk associated with its products. (Bayer bought Monsanto in 2018.) The company asserts that if it had placed cancer risk warnings on product labels it would have conflicted with provisions of FIFRA that give the U.S. Environmental Protection Agency (EPA) oversight of labeling language. The EPA has said in its assessment, that the herbicides are “not likely” to be carcinogenic. “It’s another resounding rejection of Monsanto’s preemption defense,” said attorney Brent Wisner, who served as co-counsel for the first trial to take place in the nationwide Roundup litigation, which resulted in a unanimous jury decision finding Monsanto had hidden the cancer risks of its weed killers. “It is safe to say that their argument is dead. Every court to consider this issue has sided with plaintiffs,” Wisner said. Bayer said in a statement that it believes the federal appeals court erred in its ruling. “We respectfully disagree with the Eleventh Circuit’s decision, as a cancer warning would deviate from Roundup’s EPA-approved labeling, render the product misbranded, and require the company to make a label change that would be contrary to the consistent conclusions of EPA’s scientific assessments for more than four decades. “The court’s determination that the FIFRA’s statutory registration process is not sufficiently formal to trigger preemption is inconsistent with Supreme Court precedent, and the company will review its legal options regarding further proceedings.”\n\nNot what the Espionage Act was meant for, even back in 1917.\n\nA federal jury in New York convicted former CIA employee Joshua Schulte of violating the Espionage Act when he allegedly released materials on the CIA’s hacking capabilities to WikiLeaks. This was the second trial against Schulte. In March 2020, his first trial ended in a mistrial on several Espionage Act charges, but he was found guilty of contempt of court and lying to the FBI. Unlike the first trial, Schulte represented himself and argued his case. He again maintained he was not the source of the leaks published by WikiLeaks. A jury deliberated for nearly three days before announcing a verdict. Judge Jesse M. Furman in the Southern District of New York did not schedule a sentencing date because there are other charges pending against Schulte. Known as the “Vault 7” materials, WikiLeaks began releasing documents on March 7, 2017. They came from what WikiLeaks described as an “isolated, high-security network situated inside the CIA’s Center for Cyber Intelligence.” Documents revealed how the CIA could target iPhones, Androids, and Samsung TVs and convert the devices’ microphones into bugs used to spy on targeted persons. Malware was also developed to infect Microsoft Windows users, and the CIA was “hoarding” security vulnerabilities in software and hardware that they could use for their covert operations instead of notifying companies that users were at risk of being hacked. It was one of the largest leaks of information in the history of CIA and a huge embarrassment for then-CIA Director Mike Pompeo, who responded by labeling WikiLeaks a “non-state hostile intelligence agency” and developing “secret war plans” against the media organization that included kidnapping or even killing WikiLeaks founder Julian Assange. The US government has charged Assange with violating the Espionage Act, and the UK government authorized his extradition in June. Assistant US Attorney Michael D. Lockard asserted that on April 20, 2016, Schulte “stole the entirety of the CIA’s highly sensitive cyber intelligence capabilities.” This occurred just days after the CIA “locked the defendant out of the secure restricted vault-like location on the network.” “Shortly after stealing this extraordinarily sensitive intelligence information, the defendant transmitted those backups to WikiLeaks, knowing full well that WikiLeaks would put it up on the internet,” Lockard argued. “In the weeks following this break-in, the defendant took every step he would need to take in order to transmit those files to WikiLeaks. He downloaded a program that WikiLeaks itself recommends to leakers to use to send stolen data.” [..] US prosecutors never presented any forensic evidence to specifically tie Schulte to the publication of the CIA hacking materials on WikiLeaks. Schulte acted very confident during his closing argument. He insisted that Lockard was “worried about the lack of evidence” because he had told the jury the “lack of evidence is not evidence of innocence.”\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "vaccine injured Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/vaccine-injured/", "site_name": "The Automatic Earth"}, "tags": ["collusion", "pain dial", "BioNTech", "cartel", "vaccine injured", "Joshua Schulte", "children", "Fauci", "Civil War", "mandate", "social unrest", "multipolar", "Dutch farmers", "Delta", "Poland", "Roundup", "unipolar"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Peter Oborne Demolishes Boris Johnson's Legacy <a href=\"https://twitter.com/OborneTweets?ref_src=twsrc%5Etfw\">@obornetweets</a> <a href=\"https://t.co/sbr4QKvPRl\">pic.twitter.com/sbr4QKvPRl</a></p>\n<p>— Double Down News (@DoubleDownNews) <a href=\"https://twitter.com/DoubleDownNews/status/1546801544321896448?ref_src=twsrc%5Etfw\">July 12, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.pablo-ruiz-picasso.net/work-1974.php", "http://thesaker.is/russia-and-china-havent-even-started-to-ratchet-up-the-pain-dial/", "https://nypost.com/2022/07/13/russia-warns-of-larger-conflict-if-us-continues-to-arm-ukraine/", "https://www.ft.com/content/bce78c78-b899-4dd2-b3a0-69d789b8aee8", "http://thesaker.is/the-international-political-debacle-proves-that-the-unipolar-system-is-crumbling/", "https://www.zerohedge.com/markets/take-tragedy-sri-lanka-and-multiply-ten-fed-just-lobbed-financial-nuke-will-obliterate", "http://thesaker.is/letter-from-faina-savenkova-to-my-friends-from-america/", "https://www.theepochtimes.com/climate-mandates-imposed-on-dutch-farmers-will-ruin-their-livelihood-war-correspondent_4593308.html", "https://www.reuters.com/business/energy/german-firm-calls-energy-price-cap-avoid-social-unrest-2022-07-13/", "https://trendsinthenews.substack.com/p/vaccineinjured-trends-on-twitter", "https://dailysceptic.org/2022/07/14/excess-deaths-not-from-covid-approach-9000-in-last-10-weeks/", "https://brownstone.org/articles/doctors-push-hard-for-child-vaccination-despite-their-own-research-showing-it-is-unnecessary/", "https://www.theepochtimes.com/federal-judge-orders-biden-administration-to-cooperate-in-social-media-collusion-lawsuit_4595222.html", "https://childrenshealthdefense.org/defender/appeals-court-bayer-monsanto-roundup-cancer-case/", "https://thedissenter.org/jury-guilty-cia-programmer-schulte-vault-7-wikileaks/", "http://thesaker.is/russia-and-china-havent-even-started-to-ratchet-up-the-pain-dial/", "http://thesaker.is/russia-and-china-havent-even-started-to-ratchet-up-the-pain-dial/", "https://nypost.com/2022/07/13/russia-warns-of-larger-conflict-if-us-continues-to-arm-ukraine/", "https://nypost.com/2022/07/13/russia-warns-of-larger-conflict-if-us-continues-to-arm-ukraine/", "https://www.ft.com/content/bce78c78-b899-4dd2-b3a0-69d789b8aee8", "https://www.ft.com/content/bce78c78-b899-4dd2-b3a0-69d789b8aee8", "http://thesaker.is/the-international-political-debacle-proves-that-the-unipolar-system-is-crumbling/", "http://thesaker.is/the-international-political-debacle-proves-that-the-unipolar-system-is-crumbling/", "https://www.zerohedge.com/markets/take-tragedy-sri-lanka-and-multiply-ten-fed-just-lobbed-financial-nuke-will-obliterate", "https://www.zerohedge.com/markets/take-tragedy-sri-lanka-and-multiply-ten-fed-just-lobbed-financial-nuke-will-obliterate", "http://thesaker.is/letter-from-faina-savenkova-to-my-friends-from-america/", "http://thesaker.is/letter-from-faina-savenkova-to-my-friends-from-america/", "https://www.theepochtimes.com/climate-mandates-imposed-on-dutch-farmers-will-ruin-their-livelihood-war-correspondent_4593308.html", "https://www.theepochtimes.com/climate-mandates-imposed-on-dutch-farmers-will-ruin-their-livelihood-war-correspondent_4593308.html", "https://www.reuters.com/business/energy/german-firm-calls-energy-price-cap-avoid-social-unrest-2022-07-13/", "https://www.reuters.com/business/energy/german-firm-calls-energy-price-cap-avoid-social-unrest-2022-07-13/", "https://trendsinthenews.substack.com/p/vaccineinjured-trends-on-twitter", "https://trendsinthenews.substack.com/p/vaccineinjured-trends-on-twitter", "https://dailysceptic.org/2022/07/14/excess-deaths-not-from-covid-approach-9000-in-last-10-weeks/", "https://dailysceptic.org/2022/07/14/excess-deaths-not-from-covid-approach-9000-in-last-10-weeks/", "https://brownstone.org/articles/doctors-push-hard-for-child-vaccination-despite-their-own-research-showing-it-is-unnecessary/", "https://brownstone.org/articles/doctors-push-hard-for-child-vaccination-despite-their-own-research-showing-it-is-unnecessary/", "https://www.theepochtimes.com/federal-judge-orders-biden-administration-to-cooperate-in-social-media-collusion-lawsuit_4595222.html", "https://www.theepochtimes.com/federal-judge-orders-biden-administration-to-cooperate-in-social-media-collusion-lawsuit_4595222.html", "https://childrenshealthdefense.org/defender/appeals-court-bayer-monsanto-roundup-cancer-case/", "https://childrenshealthdefense.org/defender/appeals-court-bayer-monsanto-roundup-cancer-case/", "https://thedissenter.org/jury-guilty-cia-programmer-schulte-vault-7-wikileaks/", "https://thedissenter.org/jury-guilty-cia-programmer-schulte-vault-7-wikileaks/", "https://twitter.com/OborneTweets?ref_src=twsrc%5Etfw", "https://t.co/sbr4QKvPRl", "https://twitter.com/DoubleDownNews/status/1546801544321896448?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}