{"result_id": "285032", "URL": "https://www.theautomaticearth.com/2021/08/the-vaccines-dont-work/", "timestamp": "2023-04-25 17:16:35 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/08/the-vaccines-dont-work/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The Vaccines Don't Work", "cleaned_text": "On Thursday, an internal CDC slide deck was “leaked”. On Friday, an “official” document was presented. The first is more interesting, because it contains things that are ostensibly not meant for public consumption (how to present…). The second is made up of a lot of official looking terminology. What else? But both largely say the same thing: there is no difference between the infection rates of vaccinated and non-vaccinated people. Of course that is then dressed up again in calls to get vaccinated, they can’t help themselves…\n\nIn colorful language such as “the war has changed” and “Delta spreads as easily as chickenpox”, the CDC tries very hard to undermine -even deny- it own findings. The slide deck is here:\n\nThe New York Times said:\n\nFriday’s document refers to an event in Barnstable County, Massachusetts, where 3/4 of infections were in fully vaccinated people. It’s funny to see people react with: “that makes sense, most people are vaccinated now”, completely forgetting that the vaccines were supposed to prevent infections. And inadvertently admitting that there is indeed no difference in infection rates, ergo: the vaccines don’t work.\n\nOutbreak of SARS-CoV-2 Infections, Including COVID-19 Vaccine Breakthrough Infections, Associated with Large Public Gatherings — Barnstable County, Massachusetts, July 2021\n\nPerhaps because of the big words used to dress up the story, or perhaps because people have become so conditioned to react to everything Covid with fear, the logical conclusion of these two documents is not drawn anywhere. Which is that notions such as vaccine mandates and vaccine passports should now be discarded. There is no reason for a “vaccine” to be applied if you get infected with it as easily as without.\n\nSome will still claim that they stop more severe sickness, but evidence of that is scarce at best, and it has nothing to do with the “societal functions” of not infecting others that the mandates and passports are designed for. If we know what’s good for us, it’s back to the drawing board.\n\nThere is of course no reason from an individual point of view to get vaccinated either: even if you believe that you might get less sick, you would still have to weigh that against the risks the vaccines come with. And they come in multiple large shapes and forms. There is a group now trying to prove that 500,000 people have died from the vaccines, up from 50,000, and the info from VAERS and other systems remains shaky. You would think every doctor and nurse would consider it a matter of honor to report adverse reactions as accurately as possible, but that’s not the impression we have so far.\n\nAlso, you can read everywhere that when numbers of infections (“cases”) are down in a country or region, it’s because of the vaccines. But how is that possible if infections are equally spread between vaccinated and unvaccinated? Where’s the logic? And what’s the logic of blaming the unvaccinated once you know they are no more contagious than the jabbed?\n\nI think perhaps the biggest problem of all right now is that there is so much invested in official narratives. That is as logical as it is unfortunate. And I get it, all those politicians and experts are slowly and very reluctantly realizing that they bet on the wrong horse, and to turn a ship of state around is much harder than for me to change my life.\n\nThe alternative to admitting your failures is a very dark place, so maybe you should make sure you’re ahead of the crowd, ahead of your co-PMs and presidents and “experts”, admit your faults, profoundly apologize, and shift that steering wheel 180º if need be. You don’t want to find yourself in that dark place.\n\nNow they want to put masks on the vaccinated. That must mean the vaccines don’t work, right? No, no, they swear, the vaccines are very very efficient. It’s just that you have a very rare breakthrough case now and then, because no vaccine is perfect. So for a few rare breakthrough cases you’re going to tell millions of Americans to mask up? And then you see that New York State alone has 11,000 of such very rare cases.\n\nPfizer wants to give everyone a booster shot this fall. I was thinking they must have made some improved version against Delta, but no, it’ll be a third shot of the same “vaccine”. But wait, we just found it doesn’t work against Delta. The Israelis give it a 39% efficacy, which is not even enough to get an emergency authorization. Get it off the market then.\n\nWhy would I get such a shot at this point in time? The only reason I can think of is that if I don’t, you’ll take my job away, and/or severely screw with my life, and rights, and freedoms, in other ways. But certainly not for protection, because the substance offers me none of that, not for me, not for others. And there’s something terribly wrong with that, with forcing me to make choices based on such warped notions.\n\nThe entire grand idea of getting everyone vaccinated is just like Zero covid: impossible and unnecessary grandstanding, obsessed by grand illusions of power over every single individual mind. In reality, it’s everyone’s own choice, and nobody else’s.\n\nFor some obscure reason we have accepted the idea that we can do no risk stratification, that everyone is at equal risk, and therefore everyone should undergo the same treatment. And then we find out that this treatment doesn’t work, or only half, or only for a few months, etc. But you can be sure insurance companies are still doing risk stratification, also for Covid, it’s how they make a profit.\n\nWe find the vaccine is not a vaccine, but a therapeutic. An untested one at that. While we could have focused on prevention, either for everyone or just for the vulnerable, and early treatment for early victims. As 80% of people were never at risk at all and 80% have already been infected and survived.\n\nThere are plenty ways to do prevention and we have discarded them all, in favor for a treatment that now turns against us. That is to say, the vaccine makes the virus more, not less, dangerous. It’s not the unvaccinated that are the pool the virus mutates in, it’s the vaccinated.\n\nAnd it’s not only the mutations. All Covid therapeutics used in the west induce the vaccinees’ body to produce spike proteins, which are toxic to the body. Initially, it was claimed that they would stay near the site of injection, but we soon found that they spread through the entire body, and assemble especially in the most vulnerable spots: lungs, testes, placenta etc.\n\nAnd that’s not all either: we now see suspicions that the spike proteins remain active in the body, and continue to be produced inside the body, for much longer than we were told they would be. An as yet unpublished report will claim that they have been found five months after injection, instead of mere days. The potential consequences would be much more disastrous than the virus.\n\nAnd wouldn’t you know, the moment we find out from the CDC itself that the vaccines don’t work, that same CDC clamors for more vaccinations, and all the usual suspects in the media and politics and “expertise” chime in. Everyone vaccinated now or we’ll take your jobs away, and all of your fun. Children, no matter how young, must be jabbed, even pregnant women. This therapeutic we never really tested is perfectly safe for your unborn child!\n\nWithout a jab, you’re a lethal danger to everyone who’s been vaccinated!\n\nWell, actually, I am not, and thanks to the CDC now I can prove it.\n\nThe other way around, though, I’m not so sure.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccines Don't Work - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/08/the-vaccines-dont-work/", "site_name": "The Automatic Earth", "article:published_time": "2021-08-01T13:48:04+00:00", "article:modified_time": "2021-08-01T13:48:09+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/07/PaulKleeHammamet1914.jpg"}, "tags": ["VAERS", "prevention", "infection", "vaccine mandate", "therapeutics", "spike protein", "vaccine passport", "CDC"], "tweets": [], "movies": [], "links": ["https://www.metmuseum.org/art/collection/search/483158", "https://context-cdn.washingtonpost.com/notes/prod/default/documents/54f57708-a529-4a33-9a44-b66d719070d9/note/753667d6-8c61-495f-b669-5308f2827155.#page=1", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm?s_cid=mm7031e2_w", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-08-01T13:48:04+00:00"}