{"result_id": "285039", "URL": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-30-2021/", "timestamp": "2023-04-25 17:16:42 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-30-2021/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle August 30 2021", "cleaned_text": "How many people have been warned of the ADE risk since? This is mandatory. For everyone with a syringe in their hands.\n\nNote: they are all “Vaccine Trial Subjects”.\n\nAims of the study: Patient comprehension is a critical part of meeting medical ethics standards of informed consent in study designs. The aim of the study was to determine if sufficient literature exists to require clinicians to disclose the specific risk that COVID-19 vaccines could worsen disease upon exposure to challenge or circulating virus. Methods used to conduct the study: Published literature was reviewed to identify preclinical and clinical evidence that COVID-19 vaccines could worsen disease upon exposure to challenge or circulating virus. Clinical trial protocols for COVID-19 vaccines were reviewed to determine if risks were properly disclosed. Results of the study: COVID-19 vaccines designed to elicit neutralising antibodies may sensitise vaccine recipients to more severe disease than if they were not vaccinated. \n\n Vaccines for SARS, MERS and RSV have never been approved, and the data generated in the development and testing of these vaccines suggest a serious mechanistic concern : that vaccines designed empirically using the traditional approach (consisting of the unmodified or minimally modified coronavirus viral spike to elicit neutralising antibodies), be they composed of protein, viral vector, DNA or RNA and irrespective of delivery method, may worsen COVID-19 disease via antibody-dependent enhancement (ADE). This risk is sufficiently obscured in clinical trial protocols and consent forms for ongoing COVID-19 vaccine trials that adequate patient comprehension of this risk is unlikely to occur, obviating truly informed consent by subjects in these trials. Conclusions drawn from the study and clinical implications: The specific and significant COVID-19 risk of ADE should have been and should be prominently and independently disclosed to research subjects currently in vaccine trials, as well as those being recruited for the trials and future patients after vaccine approval, in order to meet the medical ethics standard of patient comprehension for informed consent.\n\nMandatory vaccines, vaccine passports, lockdowns, facemasks, the protests if they try will be ferocious.\n• COVID-19 Mandates Will Not Work for the Delta Variant (AIER)\n\nOur core position since the start of the Covid-19 response in February 2020 (and which remains fixed for how the US, Canada, UK, Australia, Caribbean nations, European nations, and all other global nations must presently respond to the Delta variant/mutation) is that we do not lock the society down or close schools or impose mask mandates, etc. These policies did not apply to this emergency and certainly not after the first 3 to 4 weeks or so. This applies just as much for the initial Wuhan variant and now for the Covid-19 Delta variant or any other variant to come, if the variant is not one with an extremely high level of lethality, as was presumed erroneously for the initial Wuhan variant. In fact, even with respect to the initial variant it became clear very early on in the pandemic that it was probably no more lethal than annual influenza, yet we persisted with draconian devastating lockdown policies that only served to harm the people. These restrictive policies worked to ruin and kill (direct and indirect) more persons than SARS-CoV-2 itself. It is why leading infectious diseases experts especially with regards to pandemics (such as Dr. Donald Henderson of Johns Hopkins) never supported the non-pharmacological measures noted above, as they knew that such policies would be catastrophic; even for more lethal pathogens. “As experience shows, there is no basis for recommending quarantine either of groups or individuals. The problems in implementing such measures are formidable, and secondary effects of absenteeism and community disruption as well as possible adverse consequences, such as loss of public trust in government and stigmatization of quarantined people and groups, are likely to be considerable.” None of these restrictive policy measures such as lockdowns and school closures have worked in the past for Covid-19 and they will not work now with this media-driven hysteria over the Delta variant. If reimposed, they will once again cause crushing harms and deaths due to the collateral effects. The leaders in public health and government spokespersons as well as the corrupted media are quickly progressing towards endorsing and implementing and registering of individuals under the guise of a public health emergency. That our Governments are even considering the issuance of what have become known as Covid-19 ‘vaccine passports’ is very troubling on many levels. The very idea is anathema to our democratic principles and rights that are enshrined in the US Constitution.\n\n“People given both doses of the Pfizer-BioNTech vaccine were almost six-fold more likely to contract a delta infection and seven-fold more likely to have symptomatic disease than those who recovered.”\n• The WHO Oversold the Vaccine and Deprecated Natural Immunity (Tucker)\n\nExperience with Covid-19 is a textbook case of how the immune system scales naturally to take on the newest pathogens that have always and will always vex the world. The vaccine (especially one using a new innovation rather than a traditional inoculation) for this type of virus – respiratory, widespread, and mild for most – will necessarily be more hit-and-miss, simply because of the pace of mutation and the emergence of variants. The Isreali study is notable only because of the scope of the study and the precision of the results. Reuters summarizes the study in English: “The results are good news for patients who already successfully battled Covid-19, but show the challenge of relying exclusively on immunizations to move past the pandemic. People given both doses of the Pfizer-BioNTech vaccine were almost six-fold more likely to contract a delta infection and seven-fold more likely to have symptomatic disease than those who recovered”. \n\n Now to the problem: the overselling of the vaccine and the deprecation of natural immunity. Who was responsible? Indeed, WHO was responsible. Let’s have a look at their FAQ concerning herd immunity. The site was actually changed dramatically over the last twelve months, at one point even removing entirely the possibility that natural infection makes any contribution at all to creating herd immunity. The head of the WHO routinely pushed the idea that the new vaccines have created a great new way to be immune without ever being exposed to the virus. Herd immunity is a fascinating observation that you can trace to biological reality or statistical probability theory, whichever you prefer. It is certainly not a “strategy” so ignore any media source that describes it that way. When a virus kills its host – that is, when a virus overtaxes the body’s ability to integrate it, its host dies and so the virus does not spread to others.\n\nThe more this occurs, the less it spreads. If the virus doesn’t kill its host, it can hop to others through all the usual means. When you get such a virus and fight it off, your immune system encodes that information in a way that builds immunity to it. When it happens to enough people (and each case is different so we can’t put a clear number on it, especially given so many cross immunities) the virus loses its pandemic quality and becomes endemic, which is to say predictable and manageable. Each new generation incorporates that information through more exposure. This is what one would call virology/immunology 101. It’s what you read in every textbook. It’s been taught in 9th-grade cell biology for probably 80 years. Observing the operations of this evolutionary phenomenon is pretty wonderful because it increases one’s respect for the way in which human biology has adapted to the presence of pathogens without absolutely freaking out. \n\n And the discovery of this fascinating dynamic in cell biology is a major reason why public health became so smart in the 20th century. We kept calm. We managed viruses with medical professionals: doctor/patient relationships. We avoided the Medieval tendency to run around with hair on fire but rather used rationality and intelligence. One day, this strange institution called the World Health Organization – once glorious because it was mainly responsible for the eradication of smallpox – suddenly decided to delete everything I just wrote from cell biology basics. It has literally changed the science in a Soviet-like way. It has removed with the delete key any mention of natural immunities from its website. It has taken the additional step of actually mischaracterizing the structure and functioning of vaccines.\n\n“You can’t tyranny your way out of a pandemic — but you can pandemic your way into tyranny.”\n\n“Since George W. Bush declared a national emergency on September 14, 2001, every president after him has extended it.”\n• Americans Traded Their Freedoms for Safety, And Now We Have Neither (TFTP)\n\nTo be clear, no one here is claiming that COVID-19 is not serious and you shouldn’t take precautions. However, granting government tyrannical powers in the form of business closures, mandates, vaccine passports, and more lockdowns, is most assuredly not the answer. As John Locke famously stated in A Letter Concerning Toleration, “It is one thing to persuade, another to command; one thing to press with arguments, another with penalties. This the civil power alone has a right to do; to the other good-will is authority enough.” In summary, good ideas do not require force. What’s more, as the data analyses above illustrate, it is difficult to tell the difference between places which had strict lockdowns and mandates verses the ones that did not. You can’t tyranny your way out of a pandemic — but you can pandemic your way into tyranny. Sadly, Americans have a short memory when it comes to giving up their freedoms for a false sense of security. When a society surrenders individual liberty to the state, the state never gives it back. Case in point: 9/11. After the tragic attacks on September 11, 2001, the U.S. government declared a state of emergency. That order granted the Office of the President broad discretionary powers over the military, powers that the President normally does not have. It also gives the Executive far more power than it should have which allowed for the creation of the massive surveillance state we see today. Since that September day, we’ve entered into multiple wars of aggression while bypassing Congress, waged a massive domestic spying campaign, eroded the Bill of Rights, and constructed a monumental police state hear at home. Under the National Emergencies Act, national emergencies expire after a year, unless the president renews them by notifying Congress. Since George W. Bush declared a national emergency on September 14, 2001, every president after him has extended it. Because Americans have such short memories, we are once again yielding our freedom for the perception of safety. And, just like the government has done since 9/11, they will hold on to those freedoms and refuse to give them back. Now, as the bogus and freedom-diminishing war on terror comes crumbling down, the tyrant class needs a new war to keep you in line and ready and willing to relinquish your rights. The targeted “terrorists” are no longer brown people in the Middle East, the new enemies are those who refuse to give up their rights at home.\n\n10% reported, says the MHRA itself. How many vaccine deaths are labeled Covid deaths?\n\n[..] the number of reported adverse reactions to the Pfizer vaccine has increased to 302,146 as of the 18th August. The AstraZeneca jab has fared much worse though, with the total number of adverse reactions now standing at 816,393. There have also been 43,949 adverse reactions to the Moderna jab of which 2.1 million doses have been administered, and 3,148 adverse reactions reported where the brand of vaccine was not specified. This now means the current rate of people suffering a serious adverse reaction after having one of the experimental Covid vaccines stands at 1 in every 142 people, with 1,165,636 adverse reactions having now been reported to the MHRA Yellow Card scheme. But it’s important to remember that this rate only accounts for the adverse reactions that are actually reported, which is estimated to be around only 10% according to the MHRA themselves, meaning the actual rate of adverse reactions occurring is frighteningly higher. [..] The most concerning disorder to have occurred due to the Covid-19 vaccines, is one that has only recently been reported – Congenital disorders. A congenital disorder is a medical condition that is present at or before birth. These conditions, also referred to as birth defects, can be acquired during the foetal stage of development or from the genetic makeup of the parents. There have been 59 birth defects reported as adverse reactions to the Pfizer vaccine, 93 birth defects reported as adverse reactions to the AstraZeneca vaccine, and 6 birth defects reported as adverse reactions to the Moderna vaccine. Birth defects which include heart disease, cerebral palsy, foetal malformation, and congenital cystic lung – [..] The total number of nervous system disorders reported as adverse reactions to the Pfizer, AstraZeneca, and Moderna vaccines now stands at 234,270. This includes serious events such as seizure, brain damage, paralysis and stroke. There have been an array of strokes reported to the Pfizer jab and they include 41 cases of cerebral hemorrhage resulting in 8 deaths, 33 cases of ischaemic stroke resulting in 1 death, and 313 cases of cerebrovascular accidents resulting in 13 deaths. The AstraZeneca viral vector injection has however fared much worse so far causing at least 165 cases of cerebral haemmorhage resulting in 45 deaths, 90 cases of cerebral infarction resulting in 5 deaths, and 1,157 cases of cerebrovascular accidents resulting in 44 deaths.\n\n[..] As of the 18th August there have been 302,146 adverse reactions and 508 deaths reported to the MHRA against the Pfizer mRNA injection. As well as 816,393 adverse reactions and 1,056 deaths reported to the MHRA against the AstraZeneca viral vector injection. The Moderna mRNA injection meanwhile has caused at least 43,949 adverse reactions and 17 deaths as of the 18th August 2021. This vaccine has also mainly been administered to younger adults who are least at risk of suffering debilitating disease if infected with Covid-19. Around 1.4 million people have received the Moderna jab which means at least 1 in every 31 people have suffered and adverse reaction and at least 1 in every 82,000 people have sadly died. The overall number of deaths due to all three jabs now stands at 1,609 when including the 28 deaths that have been reported where the brand of vaccine was not specified.\n\nVietnam’s success at containing Covid abruptly ended this spring. Its coronavirus epidemic began in May and exploded in late June. Since then, cases have risen 25-fold. On Friday, Vietnam reported more than 17,000 cases, its most ever – more than 10 times as many as it had in all of 2020. Deaths are soaring too. Over the last week, Vietnam has averaged more deaths per-capita than the United States. With this number of cases, individual contact tracing is effectively impossible, even for a centralized and authoritarian state. So Vietnam has implemented far more aggressive lockdowns than it did last year, including bringing in soldiers to enforce quarantines in the southern metropolis of Ho Chi Minh City (formerly Saigon). [..] maybe the biggest question of all remains unanswered: why now? Inevitably, the media and government are blaming the Delta variant. But the variant was widespread worldwide well before the explosion in cases Vietnam saw two months ago. But Vietnam did see one big change this summer: the beginning of a mass vaccination program. Vietnam didn’t depend on Chinese vaccines, either (not surprising, given the long history of conflict between the two countries). It has mostly used the AstraZeneca DNA/AAV vaccine, along with the Pfizer and Moderna mRNA vaccines – the same trio that have dominated Europe. As of early June, almost no one in Vietnam was vaccinated. Today, almost 20 percent of the country has received at least one dose. The pattern is exactly the same as we saw in Israel and Britain in January, and many other countries over the spring. The first dose of mass vaccination campaigns is associated with a huge spike in cases. Too many countries have seen this trend for it to be called coincidental. The question is what’s causing it. Possibilities include post-vaccine behavioral changes (hot vaxxed summer!), vulnerable people clustering together at vaccination sites, or (most likely) some short-term vaccine-driven suppression of the immune system. Given that we know now peak mRNA vaccine protection lasts a matter of months at most, the post-first-dose spike is even more important in judging the costs and benefits of vaccines. But vaccine advocates will not even acknowledge the existence of the post-first-dose spike, much less admit that it leaves the case for mass vaccinations even murkier than before.\n\nHa ha ha, US testing went up 500% AFTER the FDA called the PCR test unreliable?\n\nMust be real hard to find out what metal this is. Either that or they won’t tell. Started out with “contaminants”, but yeah, those magnets…\n• Fears Over Metal Flakes In Moderna Vaccine After Two Deaths (Times)\n\nI get the feeling the community is trying to separate the mutations from the vaccines.\n• New Covid Variant Detected In South Africa, Most Mutated Variant So Far (JPost)\n\nA new coronavirus variant, C.1.2, has been detected in South Africa and a number of other countries, with concerns that it could be more infectious and evade vaccines, according to a new preprint study by South Africa’s National Institute for Communicable Diseases and the KwaZulu-Natal Research Innovation and Sequencing Platform. The study is awaiting peer review. Scientists first detected C.1.2 in May 2021, finding that it was descended from C.1, which scientists found surprising as C.1 had last been detected in January. The new variant has “mutated substantially” compared to C.1 and is more mutations away from the original virus detected in Wuhan than any other Variant of Concern (VOC) or Variant of Interest (VOI) detected so far worldwide. While first detected in South Africa, C.1.2 has since been found in England, China, the Democratic Republic of the Congo, Mauritius, New Zealand, Portugal and Switzerland. The scientists believe that the number of available sequences of C.1.2 may be an underrepresentation of the spread and frequency of the variant in South Africa and around the world. The study found consistent increases in the number of C.1.2 genomes in South Africa on a monthly basis, rising from 0.2% of genomes sequenced in May to 1.6% in June and then to 2% in July, similar to the increases seen with the Beta and Delta variants there. The study also found that the C.1.2 lineage has a mutation rate of about 41.8 mutations per year, which is nearly twice as fast as the current global mutation rate of the other variants. The scientists stated that this short period of increased evolution was also seen with the Alpha, Beta and Gamma variants, suggesting that a single event, followed by a spike in cases, drove faster mutation rates. More than half of the C.1.2 sequences have 14 mutations, but additional mutations have been noticed in some of the sequences, suggesting that evolution within the lineage is ongoing, according to the study. More than half (about 52%) of the mutations in the spike region of the C.1.2 sequences have previously been seen in other VOCs and VOIs. The mutations N440K and Y449H, which have been associated with escape from certain antibodies, have also been noticed in C.1.2 sequences. The scientists stressed that the combination of these mutations, as well as changes in other parts of the virus, likely help the virus evade antibodies and immune responses, including in patients who have already been infected with the Alpha or Beta variants.\n\nHa ha, they actually did it.\n\n“But it’s all about choice at the end of the day. If you don’t want to get the vax, don’t get the vax. If you do want to get it, get it. But just don’t keep locking up people.”\n\nIt can take weeks before power is restored in NOLA. Load imbalance likely took out major transformers.\n• Hurricane Ida Reversed the Course of the Mississippi River (Gizmodo)\n\nLake Peigneur: The craziest thing you’ve ever seen. h/t Dave Collum\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle August 30 2021 - The Automatic Earth", "description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-30-2021/", "site_name": "The Automatic Earth", "article:published_time": "2021-08-30T09:11:39+00:00", "article:modified_time": "2021-08-30T09:11:48+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2018/08/SloanSunsetWest23rdStreet1905.jpg"}, "tags": ["informed consent", "adverse reactions", "Vietnam", "cytokine storm", "mutations", "graphene oxide", "NOLA", "Ida", "WHO"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Whoa! Look at the demonstration against forced vaccines in Greece. <a href=\"https://t.co/qWZqlmUxxB\">pic.twitter.com/qWZqlmUxxB</a></p>\n<p>— Election Wizard (@ElectionWiz) <a href=\"https://twitter.com/ElectionWiz/status/1432150848335978497?ref_src=twsrc%5Etfw\">August 30, 2021</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/X29lF43mUlo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/X29lF43mUlo"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/p_iZr2-Coqc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/p_iZr2-Coqc"}], "links": ["http://poulwebb.blogspot.com/2012/12/ashcan-school-john-sloan-part-1.html", "https://pubmed.ncbi.nlm.nih.gov/33113270/", "https://www.aier.org/article/covid-19-mandates-will-not-work-for-the-delta-variant/", "https://brownstone.org/articles/the-world-health-organization-oversold-the-vaccine-and-deprecated-natural-immunity/", "https://thefreethoughtproject.com/americans-have-traded-their-freedoms-for-safety-from-covid-and-now-we-have-neither/", "https://tapnewswire.com/2021/08/shocking-u-k-government-release-30th-report-on-adverse-reactions-to-the-covid-19-vaccines/", "https://erj.ersjournals.com/content/early/2020/08/28/13993003.03006-2020", "https://torontosun.com/news/national/burial-costs-covered-for-canadians-killed-by-approved-vaccines", "https://alexberenson.substack.com/p/insanity-in-vietnam", "https://www.theburningplatform.com/2021/08/29/the-delta-scam/", "https://www.thetimes.co.uk/article/7d44cf44-08e8-11ec-922b-9339a9da8961?shareToken=fdd7ea04b8e1581d3fa164c8f33e2cce", "https://www.jpost.com/health-science/new-covid-variant-detected-in-south-africa-most-mutated-variant-so-far-678011", "https://www.zerohedge.com/political/australian-truckers-protest-mandatory-vaccines-and-lockdowns-block-major-highway", "https://gizmodo.com/ida-reversed-the-mississippi-river-1847581160", "https://pubmed.ncbi.nlm.nih.gov/33113270/", "https://pubmed.ncbi.nlm.nih.gov/33113270/", "https://www.aier.org/article/covid-19-mandates-will-not-work-for-the-delta-variant/", "https://t.co/qWZqlmUxxB", "https://twitter.com/ElectionWiz/status/1432150848335978497?ref_src=twsrc%5Etfw", "https://www.aier.org/article/covid-19-mandates-will-not-work-for-the-delta-variant/", "https://brownstone.org/articles/the-world-health-organization-oversold-the-vaccine-and-deprecated-natural-immunity/", "https://brownstone.org/articles/the-world-health-organization-oversold-the-vaccine-and-deprecated-natural-immunity/", "https://thefreethoughtproject.com/americans-have-traded-their-freedoms-for-safety-from-covid-and-now-we-have-neither/", "https://thefreethoughtproject.com/americans-have-traded-their-freedoms-for-safety-from-covid-and-now-we-have-neither/", "https://tapnewswire.com/2021/08/shocking-u-k-government-release-30th-report-on-adverse-reactions-to-the-covid-19-vaccines/", "https://tapnewswire.com/2021/08/shocking-u-k-government-release-30th-report-on-adverse-reactions-to-the-covid-19-vaccines/", "https://erj.ersjournals.com/content/early/2020/08/28/13993003.03006-2020", "https://erj.ersjournals.com/content/early/2020/08/28/13993003.03006-2020", "https://torontosun.com/news/national/burial-costs-covered-for-canadians-killed-by-approved-vaccines", "https://torontosun.com/news/national/burial-costs-covered-for-canadians-killed-by-approved-vaccines", "https://alexberenson.substack.com/p/insanity-in-vietnam", "https://alexberenson.substack.com/p/insanity-in-vietnam", "https://www.theburningplatform.com/2021/08/29/the-delta-scam/", "https://www.theburningplatform.com/2021/08/29/the-delta-scam/", "https://www.thetimes.co.uk/article/7d44cf44-08e8-11ec-922b-9339a9da8961?shareToken=fdd7ea04b8e1581d3fa164c8f33e2cce", "https://www.thetimes.co.uk/article/7d44cf44-08e8-11ec-922b-9339a9da8961?shareToken=fdd7ea04b8e1581d3fa164c8f33e2cce", "https://www.jpost.com/health-science/new-covid-variant-detected-in-south-africa-most-mutated-variant-so-far-678011", "https://www.jpost.com/health-science/new-covid-variant-detected-in-south-africa-most-mutated-variant-so-far-678011", "https://www.zerohedge.com/political/australian-truckers-protest-mandatory-vaccines-and-lockdowns-block-major-highway", "https://www.zerohedge.com/political/australian-truckers-protest-mandatory-vaccines-and-lockdowns-block-major-highway", "https://gizmodo.com/ida-reversed-the-mississippi-river-1847581160", "https://gizmodo.com/ida-reversed-the-mississippi-river-1847581160", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-08-30T09:11:39+00:00"}