{"result_id": "285027", "URL": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-23-2023/", "timestamp": "2023-04-25 17:16:29 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-23-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle January 23 2023", "cleaned_text": "Why get them then?\n\n“..they motivate our fighters to fight for their values. Because they see that the whole world is on your side..”\n\n“..Even saying we’re gonna put Abrams tanks in, I think, would be enough for Germany to unleash [its Leopard tanks]”\n\nUS Representative Michael McCaul has argued that announcing plans to provide America’s vaunted M1 Abrams tanks to Ukraine – even if only one of the behemoths is actually shipped out – would leave Germany with no excuses to further delay sending its Leopard tanks to Kiev. “If we announced we were going to give Abrams tanks, just one… what I hear is that Germany is waiting for us to take the lead,” McCaul said on Sunday in an ABC News interview. “Then they would put Leopard tanks in.” The Texas Republican, who chairs the House Foreign Affairs Committee, added that such a tactic also would prompt Berlin to give its permission for other European countries that use the Leopard to give some of their tanks to Ukraine. McCaul has been among the most hawkish Republicans in the House, vowing to continue providing weaponry for Ukraine to fight Russian forces, regardless of growing public opposition to the aid. He claimed that Kiev must be provided tanks and longer-range artillery urgently, to help repel an alleged imminent offensive by the Russians. Asked by ABC anchor Martha Raddatz whether just one Abrams tank would be sufficient to trigger Germany to provide more advanced weaponry to Ukraine, McCaul hinted that Washington could trick its ally.” Even saying we’re gonna put Abrams tanks in, I think, would be enough for Germany to unleash [its Leopard tanks]” McCaul also said Kiev needs longer-range artillery to strike targets in Crimea, dismissing the risks of enabling attacks on the peninsula, which Moscow considers to be sovereign Russian territory. Asked how Russian President Vladimir Putin might react, McCaul pointed to how Washington apparently got away with past escalations in aid, such as giving Ukraine HIMARS rocket launchers. Senator Chris Coons, a Delaware Democrat, also called for sending battle tanks to Ukraine. “If it requires our sending some Abrams tanks in order to unlock getting the Leopard tanks from Germany, from Poland, from other allies, I would support that,” he told Raddatz. Media reports suggested that Berlin was unwilling to send its tanks unless the US made a similar commitment. Washington has so far refused to provide its Abrams tanks, arguing that they are very complex to operate and require extensive training. Key NATO nations failed to reach an agreement about sending the German-made battle tanks to Ukraine during a Friday meeting of Western military donors at the US Ramstein air base. However, on Sunday, Germany’s foreign minister Annalena Baerbock hinted that Berlin “would not stand in the way” if Poland decides to sends its own Leopards to Ukraine.\n\n“..only “real and effective support” in the form of weaponry that Ukrainian forces can actually use on the battlefield without months or years of training..”\n\nFrench President Emmanuel Macron and German Chancellor Olaf Scholz reaffirmed their continued “unwavering support” for Ukraine for “as long as it takes” in a joint press conference on Sunday, but both said that any decision on supplying heavier arms must be reached jointly by all “friends” of Kiev. Macron said that “nothing is excluded” when asked about the possibility of sending Leclerc main battle tanks to Kiev, and confirmed he had “asked the Defense Ministry to work on it.” However, any final decision would have to be a “collective” call based on several considerations, he noted, according to AFP. France does not want the move to “weaken our own defense capabilities,” and at the same time is cautious of “escalating” the conflict. Another concern is to provide only “real and effective support” in the form of weaponry that Ukrainian forces can actually use on the battlefield without months or years of training. Scholz dodged a similar question about Leopards, saying vaguely that Germany “will continue to act according to the concrete situation” and in close coordination with “important friends and allies.” “Germany is doing a lot, too… We have constantly expanded our deliveries with very effective weapons that are already available today,” the chancellor said. Last week, Politico reported that Paris was considering deliveries of Leclerc tanks in an effort to provide a joint framework to overcome Germany’s reluctance. Amid reports that Berlin was unwilling to send its tanks unless the US made a similar move, a US lawmaker proposed giving Ukraine a single Abrams tank to leave Berlin with no excuses for further delays. Calls for Germany to supply Kiev with Leopards grew louder after the UK confirmed earlier this month that it would send 14 Challenger 2 main battle tanks to Ukraine. Poland also announced that it would transfer a company of Leopard 2 tanks to Ukraine, but the re-export of these tanks must be greenlit by Germany. On Sunday, German Foreign Minister Annalena Baerbock hinted that Berlin “would not stand in the way” if Poland makes the move. Baerbock noted that Warsaw has not yet reached out to Berlin on the matter. Kremlin spokesperson Dmitry Peskov said on Friday that the “importance of such supplies in terms of their ability to change something” on the battlefield should not be exaggerated.\n\nThe continuous flow of military aid to Kiev clearly shows that the collective West is seeking to “wear out or, preferably, destroy” Russia, the country’s former president, Dmitry Medvedev, remarked on Sunday. The effort, however, may ultimately backfire for the US and its allies, he believes. Medvedev, who currently serves as deputy chair of the Russian Security Council, made the comments in a social media post, days after a meeting at the US Ramstein air base in Germany at which Western powers pledged to continue supporting Kiev. “The meeting at Ramstein and the allocation of heavy weaponry to Kiev leave no doubt that our enemies will be trying to wear us out for an indefinite period of time, or, preferably, to destroy us,” the ex-president wrote. \n\n However, the prolongation of the hostilities in Ukraine may ultimately lead to the emergence of a new military bloc that brings together nations “fed up with the Americans,” Medvedev suggested. “This has always happened in the history of mankind during long wars. And the US then will finally abandon old Europe and what remains of the unfortunate Ukrainians, and the world will return to an equilibrium once again,” the former leader said, warning, however, that it might be “too late” before this happens. Moscow has repeatedly urged the collective West to stop “pumping” Ukraine with weapons, maintaining that it would only prolong the hostilities rather than change the ultimate outcome. Top Russian officials have repeatedly characterized what is happening as a proxy war between Russia and the US-led NATO alliance rather than merely a conflict with Ukraine.\n\n“Dodon said Sandu made her statement after meeting in Davos with Alexander Soros, son of Hungarian-born billionaire George Soros, “who brought her to power.”\n\nMoldovan President Maia Sandu has put the former Soviet republic at risk of turning into “cannon fodder” in NATO’s proxy war with Russia by failing to remain neutral over the conflict in neighboring Ukraine, her predecessor said on Saturday. “Maia Sandu continues to draw Moldova into NATO – contrary to the neutrality prescribed in the Constitution and the will of the Moldovan people, who are categorically against joining this military structure,” ex-President Igor Dodon claimed in a Telegram post. He made his comments in response to Sandu’s statement on Friday that her government was seriously considering joining a “larger alliance” amid Russia’s military operation in Ukraine. Abandoning military neutrality would be “dangerous” for Moldova, said Dodon, who served as president from 2016 until Sandu defeated him in the country’s 2020 election. The nation of just 2.6 million people consistently ranks among the poorest countries in Europe and has maintained a delicate peace with its breakaway Transnistria region since agreeing to a 1992 ceasefire, brokered by Moscow. Dodon said Sandu made her statement after meeting in Davos with Alexander Soros, son of Hungarian-born billionaire George Soros, “who brought her to power.” He added, “Obviously, Sandu is implementing his scenario in Moldova, and joining NATO is one of his points.” Although Moldova isn’t yet a member of NATO, it has cooperated with the Western military bloc, such as when it sent peacekeeping troops to Kosovo. Moldovan Foreign Minister Nicu Popescu attended a NATO summit in Bucharest last November, marking the first time that Chisinau sent a representative to a meeting of the bloc. At the time, Popescu reportedly said that joining NATO was out of the question because of the neutrality provision in Moldova’s Constitution. By apparently changing that stance, Sandu is “acting on the orders of overseas masters, against the interests of the country and the people, against the sovereignty, territorial integrity of Moldova,” Dodon said. “Our citizens want to maintain neutrality and peace, as evidenced by the results of numerous public opinion polls, and they will never agree to become cannon fodder for NATO in the fight against Russia.” Moscow has blamed NATO’s eastward expansion – contrary to promises made after the Cold War ended in 1991 – for undermining Russia’s security interests, helping to trigger the current conflict.\n\nWill it be?\n• The Nord Stream Pipeline Could Be Repaired Within A Year (OP)\n\nThe Nord Stream pipeline can be repaired within a year, but it’s unclear whether Germany would want to receive Russian natural gas at all, said Klaus-Dieter Maubach, the outgoing CEO at German energy giant Uniper, which was Russia’s top gas customer before Moscow cut off supply via Nord Stream. “The first question that needs answering: what’s the political will on a European level and in Berlin to bring Russian gas to Germany?” Maubach said at the annual Handelsblatt Energy summit on Tuesday, as carried by Reuters. Last summer, the German government bailed out Uniper as losses at the German company continued to mount after Russia slashed gas deliveries via Nord Stream in June, before cutting off supply in early September. At the end of December, it was Uniper, the operator of the Wilhelmshaven import terminal, that welcomed the first tanker carrying liquefied natural gas (LNG) at the newly opened LNG terminal, with the cargo arriving from the Calcasieu Pass export facility in the United States. Meanwhile, the investigation into the Nord Stream explosions at the end of September continues amid accusations from Russia that some Western intelligence services are “hiding something.” Sweden’s refusal to share information about the sabotage of the Nord Stream pipelines is “puzzling,” and withholding the results of the investigation means that “Swedish authorities are hiding something,” Russia’s Foreign Ministry spokeswoman Maria Zakharova said last week. Traces of explosives were found near the sites of the explosions at the Nord Stream 1 and Nord Stream 2 gas pipelines in the Baltic Sea, Sweden said in November, noting that the incident is “gross sabotage.” Nord Stream 2 was never put into operation after Germany axed the certification process following the Russian invasion of Ukraine. Russia, for its part, shut down Nord Stream 1 indefinitely in early September, claiming an inability to repair gas turbines because of the Western sanctions.\n\n“..if any witness or forensic evidence shows that Biden came into contact with any of these documents over the last 10 years, this dubious defense will take on a far more sinister appearance..”\n\nIn 1977, as senator from Delaware, Biden torpedoed President Jimmy Carter’s nominee for CIA director over his alleged mishandling of classified documents. As with the current scandal, Ted Sorensen was accused of having the documents for work on a book. The motive did not matter. Sen. Biden expressed his signature revulsion at the very thought of the possession. There was no evidence of ill intent, but Biden insisted that was not the issue. Biden argued that Sorensen could still be prosecuted under the Espionage Act and insisted the “real issue” during Sorensen’s confirmation hearing was “whether Mr. Sorensen intentionally took advantage of ambiguities in the law, or carelessly ignored the law.” After all, Biden continued, “If he did so, can he now bring the activities of the intelligence community within the strict limits of the law? We will expect that in the future of intelligence agencies. If that is to be the case, then we must hold the director – DCI – accountable as well.” Notably, some of the recently discovered classified documents may have been from Biden’s time as a senator — over ten years ago. I have previously noted that Biden “has always been better at expressing revulsion than responsibility.” When it came to Sorensen, Biden could not imagine a rationalization for a nominee to excuse such mishandling of classified material, but as a president, “there is no there there.” Biden has continued to make the case against himself with remarkable determination. His defense that some documents were housed in his “locked garage with my Corvette” may go down as one of the most imbecilic statements in modern political history. He then followed up with his “no regrets” comments (and his assurance of “no there there”) just before more classified documents were found “there.” While special counsel do not mind defendants making fools of themselves, they do not want to join them in such public spectacles. In this investigation, the Biden defense is looking increasingly implausible in his claim of no knowledge or responsibility. Indeed, if any witness or forensic evidence shows that Biden came into contact with any of these documents over the last 10 years, this dubious defense will take on a far more sinister appearance. It would establish not just intent and knowledge, but an effort to deceive the public and prosecutors. Yet, even after the latest batch was found, Biden and allies like Sen. Chris Coons, D-Del., are continuing to maintain that “there is no there there.” These continuing denials now border on willful blindness and the public reaction is likely to echo the president’s favorite tagline: “Come on, man.”\n\n“..Hunter Biden, is like the ambitious-but-dull son who wants to inherit the family business but always screws up..”\n\nWatching HBO’s “the Sopranos” can really help you understand the Biden family. Between Hunter Biden’s laptop scandal, and the Bidens’ various shady private-equity schemes with foreign fraudsters, it’s not too hard to make the analogy. President Joe Biden is clearly the head of a family. He has repeatedly exploited his public offices to make money. His son, Hunter Biden, is like the ambitious-but-dull son who wants to inherit the family business but always screws up. Some of what the Bidens have done is clearly inappropriate. Even more of what they have done is an abuse of public office. Most of what they have done is simply secret. The best example of Bidens’ manipulation of the system for profit surrounds the Biden Center for Diplomacy and Global Engagement at the University of Pennsylvania. The center has given the Bidens remarkable access to Chinese Communist Party money. According to reports in the New York Post, the university, “raked in a total of $54.6 million from 2014 through June 2019 in donations from China, including $23.1 million in anonymous gifts starting in 2016.” As the paper reported, about $15.8 in anonymous Chinese gifts came after the Biden Center was announced in 2017. As soon as Biden left the White House as vice president, he was tapped to lead the center and given a professorship. Shortly after the center fully opened, another $14.5 million in anonymous Chinese gifts were delivered in May 2018. In another report about this flood of money, The Free Beacon said $61 million in Chinese donations went to the university from 2017 to 2020. The numbers vary because there is virtually no public accountability or transparency about the money trail. It’s a given that Chinese sources aren’t going to share any information. And the University of Pennsylvania is simply refusing to obey the law and report the foreign donations. I worked with the Trump administration’s Department of Education on this for several years, and we simply could not get the University of Pennsylvania to open its books and explain where all the Chinese money was coming from. Consider that now-Secretary of State Antony Blinken was the manager of the Penn Biden Center. Several other Biden team members were paid by the University of Pennsylvania in the period between Joe Biden’s vice presidency and presidency. Meanwhile, in apparent appreciation for setting him up at the center, Joe Biden appointed former University President Amy Gutmann to be U.S. Ambassador to Germany. Similarly, David Cohen, the former chairman of the university’s board of trustees, is now the U.S. Ambassador to Canada.\n\nStonewalled by the White House, House investigators are turning their attention to the Secret Service in hopes of finding records showing who had access to the five tranches of classified records found in President Joe Biden’s Delaware home and Washington think tank office. House Oversight and Accountability Committee Chairman James Comer (R-Ky.) said Sunday the latest discovery of documents by the FBI during a search Friday had escalated the scandal from simply a question of incompetence, especially since the home where many of the documents were found was frequented by Hunter Biden as he pursued significant business deals with communist China. “This has all the pattern of an influence peddling scheme, and it also has the makings of a potential coverup,” Comer told Fox News’ Maria Bartiromo. “… There’s a lot of connections with the CCP directly to both Hunter Biden, Hunter Biden’s Uncle Jim and Joe Biden.” The Biden administration has refused to provide any information about the classified documents, citing last week an ongoing special counsel probe into the discoveries of five tranches of classified documents at the Wilmington, Del., family home and the Penn Biden Center in Washington since Nov. 2. Comer said Sunday the distribution of the documents at multiple locations raised concerns. “Does anyone believe that those classified documents, when they left the vice president’s office, they just took them to multiple locations all over the East Coast?” he asked. “It has the appearance that someone would have taken them and moved them around. I mean, this is very concerning.” Comer said his committee would be sending letters to the Secret Service on Monday for any records the presidential security agency has about who visited either location. “Hopefully, the Secret Service is going to work with us,” he said. “We’re requesting tomorrow formally any type of correspondence, any type of emails, any type of documentation that would help us determine who actually had access to those documents. And hopefully the Secret Service will work with us despite the fact that this White House is not.”\n\n“..oil’s share of energy production in the United States will only fall 8 percent in the next two decades, from 31 to 23 percent…”\n\nAt long last, the Biden administration is admitting what experts have always known: reckless energy policies have disastrous consequences. This time, the Department of Energy quietly released a report highlighting the positive economic benefits of developing the Keystone XL pipeline from Canada, an energy project canceled by President Biden in the hours following his inauguration. But the DOE’s report is a proverbial day late and a dollar short. The cancelation of the Keystone XL pipeline has already cost the United States thousands of jobs and billions in economic growth while families suffer under the weight of record high energy prices. It’s time for lawmakers to make American energy independence a top priority. Released without a formal announcement, the DOE’s report points out that the pipeline would have created between 16,149 and 59,000 jobs and would have had an economic benefit of between $3.4 and 9.6 billion. That’s no small impact. Yet with one stroke of his pen, Biden slashed the project and instead focused his efforts on costly “green energy” goals. As a result of his executive action, 11,000 pipeline workers were promptly laid off and told to “go to work to make solar panels” instead. But Biden’s green energy efforts are bound to backfire sooner rather than later. That’s because today, more than 70 percent of the energy produced and consumed in America comes from oil, gas and coal. That’s not likely to substantially change anytime soon. In fact, the International Energy Agency predicts that oil’s share of energy production in the United States will only fall 8 percent in the next two decades, from 31 to 23 percent. And that’s assuming a sustained commitment to green energy policies. The forecast spells bad news for the Biden White House. At his political peril, Biden ignores the lessons of Presidents Jimmy Carter and George H. W. Bush, who both lost elections due to spiked oil prices and accompanying recessions. Two years into sowing its Green New Deal policies, the administration is reaping a bitter harvest. Due to Biden’s folly, oil, natural gas and electricity prices have more than doubled in just a single year. Meanwhile, more than 28 percent of Americans abstained from purchasing food or medicine to pay an energy bill in 2021. And now, the misnamed Inflation Reduction Act includes wind and solar spending that will cost Americans $369 billion.\n\n“Klaus Schwab will stay in office until he dies..”\n• ‘Succession’ Has Nothing On Davos: Elite Conclave Mulls Next Leader (Pol.eu)\n\nIt’s the political race everyone is afraid to talk about. For 52 years the World Economic Forum has been synonymous with its founder and executive chair Klaus Schwab, whose humble manner belies what many who know him describe as great ambition and boundless energy, even into his mid-80s. Schwab has grown WEF’s $6,000 startup capital in 1971 into a $390 million a year business, turning a once sleepy organization into the think tank world’s FIFA. Today, WEF’s annual meeting attracts more billionaires and CEOs than any other event on earth, and more political leaders than any gathering outside the United Nations General Assembly. So what (and who) comes after Klaus Schwab? Schwab turns 85 in March, and it’s an open question whether he will pass the torch at all. Rupert Murdoch hasn’t. Warren Buffet hasn’t. In an era of active aging, why should Schwab? POLITICO spoke to 29 WEF corporate strategic partners, current and former WEF staffers, and members of the forum’s committees and communities. They all agree: Schwab tightly controls the succession discussion. Even those who know Schwab well profess little knowledge of his plans. Forum staffers have become used to Schwab putting a high-profile political figure in the frame for succession, only to see the idea disappear before it becomes a plan. Schwab has been reluctant to talk about succession, and has consistently refused to discuss a timetable. Five of the people POLITICO spoke to said they suspect he will stay in the job until he dies, like the monarchs and popes his critics say he styles himself after. WEF insiders are typically unwilling to talk on-the-record about the organization’s post-Schwab future. All 29 people told POLITICO they feared being barred from WEF events, while others said even speaking anonymously could get them fired. WEF is registered as a non-profit, but it’s also a multi-generation family business. Schwab’s children Nicole and Olivier hold high-ranking positions in the organization, and his wife Hilde presides over a foundation and awards ceremony in Davos. WEF’s governing statutes give family members rights to board seats. In 2017 Schwab brought in Børge Brende, a former Norwegian foreign minister, to serve as WEF’s president, while Schwab himself remained executive chair. If some outsiders expected the then 79-year-old to ease into the shadows, they were wrong: Per WEF’s website, the organization’s 800-strong staff is still “led by Founder and Executive Chairman Professor Klaus Schwab.”\n\n“An Inconvenient Truth” amassed $49 million at the world box office and catapulted Al into the top ranks of climate hysterics, and he’s never looked back..”\n\nFormer Vice President and 2000 presidential election loser Al Gore has spent his post-political career warning anyone who will listen that the earth is in its death throes due to global warming (now called climate change because somehow that’s better). His 2006 documentary “An Inconvenient Truth” amassed $49 million at the world box office and catapulted Al into the top ranks of climate hysterics, and he’s never looked back, constantly jetting to meetings around the world to preach his truth. This week he’s at the World Economic Forum in Davos, Switzerland, because of course he is. Is he doing this because he truly believes what he’s saying, or because he cares so very much about you? While we can’t read his mind, one thing we do know for sure: climate change has been very, very good to Al Gore. Though he was worth approximately $1.7 million at the end of his vice presidency, he has now amassed an estimated $330 million fortune, owns houses in Virginia, California, and Tennessee, and receives a cool $2 million a month for a figurehead position at the Generation Investment Management green energy fund he founded with former Goldman Sachs Managing Director David W. Blood. There are only two conclusions I can come to upon learning this news—1) I should have been a climate activist. 2) Hunter Biden has nothing on this guy. If he’s so concerned about rising seas, why would Gore buy a huge oceanview mansion in flood-prone Montecito? One might ask the same question of former president Barack Obama, who dropped $12 million for a waterfront view on the island of Martha’s Vineyard. Gore’s other property holdings are pretty sweet, too, according to Daily Mail:”Gore’s family has owned farming land in his native Tennessee for generations, while his mansion in Nashville is valued at $7.5 million, his waterfront villa in Montecito, where he counts Oprah as a neighbor [and don’t forget Prince Harry], is worth $13 million, his Virginia home is worth around $3 million as is his apartment in the St. Regis building in San Francisco.” Where did he get all this money? He has a stake in the aforementioned $36 billion Generation Investment Management fund, around $80 million worth of stock in companies such as Apple and Google, and a salary from Apple as a compensation committee member. He receives $200,000 a pop per public speaking engagement and also advises companies on “going green” for undisclosed (but presumably huge) fees.\n• Trump and DeSantis Both Leading Biden In Hypothetical 2024 Matchup (JTN)\n\nWall Street Journal editorial board member Allysia Finley has taken a flamethrower to vaccine makers over their “deceptive” campaign for bivalent Covid boosters, and slams several federal agencies for taking “the unprecedented step of ordering vaccine makers to produce them and recommending them without data supporting their safety or efficacy.” “You might have heard a radio advertisement warning that if you’ve had Covid, you could get it again and experience even worse symptoms. The message, sponsored by the Health and Human Services Department, claims that updated bivalent vaccines will improve your protection. This is deceptive advertising. But the public-health establishment’s praise for the bivalent shots shouldn’t come as a surprise. -WSJ” The narrative behind the campaign was simple; mRNA Covid shots could simply be ‘tweaked’ to to target new variants – in this case, the jabs were claimed to confer protection against BA.4 and BA.5 Omicron variants, along with the original Wuhan strain. To call this wishful thinking would be extremely generous. As Finley writes, three scientific problems have arisen. 1/ The virus is mutating much faster than vaccines can be updated. 2/ Vaccines have ‘hard wired’ our immune systems to respond to the original Wuhan strain, “so we churn out fewer antibodies that neutralize variants targeted by updated vaccines.” 3/ Antibody protection wanes after just a few months. Finley has brought receipts too… Two studies in the New England Journal of Medicine this month showed that bivalent boosters increase neutralizing antibodies against the BA.4 and BA.5 variants, but not significantly more than the original boosters. In one study, antibody levels after the bivalent boosters were 11 times as high against the Wuhan variant as BA.5. The authors posit that immune imprinting “may pose a greater challenge than is currently appreciated for inducing robust immunity against SARS-CoV-2 variants.” This isn’t unique to Covid or mRNA vaccines, though boosters may amplify the effect. Our first exposure as children to the flu—whether by infection or vaccination—affects our future response to different strains. -WSJ”\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle January 23 2023 - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2023/01/debt-rattle-january-23-2023/", "site_name": "The Automatic Earth", "article:published_time": "2023-01-23T09:45:35+00:00", "article:modified_time": "2023-01-23T09:53:02+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2020/04/EdwardHopperFollyBeach1929.jpg"}, "tags": ["Moldova", "Nord Stream", "Sopranos", "tanks", "Al Gore", "leopard", "Schwab", "Keystone XL", "WSJ", "AOC", "Abrams"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">⚠️\"This 'VACCINE' KILLS 83% of all fetuses in pregnant women.\" ~Dr. Peter McCullough</p>\n<p>\" During pregnancy, the administration of the vaccine determines a rate of 83% of pregnancy loss in women.While breastfeeding, vaccinated mothers kill their own children.  <br/>And all out of love? <a href=\"https://t.co/v9JNPEVSp1\">pic.twitter.com/v9JNPEVSp1</a></p>\n<p>— Deplorable4trump2024 (@PTRUMPFORTX2020) <a href=\"https://twitter.com/PTRUMPFORTX2020/status/1617229423467716609?ref_src=twsrc%5Etfw\">January 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">NEW — Pfizer CEO Responds to Reports of Sudden Cardiac Arrests Post-Vaccination</p>\n<p>“We constantly review and analyze the data. We’ve not seen a single [safety] signal although we have distributed billions of doses.” <a href=\"https://t.co/wsQRbg5hfy\">pic.twitter.com/wsQRbg5hfy</a></p>\n<p>— Chief Nerd (@TheChiefNerd) <a href=\"https://twitter.com/TheChiefNerd/status/1616922479787757568?ref_src=twsrc%5Etfw\">January 21, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">'The time of the Wild West is over,' EU's Věra Jourová warns Elon Musk’s Twitter from Davos<br/>Source: euronews (Youtube) <a href=\"https://t.co/FskSofrn13\">pic.twitter.com/FskSofrn13</a></p>\n<p>— Wittgenstein (@backtolife_2023) <a href=\"https://twitter.com/backtolife_2023/status/1617260785880686592?ref_src=twsrc%5Etfw\">January 22, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Aiming for a practical 99% efficient drive train is the goal of chainless bike Project CeramicSpeed DrivEn </p>\n<p>[read more: <a href=\"https://t.co/3SwZIHEssM\">https://t.co/3SwZIHEssM</a>]<a href=\"https://t.co/ma5NDV9E8h\">pic.twitter.com/ma5NDV9E8h</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1617129332320657413?ref_src=twsrc%5Etfw\">January 22, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/67inSOqk6iY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/67inSOqk6iY"}], "links": ["https://www.metmuseum.org/art/collection/search/481209", "https://www.azerbaycan24.com/en/zelenskyy-50-tanks-will-not-solve-problem/", "https://www.azerbaycan24.com/en/us-lawmaker-proposes-just-one-abrams-tank-for-ukraine/", "https://www.azerbaycan24.com/en/macron-comments-on-heavy-tanks-for-ukraine/", "https://www.azerbaycan24.com/en/ex-russian-president-predicts-new-anti-us-military-alliance/", "https://www.azerbaycan24.com/en/aoc-heckled-over-ukraine-weapons/", "https://www.azerbaycan24.com/en/european-nation-fails-to-remain-neutral-in-global-proxy-war-ex-leader/", "https://oilprice.com/Latest-Energy-News/World-News/The-Nord-Stream-Pipeline-Could-Be-Repaired-Within-A-Year.html", "https://jonathanturley.org/2023/01/22/the-immaculate-possession-biden-defense-is-vast-becoming-unsustainable/", "https://www.gingrich360.com/2023/01/18/biden-family-the-delaware-sopranos/", "https://justthenews.com/accountability/political-ethics/monhouse-investigators-press-secret-service-about-who-had-access", "https://www.realclearenergy.org/articles/2023/01/19/the_biden_administration_finally_admits_its_mistake_in_canceling_the_keystone_xl_pipeline_876557.html", "https://www.politico.eu/article/succession-has-nothing-on-davos-elite-conclave-mulls-next-leader/amp/", "https://redstate.com/bobhoge/2023/01/20/how-al-gore-amassed-a-330-million-climate-fortune-by-terrifying-everyone-n691270", "https://justthenews.com/politics-policy/elections/if-president-biden-democratic-candidate-2024-either-trump-or-desantis", "https://www.zerohedge.com/political/wsj-shreds-vaccine-makers-biden-admin-over-deceptive-booster-campaign", "https://t.co/v9JNPEVSp1", "https://twitter.com/PTRUMPFORTX2020/status/1617229423467716609?ref_src=twsrc%5Etfw", "https://t.co/wsQRbg5hfy", "https://twitter.com/TheChiefNerd/status/1616922479787757568?ref_src=twsrc%5Etfw", "https://t.co/FskSofrn13", "https://twitter.com/backtolife_2023/status/1617260785880686592?ref_src=twsrc%5Etfw", "https://www.azerbaycan24.com/en/zelenskyy-50-tanks-will-not-solve-problem/", "https://www.azerbaycan24.com/en/zelenskyy-50-tanks-will-not-solve-problem/", "https://www.azerbaycan24.com/en/us-lawmaker-proposes-just-one-abrams-tank-for-ukraine/", "https://www.azerbaycan24.com/en/us-lawmaker-proposes-just-one-abrams-tank-for-ukraine/", "https://www.azerbaycan24.com/en/macron-comments-on-heavy-tanks-for-ukraine/", "https://www.azerbaycan24.com/en/macron-comments-on-heavy-tanks-for-ukraine/", "https://www.azerbaycan24.com/en/ex-russian-president-predicts-new-anti-us-military-alliance/", "https://www.azerbaycan24.com/en/ex-russian-president-predicts-new-anti-us-military-alliance/", "https://www.azerbaycan24.com/en/aoc-heckled-over-ukraine-weapons/", "https://www.azerbaycan24.com/en/aoc-heckled-over-ukraine-weapons/", "https://www.azerbaycan24.com/en/european-nation-fails-to-remain-neutral-in-global-proxy-war-ex-leader/", "https://www.azerbaycan24.com/en/european-nation-fails-to-remain-neutral-in-global-proxy-war-ex-leader/", "https://oilprice.com/Latest-Energy-News/World-News/The-Nord-Stream-Pipeline-Could-Be-Repaired-Within-A-Year.html", "https://oilprice.com/Latest-Energy-News/World-News/The-Nord-Stream-Pipeline-Could-Be-Repaired-Within-A-Year.html", "https://jonathanturley.org/2023/01/22/the-immaculate-possession-biden-defense-is-vast-becoming-unsustainable/", "https://jonathanturley.org/2023/01/22/the-immaculate-possession-biden-defense-is-vast-becoming-unsustainable/", "https://www.gingrich360.com/2023/01/18/biden-family-the-delaware-sopranos/", "https://www.gingrich360.com/2023/01/18/biden-family-the-delaware-sopranos/", "https://justthenews.com/accountability/political-ethics/monhouse-investigators-press-secret-service-about-who-had-access", "https://justthenews.com/accountability/political-ethics/monhouse-investigators-press-secret-service-about-who-had-access", "https://www.realclearenergy.org/articles/2023/01/19/the_biden_administration_finally_admits_its_mistake_in_canceling_the_keystone_xl_pipeline_876557.html", "https://www.realclearenergy.org/articles/2023/01/19/the_biden_administration_finally_admits_its_mistake_in_canceling_the_keystone_xl_pipeline_876557.html", "https://www.politico.eu/article/succession-has-nothing-on-davos-elite-conclave-mulls-next-leader/amp/", "https://www.politico.eu/article/succession-has-nothing-on-davos-elite-conclave-mulls-next-leader/amp/", "https://redstate.com/bobhoge/2023/01/20/how-al-gore-amassed-a-330-million-climate-fortune-by-terrifying-everyone-n691270", "https://redstate.com/bobhoge/2023/01/20/how-al-gore-amassed-a-330-million-climate-fortune-by-terrifying-everyone-n691270", "https://justthenews.com/politics-policy/elections/if-president-biden-democratic-candidate-2024-either-trump-or-desantis", "https://justthenews.com/politics-policy/elections/if-president-biden-democratic-candidate-2024-either-trump-or-desantis", "https://www.zerohedge.com/political/wsj-shreds-vaccine-makers-biden-admin-over-deceptive-booster-campaign", "https://www.zerohedge.com/political/wsj-shreds-vaccine-makers-biden-admin-over-deceptive-booster-campaign", "https://t.co/3SwZIHEssM", "https://t.co/ma5NDV9E8h", "https://twitter.com/Rainmaker1973/status/1617129332320657413?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2023-01-23T09:45:35+00:00"}