{"result_id": "285002", "URL": "https://www.theautomaticearth.com/2021/09/the-vaccines-kill-many-more-people-than-they-save/", "timestamp": "2023-04-25 17:16:02 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/09/the-vaccines-kill-many-more-people-than-they-save/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The Vaccines Kill Many More People Than They Save", "cleaned_text": "Politicians and so-called experts across the planet increasingly want to force you to get inoculated with a substance that takes away at least twice the lives it saves, across all age groups. It doesn’t matter anymore if this is intentional or just sheer incompetence, we have no time left to discuss that. We’re killing people. Millions of people. Our loved ones, family, friends, and neighbors. It has to stop. Now. We have gone mad. Maybe Steve Kirsch’s access to the FDA can help.\n\nAnd when Steve says the vaccines killed 200,000 Americans so far already, and permanently disabled 300,000, remember that this is just the tip of the iceberg: many if not most of the effects will only show up later. And then Pfizer today claims that their stuff is safe for kids 5 years old and up. Who are 99.9996% safe if they get infected, due to their immune system, which also gets killed by the vaccines.\n\nAnd I would have some questions about the people “saved” by the vaccines. Because a recent Israel study suggests only that “a booster can strengthen protection for a few weeks in older adults.” A few weeks? And we call that a vaccine now?\n\nStop it. We have gone mad.\n\nThe US Food and Drug Administration (FDA) may have opened Pandora’s box on Covid. Not sure why, but for some reason they invited Steve Kirsch to a virtual meeting of the FDA Vaccine Advisory Committee, aka the Vaccines and Related Biological Products Advisory Committee, on September 17. The same committee that decided not to recommend booster shots for all Americans.\n\nKirsch is an entrepreneur who started several companies in the computing field, for instance Infoseek. He’s worth a few hundred million dollars. He also set up treatearly.org, which promotes early treatment for Covid. Didn’t anyone at the FDA know that in March, Kirsch offered $1 million to anyone who could prove fluvoxamine was not what saved 77 people in a trial, and identify what did?\n\nOr that he offered $10,000 for a one hour debate on Covid? Or did someone at the FDA open Pandora’s box on purpose? And I know, officially the committee is independent from the FDA, and I don’t know what role Kirsch played in the 16-2 decision against boosters, but there are obviously some people there who feel uncomfortable with the current vaccine-at-all-costs approach. I wouldn’t rule out it was done on purpose. But the info is out there now, and YouTube and Twitter are not going to ban or shadowban the FDA.\n\nAnd he’s banned from YouTube and Twitter:\n\nHere’s part of his presentation to the committee. The vaccines kill twice as many people as they save.\n\nI summarized part of his latest slide deck here:\n\nWhat You Need To Know About Covid Vaccine Safety\n\nCensorship required The way to fight truth is using misinformation, intimidation, mandates, and censorship. Our government is ignoring early treatments and tells everyone that early treatment don’t work. They demonize the key treatment used by India to be COVID-free. Their agenda is to push the vaccine, not to cure COVID. Social media companies will censor, demonetize, and/or ban you for telling the truth. If you are a doctor, you can have your license revoked if you say the vaccines are unsafe.\n\nCOVID vaccines kill more people than they save for all age groups. On average, in the US, COVID vaccines kill 2 people for every person they save over a 6 month period.\n\nHere’s how we compute the 2:1 ratio that shows the vaccines are nonsensical.\n\nV:C is the ratio of the the number of vaccine-caused deaths (V) relative to the projected number of COVID deaths (C) that could be saved by the vaccine over a 6 month period. A number like 2:1 means we kill 2 people for every COVID death we save. That’s bad. For a COVID vaccine to be viable, you’re looking for V:C of 1:x where x > 100, i.e., you want the risk to be very small compared to the benefit. If you are saving the lives of >100,000 people, you don’t want to have to kill >1,000 people to have to do that. That would completely unacceptable in a civilized society and would be unprecedented in modern times, especially when we have early treatments that work with over 99% risk reduction that don’t have any safety issues.\n\nV:C varies by place, time, age. V:C depends on the vaccine type, the rate of COVID deaths in your community at a particular time, and your age. For this presentation, we’ll compute this as a country-wide average for the US.\n\nDetermining V.\n\n In general, the three vaccines in the US work through a very similar process. The vaccines have an estimated death rate of close to 1 death for every 1,000 people who are vaxed. Here, we calculate a deaths per million doses for each age range (using VAERS). For risk/reward assessments done by age, this gives the most precise guidance.\n\nDetermining C.\n\n We use COVID mortality data from the CDC to determine the risk of death from COVID.\n\nIs the vaccine safe for some age groups? The vaccines may have a positive risk/benefit for people in a certain demographic. The CDC and FDA think the vaccines are perfectly safe and have killed no one, so they have never done this analysis. For example, the VRBPAC unanimously approved boosters for people over 65. None of the panel members made the risk-benefit calculation. They were guessing. Were they right? No. They were dead wrong based on both our calculations and the real-world evidence. Here’s what the detailed calculations showed…\n\nV:C in the US is not favorable for any age. The table shows the V:C numbers by age.\n\nYou can read this article which details how all these numbers were calculated. So for kids, we kill over 6 kids to save 1 kid from a COVID death. Mandating vaccination for anyone, especially school-age children, is proof of a corrupt society. Therefore, it’s nonsensical to vaccinate any age group. The FDA VRBPAC committee concluded that there is a benefit for 65 year old and older, but they refused to consider the mortality caused.\n\nThe full presentation, all 8+ hours of it. I set it to start at the point where Kirsch comes in, but knock yourself out.\n\nHere are some earlier things by Kirsch.\n\nI am the founder of the COVID-19 Early Treatment Fund (www.treatearly.org). Our work in funding early treatments for COVID was featured on 60 Minutes. I have been vaccinated and my entire family has been vaccinated. However, shortly after I was fully vaccinated, I began to hear stories from my friends that were very troubling. For example, one friend had three relatives who were formerly healthy die after getting the vaccine. Another friend had a heart attack 2 minutes after the injection and is now disabled, apparently for life. I assembled a team of over 19 doctors and scientists listed at the end of this comment to investigate the available evidence. Using the VAERS database and other official government data sources from the US and around the world (covering 35% of the world’s population), we found evidence that clearly demonstrates that the current vaccines are significantly more dangerous than has been previously believed. 1/ The “real world” fatality data from VAERS does not match the fatality data from the Phase 3 trials. They aren’t even close. Using multiple independent methods, we estimate that over 150,000 Americans have already been killed. It is urgent to resolve this discrepancy as soon as possible as we strongly believe that the real world data is right and the vaccines should be immediately stopped. 2/ None of the COVID vaccines reduce all-cause morbidity. It’s the opposite: they all significantly increase all-cause morbidity by as much as 4.2 times baseline (p<=0.00001). The CDC must know this since this information is hiding in plain sight in the published literature. What is the point of offering an optional medical intervention which significantly increases all-cause morbidity when safer alternatives such as early treatment are available? 3/ There is an error in the adverse event detection formula used by the CDC that appears to have prevented the CDC from seeing the safety signals that were obvious to our VAERS experts. 4/ Early treatment and prophylaxis protocols are a superior option to the current vaccines, yet have been inexplicably ignored by the NIH:\n• Higher relative risk reduction (over 99%)\n• Greater safety (minor temporary side effects, known safety profile)\n\n – They lower both all-cause mortality and all-cause morbidity\n\n – They work equally well on all variants\n\n – They do not promote escape variants\n\n – They do not cause vaccine enhanced infectivity/replication\n\n – They do not cause prion diseases\n\n – They prevent long-haul COVID syndrome nearly 100% of the time\n\n – They enable people to acquire recovered immunity which is both 13 times stronger and more durable than vaccine-induced immunity We recommend the committee take the following actions:\n• Require autopsies for all deaths within 4 weeks of any COVID19 vaccination so that data is available to compute an estimate of the true all-cause mortality.\n• Make available the analysis of the 11,000 deaths investigation in VAERS for public inspection. It’s important for the public to understand why the CDC couldn’t attribute a single death to the vaccine whereas one of the world’s top pathologists ascribed at least 30% of all deaths to the vaccine.\n• Explain publicly why there is a death peak on the second day after vaccination if the vaccinations are perfectly safe and not causing deaths.\n• Explain publicly why the severe adverse side effects are dose dependent [..]\n• Recommend that vaccine mandates should not be issued without evidence of a statistically significant all-cause morbidity decrease (which there is not in this case).\n• Define a COVID vaccine stopping condition after which that vaccine should be halted until the stopping issues are addressed. In 1976, the stopping threshold was 35 deaths.\n\n\n\nShould You Get Vaccinated?\n\nThe vaccines kill at least twice as many people as they save. And if you don’t take them, you will be an outcast. We have gone outrageously mad.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccines Kill Many More People Than They Save - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Donate with Paypal, Bitcoin and Patreon.", "url": "https://www.theautomaticearth.com/2021/09/the-vaccines-kill-many-more-people-than-they-save/", "site_name": "The Automatic Earth", "article:published_time": "2021-09-20T16:37:55+00:00", "article:modified_time": "2021-09-20T16:38:01+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/08/Cole_Thomas_The_Course_of_Empire_Destruction_1836-650.jpg"}, "tags": ["FDA", "vaccines", "Pfizer", "CDC", "Steve Kirsch"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/NuPEKiLwZ8k\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/NuPEKiLwZ8k"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WFph7-6t34M?start=15601\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/WFph7-6t34M?start=15601"}], "links": ["https://en.wikipedia.org/wiki/The_Course_of_Empire_(paintings)", "https://www.nationalreview.com/news/fda-advisory-panel-rejects-covid-booster-shot-for-most-americans/amp/", "https://www.skirsch.io/25-000-reward-if-you-can-show-we-need-more-data-re-fluvoxamine-for-covid-19/", "https://www.skirsch.com/covid/All.pdf", "https://www.skirsch.com/covid/VCage.pdf", "https://docs.google.com/document/d/17CFjK6MEkz82cGY0FXbqOX7lBayqGFf3ae4prOodxok/edit", "https://trialsitenews.com/should-you-get-vaccinated/", "https://1drv.ms/w/s!AuQekYR2iMPzg_oD9u3yaYbTNA7p7w?e=lu1nHo", "https://ottawacitizen.com/news/local-news/increased-risk-of-heart-muscle-inflammation-linked-with-mrna-vaccines-seen-in-ottawa", "https://twitter.com/ScienceMagazine/status/1401192114239721478", "https://www.news-medical.net/news/20210608/No-point-vaccinating-those-whoe28099ve-had-COVID-19-Findings-of-Cleveland-Clinic-study.aspx", "https://vaccinechoicecanada.com/wp-content/uploads/vcc-open-letter-dr-hoffe-to-dr-henry-april-5-2021.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://www.youtube.com/watch?v=vGBDETOPAJA", "http://www.covidlonghaulers.com", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-09-20T16:37:55+00:00"}