{"result_id": "285020", "URL": "https://www.theautomaticearth.com/tag/vaccine/", "timestamp": "2023-04-25 17:16:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "vaccine Archives", "cleaned_text": "Who and what will be the future of Ukraine?\n\nRussia’s Wagner paramilitary group in the overnight hours on Monday has claimed victory (or at least a partial victory) over Bakhmut by raising the Russian flag as well as its own PMC Wanger Group flag over central government administration buildings of Bakhmut. Wagner chief Yevgeny Prigozhin described that the key city in Donetsk is “ours” but only in a “legal sense”. He wrote on Telegram: “The commanders of the units that took city hall and the whole center will go and put up this flag,” he said in reference to a Russian flag being raised in the accompanying video. “This is the Wagner private military company, these are the guys who took Bakhmut. In a legal sense, it’s ours.” About two weeks ago Prigozhin claimed that Wagner and Russian forces controlled 70% of the utterly destroyed town, and as the Ukrainians were mounting a stiff defense, pouring more resources into the months-long fight. Hours prior to Prigozhin video showing the flag-raising against a dark night sky, the Ukrainian general staff acknowledged that “the enemy has not stopped its assault of Bakhmut… Ukrainian defenders are courageously holding the city as they repel numerous enemy attacks.” The announcement was meant to convey that the Ukrainian Army still considers that it “holds” Bakhmut. Russian sources say Ukrainian fighters are still concentrated on the Western outskirts. However, going into the weekend it was already clear that Wagner fighters were on the cusp of taking the city center… On Sunday President Zelensky was still sounding somewhat optimistic regarding the fate of Bakhmut: “I am grateful to our warriors who are fighting near Avdiivka, Maryinka, near Bakhmut… Especially Bakhmut! It’s especially hot there today!” Zelensky said in his own post to Telegram. Near Bakhmut, about 27 kilometres (17 miles) away in Kostyantynivka, a “massive attack” of Russian missiles left three men and three women dead and eleven wounded Sunday, Ukrainian authorities said. Zelensky said the affected zones are “just residential areas”, where “ordinary civilians of an ordinary city of Donbas” were targeted. Zelensky in an interview last week suggested that he may be forced to negotiate with Russia if his forces are definitively defeated at Bakhmut, while also hinting at huge losses.\n\n“..those who persecute them, “will not get any advantage earthly or heavenly, either physically or mentally… They will be hurt. They will be condemned..”\n\nThe “evildoers” who persecute Christians will derive no benefit from such action either on Earth or in the afterlife, Kesis Mezgebu, a prominent Ethiopian Orthodox priest, has told RT. Mezgebu, who serves at the Holy Trinity Theological University in Addis Ababa, was commenting on the attempts by the government of Ukrainian President Vladimir Zelensky to evict the monks of the Ukrainian Orthodox Church (UOC) from the country’s Kiev-Pechersk Lavra monastery. On Saturday, Metropolitan Pavel, the abbot of the Lavra, was placed under house arrest on accusations of “inciting religious hatred” and “justifying” Russia’s military operation in Ukraine. The abbot has vigorously denied those allegations. What’s happening in Ukraine is a “catastrophic event,” perpetrated by an “evil force,” Mezgebu said in an interview on Sunday. “This is atrocity…hatred… completely evil spirit,” he added, describing the actions of the Kiev authorities. Christians tend to help others and are always a stabilizing factor in a society, so those who persecute them, “will not get any advantage earthly or heavenly, either physically or mentally… They will be hurt. They will be condemned,”he said. According to Mezgebu, followers of the UOC in Ukraine “might be in danger soon” because they may be left with no other choice but to tell the “evildoers” to stop what they’re doing. He urged believers to stay “peaceful [and] remain within the Church” to avoid escalation. Ukraine has experienced religious tensions for years, with two entities claiming to be the country’s true Orthodox Church. The Kiev government is supporting the Orthodox Church of Ukraine (OCU), which was created only in 2014 and which the Russian Orthodox Church considers schismatic. Zelensky has explained the moves against the UOC by the need to protect Ukraine’s “spiritual independence”and deprive Russia of an opportunity to “to manipulate the spirituality of our people” amid the conflict between the two countries. However, the Ethiopian priest suggested that “nationalist xenophobia” can only lead to suffering. “This will never take us anywhere. We have a lot of things to do together in harmony and collaboration, rather than destroying one another in the name of nationality or whatever kind of patriotic feeling. This is not how you reveal your patriotism,” he explained. Mezgebu also suggested that the West is aware of the religious persecution in Ukraine, but – despite having the ability to intervene – it remains silent on the issue because it shares a “similar agenda” with Kiev.\n\n“..we must remember that 2006-9 was just a rehearsal. The finale is starting now..”\n\nSadly, gold is now on its way to heights which are unthinkable for most people. To all the people who have asked me over the years why gold doesn’t go up, I have replied: “Don’t wish for gold to go up substantially for when it does, your quality of life will deteriorate remarkably.” And we are now at the point in the world when this is likely to happen. [..] I came to the conclusion early in this century that a sick financial system was not going to survive the infestation of vermin in the form of debt that started just over 50 years ago. Nixon’s closing of the gold window in 1971 was the signal that this currency system was going to end like all currency systems in history. And for the ones who haven’t studied the history of money, let me tell you that NO FIAT MONEY HAS EVER SURVIVED IN HISTORY IN ITS ORIGINAL FORM. So with all money going to ZERO, it has never been a question of if but only of when the dollar based currency system would die. [..] At the beginning of the Ukraine conflict I and some others made the analogy with the Cuban Missile Crisis in 1962 (which I remember well) when Kennedy gave an ultimatum to Khrushchev to withdraw the nuclear missiles pointing towards the US or face war. In the same way as with Cuba, Russia was never going to accept Ukraine becoming a Nato country. But sadly the US Neocons have seen this conflict as the last chance to save the US military, political and economic hegemony from total collapse. Defeating Russia was the last stand for the US. But it now looks like they will fail which seals the fate of the US empire. The US neocons forced a much too willing Europe to not only agree to the sanctions against Russia but also make direct contributions to the war both with money and equipment. This fatal mistake by Europe and especially Germany is totally crushing the European economy. But what the US neocons never understood is that the US sanctions would affect the whole world and in particular the debt infested US and the West. [..] we must remember that 2006-9 was just a rehearsal. The finale is starting now. The debt which has built up has now reached levels which means the financial system is now too big to survive. Three US banks and one Swiss went under 2 weeks ago although two of the four were rescued temporarily at a high cost. The Swiss government could not afford to let Credit Suisse go under and is supporting the UBS takeover of the Credit Suisse at a potential extraordinary cost of CHF 209 billion. Central banks are on standby to stop the next bank run. Many expected Deutsche Bank to be next. Governments will stop major banks from going under for as long as they can, to stop global contagion. But they will of course fail. The FDIC (Federal Insurance Deposit Corporation) currently has a capital of $128 billion dollars to support a total of $18 trillion deposits. So with 0.7% cover, it is guaranteed that the US government will soon need to step in as the next lot US of banks fail. Same in Europe where the most EU banks and the ECB are in a terrible shape. Total central bank assets are $25 trillion which is less than 10% of global debt before derivatives. Default rates in coming years are likely to exceed 50% which means much more money printing to come.\n\nThe US has lost Saudi Arabia.\n\n“..respect the Russian authorities’ decision made in conformity with law and Russia’s international commitments..”\n• Lavrov Tells Blinken: Up To Court To Decide About US Journalist Future (TASS)\n\nRussian Foreign Minister Sergey Lavrov has told US Secretary of State Antony Blinken that it is up to court to decide about the future of The Wall Street Journal reporter Evan Gershkovich who was detained on espionage charges in Russia, the Russian foreign ministry said on Sunday after their telephone conversation. “In light of the established evidence of the US national’s illegal activities, his future will be determined by court. The American embassy in Moscow was duly notified about his detention,” the ministry said. “In the context of the discussion of the issue of the detention of US national Gershkovich in Russia on suspicion of espionage, which was raised by the Secretary of State, Blinken’s attention was drawn to the necessity to respect the Russian authorities’ decision made in conformity with law and Russia’s international commitments,” the ministry said. “Lavrov stressed that Gershkovich had been detained red-handed when he was receiving secret data and was collecting data constituting a state secret acting under the guise of a journalist’s status.” The Russian top diplomat also told his US counterparts that it is inadmissible to fan hysteria around the journalist’s arrest. “It was stressed that it is inadmissible for Washington officials and Western mass media to stir up hysteria with an obvious aim of giving a political overtone to this case,” the ministry said. According to the ministry, Lavrov and Blinken also touched upon several other bilateral matters. The call was initiated by the US side. Lavrov and Blinken had a ten-minute meeting on the sidelines of the Group of Twenty meeting in New Delhi. According to the Russian minister, the meeting was quite constructive. The topics included the situation in the sphere of strategic stability in the context of the New START treaty and Ukraine. The Public Relations Center of Russia’s Federal Security Service (FSB) said earlier that Evan Gershkovich, “acting at the behest of the American side, collected information constituting a state secret about the activities of an enterprise within Russia’s military-industrial complex.” The reporter was detained in the Urals city of Yekaterinburg. The FSB investigators opened a criminal case against the US citizen under Article 276 of the Russian Criminal Code (“Espionage”). On March 30, Moscow’s Lefortovo district court sanctioned Gershkovich’s arrest until May 29. In light of this, The Wall Street Journal (WSJ) published a statement expressing deep concern for the safety of Gershkovich. According to the WSJ, Gershkovich covers Russia from his post at the newspaper’s Moscow bureau.\n• ‘Lower the Rhetoric’ on China, Says Milley (D1)\n\nEveryone needs to calm down about war with China, Gen. Mark Milley said on Friday. The Joint Chiefs chairman warned against the rise of “overheated” rhetoric of a looming U.S. war with China, and he said he doubts China’s chances of “conquering” Taiwan. But, he added, the United States should continue to quicken arms shipments to the self-governing nation and its own military capabilities, just in case. Following this year’s Chinese balloon scare, the China heat is on. In the last two weeks, members of Congress in hearings aimed a list of concerns about China—everything from nuclear weapons to computer chips, invading Taiwan, and allying with Russia—at Milley and Defense Secretary Lloyd Austin. Milley has taken to telling lawmakers that war with China—and Russia—is “not imminent or inevitable.” It’s part of an effort to lower the heat, he said. “I think there’s a lot of rhetoric in China, and a lot of rhetoric elsewhere, to include the United States, that could create the perception that war is right around the corner or we’re on the brink of war with China,” Milley said in an interview with Defense One. “And that could happen. I mean, it is possible that you could have an incident or some other trigger event that could lead to uncontrolled escalation. So, it’s not impossible. But I don’t think at this point I would put it in the likely category,” said Milley. “And I think that the rhetoric itself can overheat the environment.” Still, Milley said he agrees with calls for the United States to send arms into Taiwan as quickly as possible, to beat China’s Xi Jinping to any punch. Xi has said he wants the People’s Liberation Army armed and ready to take Taiwan by force, if necessary, by 2027. “So if you think about it, that’s only four years away,” Milley said. “So, one of the elements of deterrence is to make sure that your opponent knows that the cost exceeds the benefit. So, for Taiwan, we’ve—my guess is we’ve got three or four years to get Taiwan in a position where they will create the perception in the minds of the Chinese decision makers that the cost exceeds that.” Milley said Taiwan needs air defense, anti-ship cruise missiles, and anti-ship mines. But he said the island itself, its population of 23 million—including 170,000 active duty military and 1-to-2 million reserves,—and China’s lack of experience make a takeover unlikely. “It favors the defense. It would be a very difficult island to capture,” he said.\n\n“Ukrainian operators did everything to monetize the situation. In European ports..“\n\n“.. lustration,” or a vetting process to determine who would lose their political rights over ties to the Russian state..”\n\nThe idea of renaming Sevastopol as part of Kiev’s plan to retake Crimea from Russia should not be taken seriously, the governor of the port city, Mikhail Razvozhaev told TASS news agency on Sunday. Earlier in the day, Aleksey Danilov, the secretary of Ukraine’s National Security and Defense Council, took to Facebook to post what he called “12 steps for the de-occupation of Crimea.” One of the proposed steps was to rename Sevastopol – first simply to “Installation No.6” and then to Akhtiar, after a small settlement that used to exist in the area. The re-branding would be necessary to “break the historic perception [of Sevastopol] as a city of Russian military glory,” the Kiev official stated. Danilov also suggested that if the peninsula became Ukrainian again the Crimean Bridge connecting it to mainland Russia would be destroyed, while the local population would undergo so-called “lustration,” or a vetting process to determine who would lose their political rights over ties to the Russian state. Reacting to Danilov’s plan, Razvozhaev said that “the news from Ukrainian politicians is more like entries in the medical record from Ward No.6.” He was likely referring to the 1892 short story ‘Ward No. 6’ by iconic Russian author Anton Chekhov, which depicts events at a provincial mental asylum. “One can’t take statements and comments of sick people seriously. They need to be treated, which is what our military is doing right now,” the Sevastopol governor pointed out as cited by TASS news agency. Sevastopol, in the south of the Crimean peninsula, serves as the headquarters of the Russian Black Sea Fleet. It is one of three federal cities under Russian law, together with Moscow and St Petersburg. The name Sevastopol, which was given to the city when it was founded by the Russian Empire in 1783, is composed of Greek words “sebastos,” which means “venerable,” and “polis,” which means “city.” For months, Ukraine has been mulling a major counteroffensive aimed at restoring control over all territories lost to Russia, including Crimea. Former Russian president and current deputy head of the country’s Security Council, Dmitry Medvedev, said earlier this week that the claims by Ukrainian officials were just “propaganda” and shouldn’t be treated seriously. However, Medvedev warned that if the peninsula, which reunited with Russia as a result of a referendum in 2014, is actually attacked, it could become “the basis for the use of all means of protection, including those provided for by the fundamentals of the Doctrine of Nuclear Deterrence.”\n\n“We need to teach America a lesson in these elections,” Erdogan said..\n• Erdogan Tells US Ambassador To ‘Know His Place’ (RT)\n\nWhat could go wrong?\n• US Allows Migrants To Pick Their Gender (RT)\n• Banana Time for the Rule of Law (Kimball)\n\nThe Czech novelist Milan Kundera published The Joke, his first novel, in 1967. It traces the fortunes of Ludvik, a young student, after his politically correct girlfriend shows the Communist authorities a postcard he had written to her as a joke: “Optimism is the opium of the people! A healthy atmosphere stinks of stupidity! Long live Trotsky! Ludvik.” As a result of this whimsy, Ludvik finds himself expelled from the Communist Party, the university, and is eventually conscripted to work in the mines. That’s the way things are in totalitarian societies. No jokes allowed, especially not jokes told at the expense of the regime. Thus it is that North Korea banned sarcasm and irony. Poor Ludvik suffered for his joke. But he got off easy compared to Douglass Mackey, a social media “influencer” who wrote under the pen name “Ricky Vaughn.” During the 2016 election cycle, Mackey/Vaughn posted a funny meme urging Hillary voters to “avoid the line and vote from home” by texting “Hillary” to a certain number. Who would be stupid enough to fall for such a joke? No one. But his satire was effective enough to get him banned from the pre-Elon Musk era Twitter. And the feds thought—or said they thought—that it was part of a “plot to disenfranchise black and women voters.” I guess that shows you what they think of black and women voters. It sounds stupid. It is stupid. But Mackey was charged with a felony and on Friday was convicted in the Eastern District of New York. He faces up to 10 years in jail for (as an official announcement crows) “his scheme to deprive individuals of their constitutional right to vote.” Yes, that’s right. A Trump supporter posts a silly (but amusing) meme that mocks Hillary voters and he is tried and convicted of a felony. In the course of that official announcement, an assistant U.S. attorney for the Eastern District called Breon Peace continues with this stomach churning bit of agitprop: Mackey has been found guilty by a jury of his peers of attempting to deprive individuals from exercising their sacred right to vote for the candidate of their choice in the 2016 Presidential Election. . . . Today’s verdict proves that the defendant’s fraudulent actions crossed a line into criminality and flatly rejects his cynical attempt to use the constitutional right of free speech as a shield for his scheme to subvert the ballot box and suppress the vote. In fact, that verdict proved nothing of the sort. It merely confirmed the corruption and politicization of our judicial system. The real moral of this sorry episode is this: Make a joke, go to jail.\n\n“..even the misdemeanor allegation involving false entries is unprecedented and represents selective prosecution..”\n\nIt is possible of course that an investigation is underway, but it seems more likely that Mr. Bragg is too busy making up a crime against the man he promised in his campaign to get than investigating a real crime that took place on his watch. In my new book, “Get Trump,” I predicted that partisan prosecutors would try to get Trump regardless of the lack of evidence or law. That prediction has come true. Since the indictment itself has not been leaked — at least not yet — we don’t know its specifics. We do know, based on leaks, that it involves multiple counts, almost certainly involving the payment of hush money to a porn actress. Under Mr. Bragg’s likely theory, Mr. Trump should have disclosed in his public corporate records that he paid the hush money to avoid his adulterous affair from becoming public. But no one in history has ever publicly disclosed the reason he paid money for a non-disclosure agreement. Why would Mr. Trump pay the money in the first place if he had to publicly disclose the embarrassing reason? Furthermore, no one in history has ever been indicted for listing “legal expenses” for setting a potentially embarrassing payment of hush money. Thus, even the misdemeanor allegation involving false entries is unprecedented and represents selective prosecution. It is also almost certainly barred by the two-year statute of limitations. In order to elevate this bookkeeping case into a felony, Mr. Bragg must also prove beyond a reasonable doubt that the reason Trump made the false entry — if he himself did it — was solely as a campaign contribution to help him win his election. If Mr. Trump was motivated in part by his desire to protect his wife, children, and business interests from harmful disclosures, that would not constitute the crime of making an undisclosed campaign contribution. So this too is a stretch. It is a fundamental tenet of American law that criminal law should not be stretched to fit targeted defendants. Criminal statutes must be clear and unambiguous. If there is any doubt, the age-old concept of “lenity” requires that these doubts be resolved in favor of the defendant.\n\n“..having concluded some of the most insanely stupid pharmaceutical contracts in the world.”\n• Germany To Have Enough Covid mRNA Vaccine To Last Into The 24th Century (Eugyp)\n\nAnother paper does the maths, and notes that if vaccination continues at the current rate of 2,000 jabs per day, the 227 million doses which Germany has procured will last for 311 years. Of course, all of these doses will expire well before then, so Germany will merely receive all of this useless product, store it at substantial expense in freezers for around eighteen months, and then throw it away. This hurts Corona. In related news, Welt reports on the curious failure of Lauterbach’s Health Ministry to finish work on the so-called National Reserve for Health Protection, which Merkel’s government planned three years ago. The Reserve was supposed to be a massive depot for masks (but of course), other personal protective equipment and medicines, which would in theory free Germany from reliance on China the next time somebody is stupid enough to cry wolf about a respiratory virus. \n\n So far, the only thing anybody has done to realise this Reserve, is put 245 million masks in it, a substantial portion of which will expire by the end of the year. A Ministry spokesperson explains that the project has devolved from a Health Reserve into a National Trashbin for Worthless Masks that Nobody Wants, because it has received no funding. It appears politicians have lost enthusiasm and now prefer that the manufacturers and the federal states maintain their own “decentralised” reserves. This obviously means that they have quietly written off the project but hope that nobody will realise. Despite all that you hear from WEF conference attendees and virus pests like Lauterbach about the importance of “pandemic preparedness”, the will to actually do anything about pandemics – even at the highest reaches of government – has never been lower. Perhaps we’re not the only ones who have concluded, after all that happened since March 2020, that it is indeed best to think less about viruses.\n\nShould be enough to throw out the case.\n\nThe CIA used private Spanish security company UC Global to secretly install microphones inside the Ecuadorian Embassy in London to monitor WikiLeaks co-founder Julian Assange, El Pais reported on Wednesday, citing the company’s internal communications. UC Global was hired to provide security for the embassy. Assange, who was granted asylum by Ecuador at the time, resided in the diplomatic compound from 2012 to 2019. The Spanish company’s alleged links to US intelligence agencies were first reported by El Pais in 2019. According to the newspaper, UC Global founder and head David Morales first came into contact with the CIA in 2017. Around that time, Morales informed his employees that the company would have to provide a new American client named ‘X’ with remote access to the server that collected the data from the Ecuadorian Embassy in London, which was referred to as the ‘Hotel’. “Regarding the Hotel work, I would like to offer our information collection and analysis capability to the American client,” Morales wrote in a September 2017 email. “We must… try to make it attractive and easy to interpret.” The information shared reportedly included profiles of Assange’s visitors, including lawyers and diplomats, as well as cell phone data. Morales was quoted as saying in a chat message that “the people in control are our friends in the USA.” One of microphones that Morales’ team secretly planted inside the embassy was hidden in the base of a fire extinguisher in order to listen in despite Assange’s habit of using a white noise machine to prevent surveillance, El Pais said. Stickers were attached to window corners to avoid vibrations and allow sound to be recorded through laser microphones. “I know it is of the utmost interest and that the USA wants to do it,”Morales reportedly wrote to his employees. According to El Pais, UC Global’s work helped Washington foil a plan to sneak Assange out of the embassy in December 2017. Lenin Moreno, Ecuador’s president at the time, allegedly wanted to grant the WikiLeaks co-founder Ecuadorian citizenship and get him out of Britain in a diplomatic car. Morales’ team reportedly recorded a conversation between Assange and Ecuadorian officials and then quickly sent it to the US. Washington responded by issuing an arrest warrant for Assange to Britain, which apparently prompted organizers to abort the plan. In 2019, the Spanish authorities launched an investigation into Morales’ company and briefly detained him. He has since been released on bail.\n\nWell, it’s something. Bit late perhaps?\n\nRep. Rashida Tlaib, D-Mich., is asking her fellow House members to sign a letter calling on the Justice Department to end its prosecution of Wikileaks founder Julian Assange, who is accused of publishing classified documents. The letter, which was obtained by The Intercept, is currently circulating among members as they are urged to sign it and has not yet been sent to Attorney General Merrick Garland. Democratic Reps. Jamaal Bowman, N.Y., Ilhan Omar, Minn., and Cori Bush, Mo., have signed the letter. The office of Rep. Alexandria Ocasio-Cortez, D-N.Y., said she intends to sign the letter. “I know many of us have very strong feelings about Mr. Assange, but what we think of him and his actions is really besides the point here,” Tlaib’s letter to her colleagues reads. “The fact of the matter is that the [way] in which Mr. Assange is being prosecuted under the notoriously undemocratic Espionage Act seriously undermines freedom of the press and the First Amendment.” The letter comes just ahead of the fourth anniversary of Assange’s April 11, 2019, detention. Assange is facing a legal battle over his potential extradition to the U.S. regarding the publication of classified materials detailing war crimes committed by the U.S. government in the Guantánamo Bay, Cuba, detention camp, Iraq and Afghanistan. The materials also expose instances of the CIA engaging in torture and rendition. If he is extradited to the U.S., Assange would face 17 charges for receiving, possessing and communicating classified information to the public under the espionage act and one charge alleging a conspiracy to commit computer intrusion. He could be sentenced to as many as 175 years in an American maximum security prison. The Wikileaks founder has been held at London’s high-security Belmarsh Prison since he was removed from the Ecuadorian Embassy in 2019 for breaching jail conditions. He had sought asylum at the embassy in London to avoid extradition to Sweden over allegations he raped two women. The investigations into the sexual assault allegations were eventually dropped. Tlaib’s cites last year’s open letter from the editors and publishers of U.S. and European news outlets that worked with Assange on the publication of excerpts from more than 250,000 documents he obtained in the Cablegate leak. “The New York Times, The Guardian, El Pais, Le Monde, and Der Spiegel have taken the extraordinary step of publishing a joint statement in opposition to the indictment, warning that it ‘sets a dangerous precedent, and threatens to undermine America’s First Amendment and the freedom of the press,’” Tlaib wrote to House members. The congresswoman also warned that major news outlets could later be prosecuted for publishing accurate information using classified materials if the case against Assange is successful. “Mr. Assange’s prosecution marks the first time in US history that the Espionage Act has been used to indict a publisher of truthful information,” she wrote. “The prosecution of Mr. Assange, if successful, not only sets a legal precedent whereby journalists or publishers can be prosecuted, but a political one as well. In the future, the New York Times or Washington Post could be prosecuted when they publish important stories based on classified information. Or, just as dangerous, they may refrain from publishing such stories for fear of prosecution.”\n\nSupport the Automatic Earth in virustime with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "vaccine Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/vaccine/", "site_name": "The Automatic Earth"}, "tags": ["coup", "Bragg", "fictitious", "Fed", "suicides", "Donbass", "WTC", "Kamala", "FDA", "mandate", "COVID", "Malone", "booster shots", "Sievierodonetsk", "OPEC", "Erdogan", "JFK", "Pfizer", "lockdown", "lies", "Kory", "Zelensky", "CDC", "Sevastopol", "9/11", "constitution", "vaccinated", "masks", "Trump", "Biden", "Iceland", "vaccine", "Milley", "CIA", "incubator", "Delta", "Orthodox", "virus", "VanDen Bossche", "Gamma", "catastrophic", "loss", "stupid", "NHS", "mandates", "Fauci", "severe", "Israel", "NATO", "CureVac", "contamination", "Assange", "antibodies", "India", "boosters", "Putin", "fanatics", "evil force", "Silverstein", "Covid passport", "Raytheon", "narrative", "inflation", "Bakhmut", "NIH", "Novavax", "hospitalizations", "Craig Murray", "Wuhan", "Fleming", "unvaccinated", "Tolstoy", "mRNA", "booster"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Matt Taibbi discusses disturbing new findings in the Twitter files.</p>\n<p>Aspen Institute discussions in 2021 revealed their Orwellian plan to rollout legislation in the EU/US designed to ensure complete control and immediate surveillance over media content monitored by AI.… <a href=\"https://t.co/fmDzyPidfz\">pic.twitter.com/fmDzyPidfz</a></p>\n<p>— Kat A 🌸 (@SaiKate108) <a href=\"https://twitter.com/SaiKate108/status/1642384601418199040?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">BREAKING: President Trump has recorded a video for his supporters like YOU, responding to the indictment. Not even the fake news has seen this.</p>\n<p>Please make a contribution to SAVE OUR COUNTRY – for 1,500% impact:<a href=\"https://t.co/nOTPwmH2KZ\">https://t.co/nOTPwmH2KZ</a> <a href=\"https://t.co/GqgejsCEhB\">pic.twitter.com/GqgejsCEhB</a></p>\n<p>— Team Trump (Text TRUMP to 88022) (@TeamTrump) <a href=\"https://twitter.com/TeamTrump/status/1642640555736969216?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"Not only is Donald Trump doing really well with the rank-and-file primary voters, he has more room to grow.\" 👀</p>\n<p>Pollster Jim McLaughlin breaks down new numbers showing President Trump leading the GOP field by 30(!) points and beating Joe Biden. <a href=\"https://t.co/fwAlb7d5H6\">pic.twitter.com/fwAlb7d5H6</a></p>\n<p>— Trump War Room (@TrumpWarRoom) <a href=\"https://twitter.com/TrumpWarRoom/status/1642615856625594369?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Ukrainian history 101 according to school text books. In a nutshell:</p>\n<p>– the state of Ukraine is 7500 yo<br/>\n– French, Spanish, Portuguese and even Jews are descendants of ancient Ukrs<br/>\n– progenitor of Scythians was Hercules, a native of Crimea who’s roots go back to a Dnepr island<br/>\n-… <a href=\"https://t.co/jUBBs3rFzW\">pic.twitter.com/jUBBs3rFzW</a></p>\n<p>— Donbass Devushka (@PeImeniPusha) <a href=\"https://twitter.com/PeImeniPusha/status/1642472855974686720?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">❗️\"Legally we took Bakhmut\" – Evgeny Prigozhin confirmed that PMC \"Wagner\" occupied the administrative buildings of Artemovsk</p>\n<p>The head of the Wagner PMC confirmed that the orchestra had occupied the administrative buildings of Bakhmut. The Russian flag and the banner of Wagner… <a href=\"https://t.co/8RRwZh6luC\">pic.twitter.com/8RRwZh6luC</a></p>\n<p>— Donbass Devushka (@PeImeniPusha) <a href=\"https://twitter.com/PeImeniPusha/status/1642643672989564928?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"qme\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24PFE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$PFE</a><br/> <a href=\"https://t.co/FKzgyN1539\">pic.twitter.com/FKzgyN1539</a></p>\n<p>— The_Real_Fly (@The_Real_Fly) <a href=\"https://twitter.com/The_Real_Fly/status/1642538992473194499?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">BREAKING:</p>\n<p>New Pfizer BOMBSHELL lawsuit could change everything in South Africa &amp; then all over the world 💥💥💥</p>\n<p>International story now hits the United States 🔥</p>\n<p>Applicant : FASA <a href=\"https://twitter.com/OurFASA?ref_src=twsrc%5Etfw\">@ourFASA</a></p>\n<p>Attorney: Daniel Eloff <a href=\"https://twitter.com/DJEloff?ref_src=twsrc%5Etfw\">@DJEloff</a> </p>\n<p>Counsel : Erin-Dianne Richards <a href=\"https://twitter.com/erindr88?ref_src=twsrc%5Etfw\">@erindr88</a> </p>\n<p>Thanks… <a href=\"https://t.co/2b1PQ95ziL\">pic.twitter.com/2b1PQ95ziL</a></p>\n<p>— Dr Aseem Malhotra (@DrAseemMalhotra) <a href=\"https://twitter.com/DrAseemMalhotra/status/1642046182305177600?ref_src=twsrc%5Etfw\">April 1, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Synanceia is a genus of fish of the family Synanceiidae, the stonefishes, whose members are venomous, dangerous, and even fatal to humans </p>\n<p>[read more: <a href=\"https://t.co/LiBOZRBEF2\">https://t.co/LiBOZRBEF2</a>]<a href=\"https://t.co/mi9gnTgaQT\">pic.twitter.com/mi9gnTgaQT</a></p>\n<p>— Massimo (@Rainmaker1973) <a href=\"https://twitter.com/Rainmaker1973/status/1642487514081402881?ref_src=twsrc%5Etfw\">April 2, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.artyfactory.com/art_appreciation/animals_in_art/pablo_picasso.htm", "https://www.zerohedge.com/military/wagner-raises-russian-flag-center-bakhmut-fighting-rages", "https://www.rt.com/russia/574024-ukraine-orthodox-church-zelensky/", "https://goldswitzerland.com/the-everything-collapse/?_thumbnail_id=63027", "https://www.azerbaycan24.com/en/oil-prices-surge-after-surprise-opec-move/", "https://tass.com/russia/1598197", "https://www.defenseone.com/threats/2023/03/lower-rhetoric-china-says-milley/384693/", "https://www.azerbaycan24.com/en/eastern-europe-drowning-in-ukrainian-grain-le-figaro/", "https://www.azerbaycan24.com/en/russian-official-ridicules-ukrainian-plan-to-rename-crimean-port/", "https://www.azerbaycan24.com/en/erdogan-tells-us-ambassador-to-know-his-place/", "https://www.rt.com/news/573990-us-immigrants-gender-documents/", "https://amgreatness.com/2023/04/01/banana-time-for-the-rule-of-law/", "https://www.zerohedge.com/political/leaks-braggs-grand-jury-are-crime", "https://www.eugyppius.com/p/germany-having-concluded-some-of", "https://www.rt.com/news/574018-cia-spies-assange-firm/", "https://www.foxnews.com/politics/rep-rashida-tlaib-urges-fellow-house-members-demand-doj-drop-charges-against-julian-assange", "https://t.co/fmDzyPidfz", "https://twitter.com/SaiKate108/status/1642384601418199040?ref_src=twsrc%5Etfw", "https://t.co/nOTPwmH2KZ", "https://t.co/GqgejsCEhB", "https://twitter.com/TeamTrump/status/1642640555736969216?ref_src=twsrc%5Etfw", "https://t.co/fwAlb7d5H6", "https://twitter.com/TrumpWarRoom/status/1642615856625594369?ref_src=twsrc%5Etfw", "https://t.co/jUBBs3rFzW", "https://twitter.com/PeImeniPusha/status/1642472855974686720?ref_src=twsrc%5Etfw", "https://www.zerohedge.com/military/wagner-raises-russian-flag-center-bakhmut-fighting-rages", "https://t.co/8RRwZh6luC", "https://twitter.com/PeImeniPusha/status/1642643672989564928?ref_src=twsrc%5Etfw", "https://www.zerohedge.com/military/wagner-raises-russian-flag-center-bakhmut-fighting-rages", "https://www.rt.com/russia/574024-ukraine-orthodox-church-zelensky/", "https://www.rt.com/russia/574024-ukraine-orthodox-church-zelensky/", "https://goldswitzerland.com/the-everything-collapse/?_thumbnail_id=63027", "https://goldswitzerland.com/the-everything-collapse/?_thumbnail_id=63027", "https://www.azerbaycan24.com/en/oil-prices-surge-after-surprise-opec-move/", "https://www.azerbaycan24.com/en/oil-prices-surge-after-surprise-opec-move/", "https://tass.com/russia/1598197", "https://tass.com/russia/1598197", "https://www.defenseone.com/threats/2023/03/lower-rhetoric-china-says-milley/384693/", "https://www.defenseone.com/threats/2023/03/lower-rhetoric-china-says-milley/384693/", "https://www.azerbaycan24.com/en/eastern-europe-drowning-in-ukrainian-grain-le-figaro/", "https://www.azerbaycan24.com/en/eastern-europe-drowning-in-ukrainian-grain-le-figaro/", "https://www.azerbaycan24.com/en/russian-official-ridicules-ukrainian-plan-to-rename-crimean-port/", "https://www.azerbaycan24.com/en/russian-official-ridicules-ukrainian-plan-to-rename-crimean-port/", "https://www.azerbaycan24.com/en/erdogan-tells-us-ambassador-to-know-his-place/", "https://www.azerbaycan24.com/en/erdogan-tells-us-ambassador-to-know-his-place/", "https://www.rt.com/news/573990-us-immigrants-gender-documents/", "https://www.rt.com/news/573990-us-immigrants-gender-documents/", "https://amgreatness.com/2023/04/01/banana-time-for-the-rule-of-law/", "https://amgreatness.com/2023/04/01/banana-time-for-the-rule-of-law/", "https://www.zerohedge.com/political/leaks-braggs-grand-jury-are-crime", "https://www.zerohedge.com/political/leaks-braggs-grand-jury-are-crime", "https://www.eugyppius.com/p/germany-having-concluded-some-of", "https://twitter.com/search?q=%24PFE&src=ctag&ref_src=twsrc%5Etfw", "https://t.co/FKzgyN1539", "https://twitter.com/The_Real_Fly/status/1642538992473194499?ref_src=twsrc%5Etfw", "https://twitter.com/OurFASA?ref_src=twsrc%5Etfw", "https://twitter.com/DJEloff?ref_src=twsrc%5Etfw", "https://twitter.com/erindr88?ref_src=twsrc%5Etfw", "https://t.co/2b1PQ95ziL", "https://twitter.com/DrAseemMalhotra/status/1642046182305177600?ref_src=twsrc%5Etfw", "https://www.eugyppius.com/p/germany-having-concluded-some-of", "https://www.rt.com/news/574018-cia-spies-assange-firm/", "https://www.rt.com/news/574018-cia-spies-assange-firm/", "https://www.foxnews.com/politics/rep-rashida-tlaib-urges-fellow-house-members-demand-doj-drop-charges-against-julian-assange", "https://www.foxnews.com/politics/rep-rashida-tlaib-urges-fellow-house-members-demand-doj-drop-charges-against-julian-assange", "https://t.co/LiBOZRBEF2", "https://t.co/mi9gnTgaQT", "https://twitter.com/Rainmaker1973/status/1642487514081402881?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}