{"result_id": "285038", "URL": "https://www.theautomaticearth.com/2021/07/rage-against-the-vaccine/", "timestamp": "2023-04-25 17:16:41 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/07/rage-against-the-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Rage Against the Vaccine", "cleaned_text": "I have the feeling that the story about Covid and the vaccines is about to change dramatically, but that it will take some time for us to realize it, because so much on the topic is not reported. The change will have to be undeniable before it is acknowledged.\n\nThat is, we will be moving from “the vaccines will save you” to “the vaccines may kill you”. And I don’t mean through unintentional and unfortunate adverse effects, though those are bad enough, and much more common than we are “allowed” to know. I mean that the spike proteins the vaccines force your cells to make, kill more people than the virus they purportedly protect against.\n\nMaybe I’m a bit early, not just because this would go against the overwhelming narrative grain, but also because the process itself that will lead to this, is not yet advanced enough. But perhaps that would merely mean an early warning.\n\nI’m not a fan of what is called “the vaccines” as we presently know them. They have been too poorly researched and too poorly tested, and therefore too risky to inoculate 100s of millions of people with. Which is why they were never approved, at least that part of the process had not been politicized yet.\n\nWell, not fully. They did get emergency authorizations, for which other substances, that could have saved countless lives, needed to be banned and ostracized. But in the end it all comes down to what the “vaccines” accomplish over the medium- to long term, and that is exactly the part that was never tested.\n\nHave the “vaccines” saved (m)any lives to date? It’s hard to say, they were rolled out when spring came in the northern hemisphere, a time when a year before infections plummeted. That they are skyrocketing now, in the middle of summer, may thus be a very bad sign. We won’t know until summer’s over. But there are a few things we can point to.\n\nAs an aside, the Greek PM and President have both claimed that their constitution requires people to get vaccinated. Why haven’t we heard that from other countries yet? Sacrificing your Constitution on the altar of a virus is quite the step, sacrificing your children on that same altar (see in many countries) is possible worse. Issuing an emergency authorization to inoculate children, who run a much higher risk from the vaccine than from the virus, let’s just hope that’s the worst thing that we see come out of this. The kids are at risk for the rest of their lives, it doesn’t get much worse.\n\nTalking of presidents, Joe Biden is on record telling Americans “you can’t get covid if you have a vaccine.’ (but still wear a mask, Joe?) As the infections among fully vaccinated people keep piling up. We call that a lie. Biden also said the Delta variant is both more transmissible AND more deadly. That, too, is a lie. Is it any wonder that people are vaccine hesitant when their president lies about it to them?\n\nLet’s go to case exhibit one: India. Where officially 3% of people have been vaccinated, but the Delta variant has been conquered.\n\nData From India Continues To Blow Up The ‘Delta’ Fear Narrative\n\nThe prevailing narrative from Fauci, Walensky, and company is that Delta is more serious than anything before, and even though vaccines are even less effective against it, its spread proves the need to vaccinate even more people. Unless we do that, we must return to the very effective lockdowns and masks. In reality, India’s experience proves the opposite true; namely:\n• Delta is largely an attenuated version, with a much lower fatality rate, that for most people is akin to a cold.\n• Masks failed to stop the spread there.\n• The country has come close to the herd immunity threshold with just 3% vaccinated.\n• Most people are now getting cold-like symptoms from Delta, but to the extent countries hit by Delta suffered some deaths and serious illness, they could have been avoided not with vaccines and masks, but with early and preventive treatment like ivermectin. In other words, our government is learning all the wrong lessons from India, and now Israel and the U.K. Let’s unpack what we know occurred in India and now in some of the other countries experiencing a surge in cases of the Indian “Delta” variant. The Indian Council of Medical Research (ICMR) recently conducted a fourth nationwide serological test and found that 67.6% of those over 6 years old in June and July had antibodies, including 85% of health care workers. This is a sharp increase from the 24.1% level detected during the December-January study. What we can conclude definitively is that strict mask-wearing (especially among health care workers) failed to stop the spread one bit. Yet now they have achieved herd immunity and burned out the virus with just 3% vaccination (now up to 6%) with roughly one-sixth the death rate of the U.S. and the U.K. and less than one-half that of Israel.\n\nHere are the graphs. Remember, Delta is supposed to have come from India. Perhaps that explains the spike in May, but it burned out pretty quickly. Without vaccines, or almost. What is the lesson we can draw from that? Well, certainly not that it will kill us all unless we get vaccinated.\n\nCase exhibit number two: Israel. Lots of vaccinations, but also many infections. A 30x rise in infections over the past month while vaccinations were at full speed.\n\nOver the past month, Israel, the world’s most heavily vaccinated country (with leading mRNA jabs, no less) has seen the number of positive COVID tests has risen by more than 30x as the number of active infections in the country has surpassed 10K. Meanwhile, the Israeli Health Ministry, which has previously estimated the true efficacy of the Pfizer jab against the delta variant at only 64% (while still more than 90% effective at preventing serious illness and death), just released new data purporting to show that while the Pfizer jab is still 88% effective at preventing serious illness, it’s only 39% effective at preventing infection with delta. Alex Berenson, a former NYT journalist who has often reported on scientific findings that don’t support the official narrative on masks and vaccines, shared the findings in a tweet, and speculated that the true efficacy in offering protection against the Delta variant might be even lower – perhaps as low as 30%. [..] The Israeli numbers are much lower than other recent studies, including one study recently published in the New England Journal of Medicine, which found that two doses offers 88% protection against the Delta variant causing symptomatic disease, while offering 94% protection against the alpha variant.\n\nPeople say: of course more vaccinated people will show up infected, there are only vaccinated people left. But first, look at the right hand (blue) column for vaccine efficacy. 3-4%, that’s all. And then look at the numbers of infection of vaccinated vs unvaccinated, knowing that perhaps 65% have been fully vaccinated (and 35% not).\n\nIf new infections were divided between the two groups along the same ratio (2:1), we should see that. Instead, we see a 6:1 ratio, 1426 vs 251. 6 times more vaccinated people get infected. What do we make of that? I know what I make of it; as I said above: “the vaccines may kill you”.\n\nBut at least those fully vaccinated will get less sick, you say. Well, this Israeli source casts doubts on that ubiquitous claim:\n\nAlex Berenson has some numbers on the same topic:\n\nAnd ask yourself: does it make sense that a vaccine is now 30% effective vs infection but still retains the same 80-90% effectiveness against severe disease? I liked this from @ScottAdamsSays: “If a vaccination doesn’t stop you from getting a disease, but it does reduce the symptoms, wouldn’t that be called a therapeutic?” Yes, but what do you call it if it doesn’t do that either? Where is the evidence, other than in big words? Remember how Remdesivir was marketed in much the same way, and billions spent on it, only to find it was an absolute bust.\n\nBut Remdesivir is not the same as the spike protein inducing vaccines. Compared to them, it’s just a small snake oil operation. The fates of entire governments and nations (constitutions even!) have been been tied to mRNA by now, so if it doesn’t perform as promised, they have nowhere else to turn. A dangerous position to be in.\n\nWhich is why, as we see the first signs of this appearing, there will be no discussion until it can no longer be plausibly denied. And that, given the grip the campaign has over media everywhere, can take a very long time. In the meantime, there will be booster shots, allegedly because of variants, but they will only make things worse. They will boost the presence of spike proteins in bodies whose natural immune systems are already overwhelmed.. by spike proteins.\n\nI said recently that I think the reaction to the vaccines not working will be more lockdowns and masks and vaccination pressure, in order to prevent people from finding out that the vaccines don’t work. There’ll be much talk of Delta -and Gamma- spreading like crazy and leaving us no choice, but in the end that won’t make the vaccines work.\n\nWe’ve been told that they are the only hope we have, and when that hope is gone, what are they going to say? Boosters and lockdowns, that’s what. And heaps of blame on all the unvaccinated, even if they are no more contagious or threatening -or threatened- than anyone else.\n\nWe must all hope that the course of Delta where we live will be like that in India: a 90+% decrease in infections in two months. Our problem is, the vaccines may have already made that course impossible.\n\nThis graph from Iceland is a good way to close. As vaccinations rise, so do infections. “But it would have been so much worse without the vaccines”, say the experts. You can’t prove that, though, can you? Now, I can’t -yet- prove that it’s the vaccines that led to the positive tests, but we’re working on that. It just takes a bit longer if the information is banned and hidden from view and the media ia AWOL.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rage Against the Vaccine - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/07/rage-against-the-vaccine/", "site_name": "The Automatic Earth", "article:published_time": "2021-07-24T16:44:29+00:00", "article:modified_time": "2021-07-24T16:44:34+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/07/VanGoghWillowsSettingSun1888.jpg"}, "tags": ["constitution", "India", "Biden", "Iceland", "vaccine", "severe", "Israel", "Delta", "unvaccinated", "Gamma", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.wikiart.org/en/vincent-van-gogh/pollard-willows-and-setting-sun-1888", "https://www.theblaze.com/op-ed/horowitz-data-from-india-continues-to-blow-up-the-delta-fear-narrative", "https://www.zerohedge.com/covid-19/israel-finds-pfizer-jab-only-39-effective-stopping-delta-variant", "https://www.ynetnews.com/health_science/article/bytq34n0u", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-07-24T16:44:29+00:00"}