{"result_id": "285003", "URL": "https://www.theautomaticearth.com/tag/natural-immunity/", "timestamp": "2023-04-25 17:16:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/tag/natural-immunity/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "natural immunity Archives", "cleaned_text": "Merck’s news today is great since patients will have early Rx but also sad given the high cost and lives lost compared to IVM.\n\nJanuary 2021. “..molnupiravir could be metabolised into a precursor of DNA ..”\n\nRidgeback Biotherapeutics/Merck’s Phase IIa molnupiravir is attractive for outpatient and recently hospitalised Covid-19 patients due to its mechanism and oral administration, experts said. However, many trial success blind spots persist, limiting efficacy judgment, they added. Encouraging preclinical data is yet to translate into humans, and there is potential for lingering severe side effects due to molnupiravir’s mutagenic mechanism, experts noted. While targeting Covid-19 patients in the earlier part of the disease spectrum is logical, the trial designs may blur molnupiravir’s clinical value, they said. In July 2020, Miami, Florida-based Ridgeback and Merck announced they had partnered to advance molnupiravir in Covid-19. [..]Comparing molnupiravir and Veklury may be inappropriate as they are intended for different patients, Brown added. Veklury is FDA approved in hospitalised patients, although it has a wider emergency use authorisation. Even if molnupiravir is only as potent as Veklury, its oral formulation will boost its clinical value, as it could be used by more people, Shafer said. As much as 80% of all Covid-19 cases are either asymptomatic or mild, with only 20% of patients sick enough to be hospitalised, added Dr Yvonne Maldonado, professor, infectious diseases in pediatrics and health research and policy, Stanford University, California, and a Phase II Avigan trial investigator in asymptomatic or mild Covid-19 patients. Another oral Covid-19 therapy under investigation is Fujifilm Toyama Chemical’s Avigan (favirpiravir), which is also an oral mutagen, Shafer said, but added Avigan’s preclinical and clinical data in Covid-19 are underwhelming so far. Due to limited data with highly active viral mutagens like molnupiravir, there is concern its mechanism would negatively impact the host, leading to side effects, Swanstrom said. When considering widespread deployment, toxicity is a major issue, said Dr Saye Khoo, professor, pharmacology and therapeutics, University of Liverpool, UK. How it is utilised will depend on its overall toxicity data, added Khoo, who is studying molnupiravir in a Phase I/II basket trial investigating various Covid-19 treatments. Side effect concerns have been raised about whether molnupiravir could be metabolised into a precursor of DNA, Swanstrom said, explaining it could enter the host cell nucleus, leading to oncogenesis. Mitochondrial toxicity with such a mechanism has been raised in previous investigations in hepatitis B and HIV, added an investigator in a Covid-19 trial recruiting outpatients and recently hospitalised patients. In the 20-day Phase I molnupiravir trial recruiting healthy volunteers, 93.3% of adverse events were mild, with one patient discontinuing due to rash (Painter, W., et al., Medrxiv. 14 December. https://doi.org/10.1101/2020.12.10.20235747). Molnupiravir is only used in the short term, twice-daily for five days, as opposed to chronic use, Shafer added. Polymerase inhibitor side effects have improved over the years, and while mutagen side effects were a concern in early development in HIV, they have eased in available hepatitis treatments, Brown added. However, due to the need for longer-term safety data, molnupiravir may be limited to patients at high risk of developing severe disease, Swanstrom said.\n\n“..the British Office for National Statistics inadvertently revealed that 30,305 people have died within 21 days of having the injection, during the first 6 months of 2021.”\n\nIn The Netherlands, one of the smallest nations in the European Union, an extraparliamentary research commitee set up a platform for citizens to report vaccine adverse events. This is no initiative from the government and has received no attention whatsoever in the media. The vast majority of the Dutch population is therefore unaware of its existence. Yet, dispite its narrow scope of influence, this private initiative has already received reports of 1,600 deaths and 1,200 health damages, often permanently disabling the people. 3 What if the entire vaccinated population knew about this platform and filed a report? And what if this was also available in the other E.U. countries, that are much larger than The Netherlands? UK: Shortly before the national vaccination campaign started, the MHRA (Medicines and Healthcare Products Regulatory Agency) published the following request: ‘The MHRA urgently seeks an Artificial Intelligence (AI) software tool to process the expected high volume of Covid-19 vaccine Adverse Drug Reaction (ADRs) and ensure that no details from the ADRs’ reaction text are missed.’ The British government published a report of the first series of adverse events, including blindness, strokes, miscarriages, heart failure, paralysis, auto immune disease, and more. Shortly after the first wave of immunization over 100,000 adverse events were reported, including 1260 cases of loss of eyesight (including total blindness). The first part of the report praises the vaccines to be the best way to protect people from COVID-19, and then continues to show the incredible destruction these vaccines are causing. The hypocrisy is mindboggling. Also in the United Kingdom the number of miscarriages increased by 366% in only six weeks, for vaccinated mothers. Furthermore the British Office for National Statistics inadvertently revealed that 30,305 people have died within 21 days of having the injection, during the first 6 months of 2021. And a British scientist with 35 years of experience did an in depth analysis of the British Yellow Card reporting system and found it to be unreliable. ‘We can conclude that the Yellow Card reporting scheme can provide some limited information that may be useful for alerting the UK public to possible adverse effects of the COVID-19 vaccines. However, the initial conception of the scheme as a purely descriptive rather than as an experimental undertaking means that it cannot address the real issues that are of crucial importance to the UK public. These issues are whether there are causal relationships between vaccination with the PF and AZ vaccines and serious adverse effects such as death, and if so, what are the size of these effects.’\n\n3 more months of PCR in the US. And what then?\n\nNot one lab has ever returned Ct numbers to the tested person. Not even in Florida, where DeSantis issued an Executive Order requiring it. Was there ever any enforcement of that? No. Why did we know this was entirely bogus? Simple: On the CDC’s own math the fall surge — which turned into the Winter Disaster — was epidemiologically impossible. Specifically, look at their mean ratio of infections to case counts and you see the problem; at 6x enough people had the virus for there be no surge. But there was. By the summer this was even more beclowned as on that same data everyone had been infected. But…. there was a surge. Do remember the admitted truth on PCR: A Ct test of 35 or more almost never results in culturable virus. \n\n It breaks down something like this:\n\n Ct<20 = Nearly always you can culture virus.\n\n Ct25 = 50 – 70% of the time you can culture virus.\n\n Ct30 = ~25-30% of the time you can culture virus.\n\n Ct35 = ~4-8% of the time you can culture virus.\n\n Ct40 = Statistically never can you culture virus. Why is this important? Many people have claimed that viral debris from your infection still means you had it, thus, positive is positive. Nope. This is the worst sort of fraud. At very high Ct numbers the debris could be from contamination at the lab, or between samples. But it could also be from your prior, non-Covid-19 immunity and anyone who is even slightly competent in understanding the immune system knows it. The virus enters through the nose and mouth. The upper respiratory tract is where it first gets into cells — if it gets into cells. Your body has a bevvy of defensive mechanisms to prevent that from happening. Remember that unlike bacteria a virus cannot replicate outside of a living cell. The mucosa in your mouth and nose is not alive. The cells under it are, but it is not. So if a virus lands in your nose but never gets through the mucosa it will register positive on a PCR test — because it is positive — if the Ct is cranked up high enough. Technically you “got” the virus (you “caught” it) but you were never infected. It is certainly true that some of the people who are “positive” with high Ct numbers are infected and you got them “early”; they will go on to have clinical disease and, if you test them again you will get another positive in a day or two with a much lower Ct. But nobody does that. In addition exactly zero health departments have validated their claimed “infected” counts by coming back to those people with a $5 antibody test two weeks later and looking for IgA, IgM and/or IgG antibodies. IgA may be present and both IgM and likely a weak read of IgG will be present if the person was actually infected at that time. If only IgG is present that infection was not Covid-19; they previously were infected and you lied; their body beat off the incipient infection without impact.\n\n“..large numbers of health care workers getting kicked out of their jobs will only make it more difficult to care for patients..”\n\nIn upstate New York, WNYT-TV reported yesterday that 200 employees of Albany Med, a large, regional teaching hospital, are placed on seven day’s unpaid leave prior to getting fired for refusing the vaccine. Andrew Cuomo’s replacement, new Governor Kathy Hochul, has blocked unemployment benefits for fired nurses and technicians if they persist in evading the vax. Doctors are included in the mix, too. Of course, large numbers of health care workers getting kicked out of their jobs will only make it more difficult to care for patients — with Covid or any other health problem — so how does this policy help anyone? (Unless you consider that, with fewer staff on-duty, fewer Covid in-patients will be subjected to the medical malpractice of being placed on ventilators and treated with the killer drug Remdesivir.) \n\n Not only has effective early treatment with other drugs been banned from the official medical standards-of-practice across the USA, but mere talk about it has been banned, notably by Google’s YouTube app. This coercion of health care workers is going on all over the country, of course, not just in New York state. These nurses and techs have been working around Covid patients for going on two years, and many of them have gotten the disease, with symptoms or without, conferring natural immunity. So, what is the point of forcing the vaxes on them? It is also a fact that vaccinated people are susceptible to catching the disease, and that, in any case, the vaccinated carry heavier viral loads than the un-vaxed, making them more efficient spreaders. It is also a fact that mass vaccination in the midst of a pandemic promotes the mutation of new variant viruses that increasingly are not affected by the vaccines.\n\n“By instituting vaccine mandates, university hospitals are now also questioning the existence of natural immunity after Covid disease. This is astonishing.”\n• Hospitals Should Hire, Not Fire, Nurses with Natural Immunity (Kulldorff)\n\nAmong many surprising developments during this pandemic, the most stunning has been the questioning of naturally acquired immunity after a person has had the Covid disease. We have understood natural immunity since at least the Athenian Plague in 430 BC. Here is Thucydides: ‘Yet it was with those who had recovered from the disease that the sick and the dying found most compassion. These knew what it was from experience and had no fear for themselves; for the same man was never attacked twice—never at least fatally.’ – Thucydides We have lived with endemic coronaviruses for at least a hundred years, for which we have long-lasting natural immunity. As expected, we also have natural immunity after Covid-19 disease, as there have been exceedingly few reinfections with serious illness or death, despite a widely circulating virus. For most viruses, natural immunity is better than vaccine-induced immunity, and that is also true for Covid. In the best study to date, the vaccinated were around 27 times more likely to have symptomatic disease than those with natural immunity, with an estimated range between 13 and 57. With no Covid deaths in either group, both natural and vaccine immunity protect well against death. During the last decade, I have worked closely with hospital epidemiologists. While the role of physicians is to treat patients and make them well, the task of the hospital epidemiologist is to ensure that patients do not get sick while in the hospital, such as catching a deadly virus from another patient or a caretaker. For that purpose, hospitals employ a variety of measures, from frequent hand washing to full infection control regalia when caring for an Ebola patient. Vaccinations are a key component of these control efforts. For example, two weeks before spleen surgery, patients are given the pneumococcal vaccine to minimize postoperative infections, and most clinical staff are immunized against influenza every year. Infection control measures are especially critical for older frail hospital patients with a weakened immune system. They can become infected and die from a virus that most people would easily survive. A key rationale for immunizing nurses and physicians against influenza is to ensure that they do not infect such patients. How can hospitals best protect their patients from Covid disease? It is an enormously important question, also relevant for nursing homes. There are some obvious standard solutions, such as separating Covid patients from other patients, minimizing staff rotation, and providing generous sick leave for staff with Covid-like symptoms. Another goal should be to employ staff with the strongest possible immunity against Covid, as they are less likely to catch it and spread it to their patients. This means that hospitals and nursing homes should actively seek to hire staff that have natural immunity from prior Covid disease and use such staff for their most vulnerable patients. Hence, we are now seeing a fierce competition where hospitals and nursing homes are desperately trying to hire people with natural immunity. Well, actually, not. Instead, hospitals are firing nurses and other staff with superior natural immunity while retaining those with weaker vaccine-induced immunity. By doing so, they are betraying their patients, increasing their risk for hospital-acquired infections. By pushing vaccine mandates, White House chief medical advisor Dr. Anthony Fauci is questioning the existence of natural immunity after Covid disease. In doing so, he is following the lead of CDC director Rochelle Walensky, who questioned natural immunity in a 2020 Memorandum published by The Lancet. By instituting vaccine mandates, university hospitals are now also questioning the existence of natural immunity after Covid disease. This is astonishing.\n\n“Most of the time, the changes they made hurt blacks more than whites, but that’s beside the point; in liberalism, it’s the effort that counts.”\n• 72% Of Black NYC Residents Are Banned From Entering Restaurants (Fed.)\n\nDemocrats’ summer of Black Lives Matter is over. Front-line nurses’ year in the sun has passed. Gone are the COVID cries to evict no one ever for any reason at all. Disparate impact? Never heard of her. It’s 2021 now; we’ve advanced. These aren’t simple proclamations. Go and read a newspaper from September 2020, and then glance at one from this past month. The political debates are nearly unrecognizable, it’s almost impossible to believe that the same people were often making both policies. New York City is a leader in world liberalism. For years — and especially since May 2020 — its politicians have mangled their schools, their parks, their police force, and their courts, all in the name of fighting racism. Most of the time, the changes they made hurt blacks more than whites, but that’s beside the point; in liberalism, it’s the effort that counts. New York City is also a leader of the world’s COVID cult. New Gov. Kathy Hochul says that if you want to serve God, you must receive the sacrament of vaccination. Mayor Bill de Blasio has decreed that all restaurants must see proof of vaccination before service. There’s the snag: Today in New York City, roughly 72 percent of black residents aged 18-44 have not taken the novel vaccine, meaning now roughly 72 percent of black residents aged 18-44 are banned — banned — from entering dining establishments. Statewide, 53 percent of black residents aren’t vaccinated, compared to only 44 percent of white residents who have declined the shots; yet this week, the state’s governor announced she would use the powers of this unending emergency to fire and replace as many as 72,000 health workers for refusing the vaccine. In New York City, health-care workers were lauded as both heroes and COVID experts just weeks ago. Most of those workers are women, a plurality are black, and now, thousands of them might be out of jobs. The hospital system never collapsed due to COVID, but it might collapse due to Hochul’s measures to fight it. New York City is not alone in reversing course: Down south in Florida earlier this month, one apartment owner promised to evict any tenants who decline the vaccine. It’s unsafe to be near the unclean, he said. So black mother Jasmine Erby and her two children were given the boot. “There was no loophole, no working with me, no extensions and I literally had to walk away,” Irby told Fox News. “It was either get the shot or get out.”\n\n“.. the CDC doesn’t even track the breakthrough infections so how do we know that they’re only a small portion and that they’re relatively mild?”\n\nFinally, Eisen Hit Dr. Fauci with a surprise hard ball: She cited “data” collected within her own family, whereby three vaccinated people got COVID and immediately passed it on to two unvaccinated children. Eisen then suggested that the CDC might be “too casual” about breakthough infections, and also questioned “How can the CDC keep saying COVID “breakthrough” infections are rare if they have no data?” To this, Dr. Fauci replied that the CDC is scrambling to change this, and even hinted that more data on the true rate of breakthrough infections would likely soon arrive. “Three vaccinated people got Covid in my house two unvaccinated children got it…are you too casual about the limitations of the vaccine? It seems to me these breakthroughs are happening and they’re happening regularly. You can get it and transmit it and the government hasn’t been warning about that,” Eisen said. “Oh yes we have and let me get you the facts. If you are an unvaccinated person you have 11x the likelihood of hospitalization…if you look at the people who have died from COVID-19, overwhelmingly they have been unvaccinated,” Dr Fauci Fauci adds that “over 90%” who have been unvaccinated – but of course that vast majority of deaths occurred before the vaccine rollout even started, making this statement slightly misleading. As for determining how many unvaccinated have died since the program began, it’s not exactly clear since this data wasn’t being tracked. Though deaths and hospitalizations have fallen since vaccination rates have risen, but there’s still many questions about whether the young and health actually benefit. Fortunately, CNBC released this clip. \"If you look at the people who have died from COVID-19, overwhelmingly 90% of them are unvaccinated,\" says Dr. Fauci. \"If you get vaccinated and get a break through infection, you are much less likely of having a severe outcome and much more likely you would be without symptoms.\" pic.twitter.com/gEFsIjTNWj As for the CDC tracking breakthrough infections, Eisen also pressed Dr. Fauci about the fact that “the CDC says on its website that infections occur among…unvaccinated…but the CDC doesn’t even track the breakthrough infections so how do we know that they’re only a small portion and that they’re relatively mild?” Dr. Fauci had nothing really to say to this except to admit she was of course correct while offering a flimsy excuse about the CDC working on it. “Well in the past the CDC has not tracked real or asymptomatic infections, but there are studies being done that would give the kind of data you’re talking about.” “And with the booster program we’re rolling out, we hope to see an improved effect. Israeli data have shown that when you give an at risk person a booster shot, they’re chances of being hospitalizations drop.”\n\nAt least now we know where The Science does not live.\n\nHarvard Business School (HBS) in Boston, Massachusetts has just experienced a large coronavirus outbreak despite more than 90 percent of students and staff being fully vaccinated. The school, which has a population of more than 1700 students, had a significant Covid-19 outbreak after cases started rising in September. This news comes as 95 percent of students and 96 percent of staff at the school being reported as fully vaccinated, yet this did not appear to stop Covid from making its way through those on campus. Two-thirds of all cases recorded in September came from students. A statement from the HBS said that Covid-19 cases among MBA students surged by 20 per cent in just three days. Dean Srikant Datar of HBS said: “Our positivity rate is 12 times that of the rest of Harvard. These distressing figures are so high that they have attracted the scrutiny of local public health officials.” To avoid further scrutiny from the public and to preserve Harvard’s image, Datar and several of the university’s administrators have announced that teaching will be conducted online for almost all students until the end of October. This change affects almost all first-year and some second-year courses. This is one of the first instances of a major university halting in-person teaching due to Covid-19 outbreaks. The university made its decision after receiving advice from public health officials employed by the city and state. HBS also announced that it will be increasing the number of Covid tests it forces upon students to three per week. Previously, the university’s requirement was for fully vaccinated students to get tested once per week and unvaccinated students to get tested twice per week. Mark Cautela, spokesman and head of communication for HBS, said in a statement that Harvard is also requesting students to avoid participating in social gatherings with anybody outside of their households and instead socialise with friends online.\n• Newsom Makes Vaccines Mandatory For All School Children In California (PM)\n\nHeadline is a little misleading. Sotomayor, on her own, decided the Court will not take up the case. There was no vote. Pass the hot potato?\n\nYou would think with all these mandates flying around, they should rule on the legality.\n• The Looming Energy Crisis: People Are Going To Die This Winter (Blain)\n\nFor many months myself and many of the investors I work with have become increasingly concerned at the growing instability and insecurity of energy markets. The 4 times spike in Gas prices this year has been a shocking wake-up call, highlighting energy insecurity in Europe and particularly the UK. Gas prices will remain elevated for months to come. The consequences are going to be brutal – and fatal for some. Energy – whether derived from fossil fuels, nuclear or renewables – is a commodity and the critical thing about commodities is: “You can’t print commodities like you can print money. The rules are not the same,” says my good friend and head of commodities at Shard, Ashley Boolell. Commodities are volatile and dangerous. Oil has doubled in recent months. But the thing about Gold, Silver, Palladium and copper prices is; no matter how volatile they are, they are simply investment opportunities or traps, and are unlikely to kill us. Energy is different. It can kill us. That was conclusively demonstrated earlier this year in Texas. A swift series of winter storms crashed the Texan grid when gas infrastructure failed in the cold, renewables weren’t delivering, and the deregulation of its energy system had delinked Texas from both US power Grids – making it difficult to import energy. Over 200 people died as a result of power outages. Fast forward to this winter, and the UK and Europe are in the direct firing line of the coming energy storm. The security of energy supplies has never looked less certain. In the UK, neglected storage means we have the capacity to story 3-4 days of Gas. The recent collapse in sterling has been linked to the panic over Petrol supplies, escalating and cascading supply chain failures impacting industry and growing woes blamed on Brexit. I would add questions about how the UK’s status as a first world economy with zero energy security will line up. How has this happened? Why? Well… that’s a long tale… But, it will be mightily embarrassing for the Boris Johnson Government if the first UK power outages occur during the COP26 Climate Circus in Glasgow in November. COP26 has driven the Government’s agenda and ambition to be seen as more green, more carbon neutral and more ESG than anyone else. I’ve heard tales of cabinet ministers throwing sweary hissy fits when asked to support policies that don’t immediately square with green policies perceived as vote winners. As I’ve written many times – ESG is well intentioned, but perhaps the most dangerous force in Economics today. Investment managers rely on people giving them money to manage. That is why every single fund manager on the planet is fixated on polishing their green credentials, demonstrating how they are funding ESG compliant investments, and eschewing anything even vaguely linked to hydrocarbons. It is also why Saudi Arabia is polishing its credentials by improbably launching and successfully selling a Green Bond. The result is a chronic failure of common sense across the investment industry. Fund managers claim to be investing in our futures. If that is true – how do they expect the world can transition seamlessly from dirty hydrocarbons to clean renewables overnight? It takes 20 years to get planning and build a nuclear power station – while wind is proving fickle, unreliable, far less efficient and difficult to maintain.\n\n“Given the many years, spent under both Obama and Trump, trying to shore up this claim by the most digitally advanced states in the world, it comes as something of a surprise to learn that they came up with nothing.”\n• The US Found A ‘Lawful’ Way To Disappear Assange (Cook)\n\nThe Yahoo report makes clear too that the surveillance operation against Assange and Wikileaks intensified dramatically after Snowden released his confidential documents in 2013 in collaboration with reporter Glenn Greenwald. The Snowden files showed that the US had begun expanding its ambition to use new digital technology to covertly surveil the rest of the world. Now it was increasingly turning that technological prowess inwards to covertly surveil its own population. A transparency organisation like Wikileaks, it quickly became obvious, was a major threat to the US intelligence services’ plans. According to Yahoo’s sources, it was the Obama administration that began surveilling Wikileaks more intensively and threw the net wider to expose its networks. The CIA was already centrally involved, creating a special “Wikileaks team” that worked closely with other friendly spy agencies – including one can presume the Five Eyes intelligence-sharing states that also comprise Canada, the UK, Australia and New Zealand. (One official, William Evanina, who recently retired as a top US counterintelligence official, notes the key role the Five Eyes group played in Assange’s case.) The goal, Yahoo was told by Evanina, its main named source, was to “tie [Wikileaks] back to hostile state intelligence services”. In other words, the aim was to suggest not that Assange was interested in transparency or acting out of principle but that he wanted to undermine the US on behalf of a hostile foreign power. Assange’s fate was sealed within the Obama administration in summer 2016 when Wikileaks released a cache of Democratic party emails that cast Obama’s chosen successor, Hillary Clinton, in a damning light and showed that the party had rigged its election procedures to stop her main challenger, Bernie Sanders, from winning. As an aside, the Yahoo report notes that the idea of kidnapping Assange – in violation of Ecuador and the UK’s sovereignty – actually preceded Pompeo’s arrival at the CIA. Despite Yahoo’s focus on Pompeo, it was actually Obama and the Democratic party’s thirst for vengeance that paved the way for Trump’s appointee to have viable options of either prosecuting Assange for espionage or abducting him. Obama’s officials immediately tarred Assange as conspiring with Donald Trump, Clinton’s rival for the presidential election. He was thereby dragged into an establishment conspiracy theory, Russiagate, that claimed Trump was serving as a puppet of the Kremlin. Given the many years, spent under both Obama and Trump, trying to shore up this claim by the most digitally advanced states in the world, it comes as something of a surprise to learn that they came up with nothing. Evidence of Wikileaks collusion with Russia appears never to have surfaced, even though it became an implicit, driving assumption behind the Russiagate claims. One unusually honest official, Robert Litt, a former general counsel of the Office of the Director for National Intelligence, observed to Yahoo of the claims made by Pompeo that Assange was acting on behalf of the Russians: “Based on the information that I had seen, I thought he was out over his skis on that.”\n\nSupport the Automatic Earth in virustime; donate with Paypal, Bitcoin and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "natural immunity Archives - The Automatic Earth", "url": "https://www.theautomaticearth.com/tag/natural-immunity/", "site_name": "The Automatic Earth"}, "tags": ["Armenia", "DMED", "life insurer", "Australia", "LNG", "Wikileaks", "myocarditis", "China", "Daszak", "Merck", "Pompeo", "cattle", "Zelensky", "collaborators", "unvaccinated", "Comey", "VAERS", "Biden", "NewZealand", "panic buy", "Iceland", "Navy Seals", "empty shelves", "DNA", "CIA", "anticancer", "global stilling", "truckers", "NBA", "blackout", "DOJ", "Molnupiravir", "Germany", "vaccine failure", "abnormal blood", "FBI", "Joe Rogan", "Durham", "natural immunity", "Russia", "Clinton", "mandates", "exterminations", "Fauci", "Crimea", "ivermectin", "bodily autonomy", "Lebanon", "lymphoma", "NATO", "rebellion", "Southwest", "Assange", "antibodies", "Lancet", "Trudeau", "war footing", "Downing Street", "deindustrialization", "excess deaths", "Amish", "Musk", "myopericarditis", "aspirin", "SCOTUS", "CNN", "Ukraine", "Djokovic", "Psaki", "booster"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Human rights lawyer <a href=\"https://twitter.com/SDonziger?ref_src=twsrc%5Etfw\">@SDonziger</a> was sentenced to six months in prison today for contempt of court. For the first time in US history in such a case, he was prosecuted not by the US Justice Dept, but by a private attorney who worked for Chevron. <a href=\"https://twitter.com/hashtag/FreeDonziger?src=hash&amp;ref_src=twsrc%5Etfw\">#FreeDonziger</a> <a href=\"https://t.co/mm8P3jS8ZJ\">https://t.co/mm8P3jS8ZJ</a> <a href=\"https://t.co/P5TmiChBRh\">pic.twitter.com/P5TmiChBRh</a></p>\n<p>— Greg Palast (@Greg_Palast) <a href=\"https://twitter.com/Greg_Palast/status/1444026358145994754?ref_src=twsrc%5Etfw\">October 1, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"If you look at the people who have died from COVID-19, overwhelmingly 90% of them are unvaccinated,\" says Dr. Fauci. \"If you get vaccinated and get a break through infection, you are much less likely of having a severe outcome and much more likely you would be without symptoms.\" <a href=\"https://t.co/gEFsIjTNWj\">pic.twitter.com/gEFsIjTNWj</a></p>\n<p>— CNBC's Closing Bell (@CNBCClosingBell) <a href=\"https://twitter.com/CNBCClosingBell/status/1444050427197132802?ref_src=twsrc%5Etfw\">October 1, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">HEWITT: \"Is there a point where you will say: 'I have done more harm than good because people don't listen to me anymore' and step aside?\"</p>\n<p>FAUCI: \"No. Absolutely, unequivocally no.\" <a href=\"https://t.co/puoKGqUV2Z\">pic.twitter.com/puoKGqUV2Z</a></p>\n<p>— Samuel Bravo (@bravojourno) <a href=\"https://twitter.com/bravojourno/status/1444037962753355781?ref_src=twsrc%5Etfw\">October 1, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">This is what you see when you have taken the red pill <a href=\"https://t.co/4mwFBUBuBq\">pic.twitter.com/4mwFBUBuBq</a></p>\n<p>— Anonymous UK Citizen (@AnonCitizenUK) <a href=\"https://twitter.com/AnonCitizenUK/status/1443650125218336772?ref_src=twsrc%5Etfw\">September 30, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://arthive.com/artists/3930~Maurits_Cornelis_Escher/works/200099~The_tower_of_Babel", "https://www.nature.com/articles/s41594-021-00657-8", "https://www.clinicaltrialsarena.com/comment/ridgeback-mercks-molnupiravir-for-covid-19-has-moa-administration-advantages-but-phase-iia-faces-execution-obstacles-may-have-value-gaps/", "https://www.stopworldcontrol.com/downloads/en/vaccines/vaccine-death-report.pdf", "https://market-ticker.org/akcs-www?post=243752", "https://kunstler.com/clusterfuck-nation/in-a-dark-wood/", "https://brownstone.org/articles/hospitals-should-hire-not-fire-nurses-with-natural-immunity/", "https://thefederalist.com/2021/10/01/first-workers-now-blacks-democrats-betrayals-for-big-business-are-piling-up-but-can-republicans-seize-it/", "https://www.zerohedge.com/political/cnbcs-eisen-confronts-dr-fauci-over-cdcs-unverified-claims-about-breakthrough-infections", "https://www.sciencedirect.com/science/article/abs/pii/S0146280621002267#", "https://theexpose.uk/2021/10/01/harvard-business-school-shuts-down-after-massive-covid-19-outbreak-despite-almost-all-students-being-fully-vaccinated/", "https://thepostmillennial.com/newsome-vaccines-mandatory-school-children", "https://justthenews.com/government/courts-law/supreme-court-rejects-nyc-teachers-request-stop-vaccine-mandate-taking-effect", "https://www.zerohedge.com/economics/looming-energy-crisis-people-are-going-die-winter", "https://www.jonathan-cook.net/blog/2021-09-30/us-plans-poison-assange/", "https://twitter.com/SDonziger?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/FreeDonziger?src=hash&ref_src=twsrc%5Etfw", "https://t.co/mm8P3jS8ZJ", "https://t.co/P5TmiChBRh", "https://twitter.com/Greg_Palast/status/1444026358145994754?ref_src=twsrc%5Etfw", "https://www.nature.com/articles/s41594-021-00657-8", "https://www.nature.com/articles/s41594-021-00657-8", "https://www.clinicaltrialsarena.com/comment/ridgeback-mercks-molnupiravir-for-covid-19-has-moa-administration-advantages-but-phase-iia-faces-execution-obstacles-may-have-value-gaps/", "https://www.clinicaltrialsarena.com/comment/ridgeback-mercks-molnupiravir-for-covid-19-has-moa-administration-advantages-but-phase-iia-faces-execution-obstacles-may-have-value-gaps/", "https://www.stopworldcontrol.com/downloads/en/vaccines/vaccine-death-report.pdf", "https://www.stopworldcontrol.com/downloads/en/vaccines/vaccine-death-report.pdf", "https://market-ticker.org/akcs-www?post=243752", "https://market-ticker.org/akcs-www?post=243752", "https://kunstler.com/clusterfuck-nation/in-a-dark-wood/", "https://kunstler.com/clusterfuck-nation/in-a-dark-wood/", "https://brownstone.org/articles/hospitals-should-hire-not-fire-nurses-with-natural-immunity/", "https://brownstone.org/articles/hospitals-should-hire-not-fire-nurses-with-natural-immunity/", "https://thefederalist.com/2021/10/01/first-workers-now-blacks-democrats-betrayals-for-big-business-are-piling-up-but-can-republicans-seize-it/", "https://thefederalist.com/2021/10/01/first-workers-now-blacks-democrats-betrayals-for-big-business-are-piling-up-but-can-republicans-seize-it/", "https://www.zerohedge.com/political/cnbcs-eisen-confronts-dr-fauci-over-cdcs-unverified-claims-about-breakthrough-infections", "https://t.co/gEFsIjTNWj", "https://twitter.com/CNBCClosingBell/status/1444050427197132802?ref_src=twsrc%5Etfw", "https://t.co/puoKGqUV2Z", "https://twitter.com/bravojourno/status/1444037962753355781?ref_src=twsrc%5Etfw", "https://www.zerohedge.com/political/cnbcs-eisen-confronts-dr-fauci-over-cdcs-unverified-claims-about-breakthrough-infections", "https://www.sciencedirect.com/science/article/abs/pii/S0146280621002267#", "https://www.sciencedirect.com/science/article/abs/pii/S0146280621002267#", "https://theexpose.uk/2021/10/01/harvard-business-school-shuts-down-after-massive-covid-19-outbreak-despite-almost-all-students-being-fully-vaccinated/", "https://theexpose.uk/2021/10/01/harvard-business-school-shuts-down-after-massive-covid-19-outbreak-despite-almost-all-students-being-fully-vaccinated/", "https://thepostmillennial.com/newsome-vaccines-mandatory-school-children", "https://thepostmillennial.com/newsome-vaccines-mandatory-school-children", "https://justthenews.com/government/courts-law/supreme-court-rejects-nyc-teachers-request-stop-vaccine-mandate-taking-effect", "https://justthenews.com/government/courts-law/supreme-court-rejects-nyc-teachers-request-stop-vaccine-mandate-taking-effect", "https://www.zerohedge.com/economics/looming-energy-crisis-people-are-going-die-winter", "https://www.zerohedge.com/economics/looming-energy-crisis-people-are-going-die-winter", "https://www.jonathan-cook.net/blog/2021-09-30/us-plans-poison-assange/", "https://www.jonathan-cook.net/blog/2021-09-30/us-plans-poison-assange/", "https://t.co/4mwFBUBuBq", "https://twitter.com/AnonCitizenUK/status/1443650125218336772?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": null}