{"result_id": "285037", "URL": "https://www.theautomaticearth.com/2021/07/a-pandemic-of-the-vaccinated/", "timestamp": "2023-04-25 17:16:40 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/07/a-pandemic-of-the-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "A Pandemic of The Vaccinated?", "cleaned_text": "I’ve been trying to write this for a week or so, but every time I start, new things happen. The virus landscape has changed enormously, which we of course don’t see reflected in the media. They report only on increases in infections and panicking politicians. Which can all be nicely packed together in “the Delta variant”.\n\nBut there should be much more attention -and questions- with regards to those rising numbers, more often than not occurring in highly vaccinated countries, UK, Israel etc. We might learn a thing or two if we don’t look at this through the same glasses we’ve used for a year and a half now. They grossly distorted our view. Here goes:\n\nWhat do the substances sold to us as “vaccines” -even if they’re not in the general sense of the word-, actually do? They don’t limit the risk of infection, we know that now, but we could have known it already, the producers told us. Of course the politicians and their experts said otherwise for as long as they could, but with recent rapidly rising infection rates among the fully vaccinated, we’ll hear much less of that. That story died.\n\nSo what do they do? The one thing left, and which the producers DO claim, is they make (Covid-related) illness less severe. But has anyone seen any irrefutable proof of that? If so, please send it. Not some hint at proof, nothing halfway, we’re not interested in that, but absolute and irrefutable. Like Godot.\n\nSomething we do know the vaccines do, the mRNA ones but also AZ and J&J, is they induce your cells to produce spike proteins. And it’s those spike proteins that PCR tests recognize, leading to “positive” test results, also with people who’ve never been infected by the virus.\n\nWhich makes me wonder how many people in the wave of the new “infections” test positive because they’ve been injected, not because they’ve been infected. Though the difference may not be easy to detect, other than the first group never getting sick, but then again, 80% of people have natural immunity against Covid to begin with, says Nature Magazine.\n\nSo all your victims come from 20% of the population. If you go through the sites that count “cases”, like Worldometer, you can see that there is no country (that I could find) which has seen more than 10% of people test positive. And after 18 months, chances are that percentages won’t rise much, let alone above 20%. In India, 67% of people have antibodies, it was announced today. Those people need no vaccines, their immunity is stronger than a vaccine can offer.\n\nNow, how do you tell those groups apart, the 80% vs 20%? It’s hard enough to begin with but once you inject healthy people with a substance that causes the human body to make (cyto-) toxic spike proteins, telling one from the other may become impossible (cytotoxic means it kills cells).\n\nIn short, after some 7 months of the vaccines being used, we know they are useless for preventing infection, even if loud voices keep insisting the world will come to an end if not everyone gets vaccinated. They may lead to a huge number of false positives though, meaning that once your cells start producing spike proteins, you may well get sick anyway. Sort of like a self-fulfilling prescription. Solution from industry and experts: boosters, induce cells to produce more toxic proteins. Hmmm.\n\nI’m not sure you would call the ensuing disease Covid-19, even if it has the same spike proteins, but it will have many of the same symptoms: pulmonary issues, myocarditis, other heart problems, blindness etc.\n\nAnd death. By now you must have seen some numbers, even if the media and politics keep them from you. The latest count in the US is about 11,000 deaths from the vaccines, and there is a court case being filed that claims the real count is 45,000. It could well be much more, but it’s hard to prove. All we need to know really is that in the past, 25-50 deaths was all it took to shelve a vaccine.\n\nAdverse reactions other than death are if possible even harder to get a grip on. The VAERS system says there are presently some 450,000 reported, but the UK’s MHRA yellow Card system was already well above 1,000,000 there two weeks ago, so you can pick any number you like. These systems typically register between 1-10% of events.\n\nQuestion is, do you want to pick that number AFTER getting jabbed? I’ve said before, you must count on your immune system being strong enough to fight the vaccine, not just the virus. 80% of people have an immune system that can do that. The 20% who don’t are mostly old, obese or suffering from another disease.\n\nThat the 80% is nevertheless also targeted by vaccine salesmen including politicians is pretty strange, even if we’ve come to see it as normal. But that it can actually worsen the health prospects of those involved is another story altogether. We will have to find out from the large numbers of “fully vaccinated” who are now testing positive, but who may simply have started producing spike proteins without getting infected. It will be very difficult to tell the difference, but we should no longer accept anything less.\n\nNot after accepting the failed policies of lockdowns and mask wearing and vaccines. How do we know they failed? Look at the numbers in mid summer! And compare them to last summer. Delta, yeah, yeah, I know, but how deadly is Delta? And how much have the vaccines contributed to the appearance of Delta?\n\nIt’s very popular these days to talk about the Pandemic of the Unvaccinated, but what if what we’re really looking at is a Pandemic of the Vaccinated? When the breeding ground for a virus doesn ‘t change much, there is not much reason for it to mutate. That reason comes for instance in the form of a vaccine, especially one that is non-sterilizing (doesn’t prevent further infection) and is used on an enormous scale.\n\nInstead, they’ll have you believe the opposite: that the unvaccinated (80% of whom are safe to begin with) cause a virus to mutate, and the vaccinated stop that mutating, even if they continue to infect people around them. There is no logic in that.\n\nAnd there’s that question again: what DO the vaccines do? What do they do that is beneficial to us, and which vitamin D and any of an assortment of fully harmless repurposed drugs, research into which was suspended or banned to make the vaccine EUA’s possible, could not have done, and possibly better? For one thing, the vaccines don’t grant you immunity. None. If that’s not enough yet, let’s at least start there.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Pandemic of The Vaccinated? - The Automatic Earth", "description": "Support the Automatic Earth in virustime with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/07/a-pandemic-of-the-vaccinated/", "site_name": "The Automatic Earth", "article:published_time": "2021-07-21T13:44:53+00:00", "article:modified_time": "2021-07-21T13:44:59+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/07/JohnSingerSargentPalmettos1917.jpg"}, "tags": ["vaccinated", "mutation", "spike proteins", "virus", "Delta", "EUA", "vaccines", "immune system", "unvaccinated"], "tweets": [], "movies": [], "links": ["https://www.wikiart.org/en/john-singer-sargent/palmettos-florida-1917", "https://www.nature.com/articles/s41590-020-00808-x", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-07-21T13:44:53+00:00"}