{"result_id": "285021", "URL": "https://www.theautomaticearth.com/2021/06/the-risks-to-the-fully-vaccinated/", "timestamp": "2023-04-25 17:16:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/06/the-risks-to-the-fully-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "The Risks to the Fully Vaccinated", "cleaned_text": "A bit out of the ordinary, I thought I’d give you a piece from our Comments section yesterday, by highly appreciated commenter “Doc Robinson”. Partly because he spent a lot of time weaving it together from the CDC website, and partly because it’s relevant and even somewhat shocking.\n\nTo see that vaccinated people are hospitalized, and die, at an almost twice higher rate than non-vaccinated people, is something that at least deserves much more attention. We have that attention at the Automatic Earth. And sure, we get it, more vulnerable people are more likely to have been vaccinated, but still: a lot of less-vulnerable people have been, too, by now in the US.\n\nAnd the vaccine story is being heavily skewed towards the “it’s all safe” point of view by media, industry, politics et al. But how reliable is that point of view, and how much of it is just propaganda? Let’s try and find out. You read the data, and you make up your mind. That’s all we ever asked. In that same vein, this is not meant as a definitive thing, we’re just asking questions.\n\nNearly 4,000 Fully Vaccinated People in Massachusetts Positive for COVID-19\n\nData for such “breakthrough cases” is being selectively released, and with major spin. I assembled some of the limited data that is available, and made some very rough estimates. It doesn’t look good for the vaccinated.\n\nAmong those who get a Covid-19 infection that’s symptomatic, the fully vaccinated (breakthrough cases) have a significantly higher likelihood of hospitalization than the unvaccinated. And looking at the resulting deaths as a percentage of the number of those hospitalized with a Covid-19 infection, the fully vaccinated are dying at a significantly higher rate than the unvaccinated.\n\nPercentage of Symptomatic cases which are Hospitalized:\n\nBelow is the data and math behind my estimates (for the US).\n\nPercentage of Symptomatic cases which are Hospitalized = 5.6/97.1 = 5.8%\n\n (This is the same percentage as for Feb-Dec 2020 when almost zero percent of the population was fully vaccinated.)\n\nUsing CDC data through April 30\n\n “A total of 10,262 SARS-CoV-2 vaccine breakthrough infections had been reported from 46 U.S. states and territories as of April 30, 2021. Among these cases, 6,446 (63%) occurred in females, and the median patient age was 58 years (interquartile range = 40–74 years). Based on preliminary data, 2,725 (27%) vaccine breakthrough infections were asymptomatic, 995 (10%) patients were known to be hospitalized, and 160 (2%) patients died. Among the 995 hospitalized patients, 289 (29%) were asymptomatic or hospitalized for a reason unrelated to COVID-19… 28 (18%) decedents were asymptomatic or died from a cause unrelated to COVID-19.” [CDC data through April 30]\n\nNumber of Symptomatic breakthrough cases which are Hospitalized = 995-289 = 706\n\nPercentage of Symptomatic breakthrough cases which are Hospitalized = 706/7,537 = 9.4%\n\nHospitalized COVID-19 vaccine breakthrough cases reported to CDC as of June 14 = 3,538\n\n Fatal COVID-19 vaccine breakthrough cases reported to CDC as of June 14 = 671\n\nLinks to the data used in my comment above:\n\nFor clarification, the disadvantages of vaccination shown in my comment above are only related to Covid-19 infections, and don’t include any hospitalizations or deaths due to adverse reactions from the vaccines.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Risks to the Fully Vaccinated - The Automatic Earth", "description": "Vincent van Gogh Memory of the Garden at Etten (Ladies of Arles) 1888     A bit out of the ordinary, I thought I’d give you a piece from our Comments section yesterday, by highly appreciated commenter “Doc Robinson”. Partly because he spent a lot of time weaving it together from the CDC website, and", "url": "https://www.theautomaticearth.com/2021/06/the-risks-to-the-fully-vaccinated/", "site_name": "The Automatic Earth", "article:published_time": "2021-06-24T17:32:04+00:00", "article:modified_time": "2021-06-24T17:32:10+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/03/Vincentvan_GoghLadiesOfArles1888.jpg"}, "tags": ["Doc Robinson", "vaccinated", "hospitalizations", "breakthrough", "asymptomatic", "unvaccinated", "deaths", "symptomatic", "CDC"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Memory_of_the_Garden_at_Etten_(Ladies_of_Arles)", "https://www.theautomaticearth.com/forums/topic/debt-rattle-june-23-2021/page/2/#post-78095", "https://www.theepochtimes.com/mkt_breakingnews/nearly-4000-fully-vaccinated-people-in-massachusetts-test-positive-for-covid-19_3868762.html", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-06-24T17:32:04+00:00"}