{"result_id": "285004", "URL": "https://www.theautomaticearth.com/2021/07/debt-rattle-july-19-2021/", "timestamp": "2023-04-25 17:16:04 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/07/debt-rattle-july-19-2021/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle July 19 2021", "cleaned_text": "\n• 2nd Week in a Row: More Covid Vax Deaths than COVID-19 Deaths in the US (GP)\n\n45,000 have died within 3 days from the COVID Vax\n\n https://twitter.com/i/status/1416947451056033795\n\n“Doctors for Covid Ethics has sent the following letter to tens of thousands of doctors in Europe, summarising four recent scientific findings critical to the COVID-19 vaccination program. The letter explains each finding as it relates to the biology of COVID-19 vaccines, including interactions with the immune system.\n\nTaken together, the letter warns that these new pieces of evidence force all physicians administering COVID-19 vaccines to re-evaluate the merits of COVID-19 vaccination, in the interests of their own ethical standing, and their patients’ safety and health.”\n• Four New Discoveries About Safety And Efficacy Of COVID Vaccines (DfCE)\n\nDiscovery 1: SARS-CoV-2 Spike Protein Circulates Shortly After Vaccination. SARS-CoV-2 proteins were measured in longitudinal plasma samples collected from 13 participants who received two doses of Moderna mRNA-1273 vaccine [1]. With 11 of the 13, the SARS-CoV-2 spike protein was detected in the blood within only one day after the first vaccine injection. Significance. Spike protein molecules were produced within cells that are in contact with the bloodstream—mostly endothelial cells—and released into the circulation. This means that a) the immune system will attack those endothelial cells, and b) the circulating spike protein molecules will activate thrombocytes. Both effects will promote blood clotting. This explains the many clotting-related adverse events—stroke, heart attack, venous thrombosis—that are being reported after vaccination. Discovery 2: Rapid, Memory-Type Antibody Response After VaccinationSeveral studies have demonstrated that circulating SARS-CoV-2-specific IgG and IgA antibodies became detectable within 1-2 weeks after application of mRNA vaccines [1–3]. Significance. bRapid production of IgG and IgA always indicates a secondary, memory-type response that is elicited through re-stimulation of pre-existing immune cells. Primary immune responses to novel antigens take longer to evolve and initially produce IgM antibodies, which is then followed by the isotype switch to IgG and IgA.bA certain amount of IgM was indeed detected alongside IgG and IgA in some studies [1,4]. Importantly, however, IgG rose faster than IgM [4], which confirms that the early IgG response was indeed of the memory type. This memory response indicates pre-existing, cross-reactive immunity due to previous infection with ordinary respiratory human coronavirus strains. The delayed IgM response most likely represents a primary response to novel epitopes which are specific to SARS-CoV-2.bMemory-type responses have also been documented with respect to T-cell-mediated immunity [5–7]. Overall, these findings indicate that our immune system efficiently recognizes SARS-CoV-2 as “known” even on first contact. Severe cases of the disease thus cannot be ascribed to lacking immunity. Instead, severe cases might very well be caused or aggravated by pre-existing immunity through antibody-dependent enhancement (ADE, see below). Discovery 3: SARS-CoV-2 Elicits Robust Adaptive Immune Responses Regardless Of Disease Severity Serum antibody profiles were reported for 203 individuals following SARS-CoV-2 infection [8]. 202 (>99%) of the participants exhibited SARS-CoV-2 specific antibodies. With 193 individuals (95%), these antibodies prevented SARS-CoV-2 infection in cell culture and also inhibited binding of the spike protein to the ACE2 receptor. Furthermore, CD8+ T-cell responses specific for SARS-CoV-2 were clear and quantifiable in 95 of 106 (90%) HLA-A2-positive individuals. Significance. This study confirms the above assertion that the immune response to initial contact with SARS-CoV-2 is of the memory type. In addition, it shows that this reaction occurs with almost all individuals, and particularly also with those who experience no manifest clinical symptoms. The goal of the vaccination is to stimulate production of antibodies to SARS-CoV-2, but we now know that such antibodies can and will be rapidly generated by everyone upon the slightest viral challenge, even without vaccination. Severe lung infections always take many days to develop, which means that if the antibodies generated by the memory response are needed, they will arrive on time. Therefore, vaccination is unlikely to provide significant benefit with respect to the prevention of severe lung infection. Discovery 4: Rapid Increase Of Spike Protein Antibodies After The Second Injection Of MRNA Vaccines IgG and IgA antibody titres were monitored before vaccination and after the first and the second injection of mRNA vaccines [3]. Antibody titres rose with some delay after the first injection, then plateaued, but rose again very shortly after the second injection. Significance. Even though the antibody response to the first injection is of the memory type, the small time lag after the injection may mitigate adverse reactions, because the abundance of spike protein on the cells in the blood vessel walls and in other tissues may have already passed its peak when the antibodies arrive. The situation changes dramatically with the second injection. Then the spikes are produced and protrude into the bloodstream that is already swarming with both reactive lymphocytes and antibodies. The antibodies will cause the complement system [9,10] and also neutrophil granulocytes to attack the spike protein-bearing cells. The possible consequences of all-out self-attack by the immune system are frightening.\n\nThe article above references a Dr. Bahkdi video VanDen Bossche has issues with. Could we have an actual scientific discussion? Where do the censors stand on this one?\n\nI herewith wanted to react to a recent video posted by Dr. Bhakdi (https://evidencenotfear.com/proof-that-puts-an-end-to-the-sars-cov-2-narrative-professor-sucharit-bhakdi-oracle-films/). I was quite stunned about the statements he made and could not believe that this had allegedly been published. Hence, I consulted the publications Dr. Bhakdi has been referring to in his presentation (you’ll find them in the article that accompanies the video). My contribution attached explains why his viewpoint in regard of herd immunity and protection against variants is highly questionable. Given his background and credentials, I am very surprised at his conclusions. It’s certainly not that I cannot refrain from criticizing but if we’re not going to stick to the science, we’re going to lose our precious credibility. I am sure many of you have seen Dr. Bhakdi’s presentation. As much as I’d like to confirm his position, I cannot agree with his interpretation. Dr. Bhakdi is basically claiming that because of previous exposure to common cold viruses we have immune memory cells that can be recalled upon exposure to Sars-CoV-2 and protect us! This is not true! While there is no doubt that there is some cross-reactivity between immune responses to some spike(S)-derived epitopes on beta coronaviruses (CoVs), these immune responses are not cross-PROTECTIVE. Dr. Bhakdi is confusing all along cross-reactivity (which basically means that antibodies (Abs) or T cells induced by one CoV can BIND similar [conserved] epitopes on some other CoVs) and cross-protection. However, immune RECOGNITION does not equal immune PROTECTION. None of the publications Dr. Bhakdi is referring to has analyzed or claims cross-PROTECTION elicited by other CoVs. Again, Abs that bind to Sars-CoV-2 do not necessarily neutralize the virus and prevent it from entering the cell. Of course, many people will have a history of common cold infection and hence may rapidly recall some spike-directed Abs (i.e., towards epitopes that are shared with Sars-CoV-2) upon exposure to Sars-CoV-2 or after immunization with Sars-CoV-2-derived antigens. However, this doesn’t mean at all that these rapidly rising IgG and IgA Dr. Bhakdi is referring to will neutralize Sars-CoV-2 and protect you from Covid-19 disease! In addition, Sars-CoV-2-induced Abs were only found to cross-react with 2 out of the 4 common cold CoVs (i.e., only for beta coronavirus HKU1 and OC43) and the cross-reactivity was ‘much lower than that observed for the remaining CoV epitopes’. Furthermore, his statement that people who have built immunity against CoV are automatically protected against all Sars-CoV-2 variants is not true either for exactly the same reasons (i.e., Abs that bind to variants do not necessarily neutralize them and could even be at risk of causing Ab-dependent enhancement of disease; ADE).\n\nIsrael is a prime example alright; of how the vaccine hunger screws up a country.\n\nNot arrested yet; they won’t return till August.\n• 2 More Texas Dems Who Fled State To Block GOP Voting Bill Test Positive (NYP)\n\nBecause our users are not terribly smart people…\n• Facebook Says 85% of US Users Are Pro-Vaccine (RT)\n\nFacebook has patted itself on the back for encouraging vaccine acceptance among its US users, noting an increase of 10-15% since January, while firing back at President Joe Biden’s claim of subverting the rollout. “The data shows that 85% of Facebook users in the US have been or want to be vaccinated against COVID-19,” Facebook VP of Integrity Guy Rosen said in a blog post on Saturday, rejecting Biden’s charge that social media was to blame for the lack of enthusiasm among Americans towards the Covid-19 jabs. On Friday, Biden tore into social media platforms such as Facebook, accusing them of “killing people” by not cracking down on non-conventional opinions about vaccination fervently enough. “They’re killing people… Look, the only pandemic we have is among the unvaccinated. And they’re killing people,” the US president said. Dismissing the allegation, Rosen accused Biden of essentially making Facebook a scapegoat for his administration’s failure to reach its self-imposed goal of having 70% Americans vaccinated by July 4. “President Biden’s goal was for 70% of Americans to be vaccinated by July 4. Facebook is not the reason this goal was missed,” Rosen said, arguing that figures “tell a very different story to the one promoted by the administration.” Facebook, Rosen claimed, has seen a dramatic increase in confidence in Covid-19 vaccines among its American users in the last six months. “Since January, vaccine acceptance on the part of Facebook users in the US has increased by 10-15 percentage points (70%->80-85%),” Rosen wrote, citing a recent survey by Carnegie Mellon University. He added that distrust of the jabs among racial and ethnic minorities has “shrunk considerably” as well. Facebook has deployed “unprecedented resources” in its fight against the pandemic, such as “pointing people to reliable information” and facilitating vaccine appointments, he noted. In addition to persuading people of the effectiveness and safety of the vaccines through pop-up labels under coronavirus-related posts, Facebook has been waging a war on information that does not align with the official stance of the World Health Organization (WHO) or local governments.\n\n” It was a dangerous experiment being conducted without knowing the answer to the most basic question: Just how lethal is this virus?”\n\nThe United States suffered through two lethal waves of contagion in the past year and a half. The first was a viral pandemic that killed about one in 500 Americans—typically, a person over 75 suffering from other serious conditions. The second, and far more catastrophic, was a moral panic that swept the nation’s guiding institutions. Instead of keeping calm and carrying on, the American elite flouted the norms of governance, journalism, academic freedom—and, worst of all, science. They misled the public about the origins of the virus and the true risk that it posed. Ignoring their own carefully prepared plans for a pandemic, they claimed unprecedented powers to impose untested strategies, with terrible collateral damage. As evidence of their mistakes mounted, they stifled debate by vilifying dissenters, censoring criticism, and suppressing scientific research. If, as seems increasingly plausible, the coronavirus that causes Covid-19 leaked out of a laboratory in Wuhan, it is the costliest blunder ever committed by scientists. Whatever the pandemic’s origin, the response to it is the worst mistake in the history of the public-health profession. We still have no convincing evidence that the lockdowns saved lives, but lots of evidence that they have already cost lives and will prove deadlier in the long run than the virus itself. One in three people worldwide lost a job or a business during the lockdowns, and half saw their earnings drop, according to a Gallup poll. Children, never at risk from the virus, in many places essentially lost a year of school. The economic and health consequences were felt most acutely among the less affluent in America and in the rest of the world, where the World Bank estimates that more than 100 million have been pushed into extreme poverty. The leaders responsible for these disasters continue to pretend that their policies worked and assume that they can keep fooling the public. They’ve promised to deploy these strategies again in the future, and they might even succeed in doing so—unless we begin to understand what went wrong. The panic was started, as usual, by journalists. As the virus spread early last year, they highlighted the most alarming statistics and the scariest images: the estimates of a fatality rate ten to 50 times higher than the flu, the chaotic scenes at hospitals in Italy and New York City, the predictions that national health-care systems were about to collapse. The full-scale panic was set off by the release in March 2020 of a computer model at the Imperial College in London, which projected that—unless drastic measures were taken—intensive-care units would have 30 Covid patients for every available bed and that America would see 2.2 million deaths by the end of the summer. The British researchers announced that the “only viable strategy” was to impose draconian restrictions on businesses, schools, and social gatherings until a vaccine arrived. This extraordinary project was swiftly declared the “consensus” among public-health officials, politicians, journalists, and academics. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, endorsed it and became the unassailable authority for those purporting to “follow the science.” What had originally been a limited lockdown—“15 days to slow the spread”—became long-term policy across much of the United States and the world. A few scientists and public-health experts objected, noting that an extended lockdown was a novel strategy of unknown effectiveness that had been rejected in previous plans for a pandemic. It was a dangerous experiment being conducted without knowing the answer to the most basic question: Just how lethal is this virus?\n\nFreedom of speech is dead, but not from the virus.\n• “Misinformation” Means Whatever The Censors Want It To Mean (Tracey)\n\nGovernment officials and their lackeys in the media often speak of the term “misinformation” as though it has some sort of universally-accepted, politically neutral definition. That’s always been total BS, but generating the mirage of neutrality has been a necessary ingredient in popularizing the “misinformation” concept over the past five years. Those who reject the impositions of mainstream cultural and political elites must not be simply wrong, but maliciously brainwashed by “misinformation” that complicit entities such as the social media platforms allow to proliferate. In 2018, when these entities engineered a simultaneous cross-platform purge of Alex Jones, there was an avalanche of media apologia for this hitherto unprecedented act of censorship. Jones had caused unique harm, the journalists cried, and the platforms were merely “Enforcing The Rules.” But of course what they were oblivious to was that “the rules,” such as they exist, are just a function of power. “Misinformation” and other alleged infractions of social media “rules” are determined at the whim of whoever happens to wield censorship and speech-regulation power at that moment. Journalists themselves, chronically oblivious to their own power, were exactly the ones who agitated for the expulsion of Jones, and their agitation succeeded. Here is an article I wrote the day after this cross-platform purge: “Alex Jones’ lunacy is self-evident and needs no further comment. The only relevant question is whether we want a media landscape in which a tiny cadre of unelected private officials are empowered to decide, in secret and with no mechanisms for accountability, that the time has come to purge this lunatic from the public square. “Now, just around three years later, we receive a declaration from a spokesperson for the President that the Federal Government is seeking to coerce, mandate, or otherwise bring about routinized cross-platform purges. “You shouldn’t be banned from one platform, and not others, for providing misinformation out there,” press secretary Jen Psaki demanded, creepily calling on the social media giants to create “robust enforcement strategies that bridge their properties.” So if you were under any illusion back in 2018 that this would ever stop with Jones — a figure believed to be sufficiently repulsive that any punishment doled out to him would not have broader implications for the average internet user — well, it didn’t take long for proof of just how wrong you were. Journalists and others with influential platforms, particularly those who spend all day everyday on the internet and rely on it for their livelihood, at least in theory have a duty to demonstrate some semblance of foresight. Meaning, to consider issues of public interest that go beyond their short-term desire for political vengeance.\n\nBig story yada yada, even Snowden says it, but it’s from the Guardian.\n\nHuman rights activists, journalists and lawyers across the world have been targeted by authoritarian governments using hacking software sold by the Israeli surveillance company NSO Group, according to an investigation into a massive data leak. The investigation by the Guardian and 16 other media organisations suggests widespread and continuing abuse of NSO’s hacking spyware, Pegasus, which the company insists is only intended for use against criminals and terrorists. Pegasus is a malware that infects iPhones and Android devices to enable operators of the tool to extract messages, photos and emails, record calls and secretly activate microphones. The leak contains a list of more than 50,000 phone numbers that, it is believed, have been identified as those of people of interest by clients of NSO since 2016. Forbidden Stories, a Paris-based nonprofit media organisation, and Amnesty International initially had access to the leaked list and shared access with media partners as part of the Pegasus project, a reporting consortium. The presence of a phone number in the data does not reveal whether a device was infected with Pegasus or subject to an attempted hack. However, the consortium believes the data is indicative of the potential targets NSO’s government clients identified in advance of possible surveillance attempts. Forensics analysis of a small number of phones whose numbers appeared on the leaked list also showed more than half had traces of the Pegasus spyware. The Guardian and its media partners will be revealing the identities of people whose number appeared on the list in the coming days. They include hundreds of business executives, religious figures, academics, NGO employees, union officials and government officials, including cabinet ministers, presidents and prime ministers. The list also contains the numbers of close family members of one country’s ruler, suggesting the ruler may have instructed their intelligence agencies to explore the possibility of monitoring their own relatives. The disclosures begin on Sunday, with the revelation that the numbers of more than 180 journalists are listed in the data, including reporters, editors and executives at the Financial Times, CNN, the New York Times, France 24, the Economist, Associated Press and Reuters.\n• The Controversial Prosecutor At The Heart Of The Julian Assange Case (IC)\n\nThe battle to extradite WikiLeaks publisher Julian Assange from the United Kingdom to the United States is shaping up to be a legal case of paramount importance to the future of national security reporting. The U.S. continues to press the case even after a change of administration, with President Joe Biden keeping up efforts to bring Assange to a U.S. court on Espionage Act charges for his role in publishing classified government documents. One little-noted name in filings from extradition hearings in the U.K. keeps popping up as a key figure in the U.S. government’s case: a federal prosecutor named Gordon Kromberg. On the central questions of what assistance Assange provided to whistleblower Chelsea Manning and the ostensible harm his actions caused to U.S. national security, a U.K. court filing earlier this year cites Kromberg’s assertions verbatim. “Mr. Kromberg’s evidence on this is clear,” the filing says. “He stated that stealing hundreds of thousands of documents from classified databases was a multistep process.” The same document cites Kromberg again, claiming that “well over one hundred people were placed at risk from the disclosures and approximately fifty people sought and received assistance from the US” — references to purported U.S. intelligence assets outed by the documents WikiLeaks published. Kromberg, an assistant United States attorney in the Eastern District of Virginia, may be unknown to foreign and even many American observers. In U.S. legal circles, though, he has been a highly controversial figure for over two decades, dogged by accusations of bias and politicization in his prosecutions. For years, civil rights activists and lawyers tried to draw attention to allegations of Kromberg’s abusive practices. Rather than being pushed into obscurity by these efforts, today he is serving as a key figure in one of the most important civil liberties cases in the world. In all, the January court documents from Assange’s extradition case mention Kromberg over 40 times to help make the legal argument for extraditing Assange. Many of his statements go to the heart of the Espionage Act case against the WikiLeaks publisher. [..] In the years after the 2001 September 11 terrorist attacks, Gordon Kromberg became the government’s point man on notorious terrorism cases involving allegations of torture and malicious prosecution. In the past, opposing counsels and civil rights groups accused him of engaging in racist behavior and using unethical tactics in pursuit of convictions. Legal experts said that the inclusion of a notoriously politicized and aggressive prosecutor on a high-profile extradition case like Assange’s is a sign of how strongly the government is motivated to extradite the WikiLeaks publisher and bring Espionage Act charges at all costs. “A common factor in Kromberg’s career has been a willingness to take very provocative positions on behalf of the government and stay the course with them,” said Wadie Said, a professor of law at the University of South Carolina and author of “Crimes of Terror: The Legal and Political Implications of Federal Terrorism Prosecutions.” “He has also shown great willingness to take on highly political cases and to be a lightning rod himself for attention; he often makes himself part of the story with his own actions and statements.” Said added, “From my perspective, some of the things that Kromberg has said in the past and the positions that he has taken are quite tendentious and even vindictive in terms of his mindset toward the person that he is targeting.”\n• Tribes Are Leading the Way to Remove Dams and Restore Ecosystems (Yes)\n\nCameron Macias bent down to examine a small pile of sawdust-filled scat on the floor of the former Lake Mills on the Elwha River in the northwest corner of Washington state in 2016. It was a sign that beavers were moving into the area after a 100+ year absence. “There’s very small dam-building activity in some of the side tributaries,” says Macias, who was working at the time as a wildlife technician for the Lower Elwha Klallam Tribe, of which she is a member. “It’s kind of funny and ironic because of the dam removal,” Macias says with a laugh. The dams she’s referring to—the Elwha and Glines Canyon dams—were removed in 2011 and 2014 respectively, and together they are considered the world’s largest dam removal project to date. Many other tribes have looked to the success of the Elwha River dam removals in bringing down fish-blocking dams in their lands as well, including along the Snake River and the Columbia River in the Pacific Northwest. Together, the country’s 2 million dams block access to more than 600,000 miles of river for fish. And by 2030, the American Society of Civil Engineers estimates that 80% of those dams will be beyond their 50-year lifespans. Given how obsolete and potentially dangerous this infrastructure will be, not to mention its negative effects on declining fish stocks, the best solution for many aging dams is to simply remove them. But bringing down a dam is a big job. When the Elwha River dams fell, it was the culmination of many decades of successful partnerships among the Lower Elwha Klallam Tribe, the National Park Service, the U.S. Fish and Wildlife Service, and dozens of other local and national organizations. Today, those partnerships continue to support the tribe in righting historic wrongs. The Elwha Dam was built in 1910 to provide electricity to attract new settlers, in flagrant violation of a Washington state law that said dams must allow for fish passage. At the time, no one consulted the Lower Elwha Klallam people, whose culture rests on the salmon that would be blocked by the dams. “We had a few of the elders that even stood in the areas of the lower dam where they were starting to build to protest,” says Frances Charles, the tribal chairwoman for the Lower Elwha Klallam Tribe. But the dam construction proceeded, and afterward, hatcheries were put in as a sort of life support to keep salmon populations afloat. Every year, the fish born in the hatcheries would try to return to the spawning grounds of their ancestors, banging their heads on the dam in a desperate attempt to get upstream. “We ourselves felt like we were banging our heads against the concrete wall, no different than the salmon,” Charles says. Things changed in January 1986 when the tribe filed a motion to stop the relicensing of the dams, citing that the dam prevented them from exercising their treaty rights because it blocked fish passage. “The tribe and [Olympic National] Park and the environmental interests said, ‘You know, if you’re going to license these things, you’re going to provide fish passage,’” says Mike McHenry, the Tribe’s fisheries habitat manager. Studies showed that building fish passages wouldn’t effectively restore the salmon runs, so the decision was made to take down the dams. Still, it took an Act of Congress and $325 million to complete the job.\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle July 19 2021 - The Automatic Earth", "description": "Support the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/07/debt-rattle-july-19-2021/", "site_name": "The Automatic Earth", "article:published_time": "2021-07-19T09:14:36+00:00", "article:modified_time": "2021-07-19T09:14:42+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2021/07/LeoneSicily1953.jpg"}, "tags": ["efficacy", "panic pandemic", "Assange", "Israel", "Pegasus", "Facebook", "dams", "vax deaths", "misinformation"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Dr. Richard Fleming about Heparin <a href=\"https://t.co/WLNr5C5caC\">pic.twitter.com/WLNr5C5caC</a></p>\n<p>— Camus (@camus37) <a href=\"https://twitter.com/camus37/status/1417023395812761600?ref_src=twsrc%5Etfw\">July 19, 2021</a></p></blockquote>\n"], "movies": [], "links": ["http://harbel.com/giuseppe-leone-great-sicilian-harbel-blog/", "https://www.thegatewaypundit.com/2021/07/second-week-row-covid-19-vaccination-deaths-covid-19-deaths-us-according-cdc-vaers-websites/", "https://principia-scientific.com/four-new-discoveries-about-safety-and-efficacy-of-covid-vaccines/", "https://www.geertvandenbossche.org/post/response-to-dr-bhakdi", "https://www.jpost.com/breaking-news/coronavirus-in-israel-430-new-cases-147-percent-of-tests-positive-674215", "https://nypost.com/2021/07/18/2-more-texas-dems-who-fled-state-to-block-gop-voting-bill-get-covid-19/", "https://www.rt.com/usa/529512-facebook-missed-vaccination-goal-blame/", "https://www.city-journal.org/panic-pandemic", "https://mtracey.substack.com/p/misinformation-means-whatever-those", "https://www.theguardian.com/world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus", "https://theintercept.com/2021/07/17/julian-assange-extradition-gordon-kromberg", "https://www.yesmagazine.org/environment/2021/07/14/tribes-remove-dams-restore-ecosystems", "https://t.co/WLNr5C5caC", "https://twitter.com/camus37/status/1417023395812761600?ref_src=twsrc%5Etfw", "https://www.thegatewaypundit.com/2021/07/second-week-row-covid-19-vaccination-deaths-covid-19-deaths-us-according-cdc-vaers-websites/", "https://www.thegatewaypundit.com/2021/07/second-week-row-covid-19-vaccination-deaths-covid-19-deaths-us-according-cdc-vaers-websites/", "https://principia-scientific.com/four-new-discoveries-about-safety-and-efficacy-of-covid-vaccines/", "https://principia-scientific.com/four-new-discoveries-about-safety-and-efficacy-of-covid-vaccines/", "https://www.geertvandenbossche.org/post/response-to-dr-bhakdi", "https://www.geertvandenbossche.org/post/response-to-dr-bhakdi", "https://www.jpost.com/breaking-news/coronavirus-in-israel-430-new-cases-147-percent-of-tests-positive-674215", "https://www.jpost.com/breaking-news/coronavirus-in-israel-430-new-cases-147-percent-of-tests-positive-674215", "https://nypost.com/2021/07/18/2-more-texas-dems-who-fled-state-to-block-gop-voting-bill-get-covid-19/", "https://nypost.com/2021/07/18/2-more-texas-dems-who-fled-state-to-block-gop-voting-bill-get-covid-19/", "https://www.rt.com/usa/529512-facebook-missed-vaccination-goal-blame/", "https://www.rt.com/usa/529512-facebook-missed-vaccination-goal-blame/", "https://www.city-journal.org/panic-pandemic", "https://www.city-journal.org/panic-pandemic", "https://mtracey.substack.com/p/misinformation-means-whatever-those", "https://mtracey.substack.com/p/misinformation-means-whatever-those", "https://www.theguardian.com/world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus", "https://www.theguardian.com/world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus", "https://theintercept.com/2021/07/17/julian-assange-extradition-gordon-kromberg", "https://theintercept.com/2021/07/17/julian-assange-extradition-gordon-kromberg", "https://www.yesmagazine.org/environment/2021/07/14/tribes-remove-dams-restore-ecosystems", "https://www.yesmagazine.org/environment/2021/07/14/tribes-remove-dams-restore-ecosystems", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-07-19T09:14:36+00:00"}