{"result_id": "285050", "URL": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-24-2021/", "timestamp": "2023-04-25 17:16:52 CEST+0200", "meta": {"description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "lang": "en", "keywords": "", "favicon": "https://autoearth.wpenginepowered.com/wp-content/uploads/2013/06/FaviconAplha32px.png", "canonical": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-24-2021/", "encoding": "UTF-8"}, "image": null, "domain": "www.theautomaticearth.com", "title": "Debt Rattle August 24 2021", "cleaned_text": "It’s been an insane 24 hours. You’d think a full approval of a vaccine would be a straightforward event, but the FDA just made things more, and extremely, complicated. First, a few bits and pieces from what they issued:\n\n“COMIRNATY is the first COVID-19 vaccine to be granted FDA approval ”\n\n also:\n\n “These may not be all the possible side effects of the vaccine. Serious and unexpected side effects may occur. THE VACCINE IS STILL BEING STUDIED IN CLINICAL TRIALS.”\n\nOn August 23, 2021, FDA approved the biologics license application (BLA) submitted by BioNTech Manufacturing GmbH for COMIRNATY (COVID-19 Vaccine, mRNA) for active immunization to prevent COVID-19 caused by SARS-CoV-2 in individuals 16 years of age and older…\n\n…the EUA will remain in place for the Pfizer-BioNTech COVID-19 vaccine for the previously-authorized indication and uses, and to authorize use of COMIRNATY (COVID-19 Vaccine, mRNA) under this EUA for certain uses that are not included in the approved BLA…\n\nCOMIRNATY (COVID-19 Vaccine, mRNA) is the same formulation as the PfizerBioNTech COVID-19 Vaccine and can be used interchangeably with the Pfizer-BioNTech COVID-19 Vaccine to provide the COVID-19 vaccination series…\n\nC. There is no adequate, approved, and available [see Note 9] alternative to the emergency use of Pfizer-BioNTech COVID 19 Vaccine to prevent COVID-19.\n\n[Note 9:] Although COMIRNATY (COVID-19 Vaccine, mRNA) is approved to prevent COVID-19 in individuals 16 years of age and older, there is not sufficient approved vaccine available for distribution to this population in its entirety at the time of reissuance of this EUA. Additionally, there are no products that are approved to prevent COVID-19 in individuals age 12 through 15, or that are approved to provide an additional dose to the immunocompromised population described in this EUA.\n\nX. All descriptive printed matter, advertising, and promotional material, relating to the use of the Pfizer-BioNTech COVID 19 Vaccine shall be consistent with the authorized labeling, as well as the terms set forth in this EUA, and meet the requirements set forth in section 502(a) and (n) of the FD&C Act and FDA implementing regulations.\n\nY. All descriptive printed matter, advertising, and promotional material relating to the use of the Pfizer-BioNTech COVID 19 Vaccine clearly and conspicuously shall state that:\n\n” This product has not been approved or licensed by FDA, but has been authorized for emergency use by FDA, under an EUA to prevent Coronavirus Disease 2019 (COVID-19) for use in individuals 12 years of age and older; and\n\n” The emergency use of this product is only authorized for the duration of the declaration that circumstances exist justifying the authorization of emergency use of the medical product under Section 564(b)(1) of the FD&C Act unless the declaration is terminated or authorization revoked sooner.\n\nThe original documents. Just check the dates. What happened to those?\n\n“The Pfizer-BioNTech emergency use authorization was based on clinical trials involving about 37,000 people.”\n\nWell, not really, because they stopped those trials.\n• Pfizer-BioNTech Vaccine Becomes First To Win FDA’s Full Approval (USAT)\n\nEight months after authorizing the Pfizer-BioNTech COVID-19 vaccine for emergency use in the USA, the Food and Drug Administration issued its full stamp of approval. Now that the companies’ detailed, so-called biologics license application has been granted, it’s likely that vaccination will be required by many companies, schools and other entities. The FDA decision clears the way for the companies to market their vaccine, which is not permitted without full licensure. And it may launch a race for booster shots, allowing doctors to prescribe extra Pfizer-BioNTech shots “off label” to anyone they think should get one. The FDA confirmed late last year through a more streamlined evaluation process that the vaccine, from pharmaceutical giant Pfizer and its partner, German startup BioNTech, was safe, effective and could be reliably produced. The review of the 340,000-page license application was completed in just 97 days by FDA staff working “night and day,” said Dr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research, which approves vaccines “We completed this in about 40% of the normal clock time for a submission of this magnitude,” he said. The license application was three times the size of the emergency use authorization submission, which weighed in at 110,000 pages. The companies have manufactured more than 2 billion doses, more than 200 million of which were administered in the USA, the most of any of the three vaccines allowed for use in the country. The full license includes four more months of efficacy and safety data, confirming trial results and detailing manufacturing processes. The Pfizer-BioNTech emergency use authorization was based on clinical trials involving about 37,000 people. The full approval was based on study results involving more than 44,000 people followed for six months. The license applies only to those 16 and over, but the vaccine is allowed for those 12 to 15 under the previous authorization. “Based on the longer-term follow-up data that we submitted, today’s approval for those aged 16 and over affirms the efficacy and safety profile of our vaccine at a time when it is urgently needed,” Pfizer chairman and CEO Albert Bourla said in a statement. “I am hopeful this approval will help increase confidence in our vaccine, as vaccination remains the best tool we have to help protect lives and achieve herd immunity.”\n\nNot sure it’s a great idea for the FDA to have pissed off Peter Doshi, senior editor at The BMJ, one of the most reputable magazines around. Much more at the original (link).\n• Does The FDA Think These Data Justify Approval Of A Covid-19 Vaccine? (BMJ)\n\nOn 28 July 2021, Pfizer and BioNTech posted updated results for their ongoing phase 3 covid-19 vaccine trial. The preprint came almost a year to the day after the historical trial commenced, and nearly four months since the companies announced vaccine efficacy estimates “up to six months.” But you won’t find 10 month follow-up data here. While the preprint is new, the results it contains aren’t particularly up to date. In fact, the paper is based on the same data cut-off date (13 March 2021) as the 1 April press release, and its topline efficacy result is identical: 91.3% (95% CI 89.0 to 93.2) vaccine efficacy against symptomatic covid-19 through “up to six months of follow-up.” The 20 page preprint matters because it represents the most detailed public account of the pivotal trial data Pfizer submitted in pursuit of the world’s first “full approval” of a coronavirus vaccine from the Food and Drug Administration. It deserves careful scrutiny. [..] The elephant named “waning immunity”…“Waning immunity” is a known problem for influenza vaccines, with some studies showing near zero effectiveness after just three months, meaning a vaccine taken early may ultimately provide no protection by the time “flu season” arrives some months later. If vaccine efficacy wanes over time, the crucial question becomes what level of effectiveness will the vaccine provide when a person is actually exposed to the virus? Unlike covid vaccines, influenza vaccine performance has always been judged over a full season, not a couple months. And so the recent reports from Israel’s Ministry of Health caught my eye. In early July, they reported that efficacy against infection and symptomatic disease “fell to 64%.” By late July it had fallen to 39% where Delta is the dominant strain. This is very low. For context, the FDA’s expectation is of “at least 50%” efficacy for any approvable vaccine. Delta may not be responsible Enter Pfizer’s preprint. As an RCT reporting “up to six months of follow-up,” it is notable that evidence of waning immunity was already visible in the data by the 13 March 2021 data cut-off… And it’s hard to imagine how the Delta variant could play a real role here, for 77% of trial participants were from the United States, where Delta was not established until months after data cut-off. Waning efficacy has the potential to be far more than a minor inconvenience; it can dramatically change the risk-benefit calculus. The “six month” preprint based on the 7% of trial participants who remained blinded at six months Despite the reference to “six month safety and efficacy” in the preprint’s title, the paper only reports on vaccine efficacy “up to six months,” but not from six months. This is not semantics, as it turns out only 7% of trial participants actually reached six months of blinded follow-up (“8% of BNT162b2 recipients and 6% of placebo recipients had ≥6 months follow-up post-dose 2.”) So despite this preprint appearing a year after the trial began, it provides no data on vaccine efficacy past six months, which is the period Israel says vaccine efficacy has dropped to 39%. It is hard to imagine that the <10% of trial participants who remained blinded at six months (which presumably further dwindled after 13 March 2021) could constitute a reliable or valid sample to produce further findings. Severe disease And on preventing death from covid-19, there are too few data to draw conclusions—a total of three covid-19 related deaths (one on vaccine, two on placebo). There were 29 total deaths during blinded follow-up (15 in the vaccine arm; 14 in placebo). The crucial question, however, is whether the waning efficacy seen in the primary endpoint data also applies to the vaccine’s efficacy against severe disease. Unfortunately, Pfizer’s new preprint does not report the results in a way that allows for evaluating this question. Approval imminent without data transparency, or even an advisory committee meeting? …But here we are, with FDA reportedly on the verge of granting a marketing license 13 months into the still ongoing, two year pivotal trial, with no reported data past 13 March 2021, unclear efficacy after six months due to unblinding, evidence of waning protection irrespective of the Delta variant, and limited reporting of safety data. (The preprint reports “decreased appetite, lethargy, asthenia, malaise, night sweats, and hyperhidrosis were new adverse events attributable to BNT162b2 not previously identified in earlier reports,” but provides no data tables showing the frequency of these, or other, adverse events.) It’s not helping matters that FDA now says it won’t convene its advisory committee to discuss the data ahead of approving Pfizer’s vaccine. (Last August, to address vaccine hesitancy, the agency had “committed to use an advisory committee composed of independent experts to ensure deliberations about authorization or licensure are transparent for the public.”)\n\n“..the jab allows vaccinated individuals to carry unusually high viral loads without becoming ill at first, potentially transforming them into presymptomatic superspreaders.”\n\nA groundbreaking preprint paper by the prestigious Oxford University Clinical Research Group, published Aug. 10 in The Lancet, includes alarming findings devastating to the COVID vaccine rollout. The study found vaccinated individuals carry 251 times the load of COVID-19 viruses in their nostrils compared to the unvaccinated. While moderating the symptoms of infection, the jab allows vaccinated individuals to carry unusually high viral loads without becoming ill at first, potentially transforming them into presymptomatic superspreaders. This phenomenon may be the source of the shocking post-vaccination surges in heavily vaccinated populations globally. The paper’s authors, Chau et al, demonstrated widespread vaccine failure and transmission under tightly controlled circumstances in a hospital lockdown in Ho Chi Minh City, Viet Nam. The scientists studied healthcare workers who were unable to leave the hospital for two weeks. The data showed that fully vaccinated workers — about two months after injection with the Oxford/AstraZeneca COVID-19 vaccine (AZD1222) — acquired, carried and presumably transmitted the Delta variant to their vaccinated colleagues. They almost certainly also passed the Delta infection to susceptible unvaccinated people, including their patients. Sequencing of strains confirmed the workers transmitted SARS-CoV-2 to one another. = This is consistent with the observations in the U.S. from Farinholt and colleagues, and congruent with comments by the director of the Centers for Disease Control and Prevention conceding COVID-19 vaccines have failed to stop transmission of SARS-CoV-2. On Feb. 11, the World Health Organization indicated the AZD1222 vaccine efficacy of 63.09% against the development of symptomatic SARS-CoV-2 infection. The conclusions of the Chau paper support the warnings by leading medical experts that the partial, non-sterilizing immunity from the three notoriously “leaky” COVID-19 vaccines allow carriage of 251 times the viral load of SARS-CoV-2 as compared to samples from the pre-vaccination era in 2020. Thus, we have a key piece to the puzzle explaining why the Delta outbreak is so formidable — fully vaccinated are participating as COVID-19 patients and acting as powerful Typhoid Mary-style super-spreaders of the infection. Vaccinated individuals are blasting out concentrated viral explosions into their communities and fueling new COVID surges. Vaccinated healthcare workers are almost certainly infecting their coworkers and patients, causing horrendous collateral damage. Continued vaccination will only make this problem worse, particularly among frontline doctors and nurses workers who are caring for vulnerable patients. Health systems should drop vaccine mandates immediately, take stock of COVID-19 recovered workers who are robustly immune to Delta and consider the ramifications of their current vaccinated healthcare workers as potential threats to high risk patients and coworkers.\n\n“..prior infection and recovery produces durable and stable immunity in essentially everyone who has a competent immune system..”\n\nSo the FDA has “fully approved” the Pfizer jab for Covid. In doing so standing alone they have broken the law and thus have irrevocably destroyed their authority and any reason for anyone to ever do anything based on them ever again. Let me explain. Under black letter law an EUA is illegal if there is an alternative that is considered safe, effective and available. This was the reason the FDA did not (for 18 months!) run the studies and evaluate them on other early-intervention drugs for Covid-19. We all know what they are. I’m living proof they work too, as are millions of others worldwide. But, more-importantly, this “full approval” voids all other vaccine EUAs for Covid-19. That is, under the law the Moderna and J&J instantly became illegal to offer or use within the United States. The makers can apply for full authorization, of course, but the EUAs are void as of this morning and under black letter law cannot be administered to anyone in the United States as they are now unlicensed and unlawful products in human beings until and unless they are given full approval themselves. No medical provider can offer or administer any other than the Pfizer Covid-19 shot in the United States as of the moment of that approval. You can bet the law will be ignored; note MRNAs stock price this morning. It should have instantly been cut in half. In addition the FDA broke the law itself when it issued the “approval.” The law requires a full hearing and the data from the full set of trials; the trials are not capable of being completed until early 2022 by the original submissions and they deliberately did not hold the hearing. This is a black letter violation of the law as well, but nobody cares. As for me, I don’t give a crap. I’ve been infected, 98% certain it was Delta (because that’s all that’s circulating right now in the US where the index case I got infected by came from, and I know who it was) and am recovered. I hit it with meds immediately and I’m fine. I know, scientifically, it was Covid-19 and not some other virus as I now have IgG antibodies and did not for the previous 18 months which I know factually as I repeatedly tested myself. There is thus exactly zero medical benefit I can derive from the jabs. I will walk without fear into a Covid-19 ICU unit right now without any PPE on whatsoever. I have no fear of this virus because as with every other viral infection of note including those that are much more-dangerous than Covid, such as measles, prior infection and recovery produces durable and stable immunity in essentially everyone who has a competent immune system, and I do. Those of you who trust the jabs to be equally effective to an active infection and recovery are free to come with me. I will bet my life that I’m sterile immune to the virus as a result of said infection and recovery. Are you willing to place the same bet, given the many known failures to protect by the shot, including Jesse Jackson and his wife, both of whom are in the hospital with Covid-19 despite being vaccinated in a very public spectacle in January of this year? There you have it.\n\n“..the FDA will grant approval on results that were intentionally constructed to produce only one outcome.”\n\nAccording to the New York Times and multiple media outlets, Pfizer is expected to get full FDA approval today. “The move would make it the first Covid vaccine to go from emergency use authorization to full FDA approval.” With that in mind, it is worth a reminder that both Pfizer and Moderna stopped the clinical trials the FDA was using in their review: The Moderna and Pfizer vaccine tests were conducted, as customary, with a control group; a group within the trial who were given a placebo and not the test vaccine. However, during the trial -and after the untested vaccines were given emergency use authorization- the vaccine companies conducting the trial decided to break protocol and notify the control group they were not vaccinated. Almost all the control group were then given the vaccine. Purposefully dissolving the placebo group violates the scientific purpose to test whether the vaccine has any efficacy; any actual benefit and/or safety issues. Without a control group there is nothing to compare the vaccinated group against. According to NPR, the doctors lost the control group in the Johnson County Clinicial Trial (Lexena, Kansas) on purpose: “(Via NPR) […] “Dr. Carlos Fierro, who runs the study there, says every participant was called back after the Food and Drug Administration authorized the vaccine. “During that visit we discussed the options, which included staying in the study without the vaccine,” he says, “and amazingly there were people — a couple of people — who chose that.” He suspects those individuals got spooked by rumors about the vaccine. But everybody else who had the placebo shot went ahead and got the actual vaccine. So now Fierro has essentially no comparison group left for the ongoing study. “It’s a loss from a scientific standpoint, but given the circumstances I think it’s the right thing to do,” he says. People signing up for these studies were not promised special treatment, but once the FDA authorized the vaccines, their developers decided to offer the shots. Just so we are clear, the final FDA authorization and approval for the vaccines are based on the outcome of these trials. As noted in the example above, the control group was intentionally lost under the auspices of “the right thing to do”, so there is no way for the efficacy, effectiveness or safety of the vaccine itself to be measured. There’s no one left within the control group, of a statistically valid value, to give an adequate comparison of outcomes for vaxxed -vs- non-vaxxed. This is nuts. That NPR article is one to bookmark when people start claiming the vaccination is effective. How can the vaccine not be considered effective when there is no group of non-vaccinated people to compare the results to? Good grief, the entire healthcare system is operating on a massive hive mindset where science, and the scientific method, is thrown out the window in favor of ideological outcomes and self-fulfilling prophecies. The fact that the researchers and doctors, apparently under the payroll of the pharmaceutical companies that have a vested financial interest in the vaccine outcome, lost the control group on purpose is alarming. Of course, Big Pharma will promote the vaccine as beneficial, and the controlled media will promote that message with a complete disconnect from the clinical trial details, and the FDA will grant approval on results that were intentionally constructed to produce only one outcome.\n\nAnother video on informed consent is way below. Also from Canada.\n• Everything You Need to Know About Informed Consent (21CW)\n\n“Vaccine A is quite safe, and vaccine B is extremely dangerous. And yet the formula for PRR will produce the same result for vaccine A and B!”\n\nThere are several systems for reporting vaccine reactions, including deaths, but the only one available to the public is VAERS. It is incomplete, because it relies on voluntary reporting, there is no incentive to report to VAERS, and it is a cumbersome process. We may compare reports of the COVID vaccines to past years, when there were also hundreds of millions of vaccinations, including annual flu shots and childhood vaccine schedules. The comparison is dramatic. There were more than twice as many deaths related to the COVID vaccines this year as the sum total of all vaccine deaths in the 30-year history of VAERS. Given this safety record, how is there any possibility of approval? Here is where the statistical fraud comes in. [I am grateful to have been alerted to this situation by Matthew Crawford] The safety criterion they have chosen is an obscure computation called PRR for Proportional Reporting Ratio. As the name implies, it is based on RATIOS of different event types and is utterly blind to the ABSOLUTE RATE of such events. PRR measures the distribution of different kinds of adverse events, e.g. blood clots, heart attacks, and deaths. If those ratios are severely out of line with the great variety of vaccine reactions in the past, PRR would detect that. For example, if the new vaccines caused an extraordinary risk of myocarditis, but everything else was low, then PRR would flag that. But if myocarditis was just one risk among many that have been reported from past vaccines, then PRR would not pick that up. The real scandal is that PRR is blind to the absolute risk numbers. PRR is defined in such a way as to look for unusual PATTERNS of adverse events, but it is completely insensitive to unusual RATES of adverse events. Of course, it is the rates and not the patterns that are of primary concern, and the PRR is designed NOT to reflect that. For example, suppose we have 2 vaccines: Vaccine A has 1 reported death per million vaccinations, 3 reported heart attacks per million, and 20 reported headaches per million. Vaccine B has 1 reported death per hundred vaccinations, 3 reported heart attacks per hundred, and 20 reported headaches per hundred. Vaccine A is quite safe, and vaccine B is extremely dangerous. And yet the formula for PRR will produce the same result for vaccine A and B! Clearly, PRR is not an appropriate criterion for evaluating safety of any particular vaccine. Someone has arranged to cook the books.\n\n“Regardless of the anti-science, despicable pieces regularly appearing in those outlets, such as suggesting that actually, masking kids is good for their learning ability.”\n• The More Masks Fail, The More We Need Them (Ian)\n\nOne third has said they won’t comply. Maybe this is where the real fight will happen.\n• Pentagon To Mandate Covid-19 Vaccinations For All Military Personnel (RT)\n\nNo clue how serious this is, but it’s a good idea.\n• Truckers Threaten To Shut Down Australia Due to Covid Insanity (OI)\n\n“The same progressives who regularly denounce “systemic racism” and “Western imperialism” are now enforcing policies that disproportionately punish minorities and the poor..”\n\nThroughout the pandemic, American political and public-health leaders have been following Rahm Emanuel’s classic dictum for power-seeking officials: “You never want a serious crisis to go to waste.” Now they’ve adopted a corollary: you never want a crisis to end. So they are prolonging the national misery instead of easing it, which could be done with a few simple strategies. Explain to the public that the virus will never disappear but is no longer a mortal threat to the vast majority of Americans. Encourage the minority still at risk to get vaccinated by honestly discussing who is in jeopardy and what scientists have learned about infections. Promote treatments proven to prevent infection and speed recovery while avoiding unproven treatments and mandates that cause collateral damage and generate mistrust. Above all, make it clear to Americans that we finally have reason to celebrate: what once seemed an unprecedented danger is now just one of many pathogens that we know how to live with. But the nation’s crisismongers aren’t about to relinquish their hold over the public, so they’ve set new goals that are as unachievable as they are unnecessary and harmful. Making vaccines available to every American adult is no longer sufficient; now the crisis cannot end until the entire population has been vaccinated. Instead of focusing efforts on vaccinating the vulnerable, officials obsess on compelling universal obedience, even if that means squandering vaccines on people who already have acquired natural immunity or are at minimal risk of serious illness. The same progressives who regularly denounce “systemic racism” and “Western imperialism” are now enforcing policies that disproportionately punish minorities and the poor, both in the United States (the majority of black teenagers and young adults in New York have been banished from much of public life by the city’s new vaccine-passport policy) and in the rest of the world. The hypocrisy was deftly captured in a tweet by Martin Kulldorff, the Harvard epidemiologist: “If you favor university vaccine mandates for low-risk American and European students, when there is not enough vaccine for older high-risk people in Asia, Africa and Latin America, please remove your #BLM tags from your Twitter/Facebook profiles.” Children are being sentenced to another round of unnecessary mask mandates and probably more school closures based on evidence-free warnings from Anthony Fauci and others that the Delta variant will be more deadly to them than the original virus. While the variant is more infectious, the evidence does not show it to be any more lethal. In fact, the current mortality rate among American children with Covid is lower than it was last year—and last year many more children died of the flu than of Covid. One of the most thorough studies, in England, shows that the survival rate for those under 18 with Covid is 99.995 percent. But instead of emphasizing these reassuring statistics, public-health officials like Jerome Adams, the surgeon general, keep looking for new ways to scare parents and children. “I’m an anesthesiologist,” he tweeted last weekend. “And a dad. And I can assure you in both capacities that your child will be far more comfortable if they’re in a face mask, than on a ventilator. If you’re making a choice on behalf of a child, please choose based on their comfort, vs yours.” He offered no new evidence that children are at heightened risk from the virus, much less any evidence that a mask would make any difference, but he did make sure to include a gruesome photograph of a child on a ventilator. It was a new low in public-health demagoguery, but unfortunately not so different from the fearmongering of other officials, the press, and social-media platforms. They lament that a minority of the public remains reluctant to get vaccinated without recognizing that their own tactics are a likely a chief cause of this reluctance. They have been misleading people for so long—and censoring challenges to their misinformation—that it’s no wonder polls show that an overwhelming majority of unvaccinated Americans say they don’t trust Fauci or the CDC.\n\n“Britain and France managed to get their nationals out last week, only to be rebuked by American brass for “making us look bad.” That helped, I’m sure.”\n\nNotice, there are two sets of hostages in this phase of what looks like an engineered US collapse: the thousands of stranded Americans who can’t get out of Afghanistan thanks to the history-rockin’ ineptitude of “Joe Biden,” Tony Blinken, and General Mark Milley, and the millions of We-the-People back home whose minds are hostage to the narratives concocted in a shadowland of sinister governance. Welcome to a week of throwdowns and showdowns, a force majeure of mind change. A strange paralysis in the Pentagon has prevented the use of US power to clear an escape corridor to Kabul’s airport and establish order in the facility — this, after the tactically mystifying decision to abandon the US Bagram military airfield, a good twenty miles outside of festering Kabul, and surrounded by more easily-securable empty desert. Britain and France managed to get their nationals out last week, only to be rebuked by American brass for “making us look bad.” That helped, I’m sure. And then how long can the stranded Americans even stay hidden and alive? They have to eat. Either they come out of their hidey-holes and get to some market, or they would (theoretically) have to send some Afghani servants to fetch them supplies, But, what Afghani in his right mind would want to be caught in service to the Americans by the Taliban? That quandary must have a pretty short time-horizon on it. Standing by to see how it works out…. Next in this week’s throwdown parade is the FDA’s imminent approval of Pfizer’s Covid-19 vaccine, without any of the usual extensive trials. How does that even happen, with an efficacy rate of 39 percent maximum and a runaway train of vicious side effects ranging from brain and heart damage to infertility? The so-called mRNA “vaccines” are also implicated in the ongoing mutation of the disease, producing a cavalcade of variants. Is that, perhaps, on-purpose, to keep the pandemic going, preventing it from burning-out?\n\nWe try to run the Automatic Earth on donations. Since ad revenue has collapsed, you are now not just a reader, but an integral part of the process that builds this site. Thank you for your support.\n\nSupport the Automatic Earth in virustime. Click at the top of the sidebars to donate with Paypal and Patreon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Debt Rattle August 24 2021 - The Automatic Earth", "description": "Support the Automatic Earth in virustime; donate with Paypal and Patreon.", "url": "https://www.theautomaticearth.com/2021/08/debt-rattle-august-24-2021/", "site_name": "The Automatic Earth", "article:published_time": "2021-08-24T09:31:35+00:00", "article:modified_time": "2021-08-24T09:31:43+00:00", "image": "https://theautomaticearth.com/wp-content/uploads/2018/08/George_Caleb_BinghamThe_Verdict_of_the_People1854.jpg"}, "tags": ["informed consent", "masks", "FDA", "mandate", "full approval", "Pfizer", "BMJ", "fully vaccinated", "military"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Best VIDEO of 2020 <a href=\"https://t.co/y3iK1ZoBFM\">pic.twitter.com/y3iK1ZoBFM</a></p>\n<p>— Nicolas Teterel ∞/21 (@CryptojournalFr) <a href=\"https://twitter.com/CryptojournalFr/status/1428252019010285572?ref_src=twsrc%5Etfw\">August 19, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Excellent points by Canadian criminal defence lawyer, Nicholas Wansbutter, arguing vaccine passports would be anti-consent, and that the case law makes clear it is an assault.<a href=\"https://t.co/NUmAx8VPId\">https://t.co/NUmAx8VPId</a> <a href=\"https://t.co/0gWbzLuC46\">pic.twitter.com/0gWbzLuC46</a></p>\n<p>— Eva Karene Bartlett (@EvaKBartlett) <a href=\"https://twitter.com/EvaKBartlett/status/1429785630674989062?ref_src=twsrc%5Etfw\">August 23, 2021</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sR-NYrYyEls\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/sR-NYrYyEls"}], "links": ["https://en.wikipedia.org/wiki/The_Verdict_of_the_People", "https://eu.statesmanjournal.com/story/news/health/2021/08/23/pfizer-covid-vaccine-fda-full-approval/5543473001/", "https://blogs.bmj.com/bmj/2021/08/23/does-the-fda-think-these-data-justify-the-first-full-approval-of-a-covid-19-vaccine/", "https://childrenshealthdefense.org/defender/vaccinated-healthcare-workers-threat-unvaccinated-patients-co-workers/", "https://market-ticker.org/akcs-www?post=243355", "https://theconservativetreehouse.com/blog/2021/08/23/with-pfizer-likely-to-get-fda-approval-monday-its-worth-remembering-pfizer-and-moderna-lost-the-clinical-trial-control-group-testing-vaccine-efficacy-and-safety/", "https://21stcenturywire.com/2021/08/23/video-everything-you-need-to-know-about-informed-consent-its-your-right/", "https://joshmitteldorf.scienceblog.com/2021/08/22/statistical-fraud-in-the-fda-vaccine-approval-process/", "https://ianmsc.substack.com/p/the-more-masks-fail-the-more-we-need", "https://www.rt.com/usa/532849-pentagon-military-covid-vaccine-mandatory/", "https://www.zerohedge.com/political/nyc-orders-150000-teachers-school-staff-either-get-vaccinated-or-find-new-job", "https://www.opindia.com/2021/08/truckers-threaten-to-shut-down-australia-as-country-falls-to-covid-insanity/", "https://www.city-journal.org/will-policymakers-let-the-covid-crisis-end", "https://kunstler.com/clusterfuck-nation/throwdowns-and-showdowns/", "https://eu.statesmanjournal.com/story/news/health/2021/08/23/pfizer-covid-vaccine-fda-full-approval/5543473001/", "https://eu.statesmanjournal.com/story/news/health/2021/08/23/pfizer-covid-vaccine-fda-full-approval/5543473001/", "https://blogs.bmj.com/bmj/2021/08/23/does-the-fda-think-these-data-justify-the-first-full-approval-of-a-covid-19-vaccine/", "https://blogs.bmj.com/bmj/2021/08/23/does-the-fda-think-these-data-justify-the-first-full-approval-of-a-covid-19-vaccine/", "https://childrenshealthdefense.org/defender/vaccinated-healthcare-workers-threat-unvaccinated-patients-co-workers/", "https://childrenshealthdefense.org/defender/vaccinated-healthcare-workers-threat-unvaccinated-patients-co-workers/", "https://market-ticker.org/akcs-www?post=243355", "https://market-ticker.org/akcs-www?post=243355", "https://theconservativetreehouse.com/blog/2021/08/23/with-pfizer-likely-to-get-fda-approval-monday-its-worth-remembering-pfizer-and-moderna-lost-the-clinical-trial-control-group-testing-vaccine-efficacy-and-safety/", "https://theconservativetreehouse.com/blog/2021/08/23/with-pfizer-likely-to-get-fda-approval-monday-its-worth-remembering-pfizer-and-moderna-lost-the-clinical-trial-control-group-testing-vaccine-efficacy-and-safety/", "https://21stcenturywire.com/2021/08/23/video-everything-you-need-to-know-about-informed-consent-its-your-right/", "https://21stcenturywire.com/2021/08/23/video-everything-you-need-to-know-about-informed-consent-its-your-right/", "https://joshmitteldorf.scienceblog.com/2021/08/22/statistical-fraud-in-the-fda-vaccine-approval-process/", "https://joshmitteldorf.scienceblog.com/2021/08/22/statistical-fraud-in-the-fda-vaccine-approval-process/", "https://ianmsc.substack.com/p/the-more-masks-fail-the-more-we-need", "https://t.co/y3iK1ZoBFM", "https://twitter.com/CryptojournalFr/status/1428252019010285572?ref_src=twsrc%5Etfw", "https://ianmsc.substack.com/p/the-more-masks-fail-the-more-we-need", "https://www.rt.com/usa/532849-pentagon-military-covid-vaccine-mandatory/", "https://www.rt.com/usa/532849-pentagon-military-covid-vaccine-mandatory/", "https://www.zerohedge.com/political/nyc-orders-150000-teachers-school-staff-either-get-vaccinated-or-find-new-job", "https://www.zerohedge.com/political/nyc-orders-150000-teachers-school-staff-either-get-vaccinated-or-find-new-job", "https://www.opindia.com/2021/08/truckers-threaten-to-shut-down-australia-as-country-falls-to-covid-insanity/", "https://www.opindia.com/2021/08/truckers-threaten-to-shut-down-australia-as-country-falls-to-covid-insanity/", "https://www.city-journal.org/will-policymakers-let-the-covid-crisis-end", "https://www.city-journal.org/will-policymakers-let-the-covid-crisis-end", "https://kunstler.com/clusterfuck-nation/throwdowns-and-showdowns/", "https://kunstler.com/clusterfuck-nation/throwdowns-and-showdowns/", "https://t.co/NUmAx8VPId", "https://t.co/0gWbzLuC46", "https://twitter.com/EvaKBartlett/status/1429785630674989062?ref_src=twsrc%5Etfw", "https://www.patreon.com/AutomaticEarth"], "authors": [], "publish_date": "2021-08-24T09:31:35+00:00"}