{"result_id": "286043", "URL": "https://thecommonsenseshow.com/conspiracy-economics-health/dr-judy-mikovits-sounds-alarm-exploding-cancer-rates-courtesy-covid-vaccines", "timestamp": "2023-04-25 17:17:22 CEST+0200", "meta": {"description": "Dr. Judy Mikovits sounds the alarm on EXPLODING cancer rates courtesy of COVID vaccines", "lang": "en", "keywords": "pharmaceutical fraud, poison, spike protein, Stew Peters, vaccine damage, vaccine injury, vaccines, deception, glyphosate, Judy Mikovits, pandemic,,biological weapon, cancer causes, ,cancer criminals, covid-19, Dangerous Medicine, ,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/conspiracy-economics-health/dr-judy-mikovits-sounds-alarm-exploding-cancer-rates-courtesy-covid-vaccines", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "Dr. Judy Mikovits sounds the alarm on EXPLODING cancer rates courtesy of COVID vaccines | The Common Sense Show", "cleaned_text": "Dr. Judy Mikovits warned that cancer rates have been on a rapid rise since the Wuhan coronavirus (COVID-19) vaccines were rolled out. The elites, however, are blaming this increase in cancers on other things, such as climate change.\n\nMikovits told Stew Peters of “The Stew Peters Show” how the elites are using “climate change” as a code word for glyphosate poisoning. Glyphosate, a chemical known as a carcinogenic weed killer, also happens to be an ingredient in mRNA COVID-19 vaccines.\n\n“Glyphosate, combined with all the shots, have not only been driving cancer rates in the last year – but had been driving [up] cancer rates literally, since all liabilities were removed in 1986,” Mikovits said. “We’ve been able to tie the unsafe, untested vaccines to the explosion of cancer for the last decade and a half.” (Related: Health Ranger Report: Cancer cases up by 1000% since COVID-19 vaccine rollout, Jonathan Landsman tells Mike Adams.)\n\nMikovits noted that one in every 482 people injected with the COVID-19 vaccine dies within a month, which highlighted warnings of the vaccines being bioweapons designed to alter people’s DNA and drive up cancer rates in the population. Given this, she emphasized that the COVID-19 vaccination is literally injecting cancer-causing protein, which triggers the synthesis of cancer cells.\n\nShe also recounted to Peters how she testified in the Office of Special Masters of the U.S. Court of Federal Claims, also known as the “Vaccine Court,” as an expert witness alongside a colleague. According to Mikovits, young women in the military are developing breast cancer at only 21 years old. This cancer could be associated with the many different mandatory vaccines military members get – often at young ages.\n\nAccording to the researcher and author, the National Childhood Vaccine Injury Act of 1986 created a federal no-fault system for vaccine-related injuries or death as a way to ensure a stable market supply of vaccines and provide cost-effective arbitration for vaccine injury claims. The law states that no vaccine manufacturer shall be “liable in a civil action for damages arising from a vaccine-related injury or death resulting from unavoidable side effects or solely due to the manufacturer’s failure to provide direct warnings.”\n\nPeters, however, mentioned that the COVID-19 vaccine has done more harm than good ever since its introduction.\n\n“There’s never in the history of our country that I can remember anyways where there’s been a push for a shot like there is for this one,” he said. “So it shouldn’t surprise anybody that the cancer rates are exploding.”\n\nMikovits: The time for health restoration is now\n\nMikovits thinks those injected with the COVID-19 shot can still restore their bodies to their previous health.\n\n“We can fix it from the beginning because that’s what we did with it,” she said. “We’ve got to stop injecting and start treating our innate immune system, get the poison out of our environment and restore our natural God-given innate immunity.”\n\nShe also pointed out that the injections have always been poisoned, and the most susceptible can die of cancer. However, she pointed out that if people stop getting vaccinated, they can heal naturally.\n\n“Ivermectin alone can stop the cancer caused by the shot,” Mikovits remarked, explaining that they have done it in several cases. Moreover, PET scans post-ivermectin treatment have shown no more cancerous activity.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://glyphosate.news/", "https://naturalnews.com/2022-09-14-cancer-cases-skyrocketed-since-covid-vaccine-rollout.html", "https://www.brighteon.tv/", "https://www.congress.gov/bill/99th-congress/house-bill/5546"], "authors": [], "publish_date": null}