{"result_id": "286007", "URL": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/biggest-crime-committed-during-vaccine-heist-censorship-ivermectin", "timestamp": "2023-04-25 17:16:58 CEST+0200", "meta": {"description": "The biggest crime committed during the vaccine heist is the censorship of Ivermectin", "lang": "en", "keywords": "medical censorship, Suppressed, vaccine, WHO, Censorship, conspiracy, covid19,, deception, disinfo, ivermectin, lies,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/biggest-crime-committed-during-vaccine-heist-censorship-ivermectin", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "The biggest crime committed during the vaccine heist is the censorship of Ivermectin | The Common Sense Show", "cleaned_text": "While the list of crimes committed by authorities during the COVID-19 pandemic is a long one, perhaps the biggest crime of all is the purposeful suppression of safe and effective treatments. At this point, it seems quite clear that this was done to protect the COVID jab rollout.\n\nThe COVID shots were brought to market under emergency use authorization (EUA), which can only be obtained if there are no other alternatives available. In a sane world, the COVID gene therapies would never have gotten an EUA, as there are several safe and effective treatment options available.\n\nOne treatment that stands out above the others is ivermectin, a decades-old antiparasitic drug that is on the World Health Organization’s list of essential medications.\n\nWhat makes ivermectin particularly useful in COVID-19 is the fact that it works both in the initial viral phase of the illness, when antivirals are required, as well as the inflammatory stage, when the viral load drops off and anti-inflammatories become necessary. It’s been shown to significantly inhibit SARS-CoV-2 replication in vitro,1 speed up viral clearance and dramatically reduce the risk of death.\n\nDr. Tess Lawrie, a medical doctor, Ph.D., researcher and director of Evidence-Based Medicine Consultancy Ltd (video above).2 in the U.K., has been trying to get the word out about ivermectin. To that end, she helped organize the British Ivermectin Recommendation Development (BIRD) panel3 and the International Ivermectin for COVID Conference,4 which was held online, April 24, 2021.\n\nTwelve medical experts5 from around the world shared their knowledge during this conference, reviewing mechanism of action, protocols for prevention and treatment, including so-called long-hauler syndrome, research findings and real world data. All of the lectures, which were recorded via Zoom, can be viewed on Bird-Group.org.6\n\nLawrie has published several systematic reviews and meta-analyses of studies looking at ivermectin for the prevention and treatment of COVID-19 infection. A rapid review performed on behalf of the Front Line COVID-19 Critical Care Alliance (FLCCC) in the U.S., January 3, 2021, found the drug “probably reduces deaths by an average 83% compared to no ivermectin treatment.”7\n\nHer February 2021 meta-analysis, which included 13 studies, found a 68% reduction in deaths. This is an underestimation of the beneficial effect, because one of the studies included used hydroxychloroquine (HCQ) in the control arm. Since HCQ is an active treatment that has also been shown to have a positive impact on outcomes, it’s not surprising that this particular study did not rate ivermectin as better than the control treatment (which was HCQ).\n\nTwo months later, March 31, 2021, Lawrie published an updated analysis that included two additional randomized controlled trials. This time, the mortality reduction was 62%. When four studies with high risk of bias were removed during a subsequent sensitivity analysis, they ended up with a 72% reduction in deaths.\n\nLawrie reviewed the February and March analyses and other meta-analyses in an interview with Dr. John Campbell, featured in “More Good News on Ivermectin.” Lawrie has now published her third systematic review. According to this paper, published June 17, 2021 in the American Journal of Therapeutics:8\n\nDespite the fact that most of the evidence favors ivermectin, when the WHO finally updated its guidance on ivermectin at the end of March 2021,9,10 they largely rejected it, saying more data are needed. They only recommend it for patients who are enrolled in a clinical trial.\n\nYet, they based their negative recommendation on a review that included just five studies, which still ended up showing a 72% reduction in deaths. What’s more, in the WHO’s summary of findings, they suddenly include data from seven studies, which combined show an 81% reduction in deaths. The confidence interval is also surprisingly high, with a 64% reduction in deaths on the low end, and 91% on the high end.\n\nEven more remarkable, their absolute effect estimate for standard of care is 70 deaths per 1,000, compared to just 14 deaths per 1,000 when treating with ivermectin. That’s a reduction in deaths of 56 per 1,000 when using the drug. The confidence interval is between 44 and 63 fewer deaths per 1,000.\n\nDespite that, the WHO refuses to recommend this drug for COVID-19. Rabindra Abeyasinghe, a WHO representative to the Philippines, commented that using ivermectin without “strong” evidence is “harmful” because it can give “false confidence” to the public.11\n\nWhy Ivermectin Has Been Censored\n\nIf you’ve been trying to share the good news about ivermectin, you’re undoubtedly noticed that doing so is incredibly difficult. Many social media companies are banning such posts outright.\n\nPromoting ivermectin on YouTube, or even discussing benefits cited in published research, violates the platform’s posting policies. DarkHorse podcast host Bret Weinstein, Ph.D., is but one of the victims of this censorship policy.\n\nHis interviews with medical and scientific experts such as Dr. Pierre Kory, a lung and ICU specialist, former professor of medicine at St. Luke’s Aurora Medical Center in Milwaukee, Wisconsin, and the president and chief medical officer12 of the FLCCC, and Dr. Robert Malone, the inventor of the mRNA and DNA vaccine core platform technology,13 have been deleted from the platform. The interview with Malone had more than 587,330 views by the time it was wiped from YouTube.14\n\nTo read the rest of the story click this link: Articles.Mercola.com", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://articles.mercola.com/sites/articles/archive/2021/06/30/ivermectin-covid-19-treatment.aspx?v=1626217773", "https://articles.mercola.com/sites/articles/archive/2021/06/24/use-of-ivermectin-for-covid-19.aspx", "https://articles.mercola.com/sites/articles/archive/2020/06/12/antiparasitic-medication-offers-hope-for-covid-19.aspx", "https://articles.mercola.com/sites/articles/archive/2020/07/15/hydroxychloroquine-for-coronavirus.aspx", "https://articles.mercola.com/sites/articles/archive/2021/05/21/ivermectin-for-covid-19.aspx", "https://articles.mercola.com/sites/articles/archive/2021/06/16/ivermectin-for-covid-19-infection.aspx", "https://articles.mercola.com/sites/articles/archive/2021/06/21/mrna-inventor-interviewed-about-injection-dangers.aspx", "https://articles.mercola.com/sites/articles/archive/2021/06/30/ivermectin-covid-19-treatment.aspx?v=1626217773"], "authors": [], "publish_date": null}