{"result_id": "286015", "URL": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/insider-medical-source-reveals-fauci-and-chicoms-have-introduced-new-form-aids-public", "timestamp": "2023-04-25 17:17:04 CEST+0200", "meta": {"description": "Insider Researcher Reveals That Fauci and the CHICOMS Have Introduced a New Form of AIDS to the Public", "lang": "en", "keywords": "fauci, aids, china, genocide, depopulation, , ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/insider-medical-source-reveals-fauci-and-chicoms-have-introduced-new-form-aids-public", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "Insider Medical Source Reveals That Fauci and the CHICOMS Have Introduced a New Form of AIDS to the Public | The Common Sense Show", "cleaned_text": "As many have suspected for quite some times, the release of the corona virus was deliberate and came with a distinct and clear poliical purpose. Some of the agenda will be revealed in the summary I will construct with a disease and immunology experty who has had enough of \"deadly science.\"\n\nI have been in contact with a medical researcher is highly competent in the area of infectious diseases and all related aspects of a virus. I will present the following as a quote from my source, however, the interview was telephonic and I took notes, therefore, in the interest of complete transparency, the following must be considred to be a summarization of what was presented to me as this anonymous source would not allow himself to be recorded. Admittedly, qualitative based research would suggest that this process of reporting a summarization of data might be considred to a little less accurate than an actual transcript or recording of the conversation I had with this aspect.\n\nDave, I have chosen you to communicate my concerns about the vaccines in use today related to the treatment of Covid. Based on your academic background related to research protocols, you will have the ability to comprehend what I am telling you as well as accurately report the content of our discussion. Dave, you were right on to get eyes on this phenomenon. It certainly appears that certain batches of the vaccines were created to be deadly, although mortality is a result of a process of immune system impairment, PRESUMABLY related to taking a tainted vaccine. First, there was the analysis from Karl Denninger that is now in print and I wholeheartedy agree with his conclusions. To his credit, his research originally set out to prove the opposite of his suspicion that the vaccine, or a portion of the vaccine was designed to impair immune system functioning in most people who are injected. As you know this is how good research begins with the establishment of a null hypothesis, it is the centerpiece of all research investigation. Please communicate the following to your audience: In an attempt to demonstrate research integrity, the researcher states the (null) hypothesis in the opposite direction than what is expected to be determined and this is what Karl Denniger set out to prove. In other words,Denniger did not have an agenda to disprove the medical integrity of the vaccine(s), he was merely following where the data led him.\n\nAs a confidential source, I am unwilling to self-identify because to do so at this time would be personally dangerous. The ramification of my revelation are earth-shattering. In my opinion, the administration has seized dictatorial control over the people by fundamentally negating civil liberties under the \"emergency\" guise of treating Covid, which is greatly exaggerated in the scope in which it is being presented to the public. Also, the vaccine industry as it relates to Covid, is a multi-billion dollar endeavor. Subsequently I am going to present to you, what I know and combined with literature that is already public so as to create a data trail of dependability. I have no financial motive for revealing the following.\n\n\"When we break down the best-fit hypothesis that is that causing the body to produce part of a pathogen when that part has pathological capacity (as we know is the case for the spike) cannot be controlled adequately through commercial manufacturing process at-scale.\" This is where a bad batch, so to speak, cannot be simply blamed on a faulty development process. This revelation gets to the heart of what I feel compelled to convey, namely, the development of the vaccine, that is killing its subjects in numbers above the expected laws of chance, is unquestionably intentional in its origin and design!\n\nThe following statement that is in full public view is unquestionably true: \"This means that no vector-based, irrespective of how (e.g. viral vector or mRNA), not-directly-infused coronavirus jab will ever have an acceptable safety profile because some lots will be \"hot\" and harm crazy percentages of those they're given to with no way to know in advance.\" The previous quote from Denniger is not in the language of a researcher, but the content is fundamentally accurate. The basic premise used here (ie to have the body produce the agent the immune system identifies rather than directly introduce it where you can control the quantity), is a failure.\" In other words, and to put into laymen's terms, the immune system, upon introduction of the disguised pathogen, causes the immune system to inadequately identify foreign invaders that must be contained and eliminated. Random chance would strongly suggest that some of the invading pathogens that can no longer be mitigated by the body's natural defense system, will eventually prove deadly. You have noted in your writings that the medical establishment has failed to adequately mention account for acquired immunity, through previous exposure to the pathogen. What I suspect here is what we know about AIDS. There is a vulnerability that may be applied to the findings of vaccine-related mortality. In other words, just like AIDS, the vaccine attacks the victim where they are weakest. The CDC can ignore the time-proven topic of acquired immunity because if enough people are injected with a rogue vaccine, the topic will be a moot point because everyone's immune system will be so compromised that acquired immunity would indeed cease to become a factor.\n\nThis brings in the historical research by Dr. Fauci.\n\nThe vaccine effect, at least in some cases, appears strongly to mimic an effect similar to what we originally found in AIDS. Generally, a person does not die of AIDS, they die of secondary effects directly caused by an impaired immune system, hence the name Acquired Immune Deficiency. What is frightening here is that Fauci worked on AIDs in the early days. As is being documented all across the internet, Fauci denied treatment to Gays at a time when it strongly appears that the negative effects of AIDS was being enhanced through what we have come to call \"gain of function\" research. What I have concluded and what is not unknown in scientific circles with personnel connected to the CDC, is that is strongly appears that the immune system impairment we are seeing following the covid injections mimics the acquired immune system deficiency we originally saw in AIDS. Let me cut to the chase Dave: An analysis of some of the vaccine material leads me, and others too intimdated to speak out, to conclude that some of the vaccines are designed to introduce a new and varied form of AIDs to the public. Because the effects of AIDS are latent and other intervening variables, unrelated to the vaccine, could contribute to mortality and not be a direct result of the vaccine. My common sense related to the research tells me that this process of induced mortality through a vaccine is deliberate, but because the effects are so latent and removed in time from the event of injection, there are many that will poke holes in my conclusions because of the possiblity of intervening variables which can randomly occur in the space between injection and mortality.\n\nThe \"tainted batch\" notion presented in our conversation begs one more question: Is the effect of mutating a vaccine to enhance an AIDs type of effect contagious, by touch, airborne, exchange of bodily fluids? I do not know the answer to this question, but I guarantee Fauci and his Chinese colleagues have already researched this aspect of this controversy.\n\nWhen you publish the summary of our conversation, it is my belief that others will come out as well.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}