{"result_id": "286035", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/mcdonalds-now-functioning-vaccine-propaganda-arm-cdc-meaning-government-has-recruited-junk-food", "timestamp": "2023-04-25 17:17:18 CEST+0200", "meta": {"description": "McDonald’s now functioning as vaccine propaganda arm of CDC, meaning the government has recruited a junk food giant to push “public health” propaganda", "lang": "en", "keywords": "vaccines, Biden, CDC, coronavirus, COVID, hesitant, HHS,, junk food, McCafe, McDelivery,, McDonald's, propaganda, stupid, vaccination,, Vaccine injuries, vaccine jihad, vaccine wars,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/mcdonalds-now-functioning-vaccine-propaganda-arm-cdc-meaning-government-has-recruited-junk-food", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "McDonald’s now functioning as vaccine propaganda arm of CDC, meaning the government has recruited a junk food giant to push “public health” propaganda | The Common Sense Show", "cleaned_text": "The McDonald’s fast-food chain has partnered up with the Biden regime to push overweight Americans who imbibe on Big Macs, McNuggets, and Diet Coke to go get their Wuhan coronavirus (Covid-19) injections as soon as possible.\n\nStarting in July, McCafé coffee cups will feature the Department of Health and Human Services’ (HHS) “We Can Do This” slogan alongside information about how Chinese Virus vaccination is necessary, according to the government, in order to “safely” reopen society.\n\nEmblazoned on every McDonald’s coffee cup will be a link to Vaccine.gov, where customers, many of whom have diabetes or are soon to get it, can learn more about China Joe’s efforts to plunge Wuhan Flu needles into every American’s arm by Independence Day.\n\nThis new Chinese Virus injection marketing campaign will also be featured on the seal stickers used to package “McDelivery” orders, meaning all McDonald’s customers will be blasted with the propaganda every time they eat there.\n\n“Getting vaccinated is easy,” announced Xavier Becerra, Beijing Biden’s secretary of HHS. “More than 150 million people have already gotten at least one dose of vaccine, and millions more are getting vaccinated every day.”\n\n“Thanks to McDonalds, people will now be able to get trusted information about vaccines when they grab a cup of coffee or order a meal. Ending this pandemic requires all of us working together to do our part, including encouraging our friends and family to get vaccinated. This effort will help more people make informed decisions about their health and learn about steps they can take to protect themselves and their communities.”\n\nLater this month, McDonald’s is also planning to push Wuhan coronavirus (Covid-19) “vaccines” on billboards in Times Square, which barely sees any traffic anymore ever since Andrew “Infanticide” Cuomo turned New York into a medical police state.\n\nThe push by McDonald’s and the Biden White House comes as vaccination rates for the Wuhan Flu are declining.\n\nIt would appear as though Hunter’s dad and his lackeys believe that the only people left who are refusing the injection are the type that eat at places like McDonald’s on the regular, which is certainly laughable.\n\nIt only makes sense that a fake president would push fake vaccines for an overhyped pandemic that ended a long time ago. Most Americans, it would seem know this, as only a small fraction of the country is lining up to get injected.\n\nThe government knows this as well, which is why it is attempting every trick in the book to get those messenger RNA (mRNA) chemicals into people’s bodies through any means possible, including by teaming up with McDonald’s to teach people about “health.”\n\nTo Read the rest go to this", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://newstarget.com/author/ethanh", "https://news.yahoo.com/mcdonald-introduces-redesigned-coffee-cups-165300266.html", "https://www.naturalnews.com/2021-02-18-andrew-cuomo-prosecuted-hiding-nursing-home-deaths.html", "https://www.msn.com/en-us/money/companies/mcdonald-e2-80-99s-white-house-partner-to-promote-coronavirus-vaccine/ar-BB1gC1Yi?ocid=uxbndlbing", "https://newstarget.com/2021-05-14-mcdonalds-functioning-as-vaccine-propaganda-arm-cdc.html"], "authors": [], "publish_date": null}