{"result_id": "286034", "URL": "https://thecommonsenseshow.com/activism-conspiracy-health/trump-trap-sprung-media-flips-sets-stage-blame-trump-widespread-vaccine-injuries-and-deaths", "timestamp": "2023-04-25 17:17:17 CEST+0200", "meta": {"description": "TRUMP TRAP SPRUNG: Media FLIPS, sets stage to blame Trump for widespread vaccine injuries and deaths", "lang": "en", "keywords": "vaccines, White House,, President Trump, Vaccine deaths, Vaccine injuries,, Operation Warp Speed, pandemic, Pfizer, ,CDC, COVID, FDA, Moderna,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-conspiracy-health/trump-trap-sprung-media-flips-sets-stage-blame-trump-widespread-vaccine-injuries-and-deaths", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "TRUMP TRAP SPRUNG: Media FLIPS, sets stage to blame Trump for widespread vaccine injuries and deaths | The Common Sense Show", "cleaned_text": "Once again, the independent media called this out well in advance, warning that President Trump was walking right into a trap by promoting covid vaccines and taking credit for rolling them out so quickly via .\n\nNow that hundreds of thousands of Americans are dead from the vaccines — with millions injured — the “Trump trap” is being sprung. Under the direction of the intelligence script writers, of course, the left-wing media is now reporting that Trump pressured the FDA into authorizing the deadly vaccines as part of a political ploy to win the 2020 election.\n\nPolitico and The Hill are both carrying the story that activates this pivot. The key section in The Hill’s reporting is:\n\nWhite House attempts to block the FDA from collecting additional safety data on the first coronavirus vaccine in an attempt to ensure that it could be authorized before the 2020 presidential election.\n\n“The Select Subcommittee’s findings that Trump White House officials deliberately and repeatedly sought to bend FDA’s scientific work on coronavirus treatments and vaccines to the White House’s political will are yet another example of how the prior Administration prioritized politics over public health,” Rep. James Clyburn (D-S.C.), the panel’s chair, said in a statement.\n\nFauci, Walensky, Birx and others will lay the blame at Trump’s feet\n\nWith Fauci resigning, the CDC’s Walensky begging for forgiveness for the agency’s mistakes, and Dr. Birx now publicly admitting they knew the vaccines wouldn’t stop covid infections, we are watching the stage being set for when they all point the finger at Trump and say, “He forced us to cut corners.”\n\nAll the Americans who have been injured or killed by covid vaccines are about to be laid at Trump’s feet, and Trump himself will be demonized as the scientifically inept politician who forced Pfizer, Moderna, the FDA and the CDC to rush a medical intervention into production that turned out to be deadly.\n\nThe entire corporate media, believe it or not, is about to start admitting these vaccines are killing people. And all the fingers will point at Trump.\n\nThey have finally found a way to separate Trump from his supporters\n\nInterestingly, this argument isn’t wrong, and it will gain traction among many conservatives and former Trump supporters. Trump did, indeed, push Operation Warp Speed and pressure agencies to cut corners. Trump promised a vaccine rollout on an insane, incomprehensible schedule that is simply irreconcilable with thorough quality standards and large-scale, long-term clinical testing. Clearly, Trump was promised by the vaccine industry that he would be credited for “saving America” in record time by rolling out these emergency use vaccines without proper testing, but that was all part of the trap. Sadly, Trump fell for it in his quest to secure an election victory in 2020 (which he actually won, but we know how it was stolen with ballot fraud and thousands of “mules”).\n\nInterestingly, the Democrats got hoodwinked too. When Trump was in the White House, most Democrats said they wouldn’t trust the vaccine because it was “Trump’s vaccine.” Joe Biden, Kamala Harris and many other prominent Dems are on the record saying they wouldn’t take the vaccine if Trump rushed it. But once the election was rigged and stolen, booting Trump out of power and installing Joe Biden as the Resident-In-Chief, the very same Dems who claimed they would never trust the Trump vaccine suddenly trusted the very same vaccine because Biden was now sitting in the Oval Office.\n\nIt seems stupid, yes, but that’s the way the oblivious masses process information (or fail to).\n\nAs Biden took office, the media flipped the script in early 2021, claiming the vaccine was the greatest medical intervention ever created, and everyone was pressured to take it. After all, Biden was in the White House, and Democrats quickly forgot that the vaccine was a Trump creation via Operation Warp Speed.\n\nVaccine uptake was very high among Democrats, with some blue cities reaching over 90% vaccination rates. Among the LGBT community, uptake was reportedly 95% or higher. Conservatives, meanwhile, were far more skeptical of the vaccine, and if it wasn’t for extreme coercion and threats of losing their jobs, many conservatives never would have taken the “clot shots” in the first place.\n\nFor the past year and a half, the media, government, Big Tech and educational institutions have all pushed the mRNA experimental medical injections as “safe and effective,” chiding anyone who dared to question their efficacy or safety profile. If you even questioned the vaccine, you were deplatformed from social media, disinvited to family gatherings and fired from your job. Vaccine obedience became something of a cult across America, with Democrats leading the way, claiming to be carrying the banner of “science!”\n\nBut in reality, they were pushing Trump’s Operation Warp Speed fiasco, which ended up injuring and killing millions of America, including huge numbers of Democrats.\n\nBy the third quarter of 2021, excess mortality in America had reached over 200% in certain age groups, via Group Life policies (source: SOA Research Institute report, January, 2022). (We have constructed this chart using data from the SOA report.)\n\nHi-res version of this graphic found at this link.\n\nTo put this into perspective, on any given normal day in America, around 7500 people die. If you have excess mortality of 100%, that would be an extra 7500 people dying . It’s the equivalent of two 9/11 disasters happening every single day.\n\nVarious insurance companies have, for the last year or so, been reporting excess mortality figures in the 20% to 40% range, but the SOA Research Institute aggregates data from many different insurance companies, and they are reporting excess mortality using figures like 217% or 208%. Notably, these aren’t deaths among the elderly, either. They’re deaths of people in their 20s, 30s and 40s.\n\nInvestment guru Ed Dowd detailed all this in an interview earlier this week with Alex Jones. (I was actually scheduled to host that segment and interview Dowd, but to my regret, I had an animal issue at the ranch and had to deal with that emergency instead. To my frustration, I still haven’t interviewed Dowd, yet I am determined to do so because I love talking with really smart people…)\n\nThis bombshell via Ed Dowd reveals that Trump’s vaccines are literally killing thousands of Americans every day in America. You can watch that interview here:\n\nConservatives are outraged at Trump for continuing to support mass vaccinations with depopulation bioweapons\n\nEven more astonishingly, as Democrats are coming to realize, this is something that Alex Jones, Mike Adams and many other people who voted for Trump also agree is happening. In other words, Democrats have finally found an issue that can separate Trump from his supporters: Vaccines.\n\nAll the Democrats have to do now is throw Moderna under the bus, start reporting vaccines are killing people, and lay the blame at Trump’s feet. Paint Trump as worse than Stalin or Hitler. Start covering all the mysterious deaths and increased mortality figures from the insurance industry.\n\nAfter all, they can’t hide the body bags forever. They might as well use the crisis to demonize Trump and the GOP in general.\n\nThe corporate media doesn’t even have to throw the entire vaccine industry out with the bath water, either. They can claim that all vaccines were safe and effective until Trump forced the industry to cut corners . Only the “Trump vaccine,” they will claim, is the dangerous one. And that’s not the fault of Pfizer, they will explain, because Pfizer was coerced into this by Trump who was trying to win the 2020 election. This is the narrative being unleashed right now.\n\nNotably, VAERS data actually support this narrative. The covid vaccines are most dangerous and deadly than all the other vaccines combined, through the entire history of the VAERS database. While it can’t be honestly stated that all the other vaccines are “safe” compared to covid vax shots, it can be truthfully stated that they are “safer.” (Relatively speaking.)\n\nTrump hangs up on anyone who brings up the subject of vaccines during a phone conversation\n\nI interviewed Pete Santilli last night. That interview is posted below. Santilli informed me that when close associates are on the phone with Donald Trump, if they bring up the issue of these vaccines, Trump hangs up on them. He doesn’t want to hear anything about the vaccines. He doesn’t want to talk about them at all, and certainly doesn’t want to consider his role in rushing them to market, resulting in the deaths (so far) of over 600,000 Americans, with millions injured.\n\nEven worse, as we have established through extensive laboratory analysis and research, these vaccines are growing “biostructures” — non-blood clots that clog the blood vessels and arteries, killing people over time.\n\nThese clots continue to self-assemble and increase in size with each passing week. This means that millions more Americans will likely die from these vaccines over the next decade, and there’s no known intervention that can reverse these clots. (Blood thinning, anti-clotting medications do nothing, because these aren’t blood clots.)\n\nThe corporate media is gearing up to blame Trump for each and every one of these deaths that take place over the next decade. “Died suddenly” will soon be replaced with, “Killed by Trump,” and unless he gets out in front of this in the next few weeks, Donald J. Trump will go down in history as the man who sacrificed millions of Americans to try to win an election by forcing the FDA to fast track a dangerous medical intervention that turned out to be a medical holocaust. The thalidomide fiasco will be tiny in comparison. That’s the narrative being unleashed right now. It started yesterday, in fact.\n\nAnother sign that things are rapidly shifting: Fox News and Sean Hannity are suddenly backing away from vaccines at a rapid pace. Hannity, one of the most prolific vaccine-pimping, pro-war journo-prostitutes in history, now claims he never told anyone to take the vaccines. Dan Bongino has publicly come out, admitting that taking the vaccine was the “greatest mistake of my life.” Tucker Carlson has been hammering away at the vaccine industry’s deceptions for weeks now (and doing a damn good job, notably), and the conservative movement has reached a tipping point where covid vaccines are finally seen as risky and ineffective. This is after two years of relentless pro-vaccine propaganda on Fox News, by the way.\n\nEmerald Robinson said it best in his Substack article, explaining, “The Vaccine Money Has Dried Up At Fox News! Sean Hannity now wants you to forget his role as America’s dumbest drug salesman.” From that article, which is especially poignant:\n\nIn case you missed it, the pro-vaccine frauds at Fox News are trying to pivot away from pushing the experimental Big Pharma shots day and night for two years…\n\nWatch Sean Hannity attempt to walk back his years-long role as America’s dumbest Pfizer salesman. Perhaps he can hear the lawsuits coming.\n\nHannity didn’t tell anyone to get vaccinated? Hannity told everyone to get vaccinated — and he told them practically every night for a year.\n\n“And it absolutely makes sense for many Americans to get vaccinated. I believe in science, I believe in the science of vaccination.” — Sean Hannity, July 2021\n\nWhy is Hannity trying to gaslight his own audience in 2022? He must know that bamboozling them about the shots will carry an enormous price tag — and it’s a bill that he’s not willing to pay.\n\nLet’s not forget: Hannity and the rest of the Big Pharma pimps at Fox News also relied on the very fat and very stupid Dr. Marc Siegel as their “medical expert” to push the shots in every time slot for the last two years.\n\nIndeed, all this makes me wonder about a bigger question. If Alex Jones can be sued and ordered to pay $45 to two parents of Sandy Hook children who claimed they suffered “emotional distress” because of Alex’s reporting about Sandy Hook, how many million Americans have suffered emotional distress because they were injured by vaccines promoted by Fox News and other media outlets? Will they now sue all the media players, claiming they were getting paid by Big Pharma to pump the deadly, dangerous “Trump vaccine?”\n\n…most corporate news outlets in America were paid by the Biden regime’s HHS to push the vaccines to their audiences without disclosing it — and that list includes Fox News.\n\nThat’s the largest and most comprehensive breach of journalistic ethics that has ever occurred. Almost every corporate media outlet took the money. Almost every corporate media outlet lied about the vaccines (knowingly or unknowingly). Almost every corporate media outlet refused to report anything negative about the vaccines — because they were paid to close their eyes.\n\nAlmost every corporate media outlet is implicated.\n\nTrump got played, and his supporters tried to warn him\n\nAlex Jones, by the way, has publicly admonished Trump for his role in this deadly vaccine fiasco, urging Trump to come forward with the truth about he was lied to be vaccine industry experts who promised rapid development of safe and effective vaccines (but actually delivered a depopulation bioweapon). For all those who think Trump plays 4-D chess and is always one move ahead of the enemy, in this case Trump got played by the depopulation globalists. Trump ended up endorsing and pushing a depopulation weapon that’s killing millions of people around the globe. It is one of the most successful globalist deceptions in history, and Trump walked right into it and still won’t recognize his role in the attempted extermination of humanity.\n\nYou are right now watching one of the most epic deceptions in the history of the world, and Big Pharma, the media, the CDC, FDA, Pfizer, Moderna and other players lined up Trump and played him like a fiddle. Now, having achieved the mass injection of well over 200 million Americans — and over 5 billion people worldwide — they can all claim, “We were coerced by Trump!” and point the finger at Orange Man Bad for the mass death and suffering that’s going to accelerate over the next decade.\n\nPeople like Alex Jones (and myself) publicly warned Trump about this multiple times. Once again, Alex Jones was right. But Trump refused to listen — and still refuses to listen — even while Ron DeSantis is fighting hard against Big Pharma’s attempted mass vaccination of children and toddlers, among other issues.\n\nTrump has positioned himself as Big Pharma’s front man while DeSantis is going to end up on the right side of all this as the truth about vaccine injuries goes mainstream (which has already begun).\n\nIn the mean time, independent researchers like myself, Dr. Jane Ruby, embalmers like Richard Hirschman and the German research group known as The Working Group for COVID Vaccine Analysis (see this outstanding Epoch Times article for details) are meticulously analyzing both the covid vaccines and the resulting deadly clots that grow inside people’s bodies, and we are going to nail the answers on all this well before the FDA, CDC, NIH or anybody from mainstream science does. It is independent, self-funded science, in other words, that will end up saving humanity, not government-funded science (which was never real science in the first place).\n\nTrump has a narrow window of opportunity to extricate himself from this trap and change history, but he seems paralyzed and strangely tied to Pfizer’s interests, unable to criticize the very same pharma company that donated millions to his January, 2017 inauguration ceremony.\n\nIf Trump doesn’t untie himself from pharma, he will be destroyed and forever remembered for his role in the Vaccine Holocaust.\n\nGet the full analysis in today’s Situation Update podcast here:", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://thehill.com/policy/healthcare/3614533-house-panel-details-trump-pressure-on-fda-for-discredited-covid-treatment-vaccines/", "https://www.brighteon.tv/", "https://vaccinedeaths.com/", "https://www.soa.org/48ff80/globalassets/assets/files/resources/research-report/2022/group-life-covid-19-mortality.pdf", "https://www.naturalnews.com/images/Group-Life-Insurance-Excess-Mortality-Figures-1280.jpg", "https://www.naturalnews.com/2022-08-17-elemental-analysis-results-released-vaccine-clot-composition-not-blood-clots.html", "https://emeralddb3.substack.com/p/the-vaccine-money-has-dried-up-at", "https://www.theepochtimes.com/mkt_app/unusual-toxic-components-found-in-covid-vaccines-without-exception-german-scientists_4673873.html?utm_source=andshare", "https://brighteon.com/0cc5974e-784b-4631-8fb8-8f1680a0bd82", "https://newstarget.com/2022-08-25-media-flips-sets-stage-to-blame-trump-for-vaccine-injuries-and-deaths.html"], "authors": [], "publish_date": null}