{"result_id": "286025", "URL": "https://thecommonsenseshow.com/conspiracy-economics-health/cdc-admits-natural-immunity-offers-better-protection-experimental-covid-jabs", "timestamp": "2023-04-25 17:17:10 CEST+0200", "meta": {"description": "CDC admits natural immunity offers better protection than experimental COVID jabs", "lang": "en", "keywords": ", truth, vaccine, vaccine wars, Big Pharma, CDC, covid-19, Fauci,, immune system, infections, natural immunity,, pandemic, pharmaceutical fraud, spike protein,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/conspiracy-economics-health/cdc-admits-natural-immunity-offers-better-protection-experimental-covid-jabs", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "CDC admits natural immunity offers better protection than experimental COVID jabs | The Common Sense Show", "cleaned_text": "Dr. Sanjay Gupta asked Fauci last week about an Israeli study showing natural immunity provides better protection against Covid variants than Covid vaccines.\n\n“What are people to make of that?” Gupta asked. “I get calls all the time, people say, ‘I’ve already had Covid, I’m protected.’ And now, this study says maybe even more protected than the vaccine alone. Should they also get the vaccine? How do you make the case to them?”\n\n“That’s a really good point Sanjay, I don’t have a really firm answer for you on that,” Fauci said, adding, “What the paper from Israel didn’t tell you is whether or not, as high as the protection is with natural infection, what’s the durability compared to the durability of a vaccine?”\n\nFauci’s statement is incorrect, as the Israeli study noted in its conclusion, “This study demonstrated that natural immunity confers longer-lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity.”\n\nIt appears as if the CDC is aware of natural immunity’s strong protection as well as the length of protection it provides.\n\nIn a tweet sent out Tuesday, the agency told vaccinated Americans to get tested for Covid if they have any symptoms or if they’ve been exposed to someone with Covid.\n\nHowever, in a second tweet added to the first, the agency noted that unvaccinated Americans who already beat Covid in the past three months don’t need to be tested if they’ve been exposed to someone carrying the virus.\n\nThe medical establishment has always known natural immunity provides stronger and longer-lasting protection against Covid while avoiding the possible adverse reactions that come with the experimental Covid shots.\n\nSadly, this data will continue to be manipulated and ignored in order for the elite to continue with their anti-human agenda.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\" frameborder=\"0\" src=\"https://www.youtube.com/embed/s0kneU_EUFY?feature=oembed\" title=\"Dr Fauci doesn't know how you make the case for vaccines over protection from natural immunity\"/>", "src": "https://www.youtube.com/embed/s0kneU_EUFY?feature=oembed"}], "links": ["https://www.infowars.com/posts/cdc-admits-natural-immunity-offers-better-protection-than-experimental-covid-jabs/", "https://www.infowars.com/posts/fauci-struggles-to-explain-why-people-with-natural-immunity-should-take-vax-i-dont-have-a-really-firm-answer-for-you-on-that/", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.infowars.com/posts/cdc-admits-natural-immunity-offers-better-protection-than-experimental-covid-jabs/"], "authors": [], "publish_date": null}