{"result_id": "286030", "URL": "https://thecommonsenseshow.com/conspiracy-economics-education/delta-variant-being-used-hide-real-casualty-numbers-covid-vaccine", "timestamp": "2023-04-25 17:17:13 CEST+0200", "meta": {"description": "The Delta Variant Is Being Used to Hide the Real Casualty Numbers of the Covid Vaccine", "lang": "en", "keywords": "covid, testing, pcr testing, fda, cdc, vaccine, dangerous, delta variant,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/conspiracy-economics-education/delta-variant-being-used-hide-real-casualty-numbers-covid-vaccine", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "The Delta Variant Is Being Used to Hide the Real Casualty Numbers of the Covid Vaccine | The Common Sense Show", "cleaned_text": "You are about to read a report which exposes the biggest fraud ever perpetrated upon the American people. There are no unnamed sources afraid to come out behind the shadows for fear of experiencing the loss of job or even the loss of life. The words of the CDC convict this massive CV-19 fraud perpetrated upon our once great nation.\n\nI recently interviewed a very courageous, honest, and CHRISTIAN attorney from Ohio. His name is Tom Renz. Like myself, Mr. Renz is a one-man-show. Yet, this almost self-deprecating and humble God’s servant is spearheading what may one day be considered the most important lawsuit in American history!\n\nTom Renz is risking life, limb and career to represent what has become known as the Frontline Doctors. TO LISTEN TO THIS GROUND-BREAKING INTERVIEW WITH TOM RENZ,\n\nThe chart, listed above from none other than the CDC makes the Frontline Doctors claim that no child should be vaccinated, ever!\n\nDuring the course of our interview, Mr. Renz and myself explored why the CDC would recommend treatment for a virtual non-event, medically speaking. On the journey of understanding the CDC’s rationale, from Mr. Renz, we both put forward the following:\n• None Mr. Renz and myself concur that the coronavirus is not natural. It is possible to trace the evolution of the virus and it will show the artificial manipulation of the virus into a bioweapon. I contend that the bioweapon was developed by the CHICOMS, in the Wuhan lab with the help of Democratic Party and Deep State operative, Anthony Fauci, in the manner described and revealed by Dr. Rand Paul in recent Congressional hearings. When we reduce these events to a lowest common denominator, the release of this bioweapon was, at least in part, designed to cause a change in how Americans vote. The major change was in the absentee ballots. Without these fraudulent ballots, Biden could never have generated enough fake votes to steal the election. Fauci, the CHICOMS, the Democratic Party and other unknown co-conspirators have the blood of millions of human beings on their hands. To say that Fauci is a modern-day Dr. Mengele, would be a gross understatement!\n• None From his investigation leading up to legal discovery, Mr. Renz has concluded that in order to greatly inflate the covid numbers, thus acting as a force-multiplier, the government paid health officials needed to use a test which would greatly exaggerate the number of positive covid diagnosis. Later in this article, the fraud behind covid testing will be reviewed from publications made by myself on the CSS in April/May of 2020. In short, the FDA did not require third party validation of the efficacy of the PCR test in 2020. The FDA used as the excuse to pardon the lack of scientific rigor in diagnosing covid-19, that there was not time to do validation given the emergency nature of the pandemic. The reason does not matter. If there is no test for validity, there is no test for covid. I have previously taught research and statistics at college, university and post-graduate level, and in none of my courses would a student have survived my midterm exam with this kind of shoddy, unscientific approach. Third party validation is the cornerstone of all medical testing. Why would these well-trained FDA professionals apply the scientific rigor of a third-grader? Read on, the answer will be obvious.\n• None Isn’t it interesting that the FDA just recently decertified the PCR test, a test that they never certified from a scientific point of view? What does this mean? This means that there has never been a test that could accurately identify and isolate covid-19. But wait, it gets worse. Nationally, the flu all but disappeared in 2020. Why? It has now been discovered that the PCR is so broad in the spectrum of its analysis, that any virus in the body would test positive for covid including the flu. And the federal government paid for this deceptive brand of voodoo science in order to instill fear in the public, in order gain widespread acceptance of the citizens to accept the abrogation of Constitutional rights in the name of fighting this imaginary pandemic. In order to perpetrate this fraud upon the public, the federal government paid for a questionable diagnosis of covid-19. To add insult to injury in the bastardization of the scientific process, the federal government furthered incentivized fraud by paying more for a covid-19 cause of death in final autopsy reports. Literally, people who have died from head trauma in a car accident, were determined to have died from covid-19 if the broad spectrum flawed testing revealed that covid-19 was in the deceased person’s system at the time of death.\n• None Why was this done? Both Mr. Renz and myself believe that this was done to pave the way for an untested and very dangerous vaccine that is killing people in great numbers.\n• None As we continue down the rabbit hole, Mr. Renz has discovered that most of the people dying today from the effects of the virus are fully vaccinated. Estimate range as high as 85%. Even in Israel, 85% of the viral deaths are people who were fully vaccinated.\n• None Enter the so-called Delta variant. First, please allow me to say that there is very likely a mutation that has arisen out of covid-19. However, almost all variants are more contagious, yet far less harmful in terms of lethality. THERE IS AN IMPORTANT QUESTION THAT BEGS TO BE ASKED: IF THERE IS PRESENTLY NO TEST TO DIAGNOSE COVID-19 AND ANY VARIANTS, GIVEN THE FDA’S DECERTIFICATION OF THE PCR TEST, HOW DOES THE CDC KNOW THAT THE SO-CALLED DELTA VARIANT IS SWEEPING THROUGH THE POPULATION AND IT POSES A GRAVE THREAT TO AMERICA? The answer that both Mr. Renz and myself would agree with is there is no readily available test to make such a diagnosis. Again, America is being put into a state of fear and panic so the public will accept lockdown 2.0. Mr. Renz and I both conclude that what we are seeing in hospital emergency rooms and hospitals, in general, is not primarily any Delta variant, it a severe reaction to the vaccine in the fully vaccinated.\n• None From my personal perspective, the reason for a second lockdown is necessary because the public is slowly awakening to the Marxist-Communist-based treachery of the Biden administration whose clear goal is to destroy the country in its present form. They need to maintain the post-pandemic means to steal an election because no citizen in their right mind would ever vote for their own self-destruction. Without free and valid elections, there is no America. A lockdowned nation will not force election reform and decertify criminal election practices. By the way, with pressure being applied by myself and others, the Maricopa County Election Audit has reversed course from State Senator Fann’s ineffective leadership and has issued new subpoenas to Dominion and the Maricopa County Board of Supervisors. In response, because we are now getting to closed to the truth, the twitter account of the audit team was just suspended in order to keep the public in the dark. This is exactly what Tom Renz and the Frontline Doctors are fighting against. The strategy of the Left is always the same. Vilify and censor the truth of those that would expose wrongdoing both in the lack of efficacy and safety in vaccines and the lack of integrity in the treatment for the greatly exaggerated covid19 where maximizing vaccine profits is the goal.\n\nAmerica, be not deceived by this imaginary Delta variant. We are primarily looking at vaccine side-effects and this is how it is being covered up.\n\nBefore closing, I want to expose the fraud of covid-19 testing that I exposed last year.\n\nWhether one is validating a treatment efficacy or providing a more \"reliable\" claim for diagnosis, one needs to establish the false positive rate in order to determine whether or not effective treatment or accurate diagnostics falls within acceptable limits. And of course, consistency is needed in the testing process and that is established through multiple studies in which consistent results are obtained. In health testing, a margin of error of less than 5% is acceptable. Anything greater than this calls into question the validity of the diagnostics.\n\nAt question in this report is the efficacy of the diagnostic procedures being utlized by federal and state health officials in determining the true infection rate in the United States which can be used as a guide to impose restrictions upon the people of this nation. Sometimes in investigative reporting, we can use the words of the investigated to convict them of wrongdoing. This is certainly the case here.\n\nFrom the in an April Statement from the Commissioner of Food and Drugs -Food and Drug Administration Stephen M. Hahn MD., in which the FDA admits that they have no intention of validating the testing numbers for COVID-19. Instead, the FDA admits that they will let the test developers validate their own testing reliability and validity.\n\nWhat the above paragraph is telling the reader is that the FDA has a history of not fully validating the accuracy of test kits before using them in the field and gathering data from these unvalidated tests in which policy decisions will be based! In laymen's terms, the FDA has been guilty of violating the standard tenets of science when it comes to validating tests for a long time. Practice makes perfect and this is why the FDA and its partner in crime, the CDC are so adept at fooling the public.\n\nHere is more damning self-statements from the same FDA report on test kits:\n\nSpecifically, last month (April 2020), as part of our broader strategy, the FDA issued a explaining that FDA does not intend to object when developers of serological tests market or use their tests without prior FDA review where: 1) the tests are validated by the developer to determine that they are accurate and reliable, 2) notification of the developer’s validation is provided to FDA, and 3) the tests are labeled appropriately, including that they are not to be used as a sole basis for diagnosis. Our policy does not apply to at-home specimen collection or at-home testing because of the added challenges in assuring test accuracy that these pose. The policy does apply to tests that can be performed in patient care settings. Laboratories could validate tests they receive from commercial manufacturers and determine if they should be used in their facilities. Some laboratories have already done so or have developed their own serological tests...\n\nTest results are not going to be determined by the FDA, but instead are going to be validated by the developer of the tests? The open invitation to fraud is obvious to anyone who has eyes to see. Then the FDA tries to beg themselves out of responsibility by saying the Labs can validate the test. Why should labs engage in a validating practice because testing for validation would happen AFTER the purchase of the test kits by the labs? In other words America, there is no oversight on determining whether these tests are measuring what they claim to measuring. This is like looking under the hood of the car AFTER you purchase it! And yet, these test numbers are reportedly daily in the mainstream media and provide governors and mayors with the ability to lockdown their jurisdictions as these despots violate the Constitutional rights of their citizens and the whole process of based on fake numbers!\n\nIn the face of this obvious cesspool of fraud, it is easy to conclude the following:\n\nThere is financial motive to increase the CV-19 rates as it will lead to the need for more testing and more profits for the manufacturer of the tests.\n• None Both the FDA and the CDC are well-known as being \"never-Trumpers\" and commonly operate outside the oversight of the President. These are largely Democratic Party affiliated institutions with major conflicts of interest which has been validated on multiplel sites resulting from multiple documents.\n• None By allowing a test that could very well be a hotbed for false positives, the fake numbers could be used as a phony excuse to continue to lockdown and ruin the nation's economy, thus weakening the nation for economic collapse and even military invasion since the country's ability to defend itself in the long-term would be greatly impacted.\n• None This policy in which numbers can be exaggerated for political gain is already in evidence in the practice of the CDC. The CDC announced that before a local community could progress to Phase One of the return to normalcy, the flu-like symptoms and the COVID-19 numbers must decrease from the information obtained from testing. The confabulation efforts on the part of the CDC is painfully apparent. The purpose for the fraud and using a testing kit that has not been validated for accuracy is also painfully obvious. California Governor Newsom has said the lockdown will stay in effect until the mandatory vaccines are ready. It is a well-established fact that the COVID-19 team has multiple conflicts of financial interest involving the Bill and Melinda Gates Foundation with the principal spokespeople for the COVID-19 group (eg Fauci and Birx).\n• None Arizona Governor, Doug Ducey is doing everything in his power to prolong his state's unconstitutional lockdown. Ducey sits on the Board of Directors for T-GEN which is partnering with the Gates people in the development a vaccine. A bad test, with multiple false positive will prove to be the impetus for not letting America out of its Big Pharma prison until the public accepts the mandatory vacccine. Further the testing kit fraud is consistent with CDC guidelines which allows doctors to engage in a totally unprofessional practice known as \"presumptive diagnosis\" in which the doctor simply presumes that the deceased expired because of COVID -19. This practice also inflates the numbers and provides local dictators the ability to win an election that they would be able to win without this greatly exaggerated crisis by making the public's lives miserable so they blame the existing President.\n\nThe next question that skeptics to my analysis will ask is whether of not there is any validation of widespread inaccuracy of the testing? I believe that the fraud in the United States could effectively be covered up by the CDC. However, the CDC does not control nation of Tanzania and its President and he tells a clear story of a totally imported test kit from abroad.\n\nMeanwhile, back to the CDC document:\n\nHere is my take on the situation and this is without a doubt the biggest fraud every perpetrated upon the United States\n\nThis final conclusion is obvious: Americans have sacrificed their country based on total fraud perpetrated by Fauci, Birx, the FDA and the CDC as well as the Democratic Party and its mainstream media allies. Not even the use of the original Trojan Horse can stand up to the great fraud in, not just American History, but in world history!!!\n\nRoll up your sleeves here comes the Mark of the Beast mandatory vaccines which will be required to buy, sell or trade!\n\nI stated all of this in May of 2020 and now it is coming into fruition unless enough of us stand in opposition to this tyranny and the medical martial law that will follow.\n\nMeanwhile, covid positive illegal immigrants are crossing into our border, without mitigation, while the officials responsible for this travesty, our communist dictators, are growing close to imposing mandatory and dangerous vaccines!\n\nPray and support Tom Renz, he is spearheading a movement that will shape the future of this country!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://traffic.megaphone.fm/REP9233583413.mp3", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-serological-test-validation-and-education-efforts", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/policy-coronavirus-disease-2019-tests-during-public-health-emergency-revised", "https://www.breitbart.com/national-security/2020/05/04/tanzania-president-says-faulty-imported-test-kit-claimed-goat-coronavirus/", "https://www.reuters.com/article/us-health-coronavirus-tanzania/president-questions-tanzania-coronavirus-kits-after-goat-test-idUSKBN22F0KF"], "authors": [], "publish_date": null}