{"result_id": "286036", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/putin-orders-destruction-all-covid-19-vaccines-russia", "timestamp": "2023-04-25 17:17:18 CEST+0200", "meta": {"description": "PUTIN ORDERS DESTRUCTION OF ALL COVID-19 VACCINES IN RUSSIA", "lang": "en", "keywords": "PUTIN, BANS COVID VACCINE, , ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/putin-orders-destruction-all-covid-19-vaccines-russia", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "PUTIN ORDERS DESTRUCTION OF ALL COVID-19 VACCINES IN RUSSIA | The Common Sense Show", "cleaned_text": "Although Putin has not made a formal announcement, he has tasked his right-hand man, Defense Minister Sergei Shoigu, with purging hospitals, clinics, and pharmacies of the Sputnik and CoviVac vaccine variants. The military will ensure compliance by auditing vaccine repositories and performing spot inspections.\n\nLike President Trump, Putin was deceived by a lie; a global consortium of devious doctors, health professionals, and government stooges spun a convincing yarn about a virus that would ravage the world unless vaccines were developed to inoculate the population as soon as possible. The WHO had infiltrated the Russian Ministry of Health and planted agents of evil within the Council of Ministers and State Duma, and Western propaganda—fables of people sick with Covid falling dead on the street—seeped through Russia's once secure borders. No nation was immune to the most elaborate disinformation campaign in the history of humanity.\n\nOn 2 December 2020, Russia launched its first mass vaccination experiment, beating other nations to the punch and delivering 6.9 million doses in the first week. As of 21 June 2022, 81.5 million people have received at least one dose, with 74.3 million fully vaccinated. In the West and Russia, vaccine recipients presented side effects such as cardiac ailments, seizures, and blood clots, with many dropping dead at home, at work, or in the streets.\n\n“The American CIA is brilliant. When harmless Covid spread, they made up stories of so many people dying to get us all to beg for the vaccine. Then when the vaccines came, we did start dying, and the governments can blame it on Covid, not vaccines. It was such a clever plot, the world believed it,” Zakharov said.\n\nIn December 2022, the Ministry of Health reported a dramatic, countrywide spike in HIV infections among persons who had received three or more Covid-19 vaccinations and did not fit the standard demographic—homosexuals and needle users. Between 2015-2019, Russia averaged 16,000 new infections per year. In 2022, that figure skyrocketed to 63,000 to include celibate, non-drug users.\n\nVladimir Putin, Zakharov said, arrived at the inescapable conclusion that vaccines could cause a person to develop HIV and AIDS. The evidence was unassailable; the more jabs a person got, the greater the odds of contracting HIV. Putin viewed the correlation as more than a simple coincidence—the vaccine was tailored to deliver Acquired Immune Deficiency Syndrome.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rumormillnews.com/cgi-bin/forum.cgi?read=218480"], "authors": [], "publish_date": null}