{"result_id": "286022", "URL": "https://thecommonsenseshow.com/activism-conspiracy-economics/usa-today-bestselling-author-jennifer-jaynes-who-penned-thrillers-exposing-murderous-vaccine-deep", "timestamp": "2023-04-25 17:17:09 CEST+0200", "meta": {"description": "By Mike Adams Newstarget.com   Jennifer Jaynes, USA Today bestselling author of Malice and other novels exposing the vaccine deep state, was found shot to death on Monday, November 25th, according to media reports (see links below).", "lang": "en", "keywords": "Jennifer Jaynes, Malice, Medical Tyranny, medical violence, murder, truth, vaccine industry, vaccines, ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-conspiracy-economics/usa-today-bestselling-author-jennifer-jaynes-who-penned-thrillers-exposing-murderous-vaccine-deep", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "USA Today bestselling author Jennifer Jaynes, who penned thrillers exposing the murderous vaccine deep state, found shot to death | The Common Sense Show", "cleaned_text": "Jennifer Jaynes, USA Today bestselling author of and other novels exposing the vaccine deep state, was found shot to death on Monday, November 25th, according to media reports (see links below).\n\nJaynes was a celebrated author whose books achieved USA Today bestseller status. Her novels showcased the criminality, child abuse and deep-rooted fraud of the vaccine industry.\n\nShe also wrote children’s books that focused on teaching children the importance of consuming nutritious foods. See her website, books, DVDs and more at www.JenniferJaynes.net\n\nHer most recent book, Malice, explores the medical ethics battle of a character named Dr. Daniel Winters, who tries to expose a dangerous vaccine that the medical establishment knows is harming and killing children. Her thriller is also available as an audio book on Audible.com. See four of her book titles at this link on GoodReads.com.\n\nJaynes was reportedly found with two gunshots to the head, according to AmarketNews.com. (Not one gunshot, but two.) The death was reportedly ruled a “suicide,” which begs the question of how a person can shoot themselves in the head .\n\nMany of her fans suspect Jaynes may have been murdered by the vaccine industry, which has a long history of advocating criminal fraud, bribery and kickbacks, outlandish medical experiments on human children, coordinated science fraud and other heinous crimes.\n\n616 people are talking about this\n\nOur prayers go out to the family members of Jennifer Jaynes, who was a courageous and brilliant researcher and writer. We are not yet aware of any organized effort to investigate her death or help raise funds for her family, but here are some publicly available addresses that may help you organize or share the word about such efforts:\n\nHer book publicist appears to be Ashley Vanicek who works for Thomas & Mercer, an imprint owned by Amazon.com — a corporation that has recently joined with Big Pharma to start retailing dangerous prescription drugs that will be delivered by drones. Vanicek’s contact is publicly listed as [email protected] – which appears to be a generic email address.\n\nJaynes’ literary agent is publicly listed as Italia Gandolfo, who works for Gandolfo Helin & Fountain (GHliterary.com). The agency has a public page describing the works of Jennifer Jaynes at this link: https://ghliterary.com/clients/jennifer-jaynes/\n\nWe do not publish this information to inconvenience Jaynes’ publisher or agent, of course: We hope to help spur a deeper investigation into her death, given all the suspicious deaths of individuals who have courageously spoken out against the “vaccine deep state” which quite literally consists of murderers and execution squads that seek out and silence individuals who pose a threat to the controlled vaccine narrative.\n\nIronically, the very description of the criminal vaccine industry that Jaynes wrote about in her own books is , not fiction. And many Jaynes fans believe they came for her and killed her.\n\nAs a targeted whistleblower and investigative journalist myself, I have been forced to pursue thousands of hours of pistol, rifle and shotgun combat training over the last decade in order to ensure my own safety against the vaccine criminal cartels. I am armed at all times and cannot speak in public without hiring a minimum of four armed security personnel to watch my back.\n\nEnjoy up to 51% OFF your favorite workout supplements, functional snacks, beverages and more at the Health Ranger Store's Black Friday and Cyber Monday Superfoods and Supplements Flash Sale event. This limited-time sale is going on NOW and runs through Saturday at midnight... only while supplies last. Learn more here.\n\nIt appears that Jennifer was about to launch a much larger media project, as she is the owner of which has a web domain that’s not yet populated with content: InkBugMedia.com\n\nJaynes’ fan base is, of course, horrified to discover that this talented, courageous woman has been killed. Jaynes had a very loyal following of readers and fans who spoke very highly of her work… and honored her commitment to exploring the truth about the criminal vaccine industry, even if it meant writing so-called “fiction novels” to get the word out.\n\nMy oldest daughter and her younger brother both had reactions to vaccines. Reading about Suzie almost had me hyperventilating. The scenario was nearly identical to what happened with my oldest daughter. The seizures that began after receiving a “necessary” baby shot have never gone away… I don’t think what she wrote as fiction is very far from the truth in regards to pharmaceutical companies today. Just listen to a few drug commercials and really hear the long list of side effects.\n\nThe book received rave reviews from readers who found its story line to be compelling and rooted in truths about the criminal vaccine industry. Other readers wrote:\n\nThis book, Malice, was to date, even her best novel. I was drawn into this book from page one to the final page. A great psychological thriller that takes you on a journey that is is so heart pounding, you can’t wait to read what happens next. This story is written in a way that the storyline is believable and the material is well researched. There was a twist I didn’t see coming, and that was a game changer!! I could not put this book down! Superb novel!!\n\nThis was the best book I’ve read in a long time! As a physician, I could so relate to this doctor just starting out, whose ideals come in conflict with corporate medicine and pharmaceutical corruption. The author presents some shocking truths about the practice of modern medicine, which makes this a must-read for anyone working in the medical field, or for anyone who places their trust in those hands. I could not put this book down, and was rewarded with some unexpected plot turns as the story unfolded. Brava, Jennifer Jaynes! So well done!\n\nJennifer Jaynes captivates her audience with suspense. Every Jennifer Jaynes book including Malice I had read within a few days because I was so engaged in her writing. I appreciate the research that she puts in to her writing. Even though her writing is fictional she includes truths about what is encountered in our society. In Malice she informs her readers about the truth of the drug industry. Well done Jennifer!\n\nWe pray for Jennifer Jaynes and her surviving relatives, and we hope that her novels will reach an ever-expanding number of readers and fans who realize that the criminal cartel Jaynes is describing in her novels isn’t fiction at all. It’s the reality of the Big Pharma drug cartels and their vaccine deep state “black hat” operations that engage in murder-for-hire.\n\nJaynes’ death comes on the heels of over 75 other holistic doctors, naturopaths and wellness educators who have died under extremely mysterious circumstances over the last three years or so. Erin Elizabeth of HealthNutNews.com has exhaustively documented many of these mysterious deaths in her website articles and public speeches.\n\nTo all holistic medicine practitioners: Arm yourself and learn to defend your life against the violence of the vaccine industry. If you aren’t legally carrying a pistol with you at all times, you are not prepared for the reality of the vaccine industry’s execution squads.\n\nRemember: An industry that murders and maims children for profit thinks nothing of killing whistleblowers and writers who get in their way. The vaccine industry has value for human life. Many vaccine researchers knowingly and deliberately oversee the tainting of vaccines with cancer viruses in order to cause widespread cancer outbreaks. And yes, vaccines are manufactured using aborted human fetal tissue, as the CDC openly admits. The aborted human ingredients are called MRC-5 and WI-38 human diploid cells. The FDA admits to their use here. And the CDC openly lists such ingredients in this vaccine excipient document (PDF). Here’s a link from GSK that admits the use of aborted human fetal tissue ingredients in their MMR vaccine.\n\nStay informed. Read Vaccines.news for daily updates on the vaccine industry and its crimes against humanity.\n\nWatch vaccine truth videos at Brighteon.com, now the online hub for uncensored videos about the dangers of vaccines.\n\nAnd check out the bombshell new film Vaxxed 2 at Vaxxed2.com.\n\nComing in 2020: We are launching a vaccine video platform exclusively for vaccine truth videos. Join the Natural News email newsletter to receive our announcements.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://newstarget.com/author/healthranger", "https://www.jenniferjaynes.net/children-s-books", "https://www.jenniferjaynes.net/", "https://www.amazon.com/gp/product/1503903915/", "https://www.audible.com/pd/Malice-Audiobook/1978636385", "https://www.goodreads.com/review/list/64543478-inkbug-media?shelf=read", "https://amarketnews.com/2019/11/28/jennifer-jaynes-death-obituary/", "https://www.naturalnews.com/files/Web-of-Alleged-Fraud.pdf#search=poul%20thorsen", "https://www.naturalnews.com/023654_Pfizer_drug_experiments.html", "https://www.naturalnews.com/046644_mmr_vaccine_autism_scientific_fraud.html", "https://twitter.com/SCHairCuts", "https://twitter.com/SCHairCuts", "https://t.co/7RCpEUhXO2", "https://t.co/7RCpEUhXO2", "https://t.co/7RCpEUhXO2", "https://t.co/7RCpEUhXO2", "https://t.co/7RCpEUhXO2", "https://twitter.com/intent/like?tweet_id=1199829029299347458", "https://twitter.com/SCHairCuts/status/1199829029299347458", "https://support.twitter.com/articles/20175256", "https://twitter.com/SCHairCuts/status/1199829029299347458", "/cdn-cgi/l/email-protection", "https://www.naturalnews.com/2018-06-30-amazon-to-become-your-big-pharma-drug-dealer-purchases-online-pharmacy-for-nearly-1-billion.html", "/cdn-cgi/l/email-protection", "https://ghliterary.com/", "https://ghliterary.com/clients/jennifer-jaynes/", "https://blackfridaycybermondayevent.naturalnews.com/black-friday-cyber-monday-event", "https://inkbugmedia.com/", "https://healthnutnews.com/", "https://www.naturalnews.com/041345_cdc_polio_vaccine_sv40.html", "https://www.naturalnews.com/038873_childhood_vaccines_aborted_babies_dna.html", "https://www.fda.gov/vaccines-blood-biologics/vaccines/varivax", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf", "https://au.gsk.com/media/217228/priorix_tetra_pi_008_approved.pdf", "https://vaccines.news/", "https://brighteon.com/", "https://vaxxed2.com/", "https://www.naturalnews.com/readerregistration.html"], "authors": [], "publish_date": "4:15 PM - Nov 27, 2019"}