{"result_id": "286046", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/how-covid-vaccine-may-be-related-alien-disclosure", "timestamp": "2023-04-25 17:17:25 CEST+0200", "meta": {"description": "How the Covid Vaccine May Be Related to Alien Disclosure", "lang": "en", "keywords": "prion, mad cow disease, vaccinations, AI, electromagnetic grid, culling humans, covid vaccines, ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/how-covid-vaccine-may-be-related-alien-disclosure", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "How the Covid Vaccine May Be Related to Alien Disclosure | The Common Sense Show", "cleaned_text": "I have come across information that may indicate that the vaccine may have not-yet discussed effects on our DNA which may impact our soul as well as having an impact on the food supply. And there may be an alien (eg Fallan Angel) connection to all of this. Walk with me as I relate what I have learned in the last few years.\n\nIt should be noted that during the Obama administration, Putin threatened to reveal the existence of UFO's . Is this one of the reasons behind the marginalization of Russia by the Deep State? More stunning evidence surfaced in an that is revealing what Obama and Putin had discussed creating a planetary defense system to defend against an alien attack. Of course, most will be skeptical. However, we should be mindful of the Operation Bluebeam was indeed real and it was about perpetuating a fake alien invasion in order to introduce a planetary government in response to the threat and here's why. When Trump previously talked about a vague and nebulous threat of an unspecified nature, this is one of the places my mind visited. I think Trump knew and was cast aside because he was viewed as an obstructionist to what is coming.\n\nThe Prevalence of the Perception of the Alien Threat\n\nThe Internet is increasingly carrying content about the ET/UFO subject. For example, the highly respected Mike Adams (Natural News) wrote a story on the pitfalls of first contact. Famous people from many walks of life are taking notice. From Presidents (e.g. Jimmy Carter) to Astronauts (e.g. Edgar Mitchell who walked on the moon) to high ranking government officials (e.g. Paul Hellyer the retired Canadian Secretary of Defense), have proclaimed interest and knowledge on the topic. Yet, there is no formal recognition of the phenomenon from our leaders until recently with the impending alien disclosure later this month by the Pentagon. Putin has warned the United States that if disclosure does not come soon, he will force the issue out into the open. One would have to possess a very closed mind to not give this topic some attention.\n\nPutin may be getting his way with supposed exposure on June 25, 2021. However, as I have watched the data dump on UFO’s and leaked information to people like Tucker Carlson, who has served as the point man for disclosure on his show with notables such former Pentagon UFO investigator Louis Elizondo. I must admit to skepticism from the supposed revelations coming our way on June 25th. The apparent time-released information appears to be propaganda in the works. There are several simultaneous agendas at work that I will discuss more fully when I have time to process and integrate all of the information. I wiull say, however, that the Christian religion is being replaced and Obama has alluded that this was coming when he was recently asked about alien disclosure.\n\nFrom where I sit, there are three possibilities when it comes to the topics of ET's/UFO's.\n• None There are ET's behind the scenes manipulating mankind in order to control our destiny. Some suggest that is why the planet is in such disarray.\n• None This is part of the great deception and ET's are actually fallen angels and the have come to deceive and form one world government for Satan to rule over.\n• None This is a carefully orchestrated plot designed to fool the people on this planet that we are in danger from ET's and will come to accept global governance.\n\nCatholic Doctrine has Been Morphed Into the Perverted Practice Global Religious Unification\n\nThe leaders of the multi-religious, pagan event, sponsored a gathering known as the “Mekudeshet”. This was the beginning of the mandatory One World Religion concept. The Pope popularized Chrislam, the blending of Christianity and Islam. This is something that Francis has been working towards. However, this is not the only thing that the Pope, or more accurately, the anti-Pope has been pursuing over the last couple of years. He has seemingly been on a one-man crusade to promote belief in the notion of the existence of extraterrestrial life. Along these lines, and as previouslly alluded to, Obama has just proclaimed that ET disclosure will being 2 developments: (1) the development of new religions; and, (2) spending an inordinate amount of money on defense.\n\nThe above mentioned information was offered as background. From here, the story becomes bizarre and very frightening as the story takes a strange twist.\n\nA few years ago, Paul Martin and myself conducted an interview regarding some very strange happenings in Northern Colorado at a CDC facility in the surrounding area. In the interview, Paul related how animals were showing up with a strange disease that mimicked madcow disease. The disease was transmissible to humans if they consumed the meat of the diseased cows and animals. I would love to repost the interview but Youtube took it down and I did not preserve the file. It should be noted that both Paul and myself speculated that this a depopulation event and somehow making game animals off limits to consumption, a food shortage would result and the scarcity of food would result in the age-old tactic of tyrannical regime using food as a weapon. Apparently, we were only partially correct. However, some people launched an all-out attack on myself for going down this path at that time, against me and this interview was censored. I have learned that when a story creates an unwarranted backlash against the author, something sensitive and secret is being revealed.\n\nFollowing the interview, I received an anonymous contact from someone who claimed to be a Colorado State University professor. He told me that the events that Paul and I were discussing in the interview were accurate along with the increased activity of the CDC in the area. He told me something that was totally bizarre. He said that the livestock/animals were implanted with a prion that resembled mad cow disease. However, the alleged professor’s account became very bizarre as well. He told me that the implantation of the “madcow disease” was done through artificial means using a hard-to-detect electromagnetic grid in which AI was used to implant the disorder. He then told me that the animals had previously been tagged and given a spiked protein from a vaccination of sorts and the disease would be activated through the spiked protein by the electromagnetic signals. He also told me that he heard persistent rumors that aliens (ET) were involved and this somehow related to the morphing of DNA, which produced diseased effect and the desire to change the DNA.\n\nThis professor and myself had three conversations. I confirmed he worked at Colorado State University in Fort Collins. After we went two weeks without talking, I tried to call his office number and it was suddenly a non-working number. Further, his identity had been wiped clean by the University or some force connected to University.\n\nI have never told this story but I thought of his revelations often when the story of a spiked protein surfaced as a concern with the present covid vaccines. The alleged effects are identical to what this professor told me.\n\nYesterday, another person has surfaced from the same area, with an animal doctor background and is relating stories to me regarding implantation of mad cow disease viruses. The person does not live far from Fort Collins.\n\nThis morning, I am reinterviewing Paul Martin on this topic. I just completed an interview with Dr. Ted Broer and he has a piece of this story as well. I cannot wait to see the light that Steve Quayle will add to this topic as well.\n\nI believe it is likely, that I am close to understanding the end game for the vaccines. There will be more to come including further revelations from the new source.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.express.co.uk/news/weird/811855/Vladimir-Putin-aliens-exist-Steve-Bassett-Paridigm-Research-Group-Russia-UFO", "http://www.dailystar.co.uk/news/latest-news/557708/WW3-Vladimir-Putin-Barack-Obama-aliens-attack-2017-missile-system"], "authors": [], "publish_date": null}