{"result_id": "286005", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/did-2015-movie-predict-purpose-jab-vaccine-much-more-it-appears-be", "timestamp": "2023-04-25 17:16:56 CEST+0200", "meta": {"description": "Did a 2015 Movie Predict the Purpose of the JAB? The Vaccine Is Much More Than It Appears To Be!", "lang": "en", "keywords": "thekingsman, exploding heads, vaccine side-effects, , ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/did-2015-movie-predict-purpose-jab-vaccine-much-more-it-appears-be", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "Did a 2015 Movie Predict the Purpose of the JAB? The Vaccine Is Much More Than It Appears To Be! | The Common Sense Show", "cleaned_text": "In February of 2015, Deborah Tavares told me that I really should go see the move, , because there are so many elements present in this movie which show us where so much of our technology is headed. Now I realize that the following technology is related to the Jab. This gets into the arena of predictive programming in which, for some cosmic reason, the satanic globalists must tell humanity, in some form, what is coming. Frequently, it is done through Hollywood.\n\nHave any of you noticed that with regard to the Jab, standard and time-honored medical practices have all been ignored. When I taught research courses for a local university, medical profiling was frequently contained in the curriculum to illustrate the good tenetes of research protocols (eg control and experimental groups, the search for intervening variables that could impact the relationship between the independent and dependent variables of a study, replicability, degrees confidence, etc.).Over the years, I became very familiar with the former steps employed by the FDA to bring a medical treatment to market.\n\nWith regard to this vaccine, we have ignored every single aspect of standard and sound medical practice, which I will enumerate, in part. But first,I need to expose the fact that there is not Delta variant. It is a hoax designed to keep us controlled and permanently locked down. The over-reaction is severe. For example, Australia's military is employed to enforce draconian martial law for 6 new cases of coronavirus. Secondly, there is no Delta variant. Last year in April of 2018, the FDA announced that the various developers of the PCR test would not be required to seek 3rd party validation. The FDA doubled down on that statement in May. I published a professional response in which I concluded that there is no reliable test for CV-19. As it turns out, the PCR test, as we all suspected, diagnoses CV-19 with people who have the common cold and other less virulent viruses. Ten days ago, the FDA declared the PCR test to be invalid. So let me ask you America, by what testing has Fauci and the CDC determined that the Delta variant is sweeping across the planet? There is no test, therefore,, that conclusion cannot be accurately made. This is how stupid the globalists and their CDC/FDA minions think we are. There is no doubt, variants to CV-19, but standard science says the variants are more contagious but almost always non-lethal! The Frontline Doctors have confirmed this fact. Then what is being measured that has led to a spike in something?\n\nI am convinced as many medical personnel are that what is happening is that the Delta variant is being used as a cover for the lethal side-effects of the vaccine. The attorney for the Front Line Doctors told me in two interviews that most of the admissions in the hospitals are from vaccinated individuals. This is the cover which is designed to keep people to stand in line to get the dangerous vaccine. In terms of medical science, and since it has been officially been determined that there is no reliable test to detect CV-19 and the mythical Delta variant, the only avenue to determine the existence of any mutant strain comes from a very expensive and elaborate process of testing for gene sequencing, which takes two to three weeks. Humanity is being massively lied to that is because humanity is being moved down the road of permanent eradication.\n\nAs promised, here are the major violations of science connected to the vaccine.\n• None No reliable test for diagnosis. They cannot have a reliable test, because it would reveal much.\n• None In the history of modern medicine the vaccine is the first medical treatment to contain no contraindications. That implies the treatment is perfect and without side-effects for ANY population. This is never happened before in medical history. Everyone must get vaccinated.\n• None Face mask packaging says \"cannot\" protect against viruses. Fauci, in March of 2020, said people need not wear face masks because they would not likely be effective.\n• None Death among people under 35 is almost unknown from CV-19. Why the push to vaccinate them? Everyone must be vaccinated.\n• None Time honored practices such as achieving herd immunity have been thrown out the proverbial window for the first time ever! Everyone must be vaccinated.\n• None If one has contracted the virus, it is a scientific fact that their viral load is far higher than anyone taking the vaccine, who has not contracted the virus. For the first time in medical history, this cornerstone principle of medical practice is ignored. Why? Because everyone must get vaccinated.\n• None People were told, take the vaccine and one does not have to wear a mask. That has changed. When lockdown 2.0 comes, it will not be about who is vaccinated, it will be about controlling the population for whatever hidden purpose.\n\nI have determined that there are multiple purposes and latent effects connected to the vaccine. Remember, we already know that injection sites have been shown, in some people, to be magnitized. There are other side-effects. But for the purpose of this story, let's stay with that them by looking at a 2015 movie that likely would fit under the category of informed consent through predictive programming.\n\nThe Plot of the Movie\n\nGary \"Eggsy\" Unwin (Taron Egerton), whose late father secretly worked for a spy organization, lives in a South London housing estate and seems headed for a life behind bars. However, dapper agent Harry Hart (Colin Firth) recognizes potential in the youth and recruits him to be a trainee in the secret service. Meanwhile, the villainous Richmond Valentine (Samuel L. Jackson), who masquerades as a philanthropist, launches a diabolical plan to solve the problem of climate change via a worldwide killing spree resulting in extreme depopulation.\n\nControlling the Leadership of the Planet\n\nThere are two important New World Order messages associated with this movie. First, the minions of the evil Richmond Valentine are forced to accept implants. The implants control the minions by exploding for reasons related to insubordination. Valentine, with his public persona known for philanthropy, employs the \"exploding microchip technology\" to control the various heads of state that he meets with. During these meetings, the heads of state are microchipped and become part of Valentine's Army in order to rule the world. Thus, the leadership of the planet is compromised through the implantation of microchips. If you have taken the vaccine, you have taken the chip.\n\nValentine's second part of the plot is tp destroy most of humanity to prevent extreme climate change. The plan to control humanity is carried out through the much heralded giveaway of SIM cards, granting free cellular and Internet access. Much like the sheep of today, the public lines up for miles to receive the free (Obama) cell phone. However, the free SIM card is a Trojan Horse and is designed to control and ultimately destroy humanity. After the elite are safely tucked away in a well-guarded underground facility in Sweden, Valentine unleashes his plan in which the frequency of the SIM card is changed and instantly, in every part of the planet, the people of this planet spontaneously and violently turn on each other and begin to kill one another. Valentine's plan is to allow humanity to destroy itself and when the job is complete, the elite, controlled by Valentine's implants, will emerge from their hideaway and will be ruled by the evil madman. Thus, the world will be safe from the ravages of global warming.\n\nPlease note that this principle was just codified into administrative law by the FCC in which the telecoms have been granted permission to build mini-5G-cell towers from any residence. Just like the movie, something is going to be frequency activated.\n\nIn December of 2012, I detailed how a family, whose father worked for FEMA in counter-bioterrorism and had recently retired, told me that he and other like-minded DHS and FEMA personnel were going into hiding because of what was coming. He further told me that our government had bio-agents which could promote extreme violence for a prolonged period of time. He said he had information that this would be unleashed for purposes ultimately tied to social control. He stressed to me that life was about to get very unsafe which is why he was going into hiding. They likened this coming event to an attack of Zombies and if you recall, it was in the Fall of 2012 that DHS began to carry out live Zombie suppression drills in places like San Diego on Halloween. At the end of 2012, I asked him how long we had, and he replied that this could happen in two to three years. We are now in this time frame. This revelation came out at the same time Doug Hagmann brought forth very similar warnings associated with an individual he dubbed \"Rosebud\".\n\nWith regard to implants and exploding heads, there was a lightheartedness associated with the movie designed to take the edge off of the exploding heads and effects of the mind control SIM cards. When we saw the Kingsman movie, my, then, young son asked me if the technology exists today and I informed him the SIM card frequency/mind control technology designed to control behavior through frequency modulation has been in existence since at least 1961 through the mind control work of Jose Delgado.\n\nIn the 1960’s, Spanish neurologist, Jose Delgado was involved in a noteworthy bullfight. Without any real bullfighting training, he bravely stepped into the ring with a very dangerous and deadly bull. However, Delgado had a secret weapon. He had previously implanted a radio-equipped electrode which was implanted into the bull’s limbic system (i.e. emotional center of the brain) which he called “stimoceivers.” Delgado subsequently demonstrated that he could manipulate an organism’s mind and body via remote control technology. Thus, as the bull charged, an invasive electrical signal penetrated the bull’s limbic system and the bull calmly broke off the attack in mid-charge. Delgado found that by stimulating different regions of the limbic system, which controls emotion, Delgado could also induce fear, rage and a variety of other emotions, that he was able to manipulate the type and intensity of emotional reactions. Thus, Delgado discovered the fine art of mind control. Intrigued by his work, Delgado was invited to teach and be a guest lecturer at such prominent universities such as Harvard and Yale. However, in 1968, Delgado went to work at the Stanford Research Institute (SRI) and this is where much of his research trail grows cold. We now know that SRI was a CIA front and was connected to the MK Ultra experiments. In 1974, Delgado abruptly returned to Spain and later became an outspoken opponent of mind control and its potential for harm and misuse by totalitarian societies. Perhaps, he was not on board with the CIA and what they eventually had planned for the American people. In cats, monkeys, bulls and even humans he repeatedly demonstrated that he could control emotion and ultimately behavior. In one experiment, Delgado stimulated the temporal lobe of a 21-year-old epileptic woman while she was calmly playing a guitar; in response, she flew into a rage and smashed her guitar against a wall, narrowly missing a researcher’s head. Perhaps the most medically promising finding was that stimulation of a limbic region called the septum could trigger euphoria, strong enough in some cases to counteract depression and even physical pain. Later Delgado was able to impact the hypothalamus of a cat and induce uncontrollable rage in the animal. Keep in mind that this technology is over 60 years old. One can only imagine how far this technology has come during that time. Delgado’s famous bull fight and the angry cat are depicted in the following video. The lesson is clear, embedded chips can turn normal people into crazed killers and it can take crazed killers and turn them into passive beings. Interestingly, the most famous graduate of the MK Ultra program was the Unabomber, Ted Kaczynski.\n\nMany are predicting that biometrics will be required to access the Internet. The fact is that some want your biometric information because this is the first step in gaining control over your mind. The main threat to humanity lies in the fact that the technology exists to control all of human behavior at one time. A reasonable person would certainly ask “how is that possible?” To answer that question, I refer the readers to Nick Begich’s website in which he details how mass electrical signals can be beamed up from an array of antenna and bounced off the ionosphere in either a narrow beam covering a specific and defined geographic area, or it can be reflected back to earth in a broad beam application in which millions could be impacted by one electrical signal designed to change human behavior. We know this technology as Project HAARP. United States Patent 5,159,703, Lowery, October 27, 1992, Silent Subliminal Presentation System, Inventors: Lowery, Oliver M. Appl. No. 458339 Filed December 28, 1989, discusses the microwave technology necessary for mind control. In this patent, we witness the move from the mind control of certain individuals who might have been programmed, which is frightening enough, to witnessing entire populations being controlled. The patent discusses the possibility of impacting millions at a time. The net effect of the technology is enhanced when there is a transducer in the body such as an . Particularly revealing in the arena of mind control, is Dr. Begich’s work on voice to skull technology. In 1997, he displayed this technology for the European Parliament who promptly issued a ban on the use of the technology. Unfortunately, the technology has moved forward in recent years despite the ban. Before you write to me and state that this could never happen, please spend 30 minutes on the Begich website, and analyze the validity of his observations. Begich has done a detailed analysis of the patents associated with HAARP, and very clear conclusions about the intent of these technologies can easily be made after examining the facts. Most awake people are aware that HAARP is a weather modification device. However, as a result of my research, I have come to the conclusion that HAARP’s biggest danger to humanity is the mind-control potential related to this technology. Sadly, Dr. Nick Begich has been warning us about this potential for 18 years and it is only now that significant numbers of researchers are starting to pay attention.\n\nThis will be the 5G transducing element to bring on the latent effects of the jab. The JAB is clearly an electro-magnetic transduring element. At this point, I feel compelled to raise the question as why? Is it an universal kill swith as we see in the Kingsman movie. Will it eventually zombify America. Many point to the increasing randomization of violence in America since the advent of widespread vaccination. There are many other possibilities that will be explored on this site until I suffer the same fate as Dr. Mercola.\n\nA Very Ominous Warning From the Inventor of Electromagnetic Mind Control\n\nIn his later years, and after working for the CIA for over 40 years in perfecting this technology, Dr. Delgado was very critical about the distinct lack of Bioethics and consumer protection with regard to these technologies. Until his death a few years ago, Delgado remained particularly critical of technologies which can change human nature. Delgado, stated the following:\n\nThe above quote from Delgado is a very ominous warning about how serious the subject of mind control is about to become for every person. After researching Delgado’s past, it is clear that he felt the same about mind control as Einstein felt about the unveiling of nuclear weapons.\n\nIn the movie, , the mind control technology was beta tested at a rural church in Kentucky. The Pastor, who used horribly inappropriate terms and was totally out of control, was depicted to be a facsimile of Alex Jones. In this brief scene, Alex, the person, and his work were marginalized in very graphic terms. The reference was so obvious that my son picked up on the not so subtle references to Alex Jones (lol).\n\nThis article demonstrated that the right to control your individual body is under attack on a number of fronts.\n\nAnd interestingly, Hollywood, through movies like The Kingsmen, are simply telling us that the elite are going to use the technology against humanity. The script was likely written by the CIA.\n\nThis article demonstrated that electromagnetic manipulation of the mind is over 50 years old. Further, it was established in this article that technologies such as Project HAARP are very real threats to all people and some of the supporting governmental patents were presented as well. The most surprising aspect of my research into this technology is not how far the technology has advanced, it centers around how easy it was to obtain information on the degree of sophistication of this technology. As stunning as this technology appears to be, as printed in this article, what is written here is child’s play compared to what has been developed and is in the process of being integrated into the police state surveillance grid. BUT THERE IS SOMETHING MORE OMINOUS AT WORK HERE AND IT HAS TO DO WITH THE SOUL FUTHER, THESE CONTINGENCIES HAVE BEEN REHEARSED BEFORE WITH REGARD TO THE ZOMBIFICATION OF THE HUMAN RACE. WHEN THE TIME IS RIGHT, HOW CAN THE ELITE GET THE MILITARY TO EXTERMINATE THOSE WHO HAVE NOT TAKEN THE JAB? ALL THESE QUESTIONS AND MORE WILL BE EXPLORED, HERE, ON THE COMMON SENSE SHOW.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"360\" src=\"https://www.youtube.com/embed/Ni2FFSAhTcA\" width=\"640\"/>   The lesson is clear, embedded chips can turn normal people into crazed killers and it can take crazed killers and turn them into passive beings. Interestingly, the most famous graduate of the MK Ultra program was the", "src": "https://www.youtube.com/embed/Ni2FFSAhTcA"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe allowfullscreen=\"allowfullscreen\" frameborder=\"0\" height=\"360\" src=\"https://www.youtube.com/embed/lfaw4q4fJO0\" width=\"640\"/>   Particularly revealing in the arena of mind control, is Dr. Begich’s work on voice to skull technology. In 1997, he displayed this technology for the European Parliament who promptly issued a ban on the use of the technology. Unfortunately, the technology has moved forward in recent years despite the ban. Before you write to me and state that this could never happen, please spend 30 minutes on the Begich", "src": "https://www.youtube.com/embed/lfaw4q4fJO0"}], "links": ["https://en.wikipedia.org/wiki/Subscriber_identity_module", "http://www.thecommonsenseshow.com/2012/12/25/ex-feds-and-wall-street-execs-are-going-into-hiding-why/", "https://www.wireheading.com/delgado/brainchips.pdf", "http://journals.lww.com/jonmd/pages/default.aspx", "https://robertscourt.blogspot.com/2008/06/unabomber-harvard-mkultra-victim.html", "http://www.earthpulse.com/", "http://www.earthpulse.com/"], "authors": [], "publish_date": null}