{"result_id": "286013", "URL": "https://thecommonsenseshow.com/conspiracy-economics-united-nations/millions-are-seriously-injured-or-dead-covid-vaccines-eu-database", "timestamp": "2023-04-25 17:17:03 CEST+0200", "meta": {"description": "MILLIONS are seriously injured or dead from covid vaccines – EU database", "lang": "en", "keywords": "spike protein, vaccination, Vaccine deaths, vaccine injury, vaccine reactions, vaccines, adverse reactions, biological weapons, biowar, ,coronavirus, COVID, deaths, EudraVigilance,, injuries, mRNA, Plandemic, side effects,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/conspiracy-economics-united-nations/millions-are-seriously-injured-or-dead-covid-vaccines-eu-database", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "MILLIONS are seriously injured or dead from covid vaccines – EU database | The Common Sense Show", "cleaned_text": "The latest data from EudraVigilance, a European Union database similar to VAERS (Vaccine Adverse Event Reporting System), shows that nearly 20,000 people have died from Wuhan coronavirus (Covid-19) “vaccines” in the areas of Europe it assesses, along with nearly two million people who have been seriously injured by the injections.\n\nEudraVigilance covers 27 of Europe’s 50 countries, which suggests that the true figures across the continent could be as high as 40,000 deaths and four million serious injuries. This is substantial, considering far fewer people are getting sick or dying from the Chinese Virus itself.\n\n“Seriousness provides information on the suspected undesirable effect; it can be classified as ‘serious’ if it corresponds to a medical occurrence that results in death, is life-threatening, requires inpatient hospitalisation, results in another medically important condition, or prolongation of existing hospitalisation, results in persistent or significant disability or incapacity, or is a congenital anomaly / birth defect,” the database explains about how injuries are measured.\n\nThe latest figures are much higher than earlier ones we reported on back in May, which reported about 10,000 deaths and 400,000 injuries.\n\nSo many people are getting injured or dying from Fauci Flu shots that reports indicate there is widespread vaccine regret across Europe and North America. People who lined up to “flatten the curve” through injection are saying they wish they would have listened to real scientists as opposed to television phonies like Tony Fauci.\n\nThere is also a trend of family doctors refusing to see their covid vaccine-injured patients because they do not know what to do for them. Such reports are coming out of both Scotland and England.\n\n“My vaccinated friends are not getting appointments with their family doctors who are avoiding them post vaccination even although there are no patients in the GP surgery waiting rooms when they have tried to get appointments,” one person reported.\n\n“It is utterly cruel given they talked them into getting the vaccinations and accepted 10 U.K. pounds from the Scottish and English governments per person vaccinated on their patient list and did not disclose the risk of these vaccinations to the patients.”\n\nDoctors now refusing to see vaccine-injured patients\n\nAnother person in Europe who was supposed to get a surgery was refused by her GP (general practitioner). Nurses also refused to take blood draws because they say they are not allowed to try to investigate what went wrong due to vaccination.\n\nIn another instance, a hospital consultant phoned a friend’s GP requesting that she see a patient who reported getting a Pfizer injection and feeling like it was “acid going into my veins.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://newstarget.com/author/ethanh", "https://www.naturalnews.com/2021-05-18-database-405250-covid-vaccine-injuries-10570-deaths.html"], "authors": [], "publish_date": null}