{"result_id": "286017", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/cardiac-testing-public-event-washington-shows-53-myocarditis-rate-covid-vaccine-victims", "timestamp": "2023-04-25 17:17:06 CEST+0200", "meta": {"description": "Cardiac testing at public event in Washington shows 53% myocarditis rate in covid “vaccine” victims", "lang": "en", "keywords": "Vaccine deaths, vaccine injury, vaccine wars, , heart health, inflammation, Multifunction Cardiogram, myocarditis,, pharmaceutical fraud, science deception, screening, vaccination, ,COVID, Dangerous Medicine, heart disease, vaccine damage, ,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/cardiac-testing-public-event-washington-shows-53-myocarditis-rate-covid-vaccine-victims", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "Cardiac testing at public event in Washington shows 53% myocarditis rate in covid “vaccine” victims | The Common Sense Show", "cleaned_text": "On January 28 of this year, about 500 people from Washington, Oregon, and Idaho converged on the Wenatchee Convention Center in Washington state to discuss Wuhan coronavirus (Covid-19) “vaccine” injuries and deaths. Part of the gathering included heart screening, which showed a 53 percent myocarditis rate among those evaluated.\n\nAttendees shared stories of injuries and deaths caused by Fauci Flu shots, as well as stories about how jab and mask mandates ruined lives and careers and tore families apart – not to mention all the businesses, churches, and schools that were shut down as well.\n\n“Heart screening was available and conducted using multifunction cardiogram technology, or MCG, provided by HeartCARE Corp.,” reports indicate.\n\n“We had the opportunity to perform Multifunction Cardiogram screens on a variety of participants … over half of those tested (16 of 30 people) (53%) had positive markers for myocarditis. Two of these were active-duty U.S. military pilots.”\n\nMost post-injection sudden deaths are a result of heart inflammation\n\nRight now, the authorities are reluctant to tell the truth about heart injuries and deaths stemming from covid injection. At best, they will admit to a rate of 1 in 5,000 for cardiovascular diseases like myocarditis.\n\nWhat the testing portion of the Wenatchee gathering showed is that this 1 in 5,000 rate is far too low. The reality is that many more people who get jabbed end up suffering serious heart problems after the fact.\n\n“The rates of post-covid-19 vaccine myocarditis are much, much higher than what public health authorities have admitted to,” reports explain.\n\nTwo key studies illustrate this, including one out of Thailand showing that one in 30 vaccinated boys between the ages of 13-17 develop myocarditis or pericarditis within a week following their second dose of Pfizer-BioNTech’s messenger RNA (mRNA) injection.\n\nAnother study out of Switzerland, that one conducted by Prof. Christian Mueller, found that within one week of getting “boosted” for covid, one in 35 health care workers at University Hospital Basel Switzerland developed troponinemia.\n\n“The actual incidence of post-vaccination myocardial lesions is 2.8% vs 0.0035% of myocarditis in retrospective studies (unvaccinated),” the researchers explained. “The incidence of myocardial lesions is 2.8% (1:35), or 800 times higher than the usual incidence of myocarditis (in unvaccinated).”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/cardiac-testing-washington-public-event-found-53-myocarditis-rate-including-2-active-duty-us-military-pilots-what-does-it-mean/5810311", "https://naturalnews.com/2022-04-27-study-mrna-covid-vaccines-increase-risk-myocarditis.html", "https://www.brighteon.tv/", "https://heartdisease.news/", "https://newstarget.com/2023-03-01-cardiac-testing-53-percent-myocarditis-covid-vaccines.html"], "authors": [], "publish_date": null}