{"result_id": "286008", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/cdc-confirms-100-reported-covid-19-vaccine-deaths-were-caused-just-5-batches-produced-majority-were", "timestamp": "2023-04-25 17:16:59 CEST+0200", "meta": {"description": "CDC confirms 100% of reported Covid-19 Vaccine Deaths were caused by just 5% of batches... 02-20-2023 • https://expose-news.com, BY THE EXPOSE On October 31st we exclusively revealed how an investigation of the USA's Vaccine Adverse Event Reporting System (VAERS) found extremely high numbers of adverse reactions and deaths have been reported against specific lot numbers of the Covid-19 vaccines numerous times, meaning deadly batches of the experimental injections have now been identified. That investigation also led to the discovery that 130 different lot numbers of Pfizer Covid-19 vaccine distributed to more than 13 states, harmed on average 639 times more people, hospitalised on average 109 times more people, and killed on average 22 times more people than the 4,289 different lt number of Pfizer vaccine distributed to 12 states or less. However, the most shocking finding of the investigation was that 100% of Covid-19 vaccine deaths reported to VAERS with identified lot numbers had been caused by just 5% of the batches produced. But the deeply troubling findings don't end there, because we decided to conduct further analysis of the VAERS data on the Covid-19 vaccines, and we've discovered that the majority of the deadliest batches were clearly sent to Republican controlled red states across the USA. The data used in the investigation was pulled from the publicly accessible VAERS database which can be viewed here. The Vaccine Adverse Event Reporting System (VAERS) is a United States programme for vaccine safety, co-managed by the U.S. Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA). Read Full Story", "lang": "en", "keywords": "CDC, WALENSKY, RED STATES, BAD VACCINE BATCHES , ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/cdc-confirms-100-reported-covid-19-vaccine-deaths-were-caused-just-5-batches-produced-majority-were", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "CDC confirms 100% of reported Covid-19 Vaccine Deaths were caused by just 5% of batches produced & the majority were sent to red Republican States across the USA | The Common Sense Show", "cleaned_text": "On October 31st we exclusively revealed how an investigation of the USA's Vaccine Adverse Event Reporting System (VAERS) found extremely high numbers of adverse reactions and deaths have been reported against specific lot numbers of the Covid-19 vaccines numerous times, meaning deadly batches of the experimental injections have now been identified.\n\nThat investigation also led to the discovery that 130 different lot numbers of Pfizer Covid-19 vaccine distributed to more than 13 states, harmed on average 639 times more people, hospitalised on average 109 times more people, and killed on average 22 times more people than the 4,289 different lt number of Pfizer vaccine distributed to 12 states or less.\n\nHowever, the most shocking finding of the investigation was that 100% of Covid-19 vaccine deaths reported to VAERS with identified lot numbers had been caused by just 5% of the batches produced. But the deeply troubling findings don't end there, because we decided to conduct further analysis of the VAERS data on the Covid-19 vaccines, and we've discovered that the majority of the deadliest batches were clearly sent to Republican controlled red states across the USA.\n\nThe data used in the investigation was pulled from the publicly accessible VAERS database which can be viewed here. The Vaccine Adverse Event Reporting System (VAERS) is a United States programme for vaccine safety, co-managed by the U.S. Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA).", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/02/19/cdc-confirms-deadly-covid-vaccine-batche-sent-red-states/", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://vaers.hhs.gov/", "https://expose-news.com/2023/02/19/cdc-confirms-deadly-covid-vaccine-batche-sent-red-states/"], "authors": [], "publish_date": "02-20-2023"}