{"result_id": "286048", "URL": "https://thecommonsenseshow.com/conspiracy-health-united-states/world-council-health-calls-immediate-recall-all-covid-19-vaccines", "timestamp": "2023-04-25 17:17:26 CEST+0200", "meta": {"description": "World Council For Health Calls for Immediate Recall of All COVID-19 Vaccines", "lang": "en", "keywords": "cdc, vaccine, vaccine injury, death, underreported, , ,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/conspiracy-health-united-states/world-council-health-calls-immediate-recall-all-covid-19-vaccines", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "World Council For Health Calls for Immediate Recall of All COVID-19 Vaccines | The Common Sense Show", "cleaned_text": "He was vice chief of internal medicine at Baylor University Medical Center and a professor at Texas A&M University. He is editor-in-chief of the journals Reviews in Cardiovascular Medicine and Cardiorenal Medicine. He is one of the most highly respected and published cardiologists in the U.S.\n\nHe was once one of the most published and cited authors in the medical community. Since he has come out explaining the dangers of the COVID-19 vaccines, Baylor and Texas A&M have cut ties with him. He has had his research revealing the dangers of the COVID-19 vaccines suddenly unpublished and deleted.\n\nDuring his presentation, Dr. MCullough mentioned the sweeping research by the World Council For Health (WCH). I decided to check his claims about the WCH research findings. I discovered that he was correct. My research took me beyond the WCH findings. It includes some surprising facts and evidence, which will be shocking to some, about the COVID-19 vaccines.\n\nThe World Council For Health (WCH) extensively studied the world databases on the COVID-19 vaccine injuries. The WCH for health studied the WHO VigiAccess, CDC VAERS, EudraVigilance, and UK Yellow Card Scheme to determine whether the COVID-19 vaccines are safe. 1 On June 11, 2022, the WCH announced its results. The WCH found that the databases revealed more than 40,000 deaths linked to the COVID-19 vaccines and called for an immediate recall of those vaccines. 2\n\nThose reported deaths are just the tip of the proverbial iceberg. Dr. Katrina Lindley explains the deficiency in the reports:\n\n[S]uch systems of passive surveillance result in significantly fewer ADR [adverse drug reaction] reports than active surveillance reporting. As a result, the actual number of adverse events that occurred in temporal relation to Covid-19 injections is likely to be much higher than revealed by the available official data. 3\n\nThe under-reporting in the databases is quite significant. Indeed, it is exponential. For example, because the VAERS database relies on passive reporting, it suffers from a systemic flaw known to HHS. That flaw is that the VAERS database under-reports the vaccine adverse events by a factor of 100. A Harvard study of the VAERS database that HHS commissioned revealed that “fewer than 1% of vaccine adverse events are reported.” 4 That statistical finding in the Harvard study has been confirmed to be accurate in a subsequent scientific study. 5\n\nThe adverse events listed in VAERS have not been clinically proven to have been caused by the listed vaccine. But we can reasonably infer that those who died within 48 hours of the onset of illness after the vaccination died from the vaccine. Megan Redshaw determined that 41% of those reported in VAERS as having died from a COVID-19 vaccine did so after becoming ill within 48 hours of the injection. 6 We will consider that temporal proximity as establishing a reasonable belief that the COVID-19 vaccines were the cause of the deaths.\n\nVAERS reported that of July 15, 2022, there were 29,635 deaths attributed to COVID-19. 41% of 29,635 is 12,150. Thus, one can reasonably conclude there is probable cause to believe that 12,150 persons died from the COVID-19 vaccine. Understanding that the VAERS system only reports 1% of the actual deaths, we find that the actual deaths in the U.S. from the COVID-19 vaccines are 1,215,000 people.\n\nThe World Council For Health (WCH) noted that the Polio Vaccine was recalled in less than one year after ten reported deaths, yet the Covid-19 vaccine, with 29,635 associated deaths, has not been recalled after two years. 7 The WCH concluded that “[t]here is sufficient evidence of adverse events relating to Covid-19 vaccines to indicate that a product recall is immediately necessary.” 8 The WCH came to that conclusion based on the associated deaths reported as of July 15, 2022, in VAERS being approximately 29,635. But the argument for an immediate recall becomes more compelling when one considers that there is probable cause to believe that the number of deaths in the U.S. caused by the COVID-19 vaccines is actually closer to 1.2 million.\n\nBased on the deaths associated with the COVID-19 vaccines reported to VAERS, the vaccines should have been pulled off the market almost immediately. The response to the deaths and injuries caused by the COVID-19 vaccines has been rather sleepy compared to the more vigilant response traditionally manifested when medical treatments cause deaths and injuries. For example, the WCH referenced the different response to the swine flu vaccine. The swine flu vaccine was administered to 40 million people over a 10-week period in 1976. That vaccine program was stopped within 10 weeks because 25 people died and 500 people developed Guillain-Barré Syndrome. 9 Twenty-five deaths are a fraction of the 1,215,000 deaths caused by the COVID-19 vaccines. A typical new drug receives a black box warning after about five unexplained deaths. If the deaths raise to 50 the drug is pulled off the market. Again, 50 deaths is a fraction of the 1,215,000 deaths caused by the COVID-19 vaccines.\n\nAs of July 28, 2022, there have been more adverse event reports in VAERS for the COVID-19 vaccines than all other 70+ other vaccines combined during the entire 32 year history of the VAERS database. Of the total 2.2 million adverse event reports in VAERS over the last 32 years, 1.3 million of those reports were for adverse events from the COVID-19 vaccines in the past 19 months. 10\n\nOn July 19, 2021, America’s Frontline Doctors (AFLDS) filed a motion seeking immediate injunctive relief in the Alabama Federal District Court to stop the Emergency Use Authorization (EUA) of the experimental COVID-19 injections. The plaintiffs averred the following facts in their certified complaint about the relative dangers of the COVID-19 vaccines:\n\nAccording to data extracted from the Defendants’ Vaccine Adverse Events Reporting System (“VAERS”), 99% of all deaths attributed to vaccines in the first quarter of 2021 are attributed to the COVID-19 Vaccines, and only 1% are attributed to all other vaccines. The number of vaccine deaths reported in the same period constitutes a 12,000% to 25,000% increase in vaccine deaths, year-on-year. 11\n\nThe CDC and the vaccine manufacturers are on record admitting that the COVID-19 vaccines do not prevent the spread of COVID-19. Indeed, before the EUA authorization by the FDA of the Pfizer-BioNtech vaccine, the Daily Mail reported that on or before December 4, 2020, “Pfizer CEO [Albert Bourla] admits he is ‘not certain’ their COVID-19 shot will prevent vaccinated people from spreading the virus.” 12\n\nDr. Katarina Lindley, Independent Pharmacovigilance Report Confirms Evidence for Recall of Covid-19 Vaccines, World Council For Health, Jule 11, 2022, https://worldcouncilforhealth.org/news/independent-pharmacovigilance-report-recall-of-covid-19-vaccines.\n\nDr. Katarina Lindley, Independent Pharmacovigilance Report Confirms Evidence for Recall of Covid-19 Vaccines, World Council For Health, Jule 11, 2022, https://worldcouncilforhealth.org/news/independent-pharmacovigilance-report-recall-of-covid-19-vaccines.\n\nLazarus, Ross, et al., Grant ID: R18 HS 017045, Final Report, Electronic Support for Public Health–Vaccine Adverse Event Reporting System (ESP:VAERS), at 6, 2/01/07 – 09/30/10, Submitted to: The Agency for Healthcare Research and Quality (AHRQ) U.S. Department of Health and Human Services, https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf.\n\nKimberly Blumenthal, Acute Allergic Reactions to mRNA COVID-19 Vaccines, Journal of the American Medical Association, March 8, 2021, https://jamanetwork.com/journals/jama/fullarticle/2777417.\n\nMegan Redshaw, Latest VAERS Data Show Reports of Blood Clotting Disorders After All Three Emergency Use Authorization Vaccines, The Defender, April 16, 2021, https://childrenshealthdefense.org/defender/vaers-reports-clotting-disorders-all-three-emergency-use-authorization-vaccines/?itm_term=home. See also Tyler Durden, What The CDC’s VAERS Database Reveals About “Adverse” Post-Vaccine Reactions, April 18, 2021, https://www.zerohedge.com/covid-19/what-cdcs-vaers-database-reveals-about-adverse-post-vaccine-reactions.\n\nShari Roan, Swine Flu ‘Debacle’ of 1976 Is Recalled, Los Angeles Times, April 27, 2009, https://www.latimes.com/archives/la-xpm-2009-apr-27-sci-swine-history27-story.html#:~:text=Waiting%20in%20long%20lines%20at,receiving%20the%20vaccine%3B%2025%20died. See also Gerald R. Ford Presidential Library & Museum, The Swine Flu Immunization Program of 1976, https://www.fordlibrarymuseum.gov/library/exhibits/swineflu/sf.asp (last visited on July 26, 2022.\n\nAFLDS suit seeks to immediately revoke emergency COVID vaccine use based on disturbing new mortality data, AFLDS Frontline News, November 23, 2021, https://americasfrontlinenews.com/post/aflds-suit-seeks-to-immediately-revoke-emergency-covid-vaccine-use-based-on-disturbing-new-mortality-data. See also Alabama TRO/Complaint/Preliminary Injunction, SFLDS, https://americasfrontlinedoctors.org/2/legal/tro/ (last visited on July 28, 2022).\n\nNatalie Rahhal, Pfizer CEO Admits He Is ‘Not Certain’ Their COVID-19 Shot Will Prevent Vaccinated People from Spreading the Virus – as the Firm Cuts the Number of Doses it Will Ship this Year, Daily Mail, December 4, 2020, https://www.dailymail.co.uk/health/article-9018547/Pfizer-CEO-not-certain-covid-shot-prevents-transmission.html.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote3", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote4", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote5", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote6", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote7", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote8", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote9", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote10", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote11", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#WPEndnote12", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote1", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote2", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote3", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote4", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote5", "https://jamanetwork.com/journals/jama/fullarticle/2777417", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote6", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote7", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote8", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote9", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote10", "https://www.openvaers.com/", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote11", "https://americasfrontlinedoctors.org/2/legal/tro/", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/#LinkTo_WPEndnote12", "https://greatmountainpublishing.com/2022/07/30/world-council-for-health-calls-for-immediate-recall-of-all-covid-19-vaccines/"], "authors": [], "publish_date": null}