{"result_id": "286028", "URL": "https://thecommonsenseshow.com/agenda-21-conspiracy-health/breaking-confirmation-president-trump-not-controlled-big-pharma-and-completely-opposed-coercive", "timestamp": "2023-04-25 17:17:12 CEST+0200", "meta": {"description": "BREAKING: Confirmation that President Trump is NOT controlled by Big Pharma and is completely opposed to coercive vaccine mandates", "lang": "en", "keywords": "Big Pharma, corruption, deep state, Fauci, health freedom, Liberty,,  President Trump, vaccines, White House,,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/agenda-21-conspiracy-health/breaking-confirmation-president-trump-not-controlled-big-pharma-and-completely-opposed-coercive", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "BREAKING: Confirmation that President Trump is NOT controlled by Big Pharma and is completely opposed to coercive vaccine mandates | The Common Sense Show", "cleaned_text": "Today we bring you an important update and correction. I had previously voiced concerns about Trump promoting Big Pharma and the coronavirus, fearing that the White House had been taken over by the “death science” con man Dr. Fauci and other Big Pharma operatives.\n\nI can confidently tell you today that my fears were unfounded. President Trump has not given in to Big Pharma and the vaccine industry, and he actually pushed Fauci onto the stage in order to attract intense public scrutiny that has now exposed the Fauci fraud for what it really is.\n\nAt the same time, Trump has taken other actions that are courageous and compelling:\n• He has publicly mentioned he’s taking hydroxychloroquine and zinc, being the first and only public official who has dared to mention a nutritional supplement as a preventive measure against the coronavirus.\n• He has de-funded the communist-run W.H.O. and halted all future funding unless that corrupt organization undergoes radical reforms.\n• He has affirmed that the coronavirus vaccine will NOT be mandatory but only given by choice to “those who want it.”\n• He has stated that a vaccine might never be available and that America will reopen “with or without a vaccine,” hinting that he does not make the reopening predicated on a vaccine.\n• He has demanded that churches be allowed to reopen as “critical” infrastructure, all across America. In many states, Walmart, abortion centers and bars were allowed to open while churches were ordered to stay closed.\n• Finally, just yesterday, he stated that even if there’s a second wave of infections, he will not place America under a second lockdown. Instead, it looks like he will hint at other strategies that can prevent infections, hospitalizations and deaths (perhaps zinc? Vitamin D? Wearing masks in shared places?)\n\nIn summary, although my fears were grounded in honestly observed actions involving Trump, his “vaccine czar” and Dr. Fauci’s influence at the White House, I have now learned from that Trump is fully aware of the risks of vaccines, the dangers of the Big Pharma drug cartels and the need to respect health freedom across America.\n\nThis is a tremendous relief because Trump is our last hope to fight against the vaccine deep state and the evil “death science” establishment. Sadly, he’s surrounded by evil and corruption in Washington D.C., and he’s made some mistakes, especially in picking the wrong people who turned out to be traitors (Jeff Sessions, anyone?). But from what I’ve learned, Trump is still fighting for humanity, and he hasn’t gone over to the dark side as many of us had feared.\n\nI’ve offered more details on these revelations in this heartfelt video, below.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://newstarget.com/author/healthranger", "https://brighteon.com/0e735262-095e-474c-958e-40aa23e0f361", "https://trump.news/"], "authors": [], "publish_date": null}