{"result_id": "286021", "URL": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/pancreatic-cancer-rates-skyrocket-covid-jabs-and-boosters-send-toxic-spike-protein-prions-vital", "timestamp": "2023-04-25 17:17:08 CEST+0200", "meta": {"description": "Pancreatic cancer rates skyrocket as Covid jabs and boosters send toxic spike protein prions into vital organs, including the pancreas, fueling turbo cancer", "lang": "en", "keywords": "vaccine damage, vaccine wars, vaccines,, cancer tumor, chaos, clot shot cancer, clot shots,,pancreatic cancer, spike protein, spike proteins, , covid vaccine, medical violence, pancreas, , biological weapons, biowar, bioweapons, turbo cancer,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/pancreatic-cancer-rates-skyrocket-covid-jabs-and-boosters-send-toxic-spike-protein-prions-vital", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "Pancreatic cancer rates skyrocket as Covid jabs and boosters send toxic spike protein prions into vital organs, including the pancreas, fueling turbo cancer | The Common Sense Show", "cleaned_text": "An alarming trend in cancer rates skyrocketing for perfectly healthy people has garnered major attention, even in reports published in peer-reviewed medical journals. What is being termed “turbo cancer” since the Covid vaccines hit the market may be the prime culprit of this disastrous increase in deadly cancer cases, including those of the pancreas, which has the lowest rate of survival of all cancers. Women under 55 years of age, mainly black women, are especially being targeted by pancreatic cancer, according to a report in the Gastroenterology journal recently, and scientists seem befuddled.\n\nPancreatic cancer cases increasing, causing more than 3% of all cancer deaths in USA\n\nOf course, smoking, alcohol, and sugar abuse add to the chaos of cancer developing in the human body, and lifestyle changes can certainly make a difference in reducing the chances of ever having to fight that fight, but the medical journals consistently leave out a major factor over the past three years, regarding carcinogens in the blood stream. Spike proteins are the latest source of “feed” for cancer cells, and they’re being produced in the human body by the billions, thanks to mRNA “technology.”\n\nTurbo cancer is the term for cancer cells, specifically T-cell lymphoma, that progress so rapidly, that they show up on PET/CT scans for cancer patients just days after getting the Covid Pfizer mRNA booster shot. According to a seasoned medical doctor in British Columbia, Dr. Charles Hoffe, the turbo-effect of spreading cancer cells through the lymph nodes can travel to the pancreas, feeding off spike proteins (prions) that lodge there.\n\nThe mRNA so-called “vaccines” (gene therapy injections) literally TURN OFF genes that fight cancer (P-53 genes), that are also referred to as the “guardians of the genome.” Dr. Hoffe is warning the world that the majority of Covid-vaccinated patients could experience critical health damage, including deadly pancreatic cancer, that accelerates exponentially due to the Covid jabs. Why?\n\nThe toxic spike proteins are recognized by the human immune system as enemies, foreign particles, created to resemble a deadly virus. The body is simply fooled by the mRNA RNA-changes, and is trying to attack those spike prions that have traveled throughout the body to cleansing organs, including the ovaries, brain, and yes, the pancreas. Hence all the new cases of severe inflammation.\n\nPancreatic cancer is a near death sentence, with only an 11% survival rate 5 years after diagnosis, then come the Covid clot shots", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://newstarget.com/author/sdwells", "https://naturalnews.com/2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html", "https://www.brighteon.tv/", "https://spikeprotein.news/", "https://newstarget.com/2023-02-19-pancreatic-cancer-rates-skyrocket-covid-jabs-fuel-turbo-cancer.html"], "authors": [], "publish_date": null}