{"result_id": "286019", "URL": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/we-are-living-through-greatest-scam-and-cover-human-history-are-you-prepared-what-comes-next", "timestamp": "2023-04-25 17:17:07 CEST+0200", "meta": {"description": "We are living through the greatest scam and cover-up in human history – are you prepared for what comes next?", "lang": "en", "keywords": "VAERS, Public Health, scam, vaccine, ,conspiracy, COVID, lies, medical murder, ,medical violence, Plandemic, propaganda,,,css,the common sense show, dave hodges,hodges, common sense show", "favicon": "/themes/custom/common_sense_show_custom_theme/favicon.ico", "canonical": "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/we-are-living-through-greatest-scam-and-cover-human-history-are-you-prepared-what-comes-next", "encoding": "utf-8"}, "image": null, "domain": "thecommonsenseshow.com", "title": "We are living through the greatest scam and cover-up in human history – are you prepared for what comes next? | The Common Sense Show", "cleaned_text": "However, some corporate media organizations have claimed that the federal mandate has some exemptions, not based on religious or medical exemptions, but apparently based on .\n\nNewsweek: Members of Congress and Their Staff Are Exempt From Biden’s Vaccine Mandate\n\nWashington Post: Postal Service workers not included in Biden’s mandatory vaccination order, source says\n\nIn addition, the White House Press Secretary admitted that the COVID-19 vaccine mandate did not apply to illegal immigrants walking across the border.\n\nSo it is obvious that this mandate has nothing to do with public health, and has everything to do with appeasing the Wall Street slave masters and Big Pharma.\n\nPrior to this week, vaccine laws and mandates have been a state issue.\n\nIt is important to note that this is an executive order, and not a law. It is highly unlikely that the administration could ever get such a law passed through Congress.\n\nHowever, I think it would be foolish to expect that this will be overturned by the courts. Some courts may, but the Supreme Court is firmly under the control of the corporate billionaires and bankers who actually run this country.\n\nAlmost everything about the COVID-19 Plandemic has been illegal, from requiring people to wear masks, to lock downs, to approving novel new drugs and vaccines for a sickness that has multiple FDA approved drugs already on the market that are effective in treating the symptoms related to COVID-19.\n\nIf you are a business owner with over 100 employees, you now face a difficult decision. Either comply and be complicit with injuring and killing people with the experimental COVID-19 injections, or resist, and face the consequences. The consequences could be anything from hefty fines, to loss of insurance coverage, higher taxes, and other measures the administration might take.\n\nI don’t have a business with that many employees, but if I did, the decision would be easy for me. I would resist and deal with the consequences rather than be complicit with crimes against humanity.\n\nWhat we are witnessing and living through today is the greatest scam in the history of the human race, which is now also morphing into the biggest cover-up, as vaccine injured people who have taken the experimental gene therapy shots are filling our hospitals, while the government and media lie to the American public and blame it on the unvaccinated.\n\nThe most recent data dump into the government’s Vaccine Adverse Event Reporting System (VAERS) happened yesterday (9/10/21):\n\nFrom the limited data that the CDC is willing to release, there are now 14,506 deaths recorded following COVID-19 shots, which is more than twice as many deaths recorded following all FDA approved vaccines for the past 30 years before the COVID shots were issued emergency use authorization in December of 2020. (Source.)\n\nThere are also 18,439 permanent disabilities, over 100,000 doctor visits, and 58,440 hospitalizations, which represent only a fraction of all cases as most go unreported.\n\nAnd yet we have a “pandemic of the unvaccinated” filling our hospitals?\n\nStop listening to the corporate media and politicians, and listen to what the frontline healthcare workers who are treating these patients are saying:\n\nThe Worst is Yet to Come\n\nWhile some people are now starting to wake up and realize that the whole COVID narrative has been a scam, and that they are being lied to regarding the alleged safety and effectiveness of the COVID injections, most people are seemingly still in the dark regarding the agenda in play here, and how the politicians are puppets to carry out this agenda of the Globalists.\n\nThis is a eugenics campaign to setup their New World Order and significantly reduce the world’s population, and it is no conspiracy theory anymore, as they have openly published this agenda for anyone who has eyes to see and ears to hear.\n\nWe are living in the presence of EVIL, and if you don’t wake up and recognize it soon, it will destroy you and your family.\n\nThe entire COVID Global Plandemic was simulated weeks before it ever started, and similar events that have yet to happen have also been recently simulated. See:\n\nAfter “Event 201” Coronavirus Simulation in 2019, World Economic Forum Now Plans “Cyber Pandemic” Simulation for July 2021\n\nBut what is especially troubling today is what is happening and what is being planned for our children. 12 to 15-year-olds have already been approved to receive these dangerous gene therapy shots, which NO governor, Red state or Blue state has acted to stop, and the casualties are mounting fast. See:\n\nCOVID Shots Are Killing and Crippling Teens in Record Numbers – Young Children Are Next\n\nCDC: Teens Injected with COVID Shots have 7.5 X More Deaths, 15 X More Disabilities, 44 X More Hospitalizations than All FDA Approved Vaccines in 2021\n\nAnd just this week, the Los Angeles Board of Education made COVID-19 shots mandatory for all school children over the age of 12.\n\nThe students will need to be fully vaccinated to return to class after the winter break, but many will need to be vaccinated starting in October if they are participating in sports or other extracurricular activities. (Source.)\n\nThis covers over 600,000 children, many of them poor Hispanic children.\n\nIf you can’t see the handwriting on the wall for what is going to happen this Fall, let me spell it out for you.\n\nIn addition to these school children, and now that LA has done this you can expect many other school districts to follow suit, most healthcare workers have also been mandated to get fully vaccinated by this Fall.\n\nThe number of vaccine injured is going to skyrocket, as nurses, doctors, and other healthcare workers will themselves suffer massive vaccine injuries, while many will just simply be fired or quit because they are too smart to risk their lives to keep their jobs over a killer injection. See:\n\nCrisis in America: Millions of Veteran Nurses are Resigning or Being Fired Over COVID Vaccine Mandates\n\nChildren below the age of 12, between the ages of 6 months and 11 years old, are the next target, and authorization to inject them with these experimental gene therapy shots is expected by the end of this month (September, 2021).\n\nOh my what a storm we are going to see this Fall, when the annual flu season kicks in. It will be unlike anything we have ever seen before, and if you can’t figure it out yet, let me spell it out for you.\n\nAll of these vaccine injuries and deaths, along with the annual “influenza-like” illnesses that will converge together, will be blamed on whatever flavor of COVID variant is popular at the time, and it will ALL BE BLAMED ON THE UNVACCINATED. Even the over-crowded hospitals will be blamed on the unvaccinated, instead of the shortages of healthcare workers due to COVID-19 mandates.\n\nWe know this is what will happen, because they are doing it right now!\n\nAnd once the panic sets in when the sick and dying cannot even get into hospitals, the huge bubble of our current fake economy will burst and the entire financial system may very well collapse.\n\nAnd remember that none of the experimental COVID-19 shots, including the one that has been “approved” by the FDA, has any long-term safety studies, and the control groups that were involved in the original trials, have intentionally been lost.\n\nThe corporate media actually reported this back in February of this year. Here is NPR reporting on it.\n\nSo those of us that are still unvaccinated, WE ARE THE CONTROL GROUP now by default! And you can be sure that they want to get rid of us as much as possible to keep their narrative alive.\n\nI am sorry to bring such doom and gloom through this report today, but if you don’t know what is very likely going to happen in the next few weeks as we head into the Fall flu season, you are going to be caught unprepared, and NOW is the time to prepare and start expecting these things to happen.\n\nLearn how to take care of yourself without the Healthcare system. The days are getting shorter now here in North America, and you should at the very least begin to start supplementing with Vitamin D, and increase your dosage as the days get shorter.\n\nWhatever supplements or medications you depend upon today, stock up on.\n\nAnd please, take care of your children! Public schools are the most dangerous place they can be right now, because they WILL vaccinate them with or without your approval.\n\nMany locations are already doing it, and when this crisis hits full steam later this year, you can be sure that they will not look for permission to inject children, especially from unvaccinated parents who will be looked at as domestic terrorists.\n\nThey will just take your children away from you, as they have been doing through medical kidnapping for decades now, but it will be at a much higher rate with the unvaccinated.\n\nI don’t see any signs of food shortages at the moment, mostly just inflationary prices, as this year’s harvest, while not great, is not the worst.\n\nBut as we saw last year in 2020, all of that can change in a moment due to public panic, and chokes in the supply chain. So stock up now on what you need before those panics start.\n\nThere is also a strong possibility that there will be some kind of “false flag” event soon, where the unvaccinated will be blamed. There were suggestions that this might happen on the anniversary of 911, but I am writing this on 9/11/21, and so far I have seen no reports of any major incidents involving mass casualties.\n\nStay vigilant, protect your children, and seek the wisdom of God in these very dark days.\n\nRead more of this story at: HealthImpactNews.com", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" src=\"https://www.youtube.com/embed/TpYPtZ01MGA?feature=oembed\"/>", "src": "https://www.youtube.com/embed/TpYPtZ01MGA?feature=oembed"}], "links": ["https://healthimpactnews.com/2021/we-are-living-through-the-greatest-scam-and-cover-up-in-human-history-are-you-prepared-for-what-comes-next/", "https://www.newsweek.com/members-congress-staff-exempt-biden-covid-vaccine-mandate-1627859", "https://www.washingtonpost.com/nation/2021/09/09/covid-delta-variant-live-updates/#link-ZHPPBSAVCBER7HQQD4LCHVV4VY", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&PERPAGE=400&DIED=Yes&VAX_YEAR_LOW=1991&VAX_YEAR_HIGH=2020&VAX_MONTH_HIGH=11", "https://healthimpactnews.com/2021/after-event-201-coronavirus-simulation-in-2019-world-economic-forum-now-plans-cyber-pandemic-simulation-for-july-2021/", "https://healthimpactnews.com/2021/covid-shots-are-killing-and-crippling-teens-in-record-numbers-young-children-are-next/", "https://healthimpactnews.com/2021/cdc-teens-injected-with-covid-shots-have-7-5-x-more-deaths-15-x-more-disabilities-44-x-more-hospitalizations-than-all-fda-approved-vaccines-in-2021/", "https://apnews.com/article/health-education-los-angeles-coronavirus-pandemic-school-boards-3e6d32b5545965d20128953478ee144d", "https://healthimpactnews.com/2021/do-you-want-to-be-injected-with-something-millions-of-nurses-refuse-to-take-and-are-giving-up-their-careers-because-it-is-so-dangerous/", "https://www.npr.org/2021/02/17/968760642/long-term-covid-19-vaccine-studies-hampered-as-placebo-recipients-get-real-shot", "https://medicalkidnap.com/2015/03/31/medical-kidnapping-a-threat-to-every-child-in-america-today/", "https://healthimpactnews.com/2021/we-are-living-through-the-greatest-scam-and-cover-up-in-human-history-are-you-prepared-for-what-comes-next/"], "authors": [], "publish_date": null}