{"result_id": "287041", "URL": "https://www.corbettreport.com/flashback-how-bill-gates-monopolized-global-health-2020/", "timestamp": "2023-04-25 17:17:49 CEST+0200", "meta": {"description": "FROM 2020: In light of the recent Politico/Welt whitewash on \"How Bill Gates and partners used their clout to control the global Covid response — with little oversight,\" it's a good time to re-visit \"How Bill Gates Monopolized Global Health,\" the first part of The Corbett Report' four part 2020 documentary, Who Is Bill Gates? In this edition of the flashback series, James breaks down how the latest Gates \"exposé\" from the MSM only further bolsters the mainstream \"vaccine\" narrative and we refresh our memory about how this serial software scammer became a central figure in the global public \"health\" space.", "lang": "en", "keywords": "", "favicon": "https://www.corbettreport.com/wp-content/uploads/2016/10/cropped-podcastlogonewnew-32x32.jpg", "canonical": "https://www.corbettreport.com/flashback-how-bill-gates-monopolized-global-health-2020/", "encoding": "UTF-8"}, "image": null, "domain": "www.corbettreport.com", "title": "FLASHBACK: How Bill Gates Monopolized Global Health (2020) - The Corbett Report", "cleaned_text": "FROM 2020: In light of the recent Politico/Welt whitewash on \"How Bill Gates and partners used their clout to control the global Covid response — with little oversight,\" it's a good time to re-visit \"How Bill Gates Monopolized Global Health,\" the first part of The Corbett Report' four part 2020 documentary, Who Is Bill Gates? In this edition of the flashback series, James breaks down how the latest Gates \"exposé\" from the MSM only further bolsters the mainstream \"vaccine\" narrative and we refresh our memory about how this serial software scammer became a central figure in the global public \"health\" space.\n\nTo watch the complete Who Is Bill Gates? documentary please go to:\n\nWatch a GERMAN DUB or a RUSSIAN DUB of this documentary.\n\nThis question, once merely academic, is becoming a very real question for those who are beginning to realize that Gates' unimaginable wealth has been used to gain control over every corner of the fields of public health, medical research and vaccine development. And now that we are presented with the very problem that Gates has been talking about for years, we will soon find that this software developer with no medical training is going to leverage that wealth into control over the fates of billions of people.\n\nBill Gates is no public health expert. He is not a doctor, an epidemiologist or an infectious disease researcher. Yet somehow he has become a central figure in the lives of billions of people, presuming to dictate the medical actions that will be required for the world to go \"back to normal.\" The transformation of Bill Gates from computer kingpin to global health czar is as remarkable as it is instructive, and it tells us a great deal about where we are heading as the world plunges into a crisis the likes of which we have not seen before.\n\nThis is the story of How Bill Gates Monopolized Global Health.\n\nYou're tuned in to The Corbett Report.\n\nUntil his reinvention as a philanthropist in the past decade, this is what many people thought of when they thought of Bill Gates:\n\nBut, once reviled for the massive wealth and the monopolistic power that his virus-laden software afforded him, Gates is now hailed as a visionary who is leveraging that wealth and power for the greater good of humanity.\n\nThe process by which this reinvention of Gates' public image took place is not mysterious. It's the same process by which every billionaire has revived their public image since John D. Rockefeller hired Ivy Ledbetter Lee to transform him from the head of the Standard Oil hydra into the kind old man handing out dimes to strangers.\n\nMore to the point, John D. Rockefeller knew that to gain the adoration of the public, he had to appear to give them what they want: money. He devoted hundreds of millions of dollars of his vast oil monopoly fortune to establishing institutions that, he claimed, were for the public good. The General Education Board. The Rockefeller Institute of Medical Research. The Rockefeller Foundation.\n\nSimilarly, Bill Gates has spent much of the past two decades transforming himself from software magnate into a benefactor of humanity through his own Bill & Melinda Gates Foundation. In fact, Gates has surpassed Rockefeller's legacy with the Bill & Melinda Gates Foundation long having eclipsed The Rockefeller Foundation as the largest private foundation in the world, with $46.8 billion of assets on its books that it wields in its stated program areas of global health and development, global growth, and global policy advocacy.\n\nAnd, like Rockefeller, Gates' transformation has been helped along by a well-funded public relations campaign. Gone are the theatrical tricks of the PR pioneers—the ubiquitous ice cream cones of Gates' mentor Warren Buffett are the last remaining holdout of the old Rockefeller-handing-out-dimes gimmick. No, Gates has guided his public image into that of a modern-day saint through an even simpler tactic: buying good publicity.\n\nThe Bill & Melinda Gates Foundation spends tens of millions of dollars per year on media partnerships, sponsoring coverage of its program areas across the board. Gates funds The Guardian's Global Development website. Gates funds NPR's global health coverage. Gates funds the Our World in Data website that is tracking the latest statistics and research on the coronavirus pandemic. Gates funds BBC coverage of global health and development issues, both through its BBC Media Action organization and the BBC itself. Gates funds world health coverage on ABC News.\n\nWhen the NewsHour with Jim Lehrer was given a $3.5 million Gates foundation grant to set up a special unit to report on global health issues, NewsHour communications chief Rob Flynn was asked about the potential conflict of interest that such a unit would have in reporting on issues that the Gates Foundation is itself involved in. \"In some regards I guess you might say that there are not a heck of a lot of things you could touch in global health these days that would not have some kind of Gates tentacle,\" Flynn responded.\n\nIndeed, it would be almost impossible to find any area of global health that has been left untouched by the tentacles of the Bill & Melinda Gates Foundation.\n\nIt was Gates who sponsored the meeting that led to the creation of Gavi, the Vaccine Alliance, a global public-private partnership bringing together state sponsors and big pharmaceutical companies, whose specific goals include the creation of \"healthy markets for vaccines and other immunisation products.\" As a founding partner of the alliance, the Gates Foundation provided $750 million in seed funding and has gone on to make over $4.1 billion in commitments to the group.\n\nGates provided the seed money that created the Global Fund to Fight AIDS, Tuberculosis and Malaria, a public-private partnership that acts as a finance vehicle for governmental AIDS, TB, and malaria programs.\n\nWhen a public-private partnership of governments, world health bodies and 13 leading pharmaceutical companies came together in 2012 \"to accelerate progress toward eliminating or controlling 10 neglected tropical diseases,\" there was the Gates Foundation with $363 million of support.\n\nWhen the Global Financing Facility for Women, Children and Adolescents was launched in 2015 to leverage billions of dollars in public and private financing for global health and development programs, there was the Bill & Melinda Gates Foundation as a founding partner with a $275 million contribution.\n\nWhen the Coalition for Epidemic Preparedness Innovations was launched at the World Economic Forum in Davos in 2017 to develop vaccines against emerging infectious diseases, there was the Gates Foundation with an initial injection of $100 million.\n\nThe examples go on and on. The Bill & Melinda Gates Foundation's fingerprints can be seen on every major global health initiative of the past two decades. And beyond the flashy, billion-dollar global partnerships, the Foundation is behind hundreds of smaller country and region-specific grants—$10 million to combat a locust infestation in East Africa, or $300 million to support agricultural research in Africa and Asia—that add up to billions of dollars in commitments.\n\nIt comes as no surprise, then, that—far beyond the $250 million that the Gates Foundation has pledged to the \"fight\" against coronavirus—every aspect of the current coronavirus pandemic involves organizations, groups and individuals with direct ties to Gates funding.\n\nFrom the start, the World Health Organization has directed the global response to the current pandemic. From its initial monitoring of the outbreak in Wuhan and its declaration in January that there was no evidence of human-to-human transmission to its live media briefings and its technical guidance on country-level planning and other matters, the WHO has been the body setting the guidelines and recommendations shaping the global response to this outbreak.\n\nBut even the World Health Organization itself is largely reliant on funds from the Bill & Melinda Gates Foundation. The WHO's most recent donor report shows that the Bill & Melinda Gates Foundation is the organization's second-largest donor behind the United States government. The Gates Foundation single-handedly contributes more to the world health body than Australia, Canada, France, Germany, Russia and the UK combined.\n\nWhat's more, current World Health Organization Director-General Tedros Adhanom Ghebreyesus is, in fact, like Bill Gates himself, not a medical doctor at all, but the controversial ex-Minister of Health of Ethiopia, who was accused of covering up three cholera outbreaks in the country during his tenure. Before joining the WHO, he served as chair of the Gates-founded Global Fund to Fight AIDS, Tuberculosis and Malaria, and sat on the board of the Gates-founded Gavi, the Vaccine Alliance, and the Gates-funded Stop TB Partnership.\n\nThe current round of lockdowns and restrictive stay-home orders in western countries was enacted on the back of alarming models predicting millions of deaths in the United States and hundreds of thousands in the UK.\n\nThe work of two research groups was crucial in shaping the decision of the UK and US governments to implement wide-ranging lockdowns, and, in turn, governments around the world. The first group, the Imperial College COVID-19 Research Team, issued a report on March 16th that predicted up to 500,000 deaths in the UK and 2.2 million deaths in the US unless strict government measures were put in place.\n\nThe second group, the Institute for Health Metrics and Evaluation in Bill Gates' home state of Washington, helped provide data that corroborated the White House's initial estimates of the virus' effects, estimates that have been repeatedly downgraded as the situation has progressed.\n\nUnsurprisingly, the Gates Foundation has injected substantial sums of money into both groups. This year alone, the Gates Foundation has already given $79 million to Imperial College, and in 2017 the Foundation announced a $279 million investment into the IHME to expand its work collecting health data and creating models.\n\nAnthony Fauci, meanwhile, has become the face of the US government's coronavirus response, echoing Bill Gates' assertion that the country will not \"get back to normal\" until \"a good vaccine\" can be found to insure the public's safety.\n\nBeyond just their frequent collaborations and cooperation in the past, Fauci has direct ties to Gates' projects and funding. In 2010, he was appointed to the Leadership Council of the Gates-founded \"Decade of Vaccines\" project to implement a Global Vaccine Action Plan—a project to which Gates committed $10 billion of funding. And in October of last year, just as the current pandemic was beginning, the Gates Foundation announced a $100 million contribution to the National Institute of Health to help, among other programs, Fauci's National Institute of Allergy and Infectious Diseases' research into HIV.\n\nAlso in October of last year, the Bill & Melinda Gates Foundation partnered with the World Economic Forum and the Johns Hopkins Center for Health Security to stage Event 201, a tabletop exercise gauging the economic and societal impact of a globally-spreading coronavirus pandemic.\n\nGiven the incredible reach that the tentacles of the Bill & Melinda Gates Foundation have into every corner of the global health markets, it should not be surprising that the foundation has been intimately involved with every stage of the current pandemic crisis, either. In effect, Gates has merely used the wealth from his domination of the software market to leverage himself into a similar position in the world of global health.\n\nThe whole process has been cloaked in the mantle of selfless philanthropy, but the foundation is not structured as a charitable endeavour. Instead, it maintains a dual structure: the Bill & Melinda Gates Foundation distributes money to grantees, but a separate entity, the Bill & Melinda Gates Foundation Trust, manages the endowment assets. These two entities often have overlapping interests, and, as has been noted many times in the past, grants given by the foundation often directly benefit the value of the trust's assets:\n\nThis is no mere theoretical conflict of interest. Gates is held up as a hero for donating $35.8 billion worth of his Microsoft stock to the foundation, but during the course of his \"Decade of Vaccines,\" Gates' net worth has actually doubled, from $54 billion to $103.1 billion.\n\nThe Rockefeller story provides an instructive template for this vision of tycoon-turned-philanthropist. When Rockefeller faced a public backlash, he helped spearhead the creation of a system of private foundations that connected in with his business interests. Leveraging his unprecedented oil monopoly fortune into unprecedented control over wide swaths of public life, Rockefeller was able to kill two birds with one stone: molding society in his family's own interests, even as he became a beloved figure in the public imagination.\n\nSimilarly, Bill Gates has leveraged his software empire into a global health, development and education empire, steering the course of investment and research and ensuring healthy markets for vaccines and other immunization products. And, like Rockefeller, Gates has been transformed from the feared and reviled head of a formidable hydra into a kindly old man generously giving his wealth back to the public.\n\nBut not everyone has been taken in by this PR trick. Even The Lancet observed this worrying transformation from software monopolist to health monopolist back in 2009, when the extent of this Gates-led monopoly was becoming apparent to all:\n\nThis brings us back to the question: Who is Bill Gates? What are his driving interests? What motivates his decisions?\n\nThese are not academic questions. Gates' decisions have controlled the flows of billions of dollars, formed international partnerships pursuing wide-ranging agendas, ensured the creation of \"healthy markets\" for Big Pharma vaccine manufacturers. And now, as we are seeing, his decisions are shaping the entire global response to the coronavirus pandemic.\n\nNext week, we will further explore Gates' vaccination initiatives, the business interests behind them, and the larger agenda that is beginning to take shape as we enter the \"new normal\" of the COVID-19 crisis.", "opengraph": {"locale": "en_US", "site_name": "The Corbett Report - Open Source Intelligence News", "type": "article", "title": "FLASHBACK: How Bill Gates Monopolized Global Health (2020) - The Corbett Report", "description": "FROM 2020: In light of the recent Politico/Welt whitewash on \"How Bill Gates and partners used their clout to control the global Covid response — with little oversight,\" it's a good time to re-visit \"How Bill Gates Monopolized Global Health,\" the first part of The Corbett Report' four part 2020 documentary, Who Is Bill Gates? In this edition of the flashback series, James breaks down how the latest Gates \"exposé\" from the MSM only further bolsters the mainstream \"vaccine\" narrative and we refresh our memory about how this serial software scammer became a central figure in the global public \"health\" space.", "url": "https://www.corbettreport.com/flashback-how-bill-gates-monopolized-global-health-2020/", "image": "https://www.corbettreport.com/wp-content/uploads/2022/02/The_Corbett_Report_Side_1.jpg", "image:secure_url": "https://www.corbettreport.com/wp-content/uploads/2022/02/The_Corbett_Report_Side_1.jpg", "image:width": "1400", "image:height": "1400", "article:published_time": "2022-09-24T11:33:07+00:00", "article:modified_time": "2022-09-24T11:35:51+00:00"}, "tags": ["bill gates", "health", "who"], "tweets": [], "movies": [], "links": ["https://www.corbettreport.com/flashback-how-bill-gates-monopolized-global-health-2020/", "https://www.corbettreport.com/author/admin/", "https://www.corbettreport.com/mp4/flashback-gates1.mp4", "https://www.corbettreport.com/mp4/flashback-gates1.mp4", "https://www.corbettreport.com/mp4/flashback-gates1.mp4", "#", "https://archive.org/details/flashback-gates1", "https://www.bitchute.com/video/YidDP208DoC4/", "https://odysee.com/@corbettreport:0/flashback-gates1:1", "https://corbettreport.substack.com/p/flashback-how-bill-gates-monopolized", "https://www.corbettreport.com/gates/", "https://www.kla.tv/17372", "https://www.kla.tv/17571", "https://www.youtube.com/watch?v=pyg-DYm7b0A", "https://www.youtube.com/watch?v=5oEcxMfwJnw", "https://www.corbettreport.com/", "https://www.youtube.com/watch?v=kLQqPmhwcDs", "https://www.youtube.com/watch?v=GmeGPudmSjs", "https://www.youtube.com/watch?v=WxOp5mBY9IY", "https://www.youtube.com/watch?v=iK6SS8CXYZo", "https://www.youtube.com/watch?v=Ql-Mtlx31e8", "https://www.youtube.com/watch?v=_15DReQKbt8", "https://www.youtube.com/watch?v=5oEcxMfwJnw", "https://www.youtube.com/watch?v=W3qz9-bxljA", "https://cut2thetruth.files.wordpress.com/2014/10/standard-oil-rockefeller-cartoon-monopoly-scandal-cut2thetruth.jpg?w=566&h=684", "https://www.youtube.com/watch?v=sfWZeeGeLTc&feature=youtu.be&t=918", "https://www.google.com/search?tbm=isch&source=hp&biw=1405&bih=905&ei=l3eWXpHxBc_h-Aab_6cw&q=warren+buffett+ice+cream&oq=buffett+ice+&gs_lcp=CgNpbWcQAxgAMgYIABAFEB46AggAOgYIABAIEB46BAgAEBhKKAgXEiQwZzEzNWc5MGcxNDFnODlnODlnOTZnOTVnMTM2ZzEwN2cxMDZKGQgYEhUwZzFnMWcxZzFnMWcxZzFnMWcxZzRQkApY7Rhglh9oAXAAeACAAYkBiAHPCpIBAzcuNpgBAKABAaoBC2d3cy13aXotaW1n&sclient=img", "https://www.theguardian.com/global-development/2010/sep/14/about-this-site", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2018/10/OPP1180191", "https://ourworldindata.org/supporters", "https://www.bbc.co.uk/mediaaction/about/funding", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2016/11/OPP1161829", "https://mediadecoder.blogs.nytimes.com/2010/10/06/gates-foundation-backs-abc-news-project/", "http://blogs.reuters.com/mediafile/2008/12/01/newshour-gets-35-million-from-gates-foundation/", "https://www.gavi.org/our-alliance/market-shaping", "https://www.gavi.org/investing-gavi/funding/donor-profiles/bill-melinda-gates-foundation", "https://archive.fo/20130124180843/http://www.google.com/hostednews/afp/article/ALeqM5h6Ih8CYz1SqAKYjI-SiowJgu8BSA?docId=CNG.07d4a47a8ce76f0e07e322726bdf65a2.6f1", "https://www.gatesfoundation.org/media-center/press-releases/2012/01/private-and-public-partners-unite-to-combat-10-neglected-tropical-diseases-by-2020", "https://www.globalfinancingfacility.org/bill-melinda-gates-foundation-0", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2017/11/OPP1180343", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2020/02/Gates-Foundation-Commits-10-Million-to-Support-Global-Response-on-East-Africa-Locust-Invasion", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2017/12/Gates-Foundation-Commits-300M-USD-to-Help-Farmers-in-Africa-and-Asia-Cope-with-Climate-Change?sf82155838=1", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2020/04/Gates-Foundation-Expands-Commitment-to-COVID-19-Response-Calls-for-International-Collaboration", "https://twitter.com/WHO/status/1217043229427761152?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed&ref_url=https%3A%2F%2Fwww.foxnews.com%2Fworld%2Fworld-health-organization-january-tweet-china-human-transmission-coronavirus", "https://www.who.int/about/finances-accountability/reports/A72_INF5-en.pdf", "https://archive.is/vgOWw", "http://www.stoptb.org/partners/partner_profile2.asp?PID=1057", "https://www.youtube.com/watch?v=aCpChmm1eds", "https://www.youtube.com/watch?v=LlJIwTd9fqI", "https://www.youtube.com/watch?v=ik5Ro3ScYXI", "https://www.youtube.com/watch?v=eMZz3ey4qxE", "https://www.imperial.ac.uk/media/imperial-college/medicine/sph/ide/gida-fellowships/Imperial-College-COVID19-NPI-modelling-16-03-2020.pdf", "https://edition.cnn.com/2020/03/30/health/coronavirus-us-ihme-model-us/index.html", "https://twitter.com/CNNSotu/status/1244275909944885248", "https://thehill.com/policy/healthcare/491715-key-coronavirus-model-revised-downward-predicts-60k-deaths-in-us-by-august", "https://web.archive.org/web/20200419083954/https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2020/03/OPP1210755", "https://www.gatesfoundation.org/Media", "http://www.healthdata.org/about/director-statement", "https://thehill.com/homenews/senate/486870-gop-senators-tell-trump-to-make-fauci-face-of-governments-coronavirus", "https://twitter.com/jennfranconews/status/1247294438264586240", "https://www.nih.gov/file/49246/download?token=ahYMS3M1", "https://www.nih.gov/file/49246/download?token=ahYMS3M1", "https://www.who.int/immunization/newsroom/press/news_release_decade_vaccines/en/", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/01/Bill-and-Melinda-Gates-Pledge-$10-Billion-in-Call-for-Decade-of-Vaccines", "https://www.ajmc.com/newsroom/nih-bill-and-melinda-gates-foundation-collaborate-to-develop-genebased-hiv-treatment", "https://www.centerforhealthsecurity.org/event201/", "https://www.youtube.com/watch?v=AoLw-Q8X174", "https://www.youtube.com/watch?v=GlUS6KE67Vs", "https://www.democracynow.org/2010/8/27/headlines/gates_foundation_criticized_for_increasing_monsanto_investment", "https://www.youtube.com/watch?v=XcMrHpLd9C4", "https://web.archive.org/web/20100924204343/https://www.forbes.com/profile/bill-gates/", "https://www.forbes.com/profile/bill-gates/#2125194c689f", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(09)60885-0/fulltext", "https://www.corbettreport.com/category/videos/"], "authors": [], "publish_date": "2022-09-24T11:33:07+00:00"}