{"result_id": "287036", "URL": "https://www.corbettreport.com/futurevaccines/", "timestamp": "2023-04-25 17:17:46 CEST+0200", "meta": {"description": "https://www.corbettreport.com/mp3/episode392-lq.mp3If the Gateses and the Faucis and the representatives of the international medical establishment get their way, life will not return to normal until the entire planet is vaccinated against SARS-CoV-2. What many do not yet understand, however, is that the vaccines that are being developed for SARS-Cov-2 are unlike any vaccines that have ever been used on the human population before. And, as radically different as these vaccines appear, they represent only the very beginning of a complete transformation of vaccine technology that is currently taking place in research labs across the planet. This is a study of The Future of Vaccines.", "lang": "en", "keywords": "", "favicon": "https://www.corbettreport.com/wp-content/uploads/2016/10/cropped-podcastlogonewnew-32x32.jpg", "canonical": "https://www.corbettreport.com/futurevaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.corbettreport.com", "title": "Episode 392 - The Future of Vaccines - The Corbett Report", "cleaned_text": "If the Gateses and the Faucis and the representatives of the international medical establishment get their way, life will not return to normal until the entire planet is vaccinated against SARS-CoV-2. What many do not yet understand, however, is that the vaccines that are being developed for SARS-Cov-2 are unlike any vaccines that have ever been used on the human population before. And, as radically different as these vaccines appear, they represent only the very beginning of a complete transformation of vaccine technology that is currently taking place in research labs across the planet. This is a study of The Future of Vaccines.\n\nWatch on Archive / BitChute / LBRY / Minds / YouTube or Download the mp4\n\nFor those with limited bandwidth, CLICK HERE to download a smaller, lower file size version of this episode.\n\nFor those interested in audio quality, CLICK HERE for the highest-quality version of this episode (WARNING: very large download).\n\nSince the dawn of the corona crisis, we have been told over and over that the world has changed forever.\n\nThis \"New Normal\" with which we are being threatened brings with it great uncertainty. Uncertainty over work. Uncertainty over travel. Uncertainty over what our lives will look like on the other side of this \"Great Reset.\"\n\nBut there is one thing that we can be certain about: If the Gateses and the Faucis and the representatives of the international medical establishment get their way, life will not return to normal until the entire planet is vaccinated against SARS-CoV-2.\n\nThis message has been repeated so frequently and so consistently by public health officials, political \"leaders\" and media commentators that many have begun to believe it. And now, the public is being prepared for an unprecedented global vaccination campaign. Taking the form of a military operation . . .\n\n. . .the plan is to rush a new generation of experimental vaccines to market and deliver them at \"warp speed\" before any long term testing has even been attempted. What many do not yet understand, however, is that the vaccines that are being developed for SARS-Cov-2 are unlike any vaccines that have ever been used on the human population before.\n\nAnd, as radically different as these vaccines appear, they represent only the very beginning of a complete transformation of vaccine technology that is currently taking place in research labs across the planet.\n\nThis is a study of The Future of Vaccines.\n\nYou're tuned in to The Corbett Report.\n\nFor almost the entirety of 2020, a traumatized public has been told that nothing resembling our pre-corona lives will return until there is a COVID vaccine.\n\nSo it is no surprise that the same media sources that have been promoting this talking point would celebrate the hopeful pronouncements of the Big Pharma manufacturers regarding their COVID vaccine candidates.\n\nBut lost amid the hype of this media-led celebration are some sobering facts.\n\nFirstly, these news stories were not generated on the back of publicly accessible data, but literal corporate press releases. This announcement-by-press-release style of corporate self-reporting was immediately exposed as a sham when AstraZeneca was found to have given an \"unintentionally\" lower dose to one group of trial participants and then touted the results of that smaller dose group without clarifying the confusion.\n\nSecondly, the \"success\" of these vaccines is not being measured by their ability to prevent infection with SARS-CoV-2, as many in the general public believe, but merely to lessen the severity of the symptoms associated with COVID-19, like coughs and headaches.\n\nThirdly, the studies are touted as involving tens of thousands of people, but in Pfizer's trial, only 170 of them were reported as being \"diagnosed with COVID-19\" during the trial. Of those, 162 were in the placebo group and eight were in the vaccine group. From this, it is inferred that the vaccine prevented 154/162 people from developing the disease, or \"95%\". But as even the British Medical Journal points out, \"a relative risk reduction is being reported, not absolute risk reduction, which appears to be less than 1%.\"\n\nFourthly, the trials are still ongoing. Although several countries have now issued \"emergency use authorization\" allowing these companies to begin distributing these vaccines to the public, the stage III trials of the vaccines are ongoing, with several of the planned \"endpoints\" for the data not being collected for 24 months after injection. As a result, as even the UK's own \"Information for UK Healthcare Professionals\" pamphlet regarding Pfizer's vaccine points out, \"Animal reproductive toxicity studies have not been completed,\" meaning that, \"It is unknown whether COVID-19 mRNA Vaccine BNT162b2 has an impact on fertility.\"\n\nEven more chillingly, it is not healthcare professionals who are leading the charge to deliver this vaccine to the world, but the military\n\nAnd most importantly, as incredible as this headlong rush to push an experimental vaccine on the majority of the world's population is, it is even more incredible when it is revealed that Moderna and Pfizer's vaccines are not, in fact, \"vaccines\" as anyone in the general public understands them. They are mRNA vaccines, a novel method of vaccination that has never before been approved for human use.\n\nTo be sure, the new mRNA vaccines work on an entirely different principle than any other vaccine that has ever been used on the human population. In order to understand that, it is important to understand the history of vaccine technologies.\n\nThe concept of \"inoculation\" has been around for centuries, with one of its earliest instances in China several centuries ago, where dried-out scabs of lightly infected smallpox sufferers were powdered and then blown up the nostrils of healthy people. The procedure aimed to infect the patient with a mild strain of smallpox, thus conferring immunity on them. This practice was brought over to Europe via Turkey and was eventually adopted around the world.\n\n“Vaccination” developed in the late 18th century when Edward Jenner discovered that those who had been exposed to cowpox—a less virulent relative of smallpox—were themselves immune from smallpox. He “vaccinated” a boy with a cowpox vesicle from a milkmaid and then inoculated him with smallpox two months later. The boy did not develop smallpox, and the procedure was hailed as a breakthrough of medical science. The term “vaccination,” derived from the Latin word for cow, eventually came to refer to the general process of introducing immunogens or attenuated infectious agents into the body in order to stimulate the immune system to fight infections.\n\nBut this is not how mRNA vaccines function. In contrast to vaccination, which involves introducing an immunogen into the body, mRNA vaccines seek to introduce messenger RNA into the body in order to “trick” that body’s cells into producing immunogens, which then stimulate an immune response.\n\nAny and all questions about this rushed, experimental vaccine technology are being labeled by the pharmaceutical manufacturers and the corporate press that runs on their advertising dollars as \"anti-vax misinformation\" and being actively censored. But despite the straw man argument that opposition to the vaccine comes solely from ignorant members of the public who are worried about being \"injected with mircochips,\" there are genuine concerns about the long-term safety of these vaccines coming from within the scientific community, and even from whistleblowers from within the ranks of the Big Pharma manufacturers themselves.\n\nOn December 1st, the former chair of the Parliamentary Assembly of the Council of Europe Health Committee, Dr. Wolfgang Wodarg, joined Dr. Michael Yeadon, a former Vice-President and Chief Scientific Officer at Pfizer Global R&D, to file a petition calling on the European Medicine Agency to halt the Phase III clinical trials of the Pfizer mRNA vaccine until they are restructured to address critical safety concerns associated with this experimental technology.\n\nBefore the combined weight of the pharmaceutical manufacturers, global health bodies, governments and the corporate media combined to suppress any questions about this unprecedented rush for a globally-distributed, experimental vaccine, there were widespread calls for caution from within the heart of the scientific community.\n\nEven mainstream publications like Scientific American were compelled to note back in June of this year that there are reasons for concern over the way the COVID-19 vaccines are being rushed to market:\n\nThe potential dangers of these vaccines—not just the mRNA vaccines that hijack your body's cells to begin producing proteins to stimulate an immune response, but vaccines like AstraZeneca's that uses a chimpanzee adenovirus to express the SARS-CoV-2 spike protein—are numerous. Not only do these vaccines present the potential for the antibody-dependent enhancement phenomenon that makes people more susceptible to the wild virus after having been vaccinated against it—which is a problem common to previous coronavirus vaccine candidates—but their potential impact on fertility has, even by the UK government's own admission, not been tested at this point and remains \"unknown.\"\n\nBut even more fundamental than these particular safety concerns about these particular vaccines is the way that this fanatical, reckless and unprecedented headlong rush to push (and potentially even mandate) these vaccines on billions of people worldwide—women and children, young and old, healthy and unhealthy alike—is setting the most dangerous public health precedent in the history of humanity, a precedent that threatens to undermine our most cherished health freedoms in the name of a panic-induced \"emergency.\"\n\nOne of these core freedoms is the ability to refuse an experimental medical procedure, a freedom that was acknowledged in the Nuremberg Code of 1947 and enshrined in the International Covenant on Civil and Political Rights, which states that \"no one shall be subjected without his free consent to medical or scientific experimentation.\"\n\nDespite the fact that the clinical trials surrounding these experimental vaccines are ongoing and that the FDA itself admits that there is \"currently insufficient data to make conclusions about the safety of the vaccine in subpopulations such as children less than 16 years of age, pregnant and lactating individuals, and immunocompromised individuals\" and \"risk of vaccine-enhanced disease over time, potentially associated with waning immunity, remains unknown,\" governments around the world are contemplating making these vaccinations mandatory, or compelling people to take them against their will by restricting their access to public life until they subject themselves to this medical experimentation.\n\nThe threat of forcing or compelling people to become unwilling guinea pigs in an ongoing medical experiment is immoral on its face. But even the prospect of enforcing such mandates would entail the erection of a surveillance and tracking system that further threatens basic rights and liberties. After all, in order to determine who has been vaccinated—and thus who is allowed to board an airplane or access a stadium or enter a store with a vaccine policy—there will need to be a system for identifying and tracking each vaccine recipient.\n\nWhereas in days past, such tracking systems might have worked with identification papers, special badges to identify people's status or other outwardly identifying marks, in the modern age, such schemes will take the form of digital apps and other technologically advanced methods for tracking, categorizing and identifying billions of people and their movements in real time.\n\nThere are already apps like IBM's Digital Health Pass and CLEAR's Health Pass that envision a world where our biometric ID will be linked via our smartphones to our health data in order to grant or deny access from public spaces and public events\n\nOnce the COVID vaccines are widely distributed, it would simply be a question of linking one's vaccination record to the health pass app to prevent the unvaccinated from accessing any given space.\n\nAnd while this future—sold through glossy corporate advertising but rejected by the vast majority of the public—may seem like a science-fiction dystopia, such systems are already being used to control the movements of people in China, where access to certain building or the ability to leave one's own neighbourhood can be restricted to those whose phone-based apps show a \"green\" immunity status.\n\nWorse, the COVID vaccine presents governments, intelligence agencies and corporations that have a direct interest in suppressing dissent, monitoring dissidents and controlling their populations with the perfect opportunity to make such systems a permanent fixture of daily life. After the immediate \"threat\" of the declared public health crisis subsides, the public is already being warned that these apps will be transitioned seamlessly into general monitoring of the population.\n\nAs chilling as these \"immunity passports\" opening the door for governments to implement persistent digital tracking of their entire population is, it represents only the most visible privacy invasion that is being enacted on the back of this unprecedented vaccine rollout.\n\nAs viewers of the \"Who Is Bill Gates?\" documentary will know, these smartphone apps and voluntary reporting mechanisms will eventually be replaced by an even more invasive technological means of certifying vaccination. Not the \"microchip\" strawman that the fact checkers use to attempt to debunk these concerns, but the verifiable existence of a program to develop quantum dot tags to instantly identify who has received a given vaccine.\n\nExperimental vaccine technologies. Rushed testing. Mandates and health apps. And, eventually, quantum dot tags and biometric IDs. The future that is coming into view on the back of this COVID nightmare is truly dystopian.\n\nBut as worrying as all of this, the most worrying aspect is the precedent that it sets for a new era of biosecurity. An era in which public health authorities will claim to have the right to force rushed, untested and experimental technologies on the public in the name of public \"health.\"\n\nAt the moment, these new technologies—like mRNA vaccines which reprogram cells to produce antigens or the DNA vaccines that seek to insert foreign genetic material directly into the cells' nucleus and that even biotech giant Moderna admit \"have a risk of permanently changing a person’s DNA\"—are still understood by the public as \"vaccines.\" But they bare as little resemblance to the vaccines that have previously been given to the public as Edward Jenner's cowpox vaccine bore to the old Chinese art of blowing smallpox scabs up the nose. And the medical technologies that are emerging now will once again utterly transform our understanding of \"vaccines.\"\n\nOne such technology is being actively developed by Profusa, Inc., a company that in 2016 received a $7.5 million grant from DARPA—the research and development agency of the US military—to \"develop implantable biosensors that can continuously monitor multiple body chemistries.\" Earlier this year, Profusa announced a study that will examine how the company's technology—including a \"wireless reader that adheres to the skin and collects and reports tissue oxygen levels\" and a 3mm string of hydrogel, which can be inserted under the skin with a syringe and programmed to send \"a fluorescent signal outside of the body when the body begins to fight an infection\"—can be used to \"develop an early identification system to detect not only disease outbreaks, but biological attacks and pandemics up to three weeks earlier than current methods.\" The study is expected to be completed next year.\n\nHydrogels—networks of crosslinked polymer chains—are increasingly being turned to by proponents of these new technologies as potential delivery devices for drugs, cells, proteins, and bioactive molecules. In 2013, for instance, a team of European researchers announced a novel method for injecting a vaccine-containing hydrogel sphere to a spot beneath the skin, which could be released at a later time by swallowing a \"stimulusresponsive biohybrid material.\" Touted as a \"remote-controlled vaccine delivery system,\" the researchers proved their concept by injecting mice with a hydrogel containing human papillomavirus vaccine and later giving them a pill containing fluorescein, which dissolved the hydrogel mesh and released the vaccine. The research on this vaccine delivery method continues, with a Chinese team publishing research just this year on a self-adjuvanted hydrogel which \"had both adjuvant potential and the ability to sustained release antigen.\"\n\nAs viewers of the \"Who Is Bill Gates?\" documentary will know, the idea of implanting remote-controlled vaccines in large populations has been around since at least 2012, when, according to MIT Technology Review, Bill Gates personally asked MIT researcher Robert Langer to create an implantable birth control device that could be turned on or off remotely. The resulting device—a wireless birth control microchip that, as the National Post noted in 2014, \"can be turned on and off with a remote control and that is designed to last up to 16 years\"—was developed by Microchips Biotech, now part of Daré Bioscience, and has so far received $17.9 million in grant funding from the Bill & Melinda Gates Foundation.\n\nFrom biolectronics to nanorobotics to synthetic biology, ever more incredible technologies are being pioneered that, whether or not they are marketed to the public under the catch-all term of \"vaccine,\" will operate in ways that are fundamentally unlike anything before used on the human population.\n\nUniversity of Ottawa researchers are working on creating \"edible vaccines.\"\n\nResearchers at Harvard Medical School are developing autonomous DNA nanorobots capable of transporting molecular payloads directly into cells.\n\nA team of scientists at Johns Hopkins University are working on shape-changing microdevices called \"theragrippers\" that can reside in the GI tract to aid in extended drug delivery.\n\nNanobots. Shape-changing bioelectronic devices. Remote-controlled vaccines. This is not the stuff of science fiction but of science fact, and the precedent that is being set during the COVID era to rush experimental and unproven medical technologies into use on the back of a declared crisis is the same precedent that could be used to foist these injectable technologies on the public in the future.\n\nAnd, as Catherine Austin Fitts—former United States Assistant Secretary of Housing and Urban Development and founder of Solari, Inc.—explains, these injectables are part of an elaborate system of biological, economic, and political control that is being bankrolled into existence by powerful special interests.\n\nDespite the protestations of those like Bill Gates who have a financial interest in these experimental vaccines, and the Big Pharma corporations that are selling these vaccines, and the governments that are being bribed by the international public health cartel to purchase these vaccines and pressure their public to accept them, and the corporate media who relies on these Big Pharma corporations for their advertising dollars, some facts about these novel coronavirus vaccines are indisputable:\n• They are the most rushed vaccines ever developed.\n• The manufacturers have been given total immunity from liability if their experimental vaccines cause injury.\n• The clinical trials testing the safety of these injections are not finished, meaning that every member of the public who takes one is now a human guinea pig in an ongoing medical experiment with the population of the planet.\n• The Pfizer and Moderna mRNA vaccines are themselves part of an experimental class of injection that has never before been given to the public;\n• These vaccines have not been tested for their ability to prevent infection or spread of SARS-CoV-2 and are not intended to do so.\n• And there is absolutely no long-term data about these vaccines to determine what their effects may be on fertility, the potential for pathogenic priming, or any other serious adverse reaction.\n\nThat this represents the most reckless and brazen experiment in the history of the world is undeniable on its face. Never before have billions of people been pressured to submit to a completely experimental, invasive medical procedure on the basis of a disease with a greater than 99% survival rate.\n\nBut large-scale, emergency vaccination campaigns have been tried before with sobering lessons about the danger of such a wide-scale experiment that are being deliberately ignored right now.\n\nIn the late 1950s and early 1960s, hundreds of millions of people were injected with polio vaccines that, years later, were discovered to have been contaminated with SV40, a cancer-causing virus found in the rhesus monkey kidney cells that were used to create the vaccine.\n\nIn 1976, twelve soldiers at Fort Dix were diagnosed with swine flu. This kicked off a round of public health hysteria that led the US government to mandate that every citizen in the country be vaccinated. In the end, only one soldier at Fort Dix died of the swine flu and no one outside of the base even tested positive for it, but the emergency immunization program went ahead. It was brought to an abrupt end after hundreds who had received the rushed vaccine began to display severe neurological disorders.\n\nDuring the hysteria over swine flu in 2009, GlaxoSmithKline rushed a vaccine called Pandemrix to market in several European countries that was later associated with increased risk of narcolepsy. Years later, it was admitted that the 2009 flu season was no deadlier than any other flu season, but the British Medical Journal revealed that the body that advised the WHO on the declaration of the public health emergency that caused governments to purchase billions of dollars of vaccines was itself populated by advisors with direct financial ties to the Big Pharma vaccine manufacturers.\n\nIn each of these cases, the public was told to \"follow the science,\" and in each of these cases an unknown and perhaps unknowable number of people paid for that blind faith with their health. Now the revolver is once again being put to our heads and, with an assurance that that revolver probably contains a lot of empty chambers, the public is being asked to play Russian Roulette in the name of \"trusting the science.\"\n\nSurely those who wish to be the test subjects in this ongoing experiment should be free to make themselves into guinea pigs for the Big Pharma manufacturers. But every mandate or compulsion to force the vaccine on an unwilling recipient sets a dangerous precedent, a precedent that will one day lead to a tracked and surveilled population unable to resist the next generation of injectable bioelectronics.\n\nThis is not a game, this is not a test. Billions of people are being asked to participate in a gigantic experiment, not just an experiment in medical technology, but an experiment in compliance and blind trust.\n\nThe pressure to say yes and to go along with the crowd in this experiment is enormous. But if we lose the freedom to say \"no\" to this, then we may lose control over our bodily autonomy—and, ultimately, our humanity—forever.\n\nThe choice is ours . . . but for how much longer?", "opengraph": {"locale": "en_US", "site_name": "The Corbett Report - Open Source Intelligence News", "type": "article", "title": "Episode 392 - The Future of Vaccines - The Corbett Report", "description": "https://www.corbettreport.com/mp3/episode392-lq.mp3If the Gateses and the Faucis and the representatives of the international medical establishment get their way, life will not return to normal until the entire planet is vaccinated against SARS-CoV-2. What many do not yet understand, however, is that the vaccines that are being developed for SARS-Cov-2 are unlike any vaccines that have ever been used on the human population before. And, as radically different as these vaccines appear, they represent only the very beginning of a complete transformation of vaccine technology that is currently taking place in research labs across the planet. This is a study of The Future of Vaccines.", "url": "https://www.corbettreport.com/futurevaccines/", "image": "https://www.corbettreport.com/wp-content/uploads/2022/02/The_Corbett_Report_Side_1.jpg", "image:secure_url": "https://www.corbettreport.com/wp-content/uploads/2022/02/The_Corbett_Report_Side_1.jpg", "image:width": "1400", "image:height": "1400", "article:published_time": "2020-12-23T13:30:44+00:00", "article:modified_time": "2023-03-01T02:49:41+00:00"}, "tags": ["vaccines", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.corbettreport.com/futurevaccines/", "https://www.corbettreport.com/author/admin/", "https://www.corbettreport.com/mp3/episode392_future_vaccines.mp3", "https://www.corbettreport.com/mp3/episode392_future_vaccines.mp3", "https://www.corbettreport.com/mp3/episode392_future_vaccines.mp3", "#", "https://archive.org/details/ep392-futurevaccines", "https://www.bitchute.com/video/UQvaQFdGLn8", "https://lbry.tv/@corbettreport:0/futurevaccines:6", "https://www.minds.com/newsfeed/1188474997261950976", "https://youtu.be/UQvaQFdGLn8", "https://www.corbettreport.com/mp4/ep392-futurevaccines.mp4", "http://www.corbettreport.com/mp3/episode392-lq.mp3", "http://www.corbettreport.com/mp3/episode392-hq.mp3", "https://odysee.com/@enespa%C3%B1ol:3/elfuturodelasvacunas:9", "https://odysee.com/@truthinsubita:e/Il-Futuro-dei-Vaccini-(Corbett-Report-E392--The-Future-of-Vaccines-%E2%80%93-SUB-ITA):a", "https://odysee.com/@LeTrublion:d/2020.12.23---Le-futur-des-vaccins-(The-future-of-vaccines)-:5", "https://odysee.com/@AugenAufMedienAnalyse:6/The-Corbett-Report---Die-Zukunft-Der-Impfstoffe---The-Future-Of-Vaccines---Deutsch:e", "https://www.youtube.com/watch?v=7CB85HVb5o4", "https://archive.org/details/CSPAN_20200717_093700_Arizona_Gov._Ducey_Holds_Coronavirus_Briefing/start/660/end/720", "https://www.youtube.com/watch?v=n2fp0Jeyjvw", "https://www.youtube.com/watch?v=jXHikITwlng", "https://www.youtube.com/watch?v=pP3-hE-DrSc", "https://www.youtube.com/watch?v=r_VNNEluJh8", "https://www.youtube.com/watch?v=h7B0scj77zM", "https://archive.org/details/CSPAN_20200415_140600_California_Gov._Newsom_Holds_Coronavirus_Briefing/start/1740/end/1800", "https://www.cnsnews.com/article/national/melanie-arter/fauci-well-get-back-normal-gradually-after-vaccine-you-dont-know-how", "https://www.youtube.com/watch?v=NcHjrI-zl44", "https://www.youtube.com/watch?v=Ib9RV16f-Kc", "https://www.corbettreport.com/", "https://www.youtube.com/watch?v=mMrJSllDoPc", "https://www.youtube.com/watch?v=T1yPwSVXp6s", "https://www.youtube.com/watch?v=ceP2ywRAwPw", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-conclude-phase-3-study-covid-19-vaccine", "https://www.cnbc.com/2020/11/27/oxford-who-scientists-more-data-needed-on-astrazenecas-covid-vaccine-trials-.html", "https://www.youtube.com/watch?v=YsfvESm84PQ", "https://lbry.tv/@joe-plummer:b/fauci-happy-if-vaccine-permits-infection:5", "https://blogs.bmj.com/bmj/2020/11/26/peter-doshi-pfizer-and-modernas-95-effective-vaccines-lets-be-cautious-and-first-see-the-full-data/", "https://web.archive.org/web/20210311101455/https://pfe-pfizercom-d8-prod.s3.amazonaws.com/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/941452/Information_for_healthcare_professionals.pdf", "https://www.youtube.com/watch?v=v6O38-5FEf4", "https://www.fox43.com/article/news/local/adams-county-native-plays-vital-role-in-military-operation-to-distribute-vaccine/521-0589e64b-c813-442b-a3ac-a56e82216b16", "https://www.youtube.com/watch?v=JgpMcOk78p0", "https://www.youtube.com/watch?v=v6O38-5FEf4", "https://www.pbs.org/wgbh/nova/video/rna-coronavirus-vaccine/", "https://www.youtube.com/watch?v=KMc3vL_MIeo", "https://www.youtube.com/watch?v=S8Wd-NMqvno", "https://www.youtube.com/watch?v=gG7uCskUOrA", "https://web.archive.org/web/20201209042033/https://2020news.de/wp-content/uploads/2020/12/Wodarg_Yeadon_EMA_Petition_Pfizer_Trial_FINAL_01DEC2020_EN_unsigned_with_Exhibits.pdf", "https://www.bitchute.com/video/256BhchLR0R6/", "https://www.scientificamerican.com/article/the-risks-of-rushing-a-covid-19-vaccine/", "https://www.sciencedirect.com/science/article/pii/S0264410X08015053", "https://www.c-span.org/video/?c4873497/user-clip-hotez-coronavirus-vaccine-safety-testimony", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/941452/Information_for_healthcare_professionals.pdf", "http://www.cirp.org/library/ethics/nuremberg/", "https://www.ohchr.org/EN/ProfessionalInterest/Pages/CCPR.aspx", "https://www.fda.gov/media/144245/download", "https://www.youtube.com/watch?v=CZ-n_TbK7-A", "https://www.youtube.com/watch?v=FKcUJb3rIg0", "https://www.youtube.com/watch?v=Md0WxKSzhyM", "https://www.youtube.com/watch?v=FxCn9oAaVIQ", "https://www.youtube.com/watch?v=s6NPpO4gbeU", "https://www.thoughtco.com/history-of-the-yellow-star-1779682", "https://commons.wikimedia.org/wiki/File:Tatuerat_f%C3%A5ngnummer.jpg", "https://www.youtube.com/watch?v=7FouQAgpGiQ", "https://www.youtube.com/watch?v=U88ZKJhztiM", "https://www.youtube.com/watch?v=Z6Vmb1QV4BM&list=WL&index=5", "https://www.corbettreport.com/gates/", "https://news.mit.edu/2019/storing-vaccine-history-skin-1218", "https://stm.sciencemag.org/content/11/523/eaay7162", "https://news.rice.edu/2019/12/18/quantum-dot-tattoos-hold-vaccination-record/", "https://www.corbettreport.com/gates/", "https://web.archive.org/web/20200501220734/https://www.modernatx.com/sites/default/files/RNA_Vaccines_White_Paper_Moderna_050317_v8_4.pdf", "https://www.fiercebiotech.com/medical-devices/profusa-awarded-7-5-million-darpa-grant-to-work-implantable-biosensors", "https://www.prnewswire.com/news-releases/profusa-and-partners-announce-initiation-of-study-to-measure-early-signs-of-influenza-through-biosensor-technology-301014961.html", "https://www.defenseone.com/technology/2020/03/military-funded-biosensor-could-be-future-pandemic-detection/163497/", "https://www.sciencedirect.com/science/article/abs/pii/S0956566317307698", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6158836/", "https://www.wired.com/2013/11/remote-controlled-vaccine-delivery/", "https://www.sciencedirect.com/science/article/pii/S026412752030767X", "https://www.corbettreport.com/gates/", "https://www.technologyreview.com/2014/07/04/74389/a-contraceptive-implant-with-remote-control/", "https://nationalpost.com/news/bill-gates-funds-birth-control-microchip-that-lasts-16-years-inside-the-body-and-can-be-turned-on-or-off-with-remote-control", "https://darebioscience.com/microchips-biotech/", "https://www.sciencedirect.com/journal/iscience/special-issue/10DJMM5T1K7", "https://newatlas.com/nanobots-blood-drug-delivery/38064/", "https://www.sciencedirect.com/science/article/abs/pii/S0167779918302580", "https://www.cbc.ca/news/canada/ottawa/covid-19-research-edible-vaccine-plants-tomato-lettuce-mucosal-immunity-1.5626484", "https://science.sciencemag.org/content/335/6070/831", "https://advances.sciencemag.org/content/6/44/eabb4133", "https://home.solari.com/", "https://home.solari.com/deep-state-tactics-101-the-covid-injection-fraud-its-not-a-vaccine/", "https://www.corbettreport.com/interview-1550-catherine-austin-fitts-exposes-the-injection-fraud/", "https://off-guardian.org/2020/12/19/how-belarus-exposes-the-lockdown-lie/", "https://www.cnbc.com/2020/12/16/covid-vaccine-side-effects-compensation-lawsuit.html", "https://dryburgh.com/james-lyons-weiler-coronavirus-vaccine-safety-warning/", "https://archive.org/details/virusvaccinetrue00debb/mode/2up", "http://www.sv40.org/CPV-link.html", "https://archive.is/GBuBm", "https://www.history.com/news/swine-flu-rush-vaccine-election-year-1976", "https://archive.org/details/60-minutes-mike-wallace-exposes-the-1976-swine-flu-pandemic-vaccine-injuries", "https://www.cdc.gov/vaccinesafety/concerns/history/narcolepsy-flu.html", "https://www.npr.org/sections/health-shots/2013/11/26/247379604/2009-flu-pandemic-was-10-times-more-deadly-than-previously-thought", "https://www.bmj.com/content/340/bmj.c2947.full", "https://www.youtube.com/watch?v=jB4FUHHMI24", "https://www.corbettreport.com/category/podcasts/"], "authors": [], "publish_date": "2020-12-23T13:30:44+00:00"}