{"result_id": "288037", "URL": "https://expose-news.com/2023/01/23/truth-be-told-victims-gather-to-raise-awareness/", "timestamp": "2023-04-25 17:18:59 CEST+0200", "meta": {"description": "On Saturday some brave and determined victims of the covid “vaccines” and their supporters gathered in London to make their presence known. This was one of the events being organised by the UK’s ‘Truth be Told’ campaign this month to raise awareness of vaccine injuries and deaths.  Below are some highlights. You can watch the…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/23/truth-be-told-victims-gather-to-raise-awareness/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Truth be Told: Victims gather to raise awareness of vaccine injuries and deaths", "cleaned_text": "On Saturday some brave and determined victims of the covid “vaccines” and their supporters gathered in London to make their presence known.\n\nThis was one of the events being organised by the UK’s ‘Truth be Told’ campaign this month to raise awareness of vaccine injuries and deaths. Below are some highlights. You can watch the entire rally HERE.\n\nPeaceful protestors in London threw white roses across a police border on Downing Street in a demonstration to honour the victims of covid injections.\n\nBefore going to Downing Street, the rally met outside the BBC Broadcasting House in Central London where various people spoke in support of the people killed and harmed by the covid injections. Speakers included voices of the vaccine injured and bereaved, as well as: Robert F. Kennedy, Jr., Dr. Robert Malone, Matt Le Tissier, Dr. Christian Buckland, Mark Sharman, Brianne Dressen, Cat Parker, John Watt, Alex Kelly, Alex Mitchell, Adam Rowland, Adrian Walker, Kristy Munslow, Wayne Snaith, Tony Shingler, Ali Lilley, and Nicky Black. It was followed by a silent memorial procession.\n\nBelow is a clip of Matt Le Tissier’s speech. “[The BBC], over the last few years, has done more harm to people’s health than any man-made virus could ever f**ing do,” he said.\n\n“You’re meant to hold government accountable on behalf of ‘we the people’, but you let us down badly and the majority of people, I believe, now know this. They see you for what you are – a government propaganda arm … [The media] it’s time for you [ ] to choose your side. Because, we are the many and they are the few. And we are coming for you.”\n\nAndrew Bridgen, Member of Parliament for North West Leicestershire, also spoke at the event:\n\n“We were told that these novel medical treatments … they were 100% effective. That was a lie … And we were told that they were safe and I get email after email, message after message, letter after letter from people and all that tells me, that that was a lie as well … I’m sick to death of the lies … The truth will prevail.”\n\nFor those who want to cling to the narrative that the covid injections are “safe and effective” it would be advisable to look at the swathe of evidence that says otherwise. Ignorance cannot be claimed as an excuse. We, along with many others, have been warning of the risks and dangers of covid injections from before the first dose was given to a member of the public in December 2020. And, over the years we, as with many, have published numerous calls from doctors and scientists to halt the vaccination programme. Even a quick scroll through a list of our recently published articles will point to a variety of sources indicating a variety of life-threatening and serious harms caused by the injections.\n\nWhen information is viewed through an honest lens, try as they might, those who attempt to give the “vaccines” the benefit of the doubt, as Professors Martin Neil and Norman Fenton have done, can only conclude the injections are unsafe.\n\nThe Devil’s Advocate: An Exploratory Analysis of 2022 Excess Mortality\n\nIn December, Profs. Neil and Fenton wanted to act as the “devil’s advocate” and test whether there was evidence to support alternative causes of excess deaths, not the vaccination programme. They looked at the data to test a variety of hypotheses:\n• Stringency of lockdown measures in 2020/21 causing additional deaths in 2022.\n• The covid vaccinations administered in late 2020 and 2021 are causing excess deaths in 2022.\n\nThe data the two professors used was from published government sources for weeks 1-44 of 2022. They concluded from their exploratory analysis:\n• Clearly the surge in covid-19 and its effect on excess deaths shows the vaccines are not effective. This looks self-evident and this isn’t news.\n• There is no evidence to support long-covid as a cause of excess deaths.\n• There is weak evidence of the negative effect of lockdown measures.\n• Healthcare quality looks to be irrelevant, but we are not satisfied we have good metrics for this.\n• There is a clear signal that the vaccination programme is causing, at least, some of the excess death rate. With this data, the vaccines don’t look to be safe.\n\nThey presented their work at a Pandemics Data & Analytics (“PANDA”) Open Science meeting. Prof. Fenton presented first talking about flawed covid definition, data and modelling. And Prof. Neil presented his work on excess deaths. You can watch their presentations on PANDA’s Rumble channel and read a summary on their Substack page HERE.\n\nThe mRNA Vaccines Could Wind Up in Food Supplies\n\nMeanwhile, the US Food and Drug Administration and Centres for Disease Control are investigating the impact of vaccines and possible links to stroke in elderly people. Early signs suggest that boosters may play a part in ischemic stroke, The Epoch Times’ ‘Crossroads’ reported.\n\nBut that’s not all. Instead of banning the use of harmful and dangerous mRNA technology, it seems they are attempting to find additional ways to broaden its use – without our consent. New food programs could result in mRNA vaccines in the world’s food supplies. This is raising concerns over the potential impact the vaccines could have on people who regularly consume products with the controversial drugs.\n• Pharma Plots to Inject Livestock With mRNA ‘Vaccines,’ Likely to End up in Food Supply PJ Media, 12 January\n• Bill Gates has been giving UKAid tens of millions to genetically modify livestock, The Exposé, 4 January 2023\n• Video: America Risks Falling Under the Control of a Biomedical Security State: Dr. Aaron Kheriaty Part 1 and Part 2", "opengraph": {"type": "article", "title": "Truth be Told: Victims gather to raise awareness of vaccine injuries and deaths", "url": "https://expose-news.com/2023/01/23/truth-be-told-victims-gather-to-raise-awareness/", "description": "On Saturday some brave and determined victims of the covid “vaccines” and their supporters gathered in London to make their presence known. This was one of the events being organised by the UK’s ‘T…", "article:published_time": "2023-01-23T08:30:00+00:00", "article:modified_time": "2023-01-22T18:51:03+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/FeatJan23.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://covileaks.co.uk/awareness-month", "https://expose-news.com/2023/01/08/uk-covid-vaccine-injured-awareness-month/", "https://live.childrenshealthdefense.org/chd-tv/events/london-truth-be-told-rally-giving-a-voice-to-the-injured-and-bereaved/london--truth-be-told-rally-giving-a-voice-to-the-injured-and-bereaved/", "https://t.me/childrenshd/4310", "https://t.me/covidpositivenews/2645", "https://t.me/childcovidvaccineinjuriesuk/2545", "https://t.me/lawyersoflight/10373", "https://expose-news.com/2020/12/03/head-of-pfizer-research-covid-vaccine-is-female-sterilization/", "https://expose-news.com/", "https://wherearethenumbers.substack.com/p/the-devils-advocate-an-exploratory", "https://www.pandata.org/about/", "https://rumble.com/search/video?q=pandata19", "https://wherearethenumbers.substack.com/p/the-devils-advocate-an-exploratory", "https://www.theepochtimes.com/the-mrna-vaccines-could-wind-up-in-food-supplies-cdc-investigates-vaccines-and-strokes_4992946.html", "https://pjmedia.com/news-and-politics/benbartee/2023/01/12/red-alert-pharma-plots-to-inject-livestock-with-mrna-vaccines-likely-to-end-up-in-food-supply-n1661277", "https://expose-news.com/2023/01/04/bill-gates-gives-ukaid-tens-of-millions/", "https://www.theepochtimes.com/covid-amnesty-could-lead-america-to-medical-tyranny-dr-aaron-kheriaty-part-1_4909855.html", "https://www.theepochtimes.com/america-risks-falling-under-the-control-of-a-biomedical-security-state-dr-aaron-kheriaty-part-2_4924230.html", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-23T08:30:00+00:00"}