{"result_id": "288006", "URL": "https://expose-news.com/2022/11/30/pfizer-confirm-covid-jab-damages-immune-system/", "timestamp": "2023-04-25 17:18:02 CEST+0200", "meta": {"description": "We have been sold an antivaccine as a vaccine. Official Government and Pfizer statistics prove that the \"old\" Pfizer COVID injection destroys the immune system at a rate greater than 1% per day. Now, the newly published study for Pfizer's new bivalent COVID vaccine, to combat both the original strain and Omicron, prove the old…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2022/11/30/pfizer-confirm-covid-jab-damages-immune-system/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Pfizer confirms COVID Vaccines damage the Immune System in recently published Study", "cleaned_text": "We have been sold an antivaccine as a vaccine.\n\nOfficial Government and Pfizer statistics prove that the “old” Pfizer COVID injection destroys the immune system at a rate greater than 1% per day.\n\nNow, the newly published study for Pfizer’s new bivalent COVID vaccine, to combat both the original strain and Omicron, prove the old Covid-19 vaccine had a minus-44% negative efficacy after just 30 days.\n\nThe same study also, unfortunately, proves the destruction of the immune system is only going to get worse, not better.\n\nFrom this information, we shall now prove that the original vaccine shots destroy the immune system at a rate of 44% per month.\n\nWe have known that the vaccines in effect cause VAIDS. But we had not realised how quickly they do that until now…\n\nPutting these results into a tabular form we get –\n\nLooking at the table above we see that adding 30 ug of the original Pfizer vaccine against Wuhan Hu1 (that everybody has taken for the 1st and 2nd shots and the boosters up until September 2022), to 30ug of the new Omicron BA4/5 vaccine component decreases its effectiveness after one month from 19.6x to 10.9x a reduction of 44%.\n\nLikewise adding 15ug of the old Wuhan Hu1 vaccine decreases the effectiveness of 15ug of the new Omicron BA4/5 vaccine component from 13.5x to 9.1x, a reduction of 33%.\n\nTabulating these results for Omicron BA1 neutralising antibody increase after one month we get the following –\n\nThese results lay bare what the Exposé has been demonstrating from government infection hospitalisation and death figures all over the world, many of which have now stopped publishing the relevant figures because they were worsening by the week and clearly displaying how lethal the vaccines are.\n\nThe original Pfizer vaccine not only had no efficacy against Omicron. It also progressively destroyed your immune system at the rate displayed above. It was an anti-vaccine against Omicron. It never had any positive effect on Omicron antibody levels.\n\nFurthermore, 30 days after your Pfizer booster shot (30 ug of vaccine against Wuhan Hu1) you would have had 44% fewer antibodies against Omicron than you had before you took the booster according to Pfizer’s own figures.\n\nIt was NEVER an immunity booster.\n\nIt was always an immunity disruptor, an immunity compromiser, an immunity nullifier, an immunity degrader, an immunity reducer. It was an incredibly effective immunity destroyer.\n\nWithin 30 days of taking your Pfizer booster, you lost 44% of your first level (antibody) immune response against the original Omicron variant BA1. That is why the infection rates in the vaccinated were so much worse than the infection rates in the unvaccinated for Omicron.\n\nWe no longer need government figures to see this. Because Pfizer has gone and done it for us. Their figures clearly show that the original vaccine causes a new form of Vaccine Acquired Immune Deficiency Syndrome (VAIDS) at an alarmingly fast rate of over 1% per day.\n\nThey were so keen to show the world how effective their new shots were, that they overlooked the fact that their data also proved how anti-effective their old shots were.\n\nI need to state this again clearly because it is so important.\n\nPfizer’s figures for the new vax versus the old vax prove that the old vax did not work against Omicron.\n\nPfizer’s bivalent versus monovalent trial results shows that one shot (30ug) of the old vaccine destroys 44% of your Covid19 antibodies in 30 days.\n\nSince one is not considered boosted until 14 days after the shot, it follows that the old boosters were never vaccines, they were always anti-vaccines, having a negative efficacy by day 14.\n\nMost Pfizer vaccinations taken by the majority of humans on the planet prior to September 2022, have systematically destroyed their immune response at an initial rate greater than 1% per day (44% in 30 days).\n\nMost Pfizer-vaccinated people now have VAIDS, and winter is coming.\n\nI remember when I wrote an article analysing German government figures out of the Robert Koch Institute in Berlin. They showed that vaccinated Germans were 8.1x more likely to be infected with Omicron than unvaccinated Germans.\n\nI then looked at the official figures for Australia, and they showed that vaccinated people were more than 10x likely to be infected than the unvaxxed.\n\nThe German government immediately changed their figures and claimed: “Oh we made a mistake”.\n\nThey found another 911 unvaccinated people who had allegedly caught Omicron.\n\nAre we really to believe that Germans, the best mechanical engineers in the world, routinely make mistakes with numbers?\n\nThis was no mistake. The Australian figures confirmed it back then. And Pfizer’s results above confirm it today.\n\nThere are half a million people in the UK with compromised immune systems. Many of them have absolutely zero antibodies to Omicron.\n\nJeremy Vine on BBC Radio 2 actually did a reasonable documentary on them on Thursday September 1 from 12:00 – 14:00. These people are condemned to spend the rest of their lives in total isolation having had 5 or 6 Covid vaccinations to no good end.\n\nTheir immune system can no longer produce ANY antibodies to Omicron. Jeremy interviewed several of them who confirmed that the COVID vaccines are useless for them. The government did not pay for them to discover that they had zero antibodies after 5 or 6 vaccinations. They had to have private testing done, which they paid for themselves, in order to find that out.\n\nThe solution for them is a drug called Evushield, which is a monoclonal antibody concoction. It literally gives them the antibodies that their immune system can no longer make. It is the Covid equivalent to antiretrovirals for AIDS.\n\nThe MHRA authorised the drug in March for immuno-compromised people. But you cannot get it on the NHS and you need 2 shots at £800 per shot. Many cannot afford it. So much for the NHS caring about the health of this country.\n\nObviously, if you cannot interact with anybody face to face, your earning capacity will be seriously reduced and the taxes you pay every year will likewise be significantly reduced. The idea that such a person is not worth £1600 to the economy over the rest of their lives is absurd.\n\nAn investment of £1600 would most likely be repaid within a year by the overall improvement to the economy from having another fit and healthy working person. And that is just the economic argument.\n\nThe social argument need not even be mentioned. Liz Truss is about to spend 200 Billion on energy apparently. We could fix every immuno-compromised person in the land for less than 1 billion. But that would not get any computer-generated Wuhan Hu1 spike proteins into them now, would it?\n\nThese immuno-compromised people had weak immunity to begin with, and now have absolutely zero immunity in many cases. That is where we will all end up if we continue taking any vaccination containing the genetic code for Covid spike proteins or taking the spike proteins themselves as is the case with the Novavax vaccine.\n\nOne woman interviewed on the radio said that she had not had a hug in 2½ years. Jeremy Vine suggested that the government paid for Covid tested huggers to go and visit people like her. At least that gave her a laugh.\n\nThe tragic thing about these immune-deficient people is that they are the ones least able to tolerate the immune system destruction mediated by the vaccines and yet they were always the first to be recommended to take the next shot.\n\nThey are the victims of the grossest medical negligence. They should all be given Evushield for that reason alone.\n\nPfizer has demonstrated a 44% immune degradation in 30 days at 30ug of the original Pfizer vaccine (the standard vaccine dose). I wonder if they will ever publish the 60 and 90-day figures?\n\nThere is no commercial need so to do, now that they have approval from all the regulators after a 30-day clinical trial. They stopped the 3½-year clinical trial number NCT04368728 from 2020 July 27 to 2024 February 8 of the original vaccine after 6 months, when they permitted the placebo group to become vaccinated.\n\nA 30-day clinical trial is not a completed clinical trial. It is a joke. Fauci himself said recently that we don’t have time to finish the clinical trials of the bivalent booster.\n\nThey could have made an omicron booster 8 months ago, in which case they would have had time. They could have made a delta booster a year ago. But they plainly have no interest in providing an up-to-date booster. They just want an excuse to fill the public full of the original computer-generated spike proteins.\n\n30ug of the new monovalent Pfizer vaccine increased neutralising antibodies by 19.6x after 30 days.\n\n\n\n15ug + 15ug of the bivalent Pfizer vaccine increased neutralising antibodies by 9.1x after 30 days.\n\nSo the monovalent vaccine, the fully updated vaccine, was 2.15x better (19.6/9.1) than the bivalent vaccine. \n\n\n\nIt produced actually 115% more antibodies against Omicron than the bivalent vax, because it was fully updated rather than partially updated. The only disadvantage to the monovalent vaccine for the authorities is that it does not fill you up with computer-generated Wuhan Hu1 spike proteins.\n\nSo which one did the FDA authorise? https://www.fda.gov/emergency-preparedness-and-response/coronavirus-disease-2019-covid-19/covid-19-bivalent-vaccine-boosters\n\nThey authorised the bivalent one of course. They did not authorise the monovalent one.\n\nWhat’s happening here is that the old vaccine, designed against Wuhan Hu1 (which was never isolated and was computer generated and I doubt was ever in circulation) has zero efficacy against Omicron. All it does is progressively damage your immune system.\n\nWhereas the new vaccine, being designed against Omicron, does have good initial efficacy against it as the figures above demonstrate. But all Covid variant spike proteins are anti-vaccines to the entire immune system and cause Vaccine Mediated AIDS progressively as more and more spike proteins infect your T cells.\n\nThis is true for both the new and old vaccines.\n\nWe have been sold an anti-vaccine for Omicron as a vaccine for Omicron and Pfizer’s own figures now show it.\n\nThe reason the reduction in efficacy after 30 days is 11% higher with the 30ug + 30ug shot than it is with the 15ug + 15ug shot is that the larger the dose, the more spike proteins your body makes and the more damage they do to your immune system in 30 days.\n\nIf you want to cause no damage to your immune system then do not put any spike proteins or spike protein-producing vaccines into your body.\n\nThere is a great new study from Harvard, John’s Hopkins, Oxford, Edinburgh, California and other Universities showing that for every 1 person whom the vaccines saved from hospitalisation (according to government figures), 18-98 people suffered serious life-altering adverse reactions.\n\nIt is an amazing world wherein such prestigious universities are 6 months behind writers for the Exposé.\n\nThere was a fascinating comment by a switched-on woman in the Telegraph. She asked:\n\n‘Is this whole Covid thing some kind of intelligence test?’\n\nA brainwashing test from the globalist demons and a wisdom test from the nationalist God of freedom, who forced us into nations at Babel in order to prevent a global political monopoly such as the WEF, would be my answer.\n\nWe can project forward the antibody levels post-vaccination in the bivalent vaccinated compared to the monovalent vaccinated month by month by continuing to reduce them by 44.4% and 32.6% respectively every 30 days as follows\n\nThis analysis projects only the extra reduction in antibody levels caused by adding an equal quantity of the old vax to the new vax. It does not include the reduction in antibodies caused by the new vax spike proteins themselves. It also fails to take into account the fact that your immune system is gradually wiping out vaccinated cells, So that spike protein production will fall off progressively throughout the extrapolated period which will reduce the rate of attrition of antibodies. These two omitted factors are opposite in effect.\n\nWe know how much damage 30ug of spike protein (either new or old) does in the first month. It is 32.6%. So we should reduce all the figures above by an extra 32.6% per month.\n\n\n\nWe also know that spike protein production tails off reasonably quickly at more or less the same rate. So we shall assume that these two effects more or less cancel each other out.\n\nThe fascinating thing about the extrapolation is that the lower dose does much better than the higher dose from month 2 onwards (being less destructive to the immune system). This supports something I have been saying from the start of the vaccination program, namely that the doses are way too high. They are gene therapy doses, not vaccination doses.\n\nThe 60 ug shot fails to provide any extra protection and starts to go negative at 5 months.\n\nThe 30 ug shot fails to provide any extra protection and starts to go negative at 7 months.\n\nA 1 ug shot would have provided extra protection for the entire pandemic and would not have caused nearly as many adverse reactions and would have killed almost nobody because most immune systems would have been able to deal with the 30x smaller number of spikes.\n\nSo here is what the new shots should have been if you are going to permit mRNA shots. Of course, nobody will implement this because the shots are not about health. But I am entitled to use hindsight here because the bivalent shots were both made and approved with hindsight available.\n\n1. Use the 87½% of non-spike viral proteins rather than the 12½% of viral spike proteins\n\n2. Reduce the dose from 30ug to 1ug\n\n3. Regularly update the vaccination to include non-spike protein parts only from variants actually in circulation as we do with flu shots\n\n4, Do not substitute Uracil for N1 Methyl Pseudouridine in the mRNA coding for the viral parts. That is a lethal gene hack that should never be approved by any regulator with any understanding of genetics.\n\nBut giving anybody a gene therapy shot for which no clinical studies have ever been permitted to continue for more than 6 months is extreme medical fraud (any act OR OMISSION intended to deceive).\n\n\n\nAnd giving people a gene therapy shot for which no clinical studies have lasted more than 30 days is likewise criminal. \n\n\n\nAny doctor who vaccinates people with these bivalent jabs knowing the Pfizer results above or knowing that we presently have only 30 days of clinical trial data to support them should be suspended. He has broken the Hippocratic oath. Indeed the administrations of the CDC, the FDA and the MHRA should be sacked for recommending and approving them.\n\nThe Novavax approach applied to the above would have been the best and most benign vaccination answer (indeed that is precisely what we presently do with flu shots and Covid19 is just another type of flu). But vitamin D3, direct sunlight, mouthwashes containing Cetyl Pyridinium Chloride and spending an hour breathing chlorinated air in an indoor pool facility, Ivermectin, Hydroxy Chloroquine and monoclonal antibodies are all more effective and less dangerous.\n\nI am a supporter of Trump simply because he is not a politician. But his ‘Operation Warp Speed’ was and continues to be the worst medical intervention in the history of healthcare. And the sooner he recognises it the better. I suspect that he does recognise it but cannot publicly declare his position politically.\n\nWith regard to the extrapolation above, the performance of the new vaccinations is better than that of the old ones because they actually code for a variant in circulation (to some extent), rather than a computer-generated artefact that has never been isolated and was never in circulation IMHO. So they produce more directly focused protection.\n\nBut they are just as lethal to the immune system, the cardiovascular system and the central nervous system and to all body organs.\n\nSo they start from a higher point and their protection against the alleged Omicron variant lasts longer (7 months rather than 0 months).\n\nBut the spikes and the fake uracil are just as destructive to your general health as the old vaccine was. So their VAERS results will be equally as bad. So they are in effect just a greater fool’s paradise than their predecessors.", "opengraph": {"type": "article", "title": "Pfizer confirms COVID Vaccines damage the Immune System in recently published Study", "url": "https://expose-news.com/2022/11/30/pfizer-confirm-covid-jab-damages-immune-system/", "description": "We have been sold an antivaccine as a vaccine. Official Government and Pfizer statistics prove that the “old” Pfizer COVID injection destroys the immune system at a rate greater than 1%…", "article:published_time": "2022-11-30T07:00:00+00:00", "article:modified_time": "2022-11-29T18:00:09+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/11/pfizer-confirms.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "639", "height": "360", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"639\" height=\"360\" src=\"https://www.youtube.com/embed/RexHOEpyUN4?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/RexHOEpyUN4?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["#", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-granted-fda-emergency-use-authorization", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-omicron-adapted-covid-19", "https://expose-news.com/2022/07/04/evidence-covid-vaccines-cause-ai-d-s/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/2022/03/26/pfizergate-worldwide-conspiracy-hide-covid-vaccines-cause-a-i-d-s/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://www.fda.gov/emergency-preparedness-and-response/coronavirus-disease-2019-covid-19/covid-19-bivalent-vaccine-boosters", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4206070", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2022-11-30T07:00:00+00:00"}