{"result_id": "288012", "URL": "https://expose-news.com/2023/04/12/government-confirms-horrific-figures-on-covid-vaccine-deaths/", "timestamp": "2023-04-25 17:18:18 CEST+0200", "meta": {"description": "The UK Government has published official figures on deaths following Covid-19 vaccination and they reveal that 1 in every 482 Covid-19 vaccinated people in England sadly died within one month of Covid-19 vaccination, 1 in every 246 Covid-19 vaccinated people in England sadly died within 60 days of Covid-19 vaccination, and 1 in every 73…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/04/12/government-confirms-horrific-figures-on-covid-vaccine-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Government confirms horrific figures on COVID Vaccine Deaths: 1 in 482 died within a month, 1 in 246 d died within 60 days, & 1 in 73 died by May 2022", "cleaned_text": "The UK Government has published official figures on deaths following Covid-19 vaccination and they reveal that 1 in every 482 Covid-19 vaccinated people in England sadly died within one month of Covid-19 vaccination, 1 in every 246 Covid-19 vaccinated people in England sadly died within 60 days of Covid-19 vaccination, and 1 in every 73 Covid-19 vaccinated people were dead by May 2022.\n\nThe Office for National Statistics (ONS) is the UK’s largest independent producer of official statistics and the recognised national statistical institute of the UK, and on the 6th July, they published a dataset containing a whole host of horrifying data on deaths by vaccination status in England between 1st Jan 2021 and 31st May 2022.\n\nTable 9 of the dataset contains figures on ‘Whole period counts of all registered deaths grouped by how many weeks after vaccination the deaths occurred; for deaths involving COVID-19 and deaths not involving COVID-19, deaths occurring between 1 January 2021 and 31 May 2022, England’.\n\nHere’s a snapshot of how the ONS presents the data –\n\nAs you can see, the ONS still don’t make it easy for us by revealing the overall number of deaths, but with some patience and simple maths we can easily find this out ourselves.\n\nThe following chart shows the overall number of deaths within one month/five weeks of Covid-19 vaccination in England between 1st Jan 2021 and 31st May 2022 –\n\nAccording to the Office for National Statistics between 1st Jan 21 and 31st March 22, a total of 9,891 people died with Covid-19 within 1 month of vaccination, and a total of 82,255 people died of any other cause within 1 month of vaccination.\n\nThis means that in all, 92,146 people died within one month of Covid-19 vaccination between January 2021 and May 2022.\n\nThe following chart shows the overall number of deaths within 60 days of Covid-19 vaccination in England between 1st Jan 2021 and 31st May 2022 –\n\nAccording to the Office for National Statistics between 1st Jan 21 and 31st May 2022, a total of 14,103 people died with Covid-19 within 60 days of vaccination, and a total of 166,556 people died of any other cause within 60 days of vaccination. This means that in all, 180,659 people died within 60 days of Covid-19 vaccination between January 2021 and May 2022 in England.\n\nThe following chart shows the overall number of deaths following Covid-19 vaccination in England between 1st Jan 2021 and 31st May 2022 based on the figures provided by the ONS –\n\nAccording to the Office for National Statistics between 1st Jan 21 and 31st May 22, a total of 41,117 people died with Covid-19 following Covid-19 vaccination, and a total of 565,420 people died of any other cause following Covid-19 vaccination. This means that in all, 606,537 people sadly died by 31st May 2022 following Covid-19 vaccination.\n\nAccording to the UK Health Security Agency, in England, 44.5 million people have received at least one dose of a Covid-19 vaccine.\n\nTherefore, using simple maths, we find that 1 in every 482 vaccinated people has died within 1 month of Covid-19 Vaccination in England.\n\n1 in every 246 people has died within 60 days of Covid-19 vaccination in England.\n\nAnd 1 in every 73 Covid-19 vaccinated people in England were sadly dead by the end of May 2022.\n\nOf course, some of these deaths can be attributed to other causes and would have most likely occurred anyway, but the figures are representative of a real serious problem. We know this thanks to further data from the Office for National Statistics confirming the unvaccinated population in England has the lowest mortality rate per 100,000 population in all age groups.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among each age group for Non-Covid-19 deaths in England between January and May 2022, using the figures contained in table 2 of the recently published dataset collated by the UK Government agency, the Office for National Statistics –\n\nThese are age-standardised figures. There is no other conclusion that can be found for the fact mortality rates per 100,000 are the lowest among the unvaccinated other than that the Covid-19 injections are killing people.\n\nSo now the question is, will you be coming forward for another dose of the now proven deadly Covid-19 injections this autumn/winter?", "opengraph": {"type": "article", "title": "Government confirms horrific figures on COVID Vaccine Deaths: 1 in 482 died within a month, 1 in 246 d died within 60 days, & 1 in 73 died by May 2022", "url": "https://expose-news.com/2023/04/12/government-confirms-horrific-figures-on-covid-vaccine-deaths/", "description": "The UK Government has published official figures on deaths following Covid-19 vaccination and they reveal that 1 in every 482 Covid-19 vaccinated people in England sadly died within one month of Co…", "article:published_time": "2023-04-12T07:59:12+00:00", "article:modified_time": "2023-04-12T07:59:20+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/482-246-73.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/image-5.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/image-8.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/image-10.png?ssl=1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1088929/Weekly_Flu_and_COVID-19_report_w27.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/image-12.png?ssl=1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1088929/Weekly_Flu_and_COVID-19_report_w27.pdf", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/09/image-13.png?ssl=1", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-04-12T07:59:12+00:00"}