{"result_id": "288004", "URL": "https://expose-news.com/2023/02/18/medical-tyranny-soaring-excess-deaths-failed-vaccine/", "timestamp": "2023-04-25 17:17:59 CEST+0200", "meta": {"description": "Just in time for some good weekend viewing, the remaining presentations from the conference in Stockholm are now available - including the final presentation of the conference given by Dr. Astrid Stuckelberger titled ‘From Biology to Population: Evidenced-Based Public Health Situation Analysis, Lessons and Next Steps’. An American vaccine-injured pilot tells his harrowing story of…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/02/18/medical-tyranny-soaring-excess-deaths-failed-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Covid Related News: Medical tyranny continues in Canada, soaring excess deaths in Germany and Moderna admits mRNA flu “vaccine” has failed", "cleaned_text": "Just in time for some good weekend viewing, the remaining presentations from the conference in Stockholm are now available – including the final presentation of the conference given by Dr. Astrid Stuckelberger titled ‘From Biology to Population: Evidenced-Based Public Health Situation Analysis, Lessons and Next Steps’.\n\nAn American vaccine-injured pilot tells his harrowing story of what the covid injection did to him. But despite the ever-growing evidence of serious adverse effects, health authorities in Canada insist patients “get vaccinated” or else they are not eligible for organ transplants. Based on information contained in the vaccination consent form and recent cases where uninjected patients have been denied transplants, it could be that 76% of Canadians are ineligible for organ or stem cell transplants.\n\nMeanwhile, Germany saw a staggering 50% excess deaths at the end of 2022 – higher than at any time since the covid era began – and speaking in Australia, Dr. Peter McCullough demanded an urgent investigation into Australian sudden deaths. Perhaps providing some of the answers, Dr. Naomi Wolf revisits the results of autopsies performed by German pathologist Professor Arne Burkhardt in 2021.\n\nLast but not least, Moderna admits its mRNA flu “vaccine” is a failure.\n\nThe following is a summary of a few recent articles published by others. Excepting the first, click on the section title to read the full article.\n\nRemaining Presentations Are Now Available for Stockholm Conference\n\nA few days ago when we published an article about Dr. Astrid Stuckelsberger’s account of her microphone being cut-off at the ‘Pandemic Strategies: Lessons and Consequences’ conference held in Stockholm, Sweden, there were three presentations that were still to be uploaded on Läkaruppropet’s website HERE and Rumble channel HERE. These presentations have now been uploaded and you can watch:\n• Attorney Philipp Kruse’s presentation on the legal issues and solutions regarding mRNA as the new “platform technology” HERE (45 mins).\n• WHO whistle-blower Dr. Astrid Stuckelberger’s presentation on biology to population HERE (50 mins).\n• Panel discussion: Where are we heading and what should we strive for? HERE (20 mins).\n\nIn our article, we noted that Dr. Glenn Dormer had said Dr. Stuckelberger’s presentation was cut short after 40 mins, although some accounts claim he said she was cut short at 30 mins. The programme showed that Dr. Stuckelberger’s allotted time was 40 mins. We haven’t yet watched it, but the video of her presentation is 50 mins which would suggest Dr. Stuckelberger had indeed run over time, rather than was cut short, as other presenters suggested.\n\nPlease don’t allow disagreements between researchers to get in the way of your own quest for the truth. All the Stockholm conference presentations, that researchers worked hard to prepare and present for our benefit, come highly recommended. Watch them and share them. We thank Läkaruppropet for making all these presentations available to us.\n\nHelicopter and Fixed-Wing Pilot Describes His Injury from The Covid-19 Injection\n\nUS Freedom Flyers published a personal account from vaccine-injured Tim McAdams who has been an aeroplane/helicopter pilot for 41 years. He had NO underlying health conditions before getting the Pfizer-BioNTech covid-19 injection.\n\n“Initially, I did not get vaccinated due to the unknown risks, even though my company continued sending emails saying it was in the best interest of their employees and their families to get vaccinated and they encouraged employees to do so. It wasn’t until the company mandated the covid-19 shot or be terminated that my wife and I discussed it.\n\n“I received the second shot of the Pfizer-BioNTech covid-19 on 17 Nov 2021. During the night of 28 Nov, at the age of 59, I suffered the first of two strokes.”\n\nAre 76% of Canadians Ineligible for Transplant?\n\nYesterday, we published an article about a mother of two in Victoria, Australia who is being denied a heart transplant because she is not injected with a covid “vaccine.” The medical tyranny of denying treatment to those who sensibly chose not to be injected has also been happening in Canada.\n\nA month ago, Sheila Annette Lewis was the second transplant case in the Province of Alberta who has been denied a life-saving transplant because she is unvaccinated. Lewis challenged the ruling but was still denied on appeal.\n\nSheldon Yakiwchuk highlighted that the covid injection consent form states for “protein-based” covid injections for 12 years and older:\n\nThe vaccination consent form goes on to recommend a third dose, or “booster” dose, 5 months after the last dose. “However, if you are at high risk of getting very sick from covid-19 because of a health condition or you live in a seniors care facility, such as a nursing home, you can get a booster dose 3 months after your last dose,” the consent form states.\n\nDoes this mean a person who is expecting to have a transplant must have a third dose? If so, Yakiwchuk deduced, 76% of the population of Canada can be declined for transplant surgery. Not because they haven’t been “vaccinated” but because they haven’t been boosted during the previous 6 months.\n\nHe calculated the percentage ineligible for a transplant from the Health Canada Statistics dashboard which shows the percentage of the population who have received a covid injection in the previous 6 months.\n\nGermany had a staggering 50% excess deaths in the week ending 25 December, things were a little better with ”only” 44% excess deaths in the week ending 1 January.\n\nThis is worse than at any point during covid, Peter Imanuelsen wrote. “[And] covid is not what is causing these excess deaths,” he added and demonstrated why.\n\nAmerican cardiologist Dr. Peter McCullough is touring Australia. Speaking at sold-out events down the east coast this week, said the sudden increase in deaths from unknown causes demanded an urgent inquiry.\n\n“When young people have a cardiac arrest, the cause – prior to Covid – is known. What is extremely disturbing now in the era of (Covid) vaccines is that there are sudden deaths with no explanation,” he said. “We should never accept someone who has taken the vaccine died and then had the death declared ‘unknown’.”\n\nAutopsies Revealed Catastrophic Lesions on Many Organs Likely Caused By Covid Vaccine\n\nDr. Arne Burkhardt and seven other international pathologists did autopsies at the end of 2021. They autopsied 30 deceased people, and they did so at the request of their loved ones. The loved ones were not satisfied with the results of their first autopsies. These were people ranging from 28 years old to in their 90s. What they found is catastrophic lesions throughout the body in many organs – blood damage, spleen, liver, brain, skin, and testes.\n• Two top Pathologists reveal astonishing results of an investigation into ten deaths linked to the Covid-19 Vaccines – “We’ve never seen anything like it…”\n• Scientific evidence suggests the Covid Vaccines reprogram the innate Immune System & cause lymphocytes to attack the body’s organs\n• ‘Lymphocytes Amok’ Post-Covid Injection Is Very Alarming, Says Pathologist\n\nThey don’t even work better than the (useless) flu shot. But they do have far more side effects. Don’t take it from me, wrote Alex Berenson, take it from Moderna!\n\nModerna’s leading mRNA influenza injection has failed, the company said on Thursday.\n\nIn a large clinical trial, the vaccine appeared LESS able to stimulate the immune system than older flu vaccines for two of four flu strains, the company said. It also had far higher rates of side effects than the older shots.\n\nModerna said it was changing the vaccine as a result of the trial failure and hoped to retest it in another clinical trial. But Moderna stock fell about 5 per cent yesterday, indicating that investors are sceptical of its plan.", "opengraph": {"type": "article", "title": "Covid Related News: Medical tyranny continues in Canada, soaring excess deaths in Germany and Moderna admits mRNA flu “vaccine” has failed", "url": "https://expose-news.com/2023/02/18/medical-tyranny-soaring-excess-deaths-failed-vaccine/", "description": "Just in time for some good weekend viewing, the remaining presentations from the conference in Stockholm are now available – including the final presentation of the conference given by Dr. As…", "article:published_time": "2023-02-18T10:00:00+00:00", "article:modified_time": "2023-02-17T20:25:35+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/FeatFeb18a.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://expose-news.com/2023/02/15/who-whistle-blower-shut-down-at-stockholm/", "https://lakaruppropet.se/international-conference-pandemic-strategies/", "https://lakaruppropet.se/international-conference-pandemic-strategies/", "https://rumble.com/user/Lakaruppropet", "https://rumble.com/v29r5r4-mrna-technology-lessons-and-consequences-full.html", "https://rumble.com/v29r80i-mrna-as-the-new-platform-technology-legal-issues-and-solutions-full.html", "https://rumble.com/v29u6b6-from-biology-to-population-evidence-based-public-health-lessons-and-next-st.html", "https://rumble.com/v29u89g-panel-discussion-where-are-we-heading-and-what-should-we-strive-for-full.html", "https://lakaruppropet.se/wp-content/uploads/2023/01/Program-eneglska.pdf", "https://usfreedomflyers.substack.com/p/helicopter-and-fixed-wing-pilot-describes", "https://sheldonyakiwchuk.substack.com/p/are-76-of-canadians-non-eligble-for", "https://expose-news.com/2023/02/17/australian-health-authorities-deny-mother-heart/", "https://www.westernstandard.news/alberta/smith-bows-to-doctors-in-case-of-woman-denied-transplant-because-of-vax-status/article_602e5dd2-95e9-11ed-8d04-cfedf3f466ea.html", "https://www.jccf.ca/court-ruling-a-death-sentence-for-unvaccinated-transplant-candidate/", "https://www.albertahealthservices.ca/frm-21765.pdf", "https://health-infobase.canada.ca/covid-19/vaccination-coverage/", "https://petersweden.substack.com/p/excess-germany", "https://ourworldindata.org/coronavirus#explore-the-global-situation", "https://www.rebelnews.com/cardiologist_demands_urgent_investigation_into_sudden_australian_deaths", "https://palexander.substack.com/p/dr-naomi-wolf-and-steve-bannon-autopsies", "https://expose-news.com/2021/09/26/two-top-pathologists-reveal-astonishing-results-of-investigation-into-ten-deaths-linked-to-the-covid-19-vaccines-weve-never-seen-anything-like-it/", "https://expose-news.com/2021/12/10/scientific-evidence-suggests-the-covid-vaccines-reprogram-the-innate-immune-system/", "https://expose-news.com/2021/12/14/lymphocytes-amok-post-covid-injection-is-very-alarming-says-pathologist/", "https://alexberenson.substack.com/p/mrna-vaccines-fail-again", "https://investors.modernatx.com/news/news-details/2023/Moderna-Announces-Interim-Phase-3-Safety-and-Immunogenicity-Results-for-mRNA-1010-a-Seasonal-Influenza-Vaccine-Candidate/default.aspx", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-02-18T10:00:00+00:00"}