{"result_id": "288023", "URL": "https://expose-news.com/2023/04/13/bbc-news-spreads-disinfo-covid-vaccine-deaths/", "timestamp": "2023-04-25 17:18:34 CEST+0200", "meta": {"description": "Official UK Government data has revealed a startling truth that has left the people in a state of disbelief. England and Wales suffered the highest number of excess deaths in over half a century in 2022, and a non-stop weekly rally of excess deaths since week 16 of 2022 that equates to 62,543 excess deaths…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/04/13/bbc-news-spreads-disinfo-covid-vaccine-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "BBC News caught spreading Disinformation which accidentally confirms COVID Vaccination is in fact to blame for Excess Deaths in 2022 being the highest in 50 years", "cleaned_text": "Official UK Government data has revealed a startling truth that has left the people in a state of disbelief.\n\nEngland and Wales suffered the highest number of excess deaths in over half a century in 2022, and a non-stop weekly rally of excess deaths since week 16 of 2022 that equates to 62,543 excess deaths as of March 2023.\n\nAnd thanks to the BBC lying to the public, we know that the main cause of this huge increase in deaths is COVID-19 vaccination.\n\nWhat’s more shocking is that mainstream media reporters had made the decision to conceal the truth from the public, driven by their ambition and a belief that they will not be held accountable for their actions.\n\nThey thought the British public would be too lazy to “mark their homework,” so to speak.\n\nBut they didn’t count on an independent news organisation, committed to reporting the facts that the mainstream media refuse to, fact-checking their quietly published article.\n\nThe BBC, the widely but most definitely unjustly trusted news source/propaganda arm of the UK government, and its reporters have knowingly lied about the safety of the Covid-19 vaccine and lied to the public.\n\nThey unequivocally stated that the Covid-19 vaccine was not responsible for a record-breaking year of death, providing a “source” to prove it. They claimed that figures up to June 2022, looking at deaths from all causes, showed unvaccinated people were more likely to die than vaccinated people.\n\nThey then went on to state that –\n\nThe problem for the BBC, is that ‘The Expose’ has been analyzing the source provided by a UK government institution known as the Office for National Statistics (ONS) for months on end.\n\nAnd we can reveal that mortality rates per 100,000 in every single age group, even children, in England and Wales were lowest among the unvaccinated in some age groups as early as 2021, and lowest among the unvaccinated in all age groups by May 2022 at the latest.\n\nThe overdue updated report, finally published towards the end of February 2023, also confirms the unvaccinated had the lowest mortality rate per 100,000 throughout the whole of 2022.\n\nTherefore, BBC News has not only lied to the public, but has also admitted in black and white that the Covid-19 injections are to blame for 2022 being the worst year for deaths in half a century by confirming that\n\nThe moral of this story is always to check the official source, specifically table 2 in this case –\n\nAnd table 1 in the most recent, overdue report –\n\nAs you can see from the above, the mortality rate per 100,00 among the unvaccinated remained at pretty much the same level throughout the entirety of 2022, with no major increases, or dips.\n\nBut what’s concerning is the fact that the unvaccinated mortality rate was lower than the one dose vaccinated and two dose vaccinated for the entire year. And the 3+ dose vaccinated for 8 months of the year.\n\nHowever, if it were not for the fact the 3 dose + data includes those who have also had a fourth, or even fifth dose, we fully believe that the mortality rate would still be higher than the unvaccinated mortality rate for the entire year.\n\nBecause as you can see from the above chart, the fall is far too dramatic, and it coincides with the rollout of the Autumn 2022 Booster campaign as confirmed in a press release published by the JCVI –\n\nThis means the data for mortality rates on those who had 3 doses after Spring 2022 is unreliable because it includes a small portion of people who had a fourth dose in Spring and an even smaller portion of people who had a fifth dose in the Autumn.\n\nYou cannot trust the BBC.\n\nThe UK Government has clearly confirmed that mortality rates per 100,000 were highest among the vaccinated in every single age group throughout 2022\n\nThis means that people who have taken the Covid-19 vaccine have a higher chance of dying than the general population due to the intense damage it can do to the most vital organ in the human body, the heart, and the devastating decimation it does to the natural immune system.\n\nBut that is of no comfort to the thousands of families across the country who are still mourning the loss of loved ones as the truth about the catastrophic events of the past year comes to light.\n\nAccording to the ONS data published for the week ending 24th February 2023, which can be found here, 62,543 excess deaths were recorded between week 16 of 2022 and week 8 of 2023 against the 2015-2019 five-year average.\n\nWhilst 13,244 excess deaths have been recorded between week 1 and week 8 of 2023 alone.\n\nSadly, the consequences of this deception may yet be felt for years to come.", "opengraph": {"type": "article", "title": "BBC News caught spreading Disinformation which accidentally confirms COVID Vaccination is in fact to blame for Excess Deaths in 2022 being the highest in 50 years", "url": "https://expose-news.com/2023/04/13/bbc-news-spreads-disinfo-covid-vaccine-deaths/", "description": "Official UK Government data has revealed a startling truth that has left the people in a state of disbelief. England and Wales suffered the highest number of excess deaths in over half a century in…", "article:published_time": "2023-04-13T05:59:00+00:00", "article:modified_time": "2023-04-12T18:04:04+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/04/BBC-DISINFO.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.bbc.co.uk/news/health-64209221", "https://www.bbc.co.uk/news/health-64209221", "https://www.bbc.co.uk/news/health-64209221", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-62.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-63.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.gov.uk/government/news/jcvi-advises-an-autumn-covid-19-vaccine-booster", "https://www.gov.uk/government/news/jcvi-advises-an-autumn-covid-19-vaccine-booster", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsregisteredweeklyinenglandandwalesprovisional/weekending24february2023", "https://www.ons.gov.uk/visualisations/dvc2508/fig1/datadownload.xlsx", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-04-13T05:59:00+00:00"}