{"result_id": "288027", "URL": "https://expose-news.com/2023/04/05/vaccine-shedding-graphene-oxide-pfizer-docuents/", "timestamp": "2023-04-25 17:18:41 CEST+0200", "meta": {"description": "For over two years, concerned citizens around the world have been voicing their concerns about the safety of the novel Covid-19 mRNA vaccines. Yet, time and time again, they have been dismissed and labelled as conspiracy theorists by the mainstream media and medical establishment. However, recent developments have proven that these so-called conspiracy theories were,…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/04/05/vaccine-shedding-graphene-oxide-pfizer-docuents/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Vaccine Shedding & Graphene Oxide: Secret Pfizer Documents & Studies prove Graphene is in the COVID Vaccines & Shedding is sadly occurring with Deadly Consequences", "cleaned_text": "For over two years, concerned citizens around the world have been voicing their concerns about the safety of the novel Covid-19 mRNA vaccines. Yet, time and time again, they have been dismissed and labelled as conspiracy theorists by the mainstream media and medical establishment.\n\nHowever, recent developments have proven that these so-called conspiracy theories were, in fact, true all along.\n\nBecause confidential Pfizer documents, that the US Food and Drug Administration (FDA) attempted to delay the release of for 75 years, but were subsequently forced to publish by order of the US Federal Court; and various scientific studies have confirmed that the Pfizer Covid-19 vaccine does in fact contain a highly toxic substance known as Graphene Oxide.\n\nA substance that is so toxic that it has and still is destroying red blood cells and forming strange blood clots.\n\nUnfortunately, the same confidential Pfizer documents and various scientific studies also confirm that ‘vaccine shedding’ has been occurring. A process in which individuals who received the Covid-19 vaccine unintentionally shed the contents of it to others.\n\nThis means the not-vaccinated population have also suffered and is continuing to suffer the highly toxic effects of Graphene Oxide entering the body alongside other serious adverse events induced by the Covid-19 vaccines.\n\nOne of the studies confirming the vast majority of humanity has had absolutely no choice in the matter of whether they wish to get the Covid-19 injection or not because the vaccinated have been transmitting antibodies generated by the injections through aerosol was by conducted by scientists at the University of Colorado\n\nThe findings came as no surprise however, because a confidential Pfizer document given to the FDA had already confirmed shedding and exposure to the Covid-19 mRNA injections was perfectly possible by skin-to-skin contact and breathing the same air as someone who had been injected with the Covid-19 “vaccine”.\n\nThe study, titled ‘Evidence for Aerosol Transfer of SARS-CoV2-specific Humoral Immunity’, and published on 1st May 2022, was conducted by the following scientists for the University of Colorado –\n\nThe abstract of the study reads as follows –\n\nAnd here are the study authors’ main findings –\n\nThis proves Covid-19 vaccine shedding is perfectly possible when we take into account a study performed on behalf of Pfizer in Japan.\n\nThe study observed the distribution of the Covid-19 injection in the bodies of Wister Rats over a period of 48 hours. One of the most concerning findings from the study is the fact that the Pfizer injection accumulates in the ovaries over time.\n\nThe highest concentration was noted in the liver. But it also accumulates in the salivary glands on the skin.\n\nIt is not known if the injection continues to accumulate after 48 hours due to observations being curiously halted after this amount of time in the study.\n\nBut these results, coupled with the first study above, tell us that for a minimum of 48 hours, an unvaccinated person is at risk of being exposed to the Covid-19 injection if they breathe the same air as or touch the skin of a person who has been vaccinated.\n\nThis should however come as no surprise because Pfizer admitted as much in their ‘A PHASE 1/2/3, PLACEBO-CONTROLLED, RANDOMIZED, OBSERVER-BLIND, DOSE-FINDING STUDY TO EVALUATE THE SAFETY, TOLERABILITY, IMMUNOGENICITY, AND EFFICACY OF SARS-COV-2 RNA VACCINE CANDIDATES AGAINST COVID-19 IN HEALTHY INDIVIDUALS’ document.\n\nThe document contains a whole section covering the possibility of ‘mRNA vaccine shedding’ in which it is possible for those who have been in close proximity to someone who has had the Pfizer mRNA jab to suffer an adverse reaction.\n\nSection 8.3.5 of the document, describes how exposure during pregnancy or breastfeeding to the Pfizer mRNA jab during the trials should be reported to Pfizer Safety within 24 hours of investigator awareness.\n\nThis is strange because pregnant women / new mothers were and are not part of the safety trials.\n\nSo how can they be exposed?\n\nWell, Pfizer confirms that exposure during pregnancy can occur if a female is found to be pregnant and is environmentally exposed to the mRNA Covid-19 vaccine.\n\nThe document states that environmental exposure during pregnancy can occur if a female family member or healthcare provider reports that she is pregnant after having been exposed to the study intervention by inhalation or skin contact.\n\nOr if a male family member of a healthcare provider who has been exposed to the study intervention by inhalation or skin contact then exposes his female partner prior to or around the time of conception.\n\nIn layman’s terms, Pfizer is admitting in this document that it is possible to expose another human to the mRNA Covid vaccine just by breathing the same air or touching the skin of the person who has been vaccinated.\n\nAll of this makes the findings in a study conducted by Dr Philippe van Welbergen all the more concerning.\n\nFindings that are now supported as fact by the publication of a confidential Pfizer Document in February 2023.\n\nA document that the US Food and Drug Administration (FDA) has been forced to publish by order of the Federal Court in the USA. after arguing they wanted to delay the release of the documents for 75 years.\n\nDr Philippe van Welbergen (“Dr Philippe”), Medical Director of Biomedical Clinics, was one of the first to warn the public of the damage being caused to people’s blood by Covid injections by releasing images last year of blood samples under the microscope.\n\nAt the beginning of July 2021, Dr Philippe was interviewed and explained that when his patients started complaining about chronic fatigue, dizziness, memory issues, even sometimes paralysis and late onset of heavy menstruation (women in their 60s upwards), he took blood samples.\n\nTheir blood had unusual tube-like structures, some particles which lit up and many damaged cells. Few healthy cells were visible. Until three months earlier, he had never seen these formations in blood.\n\nThen in February 2022, Dr Philippe presented images of his latest blood slides and explained what the images show. His slides showed that vaccine-free patients have been “infected” with vaccine toxins through shedding, including what was claimed to be at the time, but is now known to definitely be graphene thanks to the US Federal Court.\n\nA full review of his slides can be viewed here. But here’s a short clip of his presentation –\n\nWhat Dr Philippe van Welbergen demonstrated is that the graphene being injected into people is organising and growing into larger fibres and structures, gaining magnetic properties or an electrical charge.\n\nAnd the fibres are showing indications of more complex structures with striations.\n\nHe also demonstrated that “shards” of graphene are being transmitted from “vaccinated” to vaccine-free or unvaccinated people, sadly destroying their red blood cells and causing strange blood clots.\n\nBelow is an image of typical healthy red blood cells as seen with a microscope, what blood should look like. There is no coagulation or foreign objects in it.\n\nThe next image is of a person who has been injected with the experimental Covid drug. The blood is coagulated, and the misshapen red blood cells are clumped together.\n\nThe cell encircled in the image is a healthy red blood cell, one of the few in the image, sitting alongside the graphene fibres.\n\nYou can see the size of the graphene fibres in relation to the size of a red blood cell. Fibres of this size will block capillaries.\n\nYou can also see the graphene fibres are hollow and contain red blood cells.\n\nBelow is the image of a blood sample from an eight-year-old unvaccinated child whose blood has been contaminated and destroyed by the transmission of graphene from those around him/her who had been given a Covid injection.\n\nThe child’s right arm and upper right leg are basically paralysed, the child is unable to lift his/her right arm and the thigh is not functioning properly.\n\nDr Philippe’s presentation is truly eye-opening and horrifying – a must-watch, especially for those who proclaim Covid injections are “safe” and are insisting people be injected. And the findings of Dr Phillippe’s study have now been proven as fact by the FDA being forced to publish confidential Pfizer documents.\n\nThe FDA had initially attempted to delay the release of Pfizer’s Covid-19 vaccine safety data for 75 years, despite approving the injection after only 108 days of a safety review on December 11th, 2020.\n\nHowever, a group of scientists and medical researchers sued the FDA under FOIA to force the release of hundreds of thousands of documents related to the licensing of the Pfizer-BioNTech Covid-19 vaccine.\n\nIn early January 2022, Federal Judge Mark Pittman ordered the FDA to release 55,000 pages per month, and since then, PHMPT has posted all of the documents on its website as they have been published.\n\nOne of the most recent documents published by the FDA saved as 125742_S1_M4_4.2.1 vr vtr 10741.pdf, confirms the use of Graphene Oxide in the manufacturing process of the Pfizer Covid-19 vaccine.\n\nThe document is a description of a study carried out by Pfizer between April 7th 2020 and 19th August 2020, with the objective being “to express and characterize the vaccine antigen encoded by BNT162b2.”\n\nWhat is most interesting about the study is that it confirms on page 7 that reduced Graphene Oxide is required to manufacture the Pfizer Covid-19 vaccine because it is needed as a base for the lipid nanoparticles.\n\nPfizer states on page 7 of the study in section 3.4 the following –\n\nA full investigation of the document can be read here. But this document proves that Graphene Oxide is indeed used in the manufacturing process of the Pfizer mRNA Covid-19 vaccine because it is vital in helping to make the vaccine’s lipid nanoparticles stable.\n\nTherefore, trace amounts or large amounts, depending on the batch of vaccine manufactured, of reduced Graphene Oxide inevitably make their way into the Pfizer Covid-19 injections.\n\nThe use of Graphene Oxide in the Pfizer Covid-19 vaccine has been a source of controversy and concern from the outset, with many individuals claiming that regulators and media outlets were deliberately misleading the public about its inclusion.\n\nDespite initial denials, the documents released by the FDA, which they were forced to publish by order of the Federal Court in the USA. have confirmed the use of Graphene Oxide in the manufacturing process of the Pfizer vaccine, raising questions about who we can trust.\n\nBut the Pfizer documents and studies also confirm Covid-19 vaccine shedding has been and still is occurring, destroying red blood cells and forming strange blood clots.\n\nTherefore, it would appear there was never any need to waste an extortionate amount of taxpayers’ money on propaganda to coerce the public into getting the Covid-19 injections.\n\nBecause the taxpayer never had a choice in the matter.\n\nAll they had to do was breathe.", "opengraph": {"type": "article", "title": "Vaccine Shedding & Graphene Oxide: Secret Pfizer Documents & Studies prove Graphene is in the COVID Vaccines & Shedding is sadly occurring with Deadly Consequences", "url": "https://expose-news.com/2023/04/05/vaccine-shedding-graphene-oxide-pfizer-docuents/", "description": "For over two years, concerned citizens around the world have been voicing their concerns about the safety of the novel Covid-19 mRNA vaccines. Yet, time and time again, they have been dismissed and…", "article:published_time": "2023-04-05T05:59:00+00:00", "article:modified_time": "2023-04-04T19:14:04+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/04/graphene-shedding-confirmed.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#ref-4", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#ref-5", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://biomedclinics.wixsite.com/biomedical/about-us", "https://expose-news.com/2021/08/31/german-doctors-and-lawyers-assess-blood-smears-from-people-who-have-had-covid-injections-for-me-this-is-euthanasia-for-me-this-is-mass-murder-a-crime-on-a-grand-scale/", "https://expose-news.com/2023/02/11/drs-graphene-shed-c19-vaccinated-to-unvaccinated/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-132.png?ssl=1", "https://phmpt.org/wp-content/uploads/2023/02/125742_S1_M4_4.2.1-vr-vtr-10741.pdf", "https://expose-news.com/2023/04/02/fda-confirms-graphene-is-in-the-covid-vaccines/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-04-05T05:59:00+00:00"}