{"result_id": "288013", "URL": "https://expose-news.com/2023/02/02/vaccines-have-likely-been-the-primary-cause-of-illnesses-for-over-a-century/", "timestamp": "2023-04-25 17:18:19 CEST+0200", "meta": {"description": "In 1979, the WHO and the CDC redesigned the International Classification of Diseases coding list and erased any possibility for the world’s coroners to label a cause of death related to vaccination. A coroner has no code to input if he/she believes someone died of a vaccine. For over fifty years, WHO and CDC have…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/02/02/vaccines-have-likely-been-the-primary-cause-of-illnesses-for-over-a-century/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Vaccines have likely been the primary cause of illnesses for over a century", "cleaned_text": "In 1979, the WHO and the CDC redesigned the International Classification of Diseases coding list and erased any possibility for the world’s coroners to label a cause of death related to vaccination. A coroner has no code to input if he/she believes someone died of a vaccine.\n\nFor over fifty years, WHO and CDC have been forcing coroners to mislabel vaccination deaths. Beyond the fact it is likely a crime, this suppression means that “informed consent” has been totally corrupt for decades.\n\nContrary to what we have been made to believe, vaccination is neither safe for our children, nor for us. Poor vaccination protocols have been the likely premier cause of illnesses for over a century.\n\nMarc Girardot was inspired to write the following article after reading a paper by Neil Miller in which he noted:\n• Infant deaths post-vaccination is often misclassified as Sudden Infant Death Syndrome (“SIDS”) or suffocation in bed.\n• Of all reported SIDS cases post-vaccination, 75 % occurred within 7 days\n\nRead more: Vaccines and sudden infant death: An analysis of the VAERS database 1990–2019 and review of the medical literature by Neil Z.Miller, Toxicology Reports, Volume 8, 2021\n\nThere was a time – a long time ago – when I studied Language as a theme in philosophy.\n\n“Putting a name on things” is critically important in our collective life. It is indispensable to understanding the world, to building our intelligence, to communicating and solving problems … and therefore more generally to surviving.\n\nWhat if a group of few individuals had the ability to un-name a concept or a thing? Would that reality disappear? … Not really. If the name in question were attributed to a real thing, say a coconut, the coconut would not stop existing. An alternative name would likely be found, maybe someone from another country would bring “noix de coco.” 1\n\n\n\n\n\nWhat if it were a concept, something intangible? Well, that certainly would make things more complicated, but again, clear minded people would figure out a new way to express that concept and find another name…\n\nWhat if that same group of people would impose a strict NewSpeak worldwide, a novel name, a unique standard that means a radically different thing? Well, then the concept would literally disappear from the records of society, drowned into a conceptual potpourri. And the concept would become fuzzier requiring extensive resources and time to resurface. Most don’t have time to dedicate to phantomatic treasure hunts, especially to unearth a painful concept…\n\nWhat if I told you this actually happened?!\n\nIn 1979, the WHO and the CDC redesigned the ICD coding list – International Classification of Diseases – and erased any possibility for the world’s coroners to label a cause of death related to vaccination! You heard me. A coroner has no code to input if he/she believes someone died of a vaccine. For over fifty years, Big Brothers WHO and CDC have been forcing coroners to mislabel vaccination deaths. Beyond the fact it is likely a crime, this suppression means that “Informed Consent” has been totally corrupt for decades.\n\nIn the US alone, in the past 25 years, nearly $5 billion has been awarded to 9,946 victims 2 of vaccination, or to their families. Obviously, ten thousand people represent the tip of a much larger iceberg. Those who had the clairvoyance to acknowledge vaccination harm, who had the fortitude and resources to fight for compensation and who benefitted from the good fortune to win in court are a happy few in the tens of millions of vaccines injured, most of whom lived through their pain and health drama never knowing the vaccination was the cause of their Parkinson’s disease or their cancer.\n\nHowever there’s no question: In front of the Law, despite public health manipulations, vaccines harm exists and vaccination has been recognised as a killer in many cases, notably of babies.\n\nCollectively, if we continue to hide vaccination harm, we will never get to understand the underlying cause of these dramas, and will never stop them.\n\nThough I have more and more doubts on the efficacy and the very justification of many vaccines – call me anti-vaxxer! I’ll wear it as a badge of honour – what I am trying to highlight today is that if we hide reality, there’s no way people will actually find a solution to this never-ending flow of illnesses, however dramatic and sad. We can continue with this dramatic circus forever.\n\nTo be honest, I find it infuriating that some doctors dared telling me – when I was a young father – that it would be my fault if one of my toddlers would die. Seeding doubt and guilt as to whether I would have positioned the baby right in bed. I can’t imagine the guilt some parents have had to face – and still face every day – finding their little baby dead in the crib. Taking the responsibility and the guilt upon themselves when, in reality, the injection was to blame!\n\nData show that for decades, public health officials and doctors have been playing gods, indiscriminately injecting kids with an ever-growing arsenal of products, occasionally killing them, often harming them for life.\n\nPrior to the 1960s, the concept of sudden infant death syndrome didn’t even exist, and was not listed in the main causes of mortality. So, between 1960 and 1980, public health had to realise immunisation was a cause for serious concern. In 1979, they chose to hide it from the public and to protect vaccine manufacturers. And so, harm has continued … as if nothing could be done to avoid vaccine adverse effects.\n\nBetween 1990 and 2019, 2,605 infant deaths were reported in VAERS, 78.3% of these deaths occurring within a week of vaccination! For the record, using a 59x myocarditis under-reporting factor (likely conservative) as per the Engler et al study 3 on SmallPox vaccines – one can estimate that nearly 153,700 babies died of vaccination over thirty years. Some 5,120 families sorrowed each year during decades.\n\n17% of all infant deaths reported in VAERS occur the day of vaccination. And 78% within a week!\n\nThat’s no coincidence. In any other business, that synchronicity would be evidence enough, especially given:\n• The stakes are high: our kids’ lives!\n• The precautionary principle would invite to a review, if not an immediate complete halt.\n\nBut “No!” in public health, a scientist reporting that will be shamed and his carrier ruined for questioning the official narrative, as we have witnessed these past three years.\n\nPublic Health Authorities have managed turning ethics upside-down supposedly for the greater good.\n\nExcept if it’s truly for the greater good, why are they spending so much energy trying to:\n• Erase all traces of vaccination-induced death or harm by stopping coroners using the appropriate label.\n• Fragment and camouflage all adverse effects so as to make them acceptable (viral, bacterial, genetic, unexplainable!) as if Guillain-Barré, autism, SIDS, hepatitis or paediatric myocarditis hadn’t the same root cause. A very dark divide-and-conquer strategy built on hubris and arrogance, possibly corruption.\n\nLet’s be honest, presumably to avoid vaccine hesitancy, we are causing harm to our new-borns and to our children! We are no different than Incas practicing human sacrifice. Actually, we are far worse as the numbers are staggering.\n\nWhether it is to capture billions of dollars in revenue or to pay tribute to the vaccine god (some are religious and utterly irrational about vaccines), we have sacrificed our collective health to this lunacy, and the emotional and economic consequences of this are simply gigantic.\n\nImagine if we could avoid many cancers, most Parkinson and Alzheimer’s diseases, MSI, autism…and more. That’s what we are contemplating, however hard it is to believe.\n\nAs we are witnessing in the gruesome aftermath of covid vaccination, immunisation accidents occur frequently. 4 Pr. Muëller from Basel University Hospital showed 2.8% of vaccinated staff had clinical cardiac issues, and that 100% had some degree of cardiac impact …\n\nThroughout multiple articles, I have demonstrated that inadvertent intravascular injection of vaccines is a reality, and that the mechanism of harm 5 can – and will – apply across the endothelium according to the exposure of the endothelium. And so, to SIDS, one needs to add clinical and sub-clinical damage to:\n• The brain likely explaining the explosion of autism this past 20 years.\n• The heart explaining the rise in paediatric myocarditis. 6\n• The liver explaining hepatitis as we saw over summer.\n• The bone marrow explaining children blood cancers such as Acute Lymphoblastic Leukaemia which particularly touch toddler below 5 years of age.\n\nMaybe it’s time for our generation to wake up, dig into our ancestors’ self-preservation DNA and resist this man-made dystopia.\n\nContrary to what we have been made to believe, vaccination is neither safe for our children, nor for us. Poor vaccination protocols have been the likely premier cause of illnesses for over a century. The stakes are enormous, civilisational, I would risk. A civilisation that doesn’t care for its children inevitably will flounder. Does our generation have the grit to tackle this monster? For our children, I pray we will find the force. Let’s start by demanding a change in the WHO’s ICD codes and ask – as my friend John Beaudoin has been asking for months – that vaccine databases be tied with mortuary databases.\n\nPutting a name on the cause of death is a minimum respect owed to our deceased …\n• 3 “A Prospective Study of the Incidence of Myocarditis/Pericarditis and New Onset Cardiac Symptoms following Smallpox and Influenza Vaccination” by Renata J. M. Engler et al\n• 4 “Another One Bites The Dust” by Marc Girardot – Despite Aspiration, Experienced Nurses Hit the Vascular System in 1.9% of Injections according to a 2015 Study\n• 5 “When and How Can Vaccine Particles Hurt You? – A Visualisation Exercise” by Marc Girardot\n• 6 “Pediatric Myocarditis: What Have We Learnt So Far?” by Elettra Pomiato et al\n\nMarc Girardot has published multiple articles on covid, most notably ‘Natural Immunity versus Covid-19 Vaccine-induced Immunity’. He is a member of Pandemics Data & Analytics (“PANDA”) and author of a Substack page titled ‘Covid Myth Buster Series’.\n\nAmongst his many other skills and experiences, Girardot has an MBA from INSEAD, is a CISCO veteran, a strategy consultant, and has experience working for a company producing anti-cancer DNA vaccines.", "opengraph": {"type": "article", "title": "Vaccines have likely been the primary cause of illnesses for over a century", "url": "https://expose-news.com/2023/02/02/vaccines-have-likely-been-the-primary-cause-of-illnesses-for-over-a-century/", "description": "In 1979, the WHO and the CDC redesigned the International Classification of Diseases coding list and erased any possibility for the world’s coroners to label a cause of death related to vaccination…", "article:published_time": "2023-02-02T10:30:00+00:00", "article:modified_time": "2023-02-02T01:29:38+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/FeatFeb2a.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.sciencedirect.com/science/article/pii/S2214750021001268", "https://covidmythbuster.substack.com/p/have-public-health-authorities-been", "https://substack.com/profile/7635404-marc-girardot", "https://www.sciencedirect.com/science/article/pii/S2214750021001268", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-01-01-23.pdf", "https://www.sciencedirect.com/science/article/pii/S2214750021001268", "https://doi.org/10.1371/journal.pone.0118283", "https://covidmythbuster.substack.com/p/have-public-health-authorities-been#footnote-3-99763446", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8c862e30-2130-4afd-888f-81f82faa622a_1710x1670.png", "https://covidmythbuster.substack.com/p/are-vaccines-triggering-cancers-vaccine", "https://coquindechien.substack.com/", "https://covidmythbuster.substack.com/p/when-and-how-can-vaccine-particles", "https://www.pandata.org/what-happens-to-those-billions-of-nanoparticles-youve-become-host-to/", "https://www.pandata.org/", "https://covidmythbuster.substack.com/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-02-02T10:30:00+00:00"}