{"result_id": "288042", "URL": "https://expose-news.com/2023/01/15/aus-vaccine-rollout-controlled-by-us-military/", "timestamp": "2023-04-25 17:19:07 CEST+0200", "meta": {"description": "It is a fair bet that almost no Australians realise that their health system has been effectively taken over by the US Department of Defence (“DoD”). Yet that appears to be what occurred during the covid crisis. A group of Australian scientists, doctors, and medical academics, headed by pharmacologist Phillip Altman, are claiming that the US DoD…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/15/aus-vaccine-rollout-controlled-by-us-military/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Australia’s Health Institutions and Covid Vaccine Rollout have been controlled by US military", "cleaned_text": "It is a fair bet that almost no Australians realise that their health system has been effectively taken over by the US Department of Defence (“DoD”). Yet that appears to be what occurred during the covid crisis.\n\nA group of Australian scientists, doctors, and medical academics, headed by pharmacologist Phillip Altman, are claiming that the US DoD “had a dominant role in the response to the SARs CoV2 virus and in the subsequent development, manufacture, and distribution of the Covid 19 vaccines.”\n\n[Related: US Department of Defence controlled the Covid Vaccine Programme from the start]\n\nUS military was secretly behind Australia’s covid jab rollout: report\n\nThe following was originally published by LifeSiteNews\n\nIn a project dubbed Operation Warp Speed, the DoD manufactured the vaccines, managed distribution, owned the vials, and designed the clinical trials. The pharmaceutical companies effectively only provided window dressing. They were paid billions to do “large scale manufacturing demonstrations” that had little validity – Pfizer actually defended itself in a lawsuit claiming that because the DoD knew these demonstrations were fraudulent there was no malfeasance. The pharmaceutical companies lacked the capacity to produce the vaccines themselves.\n\nThe intention was to create the impression that normal regulatory processes were being followed when, in reality, they were bypassed completely. Australian governments and regulatory authorities participated in the deception, repeatedly assuring the citizenry that there was sound oversight to ensure safety and efficacy ­– even when it was obvious that medium term safety was impossible to assess in such a short period and the requirement for repeated boosters showed the injections were not effective for any length of time.\n\nAltman and his co-authors say the US military’s involvement has been kept hidden from the American general public since early 2020; it was certainly never explained to the Australian people. “The US DoD clearly perceived a threat to national security and all decisions from that point onward to the present day were subject to full command and control from them,” they write. “Many adverse consequences have been the outcome of this secret military response to a public health matter.”\n\nThere are related claims that the DoD knew that the Wuhan lab had created the SARS-CoV-2 virus during an attempt to develop an aerosolised bat vaccine. The project was, ironically, intended to stop naturally occurring SARS pandemics. A company called EcoHealth Alliance initially tried to get funding for the project from the DoD, but it was rejected on the grounds that it was too close to illegal gain-of-function research. The money eventually came from the National Institute of Allergy and Infectious Diseases (“NIAID”), headed by Anthony Fauci.\n\nProject Veritas has revealed that in August 2021 Major Joseph Murphy, a Marine Corps officer working for the Defence Advanced Research Projects Agency (“DARPA”), wrote in a memorandum that the EcoHealth Alliance submission indicated that SARS-CoV-2 was in all likelihood a “deliberately virulent, humanised, recombinant SarsCov that was to be reverse engineered into a … bat vaccine.”\n\nIt is now possible to piece together a tentative timeline of what has been a series of medical deceptions that have profoundly damaged Australian society – and much of the Western world. There were four phases. The first was a cover up of the fact that the Wuhan research had been funded out of the United States. Fauci initially wrote in the New England Journal of Medicine that SARS-CoV-2 was likely to be no worse than a bad seasonal flu, but behind the scenes he and others were panicking that their involvement would be exposed. Fauci and his colleagues mounted a global attack on anyone who said that the virus may have come from a lab. Scientists inquiring into the lab leak theory were not only demonised as conspiracy theorists, they were also accused, including in Australia’s mainstream media, of anti-China racism. That suppression was extremely effective.\n\nPhase two was Operation Warp Speed, the secretive use of the military by the Trump administration. As the name implies, the timeline was suspiciously short, in part because dubious, or non-existent, safety checking occurred at the same time as the manufacturing – which rendered genuine safety testing impossible. Altman writes: “There is now evidence to suggest that the SARS-CoV-2 virus was interpreted by the US as a national security threat in early 2020. The evidence shows that the Chief Operating Officer for the Warp Speed vaccine program is the US Department of Defence.”\n\n[Related: MP says Covid-19 is a Manufactured Bioweapon and Security Services knew about it in August 2019]\n\nThe third phase was a propaganda campaign that affected the whole world, the biggest ever mounted. It involved an astonishing array of players: the struggling Big Pharma industry, which is now punting its future on mRNA technology, especially revenue from patents; the World Health Organisation, which Trump had threatened to pull out of; large corporations, which enthusiastically enforced the medical tyranny; health bureaucrats who have made a mockery of the phrase “public service”; universities (many Australian universities still will not allow the unvaccinated on campus); the World Economic Forum, and a plethora of bad actors exploiting the situation to usher in the so-called Great Reset, a global technocracy.\n\nIt seems to have also included much of the executive branch of the US government. The Department of Health and Human Services had over $1 billion to spend on pushing aggressive covid policies, including vaccine mandates. It is being revealed that the FBI and other organisations in the US intelligence services were involved in censoring anyone questioning the covid narrative on social media. In Australia, State and Federal governments paid for massive advertising campaigns which became the media’s main source of revenue.\n\nThe lead players, however, were senior US health bureaucrats who set out to create fear – a tactic mimicked in Australia – partly for commercial ends and partly to get rid of then US president Donald Trump. Paul Alexander, a Canadian health researcher and Trump adviser, has provided an eye witness account of how the CDC, NIH, and WHO undermined Trump in his book ‘Presidential Takedown’. Deborah Birx, Trump’s White House Coronavirus Response Coordinator, admitted in her own book that she engaged in subterfuge and “sleight of hand” in order to implement a policy of “track, trace, and isolate” so as to force through lockdowns, masking, and vaccine mandates, all of which Trump opposed.\n\nIt was partisan politics distorting public health policy, and it also corrupted the Australian health system. When Trump suggested, for example, that hydroxychloroquine could be an effective treatment (as was indicated in the EcoHealth documents), he was savagely ridiculed. Australia, following the American lead, banned use of the drug in early 2020.\n\nThe most ridiculous deception was counting positive test results as “cases.” Most people who tested positive to the virus had no symptoms – in Australia the figure in 2020 and 2021 averaged about 80%. That either meant the test was faulty or the immune system had responded effectively. Yet it was implied that these healthy people were sick and a risk to others. The cardiologist Dr Peter McCullough said Birx reworked reports to fuel the false narrative of asymptomatic spread. “Sounds like she really believed this was the first illness in the history of medicine that spread between two perfectly healthy persons.”\n\nAustralia slavishly adhered to the same nonsense, including extremely aggressive testing and tracking. Until recently, anyone who tested positive was forced to isolate, irrespective of their symptoms. Likewise, the nation became obsessed with the daily count of “cases,” eventually implementing some of the most aggressive lockdowns and vaccine mandates in the world.\n\nThe fourth phase, which we are in now, is the cover up of possible vaccine side effects. Australia’s death rate has risen by a startling 13% this year, but the authorities are skilfully hiding the possibility that vaccine damage may be partly responsible. Even Australian actuaries are saying that they can rule out the vaccines while, in the same breath, admitting they don’t know why the death rate is rising.\n\nThe strategy is to make it difficult to report vaccine harms or to make no attempt to distinguish between vaccine side effects and long covid. If Murphy is correct, they would be hard to tell apart anyway. He said the vaccines “work poorly because they are synthetic replications of the already synthetic … spike protein,” adding that “many doctors have observed that the symptoms of the vaccine reactions mirror the symptoms of the disease, which corroborates with the similar synthetic nature and function of the respective spike proteins.”\n\nHaving had our health system, including our doctors, effectively controlled by the US military and American partisan politics, it is hard to see how Australia’s medical sovereignty can be restored. The trail of dishonesty has deeply harmed Australian institutions and destroyed the adherence to truth on which sound medicine relies.\n\nAltmann writes: “The lesson to be learned here is that development and production of vaccines and other therapeutic products for general civilian use should never again be allowed to be under military command and control.” The first step towards doing that is for Australians to become aware that it happened.", "opengraph": {"type": "article", "title": "Australia’s Health Institutions and Covid Vaccine Rollout have been controlled by US military", "url": "https://expose-news.com/2023/01/15/aus-vaccine-rollout-controlled-by-us-military/", "description": "It is a fair bet that almost no Australians realise that their health system has been effectively taken over by the US Department of Defence (“DoD”). Yet that appears to be what occurred during the…", "article:published_time": "2023-01-15T09:21:00+00:00", "article:modified_time": "2023-01-15T00:18:49+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/FeatJan15b.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.trialsitenews.com/a/did-national-security-imperatives-compromise-covid-19-vaccine-safety-adfea242", "https://expose-news.com/2023/01/08/us-dod-controlled-covid-vaccine-from-start/", "https://www.lifesitenews.com/opinion/us-military-was-secretly-behind-australias-covid-jab-rollout-report/", "//www.lifesitenews.com/", "https://www.bitchute.com/video/8ftbShzrkjl9/", "https://www.hhs.gov/sites/default/files/pfizer-inc-covid-19-vaccine-contract.pdf", "https://www.theepochtimes.com/health/pfizer-asks-court-to-dismiss-whistleblower-lawsuit-because-government-was-aware-of-fraud_4578832.html", "https://assets.ctfassets.net/syq3snmxclc9/2mVob3c1aDd8CNvVnyei6n/95af7dbfd2958d4c2b8494048b4889b5/JAG_Docs_pt1_Og_WATERMARK_OVER_Redacted.pdf", "https://www.globalresearch.ca/dr-fauci-covid-19-may-turn-out-like-bad-flu-season/5708222", "https://brownstone.org/articles/the-lab-leak-the-plots-and-schemes-of-jeremy-farrar-anthony-fauci-and-francis-collins/", "https://www.bmj.com/content/374/bmj.n1656", "https://expose-news.com/2023/01/02/covid-virus-was-a-manufactured-bioweapon-says-mp/", "https://www.zerohedge.com/political/documents-uncover-secret-twitter-portal-us-government-used-censor-covid-19-content", "https://www.amazon.com/Presidential-Takedown-Conspired-Overthrow-President/dp/1510776222", "https://www.amazon.com/Silent-Invasion-Administration-Covid-19-Preventing/dp/0063204231", "https://wentworthreport.com/2022/07/20/lockdown-architect-deborah-birx-admits-to-using-subterfuge-and-slight-of-hand-to-hide-information-from-trump/", "https://www.news.com.au/lifestyle/health/health-problems/excess-deaths-in-2022-incredibly-high-at-13-per-cent/news-story/2a33dfeeb7476765da4e237c59f59bf7", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-15T09:21:00+00:00"}