{"result_id": "288040", "URL": "https://expose-news.com/2023/03/29/covid-vaccine-aids-caused-2-million-excess-deaths/", "timestamp": "2023-04-25 17:19:03 CEST+0200", "meta": {"description": "Recent reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that 2 million excess deaths have been recorded since the mass roll-out of the Covid-19 injections. Your Government and Mainstream Media are insisting the cause of this shocking rise in…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/03/29/covid-vaccine-aids-caused-2-million-excess-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "The Pfizer Effect: Government Reports suggest COVID Vaccine-Induced Autoimmune Deficiency Syndrome is partly to blame for 2 million Excess Deaths in the West over the past 2 years", "cleaned_text": "Recent reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that 2 million excess deaths have been recorded since the mass roll-out of the Covid-19 injections.\n\nYour Government and Mainstream Media are insisting the cause of this shocking rise in deaths is merely a coincidence and have thrown out excuses such as “climate change”, a crisis in healthcare, and even hypochondria which they renamed ‘Long Covid’.\n\nBut the evidence clearly suggests that whilst the Covid-19 injections may not be to blame for all of the excess deaths suffered since the roll-out, they are by far and large the biggest contributing factor. And one of the reasons why is the huge effect they have on the immune system.\n\nRather than improving the state of your immune system, Covid-19 vaccination has the opposite effect. With official Government reports suggesting the damage caused can be so severe that it can lead to what can only be described as COVID Vaccine-Induced Autoimmune Deficiency Syndrome.\n\nThe figures in the below chart have been provided to both the Organisation for Economic Co-Operation and Development (OECD) and EuroMOMO by each country’s Government organisations. The U.S. data has been provided by the Centers for Disease Control. The UK data has been provided by the Office for National Statistics. And Australia’s data has been provided by the Australian Bureau of Statistics and so on and so on.\n\nSo these aren’t independent estimates. They are official Government-authorized figures. And they show that the ‘Five Eyes’ countries and 26 other countries across Europe suffered 1.99 million excess deaths by various dates ranging from week 34 to week 49 of 2022 ever since the Covid-19 injections were first granted Emergency Use Authorisation (EUA).\n\nThe USA suffered 674,954 excess deaths in 2021, and then 434,520 excess deaths by week 49 of 2022.\n\nThis equates to an astounding 1.1 million excess deaths in just under two years across the USA.\n\nMeanwhile, its neighbour Canada suffered 35,318 excess deaths in 2021 and then 25,333 excess deaths by week 34 of 2022. This compares to 31,042 excess deaths in 2020 by week 53.\n\nHowever, when looking at the figures up to week 34 in both 2020 and 2021, it becomes clear that 2022 has in fact been the worst year for excess deaths by far.\n\nBy week 34 of 2020, Canada had recorded 17,888 excess deaths. By week 34 of 2021, Canada had recorded 18,498 excess deaths. But by week 34 of 2022, Canada had recorded 25,333 excess deaths, representing a 42% increase on the excess deaths recorded in 2020, prior to the roll-out of the Covid-19 injections.\n\nIn New Zealand, the situation is similarly concerning.\n\nThe country suffered 2,169 excess deaths in 2021 and then a shocking 5,286 excess deaths by week 49 of 2022. These are shocking figures for the small island with an estimated population of 5 million people.\n\nEspecially when compared to 2020, when no excess deaths were suffered and 160 fewer deaths were actually recorded than expected at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means New Zealand suffered a shocking 3,404% increase in excess deaths in 49 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nMeanwhile, its closest neighbour Australia suffered 11,068 excess deaths in 2021 and then a shocking 22,730 excess deaths by week 38 of 2022. This is in stark contrast to 2020, when only 1,306 excess deaths were recorded at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means Australia suffered a shocking 1,640% increase in excess deaths in just 39 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nFinally, official figures provided to EuroMOMO by the UK Government and 26 other Governments of counties across Europe reveal that most of the continent suffered 375,253 excess deaths in 2021 and 404,6000 excess deaths in 2022.\n\nOfficial figures provided to EuroMOMO by the UK Government and 26 other Governments of counties across Europe reveal that most of the continent suffered 375,253 excess deaths in 2021 and 404,6000 excess deaths in 2022.\n\nThis equates to 779,853 excess deaths over the two years. The figures do not include Ukraine so cannot be blamed on the ongoing war.\n\nThese figures leave us with one question. ‘Why are so many people dying?’. The answer is obvious to those willing to accept that the Establishment does not work in our best interests. The main reason is Covid-19 vaccination itself.\n\nBut this leads to other questions. ‘How can Covid-19 vaccination be killing people?’\n\nWell, official evidence suggests that at least one of the reasons is that Covid vaccination causes immense damage to the immune system. The damage caused is so severe that it can lead to what can only be described as COVID Vaccine-Induced Autoimmune Deficiency Syndrome.\n\nIt’s a common misconception that AIDS is only caused by the HIV virus or that they are even one and the same.\n\nIn fact, AIDS (acquired immune deficiency syndrome) is just the name used to describe a number of potentially life-threatening infections and illnesses that happen when your immune system has been severely damaged.\n\nPeople with acquired immune deficiency syndrome have an increased risk of developing certain cancers and serious infections that usually occur only in individuals with a weak immune system, or would otherwise be mild in those with a healthy, working immune system.\n\nHere we present a series of strong evidence that the Covid-19 vaccines are causing recipients to develop acquired immune deficiency syndrome (AIDS) or a novel condition with similar attributes that can only be described as Covid-19 Vaccine Induced Acquired Immune Deficiency Syndrome (VAIDS).\n\nVaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nThe first time the body encounters a germ, it can take several days to make and use all the germ-fighting tools needed to get over the infection. After the infection, the immune system remembers what it learned about how to protect the body against that disease.\n\nVaccines allegedly help develop immunity by imitating an infection. Once the imitation infection induced by the vaccine goes away, the body is left with a supply of “memory” t-cells and antibodies that will remember how to fight that disease in the future\n\nSo, when the authorities state that the effectiveness of the vaccines weakens over time, what they really mean is that the performance of your immune system weakens over time.\n\nIn regards to the Covid-19 injections –\n• A vaccine effectiveness of +50% would mean that the fully vaccinated are 50% more protected against Covid-19 than the unvaccinated. In other words, the fully vaccinated have an immune system that is 50% better at tackling Covid-19.\n• A vaccine effectiveness of 0% would mean that the fully vaccinated are no more protected against Covid-19 than the unvaccinated, meaning the vaccines are ineffective. In other words, the fully vaccinated have an immune system that is equal to that of the unvaccinated at tackling Covid-19.\n• But a vaccine effectiveness of -50% would mean that the unvaccinated were 50% more protected against Covid-19 than the fully vaccinated. In other words, the immune system performance of the vaccinated is 50% worse than the natural immune system performance of the unvaccinated. Therefore, the Covid-19 vaccines have damaged the immune system.\n\nThe UK Health Security Agency (UKHSA) published a weekly Vaccine Surveillance Report, with each report containing four weeks’ worth of data on Covid-19 cases, hospitalisations, and deaths by vaccination status.\n\nHere are the Covid-19 case rates per 100,000 by vaccination status for each age group over the age of 18 in England, plus the average case rate per 100,000 for all adults in England taken from the UKHSA Vaccine Surveillance Report – Week 5 – 2022 –\n\nAs you can see the case rate per 100k is clearly the lowest among the unvaccinated population in all age groups, with case rates among the triple vaccinated population approximately double the rate seen among the unvaccinated in most age groups, and case rates among the double vaccinated population approximately triple the rate seen among the unvaccinated in most age groups.\n\nThis data alone should deeply concern even the most avid vaccine advocates.\n\nNow that we know the case rates, we can use Pfizer’s vaccine effectiveness formula to work out the real-world vaccine effectiveness.\n\nTherefore, the average real-world Covid-19 vaccine effectiveness in England for all adults as a whole in January 2022 was MINUS-183%.\n\nHere’s how effective the Covid-19 vaccines are proving to be in each double vaccinated age group –\n\nThe lowest Covid-19 vaccine effectiveness was seen in the 40-49 age group in England throughout January 2022, recorded at minus-209.4%, with the 50-59 age group not far behind.\n\nBut don’t forget, as we proved with the evidence presented in Exhibit A, Vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nTherefore, the UKHSA data actually shows that the Covid-19 injections are decimating the natural immune system.\n\nUK Data actually shows the Fully Vaccinated have a Negative Immune System Performance\n\nTo work out immune system performance we have to alter the calculation used to work out vaccine effectiveness slightly and divide our answer by either the largest of the vaccinated or unvaccinated case rate as per the case rates provided in Exhibit B.\n\nThe following chart shows the true extent of the damage caused to the double vaccinated populations’ immune systems by age group in January 2022 –\n\nThis means the average double-vaccinated person in England is down to the last 35% of their immune system for fighting viruses, bacteria, and cancers. But is this data just a one-off, or is the performance of the fully vaccinated populations’ immune system declining by the week?\n\nUK Data proves the Fully Vaccinated Populations Immune System Performance is declining by the week\n\nIf we take the case rates found in previous UKHSA Vaccine Surveillance reports we’re able to track the real world vaccine effectiveness and immune system performance of the vaccinated over the past few months.\n\nSo we took the case rates found in the following reports –\n\nCovid-19 Vaccine Surveillance Report – Week 37′ (Published by PHE)\n\n‘Covid-19 Vaccine Surveillance Report – Week 41’ (Published by UKHSA)\n\n‘Covid-19 Vaccine Surveillance Report – Week 45’ (Published by UKHSA)\n\n‘Covid-19 Vaccine Surveillance Report – Week 49’ (Published by UKHSA)\n\n‘Covid-19 Vaccine Surveillance Report – Week 1 – 2022’ (Published by UKHSA)\n\nAnd then calculated the real world Covid-19 vaccine effectiveness between 16th August 2021 and 2nd January 2022 –\n\nThe first booster shots were administered in week 37 of 2021, and this graph illustrates clearly how they provided a boost in vaccine effectiveness in the following two months. But unfortunately, it also shows how short-lived this boost was with the effectiveness of the Covid-19 vaccines falling to frightening levels between weeks 49 and 52.\n\nThe following graph illustrates the overall immune system performance among all age groups in England between 16th Aug 21 and 2nd Jan 22 –\n\nAs you can see from the above the 40-49 year-olds had the worst immune system performance by the 2nd Jan 22, recorded at minus-60%. In Exhibit C we shows that the immune system performance in 40-49-year-olds had declined to minus-67.7% by the 30th January 22. This therefore proves the Covid-19 vaccines are causing damage to the natural immune system that worsens by the week.\n\nUK data shows the Fully Vaccinated are now more likely to die of Covid-19\n\nThe following chart shows the Covid-19 death-rates per 100,000 by vaccination status for each age group over the age of 18 in England, calculated from the number of deaths found in the week 5 UKHSA Vaccine Surveillance Report and the size of the double vaccinated population –\n\nThe double vaccinated population have the highest death rate per 100k in every age group except for the 18-29, and 40-49-year-olds. But we can expect in coming weeks for that rate to switch among the two anomalies based on Exhibit D proving things get worse for the vaccinated population by the week.\n\nUK Data shows the Covid-19 Vaccines have a real-world Negative Effectiveness against Death\n\nNow that we know the death rates, we can again use Pfizer’s vaccine effectiveness formula to work out the real-world vaccine effectiveness against death.\n\nReal-world Covid-19 vaccine effectiveness against death in England between 3rd Jan and 30th Jan 22 was as low as -110.24% in the over 80’s, -97% in people aged 70-79, and -98.14% on average in all adults over age 18.\n\nBut don’t forget, as we proved in Exhibit A, vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipients immune system performance compared to the immune system performance of an unvaccinated person.\n\nUK data suggests some of the Elderly may have already developed VAIDS\n\nThe following chart shows the fully vaccinated populations immune system performance against death according to the Covid-19 death rates per 100,000 found in the UKHSA Vaccine Surveillance Report – Week 5 – 2022 –\n\nKeeping in line with historical trends that show the Covid-19 vaccines have caused damage to the immune system that worsens by the week we can see that the lowest immune system performance is among those who were vaccinated first, with the over 80’s recording an immune system performance of -52.4%, and then the 70-79 age group recording an immune system performance of -49.2%.\n\nThere is however a concerning anomaly in this data in that we should expect to see a positive immune system performance among the 30-39 age group of around 29%, but instead, it was at -15.4%. There could be several explanations for this but not a single one of them is good.\n\nEither the 30-39 year-olds are genuinely doing worse, or all other age groups are doing much worse than what we are being told.\n\nEither way, we can be sure that the data is reliably telling us the Covid-19 injections have caused some of the elderly and vulnerable to lose all immune system capability to the point that they are now more likely to die of Covid-19 than an unvaccinated person.\n\nPublic Health Scotland data shows the Fully Vaccinated are now more likely to die of Covid-19\n\nPublic Health Scotland published a weekly Covid-19 Statistical Report containing data on Covid-19 cases, hospitalisations and deaths by vaccination status.\n\nThe following chart shows the percentage of Covid-19 deaths by vaccination status in Scotland between 25th Dec 21 and 21st Jan 22, according to the report they published Wednesday 2nd February –\n\nThe following graph shows the age-standardised Covid-19 death rates per 100,000 individuals by vaccination status in Scotland. The data has been extracted from table 16, found on page 54 of the PHS Covid-19 Statistical report published Wednesday 2nd Feb 22.\n\nIn the most recent week ending 21st Jan the fully vaccinated were statistically over twice as likely to die of Covid-19 than the unvaccinated.\n\nThe highest death rate in that month among the fully vaccinated was recorded as 15.49 per 100,000 individuals in the week beginning 15th Jan. But the highest death rate among the unvaccinated came in the week beginning 8th Jan at 10..93 per 100,000.\n\nPublic Health Scotland Data shows the Covid-19 Vaccines have a real-world Negative Effectiveness against Death\n\nThe following chart shows the real-world vaccine effectiveness against death over four weeks according to figures supplied by Public Health Scotland –\n\nVaccine effectiveness against death has been negative since at least Dec 25th 2021, and has dropped to a staggering minus-112% as of the 21st Jan 22.\n\nBut again don’t forget, as we proved in Exhibit A, vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nPublic Health Scotland data suggests some of the Fully Vaccinated may have already developed VAIDS\n\nThe following chart shows the average immune system performance of all fully vaccinated adults against death between 15th Jan and 21st Jan 22 according to figures supplied by Public Health Scotland –\n\nThe average immune system performance against death among all adults equates to -53% in Scotland, which is slightly ahead of the average -50% seen in England as presented in Exhibit G. Because vaccination began at the same time we would expect these to be around the same.\n\nTherefore, this means that we can be assured the data is reliably telling us the Covid-19 injections are not just ineffective, but damage the immune system to the point that the recipients are developing acquired immunodeficiency syndrome and are much more likely to die than the unvaccinated population.\n\nGovernment of Canada Data confirms the Covid-19 Vaccines are decimating the Immune System\n\nThe following chart shows the number of cases by vaccination status between 5th Dec 21 and 15th Jan 22, once we simply subtract the 4th Dec figures from the 15th Jan figures in the Government of Canada Covid-19 Daily Epidemiological Updates –\n\nIn Canada, according to the 4th Dec report, 22.2 million people are at least double vaccinated, and 23.2 million people are at least partly vaccinated. According to official statistics, the population of Canada in 2020 was estimated to be 38.01 million.\n\nTherefore, because 23.1 million people in Canada have had at least a single dose of a Covid-19 vaccine, this leaves approximately 14.81 million people in Canada who are not vaccinated against Covid-19.\n\nThe following chart shows the Covid-19 case rate per 100k by vaccination status in Canada based on the population size and the case numbers provided above –\n\nThe following chart shows the real-world Covid-19 vaccine effectiveness in Canada between 5th Dec 21 and 15th Jan 22 based on the case-rate figures above –\n\nBut don’t forget, as we proved in Exhibit A, vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nThe following chart shows the immune system performance of the fully vaccinated population in Canada between 5th Dec 21 and 15th Jan 22 –\n\nThe average fully vaccinated Canadian is down to the last 18.45% of their immune system for fighting certain classes of viruses and certain cancers etc. This is what vaccination has done to the people of Canada.\n\nThe Fully Vaccinated are incapable of producing N antibodies\n\nThe UK Health Security Agency has found the vaccine interferes with the body’s innate ability after infection to produce antibodies against not just the spike protein but other pieces of the virus. Specifically, vaccinated people don’t seem to be producing antibodies to the nucleocapsid protein, the shell of the virus, which is a crucial part of the response in unvaccinated people.\n\nThe study titled ‘Innate Immune Suppression by SARS-CoV-2 mRNA Vaccinations: The role of G-quadruplexes, exosomes and microRNAs‘ was published on the 21st Jan 22, and presents a raft of evidence that the genetic modifications introduced by the mRNA Covid-19 vaccines have diverse consequences to human health.\n• increased production or formation of a tumour or tumours;\n\nA full breakdown of the study can be read here.\n\nThe following table taken from the study in Exhibit L shows the number of events in the VAERS database from 1990 to 12th Dec 2021, where several terms indicating cancer occurred in association with the Covid-19 vaccine or with all other available vaccines, along with the ratio between the two counts.\n\nThere were three times as many reports of breast cancer following a COVID-19 vaccine, and more than six times the number of reports of B-cell lymphoma. All but one of the cases of follicular lymphoma were associated with COVID-19 vaccines.\n\nPancreatic carcinoma was more than three times as high. Overall, in the above table, twice as many cancer reports to VAERS are related to a COVID-19 vaccination compared to those related to all other vaccines. That, in the study authors’ opinions constitutes a signal in urgent need of investigation.\n\nThis cannot be explained by reference to a disproportionately large number of people receiving an mRNA vaccination in the past year compared to all other vaccinations.\n\nWe know this because CDC data shows that between 2008 and 2020 over 1.72 billion doses of the flu vaccine were administered in the USA. Whereas from the start of the Covid-19 vaccination campaign up to 28th Jan 22 there were a total of 549.9 million doses of the Covid-19 vaccine administered in the USA.\n\nThe reason for this increase in rates of cancer linked to vaccination could well be because the Covid-19 vaccines are decimating the innate immune system as we’ve proved in several Exhibits. By doing so the immune system is unable to fight other infections that can cause cancer.\n\nFor instance, HPV (human papillomavirus) infection has been linked to certain head and neck cancers, anal, and cervical cancer, as well as many other kinds of cancer. Lymphoma has been linked to viral infections, too.\n\nYou can read a full list of AIDS-related cancers here.\n\nOfficial Government data from England, Scotland and Canada proves that the Covid-19 injections have a real-world negative effectiveness.\n\nBut vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nThis means the fully vaccinated population’s immune systems are actually inferior to the natural immune systems of the unvaccinated population.\n\nBut as we’ve clearly shown this immune system degradation is something that is getting worse by the week, and has now started to result in a negative immune system performance against death among the elderly and vulnerable in England and Scotland.\n\nA scientific study has also found that the Covid-19 vaccines suppress the innate immune system with genetic modifications introduced by the jabs having diverse consequences to human health that include immune thrombocytopenia and myocarditis. Both of which are autoimmune diseases.\n\nThe same study also found an increased production or formation of tumours, which is again linked to a suppressed immune system that is incapable of combating certain viruses that can cause cancer.\n\nAIDS (acquired immune deficiency syndrome) is the name used to describe a number of potentially life-threatening infections and illnesses that happen when your immune system has been severely damaged.\n\nPeople with acquired immune deficiency syndrome are at an increased risk of developing certain cancers and infections that usually occur only in individuals with a weak immune system.\n\nTherefore, we propose that the Covid-19 injections are causing either acquired immunodeficiency syndrome or a new novel condition with similar attributes than can only be described as Covid-19 Vaccine-Induced Acquired Immune Deficiency Syndrome (VAIDS).\n\nAnd this is partly why recent reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that 2 million excess deaths have been recorded since the mass roll-out of the Covid-19 injections.", "opengraph": {"type": "article", "title": "The Pfizer Effect: Government Reports suggest COVID Vaccine-Induced Autoimmune Deficiency Syndrome is partly to blame for 2 million Excess Deaths in the West over the past 2 years", "url": "https://expose-news.com/2023/03/29/covid-vaccine-aids-caused-2-million-excess-deaths/", "description": "Recent reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that 2 million excess deaths have been recorded sin…", "article:published_time": "2023-03-29T05:59:00+00:00", "article:modified_time": "2023-03-28T20:02:41+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/pfizer-effect-march-23.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-118.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://www.gov.uk/government/publications/covid-19-vaccine-weekly-surveillance-reports", "https://expose-news.com/2021/10/29/ukhsa-report-covid-vaccines-negative-effectiveness-minus-132-percent/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1018416/Vaccine_surveillance_report_-_week_37_v2.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1025358/Vaccine-surveillance-report-week-41.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1032859/Vaccine_surveillance_report_-_week_45.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1039677/Vaccine_surveillance_report_-_week_49.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1045329/Vaccine_surveillance_report_week_1_2022.pdf", "https://www.gov.uk/government/publications/covid-19-vaccine-weekly-surveillance-reports", "https://expose-news.com/2021/10/29/ukhsa-report-covid-vaccines-negative-effectiveness-minus-132-percent/", "https://www.gov.uk/government/publications/covid-19-vaccine-weekly-surveillance-reports", "https://www.publichealthscotland.scot/publications/covid-19-statistical-report/covid-19-statistical-report-2-february-2022/", "https://publichealthscotland.scot/media/11318/22-01-26-covid19-winter_publication_report.pdf", "https://publichealthscotland.scot/publications/covid-19-statistical-report/covid-19-statistical-report-2-february-2022/", "https://publichealthscotland.scot/publications/covid-19-statistical-report/covid-19-statistical-report-2-february-2022/", "https://web.archive.org/web/20211223170506/https://health-infobase.canada.ca/covid-19/epidemiological-summary-covid-19-cases.html", "https://health-infobase.canada.ca/covid-19/epidemiological-summary-covid-19-cases.html", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1052353/Vaccine_surveillance_report_-_week_5.pdf", "https://www.researchgate.net/publication/357994624_Innate_Immune_Suppression_by_SARS-CoV-2_mRNA_Vaccinations_The_role_of_G-quadruplexes_exosomes_and_microRNAs", "https://www.researchgate.net/publication/357994624_Innate_Immune_Suppression_by_SARS-CoV-2_mRNA_Vaccinations_The_role_of_G-quadruplexes_exosomes_and_microRNAs", "https://expose-news.com/2022/01/30/new-study-finds-covid-vaccines-damage-immune-system/", "https://www.cdc.gov/flu/prevent/vaccine-supply-historical.htm", "https://www.cedars-sinai.org/health-library/diseases-and-conditions/a/aids-related-cancers.html", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-118.png?ssl=1", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-03-29T05:59:00+00:00"}