{"result_id": "288044", "URL": "https://expose-news.com/2023/01/23/why-are-they-hiding-and-ignoring-vaccine-effects/", "timestamp": "2023-04-25 17:19:10 CEST+0200", "meta": {"description": "Pre-pandemic, a sudden death of a younger person would have triggered an autopsy, but not now, there are too many people dying unexpectedly - 29% more than usual in Scotland and 2,000 a week in England.  Yet the increase in deaths is being ignored by governments, public health authorities and many others. Not only are…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/23/why-are-they-hiding-and-ignoring-vaccine-effects/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Why are governments and public health authorities hiding and ignoring “vaccine” adverse effects?", "cleaned_text": "Pre-pandemic, a sudden death of a younger person would have triggered an autopsy, but not now, there are too many people dying unexpectedly – 29% more than usual in Scotland and 2,000 a week in England. Yet the increase in deaths is being ignored by governments, public health authorities and many others.\n\nNot only are the potentially fatal adverse effects of mRNA vaccination being hidden at all costs, but there is intent to continue administering it. Is it excessive pride, gross incompetence, or misplaced faith in technology? Are our leaders really that daft?\n\nAre we crossing the Rubicon or being rowed across the Styx?\n\nIn his book – The Genetic Age: Our Perilous Quest To Edit Life – Mathew Cobb affirms that biotechnology does indeed pose new and very serious threats to humanity. But way back in March 2022, when his book was completed, Cobb believed that Covid-19 did not come from a lab. He rated the Covid pandemic a narrow escape from complete catastrophe. Given the evidence available now, I doubt that Cobb still holds that opinion with any degree of certainty.\n\nSo, have we merely crossed the Rubicon (after which there is no turning back) with unresolved worries about what dangerous outcomes might possibly eventuate, as Cobb appears to believe, or have we been rowed across the River Styx and arrived at hell?\n\nThe latest figures from National Records of Scotland have revealed that excess all-cause deaths are running at 29% above the longer-term average. Scotland is not alone. Highly vaccinated nations around the world are suffering similar rises.\n\nSo who actually is dying, what are they dying of, and why are the authorities not investigating or raising alarms? Apparently, fit and healthy former American Idol star CJ Harris died suddenly this week at age 31. His family are shocked and wants answers. The Walker County Alabama Coroner told TMZ “doctors at the hospital where Harris was rushed have listed his official cause of death as a heart attack — and therefore, an autopsy is not necessary.”\n\nIt is an answer that closes a door with a ring of finality – it was just a heart attack and it could have happened to anyone. A door that is similarly being closed every week around the world on the shocked relatives of tens of thousands of apparently healthy victims dying suddenly. “Heart attack” is actually a rather vague and generic term that covers a wide range of cardiac conditions and offers little by way of explanation. Pre-pandemic, a sudden death of a younger person would have triggered an autopsy, but not now, there are too many people dying unexpectedly – 29% more than usual in Scotland and 2,000 a week in England.\n\nIt is no surprise then that health authorities, who endorse and administer Covid vaccines, have been selectively “adjusting” (???) data to make mRNA vaccination outcomes look attractive, rather than harmful. This has led to the unusual proposition circulating in MSM that there is a positive post-vax jump in health (???). This week the UK Office of National Statistics (“ONS”) was busted. It admitted it had been overestimating the vaccinated proportion of the population. This means that ONS data should not, according to the ONS itself, be used to measure vaccine outcomes. This “error” (????) was in fact the source of the entirely imaginary post-vax health effect. It is of course the other way around.\n\nAnother data error has led some to believe that myocarditis is more common after Covid than after mRNA vaccination. The source of this howler is the fact that Covid cases have become, and actually always were, grossly underreported especially now that Omicron is so mild. An error that reverses the correct conclusions.\n\nSo why are authorities so liable to make these simple “mistakes” (???). Ordinary psychology holds plenty of answers. Folk singer Woody Guthrie died of Huntington’s Disease, which is caused by a genetic defect that runs in families – in this case a sequence of DNA bases that repeats itself. The more it repeats, the earlier in life you develop the always fatal condition. Following detailed genetic research, it is now possible for family members known to be at risk of Huntington’s to get a test to discover if they have the fatal gene sequence. But only 10% of affected people choose to get the test. People who are possibly facing a serious health issue, would rather not know. Exactly the situation, research shows, which is now facing those who took the mRNA vaccines.\n\nAnother well-known psychological trait is also in play here. Humans are natural “cognitive misers.” We prefer simple comforting explanations, and therefore readily accept false ideas as long as they make everything look rosy. This predisposes many to avoid digging too deep when faced with worrying situations.\n\nAustralian Covid stats and media reporting offers a case in point. More people are dying of heart attacks in Australia than ever before, up 17% last year. Most people in Australia are vaccinated. So why are so many people dying? Enter the cognitive miser effect. The Medical Journal of Australia thinks it must be due to Covid, long Covid, and/or delayed treatment. No definitively reliable evidence supports this. The basis of the statistical fallacy is the underestimation of Covid cases and the overestimation of the number of Covid deaths, explained HERE by epidemiologist Dr. Tracy Hoeg.\n\nOr take Canada, suffering from the same high unprecedented death rates, where urgent care physician Dr. Raj Bhardwaj has appeared on CBC to announce that there is a “stroke season” that follows a flu season, something he said he has never noticed before. He now realises it is real (???) because so many people are having strokes. Possibly a comforting idea, but implausible and not the cause of the high incidence of strokes. Even the US CDC has admitted that the bivalent Covid vaccine is associated with a higher risk of stroke, an actually plausible causal candidate for the rash of Canadian strokes.\n\nIt is very reassuring to suppose, as Matthew Cobb did, that a genetic catastrophe hasn’t happened this time, but unfortunately, it is happening all around us right now. We didn’t dodge a bullet or have a lucky escape. Despite assertions that excess deaths must be due to Covid, serious Covid infection is largely behind us and has been simply ruled out as a cause by analysis. However, the majority would prefer not to notice – they are cognitive misers.\n\nMeanwhile, those who have woken up and are reading the studies and stats correctly are jumping up and down outside the fire circle in frustration. The tragedy here is that our health services could be offering testing services that would indicate beneficial interventions to those affected. Instead, they are looking the other way.\n\nGiven the high rate of sudden deaths and deaths at home, it is clear that many are unaware they are affected until it is too late. So what conditions are showing up on the radar? The obfuscation of health stats is hiding the whole picture, but by now there are enough indications to implicate the following major contributors to high death rates and hospital admissions that are associated with mRNA vaccination:\n\nThese conditions are interrelated. Immune mechanisms are responsible for genetic repair which helps prevent cancer. Strokes, clots and cardiac conditions are connected with our circulatory system. Certainly the spike protein produced by cells following mRNA vaccination is cardiotoxic and a 17 January 2022 study shows in many cases persistent for weeks. There is also a growing suspicion that mRNA genetic sequences are reverse transcribing into our genome increasing longer-term risks.\n\nThe exact mechanisms for these problems and their connection to mRNA vaccines may only be revealed when more extensive research is completed, research that authorities are assiduously avoiding funding. Worse, it is now clear that Pfizer’s trial data was manipulated to hide the connection. Even worse, Biden’s White House secretly sought to suppress studies published in prestigious and authoritative journals like the BMJ, whose concerning safety signals might have led to vaccine hesitancy.\n\nThis is clearly a lot more concerning than the actions of a cognitive miser. It represents a determination to not just hide the potentially fatal adverse effects of mRNA vaccination at all costs, but also continue administering it. Like a serial killer they can’t bring themselves to stop. If this was a homicide case, it would be interpreted as evidence of psychopathic behaviour pointing to guilt or possibly corruption on a grand scale.\n\nOr is this simply due to excessive pride, gross incompetence, or misplaced faith in American technology? Are our leaders really that daft?\n\nThis brings us to another very serious concern – has mRNA vaccination left some people subject to a lethargic mental fog, unable to change gear or reason outside their set ideas. Angry that their authority is being questioned, and blustering in response to the obvious safety signals. The truth is that medical authorities and experts (???) are increasingly adrift in a sea of obvious harm, unable to cope, unable to change gear, stumbling through ill prepared, speculative, unsupported, and far-fetched explanations of unprecedented death rates in media interviews like Dr Bhardwaj’s. A medico who, like so many others, couldn’t bring himself to question the sacred cow of vaccination. Others are fingering alcohol, sunshine, freezing cold, or even holidays. All these are people who can’t bring themselves to face a well-known fact confirmed by multiple pre-pandemic studies – gene therapy is dangerous. mRNA vaccination needs to be stopped and not restarted. Moreover, the public needs an honest education about the absolute risks and dangers of biotechnology.\n\nGuy Hatchard, PhD, was formerly a senior manager at Genetic ID a global food testing and safety company (now known as FoodChain ID). You can subscribe to his websites HatchardReport.com and GLOBE.GLOBAL for regular updates by email. GLOBE.GLOBAL is a website dedicated to providing information about the dangers of biotechnology.", "opengraph": {"type": "article", "title": "Why are governments and public health authorities hiding and ignoring “vaccine” adverse effects?", "url": "https://expose-news.com/2023/01/23/why-are-they-hiding-and-ignoring-vaccine-effects/", "description": "Pre-pandemic, a sudden death of a younger person would have triggered an autopsy, but not now, there are too many people dying unexpectedly – 29% more than usual in Scotland and 2,000 a week …", "article:published_time": "2023-01-23T10:00:00+00:00", "article:modified_time": "2023-01-22T23:15:48+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/FeatJan23b.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://hatchardreport.com/", "https://www.nrscotland.gov.uk/statistics-and-data/statistics/statistics-by-theme/vital-events/general-publications/weekly-and-monthly-data-on-births-and-deaths/deaths-involving-coronavirus-covid-19-in-scotland", "https://wherearethenumbers.substack.com/p/uk-statistics-regulator-agrees-with", "https://www.dailymail.co.uk/news/article-11659977/Australians-dying-fatal-heart-attacks-lingering-impacts-Covid-lockdowns.html", "https://www.theage.com.au/national/fatal-heart-attacks-have-surged-in-australia-here-s-why-20230117-p5cd22.html", "https://twitter.com/TracyBethHoeg/status/1616855315127107584", "https://twitter.com/thevivafrei/status/1616825564802826241", "https://onlinelibrary.wiley.com/doi/10.1111/apm.13294", "https://twitter.com/thackerpd/status/1615322067510886403", "http://HatchardReport.com", "https://globe.global/about-globe/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-23T10:00:00+00:00"}