{"result_id": "288029", "URL": "https://expose-news.com/2023/03/02/pfizer-kills-children-for-profit/", "timestamp": "2023-04-25 17:18:45 CEST+0200", "meta": {"description": "In September 2022, the UK Health Security Agency made a controversial or fabulous announcement, depending on which side of the fence you're on, that it would no longer offer the Covid-19 vaccine to healthy 5 to 11-year-old children. This decision was based on official data from the Office for National Statistics, which revealed a 22%…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/03/02/pfizer-kills-children-for-profit/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Pfizer kills Children for Profit: COVID Vaccine causes 17x increase in Child Deaths across Europe", "cleaned_text": "In September 2022, the UK Health Security Agency made a controversial or fabulous announcement, depending on which side of the fence you’re on, that it would no longer offer the Covid-19 vaccine to healthy 5 to 11-year-old children.\n\nThis decision was based on official data from the Office for National Statistics, which revealed a 22% increase in deaths among children aged 5 to 9 since the NHS had begun vaccinating children aged 5-11 in April 2022.\n\nBut the issue of child deaths from Covid-19 was not unique to the UK. Across Europe, concerns should have been growing about the safety and efficacy of Covid-19 vaccines for children.\n\nBecause by the end of 2022, excess deaths among children had increased by a shocking 1,580%.\n\nPrior to the approval of the Covid-19 vaccine for children aged 12 to 15, the number of excess deaths among children in Europe was non-existent.\n\nAccording to EuroMOMO, in the first 21 weeks of 2021, there were 346 fewer deaths than expected, meaning there were minus-346 or 0 excess deaths.\n\nHowever, as soon as the European Medicines Agency (EMA) extended the emergency use authorisation of the Pfizer Covid-19 injection to 12 to 15-year-olds in week 22 of 2021, the number of excess deaths began to rise, significantly.\n\nThese figures raise serious questions about why experimental gene therapy “vaccines” were pushed on children when the alleged Covid-19 virus was posing no risk to them.\n\nThis increase in excess deaths was of course not publicised in the mainstream media. But came as no surprise to those who were already aware of the heavily censored damage that Covid-19 vaccination was doing to adults.\n\nIf it had been publicised, instead of being swept under the carpet, it would have sparked widespread concern among parents who had chosen to vaccinate their children due to believing everything they are told by a man, in a suit, on the television.\n\nIt would have also prevented other parents from forcing their children to get a vaccine they simply did not, and do not need, when the European Medicines Agency (EMA) extended the emergency use authorisation of the Pfizer Covid-19 injection for use in 5 to 11-year-old children just a few months later.\n\nThis may have, prevented the shocking increase in excess deaths that were recorded among children in Europe up to the end of 2022.\n\nBecause the figures show that there were 466 fewer deaths than expected among children in Europe throughout the whole of 2020 at the height of the alleged pandemic.\n\nHowever, the pandemic didn’t really hit Europe until around March 2020.\n\nThis makes the EMA’s decision to jab children look even worse, as 616 fewer deaths were recorded among children at the height of the alleged pandemic.\n\nIn fact, the figures prove that children were in better shape than ever, and the alleged pandemic was not affecting them in any significant way.\n\nUnfortunately, following the emergency approval of the Covid vaccine for children, a staggering 1,953 excess deaths were recorded between week 22 of 2021 and week 52 of 2022.\n\nFor comparison, there were 334 excess deaths recorded among children between week 22 and week 52 of 2019. Unfortunately, when we couple this figure with child deaths recorded in 2020, we discover there were 132 fewer deaths than expected among children aged 0-14 across Europe.\n\nThe figures and correlation are clear:\n\nThe EMA approval of the Covid-19 vaccine for children caused a significant increase in excess deaths across Europe following a long period of children suffering far fewer deaths than expected prior to the approval.\n\nThankfully, the increase in deaths was enough to convince the UK Government that all healthy 5 to 11-year-olds should not be offered a Covid-19 vaccine. But only after they had realised it was killing children.\n\nIn September 2022, the UK Health Security Agency announced that it would no longer offer the Covid-19 vaccine to healthy children aged 5 to 11.\n\nAccording to an article published in The Guardian, “The decision to reduce the number of children who are offered Covid jabs has prompted outcry from parent groups and academics.”\n\nBut this decision came after official data from the Office for National Statistics (ONS) revealed that deaths among children aged 5 to 9 had increased by 22% compared to the previous two years since the NHS began vaccinating children aged 5-11 on April 4, 2022.\n\nIn April 2022, the NHS stated that it would start vaccinating children aged 5-11, calling it the biggest and most successful vaccination drive in health service history.\n\nAt the time, Dr. Nikki Kanani, GP and Deputy Lead for the NHS COVID-19 vaccination program, encouraged parents to get their children vaccinated at the earliest opportunity, stating that the vaccine was safe and effective. She even mentioned that her 10-year-old daughter would be getting the vaccine that week.\n\nIt is unclear whether the NHS and Dr. Kanani still stand by their claims, now that the UKHSA has decided to stop offering the vaccine to 5 to 11-year-olds.\n\nAnother ONS report also reveales that unvaccinated children aged 10 to 14 had a Covid-19 mortality rate of 0.31 per 100,000 person-years between January 2021 and May 2022.\n\nHowever, children who had received one dose of the vaccine had a mortality rate of 3.24, while those who had received three doses had a mortality rate of 41.29 per 100,000 person-years.\n\nThis revealed that unvaccinated children were less likely to die of Covid-19 than vaccinated children. Meaning the real-world effectiveness of Pfizer’s Covid-19 vaccine against death among children was also negative during the period between January 2021 and May 2022.\n\nPartly vaccinated children were 11 times or 966.67% more likely to die of Covid-19 than unvaccinated children, while triple vaccinated children were 137.3 times or 13,633.33% more likely to die of Covid-19 than unvaccinated children.\n\nThe claimed 95% effectiveness against death made by Pfizer was nowhere near achieved. In fact it was an outright lie.\n\nFurthermore, the all-cause mortality rate among unvaccinated children was 6.39 per 100,000 person-years. It was slightly higher at 6.48 among partly vaccinated children, but increased significantly to 97.28 among double-vaccinated children and a shocking 289.02 per 100,000 person-years among triple-vaccinated children.\n\nThus, according to official UK Government data, double-vaccinated children were 1422% or 15.22 times more likely to die of any cause than unvaccinated children, while triple-vaccinated children were 4423% or 45.23 times more likely to die of any cause than unvaccinated children.\n\nIt is truly unbelievable that children have been subjected to experimental gene therapy injections that we are told are vaccines, especially when official Government figures prove the alleged Covid-19 virus was posing no risk to the whatsoever.\n\nThe cost of administering experimental vaccines to children is evident in the excess deaths that have been recorded since their approval.\n\nThe decision to jab children with an experimental mRNA gene therapy raises serious questions about the motives of Governments, NGOs, Medicine Regulators, and tax-payer-funded scientists and doctors.\n\nIt is time for those in power to take responsibility for the harm that has been done to children and to reconsider their approach to public health. Children deserve better than to be treated as guinea pigs in a global experiment.", "opengraph": {"type": "article", "title": "Pfizer kills Children for Profit: COVID Vaccine causes 17x increase in Child Deaths across Europe", "url": "https://expose-news.com/2023/03/02/pfizer-kills-children-for-profit/", "description": "In September 2022, the UK Health Security Agency made a controversial or fabulous announcement, depending on which side of the fence you’re on, that it would no longer offer the Covid-19 vacc…", "article:published_time": "2023-03-02T06:59:00+00:00", "article:modified_time": "2023-03-01T20:37:27+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/killing-children-2.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-1.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://www.ema.europa.eu/en/news/comirnaty-covid-19-vaccine-ema-recommends-approval-children-aged-5-11", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-3.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-4.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.theguardian.com/world/2022/sep/06/anger-at-plans-to-roll-back-covid-vaccines-to-under-11s-in-england", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-6.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/weeklyprovisionalfiguresondeathsregisteredinenglandandwales", "https://www.england.nhs.uk/2022/04/nhs-rolls-out-covid-vaccine-to-five-million-5-to-11-year-olds/", "https://www.england.nhs.uk/2022/04/nhs-rolls-out-covid-vaccine-to-five-million-5-to-11-year-olds/", "https://www.england.nhs.uk/2022/04/nhs-rolls-out-covid-vaccine-to-five-million-5-to-11-year-olds/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-9.png?ssl=1", "https://expose-news.com/2022/08/06/dsitracted-boris-covid-vaccination-kills-children/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-03-02T06:59:00+00:00"}