{"result_id": "288048", "URL": "https://expose-news.com/2023/01/27/controlled-narrative-telegraph-rewrites-history-covid-vaccine/", "timestamp": "2023-04-25 17:19:16 CEST+0200", "meta": {"description": "Covid booster vaccines for healthy people are being wound down as the Government moves away from its \"pandemic emergency response\" approach. Amid dwindling uptake, the UKHSA is ending its evergreen offer [1] which has been in place since the inception of the coronavirus vaccine rollout. Third doses were launched in Dec 2021 but will end…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/27/controlled-narrative-telegraph-rewrites-history-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Controlled Narrative: Telegraph alters article hours later to hide COVID Vaccine info that your Government doesn’t want you to know", "cleaned_text": "Covid booster vaccines for healthy people are being wound down as the Government moves away from its “pandemic emergency response” approach.\n\nAmid dwindling uptake, the UKHSA is ending its evergreen offer [1] which has been in place since the inception of the coronavirus vaccine rollout. Third doses were launched in Dec 2021 but will end on Feb 12, the UKHSA has announced. The current autumn booster drive for over-50s will also end on the same day. The Telegraph understands that the Government is also preparing to wind down the open offer of the first two doses over the coming months.\n\nThe paragraphs above were the beginning of an article titled ‘Covid-19 booster jab offer set to end’ published by The Telegraph on Wednesday afternoon. The article headlined the end of the covid vaccination programme. That was at 2:49 pm.\n\nSeven hours later The Telegraph published a re-written version titled ‘Covid booster jabs for elderly to continue this year’ emphasising that “Government also prepares to launch emergency surge vaccinations if novel variant of sufficient concern emerges.”\n\nAlthough the second version contains the same information about the end of the covid vaccination programme, the very significant news that the covid vaccination programme is being wound down has been buried further down into the article in such a way that it would easily be missed unless one was specifically searching for it. Why?\n\n[1] Note: It’s unclear what exactly the term “evergreen offer” means in relation to “vaccines” or a “public health emergency.” Evergreen offer is a term used in marketing, find out more HERE.\n\nOn 25 January 2023 at 19:48, Dr. Aseem Malhotra tweeted an article published by the Telegraph titled ‘Covid-19 booster jab offer set to end’ with the lead sentence: “Government is also preparing to wind down the open offer of the first two doses over the coming months due to dwindling uptake.”\n\nAt 22:31, a Twitter user responded to Dr. Malhotra noting that the article had been edited, not by just a little but by a lot, and posted a screenshot of the new version.\n\nAnother Twitter user posted screenshots of the original article:\n\nThe above images are only the beginning of the article but fortunately, one of our readers had captured images of the remainder, except one paragraph, and sent them to us.\n\nComparing the two versions, it appears The Telegraph’s rewritten version is deceitful while at the same time allowing for a defence that the end of the vaccination programme was publicised. In the public interest and to enable you to make your own comparison and assess for yourself, we have reproduced the two versions below, one after the other.\n\nPlease note that we have reproduced the original version text from the images noted above and the text that is missing is as noted. The missing text, however, is included in the rewritten version as we have indicated.\n\nGovernment is also preparing to wind down the open offer of the first two doses over the coming months due to dwindling uptake\n\nCovid booster vaccines for healthy people are being wound down as the Government moves away from its “pandemic emergency response” approach.\n\nHealthy people between 16 and 49 years of age are currently able to get three Covid jabs, two primary doses and a booster.\n\nHowever, amid dwindling uptake, the UKHSA is ending its evergreen offer which has been in place since the inception of the coronavirus vaccine rollout.\n\nThird doses were launched in Dec 2021 but will end on Feb 12, the UKHSA has announced. The current autumn booster drive for over-50s will also end on the same day.\n\nThe Telegraph understands that the Government is also preparing to wind down the open offer of the first two doses over the coming months.\n\nThe move will mean unvaccinated healthy under-50s will soon not be able to get a Covid jab unless recommended by a medical professional.\n\nMore targeted strategy to be followed\n\nHealth officials are hoping to move to a more targeted vaccination strategy where non-vulnerable individuals only receive a Covid jab if there is a clear clinical need.\n\nThe Joint Committee for Vaccination and Immunisations (JCVI) on Wednesday gave advice to the Government to start planning for a spring and autumn Covid booster campaign for the most vulnerable.\n\nDetails of this are yet to be determined but it is understood it will be similar to in 2022. Spring doses last year were given to over-75s, the immunosuppressed and care home residents, while over-50s and clinically vulnerable individuals could get an autumn 2022 dose.\n\nProfessor Wei Shen Lim, chair of COVID-19 vaccination on the JCVI, said: “The COVID-19 vaccination programme continues to reduce severe disease across the population, while helping to protect the NHS.\n\n[2 Text missing] … spring booster programme for those greatest at risk.”\n\nLimited uptake by the young and healthy\n\nThe open-door policy of Covid boosters for the healthy and young is being ended because following initial widespread uptake, there has been limited uptake recently.\n\nSince April 2022 less than 0.1 per cent of eligible under-50s have got the third dose, for example.\n\nAlmost 13.7 million 16-49-year-olds have received three doses of the Covid vaccine while 19.8 and 21.3 million people had their second and first doses, respectively.\n\nThere are 29.6 million people aged between 16 and 49, according to Government data, with just 46 per cent of eligible under-50s getting three doses.\n\nCovid booster jabs for elderly to continue this year\n\nGovernment also prepares to launch emergency surge vaccinations if novel variant of sufficient concern emerges\n\nTwice-yearly Covid booster vaccines for the elderly are set to continue this year, it has been announced.\n\nFollowing a widespread booster campaign in 2021, recent vaccination programmes have focused on jabs for the elderly and most vulnerable.\n\nA booster campaign for over-75s, the immunosuppressed and care home residents last spring was followed by an autumn push for jabs for over-50s and the clinically vulnerable amid fears of a flu and Covid “twindemic”.\n\nOn Wednesday, the joint committee for vaccination and immunisation (JCVI) advised the Government to start planning for a similar spring and autumn Covid booster campaign.\n\nThe ongoing autumn booster rollout is set to conclude on Feb 12, with guidance on how and when the new spring campaign will happen expected in the next few weeks.\n\nThe Government is also preparing to launch emergency surge vaccinations if a novel variant of sufficient concern were to emerge.\n\nProf Wei Shen Lim, the chairman of Covid vaccination on the JCVI, said: “The Covid vaccination programme continues to reduce severe disease across the population while helping to protect the NHS.\n\n“That is why we have advised planning for further booster vaccines for persons at higher risk of serious illness through an autumn booster programme later this year. We will, very shortly, also provide final advice on a spring booster programme for those at greatest risk.” [2 Text missing as noted in “original version” above]\n\nThe US Food and Drug Administration announced this week that it was considering moving to an annual Covid jab programme similar to the flu vaccine.\n\nThe proposals would do away with the need for a two-dose primary course before an omicron-specific booster and see people given whichever booster is available in any given year in a bid to simplify the process.\n\nThere is widespread debate over the future of Covid vaccines, with calls for a flu-like approach, some insisting children do not need the jab and others advocating a more tailored programme targeting the most vulnerable.\n\nAlongside the conclusion of the current autumn booster programme, the UK Health Security Agency (UKHSA) is also ending the evergreen offer of Covid booster vaccines for healthy people.\n\nThe Government said that was because of low uptake and a desire to move towards a “pandemic recovery” response.\n\nHealthy people aged between 16 and 49 are currently able to get three Covid jabs – two primary doses and a booster. However, the UKHSA is ending its evergreen offer, which has been in place since the inception of the Covid vaccine rollout.\n\nThird doses were launched in December 2021 but will end on Feb 12, the UKHSA announced. The autumn booster drive for the over-50s will also end on this day.\n\nThe Telegraph understands the Government is also preparing to wind down the open offer of the first two doses over the coming months. The move will mean unvaccinated healthy under-50s will soon not be able to get a Covid jab unless one is recommended by a medical professional.\n\nThe open-door policy of Covid boosters for the healthy and young is being ended because, following initial widespread uptake, there has been scarcely any recent uptake. Since April 2022 less than 0.1 per cent of eligible under-50s have got the third dose.\n\nAlmost 13.7 million 16 to 49-year-olds have received three doses, while 19.8 and 21.3 million people had their second and first doses respectively.\n\nThere are 29.6 million people aged between 16 and 49, according to Government data, with just 46 per cent of eligible under-50s getting three doses.", "opengraph": {"type": "article", "title": "Controlled Narrative: Telegraph alters article hours later to hide COVID Vaccine info that your Government doesn’t want you to know", "url": "https://expose-news.com/2023/01/27/controlled-narrative-telegraph-rewrites-history-covid-vaccine/", "description": "Covid booster vaccines for healthy people are being wound down as the Government moves away from its “pandemic emergency response” approach. Amid dwindling uptake, the UKHSA is ending i…", "article:published_time": "2023-01-27T11:30:00+00:00", "article:modified_time": "2023-01-27T19:08:47+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/tlegraph.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Interesting to see that the article has now been completely changed and the direction of spin reversed… and I note that BBC have not mentioned it at all. Something very strange going on?? Big revelations on way?? <a href=\"https://t.co/60DV33SZ8s\">pic.twitter.com/60DV33SZ8s</a></p>— Jake (@jake7uk) <a href=\"https://twitter.com/jake7uk/status/1618376145342435331?ref_src=twsrc%5Etfw\">January 25, 2023</a></blockquote> \n"], "movies": [], "links": ["#", "https://youtu.be/l9CmwgH66Do", "https://www.telegraph.co.uk/news/2023/01/25/covid-vaccine-booster-jab-nhs-uk-end/", "https://twitter.com/DrAseemMalhotra/status/1618334961194663936", "https://www.telegraph.co.uk/news/2023/01/25/covid-vaccine-booster-jab-nhs-uk-end/", "https://t.co/60DV33SZ8s", "https://twitter.com/jake7uk/status/1618376145342435331?ref_src=twsrc%5Etfw", "https://twitter.com/Kevin27539603/status/1618381977631232002", "https://www.telegraph.co.uk/authors/j/jk-jo/joe-pinkstone/", "https://www.telegraph.co.uk/health-fitness/body/omicron-covid-vaccine-what-need-know-new-uk-booster/", "https://www.telegraph.co.uk/news/2021/11/29/booster-jabs-offered-adults-bid-beat-omicron/", "https://www.telegraph.co.uk/news/2022/03/25/covid-infections-rise-nearly-one-million-week/", "https://www.telegraph.co.uk/health-fitness/body/boosters-vaccines-jabs-how-protect-against-flu-covid-twindemic/", "https://www.telegraph.co.uk/news/2022/12/29/china-now-perfect-breeding-ground-new-covid-variants-britain/", "https://www.telegraph.co.uk/news/2022/08/15/uk-authorises-next-generation-covid-omicron-booster-vaccine/", "https://www.telegraph.co.uk/news/2022/10/13/twelve-million-over-50s-invited-book-covid-booster-friday/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-27T11:30:00+00:00"}