{"result_id": "288007", "URL": "https://expose-news.com/2023/02/06/us-dod-is-running-the-vaccine-fraud/", "timestamp": "2023-04-25 17:18:04 CEST+0200", "meta": {"description": "“[Pfizer] did not defraud the government. We delivered the fraud that the government ordered.”  Sasha Latypova used these words to describe the basis on which Pfizer has requested the dismissal of a False Claims Act case brought against them for their covid “vaccines.” The US Department of Defence ordered “demonstrations” from pharmaceutical companies using the…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/02/06/us-dod-is-running-the-vaccine-fraud/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "US Department of Defence has been running the “covid vaccine” fraud worldwide", "cleaned_text": "“[Pfizer] did not defraud the government. We delivered the fraud that the government ordered.” Sasha Latypova used these words to describe the basis on which Pfizer has requested the dismissal of a False Claims Act case brought against them for their covid “vaccines.”\n\nThe US Department of Defence ordered “demonstrations” from pharmaceutical companies using the same secretive framework they use to order weapons. While telling us they were pharmaceutical products, for legal reasons they described them as emergency use authorised “countermeasures.” No pharmaceutical regulation applies to countermeasures.\n\n“They were claiming that they’re producing pharmaceutical products to the good manufacturing standards when they perfectly well knew, I assure you, they were all aware of this. They perfectly well knew that no pharmaceutical regulations apply to these things, countermeasures … They’re just lying to you that these are pharmaceuticals. They’re actually not,” Latypova explained.\n\nThe international conference ‘Pandemic Strategies: Lessons and Consequences’ held at the Stockholm Waterfront on 21-22 January 2023 gathered 15 leading doctors, researchers and lawyers from the US, Canada, UK, Germany, France, Belgium, Switzerland, Israel, Ukraine and Norway, along with 7 Swedes.\n\nPresentations and panel discussions are being released in the order that they appeared on the program at a rate of 3 per day.\n\nAlexandra “Sasha” Latypova was one of those who gave a presentation. She holds an MBA degree and is a former Pharmaceutical R&D Executive. Latypova has spent approximately 25 years in the pharmaceutical industry and has owned and managed several contract research organisations – conducting clinical trials for over 60 pharmaceutical clients worldwide. She became concerned about the irregularities, cover-up and apparent fraud relating to the extremely high number of deaths and injuries associated with the covid injection rollout.\n\nIn her presentation, she explained that her initial investigation was to look into the so-called covid vaccines’ compliance with good manufacturing practices. It is the practice required to conform to quality guidelines recommended by regulatory agencies and applies to drugs, food and other mass-produced products that are consumed. It is to ensure, for example, that if you buy your favourite beer today and then you go to the to buy it again a week from now or a month from now, your experience is the same. The same goes for medicines like Aspirin that you buy in a pharmacy. You don’t expect a product to be a thousand times different a week from now versus today.\n\n“As a highly regulated industry, pharmaceutical manufacturers are supposed to comply with [good manufacturing practice]. And this means that the product that they claim that they make, with the ingredients that they claim that they make, is supposed to be in every vial, every shot, every pill, over and over and over again, and they should be almost identical to each other,” Latypova said.\n\nIn the first few months of her investigation, Latypova found evidence of “very bad manufacturing practices” in relation to the mRNA injections. “When I looked at the [ ] graph [of serious adverse events and deaths recorded in VAERS] for mRNA injections for the US, I found [the below]”\n\n“[I’m] only looking at serious adverse events and deaths. There were almost no adverse events reported in some lots, and some lots had thousands and they had hundreds of deaths. And so, this is not good manufacturing practice-compliant product at all,” said Latypova. “I’m not endorsing flu vaccines or any vaccines anymore, because until this is investigated fully, nobody should be taking anything. That’s my professional opinion.”\n\nThe above graph shows Johnson & Johnson (Janssen), Moderna and Pfizer. Below is a graph for Moderna. The blue colour represents serious adverse events and the orange represents death post-vaccination. “A well-manufactured product should not look like this at all,” Latypova explained.\n\nExplaining the significance of the lot labelled in the graph above, Latypova said:\n\n“On January 18, Orange County, California Health Department flagged this particular lot of Moderna for what they called ‘excessive number of allergic reactions’. Nothing was done about it. The injections were not stopped. In fact, this lot was being sold all over the United States until it ran out in late March.\n\n“And as you know, if there is salmonella in a salad, they will recall the entire product from all the shelves in the country. Right? That’s what you should do as a manufacturer. All manufacturers have systems to detect this. And the majority of recalls of products are voluntary because they don’t want this to happen.\n\n“Yet [with this lot from Moderna], nobody stopped. Not the manufacturer, not the health authorities of Orange County, not the CDC, FDA, or whoever was supposed to monitor this, they continued selling this lot. It’s now associated with over 65 deaths in the US and over 3000 serious adverse events. So, after something like this happens, everything that follows is intentional.”\n\nEvery researcher that has questioned or challenged regulatory authorities has been told: “We looked at it. It’s safe and effective. Go get vaccinated.” Why were they all behaving this way? Why are they all following the same script the world over?\n\nLatypova has been collaborating with legal researcher Katherine Watt, who publishes articles on a Substack page titled ‘Bailiwick News’, to reveal the legal structure – or rather the pseudo-legal structure as it’s not lawful – of this government, pharma, military criminal cartel. “It actually is operating all over the world,” Latypova said.\n\nIn the 1960s a contracting framework was put into place for NASA called ‘Other Transaction Authority’. “Now eleven federal agencies use it. [The] Department of Defence is a particularly huge user of this contracting method because it allows them to contract without following any federal procurement rules and regulations with a lot of secrecy,” Latypova said. “They typically use this framework to order weapons from defence contractors, but now they’re using the same framework to order what they tell us is a pharmaceutical product.”\n\nIn addition to this, there is a US code, which Latypova highlights in her presentation, which says that the use of emergency use authorised “countermeasures” is not a clinical investigation under a public health emergency. The significance of this, Latypova explained, is that if a countermeasure cannot be a clinical investigational product, then no pharmaceutical regulation applies to these products.\n\n“So, here’s the lie that our government told to us and told to the world and the governments all over the world repeated to their citizens:\n\n“They were claiming that it’s a health event. They were claiming that they’re producing pharmaceutical products to the good manufacturing standards when they perfectly well knew, I assure you, they were all aware of this. They perfectly well knew that no pharmaceutical regulations apply to these things, countermeasures.\n\n“They’re just lying to you that these are pharmaceuticals. They’re actually not … The government lied to us about this being a health event … [but] in reality, what they did, they organised the response to it as if it was war.”\n\nBelow is a slide from the presentation where the organisational structure of Operation Warp Speed was discussed. “The chief operating officer is the Department of Defence. We were told, ‘oh, they’re just doing logistics’. No, they’re not just doing logistics. They’re running the whole thing,” Latypova said.\n\nAs proof of this, Latypova cited the case where Pfizer or the FDA was refusing to release clinical trial data in less than 75 years.\n\n“Who was arguing in court on behalf of Pfizer? Pfizer lawyers were not even in the room. It was the Department of Justice. So why is the US government defending presumably a private commercial interest of a pharmaceutical company?\n\n“[In the slide above] you can see that the pharmaceutical companies are a third level down. They are not in charge, but they’re getting tremendous amounts of money to shut up and follow the orders and do as they’re told. [ ] The whole operation is run by the Department of Defence and the US government. I’m not absolving Pharma … of any responsibility. They are criminals in this cartel, and they’re collaborating, and they’re co-conspirators, and should be prosecuted together.”\n\nIn the same Operation Warp Speed presentation, Operation Warp Speed and BARDA were bragging about their vaccine manufacturing portfolio. On the right-hand side, they call it vaccine-supporting efforts. “These are all established defence contractors … who already had an established vaccine manufacturing base. At that time, it was called pan influenza. In early 2020, they simply switched to covid,” Latypova said. “These are the companies who are really making these products.”\n\n“On [the left-hand] side, it’s called ‘Demo’. That’s what the government ordered, a demonstration, which is fake by definition … These words are very carefully designed. They have legal meaning, and that’s exactly what they bought. They bought demonstrations.”\n\nThey spent $47 billion on research and development contracts – $33 billion was spent on “vaccines.” All the contracts are publicly available HERE. All of them say the Department of Defence contracted these companies. And they’re managed through Advanced Technologies International, a long-standing contracts manager for the Department of Defence.\n\nThey exempt everyone who participates in this, regardless of where they’re working, as long as they’re following the orders, they’re exempt from liability under the Prep Act clause. That same Prep Act clause states that this is a dual-use civil and military application product. How they exempted themselves internationally is by Pfizer forcing countries to sign predatory contract clauses where the national governments had to lift good manufacturing practice requirements or any drug importation requirements and look the other way. Clauses that if, for example, Swedish citizens get injured and sue Pfizer, then the Swedish government has to indemnify Pfizer and put state assets such as military bases, embassies, and other state assets as collateral. “That’s because it’s the US government who wants that base, not the private commercial manufacturer,” Latypova explained.\n\n“You maybe heard about Brooke Jackson’s case in the US. She’s suing Pfizer under False Claims Act that they defrauded the government. Well, Pfizer already filed a motion to dismiss – the case hasn’t been dismissed yet – but Pfizer already in court stated that: ‘Please dismiss this case, Judge. We did not defraud the government. We delivered the fraud that the government ordered.”\n\nYou can watch Latypova’s full presentation below.", "opengraph": {"type": "article", "title": "US Department of Defence has been running the “covid vaccine” fraud worldwide", "url": "https://expose-news.com/2023/02/06/us-dod-is-running-the-vaccine-fraud/", "description": "“[Pfizer] did not defraud the government. We delivered the fraud that the government ordered.”  Sasha Latypova used these words to describe the basis on which Pfizer has requested the dismissa…", "article:published_time": "2023-02-06T10:00:00+00:00", "article:modified_time": "2023-02-05T23:39:42+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/FeatFeb6a.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://lakaruppropet.se/international-conference-pandemic-strategies/", "https://bailiwicknews.substack.com/about", "https://bailiwicknews.substack.com/", "https://www.keionline.org/covid-contracts", "https://www.ati.org/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-02-06T10:00:00+00:00"}