{"result_id": "288015", "URL": "https://expose-news.com/2023/01/25/vaccine-genocide-pfizer-lied-20-million-died/", "timestamp": "2023-04-25 17:18:22 CEST+0200", "meta": {"description": "Secret reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that approximately 20 million deaths have been recorded resulting in 2 million excess deaths since Pfizer lied enabling the mass roll-out of the Covid-19 injections. Sadly, further reports quietly published…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/25/vaccine-genocide-pfizer-lied-20-million-died/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Vaccine Genocide: Pfizer lied and 20 Million people died in just a handful of Countries according to Secret Government Reports", "cleaned_text": "Secret reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that approximately 20 million deaths have been recorded resulting in 2 million excess deaths since Pfizer lied enabling the mass roll-out of the Covid-19 injections.\n\nSadly, further reports quietly published by the UK Government also confirm that mortality rates are lowest among the unvaccinated in every single age group.\n\nThis therefore strongly suggests that Pfizer’s lies have caused millions to die and the Covd-19 injections are by far the largest contributing factor to the millions of excess deaths seen across the ‘Five Eyes’ and most of Europe.\n\nOfficial figures provided to EuroMOMO by the UK Government and 26 other Governments of counties across Europe reveal that most of the continent suffered 375,253 excess deaths in 2021 and 404,6000 excess deaths in 2022.\n\nThis equates to 779,853 excess deaths over the two years. The figures do not include Ukraine so cannot be blamed on the ongoing war.\n\nAustralia suffered 11,068 excess deaths in 2021 and then a shocking 22,730 excess deaths by week 38 of 2022. This is in stark contrast to 2020, when only 1,306 excess deaths were recorded at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means Australia suffered a shocking 1,640% increase in excess deaths in just 39 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nNew Zealand suffered 2,169 excess deaths in 2021 and then a shocking 5,286 excess deaths by week 49 of 2022. These are shocking figures for the small island with an estimated population of 5 million people.\n\nEspecially when compared to 2020, when no excess deaths were suffered and 160 fewer deaths were actually recorded than expected at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means New Zealand suffered a shocking 3,404% increase in excess deaths in 49 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nIn Canada, the situation is similarly concerning.\n\nThe country suffered 35,318 excess deaths in 2021 and then 25,333 excess deaths by week 34 of 2022. This compares to 31,042 excess deaths in 2020 by week 53.\n\nHowever, when looking at the figures up to week 34 in both 2020 and 2021, it becomes clear that 2022 has in fact been the worst year for excess deaths by far.\n\nBy week 34 of 2020, Canada had recorded 17,888 excess deaths. By week 34 of 2021, Canada had recorded 18,498 excess deaths. But by week 34 of 2022, Canada had recorded 25,333 excess deaths, representing a 42% increase on the excess deaths recorded in 2020, prior to the roll-out of the Covid-19 injections.\n\nThis dramatic increase in excess deaths raises serious questions about the safety of the Covid-19 vaccines and whether they may have been a contributing factor to the increase in excess deaths.\n\nThe USA suffered 674,954 excess deaths in 2021, and then 434,520 excess deaths by week 49 of 2022. This equates to over 1.1 million excess deaths in nearly two years.\n\nThe USA suffered a staggering 674,954 excess deaths in 2021, a year that saw the country coerced into coming forward to get injected multiple times throughout the mass roll-out of the Covid-19 vaccines. These numbers represent a significant increase in deaths compared to previous years, and have raised alarm bells among the public and healthcare professionals alike.\n\nThe situation did not improve in 2022, with 434,520 excess deaths recorded by week 49, bringing the total number of excess deaths to over 1.1 million in nearly two years.\n\nThis is a staggering number and has led to questions about the effectiveness of the vaccine and the government’s response to the alleged pandemic.\n\nThe official narrative put forth by governments and health organizations has been that deaths in 2020 increased due to the outbreak of the alleged Covid-19 pandemic, with the response to it adversely affecting millions of people worldwide.\n\nHowever, as the pandemic progressed and a vaccine was developed and distributed, the narrative shifted to focus on the safety and effectiveness of the Covid-19 injection as a means to curb the spread of the virus and reduce the number of deaths.\n\nThis narrative was reinforced through various propaganda campaigns, public statements, and official statements, with the message that the vaccine was “safe and effective” and would be “the key to ending the pandemic”.\n\nHowever, the figures and official reports released by governments in the USA, Canada, Australia, New Zealand, the UK and most of Europe have shown that the opposite has happened, with millions of excess deaths being recorded since the mass roll-out of the Covid-19 injections.\n\nThis has led to many questions about the safety of the vaccine, the facts of the official narrative, and the integrity of Governments and Public Health bodies around the world.\n\nThe figures have been provided to both the Organisation for Economic Co-Operation and Development (OECD) and EuroMOMO by each country’s Government organisations. The U.S. data has been provided by the Centers for Disease Control. The UK data has been provided by the Office for National Statistics. And Australia’s data has been provided by the Australian Bureau of Statistics.\n\nSo these aren’t independent estimates. They are official Government-authorized figures. And they show that the ‘Five Eyes’ countries and 26 other countries across Europe have suffered 1.99 million excess deaths since the Covid-19 injections were first granted emergency use authorisation.\n\nThe official figures published by the UK Government certainly suggest that Covid-19 vaccines may have been the biggest contributing factor to the millions of excess deaths seen across the ‘Five Eyes’ and most of Europe. Because the figures confirm mortality rates are lowest among the unvaccinated in every single age group.\n\nThe figures can be found in a report titled ‘Deaths by Vaccination Status, England, 1 January 2021 to 31 May 2022‘, and it can be accessed on the ONS site here, and downloaded here.\n\nTable 2 of the report contains the monthly age-standardised mortality rates by vaccination status by age group for deaths per 100,000 person-years in England up to May 2022.\n\nWe’ve taken the figures provided by the ONS for January to May 2022 and produced the following charts which reveal the horrific consequences of the mass Covid-19 vaccination campaign.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 18 to 39-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nIn every single month since the beginning of 2022, partly vaccinated and double vaccinated 18-39-year-olds have been more likely to die than unvaccinated 18 to 39-year-olds. Triple vaccinated 18 to 39-year-olds however have had a mortality rate that has worsened by the month following the mass Booster campaign that occurred in the UK in December 2021.\n\nIn January, triple vaccinated 18 to 39-year-olds were ever so slightly less likely to die than unvaccinated 18 to 39-year-olds, with a mortality rate of 29.8 per 100,000 among the unvaccinated and 28.1 per 100,000 among the triple vaccinated.\n\nBut this all changed from February onwards. In February, triple vaccinated 18 to 39-year-olds were 27% more likely to die than unvaccinated 18 to 39-year-olds, with a mortality rate of 26.7 per 100k among the triple vaccinated and 21 per 100k among the unvaccinated.\n\nThings unfortunately got even worse for the triple vaccinated by May 2022 though. The data shows that triple vaccinated 18 to 39-year-olds were 52% more likely to die than unvaccinated 18 to 39-year-olds in May, with a mortality rate of 21.4 per 100k among the triple vaccinated and 14.1 among the unvaccinated.\n\nThe worst figures so far though are among the partly vaccinated, with May seeing partly vaccinated 18 to 39-year-olds 202% more likely to die than unvaccinated 18 to 39-year-olds.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 40 to 49-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nWe see pretty much the same when it comes to 40 to 49-year-olds. In every single month since the beginning of 2022, partly vaccinated and double vaccinated 40 to 49-year-olds have been more likely to die than unvaccinated 40 to 49–year-olds.\n\nThe worst month for mortality rates among the partly and double vaccinated compared to the unvaccinated was February. This month saw partly vaccinated 40-49-year-olds 264% more likely to die than unvaccinated 40-49-year-olds. Whilst double vaccinated 40-49-year-olds were 61% more likely to die than unvaccinated 40-49-year-olds.\n\nBy May 2022, five months after the mass Booster campaign, triple vaccinated 40-49-year-olds were 40% more likely to die than unvaccinated 40-49-year-olds, with a mortality rate of 81.8 per 100k among the triple vaccinated and a mortality rate of 58.4 among the unvaccinated.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 50 to 59-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nYet again we see exactly the same pattern among 50 to 59-year-olds as seen among 40-49-year-olds.\n\nIn every single month since the beginning of 2022, partly vaccinated and double vaccinated 50 to 59-year-olds have been more likely to die than unvaccinated 50-59–year-olds.\n\nMay was the worst month for partly vaccinated 50 to 59-year-olds, as they were 170% more likely to die than unvaccinated 50 to 59-year-olds.\n\nWhereas January was the worst month for double vaccinated 50-59-year-olds, as they were 115% more likely to die than unvaccinated 50-59-year-olds.\n\nBy May 2022, five months after the mass Booster campaign, triple vaccinated 50-59-year-olds were 17% more likely to die than unvaccinated 50-59-year-olds, with a mortality rate of 332 per 100k among the triple vaccinated and a mortality rate of 282.9 per 100k among the unvaccinated.\n\nTherefore, by May 2022, unvaccinated 50-59-year-olds were the least likely to die among all vaccination groups.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 60 to 69-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nThe 60 to 69-year-olds show exactly the same pattern as 18 to 39-year-olds. The double and partly vaccinated have been more likely to die than the unvaccinated since the turn of the year, and the triple vaccinated have been more likely to die than the unvaccinated since February.\n\nIn January, partly vaccinated 60-69-year-olds were a shocking 256% more likely to die than unvaccinated 60-69-year-olds. Whilst in the same month, double vaccinated 60-69-year-olds were 223% more likely to die than unvaccinated 60-69-year-olds.\n\nBy May, triple vaccinated 60-69-year-olds were a troubling 117% more likely to die than unvaccinated 60-69-year-olds, with a mortality rate of 1801.3 per 100k among the triple vaccinated and a mortality rate of just 831.1 among the unvaccinated.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 70 to 79-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nThings are slightly different for 70 to 70-year-olds because the data reveals the unvaccinated have been the least likely to die every month since the turn of the year.\n\nIn January, the partly vaccinated were 198% more likely to die than the unvaccinated, whilst the double vaccinated were a shocking 267% more likely to die than the unvaccinated.\n\nThe worst figures however come in May, which saw triple vaccinated 70-79-year-olds a disturbing 332% more likely to die than unvaccinated 70-79-year-olds, with a mortality rate of 9417.2 per 100k among the triple vaccinated and just 2181 per 100k among the unvaccinated.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 80 to 89-year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nAgain we see the same pattern among 80-89-year-olds as seen among 70-79-year-olds, with the unvaccinated the least likely to die every month since the turn of the year.\n\nIn April, double vaccinated 80-89-year-olds were 213% more likely to die than unvaccinated 80-89-year-olds, with a mortality rate of 7598.9 per 100k among the unvaccinated and a mortality rate of a troubling 23,781.8 per 100k among the double vaccinated.\n\nBut in the same month, partly vaccinated 80-89-year-olds were a terrifying 672% more likely to die than unvaccinated 80-89-year-olds, with a shocking mortality rate of 58,668.9 per 100k among the partly vaccinated.\n\nBy May 2022, triple vaccinated 80-89-year-olds were 142% more likely to die than unvaccinated 80-89-year-olds, with a mortality rate of 14,002.3 among the triple vaccinated and a mortality rate of 5,789.1 among the unvaccinated.\n\nThe following chart shows the monthly age-standardised mortality rates by vaccination status among 90+ year-olds for Non-Covid-19 deaths in England between January and May 2022 –\n\nFinally, we again see the same pattern among 90+ year-olds, with the unvaccinated the least likely to die every month since the turn of the year.\n\nIn April, double vaccinated 90+ year-olds were 244% more likely to die than unvaccinated 90+ year-olds, with a mortality rate of 62,302.7 per 100k among the double vaccinated and a mortality rate of 18,090.6 among the unvaccinated.\n\nDuring the same month, however, partly vaccinated 90+ year-olds were a shocking 572% more likely to die than unvaccinated 90+ year-olds, with a mortality rate of 121,749.9 per 100k person-years among the partly vaccinated.\n\nBy May 2022, triple vaccinated 90+ year-olds were 26% more likely to die than unvaccinated 90+ year-olds, with a mortality rate of 13,761.6 per 100k among the unvaccinated and a mortality rate of 17,272.2 per 100k among the triple vaccinated.\n\nThe official reports and figures from the Governments of the USA, Canada, Australia, New Zealand, the UK, and most of Europe have raised serious concerns about the safety of the Covid-19 injections.\n\nThe data shows that since the mass roll-out of the vaccines, there have been nearly 2 million excess deaths recorded, with mortality rates being lowest among the unvaccinated in every single age group. This raises important questions about the potential link between the Covid-19 injections and the increase in excess deaths.\n\nThe official narrative that the vaccines are safe and effective and would reduce the number of deaths is being called into question by the data.\n\nThe staggering number of excess deaths in the USA, Canada, Australia, New Zealand, the UK, and most of Europe is a cause for concern and demands a thorough investigation. It is crucial that an unbiased, transparent and independent investigation is conducted to determine the true cause of these excess deaths and ensure the safety of future vaccines.\n\nIn conclusion, it is extremely likely that the Covid-19 injections are to blame for the huge increase in excess deaths across the world. The data is clear and the figures speak for themselves.\n\nThe official narrative that the vaccines are safe and effective is being called into question, and many will now be questioning whether it may be an outright lie.", "opengraph": {"type": "article", "title": "Vaccine Genocide: Pfizer lied and 20 Million people died in just a handful of Countries according to Secret Government Reports", "url": "https://expose-news.com/2023/01/25/vaccine-genocide-pfizer-lied-20-million-died/", "description": "Secret reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that approximately 20 million deaths have been reco…", "article:published_time": "2023-01-25T08:15:00+00:00", "article:modified_time": "2023-01-24T20:13:47+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/genocide-2.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-146.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-147.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-148.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-150.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-149.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-151.png?ssl=1", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-29.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-30.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-31.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-32.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-33.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-34.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-35.png?ssl=1", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-25T08:15:00+00:00"}