{"result_id": "288026", "URL": "https://expose-news.com/2023/01/11/bbc-admits-covid-vaccine-killed-millions/", "timestamp": "2023-04-25 17:18:39 CEST+0200", "meta": {"description": "The people of the UK should now be in a state of shock. But instead, they have been distracted by non-stop coverage of Prince Harry's new book, so will have most likely missed the tragic and devastating information published by BBC News of all organisations. Information that reveals the UK suffered the highest number of…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/11/bbc-admits-covid-vaccine-killed-millions/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "BBC accidentally admits COVID Vaccine is to blame for 2022 being Worst Year for Excess Deaths in Half a Century after “Journalists” choose to LIE believing nobody would “mark their Homework”", "cleaned_text": "The people of the UK should now be in a state of shock.\n\nBut instead, they have been distracted by non-stop coverage of Prince Harry’s new book, so will have most likely missed the tragic and devastating information published by BBC News of all organisations.\n\nInformation that reveals the UK suffered the highest number of excess deaths throughout 2022 in over half a century.\n\nHowever, the reporters, driven by ambition and a belief that they will not be held accountable, made the decision to conceal the truth behind why there were so many excess deaths last year.\n\nThey most likely thought the majority of the British public would be too lazy to “mark their homework”, so to speak.\n\nBut they didn’t count on an independent news organisation committed to reporting the facts that the mainstream refuse to fact-checking their quietly published article.\n\nAnd we can reveal that the widely but most definitely unjustly trusted news source/propaganda arm of the Government known as the BBC, and its reporters, have knowingly lied about the safety of the vaccine and lied to you.\n\nIt was all going so well for the BBC and its reporters until they decided to unequivocally state that in no way shape or form is the Covid-19 vaccine responsible for a record-breaking year of death. They even provided a “source” to prove it and claimed that –\n\nThey then went on to state that –\n\nThe problem for BBC News and its dishonest reporters is that The Expose has been analysing the source in question, which has been provided by a UK Government institution known as the Office for National Statistics (ONS) for months on end.\n\nAnd we can reveal that mortality rates per 100,000 in every single age group, even children, in England and Wales were lowest among the unvaccinated in some age groups as early as 2021, and lowest among the unvaccinated in all age groups by May 2022 at the latest.\n\nTherefore, BBC News has not only lied to the public, but they have also admitted in black and white that the Covid-19 injections are to blame for 2022 being the worst year for deaths in half a century by confirming that “if vaccines were driving excess deaths we would expect this to be the other way around (highest mortality rates among the vaccinated)”.\n\nThe moral of this story is of course, always check the official source. Specifically table 2.\n\nBut that is of no comfort to the thousands of families across the country who are still mourning the loss of loved ones as the truth about the catastrophic events of the past year comes to light.\n\nAnd as the investigation into the Covid-19 vaccine scandal unfolds, it is clear that the consequences of this deception will be felt for years to come.\n\nThe devastation left in the wake of your Government’s actions, unelected powerful institutions’ actions, Big Techs’ actions and the Mainstream Media’s actions is unimaginable.\n\nYou cannot trust the BBC. And the UK Government has clearly confirmed that mortality rates per 100,000 are highest among the vaccinated in every single age group.\n\nThis means that people who have taken the Covid-19 vaccine have a higher chance of dying than the general population due to the intense damage it can do to the most vital organ in the human body, the heart, and the devastating decimation it does to the natural immune system.\n\nBecause this isn’t an isolated incident occurring in the UK, it’s occurring in every country where the Pfizer and/or Moderna vaccines have been administered.\n\nOfficial figures prove that in the ‘Five Eyes’ countries and most of Europe there were nearly 2 million excess deaths recorded by November 2022 since the roll-out of the Covid-19 injections.\n\nAnd in the USA there have been half a million deaths among young adults and children resulting in 118,000 excess deaths since the Covid-19 injections were first administered to the wider population.\n\nAnother “white lie” told by BBC News in its article is that –\n\nThis lie was clearly told so that they could attempt to blame the rise in excess deaths due to a crisis in the NHS affecting waiting times for treatment etc.\n\nBut the official ONS data, and Public Health Scotland data actually proves that the significant increase in excess deaths began in April.\n\nWe dug into the data, analysing the weekly number of deaths over the past eight months and comparing them to the 2015-2019 five-year average –\n\nThe chart reveals a disturbing trend, with excess deaths occurring in all but two weeks since April 2022. These two exceptions, it turns out, coincide with the late Queen’s Platinum Jubilee and funeral, which would have caused delays in death registrations due to the bank holidays.\n\nBut even taking these weeks into account, the data shows an average of 1,268 excess deaths every single week.\n\nThe following chart is taken from Public Health Scotland’s Covid-19 Dashboard, and it shows the weekly number of deaths compared to the 2015-2019 five-year average –\n\nBecause the chart doesn’t reveal the true picture, we downloaded the death data from the Public Health Scotland Covid-19 Dashboard, which you can also do so here, and calculated the total number of deaths between week 16 and week 47 of 2022.\n\nAccording to the data, there were 34,316 deaths during this period in the 2015-2019 five-year average and 38,611 deaths during this period in 2022.\n\nThis means Scotland has suffered 4,264 excess deaths against the five-year average over the past 34 weeks.\n\nThe following chart shows the overall number of deaths and excess deaths in England, Wales & Scotland –\n\nThe five-year average number of deaths in Britain over these 8 months equates to 360,531. Meanwhile, the total number of deaths in 2022 in Britain over these 8 months equated to 407,910.\n\nTherefore, Britain suffered 47,379 excess deaths between the middle of April and the beginning of December 2022.\n\nThere are a number of possible explanations for this outcome.\n\nIt is possible that the Covid-19 vaccines were not adequately tested before they were released, and therefore had unknown side effects or complications that were not discovered until after it was given to a large number of people.\n\nIt is also possible that the vaccine was not properly manufactured, and therefore was contaminated or otherwise ineffective in preventing illness or death.\n\nRegardless of the specific cause, the implications of what is currently occurring in the real world are significant.\n\nWe found data on excess deaths for 15% of the world’s countries on the website of the Organisation for Economic Co-operation and Development (OECD).\n\nThe OECD hosts data for countries including the USA, Canada, New Zealand, Australia, the UK and some of Europe.\n\nWe also extracted data from EuroMOMO, which provides compiled data for 28 countries in Europe including the UK and is more up-to-date.\n\nThe data has been provided to the OECD and EuroMOMO by each country’s government organizations, such as the Centers for Disease Control in the USA and the Office for National Statistics in the UK.\n\nThe following chart shows excess deaths in the “Five Eyes” countries (Australia, Canada, New Zealand, the UK, and the US) and 27 other European countries –\n\nIn 2021, the US suffered nearly 700k excess deaths and a further 360k excess deaths by November 11th 2022, while Europe had 382k excess deaths in 2021 and 309k excess deaths by November 2022. These figures do not include Ukraine.\n\nThe figures for New Zealand, Australia, and Canada only cover up to week 40, week 30, and week 28 of 2022, respectively. The excess deaths in these countries are not just a result of the alleged Covid-19 pandemic and have not decreased since the rollout of the Covid-19 vaccine.\n\nThe following chart shows the overall excess deaths in Australia in 2020, 2021, and up to week 30 of 2022 –\n\nIn Australia, there were only 1,303 excess deaths in 2020, but this increased by 747% to 11,042 deaths in 2021 after the rollout of the Covid-19 vaccine.\n\nBy the end of July 2022, there were 18,973 excess deaths in Australia, representing a 1,356% increase from 2020. This is more excess deaths in 7 months than in the previous two years combined.\n\nThe situation is similar in the US –\n\nIn the US, 1,700 more people died by week 38 of 2022 compared to week 38 of 2020, and 109k more died by week 38 of 2021 compared to week 38 of 2020.\n\nThese numbers indicate that deaths increased rather than decreased following the rollout of the Covid-19 vaccine.\n\nThe following two charts show the total excess deaths in the “Five Eyes” and Europe since the beginning of 2021, when the Covid-19 vaccine was rolled out –\n\nAccording to the Centers for Disease Control and the Organisation for Economic Co-operation and Development, there have been over 1 million excess deaths in the US between 2021 and 2022 so far.\n\nOfficial figures from EuroMOMO, provided by 28 European countries including the UK, France, Germany, Spain, and Italy, show over 690k excess deaths in Europe by November 2022.\n\nAustralia, Canada, and New Zealand also had significant numbers of excess deaths, though their overall populations are smaller.\n\nIn total, the “Five Eyes” and most of Europe had 1,103,592 excess deaths in 2021 and 716,133 excess deaths by November 2022.\n\nThis adds up to over 1.8 million excess deaths since the rollout of the Covid-19 vaccine.\n\nThe official narrative that the vaccine is safe and effective and would reduce the number of deaths is contradicted by the data. These figures alone suggest that the Covid-19 vaccines are the main cause of the excess deaths in the “Five Eyes” and Europe.\n\nBut we know thanks to checking the original source provided by lying “journalists” working for the BBC that this is backed up by official UK Government data published by the Office for National Statistics.\n\nThe UK government’s official report shows that the Covid-19 vaccines are deadly and killing people in the thousands.\n\nThe figures can be found in a report titled ‘Deaths by Vaccination Status, England, 1 January 2021 to 31 May 2022‘, and it can be accessed on the ONS site here, and downloaded here.\n\nTable 2 of the report reveals that mortality rates per 100,000 are lower among the unvaccinated population in every age group in England.\n\nThe data also shows that the gap between the mortality rates of the vaccinated and the unvaccinated population is increasing.\n\nAs of May 2022, the most recent month with data available, the partly vaccinated, double vaccinated, and triple vaccinated populations in England were more likely to die of any cause than the unvaccinated population in all age groups.\n\nAnd it is the complete opposite of the fantasy claim made by BBC News that, “figures up to June 2022 looking at deaths from all causes show unvaccinated people were more likely to die than vaccinated people”.\n\nThe following charts show a visualisation of the actual reality and have been created using the figures published by the Office for National Statistics –\n\nDue to the above figures being age-standardised and rates per 100,000 population, they are indisputable evidence that the Covid-19 injections increase the risk of death and are killing people.\n\nBut another disturbing trend has emerged in the USA.\n\nNearly half a million children and young adults in the US have died since the Food and Drug Administration granted emergency use authorization for the Covid-19 vaccines, representing 118,000 excess deaths by November 2022 compared to the 2015-2019 average.\n\nIn 2021, there were 291,461 excess deaths among people aged 0 to 44 in the US, a shocking 60,000 more than the previous year.\n\nThe CDC data can again be found on the website of the Organisation for Economic Co-operation and Development (OECD).\n\nThis chart reveals a troubling trend, with a significant increase in excess deaths in 2021 compared to 2020 –\n\nWhen the Covid-19 pandemic allegedly hit the US in early 2020, one might have expected excess deaths among children and young adults to decrease with the introduction of a vaccine.\n\nHowever, official figures show that excess deaths among this age group were significantly higher every week in 2021 compared to the previous year, with the exception of weeks 29 and 30.\n\nThen, in week 31, excess deaths surged among children and young adults. This trend has continued into 2022, according to data from the Centers for Disease Control. T\n\nThese figures raise concerns and warrant further investigation, as the vaccine was supposed to provide protection and mitigate the impact of the pandemic.\n\nThe CDC’s latest data reveals a disturbing trend among children and young adults because according to the agency’s figures, which cover up to week 40 of 2022, there has been a significant increase in excess deaths among this age group.\n\nWhile it’s worth noting the last few weeks of data are subject to change, they paint a worrying picture of the impact of Covid-19 vaccination on the younger generation.\n\nBut how does the situation in 2022 compare to previous years? To provide some context, let’s take a look at the figures from 2020 and 2021.\n\nAccording to the data, there has been a disturbing increase from the same time frame in 2020., with a staggering extra 7,680 excess deaths among this age group in 2022 alone.\n\nBut it’s not just this year that has seen a spike in excess deaths among young people. In 2021, the situation was even direr, with 27,227 extra excess deaths by week 40 following the rollout of the Covid-19 vaccine compared to the same time frame in 2020.\n\nThese numbers raise serious questions about the safety and effectiveness of the Covid-19 vaccines. If the official narrative that these vaccines are safe and effective is to be believed, how can we explain the increase in deaths among children and young adults in both 2021 and 2022?\n\nIn conclusion, the data shows that excess deaths have increased significantly in the “Five Eyes” and Europe since the rollout of the Covid-19 vaccine.\n\nThis includes a dramatic increase in excess deaths among children and young adults in the US and a widening gap in mortality rates between the vaccinated and unvaccinated populations in England.\n\nAnd thanks to the BBC, we now know that the COVID Vaccine is to blame.", "opengraph": {"type": "article", "title": "BBC accidentally admits COVID Vaccine is to blame for 2022 being Worst Year for Excess Deaths in Half a Century after “Journalists” choose to LIE believing nobody would “mark their Homework”", "url": "https://expose-news.com/2023/01/11/bbc-admits-covid-vaccine-killed-millions/", "description": "The people of the UK should now be in a state of shock. But instead, they have been distracted by non-stop coverage of Prince Harry’s new book, so will have most likely missed the tragic and …", "article:published_time": "2023-01-11T06:59:00+00:00", "article:modified_time": "2023-01-11T17:33:28+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/bbc-kills-millions.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.bbc.co.uk/news/health-64209221", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.bbc.co.uk/news/health-64209221", "https://www.bbc.co.uk/news/health-64209221", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-100.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://www.bbc.co.uk/news/health-64209221", "https://www.ons.gov.uk/visualisations/dvc2398/fig1/datadownload.xlsx", "https://scotland.shinyapps.io/phs-covid-wider-impact/_w_e52480d5/session/3965175f89c697c5f16808b87bfd4c54/download/download_chart_data?w=e52480d5", "https://www.ons.gov.uk/visualisations/dvc2398/fig1/datadownload.xlsx", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://scotland.shinyapps.io/phs-covid-wider-impact/_w_e52480d5/session/3965175f89c697c5f16808b87bfd4c54/download/download_chart_data?w=e52480d5", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-20.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-23.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-24.png?ssl=1", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.bbc.co.uk/news/health-64209221", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-25.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-26.png?ssl=1", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/2023/03/07/march-fundraising-campaign-2023-the-expose/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-27.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-28.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-29.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-30.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-31.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-11T06:59:00+00:00"}