{"result_id": "288014", "URL": "https://expose-news.com/2023/03/23/secret-government-documents-confirm-covid-19-vaccine-roll-out-caused-excess-deaths-in-australia-to-increase-by-5162/", "timestamp": "2023-04-25 17:18:21 CEST+0200", "meta": {"description": "Secretive data, strangely given to the Organisation for Economic Co-Operation and Development (OECD) by the Australian Government confirms the first 38 weeks of the year 2021 saw a shocking 1,452% increase in excess deaths following the rollout of the Covid-19 injections compared to the same period in 2020. Unfortunately, as the months passed, the situation…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/03/23/secret-government-documents-confirm-covid-19-vaccine-roll-out-caused-excess-deaths-in-australia-to-increase-by-5162/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Secret Government Documents confirm COVID-19 Vaccine roll-out caused Excess Deaths in Australia to increase by 5,162%", "cleaned_text": "Secretive data, strangely given to the Organisation for Economic Co-Operation and Development (OECD) by the Australian Government confirms the first 38 weeks of the year 2021 saw a shocking 1,452% increase in excess deaths following the rollout of the Covid-19 injections compared to the same period in 2020.\n\nUnfortunately, as the months passed, the situation only worsened.\n\nBy 2022, the nation was hit by a devastating blow, with a shocking 5,162% increase in excess deaths in the first 38 weeks of the year following the repeat rollout of the Covid-19 injections compared to the first 38 weeks of 2020, at the alleged height of the pandemic.\n\nBut instead of the people of Australia being in shock and disbelief at this devastating increase in excess deaths, they are carrying on with their lives, none the wiser as to what has happened.\n\nBecause their Government and their Mainstream Media refuse to tell them the truth and instead fill their heads with propaganda and lies on a daily basis.\n\nSecretive data on deaths and excess deaths in Australia has been handed to the Organisation for Economic Co-Operation and Development (OECD) by the Australian Bureau of Statistics.\n\nAnd that data reveals the following…\n\nAustralia suffered 11,068 excess deaths in 2021 and then a shocking 22,730 excess deaths by week 38 of 2022. This is in stark contrast to 2020, when only 1,306 excess deaths were recorded during the alleged height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means Australia suffered a shocking 1,640% increase in excess deaths in just 38 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nBut if we compare the data available on excess deaths in 2022 against the first 38 weeks of 2020 and the first 38 weeks of 2021, we are able to reveal the true severity of the situation in Australia.\n\nAs we know, Australia suffered a shocking 22,730 excess deaths by week 38 of 2022.\n\nBut according to the same data provided by the Australian Bureau of Statistics to the Organisation for Economic Co-Operation and Development (OECD), Australia suffered 6,706 excess deaths by week 38 of 2021, and only 432 excess deaths by week 38 of 2020.\n\nThis means Australia suffered a shocking 1,452% increase in excess deaths in the first 38 weeks of 2021 following the rollout of the Covid-19 injections compared to the first 38 weeks of 2020, at the alleged height of the Covid-19 pandemic, and prior to the rollout of a single Covid-19 injection.\n\nBut the above numbers pale in comparison to the tragic situation that unfolded throughout 2022.\n\nAustralia suffered a shocking 5,162% increase in excess deaths in the first 38 weeks of 2022 following the repeat rollout of the Covid-19 injections compared to the first 38 weeks of 2020, at the alleged height of the Covid-19 pandemic, and prior to the rollout of a single Covid-19 injection.\n\nThese aren’t independent estimates. They are official Government of Australia authorized figures. And further figures published by the UK Government strongly suggest Covid-19 vaccination is the biggest contributing factor to this huge rise in excess deaths across Australia.\n\nThe very thing that you were told would end the alleged pandemic and put a stop to the alleged huge rise in deaths across the world in 2020, has ended up having the opposite effect.\n\nInstead of reducing deaths, COVID vaccination has increased deaths exponentially.\n\nThe figures that prove this can be found in a report titled ‘Deaths by Vaccination Status, England, 1 January 2021 to 31 May 2022‘, and it can be accessed on the ONS site here, and downloaded here.\n\nTable 2 of the report contains the monthly age-standardised mortality rates by vaccination status by age group for deaths per 100,000 person-years in England up to May 2022.\n\nAnd that table reveals that mortality rates per 100,000 are lowest among the unvaccinated in every single age group.\n\nThe following two charts show the monthly age-standardised mortality rates by vaccination status for non-Covid-19 deaths in England between January and May 2022 for each age group –\n\nThese figures prove that the Covid-19 vaccines are not effective and are causing side effects so severe that they are resulting in increased mortality.\n\nThis should be of serious concern to everyone, especially those who have been vaccinated.\n\nAnd it should be on the front page of every newspaper, and the main topic of discussion on every news channel.\n\nThe science is definitive, and authorities and Governments should withdraw the Covid-19 vaccines from future use with immediate effect.\n\nIf they do not do this then they are proving to the public that they have an ulterior motive to reduce the world’s population.\n\nBecause this is precisely what will happen if the repeat rollout of these experimental and dangerous injections is allowed to continue.", "opengraph": {"type": "article", "title": "Secret Government Documents confirm COVID-19 Vaccine roll-out caused Excess Deaths in Australia to increase by 5,162%", "url": "https://expose-news.com/2023/03/23/secret-government-documents-confirm-covid-19-vaccine-roll-out-caused-excess-deaths-in-australia-to-increase-by-5162/", "description": "Secretive data, strangely given to the Organisation for Economic Co-Operation and Development (OECD) by the Australian Government confirms the first 38 weeks of the year 2021 saw a shocking 1,452% …", "article:published_time": "2023-03-23T06:59:00+00:00", "article:modified_time": "2023-03-22T20:48:13+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/asutralia-3.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://stats.oecd.org/index.aspx?queryid=104676", "https://stats.oecd.org/index.aspx?queryid=104676", "https://stats.oecd.org/index.aspx?queryid=104676", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-205.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://stats.oecd.org/index.aspx?queryid=104676", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-206.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-207.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-208.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-209.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-03-23T06:59:00+00:00"}