{"result_id": "288021", "URL": "https://expose-news.com/2023/02/05/depopulation-covid-vaccination-plan-all-along/", "timestamp": "2023-04-25 17:18:30 CEST+0200", "meta": {"description": "If we told you 20 million people had died across just the 'FIve Eyes' & 26 countries across Europe over the past two years resulting in the most excess deaths seen in half a decade wouldn't you at least be a little bit curious to find out why? You might be quick to blame Covid-19,…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/02/05/depopulation-covid-vaccination-plan-all-along/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Government Reports & Pfizer Documents prove COVID Vaccination is causing Depopulation & we now have evidence it was the plan all along", "cleaned_text": "If we told you 20 million people had died across just the ‘FIve Eyes’ & 26 countries across Europe over the past two years resulting in the most excess deaths seen in half a decade wouldn’t you at least be a little bit curious to find out why?\n\nYou might be quick to blame Covid-19, but we can assure you this is not the case.\n\nWhat if we then told you more excess deaths were actually recorded across the USA, the UK, Canada, Australia and New Zealand in 2021 & 2022 following several mass rollouts of the Covid-19 injections than were recorded at the height of the Covid-19 pandemic in 2020?\n\nWould that not pique your interest to find out why?\n\nBecause we’re not just talking about a slight increase. We’re talking about increases of thousands of per cent in excess deaths.\n\nFor instance. official Government reports prove that Australia suffered a shocking 1,640% increase in excess deaths in just 39 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nWhile New Zealand suffered a shocking 3,404% increase in excess deaths in 49 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nAre you still not interested?\n\nWell, what if we told you there now exists a mountain of evidence to prove that Covid-19 injections are to blame for this huge increase in deaths?\n\nSurely now you’d want to know why?\n\nWhat if we then revealed that sadly, that mountain of evidence also contains documents that prove Covid-19 vaccination is going to lead to mass depopulation?\n\nThis is of course an extremely bold claim to make.\n\n‘Your Government is trying to kill you’ is even bolder.\n\nAnd surely you are now more than curious to find out why?\n\nTo summarise, the answer is simple…\n\nFrom a young age, you have been conditioned to trust and obey authority without question. You have been trained to believe they would never lie to you.\n\nThe elite and corporations know that the majority of the public are too trusting of the government and mainstream media, and as a result, to solve the incoming problem of hundreds of millions, if not billions of people becoming “useless eaters” and a liability and burden due to AI and robotics taking their jobs, they came up with a plan to depopulate the planet.\n\nAnd that plan involved the invention or exaggeration of a pandemic and the roll-out of a deadly vaccine.\n\nAnd we can prove it…\n\nSecret reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised alarm bells as they confirm that approximately 20 million deaths have been recorded resulting in 2 million excess deaths since Pfizer lied enabling the mass roll-out of the Covid-19 injections.\n\nSadly, further reports quietly published by the UK Government also confirm that mortality rates are lowest among the unvaccinated in every single age group.\n\nThis, therefore, proves that Pfizer’s lies have caused millions to die and the Covd-19 injections are by far the largest contributing factor to the millions of excess deaths seen across the ‘Five Eyes’ and most of Europe\n\nOfficial figures provided to EuroMOMO by the UK Government and 26 other Governments of counties across Europe reveal that most of the continent suffered 375,253 excess deaths in 2021 and 404,6000 excess deaths in 2022.\n\nThis equates to 779,853 excess deaths over the two years. The figures do not include Ukraine so cannot be blamed on the ongoing war.\n\nAustralia suffered 11,068 excess deaths in 2021 and then a shocking 22,730 excess deaths by week 38 of 2022. This is in stark contrast to 2020, when only 1,306 excess deaths were recorded at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means Australia suffered a shocking 1,640% increase in excess deaths in just 39 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nNew Zealand suffered 2,169 excess deaths in 2021 and then a shocking 5,286 excess deaths by week 49 of 2022. These are shocking figures for the small island with an estimated population of 5 million people.\n\nEspecially when compared to 2020, when no excess deaths were suffered and 160 fewer deaths were actually recorded than expected at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means New Zealand suffered a shocking 3,404% increase in excess deaths in 49 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nIn Canada, the situation is similarly concerning.\n\nThe country suffered 35,318 excess deaths in 2021 and then 25,333 excess deaths by week 34 of 2022. This compares to 31,042 excess deaths in 2020 by week 53.\n\nHowever, when looking at the figures up to week 34 in both 2020 and 2021, it becomes clear that 2022 has in fact been the worst year for excess deaths by far.\n\nBy week 34 of 2020, Canada had recorded 17,888 excess deaths. By week 34 of 2021, Canada had recorded 18,498 excess deaths. But by week 34 of 2022, Canada had recorded 25,333 excess deaths, representing a 42% increase on the excess deaths recorded in 2020, prior to the roll-out of the Covid-19 injections.\n\nThis dramatic increase in excess deaths raises serious questions about the safety of the Covid-19 vaccines and whether they may have been a contributing factor to the increase in excess deaths.\n\nThe USA suffered 674,954 excess deaths in 2021, and then 434,520 excess deaths by week 49 of 2022. This equates to over 1.1 million excess deaths in nearly two years.\n\nThe USA suffered a staggering 674,954 excess deaths in 2021, a year that saw the country coerced into coming forward to get injected multiple times throughout the mass roll-out of the Covid-19 vaccines. These numbers represent a significant increase in deaths compared to previous years, and have raised alarm bells among the public and healthcare professionals alike.\n\nThe situation did not improve in 2022, with 434,520 excess deaths recorded by week 49, bringing the total number of excess deaths to over 1.1 million in nearly two years.\n\nThis is a staggering number and has led to questions about the effectiveness of the vaccine and the government’s response to the alleged pandemic.\n\nThe ‘Five Eyes’ & most of urope\n\nThe official narrative put forth by governments and health organizations has been that deaths in 2020 increased due to the outbreak of the alleged Covid-19 pandemic, with the response to it adversely affecting millions of people worldwide.\n\nHowever, as the pandemic progressed and a vaccine was developed and distributed, the narrative shifted to focus on the safety and effectiveness of the Covid-19 injection as a means to curb the spread of the virus and reduce the number of deaths.\n\nThis narrative was reinforced through various propaganda campaigns, public statements, and official statements, with the message that the vaccine was “safe and effective” and would be “the key to ending the pandemic”.\n\nHowever, the figures and official reports released by governments in the USA, Canada, Australia, New Zealand, the UK and most of Europe have shown that the opposite has happened, with millions of excess deaths being recorded since the mass roll-out of the Covid-19 injections.\n\nThis has led to many questions about the safety of the vaccine, the facts of the official narrative, and the integrity of Governments and Public Health bodies around the world.\n\nThe figures have been provided to both the Organisation for Economic Co-Operation and Development (OECD) and EuroMOMO by each country’s Government organisations. The U.S. data has been provided by the Centers for Disease Control. The UK data has been provided by the Office for National Statistics. And Australia’s data has been provided by the Australian Bureau of Statistics.\n\nSo these aren’t independent estimates. They are official Government-authorized figures. And they show that the ‘Five Eyes’ countries and 26 other countries across Europe have suffered 1.99 million excess deaths since the Covid-19 injections were first granted emergency use authorisation.\n\nOfficial figures published by the UK Government prove that Covid-19 vaccines have been the biggest contributing factor to the millions of excess deaths seen across the ‘Five Eyes’ and most of Europe. Because the figures confirm mortality rates are lowest among the unvaccinated in every single age group.\n\nThe figures can be found in a report titled ‘Deaths by Vaccination Status, England, 1 January 2021 to 31 May 2022‘, and it can be accessed on the ONS site here, and downloaded here.\n\nTable 2 of the report contains the monthly age-standardised mortality rates by vaccination status by age group for deaths per 100,000 person-years in England up to May 2022.\n\nWe’ve taken the figures provided by the ONS for January to May 2022 and produced the following charts which reveal the horrific consequences of the mass Covid-19 vaccination campaign.\n\nThe above charts show mortality rates per 100,000 by vaccination status. They reveal mortality rates are lowest among the unvaccinated in every single age group\n\nThis is, therefore, indisputable evidence that the Covid-19 vaccines are deadly and killing people in the thousands, and you can read a full breakdown of the data broken down by age here\n\nThe official reports and figures from the Governments of the USA, Canada, Australia, New Zealand, the UK, and most of Europe have raised serious concerns about the safety of the Covid-19 injections.\n\nThe data shows that since the mass roll-out of the vaccines, there have been nearly 2 million excess deaths recorded, with mortality rates being lowest among the unvaccinated in every single age group. This proves the link between Covid-19 injections and the increase in excess deaths.\n\nThe official narrative that the vaccines are safe and effective and would reduce the number of deaths was and still is a lie.\n\nWhy would authorities continue to administer a vaccine that is killing people?\n\nBecause it was their plan all along…\n\nWhy would they do this?\n\nYou are not free. You think you are because you put a cross on a piece of paper every few years to vote for a new government or President. But you’re not free in the slightest. In fact, your existence is almost comparable to that of free-range chickens.\n\nJust as free-range chickens are confined to a certain area and allowed some degree of freedom within that area, humans are also confined to the societies and cultures they are born into and have limited freedom within those boundaries.\n\nBoth free-range chickens and humans have a certain routine they must follow in order to survive and thrive.\n\nFor chickens, this means pecking at food, drinking water, and laying eggs, while for humans it involves going to work, caring for their families, and fulfilling other basic needs.\n\nHowever, just as free-range chickens may face danger from predators or harsh weather conditions, humans also face challenges such as financial insecurity, discrimination, and physical and mental health problems.\n\nSo while the human experience is much more complex and diverse than that of a chicken, the average persons existence is still comparable to that of a free-range chicken.\n\nSo as you can see, you’re not free in the slightest.\n\nThe problem you now have, is that very soon, you will no longer be needed.\n\nAt the moment, the rich need other people to make them rich because wealth creation is a collaborative process that requires the support of employees, customers, suppliers, and the government. Without these groups, the accumulation of wealth would not be possible.\n\nSo they need you in order to live and work a “9 to 5” existence to make them rich. And in return, you are given pennies to their pounds, or cents to their dollars.\n\nHowever, you may not realise it, but Artificial Intelligence (AI) and robotics are now so far advanced that they are now most likely capable of doing your job.\n\nEspecially if your work involves using a computer, manual labour in a factory, or getting a person from A to B.\n\nAnd AI and robotics can do what would take you hours in mere seconds.\n\nHere are just a few examples of the many potential applications of AI and robotics across a range of industries and sectors:\n• Manufacturing: Robotics can be used to automate production lines, improving efficiency and reducing costs.\n• Finance: AI can be used to analyze financial data, detect fraud, and automate routine tasks such as account reconciliation.\n• Transportation: Self-driving cars and trucks powered by AI are already being developed, with the potential to dramatically change the way goods and people are transported.\n• Retail: AI-powered chatbots can be used to provide customer service, and AI algorithms can be used to personalize the shopping experience for customers.\n• Energy: AI can be used to optimize the use of renewable energy sources, reducing costs and increasing the efficiency of energy systems.\n• Agriculture: Robotics can be used to automate tasks such as planting, harvesting, and monitoring crops, improving efficiency and reducing costs in agriculture.\n\nWe are even moving to the point where AI and robotics have the potential to play a significant role in the delivery of health and social care.\n\nSome examples of how AI and robotics could play a significant role include:\n• Diagnosis and treatment: AI algorithms can be trained to diagnose diseases from medical images, analyze patient data and make recommendations for treatment.\n• Telemedicine: Robotics can be used to support remote consultations between patients and healthcare professionals, enabling patients to receive care from the comfort of their own homes.\n• Elder care: Robotics can be used to support elderly people living at home, helping with tasks such as bathing, dressing, and mobility, reducing the need for human carers.\n• Drug development: AI can be used to analyze large amounts of data, speeding up the drug development process and enabling new treatments to be brought to market more quickly.\n\nTherefore, the world is very quickly evolving to where hundreds of millions, if not billions of people will no longer be needed for the current work that is available.\n\nThis means billions of people could become a burden and liability instead of the asset they once were for the large corporations and powerful individuals that are really ruling the world.\n\nYou may think that a system such as Universal Basic Income could just be introduced to solve this problem and allow you to live. But the current money system simply cannot afford to implement it.\n\nThe current money system in the USA and UK for instance is based on the principles of fiat currency and central banking, where the government is the issuer of currency and the central bank controls the supply of money in circulation.\n\nIn this system, the government can print or create more money as needed, but doing so can also lead to inflation and devaluation of the currency.\n\nIn the current system, Universal Basic Income (UBI), which is a guaranteed minimum income for all citizens, would require a significant increase in government spending and money creation. This would lead to a large increase in the money supply, resulting in huge inflation and a decrease in the value of the currency.\n\nAdditionally, the current system relies on taxation to fund government programs, including welfare programs. Implementing UBI would require a significant increase in taxes and a decrease in funding for other government programs, which would have negative consequences for the economy.\n\nBut if you’re not working, you’re not paying taxes. And AI won’t be getting paid, so it won’t be paying taxes either.\n\nYou might think that your Government could just increase taxes on the rich who own the companies to fund UBI. But if that were to happen the rich person would most likely take their business to another country that isn’t demanding higher taxes.\n\nAnd it wouldn’t happen anyway because large corporations like META (Facebook), powerful NGOs like the World Economic Forum, extremely rich individuals such as Bill Gates, and Big Pharmaceutical companies like Pfizer are the ones who are shaping this world how they see fit.\n\nYour Government is bought and paid for, and beholden to the above. They have no power and they do not serve you because you can’t promise them a comfortable retirement. Or promise to keep their dark secrets secret if they do as you ask of them.\n\nYou are just a free-range chicken who naively believes they are free.\n\nHow do we know all of the above?\n\nBecause we asked AI to write the majority of the paragraphs on how your existence is similar to that of a free-range chicken.\n\nAnd we also asked it to write the majority of the paragraphs in the ‘AI isn’t coming, it’s already here’ section of this investigative article.\n\nAnd we asked it to write those paragraphs based on facts and facts alone.\n\nFrom a young age, you have been conditioned to trust and obey authority without question. You have been trained to believe they would never lie to you.\n\nThe elite and corporations know that the majority of the public are too trusting of the government and mainstream media, and as a result, to solve the incoming problem of hundreds of millions, if not billions of people becoming “useless eaters” and a liability and burden due to AI and robotics taking their jobs, they came up with a plan to depopulate the planet.\n\nThat plan involved announcing a deadly pandemic, that would be in reality, either non-existent or exaggerated by rebranding pneumonia and flu deaths. and creating conditions where they can put the elderly and vulnerable on end-of-life care by isolating them in overwhelmed care homes and drugging them until they die.\n\nThis would create the illusion of a dangerous pandemic where many are dying and the public will be clamouring for a solution to be found.\n\nThat solution will be a new gene therapy that will be labelled a vaccine but isn’t a vaccine at all.\n\nThe public, desperate to return to normality will rush to take it.\n\nMeanwhile, those who are hesitant will come forward due to coercion and the threat of losing their job or not being able to travel.\n\nThe new medicine won’t instantly kill people. It will work slowly to damage the heart, the brain and the immune system. It will also make people infertile.\n\nBy the time the public realizes what has happened, hundreds of millions will have died and hundreds of millions more will be unable to have children.\n\nUnfortunately, you are now three years and counting into the roll-out of this plan, and the following evidence proves how the elite did it, and how they are succeeding…\n\nIn March 2020 the British people were told that they must “stay at home” in order to “protect the NHS” and “save lives”. They were also told that the authorities needed just “three weeks to flatten the curve”. This was allegedly because of the threat of a new and emerging virus which we’re told originated in the city of Wuhan, China.\n\nBut evidence suggests the Covid-19 pandemic was in fact an exaggerated lie. A lie that involved prematurely ending the lives of thousands upon thousands of people, who you were told died of Covid-19. A lie that has involved committing one of the greatest crimes against humanity in living memory. A lie that has required three things – fear, your compliance, and a drug known as Midazolam.\n\nSerious illness in Covid-19 allegedly presents pneumonia and accompanying respiratory insufficiency. Therefore typical symptoms include breathlessness, cough, weakness and fever. We’re also told that people who suffer deteriorating respiratory failure and who do not receive intensive care, develop acute respiratory distress syndrome with severe breathlessness.\n\nWhile midazolam (think diazepam on steroids) can cause serious or life-threatening breathing problems such as shallow, slowed, or temporarily stopped breathing that may lead to permanent brain injury or death.\n\nUK regulators state that you should only receive midazolam in a hospital or doctor’s office that has the equipment that is needed to monitor your heart and lungs and to provide life-saving medical treatment quickly if your breathing slows or stops.\n\nKnowing that would you use midazolam to treat people who were suffering pneumonia and respiratory insufficiency allegedly due to Covid-19?\n\nBecause that’s precisely what they did in the UK, and they administered it by the truckload in care homes.\n\nIn March 2020, the UK Department of Health & Social Care purchased a two-year supply of midazolam and was looking to purchase more (source). And they certainly made use of it.\n\nAccording to official data in April 2019 up to 21,977 prescriptions for Midazolam were issued, containing 171,952 items, the vast majority being Midazolam Hydrochloride. However in April 2020 45,033 prescriptions for Midazolam were issued, containing 333,229 items, the vast majority being Midazolam Hydrochloride.\n\nThat is a 104.91% increase in the number of prescriptions issued for Midazolam and a 93.85% increase in the number of items they contained.\n\nBut these weren’t issued in hospitals, they were issued by GP practices. This means they were administered to the elderly and vulnerable who had been released from hospital under the instruction of then Health Secretary Matt Hancock and into understaffed and overwhelmed care homes.\n\nAccording to the UK’s Office for National Statistics, three in every five Covid-19 deaths occurred in those who suffered learning difficulties and disabilities (see here).\n\nDo you really believe there’s a virus so clever that it knows to only kill people who are disabled or have learning difficulties?\n\nIn relation to deaths of people with learning difficulties the ONS said – ‘the largest effect was associated with living in a care home or other communal establishment.‘\n\nHaving a learning difficulty and being in care doesn’t mean you are more likely to die of Covid-19. What it means is that you are much more likely to have a DNR order placed on you without informing yourself or your family, which Carers / NHS staff then use as permission to put you on end-of-life care, which involves the administration of Midazolam.\n\nThe evidence for this is vast, and you can read a full investigation exposing the Midazolam scandal in the UK here.\n\nCovid-19 vaccination is going to lead mass depopulation on top of the thousands it has already killed.\n\nThe latest reports released by medicine regulators around the world reveal that there have been at least 7.3 million injuries reported as adverse reactions to the Covid-19 injections up to late May and early June 2022, including 77,068 deaths (source).\n\nHowever, these horrific figures do not illustrate the true nature of the consequences of Covid-19 vaccination because it is estimated by medicine regulators that just 1 to 10% of adverse events are actually reported.\n\nBut something much more sinister is occurring with these experimental injections, and the evidence can all be found in both official Government data and the confidential documents the U.S. Food & Drug Administration (FDA) attempted to delay publishing by 75 years but has been forced to publish by court order.\n\nIn early January 2022, Federal Judge Mark Pittman ordered the FDA to release 55,000 pages per month. They released 12,000 pages by the end of January.\n\nSince then, PHMPT has posted all of the documents on its website. The latest drop happened on 1st June 2022.\n\nOne of the documents contained in the data dump is ‘reissue_5.3.6 postmarketing experience.pdf’. Page 12 of the confidential document contains data on the use of the Pfizer Covid-19 injection in pregnancy and lactation.\n\nPfizer state in the document that by 28th February 2021 there were 270 known cases of exposure to the mRNA injection during pregnancy.\n\nForty-six percent of the mothers (124) exposed to the Pfizer Covid-19 injection suffered an adverse reaction.\n\nOf those 124 mothers suffering an adverse reaction, 49 were considered non-serious adverse reactions, whereas 75 were considered serious. This means 58% of the mothers who reported suffering adverse reactions suffered a serious adverse event ranging from uterine contraction to foetal death.\n\nA total of 4 serious foetus/baby cases were reported due to exposure to the Pfizer injection.\n\nBut here’s where things get rather concerning. Pfizer state that of the 270 pregnancies they have absolutely no idea what happened in 238 of them.\n\nBut here are the known outcomes of the remaining pregnancies –\n\nThere were 34 outcomes altogether at the time of the report, but 5 of them were still pending. Pfizer note that only 1 of the 29 known outcomes were normal, whilst 28 of the 29 outcomes resulted in the loss/death of the baby. This equates to 97% of all known outcomes of Covid-19 vaccination during pregnancy resulting in the loss of the child.\n\nWhen we include the 5 cases where the outcome was still pending it equates to 82% of all outcomes of Covid-19 vaccination during pregnancy resulting in the loss of the child. This equates to an average of around 90% between the 82% and 97% figure.\n\nPfizer and Medicine Regulators hid dangers of Covid-19 Vaccination during Pregnancy due to Animal Study finding an increased risk of Birth Defects & Infertility\n\nThe above is still the official guidance as of June 2022 in regards to giving the Covid-19 vaccine to pregnant women, and it leads to several questions requiring urgent answers when we consider since early 2021 pregnant women have been told Covid-19 vaccination is perfectly safe.\n\nThe limited animal study talked about in the official guidance actually uncovered the risk of significant harm to the developing foetus, but medicine regulators in the USA, UK and Australia actively chose to remove this information from public documents.\n\nThe actual study can be viewed in full here and is titled ‘Lack of effects on female fertility and prenatal and postnatal offspring development in rats with BNT162b2, an mRNA-based COVID-19 vaccine‘.\n\nThe study was performed on 42 female Wistar Han rats. Twenty-one were given the Pfizer Covid-19 injection, and 21 were not.\n\nHere are the results of the study –\n\nThe results of the number of foetuses observed to have supernumerary lumbar ribs in the control group were 3/3 (2.1). But the results of the number of foetuses to have supernumerary lumbar ribs in the vaccinated group was 6/12 (8.3). Therefore on average, the rate of occurrence was 295% higher in the vaccinated group.\n\nSupernumerary ribs also called accessory ribs are an uncommon variant of extra ribs arising most commonly from the cervical or lumbar vertebrae.\n\nSo what this study found is evidence of abnormal foetal formation and birth defects caused by the Pfizer Covid-19 injection.\n\nBut the abnormal findings of the study don’t end there. The ‘pre-implantation loss’ rate in the vaccinated group of rats was double that of the control group.\n\nPre-implantation loss refers to fertilised ova that fail to implant. Therefore, this study suggests that the Pfizer Covid-19 injection reduces the chances of a woman being able to get pregnant. So, therefore, increases the risk of infertility.\n\nUnfortunately, medicine regulators around the world are fully aware of this but chose to actively cover it up, the evidence of which can be viewed in full here.\n\nConfidential Pfizer Documents reveal the Covid-19 Vaccine accumulates in the Ovaries\n\nAnother study, which can be found in the long list of confidential Pfizer documents that the FDA have been forced to publish via a court order here, was carried out on Wistar Han rats, 21 of which were female and 21 of which were male.\n\nEach rat received a single intramuscular dose of the Pfizer Covid-19 injection and then the content and concentration of total radioactivity in blood, plasma and tissues were determined at pre-defined points following administration.\n\nIn other words, the scientists conducting the study measured how much of the Covid-19 injection has spread to other parts of the body such as the skin, liver, spleen, heart etc.\n\nBut one of the most concerning findings from the study is the fact that the Pfizer injection accumulates in the ovaries over time.\n\nAn ‘ovary’ is one of a pair of female glands in which the eggs form and the female hormones oestrogen and progesterone are made.\n\nIn the first 15 minutes following injection of the Pfizer jab, researchers found that the total lipid concentration in the ovaries measured 0.104ml. This then increased to 1.34ml after 1 hour, 2.34ml after 4 hours, and then 12.3ml after 48 hours.\n\nThe scientists, however, did not conduct any further research on the accumulation after a period of 48 hours, so we simply don’t know whether that concerning accumulation continued.\n\nBut official UK data published by Public Health Scotland, which can be found here, offers some concerning clues as to the consequences of that accumulation on the ovaries.\n\nFigures for the number of individuals suffering from ovarian cancer show that the known trend in 2021 was significantly higher than 2020 and the 2017-2019 average.\n\nSo now we know –\n• Authorities culled the elderly and vulnerable with a drug known as midazolam and told you they had died of Covid-19,\n• The only animal study performed to prove the safety of administering the Pfizer vaccine during pregnancy indicated an increased risk of infertility and birth defects,\n• and further confidential Pfizer documents reveal the vaccine accumulates in the ovaries.\n\nUnfortunately, we also have evidence that Covid-19 vaccination increases the risk of newborn babies sadly losing their lives, and it also comes from the Public Health Scotland ‘Covid-19 Wider Impacts’ dashboard.\n\nNewborn Baby Deaths hit critical levels for 2nd time in 7 Months in March 2022\n\nOfficial figures reveal that the rate of neonatal deaths increased to 4.6 per 1000 live births in March 2022, a 119% increase on the expected rate of deaths. This means the neonatal mortality rate breached an upper warning threshold known as the ‘control limit’ for the second time in at least four years.\n\nThe last time it breached was in September 2021, when neonatal deaths per 1000 live births climbed to 5.1. Although the rate fluctuates month to month, the figure for both September 2021 and March 2022 is on par with levels that were last typically seen in the late 1980s.\n\nPublic Health Scotland (PHS) did not formally announce they had launched an investigation, but this is what they are supposed to do when the upper warning threshold is reached, and they did so back in 2021.\n\nAt the time, PHS said the fact that the upper control limit has been exceeded “indicates there is a higher likelihood that there are factors beyond random variation that may have contributed to the number of deaths that occurred”.\n\nFinally, in regards to Covid-19 vaccination, we have evidence that it increases the risk of suffering a miscarriage by at least 1,517%.\n\nAccording to the Centers for Disease Control’s (CDC)) Vaccine Adverse Event Database (VAERS), as of April 2022, a total of 4,113 foetal deaths had been reported as adverse reactions to the Covid-19 injections, 3,209 of which were reported against the Pfizer injection.\n\nThe CDC has admitted that just 1 to 10% of adverse reactions are actually reported to VAERS therefore the true figure could be many times worse. But to put these numbers into perspective, there were only 2,239 reported foetal deaths to VAERS in the 30 years prior to the emergency use authorisation of the Covid-19 injections in December of 2020. (Source)\n\nAnd a further study which can be viewed here, found that the risk of suffering a miscarriage following Covid-19 vaccination is 1,517% higher than the risk of suffering a miscarriage following flu vaccination.\n\nMany people will believe the claim Covid-19 injections are in effect causing AIDS (Acquired Immunodeficiency Syndrome) is either incredibly bold or incredibly fictitious. But that’s because many people misunderstand what AIDS actually is.\n\nFirst of all, Acquired Immunodeficiency Syndrome is not contagious. But many people it is because of its association with the alleged HIV virus. But AIDS isn’t HIV, and HIV isn’t AIDS. They are two completely different things, it just so happens that AIDS can allegedly result as a complication of long-term HIV infection.\n\nAIDS is an acquired (or secondary) immune deficiency syndrome that affects your immune system partially or as a whole, making your body an easy target for several diseases and infections. When immunodeficiency disorders affect your immune system, your body can no longer fight bacteria and diseases (source).\n\nSeveral factors in the environment can cause secondary immunodeficiency disorders (source) including radiation or chemotherapy, infections due to HIV, Leukaemia, and Malnutrition.\n\nBut some of the less common causes include drugs or medications (source), and for months on end, official statistics from Governments worldwide have suggested the Covid-19 injections should be added to the list.\n\nThe most reliable example of this has come from the UK Health Security Agency (UKHSA).\n\nThe following chart shows the Covid-19 vaccine effectiveness among the triple vaccinated population in England in the Week 3, Week 7 and Week 13 UKHSA Vaccine Surveillance reports of 2022 –\n\nThis is nowhere near the claimed 95% effectiveness by Pfizer, is it?\n\nThe following chart shows the Covid-19 death rate per 100,000 individuals by vaccination status between 28th Feb and 27th March 22. The unvaccinated case rate has been taken from page 45 of the UKHSA Vaccine Surveillance Report – Week 13 – 2022, and the double vaccinated case rate has been calculated with the number of deaths provided on page 44 of the same report –\n\nThe above figures prove the Covid-19 injections are damaging the immune system because vaccine effectiveness isn’t actually a measure of a vaccine, it’s a measure of the immune system.\n\nThe Covid-19 vaccines instruct the body to produce the spike (S) protein of the original Covid-19 virus. The immune system is then supposed to rid the body of these manufactured spike proteins and remember to do so if it ever encounters the “real” virus in the future.\n\nTherefore, the UKHSA figures prove the immune systems of the vaccinated are performing far worse than the immune systems of the unvaccinated, and this degradation is getting worse by the week. This will of course lead to an inconceivable amount of people falling into an early grave due to their immune systems failing them.\n\nThere is plenty more evidence out there but the above alone strongly suggests Covid-19 vaccination is going to lead to depopulation through increased infertility, an increased rate of death of newborns, sudden death, and early death due to immune system damage.\n\nThey only have the power to do this because you give it to them\n\nIn the end, the consequences of COVID vaccination have been and are still catastrophic and far-reaching.\n\nThe plan to depopulate the planet to make way for AI has so far led to 20 million deaths and 2 million excess deaths just two years into the roll-out of the experimental injection.\n\nThis is on top of the hundreds of thousands/millions who died in 2020 due to being imprisoned in care homes, being put on end-of-life “care” due to new official care guidelines, and then being injected with midazolam or other drugs that killed them.\n\nAll so that the Elite could falsely claim they had died of Covid-19 to create the illusion of a deadly pandemic and con the public into believing they must do as they are told and be vigilant of a non-existent or exaggerated virus.\n\nAnd nothing will change or cause the elites’ plan to fail until the public realises the truth causing a widespread sense of distrust and anger to grow among the population.\n\nThere are billions of us but only thousands, if not hundreds of them. But they have all the power because you have been conditioned to obey and give it to them.\n\nWill the average person realise that before it’s too late? That remains to be seen. For now, all we can do is tell the truth and make sure it reaches as many people as possible.", "opengraph": {"type": "article", "title": "Government Reports & Pfizer Documents prove COVID Vaccination is causing Depopulation & we now have evidence it was the plan all along", "url": "https://expose-news.com/2023/02/05/depopulation-covid-vaccination-plan-all-along/", "description": "If we told you 20 million people had died across just the ‘FIve Eyes’ & 26 countries across Europe over the past two years resulting in the most excess deaths seen in half a decade …", "article:published_time": "2023-02-05T06:59:00+00:00", "article:modified_time": "2023-02-04T19:35:51+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/depop-feb-23-1.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-146.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-147.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-148.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-150.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-149.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-151.png?ssl=1", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-42.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-43.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://pharmaceutical-journal.com/article/news/supplies-of-sedative-used-for-covid-19-patients-diverted-from-france-to-avoid-potential-shortages", "https://openprescribing.net/", "https://expose-news.com/2021/04/01/do-not-resuscitate-scandal-led-to-disabled-people-accounting-for-3-in-5-covid-deaths-according-to-ons-figures/", "https://expose-news.com/2022/04/23/you-gave-up-twp-years-life-midazolam-covid-lie/", "https://expose-news.com/2022/06/11/77k-dead-7million-injured-covid-vaccine-us-uk-eu/", "https://expose-news.com/2022/06/11/77k-dead-7million-injured-covid-vaccine-us-uk-eu/", "https://phmpt.org/pfizers-documents/", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-261.png?ssl=1", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-65.png?ssl=1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043778/Temporary_Authorisation_HCP_Information_BNT162_19_0_UK_Clean.pdf", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://expose-news.com/2022/05/29/pfizer-hid-dangers-covid-vaccination-in-pregnancy/", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/pfizers-documents/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-267.png?ssl=1", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-266.png?ssl=1", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-268.png?ssl=1", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=VMAN&TSORT=down&EVENTS=ON&PERPAGE=100&ESORT=STATE&SYMPTOMS[]=Aborted_pregnancy_%2810000209%29&SYMPTOMS[]=Abortion_%2810000210%29&SYMPTOMS[]=Abortion_complete_%2810061614%29&SYMPTOMS[]=Abortion_complicated_%2810061615%29&SYMPTOMS[]=Abortion_early_%2810052846%29&SYMPTOMS[]=Abortion_incomplete_%2810000217%29&SYMPTOMS[]=Abortion_induced_%2810000220%29&SYMPTOMS[]=Abortion_induced_complete_%2810060928%29&SYMPTOMS[]=Abortion_induced_incomplete_%2810053984%29&SYMPTOMS[]=Abortion_late_%2810052847%29&SYMPTOMS[]=Abortion_missed_%2810000230%29&SYMPTOMS[]=Abortion_of_ectopic_pregnancy_%2810066266%29&SYMPTOMS[]=Abortion_spontaneous_%2810000234%29&SYMPTOMS[]=Abortion_spontaneous_complete_%2810061616%29&SYMPTOMS[]=Abortion_spontaneous_complicated_%2810000238%29&SYMPTOMS[]=Abortion_spontaneous_incomplete_%2810061617%29&SYMPTOMS[]=Ectopic_pregnancy_%2810014166%29&SYMPTOMS[]=Ectopic_pregnancy_termination_%2810014168%29&SYMPTOMS[]=Ectopic_pregnancy_with_contraceptive_device_%2810074497%29&SYMPTOMS[]=Foetal_cardiac_arrest_%2810084280%29&SYMPTOMS[]=Foetal_death_%2810055690%29&SYMPTOMS[]=Premature_baby_death_%2810076700%29&SYMPTOMS[]=Premature_delivery_%2810036595%29&SYMPTOMS[]=Ruptured_ectopic_pregnancy_%2810048407%29&SYMPTOMS[]=Stillbirth_%2810042062%29&VAX=COVID19", "https://healthimpactnews.com/2022/4113-fetal-deaths-in-vaers-following-covid-19-vaccines-not-including-those-murdered-alive-to-develop-the-vaccines/", "https://expose-news.com/2022/04/30/study-covid-vaccines-increase-risk-miscarriage-1517percent/", "https://www.webmd.com/hiv-aids/what-to-know-secondary-immunodeficiency-disorders", "https://www.webmd.com/hiv-aids/what-to-know-secondary-immunodeficiency-disorders", "https://www.webmd.com/hiv-aids/what-to-know-secondary-immunodeficiency-disorders", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1049160/Vaccine-surveillance-report-week-3-2022.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1054071/vaccine-surveillance-report-week-6.pdfhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1055620/Vaccine_surveillance_report_-_week_7.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1065279/vaccine-surveillance-report-week-13.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-286.png?ssl=1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1065279/vaccine-surveillance-report-week-13.pdf", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-02-05T06:59:00+00:00"}