{"result_id": "288034", "URL": "https://expose-news.com/2023/03/01/france-stops-covid-injections-for-all-but-vulnerable/", "timestamp": "2023-04-25 17:18:54 CEST+0200", "meta": {"description": "Last Friday, France’s independent public science authority Haute Autorité de Santé (“HAS”) released its vaccination strategy for the autumn of 2023.  It no longer recommends vaccinations for the entire population, but rather only for groups they have identified as most vulnerable to serious illness. It also recommends that covid injections be given at the same…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/03/01/france-stops-covid-injections-for-all-but-vulnerable/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "France stops covid injections for all but the “most vulnerable” in the population", "cleaned_text": "Last Friday, France’s independent public science authority Haute Autorité de Santé (“HAS”) released its vaccination strategy for the autumn of 2023. It no longer recommends vaccinations for the entire population, but rather only for groups they have identified as most vulnerable to serious illness.\n\nIt also recommends that covid injections be given at the same time as flu injections because both “vaccines” target the same vulnerable and elderly populations. We assume by linking the idea of covid and flu injections, or even combining them into one injection, they are hoping to dupe populations into having covid injections annually, at least, ad infinitum. This is the pattern we are seeing in other parts of the world. In the US, for example, an expert advisory group to the Centres for Disease Control and Prevention (CDC) said on Friday that there is not sufficient evidence to recommend more than one covid booster injection a year for older people and those with weakened immune systems. It is almost as if they are reading from the same script.\n\nUnfortunately, HAS still recommends booster doses for pregnant women:\n\nHAS also leaves room for the possibility of scaling up the vaccination campaign again “at any time if the epidemiological situation justifies it, in particular for immunocompromised and/or vulnerable people, or even on a larger scale in the general population, given the unpredictable nature of the emergence of variants.”\n\nThe 2023 vaccine strategy is according to recommendations submitted to HAS by the Directorate General for Health (“DGS”) on 26 December 2022. Interestingly, one of the factors the DGS took into consideration when devising the vaccination strategy for 2023 was the “low vaccination coverage for the booster dose.”\n\nAt the end of last year, vulnerable people or those aged 60 and over were eligible for a fourth dose. However as Connexion France reported, the covid vaccination campaign in France had been stalling, with few eligible people taking up the fourth dose. Presumably, as an attempt to use up national vaccine stocks, on 13 December the Ministry of Health announced “everyone in France can now receive a new booster dose.” And, “the government is still insisting that those in priority groups should make an even greater effort to get another vaccination as soon as possible.”\n\nFrance is not the only country where the uptake of boosters was low. In September 2022 an article published in The Lancet noted:\n\nCovid-19 booster vaccine uptake rates are behind the rate of primary vaccination in many countries. Governments and non-governmental institutions rely on a range of interventions aiming to increase booster uptake. Despite being recommended in many countries, as of July 11, 2022, only 74% of the fully vaccinated (without booster) have received a booster vaccination in the European Union, and rates are even lower in Australia (64%), South America (64%), North America (58%), Asia (41%) and Africa (11%). While this discrepancy is in part due to insufficient supply of and access to COVID-19 vaccines, some previously vaccinated people are unwilling or hesitant to get the booster vaccination, even in countries with initially high COVID-19 vaccine uptake. To increase uptake of booster vaccines, most countries inform people about the benefits of boosters, and some countries also employ interventions like sending personal reminders (e.g., Denmark, UK), offering incentives (e.g., Lithuania, many US states), imposing various restrictions on those who have not been boosted (e.g., France, Germany), or even imposing mandates with financial sanctions (e.g., Greece, Malaysia). In addition, non-governmental institutions and companies have adopted similarly heterogenous approaches to increase Covid-19 booster vaccine uptake of their workforce, including financial incentives and mandates. Crowdsourcing interventions to promote uptake of Covid-19 booster vaccines, The Lancet, 5 September 2022\n\nA year ago, in February 2022, France 24 reported that France ranked among the most vaccine-sceptic nations in the world. So much so that covid injections and covid restrictions featured in the hotly contested presidential elections held in April 2022. Since then, it seems the government’s mass covid injection campaign never recovered. Our World in Data shows a dramatic decrease in “vaccine” uptake in March 2022 where it has remained to this day.\n\nWhat will happen to the excess doses ordered? Last year they were thrown away.\n\nIn October, due to the free-falling uptake in covid injections, France had to consider throwing away 30 million doses of covid injections. To limit waste as much as possible, Express reported, France could deliver these doses to countries with low vaccination coverage. “It could be interesting, as the government has already done on several occasions, for large volumes, to send donations of vaccines to certain countries,” stressed David Lepoittevin, Pfizer France’s Director of Vaccines.\n\nThe realisation that France would have to destroy covid injections because nobody wanted them came as Switzerland was also forced to destroy 10.3 million doses of Moderna vaccines, which had reached their expiration date the week before.\n\nDespite having to throw away doses last year, it seems Sweden was destined to make the same mistake again and did not cancel or limit orders to suit “requirements.” A couple of weeks ago, Sweden discarded covid injections, this time nearly 8.5 million doses valued at US$143 million. The doses, equivalent to about 20 per cent of doses Sweden had purchased, were intended for booster vaccinations. According to Sweden’s former national vaccine coordinator, Richard Bergstrom, most are “doses that people have decided not to take, i.e., the third, fourth or fifth (booster) dose.”\n\nWe weren’t able to find how many doses France currently has in stock, is awaiting delivery or on order, but it is likely they will again follow Sweden’s suit and have to throw away millions of doses because, even when restrictions were being imposed on the French population to do so, nobody wanted them last year and nobody wants them now.\n\nFeatured image: Thousands Protest France’s Vaccine Pass for a Third Week, The New York Times, 1 August 2021", "opengraph": {"type": "article", "title": "France stops covid injections for all but the “most vulnerable” in the population", "url": "https://expose-news.com/2023/03/01/france-stops-covid-injections-for-all-but-vulnerable/", "description": "Last Friday, France’s independent public science authority Haute Autorité de Santé (“HAS”) released its vaccination strategy for the autumn of 2023.  It no longer recommends vaccinations for t…", "article:published_time": "2023-03-01T10:00:00+00:00", "article:modified_time": "2023-02-28T18:29:53+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/FeatFeb29a.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.reuters.com/world/us/not-enough-data-support-multiple-annual-covid-boosters-us-cdc-advisers-say-2023-02-24/", "https://www.has-sante.fr/jcms/p_3417408/fr/covid-19-la-has-publie-sa-recommandation-de-strategie-vaccinale-pour-2023", "https://www.has-sante.fr/jcms/p_3417245/fr/strategie-de-vaccination-contre-la-covid-19-anticipation-des-campagnes-de-vaccination-en-2023", "https://www.connexionfrance.com/article/French-news/Covid-19/Covid-France-Extra-booster-fourth-vaccine-dose-now-open-to-all", "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(22)00362-5/fulltext", "https://www.france24.com/en/europe/20220216-in-vaccine-sceptic-france-candidates-walk-a-tightrope-on-covid-measures", "https://ourworldindata.org/coronavirus#explore-the-global-situation", "https://www.express.co.uk/news/politics/1677604/macron-news-france-covid-vaccine-expiry-date-pfizer-moderna-switzerland", "https://www.telesurenglish.net/news/Sweden-Discards-8.5-Million-Doses-of-COVID-19-Vaccines-20230213-0018.html", "https://www.nytimes.com/video/world/europe/100000007898617/paris-france-protest-vaccine-pass.html", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-03-01T10:00:00+00:00"}