{"result_id": "288018", "URL": "https://expose-news.com/2023/01/20/neurosurgeon-proves-how-covid-vaccine-can-damage-the-brain-cause-cancer/", "timestamp": "2023-04-25 17:18:25 CEST+0200", "meta": {"description": "Retired American neurosurgeon Russell Blaylock recently gave an in-depth presentation on the adverse effects the spike proteins, induced by Covid-19 vaccination, have on the body. The doctor shared shocking discoveries about neurological damage, cancer rates, cardiac arrest and other exacerbating health issues as well as their connection to mRNA technology. “This [Covid] injection is an…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/20/neurosurgeon-proves-how-covid-vaccine-can-damage-the-brain-cause-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Neurosurgeon proves how COVID Vaccine can damage the Brain & cause Cancer", "cleaned_text": "Retired American neurosurgeon Russell Blaylock recently gave an in-depth presentation on the adverse effects the spike proteins, induced by Covid-19 vaccination, have on the body.\n\nThe doctor shared shocking discoveries about neurological damage, cancer rates, cardiac arrest and other exacerbating health issues as well as their connection to mRNA technology.\n\nHis presentation titled ‘Spike Proteins and Neurodegeneration: Effect of artificial exosomes on the nervous system in the form of an injection’ (which can be viewed in full at the end of this article) covers the damage the spike protein does to the brain, the elderly and unborn children.\n\nDr Blaylock also explains in detail the mechanisms that cause the damage and used several published papers to demonstrate the harm. And ends with some advice for those who have been vaccine-injured.\n\nWith all vaccines, and this injection in particular, if you stimulate the peripheral immune system within minutes there’s microglial activation in the brain – the brain’s primary immune cell. This is what Dr. Blaylock describes as “sickness behaviour.”\n\nWhen there’s systemic inflammation or any kind of trauma occurs in the body, it produces inflammation and activation of the immune system. This sends a signal to the brain within minutes and starts activating the microglia which is the inflammatory, cytotoxic cell in the brain.\n\nThe image below illustrates the different stages of microglia. At the top of the image is a ramified microglia which is “normal,” it has not been stimulated. It used to be called a “resting microglia” but that’s not an accurate term. The pseudopodia are constantly extending and retracting to analyse the extracellular space for invaders, changes in chemical content etc., explained Dr. Blaylock.\n\nWhen there is a stimulation of the immune system the ramified microglia go to the primed microglia stage. The pseudopodia are retracted and it becomes a more rounded-looking cell. Inside the primed microglia, there is an intense upregulation of cytokine, chemokine and excitotoxin production – but they’re not released from the cell so there may be some minor immune reaction but otherwise there’s not much sign of a reaction. “That’s what would happen with the first injection of this injectable they call a ‘vaccine’,” Dr. Blaylock said. It is important to note that chemokines attract macrophages, or white blood cells, to the brain. A macrophage in the brain looks exactly like microglia and can also undergo priming.\n\n“With the second immune stimulation, [which would be the second injection and] which can be months later, that primed microglia become fully activated. And when that happens it releases all these toxic components … you get chronically activated microglia, [an] overactivated state and there’s a 3-fold higher inflammatory reaction than you’d normally get with microglial activation.”\n\nWhen microglia get the second immune stimulation, for example after the second injection or further boosters, and release high levels of destructive elements it damages, for example, the dendrites, cell membranes, mitochondria and the DNA. “And so, it can produce a lot of damage to that neuron,” Dr. Blaylock said.\n\nWhen you get an infection and recover from it, microglia shift from the activated state back to the ramified state. In the ramified state, instead of releasing harmful chemicals the microglia release neurotrophins that repair the damage done during the activated state.\n\nIt is important to be aware of immunosenescence, or imflammaging, in the elderly whereby immune cells begin to age and change, and immune cells don’t reproduce themselves and become highly inflammatory. This also happens to microglia and astrocytes, star-shaped glial cells in the brain and spinal cord. Senescent microglia have an impaired ability to fight viruses while producing high levels of inflammatory mediators and excitotoxins. “So, in the aged person this reaction is infinitely magnified,” said Dr. Blaylock, “senescent astrocytes … leak excitotoxins so that adds to the problem.”\n\n“This whole senescence occurs in males more than females which explains why you see more problems in males like in autism spectrum disorders as well as in neurodegenerative disorders.”\n\nNot only do an aged person’s immune cells produce higher levels of inflammatory cytokines but they also secrete much lower levels of the reparative neurotrophic compounds. “So, the aged person has a much worse reaction and less ability to repair the neurons after an attack than a young person. That’s why ageing is the number one risk factor for neurodegenerative disorders,” Dr. Blaylock said.\n\n“The spike proteins, because they’re constantly stimulating these cells in the brain as well as systemically, are producing an increase in levels of [or accelerate] immune senescence.”\n\nDr. Blaylock then talked through a few images of histology slides from autopsies performed by Dr. Sucharit Bhakdi and Dr. Arne Burkhardt which showed the spike protein in the brain and the damage it had caused. It is worth listening to his explanation rather than us transcribing it here (see video at the top of this article, begin timestamp 17:49, end 19:19).\n\nEffects of Spike Proteins on the Central Nervous System\n\nAccording to studies, the spike protein, alone, alters neurological function.\n\nIn one study, when researchers placed the spike protein in a cell it formed abundant exosomes that not only contained the spike protein but also two microRNAs, Dr. Blaylock explained.\n\n“The spike protein contained in the exosome was shown to cause a sharp decline in [an interferon regulating, self-controlled, system] IRE9 in microglia making them infinitely more destructive.”\n\nDr. Blaylock doesn’t make clear which study he was referring to above. However, we found THIS study which may be relevant.\n\nAnother study found that antibodies to only a fragment, not the whole, of the spike protein induced neuroinflammation and impaired episodic memory in mice. “This is what we’re seeing in humans who’ve had this injection as well, they have impaired memory,” Dr. Blaylock said.\n\n“The brain has a special anti-inflammatory system built into it, which is called the alpha-7 nicotinic acetylcholine receptor, and what this does is it down-regulates all the inflammatory responses. It’s also responsible for memory and learning. And so, what they found, is after immunisation with the spike protein it develops these immune reactions to the spike protein, just of that fragment, and there was a loss in episodic memory in those animals. The second injection was even worse. Which demonstrates the priming effect that we discussed. The second injection is always worse.”\n\nA study of mitochondrial effects showed that the spike protein, alone, increased microglia mitochondrial activity producing extremely high levels of reactive oxygen and reactive nitrogen species. This makes the microglia more destructive than they normally would be, Dr. Blaylock explained. The study found extensive changes in the chemicals of mitochondria exposed to spike proteins. They noticed an increase in chemokines and cytokines. The spike protein also increased the ACE2 receptor binding site by 50% on microglia which means a lot more of them would be affected by the spike protein. Overall, the study found, there was a 64% increase in the principal inflammatory component, inflammasome, in a cell. It also showed that the spike protein impaired the ability of the brain to tolerate inflammation and greatly enhanced the brain cytokine storm.\n\nA second study of the effects of the spike protein on mitochondria found the spike protein caused microglia to switch to glycolysis – this is what cancer does. Glycolysis increases inflammation and excitotoxicity.\n\nA study published in March injected a fragment of the spike protein, the S1 subunit, into the hippocampus of mice. The hippocampus is a region of the brain that is associated primarily with memory. “They found a profound cognitive deficit,” Dr. Blaylock said. The study found neurons were remarkably decreased and an increase of 59%-63% in astrocyte activation in the two zones which relate to learning and memory, and affective brain function. The study authors determined that the death of the neurons was secondary to microglial activation caused by the spike protein. “So, just the S1 fragment alone can cause a severe cognitive deficit,” Dr. Blaylock said.\n\nThe spike protein has been shown to reduce the sensitivity of baroreceptors in the brainstem, Dr. Blaylock said. The brain stem controls the heart rate. “We’re seeing a lot of POTS syndrome with this injection, which makes sense because the spike protein is going to affect the baroreceptors,” Dr. Blaylock said. POTS is an acronym for postural orthostatic tachycardia syndrome.\n\nThe spike protein has also been shown to enter endothelial cells and rapidly enter the nucleus. It also damages the mitochondria of endothelial cells. Both have the effect of reducing endothelial cell function, which is essential to blood vessel function. The endothelial cell is particularly important for the blood-brain barrier. Reduced endothelial cell function causes damage to arteries, arterioles and capillaries in the brain. Damage to these vessels leads to strokes and, Dr. Blaylock said, “over time, I suspect, although it hasn’t been reported yet, we’re going to get a lot of aneurysms – and that’s because it’s damaging the integrity of the wall of the vessel and that’s what an aneurysm is.”\n\nThe spike protein mutation was also shown to trigger excitotoxicity in a study published in 2011. This study was of the spike protein of a coronavirus different to SARS-CoV-2 but shows the damage that the spike protein does.\n\nIn a study of six patients with known neurological effects but whose MRI scans were normal, a Diffusion Tensor Imaging (“DTI”) scan was done. A DTI shows damage to axions within the white matter, it enables a researcher to look at individual fibres of white matter. White matter is tissue in the brain composed of nerve fibres. The fibres, called axons, connect nerve cells and are covered by myelin, a type of fat. The myelin is what gives white matter its white colour. All six participants of the study had abnormal DTI scans which indicates inflammation. One of the participants died and a post-mortem was performed – extensive microglial activation was found, especially in the brain stem. Other studies have confirmed microglial activity to be most intense in white matter and not in grey matter.\n\nThe fibres in the white matter connect all areas of the brain. So, when you damage the fibre then the grey matter can’t work as it can’t communicate. This is what happens in autism and white matter abnormalities are seen in people with autism.\n\nThe ramifications on the developing foetus are astounding.\n\n“The whole process of the nano lipid carrier carrying the spike protein everywhere also occurs in the pregnant woman – the nano lipid carrier goes right through the placenta, enters the babies circulation and of course, as we said in the beginning, the child is putting on 250,000 brain cells every minute [so] its impairing [brain development]. Plus, all of the excitotoxicity and inflammation is occurring as well,” Dr. Blaylock said.\n\nIn the baby, there is the same process that happens in adults, the priming and activation and a long-term microglial activation – for example, when examining adult autism, after 40 years the microglia were still activated. Dr. Blaylock warned:\n\n“I think we’re going to see everything [as a consequence of Covid injections]. We’re going to see a tremendous increase in autism spectrum disorders. The other disorder never spoken of is schizophrenia. What we see is if we stimulate the immune system during the third trimester, the incidence of schizophrenia increases about 6-fold. But it doesn’t come on until adolescence so it’s going to be a long period before we’re going to see it.\n\n“But I think everything – malformations are increasing by 300 to 400% already, miscarriages – we’re going to see things we’ve never seen before. That’s the tragedy of all this.”\n\nThat paediatric organisations are endorsing Covid injections is monstrous.\n\nDr. Ryan Cole keeps meticulous records and noticed there was a tremendous increase in aggressive cancers after the Covid injection rollout. He also noticed that people who had well-controlled cancers were developing uncontrollable cancers and dying very quickly.\n\nLymphocytes, which help to fight cancers, are lowered post-Covid injection and this is the cause that is often spoken about. But two other mechanisms cause these cancers that need to be looked at, Dr. Blaylock said. One is the activation of oncogenic viruses and the other is glutamate levels.\n\nIt’s been mentioned on numerous occasions that Covid injections are activating latent viruses. “There are a lot of oncogenic viruses,” Dr. Blaylock said.\n\nOnce one of these viruses are activated, they’re powerful oncomodulators. One of the mechanisms for cancer induction and enhancement is inflammation. Inflammation is known to be the primary cause of virtually all cancers and it increases cancers at every stage, Dr. Blaylock said.\n\n“There’s no known vaccine that produces the extent and prolonged nature of inflammation as these injections. And it’s ongoing, they’re constantly increasing the amount of spike protein.”\n\nAll immune cells secret glutamate. So, when the immune system is activated and infiltrates tissues, it raises the glutamate levels considerably in that tissue. Several cancers are known to be stimulated by glutamate. It has been shown that glutamate blockers reduced cell division, increased cell death and inhibited cell migration.\n\nGlutamate receptors are found all over the body.\n\nMicroglia infiltration in the brain enhances brain tumour growth as do infiltration by cells secreting glutamate. “Primary brain tumours are particularly prone to this,” Dr. Blaylock explained. In the case of glioblastoma multiforme, people who have very high glutamate in the tumour have a very poor prognosis. Those who have very low levels of glutamate live much longer, he said.\n\n“People who are trying to hide that [sudden cardiac death is] caused by the injections are calling it sudden death syndrome – a nonsense term,” Dr. Blaylock said.\n\nEvery tissue in the heart has glutamate receptors. The entire electrical conduction system of the heart is controlled by glutamate receptors. “And we know that people who have low tissue magnesium have high excitotoxin levels and they’re prone to sudden cardiac death,” he explained.\n\nThe heart is also controlled by central neurological systems in the brainstem which regulates the heart’s contraction and rhythm. If glutamate is excessive in the brainstem, it can cause arrhythmia or irregular heartbeat, sudden cardiac death or infarction.\n\nIn an animal study, hamsters were given glutamate-blocking compounds for five days. The hamsters were genetically predisposed to sudden cardiac death when exposed to stress. After being given the glutamate compound it was found there was a significant reduction in stress-induced death. However, all the animals that were fed a low-magnesium diet and then exposed to stress died. For those animals whose magnesium levels were raised, none of them died. “So, low magnesium … greatly enhances excitotoxicity,” Dr. Blaylock said.\n\nA lot of people have a diet high in glutamate, found in processed foods, and aspartame content while also having low magnesium stores – this can precipitate sudden cardiac death. “So, you can see if you’re in this category and you get this injection, you’re probably going to die from it,” Dr. Blaylock explained.\n\nWhat Can People Who Have Had Covid Injections Do?\n\nDr. Blaylock ended his presentation with some advice, particularly for those who have been vaccine injured. He said:\n\n“You want to quieten the microglia. You want to help establish this protective system. And that can be done with a number of compounds, like curcumin. Quercetin, vicetin, hesperidin, vitamin D3, vitamin C, the list just goes on and on. There are a lot of flavonoids that are known to quieten the microglia. Silymarin does it in very little concentration.\n\n“The problem is getting it absorbed in the [gastrointestinal] GI tract. There are nano forms of these compounds which are highly absorbed and enter the brain in high concentrations, so we kind of defeated that. And I recommend people try nano curcumin.\n\n“You also want to increase mitochondrial function. There’s a whole host of compounds you can use to boost mitochondrial function.\n\n“And you want all your antioxidants to reduce the damage that the excitotoxicity is causing.”\n\nWhat can people do about cancers caused by the injections?\n\nDr. Blaylock has written a book about natural cancer treatments titled ‘Natural Strategies for Cancer Patients’ so he has done extensive research on the subject.\n\n“There’s a lot of natural compounds that are very powerful cancer inhibitors. What you need to do is raise your lymphocytes. Astragalus dramatically raises the lymphocytes in cancer patients.\n\n“And I’ve had a number of cancer patients in which I did that, their lymphocytes came back to normal and their cancer was under control I’ve had a number of women with stage 4 breast cancer, and we did these things, and they’ve got long survival and most of them are still alive. So, this works.\n\n“But it’s like everything we’re seeing today, they cover it up. They don’t want you to know it because pharmaceutical companies are making fortunes off of people.”\n\nFurther resources: Russell L. Blaylock’s research while affiliated with Belhaven College and other places, ResearchGate\n• Curcumin: A Review of Its Effects on Human Health, Foods, 22 October 2017", "opengraph": {"type": "article", "title": "Neurosurgeon proves how COVID Vaccine can damage the Brain & cause Cancer", "url": "https://expose-news.com/2023/01/20/neurosurgeon-proves-how-covid-vaccine-can-damage-the-brain-cause-cancer/", "description": "Retired American neurosurgeon Russell Blaylock recently gave an in-depth presentation on the adverse effects the spike proteins, induced by Covid-19 vaccination, have on the body. The doctor shared…", "article:published_time": "2023-01-20T06:59:00+00:00", "article:modified_time": "2023-01-19T17:58:01+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/neurosurgeoun-brain-cancer.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://wikispooks.com/wiki/Russell_Blaylock", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://www.britannica.com/science/astrocyte", "https://www.frontiersin.org/articles/10.3389/fimmu.2021.656700/full", "https://www.sciencedirect.com/science/article/pii/S0006291X22009779", "https://link.springer.com/article/10.1007/s11481-021-10015-6", "https://pubs.acs.org/doi/10.1021/acschemneuro.1c00675", "https://www.nature.com/articles/s41598-022-09410-7", "https://www.mdpi.com/1999-4915/13/10/2021", "https://journals.asm.org/doi/10.1128/JVI.05576-11", "https://link.springer.com/article/10.1007/s00134-020-06241-w", "https://www.verywellhealth.com/what-is-white-matter-in-the-brain-98119", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://rumble.com/v1v7udi-sickness-behavior-the-effect-of-spike-proteins-on-the-body.html", "https://www.sciencedirect.com/science/article/abs/pii/S0006899302028858", "https://www.amazon.co.uk/Natural-Strategies-Patients-Russell-Blaylock/dp/0806539224", "https://www.researchgate.net/scientific-contributions/Russell-L-Blaylock-58885645", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5664031/", "https://greenmedinfo.com/substance/curcumin", "https://greenmedinfo.com/substance/quercetin", "https://greenmedinfo.com/substance/hesperidin", "https://www.webmd.com/diet/foods-high-in-flavonoids#1", "https://greenmedinfo.com/substance/silymarin", "https://greenmedinfo.com/substance/astragalus", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-20T06:59:00+00:00"}