{"result_id": "288003", "URL": "https://expose-news.com/2023/01/06/covid-19-vaccine-linked-to-7x-increase-deaths-children-europe/", "timestamp": "2023-04-25 17:17:57 CEST+0200", "meta": {"description": "Excess deaths among children aged 0 to 14 in Europe surged 755% between January ad September 2022, according to official data, despite efforts by EuroMOMO to downplay the figures. The European Union has launched an investigation into the increase, which comes after the European Medicines Agency approved the Pfizer Covid-19 vaccine for children in May…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/06/covid-19-vaccine-linked-to-7x-increase-deaths-children-europe/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Tragedy Strikes: Covid-19 Vaccine linked to 630% increase in Excess Deaths among Children in Europe", "cleaned_text": "Excess deaths among children aged 0 to 14 in Europe surged 755% between January ad September 2022, according to official data, despite efforts by EuroMOMO to downplay the figures.\n\nThe European Union has launched an investigation into the increase, which comes after the European Medicines Agency approved the Pfizer Covid-19 vaccine for children in May 2021.\n\nOverall, excess deaths rose 630% since the vaccine’s approval for use in children by September of 2022.\n\nEuroMOMO, a European mortality monitoring organization, has reported a shocking increase in excess deaths among children aged 0 to 14 in Europe.\n\nSupported by the European Centre for Disease Prevention and Control and the World Health Organization, the organization’s data shows a weekly increase in excess deaths throughout 2021 compared to an ordinary amount of deaths in 2020 at the height of the alleged pandemic.\n\nExcess deaths among children in Europe surged in 2021, starting in week 22, which “coincidentally” coincided with the European Medicines Agency’s extension of the COVID-19 vaccine Comirnaty (Pfizer) for use in children aged 12 to 15.\n\nThe following chart shows the cumulative totals of weekly excess deaths between 2017 and 2022 among children aged 0 to 14 across Europe between week 0 and week 21. The data has been extracted from the EuroMOMO website and can be accessed here.\n\nIn the first 21 weeks of 2021, there were 408 fewer deaths among children than expected and 607 fewer deaths than the 2018-2020 average in Europe, according to data from EuroMOMO.\n\nHowever, excess deaths among children aged 0 to 14 spiked following the European Medicines Agency’s approval of the Covid-19 vaccine for 12 to 15-year-olds in week 22, as seen in the chart from EuroMOMO’s website.\n\nThe following chart shows the total number of excess deaths among children aged 0 to 14 in 2021 following EMA approval of the Covid-19 vaccine for 12 to 15-year-olds in week 22, compared to the same time frame in other years. The numbers have been extracted from the EuroMOMO website and can be accessed here.\n\nExcess deaths among children in Europe surged 554% in 2021 following the European Medicines Agency’s approval of the Pfizer Covid-19 vaccine for children, according to data from EuroMOMO.\n\nThe organization’s data shows that in the same period in 2021, there were 682 more deaths among children than expected and 578 more deaths than the 2017-2020 average.\n\nThe following chart shows the total number of excess deaths among children aged 0 to 14 in 2022 so far (Week 37) compared to the same time frame in other years. The numbers have been extracted from the EuroMOMO website and can be accessed here.\n\nExcess deaths among children in Europe have surged 755% in 2022 after the European Medicines Agency approved the Covid-19 vaccine for children aged 5 and above, according to data from EuroMOMO.\n\nThe organization’s data also shows a 630% increase in excess deaths among children since the EMA’s approval of the vaccine for children aged 12 to 15 in May 2021.\n\nDespite the overwhelming evidence, it is unlikely that authorities will acknowledge the clear danger of Covid-19 vaccinations for children.\n\nTragically, the surge in excess deaths among children in Europe since the European Medicines Agency approved the vaccine for children will likely be brushed off as just another “coincidence” in the long list of such occurrences since the beginning of the pandemic.", "opengraph": {"type": "article", "title": "Tragedy Strikes: Covid-19 Vaccine linked to 630% increase in Excess Deaths among Children in Europe", "url": "https://expose-news.com/2023/01/06/covid-19-vaccine-linked-to-7x-increase-deaths-children-europe/", "description": "Excess deaths among children aged 0 to 14 in Europe surged 755% between January ad September 2022, according to official data, despite efforts by EuroMOMO to downplay the figures. The European Unio…", "article:published_time": "2023-01-06T06:59:00+00:00", "article:modified_time": "2023-01-05T20:49:18+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/children-europe.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.euromomo.eu/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-37.png?ssl=1", "https://www.ema.europa.eu/en/news/comirnaty-covid-19-vaccine-ema-recommends-approval-children-aged-5-11", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-39.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-40.png?ssl=1", "https://www.euromomo.eu/", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-41.png?ssl=1", "https://www.euromomo.eu/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-06T06:59:00+00:00"}