{"result_id": "288038", "URL": "https://expose-news.com/2023/01/22/c19-vaccine-induced-aids-death-scandal-germany/", "timestamp": "2023-04-25 17:19:00 CEST+0200", "meta": {"description": "Official Data shows Germany suffered over 102k excess deaths in 2022, a 276% increase on excess deaths recorded in the year 2020, the alleged height of the Covid-19 pandemic, and prior to the emergency use authorisation of Covid-19 injections. Does this prove that the COVID Vaccinated did go on to develop Acquired Immune Deficiency Syndrome…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/01/22/c19-vaccine-induced-aids-death-scandal-germany/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "German Government data confirms the COVID Vaccinated did develop Acquired Immunodeficiency Syndrome in Jan. 2022 & it caused 102k Excess Deaths over the year; a 276% increase on Deaths in 2020", "cleaned_text": "Official Data shows Germany suffered over 102k excess deaths in 2022, a 276% increase on excess deaths recorded in the year 2020, the alleged height of the Covid-19 pandemic, and prior to the emergency use authorisation of Covid-19 injections.\n\nDoes this prove that the COVID Vaccinated did go on to develop Acquired Immune Deficiency Syndrome as predicted in an official report published by the ‘Robert Koch Institut?\n\nAs the German government published data in January 2022, concerns about the effectiveness of the COVID-19 vaccine began to rise.\n\nThe data suggested that most of the individuals who had been fully vaccinated would develop full-blown vaccine-induced acquired immunodeficiency syndrome by the end of the month.\n\nFurthermore, the data confirmed that the immune systems of the fully vaccinated had already degraded to an average of minus 87%.\n\nIn Germany at the time, 70.53% were fully vaccinated, 2.97% were partially vaccinated and 26.5% were unvaccinated– https://ourworldindata.org/covid-vaccinations\n\nSo the unvaccinated had 186 cases out of 26.5% of the population. While the fully vaccinated had 4020 cases out of 70.53% of the population.\n\nSo the vaccinated Omicron case incidence was 57 per 1 per cent of the population (830,000 is 1% of the 83 million German population)\n\nWhile the unvaccinated Omicron case incidence was just 7.02 per 1 per cent of the population.\n\nSo the vaccinated were (57.0/7.02 =) 8.12x more likely to be infected with Omicron than the unvaccinated in Germany.\n\nThe Koch Institut failed to produce its normal vaccine effectiveness table in its December 30 weekly report.\n\nVaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipient’s immune system performance compared to the immune system performance of an unvaccinated person.\n\nVaccines allegedly help develop immunity by imitating an infection. Once the imitation infection induced by the vaccine goes away, the body is left with a supply of “memory” t-cells and antibodies that will remember how to fight that disease in the future.\n\nSo, when the authorities state that the effectiveness of the vaccines weakens over time, what they really mean is that the performance of your immune system weakens over time.\n\nThankfully, we were able to help the Germans out with the information The Koch Institut failed to produce by simply doing the calculation for them using Pfizer’s vaccine effectiveness formula.\n\nTherefore, at the beginning of January 2022, fully vaccinated Germans had a 87.7% lower immune response than the unvaccinated had to Omicron.\n\nThis means that the average German was down to the last 12.3% of his or her immune system for fighting certain classes of viruses and certain cancers etc. etc.\n\nPanic among the Government of Germany\n\nFurther analysis showed that the average fully vaccinated German would reach minus-100% immune system degradation by the end of January 2022.\n\nAs the data and death tolls continued to cause public concern, the German government found itself under pressure to address the situation.\n\nIn an effort to quell the growing unrest, the government announced at the end of January that the initial data had been “incorrect” and that there had been a “mistake” in the analysis. They claimed that the fully vaccinated individuals were not at risk of developing AIDS and that the immune systems of the fully vaccinated had not degraded to an average of minus 87%.\n\nHowever, many were sceptical of these claims and accused the government of attempting to cover up the truth. Critics pointed out that the sudden alteration of the data without any clear explanation or transparency raised suspicions of a cover-up.\n\nDespite the German government’s efforts to reassure the public, the damage had already been done. The incident had shaken public trust in the government and the pharmaceutical industry, and many were left wondering what the true impact of Covid-19 vaccination really was.\n\nAs the weeks passed, the situation in Germany continued to worsen.\n\nAccording to official German Government data, by week 49 of 2022, the country had suffered over 102,000 excess deaths, a staggering increase from the 27,291.6 excess deaths reported by week 49 of 2020.\n\nThis represented a 276% increase in excess deaths in 2022, despite the roll-out of a vaccine that was supposed to lower deaths due to the alleged Covid-19 pandemic.\n\nThese figures alone should make the public question whether the vaccine had had the opposite effect and if fully vaccinated Germans did indeed develop AIDS by the end of January 2022.\n\nThe government and pharmaceutical companies will of course continue to deny any responsibility and insist that the vaccine is safe and effective.\n\nHowever, this data proves that you must remain sceptical and continue to demand further research and investigations into the consequences of issuing an experimental mRNA gene therapy to millions of people for the first time, and numerous times.\n\nBecause as the death toll continues to rise, it has become clear that something is not right and that the true impact of the Covid-19 injections needs to be fully understood.\n\nIf Covid-19 injections causing acquired immunodeficiency syndrome in early 2022 are not to blame for Germany recording a 276% increase in excess deaths in 2022 compared to 2020, then the German government needs to explain to the public what on earth is.", "opengraph": {"type": "article", "title": "German Government data confirms the COVID Vaccinated did develop Acquired Immunodeficiency Syndrome in Jan. 2022 & it caused 102k Excess Deaths over the year; a 276% increase on Deaths in 2020", "url": "https://expose-news.com/2023/01/22/c19-vaccine-induced-aids-death-scandal-germany/", "description": "Official Data shows Germany suffered over 102k excess deaths in 2022, a 276% increase on excess deaths recorded in the year 2020, the alleged height of the Covid-19 pandemic, and prior to the emerg…", "article:published_time": "2023-01-22T07:59:00+00:00", "article:modified_time": "2023-01-24T19:29:14+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/german-aids-true.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Situationsberichte/Wochenbericht/Wochenbericht_2021-12-30.pdf?__blob=publicationFile", "https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Situationsberichte/Wochenbericht/Wochenbericht_2021-12-30.pdf?__blob=publicationFile", "https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Situationsberichte/Wochenbericht/Wochenbericht_2021-12-30.pdf?__blob=publicationFile", "https://expose-news.com/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-154.png?ssl=1", "https://ourworldindata.org/covid-vaccinations", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-155.png?ssl=1", "https://expose-news.com/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/01/image-158.png?ssl=1", "https://stats.oecd.org/index.aspx?queryid=104676", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-01-22T07:59:00+00:00"}