{"result_id": "288036", "URL": "https://expose-news.com/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "timestamp": "2023-04-25 17:18:57 CEST+0200", "meta": {"description": "German Government Data for the alleged Omicron variant of Covid-19, suggests that most of the \"fully vaccinated\" will have full blown Covid-19 vaccine induced acquired immunodeficiency syndrome (AIDS) by the end of January 2022, after confirming that the immune systems of the fully vaccinated have already degraded to an average of minus 87%. By a concerned…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "Official German Government data suggests the Fully Vaccinated will develop Acquired Immunodeficiency Syndrome by the end of January 2022", "cleaned_text": "German Government Data for the alleged Omicron variant of Covid-19, suggests that most of the “fully vaccinated” will have full blown Covid-19 vaccine induced acquired immunodeficiency syndrome (AIDS) by the end of January 2022, after confirming that the immune systems of the fully vaccinated have already degraded to an average of minus 87%.\n\nThe German Government Covid-19 figures are produced by the ‘Robert Koch Institut’ (see here).\n\n\n\nTheir latest data is available as a downloadable pdf here.\n\nPage 14 has their Weekly COVID-19 management report from December 30, 2021 –\n\n“Additional information is known to some extent for the Omikron cases in the reporting system. for 6,788 cases were provided with information on the symptoms, mostly none or mild symptoms indicated. It was most common by patients with symptoms\n\nRunny nose (54%), cough (57%) and sore throat (39%) mentioned. 124 patients were hospitalized, four people died. Exposure abroad was reported for 543 (5%) cases. 186 patients were unvaccinated, 4,020 were fully vaccinated, of these, a booster vaccination was reported for 1,137. On the basis of the transmitted data 148 reinfections were found among all transmitted Omicron infections, none of them Previous illnesses were reported to the person affected by reinfection. Figure 9 shows the distribution of the Omikron cases reported so far in Germany. Omicron cases have been detected in all federal states.”\n\nIn Germany 70.53% are fully vaxxed, 2.97% are partially vaxxed and 26.5% unvaxxed – https://ourworldindata.org/covid-vaccinations\n\nSo unvaxxed have 186 cases out of 26.5% of the population\n\nFully vaxxed have 4020 cases out of 70.53% of the population.\n\nSo the vaxxed Omicron case incidence is 57.0 per percent of population (830,000 is 1% of the 83 million German population)\n\nAnd the unvaxxed Omicron case incidence is 7.02 per percent of population.\n\nSo the vaxxed are 57.0/7.02 = 8.12x more likely to be infected with Omicron than the unvaxxed in Germany That is what vaccination has done for the people of Germany.\n\nThe Koch Institut failed to produce its normal vaccine effectiveness table in its December 30 weekly report. This may have been due to the holidays (the British gave up completely on December23) or may have been because the table would be disastrous for the vaccines. But we can help the Germans out here by doing the calculation for them using Pfizer’s vaccine effectiveness formula.\n\nSo the vaccinated have an 87.7% lower immune response than the unvaccinated have to Omicron.\n\nThis means that the average German is down to the last 12.3% of his or her immune system for fighting certain classes of viruses and certain cancers etc. etc.\n\nHere is the prediction, the extrapolation from UKHSA Vaccine Surveillance Report data from Weeks 35-42 that we first made on October 10th. The predicted figures are in olive green.\n\nSo Germany, at 87.7% immune system degradation, has done 6.7% worse than our model which predicted, an 81.0% degradation this year (for over 18s based on 2 doses of the anti-vaccine rather than 3). \n\n\n\nIt is the 3rd dose that really kills the immune system as can be seen from the ONS data for Omicron. Here is Table 1b from the OMS report: Coronavirus (COVID-19) Infection Survey, UK: Characteristics related to having an Omicron compatible result in those who test positive for COVID-19 (84.8 kB xlsx)\n\nModelled likelihood of testing positive with an Omicron probable result in people who test positive for COVID-19, by screened demographic characteristic, UK: 29 November 2021 to 12 December 2021\n\nThese figures mean that if you have Covid and you have had 3 doses of the vaccine then you are 4.45x more likely to have Omicron than if you are an unvaxxed Covid case. But the above was merely an estimation.\n\nWe now have the German Government figures for Omicron and they show that the fully vaccinated are 8.12 times more likely to have an Omicron infection than the unvaccinated.\n\nThese truly astonishing figures show that we are over 8x safer from Omicron in a room a restaurant a bar a night club a train a boat or a plane full of unvaccinated people than we are with “fully vaccinated” people. And the more jabs you take the faster the degradation of your immune system progresses. It also looks like the unvaxxed are reaching sub herd immunity against Covid-19 whereas the fully vaxxed are being prevented from reaching it by the vaccines.\n\nThe German figures have destroyed the case for vaccine passports and by themselves prove instead the case for an immediate gene therapy and spike protein vaccination ban.\n\nThe vaccinated fare so badly against Omicron because vaccine induced antibodies against the Wuhan Alpha spike protein are next to useless against Omicron. So the underlying progressive immune system damage wrought by incessant spike protein production has almost nothing to hide behind, nothing to offset itself against. \n\n\n\nWe therefore see in these figures a much closer estimate of how much damage has been done to vaccinated people than we were able to see with delta figures for cases in the vaccinated and unvaccinated..\n\nThe UK has 69.45% double or triple vaccinated, 6.41% singly vaccinated and 24.14% unvaccinated (ourworldindata). So we will be doing very slightly worse than the Germans – having slightly more vaccination victims.\n\nBy the end of January every fully vaccinated person in both countries over 30 years old will have full blown vaccine mediated AIDS. However much of the immune system that is presently left with the ability fight Omicron will have gone.\n\nThis will cause a massive burden on the health services of both countries and massive pain suffering and death all of which has been inflicted upon us by a corrupted healthcare system. This must be the biggest own goal in medical history.\n\nWe have the figures thanks to the tireless industry, accuracy and efficiency of the Germans. But I have no words in English to describe the immorality of the crooks involved in this vaccination program.", "opengraph": {"type": "article", "title": "Official German Government data suggests the Fully Vaccinated will develop Acquired Immunodeficiency Syndrome by the end of January 2022", "url": "https://expose-news.com/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "description": "German Government Data for the alleged Omicron variant of Covid-19, suggests that most of the “fully vaccinated” will have full blown Covid-19 vaccine induced acquired immunodeficiency …", "article:published_time": "2022-01-02T07:30:00+00:00", "article:modified_time": "2022-01-01T18:59:55+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/01/GERMAN-GOV-DATA-FULLY-VACCINATED-AIDS.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.rki.de/EN/Home/homepage_node.html", "https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Situationsberichte/Wochenbericht/Wochenbericht_2021-12-30.pdf?__blob=publicationFile", "https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Situationsberichte/Wochenbericht/Wochenbericht_2021-12-30.pdf?__blob=publicationFile", "https://ourworldindata.org/covid-vaccinations", "https://expose-news.com/2021/10/10/comparison-reports-proves-vaccinated-developing-ade/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/01/image-2.png?ssl=1", "https://expose-news.com/wp-content/uploads/2022/01/image-2.png", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/adhocs/14107coronaviruscovid19infectionsurveyukcharacteristicsrelatedtohavinganomicroncompatibleresultinthosewhotestpositiveforcovid19/omicronpredictorsofpositivityadhoc.xlsx", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2022-01-02T07:30:00+00:00"}