{"result_id": "288033", "URL": "https://expose-news.com/2023/04/09/pfizer-fda-lied-graphene-oxide-is-inside-covid-vaccines/", "timestamp": "2023-04-25 17:18:52 CEST+0200", "meta": {"description": "Graphene Oxide is a fairly new substance not yet well understood. But what we do know is that studies have proven it can be toxic to cells and tissues in the body. And further studies have shown Graphene Oxide to have toxic effects on blood cells, inducing oxidative stress and inflammation. This is why it's…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/04/09/pfizer-fda-lied-graphene-oxide-is-inside-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "BREAKING: Secret Documents published by order of the U.S. Federal Court prove Pfizer, the FDA & Fact Checkers lied when they said Toxic Graphene Oxide was not inside the Covid-19 Vaccines", "cleaned_text": "Graphene Oxide is a fairly new substance not yet well understood. But what we do know is that studies have proven it can be toxic to cells and tissues in the body. And further studies have shown Graphene Oxide to have toxic effects on blood cells, inducing oxidative stress and inflammation.\n\nThis is why it’s concerning to find Graphene Oxide (GO) has been in and out of the news for the past two years in relation to the COVID-19 vaccines developed by Pfizer-BioNTech and Moderna.\n\nSeveral independent studies conducted by doctors and scientists have confirmed that Graphene Oxide is in fact present in these vaccines. But the manufacturers, medicine regulators and so called Fact-Checkers have refuted these claims, most likely due to the known toxic effects it has on the body.\n\nFor instance, Reuters, which essentially supplies the news to the entire Western world without most people realising it, stated in a fact-check article published July 23rd 2021, that it is impossible for the Covid vaccines to contain Graphene Oxide because they would be either dark brown or black in colour, instead of the clear/yellowish colour they are.\n\nBut what Reuter’s Fact Checkers failed to mention is that when Graphene Oxide is combined with other ingredients, such as Sucrose, a listed ingredient of the Pfizer Covid-19 vaccine, it’s perfectly possible to produce a clear or yellowish liquid.\n\nBut at the time of writing, Reuters did not have access to a document published in February 2023 by the U.S. Food & Drug Administration (FDA) by order of the U.S. Federal Court.\n\nA document that was submitted to the FDA by Pfizer to gain Emergency Use Authorization (EUA).\n\nA document that confirms it is perfectly possible for toxic Graphene Oxide to end up in the Covid-19 vaccines due to the manufacturing process.\n\nThe Pfizer Covid-19 vaccine is an injection that contains genetic material called mRNA that invades the cells in your body and instructs them to produce the Spike (S) protein allegedly found on the surface of the SARS-CoV-2 virus.\n\nIt is a highly complex “vaccine” that involves a multi-step manufacturing process that includes the production and purification of messenger RNA (mRNA) molecules and the formulation and packaging of the vaccine.\n\nAnd according to Pfizer, it is required during the manufacturing process of its Covid-19 vaccine. But we only know this thanks to a U.S. Federal Court Judge ordering the U.S. Food & Drug Administration (FDA) to publish all the documents that Pfizer submitted to gain Emergency Use Authorization.\n\nFor those who don’t know, the Covid-19 injections had not completed phase 3 and 4 trials, so could not be fully approved in December 2020. Instead, they had to be authorized for emergency use only. This is why it’s criminal that they extended the EUA to children, considering they are at little to no risk of suffering anything more severe than the common cold if infected with the alleged SARS-CoV-2 virus.\n\nIf the Federal Court Judge had not forced the FDA to publish the documents, they wouldn’t have seen the light of day for 75 years. Because this is the length of time the FDA requested they be given to publish the documents under the Freedom of Information Act.\n\nHowever, a group of scientists and medical researchers sued the FDA to force the release of hundreds of thousands of documents related to the Emergency Use Authorization of the Pfizer-BioNTech Covid-19 vaccine.\n\nAnd in early January 2022, Federal Judge Mark Pittman ordered the FDA to release 55,000 pages per month, and since then, PHMPT has posted all of the documents on its website as they have been published.\n\nSadly, one of the most recent documents published by the FDA, saved as 125742_S1_M4_4.2.1 vr vtr 10741.pdf, confirms the use of Graphene Oxide in the manufacturing process of the Pfizer Covid-19 vaccine. Proving that medicine regulators the mainstream media, Fact Checkers and Pfizer have all been lying to you.\n\nThe document is a description of a study carried out by Pfizer between April 7th 2020 and 19th August 2020, with the objective being “to express and characterize the vaccine antigen encoded by BNT162b2.”\n\nIn layman’s terms, the study was conducted to determine how the vaccine works. The study found that the vaccine used mRNA to instruct your cells to produce a protein (called P2 S), which is the Spike protein of the alleged Covd-19 virus.\n\nThe millions of spike proteins then bind to a receptor called ACE2 on the surface of your cells, inducing an immune system response.\n\nBut what is most concerning about the study is the confirmation on page 7 that Graphene Oxide is required to manufacture the Pfizer Covid-19 vaccine.\n\nPfizer states on page 7 of the study in section 3.4 the following –\n\nTherefore, during the manufacturing process, several factors could potentially introduce contaminants or foreign materials into the vaccine. This obviously includes the possibility of varying amounts of Graphene Oxide (GO) entering the final product.\n\nOne potential source of Graphene Oxide contamination could be the use of raw materials or reagents that contain the toxic substance or other graphene-based materials.\n\nFor example, if one of the reagents used in the manufacturing process contains Graphene Oxide as a contaminant, this could potentially introduce Graphene Oxide into the vaccine.\n\nSimilarly, if the equipment used in the manufacturing process is not properly cleaned or validated, this could lead to Graphene Oxide contamination of the vaccine.\n\nAnother potential source of Graphene Oxide contamination could be through the use of filters or other materials used to sterilize or purify the vaccine.\n\nWhile these materials are designed to remove contaminants and foreign materials, they could potentially introduce Graphene Oxide into the vaccine if they are not properly designed or validated.\n\nIn October 2021, The Expose team published an investigation of data found in the USA’s Vaccine Adverse Event Reporting System (VAERS). We found that extremely high numbers of adverse reactions and deaths have been reported against specific lot numbers of the Covid-19 vaccines several times.\n\nAt the time, as you can see from the above chart, just 4% of the batches of Pfizer Covid-19 vaccine produced were responsible for every single death reported to the CDC as being due to Pfizer Covid-19 vaccination.\n\nCould it be that these batches of the Pfizer vaccine had a yellowish colour and therefore a higher concentration of Graphene Oxide?\n\nBecause just a few months prior, Reuters published a fact check that claimed the Covid-19 vaccines do not contain Graphene Oxide, and provided the following explanation as to why –\n\nBut Reuters “forgot” to mention something important about sucrose and how its presence in the Pfizer vaccine could result in a transparent or slightly yellowish liquid when combined with Graphene Oxide.\n\nSucrose is a type of sugar that is commonly used in food and pharmaceutical products as a stabilizer and preservative. In the Pfizer-BioNTech COVID-19 vaccine, sucrose allegedly helps to maintain the stability and efficacy of the mRNA molecules in the vaccine.\n\nWhen mixed with Graphene Oxide it can produce a transparent or yellowish liquid depending on the amount of Graphene Oxide present.\n\nBut it’s also possible that other officially listed ingredients of the Pfizer vaccine – lipids, potassium chloride, monobasic potassium phosphate, sodium chloride, dibasic sodium phosphate dihydrate – could produce a transparent/yellowish liquid when combined with Grahene Oxide.\n\nIt all depends on on the concentration of Graphene Oxide and the interactions between the different components.\n\nThis is a concerning fact considering many mainstream news sources in the UK and USA rely on Reuters for their news content.\n\nSome of the major news sources in the UK that use Reuters content include the BBC, The Guardian, The Times, The Daily Telegraph, and The Independent.\n\nMeanwhile in the USA, Reuters content is used by many news outlets, including CNN, ABC News, NBC News, CBS News, Fox News, The New York Times, The Washington Post, and The Wall Street Journal.\n\nThis proves that Reuters essentially have a monopoly on the mainstream news in the West, and we’ve just proven that they are quite happy to lie to you.\n\nBut for anyone who has chosen to get the Covid-19 vaccine, or not for that matter, the fact the mainstream media lie to you should be the least of your worries.\n\nBecause there have been several studies that have shown that Graphene Oxide (GO) can be taken up by cells and tissues in the body, and there is a major concern that it may accumulate in certain organs or tissues over time.\n\nHere are just a few examples of such studies:\n• In a study published in the journal Nature Nanotechnology in 2014, researchers injected mice with GO and found that it accumulated in the lungs, liver, and spleen. The study also found that the accumulation of GO caused damage to the mice’s lungs and immune systems.\n• In another study published in the journal ACS Nano in 2016, r esearchers exposed human lung cells to GO and found that the GO was taken up by blood cells and caused oxidative stress and inflammation.\n• A r eview article published in the journal Nano Today in 2017 summarized the findings of several studies on the toxicity of GO. The article noted that GO can be taken up by cells and tissues in the body and has been shown to accumulate in the lungs, liver, spleen, and kidneys. The article also noted that the toxicity of GO appears to be dependent on several factors, including the size, shape, and surface chemistry of the Graphene Oxide.\n\nThe study published in the journal ACD Nano in 2016 is of particular concern when we look at the findings of a study conducted by Dr. Philippe van Welbergen of the mRNA Covid-19 vaccines in which he concluded Graphene Oxide was being transmitted from the COVID vaccinated to the unvaccinated, destroying red blood cells & causing strange blood Clots.\n\nAt the beginning of July 2021, Dr. Philippe, was interviewed on a South African community channel, Loving Life TV. He explained that when his patients started complaining about chronic fatigue, dizziness, memory issues, even sometimes paralysis and late onset of heavy menstruation (women in their 60s upwards), he took blood samples.\n\nTheir blood had unusual tube-like structures, some particles which lit up and many damaged cells. Few healthy cells were visible. Until three months earlier, he had never seen these formations in blood. We now know these tube-like structures are graphene.\n\nSince then, Dr. Philippe has been a regular guest on Loving Life TV: blowing the whistle on the experimental Covid injection roll-out; providing updates on the increasing damage being done to blood by the experimental Covid injections over time; and, giving updates on the Covid situation in the UK and South Africa.\n\nOn 12 February 2022, Dr. Philippe returned again to Loving Life TV to release images of his latest slides of blood samples. The live stream was lengthy so Loving Life TV separated it into two parts.\n\nPart One is a discussion including answers to the audience’s questions.\n\nIn Part Two, Dr. Philippe presents the images of his latest blood slides and explains what the images are showing. He discusses nearly 100 blood slides from both “vaccinated” and vaccine-free patients. His slides show that vaccine-free patients have been “infected with vaccine toxins through shedding.”\n\nBelow is a short clip from Part Two courtesy of The Timeline Post channel on Telegram.\n\nBelow is an image of typical healthy red blood cells as seen with a microscope, what blood should look like. There is no coagulation or foreign objects in it.\n\nThe next image is of a person who has been injected with the experimental Covid drug. The blood is coagulated, the misshapen red blood cells are clumped together. The cell encircled in the image is a healthy red blood cell, one of the few in the image, sitting alongside the graphene fibres. You can see the size of the graphene fibres in relation to the size of a red blood cell. Fibres of this size will block capillaries. You can also see the graphene fibres are hollow and contain red blood cells.\n\nA couple of weeks before the video below was made, Dr. Philippe began noticing a magnetic or electrical polarity effect on different sides of the graphene fibres. In the image below, to the right of the fibre the cells are coagulated and on the left-hand side is what looks like a gap or roughly backwards “C” shaped spacing. Dr. Philippe says that this “behaviour” was not seen before but now, all of a sudden, it is being seen in almost every sample. It is an indication that “these things have changed, their reaction with surrounding blood cells has changed … and I don’t know what triggered it,” he said.\n\nThe image below is of a blood sample from a vaccine-free, or unvaccinated, three-year-old child. It shows pieces or “shards” of graphene that “are the result of shedding,” in other words the graphene has been transmitted from “vaccinated” parents to their unvaccinated child.\n\nBelow is the image of a blood sample from an eight-year-old unvaccinated child whose blood has been contaminated and destroyed by the transmission of graphene from those around him/her who have had a Covid injection. The child’s right arm and upper right leg are basically paralysed, the child is unable to lift his/her right arm and the thigh is not functioning properly.\n\nDr. Philippe’s presentation is truly eye opening and horrifying – a must watch, especially for those who proclaim Covid injections are “safe” and continue to insist people should “get vaccinated”.\n\nBecause it is evidence the mRNA Covid-19 vaccines not only contain Graphene Oxide, but that the Graphene Oxide is also being transmitted from the COVID vaccinated to the unvaccinated, destroying red blood cells & causing strange blood Clots in both.\n\nIn conclusion, we have now proven that Graphene Oxide makes its way into the Covid-19 injections through the manufacturing process.\n\nWe have also proven that the Covid-19 vaccine manufacturers, medicine regulators, mainstream media, and so-called Fact-Checkers have continuously lied to you.\n\nAnd we have, unfortunately, proven that Graphene Oxide is toxic to humans and is shed from the Covid vaccinated to the unvaccinated.\n\nIn the wake of these shocking revelations, you may now find yourself grappling with a crisis of trust.\n\nThe once-respected medical institutions and manufacturers, who have been entrusted with safeguarding public health, now stand exposed for concealing the truth about the presence of Graphene Oxide in the Covid-19 vaccines.\n\nThe full consequences of this deception are yet to be known, but it will most definitely force more individuals to question not only the safety of the vaccines, but also the very institutions they have long relied upon.\n\nIf the truth of the confidential Pfizer document published by the FDA by order of the U.S. Federal Court, spreads like wildfire, millions around the globe might finally demand accountability and justice for those who have suffered the toxic effects of Graphene Oxide since the Covid-19 injections were granted Emergency Use Authorization.", "opengraph": {"type": "article", "title": "BREAKING: Secret Documents published by order of the U.S. Federal Court prove Pfizer, the FDA & Fact Checkers lied when they said Toxic Graphene Oxide was not inside the Covid-19 Vaccines", "url": "https://expose-news.com/2023/04/09/pfizer-fda-lied-graphene-oxide-is-inside-covid-vaccines/", "description": "Graphene Oxide is a fairly new substance not yet well understood. But what we do know is that studies have proven it can be toxic to cells and tissues in the body. And further studies have shown Gr…", "article:published_time": "2023-04-09T05:59:00+00:00", "article:modified_time": "2023-04-08T17:15:07+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/04/graohene-lies.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.reuters.com/article/factcheck-grapheneoxide-vaccine/fact-check-covid-19-vaccines-do-not-contain-graphene-oxide-idUSL1N2OZ14F", "https://phmpt.org/pfizers-documents/", "https://phmpt.org/wp-content/uploads/2023/02/125742_S1_M4_4.2.1-vr-vtr-10741.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/04/image-12.png?ssl=1", "https://phmpt.org/wp-content/uploads/2023/02/125742_S1_M4_4.2.1-vr-vtr-10741.pdf", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/04/image-13.png?ssl=1", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://www.reuters.com/article/factcheck-grapheneoxide-vaccine/fact-check-covid-19-vaccines-do-not-contain-graphene-oxide-idUSL1N2OZ14F", "https://www.reuters.com/article/factcheck-grapheneoxide-vaccine/fact-check-covid-19-vaccines-do-not-contain-graphene-oxide-idUSL1N2OZ14F", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1764161/", "https://pubmed.ncbi.nlm.nih.gov/28000740/", "https://pubmed.ncbi.nlm.nih.gov/28161457/", "https://expose-news.com/2021/08/31/german-doctors-and-lawyers-assess-blood-smears-from-people-who-have-had-covid-injections-for-me-this-is-euthanasia-for-me-this-is-mass-murder-a-crime-on-a-grand-scale/", "https://lovinglifetv.com/?s=Philippe", "https://lovinglifetv.com/live-the-death-zone-science-101-blood-slides-and-the-experimental-drug-presented-by-dr-philippe/", "https://lovinglifetv.com/dr-philippe-part-one-the-talk/", "https://lovinglifetv.com/dr-philippe-part-two-the-blood-slides-12-february-2022/", "https://t.me/The_Timeline_Post/2754", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-04-09T05:59:00+00:00"}