{"result_id": "288002", "URL": "https://expose-news.com/2023/03/24/the-fatal-shot-covid-vaccine-deaths/", "timestamp": "2023-04-25 17:17:55 CEST+0200", "meta": {"description": "Medicine Regulators have already admitted that COVID vaccination can cause damage to the heart muscle and lead to cardiovascular complications such as heart failure, myocarditis, or pericarditis. But what they failed to tell the public in December 2020, is that scientists proved the spike protein, of which the Covid-19 vaccines instructs your cells to manufacture…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/expose-news.com/wp-content/uploads/2021/09/cropped-FAV.jpg?fit=32%2C32&ssl=1", "canonical": "https://expose-news.com/2023/03/24/the-fatal-shot-covid-vaccine-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "expose-news.com", "title": "The Fatal Shot: Why the COVID Vaccine caused a Public Health Catastrophe and Millions of Excess Deaths", "cleaned_text": "Medicine Regulators have already admitted that COVID vaccination can cause damage to the heart muscle and lead to cardiovascular complications such as heart failure, myocarditis, or pericarditis.\n\nBut what they failed to tell the public in December 2020, is that scientists proved the spike protein, of which the Covid-19 vaccines instructs your cells to manufacture millions of, crosses the blood-brain barrier with potentially devastating consequences such as the potential to cause strokes, Alzheimer’s disease, Parkinson’s disease, Multiple Sclerosis, and a range of autoimmune disorders.\n\nWhile mRNA vaccines have been in development for years, they had never been used on a large scale in the general population prior to December 2020, when the Pfizer-BioNTech and Moderna COVID-19 vaccines were granted emergency use authorization by regulatory agencies.\n\nThis is in contrast to traditional vaccines, which typically use a weakened or inactivated form of a virus to trigger an immune response. Traditional vaccines have been used for many decades and have an alleged long track record of safety and efficacy.\n\nThe main factor that contributed to the delayed use of mRNA vaccines on a large scale prior to December 2020 is the risk of antibody-dependent enhancement (ADE).\n\nADE is a phenomenon where a previous infection or vaccination can lead to a more severe form of the disease upon subsequent exposure. In the case of COVID-19, there were concerns that vaccination with an mRNA vaccine could trigger ADE and make the disease worse in people who were vaccinated.\n\nDespite this, the Pfizer-BioNTech COVID-19 vaccine, an mRNA injection that is supposedly designed to provide protection against the alleged SARS-CoV-2 virus, which causes COVID-19, was granted Emergency Use Authorisation (EUA) in early December 2020.\n\nThe injection works by using a small piece of the alleged virus’s genetic material, known as messenger RNA (mRNA), which instructs cells in your body to produce a piece of the virus called the spike (S) protein.\n\nThe spike protein then triggers an immune response, which teaches the immune system to recognize and fight the alleged virus if a person is later exposed to it.\n\nHowever, just days after the Pfizer vaccine was granted Emergency Use Authorisation, several scientists published a study, on the 16th of December 2020, proving the S protein of SARS-CoV-2 crosses the blood-brain barrier in mice.\n\nThis is the very same protein that the Covid-19 injections instruct your cells to produce in the millions.\n\nThe potential consequences of this are devastating.\n\nHere is a detailed explanation of the possible neurological and autoimmune complications that could result from the spike protein, produced by your cells following Covid-19 vaccination, crossing the blood-brain barrier in humans –\n• Neuroinflammation: The immune response triggered by the spike protein in the brain could potentially cause inflammation and damage to brain tissue. This can lead to a range of neurological symptoms and complications, including:\n• Headache: A common symptom of neuroinflammation, headaches can range from mild to severe and can last for hours or days.\n• Dizziness: Neuroinflammation can also cause dizziness or vertigo, which is the sensation of spinning or feeling off-balance.\n• Confusion: In more severe cases, neuroinflammation can cause confusion or disorientation, making it difficult to think clearly or make decisions.\n• Seizures: Neuroinflammation can sometimes trigger seizures, which are sudden, uncontrolled electrical disturbances in the brain that can cause convulsions or loss of consciousness.\n• Cerebrovascular disease: The spike protein could potentially cause damage to blood vessels in the brain, leading to a range of cerebrovascular diseases such as:\n• Stroke: A stroke occurs when blood flow to the brain is blocked or reduced, causing brain damage and potentially permanent neurological complications.\n• Aneurysm: An aneurysm is a bulge or weakening in a blood vessel that can potentially rupture, causing a stroke or other complications.\n• Haemorrhage: A haemorrhage occurs when a blood vessel in the brain ruptures, causing bleeding and potentially life-threatening complications.\n• Neurodegenerative diseases: Prolonged exposure to the spike protein due to getting multiple Covid-19 injections could potentially lead to the development of neurodegenerative diseases such as:\n• Alzheimer’s disease: A progressive brain disorder that affects memory, thinking, and behaviour, and is the most common cause of dementia in older adults.\n• Parkinson’s disease: A progressive brain disorder that affects movement, causing tremors, stiffness, and difficulty with coordination and balance.\n• Multiple sclerosis: A chronic autoimmune disease that affects the central nervous system, causing inflammation and damage to the myelin sheath that surrounds and protects nerve fibres.\n• Autoimmune disorders: The immune response triggered by the spike protein could potentially cause autoimmune disorders, in which the immune system attacks healthy cells and tissues in the body. This can lead to a range of autoimmune disorders, including:\n• Lupus: A chronic autoimmune disease that can affect multiple organs and tissues in the body, causing inflammation, pain, and damage to the skin, joints, and other organs.\n• Rheumatoid arthritis: A chronic autoimmune disease that primarily affects the joints, causing inflammation, pain, and damage to the cartilage and bones.\n• Guillain-Barré syndrome: A rare autoimmune disorder that affects the nerves, causing muscle weakness, tingling, and potentially life-threatening complications such as respiratory failure.\n\nSo now that we know this, we have several reasons that may explain why official UK Government data proves mortality rates per 100,000 are lowest among the unvaccinated in every single age group.\n\nAccording to the Office for National Statistics, England and Wales suffered the highest number of excess deaths in over half a century in 2022. With a non-stop weekly rally of excess deaths since week 16 of 2022 equating to 62,543 excess deaths as of March 2023.\n\nDriven by their ambition and a belief that they will not be held accountable for their actions, mainstream media reporters made the decision to conceal the truth surrounding this from the public. Possibly due to being instructed to by the Government.\n\nThey thought the British public would be too lazy to “mark their homework,” so to speak.\n\nBut they didn’t count on an independent news organisation, committed to reporting the facts that the mainstream media refuse to, fact-checking their quietly published article.\n\nThe BBC, the widely but most definitely unjustly trusted news source/propaganda arm of the UK government, and its reporters have knowingly lied about the safety of the Covid-19 vaccine and lied to the public.\n\nThey unequivocally stated that the Covid-19 vaccine was not responsible for a record-breaking year of death, providing a “source” to prove it. They claimed that figures up to June 2022, looking at deaths from all causes, showed unvaccinated people were more likely to die than vaccinated people.\n\nBBC News then went on to state that –\n\nThe problem for BBC News is that ‘The Expose’ has been analyzing the source provided by a UK government institution known as the Office for National Statistics (ONS) for months on end.\n\nAnd we can reveal that mortality rates per 100,000 in every single age group, even children, in England and Wales were lowest among the unvaccinated in some age groups as early as 2021, and lowest among the unvaccinated in all age groups by May 2022 at the latest.\n\nThe overdue updated report, finally published towards the end of February 2023, also confirms the unvaccinated had the lowest mortality rate per 100,000 throughout the whole of 2022.\n\nTherefore, BBC News has not only lied to the public, but has also admitted in black and white that the Covid-19 injections are to blame for 2022 being the worst year for deaths in half a century by confirming –\n\nThe moral of this story is always to check the official source, specifically table 2 in this case –\n\nAnd table 1 in the most recent, overdue report –\n\nAs you can see from the above, the mortality rate per 100,00 among the unvaccinated remained at pretty much the same level throughout the entirety of 2022, with no major increases, or dips.\n\nBut what’s concerning is the fact that the unvaccinated mortality rate was lower than the one dose vaccinated and two dose vaccinated for the entire year. And the 3+ dose vaccinated for 8 months of the year.\n\nHowever, if it were not for the fact the 3 dose + data includes those who have also had a fourth, or even fifth dose, we fully believe that the mortality rate would still be higher than the unvaccinated mortality rate for the entire year.\n\nBecause as you can see from the above chart, the fall is far too dramatic, and it coincides with the rollout of the Autumn 2022 Booster campaign as confirmed in a press release published by the JCVI –\n\nThis means the data for mortality rates on those who had 3 doses after Spring 2022 is unreliable because it includes a small portion of people who had a fourth dose in Spring and an even smaller portion of people who had a fifth dose in the Autumn.\n\nYou cannot trust the BBC.\n\nThe UK Government has clearly confirmed that mortality rates per 100,000 were highest among the vaccinated in every single age group throughout 2022\n\nThis means that people who have taken the Covid-19 vaccine have a higher chance of dying than the general population due to the intense damage it can do to the two most vital organs in the human body, the heart and the brain, and the devastating decimation it does to the natural immune system.\n\nAnd scientists, Governments and Medicine Regulators knew all about this potential consequence at the very same time COVID-19 vaccines were granted emergency use authorization by regulatory agencies, thanks to a study published on the 16th of December 2020, proving the S protein of SARS-CoV-2 crosses the blood-brain barrier in mice. And it was the first study published to prove this of many.\n\nSo in effect, the past few years have all been a huge lie. And you have been tricked into taking part in an experiment that has killed millions through Midazolam/Remdesivir poisoning and Covid-19 vaccination.\n\nThe evidence to prove that claim can all be found here.\n\nAnd secret reports from the Governments of the USA, Canada, Australia, New Zealand, the UK and most of Europe have raised further alarm bells because they confirm that approximately 20 million deaths have been recorded resulting in 2 million excess deaths since Pfizer lied enabling the mass roll-out of the Covid-19 injections.\n\nOfficial figures provided to EuroMOMO by the UK Government and 26 other Governments of counties across Europe reveal that most of the continent suffered 375,253 excess deaths in 2021 and 404,6000 excess deaths in 2022.\n\nThis equates to 779,853 excess deaths over the two years. The figures do not include Ukraine so cannot be blamed on the ongoing war.\n\nAustralia suffered 11,068 excess deaths in 2021 and then a shocking 22,730 excess deaths by week 38 of 2022. This is in stark contrast to the year 2020, when only 1,306 excess deaths were recorded at the height of the Covid pandemic and prior to the rollout of the Covid injections.\n\nThis means Australia suffered a shocking 1,640% increase in excess deaths in just 39 weeks throughout 2022 compared to 53 weeks throughout 2020.\n\nYou can read much more about that here.\n\nBut the figures have been provided to both the Organisation for Economic Co-Operation and Development (OECD) and EuroMOMO by each country’s Government organisations. The U.S. data has been provided by the Centers for Disease Control. The UK data has been provided by the Office for National Statistics. And Australia’s data has been provided by the Australian Bureau of Statistics etc.\n\nSo these aren’t independent estimates. They are official Government-authorized figures. And they show that the ‘Five Eyes’ countries and 26 other countries across Europe have suffered 1.99 million excess deaths since the Covid-19 injections were first granted emergency use authorisation.\n\nAnd the millions of deaths would most likely have been avoided if the Establishment had not persisted in continuing to roll out a “vaccine” that instructs your cells to manufacture millions of dangerous spike proteins that cross the blood-brain barrier.\n\nResulting in neuroinflammation, cerebrovascular disease, neurodegenerative diseases, autoimmune diseases and a whole host of other unknown ailments.\n\nThe evidence is clear. Since 2020, the ordinary public has been unknowingly taking part in the largest experiment ever conducted on Humanity, and it has resulted in the loss of millions of lives as well as injuring millions more.", "opengraph": {"type": "article", "title": "The Fatal Shot: Why the COVID Vaccine caused a Public Health Catastrophe and Millions of Excess Deaths", "url": "https://expose-news.com/2023/03/24/the-fatal-shot-covid-vaccine-deaths/", "description": "Medicine Regulators have already admitted that COVID vaccination can cause damage to the heart muscle and lead to cardiovascular complications such as heart failure, myocarditis, or pericarditis. B…", "article:published_time": "2023-03-24T06:59:00+00:00", "article:modified_time": "2023-03-23T20:44:48+00:00", "site_name": "The Expose", "image": "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/fatal-shot.png?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["#", "https://www.nature.com/articles/s41593-020-00771-8", "https://www.nature.com/articles/s41593-020-00771-8", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.bbc.co.uk/news/health-64209221", "https://www.bbc.co.uk/news/health-64209221", "https://www.bbc.co.uk/news/health-64209221", "https://www.ons.gov.uk/file?uri=/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland/deathsoccurringbetween1january2021and31may2022/referencetable06072022accessible.xlsx", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-92.png?ssl=1", "https://expose-news.com/2022/08/09/mortality-rates-lowest-among-unvacinated/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.gov.uk/government/news/jcvi-advises-an-autumn-covid-19-vaccine-booster", "https://www.gov.uk/government/news/jcvi-advises-an-autumn-covid-19-vaccine-booster", "https://www.nature.com/articles/s41593-020-00771-8", "https://expose-news.com/2023/03/18/murder-by-midazolam-and-covid-vaccination/", "https://expose-news.com/2023/03/18/murder-by-midazolam-and-covid-vaccination/", "https://expose-news.com/2023/01/25/vaccine-genocide-pfizer-lied-20-million-died/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://expose-news.com/2023/01/25/vaccine-genocide-pfizer-lied-20-million-died/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/2023-april-fundraising-campaign/", "https://expose-news.com/2023/04/13/april-fundraising-campaign-2023/", "https://expose-news.com/asp-payment-box/?product_id=237456", "https://expose-news.com/asp-payment-box/?product_id=253886", "https://www.buymeacoffee.com/dailyexpose", "https://expose-news.com/donate-via-bank-transfer/", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "t.me/dailyexpose", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb", "https://expose-news.com/keep-up-with-the-expose/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/uks-emergency-alert-system-failed/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/leaked-new-zealand-health-data/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/covid-jabs-have-created-millions-of-zombies/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://expose-news.com/2023/04/25/75-percent-did-not-die-from-covid/", "https://t.me/dailyexpose"], "authors": [], "publish_date": "2023-03-24T06:59:00+00:00"}