{"result_id": "291040", "URL": "https://childrenshealthdefense.org/defender/bp-many-younger-us-women-flu-covid-vaccines-not-safe-pregnancy/", "timestamp": "2023-04-25 17:20:17 CEST+0200", "meta": {"description": "The Defender’s Big Pharma Watch delivers the latest headlines related to pharmaceutical companies and their products, including vaccines, drugs, and medical devices and treatments. The views expressed in the below excerpts from other news sources do not necessarily reflect the views of The Defender. Our goal is to provide readers with breaking news that affects human health and the environment.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/bp-many-younger-us-women-flu-covid-vaccines-not-safe-pregnancy/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Many Younger U.S. Women Say Flu, COVID Vaccines Not Safe in Pregnancy + More", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nSurvey: Many Younger U.S. Women Say Flu, COVID Vaccines Not Safe in Pregnancy\n\nMany U.S. women of childbearing age doubt the safety and effectiveness of vaccination against influenza and COVID-19 during pregnancy, according to a new report from the Annenberg Public Policy Center at the University of Pennsylvania.\n\nThe report, released early this week, includes the findings of the second Annenberg Science and Public Health Knowledge Monitor, a randomly drawn, online, national survey fielded by the SSRS Opinion Panel in 10 waves starting in April 2021, the most recent of which included 1,657 adults in January 2023.\n\nMost women ages 18 to 49 years (53%) indicated that flu vaccine is safe for women and their fetuses during pregnancy, and 17% said it isn’t, compared with 9% of men and 4% of women aged 50 and older. Skepticism was even more evident in the COVID-19 vaccine findings: 42% of women of childbearing age said the vaccine is safe and effective during pregnancy, but 31% said that it isn’t, compared with 15% of older women and 19% of men.\n\nRepublican Kentucky Rep. Thomas Massie sent letters Monday to senior Food and Drug Administration (FDA) vaccine officials, letting them know the House Judiciary Committee will be investigating allegations the Biden administration interfered in the FDA’s authorization and licensure of the COVID-19 vaccines.\n\nThe Daily Caller first obtained the letters to Dr. Marion Gruber and Dr. Philip Krause, both of whom resigned following President Joe Biden’s announcement in August 2021 calling for adults to receive a COVID-19 booster shot, which Massie says “put undue pressure on FDA health officials to quickly authorize the vaccinations.”\n\nIn the letters, Massie calls for records and materials relating to: 1. the FDA’s review, authorization, approval and/or promotion of all COVID-19 vaccines and boosters; 2. the departure of Dr. Marion Gruber and Dr. Philip Krause from the FDA’s Office of Vaccines Research and Review (OVRR); and 3. the identities of current or former employees who worked in the FDA’s OVRR for the period of Jan. 1, 2020, to the present.\n\nVaccines for Lyme Disease and Norovirus? Moderna Working on Shots Targeting Tick-Borne Infection and Vomiting Bug\n\nModerna on Tuesday unveiled plans to develop vaccines against tick-borne Lyme disease and norovirus, a notorious stomach bug, the Massachusetts-based biotech’s latest efforts to bolster its pipeline and expand its offerings ahead of a steep drop in demand for its COVID-19 vaccines.\n\nModerna said it is developing multiple vaccines targeting Lyme disease, a serious infection spread by tick bites that can cause a range of symptoms including fever, facial paralysis, arthritis and rash.\n\nVaccinating against bacterial infections like Lyme is generally more complicated than protecting against viral infections like COVID, and the effort marks the first time Moderna has applied its mRNA technology to bacterial threats.\n\nModerna also announced plans to develop mRNA vaccines targeting norovirus, which is highly contagious and the leading cause of diarrheal disease globally.\n\nModerna Says It Expects up to $15 Billion in Sales of COVID, RSV, Flu Vaccines in 2027\n\nModerna on Tuesday said it expects to see between $8 billion and $15 billion in sales from its COVID, RSV, flu and other respiratory vaccines in 2027.\n\nThe biotech company said it sees a corresponding operating profit in the range of $4 billion to $9 billion. Those respiratory product estimates are supported by additional research investments of $6 billion to $8 billion “over the next few years,” Moderna added.\n\nThe new 2027 guidance “represents an upside to the low profitability expected this year given the smaller” COVID market, Jefferies Analyst Michael Yee wrote in a Tuesday note.\n\nModerna said its experimental RSV vaccine is among the “big three” respiratory products that will contribute to the company’s lofty 2027 guidance.\n\nFeds Launch Criminal Investigation Into ‘AGGA’ Dental Device and Its Inventor\n\nFederal prosecutors have launched a criminal investigation into the Anterior Growth Guidance Appliance, or “AGGA” dental device, following a recent KFF Health News-CBS News investigation, according to a motion filed in federal court.\n\nMultiple lawsuits allege the device has caused grievous harm to at least 20 patients and the FDA is now investigating its safety, KFF Health News and CBS News have reported.\n\nThe AGGA is a retainer-like device promoted by some dentists as an option for expanding adult patients’ jawbones, beautifying their faces, and curing common ailments like sleep apnea. The lawsuits have alleged patients suffered damaged gums, eroded bone, and, in some cases, lost teeth.\n\nThe criminal investigation of the use of the AGGA was revealed in a court motion that seeks to delay the largest of the lawsuits “pending the outcome of any criminal proceedings.”\n\nThe motion was filed this month by attorneys for AGGA inventor Dr. Steve Galella, his company, the Facial Beauty Institute, and AGGA manufacturer Johns Dental Laboratories, who said the investigation is being conducted “for the purpose of potentially bringing criminal charges” against their clients.\n\n​​A U.S. appeals court handed Moderna Inc. (MRNA.O) a win on Tuesday, affirming a decision to cancel an Arbutus Biopharma Corp (ABUS.O) patent related to the companies’ legal fight over Moderna’s blockbuster COVID-19 vaccines.\n\nThe U.S. Court of Appeals for the Federal Circuit upheld a U.S. Patent and Trademark Office tribunal’s ruling that the patent for Arbutus’ lipid nanoparticle (LNP) technology was invalid based on an earlier Arbutus patent that disclosed the same invention.\n\nThe Federal Circuit’s decision does not affect an ongoing lawsuit filed by Arbutus and Genevant Sciences — a joint venture between Arbutus and Roivant Sciences Ltd (ROIV.O) — against Moderna last year in Delaware for allegedly infringing other related LNP patents.\n\nArbutus separately sued Pfizer and BioNTech for patent infringement last week over their COVID-19 shots, in a lawsuit that also does not include the canceled patent.\n\nA Pennsylvania woman indicates she was left with permanent hearing loss caused by Tepezza infusions administered to treat thyroid eye disease, according to a product liability lawsuit recently filed against the drug maker.\n\nThe complaint was brought last week by Deborah Welch Klostermann in the U.S. District Court for the Northern District of Illinois, pursuing damages against Horizon Therapeutics USA, Inc., for failing to adequately warn about the potential side effects following Tepezza infusions.\n\nTepezza (teprotumumab-trbw) is a new-generation biologic treatment, which was introduced in January 2020 as the first medication approved to treat thyroid eye disease or bulging eyes, which is caused by hyperthyroidism and linked to Graves’ disease, resulting in inflammation of eye muscles, eyelids, tear glands and fatty tissues behind the eye.\n\nAlthough Tepezza was originally intended as a niche treatment, with only a limited market, during the second year the drug was on the market in the United States sales doubled to $1.66 billion, and critics have expressed concern that Tepezza was aggressively marketed without adequately disclosing all of the potential risks.\n\nHundreds of former users are now coming forward to report that Tepezza infusions caused hearing loss or ringing in the ears, known as tinnitus, with many of the problems persisting long after last use of the medication.\n\nU.S. Pauses New Patients on Merck MS Drug in Blow to Shares\n\nMerck KGaA (MRCG.DE) said on Wednesday the U.S. Food and Drug Administration (FDA) had paused the initiation of new patients on its multiple sclerosis evobrutinib drug, knocking the German drugmaker’s share price.\n\nMerck has been ahead in the race to develop a drug from the class known as Bruton’s tyrosine kinase (BTK) inhibitors to slow the progression of nerve disease multiple sclerosis. But tolerability of the class has been a big concern for analysts.\n\nThe FDA’s decision, Merck said, was in response to laboratory results that suggested drug-induced liver injury during phase III studies. The two cases identified had been asymptomatic and the patients’ liver enzymes had fully normalized after discontinuation of the study medication.\n\nA trial testing Sanofi‘s (SASY.PA) rival candidate tolebrutinib — from the $3.7 billion takeover of Principia Biopharma in 2020 — was put on partial hold by the FDA in June 2022 on concerns over harmful effects on the liver. That meant the recruitment of new participants was stopped.", "opengraph": {"locale": "en_US", "type": "article", "title": "Many Younger U.S. Women Say Flu, COVID Vaccines Not Safe in Pregnancy + More", "description": "The Defender’s Big Pharma Watch delivers the latest headlines related to pharmaceutical companies and their products, including vaccines, drugs, and medical devices and treatments. The views expressed in the below excerpts from other news sources do not necessarily reflect the views of The Defender. Our goal is to provide readers with breaking news that affects human health and the environment.", "url": "https://childrenshealthdefense.org/defender/bp-many-younger-us-women-flu-covid-vaccines-not-safe-pregnancy/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-04-12T19:54:15+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/big-pharma-watch-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.cidrap.umn.edu/covid-19/survey-many-younger-us-women-say-flu-covid-vaccines-not-safe-pregnancy", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://childrenshealthdefense.org/defender_category/covid", "https://cdn.annenbergpublicpolicycenter.org/wp-content/uploads/2023/04/ASAPH_Report_II_Spring_2023_web.pdf", "https://dailycaller.com/2023/04/11/massie-judiciary-committee-investigation-biden-fda-covid-boosters/", "https://childrenshealthdefense.org/defender/fda-robert-califf-combat-misinformation/", "https://childrenshealthdefense.org/defender/biden-covid-vaccine-mandate-fighting-back/", "https://childrenshealthdefense.org/defender_category/covid", "https://dailycaller.com/2021/08/31/fda-vaccine-officials-resign-covid-coronavirus-cdc-biden/", "https://childrenshealthdefense.org/defender/fda-advisers-bivalent-vaccine/", "https://www.forbes.com/sites/roberthart/2023/04/11/vaccines-for-lyme-disease-and-norovirus-moderna-working-on-shots-targeting-tick-borne-infection-and-vomiting-bug/?sh=2ad2fb862afe", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-vaers-data/", "https://investors.modernatx.com/news/news-details/2023/Moderna-Announces-Clinical-and-Program-Updates-at-4th-Vaccines-Day/default.aspx", "https://childrenshealthdefense.org/defender/pfizer-valneva-lyme-disease-vaccine-clinical-trial/", "https://childrenshealthdefense.org/defender_category/covid", "https://www.cdc.gov/lyme/signs_symptoms/index.html", "https://www.cnbc.com/2023/04/11/moderna-2027-covid-rsv-flu-shot-sales-guidance.html", "https://www.cnbc.com/quotes/MRNA/", "https://childrenshealthdefense.org/defender_category/covid", "https://childrenshealthdefense.org/defender/cdc-rsv-vaccine-fda-rare-immune-disorder/", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://kffhealthnews.org/news/article/agga-dental-device-federal-criminal-investigation/", "https://kffhealthnews.org/news/article/dental-device-lawsuits-displaced-teeth-agga-steve-galella/", "https://childrenshealthdefense.org/defender/fda-robert-califf-combat-misinformation/", "https://kffhealthnews.org/news/article/fda-safety-concern-evaluation-agga-dental-device-investigation/", "https://kffhealthnews.org/wp-content/uploads/sites/2/2023/04/AGGA-Lawsuit-Motion-for-Stay-Because-of-Criminal-Probe.pdf", "https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-fends-off-arbutus-appeal-covid-19-vaccine-patent-fight-2023-04-11/", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-vaers-data/", "https://www.reuters.com/companies/MRNA.O", "https://www.reuters.com/companies/ABUS.O", "https://childrenshealthdefense.org/defender_category/covid", "https://www.reuters.com/business/healthcare-pharmaceuticals/arbutus-files-patent-infringement-lawsuit-against-moderna-2022-02-28/", "https://www.reuters.com/companies/ROIV.O", "https://www.reuters.com/legal/arbutus-files-patent-infringement-lawsuit-against-pfizerbiontech-2023-04-04/", "https://childrenshealthdefense.org/defender/dedra-long-pfizer-covid-vaccine-injury/", "https://www.aboutlawsuits.com/tepezza/tepezza-infusions-hearing-loss-lawsuit/", "https://www.youhavealawyer.com/tepezza-lawsuit/", "https://www.aboutlawsuits.com/wp-content/uploads/2023-04-05-Complaint.pdf", "https://www.aboutlawsuits.com/tepezza/", "https://www.reuters.com/business/healthcare-pharmaceuticals/merck-shares-dive-after-us-pauses-new-patients-evobrutinib-2023-04-12/", "https://childrenshealthdefense.org/defender/merck-gardasil-hpv-vaccine-lawsuits-multidistrict-litigation/", "https://www.reuters.com/companies/MRCG.DE", "https://childrenshealthdefense.org/defender/fda-robert-califf-combat-misinformation/", "https://childrenshealthdefense.org/defender/rsv-emergency-vaccine-race-pfizer-gsk/", "https://www.reuters.com/companies/SASY.PA"], "authors": [], "publish_date": null}