{"result_id": "291014", "URL": "https://childrenshealthdefense.org/defender/pfizer-vaccination-ads-news-sponsorships-research/", "timestamp": "2023-04-25 17:19:42 CEST+0200", "meta": {"description": "By “sponsoring” mainstream television newscasts and information programs, Pfizer hopes to increase vaccination rates, but critics suggest another motivation — skewing news coverage in their favor.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/pfizer-vaccination-ads-news-sponsorships-research/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "‘Brought to You by Pfizer’: Pharma Giant Spends More on Ads, News Sponsorships, Than Research", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\n“Good Μorning America is brought to you by Pfizer.”\n\n“Anderson Cooper 360°, brought to you by Pfizer.”\n\n“ABC News Nightline, brought to you by Pfizer.”\n\n“CNN Tonight, brought to you by Pfizer.”\n\nThese are just some of the many recent examples where Pfizer has sponsored prominent television news and information programs on American television.\n\nShared by journalist Whitney Webb, these clips, at face value, are demonstrative of a company aggressively pursuing a marketing and public relations campaign by means of sponsoring popular news programs.\n\nBut is there more to it than mere marketing?\n\nIn a recent segment on his online talk show, commentator and comedian Jimmy Dore ran off a list of recent headlines published by CNBC.com, presenting Pfizer in a positive light. Dore capped the segment off by presenting a recent tweet posted on CNBC’s official Twitter account, again portraying Pfizer in glowing terms, accompanied by the text: “paid post for Pfizer.”\n\nDore quipped, “How much critical coverage do you think they’re going to give Pfizer? Pfizer’s literally paying their bills.”\n\nAs recently highlighted by the Wall Street Journal, Pfizer — and other pharmaceutical companies — have not restricted their sponsorship campaign to news show segments and paid tweets.\n\nFor instance, a recent skit delivered by late-night network television comedian Jimmy Kimmel about COVID mRNA vaccines was sponsored by Moderna.\n\nAnd a March 2021 tweet by Pfizer expressed pride in the release of a National Geographic documentary, “Mission Possible: The Race for a Vaccine.”\n\nEven in this author’s country of residence, Greece, the influence of such a sponsorship and media relations campaign is evident. The aforementioned CNBC tweet, paid for by Pfizer, touted the future possibilities promised by the mRNA vaccine technology, including curing cancer.\n\nJust two weeks later, the front page headline in a Sunday edition of Kathimerini, Greece’s newspaper of record, touted the forthcoming potential of mRNA vaccines to cure cancer. This piece was accompanied by an interview with Uğur Şahin, CEO of Pfizer’s partner in the production of its COVID vaccine, BioNTech.\n\nIt should also be noted that Pfizer’s CEO, Albert Bourla, hails from Greece.\n\nOn television at least, Pfizer’s sponsorships of news programs and advertising spots have, up until now, not mentioned its own COVID-19 vaccine by name.\n\nFor instance, one television ad produced by Pfizer features people spending time with their loved ones, while rhetorically asking the audience “Why will you get vaccinated?”\n\nAnother Pfizer advertisement shows a baby announcement, presented as a reason to get vaccinated.\n\nMany of these advertising campaigns began earlier in 2021, when the Pfizer-BioNTech vaccine was first rolled out. But many analysts in the advertising industry believe a bolstered marketing push will follow now that the U.S. Food and Drug Administration has granted full approval to a Pfizer COVID vaccine under the name Comirnaty.\n\nSome analysts do not see a clear short-term benefit for this marketing campaign. But Pfizer’s goal may be long-term in scope: If annual or semi-annual COVID boosters become a reality, Pfizer may be gearing up to place its name ahead of the competition.\n\nPfizer’s advertising push is evident in its most recent quarterly report, for the second quarter of 2021. The report indicates a 10% increase in “SI&A expenses,” which include marketing and advertising, for the first half of 2021, as compared to the same period in 2020, when there was no COVID-19 vaccine available.\n\nThis overall figure includes an increasingly important aspect of pharmaceutical advertising campaigns: social media.\n\nIn 2020, Pfizer spent $55 million on social media advertising. As of early May 2021, the drugmaker was on pace to exceed its 2020 expenditure, having already spent $21.5 million on social media advertising since the beginning of the year.\n\nOverall, according to the Kantar Group, digital ad spending by pharmaceutical companies jumped by 43% in 2020. In sum, pharmaceutical ad spending totaled $6.58 billion in 2020.\n\nIn 2020, Pfizer spent approximately $1.8 billion in advertising, down almost $600 million from its 2019 outlay ($1.9 billion). The year 2019 was itself a down year, as Pfizer had spent $2.28 billion on advertising in 2018, a year where the company was the highest-spending Big Pharma advertiser.\n\nGoing all the way back to 2009, Pfizer’s annual advertising expenditure was already in the $2 billion range.\n\nWhile much is made about the need to “follow the science,” it has been pointed out even before COVID came onto the scene that Big Pharma spends much more generously on its own advertising, as compared to research and development expenditures.\n\nA 2019 Forbes article, for instance, reported Pfizer was spending twice as much on selling than on research.\n\nWhy does U.S. allow Big Pharma ads?\n\nIn a global context, the U.S. is an anomaly when it comes to pharmaceutical advertising. The only other country where such advertising is permitted is New Zealand — a country that has become known for its draconian COVID-related lockdowns.\n\nPharma advertising was authorized in the U.S. by the FDA as far back as 1938, following the passage of the Federal Food, Drug, and Cosmetic Act. In 1962, Congress formally granted the FDA statutory authority to regulate prescription drug labeling and advertising.\n\nIn 1969, the FDA issued its final regulations for prescription drug advertising. These regulations state ads must not be false or misleading, must present a “fair balance” of information describing both the risks and benefits of a drug, must include facts that are “material” to the drug’s promoted uses, and must include a brief summary mentioning every risk described in the product’s labeling.\n\nSince then, the FDA has further relaxed its regulations, in 1995 and in 2004. This relaxation led to a boom in pharmaceutical advertising. And, as regulation has loosened, the number of enforcement actions taken by the FDA has also declined.\n\nIn the U.S., pharmaceutical marketing has typically taken the form of direct-to-consumer advertising, intended to promote prescription products directly to patients. This form of advertising can be broken down to three main subtypes: product claim ads, reminder ads and help-seeking ads.\n\nProduct-claim ads promote prescription drugs under their brand name. Under FDA regulations, drugmakers are required to list risks and side effects as clearly and prominently as the benefits of the drug.\n\nReminder ads name a drug, its dosage form and possibly its cost — but not its uses, which also means drugmakers are absolved from having to list the potential side effects and risks.\n\nThe third category, help-seeking ads, doesn’t recommend a specific drug, but instead is intended to raise awareness of a specific disease, or a vaccine or other cure. While such advertisements cannot mention any specific drug, they can incorporate logos or marketing symbols of pharmaceutical companies.\n\nProponents of pharmaceutical advertising point to the potential benefits of raising patient and public awareness, and promoting dialogue with doctors and medical providers, removing the stigma that may be associated with certain diseases, and encouraging competition and (in theory) lower prices.\n\nCritics argue however that such advertising misinforms patients, overemphasizes the benefits of such drugs, promotes new drugs before they have developed a proven safety record, encourages the overconsumption and overprescribing of pharmaceutical products, increases costs and is not regulated as rigorously as necessary.\n\nIndeed, there have often been calls to ban direct-to-consumer advertising. However, U.S. courts have consistently held that such advertisements are a form of “commercial speech,” protected under the First Amendment.\n\nMany of Pfizer’s recent vaccine-related advertisements and sponsorships appear to fall into the category of help-seeking ads. By not mentioning a specific product, but instead, more broadly raising awareness of vaccine availability — albeit with Pfizer’s name and/or logo featured prominently — Pfizer may expect to reap indirect benefits through increased vaccination rates and changing the minds of those who may be reluctant to be jabbed.\n\nBy “sponsoring” television newscasts and information programs, though, Pfizer (and other pharmaceutical companies) may also be intending to do more than merely increase vaccination rates: They may wish to influence news coverage by these media, skewing such coverage in their favor in any number of ways.\n\nMoreover, by not advertising their vaccines by name, Pfizer-BioNTech and other drugmakers are not obliged, under current regulations, to rattle off a list of potential side effects associated with the vaccine, which would certainly do those companies no favors in the face of widespread vaccine hesitancy and criticism.\n\nCue Jimmy Dore once more, from the same aforementioned segment: “We know that the media is horrible because they’re owned by the people they’re supposed to be investigating and exposing, right?”\n\nInvestigative reporter Jon Rappoport, who has written extensively on COVID-related matters since early 2020 and on the medical industry more broadly, told The Defender such phenomena are not new:\n\n“It should come as no surprise that a drug company is influencing the news. Pharmaceutical companies buy the news with their commercials, mainstream news outlets will report on individual drug scandals now and then, but they will never indict the whole industry. For years, I’ve been highlighting a devastating review published in the Journal of American Medical Association on July 26, 2000. Titled, “Is U.S. Health Really the Best in the World?”, it was authored by a revered public expert at the Johns Hopkins School of Public Health, Dr. Barbara Starfield. Starfield concluded that, every year in the U.S., the medical system kills 106,000 people as a result of the administration of FDA-approved drugs. That’s a million deaths per decade.\n\n“I interviewed Dr. Starfield in 2009, and she confirmed there was no comprehensive government program to fix this ongoing catastrophe. Have you ever seen a major news outlet cover the Starfield report or its implications? Of course not. Among other consequences, their drug company sponsors would suddenly pull out their money. The fix is in. It’s been in for a long time.”\n\nNot everyone has privileged access to the media\n\nWhile Pfizer has seemingly curried favor — and positive coverage — via its extensive advertisement and sponsorship campaign, the same cannot be said about those who have tried to use advertising to raise awareness about vaccine injuries.\n\nThe case of 13-year-old Maddie de Garay is one example. Having experienced severe symptoms following the administration of the second dose of the Pfizer-BioNTech vaccine in January, as part of de Garay’s participation in a vaccine trial, a 30-second advertisement was prepared by the Vaccine Safety Research Association, which was intended to raise awareness of her injuries and to coincide with the Oct. 26 meeting of the FDA advisory committee meeting to review Pfizer data on its COVID vaccine for children 5-11.\n\nThe advertisement was originally accepted for broadcast by Comcast, but at the last minute, the company’s attorneys pulled the ad. It had been slated to air during broadcast sof “Saturday Night Live” and “Meet the Press.”\n\nComcast provided no explanation for why the ad was rejected at the last minute, or why the same standards have apparently not been applied to pharmaceutical advertisements and sponsorships.\n\nNot only is Comcast a major cable television and telecommunications provider, but it is the parent company of NBCUniversal, which, in turn, is the parent company of NBC — and CNBC.", "opengraph": {"locale": "en_US", "type": "article", "title": "‘Brought to You by Pfizer’: Pharma Giant Spends More on Ads, News Sponsorships, Than Research", "description": "By “sponsoring” mainstream television newscasts and information programs, Pfizer hopes to increase vaccination rates, but critics suggest another motivation — skewing news coverage in their favor.", "url": "https://childrenshealthdefense.org/defender/pfizer-vaccination-ads-news-sponsorships-research/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2021-11-02T22:03:14+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/Todays-News-Pfizer-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Well, this is totally normal and not at all a conflict of interest <a href=\"https://t.co/4MKm0VozBC\">pic.twitter.com/4MKm0VozBC</a></p>\n<p>— Whitney Webb (@_whitneywebb) <a href=\"https://twitter.com/_whitneywebb/status/1450464402000556039?ref_src=twsrc%5Etfw\">October 19, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">After delivering the first COVID-19 vaccine, Pfizer is uniquely positioned to advance mRNA, which could be a breakthrough for other infectious diseases, genetic diseases and cancer. <a href=\"https://t.co/9AYdpcp7dQ\">https://t.co/9AYdpcp7dQ</a> (Paid Post for <a href=\"https://twitter.com/pfizer?ref_src=twsrc%5Etfw\">@pfizer</a>) <a href=\"https://twitter.com/hashtag/ad?src=hash&amp;ref_src=twsrc%5Etfw\">#ad</a> <a href=\"https://t.co/Fop2lRxZJ5\">pic.twitter.com/Fop2lRxZJ5</a></p>\n<p>— CNBC (@CNBC) <a href=\"https://twitter.com/CNBC/status/1445091901741359105?ref_src=twsrc%5Etfw\">October 4, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Dr. Jimmy answers questions about the COVID-19 vaccines &amp; mRNA science! <a href=\"https://twitter.com/moderna_tx?ref_src=twsrc%5Etfw\">@Moderna_tx</a> <a href=\"https://twitter.com/hashtag/SponsoredByModerna?src=hash&amp;ref_src=twsrc%5Etfw\">#SponsoredByModerna</a> <a href=\"https://t.co/kpxdz7D4t5\">pic.twitter.com/kpxdz7D4t5</a></p>\n<p>— Jimmy Kimmel Live (@JimmyKimmelLive) <a href=\"https://twitter.com/JimmyKimmelLive/status/1378004743734194182?ref_src=twsrc%5Etfw\">April 2, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">We’re incredibly <a href=\"https://twitter.com/hashtag/PfizerProud?src=hash&amp;ref_src=twsrc%5Etfw\">#PfizerProud</a> of all of our colleagues who worked tirelessly on the history-making undertaking of developing the first Covid-19 vaccine. Follow the journey of the past year with the special <a href=\"https://twitter.com/NatGeo?ref_src=twsrc%5Etfw\">@NatGeo</a> documentary “Mission Possible- The Race for a Vaccine.</p>\n<p>— Pfizer Inc. (@pfizer) <a href=\"https://twitter.com/pfizer/status/1371472620613423107?ref_src=twsrc%5Etfw\">March 15, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://childrenshealthdefense.org/defender/chd-legal-action-fda-eua-pfizer-biontech-vaccine-children/", "https://t.co/4MKm0VozBC", "https://twitter.com/_whitneywebb/status/1450464402000556039?ref_src=twsrc%5Etfw", "https://www.youtube.com/watch?v=mLEKkTSSUwk&ab_channel=TheJimmyDoreShow", "https://twitter.com/cnbc/status/1445091901741359105", "https://t.co/9AYdpcp7dQ", "https://twitter.com/pfizer?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/ad?src=hash&ref_src=twsrc%5Etfw", "https://t.co/Fop2lRxZJ5", "https://twitter.com/CNBC/status/1445091901741359105?ref_src=twsrc%5Etfw", "https://www.wsj.com/articles/covid-19-drugmakers-take-on-your-favorite-tv-shows-to-tackle-vaccine-hesitancy-11621166403", "https://twitter.com/JimmyKimmelLive/status/1378004743734194182", "https://childrenshealthdefense.org/defender_category/covid", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://twitter.com/moderna_tx?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/SponsoredByModerna?src=hash&ref_src=twsrc%5Etfw", "https://t.co/kpxdz7D4t5", "https://twitter.com/JimmyKimmelLive/status/1378004743734194182?ref_src=twsrc%5Etfw", "https://twitter.com/pfizer/status/1371472620613423107?lang=en", "https://www.youtube.com/watch?v=jbZUZ9JYNBE&ab_channel=Pfizer", "https://twitter.com/hashtag/PfizerProud?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/NatGeo?ref_src=twsrc%5Etfw", "https://twitter.com/pfizer/status/1371472620613423107?ref_src=twsrc%5Etfw", "https://www.frontpages.gr/d/20211017/1/%CE%97-%CE%9A%CE%B1%CE%B8%CE%B7%CE%BC%CE%B5%CF%81%CE%B9%CE%BD%CE%AE", "https://www.kathimerini.gr/world/561538213/emvolia-typoy-mrna-kata-toy-karkinoy/", "https://childrenshealthdefense.org/about-us/spring-2023-match/", "https://www.youtube.com/watch?v=drIRWIQTuzQ", "https://www.youtube.com/watch?v=drIRWIQTuzQ&ab_channel=Pfizer", "https://adage.com/article/marketing-news-strategy/how-pfizer-can-market-covid-vaccine-following-fda-approval/2359876", "https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/", "https://www.fool.com/investing/2021/09/12/will-pfizers-covid-vaccine-marketing-push-pay-off/", "https://childrenshealthdefense.org/defender/cdc-director-dr-rochelle-walensky-overrules-vaccine-safety-committee-boosters/", "https://investors.pfizer.com/investor-news/press-release-details/2021/PFIZER-REPORTS-SECOND-QUARTER-2021-RESULTS/default.aspx", "https://www.theedgemarkets.com/article/pfizer-inc-spent-us55m-social-media-advertising-2020", "https://www.pathmatics.com/blog/vaccine-campaign-ads-how-pfizer-moderna-and-johnson-johnson-are-advertising", "https://www.theedgemarkets.com/article/pfizer-inc-spent-us55m-social-media-advertising-2020", "https://www.theedgemarkets.com/article/pfizer-inc-spent-us55m-social-media-advertising-2020", "https://www.statista.com/statistics/254404/us-ad-spending-of-pfizer/", "https://www.statista.com/statistics/192112/us-ad-spending-of-pfizer/", "https://www.mmm-online.com/home/channel/nielsen-pfizer-tops-list-of-biggest-pharma-advertisers-in-2018/", "https://childrenshealthdefense.org/defender_category/big-pharma", "https://www.forbes.com/sites/greatspeculations/2019/12/09/pfizer-spending-twice-as-much-on-selling-than-research/?sh=313b9ed54b37", "https://qz.com/2059769/pfizer-is-planning-to-advertise-its-covid-19-vaccine-comirnaty/", "https://www.fda.gov/regulatory-information/laws-enforced-fda/federal-food-drug-and-cosmetic-act-fdc-act", "https://www.everycrsreport.com/reports/R40590.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3278148/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3278148/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3278148/", "https://www.fda.gov/drugs/prescription-drug-advertising/correct-help-seeking-ad", "https://www.nejm.org/doi/full/10.1056/NEJMp078080", "https://childrenshealthdefense.org/defender/vaers-cdc-deaths-injuries-covid-vaccines-fda-emergency-use-pfizer-kids/", "https://childrenshealthdefense.org/defender/biden-covid-vaccine-mandates-unvaccinated-employees/", "https://childrenshealthdefense.org/defender/fda-endorses-pfizer-covid-vaccine-children/", "https://nomorefakenews.com/", "https://childrenshealthdefense.org/defender/", "https://pubmed.ncbi.nlm.nih.gov/10904513/", "https://www.foxnews.com/media/ohio-woman-daughter-covid-vaccine-reaction-wheelchair", "https://childrenshealthdefense.org/defender/sarah-green-16-year-old-neurological-symptoms-pfizer-vaccine/", "https://odysee.com/maddieaddenied:31965b8b9d19c40a17049b63a2e6f282842d3cb4?src=embed", "https://www.vacsafety.org", "https://childrenshealthdefense.org/defender/fda-endorses-pfizer-covid-vaccine-children/", "https://wsau.com/2021/10/27/healthy-12-year-old-suffers-severe-debilitating-effects-from-the-covid-shot/"], "authors": [], "publish_date": null}