{"result_id": "291023", "URL": "https://childrenshealthdefense.org/defender/congres-mondial-sur-les-vaccins-un-rapport-du-ventre-de-la-bete/?lang=fr", "timestamp": "2023-04-25 17:19:57 CEST+0200", "meta": {"description": "Les docteurs Madhava Setty et Elizabeth Mumper ont assisté la semaine dernière au Congrès mondial sur les vaccins à Washington, D.C., où ils ont constaté que les plus de 3 100 personnes, principalement issues des secteurs pharmaceutique et biotechnologique et des affaires réglementaires, qui ont participé à l'événement se sont attachées à convertir les personnes réticentes à l'idée de se faire vacciner.", "lang": "fr", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/congres-mondial-sur-les-vaccins-un-rapport-du-ventre-de-la-bete/?lang=fr", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Congrès mondial sur les vaccins : Un rapport du ventre de la bête", "cleaned_text": "La semaine dernière, j’ai assisté au 23e Congrès mondial sur les vaccins à Washington, D.C., qui se présente comme « l’événement le plus important de l’année en matière de vaccins » :\n\n« Le format de notre événement permet d’aborder des sujets concernant l’ensemble du secteur, ce qui donne l’occasion aux participants d’en savoir plus sur leur domaine de recherche spécifique et sur leur fonction. En organisant des conférences de niche parallèles pendant les trois jours, la pertinence de l’ensemble de l’événement s’en trouve accrue pour tous les participants.\n\n« Au cours des sessions, vous apprendrez comment les efforts de recherche de pointe peuvent être intégrés dans\n\n« produire davantage de vaccins de meilleure qualité pour le marché ».\n\nPlus de 3 100 personnes, principalement issues des secteurs de la « pharma » et de la biotechnologie et des affaires réglementaires, ont participé à l’événement.\n\nParmi les principaux orateurs figuraient des personnalités des agences de santé publique, notamment Peter Marks, M.D., Ph.D., directeur du Center for Biologics Evaluation and Research (CBER) de la Food and Drug Administration (FDA) des États-Unis, divers directeurs de la recherche chez BioNTech et Moderna, ainsi que des sommités universitaires telles que Peter Hotez, M.D., Ph.D., doyen de l’École nationale de médecine tropicale et codirecteur du Texas Children’s Hospital Center for Vaccine Development au Baylor College of Medicine (mon alma mater).\n\nPendant les trois journées entières de la conférence, ni moi ni le Dr Elizabeth Mumper n’avons rencontré un autre médecin actuellement en pratique clinique.\n\nL’événement était ouvert à tous ceux qui étaient prêts à payer les frais d’inscription, qui commençaient à 495 dollars pour les étudiants et allaient jusqu’à plus de 1 000 dollars. Mais d’après ce que j’ai pu voir, il s’agissait essentiellement d’un rassemblement de grandes et petites entreprises pharmaceutiques et biotechnologiques et de responsables des affaires réglementaires.\n• La majorité des participants croient sincèrement qu’ils font ce qu’il faut.\n• La majorité des participants n’hésitent pas à s’appuyer sur les recommandations des agences de santé publique pour se forger une opinion. En d’autres termes, ils sont convaincus que les vaccins contre la COVID-19 à mRNA (et d’autres) sont extrêmement sûrs et ont sauvé des millions de vies.\n• En dehors des membres du comité consultatif de la FDA sur les vaccins et les produits biologiques apparentés (VRBPAC) et des agents de l’agence britannique de sécurité sanitaire (UKHSA), peu de personnes, voire aucune, ont connaissance des essais de vaccins et des données d’observation post-commercialisation concernant la sécurité et l’efficacité du vaccin contre la COVID-19.\n• Les orateurs principaux et les modérateurs des groupes d’experts qui ont abordé le thème de « l’hésitation vaccinale » ont dédaigné ceux qui ont réussi à éviter la vaccination et ont ouvertement méprisé ceux qui ont encouragé les autres à faire de même.\n• À l’exception de quelques cas, le ton des présentations et des tables rondes était collégial. Hormis les questions précises que M. Mumper et moi-même avons pu poser, aucun des participants n’a ouvertement laissé entendre qu’il remettait en question les récits conventionnels concernant la réponse à la pandémie COVID-19.\n• Les échanges en tête-à-tête ont révélé des signes encourageants : tout le monde n’a pas adhéré aux récits conventionnels sur la pandémie.\n• Les appels à des « partenariats » public-privé ont été un thème commun.\n\nJe n’ai pu assister qu’à une fraction des centaines de présentations et de tables rondes organisées pendant la conférence. Je résume ci-dessous les points les plus importants des sessions auxquelles j’ai assisté et les conversations clés que j’ai eues avec les présentateurs.\n\nNote : Tout au long de cet article, je me suis cité et j’ai cité d’autres personnes. Je n’ai pas accès aux enregistrements audio ou vidéo des sessions, s’il y en a. Les citations sont paraphrasées à partir de mes propres souvenirs et ne doivent pas être reprises mot pour mot.\n\nIntroduction à la conférence : Les anti-vaxxers sont dangereux, attendez-vous à des vaccinations annuelles contre la COVID\n\nLe Dr Gregory Poland, directeur de la recherche sur les vaccins à la clinique Mayo, a prononcé le discours d’ouverture. Il a ensuite animé une table ronde réunissant M. Marks, Paul Burton, directeur médical de Moderna, Isabel Oliver, conseillère scientifique en chef pour la transition à l’UKHSA, et le Dr Penny Heaton, responsable du domaine thérapeutique mondial des vaccins chez Johnson & Johnson.\n\nCette première session a probablement été les 90 minutes les plus fascinantes de toute la semaine. J’ai appris, lors d’une brève conversation avec lui après la conférence, que M. Poland est également pasteur. Ses talents d’orateur ont été pleinement mis à profit lors de ses discours d’ouverture et de clôture. Il est également atteint d’une lésion vaccinale.\n\nEn février 2022, M. Poland a déclaré souffrir d’acouphènes importants après avoir reçu la deuxième dose d’un « vaccin à ARNm ». À l’époque, M. Poland a décrit ses symptômes comme étant « extraordinairement gênants ». Il a néanmoins choisi de recevoir une troisième dose (rappel monovalent).\n\nLes commentaires de M. Poland sur les vaccins contre la COVID-19 à ARNm ont été extrêmement positifs. Il a déclaré que le déploiement rapide de la nouvelle thérapie a permis de sauver des millions de vies et aurait permis d’en sauver des millions d’autres s’il n’y avait pas eu la tendance inquiétante de l’hésitation croissante à l’égard des vaccins.\n\nJ’ai supposé que ses acouphènes dus aux vaccins s’étaient résorbés au cours de l’année écoulée. Ce n’est qu’à la fin de la conférence, plusieurs jours plus tard, qu’il m’a dit personnellement que ses symptômes étaient toujours débilitants, ce qui rend son soutien inconditionnel à ces produits encore plus étonnant.\n\nM. Poland a donné le ton de la conférence de quatre jours dès les dix premières minutes. Selon lui, la pandémie de COVID-19 a été stoppée grâce au travail acharné de nos agences réglementaires et aux produits remarquables issus de la plateforme ARNm.\n\nLe seul échec a pris la forme d’une hésitation vaccinale « inexplicable », un phénomène imputable aux pseudo-scientifiques anti-vax qui tirent profit de la diffusion d’une propagande sans fondement et fondée sur la peur.\n\nLutter contre l’hésitation vaccinale est un défi aussi important que de protéger le monde contre le prochain agent pathogène mortel. En effet, une grande partie des événements a porté sur les stratégies visant à démanteler les inquiétants « anti-vaxxers ».\n\nM. Marks a soutenu la position de M. Poland selon laquelle les personnes qui hésitent à se faire vacciner sont irrationnelles : « C’est fou qu’elles ne comprennent pas à quel point les vaccins sont efficaces », a-t-il déclaré. « Je n’essaie plus de discuter avec les personnes qui pensent que les vaccins ne sont pas sûrs. »\n\nJ’ai trouvé cette remarque particulièrement inquiétante. Que faudra-t-il pour que le directeur du CBER de la FDA réévalue le profil de sécurité des injections à ARNm ?\n\nLes panélistes se sont dits choqués par le fait que certains États(Idaho et Dakota du Nord) envisagent des projets de loi rendant illégale l’administration des vaccins contre la COVID-19 à ARNm.\n\n« Comment faire comprendre au public que la science est itérative ? » demande Mme Heaton. « Les vaccins contre la COVID sauvent des vies ! »\n\nM. Poland a répondu : « Pouvons-nous avoir un amen ?!! »\n\nM. Marks, entouré de ses partenaires – je veux dire ses homologues – dans l’industrie, a fait savoir à l’auditoire à quoi ressemblerait l’avenir. « Je ne vais pas retenir mon souffle en attendant un vaccin stérilisant, la protection contre les maladies graves est suffisante », a-t-il déclaré.\n\nM. Marks a prédit que les vaccins contre la COVID-19 seraient administrés tous les ans, voire tous les deux ans.\n\nIl a noté que le défi consistera à identifier la souche d’intérêt en juin afin de pouvoir disposer d’un vaccin d’ici septembre. Un délai de 100 jours est possible à condition que la fabrication soit prête à démarrer, a-t-il déclaré. Mme Heaton (J&J) et M. Burton (Moderna) ont acquiescé.\n\nEn résumé, les dirigeants de l’industrie des vaccins et les agences de réglementation sont, selon moi, convaincus d’avoir offert au monde un produit extraordinaire et sont frustrés qu’il ne soit pas accepté immédiatement et universellement.\n\nIls ont cité le fait que, bien que 70 % des Américains aient reçu la série primaire, seuls 15 % ont choisi de recevoir le rappel bivalent disponible en septembre 2022.\n\nSelon eux, la réticence du public à accepter le vaccin est due à la perception d’une réduction de la menace de la maladie, qui peut être surmontée par des « messages appropriés ».\n\nBien sûr, le public a raison. La pathogénicité des souches actuellement en circulation est inférieure à celle de la souche ancestrale de 2020. La possibilité que la diminution de l’utilisation soit liée à un mauvais profil de sécurité n’a jamais été mentionnée.\n\nDans leur esprit, les lésions dues aux vaccins et les effets indésirables graves sont extrêmement rares. Leur incidence a été exagérée par les rumeurs anti-vax. M. Poland a déclaré en plaisantant que « nous devrions peut-être lancer une rumeur selon laquelle l’ivermectine contient des puces électroniques ».\n\nSa réplique n’est accueillie que par des rires nerveux et épars.\n\nTable ronde : « Réflexions et outils pour lutter contre l’hésitation vaccinale »\n\nBien que les orateurs de la séance d’introduction aient clairement défendu la position « sûr et efficace », ils ont reconnu qu’il existait une part importante et croissante de la population qui était réticente à l’égard des vaccins.\n\nPlus important encore, ils souhaitaient démanteler ce mouvement et non l’ignorer. C’était l’occasion de dialoguer avec eux, peut-être en petits groupes ou individuellement. J’ai tenté pour la première fois d’organiser une table ronde où les participants pourraient proposer des moyens de convaincre les « anti-vaxxers » qu’ils ont tort.\n\nJe me suis retrouvée assise à côté de Dame Jennifer Margaret Harries, médecin britannique spécialiste de la santé publique et directrice générale de l’UKHSA. L’UKHSA publie les données de surveillance sanitaire du Royaume-Uni avec une granularité et une fréquence supérieures à celles de nos propres Centres de contrôle et de prévention des maladies (CDC).\n\nJe lui ai fait savoir que j’appréciais les données provenant de son agence et que j’avais commencé à suivre les rapports de surveillance réguliers de l’agence il y a deux ans. Elle m’a remercié pour cette reconnaissance et a apprécié l’intérêt que je portais à son travail.\n\nC’est l’UKHSA qui a donné le premier aperçu de l’efficacité négative des vaccins contre la COVID-19 dans un ensemble de données publiques en septembre 2021.\n\nJ’ai interrogé Mme Harries à ce sujet et son ton a immédiatement changé. Elle a répondu qu’elle n’était pas au courant d’une telle chose et qu’elle devrait se renseigner avant de faire un commentaire.\n\nJ’ai été surpris par sa réponse. Le rapport de septembre 2021 n’était pas une aberration. Des rapports ultérieurs de l’agence qu’elle préside ont indiqué qu’il y avait une incidence importante et croissante de COVID-19 parmi les personnes vaccinées par rapport aux personnes non vaccinées.\n\nL’UKHSA a cessé de mettre ces données à disposition quelques mois plus tard. Je voulais savoir pourquoi, mais elle n’a pas voulu répondre.\n\nJ’ai changé de tactique et je l’ai interrogée sur Tess Lawrie, PhD., médecine, de l’Evidence-Based Medicine Consultancy, qui a notamment décelé des signaux de sécurité dans le système britannique de carte jaune et qui, dans une lettre ouverte publiée en juin 2021, a exhorté le directeur de l’Agence de réglementation des médicaments et des produits de santé à mettre un terme à la campagne de vaccination britannique.\n\nMme Harries m’a regardé d’un air sévère et m’a dit : « Dans mon pays, un certain nombre de médecins éminents se font connaître pour leurs positions infondées sur les dangers des vaccins, le dernier en date étant un cardiologue. »\n\n« Oui. Il a fait l’objet de beaucoup d’attention ces derniers temps. »\n\nMme Harries ne pensait pas que M. Malhotra ou Mme Lawrie avaient des opinions crédibles, ou du moins c’est ce qu’elle m’a dit. Il ne m’a pas été facile de l’accepter. Nous n’avons pas eu l’occasion d’en parler davantage. J’ai eu une autre brève interaction avec Mme Harries plus tard dans la semaine (voir ci-dessous).\n\nUn pédiatre américain a présidé la table ronde. Il a ouvert la discussion en demandant des idées sur la manière de contrer l’hésitation face aux vaccins.\n\nJ’en avais un :\n\n« Il est évident que les beignets Krispy Kreme et les restrictions de voyage sont des carottes et des bâtons qui n’ont que partiellement fonctionné. Ceux qui restent hésitants sont inébranlables dans leur position parce qu’ils ont cherché plus que la plupart d’entre eux.\n\n« Ils ne croient pas les rumeurs. Ils écoutent des médecins et des scientifiques accrédités qui ont rédigé de nombreux articles évalués par des pairs et qui se trouvent être des détracteurs du vaccin contre la COVID-19. Pourquoi ne pas les impliquer ouvertement et voir ce qu’ils ont à dire ? »\n\nKatie Attwell, professeur à l’université de Western Australia, qui s’intéresse à la politique vaccinale et à l’adoption des vaccins, a réfuté cette idée. Je ne savais pas qui elle était à l’époque. J’ai réussi à lui parler personnellement plus tard dans la semaine. Sa réprimande a été sèche et directe : « Nous ne pouvons pas donner la parole aux critiques », m’a-t-elle dit. « Une fois que le public les aura vus sur un pied d’égalité avec nous, il pourra croire ce qu’ils disent. »\n\nSa stratégie repose implicitement sur l’idée que le public ne peut pas distinguer l’information de la désinformation. La vérité, selon elle, ne peut se suffire à elle-même. Elle doit être identifiée par ceux qui savent mieux que quiconque.\n\nBien sûr, il y a une autre possibilité. Peut-être sait-elle quelle est la vérité et veut-elle la cacher. Mes premières impressions étaient qu’elle faisait sincèrement son devoir de protéger le public par tous les moyens nécessaires. Il s’agirait d’évaluer l’étendue de ses connaissances sur le sujet.\n\nChris Graves, fondateur de l’Ogilvy Center for Behavioral Science, a soutenu la position de Mme Attwell. C’était un homme souriant et grégaire qui, je l’ai appris plus tard, avait été engagé par Merck pour analyser les différents types de personnalité et les systèmes de valeurs et de croyances dans le camp des « anti-vax ».\n\nUne fois que la personne est correctement catégorisée, la « messagerie personnalisée » peut être utilisée pour la ramener à la « réalité ». Selon le résumé de son étude :\n\n« Tout comme la médecine de précision traite les individus, cette étude menée auprès de 3 000 parents (toutes catégories démographiques confondues) aux États-Unis visait à identifier les messages personnalisés les plus efficaces pour répondre à l’hésitation des parents vis-à-vis des vaccins. Tout d’abord, elle a cherché à établir des corrélations entre : les données démographiques ; les raisons spécifiques invoquées pour l’hésitation vaccinale ; les préjugés cognitifs ; les styles cognitifs ; les visions du monde liées à l’identité ; et les traits de personnalité.\n\n« Deuxièmement, elle a testé 16 messages sous forme de mini-récits, chacun incarnant un principe de science comportementale, afin de déterminer si certains messages résonnaient mieux que d’autres en fonction des nombreux facteurs susmentionnés. »\n\nJe lui ai ensuite demandé ce qu’il répondrait à quelqu’un qui aurait examiné les essais et les données d’observation et qui aurait constaté qu’ils donnaient une autre version de la sécurité des vaccins. Il a souri : « Oh, ce sont ceux qui ont un plus grand besoin de fermeture cognitive. Oui. Ils sont bloqués parce qu’ils ne peuvent pas aller de l’avant s’il y a une incertitude. »\n\nM. Graves n’a pas pu décrire la forme que prendrait la « messagerie personnalisée » pour ce groupe en particulier, se contentant de dire qu’elle existait et qu’elle s’était révélée plus efficace que les autres types de messages\n\nJe lui ai demandé s’il savait combien de rapports d’effets indésirables avaient été enregistrés dans le système de notification des effets indésirables des vaccins (Vaccine Adverse Event Reporting System). « Non », dit-il, toujours souriant.\n\nTable ronde : « Ce que les vaccins et la COVID nous ont appris sur la science de l’immunologie »\n\nLe panel comprenait Ofer Levy, M.D., Ph.D., directeur du Precision Vaccines Program à l’hôpital pour enfants de Boston et membre du VRBPAC.\n\nCette discussion a porté sur l’absence de marqueurs biologiques efficaces pour l’efficacité des vaccins. Selon la position consensuelle de la VRBPAC, les taux d’anticorps ne sont pas un substitut de la protection.\n\nEn d’autres termes, une réponse immunitaire au vaccin sous forme d’anticorps ne doit pas être utilisée pour juger de l’utilité du vaccin. Néanmoins, les essais pédiatriques de la formulation originale les ont utilisés comme preuve d’efficacité.\n\nL’un des membres du groupe d’experts, Sharon Benzeno, Ph.D., responsable commercial de la médecine immunitaire chez Adaptive Biotechnologies, a fourni des informations encourageantes. Elle a estimé que notre approche était trop centrée sur les réponses anticorps et qu’il serait possible d’identifier des marqueurs biochimiques de l’immunité cellulaire induite par le vaccin à l’avenir.\n\nM. Levy a convenu qu’il s’agirait d’un ajout important à notre fonds de connaissances pour l’avenir.\n\nAu moment des questions, j’ai interrogé le panel :\n\n« Comme nous le savons tous, l’utilisation du rappel bivalent est très faible. Les gens ne veulent pas se soumettre à une nouvelle injection parce qu’il n’y a pas d’essais portant sur les résultats, mais seulement sur l’immunogénicité, dont vous dites vous-même qu’elle est insuffisante. Pourquoi ne pas insister sur les essais qui peuvent prouver un bénéfice en termes de résultats ? »\n\nM. Levy a répondu que le comité consultatif n’avait pas son mot à dire sur le type d’études requises. Son comité consultatif ne pouvait que voter oui, non ou s’abstenir en ce qui concerne l’approbation/l’autorisation.\n\nUn autre membre du panel, Alessandro Sette, docteur en sciences biologiques, directeur du laboratoire Sette et professeur à l’Institut d’immunologie de La Jolla, a ajouté : « Ce ne serait pas pratique. Le signal est trop faible parce que nous n’avons plus affaire à une population non naïve. »\n\nM. Sette a mordu à l’hameçon. Il disait que la plupart des gens ont été soit vaccinés, soit déjà exposés au virus. Le rappel n’aurait que peu d’effet, voire aucun, sur une population déjà protégée.\n\nJ’ai posé la question suivante : « Alors pourquoi insistons-nous pour que tout le monde reçoive un rappel ? »\n\nMme Harries, la modératrice, est immédiatement intervenu : « D’accord, nous nous sommes éloignés du sujet. Prochaine question. »\n\nJe commençais à comprendre comment cette conférence était gérée. Je ne pense pas que les organisateurs de cette réunion s’attendaient à ce que le public qui a payé ses billets coûteux pose de nombreuses questions sur la qualité des vaccins contre la COVID-19. Lorsque des problèmes se posaient, les modérateurs intervenaient rapidement.\n\nEst-il possible que d’autres personnes dans le public aient vu ce qui se passait ? Je crois qu’il en est ainsi. Chaque fois que je posais une question, les personnes assises près de moi me disaient qu’elles appréciaient la question et se demandaient pourquoi elle était restée sans réponse.\n\nMême une non-scientifique de Moderna m’a approchée à plusieurs reprises au cours de la conférence pour me faire savoir qu’elle était d’accord sur le fait que répondre à ces questions serait le meilleur moyen d’« augmenter l’adoption » et qu’elle prévoyait de transmettre mes questions à son personnel scientifique.\n\nDébat d’experts : Comment la législation sur les vaccins influe-t-elle sur l’utilisation et l’accès aux vaccins ?\n\nCe groupe était animé par un avocat, Brian Dean Abramson, « un expert de premier plan en matière de droit des vaccins, qui enseigne le sujet en tant que professeur adjoint de droit des vaccins à la faculté de droit de l’université internationale de Floride ».\n\nSes remarques préliminaires ont démontré son mépris pour les personnes qui hésitent à se faire vacciner :\n\n« Nous n’avons pas atteint l’immunité collective à cause de ces anti-vaxxistes.\n\n« Ils sont dangereux. En 2021, ils ont reçu 4 millions de dollars de dons. On estime qu’en 2022, plus de 20 millions de dollars ont été acheminés vers leur mouvement. »\n\nLe panel comprenait Mme Attwell, dont la position était claire d’après sa réponse plate à ma suggestion précédente. Sa page publique indique qu’elle a reçu environ 2 millions de dollars de financement pour ses recherches sur l’amélioration de l’accès aux vaccins et de leur utilisation.\n\nMme Attwell n’est ni médecin ni scientifique médical. Toutefois, ce panel comprenait également un médecin de santé publique de l’école de santé publique Johns Hopkins Bloomberg, Chizoba Wonodi, Ph.D., qui a 27 ans d’expérience en Afrique, en Asie et en Amérique.\n\nJ’ai été encouragé par la flexibilité du public par rapport à mes défis précédents et lorsqu’on m’a offert le micro, j’ai commencé par une salve plus agressive dirigée vers le modérateur :\n\n« Le terme « anti-vax » est péjoratif et reflète l’ignorance de l’identité des opposants aux vaccins et des raisons pour lesquelles ils croient en ce qu’ils croient. C’est encore plus vrai lorsqu’on utilise des termes tels que « immunité collective » à propos de cette pandémie. En l’absence d’un vaccin stérilisant, ou même d’un vaccin capable de prévenir l’infection, l’immunité collective est impossible.\n\n« Plutôt que d’enflammer la situation, pourquoi ne pas dialoguer avec les médecins et les scientifiques qui sont favorables à la prudence vaccinale et écouter leurs arguments dans le cadre d’une discussion équitable, ouverte et publique ? »\n\nUne fois de plus, Mme Attwell a poliment mais sévèrement averti le public que cela serait trop dangereux à son avis. Je m’y attendais. J’ai également été encouragé par le fait que les trois personnes assises autour de moi ont reconnu que mon point de vue était valable et qu’il était surprenant que les panélistes n’abordent pas les mérites de ma position.\n\nPar la suite, Mme Chizoba s’est approchée de moi et m’a fait savoir qu’elle avait apprécié ma question. Dans son travail, elle a constaté que l’éducation est la chose la plus importante. Elle était bienveillante ; elle pensait qu’il était possible d’atteindre de nombreux médecins réticents à l’égard des vaccins en leur fournissant les informations appropriées.\n\nJe lui ai demandé comment elle s’adresserait à un médecin qui estimerait simplement qu’autoriser une thérapie dont l’essai en double aveugle a démontré une mortalité toutes causes confondues supérieure à celle du placebo n’est pas seulement sans précédent, mais illogique.\n\nJe lui ai dit qu’il s’agissait des résultats intermédiaires publiés de l’essai Pfizer/BioNTech, l’essai qui a lancé la campagne mondiale de vaccination. Elle n’était pas au courant des résultats.\n\nÀ sa décharge, elle a admis qu’elle n’avait pas regardé le journal mais qu’elle avait l’intention de le faire.\n\nj’ai assisté à une session intitulée « Let’s Talk Shots » au cours de laquelle Daniel Salmon, Ph.D., a présenté les travaux menés au Johns Hopkins Institute for Vaccine Safety.\n\n« Lets Talk Shots est conçu pour faciliter la prise de décision concernant les vaccins. Il partage un contenu animé attrayant basé sur les questions ou les préoccupations d’une personne. »\n\nIl suffit de dire qu’il y a beaucoup de réflexion, d’argent et d’énergie derrière la campagne de vaccination du public. Une fois de plus, l’approche repose sur des messages ciblés, qui reconnaissent que des personnes différentes ont besoin d’entendre des types d’informations différents.\n\nMme Attwell s’est également adressé au même public. Dans ce forum, elle a souligné que le gouvernement américain était plus tolérant à l’égard des opposants aux vaccins que son pays. Elle a suggéré que nos exemptions religieuses et philosophiques soient entièrement supprimées. Seules les exemptions médicales les plus strictes devraient être autorisées. Cela permettra d’obtenir de meilleurs résultats.\n\nAprès son intervention, je l’ai abordée. Elle a levé les yeux comme si elle s’attendait à ce que je lui pose des questions. Je lui ai demandé si elle était disposée à avoir une conversation plus ouverte sur ses recherches et ses opinions. Elle l’était.\n\nJe lui ai fait savoir que je pensais qu’elle était suffisamment intelligente pour se rendre compte que j’étais, en fait, un sceptique à l’égard des vaccins. Elle a hoché la tête.\n\n« Alors, ai-je dit, le principal diffuseur de désinformation pourrait être candidat à la présidence des États-Unis. Que pensez-vous qu’il faille faire ? »\n\nElle sourit, mal à l’aise, et dit : « Oui, il va être difficile de l’empêcher de s’oxygéner. »\n\nEn d’autres termes, l’approche qu’elle propose pour étouffer les porte-parole anti-vax devient beaucoup plus difficile lorsqu’ils se présentent à la plus haute fonction du pays. J’ai pensé qu’elle serait prête à reconsidérer sa stratégie. Elle ne l’était pas.\n\nJ’ai essayé une approche différente. J’ai expliqué qu’au cours de mon enquête, je n’avais pas trouvé suffisamment de preuves que les injections contre la COVID-19 à ARNm étaient sûres ou efficaces, mais que j’étais ouvert à la possibilité que la plateforme ARNm puisse s’avérer un moyen puissant de créer des thérapies sûres et efficaces à l’avenir.\n\nÀ quoi servirait-il de disposer de cette technologie si la moitié du public ne lui fait plus confiance ou ne fait plus confiance à ceux qui la lui font avaler en lui refusant la possibilité d’en débattre ?\n\nJe lui ai dit que dans ce pays, les médecins ne sont pas disposés à rédiger des exemptions religieuses ou philosophiques pour les vaccins contre la COVID-19 par crainte de réactions négatives. De toute façon, de nombreux employeurs ne les acceptent pas, de sorte que sa position n’a pas lieu d’être.\n\nJe lui ai demandé quel serait le motif d’une exemption médicale. Elle ne le savait pas. J’ai expliqué que les exemptions médicales sont considérées comme valables UNIQUEMENT si la personne a la preuve d’une réaction antérieure à un vaccin à ARNm ou à un ou plusieurs de ses ingrédients. Seule une poignée de personnes sur la planète sait ce que contiennent exactement ces produits.\n\nComment un médecin (ou toute autre personne) pourrait-il savoir si une personne donnée présente un risque accru d’événement fâcheux ?\n\n« Je ne sais pas. »\n\nJe lui ai demandé si elle était au courant des preuves de fraude médicale entourant les essais de vaccins de Pfizer. Elle a dit qu’elle avait lu quelque chose à ce sujet il y a quelque temps, mais qu’elle ne pensait pas que c’était important.\n\nEnfin, je lui ai demandé pourquoi elle pensait que vacciner tout le monde était la bonne chose à faire.\n\n« Les taux de vaccination dans mon pays sont plus élevés que dans le vôtre et nous avons obtenu de meilleurs résultats. »\n\nMais il y a des pays où les taux de vaccination sont bien inférieurs à ceux des deux pays et où les taux de mortalité sont encore plus bas. Comment l’expliquer ? Elle ne pouvait pas.\n\nMme Mumper a participé au « Partnering for Vaccine Equity Program », présidé par Joe Smyser, Ph.D., PDG de The Public Good Projects.\n\nElle m’en a fait part :\n\n« Cette conférence portait sur l’acceptation et la demande de vaccins, en particulier sur les facteurs sociaux et comportementaux, et sur la manière de relier l’action et la politique par l’utilisation des sciences sociales.\n\n« La stratégie consistait à donner aux responsables locaux les moyens de transmettre des messages de santé publique aux communautés. La recherche a montré que les disparités dans l’acceptation des vaccins ont diminué dans les communautés noires et brunes qui ont bénéficié du programme. Les recherches montrent que les personnes les plus réticentes à l’égard des vaccins sont aujourd’hui blanches, rurales et de droite.\n\n« Dans le programme décrit, ils ont travaillé avec des influenceurs des médias sociaux (comme des jeunes femmes qui tiennent des blogs sur la beauté) pour répéter des messages de santé publique à leur public. Ils ont identifié 212 700 000 messages de désinformation sur les vaccins, dont la plupart provenaient des États-Unis.\n\n« Dans ce projet, ils ont travaillé en étroite collaboration avec Twitter et ont facilité la suppression de ce qu’ils considéraient comme de la désinformation. Ils ont recruté 495 influenceurs prêts à partager volontairement des informations avec les personnes qui les suivent. Ils ont ainsi atteint 60 millions de personnes.\n\n« Ils savent que les soi-disant « anti-vaxxers » ne s’en prendront pas aux influenceurs des médias sociaux. Le programme a proposé des formations et des webinaires pour apprendre à composer des messages de santé publique efficaces.\n\n« Ce spécialiste de la santé publique et des sciences sociales a qualifié les anti-vaxxistes d’ « idiots et d’abrutis ».\n\n« Pendant la période de questions et réponses, j’ai dit que, d’après mon expérience, de nombreux parents qui étaient réticents à l’égard des vaccins étaient très intelligents et avaient des diplômes d’études supérieures. Des gens comme les médecins, les avocats et les ingénieurs connaissaient quelqu’un dans leur famille qui avait eu une réaction indésirable à un vaccin. J’ai suggéré qu’il serait plus efficace d’engager le dialogue avec les opposants aux vaccins et de découvrir les données sur lesquelles ils s’appuient plutôt que d’utiliser des injures au vitriol.\n\n« Je paraphrase la réponse de l’orateur ci-dessous. Il a répondu : « Nous travaillons en amont. Nous voulons savoir où ils obtiennent leurs informations erronées. Je peux traiter les gens d’idiots et d’abrutis s’ils diffusent des informations erronées. Si vous soulevez ne serait-ce que des questions sur le vaccin contre le papillomavirus, vous recevrez des invitations de conférenciers et des offres de livres. Des gens s’enrichissent en diffusant des informations erronées. Nous savons ce qu’est la bonne information. »\n\n« J’ai été profondément troublé d’apprendre que des chercheurs en sciences sociales et des responsables de la santé publique ont travaillé directement avec Twitter pour supprimer des contenus qu’ils considéraient comme de la désinformation. Leur affirmation « que nous savons ce qui est vrai » ne sonne pas juste. Leurs efforts visaient à accroître l’utilisation des vaccins dans tous les groupes d’âge pour lesquels une autorisation d’utilisation d’urgence avait été accordée.\n\n« L’orateur n’a pas semblé prendre en compte le droit à la liberté d’expression des personnes qui ont publié des données remettant en cause l’efficacité des vaccins contre la COVID.\n\n« J’ai été surpris par la rhétorique vitriolique dirigée contre ceux qui ont signalé des effets secondaires du vaccin ou qui ont mis en doute le rapport risque-bénéfice.\n\n« Il était troublant d’entendre comment les responsables de la santé publique ont courtisé les influenceurs des médias sociaux pour qu’ils diffusent des messages incitant leurs adeptes à se faire vacciner. Pourtant, ils ont supprimé les messages de médecins et de scientifiques qui publiaient des données gênantes sur les vaccins contre la COVID-19. »\n\nLa dernière journée s’est achevée par une nouvelle session plénière. Une fois de plus, M. Poland a animé un panel de chercheurs sur les vaccins qui ont discuté de la manière de fabriquer rapidement des vaccins plus durables, c’est-à-dire des vaccins qui offrent une protection plus longue.\n\nL’un des chercheurs a fait une observation remarquable. Au début de la pandémie, avant que le vaccin ne soit disponible, les jeunes nourrissons qui avaient contracté la COVID-19 présentaient une immunité robuste et durable à tous points de vue, même trois ans plus tard. Cette cohorte intéressante recèle peut-être quelques indices.\n\nMme Mumper a vu là une belle occasion de leur couper l’herbe sous le pied. Elle a dit :\n\n« Je suis pédiatre en Virginie. J’ai été choquée de voir à quel point mes patients en bas âge se portaient bien avec la COVID-19. Les CDC nous ont indiqué que le taux de survie à la COVID-19 est de 99,997 % chez ces nourrissons. Aujourd’hui, vous nous dites également que nous savons que ces enfants sont très bien protégés deux ans après l’infection.\n\n« Je me demande pourquoi je devrais administrer ces vaccins à un enfant de 6 mois alors que je ne dispose d’aucune donnée à long terme sur les effets de substances telles que les nanoparticules lipidiques sur les bébés. Alors convainquez-moi ! »\n\nM. Poland au panéliste : « Vous avez 30 secondes pour répondre. »\n\nUn panéliste : « Cela nécessiterait plus de temps et une bouteille de vin. »\n\nUn panéliste : « Je ne pense pas pouvoir répondre à cette question. »\n\nUne panéliste, Andrea Carfi, Ph.D., et directrice scientifique de Moderna, a réagi en soulignant que Mme Mumper pensait à tort que les effets à long terme de la COVID-19 étaient moindres que ceux des vaccins, tout en admettant qu’il ne savait pas non plus quelles étaient les séquelles à long terme de l’infection.\n\nM. Poland a accepté la réponse de Mme Carfi comme suffisante et a clos la discussion.\n\nLes personnes assises à côté de nous ont à nouveau souligné le bien-fondé de la préoccupation de Mme Mumper. De plus, la réponse de Mme Carfi n’a pas du tout résolu le problème. Si les effets à long terme du vaccin et de l’infection ne sont pas connus, sur quelles bases poussons-nous ces enfants à se faire vacciner ?\n\nIl s’agissait d’une occasion rare de dialoguer avec les partisans du vaccin dans leur propre maison et selon leurs propres termes. Selon moi, leurs fondations s’effritent et leur structure finira par s’effondrer.\n\nLes grands acteurs doivent s’en rendre compte, c’est pourquoi ils s’empressent d’étouffer toute piste d’investigation qui mettrait en évidence l’hypocrisie.\n\nCela n’a pas échappé au public. Comme je l’ai dit, certains d’entre eux ont pu se rendre compte que des questions simples ne recevaient pas de réponses claires.\n\nIl est clair pour moi que le camp des « pro-vaccins » n’est pas aussi monolithique que nous le pensons souvent. Il existe un éventail de scepticisme parmi eux. Ils reconnaissent également que les personnes qui hésitent à se faire vacciner couvrent tout le continuum qui va des « négateurs du virus SARS-CoV-2 » aux « attentistes ».\n\nIls ont les moyens de mettre sur pied des campagnes d’information sophistiquées qui ciblent les personnes qui se méfient des vaccins au moyen de messages spécifiques.\n\nJe suggère que nous utilisions leur modèle pour au moins reconnaître que nous pouvons être plus précis dans la manière dont nous les ramenons à la raison.\n\nDans mon premier commentaire ouvert lors d’une table ronde, j’ai résumé la situation comme suit :\n\n« Il y a beaucoup de gens qui sont réticents à l’égard des vaccins et qui n’ont pas la capacité de lire des documents scientifiques et d’analyser des données. Ils voient deux groupes qui sont le reflet l’un de l’autre. Les deux camps pensent que l’autre est incroyablement crédule, qu’il écoute les diffuseurs de fausses informations et qu’il met en danger le reste d’entre nous pour son propre bénéfice.\n\n« Ils peuvent également voir la grande différence entre les deux. L’une des parties demande une discussion ouverte sur cette question importante. L’autre estime que seul son camp devrait avoir le droit de s’exprimer, tandis que l’autre doit être réduit au silence.\n\n« Comment pensez-vous que cela va se passer ? Pourquoi les indécis choisiraient-ils de suivre le groupe qui prône la censure plutôt qu’un débat ouvert ? »\n\nEn refusant de nous engager dans un échange constructif, ils pourraient être en mesure de rallier à leur cause quelques personnes hostiles aux vaccins, grâce à ce que l’on peut qualifier de « thérapie de conversion ».\n\nCependant, leur tour finira par s’écrouler parce qu’elle n’est pas fondée sur la logique, la méthode scientifique ou des faits inattaquables. Elle s’appuie sur la censure des voix de ceux qui sont qualifiés pour s’exprimer sur le sujet afin de créer un « onsensus ».\n\nIl nous incombe de décider ce qu’il convient de faire pour accélérer l’émergence inévitable d’une sensibilité à ce sujet.\n\nJe suis certain qu’il existe des personnes qui savent que les vaccins causent des dommages incalculables, mais qui préconisent malgré tout leur utilisation à grande échelle. Quelques-uns d’entre eux étaient probablement présents à la conférence. Ils ne seront pas influencés par un débat ouvert, mais ils ne représentent qu’une infime minorité de tous les défenseurs des vaccins.\n\nJe suggère que nous commencions par ne pas considérer tous les partisans des vaccins comme des concepteurs de meurtres de masse. La plupart d’entre eux sont terriblement mal informés. En essayant d’obtenir une immunité collective, ils ont succombé à la mentalité de troupeau. Il faut les atteindre.\n\nD’après mon expérience récente, je constate que c’est possible par le biais d’un dialogue ouvert. C’est précisément la raison pour laquelle les ingénieurs de cette pandémie et de sa réponse veulent s’assurer que cela ne se produise jamais. Malgré ce qu’ils disent publiquement, je ne pense pas qu’ils s’inquiètent que les sceptiques des vaccins restent hésitants – ils s’inquiètent de perdre des membres de leur propre troupeau au profit de la vérité.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Congrès mondial sur les vaccins : Un rapport du ventre de la bête", "description": "Les docteurs Madhava Setty et Elizabeth Mumper ont assisté la semaine dernière au Congrès mondial sur les vaccins à Washington, D.C., où ils ont constaté que les plus de 3 100 personnes, principalement issues des secteurs pharmaceutique et biotechnologique et des affaires réglementaires, qui ont participé à l'événement se sont attachées à convertir les personnes réticentes à l'idée de se faire vacciner.", "url": "https://childrenshealthdefense.org/defender/congres-mondial-sur-les-vaccins-un-rapport-du-ventre-de-la-bete/?lang=fr", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-04-13T18:41:05+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/world-vaccine-congress-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.terrapinn.com/conference/world-vaccine-congress-washington/index.stm", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://childrenshealthdefense.org/authors/elizabeth-mumper-m-d-faap/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.mayo.edu/research/faculty/poland-gregory-a-m-d/bio-00078220", "https://www.coastalbreezenews.com/news/a-healer-of-body-and-soul/article_a0347822-a6f5-5749-9545-ab807bab7f79.html", "https://childrenshealthdefense.org/defender/vaccine-researcher-gregory-poland-tinnitus-covid-shot/", "https://legislature.idaho.gov/wp-content/uploads/sessioninfo/2023/legislation/H0154.pdf", "https://childrenshealthdefense.org/defender/cdc-ischemic-stroke-covid-bivalent-boosters-safety-signal/", "https://childrenshealthdefense.org/defender/war-on-ivermectin-pierre-kory-big-pharma-cola/", "https://en.wikipedia.org/wiki/Jenny_Harries", "https://childrenshealthdefense.org/defender/breakthrough-infections-covid-vaccine-failure/", "https://substack.com/profile/80297209-dr-tess-lawrie-mbbch-phd", "https://www.e-bmc.co.uk/", "https://yellowcard.mhra.gov.uk/", "https://ukfreedomproject.org/wp-content/downloads/Urgent%20Preliminary%20Report%20of%20Yellow%20Card%20Data%209-6-2021.pdf", "https://www.gov.uk/government/organisations/medicines-and-healthcare-products-regulatory-agency", "https://childrenshealthdefense.org/defender/aseem-malhotra-covid-vaccine-rfk-jr-podcast/", "https://www.nbcnews.com/news/us-news/krispy-kreme-offers-free-glazed-donut-those-who-show-covid-n1261768", "https://research-repository.uwa.edu.au/en/persons/katie-attwell", "https://www.ogilvyconsulting.com/people/chris-graves/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5B%5D=COVID19&VAX%5B%5D=COVID19-2", "https://www.childrenshospital.org/directory/ofer-levy", "https://www.adaptivebiotech.com/adaptive-leadership/sharon-benzeno-phd/", "https://www.lji.org/labs/sette/", "https://briandeanabramson.com/", "https://publichealth.jhu.edu/faculty/2206/chizoba-barbara-wonodi", "https://www.nejm.org/doi/suppl/10.1056/NEJMoa2110345/suppl_file/nejmoa2110345_appendix.pdf", "https://www.letstalkshots.com/main/about/#about", "https://www.letstalkshots.com/main/", "https://childrenshealthdefense.org/defender/pfizer-whistleblower-brook-jackson-lawsuit-dismissal-fraud/", "https://www.publicgoodprojects.org", "https://childrenshealthdefense.org/defender/merck-gardasil-hpv-vaccine-lawsuits-multidistrict-litigation/", "https://masscpr.hms.harvard.edu/people/andrea-carfi-phd"], "authors": [], "publish_date": null}