{"result_id": "291008", "URL": "https://childrenshealthdefense.org/defender/karl-lauterbach-germany-covid-vaccine-injuries/", "timestamp": "2023-04-25 17:19:33 CEST+0200", "meta": {"description": "Germany’s Federal Minister of Health Karl Lauterbach — a former Harvard University adjunct professor — this week admitted that COVID-19 vaccine adverse events are prevalent and that those suffering from severe vaccine injuries are being ignored.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/karl-lauterbach-germany-covid-vaccine-injuries/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "German Health Minister Reverses Course on COVID Vaccine Injuries, Says Injured Being Ignored", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nGermany’s Federal Minister of Health Karl Lauterbach — a former adjunct professor at Harvard University — this week admitted that COVID-19 vaccine adverse events are prevalent and that those suffering from severe vaccine injuries are being ignored.\n\nLauterbach, one of Germany’s foremost voices in favor of strict COVID-19 restrictions and vaccine mandates, made the comments in a March 12 interview on ZDF, Germany’s national public television broadcaster.\n\nAs recently as February 2022, Lauterbach claimed COVID-19 vaccines are free of side effects.\n\nLauterbach’s admission came amid allegations he previously falsified his academic credentials.\n\n1 in 10,000 incidence of severe adverse events from COVID vaccines\n\nDuring the interview on ZDF’s “Heute Journal,” Lauterbach admitted the incidence of severe adverse events from the COVID-19 vaccines was 1 in 10,000 people.\n\n“According to the latest research data, severe vaccine injuries are very rare. The incidence is less than 1:10,000 vaccinations.\n\n“I’ve always been aware of the numbers. They have remained relatively stable. … 1:10,000: some may say that’s a lot, and some may say it’s not that much.”\n\nDespite describing the incidence of severe adverse effects as “very rare,” Lauterbach backtracked on earlier claims that the COVID-19 vaccines did not cause side effects.\n\nOn Aug. 14, 2021, Lauterbach tweeted that the COVID-19 vaccines had “no side effects.”\n\nZDF journalist Christian Sievers confronted Lauterbach on his previous claims, stating, “You’ve always given the impression that side effects aren’t really a thing.”\n\nLauterbach replied that his 2021 statement “was an exaggeration that I once made in an ill-considered tweet,” adding that “it did not represent my true position.”\n\nHowever, Lauterbach had repeated this same position in a February 2022 interview, when he said the COVID-19 vaccines are “more or less free of side effects.”\n\nIn admitting to his “unfortunately” worded tweet, Lauterbach said some people who sustained severe adverse events from the COVID-19 vaccines will remain permanently disabled.\n\nThe injuries are unique and often not responsive to traditional medical interventions, Lauterbach said, adding that more research is needed to determine the appropriate treatment for these injuries.\n\nHe also said government agencies must do better at recognizing injuries related to the COVID-19 vaccines.\n\nAccording to Lauterbach, German government compensation programs for vaccine injury victims are in poor shape. “I can see why the people here are making complaints.”\n\nHe said, “We are slowly gaining a clearer understanding of the situation,” in relation to COVID-19 vaccine injuries, noting that the vaccines are still in their initial phase 3 clinical experiments.\n\nAs of today, Germany’s Federal Ministry of Health website states, “Modern vaccines are safe and adverse effects only occur in sporadic cases.”\n\nHowever, official data from Germany’s Paul Ehrlich Institute, the country’s federal institute for vaccines and biomedicines, indicate that as of Oct. 31, 2022, approximately 331,000 adverse events were reported after COVID-19 vaccination.\n\nOut of these 331,000-plus adverse events, 1,808 applications for relief under Germany’s vaccine injury compensation program were filed as of January, and 253 claims were approved, German newspaper Welt reported on Jan. 28.\n\nIn March 2021, Lauterbach told Science, in response to safety concerns linked to the AstraZeneca COVID-19 vaccine, that he would have allowed vaccinations to continue while the safety concerns were being investigated.\n\nLauterbach went as far as to express his hope that pharma companies will voluntarily offer compensation to those who sustained injuries from COVID-19 vaccines, on the basis that their “profits have been exorbitant.”\n\nOn June 16, 2022, Lauterbach released a video in which he said, “In very rare cases, corresponding side effects may occur after corona vaccination” — an indication he was rethinking his position on the vaccines prior to this week’s more widely publicized interview.\n\nResponding to Lauterbach’s March 12 statements, Byram Bridle, Ph.D., associate professor of viral immunology at Canada’s University of Guelph, said the 1 in 10,000 figure regarding severe adverse effects of the COVID-19 vaccines is likely low.\n\n“This statistic is almost certainly an underestimation, due to the well-known under-reporting inherent to passive monitoring systems,” Bridle wrote on his blog, “especially when coupled to pressures on physicians to parrot the ‘safe and effective’ motto,” citing academic studies to this effect.\n\nNoting the safety concerns raised about the AstraZeneca vaccine, Bridle noted that Canada suspended use of the vaccine “due to its risk of causing severe adverse events (the main one was blood clotting) in 1:55,000 inoculated adults.”\n\nAccording to Steve Kirsch, executive director of the Vaccine Safety Research Foundation, the true rate of serious adverse events is approximately 100 times greater than the figures Lauterbach cited — “closer to 1 in 100 doses” and “For death, it is ~1 in 1,000 doses.”\n\nOn Feb. 24, 2022, Andreas Schöfbeck, then-head of the German insurance company BKK ProVita, wrote a letter to the Paul Ehrlich Institute, stating that based on his company’s data, adverse events related to the COVID-19 vaccines were under-reported by 1,000%. He told the institute that 217,000 of ProVita’s 11 million clients received treatment for adverse events.\n\nThese revelations led Christine Anderson, a member of the European Parliament from Germany, on Feb. 25, 2022, to submit a question to the European Parliament regarding the “very significant under-reporting of suspected cases of COVID-19 vaccination side-effects” and accusing the EU of ignoring “vaccine failure.”\n\nOn March 1, 2022, BKK ProVita fired Schöfbeck. At the time, Dirk Heinrich, chairman of the Virchowbund, Germany’s association of resident doctors, called Schöfbeck and BKK “babbler[s] of alternative facts.”\n\nLauterbach began his tenure as Germany’s federal minister of health on Dec. 8, 2021. At the time, he was described by German public broadcaster Deutsche Welle as a “voice of reason” and a “recognized expert on COVID,” adding that “COVID deniers and anti-vaxxers are especially pointed in their hatred of him, often sending him death threats.”\n\nSoon after becoming health minister, Lauterbach became known for his hardline stance on COVID-19-related restrictions and vaccine mandates.\n\nDays after taking office, Lauterbach said unvaccinated health workers were “absolutely unacceptable.”\n\nAnd by early January 2022, Lauterbach was calling for a national vaccine mandate, according to Deutsche Welle.\n\n“We still need a vaccine mandate,” Lauterbach said. “Otherwise, Omicron is a dirty vaccination through the backdoor. Counting on everyone getting infected sooner or later and becoming immune … would cause big problems.”\n\n“Mandatory vaccination is also important for the future variants that may still develop. Omicron infection does not necessarily make one immune to the next viral variant,” he added.\n\nBut a national vaccine mandate did not come to pass in Germany. On April 10, 2022, Deutsche Welle reported that “the proposal’s failure is undermining trust in the government’s pandemic plan.”\n\nAnd on March 29, 2022, Lauterbach said he would propose the EU recommend a fourth COVID-19 vaccination for those over the age of 60.\n\nThis is not the first time Lauterbach, in his position as federal health minister, has faced challenges.\n\nOn the same day as his interview with ZDF, Welt revealed that in 1995, Lauterbach allegedly falsified his CV in order to attain a professorship at the University of Tübingen.\n\nAccording to Welt, there were at least three instances where Lauterbach allegedly lied about his experience.\n\nIn his University of Tübingen application, Lauterbach, then 32, claimed he was running a government-funded project on breast cancer. The German Ministry of Health recently revealed that it is unaware of the existence of such a project. The project was funded to the tune of more than $1 million at the time.\n\nLauterbach also claimed he helped raise funds for a Princeton University study, but it was later confirmed he “was not involved in obtaining the grant.”\n\nAnd in a third instance, Lauterbach claimed he received more than $10,000 in funding from the Robert Bosch Foundation for a study, “Ethics and Economics in Health Care.” However, it was determined he never received the funds because he never completed the project in question.\n\nNevertheless, Lauterbach remains in his position as Federal Minister of Health as of this writing.\n\nLast year, “vaccine skeptic” lawyer Markus Haintz sued Lauterbach, accusing him of spreading fake news. However, a German court ruled that Lauterbach’s statements are considered free speech — notably though not on the basis that his statements were scientific, but instead that they were political opinion.\n\nThe latest revelations about Lauterbach come just as his former counterpart in the U.K., Matt Hancock, became the primary target of a massive leak of WhatsApp messages.\n\nThe leak, known as the “Lockdown Files,” revealed that he and the U.K. cabinet implemented lockdowns and proceeded with a mass COVID-19 vaccination program on the basis of political imperatives — and not scientific data.\n\nCOVID-19 narratives and measures continued to unravel in Europe in recent weeks.\n\nVienna, Austria, allowed its mask mandate for public transportation to lapse on Feb. 28, while Greece’s government announced Tuesday that its mask mandate for public transportation and pharmacies has been rescinded.", "opengraph": {"locale": "en_US", "type": "article", "title": "German Health Minister Reverses Course on COVID Vaccine Injuries, Says Injured Being Ignored", "description": "Germany’s Federal Minister of Health Karl Lauterbach — a former Harvard University adjunct professor — this week admitted that COVID-19 vaccine adverse events are prevalent and that those suffering from severe vaccine injuries are being ignored.", "url": "https://childrenshealthdefense.org/defender/karl-lauterbach-germany-covid-vaccine-injuries/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-03-15T20:49:27+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/germany-covid-vaccine-injuries-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">A historic moment on the 12th of March 2023: German health minister Karl Lauterbach has to admit, that there are people with <a href=\"https://twitter.com/hashtag/vaccineinjuries?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccineinjuries</a>. In the months before, the <a href=\"https://twitter.com/hashtag/Covid_19?src=hash&amp;ref_src=twsrc%5Etfw\">#Covid_19</a> vaccines were *always* called “sicher und wirksam”. <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19</a> <a href=\"https://twitter.com/hashtag/Biontech?src=hash&amp;ref_src=twsrc%5Etfw\">#Biontech</a> <a href=\"https://twitter.com/hashtag/Pfizer?src=hash&amp;ref_src=twsrc%5Etfw\">#Pfizer</a> <a href=\"https://twitter.com/hashtag/Vaccinesideeffects?src=hash&amp;ref_src=twsrc%5Etfw\">#Vaccinesideeffects</a> <a href=\"https://t.co/YfOlTomtkl\">https://t.co/YfOlTomtkl</a></p>\n<p>— Julian Brandtner – Baden-Württemberg (@otrador) <a href=\"https://twitter.com/otrador/status/1635320872767729667?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.bundesregierung.de/breg-en/federal-cabinet/1988686-1988686", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.dw.com/en/germany-needs-jabs-not-omicrons-dirty-vaccination-health-minister/a-60366926", "https://www.youtube.com/watch?v=653x0SpYd48&t=234s", "https://www.zdf.de/zdfunternehmen/factsandfigures-100.html", "https://www.zdf.de/nachrichten/zdf-morgenmagazin/zdf-morgenmagazin-vom-22-februar-2022-100.html", "https://www.welt.de/politik/deutschland/plus244225919/Karl-Lauterbach-Der-dunkle-Fleck-in-seiner-Vergangenheit.html", "https://twitter.com/hashtag/vaccineinjuries?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Covid_19?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Biontech?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Pfizer?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Vaccinesideeffects?src=hash&ref_src=twsrc%5Etfw", "https://t.co/YfOlTomtkl", "https://twitter.com/otrador/status/1635320872767729667?ref_src=twsrc%5Etfw", "https://twitter.com/Karl_Lauterbach/status/1426323236019650564", "https://twitter.com/AndrewLawton/status/1635723535887790081", "https://www.bundesgesundheitsministerium.de/en/topics.html", "https://www.pei.de/EN/newsroom/dossier/coronavirus/medicine-safety.html", "https://www.pei.de/SharedDocs/Downloads/EN/newsroom-en/dossiers/safety-reports/safety-report-27-december-2020-31-october-2022-from-bulletin-drug-safety-issue-4-2022-p-29-34.pdf", "https://muula.ch/en/actual-en/germany-pays-out-hundreds-of-corona-vaccine-claims-damages-pensions-pharmaceutical-industry-states-victims-treatment-costs-injuries-compensation-pfizer-biontech-moderna-swissmedic/", "https://www.welt.de/wirtschaft/plus243468575/Corona-Kosten-Ueberfluss-an-Impfdosen-und-Entschaedigungen-Im-Kaufrausch-Kontrolle-verloren.html", "https://www.science.org/content/article/it-s-very-special-picture-why-vaccine-safety-experts-put-brakes-astrazeneca-s-covid-19", "https://childrenshealthdefense.org/defender/jack-last-astrazeneca-covid-vaccine-death/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://twitter.com/BMG_Bund/status/1537474959584501766", "https://benchtobedside.uoguelph.ca/dr-byram-bridle/", "https://viralimmunologist.substack.com/p/bombshell-from-germanys-federal-minister", "https://correlation-canada.org/wp-content/uploads/2023/02/2023-02-09-Correlation-Age-stratified-vaccine-dose-fatality-Israel-Australia.pdf", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3", "https://ici.radio-canada.ca/rci/en/news/1792478/future-of-astrazeneca-covid-19-vaccine-in-question-in-canada-over-blood-clots-supply-issues", "https://twitter.com/stkirsch/status/1635370825577803776", "https://www.vacsafety.org/", "https://europeanconservative.com/articles/news/insurance-co-finds-vaccination-side-effects-under-reported-by-1000/", "https://www.europarl.europa.eu/meps/en/197475/CHRISTINE_ANDERSON/home", "https://www.europarl.europa.eu/doceo/document/E-9-2022-000811_EN.html", "https://europeanconservative.com/articles/news/german-health-insurer-director-fired/", "https://www.virchowbund.de/ueber-uns", "https://www.virchowbund.de/pressemitteilungen/details/schwurbel-bkk-gibt-falschen-alarm-bei-impfnebenwirkungen", "https://www.dw.com/en/germany-taps-epidemiologist-as-new-health-minister/a-60037004", "https://health.economictimes.indiatimes.com/news/policy/unvaccinated-health-staff-unacceptable-german-health-minister-says/88221427", "https://www.dw.com/en/germany-needs-jabs-not-omicrons-dirty-vaccination-health-minister/a-60366926", "https://www.dw.com/en/opinion-germanys-vaccine-mandate-was-a-disaster-in-the-making/a-61421424", "https://finance.yahoo.com/news/german-health-minister-wants-eu-074719739.html", "https://www.welt.de/debatte/plus244257011/Frisierter-Lebenslauf-Karl-Lauterbach-ist-von-Anfang-an-ein-Irrtum-gewesen-Ein-Kommentar.html", "https://www.haintz-legal.de/", "https://europeanconservative.com/articles/news/german-court-covers-for-health-minister/", "https://t.me/Haintz/29754", "https://childrenshealthdefense.org/defender/lockdown-files-united-kingdom-covid-pandemic-response/", "https://childrenshealthdefense.org/defender/uk-lockdown-files-covid-vaccine/", "https://www.thelocal.at/20230208/breaking-vienna-to-drop-its-mask-mandate-by-the-end-of-february", "https://www.cnn.gr/ellada/story/354081/telos-ta-metra-gia-tin-covid-poioi-periorismoi-payoun-na-isxyoun"], "authors": [], "publish_date": null}