{"result_id": "291021", "URL": "https://ca.childrenshealthdefense.org/school/how-to-stop-covid-19-vaccine-discrimination-at-your-school/", "timestamp": "2023-04-25 17:19:54 CEST+0200", "meta": {"description": "My daughter's school was distinguishing between the vaccinated and unvaccinated for in-person events. I changed their policy. You can, too!", "lang": "en", "keywords": "", "favicon": "https://ca.childrenshealthdefense.org/wp-content/uploads/2020/07/favicon-96x96-1-16x16.png", "canonical": "https://ca.childrenshealthdefense.org/school/how-to-stop-covid-19-vaccine-discrimination-at-your-school/", "encoding": "UTF-8"}, "image": null, "domain": "ca.childrenshealthdefense.org", "title": "How To Stop COVID-19 Vaccine Discrimination At Your School", "cleaned_text": "How To Stop COVID-19 Vaccine Discrimination At Your School\n\nWe recently published this article about schools (K-12) in Calif. who are illegally requiring the COVID-19 vaccine in order to attend school. In our follow-up newsletter, we asked you to share your stories. We were surprised at how many schools were violating Calif. law by requiring students to be COVID-19 vaccinated for in-person attendance. Other people wrote to let us know that their schools were distinguishing between the vaxxed and unvaxxed for in-person events and extracurricular activities. All public and private schools that are requiring the vaccine and still distinguishing between the vaccinated and unvaccinated are not only violating Calif. law, but are ignoring the regulations of the California Department of Public Health (CDPH) and the Centers for Disease Control and Prevention (CDC). This is medical discrimination.\n\nNOW is the time to speak up. Do NOT back down! This article is written for YOU!\n\nAuthor’s Note:\n\n I fought this battle a few months ago at my daughter’s high school, and I’m happy to report that logic prevailed. On September 21 of 2022, my daughter informed me that her Drama Teacher informed the class that students who were involved in on-stage “close contact” scenes and not vaccinated against COVID-19 would have to test twice weekly during rehearsal and performance season. The vaccinated students did not have to test.\n\nI immediately sprung into action. The entire process spanned nine days and included four emails and multiple phone calls, after which, it was determined that if testing was to take place, it would take place for all students involved.\n\nI am providing my emails as a resource you can use if your child’s school is distinguishing between vaccinated and unvaccinated students for in person events and extra curricular activities. Below you will find the strategy and the facts I used. If it worked for me, it can work for you!\n\nUse emails to provide written, documented communication as to why there should be no distinction between COVID-19 vaccinated and unvaccinated at your school.\n\nUse phone calls for “following up” and “checking in,” rather than leaving detailed facts.\n\nMaintain a record of your phone calls in writing, should you ever need to prove your communication attempts.\n\nSometimes it helps to read exactly what was written. I’ve uploaded all four of my emails to these links:\n\nGOOD PRACTICES THAT RESULT IN BETTER OUTCOMES\n\nThe goal is not to engage with anyone combatively while informing them know that the law is on your side. Explain clearly why distinguishing between the vaccinated and non-vaccinated amounts to medical discrimination.\n\nSpeak their language. Use their terminology. I used the words “legal,” “illegal,” “discrimination,” “equity,” and “equality,” A LOT.\n\nDon’t spew out empty threats when speaking of “equity,” “equality,” and “discrimination.” Back everything up with mainstream resources and government websites.\n\nDon’t use anything “fringe” or “conspiracy.” Even though you may agree with Mercola or Natural News, most likely, the administration will not and they will dismiss you, entirely.\n\nThere are PLENTY of official government sources and mainstream articles to communicate your point AND win!\n\nUse both phone calls and emails to follow up. After each email, leave a message to let the teacher/staff know that you just emailed them.\n\nIn each email, state when you are going to follow up. “I’ll follow up in a few days, or early next week…” And then set a reminder on your calendar to do so!\n\nMost likely, your kid’s teacher or the school nurse does not have the authority to change policy.\n\nFind out who does. And if the person in question is not telling you, offer to help them out by speaking to their “legal department” or “county health department.”\n\n\n\nI often played my phone calls a lot softer in tone than my emails. I would call to “just follow up,” and offer to “help speed up the process” by “talking to Legal” or “whomever at the district is in charge of making these decisions.” This strategy showed that I was serious and that I had nothing personally against the teacher, school, or department.\n\nWhether you like it or not, using the language of today is quite helpful in reminding the school that they are not following their own policies of equity and equality.\n\nRemind the school that they pride themselves on non-discriminatory policies and welcome all genders, sexual expressions, political and religious beliefs. Tell them how deeply you appreciate this non-discriminatory policy. Tell them how pleased you are that the school does not single out or discriminate against anyone, and remind them that discrimination of any sort, especially on school grounds is illegal.\n\nReiterate that you hope that the school adheres to the principles of equity and equality in this situation, and does not discriminate against students who are medically different from their peers. Discrimination is illegal.\n\nI often repeated myself in these emails to get the point across. My general stance can be summarized, as follows:\n\n“It is my presumption that testing the unvaccinated is to determine whether they are infected with COVID-19 and might, unintentionally, pass on the infection to the vaccinated. Though this policy has little to no basis in science — we have known for a long time that the vaccine does not prevent transmission nor infection —it was the official stance of the CDC and the CDPH up until recently. In fall of 2021, our administration admitted that the vaccine does not prevent transmission or infection. In fall of 2022, our administration officially changed their policy to reflect these facts.\n\nThis explains why the school may have followed this policy in the past. However, official guidance and policies in regards to COVID-19 testing and transmission for both vaccinated and non-vaccinated have changed on both the state and the federal level.\n\nIn distinguishing between the vaccinated and non-vaccinated, you will be actively engaging in medical discrimination, which is illegal and violates all school codes of ethics, equity and equality.”\n\nTimeline of Official Statements and Policy Changes\n\nOctober 21, 2021 – Vaccines Do Not Prevent Transmission\n\n CDC Director Rochelle Walensky admits to Wolf Blitzer on live TV that vaccines no longer prevent transmission and that the vaccinated can be asymptomatic and pass the virus. – October 21, 2021. To view Walensky stating this on live TV, click here\n\nOctober 28, 2021\n\n “Covid:” Double vaccinated can still spread the virus.” – The BBC\n\nMy summary: “Based on the October 2021 official admission, our policies should have been changed immediately to recommend either testing of ALL individuals or the testing of none The same logic applied to verify testing the unvaccinated should have been immediately applied similarly to the vaccinated. “\n\nJune 23, 2022 – CDC Publishes, “COVID-19 after Vaccination: Possible Breakthrough Infection.”\n\n “People who get vaccine breakthrough infections can spread COVID-19 to other people. When a community reports more COVID-19 infections, that means more virus is circulating.” CDC\n\n\n\nAugust 11, 2022 – All Persons To Be Treated Equally. CDC adjusts official recommendations for all persons, irregardless of vaccine status.\n\n“BREAKING: CDC guidelines have been revised and COVID rules have been relaxed. The new guidance lifts the requirement to quarantine if exposed to the virus, deemphasizes screening people with no symptoms and updates COVID-19 protocols in schools. It is no longer recommended to screen those without symptoms. ” – NPR\n\n\n\n August 24, 2022 – Screening Update for High Risk Settings\n\n “Screening testing is no longer recommended in general community settings, and while screening testing may still be considered in high-risk settings, if implemented it should include all persons, irrespective of vaccination status, given the recent variants and sub-variants with significant immune evasion. “ – CDC\n\nSeptember 13, 2022 – CDPH Rescinds All Testing of Unvaccinated School and Healthcare Workers\n\n“Effective Saturday, September 17, 2022 — ‘The California Department of Public Health (CDPH) is ending COVID-19 policies that required weekly testing for unvaccinated individuals in high-risk workplaces and schools.’ ” – MSN September 13, 2022\n\n“To better align state COVID-19 guidance with the most current federal recommendations, the California Department of Public Health (CDPH) is ending COVID-19 policies that required weekly COVID-19 testing for unvaccinated individuals in high-risk workplaces and schools. Health care facilities, other congregate settings and schools will no longer be required to administer weekly COVID-19 testing of unvaccinated and under vaccinated workers. The changes take effect this Saturday, September 17, 2022.”— CDPH", "opengraph": {"locale": "en_US", "type": "article", "title": "How To Stop COVID-19 Vaccine Discrimination At Your School - Children's Health Defense California Chapter", "description": "My daughter's school was distinguishing between the vaccinated and unvaccinated for in-person events. I changed their policy. You can, too!", "url": "https://ca.childrenshealthdefense.org/school/how-to-stop-covid-19-vaccine-discrimination-at-your-school/", "site_name": "Children's Health Defense California Chapter", "article:published_time": "2023-02-22T22:08:45+00:00", "image": "https://ca.childrenshealthdefense.org/wp-content/uploads/discrimination_separation_2072763011-scaled-e1677102450236.jpeg", "image:width": "900", "image:height": "377", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ca.childrenshealthdefense.org/uncategorized/california-schools-requiring-covid-19-shot-are-breaking-california-law/?itm_term=home", "https://ca.childrenshealthdefense.org/wp-content/uploads/Email-1-HOW-To-article.pdf", "https://ca.childrenshealthdefense.org/wp-content/uploads/Email-2-How-To-article.pdf", "https://ca.childrenshealthdefense.org/wp-content/uploads/EMAIL-3-How-TO-article.pdf", "https://ca.childrenshealthdefense.org/wp-content/uploads/EMAIL-4-How-TO-article.2.pdf", "https://www.facebook.com/watch/?v=1236084540199715", "https://www.bbc.com/news/health-59077036", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/how-covid-spreads.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/effectiveness/why-measure-effectiveness/breakthrough-cases.html", "https://twitter.com/NPR/status/1557810406000922625", "https://www.cdph.ca.gov/Programs/CID/DCDC/Pages/COVID-19/Order-of-the-State-Public-Health-Officer-Adult-Care-Facilities-and-Direct-Care-Worker-Vaccine-Requirement.aspx?ceid=22239067&emci=9f60c9cf-5834-ed11-ae83-281878b83d8a&emdi=35900084-7734-ed11-ae83-281878b83d8a", "https://www.msn.com/en-us/health/other/state-ends-weekly-covid-19-testing-requirement-for-workers/ar-AA11Nmb6", "https://www.cdph.ca.gov/Programs/OPA/Pages/NR22-142.aspx"], "authors": ["California Archive"], "publish_date": "2023-02-22T22:08:45+00:00"}