{"result_id": "291016", "URL": "https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "timestamp": "2023-04-25 17:19:49 CEST+0200", "meta": {"description": "A 38-page report included in the released documents features an Appendix, “LIST OF ADVERSE EVENTS OF SPECIAL INTEREST,” that lists 1,291 different adverse events following vaccination. “At least now we know why the FDA and Pfizer wanted to keep this data under wraps for 75 years. These findings should put an immediate end to the Pfizer COVID vaccines. The potential for serious harm is very clear, and those injured by the vaccines are prohibited from suing Pfizer for damages,” said Children’s Health Defense (CHD) president and general counsel Mary Holland.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "CHD Says Pfizer Clinical Trial Data Contradicts ‘Safe and Effective’ Government/Industry Mantra", "cleaned_text": "Washington, DC, March 3, 2022 – An estimated 10,000-page set of documents released by the U.S. Food and Drug Administration’s (FDA’s) Center for Biologics Evaluation and Research (CBER), as ordered by U.S. District Judge Mark T. Pittman, allows the public to access data Pfizer submitted to FDA from its clinical trials in support of a COVID-19 vaccine license. Prior to Judge Pittman’s ruling, the FDA planned to suppress the data for the next 75 years which the agency claimed was necessary, in part, because of its “limited resources.”\n\nA 38-page report included in the documents features an Appendix, “LIST OF ADVERSE EVENTS OF SPECIAL INTEREST,” that lists 1,291 different adverse events following vaccination. The list includes acute kidney injury, acute flaccid myelitis, anti-sperm antibody positive, brain stem embolism, brain stem thrombosis, cardiac arrest, cardiac failure, cardiac ventricular thrombosis, cardiogenic shock, central nervous system vasculitis, death neonatal, deep vein thrombosis, encephalitis brain stem, encephalitis hemorrhagic, frontal lobe epilepsy, foaming at mouth, epileptic psychosis, facial paralysis, fetal distress syndrome, gastrointestinal amyloidosis, generalized tonic-clonic seizure, Hashimoto’s encephalopathy, hepatic vascular thrombosis, herpes zoster reactivation, immune-mediated hepatitis, interstitial lung disease, jugular vein embolism, juvenile myoclonic epilepsy, liver injury, low birth weight, multisystem inflammatory syndrome in children, myocarditis, neonatal seizure, pancreatitis, pneumonia, stillbirth, tachycardia, temporal lobe epilepsy, testicular autoimmunity, thrombotic cerebral infarction, Type 1 diabetes mellitus, venous thrombosis neonatal, and vertebral artery thrombosis among 1,246 other medical conditions following vaccination.\n\n“At least now we know why the FDA and Pfizer wanted to keep this data under wraps for 75 years,” said Children’s Health Defense (CHD) president and general counsel Mary Holland. “The clinical trial data released so far should put an immediate end to the Pfizer COVID vaccines. The potential for serious harm is very clear, and those injured by the vaccines are prohibited from suing Pfizer for damages.”\n\nThe U.S. government has already purchased 50 million doses of the Pfizer vaccine intended for children under five years of age to be delivered by April 30, 2022 although the FDA has yet to grant an Emergency Use Authorization (EUA) for this age group. The risk of serious injury or death from COVID to healthy children is practically nil and so far, the vaccine is not effective when used in young children.\n\nAccording to The Guardian, “Pfizer made nearly $37bn (£27bn) in sales from its Covid-19 vaccine last year – making it one of the most lucrative products in history – and has forecast another bumper year in 2022, with a big boost coming from its Covid-19 pill Paxlovid.” President Biden advertised Paxlovid in his State of the Union address on Tuesday, the same day that additional Pfizer data was released to the public. “We’re launching the ‘Test to Treat’ initiative so people can get tested at a pharmacy, and if they’re positive, receive antiviral pills on the spot at no cost,” Biden said during his speech.\n\nFrom mid-December, 2020 through February 18, 2022, the U.S. government’s database, the Vaccine Adverse Events Reporting System (VAERS), has received 1,134,984 reports of adverse events, including 24,402 deaths, following COVID vaccination. Additionally, there have been 4,021 cases of myocarditis and pericarditis in the U.S. with 2,475 cases associated with Pfizer, 1,364 cases with Moderna and 171 cases with J&J’s COVID vaccine. These include 643 reports of myocarditis and pericarditis in children aged 12 to 17.\n\n“It would be criminal to expose infants and young children to this extremely risky product,” said Holland. “VAERS data show the catastrophic health impacts the vaccine is having on millions of people, yet Pfizer and other vaccine makers are raking in billions of dollars with no fear of being held accountable for injuries and deaths from their vaccines.”\n\nThe FDA’s attempt to suppress these data in support of the pharmaceutical industry’s bottom line isn’t a new phenomenon in this country’s public health system. For more information on pharmaceutical corruption and the tight relationship the industry has with government regulatory agencies, read The Real Anthony Fauci: Bill Gates, Big Pharma and the Global War on Democracy and Public Health by CHD Chair and lead counsel Robert F. Kennedy, Jr.\n\nChildren’s Health Defense is a 501(c)(3) non-profit organization. Its mission is to end childhood health epidemics by working aggressively to eliminate harmful exposures, hold those responsible accountable, and establish safeguards to prevent future harm. For more information, visit ChildrensHealthDefense.org.\n\nThe press release originally stated that 55,000 documents were released this week. 55,000 documents is the number to be released per month after August 2022 after an initial dumping of approximately 300,000 pages before then as ordered by Judge Pittman on February 2nd. An estimated 10,000 documents were released last week.\n\nAdding to confusion, the February 2nd ruling clarifies the January 6th ruling by the same judge. On January 6th, court records state: “The FDA shall produce the remaining documents at a rate of 55,000 pages every 30 days, with the first production being due on or before March 1, 2022, until production is complete.” On February 2nd, court records state: “The FDA will produce 10,000 pages for the first two productions, which will be due on or before March 1 and April 1, 2022. The FDA will produce 80,000 pages on or before May 2, June 1, and July 1, 2022; 70,000 pages on or before August 1, 2022; and then 55,000 pages on or before the first business day of each month thereafter.”\n\nThe press release also mentioned that this is the first time that the public got to see these latest documents released on March 1 but was misinterpreted to mean all of the Pfizer data that has been released to date. The data dumps began in November 2021.", "opengraph": {"locale": "en_US", "type": "article", "title": "CHD Says Pfizer Clinical Trial Data Contradicts ‘Safe and Effective’ Government/Industry Mantra", "description": "A 38-page report included in the released documents features an Appendix, “LIST OF ADVERSE EVENTS OF SPECIAL INTEREST,” that lists 1,291 different adverse events following vaccination. “At least now we know why the FDA and Pfizer wanted to keep this data under wraps for 75 years. These findings should put an immediate end to the Pfizer COVID vaccines. The potential for serious harm is very clear, and those injured by the vaccines are prohibited from suing Pfizer for damages,” said Children’s Health Defense (CHD) president and general counsel Mary Holland.", "url": "https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:published_time": "2022-03-03T22:08:34+00:00", "article:modified_time": "2022-03-08T16:27:30+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/FDA-PFAS-in-food-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer.php?u=https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "https://www.twitter.com/intent/tweet?url=https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "mailto:?subject=CHD Says Pfizer Clinical Trial Data Contradicts ‘Safe and Effective’ Government/Industry Mantra&body=https://childrenshealthdefense.org/press-release/chd-says-pfizer-clinical-trial-data-contradicts-safe-and-effective/", "https://www.sirillp.com/wp-content/uploads/2022/01/ORDER_2022_01_06-9e24e298ae561d16d68a3950ab57077b.pdf", "https://news.bloomberglaw.com/health-law-and-business/why-a-judge-ordered-fda-to-release-covid-19-vaccine-data-pronto", "https://childrenshealthdefense.org/wp-content/uploads/pfizer-doc-5.3.6-postmarketing-experience.pdf#page=30", "https://www.forbes.com/sites/roberthart/2021/10/28/us-purchases-additional-50-million-pediatric-doses-of-covid-19-vaccine-pfizer-says/?sh=bc72ae82e624", "https://www.medrxiv.org/content/10.1101/2021.11.30.21267048v1", "https://s3.amazonaws.com/media2.fairhealth.org/whitepaper/asset/Risk%20Factors%20for%20COVID-19%20Mortality%20among%20Privately%20Insured%20Patients%20-%20A%20Claims%20Data%20Analysis%20-%20A%20FAIR%20Health%20White%20Paper.pdf", "https://www.statnews.com/2022/02/28/pfizer-covid-vaccine-kids-5-11/", "https://www.theguardian.com/business/2022/feb/08/pfizer-covid-vaccine-pill-profits-sales", "https://phmpt.org/pfizers-documents/", "https://www.cnbc.com/2022/03/01/joe-biden-state-of-the-union-address-live-updates.html", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Myocarditis+%2810028606%29&SYMPTOMS%5B%5D=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Myocarditis+%2810028606%29&SYMPTOMS%5B%5D=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Myocarditis+%2810028606%29&SYMPTOMS%5B%5D=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Myocarditis+%2810028606%29&SYMPTOMS%5B%5D=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Myocarditis+%2810028606%29&SYMPTOMS%5B%5D=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.nytimes.com/2022/02/20/health/covid-cdc-data.html", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens-ebook/dp/B08X5YWRRP/ref=sr_1_2?crid=1HSM6HNF3Z258&keywords=Kennedy+Fauci&qid=1646324850&sprefix=kennedy+fa%2Caps%2C535&sr=8-2", "https://childrenshealthdefense.org/about-us/sign-up/", "https://childrenshealthdefense.org/about-us/donate/"], "authors": ["Ram Basu"], "publish_date": "2022-03-03T22:08:34+00:00"}