{"result_id": "292032", "URL": "https://www.eutimes.net/2023/01/bill-gates-vows-to-pump-mrna-into-food-supply-to-force-jab-the-unvaccinated/", "timestamp": "2023-04-25 17:21:03 CEST+0200", "meta": {"description": "As the globalist elite continue finding it harder and harder to convince humanity to submit to Covid jabs and endless boosters, they are having to find cunning new ways to force their jabs on us. Reporting on the globalist elite is a full time job because, as the Bible tells us, wicked doesn’t sleep. Take", "lang": "en", "keywords": "bill gates,boosters,covid-19,food,mrna,unvaccinated,vaccines,breaking news,crimes,disasters,health,immorality,north america", "favicon": "https://www.eutimes.net/wp-content/themes/newswire/images/favicon.ico", "canonical": "https://www.eutimes.net/2023/01/bill-gates-vows-to-pump-mrna-into-food-supply-to-force-jab-the-unvaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "www.eutimes.net", "title": "Bill Gates Vows To Pump mRNA Into Food Supply To 'Force-Jab' the Unvaccinated", "cleaned_text": "Home » Breaking News, Crimes, Disasters, Health, Immorality, North America » Bill Gates Vows To Pump mRNA Into Food Supply To 'Force-Jab' the Unvaccinated\n\nAs the globalist elite continue finding it harder and harder to convince humanity to submit to Covid jabs and endless boosters, they are having to find cunning new ways to force their jabs on us.\n\nReporting on the globalist elite is a full time job because, as the Bible tells us, wicked doesn’t sleep. Take Bill Gates as a case in point. Rather than admitting that humanity has woken up to the truth about the disastrous experimental Covid-19 jabs, Gates, who is not a doctor, is doubling down and taking it upon himself to vaccinate the world by stealth.\n\nAccording to the billionaire eugenicist, farm animals including cows, pigs and chickens have inadequate genetics. And the only way to “fix” those genetics is to “vaccinate” every farm animal in the world with new mRNA vaccines.\n\nGates, who was divorced by his wife due to his close relationship with deceased pedophile Jeffrey Epstein, visited the University of Edinburgh‘s Langhill Farm to launch the school’s Global Academy of Agriculture and Food Security.\n\nRather than beating around the bush and obfuscating, as he used to do before the Covid pandemic, Gates appeared comfortable bragging about pumping mRNA vaccines into farm animals destined for dinner plates.\n\nGates is becoming increasingly arrogant and no longer feels any shame whatsoever about openly broadcasting his true intentions for the planet right in plain sight.\n\nUnless all animals, including food animals, are jabbed with Big Pharma’s latest poisons, the food supply will remain “dirty,” in Gates’ view. Only he and his globalist minions can “sanitize” nature with new chemicals and DNA modification techniques – which they are also trying to do to humans.\n\n“The Gates Foundation is partnered with DFID on a great number of things, and among those are work we do together on livestock,” Gates stated, referring to the United Kingdom-based Department for International Development.\n\n“Helping animals survive, either by having vaccines or better genetics, helping them be more productive – it’s making a big difference.”\n\nAs he usually does, Gates started all this by playing God with the lives of other people, experimenting on the third world, which he views as his personal fiefdom.\n\nAccording to Robert F. Kennedy Jr., anyone who is prepared to allow Bill Gates to dictate world and US health policy should take a long, hard look at his record in Africa.\n\n“Perhaps millions of children have died unnecessarily,” according Kennedy Jr., who shared information from a peer-reviewed publication in a respected journal.\n\n“Anyone defending Bill Gates & WHO needs to explain Morgensen et al 2017.“\n\n“This is a peer-reviewed publication in a respected journal by leading scientists describing outcomes akin to genocide,” said Kennedy Jr.\n\nRobert F. Kennedy Jr. also slammed Gates and his “messianic conviction that he is ordained to save the world with technology.”\n\n“Vaccines, for Bill Gates, are a strategic philanthropy that feed his many vaccine-related businesses (including Microsoft’s ambition to control a global vac ID enterprise) and give him dictatorial control over global health policy—the spear tip of corporate neo-imperialism,” Kennedy Jr. wrote.\n\n“Gates’ obsession with vaccines seems fueled by a messianic conviction that he is ordained to save the world with technology and a god-like willingness to experiment with the lives of lesser humans.”\n\nSince Gates views poor people as having less value than himself, they get to be the guinea pigs for all of his newfangled endeavors to change the entire world into his own image.\n\nThe question remains, though: are those eggs actually safe? Is that meat fit for human consumption? Or does it contain the very same mRNA modifications that occur in humans after getting injected for “Covid?” What will these injections do to the food that is produced and sold to the masses?\n\n“We will soon be eating DNA altered, sickened animals from the same mRNA jabs contributing to the ‘Died Suddenly’ pandemic,” warned a Twitter account called “DJ Freedom Rocket.” “What could possibly go wrong …”\n\nAnother account responded to this that, apparently, we already are eating “fully vaccinated” animal products, not to mention all the genetically modified (GMO) plant products that have been on the market and in the food supply for decades.\n\n“Are you aware of reports that Pharma now is looking to inject mRNA into foods?” this same account asked. “Into fruits and veggies? Into animal feed? Into fake vaccines for farm animals. Malthusians intend to poison our food supply.”\n\nAll of this has been many years in the making. Thirteen years ago, Gates met with other globalists including Warren Buffett, David Rockefeller, George Soros, Michael Bloomberg, Ted Turner, Oprah Winfrey, to conjure up a coordinated response to the “problem” of population growth, which all of these figures see as a threat to the “human race” – meaning themselves and their ill-gotten wealth and lavish lifestyles, which were built on the backs of the very people they are now attempting to exterminate.\n\nGates has acquired 270,000 acres of land throughout America, according to last year’s edition of the Land Report 100, an annual survey of the nation’s largest landowners. He has his eye on farming in Sub-Saharan Africa and South Asia as well.\n\nAnalysts are now connecting the dots on his agenda on the mass vaccination and gene-modification projects of livestock and his purchases of farmlands. Critics can’t help but worry that the global elite’s agenda of hijacking the food supply is slowly being carried out.\n\nIn January 2020, the Gates Foundation announced the creation of a non-profit entity called Gates Ag One, which aims to “speed up efforts to provide smallholder farmers in developing countries … with access to the affordable tools and innovations they need to sustainably improve crop productivity and adapt to the effects of climate change.”\n\nThe launch came shortly before the failure of the Alliance for a Green Revolution in Africa (AGRA), which was founded in 2006 by the businessman’s foundation as well as the Rockefeller Foundation.\n\n“Apart from the obvious financial return on his investment, why else would Gates be interested in genetically engineering livestock? While we don’t know the inner workings of the minds of the globalists, we could consider a couple of theories which, ultimately, end with the same result – ownership, and control by a few self-appointed elites with Gates as their frontman,” the Expose‘s Rhoda Wilson commented.\n\nOne possible goal of Gates in pushing the GM of farm animals is to decimate them and force people to eat lab-grown inorganic substitute foods in the future, essentially eliminating the people’s freedom to choose.\n\nJacob Bruns, writing for Headline USA, explains, “In the view of the world’s billionaires, religious and political ‘obstacles’ remain that might get in the way of their mass experimentation.” And he couldn’t be more right.\n\nIt’s not coincidence that the globalist elite at the World Economic Forum are actively working to subvert religion and convince humanity that God is dead and Jesus is fake news.\n\nThey global elite, led by figures such as Klaus Schwab and Bill Gates, are like cartoon villains at this point. Except that they’re real and incredibly dangerous.\n\nHere at the People’s Voice we are determined to continue publishing and broadcasting the news that the mainstream media does not dare to touch. But we can’t do it alone. We need your help to spread the truth far and wide. Please join us in our mission to educate the masses about what is really happening behind the scenes in the world today. We are all in this together.\n• Australia has silently withdrawn its authorization for the AstraZeneca COVID-19 vaccine\n\nDid you like this information? Then please consider making a donation or subscribing to our Newsletter.", "opengraph": {"locale": "en_US", "site_name": "The European Union Times - World News, Breaking News", "type": "article", "title": "Bill Gates Vows To Pump mRNA Into Food Supply To 'Force-Jab' the Unvaccinated", "description": "As the globalist elite continue finding it harder and harder to convince humanity to submit to Covid jabs and endless boosters, they are having to find cunning new ways to force their jabs on us. Reporting on the globalist elite is a full time job because, as the Bible tells us, wicked doesn’t sleep. Take", "url": "https://www.eutimes.net/2023/01/bill-gates-vows-to-pump-mrna-into-food-supply-to-force-jab-the-unvaccinated/", "image": "https://eurolandexperience.files.wordpress.com/2023/01/gates-vaccine-hesitancy.jpg", "image:secure_url": "https://eurolandexperience.files.wordpress.com/2023/01/gates-vaccine-hesitancy.jpg", "article:tag": "north america", "article:published_time": "2023-01-11T16:31:07+00:00", "article:modified_time": "2023-01-14T12:51:28+00:00", "article:publisher": "https://www.facebook.com/EUTimesNET/"}, "tags": ["COVID-19", "Vaccines", "Bill Gates", "Food", "Boosters", "mRNA", "Unvaccinated"], "tweets": [], "movies": [], "links": ["https://twitter.com/intent/tweet", "https://www.pinterest.com/pin/create/button/", "https://embed.tumblr.com/share", "//www.reddit.com/submit", "https://headlineusa.com/concerns-grow-over-depopulationist-plan-to-vaccinate-food-supply/", "https://landreport.com/2021/01/farmer-bill/", "https://newspunch.com/bill-gates-vows-to-pump-mrna-into-food-supply-to-force-jab-the-unvaccinated/", "https://telegram.me/share/url?url=https%3A%2F%2Fbit.ly%2F3QAcM7u&text=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "http://reddit.com/submit?url=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "https://bit.ly/3QAcM7u", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated&caption=", "https://www.instagram.com/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "https://connect.ok.ru/dk?cmd=WidgetSharePreview&st.cmd=WidgetSharePreview&st.shareUrl=https%3A%2F%2Fbit.ly%2F3QAcM7u&st.client_id=-1", "http://vkontakte.ru/share.php?&url=https%3A%2F%2Fbit.ly%2F3QAcM7u", "http://digg.com/submit?url=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "https://www.evernote.com/clip.action?url=https%3A%2F%2Fbit.ly%2F3QAcM7u&title=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated", "https://mix.com/mixit?url=https%3A%2F%2Fbit.ly%2F3QAcM7u", "https://api.whatsapp.com/send?text=Bill%20Gates%20Vows%20To%20Pump%20mRNA%20Into%20Food%20Supply%20To%20%27Force-Jab%27%20the%20Unvaccinated https%3A%2F%2Fbit.ly%2F3QAcM7u", "http://www.printfriendly.com/print?url=https%3A%2F%2Fbit.ly%2F3QAcM7u&partner=a2a", "https://bit.ly/3QAcM7u", "https://www.eutimes.net/2023/04/rising-food-prices-persist-across-the-eu/", "https://www.eutimes.net/2023/04/eu-condemns-unilateral-ban-on-ukrainian-grain-by-poland-hungary/", "https://www.eutimes.net/2023/04/pfizer-backed-cdc-project-targeting-vaccine-critics-with-psyops/", "https://www.eutimes.net/2023/04/switzerland-halts-covid-vaccinations-cites-harmful-effects/", "https://www.eutimes.net/2023/04/australia-has-silently-withdrawn-its-authorization-for-the-astrazeneca-covid-19-vaccine/", "https://www.eutimes.net/donations/", "https://feedburner.google.com/fb/a/mailverify?uri=TheEuropeanUnionTimes"], "authors": [], "publish_date": "2023-01-11T16:31:07+00:00"}