{"result_id": "292005", "URL": "https://www.eutimes.net/2022/07/german-government-admits-covid-vaccines-cause-serious-injury/", "timestamp": "2023-04-25 17:20:43 CEST+0200", "meta": {"description": "The German Government publicly acknowledged on Wednesday that the Covid vaccines cause serious side effects for one in every 5,000 doses. A tweet from the Ministry of Health stated (via Google translate): “One in 5,000 people is affected by a serious side effect after a COVID19 #vaccination. If you suspect #sideeffects, get medical attention and", "lang": "en", "keywords": "berlin,covid-19,german government,germany,injury,side effects,vaccines,europe,health,statistics / polls,survival", "favicon": "https://www.eutimes.net/wp-content/themes/newswire/images/favicon.ico", "canonical": "https://www.eutimes.net/2022/07/german-government-admits-covid-vaccines-cause-serious-injury/", "encoding": "UTF-8"}, "image": null, "domain": "www.eutimes.net", "title": "German Government Admits COVID Vaccines Cause Serious Injury", "cleaned_text": "The German Government publicly acknowledged on Wednesday that the Covid vaccines cause serious side effects for one in every 5,000 doses.\n\nA tweet from the Ministry of Health stated (via Google translate): “One in 5,000 people is affected by a serious side effect after a COVID19 #vaccination. If you suspect #sideeffects, get medical attention and report your symptoms to @PEI_Germany.” It later added a correction that the figure related to the reporting rate and to doses rather than individuals: “Correction: According to @PEI_Germany, the reporting rate for serious reactions is 0.2 reports per 1,000 vaccine doses.”\n\nThis is an unusual and welcome admission from a Government, and perhaps the beginning of governments properly acknowledging the scale of injuries caused by the novel Covid vaccines.\n\nHowever, the one in 5,000 figure (the source for which is not stated) is certainly on the low side. The correction tweet clarified that it was a reporting rate of serious reactions, so perhaps it refers to the rate of adverse event reports to the German equivalent of the Yellow Card and VAERS passive reporting systems. If so, then we might expect an under-reporting factor of around 10, meaning the true number of serious side-effects may be 10 times higher.\n\nThe Germans are actually very good at monitoring vaccine safety. In addition to their passive reporting system, the German medicine regulator, the PEI, runs an active vaccine safety monitoring app called SafeVac 2.0. The data from this monitoring tool were included in a Europe-wide report on vaccine safety last month, and showed that 0.3% of vaccine recipients in Germany reported at least one serious adverse reaction to the first dose of the vaccine. The report states:\n\nOf the 520,076 participants from Germany who had received the first dose of a COVID-19 vaccine, 1,838 (0.3%) reported experiencing at least one serious adverse reaction. A total of 1,191 (0.2%) and 39 (0.2%) participants receiving BioNTech/Pfizer and Moderna respectively reported experiencing a serious adverse reaction while 608 (0.7%) receiving AstraZeneca reported a serious reaction.\n\nThese German figures are in line with the overall rates across Europe, according to the report: “Across the sites 0.2-0.3% reported at least one serious adverse reaction after receiving the first and/or the second dose.”\n\nNote, however, that a rate of 0.3% is 15 times higher than the rate of 0.2 per 1,000 (i.e., 0.02%) quoted in the tweet. If the figure in the tweet comes, as we supposed, from a passive reporting system (which seems likely as the tweet directs readers to the PEI’s passive reporting portal), this would be an under-reporting factor of 15, which is about what we expected.\n\nBut why, then, is the German Government using the 0.02% figure instead of the 0.3% figure from its state-of-the-art vaccine safety monitoring tool when drawing attention to vaccine side effects? I’d like to think that question didn’t answer itself.\n\nIn addition, it wasn’t easy to find the SafeVac 2.0 data. I searched in vain for them on the PEI website; if they’re there then they are nowhere obvious. In the end I could only find them, via a general web search, embedded in the Europe-wide study cited above.\n\nWorries about high rates of serious vaccine side effects have been raised before in Germany. In May, Professor Harald Matthes, a scientist leading a separate study into the safety of the vaccines, said that according to his data around 0.8% of vaccinated people in Germany were struggling with serious side-effects. This was in line with international evidence, he said, and much more needs to be done to help them.\n\nThe number is not surprising. It corresponds to what is known from other countries such as Sweden, Israel or Canada. Incidentally, even the manufacturers of the vaccines had already determined similar values ​​in their studies… Most side effects, including severe ones, subside after three to six months, 80% heal. But unfortunately there are also some that last much longer.\n\nIn view of around half a million cases with serious side effects after Covid vaccinations in Germany, we doctors have to take action. We have to come to therapy offers, discuss them openly at congresses and in public without being considered anti-vaccination.\n\nA board member of a large German insurance company also spoke out in February saying that his company’s data showed serious vaccine injuries running at around 10 times the rate reported by the German Government.\n\nElsewhere, an Israeli Government survey found that 0.3% of vaccinated people reported being hospitalised as a result of their Covid vaccination, while a U.S. CDC survey found 0.9% of vaccinated people reported seeking medical care as a result of their vaccination.\n\nThe evidence is notably consistent, then, that 0.3-0.9% of vaccinated people (the exact percentage partly depending on the number of doses) suffer a serious reaction to the vaccine that leads them to require medical care or hospitalisation.\n\nThese data should be much more widely known as part of obtaining informed consent. Everyone who receives a Covid vaccine should have been told in writing that the rate of serious side effects is around one in 300 doses (with variations for age and sex). Note that such a frequency is properly termed ‘uncommon’, rather than ‘rare’, as the serious side effects are currently labelled. This is an extremely high frequency for a vaccine of course, and raises serious questions about whether they should be approved at all, especially for younger age groups.\n\nInstead, hardly anyone knows that these are the Government’s own data on serious vaccine reactions, and governments are making no obvious effort to tell them.\n\nSo, it’s one cheer for the German Government for actually doing something to raise awareness of serious vaccine side effects. But next time, maybe use the actual data, rather than a figure that’s 15 times smaller.\n• Australia has silently withdrawn its authorization for the AstraZeneca COVID-19 vaccine\n\nDid you like this information? Then please consider making a donation or subscribing to our Newsletter.", "opengraph": {"locale": "en_US", "site_name": "The European Union Times - World News, Breaking News", "type": "article", "title": "German Government Admits COVID Vaccines Cause Serious Injury", "description": "The German Government publicly acknowledged on Wednesday that the Covid vaccines cause serious side effects for one in every 5,000 doses. A tweet from the Ministry of Health stated (via Google translate): “One in 5,000 people is affected by a serious side effect after a COVID19 #vaccination. If you suspect #sideeffects, get medical attention and", "url": "https://www.eutimes.net/2022/07/german-government-admits-covid-vaccines-cause-serious-injury/", "image": "https://i.postimg.cc/6q6GTGz1/Germany-Needle.jpg", "image:secure_url": "https://i.postimg.cc/6q6GTGz1/Germany-Needle.jpg", "article:tag": "survival", "article:published_time": "2022-07-22T15:06:04+00:00", "article:modified_time": "2022-07-22T15:06:04+00:00", "article:publisher": "https://www.facebook.com/EUTimesNET/"}, "tags": ["Berlin", "Injury", "German Government", "COVID-19", "Side Effects", "Vaccines", "Germany"], "tweets": [], "movies": [], "links": ["https://twitter.com/intent/tweet", "https://www.pinterest.com/pin/create/button/", "https://embed.tumblr.com/share", "//www.reddit.com/submit", "https://dailysceptic.org/2022/07/21/german-government-acknowledges-covid-vaccines-cause-serious-injury-for-one-in-5000-doses-but-its-own-data-show-the-real-rate-is-one-in-300-doses/", "https://telegram.me/share/url?url=https%3A%2F%2Fbit.ly%2F3zmkdId&text=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "http://reddit.com/submit?url=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "https://bit.ly/3zmkdId", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury&caption=", "https://www.instagram.com/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "https://connect.ok.ru/dk?cmd=WidgetSharePreview&st.cmd=WidgetSharePreview&st.shareUrl=https%3A%2F%2Fbit.ly%2F3zmkdId&st.client_id=-1", "http://vkontakte.ru/share.php?&url=https%3A%2F%2Fbit.ly%2F3zmkdId", "http://digg.com/submit?url=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "https://www.evernote.com/clip.action?url=https%3A%2F%2Fbit.ly%2F3zmkdId&title=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury", "https://mix.com/mixit?url=https%3A%2F%2Fbit.ly%2F3zmkdId", "https://api.whatsapp.com/send?text=German%20Government%20Admits%20COVID%20Vaccines%20Cause%20Serious%20Injury https%3A%2F%2Fbit.ly%2F3zmkdId", "http://www.printfriendly.com/print?url=https%3A%2F%2Fbit.ly%2F3zmkdId&partner=a2a", "https://bit.ly/3zmkdId", "https://www.eutimes.net/2023/04/pfizer-backed-cdc-project-targeting-vaccine-critics-with-psyops/", "https://www.eutimes.net/2023/04/switzerland-halts-covid-vaccinations-cites-harmful-effects/", "https://www.eutimes.net/2023/04/australia-has-silently-withdrawn-its-authorization-for-the-astrazeneca-covid-19-vaccine/", "https://www.eutimes.net/2023/04/australians-facing-unprecedented-rise-in-mortality-rates-but-leaders-stay-silent/", "https://www.eutimes.net/2023/04/german-man-thrown-on-train-tracks-by-syrian-migrants/", "https://www.eutimes.net/donations/", "https://feedburner.google.com/fb/a/mailverify?uri=TheEuropeanUnionTimes"], "authors": [], "publish_date": "2022-07-22T15:06:04+00:00"}