{"result_id": "292026", "URL": "https://www.eutimes.net/2021/09/israeli-study-shows-natural-immunity-27-times-more-effective-against-covid-delta-variant-than-vaccine/", "timestamp": "2023-04-25 17:20:58 CEST+0200", "meta": {"description": "Natural immunity from contracting coronavirus provides people with longer-lasting protection against the so-called ‘Delta variant’ than two shots of the experimental Pfizer “vaccine” rolled out early this year, new Israeli research suggests: The study by Maccabi Healthcare Service looked at individuals who had either gotten two shots of the vaccine by the end of February", "lang": "en", "keywords": "bar-ilan university,covid-19,cyrille cohen,delta variant,immunity,israel,pfizer,tel aviv,vaccine,biology,middle east,science", "favicon": "https://www.eutimes.net/wp-content/themes/newswire/images/favicon.ico", "canonical": "https://www.eutimes.net/2021/09/israeli-study-shows-natural-immunity-27-times-more-effective-against-covid-delta-variant-than-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.eutimes.net", "title": "Israeli Study Shows Natural Immunity 27 Times More Effective Against COVID Delta Variant Than Vaccine", "cleaned_text": "Home » Biology, Middle East, Science » Israeli Study Shows Natural Immunity 27 Times More Effective Against COVID Delta Variant Than Vaccine\n\nNatural immunity from contracting coronavirus provides people with longer-lasting protection against the so-called ‘Delta variant’ than two shots of the experimental Pfizer “vaccine” rolled out early this year, new Israeli research suggests:\n\nThe study by Maccabi Healthcare Service looked at individuals who had either gotten two shots of the vaccine by the end of February or tested positive for COVID-19 by that time. It compared 46,035 Maccabi members who caught the coronavirus at some point during the pandemic and the same number of double-vaccinated people.\n\nPeople who had two vaccine shots had a six-fold higher chance of getting infected with Delta than patients who hadn’t been vaccinated but previously contracted the coronavirus, according to the research. The study, published online but not yet peer reviewed, is the largest of its kind. It doesn’t take booster shots — now widely given in Israel — into account, but given that most of the world is still giving a two-dose regimen, has international relevance.\n\nBut experts are stressing that the results shouldn’t be interpreted as discouragement from vaccinating. Immunologist Prof. Cyrille Cohen of Bar Ilan University, who was not involved in the study, told The Times of Israel: “Certain people who are not inclined to get vaccinated might be mistaken and think that this means you’d better get sick a priori and not get a vaccine. Such a thinking is medically wrong, and the results of the study do not mean that people should expose themselves on purpose and get sick.\n\n“As with other disease, it is much safer to get the vaccine and prevent COVID-19, a disease that puts one at risk of hospitalization, death and long-running after-effects.”\n\nIn the two groups, there were 748 cases of SARS-CoV-2 breakthrough infections, 640 of which were in the vaccinated group and 108 in the previously infected group, which was relying on natural immunity alone. The vaccine-dependent people had a seven-fold higher chance of symptomatic infection, and a 6.7-fold higher chance of being hospitalized.\n\nIn addition, a sample of 16,215 who were infected during Israel’s third wave in January-February 2021 was compared to an equal number of people vaccinated during that period. The contrast for these two groups was even starker: It showed that Delta had a 27-fold higher chance of breaking through vaccine protection from January and February and causing symptoms than breaking through natural immunity acquired in the same period and causing symptoms.\n\nThe study also found that when recovered patients boosted their natural protection with a single vaccine shot — as recommended by Israeli health officials — their protection reached new highs, and they had approximately half the infection risk of other recovered patients. “Individuals who were previously infected with SARS-CoV-2 and given a single dose of the vaccine gained additional protection against the Delta variant,” the study suggested. “The long-term protection provided by a third dose, recently administered in Israel, is still unknown.”\n\nThe authors, led by Dr. Sivan Gazit, deputy head of Maccabi’s research arm, noted that their study is significant for taking a wide time-frame and using a large data sample. They wrote: “Our large cohort, enabled by Israel’s rapid rollout of the mass-vaccination campaign, allowed us to investigate the risk for additional infection — either a breakthrough infection in vaccinated individuals or reinfection in previously infected ones — over a longer period than thus far described.”\n\nCohen said of the study: “The data presented is important and can draw a kind of immune hierarchy. From the most protected to the less, there are vaccinated convalescent, convalescent, then vaccinated and then people who choose not to vaccinate, who are the most vulnerable.”\n\nIn other words, these “experts” are telling us to ignore the obvious conclusions from this study and still go out and dutifully get vaccinated even though the unvaccinated with natural immunity are far more likely to fight — and survive the “virus”.\n\nWe reported on a study over a year ago that concluded everyone who had been exposed to coronavirus has developed long-term T-cell immunity — and that basically means everybody.\n\nInstead of testing everyone for “COVID-19” using their bogus PCR “tests,” they should be testing everyone for natural immunity to coronavirus, but they won’t do that because it would show too many people already have natural immunity and who therefore wouldn’t “need” their bogus — and dangerous — vaccines.\n\nCoronavirus is one of the most common viruses in the world — everybody has been exposed to it — which is good for them — and that’s why everybody has some level of long-term natural immunity to it.\n\nOnly immuno-compromised people — in their 80s who have already exceeded the average life expectancy — with multiple co-morbidities are the people who “die of” — or better yet “die with” — coronavirus.\n\nIn other words, ironically, the people who “die of” coronavirus actually live longer than people who die without it.\n\nAnd it is very common for people with advanced cancers and heart disease to ultimately die of pneumonia or the “flu” — which is why doctors used to call pneumonia “the old man’s friend” — because it put them out of their misery at the end.\n\nAnd that’s why since the advent of the “coronavirus pandemic” health authorities stopped tracking pneumonia and the seasonal flu — those people had the symptoms of “COVID” so they magically became COVID patients.\n\nBut it is very misleading for authors of this new study to claim that people with natural immunity who were given the vaccine “boosted their natural protection with a single shot” — vaccines do not boost natural immunity — they boost artificially-induced, short-term immunity that rapidly fades, as many studies on this vaccine show.\n\nWhat they don’t tell you is how long this artificial “boost” of immunity lasts — when naturally immune people are given the vaccine — but given how short this artificially-induced immunity has lasted, we would assume it doesn’t last very long at all — and therefore it’s disingenuous to push the vaccine on anyone who already has long-term natural immunity.\n\nEven the inventor of mRNA “gene therapy” vaccines, Dr. Robert Malone, confirmed that natural immunity to the coronavirus is 20 times more protective than the artificial immunity induced by COVID vaccines.\n\nIn fact, it is medically reckless to do so — you are medicating people unnecessarily and exposing them to serious vaccine side effects — like death and permanent disabilities, which include progressive heart failure and delayed strokes.\n\nIf unvaccinated people with natural immunity are 27 times less likely to contract symptoms — and presumably “spread” the “virus” — why vaccinate them at all — when it is vaccinated people are clearly the vast majority of people getting sick?\n\nAnd these “booster” shots won’t last any longer than the “standard” COVID vaccines — like many cars, all these vaccines have “built-in obsolescence” — which guarantees customers for life…\n\nAnd a way to cull the herd with ‘plausible deniability‘ whenever it gets either too big or too unruly.\n• Ghana Becomes first Country in Africa that Approves Oxford's new Malaria Vaccine\n• Australia has silently withdrawn its authorization for the AstraZeneca COVID-19 vaccine\n\nDid you like this information? Then please consider making a donation or subscribing to our Newsletter.", "opengraph": {"locale": "en_US", "site_name": "The European Union Times - World News, Breaking News", "type": "article", "title": "Israeli Study Shows Natural Immunity 27 Times More Effective Against COVID Delta Variant Than Vaccine", "description": "Natural immunity from contracting coronavirus provides people with longer-lasting protection against the so-called ‘Delta variant’ than two shots of the experimental Pfizer “vaccine” rolled out early this year, new Israeli research suggests: The study by Maccabi Healthcare Service looked at individuals who had either gotten two shots of the vaccine by the end of February", "url": "https://www.eutimes.net/2021/09/israeli-study-shows-natural-immunity-27-times-more-effective-against-covid-delta-variant-than-vaccine/", "image": "https://i.imgur.com/qQP3wNR.jpg", "image:secure_url": "https://i.imgur.com/qQP3wNR.jpg", "article:tag": "science", "article:published_time": "2021-09-17T14:38:35+00:00", "article:modified_time": "2021-09-17T14:38:35+00:00", "article:publisher": "https://www.facebook.com/EUTimesNET/"}, "tags": ["COVID-19", "Cyrille Cohen", "Israel", "Bar-Ilan University", "Immunity", "Pfizer", "Tel Aviv", "Delta Variant", "Vaccine"], "tweets": [], "movies": [], "links": ["https://twitter.com/intent/tweet", "https://www.pinterest.com/pin/create/button/", "https://embed.tumblr.com/share", "//www.reddit.com/submit", "https://www.timesofisrael.com/study-covid-recovery-gave-israelis-longer-lasting-delta-defense-than-vaccines/", "https://christiansfortruth.com/study-shows-natural-immunity-in-unvaccinated-27-times-more-effective-against-covid-delta-variant-than-vaccine/", "https://telegram.me/share/url?url=https%3A%2F%2Fbit.ly%2F39cEh1Q&text=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "http://reddit.com/submit?url=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "https://bit.ly/39cEh1Q", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine&caption=", "https://www.instagram.com/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "https://connect.ok.ru/dk?cmd=WidgetSharePreview&st.cmd=WidgetSharePreview&st.shareUrl=https%3A%2F%2Fbit.ly%2F39cEh1Q&st.client_id=-1", "http://vkontakte.ru/share.php?&url=https%3A%2F%2Fbit.ly%2F39cEh1Q", "http://digg.com/submit?url=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "https://www.evernote.com/clip.action?url=https%3A%2F%2Fbit.ly%2F39cEh1Q&title=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine", "https://mix.com/mixit?url=https%3A%2F%2Fbit.ly%2F39cEh1Q", "https://api.whatsapp.com/send?text=Israeli%20Study%20Shows%20Natural%20Immunity%2027%20Times%20More%20Effective%20Against%20COVID%20Delta%20Variant%20Than%20Vaccine https%3A%2F%2Fbit.ly%2F39cEh1Q", "http://www.printfriendly.com/print?url=https%3A%2F%2Fbit.ly%2F39cEh1Q&partner=a2a", "https://bit.ly/39cEh1Q", "https://www.eutimes.net/2023/04/pfizer-backed-cdc-project-targeting-vaccine-critics-with-psyops/", "https://www.eutimes.net/2023/04/ghana-becomes-first-country-in-africa-that-approves-oxfords-new-malaria-vaccine/", "https://www.eutimes.net/2023/04/switzerland-halts-covid-vaccinations-cites-harmful-effects/", "https://www.eutimes.net/2023/04/australia-has-silently-withdrawn-its-authorization-for-the-astrazeneca-covid-19-vaccine/", "https://www.eutimes.net/2023/04/australians-facing-unprecedented-rise-in-mortality-rates-but-leaders-stay-silent/", "https://www.eutimes.net/donations/", "https://feedburner.google.com/fb/a/mailverify?uri=TheEuropeanUnionTimes"], "authors": [], "publish_date": "2021-09-17T14:38:35+00:00"}