{"result_id": "292015", "URL": "https://www.eutimes.net/2022/05/indian-supreme-court-rules-mandatory-vaccines-as-a-grave-violation-of-bodily-integrity-and-personal-autonomy/", "timestamp": "2023-04-25 17:20:50 CEST+0200", "meta": {"description": "Vaccine mandates are now illegal in India following a Supreme Court ruling on Monday that states “bodily integrity and personal autonomy” are more important than government mandates. A big decision has come from the Supreme Court regarding the Covid vaccine. The Supreme Court has said that no one can be forced to vaccinate. But the", "lang": "en", "keywords": "autonomy,body,covid-19,dr. jacob pulial,india,integrity,new delhi,supreme court,vaccines,asia,health,justice", "favicon": "https://www.eutimes.net/wp-content/themes/newswire/images/favicon.ico", "canonical": "https://www.eutimes.net/2022/05/indian-supreme-court-rules-mandatory-vaccines-as-a-grave-violation-of-bodily-integrity-and-personal-autonomy/", "encoding": "UTF-8"}, "image": null, "domain": "www.eutimes.net", "title": "Indian Supreme Court Rules Mandatory Vaccines as 'A Grave Violation of Bodily Integrity and Personal Autonomy'", "cleaned_text": "Home » Asia, Health, Justice » Indian Supreme Court Rules Mandatory Vaccines as 'A Grave Violation of Bodily Integrity and Personal Autonomy'\n\nVaccine mandates are now illegal in India following a Supreme Court ruling on Monday that states “bodily integrity and personal autonomy” are more important than government mandates.\n\nA big decision has come from the Supreme Court regarding the Covid vaccine. The Supreme Court has said that no one can be forced to vaccinate. But the government can make policy and impose certain conditions for the greater public good and health. The government can make rules in the areas of physical autonomy. The current vaccination policy cannot be called unfair. The Supreme Court, while giving its verdict, said that this court is satisfied that the present vaccine policy cannot be said to be clearly arbitrary. Physical autonomy comes under the fundamental right to live. The court does not have the expertise to decide on scientific evidence. If there is any obvious arbitrariness, the court can give a verdict.\n\nA bench of Justice L Nageswara Rao and Justice BR Gavai, while delivering the verdict, said that the court is not inclined to interfere with the vaccine. The scope of judicial review is limited in the policy decisions taken by the government on the opinion of experts. The court said that the restrictions imposed through the vaccine mandate for the people are not proportionate. As long as the number of Covids is low, people who do not vaccinate in public areas should not be banned. If there is such an order, it should be withdrawn. Our recommendation does not apply to enforcement of Fair Practices Rules.\n\nThe Supreme Court has said that governments have not kept any data to prove that an unvaccinated person spreads the virus compared to a person who has been vaccinated. We do not agree with the petitioner that the relevant data on current vaccines has not been made available by the Government. And now all relevant data on clinical trials should be made available in the public domain. Government of India to provide data on adverse events. Relevant data on approved vaccines for children should also be available in the public domain. Publicize the data of clinical trials and adverse events related to the Covid vaccine.\n\nIn fact, Dr Jacob Pulial, a former member of the National Technical Advisory Group on Immunization (NTAGI), has filed a petition in the Supreme Court against making the vaccine mandatory and seeking to make clinical data public. Also, applications are filed in the Supreme Court against making Covid vaccine mandatory in Delhi, Madhya Pradesh, Tamil Nadu and Maharashtra. The petition said that the Center says that vaccination is voluntary but the states have made it mandatory for certain purposes. Issue instructions to declare the vaccine mandate unconstitutional.\n\nChallenging this argument of the central government in the Supreme Court, petitioner Jacob Puliyal has said that even though the central government is saying that vaccination is optional, it is not mandatory, but in states like Delhi, Tamil Nadu, Maharashtra and Madhya Pradesh, it has become mandatory. Has been given. Jacob’s petition has demanded that the government make public the reports of clinical trials of Covid 19 vaccines and their efficacy figures. So that the general public can know everything.\n\nAppearing in this petition of Jacob, his lawyer Prashant Bhushan had said that when the central government has said on many occasions, in response to statements and RTI that vaccination is not compulsory but optional, then in many states to open a shop, enter a shop or establishment. Vaccination certificates are sought on occasions such as entry of employees and people working there, walking on the streets, entering an educational institution? The petitioner, in his petition, has also referred to the circulars issued by the Government of National Capital Territory of Delhi on October 8 last year, November 8 in Madhya Pradesh, November 27 in Maharashtra and November 18 in Tamil Nadu and clearly written guidelines in which vaccination should be done. Essential restrictions have been imposed.\n\nAt the same time, the Central Government opposed the petition to give the data of the clinical trial of Corona vaccine and not to force the vaccine. In the Supreme Court, the central government had said that such petitions filed for the vested interest of some people can affect the vaccination process. Even an oral comment of the court can be harmful.\n\nThe Center told the Supreme Court that till November 24, 2021, one billion 19 crore 38 lakh 44 thousand 741 doses of corona vaccine have been given. Out of these, 2116 cases of adverse event following immunization i.e. AEFI have been registered so far. A report of rapid review and analysis has been completed for 495 (463 Coveshield and 32 Covaxin). Another report of 1356 cases (1236 Covishield, 118 Covaxin and 2 Sputnik) of severe AEFI cases (including 495 cases already analyzed) has been submitted to NEGVAC.\n\nThe remaining cases are under rapid review and analysis and will be completed soon. On behalf of the Central Government, Solicitor General Tushar Mehta had said that this petition should not be heard. This may increase hesitation for the vaccine. The country has come out of it with great difficulty.\n\nJustice Nageswara Rao had said that that is why we said that if you have some specific facts, then they should be heard. We also do not want that there should be any problem regarding vaccination. Still, if any case comes before us with concrete facts, then we have to listen to it. During the hearing, advocate Prashant Bhushan, appearing for the petitioner, had said that there are many states which have imposed many restrictions on those who do not vaccinate.\n\nIn fact, on 9 August 2021, the Supreme Court had issued a notice to the Central Government on the petition not to compel people to apply the vaccine and make the trial data public. However, the Supreme Court refused to impose an interim stay on forcing the vaccine to be administered. Justice L Nageswara Rao said that 50 crore people in the country have been vaccinated. Do you want the vaccination program to be discontinued? There is already a vaccine hesitancy going on in the country. The WHO has also said that vaccine hesitancy has done a lot of damage. Do you think this is in the larger public interest? Until we find that something seriously wrong has been done by the elected representatives.\n\nWe are fighting against vaccine hesitancy so such petitions are not creating doubt in the minds of the people. We have some apprehension that once we consider this petition, it should not imply that we are promoting vaccine hesitation. There are orders from many foreign courts including the US Supreme Court on the essentiality of the vaccine. You cannot tamper with public health like this. We have not seen such an epidemic in 100 years, so it is necessary to balance the vaccine in emergency.\n\nOn behalf of the petitioner, Prashant Bhushan had said that according to the sero report, 2/3 people have been infected with Covid. In such a situation, the anti body is more effective than the corona vaccine. Now a policy has been made that if the vaccine is not applied then one cannot travel. Many restrictions have been imposed. The government is not making clinical data public. Since the vaccine is voluntary, then if someone does not get the vaccine, then he should not be denied any facility. The petitioner’s lawyer Prashant Bhushan has filed an application asking that the clinical trial of the vaccine as well as the data regarding the adverse effect of the vaccine be made public.\n\nData on clinical trials of Covid 19 vaccine and adverse effects after taking the vaccine should be made public because emergency use of the vaccine has been allowed. A request has been made for transparency in the clinical trial of the vaccine and the data of the post-vaccine adverse reaction. The petition has been filed saying that a demand has been made to direct the Central Government to make the details public about the adverse effects of vaccination.\n\nIt has been said in the petition that the Center should be directed that how many people have been infected among those who have taken the vaccine to prevent corona. How many of these people had to be hospitalized and how many died due to vaccination. The petitioner said that whatever adverse effect data is there, it should be told to the people on the toll free number. Also, there should be such a system that if someone is getting vaccinated and there has been an adverse effect, then he can complain about it. In the application filed in the Supreme Court, the manner in which the use of the vaccine has been approved was questioned and it was said that those taking the vaccine should be monitored. This kind of monitoring has helped in controlling the adverse effects of vaccine takers in many countries of the world such as blood clotting etc. The use of Astra Zeneca Vaccine is banned in Denmark.\n• Australia has silently withdrawn its authorization for the AstraZeneca COVID-19 vaccine\n• Dalai Lama Caught Kissing Young Boy and Telling Him to 'Suck My Tongue'\n\nDid you like this information? Then please consider making a donation or subscribing to our Newsletter.", "opengraph": {"locale": "en_US", "site_name": "The European Union Times - World News, Breaking News", "type": "article", "title": "Indian Supreme Court Rules Mandatory Vaccines as 'A Grave Violation of Bodily Integrity and Personal Autonomy'", "description": "Vaccine mandates are now illegal in India following a Supreme Court ruling on Monday that states “bodily integrity and personal autonomy” are more important than government mandates. A big decision has come from the Supreme Court regarding the Covid vaccine. The Supreme Court has said that no one can be forced to vaccinate. But the", "url": "https://www.eutimes.net/2022/05/indian-supreme-court-rules-mandatory-vaccines-as-a-grave-violation-of-bodily-integrity-and-personal-autonomy/", "image": "https://i.postimg.cc/6qz9SnyT/corona-vaccine-0-sixteen-nine.jpg", "image:secure_url": "https://i.postimg.cc/6qz9SnyT/corona-vaccine-0-sixteen-nine.jpg", "article:tag": "justice", "article:published_time": "2022-05-05T17:46:13+00:00", "article:modified_time": "2022-05-05T17:46:13+00:00", "article:publisher": "https://www.facebook.com/EUTimesNET/"}, "tags": ["New Delhi", "Body", "Dr. Jacob Pulial", "COVID-19", "Vaccines", "Supreme Court", "Integrity", "India", "Autonomy"], "tweets": [], "movies": [], "links": ["https://twitter.com/intent/tweet", "https://www.pinterest.com/pin/create/button/", "https://embed.tumblr.com/share", "//www.reddit.com/submit", "https://telegram.me/share/url?url=https%3A%2F%2Fbit.ly%2F3kKGur8&text=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "http://reddit.com/submit?url=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "https://bit.ly/3kKGur8", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27&caption=", "https://www.instagram.com/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "https://connect.ok.ru/dk?cmd=WidgetSharePreview&st.cmd=WidgetSharePreview&st.shareUrl=https%3A%2F%2Fbit.ly%2F3kKGur8&st.client_id=-1", "http://vkontakte.ru/share.php?&url=https%3A%2F%2Fbit.ly%2F3kKGur8", "http://digg.com/submit?url=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "https://www.evernote.com/clip.action?url=https%3A%2F%2Fbit.ly%2F3kKGur8&title=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27", "https://mix.com/mixit?url=https%3A%2F%2Fbit.ly%2F3kKGur8", "https://api.whatsapp.com/send?text=Indian%20Supreme%20Court%20Rules%20Mandatory%20Vaccines%20as%20%27A%20Grave%20Violation%20of%20Bodily%20Integrity%20and%20Personal%20Autonomy%27 https%3A%2F%2Fbit.ly%2F3kKGur8", "http://www.printfriendly.com/print?url=https%3A%2F%2Fbit.ly%2F3kKGur8&partner=a2a", "https://bit.ly/3kKGur8", "https://www.eutimes.net/2023/04/pfizer-backed-cdc-project-targeting-vaccine-critics-with-psyops/", "https://www.eutimes.net/2023/04/switzerland-halts-covid-vaccinations-cites-harmful-effects/", "https://www.eutimes.net/2023/04/australia-has-silently-withdrawn-its-authorization-for-the-astrazeneca-covid-19-vaccine/", "https://www.eutimes.net/2023/04/australians-facing-unprecedented-rise-in-mortality-rates-but-leaders-stay-silent/", "https://www.eutimes.net/2023/04/dalai-lama-caught-kissing-young-boy-and-telling-him-to-suck-my-tongue/", "https://www.eutimes.net/donations/", "https://feedburner.google.com/fb/a/mailverify?uri=TheEuropeanUnionTimes"], "authors": [], "publish_date": "2022-05-05T17:46:13+00:00"}