{"result_id": "292033", "URL": "https://www.eutimes.net/2022/12/top-american-oncologist-says-covid-19-vaccines-have-created-a-drastic-rise-in-untreatable-cancers/", "timestamp": "2023-04-25 17:21:03 CEST+0200", "meta": {"description": "One of America’s top oncologist’s has warned that the Covid shots are causing a drastic rise in untreatable cancers. Dr. Angus Dalgleish, Professor of Oncology at St George’s University of London, says he has seen a recurrence of cancer in large numbers of his melanoma patients who have been stable for long periods prior to", "lang": "en", "keywords": "cancers,covid-19 vaccines,dr. angus dalgleish,london,oncologist,st. george\\'s university,biology,breaking news,disasters,health,north america,science", "favicon": "https://www.eutimes.net/wp-content/themes/newswire/images/favicon.ico", "canonical": "https://www.eutimes.net/2022/12/top-american-oncologist-says-covid-19-vaccines-have-created-a-drastic-rise-in-untreatable-cancers/", "encoding": "UTF-8"}, "image": null, "domain": "www.eutimes.net", "title": "Top American oncologist says COVID-19 Vaccines have created a Drastic Rise in Untreatable Cancers", "cleaned_text": "Home » Biology, Breaking News, Disasters, Health, North America, Science » Top American oncologist says COVID-19 Vaccines have created a Drastic Rise in Untreatable Cancers\n\nOne of America’s top oncologist’s has warned that the Covid shots are causing a drastic rise in untreatable cancers.\n\nDr. Angus Dalgleish, Professor of Oncology at St George’s University of London, says he has seen a recurrence of cancer in large numbers of his melanoma patients who have been stable for long periods prior to the introduction of COVID jabs.\n\nDalgleish writes: Seeing the recurrence of these cancers after all this time naturally makes me wonder if there is a common cause? I had previously noted that relapse in stable cancer is often associated with severe long-term stress, such as bankruptcy, divorce, etc. However I found that none of my patients had any such extra stress during this time but they had all had booster vaccines and, indeed, a couple of them noted that they had a very bad reaction to the booster which they did not have to the first two injections.\n\nI then noted that some of these patients were not having a normal pattern of relapse but rather an explosive relapse, with metastases occurring at the same time in several sites. Obviously, I began to wonder whether the booster vaccines could be causing these relapses and were not just coincidence, as my colleagues were willing to suggest.\n\nWithin a three-month period I have been able to identify eight people who have developed B-cell malignancies following the booster, with two of them reporting that they instantly felt very unwell after the booster, having had no problem after the first two vaccines, then describing the symptoms of extreme exhaustion and long Covid before being investigated and finding out that they had a B-cell leukaemia in two cases, non-Hodgkin’s lymphoma in five and a very aggressive myeloma in the other case.\n\nScientifically, I was reading reports that the booster was leading to a big excess of antibodies at the expense of the T-cell response and that this T-cell suppression could last for three weeks, if not more. To me, this could be causal as the immune system is being asked to make an excessive response through the humoral inflammatory part of the immune response against a virus variant which is no longer in existence in the community. This exertion leads to immune exhaustion, which is why these patients are reporting up to a 50% greater increase in Omicron, or other variations, than the non-vaccinated.\n\nHaving communicated these observations I was rapidly reminded that I had written an article, published in the Daily Mail in the middle of 2021, which encouraged people to get vaccinated, particularly younger people. This was a very thorough article, written under my name but essentially conducted by interview, for the purpose of condoning the vaccine rollout at the time. Although I had started to have concerns, the overwhelming push by the Government and the medical community was that this would be in everyone’s best interest. So the environment at that time was completely different to what it is now. Indeed, my own take on this was soon to change very dramatically when my own son developed myocarditis after having a jab he did not want but that he needed for work and travel purposes. I also then found out that one of his friends in his early 30s had suffered a stroke and that a niece of my close colleague had a fatal heart attack at the age of 34, having had the vaccine for her occupation as a nurse! I began to be highly alarmed that it was the vaccines causing these symptoms, and that just as we had written right at the very beginning of the pandemic, a genetically engineered virus had serious implications for vaccine design. This paper, which was suppressed and therefore did not appear in print for many months, reported that the sequence of the virus was completely consistent with having been genetically engineered, with a furin cleavage site and six inserts at places that would make the virus very infectious, and the reason this had such tremendous implications for vaccine design was that 80% of these sequences had homology to human epitopes. In particular, we had noticed a homology with platelet factor 4 and myelin. The former is also certainly associated with what is known as VITT (low platelets and clotting issues) and the latter associated with all the neurological problems, such as transverse myelitis, both of which are now recognised as side-effects of the vaccine even by the MHRA.\n\nAlthough it took some time to get these findings out into press, they were delivered to and widely circulated to the Cabinet and various medical committees as we thought these observations were crucially important. Unfortunately, they were ignored.\n\nHowever, the cases of myocarditis did not even need this trigger as young hearts over-express the ACE-receptor, which the virus had been trained in the laboratory to bind to with very high affinity and it is this that sets off the inflammatory response, which leads to myocarditis, pericarditis, stroke and deaths, which it is now clear are far more common in the under-40s than caused by the virus infection itself.\n\nIt was also shortly after this time that it became evident that the virus was attenuating, as all viruses do. In addition, treatment was improving so the virus was leading to fewer hospitalisations and deaths. I believe this is a very important factor to take into account as it was clear at the end of the first year that the pandemic was reducing and the virus becoming less aggressive, with the emergence of the Omicron variant, just as large sections of the population were being vaccinated.\n\nIn late 2021 it was becoming manifestly evident too that the vaccines were anything but safe and effective and that the disease was not nearly as problematic as it was at the beginning of 2020 when it was being rendered much worse with what I believed at the time to be ludicrous responses. These included both lockdown and the refusal to treat Covid as a respiratory airborne virus with consensus mechanisms but instead pushing patients on to a randomised trial, known as RECOVERY, which ended up showing what everyone knew: that if there is an acute inflammation in the lungs patients need dexamethasone. The early responses also included putting patients on ventilation, which now is known to be the last thing that should have been done as it seemed to encourage early death.\n\nWhen the facts change, or new facts emerge, the position of all those in authority directing mandates should change but unfortunately, they did not.\n\nI tried desperately to point out that all the evidence that vaccines might have been useful in helping to curtail the pandemic was changing; that it was becoming very clear that there were highly significant side-effects to the vaccine programme that Pfizer had gone to great lengths to cover up, and that it was only a court case in the U.S. that led to them becoming available. At this stage the whole vaccine programme should have been stopped but nobody seemed to want to address this, neither the Government, the medical authorities or the media.\n\nHaving written many articles for the Daily Mail arguing against lockdown and for it never to be used again, I was extremely keen to address my change of opinion on the vaccines and to warn people of their dangers particularly to younger people, and to point out there were no grounds at all for giving it to children. Unfortunately, all my efforts and approaches to the mainstream media on this subject have been rejected. This, I believe, is something that will come back to haunt all those who introduced an Orwellian kind of suppression to the emerging truth, which labelled doctors trying to save their patients along the lines of ‘first do no harm’ as outcasts or villains.\n• Ineffective Sanctions: Russian Oligarchs Thriving More than Ever Before and even in Foreign Countries\n• Russia caught spying on UK for Sabotage purposes with Fishing Ships\n• UK cows to be given methane suppressants in bizarre effort to achieve lower emissions\n• Russia warns again with Nuclear war after UK Sends Tanks to Ukraine\n• Fact-Checkers Admit 92% of All COVID Deaths Are From Jabbed People\n\nDid you like this information? Then please consider making a donation or subscribing to our Newsletter.", "opengraph": {"locale": "en_US", "site_name": "The European Union Times - World News, Breaking News", "type": "article", "title": "Top American oncologist says COVID-19 Vaccines have created a Drastic Rise in Untreatable Cancers", "description": "One of America’s top oncologist’s has warned that the Covid shots are causing a drastic rise in untreatable cancers. Dr. Angus Dalgleish, Professor of Oncology at St George’s University of London, says he has seen a recurrence of cancer in large numbers of his melanoma patients who have been stable for long periods prior to", "url": "https://www.eutimes.net/2022/12/top-american-oncologist-says-covid-19-vaccines-have-created-a-drastic-rise-in-untreatable-cancers/", "image": "https://eurolandexperience.files.wordpress.com/2022/12/covid-jabs-cancers.jpg", "image:secure_url": "https://eurolandexperience.files.wordpress.com/2022/12/covid-jabs-cancers.jpg", "article:tag": "st. george's university", "article:published_time": "2022-12-21T17:28:29+00:00", "article:modified_time": "2022-12-21T17:28:29+00:00", "article:publisher": "https://www.facebook.com/EUTimesNET/"}, "tags": ["Cancers", "London", "St. George's University", "Dr. Angus Dalgleish", "Oncologist", "COVID-19 Vaccines"], "tweets": [], "movies": [], "links": ["https://twitter.com/intent/tweet", "https://www.pinterest.com/pin/create/button/", "https://embed.tumblr.com/share", "//www.reddit.com/submit", "https://www.infowars.com/posts/i-have-tried-sounding-the-alarm-about-the-vaccines-causing-cancer-relapse-but-the-mainstream-media-dont-want-to-know/", "https://newspunch.com/top-medical-doctor-reveals-covid-jabs-are-giving-people-untreatable-cancers/", "https://telegram.me/share/url?url=https%3A%2F%2Fbit.ly%2F3FO9QyL&text=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "http://reddit.com/submit?url=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "https://bit.ly/3FO9QyL", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers&caption=", "https://www.instagram.com/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "https://connect.ok.ru/dk?cmd=WidgetSharePreview&st.cmd=WidgetSharePreview&st.shareUrl=https%3A%2F%2Fbit.ly%2F3FO9QyL&st.client_id=-1", "http://vkontakte.ru/share.php?&url=https%3A%2F%2Fbit.ly%2F3FO9QyL", "http://digg.com/submit?url=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "https://www.evernote.com/clip.action?url=https%3A%2F%2Fbit.ly%2F3FO9QyL&title=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers", "https://mix.com/mixit?url=https%3A%2F%2Fbit.ly%2F3FO9QyL", "https://api.whatsapp.com/send?text=Top%20American%20oncologist%20says%20COVID-19%20Vaccines%20have%20created%20a%20Drastic%20Rise%20in%20Untreatable%20Cancers https%3A%2F%2Fbit.ly%2F3FO9QyL", "http://www.printfriendly.com/print?url=https%3A%2F%2Fbit.ly%2F3FO9QyL&partner=a2a", "https://bit.ly/3FO9QyL", "https://www.eutimes.net/2023/04/ineffective-sanctions-russian-oligarchs-thriving-more-than-ever-before-and-even-in-foreign-countries/", "https://www.eutimes.net/2023/04/russia-caught-spying-on-uk-for-sabotage-purposes-with-fishing-ships/", "https://www.eutimes.net/2023/04/uk-cows-to-be-given-methane-suppressants-in-bizarre-effort-to-achieve-lower-emissions/", "https://www.eutimes.net/2023/03/russia-warns-again-with-nuclear-war-after-uk-sends-tanks-to-ukraine/", "https://www.eutimes.net/2023/03/fact-checkers-admit-92-of-all-covid-deaths-are-from-jabbed-people/", "https://www.eutimes.net/donations/", "https://feedburner.google.com/fb/a/mailverify?uri=TheEuropeanUnionTimes"], "authors": [], "publish_date": "2022-12-21T17:28:29+00:00"}