{"result_id": "293014", "URL": "https://theeventchronicle.com/from-ghana-ebola-is-not-real-and-the-only-people-who-have-gotten-sick-are-those-who-got-shots-from-the-red-cross/", "timestamp": "2023-04-25 17:21:20 CEST+0200", "meta": {"description": "Most people jump to “depopulation” which is no doubt always on the mind of the West when it comes to Africa. But I assure you Africa can NEVER be", "lang": "en", "keywords": "", "favicon": "https://theeventchronicle.com/wp-content/uploads/2020/06/cropped-favicon-32x32-2-32x32.png", "canonical": "https://theeventchronicle.com/from-ghana-ebola-is-not-real-and-the-only-people-who-have-gotten-sick-are-those-who-got-shots-from-the-red-cross/", "encoding": "UTF-8"}, "image": null, "domain": "theeventchronicle.com", "title": "From Ghana: Ebola is Not Real and the Only People Who Have Gotten Sick are Those Who Got Shots From the Red Cross", "cleaned_text": "From Ghana: Ebola is Not Real and the Only People Who Have Gotten Sick are Those Who Got Shots From the Red Cross\n\nMost people jump to “depopulation” which is no doubt always on the mind of the West when it comes to Africa. But I assure you Africa can NEVER be depopulated by killing 160 people a day when thousands are born per day. So the real reasons are much more tangible.\n\nThis vaccine implemented sickness being “called” Ebola was introduced into West Africa for the end goal of getting troops on the ground in Nigeria, Liberia, and Sierra Leone. If you remember America was just trying to get into Nigeria for “Boko Haram” #BULLSHIT but that fell apart when Nigerians started telling the truth. There ARE NO GIRLS MISSING. Global support fell through the floor, and a new reason was needed to get troops into Nigeria and steal the new oil reserves they have discovered.\n\nSierra Leone is the World’s Largest Supplier of Diamonds. For the past 4 months they have been on strike, refusing to provide diamonds due to horrible working conditions and slave pay. The West will not pay a fair wage for the resources because the idea is to keep these people surviving on rice bags and foreign aid so that they remain a source of cheap slave labor forever. A reason was also needed to get troops on the ground in Sierra Leone to force an end to the diamond miners strikes. This is not the first time this has been done. When miners refuse to work troops are sent in and even if they have to kill and replace them all, the only desire is to get diamonds back flowing out of the country.\n\nOf course to launch multiple campaigns to invade these countries separately would be way too fishy. But something like “Ebola” allows access to an entire area simultaneously…\n\nIn addition to stealing Nigerian oil, and forcing Sierra Leone back to mining, troops have also been sent in to FORCE vaccinations (Deadly “Ebola” Poison) onto those Africans who are not foolish enough to take them willingly.\n\n3000 troops are being sent in to make sure that this “poison” continues to spread, because again it is only spread through vaccination. As more and more news articles are released as they have been in Liberia, informing the populous of the US lies and manipulation, more and more Africans are refusing to visit the Red Cross. Troops will force these vaccinations upon the people to ensure the visible appearance of an Ebola pandemic. In addition to this they will protect the Red Cross from the Liberians and Nigerians who have been rightfully ejecting them from their countries.\n\nLast but not least, the APPEARANCE of this Ebola “pandemic” (should Americans not catch on) will be used to scare the countless millions into taking an “Ebola vaccine” which in reality is the pandemic. Already they have started with stories of how it has been brought to the U.S. and has appeared in Dallas, how white doctors were cured but black infected are not being allowed to be treated, etc.\n\nALL that will do is make blacks STRIVE to get the vaccine, because it appears that the “cure” is being held back from blacks. They will run out in droves to get it and then there will be serious problems. With all we have seen revealed about vaccines this year you would think we learned our lesson. All I can do is hope so, Because they rely on our ignorance to complete their agendas.\n\nIf Ebola really was spread from person to person, instead of controlled spread through vaccination – then WHY would the CDC and the US Government continue to allow flights in and out of these countries with absolutely no regulation, Or At All? We have got to start thinking and sharing information globally because they do not give the true perspective of the people who live here in West Africa. They are lying for their own benefit and there aren’t enough voices out there with a platform to help share our reality. Hundreds of thousands have been killed, paralyzed and disabled by these and other “new” vaccines all over the world and we are finally becoming aware of it. Now what will we do with all this information?", "opengraph": {"locale": "en_US", "type": "article", "title": "From Ghana: Ebola is Not Real and the Only People Who Have Gotten Sick are Those Who Got Shots From the Red Cross - The Event Chronicle", "description": "Most people jump to “depopulation” which is no doubt always on the mind of the West when it comes to Africa. But I assure you Africa can NEVER be", "url": "https://theeventchronicle.com/from-ghana-ebola-is-not-real-and-the-only-people-who-have-gotten-sick-are-those-who-got-shots-from-the-red-cross/", "site_name": "The Event Chronicle", "article:published_time": "2014-10-13T07:08:52+00:00", "article:modified_time": "2020-06-10T07:27:06+00:00", "image": "https://theeventchronicle.com/wp-content/uploads/2020/06/ebola-lies.jpg", "image:width": "703", "image:height": "336", "image:type": "image/jpeg"}, "tags": ["US Government", "Sierra Leone", "Red cross", "vaccine", "Ghana", "Ebola"], "tweets": [], "movies": [], "links": ["https://www.history.com/this-day-in-history/worlds-largest-diamond-found", "https://en.wikipedia.org/wiki/International_Red_Cross_and_Red_Crescent_Movement"], "authors": ["John Morse"], "publish_date": "2014-10-13T07:08:52+00:00"}