{"result_id": "293003", "URL": "https://theeventchronicle.com/22000-brave-nurses-refusing-to-submit-to-mandatory-vaccinations/", "timestamp": "2023-04-25 17:21:14 CEST+0200", "meta": {"description": "Nurses against Mandatory Vaccines (NAMV) was founded and formed by our CEO became alarmed when mandatory vaccination policies were being introduced", "lang": "en", "keywords": "", "favicon": "https://theeventchronicle.com/wp-content/uploads/2020/06/cropped-favicon-32x32-2-32x32.png", "canonical": "https://theeventchronicle.com/22000-brave-nurses-refusing-to-submit-to-mandatory-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "theeventchronicle.com", "title": "More Than 22,000 Brave Nurses Refusing to Submit to Mandatory Vaccinations", "cleaned_text": "Nurses are required to wear face masks for refusing the flu vaccine.\n\nDespite a CDC study that found mandatory vaccines for nurses offer no protection for patients, hospitals are pushing hard for forced vaccinations. Many nurses are choosing to lose their jobs rather than submit to forced mandatory flu vaccinations, and one has even sued the hospital, state, and federal governments for $100,000,000.\n\nNurses against Mandatory Vaccines (NAMV) was founded and formed by our CEO became alarmed when mandatory vaccination policies were being introduced into workplaces, and there seemed to be no rhyme or reason. First and foremost, NAMV is not anti-vaccine, but pro-choice when it comes to vaccination. We believe that all persons should have the right to choose and refuse medical treatment; that means nurses and healthcare workers alike.\n\nResearch and other publicly acquired information now shows why: hospital systems are REQUIRED to have a 90% or higher flu shot reception rate among their staff, or they lose up to 2% of their funding of Medicare/Medicaid. While the government itself does not require mandatory vaccination policies, many if not all, are taking an “all or nothing” stance against their workers. You now face being fired and without a job if you refuse a flu vaccine.\n\nThe flu vaccine is not an effective way to eradicate a disease that is only ESTIMATED to cause approximately 30,000 deaths in the US per year. This number is lumped in with pneumonia cases. More people die each year from medical errors, heart disease, diabetes, and sepsis.\n\nNAMV does not support mandatory vaccination policies for healthcare workers of any kind. We are here to stand up and fight back against this policy and procedure, and to fight back against the vaccine companies who clearly lobbied for this law ONLY to pad their own pockets. It has been suggested that the mandatory flu vaccines are for “patient safety.” The truth of the matter is, is that mandatory flu vaccine policies are to provide more funding and money for the vaccine companies who produce these drugs.\n\nNAMV is here to fight and to help others fight against these unfair and unreasonable forced medical procedures.\n\nIn spite of harassments for not compromising, these nurses keep a professional attitude and make the best of difficult circumstances for the sake of the patients.", "opengraph": {"locale": "en_US", "type": "article", "title": "More Than 22,000 Brave Nurses Refusing to Submit to Mandatory Vaccinations - The Event Chronicle", "description": "Nurses against Mandatory Vaccines (NAMV) was founded and formed by our CEO became alarmed when mandatory vaccination policies were being introduced", "url": "https://theeventchronicle.com/22000-brave-nurses-refusing-to-submit-to-mandatory-vaccinations/", "site_name": "The Event Chronicle", "article:published_time": "2015-04-14T08:59:14+00:00", "article:modified_time": "2020-06-10T09:12:21+00:00", "image": "https://theeventchronicle.com/wp-content/uploads/2020/06/vaccination.jpg", "image:width": "980", "image:height": "551", "image:type": "image/jpeg"}, "tags": ["Brave Nurses", "Refusing", "Vaccinations", "vaccine", "Health", "Mandatory Vaccinations"], "tweets": [], "movies": [], "links": [], "authors": ["John Morse"], "publish_date": "2015-04-14T08:59:14+00:00"}