{"result_id": "293002", "URL": "https://theeventchronicle.com/the-cabals-depopulation-agenda/", "timestamp": "2023-04-25 17:21:14 CEST+0200", "meta": {"description": "While the global elite construct underground bunkers, eat organic and hoard seeds in Arctic vaults; the global poor are being slowly starved thanks to high commodity prices and poisoned with genetically modified (GMO) food.", "lang": "en", "keywords": "", "favicon": "https://theeventchronicle.com/wp-content/uploads/2020/06/cropped-favicon-32x32-2-32x32.png", "canonical": "https://theeventchronicle.com/the-cabals-depopulation-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "theeventchronicle.com", "title": "The Cabal’s Depopulation Agenda", "cleaned_text": "While the global elite construct underground bunkers, eat organic and hoard seeds in Arctic vaults; the global poor are being slowly starved thanks to high commodity prices and poisoned with genetically modified (GMO) food. Austerity measures aimed largely at the poor are being imposed on all the nations of the world. Weather events grow more deadly and brushfire wars more frequent. An AK-47 can be obtained for $49 in the markets of West Africa. The depopulation campaign of the inbred Illuminati bankers is accelerating.\n\nIn 1957 President Dwight Eisenhower, who later warned of a “military-industrial complex”, commissioned a panel of scientists to study the issue of overpopulation. The scientists put forth Alternatives I, II and III, advocating both the release of deadly viruses and perpetual warfare as means to decrease world population.\n\nThe first supposition dovetailed nicely with the pharmaceutical interests of the Rockefellers. According to Nexus magazine, the Rockefellers own one-half of the US pharmaceutical industry, which would reap billions developing medicines to “battle” the deadly viruses about to be released.\n\nIn 1969 the Senate Church Committee discovered that the US Defense Department (DOD) had requested a budget of tens of millions of taxpayer dollars for a program to speed development of new viruses which target and destroy the human immune system. DOD officials testified before Congress that they planned to produce, “a synthetic biological agent, an agent that does not naturally exist and for which no natural immunity could be acquired…Most important is that it might be refractory to the immunological and therapeutic processes upon which we depend to maintain our relative freedom from infectious disease.” House Bill 5090 authorized the funds and MK-NAOMI was carried out at Fort Detrick, Maryland.\n\nOut of this research came the AIDS virus which was targeted at “undesirable elements” of the population. The first AIDS viruses were administered through a massive smallpox vaccine campaign in central and southern Africa by the World Health Organization in 1977. A year later ads appeared in major US newspapers soliciting “promiscuous gay male volunteers” to take part in a Hepatitis B vaccine study.\n\nThe program targeted male homosexuals age 20-40 in New York City, Los Angeles, Chicago, St. Louis and San Francisco. It was administered by the US Centers for Disease Control which, under its earlier incarnation as the US Public Health Department in Atlanta, oversaw the Tuskegee syphilis experiments on African American males.\n\nSan Francisco has been a target of numerous CIA experiments, due to its high population of left-leaning and gay citizens, which the Illuminati views as “undesirables”. According to Dr. Eva Snead, San Francisco has one of the highest cancer rates in the country. For years Malathion- first developed by the Nazis- was sprayed over the city by helicopters from the CIA’s Evergreen Air, whose Arizona base is used, according to author William Cooper, as CIA transshipment point for Columbian cocaine. The mysterious Legionnaire’s Disease occurs often in San Francisco and the CIA’s MK-ULTRA mind control bad acid program was based there.\n\nThe intellectual force behind the introduction of AIDS was the Bilderberger Group, which became fixated on population control after WWII. Author Cooper says the Policy Committee of the Bilderbergers gave orders to DOD to introduce the AIDS virus. The Bilderbergers are close to the OPClub of Rome, which was founded on a Rockefeller estate near Bellagio, Italy and is backed by the same European Black Nobility who frequent Bilderberger meetings. A 1968 study by the Club of Rome advocated lowering the birth rate and increasing the death rate. Club founder Dr. Aurelio Peccei made a top-secret recommendation to introduce a microbe that would attack the auto-immune system, then develop a vaccine as a prophylactic for the global elite.\n\nOne month after the 1968 Club of Rome meeting Paul Ehrlich published The Population Bomb. The book hints at a draconian depopulation plan in the works. On page seventeen Ehrlich writes, “The problem could have been avoided by population control…so that a ‘death rate solution’ did not have to occur.” A year later MK-NAOMI was born. Peccei himself authored the Club of Rome’s much-touted Global 2000 report, which President Jimmy Carter pushed on his BCCI shakedown cruise of Africa. Peccei wrote in the report, “Man is now vested with unprecedented, tremendous responsibilities and thrown into the role of moderator of life on the planet- including his own”.\n\nThe Bilderbergers were behind the Haig-Kissinger Depopulation Policy, a driving force at the State Department and administered by the National Security Council. Pressure is applied to Third World countries to reduce their populations. Those that do not comply see their US aid withheld or are subject to Pink Plan low-intensity war that targets civilians, especially women of child-bearing age. In Africa famine and brush-fire wars are encouraged. AK-47 rifles can be bought at West African markets for under $50. The same is true in the markets of Peshawar, Pakistan. In 1975, a year after attending a Club of Rome conference on the topic, Secretary of State Kissinger founded the Office of Population Affairs (OPA).\n\nLatin American OPA case officer Thomas Ferguson spilled the beans on OPA’s agenda when he stated, “There is a single theme behind all our work; we must reduce population levels. Either they do it our way, through nice clean methods or they will get the kind of mess that we have in El Salvador, or in Iran, or in Beirut…Once the population is out of control it requires authoritarian government, even fascism, to reduce it…The professionals aren’t interested in reducing the population for humanitarian reasons…Civil wars are somewhat drawn-out ways to reduce the population. The quickest way to reduce population is through famine like in Africa. We go into a country and say, here is your goddamn development plan. Throw it out the window. Start looking at your population…if you don’t …then you’ll have an El Salvador or an Iran, or worse, a Cambodia”.\n\nFerguson said of El Salvador, “To accomplish what the State Department deems adequate population control, the civil war (run by CIA) would have to be greatly expanded. You have to pull all the males into the fighting and kill significant numbers of fertile, child-bearing age females. You are killing a small number of males and not enough fertile females to do the job…If the war went on 30-40 years, you might accomplish something. Unfortunately, we don’t have too many instances of this to study”.\n\nIn 1961 Kennedy Administration officials McGeorge Bundy, Robert McNamara, and Dean Rusk, all CFR and Bilderberger members, led a study group that looked into “the problem of peace”. The group met at Iron Mountain, a huge underground corporate nuclear shelter near Hudson, New York, where CFR think tank The Hudson Institute is located. The bunker contains redundant offices in case of a nuclear attack for Exxon Mobil, Royal Dutch/Shell and JP Morgan Chase. A copy of the group discussions, known as Report from Iron Mountain, was leaked by a participant and published in 1967 by Dial Press.\n\nThe report’s authors saw war as necessary and desirable stating “War itself is the basic social system, within which other secondary modes of social organization conflict or conspire. (War is) the principal organizing force…the essential economic stabilizer of modern societies.” The group worried that through “ambiguous leadership” the “ruling administrative class” might lose its ability to “rationalize a desired war”, leading to the “actual disestablishment of military institutions”.\n\nThe report goes on to say, “…the war system cannot responsibly be allowed to disappear until…we know exactly what we plan to put in its place…The possibility of war provides a sense of external necessity without which no government can long remain in power…The basic authority of a modern state over its people resides in its war powers. War has served as the last great safeguard against the elimination of necessary classes.”\n\nHistorian Howard Zinn described this conundrum when he wrote, “American capitalism needed international rivalry- and periodic war- to create an artificial community of interest between rich and poor, supplanting the genuine community of interest among the poor that showed itself in sporadic movements”.\n\nThe Iron Mountain gang was not the first to discover the virtues of war. In 1909 the trustees of the Andrew Carnegie Foundation for International Peace met to discuss pre-WWI American life. Many of the participants were members of Skull & Bones. They concluded, “There are no known means more efficient than war, assuming the objective is altering the life of an entire people…How do we involve the United States in a war?”\n\nThe Report from Iron Mountain goes on to propose a proper role for those of the lower classes, crediting military institutions with providing “antisocial elements with an acceptable role in the social structure. The younger and more dangerous of these hostile social groupings have been kept under control by the Selective Service System… A possible surrogate for the control of potential enemies of society is the reintroduction, in some form consistent with modern technology and political process, of slavery…The development of a sophisticated form of slavery may be an absolute prerequisite for social control in a world at peace.”\n\nThe Iron Mountain goons, though thrilled by the idea of slavery, listed as other socioeconomic substitutions for war: a comprehensive social welfare program, a giant open-ended space program aimed at unreachable targets, a permanent arms inspection regime, an omnipresent global police and peacekeeping force, massive global environmental pollution which would require a large labor pool to clean up, socially-oriented blood sports and a comprehensive eugenics program.\n\nThe Iraqi genocide fulfilled the dreams of the Club of Rome Zero Population Growth maniacs, while also providing a testing ground for two of the war substitutes proposed by the Iron Mountain fascists: an arms inspection regime and UN peacekeepers. Both concepts gained traction in the international community thanks to the Gulf War.\n\nEstimates of Iraqi casualties during the Gulf War are sobering. Some organizations like Greenpeace put the death toll at near one million people. It was a war in which the media was denied access on a scale never before seen, so casualty figures vary greatly. According to Tony Murphy, a researcher at the International War Crimes Tribunal, the US attack on Iraq killed 125,000 civilians, while destroying 676 schools, 38 hospitals, 8 major hydroelectric dams, 11 power plants, 119 power substations and half the country’s telephone lines. The attacks occurred mostly at night when people were most vulnerable.\n\nIn the months following the war the death rate of Iraqi children under five tripled. Thirty-eight percent of these deaths were caused by diarrhea. Victor Filatov, a Russian journalist reporting for Sovetskaya Rossiya from post-war Baghdad wrote, “What further bloodshed do these barbarians of the 20th century need? I thought the Americans had changed since Vietnam…but no, they never change. They remain true to themselves.”\n\nAccording to former US Attorney General Ramsey Clark, the US was found guilty of nineteen war crimes against Iraq before the International War Crimes Tribunal. The US dropped 88,000 tons of bombs on Iraq during the Gulf War and has rained down countless more bombs since. Many bombs were tipped with armor piercing depleted uranium (DU) warheads, which may account for chronic Iraqi health problems. Dr. Siegwart-Horst Gunther, a German physician who came to Iraq to help its people, became gravely ill when he handled just one cigar-sized fragment from a DU warhead. Dr. Gunther measured the tiny object’s radioactivity to be 11 microSv per hour, whereas an acceptable exposure is no more than 300 microSv per year. Three hundred tons of DU ammunition was deployed during the war.\n\nMany believe DU is responsible for Gulf War Syndrome, which has killed and permanently injured many US soldiers who fought in the Persian Gulf theater. Since 2000, nearly 11,000 US Gulf War veterans have died from Gulf War Syndrome, while the Pentagon continues to cover up this travesty.\n\nThe US also tested numerous top-secret high-tech weapons systems in the Gulf theatre, while utilizing some old low-frequency favorites. When Iraqi ground forces surrendered, many of them were in a state of delirium and lethargy that could have been induced by extremely low-frequency radio waves, which the US used as a weapon as early as the Vietnam conflict.\n\nYale University and CIA psychiatrist Dr. Jose Delgado studied mind control for the Company during the 1950’s as part of the MK-ULTRA program. Delgado determined, “Physical control of many brain functions is a demonstrated fact…it is even possible to create and follow intentions…By electronic stimulation of specific cerebral structures, movements can be induced by radio command…by remote control.”\n\nAccording to a military document written by Colonel Paul Valley and Major Michael Aquino titled From PSYOP to Mindwar: The Psychology of Victory, the US Army used an operational weapons system “to map the minds of neutral and enemy individuals and then to change them in accordance with US national interests”. The technique was used to secure the surrender of 29,276 armed Viet Cong and North Vietnamese Army soldiers in 1967 and 1968. The US Navy was also heavily involved in “psychotronic” research. Many US soldiers who served near the DMZ that divided North and South Vietnam claimed to see UFOs on a regular basis. The Pentagon Papersrevealed that an electronic barrier was placed along the DMZ by the secretive JASON Society.\n\nMajor Michael Aquino was an Army psyops specialist in Vietnam, where his unit specialized in drug-inducement, brainwashing, virus injection, brain implants, hypnosis, and use of electromagnetic fields and extremely low-frequency radio waves. After Vietnam, Aquino moved to San Francisco and founded the Temple of Set. Set is the ancient Egyptian name for Lucifer. Aquino was now a senior US Military Intelligence official. He’d been given a Top Secret security clearance on June, 9, 1981. Less than a month later an Army intelligence memo revealed that Aquino’s Temple of Set was an off-shoot of Anton La Vey’s Church of Satan, also headquartered in San Francisco. Two other Set members were Willie Browning and Dennis Mann. Both were Army Intelligence officers.\n\nThe Temple of Set was obsessed with military matters and political fascism. It was especially preoccupied with the Nazi Order of the Trapezoid. Aquino’s “official” job was history professor at Golden Gate College. The Temple recruited the same Hells Angels who Billy Mellon Hitchcock had used to dole out his bad CIA acid. Its members frequented prostitutes where they engaged in all manner of sadomasochistic activities. Director of Army Counter-Intelligence Donald Press revealed that Dennis Mann was assigned to the 306 PSYOPS Battalion and that Aquino was assigned to a top secret program known as Presidio.\n\nPresidio is also the name of a spooky complex in the Golden Gate National Recreation Area, which Mikhail Gorbachev reportedly frequented as the Soviet Union was falling apart. Was Aquino part of an operation to “map the mind” of the Soviet Union’s last leader and induce him into proposing both glasnost and perestroika, the two free market policies that ultimately led to the Soviet Union’s demise? Remember the curious mark which suddenly appeared on Gorbachev’s forehead? Was he implanted with some sort of microchip mind-control device to make him think “in accordance with US national interests”?\n\nSuch Orwellian technology is marketed on a regular basis throughout the world. International Healthline Corporation and others sell microchip implants in the US, Russia and Europe. The Humane Society has adopted a policy of micro-chipping all stray pets. The State of Hawaii requires that all pets be micro-chipped. Six thousand people in Sweden have accepted a microchip in their hand, which they use for all purchases. Trials are also underway in Japan. In July 2002, National Public Radio reported a similar trial beginning in Seattle. Later in 2002, after a rash of suspicious abductions of young girls, BBC reported that a British company plans to implant children with microchips so that their parents can monitor their whereabouts.\n\nDr. Carl Sanders, a highly acclaimed electronics engineer, revealed that a microchip project he launched to help people with severed spinal cords was taken over by the Bill Colby’s Operation Phoenix in a series of meetings organized by Henry Kissinger. Sanders says the optimal spot for a microchip implant is just below the hairline on a person’s forehead, since the device can be recharged by changes in body temperatures, which are most pronounced there. Interestingly, this is the location of the pineal gland or Third Eye.\n\nThe 1986 Emigration Control Act grants the President the power to mandate any kind of ID he deems necessary. Researchers at Southern California have developed a chip which mimics the hippocampus, the part of the brain that deals with memory. Pentagon officials are interested in using it in experiments to create a “super-soldier”. Another microchip called Braingate is being implanted in paralyzed people. It allows them to control their environment by simply thinking.\n\nIn Iraq, psychological warfare gave way to slow genocide. According to UNICEF, as of late 2001, 1.5 million Iraqi children had died as a result of sanctions, while one child in ten died before their first birthday. Thalassemia, anemia and diarrhea were the biggest killers and could have been prevented were it not for a chronic shortage of blood and medicine in Iraq due to the sanctions. UN Committee 661 served as arbiter of what constituted a “dual use” item and therefore banned for import into Iraq. As of 2001, over 1,600 Iraqi contracts with Western companies for medical equipment had been blocked by 661.\n\nThe Gulf War decimated Iraq’s sewer and water treatment systems. Iraqis were forced to drink polluted water, leading to numerous health problems. Iraq was not allowed to import chlorine to clean the water since 661 deemed it a potential chemical weapon. Electrical power was rationed in three-hour daily increments per household since the Iraqi government couldn’t get the parts it needed to fix its power plants after the US bombed its entire power grid. With the devaluation of the Iraqi dinar and the ban on the export of 2.4 million barrels of oil per day, the average Iraqi lived on $2.50 a month- enough to buy a pair of shoes. The only Iraqis not affected were the wealthy elite, who had long ago stashed their savings overseas in US dollars.\n\nUNICEF estimates that 28% of Iraqi children no longer went to school. Before the war almost all children attended. Often families could only afford to send one child to school because of the cost of simple things like backpacks, shoes and notebooks. Rafah Salam Aziz, Director of Mansour Children’s Hospital, said parents were often forced to make similar decisions about their children’s lives. Aziz said, “Many times it’s easier for a family to let a baby die rather than let the whole family go hungry and get sick.”\n\nIn 1996 Clinton Defense Secretary William Perry announced a new military buildup in the Persian Gulf. Soon cruise missiles were again raining down on Baghdad. Many nations now grew weary of both US bombing and the sanctions regime, which was brutalizing the Iraqi people while strengthening the grip of Saddam Hussein. Russian President Boris Yeltsin, whose country signed a deal with Iraq to rebuild its shattered oil sector, said he was disturbed at the use of “extreme and radical force against the Arab world”. The Russian opposition offered a more scalding appraisal. Alexander Lebed stating angrily, “The US is like a strong master who spits on everybody.”\n\nTurkey, Jordan and Syria all expressed unease over the new round of bombing. Even the Saudis, where Islamic fundamentalism was on the rise and two major bombings had occurred at US bases, now refused to allow the US to use its bases to bomb Iraq. Many countries, including France, began openly flaunting the UN embargo against Iraq in the late 1990’s.\n\nDennis Halliday, former Assistant Secretary of the UN who initially headed the UN Humanitarian Program to Iraq, resigned his post in protest. He said sanctions were demolishing the very class of Iraqi people who wanted to create a better government in the country. He was scornful of the UN Oil for Food Program under which the US received 70% of Iraqi oil. Halliday stated plainly, “We are guilty of committing genocide, through the Security Council, against Iraq.”\n\nHalliday’s 1998 successor was Hans Van Sponeck, who watched as the UN unfurled the UNSCOM arms inspection regime, paid for by Iraqi oil sales. US inspector Scott Ritter confirmed Iraqi suspicions that UNSCOM was gathering intelligence for CIA and Mossad. UNSCOM was just the latest CIA tool. In 1996 the Iraqi government claimed international relief agencies, including the World Food Program, which claimed to be helping the Kurds, were actually CIA operatives attempting to destabilize the country.\n\nIn fact the CIA had spent more than $20 million in its support of the Iraqi National Congress, led by long-time CIA surrogate Jalal Talibani’s PKK Kurdish faction. In January 1997 Iraq uncovered two Mossad spy rings in one month following the attempted assassination of Saddam Hussein’s son. Hans Van Sponeck had seen enough. He too resigned in protest.\n\nIn early 1999 it was revealed that the US had used UNSCOM to plant electronic bugging devices in the Iraqi Ministry of Defense. Arms inspector Scott Ritter said the CIA was using UNSCOM to “provoke a crisis”. In December 1998 UNSCOM, faced with the embarrassing accusations of espionage, pulled out of Iraq. On December 15th the US launched a new round of bombing. Ritter says intelligence gathered by UNSCOM was used for targeting. UNSCOM spokesman David Kay resurfaced in 2003 calling for a US invasion of Iraq. He now worked for SAIC, which landed numerous Pentagon contracts to rebuild Iraq.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Cabal’s Depopulation Agenda - The Event Chronicle", "description": "While the global elite construct underground bunkers, eat organic and hoard seeds in Arctic vaults; the global poor are being slowly starved thanks to high commodity prices and poisoned with genetically modified (GMO) food.", "url": "https://theeventchronicle.com/the-cabals-depopulation-agenda/", "site_name": "The Event Chronicle", "article:published_time": "2014-07-29T07:18:08+00:00", "article:modified_time": "2020-06-15T07:41:33+00:00", "image": "https://theeventchronicle.com/wp-content/uploads/2020/06/THE-GLOBAL-DEPOPULATION-AGENDA.jpg", "image:width": "1920", "image:height": "1080", "image:type": "image/jpeg"}, "tags": ["Illuminati", "AIDS", "OPA", "CIA", "Depopulation", "Cabal", "Human", "David Rockefeller", "Depopulation Agenda", "Science"], "tweets": [], "movies": [], "links": ["https://theeventchronicle.com/the-illuminati-and-the-house-of-rothschild/", "https://en.wikipedia.org/wiki/Selective_Service_System", "https://www.history.com/this-day-in-history/war-in-iraq-begins"], "authors": ["John Morse"], "publish_date": "2014-07-29T07:18:08+00:00"}