{"result_id": "293011", "URL": "https://theeventchronicle.com/gwen-towers-mind-control-weapons/", "timestamp": "2023-04-25 17:21:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theeventchronicle.com/wp-content/uploads/2020/06/cropped-favicon-32x32-2-32x32.png", "canonical": "https://theeventchronicle.com/gwen-towers-mind-control-weapons/", "encoding": "UTF-8"}, "image": null, "domain": "theeventchronicle.com", "title": "GWEN Towers - ELF Scalar Mind Control Weapons", "cleaned_text": "This article is an overview of how we are controlled by technology – from having our brainwaves deliberately changed en masse by transmitters regulating our state of consciousness, to how we are victims of electromagnetic waves disrupting the state of our health and finally how many of us will die, as decided by our global masters.\n\nEarth is wrapped in a donut shaped magnetic field. Circular lines of flux continuously descend into the North Pole and emerge from the South Pole.\n\nThe ionosphere, an electromagnetic-wave conductor, 100 kms above the earth, consists of a layer of electrically charged particles acting as a shield from solar winds. Natural waves are related to the electrical activity in the atmosphere and are thought to be caused by multiple lightning storms.\n\nCollectively, these waves are called “The Schumann Resonance,” the current strongest at 7.8 Hz.\n\nThese are quasi-standing extremely low frequency (ELF) waves that naturally exist in the earth’s “electromagnetic” cavity, the space between the ground and the ionosphere. These “earth brainwaves” are identical to the spectrum of our brainwaves.\n\nThe Creator designed living beings to resonate to this natural frequency pulsation in order to evolve harmoniously. The ionosphere is being manipulated by US government scientists using an Alaskan transmitter called HAARP, (High-Frequency Active Auroral Research Program) which sends focused radiated power to heat up sections of the ionosphere, which bounces power down again.\n\nELF waves from HAARP, when targeted on certain areas, can engineer weather and create mood changes effecting millions of people.\n\nThe intended wattage is 1,700 billion watts of power. A former govt. insider deduced they want to flip the world upside down. Sixty-four (64) elements in the ground modulate, with variation, the geomagnetic waves naturally coming from the ground. The “earth’s natural brain rhythm” above is balanced with these.\n\nThese are the same minerals as the red blood corpuscles. There is a relation between the blood and geomagnetic waves. An imbalance between Schumann and geomagnetic waves disrupts biorhythms.\n\nThese natural geomagnetic waves are being replaced by artificially created very low frequency (VLF) ground waves coming from GWEN Towers.\n\nGWEN (Ground Wave Emergency Network) transmitters, placed 200 miles apart across the USA, allow specific frequencies to be tailored to the geomagnetic-field strength in each area, allowing the magnetic field to be altered.\n\nThey operate in the VLF range, with transmissions between VLF 150 and 175 KHz. They also emit UHF waves of 225 – 400 MHz.\n\nThe VLF signals travel by waves that hug the ground rather than radiate into the atmosphere. A GWEN station transmits up to a 300-mile radius, the signal dropping off sharply over distance. The entire GWEN system consists of, (depending on source of data), from 58 to an intended 300 transmitters, spread across the USA, each with a tower 299-500 ft high.\n\nThree hundred (300) ft. of copper wire fans out in a spoke like fashion from the base of the underground system, interacting with the earth like a thin shelled conductor, radiating radio wave energy for very long distances through the ground. The USA bathes in this magnetic field which rises to 500 ft, even going down to basements, so everyone is subject to mind control.\n\nThe whole artificial ground wave spreads out over USA like a web. It is easier to mind-control and hypnotize people who are bathed in an artificial electromagnetic wave.\n\nCovering the entire floor with aluminum and buying a CET (Cosmic Energy Transformers ) cylinder from various places -one of them, Nordic Living Water Systems – can help.\n\nGWEN transmitters have many different functions, including controlling the weather, mind, behavior and mood control of the populace.\n\nThey are also used to send synthetic telepathy disguised as infrasound to those victims of US government mind-control implants.\n\nThese towers work in conjunction with HAARP and the Russian Woodpecker transmitter, a system similar to HAARP. The Russians openly market a small version of their weather-engineering system called Elate, which can fine-tune weather patterns over a 200 mile area and have the same range as the GWEN unit. One such system operates at the Moscow airport.\n\nThe GWEN Towers shoot enormous bursts of energy into the atmosphere in conjunction with HAARP.\n\nThe internet website: www.cuttingedge.org, published an expose on how the major floods of 1993 in the Mid-Western United States were instigated by these systems. How does this happen?\n\nInvisible, enormous rivers of water, consisting of vapors that flow, move towards the poles in the lower atmosphere. They rival the flow of the Amazon River and are 420 to 480 miles wide and up to 4,800 miles long.\n\nThey are 1.9 miles above the earth and move 340 lbs of water per second. There are 5 atmospheric rivers in each Hemisphere. A massive flood can be created by damming up one of these massive vapor rivers, causing huge amounts of rainfall to be dumped. The GWEN Towers positioned along the areas north of the Missouri and Mississippi Rivers were turned on for 40 days and 40 nights, probably mocking the Flood of Genesis. (This was in conjunction with HAARP).\n\nThe damming of the vapor rivers creates a river of electricity flowing thousands of miles through the sky and down to the polar ice-cap, manipulating the jet-stream. Again, these two major rivers flooded, causing agricultural losses of $12-15 billion.\n\nHAARP also produces earthquakes by focusing on the fault lines. GWEN Towers are positioned on the fault lines and volcanic areas of the Pacific Northwest.\n\nIn 1963, Dr. Robert Becker explored effects of external magnetic-fields on brainwaves, showing a relationship between psychiatric hospital admissions and solar magnetic storms. He exposed volunteers to pulsed magnetic-fields similar to magnetic storms, and found a similar response. In the United States, sixty (60) Hz electric-power ELF waves vibrate at the same frequency as the human brain. In the United Kingdom, fifty (50) Hz electricity emissions depress the thyroid.\n\nDr. Andrija Puharich (in the 1950 & 60s), found that a clairvoyant’s brainwaves turned to 8 Hz when their psychic powers were operative. In 1956, he observed an Indian Yogi controlling his brainwaves, deliberately shifting his consciousness from one level to another.\n\nPuharich trained people via bio-feedback to do this consciously, that is, creating 8 Hz waves with the technique of bio-feedback.\n\nA psychic healer generated 8 Hz waves through a hands-on healing process, actually alleviating that patient’s heart trouble; the healer’s brain emitting 8 Hz. One person, emitting a certain frequency, can make another also resonate to the same frequency.\n\nOur brains are extremely vulnerable to any technology that sends out ELF waves, because they immediately start resonating to the outside signal by a kind of tuning-fork effect.\n\nPuharich made ELF waves change RNA and DNA in the body, breaking hydrogen bonds to make a person resonate at a higher vibratory rate.\n\nHe really wanted to go beyond the psychic 8 Hz brainwave and attract psi phenomena.\n\nJames Hurtak, who once worked for Puharich, also wrote in his book The Keys of Enoch that ultra-violet caused hydrogen bonds to break and this raised the vibratory rate.\n\nPuharich presented the mental effects of ELF waves to military leaders, but they would not believe him. He then gave this information to certain dignitaries of other Western nations. The US Government burned down his home in New York to shut him up, whereas he then fled to Mexico. However, the Russians discovered which ELF frequencies affected what portion of the human brain; it was on July 4, 1976, that they began zapping the U.S. Embassy in Moscow with electromagnetic-waves, varying the signal, also focusing on 10 Hz. (10 Hz puts people into a hypnotic state).\n\nRussians and North Koreans use this in portable mind-control machines to extract confessions. (This system can also be found in some American Churches to help the congregation believe!)\n\nThis Russian “Woodpecker” signal was traveling across the world from a transmitter near Kiev. The US Air Force identified 5 different frequencies in this compound that the harmonic Woodpecker was sending through the earth and atmosphere.\n\nIn 1901, Nikola Tesla, Nobel prize winner in Physics (shared with Einstein) revealed that power could be transmitted through the ground using ELF waves. Nothing stops or weakens these signals. The Russians retrieved Tesla’s papers when they were returned to Yugoslavia after his death.\n\nIn Mexico, Puharich continued to monitor the Russian ELF wave signal and the higher harmonics (5.340 MHz) in the MHz range. He was somehow induced to work for the CIA and he and Dr. Robert Becker designed equipment to measure these waves and their effect on the human brain.\n\nPuharich started his work by putting dogs to sleep. By 1948/49, he had graduated to monkeys, deliberately destroying their eardrums to enable them to pick up sounds without the eardrum intact.\n\nHe discovered a nerve from the tongue could be used to facilitate hearing. He created the tooth implant that mind-control victims are now claiming was put in by their dentist, unbeknownst to them, and causing them to hear “voices in their head.’ These were placed under caps or lodged in the jaw.\n\nImplants are now smaller than a hair’s width and are injected with vaccine and flu shots. Millions have had this done unknowingly. These “biochips’ circulate in the bloodstream and lodge in the brain, enabling the victims to hear “voices’ via the implant. There are many kinds of implants now, and it is estimated that 1 in 40 people are recipients of these tiny implants due to alien abductions.\n\nHowever, others have suggested that one in 20 might just be a more accurate statistic.\n\nThe fake alien abduction – these revealed by many victims – are actually engineered by the U.S. military, using advanced technology to create holograms (4th dimensional pictures) or holographic spaceships outside.\n\nThis holographic, advanced technology can actually create a scenario whereas the person believes he/she is going into a spaceship. However, once inside, the aliens are in masquerade; they are actually military personnel outfitted in full costumes, masks et al..\n\nCertainly real abductions occur, however, the “alien abduction” scenario has been most useful to the military in confusing the over all issue. This clouding tends to halt any further investigation into a government participation and inevitably absolves them of any accountability.\n\nThey are banking on the poor helpless victims feeling too intimidated to reveal such a shocking episode, lest ridicule be visited upon them.\n• Are the global masters forcing us to respond to an artificially induced vibratory rate?\n• Those power mongers who want this planet to have a sudden leap in evolution, populated only by the psychically aware and therefore superior class of human?\n• What about the billions of people who are commonly referred to as “useless eaters”; are they to be conveniently disposed of by electro-magnetically-induced cancers and diseases?\n\nIt certainly causes one to stop and ponder this catastrophic situation.\n\nThe physics and engineering behind electromagnetic disease transmission are frightening. Diseases can be reproduced as “disease signatures” in that the vibration of a disease can be manufactured and sent on to be artificially induced. (The brainwave pattern of hallucinogenic drugs can also be copied and sent by ELF waves to induce “visions”).\n\nOnce diseases are sprayed in the air, electromagnetic waves attune to the disease by using harmonics and sub-harmonics, which in turn make them even more lethal and infectious; actually a more apt description would be deadly, as in inducing death.\n\nThe skies are filled daily with chemtrails, those crisscrossed white patterns that are sprayed out across the heavens in the United States and other countries.\n\nAre these like contrails that jets emit behind them? Not exactly… contrails dissipate rather quickly, but the chemtrails – those feathery streaks that linger – are deliberately being sprayed and contain insidious chemicals (retrieved, analyzed and proven) which affect the state of consciousness, producing apathy.\n\nThis is only one “program” that has been initiated to keep the populace in a continual apathetic state. Add to this, the fluoridation of the drinking water, aspartame nutri-sweet, etc., and other highly-questionable drugs.\n\nFluoride disables the willpower section of the brain, impairing the left occipital lobe. Both fluoride and selenium (in additional amounts) can produce strange effects; one common symptom is that of “hearing voices’.\n\nELF waves create disturbances in the biological processes of the body, activated on a large scale once the body has been exposed to the aforementioned disease-causing chemtrails.\n\nSome chemtrails have been analyzed under laboratory conditions, the elements shown to cause cleavages in spatial perceptions, blocking the interaction of various amino acids that relate to higher-consciousness. Some were also shown to increase dopamine in the brain thereby producing a listless, euphoric state of lower reactive mind.\n\nThis is done to basically create confusion, rendering a person unable to differentiate between the real and illusionary. In addition, some of these chemtrails could be connected with the many UFO abductions occurring on a global massive scale.\n\nMany victims, some recalled under hypnotic regression, have witnessed other abductees laid out on tables (in a sort of assembly line operation) and in the process or being implanted.\n\nIntelligence agencies are in league with each other, behind this disablement of the masses to such a degree where they can’t even fight back. In order to implement their plans, that of total control of the populace, they need the overall “frequency” of each victim to function at a specific rate, below the threshold of awareness.\n\nCould this be part of a greater plan with mind-control transmitters covering the whole of USA and England, cleverly disguised as cell phone towers and trees? The power from microwave towers may be turned up to such a level that people will die.\n\nA brain functioning at beta-level (above 13 Hz) is agitated and cannot change the perceptions if it is artificially stabilized to that frequency by technological methods. This frequency may also increase body electricity in others, giving them psychic powers. Is this linked to the new-agers claim of a 12-14 Hz Schumann Resonance, inching us towards the 4th dimension?\n\nStimulants ingested globally from higher-caffeine, genetically modified plants, may also make an impact on the “global-brain” in the ionosphere that is collecting our brainwaves.\n\nNew-age channelers say we are going into a 4th dimensional frequency. They “heard’ the voice of some “ET” who informed them of this.\n\nHowever, some “ETs” are just plain earthians in disguise. Using Tesla Technology, Prisoners in the Utah State Prison were bombarded with voices from a “purported” ET, each prisoner receiving the same identical message. Curious, indeed. Today, it is relatively simple to produce these “voices in the head.” Implants/microchips are no longer necessary.\n\nIn 1988, an inmate in Draper Prison, Utah by the name of David Fratus wrote:\n\nHundreds of inmates at the Gunnison Facility of the Utah State Prison and the State Hospital were subjected to this brand of mind-control, used as test subjects like rats in a lab.\n\nIn the early 1970s, this was revealed in the Utah U.S. District Court.\n\nWhile incarcerated, these inmate test subjects, having been subjected to this Tesla-wave mind-control, tried to seek restitution in the courtroom. Unfortunately, they were unsuccessful.\n\nThe University of Utah researched how Tesla-waves could be used to manipulate the mind into hearing voices, overriding and implanting thoughts into the mind, in addition to reading thoughts. They also went about developing eye-implants. Cray (The Cadillac of computers, ultra sophisticated) computers, using artificial intelligence, monitor the victims of government produced implants, sending pre-recorded sound bytes or occasional live messages.\n\nThey are picked up by satellite and relayed to whatever large TV broadcasting antenna, GWEN tower or other antenna that is nearest the victim. It is believed that some types of implants pick up the signal and broadcast the correct Tesla-wave pattern to create voices within the victim.\n\nThe tracking implant keeps the staff and the satellite system informed every few minutes as to exactly where to send the voice signals. The master computer and central HQ for this is reported to be Boulder, CO. It is thought that transponders are being made there.\n\nThe central cellular computer is in the Boulder, CO National Bureau of Standards building. AT&T is also cooperating; several agencies work together on this.\n\nTim Rifat of UK wrote that “this inter-cerebral hearing” is used to drive the victim mad, as no one else can hear the voices transmitted into the brain of the target. Transmission of auditory data directly into the target’s brains using microwave carrier beams is now common practice. Instead of using excitation potentials, one uses a transducer to modify the spoken word into ELF audiograms that are then superimposed on the pulse modulated microwave beam.\n\nOn March 21, 1983, The Sydney Morning Herald published this by Dr. Nassim Abd El-Aziz Neweigy, Assistant Professor of Agriculture, Moshtohor Tukh-Kalubia, Egypt.\n\nAnother source says that these have been fed with the world’s languages and synthetic telepathy will reach into people’s heads making people believe God is speaking to them personally to enact the Second Coming, complete with holograms!\n\nThe Russians broke the genetic code of the human brain.\n\nThey worked out 23 EEG band-wave lengths, 11 of which were totally independent. So if you can manipulate those 11 you can do anything. NSA’s (U.S. National Security Agency) Cray computers can remotely track people just by knowing the specific EMF waves (evoked potentials from EEGs in the 30-50 Hz, 5 milliwatt range) of a person’s bioelectric-field.\n\nEach person’s emissions are unique and they can remotely track someone in public.\n\nNow if this isn’t a horrifically frightening thought, I don’t know what is.\n\nEvoked potentials officially do not exist in physics, but in 1873 a Scotsman, James Clerk Maxwell, discovered that electromagnetic waves have 3 components. He discovered waveforms that exist at a certain number of right-angled rotations away from the electromagnetic field. These are hyper-spacial components, not subject to constraints of time and space.\n\nHe claimed that electromagnetic radiation waves were carried by the ether and the ether was disturbed by magnetic lines of force. The hidden component is called only “potential’ now and not normally used except for covert hyper-dimensional physics and to manipulate consciousness itself via electromagnetic-waves covering vast areas of the planet.\n\nApproximately one person in 3000 is sensitive to this magnetic waveform component, the telepathic types, (according to a writer called “Majix”), and we are all capable of tuning into this magnetic component by tuning our subconscious to it. Maxwell’s successors thought potentials were akin to mysticism because they believed fields contain mass which cannot be created from nothing.\n\nThis is what potentials are – both literally and mathematically – an accumulation or reservoir of energy, consequently this hasn’t been taught in mainstream physics.\n\nSubliminal words (in the correct electromagnetic-field and attuned to the human brain) that express human consciousness can enter our minds at a subconscious level. Apparently, our brain activity patterns can be measured and stored on super-computers. If a victim needs to have subliminal thoughts implanted, all that is necessary is to capture that brain activity pattern, (saved on the mega computer) and target or match up that person’s pattern.\n\nThe targeted or specified person is then sent low frequency subliminal messages that they actually think are their own thoughts.\n\nThe researcher Majix says our brains are so sensitive, that they are like liquid crystal in response to the magnetic component of the earth. We are sensitive to earth’s magnetic changes, changes in the ionospheric cavity and resonate those frequencies ourselves. We are incredibly complex entities, beyond the layperson’s comprehension. Our brains are indeed a type of bio-cosmic transducer.\n\nPhysicists in Russia have conducted in-depth studies on the effects of the mean annual magnetic-activity, electro-magnetic and electro-static fields on human behavior and the physical body.\n\nThese electromagnetic and electro-static fields can be likened to what is popularly known as biorhythms. These magnetic frequencies can be manipulated from a very simple piece of equipment operated at extremely low power levels; our brain waves can mimic magnetic frequencies.\n\nFrom half a second to 4 seconds later, the neurons and brain waves are driven exclusively by this device; power levels almost nonexistent.\n\nAll one needs is a circularly polarized antenna, aimed up at the ionospheric cavity and they can then manipulate the moods of everyone within a 75 sq. mile area. The body picks up these “new” manipulated waves and begins to correspond immediately. What is known as the “sleep” frequency will make everyone become tired and sleep.\n\nIn Let’s Talk MONTAUK, Joyce Murphy presented data that showed that experiments on the 410-420 MHz cycle have been done which could affect the “window frequency to the human consciousness” as a whole.\n\nPreston Nichols, previously mentioned herein, learned from his experimentation with his radio equipment that whenever a 410-420 MHz cycle appeared on the air, a psychic’s mind would be “jammed,” finally tracing the signal to Montauk Point and the red and white radar antenna on the AF Base there.”\n\nTim Rifat wrote in his Microwave Mind Control in the UK article that cellular phones use 435 MHz.\n\nThe United Kingdom police use 450 MHz exclusively. Dr. Ross Adey used this frequency for CIA behavioral modification experiments. Police have a vast array of antennae to broadcast this frequency all over UK.\n\nAdey used 0.75mW/cm2 intensity of pulse modulate microwave at a frequency of 450 MHz, with an ELF modulation to control all aspects of human behavior. 450 MHZ radar modulated at 60 Hz greatly reduced T-lymphocyte activity to kill cultured cancer cells.\n\nA study in the USA of their 60 Hz power lines repeated this.\n\nThrough much study and analysis on this varied topic, independent scientists have concluded that HAARP is slicing up the ionosphere – the world-brain – like a microwave knife, producing long tear incisions and destroying the membrane that holds the reservoir of data accumulated of all earth’s history.\n\nHowever, there can be hope if we are aware of all the possibilities that exist. A healer called Mr. A claimed to have received “Ancient Wisdom” from the earth’s protective Magnetic-Ring of energy which stores within it all knowledge since time began.\n\nRuth Montgomery wrote about this healer in Born To Heal.\n\nHe claimed that if our energy flow is cut off from this magnetic field, (the protective atmospheric magnetic-ring) then the Universal Supply is obstructed and we are no longer in tune with these advantageous frequencies, therefore we begin to get sick.\n\nThe Power from this travels in split-seconds around the world and is available to anyone who is capable of receiving and handling it.\n\nThe waves from The Ring were automatically translated into words in the healer’s mind and interpreted as wisdom to diagnose and heal others; this ability coming from the storehouse of knowledge that has been present since the beginning of time. By tapping into this storehouse, he produced instant miracles, knitting broken bones and removing arthritis.\n\nA photo was produced that displayed forked lightning emitting from his fingers.\n\nThat which we term “reality” – as understood mentally by our thinking processes – is being altered and changed into different expressions to allow complete control of our personal reality – a complete absolution of that which has been normally operative in a divinely ordained, natural frequency.\n\nWe must not allow them to succeed because of the global masses’ ignorance of this very advanced technology.\n\nThese elevated scientific methods have been suppressed for many years and only those very few people in power have been privy to this information and obviously used it with no “good intention” in mind.\n\nDo you want to be turned into a zombie, a robotic, controlled entity walking around in an apathetic state, or do you want to live life as a vital, vibrant human being… as the Divine Creator intended for you?\n\nWe, as united peoples, can turn the tide…", "opengraph": {"locale": "en_US", "type": "article", "title": "GWEN Towers - ELF Scalar Mind Control Weapons - The Event Chronicle", "description": "This article is an overview of how we are controlled by technology – from having our brainwaves deliberately changed en masse by transmitters regulating our state of consciousness, to how we are victims of electromagnetic waves disrupting the state of our health and finally how many of us will die, as decided by our global …", "url": "https://theeventchronicle.com/gwen-towers-mind-control-weapons/", "site_name": "The Event Chronicle", "article:published_time": "2016-05-19T08:26:26+00:00", "article:modified_time": "2020-07-01T13:20:07+00:00", "image": "https://theeventchronicle.com/wp-content/uploads/2020/06/gwen4.jpg", "image:width": "1024", "image:height": "574", "image:type": "image/jpeg"}, "tags": ["Russian Woodpecker", "HAARP", "Dr. Andrija Puharich", "GWEN Towers", "Mind Control Weapons"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Andrija_Puharich", "https://www.britannica.com/biography/Nikola-Tesla"], "authors": ["John Morse"], "publish_date": "2016-05-19T08:26:26+00:00"}