{"result_id": "293013", "URL": "https://theeventchronicle.com/category/health/page/3/", "timestamp": "2023-04-25 17:21:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theeventchronicle.com/wp-content/uploads/2020/06/cropped-favicon-32x32-2-32x32.png", "canonical": "https://theeventchronicle.com/category/health/page/3/", "encoding": "UTF-8"}, "image": null, "domain": "theeventchronicle.com", "title": "Health Archives - Page 3 of 23", "cleaned_text": "\n• 10 Fascinating Facts About Human Brain That Will Wow You We use it every day, but how much do you really know about the human brain? It’s an incredibly complex organ that’s still shrouded in mystery. To this day, scientists are still uncovering new information about its inner workings. If you want to learn more about this fascinating organ, then look no further! In this blog post, we explore some… Read More »\n• Will Vinblastine Be a Boon for Cancer Patients? As the pace of life changes, the environment is polluted, and bad habits are prevalent. More and more people are diagnosed with cancer. Cancer has become the number one killer of human beings. Nowadays, the incidence of cancer is so high that according to statistics, if you can live to 85 years old, your probability of getting cancer in your… Read More »\n• Prevent Your Dentures from Breaking by Following These Care Tips Dentures are a great way to improve your quality of life after teeth loss, so it only makes sense that you take proper care of them. Dentures are quite durable and can last for up to seven years with the right type of maintenance. One of the ways you can proactively ensure that your dentures last as long as possible… Read More »\n• Loose Dentures? Here’s why they Occur and What You can do About Them Dentures have long been a very affordable and effective replacement solution for many who have a few or several of their teeth missing. However, they can be a nightmare when they don’t fit properly. Difficulty chewing and speaking, mouth sores, pain, cuts, gum irritation, blisters, and oral infections are some of the issues that loose dentures can cause. So what… Read More »\n• Follow These Tips for a Smoother Recovery After a Wisdom Teeth Extraction There are a number of different reasons why your dentist might recommend that you get your wisdom teeth removed. Some of the common ones include tooth crowding, infection, cavities and other diseases. The removal of the wisdom teeth is carried out by an oral surgeon, and although the procedure is routine and known to alleviate tooth pain, it is not… Read More »\n• All You Need To Know About Labial Veneers We want to avoid being in a situation whereby we have to hide our smiles away from people. Most of the time, coloured or broken teeth cause self-esteem in people. Many patients go to the dental clinic like the Dentakay dental clinic with curiosity and many questions to ask, one of which is about labial veneers. The full information will… Read More »\n• Holistic Therapy For Addiction Recovery: Try This Alternative Treatment Plan Right Now For many years, the same treatments for addiction have remained the most popular with the goal being to simply get and keep the person off the drug. Now, the world of addiction recovery is evolving and holistic therapy is becoming a more popular option. Holistic addiction recovery focuses on the whole person. Its goal is to not only help the… Read More »\n• Can You Test Negative for an STD But Still Have One? If you’re like most people, you probably think that testing for STDs is a pretty important part of your sexual health. After all, if you don’t know if you’re STD-free, chances are you’re putting yourself at risk. Unfortunately, STD testing isn’t as simple as it seems. In fact, it can be quite complicated and there are a few factors that… Read More »\n• More than 25 different viruses, bacteria, and parasites are known to be transmitted from sexual contact. Sexually transmitted infections are passed through sexual contact from one person to another. Considering many sexual infections, it is better to practice safer sexual contact to lower your risk of contracting any STIs. Some STIs are even spread through only skin-to-skin contact. A regular… Read More »\n• Avoid These Activities if You Are Experiencing Shoulder Pain Shoulder pain is a common injury that can happen to anyone. If you’re unsure whether the pain you’re experiencing is from your shoulder or neck, check out this article to learn how to differentiate between shoulder and neck pain. Shoulder pain can be caused by a number of things, but the most common causes are overuse and injury. Some other causes include… Read More »", "opengraph": {"locale": "en_US", "type": "article", "title": "Health Archives - Page 3 of 23 - The Event Chronicle", "url": "https://theeventchronicle.com/category/health/", "site_name": "The Event Chronicle"}, "tags": [], "tweets": [], "movies": [], "links": ["https://theeventchronicle.com/fascinating-facts-about-human-brain/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/fascinating-facts-about-human-brain/", "https://theeventchronicle.com/fascinating-facts-about-human-brain/", "https://theeventchronicle.com/vinblastine-boon-for-cancer-patients/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/vinblastine-boon-for-cancer-patients/", "https://theeventchronicle.com/vinblastine-boon-for-cancer-patients/", "https://theeventchronicle.com/prevent-your-dentures-from-breaking/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/prevent-your-dentures-from-breaking/", "https://theeventchronicle.com/prevent-your-dentures-from-breaking/", "https://theeventchronicle.com/loose-dentures/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/loose-dentures/", "https://theeventchronicle.com/loose-dentures/", "https://theeventchronicle.com/recovery-after-wisdom-teeth-extraction/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/recovery-after-wisdom-teeth-extraction/", "https://theeventchronicle.com/recovery-after-wisdom-teeth-extraction/", "https://theeventchronicle.com/labial-veneers/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/labial-veneers/", "https://theeventchronicle.com/labial-veneers/", "https://theeventchronicle.com/holistic-therapy-for-addiction-recovery/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/holistic-therapy-for-addiction-recovery/", "https://theeventchronicle.com/holistic-therapy-for-addiction-recovery/", "https://theeventchronicle.com/can-you-test-negative-for-std-but-still-have-one/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/can-you-test-negative-for-std-but-still-have-one/", "https://theeventchronicle.com/can-you-test-negative-for-std-but-still-have-one/", "https://theeventchronicle.com/common-sexually-transmitted-diseases/", "https://theeventchronicle.com/author/john-morse/", "https://theeventchronicle.com/common-sexually-transmitted-diseases/", "https://theeventchronicle.com/common-sexually-transmitted-diseases/", "https://theeventchronicle.com/avoid-these-activities-if-experiencing-shoulder-pain/", "https://theeventchronicle.com/author/shanon-mcdermott/", "https://theeventchronicle.com/avoid-these-activities-if-experiencing-shoulder-pain/", "https://theeventchronicle.com/avoid-these-activities-if-experiencing-shoulder-pain/"], "authors": [], "publish_date": null}