{"result_id": "294036", "URL": "https://thefullertoninformer.com/the-plan-2/", "timestamp": "2023-04-25 17:22:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/the-plan-2/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "THE PLAN «", "cleaned_text": "They are going to bombard us with so many things because they have to scare us back into submission.\n\nThey will start with the mask mandates. They don’t have the power to target the entire country at once. So they will target the weakest of institutions.\n\nYou will see universities call for mask mandates and boosters. That will just be the beginning.\n\n They will start a campaign of rising covid deaths around the world. They are going to use it as an excuse to bring Covid back. They will tell us that vaccines are not working like they used to, so we need to bring back the masks.\n\n They will make excuses for all the adverse reactions to the vaccines. They have already admitted that Canada has over 50,000 officially reported adverse reactions to the Covid vaccines. Over 10,000 are considered serious.\n\nThey are going to expand the vaccines with monkeypox, polio, covid, etc.\n\n They want to inject you with so many vaccines so that when you get sick and die, you will not know what to blame. You cannot prove what caused your death.\n\nThey will soon push polio. The Polio Psyop worked and scared the public in the 1950s into getting polio vaccines.\n\nEvery vaccine you take further reduces your immune system. People are already lining up for monkeypox vaccines.\n\nAgain, they want you to take as many vaccines as possible so you cannot prove what is causing you to get sick. They do not want accountability for your illness/death from the vaccines.\n\n\n\n They have now combined the climate change movement with the pandemic/vaccine/virus agenda.\n\nThey have tried to push the climate change agenda on us with cohesion and it did not work. They tried brute force, and it did not work. They have tried subterfuge/deception, and it did not work.\n\n So they are going to do what every tyrant in the history of humanity has done. They are going to starve the public into submission.\n\nThey have already done this under the guise of “Climate Change/Crisis.”\n\nWe need to curb our grain, our fertilizer, and our livestock. We need to starve the individual to save the planet.\n\n That is why farmers/truckers are going ballistic in the Netherlands. They understand the implications of this.\n\n They want to reduce our food supply by over 30% by 2030, while increasing the population of Canada to 50 million people.\n\nSo what is going to happen to the food supply and food prices? Your standard and cost of living are going to go down and it will create a food shortage.\n\n But don’t worry, they have a solution. They want you to eat bugs.\n\nInflation is only going to get worse. Higher energy costs to heat your home and drive your car.\n\nThe more we comply, the more the government will push ahead with their agenda. They will try to label everyone a conspiracy theorist, anti- vaxxer, and anti-masker.\n\n\n\n They will try to bring back the Covid restrictions this fall/winter. Watch for them to start the propaganda with more covid deaths and “Cases” on the rise.\n\n“How many more Covid deaths are we going to allow before we do something, etc.”\n\nDoing something means taking mandatory vaccines, contact tracing, wearing masks and vaccine passports.\n\nIf you don’t believe me, Germany has already made masks mandatory from October to mid April.\n\nWearing masks on planes and during long-distance travel by train and bus will be mandatory from October to early April all over Germany. Mandatory mask-wearing and the presentation of a negative coronavirus test will apply to hospitals, nursing homes and similar institutions with vulnerable people.\n\n\n\nGermany has introduced a Chinese-style, colour coded vaccine passport system. When you get your vaccine, it’s green to show someone freshly vaccinated you and up to date. There is no such thing as “fully vaccinated” anymore. After three months, your colour coded vaccine passport turns yellow. To remind you that your vaccine is wearing off. To insure your compliance with getting a new booster, you are legally required to wear a mask again.\n\nGerman Health Minister Karl Lauterbach has announced that the nation’s digital contact tracing and vaccine passport app, Corona-Warn-App (“CWA”), will start assigning different colours to citizens based on whether they received a Covid-19 vaccine within the last three months.\n\nThe CWA will assign one colour to citizens who add proof that they received a vaccine within the last three months and a different colour to citizens who add proof of vaccination that’s more than three months old. Only those with the colour showing that they’re “freshly vaccinated” (have received a vaccine within the last three months) will be exempt from Germany’s mask requirement in public indoor spaces.\n\n\n\nBerliner Zeitung also reported that this new German vaccine passport system would be similar to China’s colour code vaccine passport system. China’s system assigns a green, yellow, or red code to citizens. Those with a green code are allowed to move freely, those with a yellow code may be asked to stay home for seven days, and those with a red code have to quarantine for two weeks.\n\n\n\nThey are literally trying to get Germans to inject this poison every 3 months.\n\nIf people take Covid vaccines/boosters every 3 months, it will destroy your immune system and you will see people really get sick and die.\n\n Thank goodness in Canada that only 1% of parents have been getting their children vaccinated for Covid.\n\nWe are going to see more real sickness from taking all these vaccines and our government is going to sweep them all under the rug.\n\nYou are going to see more and more people develop heart conditions and heart attacks.\n\nThe more men that stand up to this tyranny, the more the public will unite. It is not up to the women to stand up..i. it is up to the men. Men need to be men.", "opengraph": {}, "tags": ["corona virus", "air combat usa", "#JOEIMBRIANO", "Doug Chaffee", "Las Vegas Shooting", "The DCCSP", "joe imbriano for city council", "illegal immigration", "Jesus Silva", "greg seabourn", "Fullerton city council", "Greg Sebourn", "Troy High School", "Bruce Whitaker Fullerton", "wifi dangers", "5G", "BRUCE WHITAKER", "JOE IMBRIANO", "Tony Bushala", "Hunt Library", "tony bushala fullerton", "Bruce Whitaker for senate", "barry levinson", "Friends for Fullertons Future", "Travis kiger", "doug chafee", "greg seaborn", "Larry Bennett", "Jim Touchstone", "fullertons sex offender ordinace repeal", "Joe Felz", "Joe Felz Dan Hughes bruce whitaker jennifer fitzgerald", "ladera vista junior high", "kelly thomas", "shawn nelson", "5G DANGERS", "corruption in the fullerton police department", "dan hughes", "Gretchen Cox", "Josh Newman", "ED ROYCE", "obstruction of justice", "jennifer fitzgerald", "Sean Paden", "jennifer Fitzgherald"], "tweets": [], "movies": [], "links": ["https://www.ctvnews.ca/health/coronavirus/germany-announces-new-coronavirus-measures-for-fall-winter-1.6012413", "https://expose-news.com/2022/08/11/germany-vaccine-passports-to-be-colour-coded/", "https://www.lifesitenews.com/news/germany-announces-color-coded-vaccine-passport-system-similar-to-communist-chinas/"], "authors": [], "publish_date": null}