{"result_id": "294045", "URL": "https://thefullertoninformer.com/category/cell-tower-dangers/", "timestamp": "2023-04-25 17:22:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/category/cell-tower-dangers/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "cell tower dangers «", "cleaned_text": "This is the most significant and important lawsuit of the 21st century, and it impacts the entire world. CEO’s and Founders Mark Zuckerberg, Elon Musk, Sergey Brin, Larry Page and Sandar Pichai are also named as defendants along with their companies.\n\nEndangering Humanity with the misuse of Artificial Intelligence, Complicity and Aiding in Physical Genocide inside of China by transferring AI Technology, Engaging in Cultural Genocide of Humanity, & Controlling and programming the Human Race by Social Engineering via AI coding and AI algorithmic biometric manipulation\n\nThis is phase 1 of first lawsuit. We are open for support at a global level. We have a network of thousands around the world and tens of thousands in China, who are witnesses and have been harmed in China from the defendants technology and data transfer.The following are Federal Case Compliant Summary Facts Extracted from the official document filed in San Diego, California. To find out details of financial, personal and corrective behavioral demands, you may access the case in the federal court data base.\n\n1. Endangering and Threatening all of the world’s citizens, and humanity by misusing and weaponizing Artificial Intelligence, Quantum Computing, Robotics, 5G, Machines, Smart Phones, Smart Homes, Smart Cities, IoT’s, Holograms, Mixed Reality, Nano-Technology, Cloning, Gen-Editing, Cybernetics, Bio-Engineering, and the creation of a digital AI Brain linked to Google’s Search engine with the use and extraction of humanities bio-Metrics data, digital bio-metric codes including facial, voice, health, organ, neural network and body recognition technology. Thus, controlling humanities thoughts, actions, biology, bio-metrics, brain neural pathways, the human bodies neural networks that reprograms all human beings through social engineering and bio-digital social programming, without their consent, knowledge, understanding, or free will. Extracting humanities digital footprints in breach of the Nuremberg Laws, FTC Act (15 U.S.C. §§ 41–58 and Engaging in irresponsible and unsafe Research and development of Artificial General Intelligence or Artificial Super Intelligence that could enslave or kill off humanity or give the power to the defendants to enslave humanity in numerous ways on the 5G and other developing networks.\n\n2. Negligence and Complicity in Persecution and Genocide of millions in China, per Article’s 1, 2, 3 and 4 of the Genocide Convention, and 18 U.S.C.A. § 1091§ 1091. Genocide, not limited to Democracy Activits, Falun Dafa Practitioners, Christians, Uyghurs, Tibetans, Journalists, Judges, Lawyers, and Academics inside of China.\n\n3. Transferring and Providing to China, China’s Government and its Companies, knowledge, data, capabilities and technology to weaponize Artificial Intelligence, Quantum Computing, Machines, Robotics, 5G, Bio-Metrics, Cybernetics, Bio-Engineering, IoT’s, Computer Vision, and Human Tracking Technology, and technology that can give China access to Artificial General Intelligence or Artificial Super Intelligence, that endangers the world, and all of humanity, including AI weaponry for assassination. In violation of Breach of Arms Control and Disarmament Act [22 U.S.C. 2551 and Foreign Assistance Act of 1961, as amended [22 U.S.C. 2151, 22 U.S. Code § 2752.Coordination with foreign policy, 22 U.S. Code § 2753. Eligibility for defense services or defense articles, 22 U.S. Code § 2754. Purposes for which military sales or leases by the United States are authorized; report to Congress, Arms Control and Disarmament Act of 1961, 22 U.S.C. § 2551, Atomic Energy Act of 1954, 42 U.S.C. §§ 2011-2021, 2022-2286i, 2296a-2297h-13,\n\n4. Providing to China and Chinese Companies, AI, Health Data and Bio-Metric Technology used for surveillance, tracking, hunting, quarantine, capture, arrest, torture, concentration camps, organ harvesting, and organ trafficking that contributed to the death of Chinese Citizens, including Falun Dafa Practitioners, Uyghurs, Democracy activists, Christians, Tibetans, judicial representatives, professors, journalists, and minority groups, not limited to any gender, race, political affiliation, faith, or persons residing in China. Same violation of fact numbers 2 and 3.\n\n5. Providing to China’s government, their corporations and nefarious entities, Facial Recognition, Voice Recognition, Body Detection, Skeleton Detection, Vital Organ Recognition, Emotion detection, Skin and Health Biometric and other AI technology that led to persecution, torture, organ harvesting, death and cremation of human beings in China, not limited to Uighur, Falun Dafa, Christian, Tibetan, Democracy activists, judges, attorneys, common citizens and other minority groups. Endangering the world by Weaponizing China’s AI Capabilities that is be laid on the (BRI) One Belt One Road linking Asia, Middle East, Africa and Europe, endangering all of humanity. Same violations of facts number 1, 2 and 3.\n\n6. Misrepresenting to the world and deceiving the U.S on Google’s activities in China and their technology transfers that contributed to China’s Quantum AI advancements, surveillance, abuse, torture, concentration camps and murder of its own citizens. Same violations of facts number 1, 2 and 3.\n\n7. Providing health, bio-metric, financial and social network data of Americans, and the world citizenry that is in the hands of the Chinese government, endangering the world and all its peoples on the 5G network.\n\n8. Creating an interconnected platform between Facebook, Google, Alphabet, all entities under Neuralink, and DeepMind that allows for a digital brain to connect to the internet, all digital and bio-digital networks, human bodies, machines, robotics, IoT’s, Augmented Reality, Virtual Reality, Mixed Reality, Holograms and other technologies, that can be used for surveillance, to track, manipulate, control, social engineer, re-engineer, reprogram, brain wash, hunt, quarantine, threaten, arrest, commit cultural genocide, and kill human beings by machines, Bio-Digital AI, Digital AI, and robotics connected to the 5G, 6G and other networks and corporate command centers\n\n9. Creating platforms that is on the verge of developing Artificial General Intelligence and the Subsequent Super Intelligence that will be beyond the control of the human beings working at Neuralink, Alphabet, DeepMind, Google, Facebook or governments.\n\n10. In violation of Article 1, 2, 3 and 4 of the Genocide Convention for weaponizing China’s Artificial Intelligence, Facial, Voice and Other Bio-Metric technology that were used on Chinese citizens. Not to exclude genetic experimentation of human beings in Chinese concentration camps, including hybrid human experiments within the concentration camps.\n\n11. Introducing, planning, promoting and engaging in physical and cultural genocide to humanity by replacing their neural network operating systems with Artificial Intelligence and Machines, merging humans with machines with the interconnection of the internet, internal tech experimentation’s of defendants and consumer products promoted, provided and transferred by the defendants to the public directly and indirectly.\n\n12. Reprogramming and social engineering humanities thoughts and brain chemistry via AI algorithms in the internet, social media, apps, smart phones, IoT’s, computers, wearable devices, implanted technology, virtual reality, augmented reality, mixed reality, holograms, and alternate reality. Not informing and explaining to humanity that their brain chemistry is altered by a replicating software as they engage with the defendants products and services, nor that their thoughts and actions can be manipulated and controlled by smart phones, apps and IoT in connection with the network platforms, technologies and initiatives Google, Alphabet, Facebook, Neuralink, DeepMind, and Tesla are providing and introducing to the public, in turn giving these tech giants complete control and influence over Americans, and humanity.\n\n13. Weaponizing AI by Utilizing humanities bio-metric and social media data and misusing the technology by Controlling the Human Race and its thoughts through Social Engineering and bio-digital social programming by using people’s bio-metric systems through Google and Facebooks eco systems, coding, algorithm unfairness, with the use of social media data, their emotions, weaponization of the internet, smart phones, IoT’s and computers, thus controlling human thoughts, and humanity at a global scale against their free-will and knowledge. Not informing the public that their dependency on smart phones, is due to frequencies and Artificial Intelligence software emitting from the AI systems and devices that is connecting to the neural networks of humans, creating a symbiotic process, making them a cyborg, dependent, reliant, controlled and programmed by the products and services provided by Google, Facebook, Alphabet, Deep Mind, Tesla, and Neuralink. In essence, putting the entire human race in a state of pet and owner relationship, via their bio-metrics, biology, and digital selves neural network operating systems. The Owner being the Artificial Narrow Intelligence, other AI forms, provided by the defendant’s companies, organizations and personal initiatives within their companies and Machine Software’s operating inside the bio-metric systems of human beings.\n\n14. Negligence in Algorithm Fairness that allows hate speech, misinformation and slander to cast doubt on google search engines against people’s efforts to notify and inform the world’s people that millions have been subject to Organ Trafficking, Organ Harvesting, Concentration Camps, Torture, and Abuse and that the risks of Artificial Intelligence is multi-faceted and enormous.\n\n15. Writing Code and Creating Algorithms that has been and is currently engaging in cultural genocide including introduction of cybernetics, robotics, and creating an ecosystem that allows for Beastiality to exist and be forefront on Google’s search engines, affecting societies, and youth’s bio-metrics system after viewing the videos and articles via their smart phones and computers, influencing their thoughts through their bio-metric systems, paving the next generation to degenerate and accept this type of behavior with the introduction and experimentation of bio-engineering and cybernetics.\n\n16. Research and Development conducted by Alphabet, Facebook, Google, DeepMind, Nueralink and other ventures in Silicon Valley have created algorithms and coding that supports, promotes and achieves brain washing of humanity through social engineering and bio-digital social programming, that endangers the human race in its entirety via the interconnection of their platforms, social media, and technology distributed in physical and digital format to society.\n\n17. Writing Code and Having Algorithms that influenced liberals and conservatives to exponentially increase their hate for each other via their bio-metric systems and emotions while attached to smart phones, IoT’s, apps, digital media, Google, Facebook and other interconnected platforms. Causing harm to the nation and the world, and endangering humanity at the geo-political level with nation state leaders undergoing social engineering and bio-digital social programming and control by their platforms to ignore human rights atrocities in China and around the world stemming from the defendant’s algorithm misuse and AI technologies. Implicating world leaders and their citizens to be charged under article 2, 3 and 4 of the genocide conventions. This includes Canadian Prime Minister, the Majority of European Leaders, and the leadership at the United Nation, the media, press, their reporters, and others who have and are still censoring awareness for human rights violations in China or working against it. Writing code and algorithms that controls reporters, media and the press’s thoughts and actions beyond the normal manipulation they receive from special interest groups, producers, or friends who may manipulate them, other reporters and their covered content, thus Weaponizing the media for Google’s development against the media’s free will and knowledge.\n\n18. Negligence on Google and Facebooks Algorithm unfairness caused liberals and conservatives to conflict and fight each other beyond the reasonable norm, affecting their thoughts and emotions via their bio-metric systems being controlled and enhanced by Artificial Narrow Intelligence systems inside the smart phones and the apps partially formed by bias and hateful content that created division and undue hate among Americans and the people of the world.\n\n19. Division caused by misuse and negligence of Algorithms in Facebook and Google, hindered and delayed the U.S administrations efforts to pressure China in time to save more people from concentration camps, death and cremation, in addition to national security concerns that impacts Americans and the world citizenry. This is not limited to the Trump Administration, rather it affected the Obama, and Bush administrations as well. Google hurt America and China for 2 decades at a geo-political level. Google is guilty of Article 2, 3 and 4 of the genocide convention, in addition to complicity.\n\n20. Masking posts and articles by The AI Organization, meant to bring awareness to human rights atrocities in China, on Facebooks Platform. Masking Content created by Cyrus A. Parsa meant to save people form dangers pertaining to human rights violations interlinked with Artificial Intelligence. Banning the book “AI, Trump, China & The Weaponization of Robotics with 5G” for advertisement and masking posts of people working on behalf of The AI Organization. Masking posts of “Artificial Intelligence Dangers to Humanity” book, on Facebooks platforms, and masking other posts from The AI Organization written by Cyrus A. Parsa. These posts related to China, Taiwan, Hong Kong, Iran, big tech, Google, 5G, Robotics, Drones, and Bio-Metrics threats to and Enslavement of Humanity. Releasing the Masks recently after coming under pressure and scrutiny. Hiring Chinese who committed espionage and attacked American companies, including The AI Organization and Cyrus A. Parsa, as well as his associates and victims of persecution.\n\n21. Writing Code and Sustaining Algorithms that propagate an extreme amount of pornography, violent pornography, and insinuation of rape and prostitution, that denigrates females, young girls, altering humanities thoughts and family based concepts of traditional health based ethics via their bio-metric systems, hence, contributing to rape, sex and human trafficking and broken families.\n\n22. Developing Code, Algorithms and Ecosystems that re-programed a generation of people’s bio-metric structure, and brain chemistry to be bio-digitally controlled by Google and every other tech industry with similar platforms that operate on varying types of Artificial Intelligence, including Artificial Narrow Intelligence.\n\n23. Developing Code, Algorithm’s and Ecosystems that created a secondary digital brain inside the brains of AI Scientists to be subservient, controlled and programmed to create, sustain, promote, and grow Google, Alphabets, Facebooks, and other tech giants’ platforms. Elon Musk has also confirmed The AI Organization’s findings, that humans can have a secondary digital brain formed via their neural networks.\n\n24. Developing Code, Algorithms and Ecosystems that creates a secondary digital brain inside the brains of all human beings that can prevent the person from recognizing that they are being controlled, and bypassing any biological resistance to AI Control or human bodies innate capability to resist the formation of a symbiotic and parasitical relationships with AI software and cybernetic hardware via their rational thinking structure in their brain.\n\n25. Not informing consumers that part of the defendants goals for AGI (Artificial General Intelligence) and ASP (Artificial Super Intelligence) has religious goals that can be dangerous to all of humanity, including attempts to retrieve or ask AGI about the inner working of the “simulation”, what, when, how and by whom the simulation was formed, and what is outside it. Neuralink, Google, Alphabet, Facebook, Tesla, and DeepMind have not registered as a religious institution, yet they are engaging in religion under the umbrella of science. In fact, they have turned their companies, into religious institutions with final aim goals identical to most religions. The defendant and their companies are attempting to treat their Technological developments as God, taking all of humanities bio-metrics, data, and connecting it to their quantum, robotic and machine-based AI technology, and upload their digital selves into other bodies, networks or machines, mimicking the beliefs of a spirit or soul. In Fact, Elon Musk stated in an interview, that he wants to develop AI to a point, that it could “give him the answers to the simulation”. Elon Musk is agreeable to the risks that an AGI or Artificial Super Intelligence can go rogue, kill off humanity, or be hacked, yet as smart as he is, he doesn’t understand that the computing technology the AGI and ASI would have, would not go beyond the level of Atoms to observe more microscopic particles at its plane, hence, any answers to his sought questions to simulation is limited, and the endeavor of an AGI or ASI is putting humankind at risk. There is an alternative way to achieve his answers, that is 100%. safe and does not involve giving the power to a machine or Artificial Intelligence.\n\n26. Defendants have created AI systems that can take in humanities facial, voice and other bio-metric information and decode whether they are resistant to AI, subject to its control, atheist or have a faith. This technology can enable AI, or any entity using AI to track, profile, hunt and kill targets it deems resistant to its control or resistant to AI. This can be done with drones, machines, robotics, or poison delivery systems such as Micro-Botic terrorism.\n\nAll Charges from 1-26 have led to physical genocide in China spearheaded by the Chinese Communist Government, and all charges from 1-16 are in breach and violations of penal codes stated in facts 1, 2 and 3. All Charges have and are leading to Cultural Genocide in America and around the World, endangering all of humanity to enter a stage of cultural and physical genocide with the interconnection of Artificial Intelligence, 5G, Robotics, Machines, Drones, Smart Cities, as it pertain to negligence and misuse by the main platforms and companies of Google, Facebook, Alphabet, DeepMind, Neuralink, John Does, and their leadership. This does not exclude other players such as Amazon and Microsoft from guilt, and the very many Chinese companies who were trained by these Western companies.\n\nTo Learn more about the Dangers from China and Big Tech AI, Read “ARTIFICIAL INTELLIGENCE Dangers to Humanity“", "opengraph": {}, "tags": ["WIRELKESS DANGERS", "#JOEIMBRIANO", "celltowerdangers.com", "TED KENNEDY", "WE DARE TO PUSH THE ENVELOPE.\"> <meta name=\"keywords\" content=\"5gdangers.com", "<meta name=\"description\" content=\"Joe Imbriano Site administrator B.S. Chemistry- University of California Irvine", "microwavedangers.com\"> <meta name=\"robots\" content=\"index", "vaxdangers.com", "follow\">", "JOHHNIE COCHRAN", "JOHN MCCAIN", "WIFIDANGERS.COM", "CELL PHONE DANGERS", "wireless radiation at troy high school", "B.S. Biological Science- University of California Irvine EVERYTHING YOU HAVE BEEN TOLD IS A LIE AND A FRAUD. JOE IMBRIANO IS THE FULLERTON INFORMER AND BECAUSE YOU HAVE THE RIGHT TO KNOW"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "392", "embed_code": "<iframe loading=\"lazy\" title=\"Support A.I. Lawsuit Against BigTech to Secure our Future from Misuse of Artificial Intelligence\" src=\"https://www.youtube.com/embed/gWdDAvJRoDE?feature=oembed\" width=\"100%\" height=\"392\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/gWdDAvJRoDE?feature=oembed"}], "links": ["https://theaiorganization.com/wp-content/uploads/2019/12/20191219_132936-e1576791082670.jpg", "https://www.westlaw.com/Link/Document/FullText?findType=L&pubNum=1000546&cite=15USCAS41&originatingDoc=I03f4d7afeee311e28578f7ccc38dcbee&refType=LQ&originationContext=document&vr=3.0&rs=cblt1.0&transitionType=PLDocumentLink&billingHash=7C6FD5F346CEA438015B0ECC4FDCCF06EE959E24BCB7B77EBACBF0B375E94F8A&contextData=(sc.Search)", "https://www.westlaw.com/Link/Document/FullText?findType=L&pubNum=1000546&cite=15USCAS58&originatingDoc=I03f4d7afeee311e28578f7ccc38dcbee&refType=LQ&originationContext=document&vr=3.0&rs=cblt1.0&transitionType=PLDocumentLink&billingHash=317537C632B1BC4D2C57C106A9370F6FE0A253E39846C3108AB362A008CE9E38&contextData=(sc.Search)", "https://www.law.cornell.edu/topn/arms_control_and_disarmament_act", "https://www.law.cornell.edu/uscode/text/22/2551", "https://www.law.cornell.edu/topn/foreign_assistance_act_of_1961", "https://www.law.cornell.edu/uscode/text/22/2151", "https://www.amazon.com/ARTIFICIAL-INTELLIGENCE-Dangers-Humanity-Cybernetics-ebook/dp/B07ZDK442Q/ref=sr_1_1?keywords=artificial+intelligence+dangers+to+humanity&qid=1577032824&sr=8-1", "https://www.amazon.com/ARTIFICIAL-INTELLIGENCE-Dangers-Humanity-Cybernetics-ebook/dp/B07ZDK442Q/ref=sr_1_1?keywords=artificial+intelligence+dangers+to+humanity&qid=1577032824&sr=8-1"], "authors": [], "publish_date": null}