{"result_id": "294014", "URL": "https://thefullertoninformer.com/troy-oracle-ignores-truth-pushes-radical-vaccine-agenda/", "timestamp": "2023-04-25 17:21:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/troy-oracle-ignores-truth-pushes-radical-vaccine-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "Troy Oracle ignores truth, pushes radical vaccine agenda: ignores parents’ bonafide concerns «", "cleaned_text": "Check out this dangerous one sided BS from these fools over at Fullerton’s Troy High School newspaper called “The Oracle”\n\nNow look now at what MS. PRISCILLA CHENEY HAS RECEIVED AND REFUSES TO PRINT.\n\nVaccine Senate Bill SB277 is currently moving through the California State Senate, effectively eliminating personal belief exemption (PBE).\n\nAs with many issues, unless we delve deeply we do not have a full understanding of both sides of the argument. With the CA bill to eliminate PBE, a nerve has been struck with those that have either done research that examined the other side of vaccine safety or had personal experience in which their child was vaccine injured or died. On a personal level, I am the parent of three who, up until five years ago, vaccinated my children. It wasn’t until I stumbled across information, not in mainstream media and not conveyed by my children’s pediatrician, that I began to look at aspects of vaccines that led me to change my mind about them. It wasn’t until SB277 and the prospect that PBE would be taken away, vaccinations forced that a considerable amount of information emerged that cannot be ignored.\n\nA lot is at stake, here. As reported by the U.S. Health and Human Services Agency, over $2.9 B has been awarded in vaccine injury court for vaccine injuries and deaths. Therefore, it only follows that this law, if enacted, will necessitate that the parent risk injury or death to their child in order to attend school. U.S. Supreme Court Justices have stated that vaccines are “unavoidably unsafe.” This is the reality and for this reason, alone, the parent must retain the right to vaccinate, or not. Aside from this, there are undeniable facts that call into question all aspects of vaccine safety. Indeed, one might wonder whether vaccines should be halted, altogether, until proven safe. In the interest of understanding and adequately presenting both sides of this argument, I would like to pass on to the journalists and op ed authors at Troy Oracle aspects/information/source documents that might not have been considered in the debate. Please consider the following:\n\nHistory of vaccines, particularly historical trend rate of measles infection relative to date of vaccine introduction\n\nRisk of injury or death from vaccines\n\nVaccine policies in other countries; India’s lawsuit against Bill and Melinda Gates Foundation for vaccine injuries, sterilization of Kenyan girls via vaccine\n\nVaccine court: damages paid by taxpayer, not by vaccine maker; vaccine makers immune from liability; how many go to court; how many are unreported\n\nCharges of corruption in US CDC science/studies, whistleblower cases\n\nNew vaccines in the pipeline (nearly 300 in 2012)\n\nAs with any new and contrary information, an open mind is required. I am certain the integrity of the Oracle journalists will make certain that, even though current beliefs may be challenged, a new understanding of vaccines will emerge and reporting integrity will prevail. Given all of this, I hope you will support the necessity of “inform consent.”\n\nThank you for your consideration of the material and attachments listed below. These are a very few, of course.\n\nThe International Medical Council on Vaccination is an association of medical doctors, registered nurses and other qualified medical professionals whose purpose is to counter the messages asserted by pharmaceutical companies, the government and medical agencies that vaccines are safe, effective and harmless. Our conclusions have been reached individually by each member of the Council, after thousands of hours of personal research, study and observation.\n\nNational Vaccine Information Center Your Health. Your Family. Your Choice.\n\nThe National Vaccine Information Center (NVIC) is dedicated to the prevention of vaccine injuries and deaths through public education and to defending the informed consent ethic in medicine.\n\nVaccine Papers — An Objective Look at Vaccine Dangers\n\nVaccinepapers.org provides detailed, science-based and objective information about the dangers of vaccines. We are most concerned about aluminum adjuvant toxicity and immune activation-mediated brain damage. Vaccinepapers.org is the first to make this hugely important scientific research accessible to the public. Link is here: http://vaccinepapers.org\n\nNational Vaccine Injury Compensation Program, U.S. Department of Health and Human Services\n\nThe Vaccine Injury Compensation Trust Fund provides funding for the National Vaccine Injury Compensation Program to compensate vaccine-related injury or death claims for covered vaccines administered on or after October 1, 1988.\n\nLink to list of court awarded compensation for vaccine injury or death claims: http://www.hrsa.gov/vaccinecompensation/statisticsreport.pdf\n\nRobert F Kennedy Jr in Vermont: “Big Pharma’s game plan is to remove parental informed consent”\n\nCurrently, in the state of Pennsylvania, case #2:10-cv-04374-cdjUNITED STATES VS MERCK is pending. The Department of Justice is involved. Former virologists now whistleblowers allege that Merck falsified data with the MMR II vaccine in order to meet the 95% efficacy rate which is the benchmark required by the FDA to maintain its monolopy on the mumps vaccine which extends to the MMR II. This suggests vaccine failure and fraud, not unvaccinated kids, as the reason for the outbreaks.\n\nIndia’s lawsuit against Bill and Melinda Gates Foundation for vaccine injuries\n\nAccusations of sterilization of Kenyan girls via Tetanus vaccine\n\nPlease listen to the hours of testimony for each of the SB277 CA senate hearings (online), which have passed through the following committees: Health, Education, and Judiciary. Also, listen to the hundreds (500+) that have showed up for each hearing to publicly oppose the bill.\n\nIs Senator Pan’s testimony before Health Committee truthful? (transcription of testimony inserted in email)\n\nRepeal Immunity for Drug Companies Against Vaccine Injuries Petition by mur\n\nTo be delivered to The United States House of Representatives, The United States Senate, and President Barack Obama\n\nWhy should the drug companies be above the law? If vaccines are safe, there would be no need to grant the drug companies immunity. In 1986 Congress gave the drug companies immunity against all lawsuits from vaccine related injuries. The Federal Government is now paying out billions in damages to parents whose children have been hurt by vaccines. So the drug companies continue to rack up huge profits while the tax payer continues to pay the damages.\n• In 2011, the U.S. Supreme Court ruled that vaccines are “unavoidably unsafe.” Bruesewitz v. Wyeth LLC, 131 S. Ct. 1068, 179 L.Ed.2d 1 (2011).1\n• There is vast underreporting of vaccine adverse events. FDA: As few as 1% of serious adverse reactions are reported.3 CDC: Only about 10% are reported.4 Congress: Has heard testimony that medical students are told not to report suspected adverse events, 5 despite federal law requiring doctors to report suspected adverse events.6 National Vaccine Information Center (NVIC) survey: 1 out of 40 doctor’s offices (2.5%) in New York report a death or injury following vaccination. 7 Association of American Physicians and Surgeons (AAPS): Only 10% of serious vaccine adverse events are reported.8\n• The Federal Court of Claims lists about 140 attorneys that accept vaccine injury and death cases.9 This number has been steadily increasing in recent years.\n• The National Childhood Vaccine Injury Act of 1986 (NCVIA) shields vaccine manufacturers from liability for the death and disability caused by their vaccines. There is no financial incentive for manufacturers to produce safer vaccines.10\n• 90-95% of 1900’s infectious disease decline preceded the vaccines. Absence of vaccination will not bring back infectious disease rates of pre-vaccine days. Graphs: http://www.theoneclickgroup.co.uk/documents/vaccines/Immunization%20Graphs%20PPT%20-%20RO%202009.pdf, https://childhealthsafety.wordpress.com/graphs/\n• According to the CDC:\n• Vaccines are 85 – 95% effective (5 – 15% of children do not develop immunity from their vaccines), and most outbreaks start in vaccinated children.11\n\n b. The median vaccine exemption rate in the U.S. is 1.8%.12 There are more than 5+ times more non-immune *vaccinated* children than exempt children.\n• Exempt children can get natural immunity, without even developing symptoms.13 You can’t tell a child’s immune status based on their immunization status.\n• The American Medical Association Code of Medical Ethics recommends “medical, religious, or philosophic” exemptions to immunizations for medical doctors.14\n• The pharmaceutical industry is the biggest defrauder of the federal government under the False Claims Act.15 In the last 5 years, $19.2 billion were returned from attempts to defraud federal health programs, more than double that of the previous 5 years (as of February 2014).16\n• In 8 years (2004-2012), there were twenty pharmaceutical company settlements in the $345 million to $3 billion range.17 Criminal fines in the $100’s of millions are common, and have been as high as $1 billion (Pfizer 2009, GlaxoSmithKline 2012). This is routine business practice.\n• Merck, manufacturer of the mumps vaccine, is going to trial in two separate lawsuits for allegedly falsifying the efficacy rate of its mumps vaccine. One suit was filed by former employee-whistleblowers, the other by pharmaceutical competitors.18\n\nConclusions:\n\n 1. There is insufficient data available to determine whether or not vaccines provide a net benefit.\n• There’s no way to determine the risk of vaccine injury or death for any given individual.\n• Individual freedom of choice provides a necessary “check and balance” to the pharmaceutical industry’s overreaching, liability-free, marketing influence over vaccine policy and law.\n• Young adults are not required to risk their lives with mandatory military service, but newborn infants are required to risk their lives with a Hep B vaccine, for a disease they are not at risk of acquiring or spreading unless the mother, who can be tested, is infected. This is not reasonable.\n• Parents for their children, and adults for themselves, should be allowed to make vaccine decisions, in consultation with the healthcare professional of their choice.\n\n3 Less than 1%, according to Barbara Fisher, citing former FDA Commissioner David Kessler, 1993, JAMA, Statement of the National Vaccine Information Center (NVIC), Hearing of the House Subcommittee on Criminal Justice, Drug Policy and Human Resources, “Compensating Vaccine Injuries: Are Reforms Needed?” September 28, 1999.\n\n4 American Association of Physicians and Surgeons, Fact Sheet on Mandatory Vaccines at http://www.aapsonline.org/.\n\n5 Jane Orient, M.D., Director of the American Association of Physicians and Surgeons, “Mandating Vaccines: Government Practicing Medicine Without a License?” 1999.\n\n8 Statement of the AAPS to the Subcommittee on Criminal Justice, Drug Policy and Human Resources of the Committee on Government Reform U.S. House of Representatives, Re: Hepatis B Vaccine, Jane Orient, MD, June 14, 1999,http://www.aapsonline.org/testimony/hepbcom.htm\n\n9 http://www.uscfc.uscourts.gov/sites/default/files/20141208%20Vaccine%20Attorneys.pdf\n\n 10 See the National Childhood Vaccine Injury Act of 1986, 42 U.S.C. § 300aa-1 et seq., and Bruesewitz v. Wyeth,\n\n11 Centers for Disease Control and Prevention, Vaccines and Immunizations, Misconception #2. The majority of people who get disease have been vaccinated. The original link, http://www.cdc.gov/vaccines/vac- gen/6mishome.htm, is now directed to a new CDC page that does not state these facts (but does not state contrary facts). The original CDC page can be viewed here: http://web.archive.org/web/20150120055820/http://www.cdc.gov/vaccines/vac-gen/6mishome.htm\n\n12 Vaccination Coverage Among Children in Kindergarten – United States 2012-2013 School Year, Morbidity and Mortality Weekly Report (MMWR), CDC,http://www.cdc.gov/mmwr/preview/mmwrhtml/mm6230a3.htm?s_cid=mm6230a3_eThe\n\n13 Centers for Disease Control and Prevention, Vaccines and Immunizations, Glossary, “Asymptomatic infection: The presence of an infection without symptoms. Also known as inapparent or subclinical infection.” http://www.cdc.gov/vaccines/about/terms/glossary.htm\n\n15 “Public Citizen Study: Pharmaceutical Industry Is Biggest Defrauder of the Federal Government Under the False Claims Act,” Dec. 20, 2010,http://www.pharmpro.com/news/2010/12/public-citizen-study-pharmaceutical-industry-biggest-defrauder-federal-government-under-false-claims-act\n\nNO ON SB277 RALLY at the Capitol in Sacramento on April 8, 2015\n\nPreview YouTube video Robert F Kennedy Jr in Vermont: “Big Pharma’s game plan is to remove parental informed consent”\n\nRobert F Kennedy Jr in Vermont: “Big Pharma’s game plan is to remove parental informed consent”\n\nPreview YouTube video NO ON SB277 RALLY at the Capitol in Sacramento on April 8, 2015\n\nNO ON SB277 RALLY at the Capitol in Sacramento on April 8, 2015\n\nLook The Oracle at Troy pushes on these impressionable young minds who are neither mature enough to make these health decisions or able to fully grasp what is involved-", "opengraph": {}, "tags": ["corona virus", "air combat usa", "#JOEIMBRIANO", "Doug Chaffee", "Las Vegas Shooting", "The DCCSP", "joe imbriano for city council", "illegal immigration", "Jesus Silva", "greg seabourn", "Fullerton city council", "Greg Sebourn", "Troy High School", "Bruce Whitaker Fullerton", "wifi dangers", "5G", "BRUCE WHITAKER", "JOE IMBRIANO", "Tony Bushala", "Hunt Library", "tony bushala fullerton", "Bruce Whitaker for senate", "barry levinson", "Friends for Fullertons Future", "Travis kiger", "doug chafee", "greg seaborn", "Larry Bennett", "Jim Touchstone", "fullertons sex offender ordinace repeal", "Joe Felz", "Joe Felz Dan Hughes bruce whitaker jennifer fitzgerald", "ladera vista junior high", "kelly thomas", "shawn nelson", "5G DANGERS", "corruption in the fullerton police department", "dan hughes", "Gretchen Cox", "Josh Newman", "ED ROYCE", "obstruction of justice", "jennifer fitzgerald", "Sean Paden", "jennifer Fitzgherald"], "tweets": [], "movies": [], "links": ["https://thefullertoninformer.com/wp-content/uploads/2015/05/cheny.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/05/download.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/05/vaccine.jpg", "mailto:oracle.troy@gmail.com", "http://www.vaccinationcouncil.org/", "http://www.nvic.org/", "http://vaccinepapers.org/", "http://vaccinepapers.org/", "http://vaccinepapers.org/", "http://www.hrsa.gov/vaccinecompensation/statisticsreport.pdf", "http://www.vaccinerights.com/", "https://www.youtube.com/watch?v=j2UJ2oBeya0", "http://www.globalresearch.ca/u-s-media-blackout-italian-courts-rule-vaccines-cause-autism/5430940", "http://www.globalresearch.ca/bill-gates-faces-trial-in-india-for-illegally-testing-tribal-children-with-vaccines/5407864", "http://healthimpactnews.com/2014/bill-melinda-gates-foundation-vaccine-empire-on-trial-in-india/", "http://nsnbc.me/2013/05/08/bill-gates-polio-vaccine-program-caused-47500-cases-of-paralysis-death/", "http://healthimpactnews.com/2014/mass-sterilization-kenyan-doctors-find-anti-fertility-agent-in-un-tetanus-vaccine/", "http://www.onenewsnow.com/culture/2014/11/16/kenyan-doctors-un-sterilized-1m-females-via-tetanus-vaccine-13m-to-go#.VU5SJ1y1iE4", "https://medium.com/@sb442no/the-truth-about-california-s-vaccination-rates-3ce3872874f1", "http://petitions.moveon.org/sign/repeal-immunity-for-drug?mailing_id=29087&source=s.icn.em.cr&r_by=12998034", "http://petitions.moveon.org/contact_creator.html?petition_id=89477", "http://www.theoneclickgroup.co.uk/documents/vaccines/Immunization%20Graphs%20PPT%20-", "https://childhealthsafety.wordpress.com/graphs/", "http://www.vaccinerights.com/", "http://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "http://www.hrsa.gov/vaccinecompensation/statisticsreport.pdf", "http://www.aapsonline.org/", "tel:703-938-0342", "http://www.aapsonline.org/testimony/hepbcom.htm", "http://www.uscfc.uscourts.gov/sites/default/files/20141208%20Vaccine%20Attorneys.pdf", "http://www.cdc.gov/vaccines/vac-", "http://web.archive.org/web/20150120055820/http://www.cdc.gov/vaccines/vac-gen/6mishome.htm", "http://www.cdc.gov/mmwr/preview/mmwrhtml/mm6230a3.htm?s_cid=mm6230a3_eThe", "http://www.cdc.gov/vaccines/about/terms/glossary.htm", "http://www.ama-/", "http://assn.org/ama/pub/physician-resources/medical-ethics/code-medical-ethics/opinion9133.page", "http://www.pharmpro.com/news/2010/12/public-citizen-study-pharmaceutical-industry-", "http://www.fraudwhistleblowersblog.com/2014/02/", "http://en.wikipedia.org/wiki/List_of_largest_pharmaceutical_settlements", "http://www.fiercevaccines.com/story/lawsuits-claiming-merck-lied-about-mumps-vaccine-efficacy-headed-trial/2014-", "http://www.vaccinerights.com/", "https://www.youtube.com/watch?v=91k1A5huwBg", "https://www.youtube.com/watch?v=23hLOHQ7r4o", "http://mexiconewsdaily.com/news/two-infants-dead-after-receiving-vaccinations/", "https://www.youtube.com/watch?v=j2UJ2oBeya0&authuser=0", "https://www.youtube.com/watch?v=91k1A5huwBg&authuser=0", "https://www.youtube.com/watch?v=23hLOHQ7r4o&authuser=0"], "authors": [], "publish_date": null}