{"result_id": "294032", "URL": "https://thefullertoninformer.com/death-by-vaccine-the-harrowing-story-of-the-death-of-michael-anthony-granata/comment-page-3/", "timestamp": "2023-04-25 17:22:18 CEST+0200", "meta": {"description": "EVERYTHING YOU HAVE BEEN TOLD IS A LIE AND A FRAUD. JOE IMBRIANO IS THE FULLERTON INFORMER AND BECAUSE YOU HAVE THE RIGHT TO KNOW, WE DARE TO PUSH THE ENVELOPE.", "lang": "en", "keywords": "CV VAX, CV19 VAX DEATH, MIKE ANTHONY GRANATA,", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/death-by-vaccine-the-harrowing-story-of-the-death-of-michael-anthony-granata/comment-page-3/#comments", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "DEATH BY VACCINE-The harrowing story of the death of Michael Anthony Granata «", "cleaned_text": "Michael, a longtime resident of Gilroy, passed away on November 1, 2021. Never a kinder more gentle man did I know than my husband, Michael.\n\nFor those who knew Mike, you know that he was a good and honest man. He was kind, considerate, and always polite.\n\nMike was adamant that people know what happened to him that caused his early and unexpected death. Message from Mike: “Many nurses and non-nursing staff begged me and my wife to get the truth out to the public about the Covid-19 vaccines because the truth of deaths from the vaccine was being hidden within the medical profession. I promised I would get the message out. So, here is my message:\n\nI was afraid of getting the vaccine for fear that I might die. At the insistence of my doctor, I gave in to pressure to get vaccinated. On August 17th I received the Moderna vaccine and starting feeling ill three days later. I never recovered but continued to get worse. I developed multisystem inflammation and multisystem failure that medical professionals could not stop. My muscles disappeared as if to disintegrate. I was in ICU for several weeks and stabbed with needles up to 24 times a day for those several weeks, while also receiving 6 or 7 IVs at the same time (continuously). It was constant torture that I cannot describe. I was no longer treated as a human with feelings and a life. I was nothing more than a covid vaccine human guinea pig and the doctors excited to participate in my fascinating progression unto death. If you want to know more, please ask my wife. I wished I would have never gotten vaccinated. If you are not vaccinated, don’t do it unless you are ready to suffer and die.”\n\nMike did not deserve the pain and suffering he endured. He was a good man and deserved better.\n\nMike was born in San Jose, California and moved to Gilroy at age one, where he resided for the last 55 years.\n\nMike attended Las Animas Elementary and Gilroy High schools. He graduated from both San Jose State University and Santa Clara University earning several scholastic degrees.\n\nMike was an intelligent man but never flaunted it. Mike chose to clothe himself in humility, kindness and gentleness every day, and preferred to work quietly behind the scenes doing good deeds and expecting nothing in return.\n\nMichael was a licensed professional engineer and the owner of Engineering By Design, Design Engineering and Professional Engineering and Design. For the last 10+ years Michael worked in the Marine industry utilizing his IP for design and engineering that is known and used worldwide.\n\nMichael could be seen twice daily walking his Golden Retriever around the neighborhood or up at Gavilan College for the last 20+ years in his jeans, t-shirt and hat.\n\nMichael was proud to be a gear-head, a true car restoration enthusiast and tinkerer.\n\nMike loved spending time with his wife, his dog, his cars and playing the drums as he was quite a gifted musician.\n\nMichael was preceded in death by his brothers Anthony Edward Granata and Salvatore Anthony Granata.\n\nMichael is survived by his wife, Susie Granata of Gilroy, his parents Anthony and Elizabeth Granata of Morgan Hill; his sister Catherine Flowers (John) of Brentwood, CA; Nieces: Heather Trumbull (Christopher), Mindy Peterson (Ryan), Jeannene Brady, and Alyssa Granata, and great nephews and niece: Anthony and Trevor Peterson, and Karlie and Colin Trumbull.\n\nTo plant Memorial Trees in memory of Michael “Mike” Anthony Granata, please click here to visit our Sympathy Store.", "opengraph": {}, "tags": ["CV19 VAX DEATH", "CV VAX", "MIKE ANTHONY GRANATA"], "tweets": [], "movies": [], "links": ["mailto:?subject=Obituary%20for%20Michael%20%22Mike%22%20Anthony%20Granata&body=Obituary%20for%20Michael%20%22Mike%22%20Anthony%20Granata%0A%0AView%20details%20at%20https%3A%2F%2Fwww.habingfamilyfuneralhome.com%2Fobituary%2Fmichael-mike-granata%0A%0ABrought%20to%20you%20by%20Habing%20Family%20Funeral%20Home%0Ahttps%3A%2F%2Fwww.habingfamilyfuneralhome.com%0A", "http://www.legacy.com/link.asp?i=gb000200579350", "https://www.habingfamilyfuneralhome.com/obituary/michael-mike-granata/cards?campaign=obituaryInline-cards-textLink-header", "https://donate.mytributegift.org/Default.aspx?fh=10480&fp=78575D7A-B8ED-4028-9A22-150E9B3A8AE9&cid=b9aa6c345cb58a6e91bf484e3fefa45b3747865fb24675228f84e297f5d8347d", "https://www.habingfamilyfuneralhome.com/obituary/michael-mike-granata/gifts?campaign=obituaryInline-gifts-textLink-obitText"], "authors": [], "publish_date": null}