{"result_id": "294020", "URL": "https://thefullertoninformer.com/ab-1993-california-proposes-unconstitutional-illegal-forced-vaccination-law-for-all-workers/", "timestamp": "2023-04-25 17:21:58 CEST+0200", "meta": {"description": "EVERYTHING YOU HAVE BEEN TOLD IS A LIE AND A FRAUD. JOE IMBRIANO IS THE FULLERTON INFORMER AND BECAUSE YOU HAVE THE RIGHT TO KNOW, WE DARE TO PUSH THE ENVELOPE.", "lang": "en", "keywords": "AB1993, BUFFY WICKS, CALIFORNIA VACCINE LAWS, forced vaccination, JOE IMBRIANO,", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/ab-1993-california-proposes-unconstitutional-illegal-forced-vaccination-law-for-all-workers/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "AB 1993-CALIFORNIA PROPOSES UNCONSTITUTIONAL, ILLEGAL FORCED VACCINATION LAW FOR ALL WORKERS «", "cleaned_text": "This is the first bill of its kind ever introduced in United States History.\n\nBUFFY WICKS has proposed AB 1993. This bill, if it becomes law, would make vaccination a requirement in order to work in California.\n\nCALL OR WRITE YOUR LEGISLATORS TO OPPOSE THIS.\n\nGET YOUR RELIGIOUS EXEMPTIONS IN ORDER, WRITTEN AND READY TO ROLL LADIES AND GENTLEMEN.\n\nThe California Constitution SEC. 4 reads as follows.\n\nFree exercise and enjoyment of religion without discrimination or preference are guaranteed. This liberty of conscience does not excuse acts that are licentious or inconsistent with the peace or safety of the State. The Legislature shall make no law respecting an establishment of religion.\n\nScience is a religion in diametric opposition to God. Medical doctors are idolaters according to their oath. Allopathic Medicine is sorcery. Vaccination is an occult practice involving necromancy. The un-Biblical mystery religion of idolatry, sorcery, necromancy and murder that is being forced on us by the continued attempts at legislative enactment such as this bill and others clearly violate both the State and Federal Constitutions. If these bills become law, it would amount to the illegal public funding of a state sanctioned, state mandated, state sponsored and state established religion. The way out is mereley a simple exemption premised on our First Ammendment rights.\n\nThe deniers of and enemies of Jesus Christ who are behind these vaccine mandates are illegally usurping their authority by conspiring to institute policies that will coerce people into abandoning the Divine protections that God has afforded in their bodies and exchange it for a damnable petrochemical poisoning regiment designed to ultimately weaken or kill innocent and unsuspecting people. This is becoming more and more obvious with each incremental step they take.\n\nVaccine mandates are an affront to God and an assault with a deadly weapon. The deception involved with this entire Covid -19 fraud is so obvious to anyone who is semi-consicious. Section 13 of all the vaccine inserts clearly prove these vaccines are not safe.\n\nThe hospitals have murdered far too many with their Covid protocols and toxic treatments. So now they think the vaccines are for the rest of us that they didn’t get hooked up to the propofol drip and the ventilators. They have another thing coming.\n\nI, Joe Imbriano, coming to you in The Name of Jesus Christ, submit to all of you that maintaining a healthy body and a clean bloodstream are some of the core tenets of sincerely held Christian religious personal beliefs and Biblical principles. The body is a Temple of The Holy Spirit and is sacred. We have a fundamental right given by God to protect and a divinely ordained duty to defend our bodies. The government has no right to establish, promote or fund this religion of sorcercy, idolatry, necromancy and murder as the self proclaimed high priests of this diabolical medical cult assault anyone with these religious intruments of mass destruction called vaccines. You simply excercise your religious exemption that your are entitled to excercise period.\n\nThe United States Constitution provides remedies in more places than one, specifically the First and Second ammendments.\n\nWith respect to the First Ammendment, the Bible is the supreme document in this particular instance.\n\nThe Bible teaches that when man’s law contradicts God’s law, His people must obey God over man. (Acts 5:29) Therefore, be it known, should any policy, edict or legislation of man decree our children must be vaccinated, we must obey God rather than man just as Moses’ parents of old, we will do so without fear (Exodus 2).\n\nGenesis 1:27, wherein “God created man in his own image. Genesis 9:5-6: “For your lifeblood I will surely require a reckoning; of every beast I will require it and of man; of every man’s brother I will require the life of man. Whoever sheds the blood of man, by man shall his blood be shed; for God made man in his own image.” John 10:10: “I have come that they may have life, and have it to the full.”\n\nScientism is a false religion. Government schools are seminaries of this false religion. It is the religion of the licentious. It is the embodiment of the very dark, wicked, and evil nature of the enemies of Jesus Christ who are behind these vaccine mandates in their attempts to murder the human cattle. The wisdom of The Holy Spirit exposes and illuminates their thinly veiled attempts to poison and kill innocent and unsuspecting people with these injections and injunctions. This is why their evil deeds are coming more and more into view with each incremental step they take. Vaccine mandates are an affront to God and an assault on our existence. The deception involved with this entire Covid -19 fraud is of the devil. The enemies of Jesus Christ are of their father the devil who was a murderer and a liar from the beginning.\n\nThe hospitals have shed far too much innocent blood and they have murdered far too many with their Covid protocols and toxic treatments. Every last one of you know someone who was murdered by these people because they fell for the lies. So now they think the vaccines are for the rest of us that they didn’t get hooked up to the propofol drip and the ventilatiors? In Jesus name, they have another thing coming.\n\nIf all else fails, then you must stand your ground.\n\nWith respect to The Second Ammendment, the Bible is the supreme document in this particular instance once again.\n\nThen said he unto them, But now, he that hath a purse, let him take it, and likewise his scrip: and he that hath no sword, let him sell his garment, and buy one.\n\nBoth Jesus and The Founding fathers meant exactly what they said. Do not be deceieved by the deniers of Jesus Christ, their filthy churches, their filthy schools, and their filthy media that are all pushing their filthy religion on us to provide an “offering” to their filthy loser god the devil. The churches are all controlled. Jesus is not found in the churches, only hirelings that deceive and work for the deceivers are what are in the pulpits with a literal handful of exceptions.\n\nYour body has 75,000 miles of circulatory system in it. You are fearfully and wonderfully made by God. Jesus put an end to the sacrifice system 2000 years ago. No need to step up and lay your body down on their filthy allopathic petrochemical pill and vaccine pushing medical pimp’s altar 2000 years later. To do so is blasphemy of the Holy Spirit.\n\nDo not practice their religion of satanic scientism. Do not participate in their satanic rituals like being masked. probed or injected. Do not be fearful of their lies. Do not recite their creeds that have been written for their worship service to satan by repeating the fraudulent fake virus narrative and its unholy words which are the lies from the pit of hell. Viruses are a fraud period. The Germ theory is a fraud period.\n\nThe government is in violation of our foundational and fundamental rights to freely excercise our religion by establishing the covidian and scientism cults as sects of the official state sanctioned religion through bills such as these and emergency declarations. Participation will always be voluntary as long as you understand that it is.", "opengraph": {}, "tags": ["CALIFORNIA VACCINE LAWS", "forced vaccination", "BUFFY WICKS", "AB1993", "JOE IMBRIANO"], "tweets": [], "movies": [], "links": ["https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB1993", "https://thefullertoninformer.com/wp-content/uploads/2022/02/Buffy_Wicks.jpg", "http://www.legislature.ca.gov/your_legislator.html", "https://thefullertoninformer.com/wp-content/uploads/2022/02/oath.png", "https://www.cnbc.com/2018/02/22/medical-errors-third-leading-cause-of-death-in-america.html", "https://thefullertoninformer.com/wp-content/uploads/2022/01/joe-03042020.jpg", "https://thefullertoninformer.com/section-13-of-the-vaccine-inserts/", "https://thefullertoninformer.com/wp-content/uploads/2022/02/JOE12.png", "https://thefullertoninformer.com/wp-content/uploads/2022/02/joe-photo-upside-down-flag.jpg", "https://biblia.com/bible/esv/galatians/5/19-21", "https://thefullertoninformer.com/wp-content/uploads/2022/02/injection-g4539d0492-1280-960.jpg"], "authors": [], "publish_date": null}