{"result_id": "294012", "URL": "http://thefullertoninformer.com/wp-content/uploads/2019/03/ShowLabeling.html", "timestamp": "2023-04-25 17:21:33 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "http://thefullertoninformer.com/wp-content/uploads/2019/03/ShowLabeling.html", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "", "cleaned_text": "To report SUSPECTED ADVERSE REACTIONS, contact Pfizer, Inc. at 1-800-438-1985 or VAERS at 1-800-822-7967 or http://vaers.hhs.gov.\n\nThe most common solicited adverse reactions in adolescents and young adults were pain at the injection site (≥85%), fatigue (≥60%), headache (≥55%), and muscle pain (≥35%). ( 6 )\n\nSyncope (fainting) can occur in association with administration of injectable vaccines, including Trumenba. Procedures should be in place to avoid injury from fainting. ( 5.4 )\n\nTrumenba is indicated for active immunization to prevent invasive disease caused by Neisseria meningitidis serogroup B. Trumenba is approved for use in individuals 10 through 25 years of age. The effectiveness of the two-dose schedule of Trumenba against diverse N. meningitidis serogroup B strains has not been confirmed.\n\nFor intramuscular use only. Two-dose schedule: Administer a dose (0.5 mL) at 0 and 6 months. If the second dose is administered earlier than 6 months after the first dose, a third dose should be administered at least 4 months after the second dose. The choice of dosing schedule may depend on the risk of exposure and the patient's susceptibility to meningococcal serogroup B disease. Shake syringe vigorously to ensure that a homogenous white suspension of Trumenba is obtained. Do not use the vaccine if it cannot be re-suspended. Parenteral drug products should be inspected visually for particulate matter and discoloration prior to administration, whenever solution and container permit. Do not use if particulate matter or discoloration is found. Inject each 0.5 mL dose intramuscularly, using a sterile needle attached to the supplied prefilled syringe. The preferred site for injection is the deltoid muscle of the upper arm. Do not mix Trumenba with any other vaccine in the same syringe. 2.3 Use of Trumenba with other Meningococcal Group B Vaccines Sufficient data are not available on the safety and effectiveness of using Trumenba and other meningococcal group B vaccines interchangeably to complete the vaccination series.\n\nIn clinical studies, the most common solicited adverse reactions in adolescents and young adults were pain at the injection site (≥85%), fatigue (≥60%), headache (≥55%), and muscle pain (≥35%). Nausea was reported in up to 24% of adolescents in early phase studies. Because clinical trials are conducted under widely varying conditions, adverse reaction rates observed in the clinical trials of a vaccine cannot be directly compared to rates in the clinical trials of another vaccine and may not reflect the rates observed in clinical practice. The safety of Trumenba was evaluated in 15,227 subjects 10 through 25 years of age in 11 clinical studies (8 randomized controlled and 3 supportive non-controlled studies) conducted in the U.S., Europe, Canada, Chile, and Australia. A total of 11,333 adolescents (10 through 18 years of age) and 3,894 adults (19 through 25 years of age) received at least one dose of Trumenba. A total of 5,501 subjects 10 through 25 years of age in the control groups received saline placebo and/or one of the following vaccine(s): Human Papillomavirus Quadrivalent (Types 6, 11, 16, and 18) Vaccine, Recombinant (HPV4) (Merck & Co., Inc.); Tetanus Toxoid, Reduced Diphtheria Toxoid and Acellular Pertussis Vaccine Adsorbed (Tdap) (Sanofi Pasteur Ltd.); Meningococcal Polysaccharide (Serogroups A, C, Y and W-135) Diphtheria Toxoid Conjugate Vaccine (MCV4) (Sanofi Pasteur Inc.); a non-U.S. licensed reduced diphtheria toxoid, tetanus toxoid, acellular pertussis and inactivated polio virus vaccine (dTaP-IPV) (Sanofi Pasteur, Inc.); Hepatitis A Vaccine, Inactivated (HAV) (GlaxoSmithKline Biologicals). The safety evaluation in the clinical studies included an assessment of: (1) solicited local and systemic reactions, and use of antipyretic medication after each vaccination in an electronic diary maintained by the subject or the subject's parent/legal guardian and (2) spontaneous reports of adverse events (AEs), including serious adverse events (SAEs), throughout the study (day of vaccination through one month or 6 months after the last vaccination, depending on the study and safety parameter). In controlled studies, demographic characteristics were generally similar with regard to gender, race, and ethnicity among subjects who received Trumenba and those who received control. Overall, across the 11 studies, among the subjects who received Trumenba, 50.5% were male and 49.5% were female, and the majority were White (86.3%) and non-Hispanic/non-Latino (87.3%). Study 1 was a Phase 3, randomized, active-controlled, observer-blinded, multicenter trial in the U.S., Canada, and Europe in which 2,693 subjects 10 to 18 years of age received at least 1 dose of Trumenba on a 0-, 2-, and 6- month schedule. A control group (n=897) received HAV at 0 and 6 months and saline at 2 months. 87.3% of subjects were White, 8.1% were Black or African-American, 0.4% were Asian, and 5.8% were Hispanic or Latino. Overall, 51.5% of subjects were male, 55.6% of participants were 10 to 14 years age, and 44.4% were 15 to 18 years of age. Study 2 was a Phase 3, randomized, placebo-controlled, observer-blinded, multicenter trial in the U.S., Canada, and Europe in which 2,471 subjects 18 to 25 years of age received at least 1 dose of Trumenba and 822 subjects received saline on a 0-, 2,- and 6- month schedule. 76.1% of subjects were White, 20.8% were Black or African-American, 1.6% were Asian, and 17.1% were Hispanic or Latino. Overall, 41.3% of subjects were male. Local adverse reactions at the Trumenba injection site and control (HAV/saline or saline) injection site were assessed in both studies. Tables 1 and 2 present the percentage and severity of reported local adverse reactions within 7 days following each dose of Trumenba or control (HAV/saline or saline) for Study 1 and Study 2, respectively. Local adverse reactions were reported more frequently following Trumenba compared to control (see Tables 1 and 2). Table 1: Percentages of Subjects 10 to 18 Years of Age (Study 1 ) Reporting Local Adverse Reactions Within 7 Days After Each Vaccination Table 2: Percentages of Subjects 18 to 25 Years of Age (Study 2 ) Reporting Local Adverse Reactions Within 7 Days After Each Vaccination In Study 1, mean duration of pain was 2.4 to 2.6 days (range 1–17 days), for redness 2.0 to 2.2 days (range 1–12 days) and for swelling 2.0 to 2.1 days (range 1–21 days) in the combined Trumenba group. In Study 2, mean duration of pain was 2.6 to 2.8 days (range 1–67 days), for redness 2.2 to 2.5 days (range 1–13 days) and for swelling 2.1 to 2.6 days (range 1–70 days) in the Trumenba group. Tables 3 and 4 present the percentage and severity of reported solicited systemic adverse reactions within 7 days of each dose of Trumenba or control (HAV/saline or saline) for Study 1 and Study 2, respectively. Table 3: Percentages of Subjects 10 to 18 Years of Age (Study 1 ) Reporting Systemic Adverse Reactions and Use of Antipyretic Medications Within 7 Days After Each Vaccination Muscle pain (other than muscle pain at the injection site)Þ Table 4: Percentages of Subjects 18 to 25 Years of Age (Study 2 ) Reporting Systemic Adverse Reactions and Use of Antipyretic Medications Within 7 Days After Each Vaccination Muscle pain (other than muscle pain at the injection site)Þ The frequencies of adverse reactions were highest after the first dose regardless of the schedule. After subsequent doses, the frequencies of adverse reactions were similar regardless of dose number and schedule. Overall in clinical studies in which 15,227 subjects 10 through 25 years of age received at least one dose of Trumenba, serious adverse events (SAEs) were reported by 269 (1.8%) subjects. Among the 8 controlled studies (Trumenba N=13,275, control N=5,501), SAEs were reported by 213 (1.6%) subjects and by 106 (1.9%) subjects who received at least one dose of Trumenba or control, respectively. Overall in clinical studies in which 15,227 subjects 10 through 25 years of age received Trumenba, non-serious AEs within 30 days after any dose were reported in 4,463 (29.3%) subjects. Among the 8 controlled studies (Trumenba N=13,275, control N=5,501), AEs that occurred within 30 days of vaccination were reported in 4,056 (30.6%) subjects who received Trumenba and 1,539 (28.0%) subjects in the control group, for individuals who received at least one dose. AEs that occurred at a frequency of at least 2% and were more frequently observed in subjects who received Trumenba than subjects in the control group were injection site pain, fever, and headache. The following adverse reactions have been identified during post-approval use of Trumenba. Because these reactions are reported voluntarily froma population of uncertain size, it is not always possible to reliably estimate their frequency or establish a causal relationship to product exposure.\n\nAll pregnancies have a risk of birth defect, loss, or other adverse outcomes. In the U.S. general population, the estimated background risk of major birth defects and miscarriage in clinically recognized pregnancies is 2% to 4% and 15% to 20%, respectively. There are no adequate and well-controlled studies of Trumenba in pregnant women. Available human data on Trumenba administered to pregnant women are insufficient to inform vaccine-associated risks in pregnancy. Two developmental toxicity studies were performed in female rabbits administered Trumenba prior to mating and during gestation. The dose was 0.5 mL at each occasion (a single human dose is 0.5 mL). These studies revealed no evidence of harm to the fetus or offspring (until weaning) due to Trumenba [see Animal Data]. Two developmental toxicity studies were performed in female rabbits. Animals were administered Trumenba by intramuscular injection 17 days and 4 days prior to mating and on gestation Days 10 and 24. The dose was 0.5 mL at each occasion (a single human dose is 0.5 mL). No adverse effects on pre-weaning development up to post-natal day 21 were observed. There were no fetal malformations or variations observed due to the vaccine. Available data are not sufficient to assess the effects of Trumenba on the breastfed infant or on milk production/excretion. The developmental and health benefits of breastfeeding should be considered along with the mother's clinical need for Trumenba and any potential adverse effects on the breastfed child from Trumenba or from the underlying maternal condition. For preventive vaccines, the underlying maternal condition is susceptibility to disease prevented by the vaccine. Safety and effectiveness have not been established in children <10 years of age. In a clinical study, 90% of infants <12 months of age who were vaccinated with a reduced dosage formulation had fever. Safety and effectiveness of Trumenba in adults older than 65 years of age have not been established.\n\nTrumenba is a sterile suspension composed of two recombinant lipidated factor H binding protein (fHBP) variants from N. meningitidis serogroup B, one from fHBP subfamily A and one from subfamily B (A05 and B01, respectively).1 The proteins are individually produced in E. coli. Production strains are grown in defined fermentation growth media to a specific density. The recombinant proteins are extracted from the production strains and purified through a series of column chromatography steps. Polysorbate 80 (PS80) is added to the drug substances and is present in the final drug product. Each 0.5 mL dose contains 60 micrograms of each fHBP variant (total of 120 micrograms of protein), 0.018 mg of PS80 and 0.25 mg of Al3+ as AlPO4 in 10 mM histidine buffered saline at pH 6.0.\n\nThe immunogenicity of Trumenba following the three-dose schedule (0, 2, and 6 months) was evaluated in individuals 10 to 25 years of age in the U.S., Canada, and Europe (Studies 1 and 2) and following the two-dose (0 and 6 months) and three-dose schedules (0, 1–2, and 6 months) in individuals 11 to 18 years of age in Europe (Study 3). Serum bactericidal antibodies were measured with hSBA assays that used each of four meningococcal serogroup B strains. These four primary test strains express fHBP variants representing the two subfamilies (A and B) and, when taken together, are representative of meningococcal serogroup B strains causing invasive disease in the U.S. and Europe. The studies assessed the proportions of subjects with a 4-fold or greater increase in hSBA titer for each of the four primary strains. The studies also assessed the composite response to the four primary strains combined (proportion of subjects who achieved a hSBA titer greater than or equal to 1:8 (three strains) or 1:16 (one strain). To assess the effectiveness of the three-dose schedule of Trumenba against diverse meningococcal serogroup B strains, the proportion of subjects achieving a defined hSBA titer post-dose 3 was evaluated against a panel of 10 additional strains, each expressing a different fHBP variant. The hSBA responses to each of the primary strains observed in U.S. subjects after the third dose of Trumenba are presented for Study 1 and Study 2 in Table 5. Table 5: Percentages of U.S. Individuals 10 to 25 Years of Age With ≥4-fold rise in hSBA Titer and Composite Response Following Administration of Trumenba on a 0-, 2-, and 6-Month Schedule for Four Primary Strains (Studies 1 and 2) Abbreviations: CI=confidence interval; fHBP=factor H binding protein; hSBA=serum bactericidal assay using human complement; LLOQ=lower limit of quantitation; LOD=limit of detection. Note: LLOQ = 1:16 for A22; 1:8 for A56, B24, and B44. Note: The 4-fold increase is defined as follows: (1) For subjects with a baseline hSBA titer <1:4, a response is defined as an hSBA titer ≥1:16. (2) For subjects with a baseline hSBA titer ≥1:4, a response is defined as an hSBA titer ≥4 times the LLOQ or ≥4 times the baseline titer, whichever was higher. Note: Pre-specified criteria for assessment of hSBA responses (4-fold rise in titer to each primary test strain, and titer above LLOQ for all four primary test strains) among U.S. subjects were met in these studies. The hSBA responses against a panel of 10 additional strains observed in U.S. subjects after the third dose of Trumenba are presented for Study 1 and Study 2 in Table 6. Table 6. Percentages of U.S. Individuals 10 to 25 Years of Age With a hSBA Titer ≥ LLOQ Against 10 Additional Strains Following Administration of Trumenba on a 0-, 2-, and 6-Month Schedule (Study 1 and Study 2)- Note: LLOQ = 1:16 for A06, A12, and A19; 1:8 for A07, A15, A29, B03, B09, B15, and B16. In Study 3, Trumenba was administered according to different schedules, including Group 1 (0, 1, and 6 months), Group 2 (0, 2, and 6 months) and Group 3 (0 and 6 months). The hSBA responses observed after the second dose in Groups 1, 2, and 3 and completion of the three-dose series in Group 1 and 2 are presented in Table 7. Table 7: Percentages of European Individuals 11 to 18 Years of Age With a ≥4-Fold Increase in hSBA Titer and Composite Response Note: LLOQ = 1:16 for PMB80 (A22) and 1:8 for PMB2001 (A56), PMB2948 (B24), and PMB2707 (B44). Note: The ≥4-fold increase is defined as follows: (1) For subjects with a baseline hSBA titer <1:4, a ≥4-fold increase was defined as an hSBA titer ≥1:16. (2) For subjects with a baseline hSBA titer ≥1:4, a ≥4-fold increase was defined as an hSBA titer ≥4 times the LLOQ or ≥4 times the baseline titer, whichever was higher. Study 4 evaluated the immunogenicity of concomitantly administered Trumenba and Human Papillomavirus Quadrivalent (Types 6, 11, 16, and 18) Vaccine, Recombinant (HPV4) (Merck & Co, Inc.). U.S. subjects 11 to <18 years of age were randomized into three groups: Group 1 received Trumenba and HPV4 (N=992), Group 2 received Trumenba and saline (N=990), and Group 3 received saline and HPV4 (N=501). All vaccines were administered according to a 0, 2 and 6 month schedule. Immune responses were evaluated by comparisons of geometric mean titer [GMT] for each HPV type at 1 month after the third HPV4 vaccination (Group 1 vs. Group 3), and hSBA GMTs using two meningococcal serogroup B strains [variants A22 and B24] 1 month after the third Trumenba vaccination (Group 1 vs. Group 2). The noninferiority criteria for the comparisons of GMTs [lower limit of the 2-sided 95% confidence interval (CI) of the GMT ratio (Group 1/Group 3 for HPV and Group 1/Group 2 for meningococcal serogroup B strains) >0.67] were met for three HPV types (6, 11 and 16) and for the meningococcal serogroup B strains tested. For HPV-18, the lower bound of the 95% CI for the GMT ratio was 0.62 at one month after the third HPV4 vaccination. Study 5 evaluated the immunogenicity of concomitantly administered Trumenba and Meningococcal Polysaccharide (Serogroups A, C, Y and W-135) Diphtheria Toxoid Conjugate Vaccine (MCV4) (Sanofi Pasteur Inc.) and Tetanus Toxoid, Reduced Diphtheria Toxoid and Acellular Pertussis Vaccine Adsorbed (Tdap) (Sanofi Pasteur Ltd.) vaccines. U.S. subjects 10 to <13 years of age were randomized into three groups: Group 1 received Trumenba at 0, 2, and 6 months, and MCV4 and Tdap were coadministered with the first Trumenba dose (N=883). Group 2 received saline at 0, 2 and 6 months, and MCV4 and Tdap were coadministered with the first saline injection (N=870). Group 3 received Trumenba at 0, 2 and 6 months, and saline was coadministered with the first Trumenba dose (N=875). Immune responses were evaluated by comparisons of GMTs for each of the MCV4 and Tdap antigens 1 month after the first Trumenba vaccination, and hSBA GMTs using two meningococcal serogroup B strains [variants A22 and B24] 1 month after the third Trumenba vaccination. The noninferiority criteria for the comparisons of GMTs [lower limit of the 2-sided 95% CI of the GMT ratio (Group 1/Group 3 for meningococcal serogroup B strains and Group 1/Group 2 for MCV4 and Tdap) >0.67] were met for all antigens.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#S12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#STable1", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#STable2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-2", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-4", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-5", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-4", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-7", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-7", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-7", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-7", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-7", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-9", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-10", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-9", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-12", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-17", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-17", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-17", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-17", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-15", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-19", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-19", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-19", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-19", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-19", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-24", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-24", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-24", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-24", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-22", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#S14", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#S6", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#SAnimal", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#S8.1", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-29", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-35", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-45", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-45", "http://labeling.pfizer.com/ShowLabeling.aspx?id=1796#footnote-44"], "authors": [], "publish_date": null}