{"result_id": "294037", "URL": "https://thefullertoninformer.com/2022/06/", "timestamp": "2023-04-25 17:22:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/2022/06/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "June « 2022 «", "cleaned_text": "One patient in New York City tested positive for Orthopoxvirus, a diease related to monkeypox, according to the health department.Courtesy of CDC/Getty Images\n\nA New York City patient tested positive for a family of viruses that monkeypox belongs to, health officials said Friday, but it was still unclear if the person was infected with the rare disease.\n\nTwo patients had been under investigation by the city’s health department for possibly carrying the virus, which has been spreading around the western world “within sexual networks”, according to officials.\n\nOne possible case of monkeypox in the city was ruled out, while the other person tested positive for “Orthopoxvirus, the family of viruses to which monkeypox belongs,” the health department said in a statement.\n\nThe patient was in isolation and presumed to be positive while the Centers for Disease Control and Prevention determines if the person does indeed have the virus. Local health officials are carrying out contact tracing in the meantime, they said.\n\nHealth officials said masks were effective at preventing the spread of monkeypox, which produces skin lesions and leaves patients with flu symptoms.\n\n“As a precaution, any New Yorkers who experience flu-like illness with swelling of the lymph nodes and rashes on the face and body should contact their health care provider,” New York City health officials wrote in a press release.\n\n“Monkeypox is rare but can spread through close contact with an infected person or animal. This includes via respiratory droplets – usually after prolonged contact — body fluids or other forms of close contact, such as sharing clothes or other materials that have been used by someone who is infectious.”\n\nNew York City health officials stated monkeypox call be spread through “respiratory droplets.”Cynthia S. Goldsmith, Russell Regner/CDC via APThe World Health Organization called an emergency meeting Friday after more than 100 confirmed or suspected cases were identified in Europe, along with cases in Canada and Australia.\n\nThe virus was first identified in monkeys and rarely spreads outside of Africa, which has made the latest rash of cases alarming to health officials.\n\nThe first signs of the new outbreak started on May 7 when a man who had been in Nigeria tested positive for the virus in England.\n\nOfficials in England and Portugal have said most patients in their country are men who have sex with other men.\n\nThe cluster of cases was classified as an epidemic, according to Dr. Fabian Leendertz, a Robert Koch Institute epidemiologist.\n\n“However, it is very unlikely that this epidemic will last long. The cases can be well isolated via contact tracing and there are also drugs and effective vaccines that can be used if necessary,” he said.", "opengraph": {}, "tags": ["corona virus", "air combat usa", "#JOEIMBRIANO", "Doug Chaffee", "Las Vegas Shooting", "The DCCSP", "joe imbriano for city council", "illegal immigration", "MONKEYPOX", "Jesus Silva", "greg seabourn", "Fullerton city council", "Greg Sebourn", "Troy High School", "Bruce Whitaker Fullerton", "wifi dangers", "5G", "BRUCE WHITAKER", "JOE IMBRIANO", "Tony Bushala", "Hunt Library", "tony bushala fullerton", "Bruce Whitaker for senate", "barry levinson", "Friends for Fullertons Future", "Travis kiger", "doug chafee", "greg seaborn", "Larry Bennett", "Jim Touchstone", "fullertons sex offender ordinace repeal", "Joe Felz", "Joe Felz Dan Hughes bruce whitaker jennifer fitzgerald", "ladera vista junior high", "kelly thomas", "shawn nelson", "5G DANGERS", "corruption in the fullerton police department", "dan hughes", "Gretchen Cox", "Josh Newman", "ED ROYCE", "obstruction of justice", "jennifer fitzgerald", "Sean Paden", "jennifer Fitzgherald"], "tweets": [], "movies": [], "links": ["https://nypost.com/tag/monkeypox/", "https://nypost.com/2022/06/15/who-investigating-claims-that-monkeypox-found-in-semen/", "https://nypost.com/2022/06/14/who-renaming-monkeypox-after-experts-say-name-could-be-stigmatizing/", "https://nypost.com/2022/06/14/who-committee-to-decide-if-monkeypox-is-emergency-of-international-concern/", "https://nypost.com/2022/06/14/kids-immune-systems-weakened-after-covid-lockdowns/", "https://nypost.com/2022/05/19/possible-case-of-monkeypox-investigated-in-nyc/", "https://www1.nyc.gov/assets/doh/downloads/pdf/press/2022/05202022-monkeypox-update.pdf", "https://nypost.com/wp-content/uploads/sites/2/2022/05/nyc-monkeypox-111.jpg", "https://nypost.com/2022/05/20/who-convening-emergency-meeting-on-monkeypox/"], "authors": [], "publish_date": null}