{"result_id": "294034", "URL": "https://thefullertoninformer.com/medical-tyranny-and-sb-277/", "timestamp": "2023-04-25 17:22:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/medical-tyranny-and-sb-277/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "MEDICAL TYRANNY AND SB-277 «", "cleaned_text": "THEY SAY THE ROAD TO HELL IS PAVED WITH GOOD INTENTIONS AND THEY ARE NOT KIDDING.\n\nWAKE UP FOLKS. RIGHT NOW, LIKE NO TIME IN HUMAN HISTORY THERE IS A CONCERTED GLOBAL EFFORT TO FORCIBLY VACCINATE EVERY LAST MAN WOMAN AND CHILD ON THE PLANET.\n\nDO VACCINES SAVE LIVES? HAVE THEY IN THE PAST? COULD THEY IN THE FUTURE? CAN WE TRUST THOSE WHO HAVE THE HOTS FOR OUR BLOODSTREAMS? I WILL TAKE MY CHANCES. IF PEOPLE WANT TO LET THEIR KIDS GUZZLE ASPARTAME, SUCRALOSE, AND HIGH FRUCTOSE CORN SYRUP BY THE GALLONS, FEED THEIR BABIES COFFEE CREAMER OUT OF AN INFANT FORMULA CAN AND LITERALLY EAT PURE GARBAGE MICROWAVED FAKE FOOD, THEN BY ALL MEANS INJECT THOSE PEOPLE TILL THE COWS COME HOME. LEAVE THE REST OF US ALONE.\n\nSenator Pan handing over the most tyrannical document in human history. STATE SANCTIONED FORCED VACCINATIONS. IF YOU ARE NOT FREAKED OUT ABOUT THIS THEN THERE IS SOMETHING WRONG WITH YOU. We live in an age where the unthinkable has become reality. Technological and scientific advances in medicine, nano technology and genetic engineering COUPLED WITH this totalitarian proposed legislation in the wrong hands will spell the end of humanity. There are those who wish to reduce the population by 99% and maker their claims out in the open. The technology indeed exists to sterilize, induce cancer and cull with injections that interact with wireless emissions whose patented gene activation abilities vastly exceed the understanding of the average person. These people do not come in peace ladies and gentlemen. The Measles outbreak is no epidemic and is under control. This draconian legislation is from the pit of hell. It must be stopped in its tracks. “The more we do to you, the less you seem to believe we are doing it.” FOLKS YOU BETTER WAKE UP. FORCED MEDICAL PROCEDURES ARE KNOCKING AT YOUR DOOR AND THEY WON’T JUST APPLY TO KIDS. ALL THEY HAVE TO DO IS PUT BETA hCG INTO THE VACCINES AND THE HORMONE WILL PRODUCE ANTIBODIES AGAINST THE hCG TO PREVENT PREGNANCY-READ THAT STERILIZATION. THE VACCINE MANUFACTURERS HAVE TOTAL IMMUNITY FROM DAMAGES THE VACCINES CAUSE AND THEY ARE ABOUT TO FORCE ANY SHOT THEY DESIRE ON ALL CHILDREN BY ENDING RELIGIOUS EXEMPTIONS WHILE OPENING THE DOOR TO AN UNLIMITED NUMBER OF VACCINES. READ FOR YOURSELF. SURE FOR NOW THEY WILL MANDATE 10 OR SO VACCINES ON THE KIDS BUT BEFORE LONG THE LIST WILL BE MUCH LONGER AND THE AGE GROUPS EXPANDED. THE DAY HAS FINALLY COME FOR US TO SAY NO TO MEDICAL TYRANNY AND TOTALITARIANISM. WHAT THE HELL IS REALLY IN THESE SHOTS? YOU WILL NEVER KNOW BUT I GUARANTEE YOU THAT IT IS NOT WHAT THEY CLAIM IS IN THEM. VACCINES ARE A TROJAN HORSE TO GET NANO TECH, PIEZO ELECTRIC AND GENETICALLY ENGINEERED COMPOUNDS THAT ARE INFLUENCED BY OR ACTIVATED IN CERTAIN ELECTROMAGNETIC FIELDS, INTO YOUR CHILDREN’S BLOODSTREAM THAT CAN TARGET SPECIFIC CELLS, TISSUES, ORGANS OR SYSTEMS IN THE BODY. THE SCIENCE IS LIGHT YEARS AHEAD OF WHAT THEY ARE TELLING YOU FOLKS. THIS IS ABOUT PRUNING THE MENTAL FACULTIES OF YOUR CHILDREN AND FORCED STERILIZATION THAT YOU WON’T KNOW ABOUT FOR A DECADE OR SO. THE KIDS ARE YOUNG. HERE IS MORE ON HOW VACCINES AND WIRELESS GO HAND IN HAND TO DEPOPULATE AND RETURN THIS PLANET TO THE WOLVES AS THEY PAINT WITH ALL THE COLORS OF THE WIND.\n\nThe Hepatitis B vaccine is now given to newborns. We sometimes give 5 or 6 vaccines at one time. I chose to have mine delayed. I don’t want the government telling me I have to give my child Hepatitis B vaccine which is transmitted by sexually transmitted disease and/or blood transfusion. . . . I had mine staggered over several months. I’ve heard of many cases of walking, talking normal children who wound up with profound mental disorders after vaccines. …I think they’re a good thing, but I think the parents should have some input. The state doesn’t own your children. The parents own the children and it is an issue of freedom. SB 277 INTRODUCED ON 2-19-15, IS A DAY THAT WILL LIVE IN INFAMY UNLESS WE SEND THESE LEGISLATIVE THUGS PACKING. JAM THEIR SWITCHBOARDS, TELL YOUR FRIENDS, WRITE, CALL, FAX AND PRAY. FORCED SCHOOL VACCINATIONS COUPLED WITH FORCED SCHOOL WIRELESS EXPOSURE SPELLS DISASTER FOR YOUR LINEAGE FOLKS Press Release: SB277 Referendum Filed by Former Assemblyman Tim Donnelly Sacramento, CA July 1st, 2015 Today, Former Assemblyman Tim Donnelly Filed papers to qualify a Referendum against SB277, the bill forcing the vaccination of every child, who wishes to attend public or private school in California. Former Assemblyman Donnelly stated, “This referendum is not about vaccinations; it is about defending the fundamental freedom of a parent to make an informed decisions for their children without being unduly penalized by a government that believes it knows best.” See Referendum Petition: https://oag.ca.gov/system/files/initiatives/pdfs/15-0035%20%28Referendum%20of%20SB%20277%29.pd California enjoys one of the highest vaccination rates in the country, and until recently respected the right of individuals for personal or religious reasons to opt out of some or all vaccinations. When Governor Jerry Brown signed SB277, he deprived every Californians of that choice should they wish to send their children to a private or public school. For the vast majority, this is not an issue, but for those who are concerned about the inherent risks of an ever increasing schedule of vaccinations, or who themselves or their children have suffered severe reactions, up to and including death, having the freedom to opt out is everything. Now, that freedom is subject to the arbitrary control and subjective determination of a doctor and the government, instead of the parent. By referencing SB277, we intend to work with every individual and group willing to collect the signatures necessary to place it on the 2016 ballot and allow all Californians to decide. Contact: Tim Donnelly or Lauren Stephens Phone: 760-933-8460 or email: Info@SB277Referendum.com FaceBook: https://www.facebook.com/SB277Referendum?fref=ts Twitter: @SB277referendum PO Box 1170, Sanger, CA 93657", "opengraph": {}, "tags": ["corona virus", "air combat usa", "#JOEIMBRIANO", "Doug Chaffee", "Las Vegas Shooting", "The DCCSP", "joe imbriano for city council", "illegal immigration", "Jesus Silva", "greg seabourn", "Fullerton city council", "Greg Sebourn", "Troy High School", "Bruce Whitaker Fullerton", "wifi dangers", "5G", "BRUCE WHITAKER", "JOE IMBRIANO", "Tony Bushala", "Hunt Library", "tony bushala fullerton", "Bruce Whitaker for senate", "barry levinson", "Friends for Fullertons Future", "Travis kiger", "doug chafee", "greg seaborn", "Larry Bennett", "Jim Touchstone", "fullertons sex offender ordinace repeal", "Joe Felz", "Joe Felz Dan Hughes bruce whitaker jennifer fitzgerald", "ladera vista junior high", "kelly thomas", "shawn nelson", "5G DANGERS", "corruption in the fullerton police department", "dan hughes", "Gretchen Cox", "Josh Newman", "ED ROYCE", "obstruction of justice", "jennifer fitzgerald", "Sean Paden", "jennifer Fitzgherald"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/fKTmOwCm9qw?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/fKTmOwCm9qw?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/1ZlTfzAw6Ak?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/1ZlTfzAw6Ak?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe loading=\"lazy\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/YEasO4dQb-s?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/YEasO4dQb-s?feature=oembed"}], "links": ["https://thefullertoninformer.com/wp-content/uploads/2015/02/1610886_10152781583220674_8860006268605655765_n-1.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/02/vaxes-and-mortality-400x242.png", "http://www.rescuepost.com/.a/6a00d8357f3f2969e20111683a026e970c-pi", "https://thefullertoninformer.com/apple-666-project-inkwell-and-agenda-21-an-expose-with-an-all-star-cast/", "https://thefullertoninformer.com/wp-content/uploads/2015/02/15885_10153107769422930_535570428732479408_n.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/02/measlesfeature.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/02/images-84.jpg", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#", "https://oag.ca.gov/system/files/initiatives/pdfs/15-0035%20%28Referendum%20of%20SB%20277%29.pd", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#", "http://timdonnellyshow.com/press-release-sb277-referendum-filed-by-former-assemblyman-tim-donnelly/#"], "authors": [], "publish_date": null}