{"result_id": "294044", "URL": "https://thefullertoninformer.com/forcedvaccination/", "timestamp": "2023-04-25 17:22:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/forcedvaccination/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "Vaccines «", "cleaned_text": "Governor Brown signed SB 277 eliminating parents’ religious rights to refuse vaccines for their children. There now exists the the absolute requirement that all California public and private school children be immunized but yet there is no such state law mandating vaccination for public or private school teachers, school food service workers, janitors or other school staff. From a public policy standpoint, this makes absolutely no sense unless this is part of an agenda aimed only at children. Ladies and gentlemen it is-\n\n“Antonio (Sonny) de los Reyes served from 1978 to 1982 in a number of Philipino population control agencies. He was in Toronto recently to attend meetings of a Catholic charismatic prayer group.\n\nMr. De los Reyes, 52, served as executive director of the Commission on Population, the body coordinating the Philippine government’s population policy. He was forced out after criticizing the government for targeting the poor in its population control efforts.\n\n Although reinstated in 1986, De los Reyes refused to go back to his old position and instead devoted his life to speaking out against anti-population schemes. Today, de los Reyes is national president of the Council of Philippine Laity. The council came to international attention when it uncovered evidence of a widespread sterilization program aimed at young Filipina women.\n\nAdvertised as a national vaccination effort, the program involved the lacing of anti-tetanus toxoids with a sterilizing chemical known as HCG. Thousands of Filipino women between the ages of 15 and 45 were inoculated by the tainted vaccines. Only through the efforts of Catholic church organizations was the tainted vaccine brought to public attention”\n\ncarried out charitable acts and he made a point to do them under the radar. He was the founder of Reach Out Worldwide, a disaster-relief nonprofit. He had first hand information about something huge and as nefarious as all hell. Paul Walker and his friend were killed shortly after they discovered a conspiracy to supply victims of Typhon Haiyan with a prototype permanent birth control drug hidden in the vaccines being distributed as medicinal supplies along with food aid. They had a damning recording and they were on their way to rendezvous with an ally who would have helped them get in touch with the right people. Turns out they were betrayed and someone either rigged the car with the “Boston Brakes”, the car was hit by a drone strike or rigged with a bomb. Flames would typically be expected where the engine is in the rear of the car, but the fire in the front reinforces the theory of a fluid leak. However, officials later said that there was no evidence of a fluid leak.\n\nIn 1990 Fr. Anthony Fontegh was murdered in cold blood for allegedly speaking out against similar questionable vaccines on young girls masterminded from abroad. Similar claims were made in 2004 during a Nigerian polio vaccine programme. We know too well that these blatant evils are being sponsored and launched by some Western agents, companies and states that care very little about human life in Africa.\n\nThe trouble began in Kenya when the Catholic hierarchy became suspicious of a vaccine targeting women between 14 and 49 years that excluded boys and men. The bishops wondered why the campaign was being done clandestinely and in questionable phases.\n\nKenyan women were injected with a tetanus vaccine corded with Beta–HCG to cause infertility and miscarriages. The Bishops of Kenya issued a courageous statement exposing this secret sterilization program disguised as a tetanus vaccine.\n\nThe Kenya Conference of Catholic Bishops ended up calling upon all Kenyans to avoid the tetanus vaccination campaign laced with Beta-HCG, because they were convinced that it was indeed a disguised population control program. As a result, they were locked in a heated battle with the Kenyan Health Ministry over the safety of a tetanus vaccine that was being administered to women in the country. Although the government, UNICEF and the World Health Organization have all said that the vaccine is safe, the country’s Catholic leaders say they have proof that the doses given to Kenyan women were”laced” with a fertility-inhibiting hormone.\n\nThis story, largely missing from US news sources, has been out for almost 20 years. http://www.matercare.org/news-publications/medical-news/catholic-doctors-speak-tetanus-vaccination-campaign-is-all-about-population\n\n Now fast forward to California present day where most being completely acquiescent to tyrannical edicts that defy logic, question not why Tetanus, although not a communicable disease, still remains a required component of the immunization battery for 7th grade school entry.\n\nIt is precisely because the tetanus toxoid is the ideal carrier for beta HCG-the sterilant. We all know what happens to 7th graders before the 8th grade year, it is the onset of sexual maturity. California’s SB 277, forced vaccinations, is merely setting up the framework for clandestine forced sterilization. This has been done before, tested thoroughly and will be implemented unless people wake up and get mad as hell.\n\nYour children are slated for a future that involves medically induced illness as well as having no children of their own. Well that is of course the case unless you simply refuse to go along with this eugenics agenda by simply refusing all vaccines.\n\nThe real reason that none of this makes any sense is because there is an agenda, and to those involved, it makes perfect sense. The vaccine inserts clearly state that none of these vaccines have been tested for impairment of fertility, none of them.\n\nTripedia vaccine has not been evaluated for its carcinogenic or mutagenic potentials or impairment of fertility.\n\n13 NON-CLINICAL TOXICOLOGY 13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility DAPTACEL vaccine has not been evaluated for carcinogenic or mutagenic potential or impairment of fertility.\n\n13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility INFANRIX has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.\n\n13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility KINRIX has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.\n\n13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility PEDIARIX has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.\n\n13 NON-CLINICAL TOXICOLOGY 13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility Pentacel vaccine has not been evaluated for carcinogenic or mutagenic potential or impairment of fertility\n\nCARCINOGENESIS, MUTAGENESIS, IMPAIRMENT OF FERTILITY IPOL Long-term studies in animals to evaluate carcinogenic potential or impairment of fertility have not been conducted.\n\nCarcinogenesis, Mutagenesis, Impairment of Fertility COMVAX has not been evaluated for its carcinogenic or mutagenic potential, or its potential to impair fertility.\n\nCarcinogenesis, Mutagenesis, Impairment of Fertility COMVAX has not been evaluated for its carcinogenic or mutagenic potential, or its potential to impair fertility.\n\n13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility HAVRIX has not been evaluated for its carcinogenic potential, mutagenic potential, or potential for impairment of fertility.\n\n13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility RECOMBIVAX HB has not been evaluated for its carcinogenic or mutagenic potential, or its potential to impair fertility.\n\nCarcinogenesis, Mutagenesis, Impairment of Fertility Liquid PedvaxHIB has not been evaluated for carcinogenic or mutagenic potential, or potential to impair fertility.\n\nGARDASIL has not been evaluated for the potential to cause carcinogenicity or genotoxicity. GARDASIL administered to female rats at a dose of 120 mcg total protein, which is equivalent to the recommended human dose, had no effects on mating performance, fertility, or embryonic/fetal survival. The effect of GARDASIL on male fertility has been studied in male rats at an intramuscular dose of 0.5 mL/rat/occasion (120 mcg total protein which is equivalent to the recommended human dose). One group of male rats was administered GARDASIL once, 3 days prior to cohabitation, and a second group of male rats was administered GARDASIL three times, at 6 weeks, 3 weeks, and 3 days prior to cohabitation.\n\n13 Menactra vaccine has not been evaluated for carcinogenic or mutagenic potential, or for 2 impairment of fertility.\n\nCarcinogenesis, Mutagenesis, Impairment of Fertility M-M-R II has not been evaluated for carcinogenic or mutagenic potential, or potential to impair fertility.\n\nA developmental and reproductive toxicity study has been performed in female rabbits at a dose approximately 20 times the human dose (on mg/kg basis) and revealed no evidence of impaired female fertility or harm to the fetus due to Prevnar 13.\n\nCARCINOGENESIS, MUTAGENESIS, IMPAIRMENT OF FERTILITY No studies have been performed with Tetanus Toxoid Adsorbed manufactured by Sanofi Pasteur Inc. to evaluate carcinogenicity, mutagenic potential, or impact on fertility.\n\nAnimal reproduction studies have not been conducted with Tetanus Toxoid Adsorbed manufactured by Sanofi Pasteur Inc. It is also not known whether Tetanus Toxoid Adsorbed manufactured by Sanofi Pasteur Inc. can cause fetal harm when administered to a pregnant woman or can affect reproduction capacity. Tetanus Toxoid Adsorbed manufactured by Sanofi Pasteur Inc. should be given to a pregnant woman only if clearly needed.\n\nAnimal fertility studies have not been conducted with BOOSTRIX.\n\npathogenesis of, or immunity to, pertussis has not been clearly defined. 13 NON-CLINICAL TOXICOLOGY 13.1 Carcinogenesis, Mutagenesis, Impairment of Fertility Adacel vaccine has not been evaluated for carcinogenic or mutagenic potential, or impairment of fertility.\n\nIt has been demonstrated that serum antitoxin has failed to prevent severe tetanus even in the amounts 2,500 times higher than what is considered sufficient for tetanus prevention in adults. TETANUS VACCINATIONS MAKE NO SENSE UNLESS THERE IS ANOTHER REASON FOR THEM.\n\nHow did smallpox disappear in the US without the smallpox vaccine remaining in the current schedule? Why do we require a tetanus vaccine which, by the way, is not EVEN A COMMUNICABLE DISEASE for school entry and not a smallpox vaccine? Why do we administer Diptheria, Tetanus and Pertussis at the same time?\n\nTetanus vaccine is part of the DTap vaccine given to children. Tetanus vaccine is part of the Tdap vaccine given to junior high students. Tetanus vaccine contains the tetanus toxoid. This is extremely important as you will see at the end of the article.\n\nThese people are simply not human. They are utilitarian and knowingly or unknowingly serving the eugenicists interests.\n\nThe behavior of our elected representatives with a handful of exceptions, is Orwellian to the core. Invoking The parens patriae doctrine, we have Senate Judiciary testimony taking parental rights down to the mat in a choke hold. This law is clearing hurdles faster that you can keep up with it. SB 277 is on a fast track and your children will be sterilized unless you wake up.\n\nNo matter how you feel about vaccinations, the words of CA senator Wieckowski from the SB277 judiciary committee hearing seem surreal and are cause for alarm if you value civil liberties. To quote him talking about various court cases: “The police power of the state..has absolute authority to force that person (even adults) to get the vaccination….We undervalue our power–the state police power. If we believe that children are being harmed, we go into this domain of family rights, which are not absolute, and my question is: maybe we are not going far enough?”\n\nThese people are not ignorant, or uninformed. To the contrary, they have pledged an allegiance to a power structure, which is satanic to the core. SB 277 is not about public health. There is no communicable disease public health crisis ladies and gentlemen. SB 277 is about eugenics.\n\nSB 277 is not about big pharma’s balance sheets or medical system’s profit taking although it will be a tremendous boon to the industries.\n\nSB 277 is not about mere political payback for campaign contributions. It is not about doing what is best for the young, the old or the most vulnerable among us.\n\nSB 277 IS ABOUT STERILIZING CHILDREN AND ESTABLISHING PRECEDENT AND SETTING UP THE FRAMEWORK TO INJECT US ALL WITH STERILANTS, CANCER VIRUSES, CHEMICALS, AND HORMONES IN ORDER TO CONTROL AND CULL THE POPULATION.\n\nHERE IS THE TRUTH ABOUT OVERPOPULATION. Census Bureau: 94.6 Percent of U.S. Is Rural Open Space-\n\nSO WHY ALL THIS TALK ABOUT OVERPOPULATION?\n\nWHY THE PUSH TO CULL US WHEN THERE IS EMPTY LAND FROM HERE TO KINGDOM COME?\n\n-BECAUSE THE MOAT AROUND THE CASTLE DOESN’T WORK WITH 6 BILLION PEOPLE ANYMORE.\n\nHERE IS THE TRUTH ABOUT SB 277-\n\nIT IS ALL ABOUT FORCED VACCINATIONS AND FORCED STERILIZATION\n\nWHY IS A TETANUS SHOT REQUIRED FOR SCHOOL ENTRY WHEN IT IS NOT A COMMUNICABLE DISEASE? BECAUSE THE TETANUS TOXOID IS ONE OF THE BEST CARRIER COMPOUNDS FOR THE STERILIZING HORMONES! WHY DO THEY REQUIRE PUBESCENT CHILDREN TO RECEIVE THE Tdap SHOT BEFORE ENTERING JUNIOR HIGH? GEE I WONDER. BY THE WAY, PERTUSSIS TOXOID AND DIPTHERIA VACCINE WORK PRETTY WELL AS A CARRIER FOR BETA HCG AS WELL. IT IS NO ACCIDENT THESE THREE ARE ALL TOGETHER IN ONE JAB.\n\nBeware of the changes coming to the school entry requirements for Tetanus, diptheria and pertussis. When they go to a multi dose battery beware. The only time the tetanus vaccine has been given in five doses is when it is used as a carrier in fertility regulating vaccines laced with the pregnancy hormone Beta HCG. What is Sanjay Gupta telling us today about pertussis? He is telling us that multiple doses may be necessary. He is setting it all up. IT IS ALL CONNECTED.\n\n\n\n By simply adding the beta-sub unit of human chorionic gonadotropin (hCG) conjugated to various carriers SUCH AS TETANUS TOXOID with highly specialized adjuvants to a vaccine, WOMEN CAN BE RENDERED INFERTILE.\n\nThe heterospecies dimer (HSD)-dehydrogenase hCG vaccine was the first to have been sucessfull for use in both sexes for the prevention of pregnancy RENDERING MEN AND WOMEN INFERTILE.\n\nZona pellucida vaccines have been around for decades. By simply vaccinating to induce immunity against zonae pellucidae, this will causes the recipient of the vaccine to produce antibodies that themselves are bound by a zona pellucida. Therefore when a sperm encounters an ovum in an person immunized against zonae pellucidae, the sperm cannot bind to the ovum because its zona pellucida has already been occupied by antibodies RENDERING MEN AND WOMEN INFERTILE .\n\nFOLKS IT IS TIME TO WAKE UP TO THIS STERILIZATION AGENDA.\n\nAND BY THE WAY, IF YOU THINK YOUR CHURCH, PASTOR, ELECTED REPRESENTATIAVES, SCHOOL DISTRICT OFFICIALS, THE PTA, YOUR DOCTOR, THE CANARY PARTY, HEALTH CHOICE, OR OUR KIDS OUR CHOICE ARE GOING TO HELP, YOU BETTER WAKE UP. YOU ARE BEING EXERCISED BY THE CONTROLLED OPPOSITION CONNECTED TO THE PHARMA AND EUGENICIST INTERESTS THROWING THE CASE AT EVERY JUNCTURE. YOU ALL BETTER GET READY TO DRAW YOUR LINE IN THE SAND FOLKS BECAUSE THEY ARE GEARING IT ALL UP. FORCED VACCINATIONS ARE COMING.\n\nThe massive damage done to the vehicle Walker was driving tells me that Walker was MURDERED. He was murdered, I believe, for trying to expose a vast conspiracy that is going to affect every man woman and child on the planet because this is not just about school entry. If SB 277 becomes law, it will fan out to encompass young, old, and anyone in between with a pulse. Open your eyes.\n\nReal true Biblical Christianity, not the phony feel good crap going on in the pickpocket criminal preachers fleecing operations in a neighborhood near you, is an untapped arsenal in the battle against the dehumanization and sterilization of helpless children that have been ignored for far too long. The agenda is coming ashore to California. There can only be a shift in mentality if Americans are made to understand – as the Kenyan Bishops have done – that children are humans. Only then will we succeed in saving God’s plan for all of humanity-the ability for our children to someday have a family and for their offspring to inherit their birth right which is eternal life. This is what is being stolen by these demonic thugs ladies and gentleman.\n\nYes watch for the soft peddling by the controlled opposition that has paved the road for this bill to get this far thanks to the Blaxill eugenics and pharma connections-Prayer today is in order and it all needs to be in Jesus name. This is a satanic agenda forcibly injecting parts of murdered unborn children with cancer viruses, sterilants, iq reducing hormones, metals, nano technology, carcinogens and toxins into the virgin bloodstreams of your children. This is the line in the sand. The canary party, health choice, our kids our choice have hijacked the movement and have sold you and your children all down the river along with all of the pickpocket church leaders who have been silent all along. Folks, pull your children out of public school and stop giving money to the phony churches that have stood by in silence while yours and your children’s God given and reproductive rights to have a healthy life and children of their own is being stripped away with a syringe and a pen. Home school your children and protect them from the common core, the sterilizing vaccines. the sterilizing forced wireless exposure and the radical godless secular humanist agendas in these prisons called classrooms. Public school is no place for your children. It is not safe anymore. It is time for us to stand our ground, draw the line in the sand and invoke the help of The One who put the 75,000 miles of circulatory system in the miracles of our children. Please read Ephesians 6 and be in prayer. May this demonic agenda from the pit of hell be stopped in its tracks, may those behind it repent of their evil deeds and may we as parents find the courage to do what is necessary to ensure that children can still be born and inherit eternal life.\n\nMAY ALMIGHTY GOD HELP US TO DEFEAT THIS STERILIZATION AGENDA, HELP IS TO STAND UP FOR THE CHILDREN WHOSE PARENTS ARE CLUELESS AND HELP US ALL BUILD OURSELVES AN ARK SO WE CAN PROTECT OUR FAMILIES NOW BEFORE IT IS TOO LATE, IN JESUS NAME, AMEN.", "opengraph": {}, "tags": ["corona virus", "air combat usa", "#JOEIMBRIANO", "Doug Chaffee", "Las Vegas Shooting", "The DCCSP", "joe imbriano for city council", "illegal immigration", "Jesus Silva", "greg seabourn", "Fullerton city council", "Greg Sebourn", "Troy High School", "Bruce Whitaker Fullerton", "wifi dangers", "5G", "BRUCE WHITAKER", "JOE IMBRIANO", "Tony Bushala", "Hunt Library", "tony bushala fullerton", "Bruce Whitaker for senate", "barry levinson", "Friends for Fullertons Future", "Travis kiger", "doug chafee", "greg seaborn", "Larry Bennett", "Jim Touchstone", "fullertons sex offender ordinace repeal", "Joe Felz", "Joe Felz Dan Hughes bruce whitaker jennifer fitzgerald", "ladera vista junior high", "kelly thomas", "shawn nelson", "5G DANGERS", "corruption in the fullerton police department", "dan hughes", "Gretchen Cox", "Josh Newman", "ED ROYCE", "obstruction of justice", "jennifer fitzgerald", "Sean Paden", "jennifer Fitzgherald"], "tweets": [], "movies": [], "links": ["http://www.theinterim.com/issues/population/former-population-control-official-affirms-philippine-vaccine-scandal/", "https://thefullertoninformer.com/wp-content/uploads/2015/06/AP40590256290-1-632x450-1.jpg", "http://www.kccb.or.ke/home/news-2/press-statement-by-the-kenya-conference-of-catholic-bishops/", "http://www.fda.gov/downloads/BiologicsBloodVaccines/Vaccines/ApprovedProducts/ucm101580.pdf", "https://thefullertoninformer.com/wp-content/uploads/2015/04/images.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/04/images-100.jpg", "https://thefullertoninformer.com/wp-content/uploads/2015/04/images3.jpg"], "authors": [], "publish_date": null}