{"result_id": "294042", "URL": "https://thefullertoninformer.com/covid-vax-required-to-buy-food-bolsheviking-the-phillipines/", "timestamp": "2023-04-25 17:22:31 CEST+0200", "meta": {"description": "EVERYTHING YOU HAVE BEEN TOLD IS A LIE AND A FRAUD. JOE IMBRIANO IS THE FULLERTON INFORMER AND BECAUSE YOU HAVE THE RIGHT TO KNOW, WE DARE TO PUSH THE ENVELOPE.", "lang": "en", "keywords": "PHILLPINE FORCED VAX,", "favicon": "https://thefullertoninformer.com/wp-content/themes/fusion/favicon.ico", "canonical": "https://thefullertoninformer.com/covid-vax-required-to-buy-food-bolsheviking-the-phillipines/", "encoding": "UTF-8"}, "image": null, "domain": "thefullertoninformer.com", "title": "COVID VAX REQUIRED TO BUY FOOD-Bolsheviking the Phillipines- «", "cleaned_text": "CEBU CITY – Lapu-Lapu City Mayor Junard Chan on Tuesday said his executive order requiring residents to present a vaccination card in entering public and private markets and other establishments is meant to entice them to get inoculated against the coronavirus disease 2019 (Covid-19).\n\nChan admitted in a radio interview that the city has a low vaccination turnout and he sees the need to bolster efforts to reach the 70 percent population protection.\n\nOn Monday, he issued Executive Order 2021-040 imposing stricter measures amid a surge in coronavirus cases and placing the entire city under month-long modified general community quarantine until Aug. 25.\n\nHe, however, said the executive order that will require residents entering markets, convenience and department stores to present their vaccination card, will take effect on August 25.\n\n“We will wait until August 25. Let’s balance if the number of our residents who will get vaccinated. Let’s us wait and see, it’s not yet final as we will evaluate the turnout in our vaccination centers,” Chan said.\n\nThe mayor was reacting to netizens’ social media comments on the new measure, saying it will bring them hardship in accessing basic and essential goods amid the pandemic.\n\nHe appealed to the residents to cooperate with the city in observing the minimum health protocols as well as in its effort to inoculate at least 70 percent of the population to reach the protection goal against Covid-19.\n\n“Since the start of the pandemic, we have nothing to think of except the welfare of our people. We don’t want anything else to happen but to provide protection to the Oponganons (residents of Lapu-Lapu City). So much for my concern that this week, the Covid-19 cases are seriously high,” Chan said in a separate statement posted on his social media page.\n\nHe said on Friday last week, the city recorded 93 new cases, 85 on Saturday and 64 on Sunday.\n\nHe noted that the allotted beds for Covid-19 patients in Metro Cebu’s public and private hospitals have been filled up due to a surge in cases. (PNA)", "opengraph": {}, "tags": ["PHILLPINE FORCED VAX"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}