{"result_id": "295017", "URL": "https://www.greanvillepost.com/2020/05/11/virus-of-mass-destruction/", "timestamp": "2023-04-25 17:22:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/05/11/virus-of-mass-destruction/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Virus of Mass Destruction", "cleaned_text": "[dropcap]T[/dropcap]here comes a point in the introduction of every new official narrative when people no longer remember how it started. Or, rather, they remember how it started, but not the propaganda that started it. Or, rather, they remember all that (or are able to, if you press them on it), but it doesn’t make any difference anymore, because the official narrative has supplanted reality.\n\nYou’ll remember this point from the War on Terror, and specifically the occupation of Iraq. By the latter half of 2004, most Westerners had completely forgotten the propaganda that launched the invasion, and thus regarded the Iraqi resistance as “terrorists,” despite the fact that the United States had invaded and was occupying their country for no legitimate reason whatsoever. By that time, it was abundantly clear that there were no “weapons of mass destruction,” and that the U.S.A. had invaded a nation that had not attacked it, and posed no threat to it, and so was perpetrating a textbook war of aggression.\n\nThese facts did not matter, not in the slightest. By that time, Westerners were totally immersed in the official War on Terror narrative, which had superseded objective reality. Herd mentality had taken over. It’s difficult to describe how this works; it’s a state of functional dissociation. It wasn’t that people didn’t know the facts, or that they didn’t understand the facts. They knew the Iraqis weren’t “terrorists.” At the same time, they knew they were definitely “terrorists,” despite the fact that they knew that they weren’t. They knew there were no WMDs, that there had never been any WMDs, and still they were certain there were WMDs, which would be found, although they clearly did not exist.\n\nThe same thing happened in Nazi Germany. The majority of the German people were never fanatical anti-Semites like the hardcore N.S.D.A.P. members. If they had been, there would have been no need for Goebbels and his monstrous propaganda machine. No, the Germans during the Nazi period, like the Americans during the War on Terror, knew that their victims posed no threat to them, and at the same time they believed exactly the opposite, and thus did not protest as their neighbors were hauled out of their homes and sent off to death camps, camps which, in their dissociative state, simultaneously did and did not exist.\n\nWhat I’m describing probably sounds like psychosis, but, technically speaking, it isn’t … not quite. It is not an absolute break from reality. People functioning in this state know that what they believe is not real. Nonetheless, they are forced to believe it (and do, actually, literally, believe it, as impossible as I know that sounds), because the consequences of not believing it are even more frightening than the cognitive dissonance of believing a narrative they know is a fiction. Disbelieving the official narrative means excommunication from “normality,” the loss of friends, income, status, and in many cases far worse punishments. Herd animals, in a state of panic, instinctively run towards the center of the herd. Separation from the herd makes them easy prey for pursuing predators. It is the same primal instinct operating here.\n\nIt is the goal of every official narrative to generate this type of herd mentality, not in order to deceive or dupe the public, but, rather, to confuse and terrorize them to the point where they revert to their primal instincts, and are being driven purely by existential fear, and facts and truth no longer matter. Once an official narrative reaches this point, it is unassailable by facts and reason. It no longer needs facts to justify it. It justifies itself with its own existence. Reason cannot penetrate it. Arguing with its adherents is pointless. They know it is irrational. They simply do not care.\n\nWe are reaching this point with the coronavirus narrative. It is possible that we have already reached it. Despite the fact that what we are dealing with is a virus that, yes, is clearly deadly to the old and those with medical conditions, but that is just as clearly not a deadly threat to the majority of the human species, people are cowering inside their homes as if the Zombie Apocalpyse had finally begun. Many appear to believe that this virus is some sort of Alien-Terrorist Death Flu (or weaponized Virus of Mass Destruction) that will kill you the second you breathe it in.\n\nThis is not surprising at all, because, according to the official narrative, its destructive powers are nearly unlimited. Not only will it obliterate your lungs, and liquidate all your other major organs, and kill you with blood clots, and intestinal damage, now it causes “sudden strokes in young adults,” and possibly spontaneous prostate cancer, and God knows what other medical horrors!\n\nAccording to all the “scientists” and “medical experts” (i.e., those that conform to the official narrative, not all the other scientists and medical experts), it is unlike any other virus that has ever existed in the history of viruses. It certainly doesn’t follow the typical pattern of spreading extensively for a limited period, and then rapidly dying down on its own, regardless of what measures are taken to thwart it, as this Israeli study would seem to indicate.\n\nAlso, “we have no immunity against it,” which is why we all have to remain “locked down” like unruly inmates in a penitentiary until a vaccine can be concocted and forced onto every living person on earth. Apparently, this mandatory wonder vaccine will magically render us immune to this virus against which we have no immunity (and are totally unable to develop immunity), which immunity will be certified on our mandatory “immunity papers,” which we will need to travel, get a job, send our kids to school, and, you know, to show the police when they stop us on the street because we look like maybe we might be “infected.”\n\nGermany (where I live) is way out in front of this. According to the Süddeutsche Zeitung, the federal government plans to introduce a coronavirus “immunity card” as part of its “Infection Protection Law,” which will grant the authorities the power to round up anyone “suspected to be contagious” and force them into … uh … “quarantine,” and “forbid them from entering certain public places.” The Malaysian authorities have dispensed with such niceties, and are arresting migrant workers and refugees in so-called “Covid-19 red zones” and marching them off to God knows where.\n\nOh, yeah, and I almost forgot … the germ and chemical warfare researchers at DARPA (i.e., the U.S. military’s Defense Advanced Research Projects Agency) have developed some new type of fancy blood test that will identify “asymptomatic carriers” (i.e., people who display no symptoms whatsoever). So that will probably come in handy … especially if the “white supremacists,” “Red-Brown extremists,” and “conspiracy theorists” keep protesting the lockdown with their wives and kids!\n\nAnd these are just the latest additions to a list of rather dystopian examples of the “brave new normal” official narrative that GloboCap is rolling out, right before our very eyes (which the OffGuardian editors have streamlined here and here, and which continues on Twitter). It’s all right there in black and white. They aren’t hiding the totalitarianism … they don’t have to. Because people are begging for it. They are demanding to be “locked down” inside their homes, forced to wear masks, and stand two meters apart, for reasons that most of them no longer remember.\n\nPlastic barriers are going up everywhere. Arrows on the floor show you which way to walk. Boxes show you where to stand. Paranoid Blockwarts are putting up signs threatening anyone not wearing a mask. Hysterical little fascist creeps are reporting their neighbors to the police for letting their children play with other children. Millions of people are voluntarily downloading “contact tracing applications” so that governments and global corporations can monitor their every movement. In Spain, they bleached an entire beach, killing everything, down to the insects, in order to protect the public from “infection.” The Internet has become an Orwellian chorus of shrieking, sanctimonious voices bullying everyone into conformity with charts, graphs, and desperate guilt-trips, few of which have much connection to reality. Corporations and governments are censoring dissent. We’re approaching a level of manufactured mass hysteria and herd mentality that not even Goebbels could have imagined.\n\nMeanwhile, they’re striking the mostly empty “field hospitals,” and the theatrical “hospital ship” is now gone, and despite their attempts to inflate the Covid-19 death count as much as humanly possible, the projected hundreds of millions of deaths have not materialized (not even close), and Sweden is fine, as is most of humanity, and … just like there were no WMDs, there is no Virus of Mass Destruction.\n\nWhat there is, is a new official narrative, the brave new, paranoid, pathologized “normal.” Like the War on Terror, it’s a global narrative. A global, post-ideological narrative. It’s just getting started, so it isn’t yet clear how totalitarian this show will get, but, given the nature of the pilot episode, I am kind of dreading the rest of the series.", "opengraph": {"site_name": "The Greanville Post", "title": "Virus of Mass Destruction | The Greanville Post", "description": "CH HOPKINS—What I’m describing probably sounds like psychosis, but, technically speaking, it isn’t … not quite. It is not an absolute break from reality. People functioning in this state know that what they believe is not real. Nonetheless, they are forced to believe it (and do, actually, literally, believe it, as impossible as I know that sounds), because the consequences of not believing it are even more frightening than the cognitive dissonance of believing a narrative they know is a fiction. Disbelieving the official narrative means excommunication from “normality,” the loss of friends, income, status, and in many cases far worse punishments.", "url": "https://www.greanvillepost.com/2020/05/11/virus-of-mass-destruction/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/03/coronavirus-graphic-web-featureUSGov.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.telegraph.co.uk/news/2020/04/17/high-risk-coronavirus/", "https://www.washingtonpost.com/health/coronavirus-destroys-lungs-but-doctors-are-finding-its-damage-in-kidneys-hearts-and-elsewhere/2020/04/14/7ff71ee0-7db1-11ea-a3ee-13e1ae0a3571_story.html", "https://edition.cnn.com/2020/04/22/health/strokes-coronavirus-young-adults/index.html", "https://off-guardian.org/2020/03/24/12-experts-questioning-the-coronavirus-panic/", "https://off-guardian.org/2020/03/28/10-more-experts-criticising-the-coronavirus-panic/", "https://www.timesofisrael.com/the-end-of-exponential-growth-the-decline-in-the-spread-of-coronavirus/", "https://edition.cnn.com/2020/04/25/us/who-immunity-antibodies-covid-19/index.html", "https://www.sueddeutsche.de/politik/coronavirus-immunitaetsausweis-regierung-1.4892945", "https://www.scmp.com/week-asia/politics/article/3082529/coronavirus-hundreds-arrested-malaysia-cracks-down-migrants", "https://www.theguardian.com/world/2020/may/01/us-germ-warfare-lab-creates-test-for-pre-infectious-covid-19-carriers", "https://www.commondreams.org/news/2020/05/01/echoing-praise-charlottesville-neo-nazis-trump-calls-armed-anti-lockdown-fanatics", "https://www.tagesspiegel.de/gesellschaft/medien/querfront-protest-vor-der-volksbuehne-wie-die-ard-verschwoerungstheoretikern-auf-den-leim-ging/25755124.html", "https://www.nytimes.com/2020/05/02/us/anti-vaxxers-coronavirus-protests.html", "https://www.theguardian.com/us-news/2020/may/01/california-coronavirus-protests-huntington-beach-sacramento", "https://consentfactory.org/2020/04/13/brave-new-normal/", "https://off-guardian.org/", "https://off-guardian.org/2020/04/14/50-headlines-welcome-to-the-new-normal/", "https://off-guardian.org/2020/04/25/50-headlines-darker-more-of-the-new-normal/", "https://twitter.com/consent_factory/status/1238971734063226881", "https://twitter.com/paulschwartzman/status/1256705546041901066", "https://pjmedia.com/culture/megan-fox/2020/04/29/new-normal-wisconsin-cops-caught-on-camera-threatening-mom-for-letting-child-play-with-neighbor-n386692", "https://www.abc.net.au/news/2020-04-27/coronavirus-tracing-app-covidsafe-one-million-downloads/12187806", "https://www.bbc.com/news/world-europe-52471208", "https://taibbi.substack.com/p/temporary-coronavirus-censorship", "https://www.telegraph.co.uk/news/2020/04/14/just-19-patients-treated-easter-weekend-4000-bed-nhs-nightingale/", "https://www.nytimes.com/2020/04/02/nyregion/ny-coronavirus-usns-comfort.html", "https://off-guardian.org/2020/04/05/covid19-death-figures-a-substantial-over-estimate/"], "authors": [], "publish_date": "May 11, 2020"}