{"result_id": "295012", "URL": "https://www.greanvillepost.com/2021/09/29/danger-to-society-against-vaccine-passports/", "timestamp": "2023-04-25 17:22:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/09/29/danger-to-society-against-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Danger to Society: Against Vaccine Passports", "cleaned_text": "HELP ENLIGHTEN YOUR FELLOWS. BE SURE TO PASS THIS ON. SURVIVAL DEPENDS ON IT.\n\ne are in the midst of a radical restructuring of American society that involves imposing a regime of comprehensive discrimination, segregation, and social control not seen since the dismantling of Jim Crow.\n\nTo be clear, my central concern here is the policy of vaccine passports. Whatever one thinks many of the other issues involved here– lockdowns, masks, etc.—forcing people to inject a novel pharmaceutical into their bodies is something of an entirely different order of intrusion.\n\nThe first thing is to recognize that this is what vaccine passports and mandates of the kind Bill De Blasio (in New York) and Joe Biden (nationally) are doing. It is not a matter of some temporary, minor inconvenience to a few people that can be waived off as no-big-deal. “If you want to participate in our society fully, you've got to get vaccinated” is an extraordinary, radically divisive directive.\n\nIt is telling millions of Americans, for whom our Dear Leader’s “patience is wearing thin”—including me and >70% of black Americans—that they are going to be thrown out of work, school, and social life unless they agree to surrender their bodily integrity and right of informed consent, and submit to being injected with a pharmaceutical treatment of a kind that has never been used widely on humans before, that induces their bodies to produce a toxic protein, that has unknown medium- and long-term effects, that does not prevent them from getting or spreading the targeted disease, and that’s going to have to be re-administered every 5 months.\n\nThis will change our lives and transform society. Not just the lives of the unvaccinated, who will be thrown out of normal society, be refused probation, and lose their kids, but all of our lives—starting with the friends, loved ones, and workmates of the unvaccinated, who will have to leave them behind. If you are unvaccinated, you will not be able to go to a restaurant, a movie, a museum, or a political meeting with your friends. You and your vaccinated friends will be subject to constant demands for proof of your extraordinary eligibility to exercise what should be normal and unquestionable social rights.\n\nTo put it more existentially, you will be deprived of the ability to live in society in the simplest, most primary way that should not involve the language of “exercising rights” at all. People will be dragged out of the diner and the pollical rally if they don’t have the proper papers or QR code. We will all be living in a finely-articulated system of social control down to the café level, a new kind of checkpoint society.\n\nWell, maybe not that new. Most people accepting it will insist it’s not the same as the kind of checkpoint society we’ve seen and castigated in other places and times, but a lot of people like this mayor of Boston and this holocaust survivor will see the resemblance. Jim Covid. Medical Apartheid.\n\nThis is a real, cop-enforced policy of discrimination and segregation. As with any such regime imposed by the power of the state, if you do not oppose it, you're accepting and helping to enforce it. There is no in-between. This is the \"What would I have done\" moment you'll look back on with either pride or shame. Please do not try to minimize it, or pass it off as no big deal.\n\nAnd please don’t tell us it is not forced. You mean like: “I’m not forcing you to work as a wage slave. I’m just creating the conditions in which it’s impossible for you to live normally if you don’t.”? Or, better: “I’m not forcing you to sign this loyalty oath, I just won’t let you work here if you don’t.” Isn’t that the kind of Ayn-Randian/libertarian disingenuousness that leftists so shrewdly identify and denounce?\n\nSo, don’t deny or obfuscate: It is authoritarian, and it is radical. If you want to argue it's necessary (because sometimes it is necessary to be authoritarian), do so; but don’t deny it is. None of us newly-degraded Untermenschen are going to let you deny what is happening to us, and to the polity as a whole.\n\nAnd it will not stop with Covid. It will be extended to the infinite series of Covid boosters. Per Fauci, every eight—no, breaking news, now every five months. Follow that scientist—who, “quite frankly” is “science”—as he moves that “fully-vaccinated\" goalpost down the field. Obviously has this entirely under control.\n\nAnyone who thinks—Pharma having tasted the profits—this won’t be enforced every year, for every virus and variant, and—the state having tasted this level of social control—it won’t be extended into every corner of socio-political life, is exceptionally...well, naïve, to use the kindest word I can think of. Especially leftists.\n\nIt is a big deal, socially and politically.\n\nI would hope that anyone—and certainly leftists—professedly concerned with things like civil rights and bodily integrity would understand where the burden of proof lies. It is not the responsibility of those opposing it to prove that such a policy is not necessary; it’s the responsibility of the state and its supporters to prove that it is. I hope people who proclaim My Body, My Choice! would not agree to support or accept such a social regime unless they were absolutely convincedthere was a rock-solid justification for abolishing bodily autonomy along with a swath of primary social rights, and consigning millions of their friends and neighbors to joblessness, social exile, and effective house arrest.\n\nWhat are the grounds of their conviction? It seems to me that justification must meet at least three conditions: 1) that Covid is an overwhelming, apocalyptic greater danger, 2) that these vaccines are a necessary, effective, and the only or least oppressive solution to that danger, and 3) that there are no serious risks to be considered from the vaccines themselves, no possibility that they might cause other harms equal to or greater than the specific danger of Covid. We’ll discuss some of these below.\n\nBut there is one necessary condition of their conviction that dominates the discourse of those advocating mandates and passports, which is captured in the repeated declaration: The unvaccinated are a danger to society. As Biden says, we have to “protect vaccinated workers from the unvaccinated.” They are “plague carriers” who are responsible for spreading the virus and killing people because of their stupid and/or selfish choice, which we therefore cannot allow them to make.\n\nWow. If that conviction were true, who could argue with the conclusion? Not I, a socialist and marxist who understands the imperatives of social responsibility. I contend, however, that it is not true. It rests on a set of assumptions—framed as “scientific” certainties—that are false and misleading.\n\nNothing is more destructive to science and the pursuit of knowledge than the epistemological stance on display every day from establishment experts: false certainty: I stand with these guys: “I would rather have questions that can’t be answered, than answers that can't be questioned” (Richard Feynman); \"Unthinking respect for authority is the greatest enemy of truth\" (Einstein).\n\nLet’s leave aside for the moment discussion of any possible destructive personal or public health consequences of the vaccine or the vaccine pass-law regime itself. It is sufficient to point out that, in this specific case, at this point, with these Covid-19 therapeutics, the claim that the unvaccinated are a special “danger to society” is false. The falsity of that conviction, and the injustice of the pass-law policy based on it, is made evident by one scientific finding:\n• None The virus that grows [in vaccinated people] is just as infectious as that in unvaccinated people, meaning vaccinated people can transmit the virus and infect others…\n• None people with breakthrough infections—many of whom do not develop COVID symptoms—can unknowingly spread the virus…\n• None 68 percent of the studied breakthrough patients had very high viral loads…\n• None Grande’s [Katarina Grande, a Wisconsin public health supervisor] team detected infectious virus in nearly everyone: from 88 percent of unvaccinated individuals and 95 percent of vaccinated people.\n• None “We put the samples onto cells, and the cells died when they got infected.” …\n• None it means [vaccinated people] can spread the virus as easily as those who are not vaccinated. Evidence mounts that people with breakthrough infections can spread Delta easily\n• None “When you look at the level of virus in the nasopharynx of people who are vaccinated who get breakthrough infections, it's really quite high and equivalent to the level of virus in the nasopharynx of unvaccinated people who get infected.”\n• None Double-jabbed people carry same levels of Covid as unvaccinated. -- Double-jabbed people carry same levels of Covid as unvaccinated\n• None Fully vaccinated people who get a Covid-19 breakthrough infection can transmit the virus…“what [the vaccines] can't do anymore is prevent transmission.”\n\nJust a few sources. I could post scores like them. Everybody knows this now. It is why there’s such a frantic push to re-mask, cook up boosters, do something to compensate for the fact that the vaccines are not working as the get-us-back-to-normal solution we were led to believe they would be.\n\nPlease note also the evidence that infectious virus can be found more often in vaccinated (95%) than unvaccinated (over 88%) people. The evidence at this point clearly shows—in the scientific terms vaccine mandate proponents claim as their justification—that the vaccinated are at least as infectious, at least as much “plague carriers,” as the unvaccinated.\n\nPerhaps one can find different scientific opinions about this. Unlike the medical bureaucracy, I understand there will often be different reasonable, and sometimes conflicting scientific interpretations of data. But the burden of proof is on those seeking to impose a radical policy of discrimination and social control to justify it with overwhelming scientific evidence that those they will segregate are particularly dangerous “plague carriers.” And they do not have it.\n\nSome vaccine passport proponents will point to evidence viral load clears faster in vaccinated people, though it’s the same during the first 6-8 days, the period of maximum contagiousness. That’s hardly a sufficient thread on which to hang a radical transformation of society and the blackmailing of millions, including >70% of black Americans—as every one of those proponents would recognize if another team’s president were proposing that policy.\n\nHarvard epidemiologist Martin Kulldorff agrees, making the further point that vaccine passports are particularly discriminatory to working-class people, who are most likely to already have stronger natural immunity: “Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical.” Effectively firing and segregating the race and class disadvantaged—that’s touted as the socially virtuous policy.\n\nAs an article on Kulldorff notes: “Nor is the study out of Israel a one-off. Media reports show that no fewer than 15 academic studies have found that natural immunity offers immense protection from COVID-19.”\n\nSetting aside any of the other real concerns, then, I need not say one more thing to assert that vaccine passports are neither necessary nor effective, and therefore must be opposed—certainly by leftists. The bulk of scientific evidence, including from the sources that vaccine proponents insist we must follow (Fauci, the CDC), states that the unvaccinated are no more infectious and therefore no more a danger to society than the vaccinated. I need say nothing else to ask, with urgency, that vaccine pass-law supporters recognize the conviction they were so certain of is hollow, and either present some other, rock-solid scientific justification for throwing millions of us out of work, school, and exiling us from society, or oppose any such policy.\n\nThis alleged justification does not work: “But you’re putting those who can’t be vaccinated—children, the immunocompromised—at risk.” So are you, the vaccinated, at least as much. Follow the science.\n\nAnd please, if you’re tempted to riposte with: “But those who are vaccinated will get less sick and won’t die as often!” think again. If that were true, that’s a cautionary warning to anyone who is not vaccinated. It is not a justification for throwing the unvaccinated, and not the equally infectious vaccinated, out of work, school, restaurants, grocery stores, and political rallies if they don’t comply.\n\nBesides, it’s probably not true. As Dr. Charlotte Thålin of the Karolinska Institute says, “natural immunity is really better than vaccination,” and this “has really been shown in the context of COVID-19.” Of course, the United States—where the CDC cooks the data to taste1—seems to be exceptional in this as in everything else, but the latest and “some of the absolutely best data coming out anywhere in the world” show that unvaccinated people who’ve had Covid are “much [up to 27 times] less likely than vaccinated people to get Delta, develop symptoms from it, or become hospitalized with serious COVID-19. [my emphasis]”2\n\nSo, according to the best data in the world, those people in the hospital beds are at least as likely to have been put there by vaccinated people and at least as likely to be vaccinated people. Note that the percentage of cases among vaccinated is higher than the percentage of vaccinated in population:\n\nAnd there’s this gem: “But the unvaccinated who get sick will take up more of the beds that should go to people who made the other right choice.” So, obese people (the number one comorbidity for Covid), who choose to over-indulge in demon sugar should be thrown out of restaurants and their jobs because they might get sick and take up the beds reserved for virtuous Covid patients. Or drug addicts, who choose to fill up their bodies with substances they know are harmful. And, definitely, if Dr. Fauci/Pfizer produces an AIDS vaccine—which he already wasted time trying to do while ignoring other therapies—any gay man who declines to take it should be fired from his job and exiled from society because he might get sick. Maybe he should even be refused treatment if he does. Plague carrier! Why not start now with gay men who choose not to use condoms? They know the risks they are choosing to take. Must be fired from their jobs for possibly taking up the bed reserved for safe-sex practitioners. That‘s the version of a scientifically-justified ethico-political argument people—including leftists—want to make?\n\nThere is a basic category error at the heart of discriminatory pass-law thinking. As Dr. Marty Makary of Johns Hopkins says: “instead of talking about the vaccinated and the unvaccinated, we should be talking about the immune and the non-immune.”\n\nIt’s not the person—vaccinated or unvaccinated—who is the danger to society; it’s the virus. It's not the distinction between vaccinated and unvaccinated that’s important; it’s the distinction between immune/non-infectious and non-immune/infectious.\n\nThough we’re encouraged to think otherwise, in any circumstance, the term “vaccinated” does not necessarily mean “immune” or “non-infectious,” and “unvaccinated” does not mean “sick” or “infectious” and does include people who are “immune.” These are false and harmful equations.\n\nIt’s not “the unvaccinated” who get sick; it’s the non-immune. It’s not “the unvaccinated” who infect other people; it’s the infectious. In this case, because the vaccine does not prevent people from being infected or infectious, vaccinated people are not completely immune from the disease and are potentially infectious. And, crucially, as is always the case, many—likely most—unvaccinated people arenot sick or infectious and may never become so, and many are immune.\n\nTreating the “unvaccinated”—which includes people who have never been infected, people who have recovered from infection and have stronger, longer-lasting immunity (the most helpful kind for herd immunity), people who can’t be vaccinated, and people who choose not to be vaccinated—as an undifferentiated mass of “plague carriers” is scientifically misleading and ethico-politically pernicious. As history has taught us.\n\nThe notion that, just because they are “unvaccinated,” people deserve to be punished—by being exiled from society or not receiving medical treatment if they do get sick—should be firmly rejected, especially by leftists. (Maybe just, you know, people who get sick for whatever reason should get healthcare, period.)\n\nIf you want to follow the science rigorously, you distinguish between the immune/non-infectious and the non-immune/infectious, not between the vaccinated and unvaccinated.\n\nThat task no more requires “protect[ing] vaccinated workers from unvaccinated coworkers” than the reverse. If Joe Biden and the public health authorities really wanted to do the scientifically effective and ethico-politically fair thing, they would require everyone to be constantly tested before entering the workplace, vaccinated or not, because everyone who is vaccinated can also be infected and infectious. If, on the other hand, they want to sell as many profitable vaccines as possible…\n\nSo, there is no science or politico-ethical logic behind those eager-to-discriminate talking points used to justify vaccine mandates and passports. It is scientific nonsense.\n\nThis tweet describes exactly the situation vaccine passports are creating. Except it’s not just in the bar, it’s in the workplace, the classroom, every social space. There is no justification for it. It is, in fact, extremely dangerous, scientifically and politically, to think there is.\n\nReally, what is there, except an unscientific, illogical impulse: “Vaccine. Must take it.” and/or “The CDC says so. Must comply.” As Fauci directed: “Do what you’re told.”\n\nIn addition to the infectiousness of the vaccinated, which itself annuls the supposedly-scientific rationale for vaccine passports and mandates, there are other issues of efficacy, safety, and political ethics that make declining the vaccination a perfectly reasonable choice.\n\nFirst of all, it’s not apocalyptic. It’s really not. Estimates vary, but Covid is a disease with an Infection Fatality Rate (IFR) well below 1% for anyone under 65 years of age and under 0.5% overall in most calculations. The CDC’s “best estimate” is broken down by age group is: 0-17 = .002%, 18-49 = .05%, 50-64 = 0.6%, 65+ = 9%. According to the WHO, “Across 51 locations, the median COVID-19 infection fatality rate was 0.27% (corrected 0.23%)… In people < 70 years, infection fatality rates ranged from 0.00% to 0.31% with crude and corrected medians of 0.05%”. That 0.27% figure from the WHO is widely used, and I will use it.3\n\nHere's the latest estimate from Stanford epidemiologist John Ioannidis’s meta-analysis of 23 studies in 14 countries, broken down into smaller age groups, along with Stockholm University data:\n\nAs all these analyses show, Covid is certainly a significant danger to older people. According to the CDC, 56.8% of Covid deaths were in persons 75+, 29.7% were 85+, most with multiple co-morbidities. In children, on the other hand, at least one study shows that “COVID-19 disease has a milder clinical and laboratory course than Influenza”—1.8% vs.41.3% in intensive care, 1.2% vs. 34.8% requiring ventilation, and 1.2% vs. 15.2% morality. And the CDC confirms that, for children, Covid is less deadly than the flu.\n\nWe must also be aware that the basic data on this disease—statistics on number of cases and deaths—are unreliable. Positive PCR tests were counted as “cases” despite the fact that the test tells you nothing about the health of the person tested. As the Nobel-Prize winning inventor of the test said, it “can find almost anything in anybody” and “It can’t tell you that you’re sick.” This was known and reported by knowledgeable scientists, and even the NY Times, for over a year, and has just been re-discovered by The Atlantic and other publications, but its significance is completely ignored. If “as many as 9 out of every 10 [confirmed COVID-19 infections in the U.S.]— may not be infectious at all,” then…well, as Prof. Beda M. Stadler says: \"No other virus, ever, on this planet, has been accompanied by so much testing, and testing that's created so much nonsense and panic!\"\n\nCompounding that, on explicit orders from public health authorities, anyone who died with a positive PCR test within 60 days (and everybody entering a hospital was given an PCR test) was considered to have died from Covid. Dr. Deborah Birx, speaking as the White House Coronavirus Response Coordinator declared: ”If someone dies with Covid-19, we are counting that as a Covid-19 death.” The Illinois Director of Public Health directed: “Even if you died of a clear alternate cause…it's still listed as a Covid death…that does not mean that was the cause of the death [her emphasis].” By “clear alternate cause” of death, they mean things like intentional injury and poisoning, motorcycle accidents, and gunshot wounds, As one epidemiologist told The Atlantic: “Those patients who are there with rather than from COVID don’t belong in the metric.” But there they are.\n\nThis, unprecedented, scientifically specious, and misleading distortion of basic data, makes it impossible to know how many Covid cases and deaths there actually have been. It has been a deliberate deception that forms the basis of radically disruptive social policies. It’s difficult to think it was not done for any other reason than to promote panic for political and pharmaceutical-industry benefit. It has been severely damaging to our understanding of the disease and to the scientific process itself—damage compounded by the ridicule and­­ censorship of anyone who points that out.\n\nSo, given a ~0.27% IFR even with these distortions, I think it’s fair to say that Covid is a disease not to be taken lightly, but far from an apocalyptic social threat. How does this require an unprecedented, radical regime of mandates and passports that annuls fundamental rights of bodily integrity and informed consent and creates a checkpoint society?\n\nIf there were some Children of Men scenario, it might be necessary to consider abrogating such rights and proclaiming, “My Body, Society’s Choice,” but not for a 0.27% decrease in fertility. This isn’t a science fiction movie, and Anthony Fauci isn’t Dustin Hoffman.\n\nFurthermore, not only are the mRNA vaccines the U. S. relies on not getting us back to normal, as was promised, there is evidence that they are making things worse.\n\nAn important analysis in that regard is the “immune escape” proposition of Geert Vanden Bossche, who has worked on vaccines with GAVI, The Vaccine Alliance and the Bill & Melinda Gates Foundation. It’s complex and counter-intuitive, and he presents it in some long interviews (here, here, here, here) that you really should take a look at if you want to understand all the scientific issues that some of us are worried about. I will try to summarize it.\n\nAs a prefatory note, it’s important to understand how the mRNA treatments differ from traditional vaccines. The traditional vaccines put a killed or inactivated whole virus into our bodies, accompanied by various adjuvants. Our immune system then recognizes the virus as a threat and mounts a reaction that neutralizes the virus, and will attack the virus if it appears again.\n\nThe mRNA therapies, on the other hand, do not put a virus into our bodies; they inject a package of genetic code that enters our cells and make them produce one part of the virus, the spike protein (actually a slightly modified version thereof). Our immune systems will recognize and mobilize against that specific protein, and will attack it again if it enters the body as part of the virus.\n\nThe other difference is that, unlike most vaccines we are familiar with, these mRNA jabs, it is now clear (‘cause you really don’t know what’s going to happen until you give it to a lot of people. Warp speed, and all.), are very “leaky.” A leaky, or non-sterilizing vaccine is one that “keeps a microbe from doing serious harm to its host, but doesn’t stop the disease from replicating and spreading to another individual.”\n\nHere’s my abbreviated, simplified version of Vanden Bossche’s “immune escape“ analysis: Because these vaccines lessen symptoms and mortality but do not confer sterilizing immunity, and because, unlike traditional whole-virus vaccines or wild virus infections, they provoke immunity targeted specifically on a single element of the virus (the spike protein), they create, in vaccinees, propitious conditions for the incubation of new variants. In vaccinees, the virus, under “sub-optimal” pressure and still capable of replicating, will evolve in ways that change enough of the spike protein to escape the specific immune response the vaccine trains the immune system for.\n\nAt the same time, pushing the vaccine even to those whose immune systems are quite capable of recognizing and neutralizing the whole wild virus diminishes the reservoir of broader, stronger, and longer-lasting natural immunity that would be capable of “develop[ing] antibodies to the entire surface of the virus, not just a spike protein constructed from a vaccine,” and therefore capable of recognizing and neutralizing more variants. The resulting huge mass of not-so-immune, not-so-sick or asymptomatic, “leaky”-vaccinated people becomes a giant petri dish driving the evolution of vaccine-resistant variants.\n\nBottom line for vanden Bossche: \"The current [mass vaccination] 'experiment' is exactly how one would proceed to generate highly infectious variants that ultimately resist the vaccines.\"\n\nIt’s like giving everyone a half-course of antibiotics in the midst of a mass bacterial infection. We all understand that’s not going to defeat the bacterium. It only heightens the risk of super-bugs emerging that would be more deadly and impervious to the drug. As reported in Quanta in 2018, “Just as antibiotics breed resistance in bacteria, vaccines can incite changes that enable diseases to escape their control.”\n\nThe “immune escape” problem with vaccines has been known and worried about for quite a while. A 2001 study found that “vaccines that are not expected to provide full immunity” can “diminish selection against virulent pathogens…lead[ing[ to higher levels of intrinsic virulence and hence to more severe disease in unvaccinated individuals” and “eroding any population-wide benefits such that overall mortality rates are unaffected, or even increase, with the level of vaccination coverage.” (We’ll come back to that point about “overall mortality.”)\n\nThe most influential study relevant to the current situation was done around 2012 by Andrew F. Read, et. al. They studied an immune escape event that actually occurred with a vaccine for a poultry virus (Merck’s). In their experiments, “vaccination enabled the onward transmission of viruses otherwise too lethal to transmit, putting unvaccinated individuals at great risk of severe disease and death.”\n\nAs Nsikan Akpan points out, in a 2015 PBS article on the Read study: “the virus spread to sentinel [control group] birds nine days faster if it came from a vaccinated chicken versus an unvaccinated one…[and] “sentinels died faster when exposed to vaccinated chickens versus unvaccinated chickens.” As Read said, “One way to look at that experiment is that [it] shows vaccinating birds kills unvaccinated birds.”\n\nSince then, there has been concern about this happening with human vaccines. Per Read, quoted, in Science: “We are entering the era of leaky vaccines in humans…We need to have a responsible discussion about this.”\n\nIf this “immune escape” analysis is accurate, then, the greatest danger now comes from the vaccinated. They become the vector and driver of variant evolution, the danger to society. The unvaccinated need to protect themselves from the vaccinated.\n\nIs this analysis correct? I don’t know. I was very skeptical about it a few months ago, partly because I don’t want it to be true. The implications are disastrous. But developments during the past few months are consistent with what Vanden Bossche predicted: the rapid emergence of extremely infectious (but not necessarily as deadly) variants, outbreaks in unusual populations and environments, vaccinal immunity waning quickly, breakthrough infections galore, the constantly-changing meaning of “fully-vaccinated.” And, though there’s likely a lot of fear-mongering in the various headlines, we are quickly running through the Greek alphabet, from Delta, a variant: “poised to acquire complete resistance to wild-type spike vaccines,” to Mu, a variant “that might be able to evade immunity from vaccines and previous infections.” We had better take it seriously.\n\nThis experiment—and it is “the grandest medical experiment ever imagined\"—is ongoing in humans. Whether immune escape is happening is a matter for open, transparent, publicly available—you know, scientific—investigation and discussion. In place of reasonable discussion, we have censoring, ridiculing, and threatening to punish scientists and doctors who are trying to have one. How many of the articles I referenced above would be allowed to be published today? The resistance wouldn’t be because they are “anti-scientific” or wrong, but because they are cogent and call into question the vaccine program.\n\nI emphatically second this observation, from another excellent overview of the issue:\n\nthis is not a proven hypothesis. let’s be very clear about that.\n\nbut it is an increasingly well-supported hypothesis and one that seems more consistent with the facts than claims that vaccines are protecting society from spread or even from severity in the long run. if this bears out, boosters are a recipe for epidemiological poison, not prevention. you’re putting out a fire with gasoline….\n\nwe need to get much deeper into this issue of societal spread and viral amplification by the vaccinated.\n\nthe FDA and NIH need to stop playing vaccine salesman and do their actual jobs. they never looked at safety here and they never looked at long-term sterilizing immunity. if they pushed a seriously leaky vaccine into hundreds of millions, blame for this new surge lies 100% at their feet.\n\nthe fact that they are not all hands on deck assessing this issue is a disgrace. there is no higher priority in medicine right now.\n\nIndeed, compare Vanden Bossche’s predictions with the rosy forecast of Fauci, Gates, et. al., that the vaccines would be just the thing to bring us back to normal. That’s down the drain, with so many other things they were so sure about. Clearly something is going on that the advocates of the vaccine solution did not expect, and are flailing around to deal with. Unfortunately, instead of taking stock/acknowledging that the vaccines are not the solution, they are doubling down on a whack-a-mole booster chase that will inevitably fail. You cannot outrun the evolution of variants and you cannot put the immune system through new vaccines every 5 months. You will never be “fully vaccinated.” The vaccine companies, though, will be fully profitable. Something leftists might notice.\n\nYou know that thing about wars that are never meant to be won, but to be a continuous source of profits for weapons makers? Do we think, in our United States, that the Pentagon-arms manufacturer dance just can’t be what’s going on with the medical bureaucracy and Pharma? Or do we think that just can’t be what’s going on with this one type of weapon they produce—vaccines? Something leftists might think about how they think about.\n\nEditor's Note: What Jim Kavanagh is warning us about—the true nature of the corporate game for our utterly corrupt elites—bears repeating:\n\nIt’s a very dangerous situation because the medical bureaucracy has not, and never will, look for an alternative. They are completely invested, financially and ideologically, in vaccines as the solution. It’s always been about vaccines, and getting a permanent regime of mandatory adult vaccination—and those continuous profits. The longer they cling to that paradigm—and it’s going to be very hard, virtually impossible, for the medical bureaucrats to admit they were wrong—the bigger the disaster to come if it doesn’t work. And it isn’t.\n\nOf course, it’s not all about profit. In fact, the most difficult thing to overcome is the ideological commitment of the agents of the apparatus (and all those they have convinced) to the rightness of the missionary-imperialist pharmaceutical/vaccine paradigm.\n\nThe Gates-Fauci paradigm—which is now the dominant one—sees the human body as defective and infective, a plague-carrier, until and unless it is properly pharmaceuticalized. The natural human immune system just doesn’t work well enough. It has to be effectively replaced with a pharmaceutical construct, built with the latest, constantly upgraded, patented and profitable vaccines and genetic coding packages that everybody is forced to take.\n\nSpeaking of Bill Gates, if you’ve ever used something from, uh, Microsoft, you may recognize the “science” grift business plan. Moderna literally says it’s creating an “mRNA technology platform that functions very much like an operating system… designed so that it can plug and play interchangeably with different programs…the ‘program’ or ‘app’ is our mRNA drug,” which Moderna calls the “Software of Life.” [I cannot make this up.]\n\nIn other words, they will be selling what amounts to immunity-software-as-a-service, where you subscribe to constant updates of the “software of life” via proprietary, plug-and-play “unique mRNA sequence[s]”and coding packages that fix all the new variants—yes, perfectly, bugs—that may emerge. And also just happen to create a constant stream of income.\n\nThe purpose is not to win the war against the virus, but to keep it going as a continuous source of profits.\n\nThe model of “public health” in this paradigm is a society divided between quarantined bubble-people and continuously- and fully-vaccinated people, made “free” by the pharmaceutical fix. The unfortunately stubborn and the blissfully compliant. (And we’ll make life too difficult for the stubborn to resist.)\n\nThis paradigm just happens to be profitable; they sincerely think. (As does everyone who has been sincerely convinced by them.)\n\nThis paradigm is also the surest way to lose humanity’s war against viruses. As every scientist before the year 2020 would have said.\n\nThink about this for a minute, scientifically and logically, as you'd think about any such paradigm for chemically or genetically re-engineering any other complex natural eco-system. No one—certainly no one from the left—would or should accept such techno-dystopian nonsense: The earth will kill us with hunger, floods, and plagues unless we sufficiently herbicide all the crops, dam the rivers, fill in the wetlands, and kill all the insects. Do you question that? You're killing people! Says the agro-chemical industry. Oops, I mean \"science.\"\n\nWe understand very well that we cannot pesticide away all the dangerous insects, and would be killing ourselves if we tried. Not only because there are too damn many, but because every intervention with pesticide doesn’t just kill bad insects but affects, and can damage, other elements of the biosphere we need to live. We must also recognize that every intervention in the human immune system with every pharmaceutical and vaccine doesn’t just kill a virus, it changes and can damage the way the immune system works within the ecology of the whole human biome. And sometimes it takes a while to see it. As we are now experiencing. Thalidomide was a great drug. Until it wasn’t. Vaccines are not exempt from that problematic.\n\nAll vaccines have what Dr. Christine Stabell Benn (whose talk I implore you to watch) calls “non-specific effects”—that is, “They alter the immune system more broadly and so may affect the risk of other infections.” There should be nothing unusual about recognizing and talking about this—and there isn’t, for any other pharmaceutical except vaccines. Somehow we forgot, or have been led to forget, that.\n\nThe alternative paradigm of public health, which has been effectively disappeared behind the obsessive fixation on the indispensable pharmaceutical/vaccine solution, is to build structural public primary and continuous healthcare, and social measures that make for strong immune systems in healthy bodies in healthy social and environmental conditions. It’s a paradigm in which fully-tested pharmaceuticals and vaccines—targeted and offered to those most vulnerable to new pathogens—supplement, not replace, the natural human immune system, which has developed an armada of ways for defending against viruses for the million or so years we’ve been subscribed to it. For free. This paradigm offers the only hope of humanity staying alive in the infinite sea of ever-emerging viruses that no magic bullets will conquer.\n\nHave you seen one segment, heard one word, in the tsunami of media fear-mongering over the last eighteen months about how people can and should get and stay healthy and reinforce their immune systems? Has there been any discussion about possibly helpful available treatments that don’t require a new subscription, besides rejecting them and ridiculing anyone who mentions them? Has there been anything related to public health, besides rejecting universal, single-payer healthcare? Or has it all been about building anticipation for the appearance of the magic bullet?\n\nDo you think the presence of one thing and the absence of all the others is an accident or an oversight? The entire discourse of the Pharma-captured medical establishment has not been about public health; it’s been about vaccines. It’s been directed toward getting us to anticipate and accept mandatory adult vaccination. It’s going to be very hard to get them to focus on anything else. Some mass of people—maybe even including leftists—will have to force them to do it.\n\nPublic health scientist Allyson Pollock made the point about these different public-health paradigms in an interview with Tariq Ali during the Ebola outbreak in 2014:\n\nThe solution to these epidemics is not the magic bullets of vaccines and it is not sending in the troops. It’s structural, it’s social, it’s economic, it’s environmental and it is putting in all the public health measures….\n\nNow I’m not saying we don’t need vaccines, but one of the big problems is that vaccine developments itself is now in the hands of these large very powerful foundations like NGOs, like GAVI – the Global Alliance for Vaccine Initiative, who in conjunction with big companies like GSK and Merck, are out to seek patents and the reason why they like vaccines is it gives… because vaccines mean mass immunisation, it means numbers and numbers mean money…we are talking about re-building public health infrastructure and that includes putting in community primary health care, community health systems, infection control units at community level, putting in hospitals and training nurses and doctors. …\n\nlarge global funds like the Gates Fund or the Buffett Fund … need to industrialise, they need to medicalise and they need to pharmaceuticalise. But there is a big backlash coming, a big backlash in the Western world, much more critical thought about the ethicacy [sic] and the safety and the appropriateness of the drugs and vaccines and medications…\n\nSo far, we have talked about possible unintended effects of this mass vaccination program on the process of viral evolution and transmission (N.B., concerns about not “personal” but societal effects), which support legitimate concern about forcing everyone to take the vaccine. But there are also concerns about the safety of the vaccine, about its potential “non-specific” adverse health effects for the person and the mass of people taking it. These concerns cannot simply be dismissed when considering whether the state can force everybody to take a drug. They must be openly and transparently investigated, without favoring a desired result. As in, you know, science.\n\nThis is what everyone—certainly leftists—would expect and demand with any drug, but the very idea of which many ridicule with vaccines, for which they adopt the upside-down attitude that, however brand-new the vaccine is, its safety is to be assumed by default and the serious risk factor set to 0, unless someone gives overwhelming proof otherwise. I can’t believe the constant outcry I’m hearing: Why haven’t you approved it for the children already? What’s the matter with you?People really don’t see what­ dangerous, anti-scientific, lunacy that is.\n\nIsn’t it remarkable that the British government wants to ignore, and, as Jonathan Cook, points out, “appears to be furious” at, the advice of its own scientific advisors (the Joint Committee on Vaccination and Immunisation) and “push ahead” with vaccinating all 12-15 year-old children? It seems that, when “the science”—i.e., your own chosen group of experts that you’ve defined as “science”—happens to go in any way against extending the vaccine requirements, it’s time to unfollow it. ‘Cause it is not the science, but the vaccine, that leads. Boris & Co. are clearly looking for the “science” that takes them where they want to go—to more vaccines.\n\nAnd not to worry. Cook predicted that they would likely “bully the JCVI into hastily changing its mind,” with “liberal media outlets … which have been so careful until now to avoid giving a platform to ‘dissident’ scientists,…suddenly subjecting the great and the good of the vaccination establishment to harsh criticism from doctors who want children vaccinated as quickly as possible.” And so it seems the Ministers are “tak[ing] a wider perspective than the JCVI” and will likely approve the jab for those kids. Follow the science leader.\n\nOne might (or might not) also notice how this echoes a pattern that extends through every discussion of vaccines: Every bit of negative evidence that isn’t proof is deemed not evidence at all, to be dismissed, while every bit of positive evidence is presented as dispositive, to be embraced. And every attempt to point out how upside-down that is is denounced as “anti-scientific.” This is vaccine exceptionalism, and it is anti-scientific.\n\nThere are serious, unresolved harms and signals of harms from these vaccines, including to children, that deserve to be scrutinized, not dismissed.\n\nOf course, the medium- and long-term effects of these vaccines are entirely unknown. They have already generated one-third of the adverse-event reports of all vaccines since 1990 (>600,000, including >17,000 permanently disabled and >13.000 deaths) in the VAERS system, which admits it receives notice of “only a small fraction of actual adverse events.” Just reports, not confirmed, they say, as if, apples-to-apples, the astronomical difference means nothing.\n\nAny way you cut it:\n\nOf course, these reports are not confirmed. And never will be, because you can’t find what you don’t look for. Right-side up science and public health demand that a brand-new pharmaceutical prove itself to be safe before you administer—let alone mandate—it to everybody. Which means, deluged with unprecedented number of “just” reports of sudden death, you just investigate, with standard procedures like autopsies and without the agenda of predetermining results to protect that brand-now pharmaceutical. Not happening.\n\nAs in OSHA’s early recommendation that COVID-19 deaths not be autopsied. As in the Virginia Health Departments refusal, despite the family’s request, to autopsy a 58-year-old woman who died within hours of taking the vaccine, because, according to the current version of precognitive “science,” “nothing could be gleaned from an autopsy that would relate the vaccine to her death.” Or maybe, actually, because “officials inside and outside the health department were concerned the death of Keyes, who is Black, could worsen vaccine hesitancy among minorities.” Sometimes, you see, you have to lead the science where you want it to go.\n\nOne of the adverse effects that has been noticed is the occurrence of myocarditis and pericarditis (inflammation of the heart muscle or sac), reports of which always emphasize, as a way of dismissing concern, how “rare” it is. Yes, it is rare, especially among children, but the important point is: It is a lot less rare among the vaccinated,\n\nAs Dr. Makary points out, citing the CDC, the risk of hospitalization from vaccine-induced myocarditis (50 per million) is more than 150 times the very rare risk of hospitalization (0.3 per million) from COVID-19 in kids ages 5 to 17 (0.3 per million). A UC study puts boys 12-15 at 4-6 times greater risk of hospitalization with vaccine-caused myocarditis than with Covid. These vaccines have generated more reported cases of myocarditis/pericarditis in 7 months than flu vaccines have in 20 years.\n\nThese are not trivial differences. It means there is a whole cohort of people for which the vaccine is more dangerous than Covid. And myocarditis is not a trivial event. It is permanent damage to the heart muscle, which does not regenerate. When a 14-year-old boy gets myocarditis, it changes his life. As his cardiologist put it, critiquing the CDC’s minimizing word: “No case of myocarditis is ‘mild.’ That’s like saying a heart attack is mild.”\n\nThis is the kind of signal that would put a pause, at least, on the approval of any other drug, but are here waived off, with the word “rare,” while these pharmaceuticals are forced on everybody. That reaction is not driven by “science.”\n\nMyocarditis disproportionately affects boys and men. As Marcie Smith Parenti of the Black Feminist Project points out, in a must-read article (especially, I would think, for leftists concerned with women’s health), women are seeing“menstruation-related post-vaccine symptoms [that] are distressing”—including “hemorrhagic bleeding lasting more than a month; heavy intermittent bleeding for four months; passing golf-ball size clots of blood; and extreme cramping, serious enough to land one … in the ER.”\n\nOf course, we don’t know whether these symptoms “might be the harbinger of long-term fertility problems,” since “the effects of Covid vaccines on women’s health specifically, including the menstrual cycle, were not studied as part of the Emergency Use Authorization process,” there are “zero published studies on the effects of Covid vaccines on women’s reproductive systems,” and we have no idea what the long-term effects of these vaccines are. No wonder, as she says, that “’vaccine hesitancy seems to be especially pronounced among women aged 25-39 …[and] women of color, especially in the South.”\n\nAll of this is one other thing that, alone, should disqualify any attempt to force women (or anyone) to take these pharmaceuticals. But, as she points out (and as with all reports of adverse events), the media reaction to this “follow[s] a clear pattern: dismissive, trivializing, or hostile headlines and framing are followed deeper into the articles by acknowledgments that something may indeed be wrong.”\n\nBoth of these sets of symptoms relate to something that has been noticed, and caused confusion (“there's something else going on”), from the outset—that Covid looks to be as much a vascular as a pulmonary disease, with autopsies in July 2020 revealing blood clots in “almost every organ.” The curtain was dropped on that discussion, but recent research has given a possible explanation.\n\nIt was supposed that the spike protein—which the vaccines induce your body to produce—was itself harmless, and would stay in or near the site of injection (the deltoid muscle). It turns out—as detailed by scientists at UC San Diego and the Salk Institute in a report that “shows conclusively that COVID-19 is a vascular disease”—that “the spike protein alone was enough to cause disease” and “has a major damaging effect on the vascular cells.”4 Researchers from the University of Bristol also found that “the spike protein binds to cells…which line the small vessels of the heart…trigger[ing] a cascade of changes which disrupt normal cell function.”\n\nThus, Canadian scientist Byram Bridle’s fear: “We made a big mistake…We thought the spike protein was a great target antigen, we never knew the spike protein itself was a toxin and was a pathogenic protein. So by vaccinating people we are inadvertently inoculating them with a toxin.”\n\nBridle also discovered, that, according to Pfizer’s confidential “biodistribution study,” the lipid nanoparticles containing the spike protein manufacturing instructions circulate in the blood and throughout the body for days (an average of 13 days after first injection in some people), and accumulate “in organs and tissues including the spleen, bone marrow, the liver, adrenal glands, and in ‘quite high concentrations’ in the ovaries.”\n\nIt seems more than reasonable that doctors like pediatrician J. Patrick Whelan are right to be “concerned about the possibility that the new vaccines…have the potential to cause microvascular injury to the brain, heart, liver and kidneys in a way that does not currently appear to be assessed in safety trials of these potential drugs.”\n\nMaybe we need some more of what Marcie Smith Parenti calls for: “actual scientific research on the question.” Maybe before encouraging, let alone mandating, everyone to ingest the cool new “app” that makes their cells produce this protein all over their bodies.\n\nHere’s Thai-German microbiologist Sucharit Bhakdi’s very clear five-minute explanation of what gives Dr. Whelan such concern—what is happening in the vaccinated body if the circulating spike protein acts like…well, exactly how you’d expect it to act, having “a major damaging effect on the vascular cells”. Surely no one will try to force people to take these genetic therapeutics unless they are to be able to explain, just as clearly and persuasively, why they are certain that this is wrong:\n\nAssociated with all this, and alluded to by Bhakdi, is the danger of Antibody-dependent enhancement (ADE) or “pathogenic priming.” This is a process in which a vaccine that successfully neutralizes a virus also primes the immune system in such a way that, if challenged again with the same or a similar virus, it initiates a “cytokine storm” in which the immune system starts attacking the body’s own organs. In this case that would mean that vaccinated people who overcome a first infection with Covid might get deathly sick when infected again with Covid or another coronavirus (i.e., the common cold).\n\nFauci himself warned about this: “You vaccinate someone, they get infected with what you’re trying to protect them with [sic ‘from’], and you actually enhance the infection” [his emphasis].\n\nThis is a known risk with SARS viruses and coronavirus vaccines, and it occurred in previous animal trials of mRNA vaccines. A study on Covid vaccine safety concerns in October 2016 goes over some of these cases The most tragic example of ADE occurred in trials of vaccine for respiratory syndrome coronavirus (RSV). Of the 20 infants in the vaccinated group, 16 required hospitalization, including two who died, while only one of the 21 participants in the control group was hospitalized. As the authors of study note: “we have learnt the absolute necessity of tracking the comprehensive safety of vaccines before large-scale application, no matter the urgency of the moment.” See this analysis by Irish scientist Dolores Cahill and this paper from Shenzhen University Institute for Advanced Study. Unfortunately, clinical trials for these Covid vaccines did not fully test for this. Warp-speed and all.\n\nAs Robert Malone, who developed the mRNA technology, says: “The clinical trials were not designed to detect ADE, despite it being a major risk for corona vax development... FDA specifically acknowledged that ADE was a risk, and suggested focused trials were warranted - but did not require them… I find no trials to rule in/out ADE.”\n\nThe testing is now being done on those vaccinated via the “let’s see what happens” method. As this paper from NYU Langone and Tulane researchers puts it: “COVID-19 vaccines designed to elicit neutralising antibodies may sensitise vaccine recipients to more severe disease than if they were not vaccinated….This risk is sufficiently obscured in clinical trial protocols and consent forms for ongoing COVID-19 vaccine trials.”\n\nSo, we do not yet know whether this is happening, and it’s a level of risk that nobody should be forced to take. No matter the urgency of the moment.\n\nSpeaking of risk, everyone—every person making a decision whether to take a vaccine, and every society making decisions about public health policy—should be aware of the difference between relative risk reduction (RRR) and absolute risk reduction (ARR). As explained in a Lancet article, RRR “considers only participants who could benefit from the vaccine,” while ARR considers “the difference between attack rates with and without a vaccine [within] the whole population.”\n\nThink of it this way: If I buy a second ticket in a 100,000,000-to-one lottery, I can say I reduced my Relative Risk of losing the lottery by 50%; or I can say my Absolute Risk is now at 50,000,000/1. Both are true. Which is more relevant to my decision? I still need to buy 50 million more tickets. How much are they?\n\nThis is not a trivial game. I have been part of decisions by cancer patients that went like this: “You should do the chemotherapy. Studies show it reduces your chances of dying in the next three years by 20%.” When pressed, that meant from 5% to 4%, an absolute reduction of 1%. Makes a big difference when you’re deciding whether you want to pay all the costs of chemotherapy. It’s not a simple decision, you need to know the answers to a lot of things before making it, and it is your right alone to make it.\n\nAs the Lancet authors point out “Vaccine efficacy is generally reported as a relative risk reduction” and “ARRs tend to be ignored because they give a much less impressive effect size.” The numbers you always hear—95% for the Pfizer, 94% for Moderna—are, of course, the RRR numbers. The somewhat less impressive ARR numbers you never hear—derived from their own trials—are 0.84% for Pfizer and 1.2% for Moderna.\n\nThis translates into another relevant data point: NNV—the Number of people Needed to Vaccinate to prevent one more case of COVID-19. That number is 117 for Pfizer and 76 for Moderna. So, with the Pfizer genetic “app,” you need to turn between 117 people into spike protein factories to prevent 1 more case of Covid.\n\nNo one—neither an individual cancer patient nor the whole of society—can make a reasonable, scientifically-informed decision about whether to take—let alone whether to force everyone to take—these vaccines without all this information. RRR should never be presented without ARR, as if it’s the only relevant metric. Per the Lancet study: “With the use of only RRRs, and omitting ARRs, reporting bias is introduced, which affects the interpretation of vaccine efficacy. When communicating about vaccine efficacy, especially for public health decisions,… having a full picture of what the data actually show is important.” Ya think? Is that not the fundamental, indispensable scientific (and ethico-politcal) attitude?\n\nYet, we are in a situation where the full picture is deliberately and systematically hidden. I venture to say, far fewer than 1/117 media or medical-bureaucracy reports about these vaccines, and far fewer people—including leftists—taking adamant “follow the science” stances in favor of a pass-law, checkpoint regime that throws millions out of work have any awareness of this simple consideration of RRR and ARR. And the people thrown out of work and school and house-arrested because they are aware of this (and other considerations) and are making perfectly reasonable, scientifically-informed decisions on that basis, are being portrayed as being nothing but stupid and selfish.\n\nAll, the Way\n\nYet another way of considering efficacy and risk is to look at what is increasingly considered the best metric for evaluating the net positive effect of new drugs: all-cause mortality and morbidity. The logic is simple and irrefutable: We do not get an accurate assessment of the real health benefit by just measuring how effective a drug or vaccine is in preventing illness or death from the specific disease it targets.\n\nIt’s very unlikely that complex therapeutics like these vaccines will have no effect on anything else in the human body—and therefore public health—but the Covid virus. You must look for those other effects. Personally, if a vaccine reduces the risk of dying from Covid by 2X while increasing your risk of dying from a heart attack by 4X or getting sick from cancer by 3X, it does more harm than good. Socially, if the vaccinated population has fewer Covid deaths but also has more deaths overall than the unvaccinated population, you’ve got a problem that needs to be investigated—if you bother to see it.\n\nVaccine recipients need to know the total net risk-benefit to their health, and society to public health, not just the effect on a particular disease. If it does not improve the total risk of disease or death, it is not worth it—and certainly cannot be mandated.\n\nAs Dr. J. Bart Classen points out, in his study of Covid vaccines:\n\nUnfortunately, with vaccines, they don’t bother, and don’t want, to see it: “No pivotal clinical trial for a vaccine preventing an infectious disease” including for these Covid vaccines, has used the all-cause mortality and morbidity standard. Instead, “Manufactures and government agents” have used infection rates with a specific infectious agent as misleading surrogate endpoints, assuming they equate to a net health benefit.\n\nClassen’s analysis of the Pfizer, Moderna, and Jannssen vaccine trials, with 110,000 people followed for a maximum of 81 days, shows that, while the vaccinated group had fewer severe Covid cases (22-117) and fewer deaths (7- 23, six of which were confirmed as having Covid) than the control group, the vaccinated had many (3396) more severe adverse events (4842-1446).\n\nIn a later six-month trial, Pfizer reported 20 deaths from the vaccinated group and 14 from the placebo group, “none of which were considered related to [the vaccine] by investigators.” Their hard-to-find and somewhat confusing Supplementary Data table also shows more total adverse events (6617 vs. 3048) and more in all the categories of severe or life-threatening adverse events (375 vs. 277) in the vaccine group.\n\nFor Classen, these data indicates that “none of the vaccines provide a health benefit, and all pivotal trials show a statically significant increase in all-cause severe morbidity in the vaccinated group compared to the placebo group” and that “it is all but a certainty that mass COVID-19 immunization is hurting the health of the population in general.”\n\nOf course, we need more data and more time to assess the true effect. All this data does is demonstrate, based on the drug companies’ own trials, that there is no strong evidence that the vaccines reduce, and some evidence that they worsen, all-cause mortality and morbidity.\n\nThat’s all it has to do, because the burden of proof is on those trying to force everyone to take the vaccines to show that they are not going to diminish public health—will not increase all-cause mortality and morbidity—whatever their effects on Covid. It’s on those who advocate a pass-law segregation regime to prove, or at a minimum provide overwhelming evidence, that it is necessary and will be at least net harmless to public health as a whole. The fact that it’s built around a vaccine, no matter how effective it may be against the target disease, is not in itself such proof—although a lot of people, including leftists, have come to adopt that illogical and unscientific assumption.\n\nThough we don’t have enough excess all-cause mortality data since vaccination was initiated, we do have enough comparative data for the past 20 months, with a country that we haven’t heard much of recently, to make anyone actually motivated by data to think twice about how necessary repressive mandates and social policies are:\n\nAnd I’m sure someone can figure out a way to blame this on “the unvaccinated”:\n\nI despise and despair of the “political” framework that is taking hold in the United States, and the way this issue is being captured within it.\n\nVaccine mandates and passports will be supported and opposed by people on the right and the left, because there are scientific questions involved that are irreducible to any political position. We can be sure, however, and are already seeing, that the political and ideological apparatuses in the United States today will try to force them into the ridiculous categories of American partisan culture wars. There’s an attempt to create virtually a species distinction between the vaccinated and the unvaccinated, as another divisive “wedge” issue. That’s how pernicious and divisive the American “political” system, and its embedded “scientific” bureaucracy, is.\n\nI reject, and plead for all to reject, all such attempts. That way lies not only the destruction of politics—which is already well advanced—but also the destruction of science.\n\nAdvocating masks or social distancing is not “communism,” and skepticism about vaccines or resistance to vaccine passports does not make one a “right wing anti-vaxxer.” All leftists understand how ridiculous the first assertion is, though too many—probably most—are comfortable with the equally ridiculous latter. (And that unfortunately includes radical, anti-capitalist and anti-imperialist leftists, not just MSNBAOC “progressives”).\n\nFirst of all, \"anti-vaxxer\" is an epithet like \"conspiracy theorist\" or “Assaadist,\" whose purpose is to insult people who only have the same critical skepticism toward vaccines as toward any other product of the for-profit pharmaceutical industry—i.e., who are not vaccine exceptionalists—and to prevent and evadediscussion with them. Like those terms, it says something far more problematic about the person using it than the people to whom it is directed.\n\nAs a recent MIT study points out, skeptics of one-size-fits-everybody novel drugs are \"highly informed, scientifically literate, and sophisticated in the use of data.\" Indeed, I would contend, a lot of them know much more about the subject than most people who accept the establishment line. Per the study, it would be best “if the Left [or anybody else] would refrain from their sickening condescension toward those with serious, legitimate questions.”\n\nThe absurd attempts to make certain positions on complex scientific questions (and even specific drugs!) into right-wing phenomena should be embarrassing to those trying to pull it off. Opposing the radical, permanent abrogation of bodily integrity and informed consent from medical treatments no more makes one a Republican libertarian than does advocating for abortion rights, no matter how many libertarians agree with me on either. Let me not hear leftists accusing us who oppose vaccine passports of being rightist by association. Nobody's vetted the politics of everyone—let alone every scientist—they agree with on this issue. Nor must they. Those who stand with likes of Bill Gates, David Frum, Tony Blair, and Alan Dershowitz best keep that stone in their pocket.\n\nNor should anti-capitalist, anti-imperialist socialists and marxists disdain “personal freedom.” Our positions on abortion rights, surveillance, stop-and -frisk (Isn’t gun violence presented as a “public health” issue?), etc., are about protecting personal freedoms. Our goal, I hope, is to organize society in a way that will protect and expand personal rights and freedom—which we value as the hard-won fruits of social and historical struggle—better than does capitalist society, not to denigrate them. “My Body, My Choice” is precisely about personal choice.\n\nSometimes, we support movements for important personal rights even when they adopt unfortunate rhetorical frameworks from the ideological atmosphere we live in—like the conservative, disingenuous, and politically-weakening “Pro-Choice” slogan that the abortion rights movement decided to brand itself with. Does any leftist want to argue that we should withhold our support of the fight for that important personal freedom until the movement purges itself of all individualist, property-rights-based ideology and all the people who support abortion rights because Ayn Rand did, or whatever?\n\nLeftists who insist that the government not interfere in a woman’s free personal choice and the doctor-patient relationship when it comes to terminating a pregnancy may want to think twice about applauding the government eliminating choice, and permanently replacing the doctors-patient relationship with its own orders, when it comes to injecting complex pharmaceuticals into one’s own bloodstream. Are the same people who want to excoriate and sue bakers who don't want to make a gay wedding cake really going to cheer on doctors who refuse to treat sick people who have chosen not to take a particular drug? I suspect that logic will come back to bite them.\n\nOf course, in any polity, and there are going to be instances in which social necessity infringes upon even what are considered important individual personal freedoms, but that is not a trivial matter, and all cats are not the same libertarian or collectivist gray. Stopping at red lights is another order of rights-infringement than military conscription. The specific circumstances must always be considered, and not waived away with straw-manning invocation of general principles. Neither right-wing libertarians nor left-wing socialists have a formula that automatically generates the correct answer in all of these situations.\n\nWe must, and already have agreed that the right of informed consent for medical procedures is a fundamental right, a historical achievement to be centrally valued. It is as important as—is really the general instance of—the right of personal bodily autonomy we value and defend with a woman's body. It is a protection against another Tuskegee and against another Thalidomide, Vioxx, or Swine Flu vaccine. Nobody—certainly nobody of the political left—should in any way minimize its importance. It is, for good reason, encoded in domestic and international law—yes, the Nuremberg Code and the Universal Declaration on Bioethics and Human Rights, which states:\n\n“preventive, diagnostic and therapeutic medical intervention is only to be carried out with the prior, free and informed consent of the person concerned, based on adequate information. The consent should, where appropriate, be express and may be withdrawn by the person concerned at any time and for any reason without disadvantage or prejudice.”\n\nThe value of this right can not be set to zero and ignored every time something purporting to be an effective drug comes along.\n\nUnd­er any emergency circumstance, any limitation on this right must be fully justified, democratically agreed to, restricted to what is absolutely necessary, and temporary.\n\nThe state is adept at finding “emergency” reasons that sound socially reasonable to infringe upon core personal freedoms and take further control of our lives: “wars” on drugs, child pornography, terrorism, etc. Under the rubric of a public health emergency, this American capitalist-imperialist state, in which political institutions and medical agencies are entirely captured and corrupted by for-profit Pharma, has found something that appeals to the liberal sense of rationality and social responsibility, resistance to which they can portray as nothing but stupid and selfish. Because a real public health emergency may demand exceptional responses.\n\nThe issue is whether, in this situation, the state authorities’ claims about the emergency and the necessary responses to it are as scientifically justified as they insist. We have no reason just to accept, and in fact every responsibility to start out doubting, their claims—especially when they insist on inaugurating a radical regime of social control. We must insist that the burden of proof is on them, and never be so foolish as to accept the notion that they must--for our own sake, of course—deny us access to expert witnesses they don’t like. There’s no exception to that when a vaccine comes into evidence.\n\nSo, let’s think about the process of social choice that brought so many people, including leftists, to endorse a new, permanent, throwing-people-out-of-their-jobs regime of discrimination.\n\nI hope we understand that experts are not there to rule over the public, but to advise. Plato’s philosopher kings have no place in, are the enemies of, popular democracy.\n\nSurely, the default is not to accept the decree of some state-approved agency or expert that such a regime is necessary, but to demand the evidence and arguments for it. We should only accept such a regime if it were the result of a people’s decision, through their elected representatives as appropriate, after an open, transparent public discussion where all scientific and ethico-political arguments were heard—not one censored and restricted by government agencies, one or another political party, or their allied Overton-window-enforcing media and Silicon-Valley fact-checkers. Did I miss that process of social choice?\n\nWhat we have instead is precisely rule by decree. Biden’s decree is based on very expansive interpretation (\"Tests Limits of Presidential Power”) of a workplace-safety law that provides for “an emergency temporary standard” in cases where “employees are exposed to grave danger from exposure to substances or agents determined to be toxic or physically harmful or from new hazards.”\n\nHe offered none of the indispensable compensatory healthcare policies that must accompany any regime of discrimination supposedly enacted for the sake of the people. And no one I’ve noticed has demanded any of that. Must not leftists that support such a pass-law, segregation regime insist, every time they express that support—indeed, as a condition of that support—that it be accompanied by a corresponding regime of single-payer, universal-coverage healthcare-for-all? How about, at the very least, completely free treatment for any adverse effects from the vaccinations? Don’t passport supporters want to prove to everybody, especially to themselves, that it’s not all about control—social control and control of everyone’s bodies? <crickets>\n\nAt the start, it was: “the most meaningful divide...is between those actively working toward single-payer health care and those unwilling to embrace it.” Now, it’s: the most meaningful divide is between the vaccinated and the unvaccinated.\n\nSome people cite the mandatory childhood vaccination program as sufficient justification for the adult mandate and passport regime being proposed now. “I had to get vaccinated to go to school. What’s the big deal?“ Well, gee, let’s look at a couple of the assumptions in that way of thinking, and marvel at how self-demeaning and how unnoticed they are.\n\n1) Treat me like a child. I accept that the American capitalist state, in the person of Joe Biden (protector of workers) and Anthony Fauci (science itself), can treat me like a child. Those who don’t are stupid, selfish fascists. (Except it’s even worse: Children aren’t required to show a vax pass to get into Chuck E, Cheese.)\n\n2) One vaccine is as good as another. 'Cause all vaccines are good. No need to consider exactly how effective or possibly harmful to myself or the public health in general this vaccine might be, cause all vaccines are harmless magic bullets. I’ll take any one that comes along, because I don’t treat them as I would any other complex chemical cocktail someone might want me, a full-grown adult, to ingest, but like mother’s milk.\n\nThese assumptions do derive from, and the proposed pass-law policies are the apotheosis of, a blithe attitude about the U.S. program of mandatory childhood vaccination that we have been inculcated with, and that I hope this situation will bring more people to allow themselves to question. The US has gone from 3 doses in the 1960s, to 24 in 1983, to 72 now, a proliferation fueled by the passage of a 1986 law exempting vaccine makers from liability. This is far from the norm in other countries. We have, indeed, become inured to accepting any childhood vaccine that comes along and Daddy-CDC insists on, and mandatory vaccination for college students was the camel’s nose for adult mandates.\n\nSo, please do look carefully at the childhood mandatory schedule, because you’re looking at your future. When will you allow yourself to doubt? On the 3rd booster, or the 8th one? On the 2nd vaccine for an apocalyptic virus, the 24th or the 72nd? Will you then look at all the science without preconception? Will you then try to squirm off the logic you hoisted yourself on? Will you then want solidarity from those you house-arrested or forced to take the drug, and ridiculed? Or will you just continue to do what you’re told? Because I guarantee this is not stopping with SARS-COV2.\n\nTo understand how important it is to reject any attempt to instrumentalize an issue like this for useless partisan and culture war purposes, we have to go way back in the mists of American historical time, to 2014, when a similar issue arose regarding the Ebola virus.\n\nThis was a pathogen that causes a hemorrhagic fever that eats your blood vessels from the inside out, and for which, “There is no cure or specific treatment.” When it was clear that the virus had arrived in the U.S., killing one man in Texas and infecting two of his caregivers, a debate arose about whether to temporarily quarantine health workers returning from treating Ebola patients in Africa. Initially, both NY Governor Andrew Cuomo and NJ Governor Chris Christie wanted to quarantine those coming back into the NYC airports, with Christie saying: “the government's job is to protect the safety and health of our citizens,” and \"I don't think when you're dealing with something as serious as this you can count on a voluntary system. This is the government's job.\"\n\nBut it quickly became a partisan political football. Brouhaha ensued when Kaci Hickox, an American nurse, arrived at EWR after treating Ebola patients in Sierra Leone, and became the first person placed in mandatory quarantine. Obama administration “officials” said the policy was “not grounded in science.” Dr.—yup—Anthony Fauci, insisted that quarantining people who had been in contact with one of the world’s deadliest diseases is \"a little bit draconian.\" He and Obama’s UN Ambassador Samantha Power worried that quarantines would risk“disincentive[izing]…our heroes, the health care workers, [who] go there and help us to protect America.\"\n\nWhen Christie let Kaci out of quarantine early, the right-wing, led by Rush Limbaugh, accused him of “caving” to Obama. Meanwhile, over at MSDNC, Chris Hayes and his guests opined about how brave Kaci had stood up to Christie’s attempt to “bully” her, and how the right was using “fear …to drive conservative votes in a mid-term…fear of cells basically.”\n\nChris solemnly reminded us that “A mandatory quarantine is a pretty big deal...Quarantine is an extreme step. The public health version of martial law.” And one of his guests stressed that: “one of things you have to think through with quarantine if you`re going to exercise loss of liberty is, are you going to enforce that loss of liberty?” He pointed out that the last time a “controversial” policy “of th[is] scale” was “decreed,” when New York City quarantined some TB patients in the early 90s, it was accompanied with “a system of checks and balances. Patients had the right to a court hearing …a lawyer paid for by the city, and court review every three months. There was, in other words, due process.” Not like how the bad Republican governor “ordered a nurse into forced isolation for three days …with no state-appointed lawyer, no hearing, or process of appeals.”\n\nThe same people who pontificated about the “scale” of the not-scientifically-grounded, “draconian” “extreme step,” the “public health version of martial law” that would “disincentivize” our heroic health care workers—putting a few people who were in close contact with the deadliest virus in the world in temporary quarantine—are now insisting that, for a disease that has a ~0.27% infection fatality rate, the government can fire and socially-exile everyone, including health care workers, who won’t take a drug that will not protect them from being sick or infectiousness. Did I miss the part about the right to a state-appointed lawyer, a court hearing, and court review every three months? ‘Cause you really have to think through how you are going to “enforce that loss of liberty.”\n\nAre you following the bouncing ball “science”?\n\nIt is astounding to me (no, it really isn’t, unfortunately) that this stark reversal of partisan political polarity—right-wing Republican vs. liberal Democrat—regarding the state’s assertion of authority in public health emergencies, a mere seven years ago, has gone effectively unnoticed in the incessant punditry over the present viral crisis. I feel like I’m in a medical version of the movie Yesterday. Did everyone forget the Beatles, too?\n\nI wrote an article about this at the time, because I thought a temporary quarantine of a few people in these circumstances wasn’t outrageous, as I thought a few weeks of lockdown to “flatten the curve” at the beginning of this pandemic, when we didn’t know who was most infected, was reasonable—because I was focused on what a full analysis of the science justified, what was socially responsible and respectful of rights and best for public health, and because, for me, none of these considerations has anything to do with Obama or Trump or Republicans or Democrats or what’s useful for winning the next election, or any of the utterly ridiculous fights they manage to corral even many smart leftists into.\n\nThere’s an agenda here, which has nothing to do with health and science. Anyone who, seven years ago, was railing against temporary quarantine as “medical martial law” and is now embracing vaccine mandates and passports and a permanent, vast regime of segregation and social control, and doesn’t think they’re enmired in the RepubliDem mud, is, well, kidding themselves.\n\nRecalling that little bit of historical memory, I feel comfortable asserting that, given all the same information, virtually every one the vast majority of vaccine-mandate supporters who consider themselves in any way on the “left” would be howling in rage if Donald Trump had proposed, word-for-word, the same policy Joe Biden just did. His “patience is wearing thin” with the millions of working-class, including >70% of black, Americans who are too stupid or selfish to take a risky drug that won’t prevent them from getting sick or infecting others. Fire them all. Howling. That’s how much their position is about the “science.”\n\nI’ve given my reasons for opposing vaccine passports and mandates. Don’t think I am dismissive of concern: I have two extended family members who died from—or at least with—Covid. (Both had co-morbidities, one multiple and serious. Not close enough to know more, including their vaccination status.). I know a number of people—of all ages—who have had it before vaccination was available and know it’s not trivial. I now know some vaccinated people who have been infected and become sick, also not trivially, having—in their own estimation—caught it from other vaccinated people they hang out with. And I know one person—healthy, with no serious co-morbidities—who died within a few days of being vaccinated. I’m of an age to be threatened by Covid and I take that seriously. If there were a well-tested whole-virus vaccine, I might well take it.\n\nIn fact, I’m more afraid of Covid now than I was a year ago, what with all the leaky-vaccinated variant carriers running around. I am also healthy and have no co-morbidities. So I have to make a decision whether to take the chance of getting the disease and having strong immunity if I survive it, or take the chance of having the spike protein erupting throughout my body “trigger[ing] a cascade of changes which disrupt normal cell function” including possible neurodegeneration, and maybe still get the disease, possibly aggravated by ADE, anyway. Tough choice. And guess what? It’s mine to make.\n\nSo, my (and most people’s) reasons to oppose vaccine mandates and passports have nothing to do with stupidity or selfishness or fascism or any of the weak insults those who don’t want to know the reasons throw around. I oppose, and everyone should oppose, vaccine passports and mandates because I agree with the scientist who developed the vaccine technology they’re trying to force on us, that: “It's just bad science; it's bad policy; it's bad ethics.”\n\nStill certain that vaccine passports are the right thing to do? You better be. Get ready to confront hundreds of thousands of people like this—firefighters, nurses, hospital workers, delivery drivers, people who have been on the front lines of taking care of things in the three-dimensional social universe while others were chatting in Zoomland—who are going to lose their jobs—even if they are healthy, even if they have better immunity and are no more a “danger to society” than everyone who is vaccinated, because they do not want to take a real risk to their health, because they will not just do as they’re told.\n\nGet ready to explain to nurses and firefighters and truckers and bus drivers the absolutely rock-solid scientific justification for throwing them in the street. Because I still haven’t heard the demand from those who support vaccine mandates, including leftists, that housing, job, and healthcare guarantees must be a condition of any such policy.\n\nGet ready to explain why the people who are telling them to do as their told—White House staff, for example—are not themselves doing as they say. We have to ask—the press has to ask, but it won’t—of everyone promoting this at everyinstitution: What are the exemptions? Are there any non-public—i.e., secret—exemptions? Because if you don’t think that the vaccine mandate throughout society will work just like the mask mandate did at the Met Gala ,that high-level politicians, CEOs, donors, doctors, and their families will get exemptions and have their own special QR code that beeps them right through every checkpoint, you are…well, naïve is the kindest word I can think of. Especially if you’re a leftist. The people you’ve helped throw on the street will not be that, er, naïve.\n\nAnd yes, doctors. It is amazing, and shows how adamant the vaccine salesmenmedical bureaucrats are, that they’re willing to dump nurses, a crucial resource. But they really don’t want doctors rebelling and speaking up about their misgivings about the vaccine. This is also a class thing: They know they can get away—even with leftists— portraying all dissident healthcare workers up to nurses as “stupid”; doctors, not so much.\n\nSo I bet they will leave the doctors off the hook. Even if there’s a mandate on paper, it won’t be enforced. They will be allowed to grant themselves medical exemptions, but they’ll be hounded by licensing boards if they try to grant them to anyone else— anyone, that is, who’s not important. Does anybody doubt this?\n\nNot my interest, but those who are invested in electoral politics might consider the brilliant political framework they are creating:\n\nCandidate A: \"I'm going to throw you out of your job, school, and social life if you don't take the drug I order that won’t make you any less infectious and you think might harm you.\"\n\nWhat is A offering that'll overcome that? Good thing s/he is offering a fabulous program of healthcare, housing, and jobs to compensate for firing you. Ha.\n\nWho is going to be most motivated to vote? How many of those >70% of the black population fired or bullied into submission will be flocking to Candidate A rather than, at best, staying home?\n\nPerhaps you think that all these people will just fold and get jabbed—and of course most of them will, because they are wage slaves and the “science followers” are counting on that—and they’ll get over it. No lasting political cost. No big deal. Except for the rare ones who are harmed by the vaccines, and their family and friends. Except for anyone among the working class, including the 70% of the black population, who is not craven enough to say: “You forced me to sign that loyalty oath get that jab so I could eat, but I won’t hold that against you. I’ll make sure to vote for you next election.”\n\nIf you think this is going to help build a progressive political movement, if you don’t understand it’s going to further destroy any chance of that, you are kidding yourself. And you’re helping to accelerate the political disaster.\n\nBut don’t worry, you can blame the result on “the unvaccinated.”\n\nI hate to be so blunt. But I also hate to be put under house arrest. I hate that everyone will be subject to a regime of ubiquitous social control by the American capitalist-imperialist state, through its corporate-captured medical bureaucracy, that will extend to every activity, and will not end with, or be limited to, this one virus. I hate that so many people—especially leftists—have not thought for two serious seconds about that. I hate that so many people—especially leftists—are ready not just to accept, but promote this, and, with unmerited arrogance and condescension, attack and ridicule those who resist it.\n\nI wish it weren't such a dire choice we are facing, but it is. The net effect of a society divided between bubble people and continuously vaccinated people will be the weakening of the human immune system en masse. The net effect of an internal \"vaccine passport\" that controls all bodies, movement, and participation will be more control all around. There is no scientific, public health, or political justification for, or benefit from, this, and it will in fact work to destroy science, public health, and political life. It will mark an enormous failure of the radical/socialist left to fall for this.\n\nTherein lies the real danger to society.\n\nJim Kavanagh edits The Polemicist. Follow him on Twitter @ThePolemicist_.\n\n1 Including in statistics all cases from before vaccines were available, not counting single-jabbed or anyone fewer than 14 days jabbed as “vaccinated,” etc.\n\n2“natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant” Comparing SARS-CoV-2 natural immunity to vaccine-induced immunity: reinfections versus breakthrough infections,\n\n3 Another meta-analysis shows a global IFR of 0.68%, with a lower range of 0.17% and a highest estimate of 1.7%. The Oxford Centre for Evidence-Based Medicine estimates an IFR “somewhere between 0.1% and 0.35%.\"\n\n4 The Salk Institute press release on the study asserts that the wild spike protein they studied “behave[s] very differently” than the slightly modified and “safely encoded” version the vaccine induces your cells to produce. But the study the press release alludes to says nothing about this, and no evidence is given for the statement, Robert Malone specifically denies the spike protein in the vaccine was modified to enhance “safety”: “So, yes, they did make some modifications to the spike protein when they engineered it for putting it into these genetic vaccines. But they weren't designed specifically to make it more safe, they were designed to make it more immunogenic, a better immunogen.”\n\nDanger to Society: Against Vaccine Passports, Jim Kavanagh, Big Pharma, Mandates, The Polemicist\n\nThe views expressed herein are solely those of the author and may or may not reflect those of The Greanville Post. However, we do think they are important enough to be transmitted to a wider audience.\n\nIf you find the above useful, pass it on! Become an \"influence multiplier\"! \n\n The battle against the Big Lie killing the world will not be won by you just reading this article. It will be won when you pass it on to at least 2 other people, requesting they do the same.", "opengraph": {"site_name": "The Greanville Post", "title": "Danger to Society: Against Vaccine Passports | The Greanville Post", "description": "JIM KAVANAGH—I hate to be so blunt. But I also hate to be put under house arrest. I hate that everyone will be subject to a regime of ubiquitous social control by the American capitalist-imperialist state, through its corporate-captured medical bureaucracy, that will extend to every activity, and will not end with, or be limited to, this one virus. I hate that so many people—especially leftists—have not thought for two serious seconds about that. I hate that so many people—especially leftists—are ready not just to accept, but promote this, and, with unmerited arrogance and condescension, attack and ridicule those who resist it.", "url": "https://www.greanvillepost.com/2021/09/29/danger-to-society-against-vaccine-passports/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/04/covid-19-global-4951405.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical. <a href=\"https://t.co/d14kTPnCWk\">https://t.co/d14kTPnCWk</a></p> <p>— Martin Kulldorff (@MartinKulldorff) <a href=\"https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw\">August 27, 2021</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Heard the joke about the three guys that went into the bar?<br/> The first guy was unvaxxed but covid free and wasn’t allowed in. <br/> The second guy had natural immunity and was turned away. <br/> The third guy was vaxxed and was allowed in but he had covid and spread it to everyone else.</p> <p>— MikeUnleashed ???? (@CaccioppoliMike) <a href=\"https://twitter.com/CaccioppoliMike/status/1426667563761606657?ref_src=twsrc%5Etfw\">August 14, 2021</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">More truth in this 27-second clip than what most journalists who hate Julian Assange have brought to the public in their entire lifetimes combined.</p> <p>*That* is why they don't care if he rots in prison. He's a mirror constantly reminding them of what they claim to be but are not: <a href=\"https://t.co/qX34W4cNhS\">https://t.co/qX34W4cNhS</a></p> <p>— Glenn Greenwald (@ggreenwald) <a href=\"https://twitter.com/ggreenwald/status/1442165601934487589?ref_src=twsrc%5Etfw\">September 26, 2021</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">More truth in this 27-second clip than what most journalists who hate Julian Assange have brought to the public in their entire lifetimes combined.</p> <p>*That* is why they don't care if he rots in prison. He's a mirror constantly reminding them of what they claim to be but are not: <a href=\"https://t.co/qX34W4cNhS\">https://t.co/qX34W4cNhS</a></p> <p>— Glenn Greenwald (@ggreenwald) <a href=\"https://twitter.com/ggreenwald/status/1442165601934487589?ref_src=twsrc%5Etfw\">September 26, 2021</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p>What in the mother fucking on everything holy is this?! <a href=\"https://t.co/l8IKiEvyhs\">https://t.co/l8IKiEvyhs</a></p> <p>— Craig Pasta Jardula (@yopasta) <a href=\"https://twitter.com/yopasta/status/1443038439474020361?ref_src=twsrc%5Etfw\">September 29, 2021</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">With nearly the entire vulnerable population vaccinated in the UK, you would expect most of the reported deaths to come from the vaccinated population.</p> <p>What you might not expect is that total Covid deaths are up nearly 1000% compared to the same period last year. <a href=\"https://t.co/RWgu8qqKcc\">pic.twitter.com/RWgu8qqKcc</a></p> <p>— PLC (@Humble_Analysis) <a href=\"https://twitter.com/Humble_Analysis/status/1437802015803858953?ref_src=twsrc%5Etfw\">September 14, 2021</a></p></blockquote> "], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2017/12/disgustingcapitalismwhiteletterslogo5.jpg", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#more", "https://www.nytimes.com/2021/08/03/nyregion/nyc-vaccine-mandate.html", "https://www.nytimes.com/2021/09/09/us/politics/biden-mandates-vaccines.html", "https://childrenshealthdefense.org/defender/vaccine-mandates-segregation-discrimination-black-americans/?utm_source=salsa&eType=EmailBlastContent&eId=5c611af3-b4e4-4114-988f-7137a2749a72", "https://www.dispatch.com/story/news/local/2021/06/29/columbus-ohio-judge-richard-frye-mandates-covid-vaccine-some-probation-cases/7794381002/", "https://www.zerohedge.com/covid-19/chicago-judge-strips-mother-parental-rights-being-unvaccinated", "https://www.dailymail.co.uk/news/article-9860535/Bostons-acting-Mayor-Kim-Janey-compares-vaccine-passports-slave-papers-birtherism.html", "https://twitter.com/BGOnTheScene/status/1424778804506071042?s=20", "https://nypost.com/2021/08/27/biden-and-fauci-discuss-covid-19-booster-shots-every-5-months/", "https://www.cnbc.com/2021/06/09/fauci-blasts-preposterous-covid-conspiracies-accuses-critics-of-attacks-on-science.html", "https://www.amazon.com/questions-answered-answers-questioned-Richard/dp/B089CXCF9Z", "https://bigthink.com/words-of-wisdom/albert-einstein-rebel-scientist/", "https://www.nationalgeographic.com/science/article/evidence-mounts-that-people-with-breakthrough-infections-can-spread-delta-easily", "https://thehill.com/homenews/sunday-talk-shows/565831-fauci-amount-of-virus-in-breakthrough-delta-cases-almost-identical", "https://www.telegraph.co.uk/news/2021/08/19/double-jabbed-people-carry-levels-covid-unvaccinated/", "https://www.cnn.com/2021/08/05/health/us-coronavirus-thursday/index.html", "https://www.medrxiv.org/content/10.1101/2021.07.28.21261295v1", "https://t.co/d14kTPnCWk", "https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw", "https://fee.org/articles/harvard-epidemiologist-says-the-case-for-covid-vaccine-passports-was-just-demolished/", "https://www.sciencemag.org/news/2021/08/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-no-infection-parties", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_edn1", "https://www.science.org/news/2021/08/grim-warning-israel-vaccination-blunts-does-not-defeat-delta", "https://www.sciencemag.org/news/2021/08/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-no-infection-parties", "https://brownstone.org/articles/the-world-health-organization-oversold-the-vaccine-and-deprecated-natural-immunity/", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_edn2", "https://www.youtube.com/watch?v=ezKb_AFvU4g", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://www.sciencemag.org/news/2021/08/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-no-infection-parties", "https://twitter.com/CaccioppoliMike/status/1426667563761606657?ref_src=twsrc%5Etfw", "https://www.cnbc.com/2020/11/12/fauci-says-us-has-independent-spirit-but-now-is-the-time-to-do-what-youre-told.html", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/planning-scenarios.html", "https://www.who.int/bulletin/online_first/BLT.20.265892.pdf", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_edn3", "https://www.medrxiv.org/content/10.1101/2021.07.08.21260210v1.full-text", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7451213/", "https://onlinelibrary.wiley.com/doi/10.1111/ijcp.14466", "https://youtu.be/ZmZft4fXhQQ?list=PL8bqIfxnGnznu-FEJe48Y5suORT5byHwl", "https://www.nytimes.com/2020/08/29/health/coronavirus-testing.html?", "https://www.theatlantic.com/health/archive/2021/09/covid-hospitalization-numbers-can-be-misleading/620062/", "https://tennesseestar.com/2020/09/19/growing-research-indicates-many-covid-19-cases-might-not-be-infectious-at-all/?fbclid=IwAR23DHZBj-F_PKEFIsVsL4d_b6S37eJTg8A5xbx8RpTYUkIXPJfvO7wQOwI", "https://youtu.be/RpQ2h8GhaVQ", "https://youtu.be/oG4AE_0SJck", "https://youtu.be/qp0afdBUzis", "https://www.washingtonexaminer.com/news/investigation-finds-several-deaths-in-florida-county-wrongly-attributed-to-coronavirus", "https://www.freedomfoundation.com/washington/washington-health-officials-gunshot-victims-counted-as-covid-19-deaths/", "https://www.youtube.com/watch?v=XC23IPm6aE4", "https://youtu.be/ZJZxiNxYLpc", "https://www.youtube.com/watch?v=BNyAovuUxro", "https://childrenshealthdefense.org/defender/virologist-huge-price-covid-mass-vaccination/", "https://www.pbs.org/newshour/science/tthis-chicken-vaccine-makes-virus-dangerous", "https://www.sciencemag.org/news/2021/08/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-no-infection-parties", "https://brownstone.org/articles/the-world-health-organization-oversold-the-vaccine-and-deprecated-natural-immunity/", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://twitter.com/DavidLWindt/status/1387125710599360514?s=20", "https://www.quantamagazine.org/how-vaccines-can-drive-pathogens-to-evolve-20180510/", "https://www.nature.com/articles/414751a", "https://journals.plos.org/plosbiology/article/info:doi/10.1371/journal.pbio.1002198", "https://www.pbs.org/newshour/science/tthis-chicken-vaccine-makes-virus-dangerous", "https://www.sciencemag.org/news/2015/07/could-some-vaccines-make-diseases-more-deadly", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1", "https://news.yahoo.com/tracking-covid-19-variant-called-042213983.html", "https://anandamide.substack.com/p/directed-evolution?r=jhcie&utm_campaign=post&utm_medium=web&utm_source=copy", "https://boriquagato.substack.com/p/leaky-vaccines-super-spreads-and", "https://t.co/qX34W4cNhS", "https://twitter.com/ggreenwald/status/1442165601934487589?ref_src=twsrc%5Etfw", "https://www.modernatx.com/mrna-technology/mrna-platform-enabling-drug-discovery-development", "https://t.co/qX34W4cNhS", "https://twitter.com/ggreenwald/status/1442165601934487589?ref_src=twsrc%5Etfw", "https://t.co/l8IKiEvyhs", "https://twitter.com/yopasta/status/1443038439474020361?ref_src=twsrc%5Etfw", "https://www.youtube.com/watch?v=_d8PNlXHJ48", "https://theconversation.com/amp/declaring-vaccine-hesitancy-one-of-the-ten-biggest-health-threats-in-2019-is-unhelpful-123628?__twitter_impression=true", "http://theconversation.com/vaccines-have-health-effects-beyond-protecting-against-target-diseases-106383", "http://www.counterpunch.org/2014/10/10/the-origins-of-the-ebola-crisis/", "https://www.theguardian.com/society/2021/sep/03/uk-rules-out-covid-vaccinations-for-children", "https://www.jonathan-cook.net/blog/2021-09-04/vaccine-children-science/", "https://www.jonathan-cook.net/blog/2021-09-04/vaccine-children-science/", "https://www.walesonline.co.uk/news/uk-news/covid-vaccine-roll-out-12-21482755", "https://childrenshealthdefense.org/defender/vaccine-injuries-regulatory-agencies-hiding-covid-safety-data/", "https://www.openvaers.com/covid-data", "https://vaers.hhs.gov/data/dataguide.html", "https://www.thename.org/assets/docs/COVID-19%20PRESS%20RELEASE.pdf", "https://www.pilotonline.com/news/health/vp-nw-coronavirus-drene-keyes-vaccine-investigation-20210307-nejhppci45g6rongf6fbdrx7te-story.html", "https://www.medscape.com/viewarticle/956089#vp_1", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://gis.cdc.gov/grasp/COVIDNet/COVID19_3.html", "https://www.theguardian.com/world/2021/sep/10/boys-more-at-risk-from-pfizer-jab-side-effect-than-covid-suggests-study?fbclid=IwAR3BgHZwwFYGUgpkcN3mnV-oGxa3Y8ro9Zd_hC6DImO9W5mYIUusPhqkpyY", "https://childrenshealthdefense.org/defender/emily-jo-14-year-old-son-aiden-myocarditis-pfizer-vaccine/", "https://thegrayzone.com/2021/08/13/cdc-fda-women-covid-19-vaccines-menstrual-disruption/", "https://bsd.biomedcentral.com/articles/10.1186/s13293-020-00308-5", "https://www.wsj.com/articles/which-americans-are-least-willing-to-get-a-covid-19-vaccine-11612979857", "https://www.youtube.com/watch?v=42qGSrtkqxU", "https://thehill.com/homenews/506740-autopsies-of-covid-19-patients-show-blood-clots-in-multiple-organs-top-pathologist", "https://www.salk.edu/news-release/the-novel-coronavirus-spike-protein-plays-additional-key-role-in-illness/", "https://www.ahajournals.org/doi/10.1161/CIRCRESAHA.121.318902", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_edn4", "https://www.bhf.org.uk/what-we-do/news-from-the-bhf/news-archive/2021/august/covid-19-spike-protein-binds-to-and-changes-cells-in-the-heart", "https://www.lifesitenews.com/news/vaccine-researcher-admits-big-mistake-says-spike-protein-is-dangerous-toxin/", "https://www.lifesitenews.com/news/vaccine-researcher-admits-big-mistake-says-spike-protein-is-dangerous-toxin/", "https://www.docdroid.net/xq0Z8B0/pfizer-report-japanese-government-pdf", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab465/6279075", "https://beta.regulations.gov/document/FDA-2020-N-1898-0246", "https://youtu.be/DtkeRJZnCHs?list=PL8bqIfxnGnznu-FEJe48Y5suORT5byHwl", "https://www.nature.com/articles/s41579-020-00462-y#Sec11", "https://www.bitchute.com/video/A5wDhtDdYdVe/", "https://www.sciencedirect.com/science/article/pii/S1201971220307311", "https://twitter.com/RWMaloneMD/status/1421830766162583553", "https://pubmed.ncbi.nlm.nih.gov/33113270/", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00069-0/fulltext", "https://www.scivisionpub.com/pdfs/us-covid19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scientific--1811.pdf", "https://disq.us/url?url=https%3A%2F%2Fwww.medrxiv.org%2Fcontent%2Fmedrxiv%2Fearly%2F2021%2F07%2F28%2F2021.07.28.21261159%2FDC1%2Fembed%2Fmedia-1.pdf%3Fdownload%3Dtrue%3AhXO1d89_phuZwhvfok_waLlI4yM&cuid=5391416", "https://t.co/RWgu8qqKcc", "https://twitter.com/Humble_Analysis/status/1437802015803858953?ref_src=twsrc%5Etfw", "https://www.evernote.com/shard/s143/sh/d74bacc7-bbb9-40f9-9adb-a67984494a96/581550508d8c617b742fc999da03369d", "https://taibbi.substack.com/p/ivermectin-can-a-drug-be-right-wing", "https://time.com/5951001/gun-violence-public-health-crisis/", "https://www.law.cornell.edu/uscode/text/21/360bbb-3", "https://www.fhi360.org/sites/all/libraries/webpages/fhi-retc2/Resources/nuremburg_code.pdf", "http://portal.unesco.org/en/ev.php-URL_ID=31058&URL_DO=DO_TOPIC&URL_SECTION=201.html", "https://www.propublica.org/article/fda-repays-industry-by-rushing-risky-drugs-to-market?fbclid=IwAR3LlmyEZEMY43i2MoGtU__MT4OS3dvmBUyPMjjkrZw3rd8aefhJcuOIumA", "https://truthout.org/articles/former-fda-reviewer-speaks-out-about-intimidation-retaliation-and-marginalizing-of-safety/", "https://www.nytimes.com/2021/09/10/us/politics/biden-vaccines.html", "https://www.osha.gov/laws-regs/oshact/completeoshact", "https://jacobinmag.com/2020/04/new-orleans-coronavirus-crisis-health-care-privatization", "https://en.wikipedia.org/wiki/Ebola_virus_cases_in_the_United_States#cite_note-Choi2013-198", "https://www.npr.org/sections/thetwo-way/2014/10/26/359082611/christie-defends-quarantine-and-jabs-at-cdc-over-ebola", "https://www.usatoday.com/story/theoval/2014/10/26/obama-ebola-quarantine-samantha-power-anthony-fauci/17955781/", "https://www.npr.org/sections/thetwo-way/2014/10/26/359082611/christie-defends-quarantine-and-jabs-at-cdc-over-ebola", "https://www.usatoday.com/story/theoval/2014/10/26/obama-ebola-quarantine-samantha-power-anthony-fauci/17955781/", "https://www.politico.com/story/2014/10/rush-limbaugh-chris-christie-ebola-112229", "http://www.nbcnews.com/id/56315216", "http://www.thepolemicist.net/2014/11/ripley-was-right-ebola-science-and.html#more", "https://pubmed.ncbi.nlm.nih.gov/33789211/", "https://www.youtube.com/watch?v=iwPKnOhJRYg&t=2s", "https://www.cincinnati.com/story/news/2021/09/01/survey-shows-nurses-quit-over-uc-health-covid-19-vaccine-mandate/5680714001/", "https://www.wsj.com/amp/articles/big-truckers-say-vaccine-mandate-could-push-drivers-away-11631657882", "https://www.npr.org/2021/08/31/1033002694/chicago-school-bus-drivers-have-quit-in-droves-over-covid-vaccine-mandate", "https://www.foxnews.com/politics/biden-mandating-covid-vaccines-for-white-house", "https://greenwald.substack.com/p/the-masking-of-the-servant-class", "http://www.thepolemicist.net/", "https://twitter.com/ThePolemicist_", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_ednref1", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_ednref2", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_ednref3", "https://www.ijidonline.com/article/S1201-9712(20)32180-9/fulltext", "https://www.cebm.net/covid-19/global-covid-19-case-fatality-rates/", "http://www.thepolemicist.net/2021/09/danger-to-society-against-vaccine.html#_ednref4", "https://www.youtube.com/watch?v=iwPKnOhJRYg&t=2s", "https://www.greanvillepost.com/wp-content/uploads/2019/08/TGP-DONATE-QR-Code-2.jpg", "https://www.greanvillepost.com/wp-content/uploads/2019/08/Screen-Shot-2019-08-20-at-4.06.17-PM.png"], "authors": [], "publish_date": "September 29, 2021"}