{"result_id": "295036", "URL": "https://www.greanvillepost.com/?print=print-search", "timestamp": "2023-04-25 17:23:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/?print=print-search", "encoding": null}, "image": null, "domain": "www.greanvillepost.com", "title": "Garland Nixon Interview: An Objective Look at U.S. Foreign Policy - The Greanville Post", "cleaned_text": "Such hypocrisy is damning not because hypocrisy itself is a particularly terrible thing, but because it shows that the US does not actually value press freedoms or free speech; it only pretends to in order to advance its own foreign policy objectives. It only cares about these freedoms insofar as it can rhetorically bludgeon governments it dislikes for not having them.\n\nSo it turns out that after the Hunter Biden laptop leak, Tony Blinken contacted his CIA buddy Mike Morell to make it go away, and Morell has now admitted to cooking up the bogus “Russian disinfo” letter from 51 US intelligence insiders to “help Vice President Biden… because I wanted him to win the election.”\n\nObama’s acting CIA director just coolly admitting that he used his intelligence connections to orchestrate a psyop to change the outcome of a presidential election completely invalidates anything the US government does under the banner of fighting “election interference”. Keep this glaring hypocrisy in mind as the US government continues churning out indictments and ramping up authoritarian measures in the name of fighting “disinformation” and protecting American “democracy”.\n\nStill stuns me that the global north is full of fully grown adults who sincerely believe Putin invaded Ukraine completely unprovoked, solely because he is evil and hates freedom, and that the US is defending Ukraine because it wants to protect freedom and democracy from tyrants.\n\nThe Democratic Party is what the natural, healthy human impulse to promote civil rights and economic justice looks like after you filter it through the most powerful propaganda machine that has ever existed and put it in charge of an empire that is fueled by human suffering.\n\nThe death of the 2016 Bernie Sanders campaign marked the end of any meaningful push toward economic justice in the US. Ever since then all political oxygen has gone into ramping up culture war hostilities that won’t put a single cent into any struggling American’s bank account.\n\nSome days I hate Republicans more than Democrats because while Democrats facilitate all the most murderous and destructive tendencies of the most powerful government on earth, Republicans do exactly the same thing while pretending they’re a persecuted and disempowered group.\n\nDon’t be a pro bono Pentagon propagandist. If you oppose the empire, don’t preface everything you say about China, Russia or other empire-targeted governments with “Of course their regime is evil and tyrannical, but”. Those messages are already being amplified by society’s most influential voices, and they get paid a lot for it. Don’t do their job for free.\n\nIndie media who spend a lot of time sniping at other indie media aren’t in it to fight the power or make the world a better place, they’re in it to build a brand. If you’re serious about this shit you keep your crosshairs on the top of governmental, political and media power.\n\nThis is the dystopia you were warned about. A mind-controlled populace thinking, speaking, shopping, moving and voting in accordance with the will of the powerful. All that’s left now is to secure the few dissidents on the fringes and keep bolstering the mind control matrix.\n\nThis doesn’t mean it’s hopeless, it just means we’ve got to acknowledge reality and start working from where we’re at. The biggest obstacle to real freedom is the belief that we already have it.\n\nIt’s important to watch out for red flags in the early stages of a new relationship, because if you don’t see any it means they’re probably not a communist and are therefore bad in bed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "314", "embed_code": "<iframe src=\"//www.youtube.com/embed/XqhUZ_NYCn4\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/XqhUZ_NYCn4"}], "links": ["https://soundcloud.com/going_rogue", "https://soundcloud.com/going_rogue/the-empire-of-hypocrisy", "https://www.theguardian.com/world/2023/mar/31/evan-gershkovich-let-him-go-joe-biden-calls-on-russia-to-release-us-journalist", "https://caitlinjohnstone.com/2021/12/16/the-assange-case-explained-simply/", "https://www.youtube.com/watch?v=tWNh03Ma1SA", "https://consortiumnews.com/2023/04/20/caitlin-johnstone-biden-doj-indicts-four-americans-for-weaponized-free-speech/", "https://twitter.com/caitoz/status/1648818685644247041", "https://www.youtube.com/watch?v=FXy-yKHD4Ys", "https://nypost.com/2023/04/20/biden-campaign-pushed-spies-to-write-false-hunter-laptop-letter/", "https://www.politico.com/news/2020/10/19/hunter-biden-story-russian-disinfo-430276", "https://caitlinjohnstone.com/2022/12/11/the-biggest-obstacle-to-real-freedom-is-the-belief-that-we-already-have-it/"], "authors": [], "publish_date": null}