{"result_id": "295007", "URL": "https://www.greanvillepost.com/2023/01/31/secretive-british-intelligence-units-censor-government-critics-by-labeling-them-misinformation/", "timestamp": "2023-04-25 17:22:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2023/01/31/secretive-british-intelligence-units-censor-government-critics-by-labeling-them-misinformation/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Secretive British Intelligence Units Censor Government Critics By Labeling Them “Misinformation”", "cleaned_text": "Since the pandemic’s beginning in early 2020, an increasing number of online discussions have been shut down by social media companies—labeled disinformation or “conspiracy theory”, although how these companies determine the truth remains a black box. In many cases, social media companies got it wrong and censored information as false, when it was actually true: natural immunity does protect against the virus, COVID-19 vaccines never stopped transmission, and evidence shows that the pandemic might have started from a lab accident in Wuhan China.\n\nBut it’s now becoming clear that it was governments that were working behind the scenes to shut down public debate, communicating secretly with social media companies and urging them to censor views that criticized government policy. In one example, a Facebook fact checker with a long history of getting their facts wrong labeled as “misleading” an investigation I wrote about problems with Pfizer’s clinical trial for the COVID-19 vaccine. We recently learned, from internal White House emails, that this fact check happened after Facebook had struck a deal with the Biden administration to attack “true information” that ran counter to the administration’s own vaccine policies.\n\nThe same government intrusion into social media companies is also happening in the UK, according to a new report Big Brother Watch released over the weekend: “Ministry of Truth: the secretive government units spying on your speech.” Referencing internal government documents, the report documents secretive Whitehall units that have been monitoring online critics of government policies—including MPs, academics, journalists, human rights campaigners and the public—all under the guise of combatting “misinformation.”\n\nBig Brother Watch is a UK civil liberties group that works to defend privacy and roll back the growing surveillance state. To discuss their new report, I caught up with Silkie Carlo, the group’s director.\n\n“During the pandemic, you can listen to people's personal experiences, and to the best medical academic at Oxford,” Carlo explained. “But this is happening through a small number of social media platforms that are in bed with the government which has accumulated secretive resources to control those platforms, beyond the limits of the law.”\n\nSpeaking with me from Big Brother Watch’s office in Westminster, London, Carlo noted that labeling some speech as “misinformation” has become a convenient vehicle for the British government to investigate and denigrate views that are critical of government policies. This interview has been condensed and edited for clarity\n\nTHACKER: Your report goes into different groups within different parts of the British government. Can you explain who these groups are and what they do?\n\nCARLO: Kind of at the center of all of is this Counter Disinformation Unit which sits within the Department for Digital Culture, Media and Sport. It was seen for many years as a semi-serious department that deals with things like Olympics, national sports, the media and so on. When they added in the digital aspect, it's kind of grown in muscle as it's got this disinformation function. It's involved in intelligence style activities.\n\nThe other one that we look at quite closely is the Rapid Response Unit, which sits in the Cabinet Office. The Cabinet Office, it's a central government department that works across government business.\n\nAnd then you've got RICU—Research Intelligence Communication Unit, which is in the Home Office and I suppose is like America’s Department of Homeland Security. It deals with domestic security and law enforcement, immigration, and those kind of things.\n\nTHACKER: I’m looking at the CDU or Counter Disinformation Unit and it's new, came out in March of 2020 to crack down on false coronavirus information online.\n\nCARLO: It was put up actually in the 2019 election period, but then stood up again in March 2020 in its current form, and they've got no intention of closing it.\n\nTHACKER: You report how even government ministers have tried to figure out what this unit does, and they won’t be told anything—budgets and staffing levels. And the CDU claims they can’t tell because there will be “malign actors” that will gain insight into what they.\n\nAnd because of this claim, your government leaders can’t ask what they do.\n\nCARLO: Members of Parliament have put forward these questions, and the Counter Disinformation Unit won't answer anything. Won't tell us about staff or resources, won't disclose any communications they've had with tech companies.\n\nThis is ostensibly a unit that is looking at domestic communications, so we're not talking necessarily about the kind of stuff that the intelligence agencies do with disinformation from overseas.\n\nThey publish absolutely nothing about what they do other than press releases.\n\nTHACKER: Why are your members of Parliament not upset about this? And when they say they can’t release anything because of “malign actors” do they mean people living in England? Because those are the people who pay taxes that support this government unit.\n\nCARLO: That's certainly my reading. This level of opacity and evasiveness on the parliamentary questions is unusual. It has concerned a few members of Parliament.\n\nBut the other thing, with the nature of the conversation about disinformation, we actually have a lot of members of parliament who have been calling for these units to do more and more, without knowing what it is that they actually really do.\n\nThey ask if these units are doing enough monitoring and censorship. And I think that's a sign of the state of the conversation around free speech.\n\nTHACKER: It’s almost a weird feedback loop, in which they report that they are handling all kinds of misinformation—but we’re not really told what this “misinformation” is—and this leads to a call for more money and power so they can deal more with misinformation.\n\nEven though we don't know what they're doing.\n\nCARLO: Exactly. There's no way that this can be functioning optimally in such a vacuum of oversight, accountability and transparency. They've spent millions on these artificial intelligence contracts to monitor disinformation, one of which went to a company that's got links to government ministers.\n\nTHACKER: One report I’m looking at is titled “Vaccine Misinformation, Disinformation Narratives in an Engagement.” It's so funny when you run these words together for a report.\n\nThe title starts off with “let me tell you about misinformation and disinformation.” They’re making a case that the report is about people speaking up about vaccines that is factually inaccurate. But then they jump into the “narratives” about the vaccines and people’s “engagement” with these narratives online.\n\nSo this makes me wonder: Is it really about factual information—misinformation—about vaccines, or is it about the narratives—the types of stories that are being told about these vaccines? Because people can put up a story that is factually accurate, with no misinformation, but the censors just don’t like the story—the narrative. Or it can get shared a lot and have high “engagement” and make the government look bad.\n\nThe Daily Mail ran a piece on the introduction of compulsory jabs and the CDU unit starts to track this, which individuals were sharing the article, commenting on their perceived attitudes towards the vaccines.\n\nWhy is the government worrying about what people are reading from a public newspaper? It's kind of scary that they’re doing that. Is the next step to reach in to the newspapers and tell them what they can and cannot write? Because that's what it seems like the next step is.\n\nCARLO: That's so true. But also, yes, that is the next step, because that's exactly what they did. They put out a rebuttal because they were concerned that the Mail piece was going to affect compliance.\n\nTHACKER: So you have a newspaper that’s writing a piece discussing or criticizing a government policy, and the government tracks public response and then goes after the news story. In this case, it's vaccines. But it could also be about a war, immigration policy, spending for agriculture, whatever. That's kind of crazy.\n\nCARLO: It most certainly is. A campaign group, Freedom from Torture, tweeted a video of a Holocaust survivor showing up in person and challenging the Home Secretary about dehumanizing language she had used around migration. And the Home Office put out a rebuttal tweet saying that the video clip of the Home Secretary had been heavily edited and was misleading.\n\nAnd the Home Office used this “disinformation” style language in their complaint, saying that they had asked the group to take it down. But if the clip of the Home Secretary was misleading, why didn’t they ask the group to post the whole video?\n\nTHACKER: Right. If it was edited improperly, post the whole piece and let people decide.\n\nCARLO: The group then posted the whole video, rather than take it down. And it didn't misrepresent what the Home Secretary had said in the slightest.\n\nTHACKER: They highlighted parts of the Secretary’s speech that were most interesting, like as always happens in journalism. It makes me think what the government doesn’t really like is journalism.\n\nCARLO: Our report goes into “disinformation” and policies around COVID. But this architecture is going to be used on immigration, on environment, on all of the big things that the government is challenged about.\n\nTHACKER: You document occasions where the government gives misinformation about what they’re doing on misinformation. There's mission creep into doing the things that the government previously denied that they were doing.\n\nYou have the digital minister saying that the job, the job of the Counter Disinformation Unit was to work with social media firms to get bad information taken down, and sometimes the ministers have engaged directly with the media. But we learn later that this happens daily.\n\nIt's not on random occasions, or sometimes, as was first explained. It's happening constantly that they take things down.\n\nCARLO: Absolutely, routine part of government business. It was made to sound like this is some sort of like workshop, that happened at one time. But it's the government telling corporations to silence citizens extrajudicially. And it's all secret. They won't even tell us how many times that they've asked social media companies to do this.\n\nTHACKER: You discovered that this multiple units were looking at people who were questioning lockdown models. It's not true or misinformation or disinformation whether lockdowns work or not. It's a public policy discussion about how to limit virus transmission.\n\nIt’s not true or false science. But they're using this misinformation, disinformation model to enforce policies that should be discussed and debated.\n\nCARLO: But even with science, there things that are facts until they're not. It's a constant process of discovery. Things became so dogmatic over the past couple of years, like “follow the science.” As if there's some kind of like fossilized version of truth, especially when this process began soon into the pandemic, and we were lost to a large degree.\n\nExperts have come up in our report because they were monitored and recorded for criticizing government policies, when they were precisely the people that should be part of the public discussion. To exclude them and try to control the public discussion shows there's no interest in actually in science or in having a fact-based debate.\n\nTHACKER: Even Conservative Party MPs were looked at, elected members of the party in power. Even they are having their activities surveilled. No one is really safe from this.\n\nThese units are looking in every corner to see who might become a threat to government policy.\n\nCARLO: This includes former ministers as well. You’re talking about some of the most senior people in the party having these reports written about them, by bureaucrats, that we don't know who they are. We don't know how many people are working in government creating records on what people are doing.\n\nTHACKER: The Department for Digital Culture, Media and Sport began examining a tweet by a radio reporter named Ms. Hartley-Brewer.\n\nCARLO: She's a very well-known journalist and broadcaster. She's frequently a guest on some of the flagship political shows over here, on the BBC.\n\nTHACKER: They start looking at this tweet, and all she tweeted was factual information but that was critical of the government. And this contractor for the government named Logically reported that tweet to the government.\n\nAll Hartley-Brewer had done was sharing in a tweet that a listener had suffered during the lockdown.\n\nWhat is this about? She wasn’t putting out misinformation. They’re not tracking misinformation, they’re tracking narratives and stories being told that are critical of government policy. Isn't that what's really going on?\n\nCARLO: That's exactly what's going on. In our report, we don’t look at instances where somebody has spread misinformation. There's not a single case of it. We found reams and reams of content that was being collected and analyzed because it was unflattering to the government or disagreed with policies.\n\nIt's a convenient thing about “misinformation.” It’s become this blank check to investigate anything, and for the government to exert more power over information.\n\nTHACKER: In another example, Ms. Hartley-Brewer was flagged when she shared the UK's own numbers on cancer deaths. This was at a time when cancer charities were flagging the negative impact of coronavirus policies on cancer treatment.\n\nThe government is scared of people sharing its own factual information.\n\nCARLO: Absolutely. They recorded one of my tweets where I was correcting a government misinformation about the so-called hugging ban. I just posted that there never actually was a hugging ban. Because there wasn't.\n\nSo this so-called misinformation unit is actually flagging people for noticing their own misinformation. There was no such thing as a hugging ban.\n\nIt was an absolute fiction. But the government press released this, and the media lapped it up. Disgusting, really.\n\nThe BBC was putting out videos of how to hug people safely now that we're allowed to hug again. It was one of the most bizarre moments of the whole pandemic, with the media just following along.\n\nTHACKER: This group Logically is very interesting. You point out in your report that they are a contractor to the British government to find misinformation. I found a press release that Logically hired a senior official at the Poynter Institute as their vice president of fact checking. First off, that’s a bizarre title: vice president of fact checking. Second, I always wondered about the ties between Poynter, which is a journalism group, and these hired gun fact checkers.\n\nThere seems to be no wall between journalism and Big Fact Check. What are the ties between Poynter and Logically, Poynter and government intelligence?\n\nLogically also hired a former Department of Homeland Security official as vice president of strategic operations. If Logically is hiring US intelligence officials, but is a contractor to the British government … which government are they serving?\n\nLogically has also announced a new partnership with Facebook and works with TikTok, which the US government just banned from federal devices of security concerns and the company’s links to Chinese intelligence.\n\nSo what is Logically? Who do they serve? Do they work on behalf of journalists? Do they work on behalf of US and British intelligence services? Do they serve the Chinese fascist government? Or do they work on behalf of social media corporations?\n\nAnd why aren’t journalists asking questions about this?\n\nCARLO: I guess they're just working for whoever's stupid enough to give them money to do what they do. From what we can see, the product they sell is terrible. They're just scouring keywords on Twitter then saying that something might have breached terms of service, when a lot of what they identified actually didn’t.\n\nThey're getting paid millions of pounds for this.\n\nTHACKER: Is there no one inside your government who’s saying, “Hey, we're hiring this contractor investigating our own politicians, and they’ve got ties to other governments and multinational corporations. Should we do a background search to see who they're really working for?”\n\nCARLO: I wonder if the UK government contract is what made them more marketable, so that they’re doing extra contracts on the back of that. I’d like to know how they got that government contract. Who did they know?\n\nTHACKER: You also have a whistleblower that you give the name “AB.”\n\nCARLO: That's the whistleblower who works in the 77th Brigade. We can’t say much about this person, for obvious reasons.\n\nTHACKER: This is an intelligence unit in the British military?\n\nCARLO: It's been described as an information warfare machine. Essentially, it’s involved in information operations and claimed that was always directed overseas. Anyone concerned about them acting domestically would obviously be a conspiracy theorist.\n\nTHACKER: Then this whistleblower tells you that the conspiracy is that they actually were spying on British citizens at times.\n\nCARLO: Yes. It wasn't directed domestically, but … First, the whole idea that it was “elite” is a bit of a joke. They were poorly resourced, poorly trained and they didn't have clearance to be doing surveillance.\n\nYou can read his testimony. He said that if there were foreign disinformation—which he strongly suspects there were—they had absolutely no chance of surfacing it because they didn't have the capabilities. They were doing was these generalized searches, and in the English language.\n\nThis also means there were no barriers stopping them from spying on Brits.\n\nTHACKER: There’s two things going on here. First off, they were inadvertently spying on British citizens. And then second, they were providing zero quality work for their mission, which was defeating disinformation from foreign governments.\n\nCARLO: I think that's the issue with all of these units. The reason they've enjoyed political support is that politicians have kind of made up in their own heads what they're doing. Partly because of media coverage of these topics, people have imagined about all nefarious cells of actors promoting misinformation. And that this even happens domestically\n\nThese units shouldn't be wasting time recording what the government's own senior members of parliament are saying about highly controversial policies. That’s clearly a misdirection of resources.\n\nTHACKER: You note that technology was once thought to allow more open discourse. To allow more voice and greater democracy. Instead, we’re seeing these social media platforms constricting speech. The internet gives the possibility of the greatest democratization of information in the history of humankind, and the greatest control of information and speech.\n\nCARLO: My fear is that, yeah, what is supposed to be a completely open forum where people can speak to power, speak to each other like never before … During the pandemic, you can listen to people's personal experiences, and to the best medical academic at Oxford.\n\nBut this is happening through a small number of platforms that are in bed with the government which has accumulated secretive resources to control those platforms, beyond the limits of the law.\n\nWe accept limitations around freedom of speech insofar as it promotes human rights and protects human rights. But the types of censorship happening go way beyond the law, because it’s lawful speech; it's stuff criticizing the government.\n\nUltimately these platforms that were supposed to offer a space of freedom, are often an extension of government control, influencing what people are able to read, see and hear—and thus think. Even worse, we may not even always realize it.", "opengraph": {"site_name": "The Greanville Post", "title": "Secretive British Intelligence Units Censor Government Critics By Labeling Them “Misinformation” | The Greanville Post", "description": "PAUL THACKER—Since the pandemic’s beginning in early 2020, an increasing number of online discussions have been shut down by social media companies—labeled disinformation or “conspiracy theory”, although how these companies determine the truth remains a black box. In many cases, social media companies got it wrong and censored information as false, when it was actually true: natural immunity does protect against the virus, COVID-19 vaccines never stopped transmission, and evidence shows that the pandemic might have started from a lab accident in Wuhan China.", "url": "https://www.greanvillepost.com/2023/01/31/secretive-british-intelligence-units-censor-government-critics-by-labeling-them-misinformation/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2023/01/https3A2F2Fsubstack-post-media.s3.amazonaws.com2Fpublic2Fimages2Fa6eb8d35-9fc8-4fbd-bffa-31b8d1485cee_836x594.jpeg", "article:section": "BOUGHT POLITICIANS & PHONIES", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/374/bmj.n2101", "https://www.bmj.com/content/374/bmj.n2101", "https://www.bmj.com/content/374/bmj.n2101", "https://disinformationchronicle.substack.com/p/bbc-should-step-aside-and-allow-the", "https://disinformationchronicle.substack.com/p/bbc-should-step-aside-and-allow-the", "https://disinformationchronicle.substack.com/p/bbc-should-step-aside-and-allow-the", "https://disinformationchronicle.substack.com/p/fact-check-true-yes-fauci-funded", "https://disinformationchronicle.substack.com/p/fact-check-true-yes-fauci-funded", "https://disinformationchronicle.substack.com/p/fact-check-true-yes-fauci-funded", "https://disinformationchronicle.substack.com/p/new-emails-biden-white-house-behind", "https://disinformationchronicle.substack.com/p/new-emails-biden-white-house-behind", "https://bigbrotherwatch.org.uk/about/", "https://bigbrotherwatch.org.uk/campaigns/ministry-of-truth/", "https://bigbrotherwatch.org.uk/team/", "https://twitter.com/FreefromTorture/status/1614172335921303554?s=20&t=00p2gnAyCuBJlZO_Q9fFYA", "https://twitter.com/ukhomeoffice/status/1614281821692338177?s=20&t=00p2gnAyCuBJlZO_Q9fFYA", "https://www.youtube.com/watch?v=mO5bSZ8CuuY", "https://twitter.com/silkiecarlo/status/1619664999504568320?s=20&t=00p2gnAyCuBJlZO_Q9fFYA", "https://www.logically.ai/press/logically-confirms-new-vp-fact-checking-baybars-%C3%B6rsek", "https://www.logically.ai/press/senior-dhs-official-and-former-fbi-executive-brian-murphy-joins-logically", "https://www.logically.ai/press/logically-announces-uk-fact-checking-partnership-with-facebook", "https://newsroom.tiktok.com/en-gb/new-prompts-to-help-people-consider-before-they-share-uk", "https://www.cfr.org/in-brief/us-government-banned-tiktok-federal-devices-whats-next", "https://disinformationchronicle.substack.com/p/secretive-british-intelligence-units/comments"], "authors": [], "publish_date": "January 31, 2023"}