{"result_id": "295043", "URL": "https://www.greanvillepost.com/2017/05/03/chronic-fatigue-syndromes-pots-and-the-dangers-of-aluminum-adjuvanted-vaccines-like-gardisil/", "timestamp": "2023-04-25 17:23:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2017/05/03/chronic-fatigue-syndromes-pots-and-the-dangers-of-aluminum-adjuvanted-vaccines-like-gardisil/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Chronic Fatigue Syndromes, POTS and the Dangers of Aluminum-adjuvanted Vaccines like Gardisil", "cleaned_text": "BE SURE TO PASS OUR ARTICLES ON TO KIN, FRIENDS AND COLLEAGUES\n\n“No vaccine manufacturer shall be liable…for damages arising from a vaccine-related injury or death.” – President Ronald Reagan, as he signed The National Childhood Vaccine Injury Act (NCVIA) of 1986, absolving drug companies from all medico-legal liability when children die, are injured or are disabled from vaccine injuries, thus reversing many of the intentions of the original legislation establishing the FDA\n\n“The human immune system is divided into two major classes: 1) Cellular Immunity,(for which injected vaccines do absolutely nothing, except to weaken it) located in the mucous membranes of the gastrointestinal and respiratory tracts and their respective lymph nodes and 2) Humoral Immunity, with production of antigen-specific antibodies by plasma cells in the bone marrow. For eons of time the mucous membranes of the gastrointestinal and respiratory tracts have been the primary sites of infectious microbe entry into the body so that, of necessity, mucosal/cellular immunity has evolved as the primary defense system, with humoral immunity serving a secondary or backup role…Vaccines are reversing these roles, attempting to substitute vaccine-induced humoral immunity for the far more efficient mucosal immunity, the latter in turn undergoing a process of “atrophy of disuse” as a result of this role-switching.” – Harold Buttram, MD\n\n“In the field of chemical toxicology it is universally recognized that combinations of toxins may bring exponential increases of toxicity; ie, a combination of two chemicals may bring a 10-fold increase in toxicity, three chemicals 100-fold increases. This same principle almost certainly applies to the immunosuppressive effects of viral vaccines when administered in combination, as with the MMR vaccine, among which the measles vaccine is (known to be) exceptionally immunosuppresive.” – Harold Buttram, MD\n\n“…the NIH (National Institutes of Health) is incapable of conducting conflict-free research. …it is clear that the system managing our vaccine program is corrupt beyond repair and needs a complete overhaul.” – Lori Mellwain, National Autism Association board chair\n\n\"It is difficult to get a man to understand something, when his salary depends upon his not understanding it!\" – Upton Sinclair, whose 1903 novel “Jungle” led to President Theodore Roosevelt’s pushing through the Pure Food and Drug Act of 1906.\n\nLast year there was an article published in my local newspaper describing an outbreak of a syndrome afflicting a group of young women. The syndrome was eventually labeled by the Mayo Clinic as Postural Orthostatic Tachycardia Syndrome (POTS). As with most of the many iatrogenic illnesses (whose causes are drug-induced or are caused by physician-prescribed “treatments” such as vaccine administration), the medical establishment regards POTS as having “no known cause”.\n\nThe young women involved were students that had, according to the article, been ill for an unspecified number of months. The young women were underclasswomen in a local high school, where they had found each other and started a support group. At least two of them had had symptoms since age the early teens, the typical age at which the Centers for Disease Control and Prevention (CDC) and the American Academy of Pediatrics (AAP) mandate (for pre-sexually active girls) a series of three intramuscular, aluminum-containing inoculations using one of the two FDA-approved, so-called “anti-cervical cancer” vaccines (the Human Papilloma Virus [HPV] vaccines Gardasil and Cervarix).\n\nThe Big Pharma giant Merck (of Vioxx and MMR/mumps infamy) makes and markets Gardasil and the equally large Big Pharma giant GlaxoSmithKline (of Paxil and Wellbutrin infamy) makes and markets Cervarix. Gardasil contains 4 genetically-engineered human papilloma virus-like antigens in it and Cervarix contains 2. The two vaccines have been approved by the heavily conflicted FDA (corrupted by industry shills) for safety and efficacy and have been pushed by the equally heavily conflicted CDC and AAP. The vaccines are described in more detail in previous Duty to Warn columns (see the links below).\n\nThe young women had been sickened for months with symptoms that included (according to the newspaper article) dizziness, light-headedness, fainting, headaches, stomach pains, cramps, nausea, “brain fog”, flushing, purplish legs, reddened hands and numbing fatigue. The most frustrating symptom mentioned in the article was that of chronic fatigue.\n\nBecause I had been doing a lot of research on the American epidemic of vaccine-induced (and therefore iatrogenic) illnesses, I wondered if some of the women had received their series of aluminum-containing HPV shots – or perhaps may have received other vaccinations known to cause vaccine-injuries. Unfortunately I was unable to find out more specific clinical details, but the information given made me want to search the literature.\n\nEventually, I found out that some of the young women had eventually gone to the Mayo Clinic where they received a diagnosis of Postural Orthostatic Tachycardia Syndrome (“of unknown etiology”) - and therefore the girls were offered no cure or suggestions about prevention. And one can assume that they weren’t given any advice about avoiding receiving any toxic substance that could have triggered the illness. Read on.\n\nEven though the FDA approved the vaccine to (theoretically) prevent HPV-associated cancer of the uterine cervix, no one will ever be certain if any cancers will actually be prevented until 20 – 30 years from now, because that is how long cancer of the cervix takes to develop after exposure to the carcinogenic virus. And the clinical trial results presented to the FDA only lasted a few years! Nevertheless, the FDA approved the inoculants, and the CDC and AAP immediately started recommending the very expensive shots (up to $130 per shot, not including office visit charges!) for girls of middle school age before there is any sexual activity).\n\nMerck’s safety review group acknowledged a number of adverse events observed in the clinical trials of Gardasil, which physicians are supposed to inform patients or parents about before obtaining permission to inject the hazardous substance into the bodies of children.\n\n“local injection site reactions, syncope (fainting), dizziness, nausea, headaches, hypersensitivity reactions (such as rashes, hives, itching and anaphylaxis), Guillain-Barré syndrome (GBS), transverse myelitis, motor neuron disease, venous thromboembolic events (blood clots), pancreatitis, autoimmune disorders, pregnancy, and death.”\n\nThe website of the prestigious Mayo Clinic in Rochester, Minnesota, just like the websites of most other major clinics that benefit financially from aggressive over-vaccination agendas, mentions the following list of innocuous-sounding adverse effects from HPV inoculations:\n\n “may cause soreness at the injection site (the arm), headaches and low-grade fever. Sometimes dizziness or fainting occurs after the injection. Remaining seated for 15 minutes after the injection can reduce the risk of fainting. In addition, Cervarix might also cause nausea, vomiting, diarrhea or abdominal pain.”\n\nNote that the Mayo Clinic cleverly fails to mention any of the serious life-threatening adverse effects that were listed by the manufacturers, specifically not mentioning death or autoimmune disorders. The principle of informed consent is obviously being side-stepped - even by the Mayo Clinic.\n\nSoon after Gardasil was introduced into the CDC’s recommended pediatric vaccination schedule, the independent Vaccine Adverse Event Reporting System (VAERS) started reporting numerous adverse events related to the HPV injections, including fainting, pain at the injection site, headaches, nausea, fever, tonic-clonic (jerking) muscular movements and seizure-like activity. Fainting was particularly common after injections. The fainting spells sometimes caused serious injuries, such as head injuries.\n\nJust two years after Gardasil’s introduction into the US market, VAERS reported , more or less equally distributed after the first, second or third inoculation. The median interval from vaccination to death was 14.5 days.\n\n“autoimmune hemolytic anemia, idiopathic thrombocytopenic purpura, lymphadenopathy, pulmonary embolus, nausea, pancreatitis, vomiting, asthenia (weakness), chills, death, fatigue, malaise, autoimmune diseases, hypersensitivity reactions (including anaphylactic/anaphylactoid reactions, bronchospasm, and urticaria), arthralgia, myalgia, acute disseminated encephalomyelitis, dizziness, Guillain-Barré syndrome, headache, motor neuron disease, paralysis, seizures, syncope (sometimes resulting in falling with injury), transverse myelitis, and deep venous thrombosis.”\n\nAccording to the VAERS website, as of January 2015 there have been 220 HPV vaccine-related deaths, 1,283 chronically disabled patients, 3,945 hospital admissions, 12,305 admissions to emergency rooms, 595 abnormal Pap smears (including 262 cases of cervical dysplasia and 100 cases of cervical cancer!). Note that the FDA has previously admitted that as few as 1% of adverse reactions to drugs or vaccines are ever reported by patients or physicians so these numbers are likely to be falsely low. The real number of adverse events related to HPV could be as high as 100 times more that the reported statistics above!\n\nVaccine-related illnesses or deaths, just like many chronic illnesses from toxic exposures, can be delayed by months. Therefore it is likely that adverse reactions to any vaccine (or prescription drug, for that matter) may not be recognized by the patient or her doctor as being caused by the toxic substance, particularly the occurrence of a vaccine-induced chronic fatigue syndrome, autoimmune disorders or POTS.\n\nIt is also likely, since physicians are widely and thoroughly indoctrinated into the belief system that all vaccines are totally safe and totally effective, they would tend to be unwilling to admit to any vaccine-related adverse event.\n\nI end this article with some more quotes from vaccinology and immunology experts about the serious problems of America’s vaccine industry (and the studied lack of media attention to the truth about vaccines and iatrogenic illnesses) and then end with a few excerpts from some of the multitude of medical journal articles that support the assertions and warnings above.\n\nKnowledgeable and informed observers of Big Pharma’s tendency to habitually lie about the value of their newest blockbuster products are shocked at how the medical establishment has accepted these new and dangerous vaccines without much skepticism. Just claiming that Gardasil will prevent future cancers of the cervix is almost laughable - if it weren’t so serious.\n\nMy column on the absurdity of the medical profession mandating a series of routine HPV vaccinations to all adolescents on the untested and unproven theory that they will prevent cancer 20 – 30 years in the future, can be accessed at: http://duluthreader.com/articles/2015/04/15/5155_open_letter_to_eric_holder_regarding_the_big\n\nMy column about vaccine-induced injuries, including vaccine-induced chronic childhood illnesses, vaccine-induced autoimmune disorders, aluminum adjuvant toxicity and vaccine-induced mitochondrial toxicity can be accessed at: http://duluthreader.com/articles/2015/12/30/6472_a_look_back_at_some_of_my_2015_duty_to_warn\n\nAnd my column about the vaccine compensation program that is designed to compensate victims of vaccine-induced injury or death is at: https://www.transcend.org/tms/2016/03/duty-to-warn-big-pharmas-nefarious-control-of-health-care-and-the-vaccine-injury-compensation-program/\n\nBelow are some useful quotes and also abstracts from peer-reviewed medical journal articles that pertain to and support this discussion.\n\n“The autism epidemic is real, and excessive vaccinations are the cause.” – Dr Bernard Rimland\n\n“Completely unvaccinated children have less chronic disease and a lower risk of autism than\n\n“The soaring incidence of physical and mental illnesses among today’s children (may be) causally related to current childhood vaccine programs. Primary among these is the large-scale contamination of the measles, mumps, and influenza vaccines with retroviruses capable of engrafting their genetics into the DNA of childhood recipients. This is rendered more likely because of the cavalier disregard with which combinations of viral vaccines are now being administered, primarily involving the MMR vaccines…in spite of the toxicology principle that combinations of toxins may bring exponential (10-fold or 100-fold) increases in toxicity.” – Harold Buttram, MD\n\n\"The really sad thing is the amount of doctors I've spoken to who say to me, 'Del, I know that vaccines are causing autism, but I won't say it on camera because the pharmaceutical industry will destroy my career just like they did to Andy Wakefield.'\" -- Del Bigtree, Producer of \"Vaxxed: From Cover-up to Catastrophe\"\n\n“…our current results are consistent with the existing evidence on the toxicology and pharmacokinetics of Aluminum adjuvants which altogether strongly implicate these compounds as contributors to the rising prevalence of neurobehavioral disorders in children. Given that autism has devastating consequences in a life of a child, and that currently in the developed world over 1% of children suffer from some form of Autism Spectrum Disorder, it would seem wise to make efforts towards reducing infant exposure to aluminum from vaccines.“ — C A Shaw, PhD\n\n“There is a serious problem with vaccine safety. Vaccine aluminum adjuvant has adverse neurological effects, at dosages that are recommended by the US CDC. Vaccine critics are supported by the science. Parents refusing to vaccinate according to the recommended CDC schedule are supported by the science. Use aluminum-containing vaccines with great caution, or not at all.” – C. A. Shaw, PhD http://vaccinepapers.org/category/aluminum/\n\n“Aluminum is an experimentally demonstrated neurotoxin and the most commonly used vaccine adjuvant…research clearly shows that aluminum adjuvants have a potential to induce serious immunological disorders in humans. In particular, aluminum in adjuvant form carries a risk for autoimmunity, long-term brain inflammation and associated neurological complications and may thus have profound and widespread adverse health consequences.” -- From Tomljenovic and Shaw’s journal article “Aluminum Vaccine Adjuvants: Are They Safe?”\n\nPostural Orthostatic Tachycardia (POTS) with Chronic Fatigue After HPV Vaccination as Part of the \"ASIA Syndrome”\n\nWe report the case of a 14-year-old girl who developed postural orthostatic tachycardia syndrome (POTS) with chronic fatigue 2 months following Gardasil vaccination. The patient suffered from persistent headaches, dizziness, recurrent syncope, poor motor coordination, weakness, fatigue, myalgias, numbness, tachycardia, dyspnea, visual disturbances, phonophobia, cognitive impairment, insomnia, gastrointestinal disturbances, and a weight loss of 20 pounds.\n\nThe psychiatric evaluation ruled out the possibility that her symptoms were psychogenic or related to anxiety disorders. Furthermore, the patient tested positive for ANA (1:1280), lupus anticoagulant, and antiphospholipid.\n\nOn clinical examination she presented livedo reticularis and was diagnosed with Raynaud's syndrome. This case fulfills the criteria for the autoimmune/auto-inflammatory syndrome induced by adjuvants (ASIA).\n\nBecause human papillomavirus vaccination is universally recommended to teenagers and because POTS frequently results in long-term disabilities (as was the case in our patient), a thorough follow-up of patients who present with relevant complaints after vaccination is strongly recommended.\n\nAn adjuvant is a substance that enhances the antigen-specific immune response, induces the release of inflammatory cytokines…The immunological consequence of these actions is to stimulate the innate and adaptive immune response. The activation of the immune system by adjuvants, a desirable effect, could trigger manifestations of autoimmunity or autoimmune disease. Recently, a new syndrome was introduced, autoimmune/inflammatory syndrome induced by adjuvants (ASIA), that includes postvaccination phenomena, macrophagic myofasciitis, Gulf War syndrome and siliconosis. This syndrome is characterized by nonspecific and specific manifestations of autoimmune disease. The main substances associated with ASIA are squalene (Gulf War syndrome), aluminum hydroxide (postvaccination phenomena, macrophagic myofasciitis) and silicone with siliconosis.\n\nLong-term persistence of vaccine-derived aluminum hydroxide is associated with chronic cognitive dysfunction,\n\nMacrophagic myofasciitis (MMF) is an emerging condition, characterized by specific muscle lesions assessing long-term persistence of aluminum hydroxide within macrophages at the site of previous immunization. Affected patients mainly complain of arthromyalgias, chronic fatigue, and cognitive difficulties. We designed a comprehensive battery of neuropsychological tests to prospectively delineate MMF-associated cognitive dysfunction (MACD).\n\nCompared to control patients with arthritis and chronic pain, MMF patients had pronounced and specific cognitive impairment. MACD mainly affected (i) both visual and verbal memory; (ii) executive functions, including attention, working memory, and planning; and (iii) left ear extinction at dichotic listening test. Cognitive deficits did not correlate with pain, fatigue, depression, or disease duration. Pathophysiological mechanisms underlying MACD remain to be determined.\n\nIn conclusion, long-term persistence of vaccine-derived aluminum hydroxide within the body assessed by MMF is associated with cognitive dysfunction, not solely due to chronic pain, fatigue and depression.\n\nA role for the body burden of aluminium in vaccine-associated macrophagic myofasciitis (MMF) and chronic fatigue syndrome\n\nMacrophagic myofasciitis and chronic fatigue syndrome are severely disabling conditions which may be caused by adverse reactions to aluminium-containing adjuvants in vaccines. While a little is known of disease aetiology both conditions are characterised by an aberrant immune response, have a number of prominent symptoms in common and are coincident in many individuals. Herein, we have described a case of vaccine-associated chronic fatigue syndrome and macrophagic myofasciitis (MMF) in an individual demonstrating aluminium overload. This is the first report linking the latter with either of these two conditions and the possibility is considered that the coincident aluminium overload contributed significantly to the severity of these conditions in this individual. This case has highlighted potential dangers associated with aluminium-containing adjuvants and we have elucidated a possible mechanism whereby vaccination involving aluminium-containing adjuvants could trigger the cascade of immunological events which are associated with autoimmune conditions including chronic fatigue syndrome and macrophagic myofasciitis.", "opengraph": {"site_name": "The Greanville Post", "title": "Chronic Fatigue Syndromes, POTS and the Dangers of Aluminum-adjuvanted Vaccines like Gardisil | The Greanville Post", "description": "  Dateline– May 2, 2017 Why contributing to the Greanville Post is urgent and…", "url": "https://www.greanvillepost.com/2017/05/03/chronic-fatigue-syndromes-pots-and-the-dangers-of-aluminum-adjuvanted-vaccines-like-gardisil/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2017/05/gardasil.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["http://duluthreader.com/articles/2015/04/15/5155_open_letter_to_eric_holder_regarding_the_big", "http://duluthreader.com/articles/2015/12/30/6472_a_look_back_at_some_of_my_2015_duty_to_warn"], "authors": [], "publish_date": "May 3, 2017"}