{"result_id": "295031", "URL": "https://www.greanvillepost.com/2021/02/16/why-are-effective-and-inexpensive-chinese-and-russian-vaccines-unavailable-in-much-of-the-west/", "timestamp": "2023-04-25 17:22:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/02/16/why-are-effective-and-inexpensive-chinese-and-russian-vaccines-unavailable-in-much-of-the-west/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Why are Effective and Inexpensive Chinese and Russian Vaccines Unavailable in Much of the West?", "cleaned_text": "Help us break the corporate media monopoly before it kills us all. The global oligarchy depends on its disinformation machine to maintain its power. Now the malicious fog of Western propaganda has created an ocean of confusion in which even independent minds can drown. Please push back against this colossal apparatus of deception. Consider a donation today!\n\nHelp us break the corporate media monopoly before it kills us all. The global oligarchy depends on its disinformation machine to maintain its power. Now the malicious fog of Western propaganda has created an ocean of confusion in which even independent minds can drown. Please push back against this colossal apparatus of deception. Consider a donation today!\n\nIn 2016, I attended an information session about First Nations in Lax Kxeen (colonial designation Prince Rupert), [1] “BC.” During a break, I conversed with some fellow attendees. They expressed skepticism to colonial provincial authorities being behind the intentional spreading of smallpox among First Nations people [2] and that a vaccine was withheld from infected Indigenous individuals. The attendees insisted that there was no vaccine at that time for smallpox.\n\nYet, the English doctor Edward Jenner is celebrated for having discovered the smallpox vaccine in 1796. This is the predominant western account on the origin of the smallpox vaccination.\n\nIt is also recorded that inoculation against smallpox was already being practiced in Sichuan province by Taoist alchemists in the century CE. [3] The Chinese inoculators administered dead or attenuated smallpox collected from less virulent scabs, which were inserted into the nose on a plug of cotton. Inoculation may also have been practiced much earlier by the Chinese — some sources cite dates as early as 200 BCE.\n\nChina obviously has a historical background in strengthening the immune response of people. Yet, in the western media, one seldom reads or hears about the Chinese COVID-19 vaccines. Neither were we well informed about the effectiveness of the Russian COVID-19 vaccine — that was until recently [WARNING: this video, by the Canadian network CBC, carries the usual russophobic smears disseminated by all Western media], when some western nations have been coming up short on vaccine supplies. The Canadian government has been scrambling to meet the demand for vaccines since Pfizer shipments were held up. The focus of western state and corporate media seemed clearly on procuring supplies of the Pfizer (US), Moderna (US), and AstraZeneca (UK-Sweden) vaccines. This is despite effective, but less heralded, Russian and Chinese vaccines being available and at a more affordable price. South Korea’s Arirang News reported Russian test results that “its second COVID-19 vaccine is 100% effective.” CBC.ca found this success problematic; it depicted a political quandary in considering a Russian vaccine: “At first dismissed and ridiculed by Western countries, Russia’s Sputnik V vaccine has not only been rehabilitated; it’s emerging as a powerful tool of influence abroad for President Vladimir Putin.” France 24 concurred, hailing it as “a scientific and political victory for Vladimir Putin’s Russia.”\n\nThe Russian and Chinese vaccines have been embraced by a number of Latin American nations, including Argentina, Mexico, Venezuela and others.\n\n\n\n Mexico close to approving Sputnik V COVID-19 vaccine (Scoop: It is already approved and in distribution)\n\nAl Jazeera English Mexico's deputy health minister says the government must authorise the emergency use of Russia's Sputnik V COVID-19 vaccine within days. The country's COVID-19 death toll has crossed 150,000, which is the fourth-highest in the world. On Sunday, Mexico's president announced that he had tested positive for COVID-19, and was being treated for mild symptoms.\n\nIran is also receiving the Russian vaccine—\n\n\n\nIran starts COVID-19 vaccinations with Sputnik V\n\n \n\n Al Jazeera English\n• Iran is the country with the highest COVID-19 death toll in the Middle East. Nearly 1.5 million people have been infected with the coronavirus and almost 60,000 have died. On Tuesday, officials finally began their vaccination programme after importing the Russian Sputnik V vaccine last week.\n\nWould Canada refuse to consider securing vaccines from Russia to safeguard the health of Canadians to avoid granting Putin, derided by Canadian magazine Macleans as a “new Stalin,” a political victory? Why shouldn’t Russia be lauded for coming up first with a working and effective vaccine? What does it matter if the leader of that country receives recognition? Shouldn’t the national priority be obtaining the best vaccine to protect the health of citizens?\n\nMedical data aside, western mass media has, apparently, been effective in stirring up a distrust of COVID-19 vaccines from China and Russia in comparison to western vaccines, as revealed in a YouGov poll of almost 19,000 people worldwide.\n\nHungary has been mildly criticized for going its own way in ordering the Russian vaccine. Hungary’s foreign minister, Péter Szijjártó, had no qualms and defended Budapest’s decision to buy two million doses of Russia’s Sputnik V vaccine.\n\nThe Czech Republic is also considering following Hungary in using Russian and Chinese vaccines that are still pending approval by the European Union.\n\nThe World Health Organization (WHO) director-general Tedros Adhanom Ghebreyesusstrongly criticizedbig pharma for profiteering and vaccine inequalities. Adhanom charged that younger, healthier adults in wealthy countries were being prioritized for vaccination against COVID-19 before older people or health care workers in poorer countries and that markets were sought to maximize profitability.\n\nIn chapter VII of the e-book The 2020 Worldwide Corona Crisis: Destroying Civil Society, Engineered Economic Depression, Global Coup d’État and the “Great Reset” (December 2020, revised January 2021), professor Michel Chossudovsky writes:\n\nChossudovsky also questions the safety of the rushed testing and the need for a vaccine given that the WHO and the US Center for Disease Control and Prevention (CDC) both confirmed that Covid-19 is “similar to seasonal influenza.” [5]\n\nA report raised alarm about at least 36 people who developed a rare, lethal blood disorder, called thrombocytopenia, after receiving either of the two approved COVID-19 vaccines in the US. A Miami obstetrician, Gregory Michael, just 56, died of a brain hemorrhage just 16 days after receiving a Pfizer vaccination. His thrombocytopenia had caused his platelets to drop to virtually zero.\n\nA Johns Hopkins University expert on blood disorders, Jerry L. Spivak, who was uninvolved in Michael’s care, said that based on Michael’s wife’s description: “I think it is a medical certainty that the vaccine was related [to Michael’s death].”\n\nIn Israel, at least three people suffered Bell’s palsy, facial paralysis, after receiving the vaccine. Data from Pfizer and Moderna vaccine trials revealed seven COVID-19 participants had experienced Bell’s palsy in the weeks following vaccination.\n\nIn Norway, at least 23 people who received the Pfizer COVID-19 vaccine died. According to authorities, thirteen of the fatalities were associated to the vaccine’s side effects. In addition, 10 deaths shortly following vaccination were being probed in Germany.\n\nPfizer and Moderna use a novel vaccine based on mRNA. Following the deaths in Norway, Chinese health expertscalled for caution and the suspension of mRNA-based COVID-19 vaccines, especially for elderly people.\n\nRegarding the safety of COVID-19 vaccines, the CDC reported the administration of over 41 million doses of COVID-19 vaccines in the US from 14 December 2020 through 7 February 2021. During this time, the Vaccine Adverse Event Reporting System received 1,170 reports of death (0.003%) among people vaccinated for COVID-19. Based on the extremely low figure, the CDC advised people that “COVID-19 vaccines are safe and effective” and “to get a COVID-19 vaccine as soon as you are eligible.”\n\nYet, it seems some Europeans distrust their own government-approved Covid-19 vaccines. A black market has arisen; two doses of unapproved Chinese vaccines havereportedlysold for as high as 7,000 yuan (£800) — almost 20 times the reported usual price.\n\nVaccine makers, Sinopharm and Sinovac, cautioned the public not to buy the vaccines online.\n\nChinese leader Xi Jinping has been magnanimous with what could be an extremely profitable property. Said Xi, “China is willing to strengthen cooperation with other countries in the research and development, production, and distribution of vaccines,”\n\n“We will fulfill our commitments, offer help and support to other developing countries, and work hard to make vaccines a public good that citizens of all countries can use and can afford.”\n\nImagine that: making an in-demand product available as a “pubic good” instead of taking advantage of a seemingly dire situation to rake in huge profits. Africa, for one, is benefiting.\n\nBack in October 2020, Fortune.com proclaimed in its headline: “World’s vaccine testing ground deems Chinese COVID candidate ‘the safest, most promising.’” The tests conducted in Brazil were large, human trials of the COVID-19 vaccines that included Johnson & Johnson, Pfizer, AstraZeneca, and China’s Sinovac and Sinopharm.\n\nOn 3 February 2021, the peer-review medical journal, The Lancet, published a study by Wu et al. who spoke to the urgent need for a vaccine against COVID-19 for the elderly. Their study found that the Chinese CoronaVac, containing inactivated SARS-CoV-2, is safe and well tolerated by the elderly.\n\nJournalist Wei Ling Chua, who follows closely how events involving China are portrayed and perceived elsewhere, asked in an email on 12 February 2021:", "opengraph": {"site_name": "The Greanville Post", "title": "Why are Effective and Inexpensive Chinese and Russian Vaccines Unavailable in Much of the West? | The Greanville Post", "description": "The World Health Organization (WHO) director-general Tedros Adhanom Ghebreyesusstrongly criticizedbig pharma for profiteering and vaccine inequalities. Adhanom charged that younger, healthier adults in wealthy countries were being prioritized for vaccination against COVID-19 before older people or health care workers in poorer countries and that markets were sought to maximize profitability.", "url": "https://www.greanvillepost.com/2021/02/16/why-are-effective-and-inexpensive-chinese-and-russian-vaccines-unavailable-in-much-of-the-west/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-16-at-1.58.01-PM.png", "article:section": "CALLOUS CONTEMPT", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2016/01/Vaccines-Profits-1.jpg", "https://www.historyofvaccines.org/content/early-chinese-inoculation", "https://www.youtube.com/watch?v=wjP6os8lBdM", "https://www.ctvnews.ca/politics/feds-on-defensive-as-no-pfizer-vaccine-shipment-arriving-next-week-1.5273212", "https://www.youtube.com/watch?v=Do0PayqyeVc", "https://www.cbc.ca/news/world/russia-sputnik-lancet-1.5908369", "https://www.france24.com/en/video/20210203-the-sputnik-v-vaccine-a-scientific-and-political-win-for-russia", "https://www.youtube.com/channel/UCNye-wNBqNL5ZzHSJj3l8Bg", "https://www.youtube.com/channel/UCNye-wNBqNL5ZzHSJj3l8Bg", "https://www.youtube.com/channel/UCNye-wNBqNL5ZzHSJj3l8Bg", "https://www.macleans.ca/opinion/putin-is-the-new-stalin-heres-why-his-poisonous-gangland-oligarchy-will-prevail/", "https://www.reuters.com/article/us-health-coronavirus-vaccines-attitudes-idUSKBN29K16T", "https://www.youtube.com/watch?v=Pe0D8su7I3M", "https://www.reuters.com/article/us-health-coronavirus-czech/czechs-may-follow-hungary-in-using-vaccines-not-registered-in-eu-pm-idUSKBN2A51YZ", "https://www.rollingstone.com/politics/politics-features/big-pharma-covid-19-profits-1041185/", "https://www.9news.com.au/world/coronavirus-who-chief-tedros-lambasts-vaccine-profits-demands-elderly-go-first/ff63403a-3e54-4613-8ddc-2ae8f68692a9?ocid=edm-nine.com.au-ninedaily--210119&mktg_scr=edm-ninedaily", "https://www.globalresearch.ca/big-pharmas-covid-vaccine/5736952", "https://www.msn.com/en-au/health/medical/36-people-developed-rare-blood-disorder-after-covid-vaccination/ar-BB1dxAvo", "https://www.nytimes.com/2021/01/12/health/covid-vaccine-death.html", "https://www.rt.com/news/512736-israel-facial-paralysis-13-covid-vaccine/", "https://www.verywellhealth.com/bells-palsy-covid-19-5093172", "https://childrenshealthdefense.org/defender/china-health-experts-suspension-covid-vaccines-norway/", "https://www.globaltimes.cn/page/202101/1212915.shtml", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html#:%7E:text=Over%2041%20million%20doses%20of,received%20a%20COVI", "https://www.thetimes.co.uk/article/unapproved-vaccines-sold-for-800-on-black-market-kd9zmnbg9", "https://chinaafricaproject.com/2021/02/09/the-china-africa-vaccine-air-bridge-is-open/?utm_source=rss&utm_medium=rss&utm_campaign=the-china-africa-vaccine-air-bridge-is-open&ct=t%28EMAIL_CAMPAIGN_2_6_2021_13_13_COPY_01%29&goal=0_678a4a5d7b-d70c9f4a7e-360182996&mc_cid=d70c9f4a7e&mc_eid=515e16d63a", "https://fortune.com/2020/10/20/covid-vaccine-china-brazil-testing-ground-safest-most-promising-sinovac/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2820%2930987-7/fulltext#seccestitle80"], "authors": [], "publish_date": "February 16, 2021"}