{"result_id": "295003", "URL": "https://www.greanvillepost.com/2022/07/30/court-rejects-googles-attempt-to-dismiss-rumbles-antitrust-lawsuit-ensuring-vast-discovery/", "timestamp": "2023-04-25 17:22:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/07/30/court-rejects-googles-attempt-to-dismiss-rumbles-antitrust-lawsuit-ensuring-vast-discovery/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Court Rejects Google’s Attempt to Dismiss Rumble’s Antitrust Lawsuit, Ensuring Vast Discovery", "cleaned_text": "A federal district court in California on Friday denied Google's motion to dismiss a lawsuit alleging that the Silicon Valley giant is violating federal antitrust laws by preventing fair competition against its YouTube video platform. The lawsuit against Google, which has owned YouTube since its 2006 purchase for $1.65 billion, was brought in early 2021 by Rumble, the free speech competitor to YouTube. Its central claim is that Google's abuse of its monopolistic stranglehold on search engines to destroy all competitors to its various other platforms is illegal under the Sherman Antitrust Act of 1890, which makes it unlawful to “monopolize, or attempt to monopolize…any part of the trade or commerce among the several States, or with foreign nations.”\n\nIt is rare for antitrust suits against the four Big Tech corporate giants (Google, Facebook, Apple and Amazon) to avoid early motions to dismiss. Friday's decision against Google ensures that the suit now proceeds to the discovery stage, where Rumble will have the right to obtain from Google a broad and sweeping range of information about its practices, including internal documents on Google's algorithmic manipulation of its search engine and the onerous requirements it imposes on companies dependent upon its infrastructure to all but force customers to use YouTube.\n\nFounded in 2013, Rumble began experiencing explosive growth in the run-up to the 2020 election. Americans were encountering escalating and aggressive Big Tech censorship of political content as the election approached. Conservative politicians, followed by a wide range of heterodox voices on the right and left, began migrating by the millions away from Google's YouTube to Rumble, which has promised and provided far more permissive free speech rights. That was at the time when Google and other Big Tech platforms — at the urging of the Democratic-controlled Congress — began aggressively increasing its censorship of political video content on YouTube in the name of combatting “disinformation” and “hate speech.”\n\nThe explosive user growth which Rumble enjoyed in 2020 has continued to rapidly increase, as Big Tech generally, and Google specifically, clamped down further on dissident views in the name of the COVID pandemic, and now even more so with respect to the US/NATO role in the war in Ukraine. More and more prominent politicians, journalists and commentators, along with smaller content creators, have either been banned by YouTube or left on their own accord to join Rumble as Google's crackdown on free speech intensifies. The ability to speak more freely on Rumble regarding the most contentious political debates has become one of the key drivers of the exodus of users from YouTube to Rumble.\n\nDuring the COVID pandemic, Rumble allowed far greater questioning of the claims and policies of U.S. public health official Dr. Anthony Fauci and the World Health Organization — regarding the virus's origins, the efficacy of masks, and the justifiability of vaccine mandates — than Big Tech platforms permitted. For the first year of the pandemic, Big Tech users who questioned or rejected the official story that COVID-19 was zoonotic rather than due to a lab leak in Wuhan were silenced or banned: a censorship policy that was reversed only when the Biden administration itself admitted that it did not know the answer to that question and would officially investigate it.\n\nSimilarly, Americans who were stifled or outright barred by Big Tech from citing pre-election revelations about Joe Biden from the archive of his son obtained by The New York Post found a place, on Rumble, where they could openly reference and discuss them. And Rumble has aggressively resisted pressure campaigns from the U.S. government and corporate media outlets and outright legal bans enacted by the EU requiring all platforms to cease allowing “pro-Russian” news outlets such as RT and Sputnik to be heard.\n\nRumble's user growth, driven overwhelmingly by growing anger toward Big Tech censorship and de-platforming, has continued to swell this year. As Investor Place's Ian Cooper wrote in April, “its user base hit a new record of 41 million monthly active users in the first quarter of 2022. That is 22% growth quarter-over-quarter.” Moreover, “Rumble is setting user engagement records. In the first quarter of 2022, Rumble users watched about 10.5 billion minutes per month.”\n\nAs discussed on this page and as was reported by The Washington Post, I was one of a group of nine journalists and commentators, along with former Congresswoman Tulsi Gabbard (D-HI), to make Rumble my primary home for video journalism in mid-2021 based on support for its free speech principles and the need for alternatives to centralized Big Tech repression. Though the purpose of that Post article was to predictably malign Rumble as a cesspool of hate speech and disinformation — relying on and extensively quoting a “disinformation\" expert who happens to partner with U.S. and British intelligence agencies and Big Tech platforms such as Google and Facebook — The Post was forced to acknowledge how significant Rumble's growth has been (and since that August, 2021 Post article, the growth has increased further):\n\nThough Rumble's audience size is still significantly smaller than YouTube's, the threat posed by Rumble to YouTube is real. Rumble's imminent merger with the special purpose acquisition company (SPAC) CF Acquisition Corp. VI will effectively make Rumble a public company and is likely to arm it with far greater capital to compete even more robustly with YouTube.\n\nBut the major obstacle to competing with Big Tech giants generally, and Google specifically, is that these companies have acquired such extreme market dominance in so many key areas of the internet that they abuse that power to prevent competition and crush any competitors who pose a challenge. That these four Big Tech giants are classic monopolies in violation of the antitrust law was the emphatic conclusion of the House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law's comprehensive 2020 report, a conclusion that now has ample support from leading members of both parties.\n\nThe lawsuit brought by Rumble against Google is designed to ensure free and fair competition, so that the public is not effectively forced to use YouTube but can instead fairly choose among Google's competitors as well. The primary allegation is that Google abuses its power as the dominant search engine and destroys free competition for online video platforms by manipulating its algorithms to prevent YouTube's competitors, including Rumble, from being found by the public.\n\nAttempts to find Rumble videos through Google searches are purposely thwarted by burying Rumble's videos and instead redirecting the user to YouTube, the lawsuit alleges. Google's “chokehold on search is impenetrable, and that chokehold allows it to continue unfairly and unlawfully to self-preference YouTube over its rivals, including Rumble, and to monopolize the online video platform market.” I often am unable to find my own videos using Google's search engines even when I recall the title of the video more or less perfectly, and have frequently heard the same complaint from viewers.\n\nFurther illegal monopolistic acts alleged by the complaint include Google's manufacturing of its Android phones with a pre-installed YouTube app as the default video setting, and imposing agreements on other Android-based mobile smart device manufacturers to pre-install YouTube, place it in the most prominent position, and prevent users from deleting it. The court summarized the alleged anti-competitive results of Google's behavior this way (citations omitted):\n\nAs a result of the denial of Google's motion to dismiss the complaint, the lawsuit will now proceed to the discovery stage. After denying Google's request to dismiss the lawsuit prior to discovery, the judge scheduled a conference at which a discovery plan would be established. This phase of the lawsuit is when one party can obtain a broad range of documents from the other relevant to the claims of the lawsuit.\n\nThe antitrust specialist Matt Stoller, Research Director of the American Economic Liberties Project, said about the ruling: “Getting past the motion to dismiss stage is quite meaningful, and depending on what turns up in discovery Google could be in serious trouble.” This ruling should enable Rumble to acquire and utilize extremely revealing documents about how Google exploits its algorithms to manipulate search results on its dominant search engine, as well the burdensome requirements it imposes on other companies dependent on Google's infrastructure to ensure prominent promotion of YouTube.\n\nGoogle did not respond to requests for comment on the judicial ruling. Rumble's statement was naturally celebratory: \"We welcome the court’s decision, which is a significant step toward ending Google’s unlawful preferences for YouTube and helping to put creators first. We look forward to starting discovery.\"\n\nWhen Rumble first filed the suit, its founder and CEO, Chris Pavlovski, told Fox News’ Tucker Carlson that the company's data specialists had determined that, with its search engine algorithmic manipulations, “Google has redirected up to 9.3 billion visitors to YouTube instead of to Rumble.” These anti-competitive practices by Google, he argued, destroy the possibility for innovation and competition: “Imagine being a tech entrepreneur trying to build an online video platform. You absolutely do not have a shot. You do not have a chance. You have pre-installed YouTube apps on phones. You have a rigged search engine. You have no ability to compete in this market.”\n\nLawsuits like these have the ability to unite people across the political spectrum. Stoller, one of the nation's leading scholars on the question of Big Tech monopolistic dominance, noted that \"the case leverages antitrust action by the government pursued under both Trump and Biden. It’s also notable that this ruling came from an Obama-appointed judge. Clearly concentrations of power worry both sides.”\n\nRegardless of whether one is an avid admirer of the modern iteration of capitalism, there is nothing to cheer when a tiny group of corporate behemoths can corner a market and prevent competition. That is particularly true when — as is obviously the case for Big Tech — the \"market” in question is now the primary means by which Americans gather information, politically organize, receive and disseminate news, and question and debate the most consequential political controversies. The political and propagandistic aspects of these anti-competitive practices substantially elevate the public interest in fostering free and fair market competition. To allow a tiny number of tech monopolists to maintain a stranglehold on the digital public square is self-evidently dangerous, especially as they escalate their censorship regime, due to some combination of their own political interests, the demands of the majority political party in Washington, and the incessant grievances of their own work force.\n\nThese dangers are not abstract. Perhaps they were most vividly seen in January, 2021, when Parler — designed as a free speech alternative to Facebook and Twitter — became the most-downloaded app in the country, fueled by anger over the pre-election censorship of the New York Post's reporting on Joe Biden's activities in Ukraine and China as well as the banishment of President Trump by a consortium of Big Tech firms. As soon as Parler rose to the top spot, Democratic politicians such as Rep. Alexandria Ocasio-Cortez and censorship activists groups such as Sleeping Giants demanded that Google and Apple immediately remove Parler from their app stores, preventing any further downloading. Other Democratic lawmakers then demanded that Amazon Web Services, the dominant hosting company that had enabled Parler's website, terminate its agreement with Parler.\n\nWithin forty-eight hours, all three Silicon Valley monopolies complied with these demands. Parler instantly went from the most popular app in the country — thanks to the free speech principles it upheld — to utterly crippled if not destroyed. It attempted to come back but never really recovered. That was as brute and stark a display of Big Tech's ability and willingness to destroy any successful competitors as one might imagine. And in the process, they not only abused their anti-competitive dominance to destroy one of their few successful competitors but also, heeding the demands of Democratic Party politicians, abolished one of the few significant venues on the internet where Americans could gather to freely question and dissent from the orthodoxies and pronouncements of their leaders.\n\nThere are other antitrust actions currently pending against the Big Tech giants from both private companies and, increasingly, the Federal Trade Commission (FTC). But this suit from Rumble has enormous potential to open competition in the vital video uploading market and, perhaps even more importantly, shed substantial light on the extremely opaque and guarded algorithmic manipulations Google uses to force down the public's throat the content it wants them to see while hiding that which it does not want them to see.", "opengraph": {"site_name": "The Greanville Post", "title": "Court Rejects Google’s Attempt to Dismiss Rumble’s Antitrust Lawsuit, Ensuring Vast Discovery | The Greanville Post", "description": "GLENN GREENWALD—Founded in 2013, Rumble began experiencing explosive growth in the run-up to the 2020 election. Americans were encountering escalating and aggressive Big Tech censorship of political content as the election approached. Conservative politicians, followed by a wide range of heterodox voices on the right and left, began migrating by the millions away from Google's YouTube to Rumble, which has promised and provided far more permissive free speech rights. That was at the time when Google and other Big Tech platforms — at the urging of the Democratic-controlled Congress — began aggressively increasing its censorship of political video content on YouTube in the name of combatting “disinformation” and “hate speech.”", "url": "https://www.greanvillepost.com/2022/07/30/court-rejects-googles-attempt-to-dismiss-rumbles-antitrust-lawsuit-ensuring-vast-discovery/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/07/Google-YouTube-logo-scaled.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F25cf64fe-44d5-4183-996e-1ed275fa7e8c_5000x3333.jpeg", "https://www.greanvillepost.com/wp-content/uploads/2022/07/Google-YouTube-logo-scaled.jpg", "https://drive.google.com/file/d/1Jdm8AvAKYRlD9Xru4RVttBBZfSi56LCG/view", "https://www.nbcnews.com/id/wbna15196982", "https://news.bloomberglaw.com/antitrust/youtube-competitor-rumble-hits-google-with-antitrust-allegations", "https://www.archives.gov/milestone-documents/sherman-anti-trust-act", "https://www.nasdaq.com/articles/forget-musks-twitter-stake-cfvi-stock-is-still-ready-to-rumble", "https://www.cnet.com/news/politics/dems-slam-social-media-execs-for-allowing-spread-of-disinformation-amid-covid-19/", "https://www.politico.com/news/2021/05/26/facebook-ban-covid-man-made-491053", "https://www.bbc.com/news/world-us-canada-57260009", "https://theintercept.com/2020/10/15/facebook-and-twitter-cross-a-line-far-more-dangerous-than-what-they-censor/", "https://www.reuters.com/business/media-telecom/russian-news-channel-rt-broadcast-rumble-after-big-tech-curbs-2022-03-03/", "https://www.theglobeandmail.com/business/article-russias-rt-is-embracing-canadian-video-site-rumble/", "https://www.reuters.com/world/europe/eu-bans-rt-sputnik-banned-over-ukraine-disinformation-2022-03-02/", "https://www.nasdaq.com/articles/forget-musks-twitter-stake-cfvi-stock-is-still-ready-to-rumble", "https://www.wfmz.com/news/pr_newswire/pr_newswire_entertainment/rumble-sets-new-all-time-records-across-all-key-performance-measures/article_768d494a-9a59-52bb-90a0-f30e8158f9d7.html#:~:text=LONGBOAT%20KEY%2C%20Fla.%2C%20April,relative%20to%20the%20fourth%20quarter", "https://www.washingtonpost.com/technology/2021/08/12/rumble-video-gabbard-greenwald/", "https://rumble.com/vl29vn-online-censorship-and-the-washington-posts-propaganda-tactics.html", "https://www.similarweb.com/", "https://www.nasdaq.com/articles/forget-musks-twitter-stake-cfvi-stock-is-still-ready-to-rumble", "https://arstechnica.com/tech-policy/2020/10/house-amazon-facebook-apple-google-have-monopoly-power-should-be-split/", "https://www.denverpost.com/2021/06/27/ken-buck-amazon-facebook-google/", "https://rumble.com/vcvjqj-rumble-files-a-lawsuit-against-google-for-antitrust-violations.html", "https://greenwald.substack.com/p/how-silicon-valley-in-a-show-of-monopolistic", "https://www.nytimes.com/2021/01/10/technology/parler-app-trump-free-speech.html", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe2c2610-7e51-4e7d-9ec3-0a38ce8a28de_1298x1080.png", "https://www.greanvillepost.com/wp-content/uploads/2022/07/rumble-lawsuit.png"], "authors": [], "publish_date": "July 30, 2022"}