{"result_id": "295006", "URL": "https://www.greanvillepost.com/2022/11/26/the-age-of-dangerous-charlatans/", "timestamp": "2023-04-25 17:22:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/11/26/the-age-of-dangerous-charlatans/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "The Age of Dangerous Charlatans", "cleaned_text": "Elon Musk, the prominent enfant terrible of the globalist set, never ceases to astonish. At the recent G20 business forum in Indonesia, prompted by no apparent motive related to the gathering, he declared that “maybe we will find alien civilisations or discover civilisations that existed millions of years ago.” The bizarre announcement was delivered in a suitably mystical atmosphere, including an occult crystal bowl situated in the forefront, with Musk sitting in the dark, wearing a traditional Indonesian batik shirt and surrounded by candles as he offered a “vision” for the future that in addition to aliens also included deep tunnels and rocket tourism.\n\nThere is no record of anyone in attendance asking Musk the obvious question: what qualifies him to speculate on these subjects? There is meagre information about Musk’s education and accomplishments, if we exclude the widely known fact of his sudden, inexplicable, and spectacular enrichment, on a par with similar “success stories” involving the emergence of magnates “out-of-nowhere” in 1990s Russia.\n\nThe scant available biographical data about Musk include such titbits of budding genius as creating a video game at the tender age of 12. As for actual education, it is said that in 1997 Musk received bachelor’s degrees “in physics and economics” from the University of Pennsylvania. The eclectic scholar Musk subsequently enrolled at Stanford to pursue graduate studies in physics, which he abandoned after only two days in residence because “he felt that the Internet had much more potential to change society than work in physics.”\n\nNeedless to say, Elon Musk is not our only prominent contemporary these days who is strategically using fame and money to “change society”. The notorious Bill Gates is another well-known example. On the level of competence, the similarities between these two are striking. Like Musk, Gates has zero meaningful education or expertise in anything. He is simply what in America used to be known contemptuously (but in Gates’ case spot on accurately) as a high school dropout. Like Musk, Gates also tinkered with computer technology from an early age, but there is no evidence of his having sought or acquired any special training or knowledge in anything, be it medicine, eugenics, pharmacology, or any of the other fields that he had impacted critically with the immense amounts of money that came to be concentrated under his control. In fact, other than double crossing his business partners for personal advantage it is not known that in the course of his active life Gates had been particularly accomplished at anything.\n\nIn the society of the spectacle, which the collective West has turned into, the Kim Kardashians and Angelina Jolies reign supreme. The fascinated consumers of BS are too disoriented to demand to see credentials, whether of Hollywood starlets or wealthy “philanthropic” tycoons trying to fill their inner emptiness by turning to the dangerous pursuit of social engineering. The concept of authority, in its broad spectrum ranging from political to academic, in Western neo-liberal society has completely collapsed. Cheap fame and abundant money in that society are sufficient qualifications to pontificate on any subject.\n\nWhile a moneyed nobody like Bill Gates corrupts institutions to endorse his untutored hogwash, a respected and renowned medical specialist like Dr. Peter A. McCullough is hounded and his licence has been revoked for refusing to violate professional ethics and bend his knee to an enormously wealthy mountebank.\n\nThe sad reality of Western societies is that on one policy issue after another the tone is set and narrative shaped by charlatans, self-designated bogus authorities, or in Russian самозванцы, fraudsters and impostors of the ilk of Musk and Gates, whose every word is avidly absorbed by a clueless and bamboozled public. These charlatans influence minds and shape events in all major spheres of life, not just entertainment which has served them as an effective springboard for the corruption of habits and morals, but also in politics, gekaufte or bought-and-paid-for journalism and science, decadent art, phony scholarship, and so forth.\n\nThe important question of the extent of the fraudsters’ effective power and influence can for the moment be set aside. Sociologist Andrey Fursov’s pregnant observation should always be kept in mind, that if you have heard of someone’s name then more than likely he is merely somebody’s agent, a façade for hidden directors, rather than a genuine principal. But whether in the capacity of instruments or less probably as genuine actors, the damage done by these fabulously wealthy fraudsters, men of questionable integrity and murky biographies, has been enormous.\n\nSuffice it to mention George Soros, our subjects’ prototype, cynical betrayer of his own people and eager collaborator of their tormentors, and ruthless financial market manipulator who in 1997 caused massive devastation to millions in South East Asia with the psychopathic explanation that his purpose is to make money, not safeguard the material wellbeing of his victims. Soros’ deceptively named Open Society Foundation has been the hub of subversion in most countries of the world and has been banned and expelled from many of them.\n\nThe wicked practices of perverse social engineering exemplified by Soros have been avidly followed by Gates and Musk. Like Soros in the domains of his particular interest, and also after purchasing for himself the high-sounding title of “philanthropist,” Gates has pumped hundreds of millions of dollars into a variety of anti-human projects. There come to mind, to mention just a few, the artificial darkening of the sun, sterilisation campaigns in Africa disguised in the form of distribution of free vaccines, illegal medical trials targeting unsuspecting farmers in India, and the energetic promotion of a general world population reduction scheme which aims to physically eliminate the greater part of the earth’s current inhabitants. A very ambitious high school drop out for sure, but some philanthropist!\n\nWhen a major statesman recently suggested that Western elites were “satanic” in their inspiration, it does not seem that he was wide off the mark.\n\nLike his confreres Soros and Gates, Elon Musk is also using the vast quantities of fiat money put at his disposal to aggressively interfere in every conceivable domain, from organising coups in South America for the plunder of local mineral resources, to injecting himself into the Ukrainian conflict with the satellite technology he controls, and – as we have seen above – twisting the minds of his besotted audiences with the claptrap about extra-terrestrials.\n\nProbably unbeknownst to him, in his G20 address Musk touched on a fundamental point of Orthodox eschatology, the teaching that at the end of time the advent of the false messiah and the counterfeit salvation he brings will be heralded by demons in the guise of extra-terrestrials. In that regard, St. Gabriel Orgebadze of Georgia issued the following warning that Musk and all who take him seriously should carefully consider before embroiling others in their web of deception:\n\n“During the Antichrist times, the strongest temptation will be anticipation of salvation from the cosmos, from humanoids, extra-terrestrials that are actually demons. One should rarely look up at the sky, as the signs might be deceptive and thus one may be ruined.”\n\nAfter losing its moral, intellectual, and spiritual compass, befuddled Western humanity will be hard put to avoid ruin if it continues to follow the dangerous charlatans who have usurped front row seats in the public arena of their moribund world.", "opengraph": {"site_name": "The Greanville Post", "title": "The Age of Dangerous Charlatans | The Greanville Post", "description": "STEPHEN KARGANOVIC—In the society of the spectacle, which the collective West has turned into, the Kim Kardashians and Angelina Jolies reign supreme. The fascinated consumers of BS are too disoriented to demand to see credentials, whether of Hollywood starlets or wealthy “philanthropic” tycoons trying to fill their inner emptiness by turning to the dangerous pursuit of social engineering. The concept of authority, in its broad spectrum ranging from political to academic, in Western neo-liberal society has completely collapsed.", "url": "https://www.greanvillepost.com/2022/11/26/the-age-of-dangerous-charlatans/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/11/elon-musk-spaceX.webp", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.khaleejtimes.com/economy/g20-summit-musk-sees-aliens-tunnels-in-a-candlelit-vision-of-the-future", "https://www.greanvillepost.com/wp-content/uploads/2022/11/Elon-Musk-vacation.png", "https://www.britannica.com/biography/Elon-Musk", "http://stevejobsinc.blogspot.com/2011/04/bill-gates-steals-from-steve-jobs.html", "https://files.libcom.org/files/The%20Society%20of%20the%20Spectacle%20Annotated%20Edition.pdf", "https://www.medpagetoday.com/special-reports/exclusives/101529", "https://strategic-culture.org/news/2020/06/10/from-gekaufte-journalisten-to-gekaufte-wissenschaftler/", "https://www.amazon.com/Trousered-Apes-Sick-Literature-Society/dp/B000ERTX70", "https://www.greanvillepost.com/wp-content/uploads/2022/11/elon-musk-G20-ridiculous.jpg", "https://www.readkong.com/page/bill-gates-talks-about-vaccines-to-reduce-population-6207344", "https://strategic-culture.org/news/2020/08/02/the-privatization-of-global-chaos/", "https://www.youtube.com/watch?v=_2q-zThAD0U"], "authors": [], "publish_date": "November 26, 2022"}