{"result_id": "295009", "URL": "https://www.greanvillepost.com/2022/02/09/anti-vaxxers-could-be-wrong-but-they-are-not-crazy-or-just-a-bunch-of-ignoramuses/", "timestamp": "2023-04-25 17:22:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/02/09/anti-vaxxers-could-be-wrong-but-they-are-not-crazy-or-just-a-bunch-of-ignoramuses/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Anti-Vaxxers Could Be Wrong, But They Are Not Crazy or Just a Bunch of Ignoramuses", "cleaned_text": "Be sure to circulate this article among friends, workmates and kin.\n\n: Here's Why You Should Skip the [mRNA] Covid Vaccine*\n\n“The world has bet the farm on vaccines as the solution to the pandemic, but the trials are not focused on answering the questions many might assume they are.” —Peter Doshi, associate editor of the British Medical Journal and assistant professor of pharmaceutical health services research at the University of Maryland School of Pharmacy ∞ \n\n “The difference between genius and stupidity is that genius has its limits.” —Albert Einstein.\n\nhe new Covid vaccines will make billions of dollars for the big pharmaceutical companies, but here’s what they won’t do:\n\nThe vaccines will not cure Covid\n\n The vaccines will not prevent people from contracting Covid\n\n The vaccines will not prevent Covid-related hospitalizations\n\n The vaccines will not prevent Covid-caused deaths\n\nNow, I know what you’re thinking. You’re thinking, “If the vaccine does not protect me from getting Covid (or dying from Covid), then why should I take it?”\n\nAnd the answer is: “You shouldn’t.\" It makes no sense at all, especially in view of the fact that new vaccines pose considerable risks to one’s health and well-being.\n\n“Risks,” you say? “No one said anything about risks. I thought this wonderful new Covid cure was entirely risk-free; just take the jab and– Presto– life goes back to normal.”\n\nWrong. There are risks, significant risks that the media and the medical establishment have papered-over with their ridiculous Happy Talk about “miracle” vaccines. But all of this is just public relations hype designed to hoodwink people into injecting themselves with a dubious substance that does NOT do what it’s supposed to do, and which DOES pose serious long-term risks to one’s health.\n\nSo, let’s dig a little deeper into this question of risks and see what are the experts saying. Check out this excerpt from an “Open Letter From: UK Medical Freedom Alliance To: The Joint Committee on Vaccination and Immunization… for COVID-19 in the UK.”:\n\n“It is worrying that recent Parliamentary discussions seem to not attach proper weight to any concern about vaccine risks and the right to informed consent, while focusing solely on strategies to increase the uptake of vaccines in the general population.\n\nInadequate Assessment of the Public Health Risk from a Covid Vaccine\n\nIn a recent letter to the British Medical Journal (BMJ), physician Arvind Joshi warned against the disaster that could result from this misguided policy and outlined the serious risks involved to the public and other serious issues that are being taken if a Covid Vaccine is rushed out without thorough and adequate safety and efficacy testing:\n\n“Adverse effects like Subacute Sclerosing Pan Encephalitis, Ascending Polyneuritis, Myopathies, Autoimmune Diseases, and rarer chance of triggering development of malignancies are most dreaded possibilities.“...“The rush for the Vaccines should not lead to disaster.” (Note: There is a more comprehensive list of potential ‘bad outcomes’ in the link to the article.)\n\nVirus-vectored and genetically engineered vaccines could undergo recombination or hybridization with unpredictable outcomes.…Previous attempts to develop coronavirus and other vaccines e.g., RSV and dengue, have been hampered by the problem of ‘antibody-dependent enhanced immunity’(ADEI), which has led to severe illness and deaths in the animals and human subjects involved in the trials28. This phenomenon only becomes apparent after vaccination, when the subject is exposed to wild viruses at some point in the future. Worryingly, the Covid Vaccine trials have not been conducted in a way to exclude the possibility of this serious sequelae occurring months or years after vaccination...\n\nLate-onset adverse vaccine effects such as Subacute Sclerosing Pan Encephalitis (SSPE), Ascending Polyneuritis, Myopathies, Autoimmune Diseases, Infertility and Cancers cannot be ruled out with short-duration trials.” (“Open Letter From: UK Medical Freedom Alliance To: The Joint Committee on Vaccination and Immunization… for COVID-19 in the UK.”)\n\nIt’s all very technical, but the truth is plain to see: There are serious risks associated with taking the Covid-19 vaccine. Most vaccine recipients will experience only minor aches and pains but some will undoubtedly get quite ill and permanently damage their health. No one really knows for sure because there have been no long-term trials. The Covid vaccine has been fast-tracked from Day 1. So, the question is: Do the benefits outweigh the risks. And, in this case, they clearly don’t. The chances of getting violently sick or dying from Covid are very slight, (IFR is 1 in 400) while the (potential) adverse effects from the vaccine are spelled out above. Why would anyone roll the dice on a vaccine that does not prevent one from contracting Covid, does not protect one from hospitalization, and will not prevent one from dying? That’s just not a good tradeoff. Here’s more from an article at Forbes:\n\n“Prevention of infection must be a critical endpoint…(But) Prevention of infection is not a criterion for success for any of these vaccines. In fact, their endpoints all require confirmed infections and all those they will include in the analysis for success, the only difference being the severity of symptoms between the vaccinated and unvaccinated. Measuring differences amongst only those infected by SARS-CoV-2 underscores the implicit conclusion that the vaccines are not expected to prevent infection, only modify symptoms of those infected“…\n\nThe publication of this article by The Greanville Post does not signify a rejection of vaccines in general, or the denial that vaccines—against smallpox, polio, TB, etc.—have represented enormous advances in medical science and saved untold numbers of people from early and painful death or lifetimes of misery. The publication of this article by The Greanville Post does not signify a rejection of vaccines in general, or the denial that vaccines—against smallpox, polio, TB, etc.—have represented enormous advances in medical science and saved untold numbers of people from early and painful death or lifetimes of misery. Our position is that these recent US/Western-developed \"Covid vaccines\" —rushed to production by Pfizer, Moderna, Astra Zeneca, etc.—have not followed time-honored protocols that could guarantee sufficient safety and effectiveness against a still badly understood disease. As Whitney says, immunized (no pun intended) against possible lawsuits for medical malfeasance, they have launched a global experiment in which billions of people are essentially guinea pigs, but also in which billions of dollars can and are being made through essentially a mandated monopoly and the manipulation of media and governmental agencies, down to state and municipal levels. Pfizer alone—easily the most aggressive and shameless of the lot— has projected tens of billions in earnings solely from the vaccines: Pfizer revenue and profits soar on its Covid vaccine business, By Chris Isidore , CNN Business, November 2, 2021. Pfizer reported that earnings and sales more than doubled in the past quarter, and it raised its outlook for results the full year, thanks greatly to its Covid-19 vaccine. The company reported adjusted earnings of $7.7 billion, up 133% from a year earlier. Revenue soared to $24.1 billion, up 134%. Both easily cleared results forecast by analysts. The vaccine business alone was responsible for more than 60% of the company's sales, as vaccine revenue rose to $14.6 billion from only $1.7 billion a year earlier. The company said its Covid vaccine sales accounted for $13 billion of that revenue. Revenue outside of its Covid vaccine business was up a far more modest 7%. This year, the Covid vaccine has brought in revenue of $24.3 billion. And Pfizer said it expects a total of $36 billion from the vaccine for all of 2021 -- nearly $12 billion more in revenue the final quarter of the year. And it said based on contracts it now has signed it expects revenue $29 billion from the Covid vaccine in 2022. And that's not necessarily all it will bring in. Further, we remain deeply critical of the manner in which Big Pharma, always putting profits ahead of public health, has demonstrably corrupted and captured the political establishment in order to influence national and international public policy for its own benefit, using crucial Federal agencies such as the FDA and CDC to dictate or endorse policies that could be injurious to the public, not just on the strictly medical aspect, but also psychological and economic. As well, Big Pharma, especially Pfizer, has clearly pushed the FDA to approve supposedly \"custom\" vaccines for children in the 5-11 age bracket, populations that accumulated data shows to be practically immune to any great risk, including death, from exposure to the Covid virus. That means that Pfizer (and the FDA and CDC) are enacting health policies quite unsupported by science. The media, (including the big social media companies like Google, YouTube, Twitter, etc, complicit as supporters of the establishment, or in the pockets of Big Pharma), are censoring any and all voices and institutions—just observe what they are doing to Joe Rogan and countless others of lesser stature— that stand opposed to vaccine mandates, including lockdowns, and would wish to conduct a free and open discussion of these vital issues.—PG\n\n“We all expect an effective vaccine to prevent serious illness if infected. Three of the vaccine protocols…do not require that their vaccine prevent serious disease only that they prevent moderate symptoms which may be as mild as cough, or headache.” (“Covid-19 Vaccine Protocols Reveal That Trials Are Designed To Succeed”, Forbes)\n\nCan you see what’s going on? “Prevention” is not even a primary objective. The standard for success in these trials is whether the vaccine mitigates Covid symptoms in people who test positive. But who cares about symptoms? What people care about is dying. That’s why people are so eager to get vaccinated, because they think it will eliminate the threat of dying.\n\nThis is a critical point, and one that is well worth mulling over.\n\nBecause it helps to illustrate how the vaccine campaign is built on a foundation of lies and deception. For example, when the drug companies boast that their product is “95% effective”, it does NOT mean that– if you get vaccinated– you will be immune to Covid. It doesn’t even mean that you won’t get violently ill and die. All it means is that the vaccine reduced the symptoms of some of the people in the trials who tested positive.\n\nDid you know that?\n\nOf course, you didn’t. You thought that if you took the vaccine, you’d be protected from Covid, because that is the logical assumption that anyone would make. Most people equate vaccines with immunity. The drug companies know that which is why they’re exploiting people’s ignorance and deliberately obfuscating the truth. They want people to continue to believe that vaccination is a protective shield that will save them from sickness and death. But it’s not. It’s a bunch of baloney.\n\nBottom line: Vaccine “effectiveness” is not measured in terms of “preventing infection”. It relates to the vaccine’s impact on symptoms. Here’s more from Forbes:\n\n“One of the more immediate questions a trial needs to answer is whether a vaccine prevents infection. If someone takes this vaccine, are they far less likely to become infected with the virus? These trials all clearly focus on eliminating symptoms of Covid-19, and not infections themselves….\n\nIt appears that all the pharmaceutical companies assume that the vaccine will never prevent infection. Their criteria for approval is the difference in symptoms between an infected control group and an infected vaccine group. …\n\nA greater concern for the millions of older people and those with preexisting conditions is whether these trials test the vaccine’s ability to prevent severe illness and death. Again, we find that severe illness and death are only secondary objectives in these trials. None list the prevention of death and hospitalization as a critically important barrier….\n\nThese protocols do not emphasize the most important ramifications of Covid-19 that people are most interested in preventing: overall infection, hospitalization, and death. It boggles the mind and defies common sense that the National Institute of Health, the Center for Disease Control, the National Institute of Allergy and Infectious Disease, and the rest would consider the approval of a vaccine that would be distributed to hundreds of millions on such slender threads of success.\n\nIt appears that these trials are intended to pass the lowest possible barrier of success.” (“Covid-19 Vaccine Protocols Reveal That Trials Are Designed To Succeed“, Forbes)\n\nThe author is right, isn’t he? If the vaccine doesn’t prevent infection, it’s not worth taking. Period. And yet, all these high-falutin organizations are on-board with this farce. It’s a disgrace. We’re not even talking about a “low bar” for success here. We’re talking about “no bar”. If people are concerned about symptoms, they’d be better off taking an aspirin and leaving it at that. There’s no need to inject themselves with some hybrid cocktail that no one has the slightest idea of what the long-term effects might be. That’s just reckless.\n\nLike we said earlier, the real issues are being cleverly concealed by the people in charge who are hyping the “95% effective” nonsense to hoodwink people into cooperating. It’s blatantly dishonest.\n\nAnd here’s something else to think over: What do we really know about these miraculous vaccines that are supposed to lead us out of our “public health crisis”?\n\nNot much. We know that they’re being rushed to market. We know that they were delayed for political reasons. We know the science is being shaped by the politics. We know that vaccine development typically takes 10 years, and that “rushed” vaccine development takes 3 years, and that the upcoming batch of dubious vaccines will have taken roughly 8 months.\n\nDo you find that reassuring? Does that make you want to push your way to the front of the line on Vaccine Day? And are you surprised that a large sampling of medical professionals has decided they aren’t going to take the vaccine until it’s been out for at least a year??\n\nAnd here’s another thing: The pharmaceutical giants don’t even know if their vaccines will stop transmission or not. I’m not kidding, they really don’t know. So– along with the fact that the vaccine will not provide immunity– it also will not stop the spread of the infection which means, the pandemic will continue.\n\nDon’t you think the public is entitled to know this?\n\nAnd let’s not forget that these so-called “vaccines” don’t really fit the traditional definition of vaccine at all. The CDC defines a vaccine as: “A product that stimulates a person’s immune system to produce immunity to a specific disease, protecting the person from that disease.”\n\nAnd the CDC defines “immunization” as:\n\n“A process by which a person becomes protected against a disease through vaccination. This term is often used interchangeably with vaccination or inoculation.”\n\nWell, we’ve already shown that the new vaccines do not necessarily provide immunity, so the question is whether they actually “stimulate a person’s immune system” or if the “vaccine” moniker was simply preserved as a promotional device to dupe the public? Here’s some background from an article at RT:\n\n“The type of vaccine being developed against Covid-19 has never been used before, outside of Ebola. Some people feel that they should not really be called vaccines, because they are completely different from anything that has gone before.\n\nUp to now, vaccination has meant injecting a dead virus (or bacteria), or one that has been weakened and can only poorly replicate, or parts of the virus, or suchlike. Once inside the body, the immune system spots this ‘alien’ material, and creates a response against it, which will hopefully be remembered for years and years. The next time the dangerous virus appears, the body will use the immune memory of something very similar, to wipe out the virus (or bacteria) at high speed, giving it no chance to do damage\n\nNow, we have a thing called a messenger RNA vaccine (mRNA). RNA is, effectively, a single strand of DNA – the double helix that sits within our cells and makes up our genetic code. Many viruses are made up of a single strand of RNA, surrounded by a protein sphere. They enter the cell, take over the replication systems, make thousands of copies of themselves, then exit the cell. Sometimes killing the cell as they do so, sometimes exiting more gently. Covid19 (Sars-Cov2) is an RNA virus.\n\nKnowing this, rather than attempting to create a weakened virus, which can take years, or break the virus into bits, the vaccine researchers decided to use Sars-Cov2’s RNA against itself. To do this, they isolated the section of RNA which codes for the ‘spike’ protein – which is the thing the virus uses as a ‘key’ to enter cells…\n\nThese spike proteins then leave the cell – somehow or other, this bit is unclear. The immune system comes across them, recognizes them as ‘alien’ and attacks. In doing so, antibodies are created, and the immune memory system kicks into action. If, later on, a Sars-Cov2 virus gets into the body, the immune system fires up and attacks the remembered spike protein. Hopefully killing the entire virus.” (“As a doctor, people ask me if it’s safe to take a new Covid vaccine“, RT)\n\nIt’s all very complicated and cutting-edge, but what’s clear is that “Messenger RNA” and “spike’ protein” are a far-cry from plain-old dead virus which has worked just fine for decades. It’s hard to understand why the drug companies decided to reinvent the wheel in trying to settle on an antidote for Covid. Even so, this new state-of-the-art technology does have its drawbacks as was pointed out in the letter by the researchers in the Medical Freedom Alliance. Here’s what they said:\n\n“Several Covid Vaccines involve the use of a completely new technology -mRNA vaccination -whose large-scale use in healthy human subjects is unprecedented and long-term effects unknown. Exogenous mRNA is inherently immunostimulatory, and this feature of mRNA could be beneficial or detrimental. In addition, a study found evidence of molecular mimicry …\n\nVirus-vectored and genetically engineered vaccines could undergo recombination or hybridisation with unpredictable outcomes….Previous attempts to develop coronavirus and other vaccines e.g., RSV and dengue, have been hampered by the problem of ‘antibody dependent enhanced immunity’(ADEI), which has led to severe illness and deaths in the animals and human subjects involved in the trials. This phenomenon only becomes apparent after vaccination, when the subject is exposed to wild virus at some point in the future. Worryingly, the Covid Vaccine trials have not been conducted in a way to exclude the possibility of this serious sequalae occurring months or years after vaccination.” (“Open Letter From: UK Medical Freedom Alliance To: The Joint Committee on Vaccination and Immunization… for COVID-19 in the UK.”)\n\nThe point is, the effects of injecting a hybrid concoction into one’s body could be quite serious. We just don’t know what the long-term effects will be, and we probably won’t know because the vaccine is going to be rushed into distribution before those trials can be conducted. This is not a sensible strategy for dealing with the virus. It is needlessly reckless and, perhaps, lethal. Here’s more from an article at the Jerusalem Post:\n\n“There is a race to get the public vaccinated, so we are willing to take more risks,” Tal Brosh, head of the Infectious Disease Unit at Samson Assuta Ashdod Hospital, told The Jerusalem Post…..\n\n“We will have a safety profile for only a certain number of months, so if there is a long-term effect after two years, we cannot know,” Brosh said, adding that we could wait two years to discover them, “but then we would have the coronavirus for two more years.”…\n\n(Brosh) acknowledged that there are unique and unknown risks to messenger RNA vaccines, including local and systemic inflammatory responses that could lead to autoimmune conditions….. An article published by the National Center for Biotechnology Information, a division of the National Institutes of Health, said other risks include the bio-distribution and persistence of the induced immunogen expression; possible development of auto-reactive antibodies; and toxic effects of any non-native nucleotides and delivery system components…\n\nGreat, so the “professor of biological chemistry” isn’t going to take the vaccine, but it’s okay for ordinary people like you and me??\n\nGive me a break. Professor Linial’s reluctance is a tacit admission that the vaccine is not safe. What else could it mean? Here’s more from the same article:\n\n“In order to receive Food and Drug Administration approval, the companies will have to prove there are no immediate or short-term negative health effects from taking the vaccines. But when the world begins inoculating itself with these completely new and revolutionary vaccines, it will know virtually nothing about their long-term effects.” (The Jerusalem Post)\n\nWell, that’s just dandy. We know the vaccines won’t prevent infection, hospitalization or death. We also know they are “are completely different from anything that has gone before”. We also know they won’t stop transmission, and that their long-term safety is very much in doubt. Even so, our leaders– who lie to us about virtually everything– want us to click our heels and submissively take “the jab” whether we want to or not.\n\nIn my opinion, the risks of vaccination far outweigh the benefits. I would rather trust my own auto-immune system (and the new treatments, medications and therapies) than be guinea pig in Big Pharma’s sinister lab experiment.", "opengraph": {"site_name": "The Greanville Post", "title": "Anti-Vaxxers Could Be Wrong, But They Are Not Crazy or Just a Bunch of Ignoramuses | The Greanville Post", "description": "MIKE WHITNEY—Knowing this, rather than attempting to create a weakened virus, which can take years, or break the virus into bits, the vaccine researchers decided to use Sars-Cov2’s RNA against itself. To do this, they isolated the section of RNA which codes for the ‘spike’ protein – which is the thing the virus uses as a ‘key’ to enter cells… These spike proteins then leave the cell – somehow or other, this bit is unclear. The immune system comes across them, recognizes them as ‘alien’ and attacks. In doing so, antibodies are created, and the immune memory system kicks into action. If, later on, a Sars-Cov2 virus gets into the body, the immune system fires up and attacks the remembered spike protein. Hopefully killing the entire virus.”", "url": "https://www.greanvillepost.com/2022/02/09/anti-vaxxers-could-be-wrong-but-they-are-not-crazy-or-just-a-bunch-of-ignoramuses/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/08/Covid-19-Vaccine.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2018/04/cropped-fight-racism-capitalism-1.jpg", "https://www.greanvillepost.com/wp-content/uploads/2021/05/modernaVaccine.jpg", "https://uploads-ssl.webflow.com/5fa5866942937a4d73918723/5fbd13488af2de09d68bd61c_UKMFA_Letter_to_MHRA_JCVI.pdf", "https://www.greanvillepost.com/wp-content/uploads/2022/02/Polio-victim-iron-lung.jpg", "https://www.cnn.com/profiles/chris-isidore", "https://www.cnn.com/2021/11/02/business/pfizer-earnings/index.html", "https://www.forbes.com/sites/williamhaseltine/2020/09/23/covid-19-vaccine-protocols-reveal-that-trials-are-designed-to-succeed/?sh=348653a65247", "https://www.forbes.com/sites/williamhaseltine/2020/09/23/covid-19-vaccine-protocols-reveal-that-trials-are-designed-to-succeed/?sh=348653a65247", "https://www.rt.com/op-ed/507587-covid19-vac", "https://uploads-ssl.webflow.com/5fa5866942937a4d73918723/5fbd13488af2de09d68bd61c_UKMFA_Letter_to_MHRA_JCVI.pdf", "https://www.jpost.com/health-science/could-an-mrna-vaccine-be-dangerous-in-the-long-term-649253"], "authors": [], "publish_date": "February 9, 2022"}