{"result_id": "295024", "URL": "https://www.greanvillepost.com/2022/06/08/peoples-party-blocks-liberal-takeover-attempt/", "timestamp": "2023-04-25 17:22:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/06/08/peoples-party-blocks-liberal-takeover-attempt/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "People’s Party Blocks Liberal Takeover Attempt.", "cleaned_text": "\"As long as I am with the People’s Party, it will never submit to threats and blackmail. We will meet these attacks head-on. Because this is what the establishment does to people, parties, and organizations who threaten them.\"\n\nMy friends, I have been accused of sexual harassment. These allegations are false and politically motivated. There is no evidence to substantiate them. In fact, following a thorough investigation, my accuser admitted that there is no evidence to substantiate them. We had been in a consensual relationship that she had initiated.\n\nThe accuser made allegations against me to the board in December, one week before the start of the National Organizing Committee. Immediately there were red flags. Mixed in with the allegations were demands for professional advancement and veiled threats to the board that she could go public and attempt to destroy the party if her demands weren’t met.\n\nWhen she made these serious accusations, the board acted immediately and appointed a committee of three Board members to investigate. After taking written statements, interviewing both of us separately, and examining the evidence, the committee concluded that the allegations did not have merit and were a politically motivated attempt to remove me. They discovered that two board members, who had confided to others that they had long sought to remove me and take my position, had orchestrated the allegations with the accuser and a contractor.\n\nBefore anyone had investigated the veracity of her allegations, they treated them as a foregone conclusion and personally called and lobbied every member of the board to remove me, the first democratically-elected chair of this party, whom you, the membership, chose. Instead of running against me in last year’s interim chair election or this year’s national committee chair election, they tried to remove me through false allegations.\n\nThe People’s Party is a populist party. These board members wanted to convert it into a more liberal and woke party. They had already begun reorienting the party’s message away from economic populism and towards identity politics, a transformation that alarmed many volunteers. They were supported by contractors who abused their positions of authority in the party to attack our own volunteers, delegates, and even Ralph Nader — who spoke at the opening meeting of the National Organizing Committee — as sexists, racists, and white supremacists for seeking to build class solidarity.\n\nDATELINE—Feb 24, 2022\n\n Movement for a People’s Party founder Nick Brana has become the latest member of the populist left to be accused of inappropriate sexual conduct. The accusations come amidst a great deal of turmoil and struggle for control of the People’s Party and it’s direction. Brana appears with Jimmy to defend himself against the charges and reveal the internal battles underway at the People’s Party that he believes are behind the allegations.\n\nThis liberal faction opposed allowing our membership to democratically decide the party’s position on Covid vaccine mandates, going as far as attempting to shut down a party-wide vote and censor and cancel volunteers who discussed it in Slack. They even responded to Rodrigo’s personal story of suffering a vaccine injury, Bell’s palsy, by alleging that it hadn’t actually happened. They sought to replace our universalist message of health care, college, and housing for all with partitioned messages for different identity groups, a staple of Democratic Party campaigns. They were fundamentally reorienting the party away from its populist mission of uniting the left and right against the establishment, a mission they derided as building a “red-brown alliance” and “economic reductionism.”\n\nThis group of board members also sought to remove any and all accountability from paid contractors. Paula Jean Swearengin was hired as our West Virginia State Director but failed to bring in a single volunteer or National Organizing Committee delegate during her six months with the party. Sabrina Peña Young represented herself as a populist when she was interviewed for our Communications Director position but promoted a liberal message after being hired. Sabrina’s woke attacks on many of you were so abrasive that dozens of grievances were filed against her, more than everyone else in the party combined, culminating in a petition with dozens of signatures demanding that she be dismissed. Despite their failure to meet basic contractual responsibilities and their hostility to volunteers, the minority board members protected them from so much as a reprimand, a dereliction of fiduciary and ethical duty in managing these paid contractors.\n\nSmug, neurotic, unprincipled, and hypocritical, the synthetic left tried to infect the People's Party with a Democrat party virus to destroy it from within.\n\nOther members of the board and I were told that any attempt to intervene in the hijacking of the party’s message and purpose, including holding a party-wide vote on vaccine mandates, would be construed as “retaliation” against the accuser, in further acts of collusion between her and those on the board.\n\nWhen the hostile members of the board and contractors realized that the investigation was not going their way, they encouraged the accuser to escalate her claims. The accuser’s original complaint had not even used the words “sexual harassment,” but they told her to allege rape. This shocked the investigative committee, and one of the members later told me, “Every time I spoke with her, I got a different story. Every time I spoke with you, I heard the same thing.” Another member of the investigative committee put together a list of dozens of inconsistencies between her own accounts.\n\nThe original investigation was supposed to last about a week, but because it had not arrived at the predetermined conclusion sought by the hostile board members, they prolonged it week after week for two months, pressuring committee members to alter their conclusions, attempting to censor and expel committee members who objected to the political motives behind the allegations, fabricating new charges of “retaliation” for supporting a party-wide vote on vaccine mandates, and most seriously, engaging in a sustained campaign to replace the legal board of the organization with a partial one that subtracted Rodrigo and me, an attempt that our General Council affirmed was illegal.\n\nHad there been any actual evidence, the investigation would have concluded quickly. Because there was none, they resorted to manufacturing the new charges, further revealing their political motives. But the more her allegations fell apart, the more brazen the hostile faction on the board became. They abandoned their responsibilities in other areas of the party, including organizing, tech, and finance, and focused obsessively on attempting to remove me.\n\nMeanwhile, they were also trying to enact their liberal agenda on the National Organizing Committee. They inserted a provision into the draft charter of the People’s National Committee which would have allowed registered Democrats to control every seat on about forty People’s Party state committees and a supermajority on our national committee, effectively inviting Democratic Party infiltrators. When populist delegates overwhelmingly struck down their provision, they were furious. They had realized that our members and NOC delegates are overwhelmingly populist and they were the outliers.\n\nOutraged, this hostile faction of board members drew up a plan to purge dozens of populist leaders from states across the party, beginning with me and proceeding to other national board members and the state delegates who had voted against them, an action that would have destroyed the party. Nick’s populist “NOC coalition has to go,” they stated. Despite not having the votes to remove me, and in opposition to our General Counsel, they had resolved to do it illegally. This was so alarming to the remaining national board members that they brought it to my attention and that of our General Counsel.\n\nAt the same time, whistleblowers at the accuser’s last place of employment told us that she had done the same thing at their organization that she was presently doing with us, accusing board members of sexual harassment and abuse, using it to split the board and demand professional advancement. It also turned out that she was friends and former colleagues with Shahid Buttar’s accuser, who had sought to sink his congressional challenge to Nancy Pelosi, and had even tried to get us to hire his accuser.\n\nThe remaining board members and our General Counsel decided that we had to take action to safeguard the party before they attempted to purge the party of populist leaders, delegates, and volunteers. We also knew that we couldn’t let them continue to abuse volunteers, shift our message and mission to identity politics, and deny party members the democratic right to vote and decide the party’s position on vaccine mandates. So we took action to remove them with the guidance of multiple lawyers and law firms.\n\nHaving failed to derail the party away from the populist mission that has galvanized thousands nationwide, we can expect relentless attacks on the party and me. Expect those who were removed to attack on DNC-aligned and billionaire-funded media outlets that have long sought to bring down the People’s Party, especially since Force the Vote. As long as I am with the People’s Party, it will never submit to threats and blackmail. We will meet these attacks head-on. Because this is what the establishment does to people, parties, and organizations who threaten them. We will keep our mission sharply in focus and work steadfastly toward building a major new populist party free of corporate money.\n\nTo the many dozens of people who have reached out with solidarity, encouragement and defiance in the face of these attacks, thank you. Together we are building a major new populist party and we will transform this country.", "opengraph": {"site_name": "The Greanville Post", "title": "People’s Party Blocks Liberal Takeover Attempt. | The Greanville Post", "description": "The People’s Party is a populist party. These board members wanted to convert it into a more liberal and woke party. They had already begun reorienting the party’s message away from economic populism and towards identity politics, a transformation that alarmed many volunteers. They were supported by contractors who abused their positions of authority in the party to attack our own volunteers, delegates, and even Ralph Nader — who spoke at the opening meeting of the National Organizing Committee — as sexists, racists, and white supremacists for seeking to build class solidarity.", "url": "https://www.greanvillepost.com/2022/06/08/peoples-party-blocks-liberal-takeover-attempt/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/06/Screen-Shot-2022-06-08-at-12.35.43-PM.png", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "June 8, 2022"}