{"result_id": "295046", "URL": "https://www.greanvillepost.com/2022/02/04/ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-u-s-against-china/", "timestamp": "2023-04-25 17:23:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/02/04/ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-u-s-against-china/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Ron Unz: COVID-19 Was an ‘Anti-Economy’ Bioweapon by the U.S. Against China", "cleaned_text": "HELP ENLIGHTEN YOUR FELLOWS. BE SURE TO PASS THIS ON. SURVIVAL DEPENDS ON IT.\n\nRon Unz: COVID-19 Was an ‘Anti-Economy’ Bioweapon by the U.S. Against China\n\nRon Unz provides his analysis on the origins of the COVID-19 pandemic. He discusses the possibility of it being deliberate biowarfare by the United States against China and Iran, given it appeared at the peak of America’s global confrontation with China. As a moderately lethal but highly contagious pathogen, it was designed to be an “anti-economy” bioweapon, and the national security state apparatus which carried out the attack likely believed there would be minimal blowback.\n\nGeopolitics & Empire · Ron Unz: COVID-19 Was an 'Anti-Economy' Bioweapon by the U.S. Against China #257\n\nGeopolitics & Empire: The Geopolitics & Empire podcast is joined by Ron Unz. He is a theoretical physicist by training, has worked in the financial services software industry, and became involved in politics and public policy activities. He founded The Unz Review in, I believe, 2013, which garners a lot of traffic, is widely read. Welcome to Geopolitics & Empire, Mr. Unz.\n\nHey, great to be here.\n\nGeopolitics & Empire: Yeah, good to have you. And just a few quick announcements before we begin. Tomorrow, actually, I am released from YouTube prison as my second first strike in a row will expire. I’m not sure if I will post this controversial interview with Ron in full on Pentagon too, but listeners know they can find it on all podcast platforms and now the five video platforms of Odyssey, Rumble, Rokfin, BitChute and Brighteon. The brand new website for Geopolitics & Empire has just gone live. You can find it at geopoliticsandempire.com. There’s a new membership option there to help support the podcast and get access to my new brief weekly podcast, commentary, monthly newsletter, private Telegram, and monthly group call with members. All of this, both in English and Spanish.\n\nNow, back to Mr. Unz who will be discussing his take on the origins of the pandemic, how deadly he deems the pandemic to be the efficacy of the vaccines, the new cold war with China and so forth. Just real quick. My view is that there is no way any of this to me was natural or accidental or spontaneous given all the evidence we have seen the past few years. I can only interpret the pandemic as a planned event. For me, the question then becomes planned by who, what is the nature exactly of the pandemic and to what end?\n\nI initially viewed it as a biological warfare attacked by the west against the east. I also entertained the idea that it could be a biological attacked by the east against the west. But given the global coordination we’ve been seeing lately by all nations against their own peoples, I’m starting to view it as an attack by ruling elites around the globe on their own populations as George Orwell wrote in Nineteen Eighty-Four.\n\nI tend to believe that we are not in a pandemic by definition. I question whether there is a virus at all, and that it’s possible many events were manufactured. But I’m still not sure, and I’m of course, open to the idea that there was a gain-of-function, a virus. I view the vaccines as dangerous and possibly as a bio weapon as some people have said such as Francis Boyle. But more importantly for me, I’m afraid that it created a pretext for the installation of a Chinese style, social credit, digital passport kind of system.\n\nSo those are my 2 cents. I know on the Unz Review, you have given platform to a wide range of views on the matter, which is fantastic and how media should be. Mike Whitney has been a prolific commentator in your site but you disagree with him on many points. So we’re ready for your take on COVID 19. I believe you believe it was a bio warfare [attack] by the west against China and Iran among others, that the pandemic health threat is serious, and that there is little evidence demonstrating the vaccines are harmful. I’m not really here to debate, but just for you to give us your data dump. So maybe we can start with the bio warfare aspect. Give us your take, Mr. Unz.\n\nRon Unz: \n\n Okay. Well, I mean, my views in some ways probably are much more conventional and closer to the mainstream than some of the issues that you’ve raised. When the epidemic obviously first began, it suddenly appeared in the city of Wuhan, China. And then at first, really nobody knew what was behind it. So obviously after a few months, the conventional wisdom, the establishment opinion settled in it being a natural virus. And that was basically supported by articles that came out in Nature Medicine and science. And the entire media shifted over to that perspective.\n\nSo in other words, really for about a year, the establishment position in the media was that it was a natural virus that unfortunately leaked into the human population and was devastating the world for that reason. Now, that certainly was possible. But a few months ago, there’s suddenly that, what I guess could be called almost a propaganda bubble ended up bursting. Particularly, a long time science journalist named Nick Wade, who had been editor, science editor at the New York Times and spent decades there came out with a very long and detailed analysis pointing to the fact that there’s very little evidence that’s a natural virus.\n\nAnd if it’s not a natural virus, he argued that the obvious alternative was that it was an artificial virus produced in a laboratory that leaked out of Wuhan, China. Those are the two possibilities that have been widely debated in the media over the last six or eight months, either a natural virus, which was the previous conventional opinion or a lab leak, an artificial virus that leaked out of Wuhan, China. It seems to me, the interesting thing about the debate is that there’s an obvious third possibility, which just as you say has been discussed in fringe areas of the internet from the beginning, but has really been confined to those fringe areas.\n\nAnd the third possibility is that it was a deliberate bio warfare attack. In other words, the virus was biologically engineered to be moderately lethal, but extremely, extremely contagious. So in effect, it was designed to be an anti-economy bioweapon, not an anti-personnel bioweapon and that with the fatality rate of about 0.5 to 1%, obviously it wouldn’t wipe out a population, but it would kill a sufficiently large fraction of the population, and it was so extremely contagious that countries that were infected with it would have to take drastic measures that would disrupt their economy to control it. And that’s exactly what happened in China.\n\nIn other words, when you’re looking at the details of the original incident in China, the virus appeared in Wuhan, China, according to all of the best estimates towards the end of October or towards the beginning of November. That was patient zero. Now, that would’ve allowed exactly right amount of time for the virus to become an unstoppable epidemic around the time of the Lunar New Year travels in China.\n\nIn other words, the Lunar New Year is a tremendously important holiday in China. It’s the equivalent of Christmas, New Year’s, and number of other things put together with 450 million Chinese traveling. Wuhan is a key transit hub. So to the extent that the virus became widespread in Wuhan invisibly before the government noticed what was happening and during the lunar New York travels, it would’ve infected the entire country and had a devastating impact in China’s economy.\n\nNow, the virus appeared exactly at the peak of America’s global confrontation with China. And the suspicion that the two events connected is really a fairly obvious one. Furthermore, when you look at some of the details of what had been happening in China, the previous two years, in 2018, there was a mysterious viral epidemic that had devastated China’s poultry industry.\n\nI’ll add one more thing. What we have to realize is that America for many years now, I would argue, has been run by its own propaganda ministry. Now, when a country has a very effective propaganda ministry, it has many powerful elements. It’s able to influence the world in ways that countries like China, Russia, whose media is much less dominant are not able to do, but sometimes countries then start believing their own propaganda.\n\nIn 2019, there was a mysterious viral epidemic that appeared in China and destroyed 40% of China’s pig herds, its primary meat source. So we’re talking about a virus appearing in 2018, attacking its food supply. A virus appearing in 2019 attacking another source of food supply, and then a virus appearing at the end of 2019 that could have devastated China’s economy in exactly that sort of way.\n\nNow, as it happens, when we look at some of the other events that really would make anybody very suspicious, in 2017, before these viral epidemics began, a man named Robert Kadlec was brought into the Trump administration. For decades, he’d been one of America’s leading bio warfare experts, an advocate of bio warfare as being a very useful and plausibly deniable means of damaging or severely disrupting international adversaries.\n\nSo he was brought in, in 2017. And then in 2018 and 2019, these food supply viruses inflicted a tremendous amount of damage in China. Furthermore, when we look at the events of 2019, and we’re talking about really ridiculous things, I mean, from January to September 2019, Robert Kadlec’s department ran something called the Crimson Contagion exercise, which was a federal state planning process as to how America officials would guard America from suffering any damage, suffering infection from a respiratory virus that might suddenly appear in China.\n\nSo we’re talking about Robert Kadlec America’s chief bio warfare expert running this exercise from January to August 2019, and two months later exactly that sort of virus appeared in China. I mean, the coincidences are really absolutely ridiculous. We’re talking about when something is called the Crimson Contagion exercise, it sounds like a bizarre conspiracy theory that was invented on a corner of the internet.\n\nThe way I found out about it is there was a front page story in the New York Times describing it in all the details. So what we’re talking about are basically a tremendous amount of circumstantial evidence pointing towards America elements of the American national security establishment inflicting a viral epidemic on China for very obvious reasons.\n\nIn other words, China right now has one of the fastest growing world economies. And in fact, by most measures, it already surpassed America’s economy in size several years ago. How in the world could China be controlled? How could America maintain its dominant position? I mean, China, for example, has a suite of carrier killer missiles, long range missiles that could easily destroy a carrier fleet. We’ve been trying various means to sort of hinder the Chinese economy, damage Chinese companies like Huawei.\n\nBut when we’re talking about economy that large, growing that rapidly, and these days closely aligned with the massive national resources of Russia, I think the only plausible means of dealing China severe blow would be something like a bio warfare attack.\n\nSo that in a sense was the starting point. When I first, in late January and early February, began hearing of this mysterious virus appearing in the city of Wuhan, I started wondering, and having a few suspicions here and there, but more and more evidence gradually accumulated. I think at this stage, it becomes by far the most plausible scenario, despite the fact that it’s been entirely, entirely avoided by not only the mainstream media, but virtually all of the alternative media as well.\n\nThe number of alternative media websites that even raise the possibility of the COVID virus being an American bio warfare attack are virtually nil. I mean, I’m not saying none, but I mean virtually none. It just seems very strange when all the evidence obviously points in such an obvious direction.\n\nI might as well raise a few more points. Again, this is information that came straight from the mainstream media, from the New York Times that I read very carefully every morning. Soon after the outbreak of the original virus in Wuhan, that virus suddenly jumped 5,000, 3,000 miles to the city of Qom in Iran, the holy city of Qom which was the center of their religious and political elites.\n\nNow, if you’re talking about a virus spreading from Wuhan, China, the most logical places you’d to go next would be the other East Asian nations bordering China, and that’s exactly where a few outbreaks did occur. But the virus then suddenly jumped all the way to Iran. And in fact, the headline in the New York Times described Iran as being the second global epicenter of the virus.\n\nNot only that, but it specifically targeted Iran’s political elites. 10% of the Iranian parliament ended up being infected. Some of the top Iranian officials ended up being infected and a number of them died. So we’re talking about a virus epidemic that occurred in Iran just a few weeks after America had assassinated Iran’s top military leader. I mean the whole thing is ridiculous and nobody ended up bringing up any of these points.\n\nSo we’re talking about the two countries in the world that America was most at loggerheads with at that point were China and Iran. And they were the two countries struck down by this virus. Now, some of the other points you raised in your introduction are some of the suspicions that were raised, especially in certain elements of the alternative media, that this is a coordinated plot by most of the governments of the world working together behind the scenes.\n\nNow, I can’t rule anything out, but it seems to me really fairly implausible. The idea would be that America, China, Russia, Iran, Israel and all of these other major countries in the world that are ferociously hostile to each other in every particular way would be secretly coordinating their joint use of a virus. Now, anything is possible, but it seems to me that’s a much less likely possibility than a simple case that when a mysterious viral outbreak occurs in China and Iran, when America is most hostile to China and Iran, and America has spent eight months preparing for defense against the viral outbreak before it actually occurred, I think the most likely scenario is simply that it happened exactly the way you’d expect.\n\nIt’s probably easier to get into some of the questions you could raise about that. But one thing I should say is that once the virus spread to the United States then, the reaction of the Trump administration was so lazy and incompetent, and ignored the whole problem. I think it’s extremely unlikely that Trump himself was aware of what had happened. In other words, he basically claimed the virus didn’t exist. It wasn’t a problem. It would vanish by itself. He was so lackadaisical that we ended up having a massive outbreak in our country.\n\nAnd from that point of view, I think it almost entirely rules out the possibility that he himself had authorized the attack. Now, with most administrations, most countries around the world, the notion of the top leader of a country not having been involved in a major bio warfare attack against the country’s leading international rivals would seem utterly absurd, but America is not a normal country these days.\n\nThe Trump administration was a very strange administration. If you’ve read some of the accounts that have come out, Trump’s top aides and advisors would often run circles around him. In some cases, they would hide his own executive orders, hoping that he would forget that he’d plan to issue them.\n\nSo under those circumstances, it’s easy to imagine some of the top national security officials in the Trump administration deciding to deal a body blow to China, America’s leading geopolitical rival, and perhaps also Iran, attack the Iran leadership, and doing so without Trump’s authorization.\n\nNow, my own speculation or foreign speculation would be that all of the elements of the attack probably came from America’s own national security establishment. In other words, the virus had probably been developed [at] Fort Detrick or some other bio warfare facility. The virus was probably taken to China by elements of American special forces or CIA operatives or something like that. All of those individual believed that they were acting with the full authorization of the top American government.\n\nWhile on the other hand, the people actually involved were one notch down from Trump. Probably a small group of officials who decided that they needed to strike a deep blow against China, and they basically authorized the attack on their own with all of the lower level officials, assuming that it had Trump’s authorization, which it didn’t. Then once the attack caused a massive blowback in the United States, I mean, by most estimates, probably about a million Americans have already died. It’s the worst disaster to hit the United States since the Great Depression. It’s the worst worldwide event. The most important worldwide event since the Second World War.\n\nSo you can easily imagine those officials who were involved in it at the time assuming that they did not intend for it to have blowback inside the United States would now be very, very concerned that their all might be found. So you’d never get them to talk about it. I mean, a million Americans have died from it. And to say, “Oh, we thought it would stay in China.” I mean, that’s not an answer that anybody would accept.\n\nI’ll add one more thing. What we have to realize is that America for many years now, I would argue, has been run by its own propaganda ministry. Now, when a country has a very effective propaganda ministry, it has many powerful elements. It’s able to influence the world in ways that countries like China, Russia, whose media is much less dominant are not able to do, but sometimes countries then start believing their own propaganda.\n\nFor example, one very telling element that came out in late 2019 before the epidemic was [not] at all known by anybody was that international organizations ranked the countries in the world as best being able to cope with the sudden appearance of an epidemic. America was ranked best in the world. America would be more secure against any unexpected epidemic than any country in the world. Britain was ranked number two and China was down around 40 or 50.\n\nSo under those circumstances, it’s easier to imagine that American national security officials would simply assume that America could control any sort of blowback that occurred here. Furthermore, when the original SARS virus appeared in China, at first, there was obviously a lot of international concern, but it stayed almost entirely in China plus a few other East Asian countries and never had any significant impact in the United States.\n\nThe same thing with the MERS epidemic, which appeared in the middle East. There was virtually no presence of MERS in the United States. So it’s easier to imagine government officials thinking, well, SARS was no problem. MERS was no problem. If we then launch a bio warfare attack in Wuhan, China, there’s a pretty good chance it’ll devastate the Chinese economy, put them out of business, maybe even cause the overthrow of the Chinese regime, total disruption in their society.\n\nWhile on the other hand, especially if we’ve spent eight months preparing in the Crimson Contagion exercises for coping with any sort of blowback in the United States, we’ll be very prepared and there won’t be any problem. I mean, maybe a few Americans will die, but it won’t be anything like the devastation that we’re inflicting on China and to some extent Iran.\n\nSo, I mean, that’s basically the scenario I’m looking at. It’s a very simple straightforward idea. We don’t have to deal with the idea of all these different hostile countries in the world together cooperating. We don’t have to assume that the attack was especially well thought out. It didn’t go through 18 different planning stages in the Pentagon. My guess is it was probably a small group of a handful of conspirators, including probably one or two people near the top of the Trump administration.\n\nThey then enlisted elements of the national security establishment, carrying it out with all of those individuals, assuming it was a fully authorized operation intended to basically severely damage America’s main geopolitical rival. And under those circumstances, nobody expected it would have [an] impact in the United States. And then once it had that impact, America has been very, very ineffective at coping with the results because of our own incompetence, I think rather than any deliberate scheme on the part of America’s top leaders.\n\nSo in a sense, the only part of the scenario in my case that differs from the Orthodox mainstream narrative promoted by the media is that they’ve never considered the third option. They’ve considered there was a natural virus, or that it might be an artificial lab leak, but they’ve never considered that it was the obvious case of a country inflicting a bio warfare attack against another country. And given that America’s had the world’s largest and most active bio warfare program going on 70 years now, and has spent so many billions of dollars. I think the figure is probably $100 billion on bio warfare research and development over the last 40 or 50 years.\n\nIf [we] build all these bio warfare facilities, at some point, somebody might decide to use them, even if the president isn’t informed. So that’s the rough scenario I’m talking about.\n\nGeopolitics & Empire: Yeah. I think it’s Chekhov’s Gun. At the beginning of the play, if there’s a loaded gun it’s going to go off by the end. A lot of us agree with what you said. Many in the alternative media, Whitney Webb who I’ve interviewed and I’ve long held the same view as you that whatever is going on has come out of the west that it was led by the west. Francis Boyle, I think, would agree that I think he thinks it comes from Fort Detrick or wherever.\n\nI just interviewed the Dutch academic, Kees van der Pijl who had a long chapter in his book about the bio warfare stuff that would agree with you. Robert Kennedy, Jr. as you mentioned, also has a big chapter on that and a few others that I’m forgetting. So I would largely agree that whatever’s going on is instigated from the west. I would also mention, you mentioned Crimson Contagion. There’s a lot of other simulations. We had 2017 SPARS simulation.\n\nAnd then I think also in 2019, we had the eventual one in October. You had Urban Outbreak. I think it was also September, October 2019. But it was interesting in September of 2019, the Chinese held in Wuhan, I guess, it was maybe a minor simulation simulating a coronavirus outbreak. So who knows maybe the Chinese caught wind of what was going on and they were doing a simulation to prepare like a contingency. And I would just add that in 2019, I was living in Kazakhstan at the time right near to China and in December of 2019, my whole family and I got a really a bad case of symptoms of like pneumonia or similar to COVID. It was really strong.\n\nSo again, that would be anecdotal evidence adding to what you’re saying. And then I guess the question would be, if we’re talking about this in the context of the new cold war, biological warfare, you said it was a punch against China’s economy, supply chain. Do you think they met their goal or was it maybe like a first phase? What do they expect? Is there a second phase to this attack? And as well, hasn’t it damaged America’s, and Europe’s, and Canada’s economy and supply chains?\n\nOh, entirely. I mean, what I should say is that also with regards to those exercises, the Crimson Contagion exercise, the Event 201 exercise, I don’t think there’s any hard evidence that any of the people associated with those exercises were aware of what was happening. In other words, under the scenario I’m talking about, a small group of conspirators decided to launch these attacks. Probably the initial 2018 and 2019 viral epidemics targeting China’s poultry and pork supply were obviously put in place years before. But in terms of the anti personnel attack that occurred in the end of 2019, if a small group of individuals were planning something like this, it’s easy… And they were near the top of the American government.\n\nIt’s easy to imagine that they just casually shifted other groups into thinking about the idea. It’s not that they would go, for example, to the world economic forum people or these other groups doing the exercise and saying, “We expect we will be launching a bio warfare attack against China in eight months or in a year.” But it’s more that they would urge those people about the dangers of bio warfare, the dangers of the mysterious virus suddenly appearing and suggest that exercise be held to protect America against any unexpected health threat of that type.\n\nSo in other words, simply because these exercises were organized by a certain group, doesn’t mean that group was at all informed of what was happening. But they probably would’ve been in the general orbit of those people who were informed and were organizing it. And they would’ve simply shifted efforts in that direction so a\n\ns to protect America. And the end result, I mean, the point about it is the only reason China was able to control the epidemic, I mean, China didn’t even know that the virus was there until right at the end of December. Just a few weeks before the Lunar New Year holiday travels.\n\nWith Wuhan being a key transit hub for the entire country, if China had not reacted the way it did, the virus would’ve spread throughout the entire country and become endemic and uncontrollable with tremendous disruption for China. The point is China controlled the epidemic through the largest lockdown, an unprecedented lockdown in history that was a 700 million Chinese were in temporal lockdown throughout the entire country. A lockdown a thousand times larger than the largest lockdown in the history of the world.\n\nNobody would’ve expected the Chinese government to take such incredibly forceful action. They’ve never done anything like that before. And if they hadn’t taken such action, the disease would’ve spread out [over] the entire country with devastating results for China’s society and economy. When the disease then started leaking back into the United States, China had successfully controlled [it] through that sort of lockdown. I think what probably happened was that since America botched the production of its first CDC testing kit and the Trump administrations ignored the problem in hopes it wouldn’t occur here, basically, the disease started spreading here.\n\nAnd since the government didn’t really know what to do. Some of the local state authorities starting with actually my own health authority here in Santa Clara County and Silicon valley, and later in California implemented the same sort of lockdown because it had succeeded in China. In other words, if you’re faced with a very highly contagious, dangerous disease, and you don’t know what to do with it, you simply would look at what was happening in China and say that, “Well, if they controlled it, maybe we should take the same action.”\n\nI don’t think there was any nefarious aspect to that, that was done. And in fact, at first, the Trump administration was very hostile to the notion of these lockdowns and resisted them initially. But when the disease starts spreading exponentially and it hit New York City so hard very early on, including it killed one of Trump’s friends and it ended up devastating a lot of the elite Wall Street groups and everything like that, there was a feeling that, “Well, we have to do something.”\n\nSo the lockdown measure was the only thing really anybody could think of. Now, originally, the lockdown was proposed as something that would just last two or three or four weeks. But the problem with the western lockdowns is they weren’t anything like as severe and harsh as the Chinese lockdowns. What the Chinese did was have an extremely, extremely sharp lockdown that lasted for a few weeks and within a month or two, most of the country was back to normal.\n\nAnd within two or three months virtually the entire country was back to normal because they stamped out the virus. The problem with the American lockdowns was that they were so porous, so leaky that they really ended up not being successful. [The libertarian/federalist effect in US society.—Ed) And since they weren’t successful and the government couldn’t think of anything else to do, the government continued the lockdowns off and on. Turning them on, turning them off for really most of a year.\n\nSo we ended up getting the worst of both worlds. We ended up having severe damage to our society and our economy because of the disruptions caused by the lockdowns while still probably about a million Americans died. I mean, the disease spread out over the entire country and probably about half of the American population ended up getting infected or something like that. So it ended up being a total disaster for the United States. But I don’t think it was an intentional disaster.\n\nThe fact that the government kept on changing its position. First, they were opposed to lockdowns. Then they supported lockdowns. Some states had them, some states didn’t. I mean, that’s the sort of total disorganization you’d expect from a very incompetently run government that doesn’t really know what to do, rather than a sort of centrally planned diabolical scheme to impose totalitarianism on the United States.\n\nI think basically what we’re looking at is tremendous American incompetence, which we’ve seen in a lot of other areas. I mean, the fact that when we left… I mean, there are flights from Afghanistan. It’s got to be one of the most humiliating things any major countries suffered. We were there for 20 years. We left, we thought the regime would last at least six months or a year, and it fell in five days, 10 days, something like that. A total humiliation.\n\nSo the fact that basically America’s government is so incompetent, so many different ways today, I think makes it much more plausible that they were incompetent with regard to stamping out the virus and most western governments have had exactly the same sort of problem. So that’s basically my take. It’s not malevolence for most of these government officials except for probably a tiny handful were involved in the bio warfare plot. I think it’s more just total incompetence.\n\nGeopolitics & Empire: So if this was a bio warfare attack against China and the east, and China knows this, do you think there will be further consequences now? So we’ve seen like everyone’s economies basically damaged. So do you think this will increase the chances of an escalation of a conventional or even unconventional conflict with China, nuclear war. There’s this talk about Taiwan and we’re seeing what’s happening with China’s ally Russia in Ukraine now. Do you think this bio war will increase the possibility of greater conflict in the near future?\n\nWell, I mean, certainly we’re right now in a very dangerous situation with both China and Russia with the Ukraine and with Taiwan, but I don’t think those are directly connected with what I strongly suspect was a bio warfare attack. First of all, there’s no proof it was an American bio warfare attack. I doubt whether the Chinese have any hard proof. In other words, it seems very plausible. Anybody can look at these pattern of events and a few more things I can also discuss, but it’s very different to have very strong suspicions of what happened and have actual proof of it.\n\nAnd since America and the west totally dominates the world media, if the Chinese level those sorts of accusations, unless they had hard proof, I think everybody would basically just consider it was Chinese insanity and that’s how the American media would portray it.\n\nIn fact, one of the interesting things that I discovered… As I said, the fact that the virus jumped so rapidly in just a few weeks from Wuhan, China to the holy city of Qom in Iran and hit the political elites in Iran, the only political elites in the world that have suffered such severe damage right after we assassinated Iran’s top military official, when that happened, I really thought myself months or a year later, why didn’t the Iranians suspect anything?\n\nIt seems so obvious what had happened. And then I discovered not only that the Iranians believed it was a bio warfare attack, but they publicly accused the United States of launching a bio warfare attack. Their media outlets said they believed the COVID outbreak in Iran was an American bio warfare attack directed against their government for obvious reasons.\n\nIn fact, the former president of Iran filed a formal complaint with the United Nations accusing America of having launched a bio warfare attack, but nobody in the west ever heard about it because the west controls the international media. Even though it was covered in the Iranian media and the Iranian top officials accused America, nobody in America found out about it. It was never in the New York Times. It was never in the mainstream media.\n\nIn fact, very few people, even in the alternative media, are aware that Iran specifically accused America of launching a bio warfare attack. And in some respects, I think Iranian media is stronger globally than Chinese media. The Chinese media is much more insulated. It’s obviously very dominant in China, but it’s really not very strong around the rest of the world.\n\nSo I think if China made these sorts of accusations, they would be ridiculed as being totally ridiculous just the way the Iranian accusations have been ridiculed, and denounced as ridiculous. So the other way of looking at it also is that according to all the estimates we have, the Chinese suffered a few thousand dead, I think about three or 4,000 dead from the virus. Almost no damage to their economy.\n\nLife in China went back to almost entirely normal within two or three months after the outbreak. And for two years now, life in China has been basically what it was before the outbreak. Though every now and then, there are small new outbreaks that they have to crack down on particular cities. Meanwhile, America suffered a million dead and our society has been devastated.\n\nNow, if the Chinese wanted to punish America for having launched this attack against them, what more could they do? I mean, America suffered a million dead. I mean, we basically had tremendous disruption in our societies. Most Americans spent a year or two years, much of it under lockdown. I mean, I can’t think of anything more that anybody could do to us. So it’s the old story of if you launch an arson attack against, for example, your neighbor’s house, but he puts down the fire and it spreads to your house and burns down your own house, your neighbor may be angry at you, but your house has been burned down.\n\nSo it’s not really clear what more he could inflict on you. It’s not just America. The whole west has been devastated. I mean, basically the Western world, America, Britain, Italy, France, Spain, Germany, all of our NATO allies have been hit very hard by this virus. And it might come back again. I mean, it’s perfectly possible there might be another strain that would appear, that would inflict a fifth wave on American society while the Chinese have suffered almost nothing at all.\n\nSo it’s clear right now, there is certainly the danger of war with China or war with Russia over Ukraine or over Taiwan. But those are the flash points rather than this possibility of America having launched a bio warfare attack against China. In any event, it wasn’t something done by the American government. I mean, a sign of how… Under the scenario, I’m talking about a sign of how disorganized and incompetent the government has become, the American regime has become ...that if this attack occurred, it occurred without the approval of the top American political leadership, which is… I mean, something like that is almost unthinkable in modern world history.\n\nI can’t think of any situation where this sort of attack would’ve been launched by one country against a major rival without the top leadership of that country [knowing about it]. Even being aware of what had happened. And Trump’s behavior, I mean, makes me extraordinarily skeptical that he was aware of what was happening when the virus came back to the United States.\n\nGeopolitics & Empire: We’ve seen clips where they were at press conferences, and I think people will remember Trump turns to Mike Pompeo saying… They were talking about something about a live exercise and Trump is like, “You didn’t tell me about this.” And so that confirms what you’re saying. One thing that comes to mind was I don’t know if you’ve seen it, but Whitney Webb and others have talked about the 2010 Rockefeller lockstep report, which predicts in 2010… Robert Kennedy and others have documented that they’ve been running these pandemic simulations for two decades now. So there was this Rockefeller report in 2010 saying that a virus would come out of China and that China would react as you laid out that they have very quickly, very harshly locking down and stopping the virus.\n\nThe report was basically saying that the rest of the world should do the same, and that the rest of the world [should] start to implement measures that remain permanent, that don’t go away. And that many other countries follow China’s model and the west starts to become more authoritarian. In my biggest fear now, we have these digital passports. I mean, just to get your thought on these digital passports, it seems like they’re not going to go away.\n\nSo then we’re going to need permission to do everything based on these passports. There’s people now in another state here in Mexico, you can’t go into a supermarket without the passport that verifies that you’ve been… You can’t buy food unless you’ve been vaccinated. You can’t go to the park unless you’ve been vaccinated. In Italy, pensioners can’t go into the bank to get their pension unless they’ve got the digital passport.\n\nI’m afraid of this because I feel later things can be added to this if it’s not taken away, other [things] required besides vaccines. So have you thought about this part, like the vaccine passports?\n\nWith regard to the vaccination issue, I mean, as far as I can tell, based on what I’ve read in the media and what I followed, I mean, the vaccines seem ineffective at preventing infection or transmission of the virus, but they do seem to drastically reduce the lethality of the virus if you do become infected. So overall, I think probably it’s perfectly logical that the government would support these vaccination efforts the way they have. I don’t have any strong feelings about that. In other words, I think probably these vaccination mandates are a bad idea and also an illogical one, since the vaccines aren’t really all that effective in preventing people from becoming infected or transmitting the virus, but only in a sense help the individual person from surviving the virus.\n\nIt seems to me forcing people to become vaccinated doesn’t make much sense since it’s not really communal good, it’s more of a personal issue. And if people don’t want to become vaccinated and end up getting much, much more sick or even die as a consequence, that in a sense is more of their own decision to make. I certainly agree that the way the government has handled this has been very disorganized and counterproductive.\n\nIt’s perfectly possible that these vaccines are much more dangerous than past vaccines especially because they’ve undergone so little testing compared to traditional vaccination policies. But on the other hand, and it’s also very possible that certain elements of Americans society [think Big Pharma, and especially Pfizer.—Ed] or the American government or the American economy might take advantage of this crisis for their own ends.\n\nSo for example, some of these restrictions being opposed, or for example, the fact that the crisis was used to open the spigots of the federal reserve and boost the stock market incredibly. I mean in a ridiculous way. I mean, trillions of dollars flowing into the stock market. I mean, that certainly was a bad policy on the part of the American government.\n\nI think it reflects the power of some of these groups that were able to take advantage of the crisis to implement these policies. But that’s a long way from saying that they were actually behind the policy, behind the crisis in the first place. And to give you an example, when the financial meltdown took place in 2008, the Wall Street mortgage bubble, a lot of these same groups were able to get massive bailouts of the financial services industry.\n\nThey didn’t create the financial crisis, but they were able to use their political power to bail out all their banks and other organizations and basically take advantage to get trillions in federal funding. So just because somebody takes advantage of a crisis doesn’t necessarily mean they had anything to do with fostering it. And the fact that America, for example, had had these training exercises for a number of years, I mean, in some ways once the SARS epidemic broke out in China in 2002, 2003 with a very highly lethality rate, I think it was probably 15% lethal or 20% lethal.\n\nIt only basically, fortunately didn’t spread very rapidly and it was only contagious after somebody showed symptoms. So that’s the reason they were able to stamp it out. But once you have a deadly virus like that appearing in China, it seems not entirely implausible that World Health Organization or the international bodies you mentioned would consider the possibility of future viruses appearing, especially after MERS appeared then, I think around 2007, 2008.\n\nSo it’s not totally surprising that some of these organizations would’ve organized plans or exercises in 2010 or 2012 or 2014 to cope with the same sort of thing. The example I was citing though was a very specific exercise that was held in the United States by our chief bio warfare expert from January to August 2019 to deal with the outbreak of respiratory virus that would appear in China and that respiratory virus appeared in China two months after the end of the exercise.\n\nSo when you’re talking about coincidences, that’s much sharper than something that might have happened in 2010 or 2012. There’s actually one other example I should cite, which I think personally represents the closest thing we have to a smoking gun in the entire situation. And that’s once America showed itself entirely unable to cope with this massive disaster in the country.\n\nIn other words, when tens of thousands of Americans were becoming infected and dying, when the Trump administration couldn’t figure out what to do, and when the media, which was obviously very hostile to Trump, was ferociously attacking him on all those grounds, then ABC News came out with a very interesting story. Four American intelligence officials went to ABC News and explained to them that the disaster that we were suffering was not their fault, not the fault of the American intelligence community, but the fault of the top political leaders like Donald Trump.\n\nWhat they said was they themselves had produced a secret intelligence report, which they distributed to Trump and all of our top officials describing a dangerous, possibly catastrophic disease epidemic breaking out in Wuhan, China, and that it was the fault of Trump and our top officials who didn’t take that report seriously and didn’t do anything to cope with the disaster, which is exactly what intelligence officials do. They would want to cover themselves by saying it wasn’t they who were asleep at the switch, it was Trump or the top government officials.\n\nThat story got on ABC. It got a lot of attention. I think it ended up getting 1,800 comments. It was massively covered in the media. And then suddenly somebody noticed something. The date at which the report had been distributed was November. November was before anybody was aware of the outbreak in Wuhan, China. The Chinese government didn’t become aware of it until over a month later. Most of the estimates when people have tried to back in when patient zero occurred, most of the estimates based on the epidemiological and genetic studies that they’ve done show the patient zero, the first person infected in Wuhan, China probably occurred towards the end of October or the beginning of November.\n\nSo that secret government report by the American defense intelligence agency that was the distributor, to top leaders, was produced before anybody was aware of the outbreak in China. Now, once people realized that, immediately the Defense Intelligence Agency announced that the report didn’t exist. Even though it had four intelligence sources who revealed its existence to ABC news, and it had been promoted very heavily. They said, “Nope, it was a false report. The report never existed.”\n\nBut then Israeli TV, a couple of weeks later came out with a report saying, “Of course the report existed. It had been sent to Israel. It had been sent to our NATO allies and the report had been produced in the second week of November.” So we’re talking about a report, a secret government report by the Defense Intelligence Agency describing a potentially catastrophic disease outbreak taking place in Wuhan, China when there were probably five or 10 people in a city of 11 million who’d so far become infected and were just starting to feel a little bit sick.\n\nThere was absolutely no way the American government could have known of it. So under those circumstances, when the Defense Intelligence Agency distributes a secret intelligence report, warning of a catastrophic disease outbreak taking place in Wuhan China, before there is a catastrophic disease outbreak in Wuhan, China, that seems awfully close to a smoking gun. And again, it reinforces the idea that those elements of the American government that had been behind the attack decided to further strengthen America’s defenses by probably leaking the report to some people in the Defense Intelligence Agency saying that they had some secret intelligence, that there was some sort of disease outbreak going on in Wuhan, China, and that we should gird our defenses against it.\n\nUS intelligence agencies warned of virus in November | WNT\n\nSo in other words, we had planning exercises for what happened. We had a secret intelligence report for what happened. We were preparing. Elements of our government were preparing themselves as much as possible to cope with the threat of a disease outbreak. But when it actually happened, the rest of our government was just so incompetent and lackadaisical that those efforts really had no impact at all.\n\nOh, and one other thing I should mention, another remarkable coincidence, and this came out very early towards the end of January. Wuhan, China as a city that most Americans have probably never heard of, and I’d certainly never heard of until the outbreak took place. It’s a large city. It would be the equivalent of a Midwestern city like Chicago that doesn’t have the visibility of a New York or San Francisco, but it’s certainly a major transit hub.\n\nNow, it turns out, again, the epidemiological and genetic mutational evidence tends to show that patient zero, the initial outbreak occurred towards the end of October or the beginning of November. And that was known fairly early on. That was the estimate people focused on. And then it turns out, I found out from a Chinese blogger that right towards the end of October, Wuhan had been host to the international military games in which 300 American military officers participated along with thousands of servicemen from around the world.\n\nSo we had 300 American servicemen going to Wuhan, China and exactly at the time when they were there is when the initial disease outbreak seems to have occurred. Now, there have been some statements, some claims that for example, some of them may have been infected. Some of the participants may have been infected and there seems very, very little evidence of that. In fact, almost no evidence at all.\n\nBut on the other hand, if you have thousands of military servicemen from around the world including 300 Americans participating in the military games in Wuhan, China, doing sightseeing in the city and everything like that, that would’ve been an ideal opportunity for America to have slipped a couple of operatives into that group who would then have surreptitiously released the virus.\n\nSo in other words, normally China is more of a close society and it’s not easy to probably send operatives there to release the virus in a major city, especially a city like Wuhan, which doesn’t have the high profile of Shanghai or Beijing. But if you have thousands of military servicemen from all over the world in that city, traveling around sightseeing, that would be the absolutely ideal cover to do something like that. [Wuhan is also centrally located in China, making a vector contagion that much more effective.—Ed)\n\nSo maybe it’s an entire coincidence, but we are talking about a situation ..like...if 300 Chinese military servicemen had visited Chicago and immediately after they left, we suddenly had a mysterious viral outbreak in that city, a lot of Americans would be extraordinarily suspicious. So we’re talking about putting together all of these different strands. And I think most of these strands, the fact that there seemed to be so much preparation that was done on America’s part to prepare against such an outbreak leaking back into the United States tends to decrease the likelihood that any sort of outbreak in the United States was intentional.\n\nAnyway, we’re talking about basically China being hit, Iran being hit, and then the virus spreading to these other European countries. It’s not clear why anybody would want to hit Italy or hit Spain or hit Britain. And I think those outbreaks were exactly what they seemed to be. In other words, when you look at a country like Italy, the outbreak took place in Northern Italy, Lombardy area, where there are 300,000 Chinese living and working. And it occurred right after Chinese Lunar New Year.\n\nSo probably hundreds or thousands of them had traveled home, many of them to Wuhan and it come back to Italy and then naturally they spread the virus there. In the same way, the virus then broke out in Spain and there are 150,000 Chinese living in Spain there. So you’d expect it to happen there. While on the other hand, the whole of Iran has one of the world’s lowest Chinese populations, only a few thousand Chinese live in Iran, and almost all of them live in Tehran, the large capital city. Very few of them in Qom. While on the other hand, it was the holy city of Qom where the disease suddenly broke out.\n\nSo you really would have to say that if you were producing a list of the most likely cities, where an outbreak in Wuhan, China would soon spread...You’d expect cities in East Asia, if you realize that 300,000 Chinese are living and working in Lombardy, you might expect it to go to Italy. You might expect the United States because we have a large Chinese population. But probably the holy city of Qom would be absolute lowest on your list around the world for the disease to suddenly spread there. And that’s the second place it appeared after Wuhan, China, targeting China’s political and military elites right after America assassinated Iran’s top military leading.\n\nSo in the same way, just as you were saying about war with China, I just can’t see the Chinese feeling that anything like that is necessary after the devastation that we’ve suffered. And then the same way with Russia. I mean, Russia has suffered very much from the outbreak as well. I think mostly because it leaked into that country. But the flash point with Russia right now is over the Ukraine obviously.\n\nSo I think basically America, elements of the American government were probably involved in the attack. It backfired horrendously. It’s the worst blowback in the history of the human species. It’s probably worse than every other example of blowback in world history combined. I think the sooner that America admits and the sooner the American media starts recognizing what probably happened, I think the sooner we may start realizing that bio warfare weapons that we’ve probably spent $100 billion on over the years are just too dangerous to have around. And they’re a very bad thing to put in the hands of people that could end up using [them].\n\nGeopolitics & Empire: Yeah. And just on your point about black operations, I mean that’s how they work. We can see in many historical examples of whether it’s the CIA’s shenanigans during the Cold War or Operation Gladio by NATO, they’re usually carried out by small groups who are in the know while the rest of the, as you said, governmental apparatus does not know about them. [Sometimes by design, to allow \"plausible denial\"—Ed.] I guess, given everything that you’ve laid out, how do you see the pandemic ending? Will it ever end? Where do we go from here? You commented on the military aspect. You don’t think there will be a military war with China. But do you see any other fallout, whether political, social, or economic? Where do we go from here?\n\nWell, it’s very difficult to tell what direction things will go. I mean, we’re talking about, again, I think, the most impactful global event since Second World War, something far greater than any other event. The disruption to our society, just as you say, all these vaccines in passports, the tremendous changes taking place, it’s very difficult to say where things will go even if there are no additional strains of the virus that end up producing additional waves.\n\nI mean, it’s very difficult to say. One thing I really should say is that it is a little bit shocking to me that both the mainstream and so much of the alternative media have refused to even consider these possibilities. I mean, just to give an example, a few weeks ago I ended up looking… The Wall Street Journal had a full page of book reviews on all the major books that have come out right now, looking at the possible origins of the virus.\n\nMost of them now focus on the lab leak hypothesis. That seems to be where most of them are heading, a manmade virus that leaked out of the Wuhan lab. But none of them, none of them even raised the possibility of a deliberate bio warfare attack, despite all of this evidence that I’ve laid out. And that’s even true of the alternative media. I mean, an awful lot of alternative media people seem very reluctant to simply raise these possibilities, partly because it might be too worrisome that if America basically… I mean, 20 million people probably have died around the world, probably 4 million people in India, a million people in the United States.\n\nI mean, we’re talking about a massive disaster that very likely was due to rogue elements of the American government of Donald Trump. And the irony is that you have all of Trump’s enemies in the media who’ve attacked him on every possible ground. The fact that he sent out a nasty tweet against somebody at 2:00 AM. But they’ve been very determined to avert their eyes from the very real likelihood that some of the people he hired and put into place at the top of administration were involved in these disastrous bio warfare attack that has killed a million Americans.\n\nSo it seems to me first stage is for people at least to start discussing this issue. I’ve done what I can for 20 or 22 months now. I’ve written a series of articles. [See below.] And the fact one other thing I should mention, which is quite intriguing is when my first article in the series came out, which was an April of 2020, it ended up getting massive media attention, more page views than anything I’d written for many, many years.\n\nAnd within days, our entire website was suddenly deranked by Google and we were banned by Facebook. So obviously, when you’re entirely deranked from Google and banned by Facebook, getting subsequent information out is proving much more difficult. And it could be that quite a lot of people look at that sort of pattern and say that they consider it something that they like to avoid discussing for fear of getting kicked off YouTube or kicked off Twitter or banned. Then a number of people told me flat out that they’re reluctant to discuss this with me on their podcasts because it could have negative impact on their career or something like that.\n\nAgain, those are personally valid, personal reasons to have, but I mean we are talking about something that’s killed a million Americans, that’s devastated the world. One reason I think the media is so reluctant even to raise these issues is that the circumstantial and even more than circumstantial evidence for an American bio warfare attack is so overwhelmingly strong. The fact that it hit China and Iran right when we were in international confrontation with China and Iran. The fact that we have the world’s largest and most long-term bio warfare program.\n\nI mean, we’d had these exercises to guard against bio warfare blowback right before the bio warfare attack occurred. I mean, if the media ended up discussing any of these things, I think very quickly an awful lot of Americans would decide that they were probably true or reasonably likely... and the whole thing would unravel. So in other words, nobody wants to be the first person to go first on something like that, which is why I think it’s up to the alternative media to try to at least get these ideas into circulation so that the mainstream media will have to at some point cover them or explain why they’re not covering them.\n\nGeopolitics & Empire: Yeah. I was just going to comment on the censorship issue. I mean, I was the first to do the interview with Boyle in January. I think I published it January 29 or 30th of 2020 and it was my biggest video. 300,000 views on YouTube. I would’ve hit a million and Google deleted it. It’s still deleted. And that hurt my growth for the podcast because if it would’ve kept going viral, it would’ve helped the podcast grow, but it’s still banned. But I see now on YouTube there are more videos, a few more videos discussing what we’re talking about that are on YouTube.\n\nBut in general, I think the pandemic allowed them to exercise an insane amount censorship, I mean, just this crazy that we haven’t seen before, de-platforming the president and mentioning Google ranking. So my new website just went live on Friday, the weekend and I noticed on the Google search engine when I type in Geopolitics & Empire, it does not appear at all.\n\nGeopolitics & Empire: At all. And then I go to DuckDuckGo, Swisscows, Qwant, Yandex and you get the website. My website is at the top and all of my other channels, but on Google, it’s just gone. I don’t exist. It’s insane.\n\nExactly. In fact, one thing that happened to me, and at that time deranking wasn’t as common as, since it began. So I was shocked when it happened. I’d actually done a lot of writing on racial and ethnic issues over the years. And one of my articles on crime rates, Hispanic crime rates had spent 10 years as the number two ranked article in Google out of 200 million articles.\n\nSo we’re talking about something as large as anything. If you Google the word communism, you get something like 150 million pages, while Hispanic crime, you get 200 million. And it was ranked number two all those years. And I really was quite proud of it. Google disappeared it. And in fact for about six or eight months afterwards, it was still ranked number one or number two on DuckDuckGo and Bing. But it then a few weeks ago I checked and it disappeared from those as well.\n\nSo in other words, we’re talking about a situation where certain [inaudible 01:01:11], certain gatekeepers on the internet can basically make whatever they want disappear, vanish without a trace. And it’s really [a] very unfortunate situation. That’s obviously happening to more and more people these days and becoming more of really a factor. To give another example, a Pulitzer surprise winner, one of the authors we’ve published, Sydney Schanberg, you might or might not know his name. He’s the guy who wrote the book that became The Killing Fields movie.\n\nHe won a Pulitzer surprise. He was a top editor at the New York Times. The Killing Fields is one of those classic Vietnam war movies probably won an Oscar and everything like that. His article that we ran, it had to do with some of the background of John McCain. And it had been ranked always near the top of all the search engines for all those years and then suddenly it was disappeared. If you go on it, neither our website or any other website has that article there.\n\nWhen you have a situation where a lot of things can be kept quiet, you sometimes end up with very unfortunate developments happening like this. And that’s why I think it’s really the responsibility of the alternative media to start pressing these issues as much as possible to really force more people in the mainstream media to at least consider them.\n\nGeopolitics & Empire: Yeah. And they’ve effectively put us in what my past guest historian, Edwin Black, has called the algorithm ghetto. I have one just last question that maybe slightly off topic, but for me, it’s also important. I’m curious about the Unz Review, I guess, view or perspective ideology. Here in Geopolitics & Empire, I talk to everyone kind of like what you do from the left and Marxists to conservatives, to the right, libertarians and many others who don’t fall into a cute little category. And the vast majority of listeners love the fact that I have such a wide variety of guests. But with each episode I will get complaints about why I interviewed this commie or that right-winger, I simply don’t care because it would be boring to pigeonhole myself into a single category.\n\nI think you do something similar on unz.com. In the about section on your website, it says, “You are neither right wing or left wing, but are both.” Could you speak to this and to the importance of listening to all viewpoints?\n\nOh, exactly. In other words, basically we build ourselves as an alternative media website. In other words, we basically try to provide a mix of views from the right...right wing, left wing, libertarian, all sorts of different perspectives. And in fact, many of those perspectives to be honest are perspectives that I, myself may not very much agree with both on some of these racial or ethnic issues. And also for example on some of these vaccination issues. So we’d really try to offer as much of a broad spectrum of alternative perspectives as possible.\n\nI’d say probably if I had to go through it, I’d say probably about 40% to 50% of our writers would be more classified as being on the right wing or conservative side, probably 30 to 40% on the left wing side and then maybe another 20% or so difficult to characterize, or libertarian, or so mixed with so many different views.\n\nIt would be hard really to put in the category. In some ways, I would put myself in that same category. In other words, over the years… In the past, I actually had been much more heavily involved with the mainstream media. I published quite a lot in the New York Times or the Wall Street Journal or various right wing magazines or The Nation on the left wing and that sort of thing.\n\nSo I’ve really always tried to look at issues on a case by case basis and draw my own conclusions based on where the evidence goes with my scientific background being what drives me. So most recently in the last three or four years, I’ve really started something that I call the American Pravda Series, which has been really a very long series. It probably runs by now around three or 400,000 words. It’s counting all the articles in dozens and dozens of articles. It’s been viewed many millions of times, and it really deals with a lot of the historical or other elements of American history for which there’s a tremendous amount of solid evidence if you probe into it, but which is often ignored by the American media.\n\nIn some ways it functions as a counter narrative as I say, of the last 100 years of Western history, going back to the First World War, The Great Depression period, the Second World War, the more recent events since then. Some incidents that sometimes put in the conspiracy theory category like the Kennedy assassinations or the 9/11 attacks. Issues of the Second World War, or most recently, obviously the COVID outbreak, which I think there is quite a lot of evidence was probably an American bio warfare attack against China and Iran.\n\nSo in effect it deals with things that are covered by the media I view in a very skewed way and tries to go through the original sources and come up with a different perspective. In some ways, it’s certainly by far the longest and most comprehensive thing I’ve ever published. And even though the individual articles cover all these different areas, the common theme is that the mainstream history and the mainstream media can often not be trusted on controversial issues.\n\nGeopolitics & Empire: All right. Yeah. I think I’ve read some of those ...I read on Unz from time to time. Is there any final thought for us?\n\nNot really. I’m just hoping that… I’ve actually done very few… This is one of my first video podcasts and it was suggested to me that even though I spent most of my time writing articles, probably getting these ideas out via podcasting with some of the podcasters like you and others might be a useful means of spreading the ideas into circles that would be less likely to read some of my detailed articles.\n\nAlso, the other thing about is sometimes when these ideas are presented orally or verbally, or visually, certain aspects come across that might be missed in a dry written narrative. So in the past almost all of my work has been done either in written form, or five or 10 years ago I sometimes used to be on cable a certain amount of time, but I mean this is a new experience to me and I’m really hoping to get a little bit more comfortable with it and get it out to a wider audience.\n\nGeopolitics & Empire: Yeah. I’m always trying to find a guest that no one is talking to. I’m kind of bored. There’s a lot of people that do their podcast and I’m like, “He’s just going to tell me the same thing that he’s told to 10 other podcasts.” I’m trying to find diamonds in the rough. I’ve had a number of guests that have been the first time they spoke with me was their first video podcast. So I’m always trying to find new interesting people.\n\nThis is kind of like the market. Like as you said, podcasting is growing and whether it’s just the audio or half of the people listen to just the audio version of this or the other half the video. And so that’s becoming popular. And just as you said, there are things that you get from the audio or the video that you don’t get from the text. Apart from unz.com, are there any other websites or books or projects we should know about or just go to the website?\n\nWell, I mean the website really would be sort of the main place for them. A lot of what we publish is simply material that we syndicate from other websites, right wing websites, left wing websites, independent bloggers, that sort of thing. We also publish a lot of material ourselves. And also one thing I’d actually done, and that, I actually been what I’d spent most of the early 2000s working on, is to build up a massive content archive library of America’s leading periodicals of the last 150 years.\n\nIn other words, what I ended up doing was digitizing a couple of hundred of America’s leading opinion publications of the last 150 years. The complete archives, for example of publications that are still around like The Nation or The New Republic or Harper’s, and then publications like Century Magazine or The Forum, or for example, Saturday Review, which were very important and dominant 50, or 60, or 80 years ago, but are forgotten right now.\n\nOne of the reasons I ended up actually starting on the American Pravda Series is as I started going through those archives, I really discovered that much of my understanding of American history from 50 or 60 years ago, what I’d studied in my college courses or in reading books was very misleading. And when you actually read the articles, the articles that were published by America’s leading periodicals of 80 or a hundred years ago, they sometimes present a picture of history that’s very different than what would you get in today’s current media or in your college textbooks.\n\nSo that started me really thinking more about how there might be a lot of factual information out there that was simply unaware of, and that led me to start investigating a lot of these other historical issues, which I ended up putting into my series.\n\nSo in other words, right now, the website has probably about a million or 2 million articles from all of these old publications available at your fingertips and they used to be much more easily available on Google, but since we’ve been deranked from Google, they’re harder to find. Though, in many cases, this website is the only source of them anywhere on the internet. So people still find them because even if you’re deranked and at the bottom of all of the Google searches, if there’s nothing else, anywhere else on the internet, you can still find it that way.\n\nAlso, I’ve ended up digitizing quite a number of more recently published books of various controversial nature in a number of different subjects. So the website is really very large. I mean, we probably get, oh, I think it’s probably about 20 or 30 million words of comments a month, something like that.\n\nSo we get thousands of comments a day and many of the comments are very substantive. I’ve actually built the website myself. I’m a software developer by recent background. So a lot of the features on the website are fairly unique, I think, make it much more useful for extended discussions that sometimes can go 200,000 words or 150,000 words, just to give you one example.\n\nI’m somebody very skeptical of a lot of the anti-vaccine arguments that are out there, about the vaccines being very dangerous and I ended up actually doing a lengthy interview expressing skepticism which generated 200,000 words of mostly very hostile comments and critiques, and then was continued in two additional open threats on the same subject. So after about a month of that, we were actually told that we probably had 2 million words written by anti-vaxxers on our website, which probably made it the single largest repository of anti-vaccine argument anywhere in the internet, even though I disagreed with the ideas involved.\n\nSo the whole thing about it is we try to be very open to all these different perspectives and people look in the website. They can see the different perspectives that we host, including my own.\n\nGeopolitics & Empire: Yeah. It’s very active. As you said, you’ve been nuked off of Facebook and deranked on Google. Hopefully they don’t nuke the website. There’s been talk now of… That’s the final frontier trying to take down websites and with the whole Joe Rogan Spotify thing now. They’ve been in the last few years, putting out the establishment, putting out articles. They’re angry that they can’t touch podcasts. They’ve set their eyes on trying to take us down, podcasts, but we’ve got the godfather of podcast, Adam Curry, I think he’s working to make podcast medium Bulletproof to create a network to protect podcasts. So hopefully they can’t get to us, touch our websites or our podcasts.\n\nAll right. So everyone be sure to bookmark unz.com. As I said, I often read material from there. In the description, I’ll leave a few key links that will lead listeners to key articles about what we’ve been talking about. It will give important background information. Again, Mr. Unz, thank you for being on Geopolitics & Empire.\n\nHey, great to be here.\n\nGeopolitics & Empire: I hope you enjoyed this Geopolitics & Empire podcast. The website is geopoliticsandempire.com. I encourage you to sign up for the free email list that goes out with each podcast and every weekend with a collection of news headlines. The newsletter and website are our last lines of defense. We’re being censored and de-platformed. It’s nearly impossible to find Geopolitics & Empire under Google search engine. We’ve been blacklisted. YouTube frequently takes down our videos with strikes. Facebook restricts our page. Reddit and Twitter take down posts. And after the Associated Press mentioned Geopolitics & Empire in a 2021 article co-written with NATO, our Patreon account was terminated. Vimeo also terminated our pro account.\n\nThe best freeway to help Geopolitics & Empire is to leave a review on Apple Podcasts or elsewhere and subscribe to all of our media channels. You can find the video broadcast now on five platforms, Odyssey, Rokfin, Rumble, BitChute and Brighteon. You can find the audio broadcast on the podcast ecosystem, SoundCloud, Apple, Spotify, and so on. My current favorite social media channels are Twitter and Telegram, but you can all also find us on Gab, MeWe, Minds, Float, VK, Instagram, Facebook, and LinkedIn.\n\nFinally, Geopolitics & Empire is in dire need of funding to continue. You can leave a donation, purchase a consultation with the host or become a member to receive additional benefits. We also produce a weekly broadcast called Dissident Thinker for members and Rokfin subscribers only. We will continue to fight the good fight come hell or high water. Thank you for listening.\n\nA theoretical physicist by training, Mr. Unz serves as founder and chairman of UNZ.org, a content-archiving website providing free access to many hundreds of thousands of articles from prominent periodicals of the last hundred and fifty years. He also served as publisher of The American Conservative, a small opinion magazine, from 2006 to 2013 and had previously served as chairman of Wall Street Analytics, Inc., a financial services software company which he founded in New York City in 1987. He holds undergraduate and graduate degrees from Harvard University, Cambridge University, and Stanford University, and is a past first-place winner in the Intel/Westinghouse Science Talent Search. He was born in Los Angeles in 1961. He has long been deeply interested in public policy issues, and his writings on issues of immigration, race, ethnicity, and social policy have appeared in The New York Times, The Wall Street Journal, Commentary, The Nation, and numerous other publications. 999999 In 1994, he launched a surprise Republican primary challenge to incumbent Gov. Pete Wilson of California, running on a conservative, pro-immigrant platform against the prevailing political sentiment, and received 34% of the vote. Later that year, he campaigned as a leading opponent of Prop. 187, the anti-immigration initiative, and was a top featured speaker at a 70,000 person pro-immigrant march in Los Angeles, the largest political rally in California history to that date. In 1997, Mr. Unz began his “English for the Children” initiative campaign to dismantle bilingual education in California. He drafted Prop. 227 and led the campaign to qualify and pass the measure, culminating in a landslide 61% victory in June 1998, effectively eliminating over one-third of America’s bilingual programs. Within less than three years of the new English immersion curriculum, the mean percentile test scores of over a million immigrant students in California rose by an average of 70%. He later organized and led similar initiative campaigns in other states, winning with 63% in the 2000 Arizona vote and a remarkable 68% in the 2002 Massachusetts vote without spending a single dollar on advertising. After spending most of the 2000s focused on software projects, he has recently become much more active in his public policy writings, most of which have appeared in his own magazine.\n\n*Podcast intro music is from the song “The Queens Jig” by “Musicke & Mirth” from their album “Music for Two Lyra Viols”: http://musicke-mirth.de/en/recordings.html (available on iTunes or Amazon)\n\nMuch more detailed information may be found in my long series of articles on the subject, which began in April 2020. This series runs about 80,000 words and is also available as a freely downloadable eBook:\n• American Pravda: Our Coronavirus Catastrophe as Biowarfare Blowback?\n\n The Unz Review\n• April 21, 2020\n• 7,400 Words\n• American Pravda: Covid-19, Its Impact and Origins After One Year\n\n The Unz Review\n• March 15, 2021\n• 8,700 Words\n• American Pravda: “The Truth” and “The Whole Truth” About the Origins of Covid-19\n\n The Unz Review\n• May 10, 2021\n• 6,400 Words\n• The Covid BioWeapon: Made in the USA, Aimed at China\n\n The Unz Review\n• June 15, 2021\n• 4,400 Words\n• Interview by Mike Whitney\n• American Pravda: Covid Epidemic as Lab-Leak or Biowarfare?\n\n The Unz Review\n• July 12, 2021\n• 13,100 Words\n\nThe views expressed herein are solely those of the author and may or may not reflect those of The Greanville Post. However, we do think they are important enough to be transmitted to a wider audience.\n\nIf you find the above useful, pass it on! Become an \"influence multiplier\"! \n\n The battle against the Big Lie killing the world will not be won by you just reading this article. It will be won when you pass it on to at least 2 other people, requesting they do the same.", "opengraph": {"site_name": "The Greanville Post", "title": "Ron Unz: COVID-19 Was an ‘Anti-Economy’ Bioweapon by the U.S. Against China | The Greanville Post", "description": "RON UNZ—It seems to me, the interesting thing about the debate is that there’s an obvious third possibility, which just as you say has been discussed in fringe areas of the internet from the beginning, but has really been confined to those fringe areas. And the third possibility is that it was a deliberate bio warfare attack. In other words, the virus was biologically engineered to be moderately lethal, but extremely, extremely contagious. So in effect, it was designed to be an anti-economy bioweapon, not an anti-personnel bioweapon and that with the fatality rate of about 0.5 to 1%, obviously it wouldn’t wipe out a population, but it would kill a sufficiently large fraction of the population, and it was so extremely contagious that countries that were infected with it would have to take drastic measures that would disrupt their economy to control it. And that’s exactly what happened in China.", "url": "https://www.greanvillepost.com/2022/02/04/ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-u-s-against-china/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/02/ron-Unz.jpeg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2018/04/cropped-fight-racism-capitalism-1.jpg", "https://geopoliticsandempire.com/author/admin_61bb72ix/", "https://www.greanvillepost.com/wp-content/uploads/2022/02/ron-Unz.jpeg", "https://www.rokfin.com/post/71445/Ron-Unz-COVID19-Was-an-AntiEconomy-Bioweapon-by-the-US-Against-China", "https://rumble.com/vtxaju-ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-u.s.-against-china.html", "https://www.bitchute.com/video/lsuiaTgZ-zs", "https://www.brighteon.com/3325c6df-0982-4829-90e3-a7c19a1cbdd1", "https://www.youtube.com/watch?v=lsuiaTgZ-zs", "https://soundcloud.com/geopoliticsandempire", "https://soundcloud.com/geopoliticsandempire/ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-us-against-china-257", "https://soundcloud.com/geopoliticsandempire", "https://soundcloud.com/geopoliticsandempire/ron-unz-covid-19-was-an-anti-economy-bioweapon-by-the-us-against-china-257", "https://geopoliticsandempire.com/donations", "https://geopoliticsandempire.com/consultation", "https://geopoliticsandempire.com/become-member", "https://geopoliticsandempire.com/sponsors", "https://www.unz.com/page/covid-biowarfare-articles", "https://www.unz.com/runz/american-pravda-anne-frank-sirhan-sirhan-and-aids", "https://www.unz.com/runz/covid-deaths-and-vaxxing-deaths", "https://www.youtube.com/watch?v=-mFFcKo-gLY", "https://www.unz.com/", "https://twitter.com/UnzReview", "https://www.greanvillepost.com/wp-content/uploads/2022/02/Robert-Kadlec-876.jpeg", "https://www.youtube.com/channel/UCBi2mrWuNuyYy4gbM6fU18Q", "https://www.youtube.com/channel/UCBi2mrWuNuyYy4gbM6fU18Q", "http://geopoliticsandempire.com", "http://musicke-mirth.de/en/recordings.html", "https://www.greanvillepost.com/wp-content/uploads/2018/11/separator-authorbox.jpg", "https://www.unz.com/page/covid-biowarfare-articles/", "https://www.unz.com/ebook/covid-catastrophe-ebook/", "https://www.unz.com/page/covid-biowarfare-articles", "https://www.unz.com/runz/american-pravda-our-coronavirus-catastrophe-as-biowarfare-blowback/", "https://www.unz.com/runz/american-pravda-covid-19-its-impact-and-origins-after-one-year/", "https://www.unz.com/runz/american-pravda-the-truth-and-the-whole-truth-on-the-origins-of-covid-19/", "https://www.unz.com/runz/american-pravda-george-orwells-virus-lab-leak/", "https://www.unz.com/mwhitney/the-covid-bioweapon-made-in-the-usa-aimed-at-china/", "https://www.unz.com/runz/american-pravda-the-covid-epidemic-as-lab-leak-or-biowarfare/", "https://www.unz.com/runz/american-pravda-waging-biological-warfare/", "https://www.unz.com/runz/american-pravda-confronting-covid-crimestop/", "https://www.greanvillepost.com/wp-content/uploads/2019/08/TGP-DONATE-QR-Code-2.jpg", "https://www.greanvillepost.com/wp-content/uploads/2019/08/Screen-Shot-2019-08-20-at-4.06.17-PM.png"], "authors": [], "publish_date": "February 4, 2022"}