{"result_id": "295047", "URL": "https://www.greanvillepost.com/2021/07/31/retired-taiwan-general-tells-military-to-overthrow-dpp-surrender-to-china/?print=print", "timestamp": "2023-04-25 17:23:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/07/31/retired-taiwan-general-tells-military-to-overthrow-dpp-surrender-to-china/?print=print", "encoding": null}, "image": null, "domain": "www.greanvillepost.com", "title": "Retired Taiwan general tells military to overthrow DPP, surrender to China - The Greanville Post", "cleaned_text": "After COVID cases spiked in Taiwan, retired general Kao An-kuo (高安國) decked himself out in camouflage fatigues, wireframe sunglasses, and a blue beret to release a video on June 7 titled, \"A letter from the 'General An-kuo Unification Forum' to brothers in the Army, Navy, and Air Force.\" In the video, Kao alleged that Taiwan's surge in COVID cases was a result of the Democratic Progressive Party (DPP) blocking the import of vaccines at source and \"attempting to use the vaccine to extort money for votes.\"\n\nTo Chinese patriots in Taiwan and the mainland, Gen. Kao may be expressing a widespread but silent sentiment. The avoidance of a fratricidal bloodbath is also a consideration of the first magnitude, not to mention the need to deny the global hegemon a profitable entry into Chinese affairs. Gen. Kao is obviously a man of courage and principle, and a genuine patriot .\n\nHe accused the Taiwan government of slandering China and \"maliciously rejecting the mainland vaccine.\" He blamed the new outbreak and deaths on Taiwan's rejection of China's vaccines, and asserted that if the DPP is allowed to continue with its \"foolish acts,\" Taiwan will be reduced to a \"hell on Earth.\"\n\nKao said that Taiwan lost its military advantage in the 1980s and China's economic boom has led to great advancements in its military strength. He claimed the Chinese Communist Party (CCP) is no longer the version seen in the 1950s and '60s and called on \"brothers from the three armed services\" to show \"loyalty and filial piety\" to China.\n\nHe added \"the time is right\" for generals leading the three branches of Taiwan's military to \"stand up and set things right.\" Kao alleged that Taiwan's \"hard-won democracy and freedom have been destroyed by the DPP.\"\n\nKao urged Taiwan's generals to rise up \"for the sake of national righteousness\" and to \"save the people of Taiwan from turmoil.\" In an apparent reference to a Chinese invasion of Taiwan, Kao said that when \"D-Day\" arrives, Taiwan's armed forces \"must respond by overthrowing this DPP scam ring in one fell swoop.\"\n\nHe added the military must also \"relieve the people's fear of military rule over Taiwan and the coronavirus pandemic.\" Further, it should combine with pro-China unification factions to \"complete the historical sacred mission of China's unification.\"\n\nThis week, the video made its way onto social media in Taiwan. On Thursday, DPP Legislator Lai Jui-lung (賴瑞隆) said that Kao's words were treasonous because he is calling for surrender to China and that he should be prosecuted for violating the National Security Act (國家安全法), reported FTV News.\n\nAttorney Huang Di-ying (黃帝穎) was cited by SET News as saying that Kao's video is a clearly a breach of the Criminal Code and incites others to commit crimes. Huang said that if Kao is in direct contact with military personnel about the matters he discussed in the video, he may have violated the National Security Act.\n\nHuang called on prosecutors to take the initiative and investigate Kao's actions. He said that after watching the video, he found that Kao had \"not only blurred the lines between friend and foe, but he also crossed legal boundaries.\"\n\nAttorney Shen Ching-chia (沈靖家) told FTV News that a retired general calling on the armed forces to overthrow the government could constitute a violation of Article 153 of the Criminal Code. He added that if he wore an \"official military uniform\" in the video he could be charged with breaching Article 159 of the Criminal Code.\n\nABOUT KEONI EVERINGTON\n• Keoni is an American with a deep personal interest in all things Chinese (being part of his heritage). He invested more than 20 years in learning Chinese, and finally he moved to China in the 1990s. Learn more about Keoni in the podcast interview below.", "opengraph": {}, "tags": ["Keoni Everington"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "592", "height": "333", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/L4EmWYqM1_A\" width=\"592\" height=\"333\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/L4EmWYqM1_A"}], "links": ["https://tw.news.yahoo.com/%E9%9B%A2%E8%AD%9C-%E9%80%80%E5%B0%87%E9%AB%98%E5%AE%89%E5%9C%8B%E7%AB%9F%E5%96%8A%E8%A9%B1-%E6%8A%95%E5%85%B1%E5%8F%9B%E5%9C%8B-%E7%B6%A0%E5%A7%94-%E5%8F%9B%E5%9C%8B%E7%BD%AA-061455539.html", "https://www.setn.com/News.aspx?NewsID=974520", "https://www.greanvillepost.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-23-at-1.58.01-PM.png"], "authors": [], "publish_date": null}