{"result_id": "295044", "URL": "https://www.greanvillepost.com/2021/05/13/second-stage-terror-wars/", "timestamp": "2023-04-25 17:23:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/05/13/second-stage-terror-wars/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Second Stage Terror Wars", "cleaned_text": "“We’ll know our disinformation program is complete when everything the American public believes is false.” – William Casey, CIA Director, Feb. 1981\n\nt is well known that the endless U.S. war on terror was overtly launched following the mass murders of September 11, 2001 and the linked anthrax attacks . The invasion of Afghanistan and the Patriot Act were immediately justified by those insider murders, and subsequently the wars against Iraq, Libya, Syria, etc. So too the terrorizing of the American people with constant fear-mongering about imminent Islamic terrorist attacks from abroad that never came.\n\nIt is less well known that the executive director of the U.S. cover story – the fictional 9/11 Commission Report – was Philip Zelikow, who controlled and shaped the report from start to finish.\n\nIt is even less well known that Zelikow, a professor at the University of Virginia, was closely associated with Condoleezza Rice, George W. Bush, Dickey Cheney, Paul Wolfowitz, Brent Scowcroft, et al. and had served in various key intelligence positions in both the George H. W. Bush and George W. Bush administrations. In 2011 President Obama named him to his President’s Intelligence Advisory Board as befits bi-partisan elite rule and coverup compensation across political parties.\n\nPerhaps it’s unknown or just forgotten that The Family Steering Committee for the 9/11 Commission repeatedly called for Zelikow’s removal, claiming that his appointment made a farce of the claim that the Commission was independent.\n\nZelikow said that for the Commission to consider alternative theories to the government’s claims about Osama bin Laden was akin to whacking moles. This is the man, who at the request of his colleague Condoleezza Rice, became the primary author of (NSS 2002) The National Security Strategy of the United States of America, that declared that the U.S. would no longer abide by international law but was adopting a policy of preemptive war, as declared by George W. Bush at West Point in June 2002. This was used as justification for the attack on Iraq in 2003 and was a rejection of the charter of the United Nations.\n\nSo, based on Zelikow’s work creating a magic mountain of deception while disregarding so-called molehills, we have had twenty years of American terror wars around the world in which U.S. forces have murdered millions of innocent people. Wars that will be continuing for years to come despite rhetoric to the contrary. The rhetoric is simply propaganda to cover up the increasingly technological and space-based nature of these wars and the use of mercenaries and special forces.\n\nSimultaneously, in a quasi-volte-face, the Biden administration has directed its resources inward toward domestic “terrorists”: that is, anyone who disagrees with its policies. This is especially aimed at those who question the COVID-19 story.\n\nNow Zelikow has been named to head a COVID Commission Planning Group based at the University of Virginia that is said to prepare the way for a National COVID Commission. The group is funded by the Schmidt Futures, the Skoll Foundation, the Rockefeller Foundation and Stand Together, with more expected to join in. Zelikow, a member of the Bill & Melinda Gates Foundation’s Global Development Program Advisory Panel, will lead the group that will work in conjunction with the Johns Hopkins Center for Health Security at the Bloomberg School of Public Health. Stand together indeed: Charles Koch, Bill Gates, Eric Schmidt, the Rockefellers, et al. funders of disinterested truth.\n\nSo once again the fox is in the hen house.\n\nIf you wistfully think the corona crisis will soon come to an end, I suggest you alter your perspective. Zelikow’s involvement, among other things, suggests we are in the second phase of a long war of terror waged with two weapons – military and medical – whose propaganda messaging is carried out by the corporate mainstream media in the pursuit of the World Economic Forum’s Great Reset. Part one has so far lasted twenty years; part two may last longer. You can be certain it won’t end soon and that the new terrorists are domestic dissidents.\n\nDid anyone think the freedoms lost with The Patriot Act were coming back some day? Does anyone think the freedoms lost with the corona virus propaganda are coming back? Many people probably have no idea what freedoms they lost with the Patriot Act, and many don’t even care.\n\nAnd today? Lockdowns, mandatory mask wearing, travel restrictions, requirements to be guinea pigs for vaccines that are not vaccines, etc.?\n\nAnd they thought they were free, as Milton Mayer wrote about the Germans under Hitler. Like frogs in a pot of cold water, we need to feel the temperature rising before it’s too late. The dial is turned to high heat now.\n\nBut that was so long ago and far away, right? Don’t exaggerate, you say. Hitler and all that crap.\n\nAre you thankful now that government spokespeople are blatantly saying that they will so kindly give us back some freedoms if we only do what we’re told and get “vaccinated” with an experimental biological agent, wear our masks, etc.? Hoi polloi are supposed to be grateful to their masters, who will grant some summer fun until they slam the door shut again.\n\nPfizer raked in $3.5 billion from vaccine sales in the first quarter of 2021, the first three months of the vaccine rollouts, and the company projects $26 billion for the year. That’s one vaccine manufacturer. Chump change? Only a chump would not realize that Pfizer is the company that paid $2.3 billion in Federal criminal fines in 2009 – the largest ever paid by a drug company – for being a repeat offender in the marketing of 13 different drugs.\n\nMeanwhile, the commission justifying the government’s claims about COVID-19 and injections (aka “vaccines”) will be hard at work writing their fictive report that will justify ex post facto the terrible damage that has occurred and that will continue to occur for many years. Censorship and threats against dissidents will increase. The disinformation that dominates the corporate mainstream media will of course continue, but this will be supplemented by alternative media that are already buckling under the pressure to conform.\n\nThe fact that there has been massive censorship of dissenting voices by Google/ YouTube, Facebook, Twitter, Wikipedia, etc., and equally massive disinformation by commission and omission across media platforms, should make everyone ask why. Why repress dissent? The answer should be obvious but is not.\n\nThe fact that so many refuse to see the significance of this censorship clearly shows the hypnotic effects of a massive mind control operation.\n\nName calling and censorship are sufficient. Perfectly healthy people have now become a danger to others. So mask up, get your experimental shot, and shut up!\n\nYour body is no longer inviolable. You must submit to medical procedures on your body whether you want them or not. Do not object or question. If you do, you will be punished and will become a pariah. The authorities will call you crazy, deviant, selfish. They will take away your rights to travel and engage in normal activities, such as attend college, etc.\n\nPlease do not recall The Nuremberg Code. Especially number 7: “Proper preparations should be made and adequate facilities provided to protect the experimental subject against even remote possibilities of injury, disability or death.” (my emphasis)\n\n“Now is the time to just do what you are told,” as Anthony Fauci so benevolently declared.\n\nI am not making a prediction. The authorities have told us what’s coming. Pay attention. Don’t be fooled. It’s a game they have devised. Keep people guessing. On edge. Relieved. Tense. Relaxed. Shocked. Confused. That’s the game. One day this, the next that. You’re on, you’re off. You’re in, you’re out. We are allowing you this freedom, but be good children or we will have to retract it. If you misbehave, you will get a time out. Time to contemplate your sins.\n\nIf you once thought that COVID-19 would be a thing of the past by now, or ever, think again. On May 3, 2021 The New York Times reported that the virus is here to stay. This was again reported on May 10. Hopes Fade for Global Herd Immunity. You may recall that we were told such immunity would be achieved once enough people got the “vaccine” or enough people contracted the virus and developed antibodies.\n\nOn May 9, on ABC News, Dr. Fauci, when asked about indoor mask requirements being relaxed, said, “I think so, and I think you’re going to probably be seeing that as we go along, and as more people get vaccinated.” Then he added: “We do need to start being more liberal, as we get more people vaccinated.”\n\nBut then, in what CNN reported as a Mother’s Day prediction, he pushed the date for “normality” out another year, saying, “I hope that [by] next Mother’s Day, we’re going to see a dramatic difference than what we’re seeing right now. I believe that we will be about as close to back to normal as we can. We’ve got to make sure that we get the overwhelming proportion of the population vaccinated. When that happens, the virus doesn’t really have any place to go. You’re not going to see a surge. You’re not going to see the kinds of numbers we see now.”\n\nHe said this with a straight face even though the experimental “vaccines,” by their makers own admissions, do not prevent the vaccinated from getting the virus or passing it on. They allege it only mitigates the severity of the virus if you contract it.\n\nNotice the language and the vaccination meme repeated three times: “We get more people vaccinated.” (my emphasis) Not that more people choose to get vaccinated, but “we get” them vaccinated. Thank you, Big Daddy. And now we have another year to go until “we will be about as close to back to normal as we can.” Interesting phrase: as we can. It other words: we will never return to normality but will have to settle for the new normal that will involve fewer freedoms. Life will be reset, a great reset. Great for the few and terrible for the many.\n\nOnce two vaccines were enough; then, no, maybe one is sufficient; no, you will need annual or semi-annual booster shots to counteract the new strains that they say are coming. It’s a never-ending story with never-ending new strains in a massive never-ending medical experiment. The virus is changing so quickly and herd immunity is now a mystical idea, we are told, that it will never be achieved. We will have to be eternally vigilant.\n\nBut wait. Don’t despair. It looks like restrictions are easing up for the coming summer in the northern hemisphere. Lockdowns will be loosened. If you felt like a prisoner for the past year plus, now you will be paroled for a while. But don’t dispose of those masks just yet. Fauci says that wearing masks could become seasonal following the pandemic because people have become accustomed to wearing them and that’s why the flu has disappeared. The masks didn’t prevent COVID-19 but eliminated the flu. Are you laughing yet?\n\nCensorship and lockdowns and masks and mandatory injections are like padded cells in a madhouse and hospital world where free-association doesn’t lead to repressed truths because free association isn’t allowed, neither in word nor deed. Speaking freely and associating with others are too democratic. Yes, we thought we were free. False consciousness is pandemic. Exploitation is seen as benevolence. Silence reigns. And the veiled glances signify the ongoing terror that has spread like a virus.\n\nWe are now in a long war with two faces. As with the one justified by the mass murders of September 11, 2001, this viral one isn’t going away.\n\nThe question is: Do we have to wait twenty years to grasp the obvious and fight for our freedoms?\n\nWe can be assured that Zelikow and his many associates at Covid Collaborative, including General Stanley McChrystal, Robert Gates, Arnie Duncan, Deval Patrick, Tom Ridge, et al. – a whole host of Republicans and Democrats backed by great wealth and institutional support, will not be “whacking moles” in their search for truth. Their agenda is quite different.\n\nBut then again, you may recall where they stood on the mass murders of September 11, 2001 and the endless wars that have followed.", "opengraph": {"site_name": "The Greanville Post", "title": "Second Stage Terror Wars | The Greanville Post", "description": "EDWARD J CURTIN—t is well known that the endless U.S. war on terror was overtly launched following the mass murders of September 11, 2001 and the linked anthrax attacks.   The invasion of Afghanistan and the Patriot Act were immediately justified by those insider murders, and subsequently the wars against Iraq, Libya, Syria, etc.  So too the terrorizing of the American people with constant fear-mongering about imminent Islamic terrorist attacks from abroad that never came. It is less well known that the executive director of the U.S. cover story – the fictional 9/11 Commission Report – was Philip Zelikow, who controlled and shaped the report from start to finish. It is even less well known that Zelikow, a professor at the University of Virginia, was closely associated with Condoleezza Rice, George W. Bush, Dickey Cheney, Paul Wolfowitz, Brent Scowcroft, et al. and had served in various key intelligence positions in both the George H. W. Bush and George W. Bush administrations. In 2011 President Obama named him to his President’s Intelligence Advisory Board as befits bi-partisan elite rule and coverup compensation across political parties.", "url": "https://www.greanvillepost.com/2021/05/13/second-stage-terror-wars/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-13-at-3.17.15-PM.png", "article:section": "US EXCEPTIONALISM", "article:publisher": "https://www.facebook.com/facebook"}, "tags": ["lockdowns"], "tweets": [], "movies": [], "links": ["https://hellboundanddown.com/2020/12/26/did-cia-director-william-casey-really-say-well-know-our-disinformation-program-is-complete-when-everything-the-american-public-believes-is-false/", "https://www.claritypress.com/product/the-2001-anthrax-deception-the-case-for-a-domestic-conspiracy/", "https://ratical.org/ratville/CAH/USAPA.html", "https://tinyurl.com/history-commons-zelikow", "https://millercenter.org/experts/philip-zelikow", "https://web.archive.org/web/20190614190832/http:/www.historycommons.org/context.jsp?item=a010301clarkedemoted", "https://www.sourcewatch.org/index.php/Philip_D._Zelikow", "https://web.archive.org/web/20121127103632/http:/www.historycommons.org/entity.jsp?entity=9-11_family_steering_committee", "https://nssarchive.us/national-security-strategy-2002/", "https://www.mintpressnews.com/iraq-and-beyond-how-many-millions-have-been-killed-in-american-wars/239468/", "https://greenwald.substack.com/p/the-new-domestic-war-on-terror-is", "https://consentfactory.org/2021/05/03/the-criminalization-of-dissent/", "https://news.virginia.edu/content/broad-covid-commission-planning-group-will-be-based-uvas-miller-center", "https://schmidtfutures.com/our-method/our-people/", "https://skoll.org/about/meet-jeff-skoll/", "https://www.thelastamericanvagabond.com/bill-gates-web-dark-money-influence-part-3-health-surveillance-event-201-rockefeller-connection/", "https://standtogether.ucla.edu/", "https://www.gatesfoundation.org/Ideas/Media-Center/Press-Releases/2007/09/Program-Advisory-Panels", "https://apps.who.int/gpmb/assets/thematic_papers/tr-6.pdf", "https://littlesis.org/org/42334-John_Hopkins_Bloomberg_School_of_Public_Health", "https://www.forbes.com/profile/charles-koch/?sh=490d536f57d7", "https://www.markmallett.com/blog/the-case-against-gates/", "https://forward.ny.gov/reimagine-new-york-commission", "https://journal.ratical.earth/2020/06/15/usa-plan-militarized-control-of-population-the-national-covid-19-testing-action-plan/", "https://www.wrongkindofgreen.org/2020/10/14/klaus-schwab-and-his-great-fascist-reset-an-overview/", "http://kathydopp.info/COVIDinfo/Lockdowns", "https://ahrp.org/the-significance-of-the-nuremberg-code/", "https://ratical.org/PandemicParallaxView/TheyThoughtTheyWereFree-Mayer1955.pdf", "https://press.uchicago.edu/Misc/Chicago/511928.html", "https://home.solari.com/deep-state-tactics-101-the-covid-injection-fraud-its-not-a-vaccine/", "https://ratical.org/PandemicParallaxView/FalsePromiseOfBiosecurity.html#Mask", "https://www.mp-22.com/vax", "https://www.wrongkindofgreen.org/2020/10/28/its-not-a-social-dilemma-its-the-calculated-destruction-of-the-social/", "http://www.cirp.org/library/ethics/nuremberg/", "https://www.nytimes.com/live/2021/05/10/world/covid-19-coronavirus", "https://www.cnn.com/2021/05/09/health/us-coronavirus-sunday/index.html", "https://off-guardian.org/2021/03/30/covid-vaccine-nonsense/", "https://www.aier.org/article/who-deletes-naturally-acquired-immunity-from-its-website/", "https://www.washingtonpost.com/health/2021/05/09/fauci-covid-masks-seasonal-pandemic/", "http://kathydopp.info/COVIDinfo/Censorship", "https://www.wrongkindofgreen.org/tag/covid-oppression/", "https://www.markmallett.com/blog/unmasking-the-facts/", "https://www.wrongkindofgreen.org/2021/03/11/the-mechanism-of-invisible-hand-invisible-cage-and-invisible-empire-over-humanity-and-nature/", "https://ratical.org/PandemicParallaxView/CAF-MrGlobal.html", "https://ratical.org/PandemicParallaxView/Lawsuits-C19-False-Claims.html", "https://www.covidcollaborative.us/state-of-the-crisis"], "authors": [], "publish_date": "May 13, 2021"}