{"result_id": "295015", "URL": "https://www.greanvillepost.com/2020/10/12/venezuela-to-receive-russian-covid-19-vaccine/", "timestamp": "2023-04-25 17:22:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/10/12/venezuela-to-receive-russian-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Venezuela to Receive Russian Covid-19 Vaccine", "cleaned_text": "he first batch of the Russian Sputnik V vaccine has arrived in Venezuela, to start phase III of clinical trials, announced the Executive Vice President of the Republic, Delcy Rodríguez.\n\n“It is a historic moment for our Homeland, Venezuela becomes the first country in America to receive the Russian vaccine against Covid-19. This action is the result of permanent contact and cooperation that Venezuela has with the Russian Federation,” highlighted the Executive Vice President.\n\nLikewise, the vice president stressed that thanks to the leadership of Vladimir Putin, president of Russia, relief is brought to the world with the first registered vaccine to combat covid-19. “Sputnik V is a safe vaccine that offers long-lasting immunity, of approximately two years, in comparison with other types of vaccines that have a short life and are being tested. The Sputnik V is a safe vaccine because it is based on human adenovirus,” said Rodríguez.\n\nRodríguez added that thanks to the strategic Russia-Venezuela cooperation, “we are going to participate in the safe supply for our people and also in the production of the vaccine in Venezuela.” In the event was also present the Venezuelan Minister for Foreign Affairs, Jorge Arreaza.\n\nIn matters of health and many others, Russia has maintained very close cooperation with the Venezuelan people. “We have received tons of drugs, PCR tests and today it reaches a maximum level with the arrival of this first batch of vaccines,” she stressed. The vice president pointed out that due to cooperation with Russian National Center for Epidemiology and Microbiology Research Gamaleya it was possible for Venezuela to acquire the Russian vaccine Sputnik V.\n\nFor his part, Carlos Alvarado, Minister for Health, reported that 2,000 people will be included in this trial phase and immediately afterwards the alliances with Russia will be finalized to carry out the packaging and subsequent production of the vaccine in Venezuela.\n\n“Two thousand people are going to receive the test dose of the vaccine in its third phase that we will start in the next few days. After finishing the test phase, the manufacture of the vaccine will begin, we already have the team of researchers who are going to lead, they are going to follow up,” he said.\n\nHe also said that “this historic brotherhood of our countries consolidates a union that had already been strengthened and is now receiving much more strength for the entire country.”\n\nRussia’s charge d’affaires, Alexey Seredin, said he was happy that Venezuela is the first country on this side of the world to receive the vaccine. “This vaccine is very resistant to treat coronavirus infection. Soon we will have the opportunity to apply the vaccine to the entire population, “said Seredin.\n\nThis article previously appeared in the Orinoco Tribune .\n\nPlease join the conversation on Black Agenda Report's Facebook page at http://facebook.com/blackagendareport\n\nOr, you can comment by emailing us at comments@blackagendareport.com", "opengraph": {"site_name": "The Greanville Post", "title": "Venezuela to Receive Russian Covid-19 Vaccine  | The Greanville Post", "description": "In matters of health and many others, Russia has maintained very close cooperation with the Venezuelan people. “We have received tons of drugs, PCR tests and today it reaches a maximum level with the arrival of this first batch of vaccines,” she stressed. The vice president pointed out that due to cooperation with Russian National Center for Epidemiology and Microbiology Research Gamaleya it was possible for Venezuela to acquire the Russian vaccine Sputnik V.", "url": "https://www.greanvillepost.com/2020/10/12/venezuela-to-receive-russian-covid-19-vaccine/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/10/BAR-Vene-Covid_845x400.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://orinocotribune.com/", "https://www.facebook.com/blackagendareport/", "mailto:comments@blackagendareport.com"], "authors": [], "publish_date": "October 12, 2020"}