{"result_id": "295001", "URL": "https://www.greanvillepost.com/2020/03/02/bats-gene-editing-and-bioweapons-recent-darpa-experiments-raise-concerns-amid-coronavirus-outbreak/", "timestamp": "2023-04-25 17:22:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/03/02/bats-gene-editing-and-bioweapons-recent-darpa-experiments-raise-concerns-amid-coronavirus-outbreak/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Bats, Gene Editing and Bioweapons: Recent Darpa Experiments Raise Concerns Amid Coronavirus Outbreak", "cleaned_text": "DARPA recently spent millions on research involving bats and coronaviruses, as well as gene editing “bioweapons” prior to the recent coronavirus outbreak. Now, “strategic allies” of the agency have been chosen to develop a genetic material-based vaccine to halt the potential epidemic.\n\nWASHINGTON D.C. –\n\n [dropcap]I[/dropcap]n recent weeks, concern over the emergence of a novel coronavirus in China has grown exponentially as media, experts and government officials around the world have openly worried that this new disease has the potential to develop into a global pandemic.\n\nAs concerns about the future of the ongoing outbreak have grown, so too have the number of theories speculating about the outbreak’s origin, many of which blame a variety of state actors and/or controversial billionaires. This has inevitably led to efforts to clamp down on “misinformation” related to the coronavirus outbreak from both mainstream media outlets and major social media platforms.\n\nHowever, while many of these theories are clearly speculative, there is also verifiable evidence regarding the recent interest of one controversial U.S. government agency in novel coronaviruses, specifically those transmitted from bats to humans. That agency, the Pentagon’s Defense Advanced Research Project Agency (DARPA), began spending millions on such research in 2018 and some of those Pentagon-funded studies were conducted at known U.S. military bioweapons labs bordering China and resulted in the discovery of dozens of new coronavirus strains as recently as last April. Furthermore, the ties of the Pentagon’s main biodefense lab to a virology institute in Wuhan, China — where the current outbreak is believed to have begun — have been unreported in English language media thus far.\n\nWhile it remains entirely unknown as to what caused the outbreak, the details of DARPA’s and the Pentagon’s recent experimentation are clearly in the public interest, especially considering that the very companies recently chosen to develop a vaccine to combat the coronavirus outbreak are themselves strategic allies of DARPA. Not only that, but these DARPA-backed companies are developing controversial DNA and mRNA vaccines for this particular coronavirus strain, a category of vaccine that has never previously been approved for human use in the United States.\n\nYet, as fears of the pandemic potential of coronavirus grow, these vaccines are set to be rushed to market for public use, making it important for the public to be aware of DARPA’s recent experiments on coronaviruses, bats and gene editing technologies and their broader implications.\n\nAs the coronavirus outbreak has come to dominate headlines in recent weeks, several media outlets have promoted claims that the reported epicenter of the outbreak in Wuhan, China was also the site of laboratories allegedly linked to a Chinese government biowarfare program.\n\nHowever, upon further examination of the sourcing for this serious claim, these supposed links between the outbreak and an alleged Chinese bioweapons program have come from two highly dubious sources.\n\nFor instance, the first outlet to report on this claim was Radio Free Asia, the U.S.-government funded media outlet targeting Asian audiences that used to be run covertly by the CIA and named by the New York Times as a key part in the agency’s “worldwide propaganda network.” Though it is no longer run directly by the CIA, it is now managed by the government-funded Broadcasting Board of Governors (BBG), which answers directly to Secretary of State Mike Pompeo, who was CIA director immediately prior to his current post at the head of the State Department.\n\nIn other words, Radio Free Asia and other BBG-managed media outlets are legal outlets for U.S. government propaganda. Notably, the long-standing ban on the domestic use of U.S. government propaganda on U.S. citizens was lifted in 2013, with the official justification of allowing the government to “effectively communicate in a credible way” and to better combat “al-Qaeda’s and other violent extremists’ influence.”\n\nReturning to the subject at hand, Radio Free Asia’s recent report on the alleged origins of the outbreak being linked to a Chinese state-linked virology center cited only Ren Ruihong, the former head of the medical assistance department at the Chinese Red Cross, for that claim. Ruihong has been cited as an expert in several Radio Free Asia reports on disease outbreaks in China, but has not been cited as an expert by any other English-language media outlet.\n\n“It’s a new type of mutant coronavirus.They haven’t made public the genetic sequence, because it is highly contagious…Genetic engineering technology has gotten to such a point now, and Wuhan is home to a viral research center that is under the aegis of the China Academy of Sciences, which is the highest level of research facility in China.”\n\nThough Ruihong did not directly say that the Chinese government was making a bioweapon at the Wuhan facility, she did imply that genetic experiments at the facility may have resulted in the creation of this new “mutant coronavirus” at the center of the outbreak.\n\nWith Radio Free Asia and its single source having speculated about Chinese government links to the creation of the new coronavirus, the Washington Times soon took it much farther in a report titled “Virus-hit Wuhan has two laboratories linked to Chinese bio-warfare program.” That article, much like Radio Free Asia’s earlier report, cites a single source for that claim, former Israeli military intelligence biowarfare specialist Dany Shoham.\n\nYet, upon reading the article, Shoham does not even directly make the claim cited in the article’s headline, as he only told the Washington Times that: “Certain laboratories in the [Wuhan] institute have probably been engaged, in terms of research and development, in Chinese [biological weapons], at least collaterally, yet not as a principal facility of the Chinese BW alignment (emphasis added).”\n\nWhile Shoham’s claims are clearly speculative, it is telling that the Washington Timeswould bother to cite him at all, especially given the key role he played in promoting false claims that the 2001 Anthrax attacks was the work of Iraq’s Saddam Hussein. Shoham’s assertions about Iraq’s government and weaponized Anthrax, which were used to bolster the case for the 2003 invasion of Iraq, have since been proven completely false, as Iraq was found to have neither the chemical or biological “weapons of mass destruction” that “experts” like Shoham had claimed.\n\nBeyond Shoham’s own history of making suspect claims, it is also worth noting that Shoham’s previous employer, Israeli military intelligence, has a troubling past with bioweapons. For instance, in the late 1990s, it was reported by several outlets that Israel was in the process of developing a genetic bioweapon that would target Arabs, specifically Iraqis, but leave Israeli Jews unaffected.\n\nGiven the dubious past of Shoham and the clearly speculative nature of both his claims and those made in the Radio Free Asia report, one passage in the Washington Times article is particularly telling about why these claims have recently surfaced:\n\n“One ominous sign, said a U.S. official, is that the false rumors since the outbreak began several weeks ago have begun circulating on the Chinese Internet claiming the virus is part of a U.S. conspiracy to spread germ weapons. That could indicate China is preparing propaganda outlets to counter future charges the new virus escaped from one of Wuhan’s civilian or defense research laboratories (emphasis added).”\n\nHowever, as seen in that very article, accusations that the coronavirus escaped from a Chinese-state-linked laboratory is hardly a future charge as both the Washington Times and Radio Free Asia have already been making that claim. Instead, what this passage suggests is that the reports in both Radio Free Asia and the Washington Times were responses to the claims circulating within China that the outbreak is linked to a “U.S. conspiracy to spread germ weapons.”\n\nThough most English-language media outlets to date have not examined such a possibility, there is considerable supporting evidence that deserves to be examined. For instance, not only was the U.S. military, including its controversial research arm — the Defense Advanced Research Projects Agency (DARPA), recently funding studies in and near China that discovered new, mutant coronaviruses originating from bats, but the Pentagon also became recently concerned about the potential use of bats as bioweapons.\n\nAs the ongoing coronavirus outbreak centered in China has spread to other countries and been blamed for a growing number of deaths, a consensus has emerged that this particular virus, currently classified as a “novel [i.e. new] coronavirus,” is believed to have originated in bats and was transmitted to humans in Wuhan, China via a seafood market that also traded exotic animals. So-called “wet” markets, like the one in Wuhan, were previously blamed for past deadly coronavirus outbreaks in China, such as the 2003 outbreak of Severe Acute Respiratory Syndrome (SARS).\n\nIn addition, one preliminary study on the coronavirus responsible for the current outbreak found that the receptor, Angiotensin-converting enzyme 2 (ACE2), is not only the same as that used by the SARS coronavirus, but that East Asians present a much higher ratio of lung cells that express that receptor than the other ethnicities (Caucasian and African-American) included in the study. However, such findings are preliminary and the sample size is too small to draw any definitive conclusions from that preliminary data.\n\nTwo years ago, media reports began discussing the Pentagon’s sudden concern that bats could be used as biological weapons, particularly in spreading coronaviruses and other deadly diseases. The Washington Post asserted that the Pentagon’s interest in investigating the potential use of bats to spread weaponized and deadly diseases was because of alleged Russian efforts to do the same. However, those claims regarding this Russian interest in using bats as bioweapons date back to the 1980s when the Soviet Union engaged in covert research involving the Marburg virus, research that did not even involve bats and which ended with the Soviet Union’s collapse in 1991.\n\nLike much of the Pentagon’s controversial research programs, the bats as bioweapons research has been framed as defensive, despite the fact that no imminent threat involving bat-propagated bioweapons has been acknowledged. However, independent scientists have recently accused the Pentagon, particularly its research arm DARPA, of claiming to be engaged in research it says is “defensive” but is actually “offensive.”\n\nThe most recent example of this involved DARPA’s “Insect Allies” program, which officially “aims to protect the U.S. agricultural food supply by delivering protective genes to plants via insects, which are responsible for the transmission of most plant viruses” and to ensure “food security in the event of a major threat,” according to both DARPA and media reports.\n\nHowever, a group of well-respected, independent scientists revealed in a scathing analysis of the program that, far from a “defensive” research project, the Insect Allies program was aimed at creating and delivering “new class of biological weapon.” The scientists, writing in the journal Science and led by Richard Guy Reeves, from the Max Planck Institute for Evolutionary Biology in Germany, warned that DARPA’s program — which uses insects as the vehicle for as horizontal environmental genetic alteration agents (HEGAAS) — revealed “an intention to develop a means of delivery of HEGAAs for offensive purposes (emphasis added).”\n\nWhatever the real motivation behind the Pentagon’s sudden and recent concern about bats being used as a vehicle for bioweapons, the U.S. military has spent millions of dollars over the past several years funding research on bats, the deadly viruses they can harbor — including coronaviruses — and how those viruses are transmitted from bats to humans.\n\nFor instance, DARPA spent $10 million on one project in 2018 “to unravel the complex causes of bat-borne viruses that have recently made the jump to humans, causing concern among global health officials.” Another research project backed by both DARPA and NIH saw researchers at Colorado State University examine the coronavirus that causes Middle East Respiratory Syndrome (MERS) in bats and camels “to understand the role of these hosts in transmitting disease to humans.” Other U.S. military-funded studies, discussed in detail later in this report, discovered several new strains of novel coronaviruses carried by bats, both within China and in countries bordering China.\n\nMany of these recent research projects are related to DARPA’s Preventing Emerging Pathogenic Threats, or PREEMPT program, which was officially announced in April 2018. PREEMPT focuses specifically on animal reservoirs of disease, specifically bats, and DARPA even noted in its press release in the program that it “is aware of biosafety and biosecurity sensitivities that could arise” due to the nature of the research.\n\nDARPA’s announcement for PREEMPT came just a few months after the U.S. government decided to controversially end a moratorium on so-called “gain-of-function” studies involving dangerous pathogens. VICE News explained “gain-of-function” studies as follows:\n\n“Known as ‘gain-of-function’ studies, this type of research is ostensibly about trying to stay one step ahead of nature. By making super-viruses that are more pathogenic and easily transmissible, scientists are able to study the way these viruses may evolve and how genetic changes affect the way a virus interacts with its host. Using this information, the scientists can try to pre-empt the natural emergence of these traits by developing antiviral medications that are capable of staving off a pandemic (emphasis added).”\n\nIn addition, while both DARPA’s PREEMPT program and the Pentagon’s open interest in bats as bioweapons were announced in 2018, the U.S. military — specifically the Department of Defense’s Cooperative Threat Reduction Program — began funding research involving bats and deadly pathogens, including the coronaviruses MERS and SARS, a year prior in 2017. One of those studies focused on “Bat-Borne Zoonotic Disease Emergence in Western Asia” and involved the Lugar Center in Georgia, identified by former Georgian government officials, the Russian government and independent, investigative journalist Dilyana Gaytandzhieva as a covert U.S. bioweapons lab.\n\nIt is also important to point out the fact that the U.S. military’s key laboratories involving the study of deadly pathogens, including coronaviruses, Ebola and others, was suddenly shut down last July after the Center for Disease Control and Prevention (CDC) identified major “biosafety lapses” at the facility.\n\nThe U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID) facility at Fort Detrick, Maryland — the U.S. military’s lead laboratory for “biological defense” research since the late 1960s — was forced to halt all research it was conducting with a series of deadly pathogens after the CDC found that it lacked “sufficient systems in place to decontaminate wastewater” from its highest-security labs and failure of staff to follow safety procedures, among other lapses. The facility contains both level 3 and level 4 biosafety labs. While it is unknown if experiments involving coronaviruses were ongoing at the time, USAMRIID has recently been involved in research borne out of the Pentagon’s recent concern about the use of bats as bioweapons.\n\nThe decision to shut down USAMRIID garnered surprisingly little media coverage, as did the CDC’s surprising decision to allow the troubled facility to “partially resume” research late last November even though the facility was and is still not at “full operational capability.” The USAMRIID’s problematic record of safety at such facilities is of particular concern in light of the recent coronavirus outbreak in China. As this report will soon reveal, this is because USAMRIID has a decades-old and close partnership with the University of Wuhan’s Institute of Medical Virology, which is located in the epicenter of the current outbreak.\n\nBeyond the U.S. military’s recent expenditures on and interest in the use of bats of bioweapons, it is also worth examining the recent studies the military has funded regarding bats and “novel coronaviruses,” such as that behind the recent outbreak, that have taken place within or in close proximity to China.\n\nFor instance, one study conducted in Southern China in 2018 resulted in the discovery of 89 new “novel bat coronavirus” strains that use the same receptor as the coronavirus known as Middle East Respiratory Syndrome (MERS). That study was jointly funded by the Chinese government’s Ministry of Science and Technology, USAID — an organization long alleged to be a front for U.S. intelligence, and the U.S. National Institute of Health — which has collaborated with both the CIA and the Pentagon on infectious disease and bioweapons research.\n\nThe authors of the study also sequenced the complete genomes for two of those strains and also noted that existing MERS vaccines would be ineffective in targeting these viruses, leading them to suggest that one should be developed in advance. This did not occur.\n\nAnother U.S. government-funded study that discovered still more new strains of “novel bat coronavirus” was published just last year. Titled “Discovery and Characterization of Novel Bat Coronavirus Lineages from Kazakhstan,” focused on “the bat fauna of central Asia, which link China to eastern Europe” and the novel bat coronavirus lineages discovered during the study were found to be “closely related to bat coronaviruses from China, France, Spain, and South Africa, suggesting that co-circulation of coronaviruses is common in multiple bat species with overlapping geographical distributions.” In other words, the coronaviruses discovered in this study were identified in bat populations that migrate between China and Kazakhstan, among other countries, and is closely related to bat coronaviruses in several countries, including China.\n\nThe study was entirely funded by the U.S. Department of Defense, specifically the Defense Threat Reduction Agency (DTRA) as part of a project investigating coronaviruses similar to MERS, such as the aforementioned 2018 study. Yet, beyond the funding of this 2019 study, the institutions involved in conducting this study are also worth noting given their own close ties to the U.S. military and government.\n\nThe study’s authors are affiliated with either the Kazakhstan-based Research Institute for Biological Safety Problems and/or Duke University. The Research Institute for Biological Safety Problems, though officially a part of Kazakhstan’s National Center for Biotechnology, has received millions from the U.S. government, most of it coming from the Pentagon’s Cooperative Threat Reduction Program. It is the Kazakhstan government’s official depository of “highly dangerous animal and bird infections, with a collection of 278 pathogenic strains of 46 infectious diseases.” It is part of a network of Pentagon-funded “bioweapons labs” throughout the Central Asian country, which borders both of the U.S.’ top rival states — China and Russia.\n\nDuke University’s involvement with this study is also interesting given that Duke is a key partner of DARPA’s Pandemic Prevention Platform (P3) program, which officially aims “to dramatically accelerate discovery, integration, pre-clinical testing, and manufacturing of medical countermeasures against infectious diseases.” The first step of the Duke/DARPA program involves the discovery of potentially threatening viruses and “develop[ing] methods to support viral propagation, so that virus can be used for downstream studies.”\n\nDuke University is also jointly partnered with China’s Wuhan University, which is based in the city where the current coronavirus outbreak began, which resulted in the opening of the China-based Duke Kunshan University (DKU) in 2018. Notably, China’s Wuhan University — in addition to its partnership with Duke — also includes a multi-lab Institute of Medical Virology that has worked closely with the US Army Medical Research Institute for Infectious Diseases since the 1980s, according to its website. As previously noted, the USAMRIID facility in the U.S. was shut down last July for failures to abide by biosafety and proper waste disposal procedures, but was allowed to partially resume some experiments late last November.\n\nThe U.S. military has a troubling past of having used disease as a weapon during times of war. One example involved the U.S.’ use of germ warfare during the Korean War, when it targeted both North Korea and China by dropping diseased insects and voles carrying a variety of pathogens — including bubonic plague and hemorrhagic fever — from planes in the middle of the night. Despite the mountain of evidence and the testimony of U.S. soldiers involved in that program, the U.S. government and military denied the claims and ordered the destruction of relevant documentation.\n\nIn the post World War II era, other examples of U.S. research aimed at developing biological weapons have emerged, some of which have recently received media attention. One such example occurred this past July, when the U.S. House of Representatives demanded information from the U.S. military on its past efforts to weaponize insects and Lyme disease between 1950 and 1975.\n\nThe U.S. has claimed that it has not pursued offensive biological weapons since 1969 and this has been further supported by the U.S.’ ratification of the Biological Weapons Convention (BWC), which went into effect in 1975. However, there is extensive evidence that the U.S. has continued to covertly research and develop such weapons in the years since, much of it conducted abroad and outsourced to private companies, yet still funded by the U.S. military. Several investigators, including Dilyana Gaytandzhieva, have documented how the U.S. produces deadly viruses, bacteria and other toxins at facilities outside of the U.S. — many of them in Eastern Europe, Africa and South Asia — in clear violation of the BWC.\n\nAside from the military’s own research, the controversial neoconservative think tank, the now defunct Project for a New American Century (PNAC), openly promoted the use of a race-specific genetically modified bioweapon as a “politically useful tool.” In what is arguably the think tank’s most controversial document, titled “Rebuilding America’s Defenses,” there are a few passages that openly discuss the utility of bioweapons, including the following sentences:\n\n“…combat likely will take place in new dimensions: in space, “cyber-space,” and perhaps the world of microbes…advanced forms of biological warfare that can “target” specific genotypes may transform biological warfare from the realm of terror to a politically useful tool.”\n\nThough numerous members of PNAC were prominent in the George W. Bush administration, many of its more controversial members have again risen to political prominence in the Trump administration.\n\nSeveral years after “Rebuilding America’s Defenses” was published, the U.S. Air Force published a document entitled “Biotechnology: Genetically Engineered Pathogens,” which contains the following passage:\n\n“The JASON group, composed of academic scientists, served as technical advisers to the U. S. government. Their study generated six broad classes of genetically engineered pathogens that could pose serious threats to society. These include but are not limited to binary biological weapons, designer genes, gene therapy as a weapon, stealth viruses, host-swapping diseases, and designer diseases (emphasis added).”\n\nConcerns about Pentagon experiments with biological weapons have garnered renewed media attention, particularly after it was revealed in 2017 that DARPAwas the top funder of the controversial “gene drive” technology, which has the power to permanently alter the genetics of entire populations while targeting others for extinction. At least two of DARPA’s studies using this controversial technology were classified and “focused on the potential military application of gene drive technology and use of gene drives in agriculture,” according to media reports.\n\nThe revelation came after an organization called the ETC Group obtained over 1,000 emails on the military’s interest in the technology as part of a Freedom of Information Act (FOIA) request. Co-director of the ETC Group Jim Thomas said that this technology may be used as a biological weapon:\n\n“Gene drives are a powerful and dangerous new technology and potential biological weapons could have disastrous impacts on peace, food security and the environment, especially if misused, The fact that gene drive development is now being primarily funded and structured by the US military raises alarming questions about this entire field.”\n\nThough the exact motivation behind the military’s interest in such technology is unknown, the Pentagon has been open about the fact that it is devoting much of its resources towards the containment of what it considers the two greatest threats to U.S. military hegemony: Russia and China. China has been cited as the greatest threat of the two by several Pentagon officials, including John Rood, the Pentagon’s top adviser for defense policy, who described China as the greatest threat to “our way of life in the United States” at the Aspen Security Forum last July.\n\nSince the Pentagon began “redesigning” its policies and research towards a “long war” with Russia and China, the Russian military has accused the U.S. military of harvesting DNA from Russians as part of a covert bioweapon program, a charge that the Pentagon has adamantly denied. Major General Igor Kirillov, the head of the Russian military’s radiation, chemical and biological protection unit who made these claims, also asserted that the U.S. was developing such weapons in close proximity to Russian and Chinese borders.\n\nChina has also accused the U.S. military of harvesting DNA from Chinese citizens with ill intentions, such as when 200,000 Chinese farmers were used in 12 genetic experiments without informed consent. Those experiments had been conducted byHarvard researchers as part of a U.S. government-funded project.\n\nDarpa and Its Partners Chosen to Develop Coronavirus Vaccine\n\nLast Thursday, the Coalition for Epidemic Preparedness Innovations (CEPI) announced that it would fund three separate programs in order to promote the development of a vaccine for the new coronavirus responsible for the current outbreak.\n\nCEPI — which describes itself as “a partnership of public, private, philanthropic and civil organizations that will finance and co-ordinate the development of vaccines against high priority public health threats” — was founded in 2017 by the governments of Norway and India along with the World Economic Forum and the Bill and Melinda Gates Foundation. Its massive funding and close connections to public, private and non-profit organizations have positioned it to be able to finance the rapid creation of vaccines and widely distribute them.\n\nCEPI’s recent announcement revealed that it would fund two pharmaceutical companies — Inovio Pharmaceuticals and Moderna Inc. — as well as Australia’s University of Queensland, which became a partner of CEPI early last year. Notably, the two pharmaceutical companies chosen have close ties to and/or strategic partnerships with DARPA and are developing vaccines that controversially involve genetic material and/or gene editing. The University of Queensland also has ties to DARPA, but those ties are not related to the university’s biotechnology research, but instead engineering and missile development.\n\nFor instance, the top funders of Inovio Pharmaceuticals include both DARPA and the Pentagon’s Defense Threat Reduction Agency (DTRA) and the company has received millions in dollars in grants from DARPA, including a $45 million grant to develop a vaccine for Ebola. Inovio specializes in the creation of DNA immunotherapies and DNA vaccines, which contain genetically engineered DNA that causes the cells of the recipient to produce an antigen and can permanently alter a person’s DNA. Inovio previously developed a DNA vaccine for the Zika virus, but — to date — no DNA vaccine has been approved for use in humans in the United States. Inovio was also recently awarded over $8 million from the U.S. military to develop a small, portable intradermal device for delivering DNA vaccines jointly developed by Inovio and USAMRIID.\n\nHowever, the CEPI grant to combat coronavirus may change that, as it specifically funds Inovio’s efforts to continue developing its DNA vaccine for the coronavirus that causes MERS. Inovio’s MERS vaccine program began in 2018 in partnership with CEPI in a deal worth $56 million. The vaccine currently under development uses“Inovio’s DNA Medicines platform to deliver optimized synthetic antigenic genes into cells, where they are translated into protein antigens that activate an individual’s immune system” and the program is partnered with U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID) and the NIH, among others. That program is currently undergoing testing in the Middle East.\n\nInovio’s collaboration with the U.S. military in regards to DNA vaccines is nothing new, as their past efforts to develop a DNA vaccine for both Ebola and Marburg virus were also part of what Inovio’s CEO Dr. Joseph Kim called its “active biodefense program” that has “garnered multiple grants from the Department of Defense, Defense Threat Reduction Agency (DTRA), National Institute of Allergy and Infectious Diseases (NIAID), and other government agencies.”\n\nCEPI’s interest in increasing its support to this MERS-specific program seems at odds with its claim that doing so will combat the current coronavirus outbreak, since MERS and the novel coronavirus in question are not analogous and treatments for certain coronaviruses have been shown to be ineffective against other strains.\n\nIt is also worth noting that Inovio Pharmaceuticals was the only company selected by CEPI with direct access to the Chinese pharmaceutical market through its partnership with China’s ApolloBio Corp., which currently has an exclusive license to sell Inovio-made DNA immunotherapy products to Chinese customers.\n\nThe second pharmaceutical company that was selected by CEPI to develop a vaccine for the new coronavirus is Moderna Inc., which will develop a vaccine for the novel coronavirus of concern in collaboration with the U.S. NIH and which will be funded entirely by CEPI. The vaccine in question, as opposed to Inovio’s DNA vaccine, will be a messenger RNA (mRNA) vaccine. Though different than a DNA vaccine, mRNA vaccines still use genetic material “to direct the body’s cells to produce intracellular, membrane or secreted proteins.”\n\nModerna’s mRNA treatments, including its mRNA vaccines, were largely developed using a $25 million grant from DARPA and it often touts is strategic alliance with DARPA in press releases. Moderna’s past and ongoing research efforts have included developing mRNA vaccines tailored to an individual’s unique DNA as well as an unsuccessful effort to create a mRNA vaccine for the Zika Virus, which was funded by the U.S. government.\n\nBoth DNA and mRNA vaccines involve the introduction of foreign and engineered genetic material into a person’s cells and past studies have found that such vaccines “possess significant unpredictability and a number of inherent harmful potential hazards” and that “there is inadequate knowledge to define either the probability of unintended events or the consequences of genetic modifications.” Nonetheless, the climate of fear surrounding the coronavirus outbreak could be enough for the public and private sector to develop and distribute such controversial treatments due to fear about the epidemic potential of the current outbreak.\n\nHowever, the therapies being developed by Inovio, Modern and the University of Queensland are in alignment with DARPA’s objectives regarding gene editing and vaccine technology. For instance, in 2015, DARPA geneticist Col. Daniel Wattendorf described how the agency was investigating a “new method of vaccine production [that] would involve giving the body instructions for making certain antibodies. Because the body would be its own bioreactor, the vaccine could be produced much faster than traditional methods and the result would be a higher level of protection.”\n\nAccording to media reports on Wattendorf’s statements at the time, the vaccine would be developed as follows:\n\n“Scientists would harvest viral antibodies from someone who has recovered from a disease such as flu or Ebola. After testing the antibodies’ ability to neutralize viruses in a petri dish, they would isolate the most effective one, determine the genes needed to make that antibody, and then encode many copies of those genes into a circular snippet of genetic material — either DNA or RNA, that the person’s body would then use as a cookbook to assemble the antibody.”\n\nThough Wattendorf asserted that the effects of those vaccines wouldn’t be permanent, DARPA has since been promoting permanent gene modifications as a means of protecting U.S. troops from biological weapons and infectious disease. “Why is DARPA doing this? [To] protect a soldier on the battlefield from chemical weapons and biological weapons by controlling their genome — having the genome produce proteins that would automatically protect the soldier from the inside out,” then-DARPA director Steve Walker (now with Lockheed Martin) said this past September of the project, known as “Safe Genes.”\n\nResearch conducted by the Pentagon, and DARPA specifically, has continually raised concerns, not just in the field of bioweapons and biotechnology, but also in the fields of nanotechnology, robotics and several others. DARPA, for instance, has been developing a series of unsettling research projects that ranges from microchips that can create and delete memories from the human brain to voting machine software that is rife with problems.\n\nNow, as fear regarding the current coronavirus outbreak begins to peak, companies with direct ties to DARPA have been tasked with developing its vaccine, the long-term human and environmental impacts of which are unknown and will remain unknown by the time the vaccine is expected to go to market in a few weeks time.\n\nFurthermore, DARPA and the Pentagon’s past history with bioweapons and their more recent experiments on genetic alteration and extinction technologies as well as bats and coronaviruses in proximity to China have been largely left out of the narrative, despite the information being publicly available. Also left out of the media narrative have been the direct ties of both the USAMRIID and DARPA-partnered Duke University to the city of Wuhan, including its Institute of Medical Virology.\n\nThough much about the origins of the coronavirus outbreak remains unknown, the U.S. military’s ties to the aforementioned research studies and research institutions are worth detailing as such research — while justified in the name of “national security” — has the frightening potential to result in unintended, yet world-altering consequences. The lack of transparency about this research, such as DARPA’s decision to classify its controversial genetic extinction research and the technology’s use as a weapon of war, compounds these concerns. While it is important to avoid reckless speculation as much as possible, it is the opinion of this author that the information in this report is in the public interest and that readers should use this information to reach their own conclusions about the topics discussed herein.", "opengraph": {"site_name": "The Greanville Post", "title": "Bats, Gene Editing and Bioweapons: Recent Darpa Experiments Raise Concerns Amid Coronavirus Outbreak | The Greanville Post", "description": "WHITNEY WEBB—Though the exact motivation behind the military’s interest in such technology is unknown, the Pentagon has been open about the fact that it is devoting much of its resources towards the containment of what it considers the two greatest threats to U.S. military hegemony: Russia and China. China has been cited as the greatest threat of the two by several Pentagon officials, including John Rood, the Pentagon’s top adviser for defense policy, who described China as the greatest threat to “our way of life in the United States” at the Aspen Security Forum last July.", "url": "https://www.greanvillepost.com/2020/03/02/bats-gene-editing-and-bioweapons-recent-darpa-experiments-raise-concerns-amid-coronavirus-outbreak/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/03/genome-NIH-DNA-sequence.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2020/03/genome-NIH-DNA-sequence.jpg", "https://www.nytimes.com/1977/12/26/archives/worldwide-propaganda-network-built-by-the-cia-a-worldwide-network.html", "https://pando.com/2015/03/01/internet-privacy-funded-by-spooks-a-brief-history-of-the-bbg/", "https://www.mintpressnews.com/planting-stories-in-the-press-lifting-of-us-propaganda-ban-gives-new-meaning-to-old-song/237493/", "https://www.rfa.org/english/news/china/outbreaks-09072018110830.html", "https://www.rfa.org/english/news/china/wuhan-outbreak-01092020133656.html", "https://www.rfa.org/english/news/china/wuhan-outbreak-01092020133656.html", "https://www.washingtontimes.com/news/2020/jan/24/virus-hit-wuhan-has-two-laboratories-linked-chines/", "https://www.researchgate.net/publication/254312047_The_Anthrax_Evidence_Points_to_Iraq", "https://www.cnsnews.com/news/article/israeli-experts-go-after-saddam-hussein-he-gets-nukes", "https://www.wired.com/1998/11/israels-ethnic-weapon/", "https://www.washingtontimes.com/news/2020/jan/24/virus-hit-wuhan-has-two-laboratories-linked-chines/", "https://www.washingtontimes.com/news/2020/jan/24/virus-hit-wuhan-has-two-laboratories-linked-chines/", "https://www.greanvillepost.com/wp-content/uploads/2020/03/bats-flock-.jpg", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "http://feeds.latimes.com/~r/latimes/news/science/~3/KHMZz6VDd-o/china-coronavirus-china-likely-originated-in-bats", "https://www.businessinsider.com/wuhan-coronavirus-chinese-wet-market-photos-2020-1", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(03)15329-9/fulltext", "https://www.biorxiv.org/content/10.1101/2020.01.26.919985v1.full", "https://www.stripes.com/news/us/us-military-is-interested-in-bats-as-possible-defenders-against-bioweapons-1.542849", "https://www.army-technology.com/features/featurethe-worlds-most-dangerous-bioweapons-4546207/", "https://www.scmp.com/news/world/united-states-canada/article/2153562/how-pentagon-planning-using-bats-battle-against", "https://www.darpa.mil/program/insect-allies", "https://www.newsweek.com/darpa-biological-weapons-insects-scientists-warn-1152834", "https://www.newsweek.com/darpa-biological-weapons-insects-scientists-warn-1152834", "https://www.independent.co.uk/news/science/us-military-plan-biological-weapons-insect-allies-virus-crop-darpa-a8568996.html", "https://www.independent.co.uk/news/science/us-military-plan-biological-weapons-insect-allies-virus-crop-darpa-a8568996.html", "https://www.bozemandailychronicle.com/news/montana_state_university/msu-project-to-prevent-bat-borne-diseases-wins-million-grant/article_805eb8ec-763c-53ff-87da-3d9c2466cd61.html", "https://source.colostate.edu/wuhan-coronavirus-once-again-on-the-brink-of-a-global-health-crisis-csu-researchers-respond/", "https://www.darpa.mil/news-events/2018-01-04", "https://www.vice.com/en_us/article/d34vyj/the-us-will-fund-research-to-make-pathogens-deadlier-again", "https://www.vice.com/en_us/article/d34vyj/the-us-will-fund-research-to-make-pathogens-deadlier-again", "https://www.grease-network.org/content/download/5407/40323/version/1/file/2017+CBEP+SPR+Program+Book_Final.pdf", "https://www.grease-network.org/content/download/5407/40323/version/1/file/2017+CBEP+SPR+Program+Book_Final.pdf", "https://www.rt.com/news/438543-georgia-us-laboratory-bio-weapons/", "https://www.rt.com/news/440309-us-georgia-toxic-bioweapon-test/", "http://dilyana.bg/us-diplomats-involved-in-trafficking-of-human-blood-and-pathogens-for-secret-military-program/", "https://www.fredericknewspost.com/news/health/fort-detrick-lab-shut-down-after-failed-safety-inspection-all/article_767f3459-59c2-510f-9067-bb215db4396d.html", "https://www.the-scientist.com/news-opinion/cdc-shuts-down-army-labs-disease-research-66235", "https://phys.org/news/2018-04-egyptian-fruit-genome-yields-clues.html", "https://globalbiodefense.com/2019/11/23/cdc-approves-partial-resumption-of-usamriid-select-agent-research/", "https://globalbiodefense.com/2019/11/23/cdc-approves-partial-resumption-of-usamriid-select-agent-research/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6002729/", "https://foreignpolicy.com/2014/04/03/cuban-twitter-and-other-times-usaid-pretended-to-be-an-intelligence-agency/", "https://www.newsweek.com/high-stakes-science-94931", "https://www.ncbi.nlm.nih.gov/pubmed/30999711", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6521082/", "https://www.nti.org/learn/facilities/812/", "https://www.nti.org/learn/glossary/#cooperative-threat-reduction-nunn-lugar-program", "https://www.nti.org/learn/facilities/812/", "https://www.salon.com/2013/08/29/the_us_is_building_a_bioweapons_lab_in_kazakhstan_newscred/", "https://dhvi.duke.edu/our-programs/pandemic-preparedness/duke-darpa-pandemic-prevent-platform-p3", "https://www.darpa.mil/program/pandemic-prevention-platform", "https://dhvi.duke.edu/our-programs/pandemic-preparedness/duke-darpa-pandemic-prevent-platform-p3", "https://www.wral.com/duke-kunshan-university-closed-during-coronavirus-outbreak-in-china/18909092/", "http://wbm.whu.edu.cn/English/Departments/Departments/Institute_of_Medical_Virology.htm", "https://www.counterpunch.org/2017/05/26/the-dirty-secret-of-the-korean-war/", "https://www.independent.co.uk/news/world/americas/pentagon-ticks-insects-biological-weapons-congress-bill-chris-smith-a9006701.html", "https://www.state.gov/biological-weapons-convention/", "https://www.counterpunch.org/2018/11/21/criminal-behavior-us-may-be-developing-biological-weapons/", "http://dilyana.bg/the-pentagon-bio-weapons/", "https://archive.org/details/RebuildingAmericasDefenses/page/n5/mode/2up", "https://apps.dtic.mil/dtic/tr/fulltext/u2/a556597.pdf", "https://www.theguardian.com/science/2017/dec/04/us-military-agency-invests-100m-in-genetic-extinction-technologies", "https://www.rt.com/usa/412019-pentagon-darpa-gene-drive/", "https://www.rt.com/usa/412019-pentagon-darpa-gene-drive/", "https://nationalinterest.org/blog/the-buzz/pentagon-russia-china-are-americas-biggest-military-threats-24495", "https://www.washingtonexaminer.com/policy/defense-national-security/top-pentagon-official-china-a-threat-to-our-way-of-life-in-the-united-states", "https://www.defensenews.com/pentagon/2018/01/30/the-pentagon-is-planning-for-war-with-china-and-russia-can-it-handle-both/", "https://www.mintpressnews.com/pentagon-planning-a-three-front-long-war-against-china-and-russia/240100/", "https://www.scmp.com/news/world/united-states-canada/article/2167058/pentagon-denies-russias-claim-us-running-secret", "https://www.mintpressnews.com/putin-questions-us-air-force-dna-collection-ethnic-russians/233946/", "https://ahrp.org/article-30/", "https://www.globalresearch.ca/chinas-new-coronavirus-an-examination-of-the-facts/5701662", "https://cepi.net/news_cepi/cepi-partners-with-university-of-queensland-to-create-rapid-response-vaccines/", "https://www.eurekalert.org/pub_releases/2011-02/uoc--uea021411.php", "https://www.thedrive.com/the-war-zone/12456/the-united-states-and-australia-quietly-test-hypersonic-missiles?iid=sr-link3", "https://www.crunchbase.com/organization/inovio-pharmaceuticals#section-funding-rounds", "https://www.marketwatch.com/press-release/inovio-pharmaceuticals-selected-by-darpa-to-lead-a-45-million-program-to-expedite-development-of-novel-products-to-prevent-and-treat-disease-caused-by-ebola-2015-04-08", "https://www.barrons.com/press-release/PR-CO-20190610-904931?tesla=y&tesla=y", "https://cepi.net/news_cepi/inovio-awarded-up-to-56-million-from-cepi-to-advance-dna-vaccines-against-lassa-fever-and-mers/", "https://cepi.net/news_cepi/cepi-to-fund-three-programmes-to-develop-vaccines-against-the-novel-coronavirus-ncov-2019/", "https://www.marketwatch.com/press-release/inovio-pharmaceuticals-dna-vaccine-against-ebola-and-marburg-filoviruses-provides-complete-protection-in-preclinical-challenge-study-2013-05-14", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6002729/", "http://ir.inovio.com/news-and-media/news/press-release-details/2018/Inovio-Enters-License-and-Collaboration-Agreementwith-ApolloBio-To-Develop-and-Commercialize-VGX-3100-in-Greater-China/default.aspx", "https://investors.modernatx.com/news-releases/news-release-details/darpa-awards-moderna-therapeutics-grant-25-million-develop", "https://www.morningstar.com/news/business-wire/20191211005159/moderna-announces-key-2020-investor-and-analyst-events", "https://www.nature.com/articles/d41586-019-03072-8", "https://www.ncbi.nlm.nih.gov/pubmed/16982535", "https://www.yahoo.com/news/darpa-developing-human-bio-factories-brew-lifesaving-vaccines-120915583.html", "https://www.yahoo.com/news/darpa-developing-human-bio-factories-brew-lifesaving-vaccines-120915583.html", "https://www.washingtonexaminer.com/policy/defense-national-security/military-wants-to-use-gene-editing-to-protect-troops-against-chemical-and-biological-weapons", "https://www.darpa.mil/program/safe-genes", "https://singularityhub.com/2018/01/25/heres-the-tech-that-could-one-day-track-boost-or-erase-human-memory/amp/", "https://singularityhub.com/2018/01/25/heres-the-tech-that-could-one-day-track-boost-or-erase-human-memory/amp/"], "authors": [], "publish_date": "March 2, 2020"}