{"result_id": "295037", "URL": "https://www.greanvillepost.com/2021/12/11/omicron-could-give-us-the-ultimate-natural-vaccine-to-retire-the-covid-pandemic-meantime-beware-of-covid-fear-porn/", "timestamp": "2023-04-25 17:23:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/12/11/omicron-could-give-us-the-ultimate-natural-vaccine-to-retire-the-covid-pandemic-meantime-beware-of-covid-fear-porn/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Omicron could give us the ultimate natural vaccine to retire the Covid pandemic. Meantime, beware of Covid fear porn.", "cleaned_text": "Please make sure these dispatches reach as many readers as possible. Share with kin, friends and workmates and ask them to do likewise.\n\nthe establishment media is an enabler of endless wars and illegitimate oligarchic power\n\nIs Omicron the End of the Pandemic? \n\n \n\n First run on Dec 9, 2021\n\n Omicron—a likely natural vaccine against the Covid virus—is bad news for Big Pharma, especially Pfizer, which dreams of having endless pandemics with their requisite endless profit-making artificial and highly inefficient \"boosters\".\n\n In other words, far from celebrating the arrival of a new Pfizer \"vaccine\" against Omicron, we should be decrying it. Of course, that's exactly what the establishment doesn't want us to do!\n\nBONUS FEATURES\n\n And here's the backstory. Covid 19 is not liable to be eradicated. Mutations will continue, as is the case with all viruses. But the latest variant, Omicron, is showing promising features that could powerfully influence the course of this pandemic: high transmissibility combined with mild disease symptoms. In medical terms this means that the virus is likely to become \"normalised\" in the human population, who would be attaining the equivalent of \"herd immunity\". Below, Jimmy skewers the media scaremongering about this latest variant.\n\nBELOW, watch how Jen Psaki fumbles when trying to give a straight sensible answer to a simple question. They serve their capitalist masters and they think in capitalist terms, that's why.\n\nThe views expressed herein are solely those of the author and may or may not reflect those of The Greanville Post. However, we do think they are important enough to be transmitted to a wider audience.\n\nIf you find the above useful, pass it on! Become an \"influence multiplier\"!\n\nSince the overpaid corporate media whores will never risk their careers to report the truth, the world must rely on citizen journalists to provide the facts that explain reality. Put this effort to use by becoming an influence multiplier. Repost this material everywhere you can. Send it to your friends and kin. Discuss it with your workmates. Liberation from this infernal and mendacious system is in your hands.\n\nThis post is part of our Orphaned Truths series with leading cultural and political analysts. People you can trust.\n\nIndecent Corporate Journos Won't Do the Job, So Citizen Journalists Must\n\nThe Jimmy Dore Show\n• Fiorella Isabel — Craig Pasta Jardula (The Convo Couch)\n• Mike Prysner & Abby Martin (The Empire Files)\n• Lee Camp's Redacted Tonight\n• Caleb Maupin\n• Jonathan Cook\n• Jim Kavanagh\n• Paul Edwards\n• David Pear\n• Steven Gowans\n• Max Blumenthal\n• Ben Norton\n• Aaron Maté\n• Anya Parampil (The Grayzone)\n• Caitlin Johnstone\n• Chris Hedges\n• Alex Rubinstein\n• Alex Mercouris\n• Margaret Kimberley\n• Danny Haiphong\n• Bruce Lerro\n• Israel Shamir\n• Ron Unz\n• The Saker\n• Alan Macleod\n• Eric Zuesse\n• Ed Curtin\n• Gary Olson\n• Andrei Martyanov\n• Jeff J Brown\n• Godfree Roberts\n• Jacques Pauwels\n• Max Parry\n• Matt Orfalea\n• Glenn Greenwald\n• Rick Sterling\n• Jim Miles\n• Janice Kortkamp\n• Margaret Flowers", "opengraph": {"site_name": "The Greanville Post", "title": "Omicron could give us the ultimate natural vaccine to retire the Covid pandemic. Meantime, beware of Covid fear porn. | The Greanville Post", "description": "Contrary to the fear porn about Covid, and Omicron, disseminated by the corporate media, this variant could be exactly what humanity needed to retire this pandemic, while conferring herd immunity in the best possible way, the natural way. ", "url": "https://www.greanvillepost.com/2021/12/11/omicron-could-give-us-the-ultimate-natural-vaccine-to-retire-the-covid-pandemic-meantime-beware-of-covid-fear-porn/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-11-at-6.07.55-PM.png", "article:section": "BOUGHT POLITICIANS & PHONIES", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/channel/UCF9IOB2TExg3QIBupFtBDxg", "https://www.youtube.com/channel/UCF9IOB2TExg3QIBupFtBDxg", "http://creativecommons.org/licenses/by-nc/4.0/", "https://www.greanvillepost.com/wp-content/uploads/2021/01/cc-logo-by-nc-sa.png"], "authors": [], "publish_date": "December 11, 2021"}