{"result_id": "295040", "URL": "https://www.greanvillepost.com/2020/04/05/ground-control-to-planet-lockdown-this-is-only-a-test/", "timestamp": "2023-04-25 17:23:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/04/05/ground-control-to-planet-lockdown-this-is-only-a-test/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Ground Control to Planet Lockdown: This Is Only a Test", "cleaned_text": "[dropcap]A[/dropcap]s much as Covid-19 is a circuit breaker, a time bomb and an actual weapon of mass destruction (WMD), a fierce debate is raging worldwide on the wisdom of mass quarantine applied to entire cities, states and nations.\n\nThose against it argue Planet Lockdown not only is not stopping the spread of Covid-19 but also has landed the global economy into a cryogenic state – with unforeseen, dire consequences. Thus quarantine should apply essentially to the population with the greatest risk of death: the elderly.\n\nWith Planet Lockdown transfixed by heart-breaking reports from the Covid-19 frontline, there’s no question this is an incendiary assertion.\n\nIn parallel, a total corporate media takeover is implying that if the numbers do not substantially go down, Planet Lockdown – an euphemism for house arrest – remains, indefinitely.\n\nMichael Levitt, 2013 Nobel Prize in chemistry and Stanford biophysicist, was spot on when he calculated that China would get through the worst of Covid-19 way before throngs of health experts believed, and that “What we need is to control the panic”.\n\nLet’s cross this over with some facts and dissident opinion, in the interest of fostering an informed debate.\n\nThe report Covid-19 – Navigating the Uncharted was co-authored by Dr. Anthony Fauci – the White House face of the fight –, H. Clifford Lane, and CDC director Robert R. Redfield. So it comes from the heart of the U.S. healthcare establishment.\n\nThe report explicitly states, “the overall clinical consequences of Covid-19 may ultimately be more akin to those of a severe seasonal influenza (which has a case fatality rate of approximately 0.1%) or a pandemic influenza (similar to those in 1957 and 1968) rather than a disease similar to SARS or MERS, which have had case fatality rates of 9 to 10% and 36%, respectively.”\n\nOn March 19, four days before Downing Street ordered the British lockdown, Covid-19 was downgraded from the status of “High Consequence Infectious Disease.”\n\nJohn Lee, recently retired professor of pathology and former NHS consultant pathologist, has recently argued that, “the world’s 18,944 coronavirus deaths represent 0.14 per cent of the total. These figures might shoot up but they are, right now, lower than other infectious diseases that we live with (such as flu).”\n\nHe recommends, “a degree of social distancing should be maintained for a while, especially for the elderly and the immune-suppressed. But when drastic measures are introduced, they should be based on clear evidence. In the case of Covid-19, the evidence is not clear.”\n\nThat’s essentially the same point developed by a Russian military intel analyst.\n\nNo less than 22 scientists – see here and here – have expanded on their doubts about the Western strategy.\n\nDr. Sucharit Bhakdi, Professor Emeritus of Medical Microbiology at the Johannes Gutenberg University in Mainz, has provoked immense controversy with his open letter to Chancellor Merkel, stressing the “truly unforeseeable consequences of the drastic containment measures which are currently being applied in large parts of Europe.”\n\nEven New York governor Andrew Cuomo admitted on the record about the error of quarantining elderly people with illnesses alongside the fit young population.\n\nThe absolutely key issue is how the West was caught completely unprepared for the spread of Covid-19 – even after being provided a head start of two months by China, and having the time to study different successful strategies applied across Asia.\n\nThere are no secrets for the success of the South Korean model.\n\nSouth Korea was producing test kits already in early January, and by March was testing 100,000 people a day, after establishing strict control of the whole population – to Western cries of “no protection of private life”. That was before the West embarked on Planet Lockdown mode.\n\nSouth Korea was all about testing early, often and safely – in tandem with quick, thorough contact tracing, isolation and surveillance.\n\nCovid-19 carriers are monitored with the help of video-surveillance cameras, credit card purchases, smartphone records. Add to it SMS sent to everyone when a new case is detected near them or their place of work. Those in self-isolation need an app to be constantly monitored; non-compliance means a fine to the equivalent of $2,800.\n\nIn early March, the Chinese Journal of Infectious Diseases, hosted by the Shanghai Medical Association, pre-published an Expert Consensus on Comprehensive Treatment of Coronavirus in Shanghai. Treatment recommendations included, “large doses of vitamin C…injected intravenously at a dose of 100 to 200 mg / kg per day. The duration of continuous use is to significantly improve the oxygenation index.”\n\nThat’s the reason why 50 tons of Vitamin C was shipped to Hubei province in early February. It’s a stark example of a simple “mitigation” solution capable of minimizing economic catastrophe.\n\nIn contrast, it’s as if the brutally fast Chinese “people’s war” counterpunch against Covid-19 had caught Washington totally unprepared. Steady intel rumbles on the Chinese net point to Beijing having already studied all plausible leads towards the origin of the Sars-Cov-2 virus – vital information that will be certainly weaponized, Sun Tzu style, at the right time.\n\nAs it stands, the sustainability of the complex Eurasian integration project has not been substantially compromised. As the EU has provided the whole planet with a graphic demonstration of its cluelessness and helplessness, everyday the Russia-China strategic partnership gets stronger – increasingly investing in soft power and advancing a pan-Eurasia dialogue which includes, crucially, medical help.\n\nFacing this process, the EU’s top diplomat, Joseph Borrell, sounds indeed so helpless: “There is a global battle of narratives going on in which timing is a crucial factor. […] China has brought down local new infections to single figures – and it is now sending equipment and doctors to Europe, as others do as well. China is aggressively pushing the message that, unlike the U.S., it is a responsible and reliable partner. In the battle of narratives we have also seen attempts to discredit the EU (…) We must be aware there is a geo-political component including a struggle for influence through spinning and the ‘politics of generosity’. Armed with facts, we need to defend Europe against its detractors.”\n\nThat takes us to really explosive territory. A critique of the Planet Lockdown strategy inevitably raises serious questions pointing to a controlled demolition of the global economy. What is already in stark effect are myriad declinations of martial law, severe social media policing in Ministry of Truth mode, and the return of strict border controls.\n\nThese are unequivocal markings of a massive social re-engineering project, complete with inbuilt full monitoring, population control and social distancing promoted as the new normal.\n\nThat would be taking to the limit Secretary of State Mike “we lie, we cheat, we steal” Pompeo’s assertion, on the record, that Covid-19 is a live military exercise: “This matter is going forward — we are in a live exercise here to get this right.”\n\nSo as we face a New Great Depression, steps leading to a Brave New World are already discernable. It goes way beyond a mere Bretton Woods 2.0, in the manner that Pam and Russ Martens superbly deconstruct the recent $2 trillion, Capitol Hill-approved stimulus to the U.S. economy.\n\nEssentially, the Fed will “leverage the bill’s $454 million bailout slush fund into $4.5 trillion”. And no questions are allowed on who gets the money, because the bill simply cancels the Freedom of Information Act (FOIA) for the Fed.\n\nThe privileged private contractor for the slush fund is none other than BlackRock. Here’s the extremely short version of the whole, astonishing scheme, masterfully detailed here.\n\nWall Street has turned the Fed into a hedge fund. The Fed is going to own at least two thirds of all U.S. Treasury bills wallowing in the market before the end of the year.\n\nThe U.S. Treasury will be buying every security and loan in sight while the Fed will be the banker – financing the whole scheme.\n\nSo essentially this is a Fed/ Treasury merger. A behemoth dispensing loads of helicopter money – with BlackRock as the undisputable winner.\n\nBlackRock is widely known as the biggest money manager on the planet. Their tentacles are everywhere. They own 5% of Apple, 5% of Exxon Mobil, 6% of Google, second largest shareholder of AT&T (Turner, HBO, CNN, Warner Brothers) – these are just a few examples.\n\nThey will buy all these securities and manage those dodgy special Purpose Vehicles (SPVs) on behalf of the Treasury.\n\nBlackRock not only is the top investor in Goldman Sachs. Better yet: Blackrock is bigger than Goldman Sachs, JP Morgan and Deutsche Bank combined. BlackRock is a serious Trump donor. Now, for all practical purposes, it will be the operating system – the Chrome, Firefox, Safari – of Fed/Treasury.\n\nThis represents the definitive Wall Street-ization of the Fed – with no evidence whatsoever it will lead to any improvement in the lives of the average American.\n\nWestern corporate media, en masse, have virtually ignored the myriad, devastating economic consequences of Planet Lockdown. Wall to wall coverage barely mentions the astonishing economic human wreckage already in effect – especially for the masses barely surviving, so far, in the informal economy.\n\nFor all practical purposes, the Global War on Terror (GWOT) has been replaced by the Global War on Virus (GWOV). But what is not being seriously analyzed is the Perfect Toxic Storm: a totally shattered economy; The Mother of All Financial Crashes – barely masked by the trillions in helicopter money from the Fed and the ECB; the tens of millions of unemployed engendered by the New Great Depression; the millions of small businesses that will simply disappear; a widespread, global mental health crisis. Not to mention the masses of elderly, especially in the U.S., that will be issued an unspoken “drop dead” notice.\n\nBeyond any rhetoric about “decoupling”, the global economy is already, de facto, split in two. On one side, we have Eurasia, Africa and swathes of Latin America – what China will be painstakingly connecting and reconnecting via the New Silk Roads. On the other side, we have North America and selected Western vassals. A puzzled Europe lies in the middle.\n\nA cryogenically induced global economy certainly facilitates a reboot. Trumpism is the New Exceptionalism – so that means an isolationist MAGA on steroids. In contrast, China will painstakingly reboot its market base along the New Silk Roads – Africa and Latin America included – to replace the 20% of trade/exports to be lost with the U.S.\n\nThe meager $1,200 checks promised to Americans are a de facto precursor of the much touted Universal Basic Income (UBI). They may become permanent as tens of millions of people will be permanently unemployed. That will facilitate the transition towards a totally automated, 24/7 economy run by AI – thus the importance of 5G.\n\nAnd that’s where ID2020 comes in.\n\nThe European Commission is involved in a crucial but virtually unknown project, CREMA (Cloud Based Rapid Elastic Manufacturing) which aims to facilitate the widest possible implementation of AI in conjunction to the advent of a cashless One-World system.\n\nThe end of cash necessarily implies a One-World government capable of dispensing – and controlling – UBI; a de facto full accomplishment of Foucault’s studies on biopolitics. Anyone is liable to be erased from the system if an algorithm equals this individual with dissent.\n\nIt gets even sexier when absolute social control is promoted as an innocent vaccine.\n\nID2020 is self-described as a benign alliance of “public-private partners”. Essentially, it is an electronic ID platform based on generalized vaccination. And its starts at birth; newborns will be provided with a “portable and persistent biometrically-linked digital identity.”\n\nGAVI, the Global Alliance for Vaccines and Immunization, pledges to “protect people’s health “ and provide “immunization for all”. Top partners and sponsors, apart from the WHO, include, predictably, Big Pharma.\n\nAt the ID2020 Alliance summit last September in New York, it was decided that the “Rising to the Good ID Challenge” program would be launched in 2020. That was confirmed by the World Economic Forum (WEF) this past January in Davos. The digital identity will be tested with the government of Bangladesh.\n\nThat poses a serious question: was ID2020 timed to coincide with what a crucial sponsor, the WHO, qualified as a pandemic? Or was a pandemic absolutely crucial to justify the launch of ID2020?\n\nAs game-changing trial runs go, nothing of course beats Event 201, which took place less than a month after ID2020.\n\nThe Johns Hopkins Center for Health Security in partnership with, once again, the WEF, as well as the Bill and Melinda Gates Foundation, described Event 201 as “a high-level pandemic exercise”. The exercise “illustrated areas where public/private partnerships will be necessary during the response to a severe pandemic in order to diminish large-scale economic and societal consequences.”\n\nWith Covid-19 in effect as a pandemic, the Johns Hopkins Bloomberg School of Public Health was forced to issue a statement basically saying they just “modeled a fictional coronavirus pandemic, but we explicitly stated that it was not a prediction”.\n\nThere’s no question “a severe pandemic, which becomes ‘Event 201’ would require reliable cooperation among several industries, national governments, and key international institutions”, as spun by the sponsors. Covid-19 is eliciting exactly this kind of “cooperation”. Whether it’s “reliable” is open to endless debate.\n\nThe fact is that, all over Planet Lockdown, a groundswell of public opinion is leaning towards defining the current state of affairs as a global psyop: a deliberate global meltdown – the New Great Depression – imposed on unsuspecting citizens by design.\n\nThe powers that be, taking their cue from the tried and tested, decades-old CIA playbook, of course are breathlessly calling it a “conspiracy theory”. Yet what vast swathes of global public opinion observe is a – dangerous – virus being used as cover for the advent of a new, digital financial system, complete with a forced vaccine cum nanochip creating a full, individual, digital identity.\n\nThe most plausible scenario for our immediate future reads like clusters of smart cities linked by AI, with people monitored full time and duly micro-chipped doing what they need with a unified digital currency, in an atmosphere of Bentham’s and Foucault’s Panopticum on overdrive.\n\nSo if this is really our future, the existing world-system has to go. This is a test, this is only a test.", "opengraph": {"site_name": "The Greanville Post", "title": "Ground Control to Planet Lockdown: This Is Only a Test | The Greanville Post", "description": "PEPE ESCOBAR—Western corporate media, en masse, have virtually ignored the myriad, devastating economic consequences of Planet Lockdown. Wall to wall coverage barely mentions the astonishing economic human wreckage already in effect – especially for the masses barely surviving, so far, in the informal economy.", "url": "https://www.greanvillepost.com/2020/04/05/ground-control-to-planet-lockdown-this-is-only-a-test/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/04/LOCKDOWN_LOCKDOWN_LOCKDOWN_150330-F-VJ293-217.jpg", "article:section": "ANTI-CORPORATISM", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.latimes.com/science/story/2020-03-22/coronavirus-outbreak-nobel-laureate", "https://www.nejm.org/doi/full/10.1056/NEJMe2002387", "https://www.gov.uk/guidance/high-consequence-infectious-diseases-hcid", "https://www.spectator.co.uk/article/The-evidence-on-Covid-19-is-not-as-clear-as-we-think", "https://www.fort-russ.com/2020/03/covid-19-it-may-turn-out-that-the-world-has-been-deceived-hints-russian-military-intelligence-agent/", "https://off-guardian.org/2020/03/24/12-experts-questioning-the-coronavirus-panic/", "https://off-guardian.org/2020/03/28/10-more-experts-criticising-the-coronavirus-panic/", "https://off-guardian.org/2020/03/31/open-letter-from-prof-sucharit-bhakdi-to-chancellor-merkel/?fbclid=IwAR0jdc7ofugptKgkMHet8WFxWxkWCkxV2BzW1lOw4hXaT6YLxeaXIrfQMuE&__cf_chl_jschl_tk__=89b159eb35b9a2bd0a494b50f767046d89a493c8-1585659573-0-AeZ3yICPpvVgI68ZEnpTKvPuvELDSB9lj7l_GW58uJYyjNQWSwQIQmfeGqYe7RN_E4CoE1mX5DOlGdA-Tpu4996VkbGFMJwRRQNlK9L1_gaFvv9EoRJwQlNMr-QKg0AW3nGO7qhz-96xsFmMYlJ-Rjw6FwHeHd-a-8x8eI6DlxglAD8GSAvLpBcX9mTt6odR5daG7L_WqF_Wl7uwJ0GSQVEqQ7LKNiNbeXGq0FegbFYP9_S4qTnSiYfKVXW4h2dKYMLUVVJLB21CharX45Bg1mYl8rpjl7dDw2G0istkw-ZQBQ6EYVCJgvJB3hE8I0Qmbo6o4EuPkqoqNsCjiwdQQtFqDEhXC2__9pj7Uey-0UQRuvoVfsWw5xGGM2kVEd4YcE-infpT4m2XNCarPag_FnPHFYZwuG8ezo1AhQfkULt9dmJZ0X-Wu3F5klxHDwHFIMyX8-erGWo5mLpRKTUWIUA", "https://mp.weixin.qq.com/s/bF2YhJKiOfe1yimBc4XwOA", "https://eeas.europa.eu/headquarters/headquarters-homepage/76379/coronavirus-pandemic-and-new-world-it-creating_en", "https://wallstreetonparade.com/2020/03/stimulus-bill-allows-federal-reserve-to-conduct-meetings-in-secret-gives-fed-454-billion-slush-fund-for-wall-street-bailouts/", "https://www.counterpunch.org/2020/03/30/washington-uses-the-pandemic-to-create-a-2-trillion-slush-fund-for-its-cronies/", "https://fashthenation.com/2020/03/how-trump-nationalized-u-s-financial-markets/", "https://cordis.europa.eu/project/id/637066", "https://findbiometrics.com/new-id2020-project-to-build-biometric-id-program-around-infant-immunization/", "https://euvsdisinfo.eu/report/the-coronavirus-moves-us-towards-a-totalitarian-state-of-the-world-and-the-introduction-of-agenda-id2020/", "https://www.gavi.org/", "http://www.centerforhealthsecurity.org/event201/", "http://www.centerforhealthsecurity.org/newsroom/center-news/2020-01-24-Statement-of-Clarification-Event201.html"], "authors": [], "publish_date": "April 5, 2020"}