{"result_id": "295029", "URL": "https://www.greanvillepost.com/2020/04/20/moon-of-alabama-pushes-back-against-those-claiming-covid-19-lockdowns-are-unjustified/", "timestamp": "2023-04-25 17:22:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/04/20/moon-of-alabama-pushes-back-against-those-claiming-covid-19-lockdowns-are-unjustified/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Moon of Alabama pushes back against those claiming Covid-19 lockdowns are unjustified", "cleaned_text": "Please make sure these dispatches reach as many readers as possible. Share with kin, friends and workmates and ask them to do likewise.\n\nDISPATCHES FROM MOON OF ALABAMA, BY \"B\"\n\n This article is part of an ongoing series of dispatches from Moon of Alabama\n\n\n\nOn two Coronavirus pieces on other websites:\n• Sweden Is Right. The Economy Should be Left Open - Mike Whitney, UNZ\n\nThe piece debunks itself when it quotes a Swedish epidemiologist who says:\n\nSweden can do without orders of social distancing because its people will socially distance voluntarily when asked. That works because \"there is a high level of trust here between the population and the authorities\". That does not hold for the community of Somali people and other immigrants in Sweden more of whom are dying than in any other group.\n\nNow project such a voluntary attempt onto the U.S. public where there is little, if any, trust between the population and the authorities. It simply would not work and one would soon have a runaway epidemic with all its bad consequences. Whitney's conclusion that we should all do like Sweden is thus not justified.\n\nThe [above] piece was posted on April 17. One of the 'experts' it quotes is Dr. John Oxford, \"an English virologist and Professor at Queen Mary, University of London.\" Here is the quote as posted on Off-Guardian:\n\na. On April 17, when Off-Guardian posted the piece, the United Kingdom already had 14.607 deaths from Covid-19. Those were 6.600 more than the total number Dr. John Oxford predicted. If the real numbers, which are still increasing, are already 80+% higher than the expert's guesstimate should one really use that expert to claim that the 'coronavirus panic' is unjustified?\n\nb. Dr. Oxford made his claim in a \"blog post on Novus Communications website\". Novus Comes is a public relations agency which provides \"financial social media & digital communications for small caps\". The company is paid by its clients to talk up certain sectors of the stock market. Should one really use paid PR posts on a PR company's website to judge if some 'panic' about an epidemic is justified?\n\nAs for the other 'experts' Off-Guardian quoted. Yes, there are some doctors who do have a different opinion than most of their colleagues. But that does not make them right.\n\nAn astroturfing campaign was launched in the U.S. to end the lockdowns. It is paid for by rightwing big money:\n\nCovid-19 is a really, really nasty disease:\n• How does coronavirus kill? Clinicians trace a ferocious rampage through the body, from brain to toes - Science\n• Confusion, seizure, strokes: How COVID-19 may affect the brain - AFP\n• Coronavirus infection may cause lasting damage throughout the body, doctors fear - LA Times\n• Coronavirus Antibodies May Not Make You Immune, WHO Warns - Forbes\n\nWe need to learn from this:\n• Leaked Labour Report Shows Party’s Own Senior Staff Acted To Keep Corbyn Out Of Power - Media Lens\n\nPosted by b on April 19, 2020 at 14:26 UTC Permalink\n\nCommentary on Trump's Tweets (excerpts)\n\n Mary McCord, The Washington Post (Reposted on The Hour, Norwalk, Conn.)\n\nPresident Donald Trump incited insurrection Friday against the duly elected governors of the states of Michigan, Minnesota and Virginia. Just a day after issuing guidance for reopening America that clearly deferred decision-making to state officials - as it must under our constitutional order - the president undercut his own guidance by calling for criminal acts against the governors for not opening fast enough.\n\nTrump tweeted, \"LIBERATE MINNESOTA!\" followed immediately by \"LIBERATE MICHIGAN!\" and then \"LIBERATE VIRGINIA, and save your great 2nd Amendment. It is under siege!\" This follows Wednesday's demonstration in Michigan, in which armed protesters surrounded the state capitol building in Lansing chanting \"Lock her up!\" in reference to Democratic Gov. Gretchen Whitmer, and \"We will not comply,\" in reference to her extension of the state's coronavirus-related stay-at-home order. Much smaller and less-armed groups had on Thursday protested on the state capitol grounds in Richmond, Va., and outside the governor's mansion in St. Paul, Minn.\n\n\"Liberate\" - particularly when it's declared by the chief executive of our republic - isn't some sort of cheeky throwaway. Its definition is \"to set at liberty,\" specifically \"to free (something, such as a country) from domination by a foreign power.\" We historically associate it with the armed defeat of hostile forces during war, such as the liberation of Western Europe from Nazi Germany's control during World War II. Just over a year ago, Trump himself announced that \"the United States has liberated all ISIS-controlled territory in Syria and Iraq.\"\n\nIn that context, it's not at all unreasonable to consider Trump's tweets about \"liberation\" as at least tacit encouragement to citizens to take up arms against duly elected state officials of the party opposite his own, in response to sometimes unpopular but legally issued stay-at-home orders. This is especially so given the president's reference to the Second Amendment being \"under siege\" in Virginia, where Democratic Gov. Ralph Northam just signed into law a number of gun-safety bills passed during the most recent session of the state general assembly - bills that prompted protests by Second Amendment absolutists at the state capitol in January, leading Northam to declare a state of emergency and temporarily ban firearms from the capitol grounds due to the threat of violence.\n\n <.>\n\nRegardless of whether the tweets are criminal on their own, more importantly, they are irresponsible and dangerous. Private armed militias recently expressed eagerness to support the president's veiled call to arms when he shared a comment on Twitter suggesting that if he were impeached and removed from office, it could lead to civil war:\n\nJust a day before, the Oath Keepers Twitter account tweeted, in an apparent reference to the president, that \"All he has to do is call us up. We WILL answer the call.\" Months before, vigilante groups responded to Trump's frequent rhetoric about an \"invasion\" on America's southern border by deploying to the border and illegally detaining migrants while heavily armed, dressed in military fatigues and calling themselves the \"United Constitutional Patriots.\"\n\nTrump has a bully pulpit unlike an ordinary citizen. His Twitter account boasts over 77 million followers, but many more see his tweets when they're retweeted by others, posted on other social media and covered by media outlets. He is prolific, having tweeted more than 50,000 times. And he is influential: his three \"Liberation\" tweets have been retweeted and \"liked\" hundreds of thousands of times. We are not talking about a typical person when we consider the impact of his statements.\n\nRead the whole article here.\n\n\"b\" is Moon of Alabama's founding (and chief) editor. This site's purpose is to discuss politics, economics, philosophy and blogger Billmon's Whiskey Bar writings. Moon Of Alabama was opened as an independent, open forum for members of the Whiskey Bar community. Bernhard )\"b\") started and still runs the site. Once in a while you will also find posts and art from regular commentators. You can reach the current administrator of this site by emailing Bernhard at MoonofA@aol.com. \n\n This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License.", "opengraph": {"site_name": "The Greanville Post", "title": "Moon of Alabama pushes back against those claiming Covid-19 lockdowns are unjustified | The Greanville Post", "description": "MoA—\"Liberate\" - particularly when it's declared by the chief executive of our republic - isn't some sort of cheeky throwaway. Its definition is \"to set at liberty,\" specifically \"to free (something, such as a country) from domination by a foreign power.\" We historically associate it with the armed defeat of hostile forces during war, such as the liberation of Western Europe from Nazi Germany's control during World War II. Just over a year ago, Trump himself announced that \"the United States has liberated all ISIS-controlled territory in Syria and Iraq.\"", "url": "https://www.greanvillepost.com/2020/04/20/moon-of-alabama-pushes-back-against-those-claiming-covid-19-lockdowns-are-unjustified/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-20-at-8.36.22-PM.png", "article:section": "AMERICAN STUDIES", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">LIBERATE VIRGINIA, and save your great 2nd Amendment. It is under siege!</p> <p>— Donald J. Trump (@realDonaldTrump) <a href=\"https://twitter.com/realDonaldTrump/status/1251169987110330372?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Trump's tweets encouraged online extremists to speculate whether he was advocating for armed conflict, an event they’ve termed \"the boogaloo.” Afterward, there was a sharp increase in both the use of conspiracy terminology and violent threats online. <a href=\"https://t.co/viMiM0HqyY\">https://t.co/viMiM0HqyY</a></p> <p>— Shannon Watts (@shannonrwatts) <a href=\"https://twitter.com/shannonrwatts/status/1251271744125415424?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">“Trump’s tweets about “liberation” [are] at least tacit encouragement to citizens to take up arms against duly elected state officials of the party opposite his own, in response to sometimes unpopular but legally issued stay-at-home orders.”<a href=\"https://t.co/xkidKWvFCj\">https://t.co/xkidKWvFCj</a></p> <p>— Laurence Tribe (@tribelaw) <a href=\"https://twitter.com/tribelaw/status/1251531862222286848?ref_src=twsrc%5Etfw\">April 18, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Protesters demanding an end to shutdown orders gathered in streets and outside several states' capitol buildings on Saturday, a day after President Trump posted a series of tweets calling for demonstrators to \"LIBERATE\" certain states. <a href=\"https://t.co/iN05lWNLoC\">https://t.co/iN05lWNLoC</a></p> <p>— NBC News (@NBCNews) <a href=\"https://twitter.com/NBCNews/status/1251632358257831937?ref_src=twsrc%5Etfw\">April 18, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">The “liberate Minnesota” protesters are now outside the home of the governor.</p> <p><a href=\"https://t.co/MoppWGHnxJ\">pic.twitter.com/MoppWGHnxJ</a></p> <p>— Joshua Potash (@JoshuaPotash) <a href=\"https://twitter.com/JoshuaPotash/status/1251198456342945794?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Liberate Michigan<br/> Liberate Minnesota<br/> Liberate Virginia</p> <p>How about Liberate America!</p> <p>Trump is tweeting this shit and inciting violence? <a href=\"https://t.co/CPi60FoxmR\">pic.twitter.com/CPi60FoxmR</a></p> <p>— Jerry Avenaim (@avenaim) <a href=\"https://twitter.com/avenaim/status/1251192954531840002?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Here's the Fox News segment that inspired Trump's unhinged \"LIBERATE MINNESOTA\" tweet (as <a href=\"https://twitter.com/MattGertz?ref_src=twsrc%5Etfw\">@MattGertz</a> notes it ran just two minutes before Trump's tweet was posted) <a href=\"https://t.co/mHLxCcpoDP\">pic.twitter.com/mHLxCcpoDP</a></p> <p>— Aaron Rupar (@atrupar) <a href=\"https://twitter.com/atrupar/status/1251176679965327361?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Trump's call to LIBERATE Minnesota and out of The entire state of Minnesota- over 5 million people- only a few hundred showed up for a protest. Looking more and more like this November we will LIBERATE AMERICA From Trump and the virus known as Trumpism <a href=\"https://t.co/khEF4ef16D\">https://t.co/khEF4ef16D</a></p> <p>— (((DeanObeidallah))) (@DeanObeidallah) <a href=\"https://twitter.com/DeanObeidallah/status/1251207615046193155?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> ", "<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">Donald Trump is massive piece of shit! Tweeting (instead of actually doing his fucking job) to liberate Michigan, Virginia &amp; Minnesota states with a stay at home order.. basically encouraging his insane fan base to protest etc. Further spreading this virus. Fuck him! <a href=\"https://t.co/vJwCZ40spQ\">pic.twitter.com/vJwCZ40spQ</a></p> <p>— Amy ???????????? (@Steelers_Girl74) <a href=\"https://twitter.com/Steelers_Girl74/status/1251188849474260994?ref_src=twsrc%5Etfw\">April 17, 2020</a></p></blockquote> "], "movies": [], "links": ["http://www.moonofalabama.org", "https://www.greanvillepost.com/wp-content/uploads/2018/02/Moa1.jpg", "https://www.unz.com/mwhitney/sweden-is-right-the-economy-should-be-left-open/", "https://news.yahoo.com/coronavirus-spotlights-swedish-segregation-080301154.html", "https://english.alaraby.co.uk/english/news/2020/3/25/somalis-are-dying-of-coronavirus-in-sweden", "https://off-guardian.org/2020/04/17/8-more-experts-questioning-the-coronavirus-panic/", "http://91-divoc.com/pages/covid-visualization/", "https://novuscomms.com/", "https://www.greanvillepost.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-20-at-8.36.22-PM.png", "https://twitter.com/mcmillen/status/1251632509848297474", "https://www.reddit.com/r/maryland/comments/g3niq3/i_simply_cannot_believe_that_people_are/fnstpyl/", "https://twitter.com/marcowenjones/status/1251772613346709506", "https://twitter.com/realDonaldTrump/status/1251169987110330372?ref_src=twsrc%5Etfw", "https://www.sciencemag.org/news/2020/04/how-does-coronavirus-kill-clinicians-trace-ferocious-rampage-through-body-brain-toes", "https://www.afp.com/en/news/15/confusion-seizure-strokes-how-covid-19-may-affect-brain-doc-1qo2w12", "https://www.latimes.com/science/story/2020-04-10/coronavirus-infection-can-do-lasting-damage-to-the-heart-liver", "https://www.forbes.com/sites/marleycoyne/2020/04/17/coronavirus-antibodies-may-not-make-you-immune-who-warns/#557d9335133a", "https://www.medialens.org/2020/the-people-have-spoken-bastards-leaked-labour-report-shows-partys-own-senior-staff-acted-to-keep-corbyn-out-of-power/", "https://www.moonofalabama.org/2020/04/the-moa-week-in-review-open-thread-2020-31.html", "https://t.co/viMiM0HqyY", "https://twitter.com/shannonrwatts/status/1251271744125415424?ref_src=twsrc%5Etfw", "https://t.co/xkidKWvFCj", "https://twitter.com/tribelaw/status/1251531862222286848?ref_src=twsrc%5Etfw", "https://t.co/iN05lWNLoC", "https://twitter.com/NBCNews/status/1251632358257831937?ref_src=twsrc%5Etfw", "https://t.co/MoppWGHnxJ", "https://twitter.com/JoshuaPotash/status/1251198456342945794?ref_src=twsrc%5Etfw", "https://t.co/CPi60FoxmR", "https://twitter.com/avenaim/status/1251192954531840002?ref_src=twsrc%5Etfw", "https://twitter.com/MattGertz?ref_src=twsrc%5Etfw", "https://t.co/mHLxCcpoDP", "https://twitter.com/atrupar/status/1251176679965327361?ref_src=twsrc%5Etfw", "https://t.co/khEF4ef16D", "https://twitter.com/DeanObeidallah/status/1251207615046193155?ref_src=twsrc%5Etfw", "https://www.thehour.com/news/article/Trump-s-LIBERATE-MICHIGAN-tweets-incite-15209368.php", "https://t.co/vJwCZ40spQ", "https://twitter.com/Steelers_Girl74/status/1251188849474260994?ref_src=twsrc%5Etfw", "https://www.thehour.com/news/article/Trump-s-LIBERATE-MICHIGAN-tweets-incite-15209368.php", "http://www.billmon.org/", "mailto:MoonofA@aol.com", "http://creativecommons.org/licenses/by-nc/4.0/", "http://creativecommons.org/licenses/by-nc/4.0/", "https://www.greanvillepost.com/wp-content/uploads/2017/11/LeaveComment.jpg", "https://www.facebook.com/groups/greanvillepost/", "https://www.greanvillepost.com/wp-content/uploads/2016/01/black-horizontal.png"], "authors": [], "publish_date": "April 20, 2020"}