{"result_id": "295034", "URL": "https://www.greanvillepost.com/2021/10/10/who-is-an-anti-vaxxer/", "timestamp": "2023-04-25 17:22:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/10/10/who-is-an-anti-vaxxer/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Who is an Anti-vaxxer?", "cleaned_text": "overnments in certain countries, with the support of Big Pharma and the media, are mandating that citizens must vaccinate or be denied the right to enjoy public amenities in society, such as restaurants, cinemas, night clubs, museums, sporting events, etc. Those who wish to travel may be barred by not having documentation of being fully vaccinated. Probably worst of all, people are being fired from their jobs for refusing vaccination. These people who are fearful of the vaccines, in particular the mRNA vaccine, are being denigrated by calling them anti-vaxxers.\n\nFirst, is the mRNA vaccine even a vaccine? The World Health Organization (WHO) says,\n\nThe mRNA vaccines do not contain “only killed or weakened forms of germs like viruses or bacteria.” Even worse, reports of adverse reactions to the mRNA purported vaccines are on the increase, even causing death. So if the mRNA “vaccine” is not by definition a vaccine, then people opposed to being injected with the experimental mRNA “vaccine” can not truthfully be labeled anti-vaxxers.\n\nSecond, even if mRNA “vaccines” were accepted to be vaccines, is it still proper to call vaccine skeptics anti-vaxxers? Is the ad hominem truthful? Assuredly many, if not most, of the people opposed to being jabbed with the mRNA “vaccines” and other experimental vaccines have been willingly vaccinated previously to protect against other infections, among them whooping cough, chicken pox, measles, smallpox, rubella, tetanus, mumps, and perhaps others. Having received so many vaccinations, and having agreed to their children being vaccinated, then how accurate is it to demean these people as anti-vaxxers?\n\nThird, are the vaccine skeptics opposed to others who of their own volition receive vaccines? Vaccine skeptics take action to protect their bodily sovereignty; they do not force others to receive or refuse vaccination. So they are not anti-vaxxers.\n\nFourth, the vaccines are experimental. On 29 September, Globaldata Healthdcare reported, “Currently, there are over 2,000 COVID-19 clinical trials recruiting patients, with 16% being for vaccines and 84% for therapeutics.” One cannot ethically be mandated to take part in an experiment. Informed consent is required.\n\nAre some people opposed to being vaccinated by any vaccine for COVID-19? Sure, some are. Others are just opposed to having an experimental mRNA “vaccine” injected into their body. They have heard that these mRNA “vaccines” are not genuine vaccines; many would, however, accept a traditional vaccine that has been demonstrated experimentally to be safe and effective. These vaccines tend to be most prominent in China, and their usage in the West would cut into the mega-bucks that western pharmaceutical companies are currently reaping. Yet China has declared its COVID-19 vaccines a global public good and has donated its vaccines to various developing countries.\n\nThere are many reasons to doubt the efficacy of the COVID-19 vaccines. Many vaccine skeptics are aware of several physicians and scientists cautioning against taking the vaccines.\n\nDr Gérard Delépine, an oncologist, orthopedic surgeon, and statistician at the Raymond Poincaré Hospital in Paris analyzed the pre- and post-vaccine trends for 14 countries and found overwhelming evidence that COVID-19 vaccines are correlated with new infections and mortality. In other words, the vaccines appear to be killing people who are getting vaccinated, sadly ironic since people became vaccinated so they wouldn’t suffer or die.\n\nThere are reports of vaccinations being associated with blood clots causing death, Bells palsy, central nervous system disorders, eye disorders, menstrual irregularities, etc. There are the Vaccine Adverse Event Reporting System (VAERS) reports of tens of thousands having died after receiving being vaccinated.\n\nSome people think the dangers of COVID-19 are overhyped. For example, when examining the data for winter-burden all-cause mortality prior to and since the appearance of COVID-19, there has been no significant difference in deaths from previous years.\n\nPeople are leery of the information surrounding vaccinations. Is there a cover up? For instance, reporting deaths or injury to VAERS after vaccination can get you fired. Corporate/state media have been criticized for censoring medical experts who question the vaccine safety, saying “the COVID jabs are causing the proliferation of toxic spike proteins throughout the vascular systems of injection recipients.”\n\nGiven all this, is it any wonder that some people are fearful of the COVID-19 vaccines? And the fear is not limited to the mRNA “vaccines” because vaccine trials are still ongoing, although emergency use authorization had sped up the roll out of vaccines. The vector vaccine Oxford-AstraZeneca usage was stopped in several countries, especially in Europe; in Canada the National Advisory Committee on Immunization recommended provinces stop using AstraZeneca. The vector vaccine Janssen/Johnson & Johnson also received emergency use authorization and it has had its problems. In particular, a pause in its use occurred to “investigate whether the vaccine triggers a rare but serious side effect — the development of diffuse blood clots, even though the few individuals who developed the condition had low platelet levels.”\n\nAre the Establishment’s vaccine experts speaking ex cathedra or are they presenting the scientific evidence to support their stance? Since many of us non-experts are barraged by contradictory information surrounding COVID-19, it is incumbent upon people to do their own research to ascertain the verisimilitude of the reports. Apply open-minded skepticism. Scrutinize the credentials and expertise of the person(s) reporting, but more so the factually accuracy of their pronouncements along with the morality and logic applied thereto. Are the reports in peer-review science journals or tabloid newspapers? More important than the source, however, is the actual information. Ask is the evidence solid, are the facts accurate, is the logic coherent, and are the conclusions proffered credible? And always ask cui bono? Should anyone be profiting exorbitantly from the ill health of other people?\n\nThe venerable professor Noam Chomsky spurns the pejorative use of the term anti. Chomsky promotes vaccination, but doesn’t call people resistant to vaccination anti-vaxxers. Nonetheless, he does depict them as people who are “willing to be a danger to the community.”\n\nAnother means of demeaning a group is to accuse them of being deniers.\n\nThere is a contingent of people who are skeptical that Earth is succumbing to global warming. They are disparaged as climate deniers rather than stating that they are climate skeptics. Some people have provided a serious scientific rationale for their skepticism; others are not so well versed in science but have listened to or read accounts of why people need not fret an imminent and catastrophic climate change. [1] \n\n\n\nAnd there is the hot-button issue of abortion. Both sides seek to describe themselves as pro-. On the one hand, those who support the woman’s right to choose whether or not to undergo a procedure to terminate the fetus will label themselves as pro-choice (they will steer clear of describing themselves as pro-abortion). The pro-choice people will argue that it is the woman’s body, and she has sovereignty over her body. On the other hand, those who are against terminating a fetus will label themselves as pro-life (they will not describe themselves as anti-abortion). They seek to protect a nascent life form.\n\nIf one applies the rationale of the pro-choice crowd, then they should support the right of vaccine skeptics to enjoy dominion over their body and, if the vaccine skeptics so choose, accept their unwillingness to being jabbed.\n\nThe vaccine skeptics, however, are in the minority it seems. This is unsurprising given the government, corporate media nexus that pushes for vaccination. Nonetheless, being in the minority is sometimes the best place to be. In the 1960s, the psychologist Stanley Milgram carried out a study into obedience. The subjects were assigned the role of a teacher. They were introduced to a confederate, the learner, who they met outfitted with attached electrodes. During the experiment, the learner would be on the other side of a partition, out of sight of the teacher. The teacher’s job was to give the learner an electric shock each time a mistake was made. The shocks were increased for each mistake, eventually reaching a zone marked danger and finishing in a 450-volt zone marked XXX. An experimenter in a lab coat would prod the teachers to continue administering shocks until the end of the test despite learner hesitancy to shock the obviously distressed learner who was heard moaning, and this prodding continued even after the learner failed to respond. Roughly two-thirds of teachers obeyed the experimenter right through 450 volts. Such is the nature of human obedience — at least, for two-thirds of humans. [2]\n\nToday, people are not only being encouraged to be vaccinated, but those that resist are being coerced. Nowadays, Milgram’s experiments would encounter difficulty receiving permission from a human research ethics committee; regardless, the audacious and draconian force the Establishment employs against the unvaccinated minority poses a grave ethical scenario.\n\nThe state actors say the science supports them, but the data they present is scarce. If the science is that strong, then there is no need to silence doctors, scientists, professors, and intellectuals who have reached different conclusions. Bring the two camps together and present the science, data, and evidence in an open and fair debate that allows people to reach an informed and fact-based conclusion. Otherwise, people who resist vaccination have a reasoned right to their skepticism, and are undeserving of ad hominem directed against them. An information war shouldn’t be mired by invective.", "opengraph": {"site_name": "The Greanville Post", "title": "Who is an Anti-vaxxer? | The Greanville Post", "description": "Governments in certain countries, with the support of Big Pharma and the media, are mandating that citizens must vaccinate or be denied the right to enjoy public amenities in society, such as restaurants, cinemas, night clubs, museums, sporting events, etc. Those who wish to travel may be barred by not having documentation of being fully vaccinated. Probably worst of all, people are being fired from their jobs for refusing vaccination. These people who are fearful of the vaccines, in particular the mRNA vaccine, are being denigrated by calling them anti-vaxxers.", "url": "https://www.greanvillepost.com/2021/10/10/who-is-an-anti-vaxxer/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-10-at-5.27.27-PM.png", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.who.int/news-room/q-a-detail/vaccines-and-immunization-what-is-vaccination", "https://www.clinicaltrialsarena.com/comment/us-leads-actively-recruiting-clinical-trials-for-covid-19/", "https://www.globalresearch.ca/covid-19-vaccines-lead-to-new-infections-and-mortality-the-evidence/5746393", "https://www.researchgate.net/publication/341832637_All-cause_mortality_during_COVID-19_No_plague_and_a_likely_signature_of_mass_homicide_by_government_response", "https://www.bitchute.com/video/jX9oL64Gpxiu/", "https://www.globalresearch.ca/prof-anthony-halls-message-to-cbc-on-censorship-of-top-experts-in-covid-19-research/5748508", "https://www.statnews.com/2021/02/02/comparing-the-covid-19-vaccines-developed-by-pfizer-moderna-and-johnson-johnson/", "https://www.statnews.com/2021/06/12/if-vaccine-apartheid-exists-vaccine-billionaires-shouldnt/", "https://dissidentvoice.org/2004/04/anti/", "https://www.youtube.com/watch?v=7RPt7hRfr8I", "mailto:kimohp@gmail", "https://twitter.com/kimohpetersen"], "authors": [], "publish_date": "October 10, 2021"}