{"result_id": "295027", "URL": "https://www.greanvillepost.com/2020/05/26/fw-engdahls-compelling-dossier-on-the-warp-speed-push-for-coronavirus-vaccines/", "timestamp": "2023-04-25 17:22:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2020/05/26/fw-engdahls-compelling-dossier-on-the-warp-speed-push-for-coronavirus-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "FW Engdahl’s compelling dossier on the “Warp Speed” Push for Coronavirus Vaccines", "cleaned_text": "Since January, 2020 our world has been literally transformed almost beyond recognition. For sake of a putative virus that WHO officials claim is extremely deadly and fast-spreading, the entire world with few exceptions has imposed total lockdown of the population, something never done in the history of public health epidemics. Basic civil liberties have gone, private giant social media such as Facebook or Google have become arbiters of what is medical truth in the pandemic, often with dubious basis. Here I share a compilation of a portion of my research into various alarming aspects of the coronavirus. If we are to come out of this crisis wiser we must be willing to encourage diverse opinion to understand what is going on. Please take time to also consider purchase of one or more of my books or a support via my PayPal on my website so that I ‘m able to continue to offer my work free and open to all. With internet censorship, my ability as an independent voice to reach a large audience is under threat as never before. The US White House has appointed a coronavirus “Vaccine Czar” from Big Pharma to oversee something dubbed Operation Warp Speed. The goal is to create and produce 300 million doses of a new vaccine to supposedly immunize the entire US population by year-end against COVID19. To be sure that Big Pharma companies give their all to the medical Manhattan Project, they have been fully indemnified by the US government against liabilities should vaccine recipients die or develop serious disease as a result of the rushed vaccine. The FDA and NIH have waived standard pre-testing on animals in the situation. The US military, according to recent remarks by the US President, is being trained to administer the yet-to-be unveiled vaccine in record time. Surely nothing could go wrong here? Warp speed is a term out of the sci-fi Star Trek media, defined as a speed faster than the speed of light. In recent weeks billions of dollars have been pledged from governments, from the Bill and Melinda Gates Foundation and others to fast-track a vaccine as well as test medical treatments to combat the VODIV19 illness said to originate from a novel coronavirus first discovered late 2019 in Wuhan China. This rush to create a “miracle” vaccine is ominous and suggests some hidden agenda. Washington’s Operation Warp Speed is reportedly the brainchild of Presidential Adviser and son-in-law Jared Kushner. It is being formally run by the Health and Human Services Secretary Alex Azar and Defense Secretary Mark Esper who will work with a new Vaccine Czar. The Vaccine Czar selected for Kushner’s Operation Warp Speed is former GlaxoSmithKline Chairman of its Vaccines Division, Moroccan-born US citizen, Dr. Moncef Slaoui. From 2006 through 2017 Slaoui was Chairman of Global R&D and Vaccines at GlaxoSmithKline and sat on the company's Executive team and Board of Directors. While at GSK Slaoui headed the development of Cervarix. Its Cervarix HPV cervical cancer vaccine was reported tied to multiple deaths or severe crippling effects in many recipients. A 2017 WHO monitoring report revealed that serious adverse effects from Moncef Slaoui’s HPV vaccine included complex regional pain syndrome (CRPS), postural orthostatic tachycardia syndrome (POTS) and chronic fatigue syndrome (CFS) that “exceeds any other vaccine.” [i]That is not reassuring in terms of the new Czar of a rushed coronavirus vaccine. In 2015 the Indian Supreme Court investigated charges that young Indian village girls died after being given Cervarix from Slaoui’s GSK. It was done in illegal vaccine “human guinea pig” tests of the HPV vaccine where neither the girls nor their parents were told what it was. The study was reportedly funded by the Bill and Melinda Gates Foundation. [ii] In 2012 while Slaoui headed GSK global R&D and vaccine development, and sat on the GSK board, the company was fined $3 billion by the US Department of Justice, the largest ever fine against a pharmaceutical company. Among the charges was that GlaxoSmithKline deliberately withheld alarming safety data for its major-selling diabetes drug, Advandia, from the US FDA. [iii] After Advandia quietly vanished from the product list of GSK. Slaoui also has ties to the projects of the Bill & Melinda Gates Foundation. He sat on the board of the Gates-funded International AIDS Vaccine Initiative. The IAVI was initiated in 1994 at a Rockefeller Foundation conference and is backed among others by the Gates Foundation, by the US Department of Defense and by Tony Fauci’s National Institute of Allergy and Infectious Diseases. [iv] At a May 15 White House press conference where the President introduced Slaoui as the head of the crash vaccine project, Slaoui stated, “Mr. President, I have very recently seen early data from a clinical trial with a coronavirus vaccine. These data make me feel even more confident that we will be able to deliver a few hundred million doses of vaccine by the end of 2020.” Though he did not say, he was clearly referring to Moderna and its mRNA gene-edited vaccine, the first US vaccine authorized to enter Phase I human trials after the US government gave the company a staggering $483 million of funding to fast-track the COVID19 vaccine. Vaccine Czar Slaoui is well-placed with regard to Moderna. After leaving GSK from 2017 until he joined the Trump Operation Warp Speed, Slaoui was on the Moderna Board of Directors. He also still holds $10 million worth of Moderna stock options, options likely to soar in value as the Warp Speed zooms forward. [v] This would suggest a glaring conflict of interest with Czar Slaoui, but that’s only the start of this saga, where millions of lives are potentially at threat from a novel inadequately-tested or proven genetically edited vaccine. At this point the leading US Government candidate for winning the “warp speed” race to roll out a Covid19 vaccine is Slaoui’s Moderna Inc. in Cambridge, Massachusetts. That’s surely a coincidence? Moderna claims that between January 11, when they got the DNA sequence of the virus from China, and January 13--in just two days--working together with Anthony Fauci’s National Institute of Allergies and Infectious Diseases (NIAID) of NIH, they managed to finalize the sequence for mRNA1273 vaccine against the novel coronavirus. At that point Fauci announced unprecedented plans to run human Phase I trials of the vaccine without prior animal studies. The FDA waived animal pretest requirements. The Moderna mRNA1273 tests were funded by the Gates Foundation-funded Coalition for Epidemic Preparedness Innovations (CEPI). [vi] The focus by Fauci on Moderna’s mRNA experimental Covid19 vaccine while Slaoui was heading its development at Moderna is impressive to say the least. The company states that on April 16, Moderna got an award from US government agency BARDA for $483 million to accelerate development of mRNA-1273. This award will fund the development of mRNA-1273 to FDA licensure and manufacturing process scale-up to enable large-scale production in 2020 for pandemic response. At that point the stock value of Slaoui’s Moderna stock options jumped 184%. Then, on May 1, Moderna and Lonza Group announced a worldwide strategic collaboration to manufacture mRNA-1273 at a planned 1 billion doses per year. [vii]This is no small deal. On May 6, Moderna filed a Current Report on Form 8-K with the SEC, which included an interview published by National Geographic with Anthony S. Fauci, Director of NIAID, which described his assessment of the results of testing related to the ongoing Phase 1 clinical study of mRNA-1273. [viii] It was quite positive. So, between January 13 and March 25, Slaoui and his team at Moderna were able to design the vaccine, and to produce it in such a way that it can be injected in humans, Slaoui told a Moroccan magazine, L’Economiste. While with Moderna, Slaoui was fully involved in the development of the mRNA covid19 vaccine. On May 7 just days before Slaoui became the Trump Vaccine Czar, the US Food and Drug Administration (FDA) approved the gene-edited messenger RNA (mRNA) vaccine, mRNA1273, to go into a Phase II human trial in the summer. On May 12, the FDA gave Fast Track Designation for Moderna’s mRNA Vaccine. Warp Speed, you know. The FDA with the backing of Tony Fauci’s NIAID in the NIH, granted unprecedented Phase I human trials of the never-before approved mRNA vaccine on April 27. They skipped normal animal, usually rat, testing, to go directly to human guinea pig tests. Moderna says Phase II trial will assess the safety, reactogenicity, and immunogenicity of two vaccinations of mRNA-1273 given 28 days apart. They will enroll 600 healthy adults for the experiment and supposedly follow their health for 12 months after the second vaccination. [ix] The plan is to begin human vaccinations by year end. All this, despite the evidence of extreme conflicts of interest between NIAID and other agencies of the US Government with Moderna and now-Vaccine Czar and former Moderna director Slaoui, might be treated more lightly, were it not for the fact that Moderna’s mRNA gene-edited vaccine technology is entirely experimental and never before approved for use as a vaccine. The company itself admits as much. It says, “mRNA is an emerging platform… we are still early in the story. Our most advanced vaccine program (CMV) is in Phase 2 clinical testing and we have no approved drugs to date.” [x] Moderna and others working with the experimental gene-edited mRNA vaccines claim they are safer than the admittedly unpredictable gene-edited DNA vaccines. DNA vaccine research is thirty years old but to date, has failed to produce a single licensed DNA vaccine. Moderna is only 11 years old and the CRISPR gene-editing technology it uses is barely 5 years old. We are told mRNA is completely different and safe. However, numerous scientists warn that once inside the cell nucleus, mRNA vaccines have a risk of permanently changing a person’s DNA in unpredictable ways. Tony Faudi’s own NIH published a scientific paper regarding the new mRNA vaccine prospects. It read in part, “innate immune sensing of mRNA has also been associated with the inhibition of antigen expression and may negatively affect the immune response. Although the paradoxical effects of innate immune sensing on different formats of mRNA vaccines are incompletely understood, some progress has been made in recent years in elucidating these phenomena.” This is highly experimental science. [xi] Another scientific paper funded by several Chinese universities and republished by the NIH in 2019, reviewing the development of the new messenger RNA technique for vaccines sounded some sober warnings. It noted that there were “Concerns with instability and low immunogenicity.” Further that, “mRNA vaccines are efficient at antigen expression, but sequence and secondary structures formed by mRNAs are recognized by a number of innate immune receptors, and this recognition can inhibit protein translation.” Not only that, but “…several of these delivery vehicles demonstrated toxicity in vivo, which may limit their use in humans.”(emphasis added). The authors concluded that “The immune response mechanism instigated by mRNA remains to be elucidated. The process of mRNA vaccine recognition by cellular sensors and the mechanism of sensor activation are still not clear.” [xii] The US government, in a tight-knit circle all tied to Tony Fauci’s NIAID, the Gates Foundation, WHO are moving with not warp, but rather warped human priorities to deliver us a vaccine that no one can assure is in any way safe. Were Moderna so certain it is safe, they should offer to be legally liable for any mRNA damage. They don’t, nor do any vaccine companies. We need to decide if the scale of the worldwide deaths, inflated or not, alleged to be of covid19, warrant such a human experiment that could alter our genetics in unpredictable and possibly toxic ways. The Models, the Tests and Now the Consequences Since late in January the world has undergone staggering changes which in many cases may be irreparable. We have given decisions over every aspect of our lives to the judgment of tests and to the projections of computer models for the coronavirus first claimed to have erupted in Wuhan China, now dubbed SARS-CoV-2. With astonishing lack of transparency or checking, one government after the other has imposed China-model lockdowns on their entire populations. It seems we are being led like sheep to slaughter for corrupted science. Two major models are being used in the West since the alleged spread of coronavirus to Europe and USA to “predict” and respond to the spread of COVID-19 illness. One was developed at Imperial College of London. The second was developed, with emphasis on USA effects, by the University of Washington’s Institute for Health Metrics and Evaluation (IHME) in Seattle, near the home of Microsoft founder Bill Gates. What few know is that both groups owe their existence to generous funding by a tax exempt foundation that stands to make literally billions on purported vaccines and other drugs to treat coronavirus—The Bill and Melinda Gates Foundation. In early March, Prof. Neil Ferguson, head of the MRC Centre for Global Infectious Disease Analysis at Imperial College London issued a widely-discussed model that forecast possible COVID-19 deaths in the UK as high as 500,000. Ferguson works closely with the WHO. That report was held responsible for a dramatic u-turn by the UK government from a traditional public health policy of isolating at risk patients while allowing society and the economy to function normally. Days after the UK went on lockdown, Ferguson’s institute sheepishly revised downwards his death estimates, several times and dramatically. His dire warnings have not come to pass and the UK economy, like most others around the world, has gone into deep crisis based on inflated estimates. Ferguson and his Imperial College modelers have a notorious track record for predicting dire consequences of diseases. In 2002 Ferguson predicted that up to 50,000 people in UK would die from variant Creutzfeldt-Jakob disease, \"mad cow disease\", possibly to 150,000 if the epidemic expanded to include sheep. A total of 178 people were officially registered dead from vCJD. In 2005, Ferguson claimed that up to 200 million (!) people worldwide would be killed by bird-flu or H5N1. By early 2006, the WHO had only linked 78 deaths to the virus. Then in 2009 Ferguson’s group at Imperial College advised the government that swine flu or H1N1 would probably kill 65,000 people in the UK. In the end, swine flu claimed the lives of 457 people. [xiii] Ferguson and his Imperial College group have a notoriously bad track record for predicting disease consequences. Yet the same Ferguson group at Imperial College, with WHO endorsement, was behind the panic numbers that triggered a UK government lockdown. Ferguson was also the source of the wild “prediction” that 2.2 million Americans would likely die if immediate lockdown of the US economy did not occur. Based on the Ferguson model, Dr Anthony Fauci of NIAID reportedly confronted President Trump and pressured him to declare a national health emergency. Much as in the UK, once the damage to the economy was begun, Ferguson’s model later drastically lowered the US fatality estimates to between 100,000 to 200,000 deaths. In both US and UK cases Neil Ferguson relied on data from the Chinese government, data which has been shown as unreliable. [xiv] Neil Ferguson and his modelling group at Imperial College, in addition to being backed by WHO, receive millions from the Bill & Melinda Gates Foundation. Ferguson heads the Vaccine Impact Modelling Consortium at Imperial College which lists as its funders the Bill & Melinda Gates Foundation and the Gates-backed GAVI-the vaccine alliance. [xv] From 2006 through 2018 the Gates Foundation has invested an impressive $184,872,226.99 into Ferguson’s Imperial College modeling operations. [xvi] Notably, the Gates foundation began pouring millions into Ferguson’s modelling operation well after his catastrophic lack of accuracy was known, leading some to suggest Ferguson is another “science for hire” operation. More recently, the forecast models being used to justify the unprecedented lockdown measures across the United States have been developed at the University of Washington Institute for Health Metrics and Evaluation (IHME) in Seattle. Its COVID-19 model forecasts deaths and the use of hospital resources such as hospital beds, ICU beds and ventilators. At the end of March the model from IHME also “predicted” up to 2.2 million American coronavirus deaths unless drastic lockdown measures were followed. By April 7 IHME models revised that down to up to 200,000 deaths. Their last down revision puts deaths at just over 60,000. The claim is that the down revisions are informed by actual data. Yet the wildly inaccurate projections were the ones used to impose catastrophic social and economic restrictions across the USA. Alex Berenson, a former New York Times reporter questioned the IMHE model: “Aside from New York, nationally there’s been no health system crisis. In fact, to be truly correct, there has been a health system crisis, but the crisis is that the hospitals are empty,” he said. “This is true in Florida where the lockdown was late, this is true in southern California where the lockdown was early, it’s true in Oklahoma where there is no statewide lockdown. There doesn’t seem to be any correlation between the lockdown and whether or not the epidemic has spread wide and fast.” IHME claims its revisions are result of the lockdown taking effect even though that would take weeks to show up. [xvii] Like Neil Ferguson at the Imperial College London, the University of Washington’s IHME is another project of the Gates Foundation. It was created in 2007 with a major grant from the Bill & Melinda Gates Foundation. In May 2015 IHME and the World Health Organization signed a major agreement to collaborate on data used to estimate world health trends. Then in 2017 IHME got an additional $279 million from the Gates Foundation to expand its work over the next decade. That, in addition to another a $210 million gift in 2016 from the Bill & Melinda Gates Foundation to fund construction of a new building to house several UW units working in population health, including IHME. In other words, IHME has been a crucial piece of the Gates global health strategy for more than 13 years. [xviii] They have been turning out highly inflated models for state-by-state emergency room demands . Those inflated projections, from New York to California and beyond have wreaked havoc on the entire health care system. When one IHME model predicted need for 430,000 intensive care beds across the US in March, states went into panic mode from New York to California to Pennsylvania and beyond. By the third week of April the reality was that hospital beds were empty and untold numbers of other operations had been canceled to make room for covid19 patients who never materialized. The wide variety of different tests that are supposed to tell whether one is infected with the SARS-CoV-2 virus have added a crucial element to the perfect dystopian storm that is raging globally. Simply put, the tests are not that reliable. A leading German laboratory reported in early April that, according to WHO recommendations, Covid19 virus tests are now considered positive, even if the specific target sequence of the Covid19 virus is negative and only the more general corona virus target sequence is positive. This can lead to other corona viruses such as cold viruses also triggering a false positive test result. [xix] That means you can have a simple cold and you are deemed coronavirus positive. Little wonder that the tally of coronavirus “infected” is exploding over the past weeks. But what does that number really mean? We simply don’t know. Yet our politicians are glibly shutting down entire economies and causing inconceivable social damage based on false model projections and WHO’s dodgy testing guidelines. In Germany the Robert Koch Institute (RKI), the government agency leading the COVID19 response, has deliberately refused to list the actual daily number of persons tested despite requests. Prof. Christopher Kuhbander, author of a detailed study states, “The reported figures on new infections very dramatically overestimate the true spread of the corona virus. The observed rapid increase in new infections is almost exclusively due to the fact that the number of tests has increased rapidly over time. So, at least according to the reported figures, there was in reality never an exponential spread of the coronavirus. The reported figures on new infections hide the fact that the number of new infections has been decreasing since about early or mid-March.” [xx] Yet the uncritical media presentation of endless statistics from the head of the RKI have fostered unprecedented anxiety and fear in the population of Germany. Californian physician Dr. Dan Erickson described his observations regarding Covid19 in a press briefing. He stated that hospitals and intensive care units in California and other states have remained largely empty so far. Dr. Erickson reports that doctors from several US states have been “pressured“ to issue death certificates mentioning Covid19, even though they themselves did not agree. In Pennsylvania the state was forced to remove some 200 “coronavirus” deaths after doctor autopsy revealed death from pre-existing causes such as heart or lung diseases. The more that actual facts are emerging around this pandemic and its consequences, it is becoming clear were are being told to commit economic and social suicide based on wrong methods and wrong information. Not only are the coronavirus models being used by WHO and the most national health agencies based on highly dubious methodologies, and not only are the tests being used of wildly different quality, that only indirectly confirm antibodies of a possible covid-19 illness. Now the actual designations of deaths related to coronavirus are being revealed to be equally problematic for a variety of reasons. It gives alarming food for thought as to the wisdom of deliberately putting most of the world’s people--and with it the world economy--into Gulag-style lockdown on the argument it is necessary to contain deaths and prevent overloading of hospital emergency services. When we take a closer look at the definitions used in various countries for “death related to Covid-19” we get a far different picture of what is claimed to be the deadliest plague to threaten mankind since the 1918 “Spanish Flu.” Right now the USA is said to be the nation with far the largest number of Covid-19 deaths, as of this writing, with media reporting some 68,000 “Covid-19” deaths. Here is where it gets very dodgy. The Government agency responsible for making the cause of death tally for the country, the CDC, is making huge changes in how they count so-called novel coronavirus deaths. As of May 5, the National Center for Health Statistics (NCHS) of the Centers for Disease Control and Prevention in Atlanta, the central agency recording cause of death nationwide, reported 39,910 Covid-19 deaths. A footnote defines this as “Deaths with confirmed or presumed COVID-19.” How a doctor makes the “presumed” judgment leaves huge latitude to the hospital and health professionals. Although the coronavirus tests are known to be subject to false results, CDC states that even where no tests have been made a doctor can “presume” covid-19. Useful to note for perspective is the number of USA deaths recorded from all causes in the same period of February 1 through May 2, that was 751,953. [xxi] Now it gets more murky. The CDC posted this notice: “As of April 14, 2020, CDC case counts and death counts include both confirmed and probable cases and deaths.” From that time the number of so-called Covid-19 deaths in USA has exploded in an alarming manner it would appear. On that day, April 14, New York City’s coronavirus death toll was revised with a major 3,700 fatalities added, with the provision that the count now included \"people who had never tested positive for the virus but were presumed to have it.\" [xxii] The CDC now defines confirmed as “confirmatory laboratory evidence for COVID-19,” which as we noted elsewhere included tests of dubious precision, but at least tests. Then they define “probable” as “with no confirmatory laboratory testing performed for COVID-19.” [xxiii] Just a guess of the doctor in charge. Now leaving aside the major discrepancy between the CDC headline covid-19 deaths as of May 5 of 68,279 and their detailed total of 39,910 deaths for the same period, we find another problem. Hospitals and doctors are being told to list Covid-19 as cause of death even if, say, a patient age 83 with pre-existing diabetes or cardiac issues or pneumonia dies with or without covid-19 tests. The CDC advises, “In cases where a definite diagnosis of COVID cannot be made but is suspected or likely (e.g. the circumstances are compelling with a reasonable degree of certainty) it is acceptable to report COVID-19 on a death certificate as 'probable' or 'presumed.'” This opens the door ridiculously wide for abuse of coronavirus death numbers in the United States. A provision in the March 2020 Coronavirus Aid, Relief, and Economic Security Act, known as the CARES Act, gives a major incentive for hospitals in the US, most all of them private for-profit concerns, to deem newly-admitted patients as “presumed Covid-19.” By this simple method the hospital then qualifies for a substantially larger payment from the government Medicare insurance, the national insurance for those over 65. The word “presumed” is not scientific, not at all precise but very tempting for hospitals concerned about their income in this crisis. Dr Summer McGhee, Dean of the School of Health Sciences at the University of New Haven, notes that, “The CARES Act authorized a temporary 20 percent increase in reimbursements from Medicare for COVID-19 patients…” He added that, as a result, “hospitals that get a lot of COVID-19 patients also get extra money from the government.\" [xxiv] Then, according to a Minnesota medical doctor, Scott Jensen, also a State Senator, if that Covid-19 designated patient is put on a ventilator, even if only presumed to have covid-19, the hospital can get reimbursed three times the sum from the Medicare. Dr Jensen told a national TV interviewer, “Right now Medicare is determining that if you have a COVID-19 admission to the hospital you get $13,000. If that COVID-19 patient goes on a ventilator you get $39,000, three times as much.” [xxv] Little wonder that states such as Massachusetts suddenly began backdating cause of death totals back to March 30, significantly inflating covid death numbers, or that New York Governor Andrew Cuomo began demanding 30,000 ventilators and emergency equipment around the same early April time, equipment that was not needed. [xxvi] In short, the covid19 death statistics in the USA are highly dubious for a variety of reasons, not least huge financial incentives to hospital administrators who had been told to cancel all other operations to make extra room for a predicted flood of coronavirus ill. That rising death toll said to be “covid19 or presumed” impacts the decisions to lock down the economy and in effect create an economic pandemic of unparalleled dimension. Not only are USA covid19 death numbers open to serious question. If we look closely most major countries have equally dubious data. Until recently one of the highest Covid-19 death rates in the EU was Italy where outbreaks have been concentrated in the Lombardy and adjacent regions of the industrial north. Here again the definition of cause of death has been fuzzy. A report in the Journal of the American Medical Association by a group of Italian doctors who analyzed the alarming high covid-19 figures pointed out that when state medical authorities made detailed case examination of a sample of 355 covid-19 “presumed” deaths, they found that the mean age was 79.5 years. “In this sample, 117 patients (30%) had ischemic heart disease, 126 (35.5%) had diabetes, 72 (20.3%) had active cancer, 87 (24.5%) had atrial fibrillation, 24 (6.8%) had dementia, and 34 (9.6%) had a history of stroke. The mean number of preexisting diseases was 2.7. Overall, only 3 patients (0.8%) had no diseases.” [xxvii] That means that of the sample 99.2% had other serious illnesses. In Italy, the persons who tested positive for Covid-19, regardless of preexisting serious illness, were listed as Covid19 fatalities. Italy has the EU’S oldest population on average and the worst air pollution in the EU, especially in the Lombardy region. From the first case in early February until 6 May Italy has declared 29,315 covid-19 deaths. This is more than the total of deaths in 2017 attributed to influenza and/or pneumonia which was reported 25,000. The reason for the apparent spike should be seriously investigated, but reports of panic among hospital workers over the shutdown declaration by the Conte government, with thousands reportedly fleeing Italy for their home countries in Poland or elsewhere, might have also played a role. On March 31 a report from northern Italy stated, “In recent weeks, most of the Eastern European nurses who worked 24 hours a day, 7 days a week supporting people in need of care in Italy have left the country in a hurry. This is not least because of the panic-mongering and the curfews and border closures threatened by the ‘emergency governments.’“ [xxviii] In many countries the picture is one of a predominately mild influenza-like infection with comparable death rates. The lack of uniformly agreed tests and the inaccuracies of many tests used, as well as the extremely doubtful criteria for declaring a cause of death as being “from”covid-19 suggest that it is well past time to reexamine the unprecedented lockdown measures, social distancing, possible mandatory vaccines of unproven effect, all of which are creating what is becoming the worst economic depression since the 1930’s. Arguably, no one has been more active in promoting and funding research on vaccines aimed at dealing with coronavirus than Bill Gates and the Bill and Melinda Gates Foundation. From sponsoring a simulation of a coronavirus global pandemic, just weeks before the Wuhan outbreak was announced, to funding numerous corporate efforts to come up with a novel vaccine for the apparently novel virus, the Gates presence is there. What does it actually entail? We must admit that at the very least Bill Gates is prophetic. He has claimed for years that a global killer pandemic will come and that we are not prepared for it. On March 18, 2015 Gates gave a TED talk on epidemics in Vancouver. That day he wrote on his blog, “I just gave a brief talk on a subject that I’ve been learning a lot about lately—epidemics. The Ebola outbreak in West Africa is a tragedy—as I write this, more than 10,000 people have died.” Gates then added, “As awful as this epidemic has been, the next one could be much worse. The world is simply not prepared to deal with a disease—an especially virulent flu, for example—that infects large numbers of people very quickly. Of all the things that could kill 10 million people or more, by far the most likely is an epidemic.” [xxix] That same year, 2015, Bill Gates wrote an article for the New England Journal of Medicine titled, “The Next Epidemic: Lessons from Ebola.” There he spoke of a special class of drugs that “involves giving patients a set of particular RNA-based constructs that enables them to produce specific proteins(including antibodies).Although this is a very new area, it is promising because it is possible that a safe therapy could be designed and put into large-scale manufacture fairly rapidly. More basic research as well as the progress of companies like Moderna and CureVac could eventually make this approach a key tool for stopping epidemics.”[xxx] Moderna and CureVac both today receive funds from the Gates Foundation and are leading the race to develop an approved COVID-19 vaccine based on mRNA. A global flu-like pandemic in fact is something that Gates and his well-endowed foundation have spent years preparing for. In 2017 during the Davos World Economic Forum, Gates initiated something called CEPI, the Coalition for Epidemic Preparedness Innovations, together with the governments of Norway, India, Japan, and Germany, along with the Wellcome Trust of the UK. Its stated purpose is to “accelerate the development of vaccines we’ll need to contain outbreaks” of future epidemics.[xxxi] He noted at the time that “One promising area of vaccine development research is using advances in genomics to map the DNA and RNA of pathogens and make vaccines.” We will return to that. By 2019 Bill Gates and the foundation were going full-tilt boogie with their pandemic scenarios. He made a Netflix video which made an eerie imaginary scenario. The video, part of the “Explained” series, imagined a wet market in China where live and dead animals are stacked and a highly deadly virus erupts that spreads globally. Gates appears as an expert in the video to warn, “If you think of anything that could come along that would kill millions of people, a pandemic is our greatest risk.” He said if nothing was done to better prepare for pandemics, the time would come when the world would look back and wish it had invested more into potential vaccines. That was weeks before the world heard about bats and a live wet market in Wuhan China. [xxxii] In October, 2019 the Gates Foundation teamed up with the World Economic Forum and the Johns Hopkins Center for Health Security to enact what they called a “fictional” scenario simulation involving some of the world’s leading figures in public health. It was titled Event 201. As their website describes it, Event 201 simulated an “outbreak of a novel zoonotic coronavirus transmitted from bats to pigs to people that eventually becomes efficiently transmissible from person to person, leading to a severe pandemic. The pathogen and the disease it causes are modeled largely on SARS, but it is more transmissible in the community setting by people with mild symptoms.” [xxxiii] In the Event 201 scenario the disease originates at a pig farm in Brazil, spreading through low-income regions and ultimately explodes into an epidemic. The disease is carried by air travel to Portugal, the USA and China and beyond to the point no country can control it. The scenario posits no possible vaccine being available in the first year. “Since the whole human population is susceptible, during the initial months of the pandemic, the cumulative number of cases increases exponentially, doubling every week.” [xxxiv] The scenario then ends after 18 months when the fictional coronavirus has caused 65 million deaths. “The pandemic is beginning to slow due to the decreasing number of susceptible people. The pandemic will continue at some rate until there is an effective vaccine or until 80-90 % of the global population has been exposed.” [xxxv] As interesting as the prescient Gates-Johns Hopkins Event 201 fictional scenario of October, 2019 may be, the list of panelists who were invited to participate in the imaginary global response is equally interesting. Among the selected “players” as they were called, was George Fu Gao. Notably, Prof. Gao is director of the Chinese Center for Disease Control and Prevention since 2017. His specialization includes research on “influenza virus interspecies transmission (host jump)... He is also interested in virus ecology, especially the relationship between influenza virus and migratory birds or live poultry markets and the bat-derived virus ecology and molecular biology.” [xxxvi] Bat-derived virus ecology… Prof. Gao was joined among others at the panel by the former Deputy Director of the CIA during the Obama term, Avril Haines. She also served as Obama’s Assistant to the President and Principal Deputy National Security Advisor. Another of the players at the Gates event was Rear Admiral Stephen C. Redd, Director of the Office of Public Health Preparedness and Response at the Centers for Disease Control and Prevention (CDC). The same CDC is at the center of a huge scandal for not having adequate functioning tests available for testing cases of COVID-19 in the USA. Their preparedness was anything but laudable. [xxxvii] Rounding out the group was Adrian Thomas, the Vice President of scandal-ridden Johnson & Johnson, the giant medical and pharmaceutical company. Thomas is responsible for pandemic preparedness at J&J including developing vaccines for Ebola, Dengue Fever, HIV. And there was Martin Knuchel, Head of Crisis, Emergency & Business Continuity Management, for Lufthansa Group Airlines. Lufthansa has been one of the major airlines dramatically cutting flights during the COVID-19 pandemic crisis. [xxxviii] All this shows that Bill Gates has had a remarkable preoccupation with the possibility of a global pandemic outbreak he said could be even larger than the alleged deaths from the mysterious 1918 Spanish Flu, and has been warning for at least the past five years or more. What the Bill & Melinda Gates Foundation also has been involved in is funding development of new vaccines using bleeding-edge CRISPR gene-editing and other technologies. Gates Foundation money is backing vaccine development on every front. Inovio Pharmaceuticals of Pennsylvania received $9 million from the Gates-backed CEPI, Coalition for Epidemic Preparedness Innovations, to develop a vaccine, INO-4800, which is about to test on humans in April, a suspiciously rapid time frame. In addition Gates Foundation just gave the company an added $5 million to develop a proprietary smart device for intradermal delivery of the new vaccine. [xxxix] In addition Gates Foundation monies via CEPI are financing development of a radical new vaccine method known as messengerRNA or mRNA. They are co-funding the Cambridge, Massachusetts biotech company, Moderna Inc., to develop a vaccine against the Wuhan novel coronavirus, now called SARS-CoV-2. Moderna’s other partner is the US National Institute of Allergy and Infectious Diseases (NIAID), a part of the National Institutes of Health (NIH). Head of NIAID is Dr Anthony Fauci, the person at the center of the Trump Administration virus emergency response. Notable about the Fauci-Gates Moderna coronavirus vaccine, mRNA-1273, is that it has been rolled out in a matter of weeks, not years, and on February 24 went directly to Fauci’s NIH for tests on human guinea pigs, not on mice as normal. Moderna’s chief medical adviser, Tal Zaks, argued, “I don’t think proving this in an animal model is on the critical path to getting this to a clinical trial.” [xl] Another notable admission by Moderna on its website is the legal disclaimer, “Special Note Regarding Forward-Looking Statements: …These risks, uncertainties, and other factors include, among others: … the fact that there has never been a commercial product utilizing mRNA technology approved for use.” [xli] In other words, completely unproven for human health and safety. Another biotech company working with unproven mRNA technology to develop a vaccine for the COVID-19 is a German company, CureVac. Since 2015 CureVac has received money from the Gates Foundation to develop its own mRNA technology. [xlii] In January the Gates-backed CEPI granted more than $8 million to develop a mRNA vaccine for the novel coronavirus. [xliii] Add to this the fact that the Gates Foundation and related entities such as CEPI constitute the largest funders of the public-private entity known as WHO, and that its current director, Tedros Adhanom, the first WHO director in history not a medical doctor, worked for years on HIV with the Gates Foundation when Tedros was a government minister in Ethiopia, and we see that there is practically no area of the current coronavirus pandemic where the footprints of the omnipresent Gates are not to be found. If that is to the good of mankind or grounds to be worried, time will tell. Why We Cannot Trust the WHO The most influential organization in the world with nominal responsibility for global health and epidemic issues is the United Nations’ World Health Organization, WHO, based in Geneva. What few know is the actual mechanisms of its political control, the shocking conflicts of interest, corruption and lack of transparency that permeate the agency that is supposed to be the impartial guide for getting through the current COVID-19 pandemic. The following is only part of what has come to public light. On January 30 Tedros Adhanom, Director-General of the UN World Health Organization declared a Public Health Emergency of International Concern or PHIEC. This came two days after Tedros met with China President Xi Jinping in Beijing to discuss the dramatic rise in severe cases of a novel coronavirus in Wuhan and surrounding areas that had reached dramatic proportions. Announcing his emergency PHIEC declaration, Tedros praised the Chinese quarantine measures, measures highly controversial in public health and never before in modern times attempted with entire cities, let alone countries. At the same time Tedros, curiously, criticized other countries who were moving to block flights to China to contain the strange new disease, leading to charges he was unduly defending China. [xliv] The first three cases in Wuhan were reported, officially, on December 27, 2019, a full month earlier. The cases were all diagnosed with pneumonia from a “novel” or new form of SARS Coronavirus. Important to note is that the largest movement of people in the year, China’s Lunar New Year and Spring Festival, during which some 400 million citizens move throughout the land to join families went from January 17 through February 8. On January 23, at 2am two days before start of actual New Year festivities, Wuhan authorities declared an unprecedented lockdown of the entire city of 11 million as of 10am that day. By then, hundreds of thousands if not several million residents had fled in panic to avoid the quarantine. By the time the WHO declared its Public Health Emergency of International Concern on 30 January, precious weeks had been lost to contain the disease. Yet Tedros effusively praised the “unprecedented” Chinese measures and criticized other countries for placing “stigma” on Chinese by cutting travel. In reference to the Wuhan COVID-19 spread and why WHO did not call it a pandemic, the WHO spokesman, Tarik Jasarevic, stated “There is no official category (for a pandemic)…WHO does not use the old system of 6 phases — that ranged from phase 1 (no reports of animal influenza causing human infections) to phase 6 (a pandemic) — that some people may be familiar with from H1N1 in 2009.” [xlv] Then, in an about-face, on March 11, Tedros Adhanom announced for the first time that WHO was calling the novel coronavirus illness, now renamed COVID-19, a “global pandemic.” At that point WHO said there were more than 118,000 cases of COVID-19 in 114 countries, with 4,291 deaths. [xlvi] Since an earlier WHO fiasco and scandal in 2009 over its declaration of a global pandemic around the “swine flu” or H1N1 as it was termed, the WHO decided to drop using the term pandemic. The reason is indicative of the corruption endemic to the WHO institution. Just weeks before first reports in 2009 of a young Mexican child being infected with a novel H1N1 “swine flu” virus in Veracruz, the WHO had quietly changed the traditional definition of pandemic. No longer was it necessary a reported disease be extremely widespread in many countries and extremely deadly or debilitating. It need only be widespread, like seasonal flu, should WHO “experts” want to declare pandemic. WHO H1N1 symptoms were the same as a bad cold. When then-WHO Director-General Dr Margaret Chan officially declared a Phase 6 global Pandemic emergency, that triggered national emergency programs including billions of dollars of government purchases of alleged H1N1 vaccines. At the end of the 2009 flu season it turned out the deaths due to H1N1 were tiny relative to the normal seasonal flu. Dr Wolfgang Wodarg, a German physician specialising in Pulmonology, was then chairman of the Parliamentary Assembly of the Council of Europe. In 2009 he called for an inquiry into alleged conflicts of interest surrounding the EU response to the Swine Flu pandemic. The Netherlands Parliament as well discovered that Professor Albert Osterhaus of the Erasmus University in Rotterdam, the person at the center of the worldwide Swine Flu H1N1 Influenza A 2009 pandemic as the key advisor to WHO on influenza, was intimately positioned to personally profit from the billions of euros in vaccines allegedly aimed at H1N1. [xlvii] Many of the other WHO scientific experts who advised Dr Chan to declare pandemic were receiving money directly or indirectly from Big Pharma including GlaxoSmithKline, Novartis and other major vaccine-makers. [xlviii] The WHO Swine Flu Pandemic declaration was a fake. 2009-10 saw the mildest influenza worldwide since medicine began tracking it. The pharma giants took in billions in the process. It was after the 2009 pandemic scandal that the WHO stopped using the 6 phase pandemic declaration and went to the totally vague and confusing “Public Health Emergency of International Concern.” But now, Tedros and WHO arbitrarily decided to reintroduce the term pandemic, admitting though that they are still in the midst of creating yet a new definition of the term. “Pandemic” triggers more fear than “Public Health Emergency of International Concern.” Despite the huge 2009-10 conflict-of-interest scandals linking Big Pharma to WHO, today the WHO under Tedros has done little to clean out corruption and conflicts of interest. The current WHO Scientific Advisory Group of Experts (SAGE) is riddled with members who receive “financially significant” funds from either major vaccine makers, or the Bill and Melinda Gates Foundation (BGMF) or Wellcome Trust. In the latest posting by WHO of the 15 scientific members of SAGE, no fewer than 8 had declared interest, by law, of potential conflicts. In almost every case the significant financial funder of these 8 SAGE members included the Bill and Melinda Gates Foundation, Merck & Co. (MSD), Gavi, the Vaccine Alliance (a Gates-funded vaccine group), BMGF Global Health Scientific Advisory Committee, Pfizer, Novovax, GSK, Novartis, Gilead, and other leading pharma vaccine players. [xlix] So much for independent scientific objectivity at WHO. The fact that many of the members of WHO’s SAGE have financial ties to the Gates Foundation is highly revealing, even if not surprising. Today the WHO is primarily financed not by UN member governments, but by what is called a “public-private partnership” in which private vaccine companies and the group of Bill Gates-sponsored entities dominate. In the latest available financial report of WHO, for December 31, 2017, slightly more than half of the $2+ billion General Fund Budget of WHO was from private donors or external agencies such as World Bank or EU. Far the largest private or non-government funders of WHO are the Bill and Melinda Gates Foundation together with Gates-funded GAVI Vaccine Alliance, the Gates-initiated Global Fund to Fight AIDS, Tuberculosis and Malaria (GFATM). Those three provided more than $474 million to WHO. The Bill and Melinda Gates Foundation alone gave a whopping $324,654,317 to WHO. By comparison, the largest state donor to WHO, the US Government, gave $401 million to WHO. [l] Among other private donors we find the world’s leading vaccine and drug makers including Gilead Science (currently pressing to have its drug as treatment for COVID-19), GlaxoSmithKline, Hoffmann-LaRoche, Sanofi Pasteur, Merck Sharp and Dohme Chibret and Bayer AG.[li] The drug makers gave tens of millions of dollars to WHO in 2017. This private pro-vaccine industry support for the WHO agenda from the Gates Foundation and Big Pharma is more than a simple conflict of interest. It is a de facto high-jacking of the UN agency responsible for coordinating worldwide responses to epidemics and disease. Further, the Gates Foundation, the world’s largest at some $50 billion, invests its tax-exempt dollars in those same vaccine makers including Merck, Novartis, Pfizer, GlaxoSmithKline. [lii] Against this background it should come as no surprise that Ethiopian politician, Tedros Adhanom, became head of WHO in 2017. Tedros is the first WHO director not a medical doctor despite his insistence on using Dr. as title. His is a doctor of philosophy in community health for “research investigating the effects of dams on the transmission of malaria in the Tigray region of Ethiopia.” [liii] Tedros, who was also Ethiopia Minister of Foreign Affairs until 2016, met Bill Gates when he was Ethiopian Health Minister and became Board Chair of the Gates-linked Global Fund Against HIV/AIDS, TB and Malaria. Under Tedros, the notorious corruption and conflicts of interest at WHO have continued, even grown. According to a recent report by the Australian Broadcasting Corporation, in 2018 and 2019 under Tedros, the WHO Health Emergencies Program, the section responsible for the COVID-19 global response, was cited with the highest risk rating noting the \"failure to adequately finance the program and emergency operations [risks] inadequate delivery of results at country level.\" The ABC report further found that there has also been a “surge in internal corruption allegations across the whole of the organisation, with the detection of multiple schemes aimed at defrauding large sums of money from the international body.” [liv]Not very reassuring. In early March Oxford University stopped using WHO data on COVID-19 because of repeated errors and inconsistencies the WHO refused to correct.[lv] The WHO test protocols for coronavirus tests have repeatedly been cited by various countries including Finland for flaws and false positives and other defects. This is the WHO which we now trust to guide us through the worst health crisis of the past century. Dramatic political and social decisions are being made across the United States and around the world on what emergency quarantine measures and other steps must be taken. In many cases the radical and severe measures, such as shutting down the world economy, are being justified by COVID-19 case projections of morbidity into the future. If there is one person who is the face of the current strategy of dealing with the coronavirus in Washington it is the Director of the US National Institute for Allergy and Infectious Diseases (NIAID) of the NIH, Dr. Tony Fauci. What major media conveniently leave out in discussing Fauci’s role is his highly controversial and conflicted history since he first joined NIAID in 1984 during the beginnings of the AIDS panic. His role then sheds valuable light on his remarkable and highly controversial actions today. Tony Fauci, a leading member of the White House Coronavirus Task Force, is being promoted by major US media such as CNN, MSNBC or the New York Times as the great expert on all related to the Covid19 outbreak. He had dismissed the President’s efforts to promote a known malaria medication as treatment for severe corona patients as “anecdotal,” even though seven years before he backed the same drug. He has publicly taken projections from an institute created in Washington State by the Gates Foundation, the same foundation that virtually owns the WHO and owns major stakes in the leading vaccine makers, to claim that up to 200,000 Americans could die from COVID19. Fauci stated that COVID19 is “probably about 10 times more lethal than the seasonal flu,” which would mean 300-600,000 coronavirus deaths this year, at the same time in a respected medical journal he compared Covid-19 as similar to seasonal flu in morbidity. When questioned how long the shutdown of much of the US economy must last, Fauci replied only when there is zero new covid19 positive tested cases, something impossible given the defective testing.[lvi] He has also backed direct human tests of novel vaccines with no prior animal tests, including with radical non-tested mRNA gene-edited vaccines. Fauci has more influence over US national policy on the unprecedented Covid-19 pandemic than anyone, including the President. Much of media treats him with awe as an unimpeachable scientist, one of the world’s finest. A closer look at Anthony Fauci’s career gives a starkly different picture, a very alarming one in fact. Tony Fauci has held the top post at the NIAID in Washington for an astonishing 36 years. Today he is well past retirement age at 79, and holds the funds to determine which drug companies or university researchers will get precious government funds or not from NIAID’s annual $5 billion budget. Let’s go back to 1984 when Fauci was named head of NIAID during the Reagan era. That year an AIDS researcher, Robert Gallo, working under Fauci, held a press conference to announce that he had “discovered” the AIDS virus. He said it was HIV-- human immunodeficiency virus. The shocking announcement which went around the world, was in complete disregard of scientific procedures of prior peer-reviewed published scientific evidence, including the required electron microscope analyses. It was a case of “science by press conference” as a critical scientist, Prof. Peter H. Duesberg described it. Duesberg was an award-winning researcher at Berkeley who isolated the first cancer gene through his work on retroviruses in 1970, and mapped the genetic structure of these viruses. [lvii] For Gallo and Fauci, that was unimportant as millions in research funds flowed into NIAID to research the new virus, HIV. Fauci and Gallo claimed that AIDS was highly contagious, also by sexual transmission, especially among homosexual men. Notably, before the Gallo claim to have found the HIV AIDS virus, NIAID had been doing research on the role of drugs, poppers or nitrites, proven immune-suppressants, in the deaths of the earliest AIDS patients. That was quickly dropped in favor of researching a “cure” for AIDS. Media was told that AIDS was the “public health threat of the Century.” Gallo went on to make millions on his patented blood test for HIV, despite the fact that the test was often giving false positives and did not test directly for the alleged virus but for active antibodies, something immunology practice said was not valid, as antibodies merely suggested a past infection response and not necessarily presence of AHIV. At this time in the 1980’S Fauci was responsible for AIDS research at NIAID, a post he still holds. The issue of HIV/AIDS tests is central. While a frightened world was clamoring for a test, Gallo and Fauci promoted their deeply flawed tests of antibodies. In 2006 Gallo claimed, “HIV tests were highly accurate from the time they were developed in 1984 and have become much more accurate over time…” Highly accurate in 1984 but more accurate than highly over time? Gallo added in response to criticism, “A PCR test for the presence of the virus itself can accurately determine a child’s HIV status.” In a sharp rebuttal of the Gallo claims, claims endorsed by Fauci and the NIAID as well as CDC, Roberto A. Giraldo, MD and Etienne de Harven, MD, the scientist who produced the first electron micrograph of a retrovirus, pointed out that both the ELISA and Western blot, and a genetic test, the PCR or ‘Viral Load’ test,” the two major tests used to determine if one has AIDS, are invalid. “None of these tests detect the HIV virus itself, nor do they detect HIV particles.” They add that there are “more than 70 different documented conditions that can cause the antibody tests to react positive without an HIV infection.” Among the false positive cases are influenza, the common cold, leprosy or the existence of pregnancy. [lviii] The same tests are used today to determine SARS-CoV-2-positive. They concluded, “The fact that after 25 years of intense research HIV has been neither isolated nor purified in terms of classical virology indicates to us that the infectious view of AIDS as a contagious viral disease is based on an apparently non-existent microbe!”[lix] Giraldo and de Harven declared, “The alleged existence of HIV was asserted from the study of proteins, reverse transcriptase activity (RT), and RNA fragments that were found in culture supernatants, not from the direct analysis of purified viral particles.” [lx] The CDC requires a positive antibody test for HIV to determine AIDS in the USA. Yet in Africa since 1985 the WHO requires no HIV test or any other laboratory test. Merely the patient’s symptoms that can include weight loss, chronic diarrhea, prolonged fever, persistent cough and such, symptoms endemic to chronic poverty, malnutrition and lack of sanitation. Yet this fraud has shaped the career of Tony Fauci for more than 35 years. Fauci as head of NIAID has taken millions from the Bill & Melinda Gates Foundation as well as the Clinton Foundation along with tens of billions from US taxpayers for this bogus research. Suspiciously, the 2006 article by Giraldo and de Harven was suddenly retracted by the journal in 2019 just before the coronavirus Wuhan outbreak. Despite the fact that he knew the established rules of virology, Fauci, as head of NIAID, recommended the Burroughs Wellcome chemotherapy drug, AZT as a “preventive drug” for HIV diagnosed patients even without symptoms! Burroughs Wellcome gave NIAID the study that was deliberately biased for AZT. Fauci even backed AZT for pregnant women despite the grave risk to the fetus. One mark of pregnancy in all women is a higher level of antigens as the natural immune system fights any infection to protect the fetus. AZT or Retrovir, a failed leukemia drug, has been proven to be a highly toxic drug. [lxi] It was approved for AIDS testing in a record 5 days by Fauci and the US Government in 1987. Today despite more than thirty years funded research and billions of dollars, no effective vaccine for HIV/AIDS exists. According to people who have studied the role of Tony Fauci as head of NIAID, his focus has been what is called scientific reductivism, described as “a 19 Century-style, single-germ theory for a complex web of factors that collapsed the immune systems of a subset of gay men in the early 1980s.” He has refused to explore the documentation that a variety of lethal drugs and other toxins such as nitrites could play a role. As a result he has wasted tens of billions of taxpayer dollars since 1984 on dead end experiments. One of his most nefarious was his collaboration with Gilead Sciences. Not satisfied with having developed a false positive test for AIDS and having gained FDA fast-track approval for AZT to treat HIV-positive patients with serious illness symptoms, Fauci decided to collaborate with Gilead (as in the Biblical “balm of Gilead”) on what came to be called PrEP experiments. Fauci in 2007 began to finance clinical trials of the AZT drugs in HIV “negatives,” on the theory the chemotherapy would “protect” them from becoming “positive.” That is, testing toxic HIV drugs on otherwise healthy persons to “insure” they never got AIDS. If it sounds mad, it was. Gilead supplied the drug, Truvada, to NIAID between 2007-2012 for Phase III human tests on HIV negative subjects. Four tests of at least 2,000 and up to 5,000 test subjects each, were done. The project was called “pre-exposure prophylaxis” or “PrEP.” Healthy subjects were given doses of chemotherapy drug Truvada on the thesis it could prevent them from one day getting HIV-positive. CDC, in its May 2014 recommendation urged physicians to prescribe Truvada for negatives in the so-called “risk groups,” an official government imprimatur for an extremely profitable drug. [lxii] The FDA ignored two of the four Truvada tests that had failed and been halted. Despite that and owing to data manipulation by Fauci’s NIAID and Gilead, the FDA approved the dangerous Truvada for PrEP. Today Gilead lists the side effects of Truvada: Kidney problems, including kidney failure; worsening Hepatitis B; too much lactic acid in your blood (lactic acidosis), which can lead to death; severe liver problems, which can lead to death; bone problems. They state that Truvada “can help reduce the risk of getting HIV-1 through sex, when taken every day and used together with safer sex practices.” [lxiii] The Fauci-Gilead scam of promoting Truvada for healthy people to “reduce risk” of HIV is a marker for the level of medical malpractice and in some cases evident criminal abuse of human health that the current White House coronavirus guru, A. Fauci, represents. In October, 2019 Fauci and his NIAID got $100 million from the Gates Foundation to develop “gene-based” therapies for HIV and sickle cell disease. That means Fauci still to the time of the first claims of novel coronavirus in Wuhan China, Fauci was still promoting a 35-year fraud around HIV. [lxiv] Fauci is also part of the Gates Foundation cabal. In 2012 Fauci was named one of the five Leadership Council of the Gates Foundation-created Global Vaccine Action Plan. [lxv] This is highly relevant to his role today as the Trump Administration coronavirus “pope.” Has his NIAID or any other laboratory in the world rigorously, with electron microscopy, isolated and purified samples of patients tested SARS-CoV-2 positive for Covid-19? Or are the virus proofs as faulty as Fauci and the AIDS clique have made for HIV? In addition NIAID is working with Gilead to conduct Phase II human trials on Gilead’s drug, remdesivir, as a potential treatment for hospitalized adult patients diagnosed with COVID-19. Relevant also is the fact that all top scientific advisers to the US President’s Task Force on COVID-19 are tied since decades to the bogus and destructive HIV/AIDS research and propagation of false theories. Alongside Tony Fauci of NIAID stands Deborah L. Birx, M.D., Obama appointee as U.S. Global AIDS Coordinator who worked under Tony Fauci at NIAID from 1983-1986.[lxvi] Robert Redfield is the current Director of the Centers for Disease Control and Prevention, center of the recent coronavirus testing scandal. Redfield cofounded with the discredited Robert Gallo, former Fauci colleague in the AIDS scandals of the early 1980’s at NIH, the Institute of Human Virology based at University of Maryland. Redfield and Birx also coauthored numerous scientific articles on purported HIV vaccines, none of which have been effective. Fauci, Birx and Redfield, all incestuously complicit in the HIV/AIDS frauds and malpractice, today hold the future of not only American public health, but also of the entire world economy in their hands. Not a good situation. As their work on the proved HIV=IDS fraud shows, the coronavirus tests do not at all prove presence of a deadly virus in any patient. If this is so, it is perhaps the greatest criminal fraud in medical history. [i] HPV vaccine, the most dangerous vaccine yet, 18 January 2017, https://www.anhinternational.org/2017/01/18/official-hpv-vaccine-vaccine-dangerous-yet/ [ii] Gethin Chamberlain, Judges demand answers after children die in controversial cancer vaccine trial in India, Mail Online, 13 January, 2015, https://www.dailymail.co.uk/news/article-2908963/Judges-demand-answers-children-die-controversial-cancer-vaccine-trial-India.html [iii] GlaxoSmithKline to pay $3 billion fine after pleading guilty to healthcare fraud-- the biggest in U.S. history, 2 July 2012, https://www.dailymail.co.uk/news/article-2167742/GlaxoSmithKline-pay-3b-fine-pleading-guilty-healthcare-fraud.html [v]Kieran Corcoran, The ex-pharma exec leading Trumps COVID19 vaccine program has $ 10 million in stock options for a company getting federal funding, https://www.businessinsider.com/moncef-slaoui-leading-trump-vaccine-push-10m-holding-moderna-conflict-2020-5?r=DE&IR=T; Moderna Press Release, Moderna Congratulates Dr. Moncef Slaoui on His Appointment to Oversee the White House’s Operation Warp Speed Initiative, May 15, 2020, http://www.pharmaceuticaldaily.com/moderna-congratulates-dr-moncef-slaoui-on-his-appointment-to-oversee-the-white-houses-operation-warp-speed-initiative/ [x] Moderna Inc., Frequently asked questions about our technology & platform, https://www.modernatx.com/modernas-work-potential-vaccine-against-covid-19 [xi]Norbert Pardi, et al, mRNA vaccines — a new era in vaccinology, Nat Rev Drug Discov. Author manuscript; Published in final edited form as: Nat Rev Drug Discov. 2018 Apr; 17(4): 261–279., cited in https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5906799/citedby/ [xii] Cuiling Zhang, et al, Advances in mRNA Vaccines for Infectious Diseases, Frontiers of Immunol. 2019; 10: 594. Published online 2019 Mar 27. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6446947/ [xiii] Vanessa Beeley, Who controls the British Government response to Covid–19? Part One, 22 April, 2020, https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one [xiv] Neil Ferguson, et al, Report 9: Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand, 16 March, 2020, Imperial CollegeCOVID-19 Response Team, https://www.imperial.ac.uk/media/imperial-college/medicine/sph/ide/gida-fellowships/Imperial-College-COVID19-NPI-modelling-16-03-2020.pdf [xxi] CDC, Provisional Death Counts for Coronavirus Disease (COVID-19): Daily updates of totals by week and state, May 5, 2020, https://www.cdc.gov/nchs/nvss/vsrr/covid19/index.htm [xxii] Hollie McKay, Hospitals are paid more for Medicare patients confirmed or presumed to have coronavirus, Fox News, May 5, 2020, https://www.foxnews.com/health/hospitals-medicare-patients-cost-coronavirus [xxv] Jim Hoft, MN Senator and Doctor: Hospitals Get Paid More to List Patients as COVID-19 and Three Times as Much if the Patient Goes on Ventilator, April 9, 2020, https://www.thegatewaypundit.com/2020/04/huge-mn-senator-doctor-hospitals-get-paid-list-patients-covid-19-three-times-much-patient-goes-ventilator-video/ [xxvi] Jim Hoft, Massachusetts Is Going Back and Adding Coronavirus Deaths to Totals – Is this to Get More Cash?, April 10, 2020, https://www.thegatewaypundit.com/2020/04/wth-massachusetts-padding-coronavirus-numbers-get-cash/ [xxvii] Graziano Onder, MD, PhD, et al, Case-Fatality Rate and Characteristics of Patients Dying in Relation to COVID-19 in Italy, JAMA, March 23, 2020, https://jamanetwork.com/journals/jama/fullarticle/2763667 [xxix] Bill Gates, Lessons From Ebola: We’re Not Ready for the Next Epidemic, March 18, 2015, Gatesnotes, https://www.gatesnotes.com/Health/We-Are-Not-Ready-for-the-Next-Epidemic?ref=hvper.com [xxx] Bill Gates, The Next Epidemic: Lessons from Ebola, https://www.nejm.org/doi/suppl/10.1056/NEJMp1502918/suppl_file/nejmp1502918_appendix.pdf [xxxi] Bill Gates, Preparing for the next epidemic, January 18, 2017, https://www.gatesnotes.com/Health/Preparing-for-the-Next-Epidemic [xxxii] Corazon Miller, Bill Gates predicted a coronavirus-like outbreak - down to it starting at a Chinese market…, 31 January, 2020, Mailonline, https://www.dailymail.co.uk/news/article-7951293/Bill-Gates-Predicted-Coronavirus-Like-Outbreak-2019-Netflix-Documentary.html [xxxix] Ciara Linnane, Inovio stock rallies after company gets Gates Foundation grant to test device for coronavirus vaccine, Market Watch, March 14, 2020, https://www.morningstar.com/news/marketwatch/20200312540/inovio-stock-rallies-after-company-gets-gates-foundation-grant-to-test-device-for-coronavirus-vaccine [xl] Eric Boodman, Researchers rush to test coronavirus vaccine in people without knowing how well it works in animals, March 11, 2020, https://www.statnews.com/2020/03/11/researchers-rush-to-start-moderna-coronavirus-vaccine-trial-without-usual-animal-testing/ [xli] Moderna Inc., Press Release, Moderna Announces Funding Award from CEPI to Accelerate Development of Messenger RNA (mRNA) Vaccine Against Novel Coronavirus, January 23, 2020, https://investors.modernatx.com/news-releases/news-release-details/moderna-announces-funding-award-cepi-accelerate-development [xlii] Gates Foundation and CureVac Collaborate to Accelerate the Development of Transformative Vaccine Technology, Bill & Melinda Gates Foundation https://www.gatesfoundation.org/Media-Center/Press-Releases/2015/03/CureVac-Collaboration [xliii] Reuters, Germany's CureVac says low-dose coronavirus vaccine could allow for mass production [xliv] Statement on the second meeting of the International Health Regulations (2005) Emergency Committee regarding the outbreak of novel coronavirus (2019-nCoV), 30 January 2020, Geneva, Switzerland, https://www.who.int/news-room/detail/30-01-2020-statement-on-the-second-meeting-of-the-international-health-regulations-(2005)-emergency-committee-regarding-the-outbreak-of-novel-coronavirus-(2019-ncov). [xlv] Stephanie Nebehay , WHO says it no longer uses pandemic category, but virus still emergency, February 24, 2020 https://www.reuters.com/article/china-health-who-idUSL5N2AO1BP [xlvii] Martin Enserink, In Holland the Public Face of Flu Takes a Hit, Science, 16 October 2009: Vol. 326. no. 5951, pp. 350 ¬ 351; DOI: 10.1126/science.326_350b, https://science.sciencemag.org/content/326/5951/350.2.full [xlviii] Sophie Borland, Swine flu advisers' ties to drug firms: Five WHO experts linked with vaccine producers, 13 August 2010, UK Mail Online, https://www.dailymail.co.uk/health/article-1302505/WHO-swine-flu-advisers-ties-drug-firms-Experts-linked-vaccine-producers.html [xlix] WHO, Declaration of Interests, Virtual Meeting of Strategic Advisory Group of Experts (SAGE) [l] World Health Organization, Schedule 2 – Voluntary contributions, by fund and by contributor For the year ended 31 December 2017, https://www.who.int/about/finances-accountability/funding/A71_INF2-en.pdf [liii] Ghebreyesus, Tedros Adhanom (2000). The effects of dams on malaria transmission in Tigray Region, northern Ethiopia, and appropriate control measures. jisc.ac.uk (PhD thesis). University of Nottingham. [lv] Jon Miltimore, Oxford Based Group Stops Using WHO Data for Coronavirus Reporting Citing Errors, March 25, 2020, https://fee.org/articles/oxford-based-group-stops-using-who-data-for-coronavirus-reporting-citing-errors/ [lvi] Paul Joseph Watson, Fauci Says Lockdown Will Continue Until There Are No “New Cases” of Coronavirus, 2 April, 2020, https://summit.news/2020/04/02/fauci-says-lockdown-will-continue-until-there-are-no-new-cases-of-coronavirus/ [lxvi] Cheryl Gay Stolberg, Top Coronavirus Official for U.S. Has Fought an Epidemic Before, 6 March 2020, the New York Times, https://www.nytimes.com/2020/03/06/us/politics/coronavirus-trump-deborah-birx.html", "opengraph": {"site_name": "The Greanville Post", "title": "FW Engdahl’s compelling dossier on the “Warp Speed” Push for Coronavirus Vaccines | The Greanville Post", "description": "F W ENGDAHL—The US White House has appointed a coronavirus “Vaccine Czar” from Big Pharma to oversee something dubbed Operation Warp Speed. The goal is to create and produce 300 million doses of a new vaccine to supposedly immunize the entire US population by year-end against COVID19. To be sure that Big Pharma companies give their all to the medical Manhattan Project, they have been fully indemnified by the US government against liabilities should vaccine recipients die or develop serious disease as a result of the rushed vaccine.", "url": "https://www.greanvillepost.com/2020/05/26/fw-engdahls-compelling-dossier-on-the-warp-speed-push-for-coronavirus-vaccines/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2020/05/Trump-Fauci.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=5xOSoYeRb4OvUxaOj.ASdw", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=fZ3s7Wc0tFeA3UNHsSrxoA", "https://www.greanvillepost.com/wp-content/uploads/2020/05/Trump-Fauci.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn1", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn2", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn3", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn4", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn5", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn6", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn7", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn8", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn9", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn10", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn11", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn12", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn13", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn14", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn15", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn16", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn17", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn18", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn19", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn20", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn21", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn22", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn23", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn24", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn25", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn26", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn27", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn28", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn29", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn30", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn31", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn32", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn33", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn34", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn35", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn36", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn37", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn38", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn39", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn40", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn41", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn42", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn43", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn44", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn45", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn46", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn47", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn48", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn49", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn50", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn51", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn52", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn53", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn54", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn55", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn56", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn57", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn58", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn59", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn60", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn61", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn62", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn63", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn64", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn65", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_edn66", "https://www.greanvillepost.com/wp-content/uploads/2018/09/blackband-thick.jpg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref1", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=jSHoHk9itfs87WlfN3TGoA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref2", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=u1kcS6dbEk7qlm4u.WG84g", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref3", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=vbVPLJd7r1W_z7VSIDkE1Q", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref4", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=XKYjZmz_1ey1.co4g8qbQg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref5", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=Vhkrxj_MwjWPBbxEXWWNUQ", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=K1ix32URDEg42rOkVmRAEw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref6", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=N2m0ufgz_u6w.llwEfgbxw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref7", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref8", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref9", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=bzvdvoY45YJ0Wyn4CjSVcA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref10", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=N2m0ufgz_u6w.llwEfgbxw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref11", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=CJlg33EmqRMMCa98mb6i8Q", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref12", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=wqg2bDF9VUMcBx6JyodBbA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref13", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=rBAQHWbzLS_ZDkHFwFaD5A", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref14", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=8wt6UTxe6xSi1yqdySZJfA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref15", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=xiUheqZsXKj9ObZNRP47mw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref16", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=CEAlzOfDVmbp8xGtPTbNOg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref17", "http://dailywire.com/", "https://www.dailywire.com/news/top-covid-19-model-significantly-lowers-us-death-toll-estimate-again", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref18", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=ir53V4FGWzyn8FKseG.2jw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref19", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=KemVJUKUEt9R79fK8txiuw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref20", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=h64C18gLKuy0FNhfl94bUg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref21", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=S4bCvKT67DUOF0hkCEx6MQ", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref22", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=EnT73rdI6YrgjxRS5a3.Kg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref23", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=XKSDEC8Mvyijh2MnjpGbqQ", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref24", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref25", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=T01eM_5N9A17avGpQghn6g", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref26", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=pTNDFbbu8Jj.VJx7RWYOgg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref27", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=VOax7dkM39q0eFYBWtxO.A", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref28", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=0D2m4ksZtb.tfjaMYy8z5Q", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref29", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=2Gzemd9vsTxc7h8YZo47Aw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref30", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=ytNcjnPPcjAAEICKIq0y8A", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref31", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=WItZoqtX_2Do0QT1YvxjeA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref32", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=PPcfBxCqyT_hNrtnNCgT9g", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref33", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=X5wI4tS1XoS7Gogjh0aGlg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref34", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref35", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref36", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=X5wI4tS1XoS7Gogjh0aGlg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref37", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref38", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref39", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=p7Pg.8YVGgTKjqP2NuF_gg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref40", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=7qJqjKqAyI4qvRgO0Ii.Qw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref41", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=xDrXlc5IValYgG8dMI2fpw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref42", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=NYIQQEpL2DEh7Qtf1UzfhQ", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref43", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=R.Wa8lGUOpOb5hl.ayE3.w", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref44", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=eWlqZq8yC5jxv45E7XIjyQ)", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref45", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=buwg0kOor2nncayIJ2Afug", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref46", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=cm_sf4tVRD75.xL0Qj0mkw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref47", "https://science.sciencemag.org/content/326/5951/350.2.full", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref48", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=WiabR.AYT.rXzqNW5WyaiA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref49", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=poGlYVSyBrRgWww6_ilypg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref50", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=sRyJclJYCEoc20jw3UVIDw", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref51", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref52", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=46bDiXU0S68QPfbea.3DJg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref53", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=LmDgcVKr0Nar3YMIrD6.cA", "http://jisc.ac.uk/", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref54", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=O7J5ERO3CIsw9UOT7e1bLA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref55", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=aZQrXBOat0zS.0y3jU2MrA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref56", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=gEW3xvrNH8ootU3UQ5l_ww", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref57", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref58", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=eG9OSil3KkxnZTpfrS8QLg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref59", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref60", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref61", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref62", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=IKe31Zp3YN.WRrdP91klRg", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref63", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=4FYLU5h3fDwbIigoynp7pA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref64", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=jWdj_s6AnvjI1AC8bmX34w", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref65", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=Jt_8_38G62gpoh7GIRQVYA", "x-webdoc://98B4BDEC-B012-4D77-A20F-9FB23E4AE87F#_ednref66", "https://clicks.aweber.com/y/ct/?l=PCeE1&m=kSFQTaOgy4Tdiqk&b=tSdSaStiddHxUf9czuCfJQ"], "authors": [], "publish_date": "May 26, 2020"}