{"result_id": "295032", "URL": "https://www.greanvillepost.com/2022/04/14/mariupol-1000-gay-satanic-terrorists-surrender-in-a-single-day/", "timestamp": "2023-04-25 17:22:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/04/14/mariupol-1000-gay-satanic-terrorists-surrender-in-a-single-day/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Mariupol: 1000 Gay Satanic Terrorists Surrender in a Single Day", "cleaned_text": "Never forget that the same people who told you that the vaccine was safe and effective and that men can become women by cutting their penises off told you that Russia was losing the conflict in the Ukraine.\n\nLiterally nothing that these people say is true. You can basically determine the truth of anything by simply looking at the mainstream media narrative, and believing the opposite.\n\nSee – this is how against democracy the Russians truly are.\n\nIn a democracy, when you take POWs, you are supposed to tie them up and shoot off their kneecaps. Not give them medical treatment.\n\nThis is why we have to completely destroy Russia – they hate our values.\n\nThe report was disputed by Ukrainian officials. Presidential adviser Alexey Arestovich claimed on social media that the unit had performed a “difficult and very risky maneuver” and joined forces with the Azov Battalion, the Ukrainian national guard unit holding position at a different location in Mariupol. This “gave the 36th a second chance” and significantly boosted the defensive capabilities of Kiev’s forces in the city, he said. The reports of a large number of Ukrainian troops laying down arms in Mariupol began to emerge on Tuesday. These were supported by footage from war correspondents on the ground, showing what appears to be groups of people wearing military uniforms in captivity. The claimed mass surrender followed a report by the Russian Defense Ministry, which said around 100 Ukrainian marines had made an attempt to break out from the factory. According to the Russian claims, about half of the Ukrainian military personnel involved were killed when their motorcade was attacked by artillery and warplanes, while the rest were captured.\n\nI regretfully inform you that the last big Twitter account that was posting this video was banned today.\n\nThere’s still one account with one of the videos on Twitter (hopefully people do keep making new accounts and uploading these videos from Telegram):\n\nMaybe it was faked with crisis actors, and actually, Ukraine is really, really winning hard.\n\nMaybe Ukrainian forces are surrounding Moscow as we speak. That’s definitely the impression you get from the American media. I half expect to turn on CNN and literally see Jake Tapper say: “we’re getting reports that Azov battalion has surrounded Moscow, and that the Kremlin is in the process of discussing a Russian surrender.”\n\nOf course, the same people making those claims will also not try to contest this:\n\nThey just don’t talk about it, and instead tell you about Snake Island and the Ghost of Kiev.\n\nIn real life, the end has already begun.\n\nFootage of the mass surrender in Mariupol can be banned from Twitter, but it is getting spammed all over Telegram, and the Ukrainians are seeing it. Very, very bad for morale, as the ultimate battle for the Donbass looms.\n\nFaggots on Reddit wanted a Marvel Comics showdown – well, they’re going to get that.\n\nExcept it’s probably going to be a lot more surrendering than fighting.\n\nAzovstal is falling. The complex is being cleared out. The forces from the north are moving down, and they will meet the forces from the south, and most of the Ukrainian military is going to be inside a cauldron.\n\nThey will all be asking themselves what exactly it is they are dying for:\n\nThere is no such thing as a “Ukrainian country.” So they can’t be fighting for that. This concept of a Ukrainian country has been built up over the last 8 years around anal sex and satanic neo-Nazism, but it takes a lot more than that – and a lot longer than 8 years – to actually form a real national identity.\n\nI hope the normal Ukrainians surrender. I don’t want to see them slaughtered. No one wants to see that. Many people wanted to see Azov slaughtered, because they literally worship Satan and slaughter innocent women, children, and old people. But that is pretty much done already.\n\nThe normal Ukrainian forces should surrender, go home, and try to rebuild. Russia is going to help them get back on their feet. Russia has already committed to that. There is no reason for them to die.\n\nBut if they decide to die, then okay. Whatever. I don’t believe any of them doesn’t know that they are fighting for the single most Jewish government in the world outside of Israel, which is teaching gay sex and trannyism to their children in kindergarten.\n\nIf they want to die for that, that is their prerogative.\n\nThe Next Phase of Your Retarded Doom\n\nOnce Russia wins outright and gets everything that they demanded, the media is going to have to deal with the fact that they made the utterly nonsensical claim that the Ukraine was going to win the war.\n\nThey’re not going to apologize to you – they are going to switch to something else.\n\nPresumably, it is going to be back to coronavirus.\n\nAfter realizing that they cannot do this weird shit on the global stage, the US ZOG machine is going to turn to the battle they can win: the battle against the American people themselves.", "opengraph": {"site_name": "The Greanville Post", "title": "Mariupol: 1000 Gay Satanic Terrorists Surrender in a Single Day | The Greanville Post", "description": "ANDREW ANGLIN—There is no such thing as a “Ukrainian country.” So they can’t be fighting for that. This concept of a Ukrainian country has been built up over the last 8 years around anal sex and satanic neo-Nazism, but it takes a lot more than that – and a lot longer than 8 years – to actually form a real national identity. I hope the normal Ukrainians surrender. I don’t want to see them slaughtered. No one wants to see that. Many people wanted to see Azov slaughtered, because they literally worship Satan and slaughter innocent women, children, and old people. But that is pretty much done already.", "url": "https://www.greanvillepost.com/2022/04/14/mariupol-1000-gay-satanic-terrorists-surrender-in-a-single-day/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/04/ukraine-tranny-indoctrination-kindergarten.png", "article:section": "RUSSIA & NOVOROSSIYA", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"> <p dir=\"ltr\" lang=\"en\">⚡⚡⚡More captured Ukrainian soldiers from yesterday, the estimated amount of total captured soldiers is around 1000 soldiers just in 1 day.<a href=\"https://twitter.com/hashtag/Mariupol?src=hash&amp;ref_src=twsrc%5Etfw\">#Mariupol</a><a href=\"https://twitter.com/hashtag/Donbass?src=hash&amp;ref_src=twsrc%5Etfw\">#Donbass</a> ⚡⚡⚡ <a href=\"https://t.co/cRQ7KEgjVk\">pic.twitter.com/cRQ7KEgjVk</a></p> <p>— ILRUSSO???????????????????????????????????????????????????????????????????????????????? (@ILRUSSO1) <a href=\"https://twitter.com/ILRUSSO1/status/1514096833425035268?ref_src=twsrc%5Etfw\">April 13, 2022</a></p></blockquote> "], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2022/04/mariupol-Russian-DNR-officer.png", "https://www.rt.com/russia/553792-mariupol-mass-surrender-report/", "https://dailystormer.cn/wp-content/uploads/2022/04/Screen-Shot-2022-04-13-at-11.12.30-AM.png", "https://twitter.com/hashtag/Mariupol?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Donbass?src=hash&ref_src=twsrc%5Etfw", "https://t.co/cRQ7KEgjVk", "https://twitter.com/ILRUSSO1/status/1514096833425035268?ref_src=twsrc%5Etfw", "https://www.greanvillepost.com/wp-content/uploads/2022/04/war-losses-Ukie-Russia.jpeg", "https://www.greanvillepost.com/wp-content/uploads/2022/04/marvel-comics-monster.jpeg", "https://www.greanvillepost.com/wp-content/uploads/2022/04/ukraine-military-situation.jpeg", "https://www.greanvillepost.com/wp-content/uploads/2022/04/ukraine-tranny-indoctrination-kindergarten.png", "https://www.greanvillepost.com/wp-content/uploads/2022/04/fauci-demon.png"], "authors": [], "publish_date": "April 14, 2022"}