{"result_id": "295035", "URL": "https://www.greanvillepost.com/2021/04/18/the-footprints-of-us-uk-hybrid-war-dirty-tricks-are-obvious-czechs-announce-expulsion-of-18-russian-diplomats-as-prague-claims-intel-officers-involved-in-2014-munitions-depot-explo/", "timestamp": "2023-04-25 17:22:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/04/18/the-footprints-of-us-uk-hybrid-war-dirty-tricks-are-obvious-czechs-announce-expulsion-of-18-russian-diplomats-as-prague-claims-intel-officers-involved-in-2014-munitions-depot-explo/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "The footprints of US/UK hybrid war dirty tricks are obvious: Czechs announce expulsion of 18 Russian diplomats, as Prague claims ‘intel officers’ involved in 2014 munitions depot explosion", "cleaned_text": "Please make sure these dispatches reach as many readers as possible. Share with kin, friends and workmates and ask them to do likewise.\n\nhe Czech Republic says it will expel 18 Russian diplomats, alleging that Russian intelligence officers were involved in a local munitions depot blast in 2014. It comes a day after Moscow said it would expel 10 US diplomats.\n\nThe move by Prague came amid a diplomatic standoff between Moscow and Washington that began midweek, after US President Joe Biden ordered 10 Russian diplomats out of the country over the Kremlin’s alleged interference in the 2020 presidential election and its claimed involvement in last year’s SolarWinds cyber-espionage case. More than 30 Russian individuals and organizations were also sanctioned, while American companies were banned from directly buying shares in Russia’s national debt.\n\nMoscow delivered a tit-for-tat response on Friday, with Foreign Minister Sergey Lavrov stating that 10 American diplomats would be expelled from Russia, and promising measures that would bar US funds and NGOs from interfering in its internal affairs.\n\nPrime Minister Andrej Babis and Foreign Minister Jan Hamacek announced the expulsion at a joint press conference in the country’s capital.\n\nBabis said the move was a response to the alleged involvement of Russian intelligence officers in arms depot explosions in the Czech Republic seven years ago.\n\n “We are keeping our partners from the European Union and NATO informed and ask for their support,” Hamacek added. He has canceled his planned trip to Moscow, where he was to have discussed the possible purchase of Russia’s Sputnik V Covid-19 vaccine.\n\nPresident Milos Zeman, who is known as a strong supporter of better ties between Prague and Moscow, had already been informed of the expulsions, and has “expressed absolute support for us,” the two officials said.\n\nSeveral explosions rocked an ammunition depot in the village of Vrbetice, some 330km southeast of Prague, in October 2014. The blasts killed two employees of a private company that had been renting the warehouse from the Czech military.\n\nAlso on Saturday, the Czech police placed two Russian citizens, who had allegedly visited Vrbetice at the time of the explosions, on the wanted list over “serious crime.” They were identified as Alexander Petrov and Ruslan Boshirov – the same persons that Britain accused of being the Russian spies in the UK responsible for using the infamous ‘Novichok’ chemical agent on double agent Sergei Skripal and his daughter Yulia in Salisbury in March 2018.\n\nThe two men have previously denied any links to the Russian Military Intelligence Directorate (GRU) and have complained their lives have been ruined by unsubstantiated accusations coming from London.\n\nWestern media—in this case France 24—has been quick to pick the spurious story. Here's Babis duly denouncing Russia, as per London instructions.\n\nThe Czech police said they couldn’t confirm the link between Petrov and Boshirov’s wanted status and the Vrbetice explosions, when asked for comment by news agency RIA Novosti.\n\n“Prague is well aware what the follow-up of such tricks will be,” Russia’s Foreign Ministry spokeswoman, Maria Zakharova, said in response to the expulsions, without elaborating on what Moscow’s response would be. Some Russian officials immediately linked the move to the ongoing US-Russia sanctions war.\n\nArguing that the Czech claims were “nonsense,” First Deputy Chair of the Federation Council Committee on Foreign Affairs, Vladimir Dzhabarov, insisted that “the whole situation was invented to support the Americans, who have now received a harsh response from us.”\n\nIt was “laughable” to suggest that Russia would blow anything up inside Czechia, Dzhabarov said, reminded that Prague is a buyer of Russian gas and it would’ve made no sense for Moscow to jeopardize those good trade relations. As for Russia’s countermeasures, the senator suggested that they would be “adequate” and “proportionate.”\n\nWhat makes the timing of the Czech accusations against Russia more “interesting,” is that they come just days before FM Hamacek was expected in Moscow to discuss the purchase of Sputnik V Covid-19 vaccine for the Czech Republic, political analyst Dmitry Babich told RT. Often criticized for being too “friendly” with Moscow, President Zeman, who openly expressed his support for the idea of buying Sputnik V, may now be forced to prove his “patriotism” and “demand explanations from Russia,” Babich believes.\n\nAs part of a “larger picture,” growing tensions in eastern Ukraine should also be taken into account, geopolitical analyst and consultant Rainer Rothfuss added, noting that no clear evidence of Russia’s involvement has yet been presented. “Words aren’t enough… No evidence shows Petrov and Boshirov’s involvement, so it’s just handy to show those familiar faces,” Rothfuss said. “Until we see evidence we must assume that it’s another crisis between Western Europe, America, of course, and Russia.”\n\nThe Czech authorities were simply following “Washington's Russophobic track,” the chairman of the Parliament’s Committee on International Affairs, Leonid Slutsky, said, adding that he believes there have been “no actual reasons” for a crackdown on Russian embassy staff.\n\nThe views expressed are solely those of the author and may or may not reflect those of The Greanville Post", "opengraph": {"site_name": "The Greanville Post", "title": "The footprints of US/UK hybrid war dirty tricks are obvious: Czechs announce expulsion of 18 Russian diplomats, as Prague claims ‘intel officers’ involved in 2014 munitions depot explosion | The Greanville Post", "description": "The move by Prague came amid a diplomatic standoff between Moscow and Washington that began midweek, after US President Joe Biden ordered 10 Russian diplomats out of the country over the Kremlin’s alleged interference in the 2020 presidential election and its claimed involvement in last year’s SolarWinds cyber-espionage case. More than 30 Russian individuals and organizations were also sanctioned, while American companies were banned from directly buying shares in Russia’s national debt. Moscow delivered a tit-for-tat response on Friday, with Foreign Minister Sergey Lavrov stating that 10 American diplomats would be expelled from Russia, and promising measures that would bar US funds and NGOs from interfering in its internal affairs.", "url": "https://www.greanvillepost.com/2021/04/18/the-footprints-of-us-uk-hybrid-war-dirty-tricks-are-obvious-czechs-announce-expulsion-of-18-russian-diplomats-as-prague-claims-intel-officers-involved-in-2014-munitions-depot-explo/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-18-at-12.29.21-PM.png", "article:section": "IMPERIAL WHORES", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2021/04/Defeat-US-imperialism-2.jpg", "https://www.rt.com/russia/521369-czech-republic-expels-russian-diplomats/", "https://www.greanvillepost.com/wp-content/uploads/2021/04/Andrej-Babis-Czech-PM.jpg"], "authors": [], "publish_date": "April 18, 2021"}