{"result_id": "295010", "URL": "https://www.greanvillepost.com/2021/10/02/andrei-martyanov-analyses-the-current-moment-in-europe-and-the-world/", "timestamp": "2023-04-25 17:22:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/10/02/andrei-martyanov-analyses-the-current-moment-in-europe-and-the-world/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Andrei Martyanov Analyses the Current Moment in Europe and the World", "cleaned_text": "Tyler Durden of ZeroHedge posted today (Oct 1, 2021) a piece by Bill Blain about the energy crisis. Blain opens with a broadside:\n\nFor many months myself and many of the investors I work with have become increasingly concerned at the growing instability and insecurity of energy markets. The 4 times spike in Gas prices this year has been a shocking wake-up call, highlighting energy insecurity in Europe and particularly the UK. Gas prices will remain elevated for months to come. The consequences are going to be brutal – and fatal for some. Energy – whether derived from fossil fuels, nuclear or renewables – is a commodity and the critical thing about commodities is: “You can’t print commodities like you can print money. The rules are not the same,” says my good friend and head of commodities at Shard, Ashley Boolell.\n\nIt is obvious--commodities ARE the foundation of the physical economy which is THE economy, the rest, including finances, is merely a derivative, an avatar for exchange. But that is not the main focus here. Blain writes about Russia, of course.\n\nThe likely source of Gas will be Russia. And Vladimir Putin can’t wait. The coming Energy Crisis will be his grand opportunity. Remember the famous photo of him with Angela Merkel and his dog prowling in front of her? Putin knew she has a terror of dogs so he deliberately intimidated her. He won’t deal with Europe. He will invite each European leader to plead their case individually, menacingly asking each leader why he should open the Gas Taps to their nation specifically. Covid 19 was the first big test for Europe. Its vaccine programme failures could have been disastrously fractious for the EU. When faced with a European Energy Crisis and Russia holding the cards, what’s to stop countries doing deals? Who will crack first? Poland? Germany? And what will Putin expect in return? Legitimacy? A free-hand to deal with domestic dissent? Sanction ending? A free hand in Ukraine or even the Baltics? It rather depends on what price he thinks he can force Europe to pay. And what will Putin ask of Boris? That London reopens its door and markets to the kleptocracy he leads? Or something more…? Make no mistake, this winter is going to be shocking. Be aware.\n\nBlain, obviously, is fully ignorant of Russia because he doesn't understand the weight difference between the UK and her rather dubiously qualified PM BoJo and Russia and Putin. The difference is not just in the weight category; the UK and any separate EU country are orders of magnitude less important geopolitically than Russia. The difference is in power. Blain, being an \"investor\" doesn't operate with such categories because they are beyond the grasp of the run-of-the-mill British \"financial strategist\" and a product of Western \"schools of economics\". That is why Western \"strategists\" cannot find their own ass with their own two hands in a brightly lit room, since none of them understands the real economy, real power, including military and, being a product of Western non-STEM education, they do not have a grasp of the physical economy in terms of advanced manufacturing. But that is not the main issue. The main issue is what is highlighted in yellow.\n\nTalk about being ignorant and suffering from the acute case of folie de grandeur while being British. Putin is not going to \"ask anything\" from BoJo and the UK. Least of all legitimacy? LOL. Blain should stick to what he knows best, which is a financial voodoo which turned the UK into a pipsqueak of a country and continues to run the US into the ground with acceleration. Russia doesn't need any favors from the UK nor any permissions on dealing with anything domestically, let alone about Ukraine and here is the point: what is the definition of \"free hand\" in Ukraine? Can Blain give a definition of what this \"free hand\" in Ukraine means? He can't for a simple reason, as I already pointed out above--he will deflate within the first minute when trying to talk about real geopolitics and real economy because he has zero background in those matters and does not operate with the conceptual apparatus and epistemology of modern geopolitics because it is very difficult and requires serious STEM and natural science background. Should he have one, he would have known that the only concern for Russia in 404 is for it turning, an ongoing and accelerating process, into a complete shithole which in desperation may indeed commit suicide (including on the advice of Blain's homeland) and unleash the war against Russia which it will lose very fast and severely but will accomplish only one thing, which Russia was avoiding for the last 7 years—taking this freak of a nation with its third world problems and hostile population on Russia's balance.\n\nBut Blain is not aware of this and his thinking that \"London reopening its door and market\" for Russia is desirable is ludicrous. Same goes with lifting sanctions. Netherlands and Belarus are above the UK as Russia's trading partners and the UK \"market\" is not that important for Russia as are the Chinese or German markets, with the latter also declining in importance. But the trend with EU (and UK as a former part of it) in general as I already stated not for once is on reorienting Russia toward the East where her real economic and geostrategic interests are. and in those plans both the US and UK as the US chihuahua, are viewed as enemies with suicidal tendencies. So, for Blain it is time to wake up and smell the reality of the UK being a secondary power at best (in reality--tertiary), and the fact that a lot of banking is done in London City doesn't make it a center of the world. The last remaining jewels of British engineering ingenuity and economic ability, such as Rolls-Royce, among very few others, should not give Blain a strange idea that he understands the modern world, especially Russia, and how it operates. He doesn't, most \"investors\" and \"strategists\" don't, otherwise the collapsing Western World wouldn't have found itself in the place it is today. As they say in the Anglo-world, the proof is in the pudding. I hope Blain at least heard this one. But generally, one has to ask why such illiterate trash as Blain wrote even has to be taken seriously. But I feel his pain.\n\nP.S. Has this \"strategist\" dabbled into military analysis to compare the armed forces of the UK and Russia? Just wondering.\n\nThe global energy crunch forced a German electricity producer to halt a power plant after it ran out of coal. Steag GmbH closed its Bergkamen-A plant in the western part of the country this week due to shortages of hard coal, it said by email. The closure is the first sign that Europe may need to count on mild and windy weather to keep the lights on as the continent faces shortages of natural gas and coal is unlikely to come to rescue. Read again, attentively: The closure is the first sign that Europe may need to count on mild and windy weather to keep the lights on as the continent faces shortages of natural gas and coal is unlikely to come to the rescue. Western \"elites\" are morons with zero serious engineering and real science background. So, let them continue to get greener. European utilities had already turned to coal due to shortages of natural gas, recently stepping in to the spot market to secure cargoes and even asking Russia for more supplies. China’s move to secure more supplies is likely to make matters worse, with Europe set to scramble to secure fuel this winter. Don't tell me that I didn't warn you. Russia fulfills her contract obligations in full and if someone wants to commit suicide it is not Russia's responsibility to save them. They want more? Sure, pay the new price for additional volumes of whatever energy they want. If not--go fvck yourself and go full retard... I mean \"green\" which is pretty much the same in terms of delusion. They don't teach physics and electrical engineering in law and political \"science\" schools. Russia, meanwhile, has a much bigger fish to fry in the East and is in the process of reorienting her resources toward that market. Germany's Emercom already issued Public Video Announcement on how not to die from cold. Well, if Star Trek meme wasn't enough, this one covers pretty much everything, including the indictment of the EU political class who view their people as guinea pigs in a bizarre experiment of patients running the asylum. We are talking about criminal negligence due to utter incompetence and fanaticism of Western political class for which Europeans are paying the price already.", "opengraph": {"site_name": "The Greanville Post", "title": "Andrei Martyanov Analyses the Current Moment in Europe and the World | The Greanville Post", "description": "ANDREI MARTYANOV—Talk about being ignorant and suffering from the acute case of folie de grandeur while being British. Putin is not going to \"ask anything\" from BoJo and the UK. Least of all legitimacy? LOL. Blain should stick to what he knows best, which is a financial voodoo which turned the UK into a pipsqueak of a country and continues to run the US into the ground with acceleration. Russia doesn't need any favors from the UK nor any permissions on dealing with anything domestically, let alone about Ukraine and here is the point: what is the definition of \"free hand\" in Ukraine?  Can Blain give a definition of what this \"free hand\" in Ukraine means? He can't for a simple reason, as I already pointed out above--he will deflate within the first minute when trying to talk about real geopolitics and real economy because he has zero background in those matters and does not operate with the conceptual apparatus and epistemology of modern geopolitics because it is very difficult and requires serious STEM and natural science background.", "url": "https://www.greanvillepost.com/2021/10/02/andrei-martyanov-analyses-the-current-moment-in-europe-and-the-world/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/10/Bill-Blain-market-strategist.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://morningporridge.com/about/", "https://www.statista.com/statistics/1100708/russia-leading-foreign-trade-partners-by-volume/", "http://smoothiex12.blogspot.com/2021/10/almost-without-comments.html", "https://www.bloomberg.com/news/articles/2021-10-01/energy-crisis-forces-german-power-plant-to-halt-on-lack-of-coal", "https://1.bp.blogspot.com/-IlEWDYPG0WQ/XNr8y0wfsTI/AAAAAAAACKk/cZVC6pdL5sg5VqbFl8aJA_LTci3Xwpr-wCPcBGAYYCw/s640/double-facepalm1.jpg", "https://1.bp.blogspot.com/-PQdN386lspY/XadKM37BD6I/AAAAAAAACW4/WawCLxFf0RweG604_x5mlovB2fQlbprDgCPcBGAYYCw/s1280/Lavrov-Debily1.jpg"], "authors": [], "publish_date": "October 2, 2021"}