{"result_id": "295016", "URL": "https://www.greanvillepost.com/2023/01/10/deborah-armstrong-my-interview-by-regis-tremblay/", "timestamp": "2023-04-25 17:22:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2023/01/10/deborah-armstrong-my-interview-by-regis-tremblay/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Deborah Armstrong: My Interview by Regis Tremblay", "cleaned_text": "Please share this article as widely as you can.\n\nYesterday, I was honored to be interviewed by Filmmaker Regis Tremblay for his Up Close and Personal series.\n\nWe talked about what it was like when I lived in the USSR in 1991, what the people were like, my TV news career, what got me started writing about the Donbas, and American apathy.\n\nRegis is best known for his film The Ghosts of Jeju, a shocking documentary about the struggle of the people of Jeju Island, S. Korea. Set in the context of the American presence in Korea after World War II, the film reveals horrible atrocities at the hands of the U.S. Military Government of Korea.\n\nRegis currently lives in Yalta, Russia, on the Crimean Peninsula. His YouTube channel was deleted despite having 16,000 subscribers, hundreds of thousands of views, and mountains of video footage telling the story of Donbas. You can now find him at the following links:\n\nI will also be uploading some of Regis videos from his international association, “Friends of Crimea — Friends of Russia,” which I have also joined.\n\nIf you are not already familiar with Regis Tremblay and his Global Conversations, I highly recommend them!\n\nHere is my interview with Regis.\n\nSince we do not trust Google (YouTube) to keep these invaluable videos around (they deleted Regis' account along with his video library) we are offering here the BitChute version of this interview. \n\n\n\n\n\n Deborah Armstrong, long-time TV and print journalist and Friend of Russia - Friend of Crimea tells of her year and a half in the Soviet Union working for Soviet national television. She's featured here singing on a Soviet TV show. Overcoming the brainwashing and propaganda is difficult when so many Americans are just trying to survive and care for their families.", "opengraph": {"site_name": "The Greanville Post", "title": "Deborah Armstrong: My Interview by Regis Tremblay | The Greanville Post", "description": "DEBORAH ARMSTRONG—Yesterday, I was honored to be interviewed by Filmmaker Regis Tremblay for his Up Close and Personal series. We talked about what it was like when I lived in the USSR in 1991, what the people were like, my TV news career, what got me started writing about the Donbas, and American apathy. Regis is best known for his film The Ghosts of Jeju, a shocking documentary about the struggle of the people of Jeju Island, S. Korea. Set in the context of the American presence in Korea after World War II, the film reveals horrible atrocities at the hands of the U.S. Military Government of Korea.", "url": "https://www.greanvillepost.com/2023/01/10/deborah-armstrong-my-interview-by-regis-tremblay/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-10-at-5.27.29-PM.png", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bitchute.com/video/t491VdDFeuia/", "https://www.facebook.com/regis.tremblay.12/", "https://rumble.com/v1munwh-global-conversations-with-regis-tremblay.html", "https://www.registremblay.com/"], "authors": [], "publish_date": "January 10, 2023"}