{"result_id": "295018", "URL": "https://www.greanvillepost.com/2021/06/04/a-scandal-is-being-thuggishly-covered-up-by-a-regime-more-interested-in-propaganda-than-human-life/", "timestamp": "2023-04-25 17:22:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/06/04/a-scandal-is-being-thuggishly-covered-up-by-a-regime-more-interested-in-propaganda-than-human-life/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "POLITICS OF THE WUHAN LEAK HYPOTHESIS: A scandal is being thuggishly covered up by a regime more interested in propaganda than human life", "cleaned_text": "US president Joe Biden has ordered a “hunt for new intelligence to determine whether the Chinese government covered up an accidental leak” [1] at the Wuhan Institute of Virology, a laboratory in Wuhan, the city in which the novel coronavirus was first identified. The lab is a biosafety level 4 (BSL4) facility, the highest level.\n\nTwelve months ago, then secretary of state Mike Pompeo also “asked intelligence agencies to continue looking for any evidence to support” (what the New York Times at the time) called “an unsubstantiated theory that the pandemic might be the result of an accidental lab leak.” Times’ reporters Edward Wong and Ana Swanson added that the intelligence community had told Pompeo that “they most likely will not find proof.” [2]\n\nAt the time, some US “officials were wary of President Donald J. Trump’s motives, arguing that his interest in the origins of the pandemic was either to deflect blame from his administration’s handling of it or to punish China.” The Biden administration says that “the central goal of the new intelligence push is to improve preparations for future pandemics.” [3]\n\nIt is widely agreed that the pandemic originated in a zoonotic spillover—the transmission of the novel coronavirus from another species to humans. The spillover may have happened in nature, or it may have happened in a laboratory. A laboratory spillover would involve the accidental infection of a scientist working with live virus.\n\nVirus hunters have “collected samples from 164,000 animals and humans and claimed to have found ‘almost 1,200 potentially zoonotic viruses, among them 160 novel coronaviruses, including multiple SARS- and MERS-like coronaviruses.’” These potential pandemic pathogens are “studied and circulated in laboratories worldwide.” [4]\n\nIn 2012, there were at least 42 facilities engaged in researching live potential pandemic pathogens, including 30 labs that were working with live SARS virus. [5]\n\nWriting in the Bulletin of the Atomic Scientist, Lynn Klotz, Senior Science Fellow at the Center for Arms Control and Non-Proliferation, warned in 2019 that “Incidents causing potential exposures to pathogens occur frequently in the high security laboratories often known by their acronyms, BSL3 (Biosafety Level 3) and BSL4. Lab incidents that lead to undetected or unreported laboratory-acquired infections can lead to the release of a disease into the community outside the lab; lab workers with such infections will leave work carrying the pathogen with them. If the agent involved were a potential pandemic pathogen, such a community release could lead to a worldwide pandemic with many fatalities.” [6]\n\nNicholson Baker, a prolific writer of both fiction and non-fiction, wrote a long article in New York Magazine in January exploring the lab-leak hypothesis. Baker wrote that “In 2015, the Department of Defense discovered that workers at a germ-warfare testing center in Utah had mistakenly sent close to 200 shipments of live anthrax to laboratories throughout the United States and also to Australia, Germany, Japan, South Korea, and several other countries over the past 12 years. In 2019, laboratories at Fort Detrick — where ‘defensive’ research involves the creation of potential pathogens to defend against — were shut down for several months by the Centers for Disease Control and Prevention for ‘breaches of containment’.” They reopened in December 2019.” [7]\n\nAccording to the New York Times, safety concerns “led the government to shut down research involving dangerous microbes like the Ebola virus” at the military lab in the summer of 2019. The newspaper noted that “Missteps have occurred at other government laboratories, including those at the Centers for Disease Control and the National Institutes of Health.” [8]\n\nResearch was also suspended at Fort Detrick in 2009 over bio-safety concerns. [9]\n\nChina has demanded an independent inquiry of the Fort Detrick laboratories as the possible source of the novel coronavirus, [10] a demand the US news media have ridiculed, arguing there is “not a shred of evidence to support” a leak at the lab. [11]\n\nBut, as lapses at Fort Detrick demonstrate, laboratory accidents do happen, “even in high containment settings.” [12]\n\nAccording to the scientific journal, Nature Reviews Microbiology, “More than twice a week in US laboratories, there is a ‘possible release event’ or a ‘possible loss event’, even if we look only at select agents — some of the most dangerous pathogens. For every 1,000 lab-years of work in BSL-3 laboratories in the United States with select agents, there are at least 2 accidental infections. This level of safety may be acceptable if the risk is to the laboratory workers only, as it is with most pathogens that are not readily transmissible. However, the same probability of an accident that could spark a global pandemic cannot be called acceptably safe.” [13]\n\nLynn Klotz, and Edward Sylvester, a professor at the Walter Cronkite School of Journalism and Mass Communication at Arizona State University, ask us to “consider the probability for escape from a single lab in a single year to be 0.003 (i.e., 0.3 percent)…[With] 42 labs carrying out live [potential pandemic pathogen] research, this basic 0.3 percent probability translates to an 80 percent likelihood of escape from at least one of the 42 labs every 12.8 years.” Klotz and Sylvester argue the “level of risk is clearly unacceptable.” [14]\n\nBy 2012, SARS had “escaped from laboratories three times.” [15] A “researcher at the National Institute of Virology in Beijing” was infected, and “passed it on to others, including her mother, who died from the infection.” [16] If SARS could escape three times from a laboratory, could SARS-2 have escaped one or more times?\n\nWhether it did or didn’t, lab leaks do happen, and questions need to be raised about whether the risks involved in working with potential pandemic pathogens in the laboratory are acceptable. Many scientists, including Richard Ebright, a molecular biologist at Rutgers University, believe the consequences of a potential pandemic pathogen leaking from a lab are too great to accept the risk, no matter how small. He compares lab work with pathogens that could spark a pandemic to “looking for a gas leak with a lighted match.” [17]\n\nClearly, the possibility that there was a leak at the Wuhan Institute of Virology cannot be ruled out, any more than leaks at Fort Detrick or the dozens of other laboratories around the world that are looking for gas leaks with lighted matches can be ruled out.\n\nAnd there is a surface plausibility to the Wuhan lab leak claim. As the New York Times reported, “The coronavirus first came to light in the city of Wuhan, home to the Wuhan Institute of Virology, where researchers study dozens of strains of coronaviruses collected in caves in southern China.” [18]\n\nWhat’s more, according to intelligence shared with Washington by an ally, “three workers in the Wuhan virological laboratory were hospitalized with serious flulike symptoms in the autumn of 2019. [19]\n\nHowever, there are also plausible alternative explanations. We don’t know whether the novel coronavirus originated in Wuhan. We only know that Wuhan is where a new form of SARS was first identified. The virus may have originated elsewhere, and the first cases misdiagnosed as pneumonia or flu, and later brought to Wuhan.\n\nAs to the lab workers who are alleged to have fallen ill in the autumn of 2019, the New York Times reported that US “intelligence officials do not know whether the lab workers contracted Covid-19 or some other disease, like a bad flu. If they did have the coronavirus, the intelligence may suggest that they could have become sick from the lab, but it also could simply mean that the virus was circulating in Wuhan” earlier than currently believed. [20]\n\nAnd while the lab employees were hospitalized it “isn’t unusual for people in China to go straight to the hospital when they fall sick, either because they get better care there or lack access to a general practitioner. Covid-19 and the flu, while very different illnesses, share some of the same symptoms, such as fever, aches and a cough.” [21]\n\nThe fact of the matter is that although a lab leak is possible, including one at the Wuhan lab, there is no evidence that one happened.\n\n“Most of the broader intelligence community, including the C.I.A. and the Defense Intelligence Agency, believe there is not yet sufficient information to draw a conclusion, even with low confidence, about the origins,” according to the New York Times. [22]\n\nAlso, evidence exists that is inconsistent with the hypothesis that the novel coronavirus spilled out of the Wuhan lab. Virologist Robert Garry “observed that Chinese scientists would have to have collected SARS-CoV-2 and then grown it in a colony of cells, but somehow never publish any details of it even as they published reports on other coronaviruses for years. ‘It makes no sense to me’,” he said. [24]\n\nBiden says that unlike Trump, he is asking the intelligence community to investigate the possibility of a lab leak in Wuhan in order to “improve preparations for future pandemics,” not to discredit China. [25] But his claim is implausible.\n\nTo show this, consider the following sets of questions. Only one of them is directly relevant to the question of how to reduce the risk of future pandemics.\n• Are the risks of a lab accident acceptable given the possible consequences? If not, can the risks be reduced to acceptable levels by enhancing laboratory safeguards? Or, is it the case, that the consequences of a leak could be so catastrophic, that taking any risk is foolhardy?\n• Did SARS-CoV-2 leak from the Wuhan Institute of Virology?\n\nIf we’re genuinely interested in reducing the chances of future pandemics, we ought to answer the first set of questions. The second question is irrelevant.\n\nEven if a lab leak didn’t happen at the Wuhan lab, the question of whether the risks of a leak from any lab are acceptable still stands. Should we be looking for gas leaks with a lit match?\n\nAnd if a leak did happen in Wuhan, the first set of question still remains.\n\nHere are two objectives. Which of these most closely match the questions above?\n• How can we reduce the chance of a future pandemic?\n• How can we blacken China’s reputation?\n\nIf Biden were genuinely interested in learning how to prevent a future pandemic he would be exploring how to prevent zoonotic spillovers, both in nature, and in the lab. On the other hand, if he’s interested in tarring the reputation of a country he has labelled a competitor, as his predecessor was, he is proceeding along the right path. Unfortunately, that path has nothing to do with protecting humanity from future pandemics.\n\n1 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021\n\n2 Edward Wong and Ana Swanson, “Some Trump Officials Take Harder Actions on China During Pandemic,” The New York Times, May 1, 2020\n\n3 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021\n\n5 Lynn C. Klotz, Edward J. Sylvester, “The unacceptable risks of a man-made pandemic,” The Bulletin of the Atomic Scientists, August 7, 2012\n\n6 Lynn Klotz , “Human error in high-biocontainment labs: a likely pandemic threat,” Bulletin of the Atomic Scientists, February 25, 2019\n\n8 Denise Grady, “Deadly Germ Research Is Shut Down at Army Lab Over Safety Concerns,” The New York Times, August 5, 2019\n\n9 Denise Grady, “Deadly Germ Research Is Shut Down at Army Lab Over Safety Concerns,” The New York Times, August 5, 2019\n\n10 “Time to probe Fort Detrick biolab despite US hype: Global Times editorial, “Global Times, May 26, 2021\n\n11 Steven Lee Myers, “China Spins Tale That the U.S. Army Started the Coronavirus Epidemic,” The New York Times, March 13, 2020\n\n14 Lynn C. Klotz, Edward J. Sylvester, “The unacceptable risks of a man-made pandemic,” The Bulletin of the Atomic Scientists, August 7, 2012\n\n15 Lynn C. Klotz, Edward J. Sylvester, “The unacceptable risks of a man-made pandemic,” The Bulletin of the Atomic Scientists, August 7, 2012\n\n16 Carl Zimmer, James Gorman and Benjamin Mueller, “Scientists Don’t Want to Ignore the ‘Lab Leak’ Theory, Despite No New Evidence,” The New York Times, May 27, 2021\n\n18 Carl Zimmer, James Gorman and Benjamin Mueller, “Scientists Don’t Want to Ignore the ‘Lab Leak’ Theory, Despite No New Evidence,” The New York Times, May 27, 2021\n\n19 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021\n\n20 Michael D. Shear, Julian E. Barnes, Carl Zimmer and Benjamin Mueller, “Biden Orders Intelligence Inquiry Into Origins of Virus,” The New York Times, May 26, 2021\n\n21 Michael R. Gordon, Warren P. Strobel and Drew Hinshaw, “Intelligence on Sick Staff at Wuhan Lab Fuels Debate on Covid-19 Origin,” The Wall Street Journal, May 23, 2021\n\n22 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021\n\n23 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021\n\n24 Carl Zimmer, James Gorman and Benjamin Mueller, “Scientists Don’t Want to Ignore the ‘Lab Leak’ Theory, Despite No New Evidence,” The New York Times, May 27, 2021\n\n25 Julian E. Barnes and David E. Sanger, “U.S. Is Said to Have Unexamined Intelligence to Pore Over on Virus Origins,” The New York Times, May 27, 2021", "opengraph": {"site_name": "The Greanville Post", "title": "POLITICS OF THE WUHAN LEAK HYPOTHESIS: A scandal is being thuggishly covered up by a regime more interested in propaganda than human life | The Greanville Post", "description": "STEPHEN GOWANS—If this plays out as it has in the past, the news media will report that the US intelligence community has concluded that the Wuhan laboratory was the source of the pandemic. The key qualifier that the conclusion is based on no proof, will be quickly passed over and eventually forgotten, and the reality that the conclusion came from the intelligence community will be adduced as its substantiation, as if US spooks are impartial arbiters of all questions of consequence, and not part of a state apparatus that has a vested interest in discrediting a country Washington deems a near-peer competitor. Former CIA case officer Ralph McGehee’s view of his former employer suggests what outcome we can expect from Biden’s ‘find me some evidence’ order to the intelligence community. “The CIA is not now nor has it ever been a Central Intelligence Agency,” McGehee said. Instead, “it is the covert action arm of the president’s foreign policy advisers” whose role is “reporting ‘intelligence’ justifying” the president’s positions and activities. The CIA “shapes its intelligence … to support presidential policy.” McGehee concluded that disinformation is a large part of the intelligence community’s ambit, and the US population is “the primary target audience of its lies.”  ", "url": "https://www.greanvillepost.com/2021/06/04/a-scandal-is-being-thuggishly-covered-up-by-a-regime-more-interested-in-propaganda-than-human-life/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/02/Wuhan-lab-scientists.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2021/02/wuhan-Virology-Institute-345.jpg", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://www.nytimes.com/2020/05/01/us/politics/coronavirus-china-trump.html", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://nymag.com/intelligencer/article/coronavirus-lab-escape-theory.html", "https://thebulletin.org/2012/08/the-unacceptable-risks-of-a-man-made-pandemic/", "https://thebulletin.org/2019/02/human-error-in-high-biocontainment-labs-a-likely-pandemic-threat/#:~:text=Human%20error%20in%20high%2Dbiocontainment%20labs%3A%20a%20likely%20pandemic%20threat,-By%20Lynn%20Klotz&text=Incidents%20causing%20potential%20exposures%20to,Biosafety%20Level%203)%20and%20BSL4.", "https://nymag.com/intelligencer/article/coronavirus-lab-escape-theory.html", "https://www.nytimes.com/2014/07/20/science/pathogen-mishaps-rise-as-labs-proliferate-with-scant-regulation.html?searchResultPosition=5", "https://www.nytimes.com/2019/08/05/health/germs-fort-detrick-biohazard.html", "https://www.nytimes.com/2019/08/05/health/germs-fort-detrick-biohazard.html", "https://www.globaltimes.cn/page/202105/1224597.shtml", "https://www.nytimes.com/2020/03/13/world/asia/coronavirus-china-conspiracy-theory.html", "https://pubmed.ncbi.nlm.nih.gov/25482289/", "https://pubmed.ncbi.nlm.nih.gov/25482289/", "https://thebulletin.org/2012/08/the-unacceptable-risks-of-a-man-made-pandemic/", "https://thebulletin.org/2012/08/the-unacceptable-risks-of-a-man-made-pandemic/", "https://www.nytimes.com/2021/05/27/health/wuhan-coronavirus-lab-leak.html", "https://nymag.com/intelligencer/article/coronavirus-lab-escape-theory.html", "https://www.nytimes.com/2021/05/27/health/wuhan-coronavirus-lab-leak.html", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://www.greanvillepost.com/wp-content/uploads/2020/01/Pompeo-atMike.jpg", "https://www.nytimes.com/2021/05/26/us/politics/biden-coronavirus-origins.html", "https://www.wsj.com/articles/intelligence-on-sick-staff-at-wuhan-lab-fuels-debate-on-covid-19-origin-11621796228", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://www.nytimes.com/2021/05/27/health/wuhan-coronavirus-lab-leak.html", "https://www.nytimes.com/2021/05/27/us/politics/coronavirus-origins-intelligence.html", "https://www.nature.com/nrmicro", "https://www.nature.com/nrmicro", "https://thebulletin.org/biography/lynn-c-klotz/", "https://www.nytimes.com/by/james-gorman", "https://www.nytimes.com/by/carl-zimmer", "https://www.nytimes.com/by/james-gorman", "https://www.nytimes.com/by/benjamin-mueller", "https://www.nytimes.com/by/julian-e-barnes", "https://www.nytimes.com/by/david-e-sanger", "https://www.nytimes.com/by/julian-e-barnes", "https://www.nytimes.com/by/david-e-sanger", "https://www.nytimes.com/by/julian-e-barnes", "https://www.nytimes.com/by/david-e-sanger", "https://www.nytimes.com/by/carl-zimmer", "https://www.nytimes.com/by/james-gorman", "https://www.nytimes.com/by/benjamin-mueller", "https://www.nytimes.com/by/julian-e-barnes", "https://www.nytimes.com/by/david-e-sanger"], "authors": [], "publish_date": "June 4, 2021"}