{"result_id": "295025", "URL": "https://www.greanvillepost.com/2022/07/15/jimmy-dore-is-considering-running-for-president-he-could-win/", "timestamp": "2023-04-25 17:22:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2022/07/15/jimmy-dore-is-considering-running-for-president-he-could-win/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "Jimmy Dore is considering running for president. He could win.", "cleaned_text": "It’s a dark time in America. And it’s getting worse.\n\nMillions lack food and health care and live paycheck to paycheck. Poverty wages are now gutted by inflation. Eviction and homelessness sweep every city. Desperation is so deep it drives people to opioid addiction and mass murder-suicide. The looming fall of the dollar and depression. A dying empire is lashing out for war with not one but two nuclear powers. The major \"left-wing\" party in this country leading the charge for annihilation and censorship.\n\nThankfully, I and many others have recently found real hope and joy in the prospect that Jimmy Dore could run for president of the United States.\n\nJimmy has been considering a run for president with the People’s Party for the past several weeks. We’ve been discussing it with him and Stef and have developed a fifty-state campaign and ballot access plan with organizers and leading ballot access attorneys.\n\nThe crowds in Des Moines, Omaha and Kansas City erupted in cheers when Jimmy surprised everyone at his live stand-up shows last month and said, “I’m thinking of running for president,” and took townhall-style questions for the first time.\n\nThat weekend, Jackson Hinkle told him he should run for president live on Jimmy’s show and Jimmy said he’s considering it. Then Jimmy asked Chris Hedges what would happen if he was to run for president on air. And on June 3, I joined Jimmy and Stef in studio and told them and all of their supporters why he needs to run. We discussed it for the last half of the segment with Jackson and Kurt Metzger weighing in. The next day Jimmy uploaded the whole conversation to YouTube.\n\nJimmy would be the most popular comedian to ever run for president. He would be the first candidate with his own hugely popular online show — something that has only just now become possible due to the rise of the internet and independent media.\n\nWe believe that Jimmy could WIN.\n\nAnd not just by becoming president, but by consolidating and organizing a surging populist movement — the kind Ralph Nader described and predicted in his 2014 book, Unstoppable: The Emerging Left-Right Alliance to Dismantle the Corporate State.\n\nJimmy could win by using the campaign to organize direct actions. By building a major new populist party that realigns our politics along class, like the new parties breaking through in Latin America and Europe. By supporting strikes and giving a surging new generation of unions an alternative to co-optation and death in the Democratic Party. By showing people that billionaires are to blame instead of the poor. By showing us if change is possible within the electoral system. By striking fear into the hearts of the richest people on Earth and making them reconsider the wisdom of cruelly impoverishing so many. By showing millions of Americans what a leader with integrity looks like.\n\nThis is why Jackson said that Jimmy embodies the political realignment that is happening in this country and should run. It’s why Max Blumenthal told me that Jimmy’s campaign would give him hope. And it’s why Ralph Nader told Jimmy and me that he supports Jimmy running and would advise the campaign.\n\nJimmy comes from a big family in the South Side of Chicago, where he worked as a bricklayer and forklift driver. He’s starred in two Comedy Central Specials and built The Jimmy Dore Show with his wife Stef Zamorano, a former teacher and union leader. Stef, The Miserable Liberal, produces and stars on the show with him.\n\nThrough his show, Jimmy has consistently led and been right on issues like RussiaGate, the chemical attack in Syria, the DNC rigging a second election against Bernie Sanders, the CARES Act bailout for Wall Street, Covid vaccine mandates and lockdowns, Bernie’s spinelessness, the Squad’s careerism, and the need for a major new populist party free of corporate money.\n\nHis #ForceTheVote campaign reshaped US politics by exposing that even progressives like AOC are quickly corrupted by the Democratic Party. The People’s Party was the only major national organization to partner with Jimmy and demand a floor vote on Medicare for All in the middle of the pandemic.\n\nWhen Jimmy asked him about running on the show, Chris Hedges said the media would dredge up something he said or did, or allegedly said or did, and use it to attack him endlessly. He’s right, they would do this to any independent populist who truly challenges the corporate state, but as Ralph pointed out, we’re in a very different political and media age from when he ran in 2000.\n\nWe’ve been through two great recessions and a pandemic that were used to crush us and create super billionaires. People are working more, making less, and living worse. Faith in institutions has collapsed across society, including the major parties, the media, big business, the banks, the courts, and schools. Trust in government is at historic lows. The number of independents is at record highs. And a majority of Americans want a major new party and an independent candidate for president.\n\nThe corporate media is now so discredited that their attacks amount to free publicity and rally mass support. Trump and Rogan grew rapidly while being attacked by the media. If their attacks could make Trump president six years ago, despite him being the antithesis of his working class voters, imagine what they’ll do today for a no-bullshit comedian with real populist principles and policies. The way Jimmy triggers liberals is one of his greatest advantages. It gets people rooting for him. The more he’s attacked, the more people will tune into his show to see him shred the establishment.\n\nIn fact, the attacks are why Jimmy is such a great candidate. Comedy can laugh off and flip attacks more effectively than logic and facts. Comedy reduces the establishment to a joke and lets you entertain while you preach. That’s why the corporate media attacks against Jimmy have backfired and just made him more popular, including hit pieces by CNN and the Daily Beast.\n\nThe media also recycles the same attacks over and over against anyone who defies the establishment, making them trite and predictable. They’ll smear him as a conspiracy theorist, right winger, grifter, anti-vaxxer, racist, sexist, and try to #MeToo him again. But the more the media tries to demonize Jimmy, the more obvious it will become that they have no response to his message and are just trying to destroy someone who speaks for the working class. The more they attack him, the stronger he will become.\n\nEven without the corporate media coverage, Jimmy will have greater media reach than any independent candidate in modern history thanks to his show and other independent shows. He already has a million subscribers on YouTube and a half a billion views. He’s done shows with many other major podcasters like Joe Rogan, Russell Brand, and former UK Member of Parliament George Galloway, who just yesterday said that he supports Jimmy running.\n\nThe Bernie 2016 campaign set off a flourishing of independent media as people tuned in for campaign news that the corporate media wasn’t covering. Jimmy’s campaign would launch a second renaissance of independent media, with populist channels growing across many platforms, further replacing corporate media and increasing the movement’s resiliency against Big Tech censorship and deplatforming.\n\nThe absurdity of a jagoff comedian becoming president by being better than legions of \"serious\" politicians is the ultimate political statement that perfectly reflects the zeitgeist of this country. Liberals who try to attack him for being a comedian will immediately have to face that their ultimate global hero is a comedian who ran for president in Ukraine and won.\n\nA now-ubiquitous internet has also transformed organizing and empowered working class campaigns in unprecedented ways in the last 20 years.\n\nIndependent YouTube shows and podcasts rival and even exceed the viewership of corporate media. Social media lets us communicate and organize with people directly, bypassing traditional media gatekeepers. Smartphones and apps enable new kinds of mass canvassing. Online crowdfunding allowed Bernie to raise more than $200 million in small and recurring donations on each of his campaigns. Even with the suppression, we have tools that the movements and campaigns of the past could only dream of.\n\nFor years Jimmy and the People’s Party called for Bernie, AOC and progressive Democrats to leave the party and join us in starting a major new one free of corporate money. But after 18 months of selling out to Biden’s corporate war-mongering agenda, they are so thoroughly discredited that we don’t need or want them anymore. Jimmy’s campaign can give this country a real populist opposition party without them.\n\nJimmy is already bringing out thousands of people across every part of this country. At his shows you see young and old, men and women, right and left, people of every race and gender – a cross-section of America. His show has and is taking him to Buffalo, Tempe, Baltimore, Raleigh, Philadelphia, Houston, Addison, Orlando, Tampa, Columbus, Cleveland, Pittsburgh, Des Moines, Omaha, Kansas City, Los Angeles, Irvine, Honolulu, Denver, Salt Lake City, Las Vegas, Rosemont, Chicago, San Diego, Sacramento, Indianapolis, Louisville, Tulsa, Oklahoma City, Spokane, Tacoma, Virginia Beach, Richmond, Arlington, Miami, West Palm Beach, Portland, and more. This is what a nationwide revolution looks like!\n\nHis campaign tour could be even more incredible, potentially with figures like Chris Hedges, Cornel West, Susan Sarandon, Anya Parampil, Max Blumenthal, Chris Smalls, Medea Benjamin, Jackson Hinkle, Richard Wolff, and Aaron Mate joining him on the road, and in what is sure to be the most revolutionary White House cabinet in the history of this country.\n\nPresident Dore would have incredible power to change lives. He could use executive authority to its fullest extent on day one: wipe out student debt, end the war on terror, effectively legalize marijuana, enforce anti-monopoly rules, break up big banks, pardon whistleblowers like Assange and Snowden, use a form of eminent domain on Big Pharma patents to force them to lower drug prices, and reinvigorate the labor movement by prioritizing workplaces with collective-bargaining agreements for federal contracts.\n\nHe could wield the greatest bully pulpit in the world to excoriate Congress into doing its job and helping people. He could be the real organizer-in-chief, calling thousands of people to the streets of DC to protest Congress and their billionaire donors. He could convene special sessions of Congress, denying members of the House and Senate vacation until they give every American health care and a living wage. He could veto corporate legislation, forcing the establishment parties to team up to pass anything, further exposing them as Wall Street tools and setting them up to be further replaced by People’s Party members of Congress in 2026.\n\nHe could fight for an end to homelessness, expanded Social Security, an end to job-killing trade deals, free public college, a jobs guarantee, abolishing mass incarceration, free speech or nationalization for every social media platform, public funding of elections, and a multi-party system with ranked choice voting and proportional representation.\n\nCandidate and President Dore would move the working class from a perpetually reactive position to a proactive one. From powerlessness to revolution. All through one of the greatest and most enjoyable comedy tours of all time. As Matt Orfalea said, #Dore24 is a historic opportunity.\n\nThere couldn’t be a better time for his campaign. Despite holding the presidency and both houses of Congress, the Democrats have done nothing for working people. Biden has betrayed even his moderate campaign promises for a public option and $15 minimum wage. He ended the eviction moratorium, is hiking Medicare premiums and incrementally privatizing it, is selling off infrastructure to Wall Street, and let the child tax credit expire.\n\nBiden’s approval ratings are worse than Trump’s. Support for the Democratic Party is even crashing among Black and Latino voters. Just 33% of Americans approve of Biden’s job performance, including 49% of Black voters, 24% of Latinos, and 22% of 18-34-year-olds. Most people don’t even think he has the mental fitness for the job. The Democrats are facing huge losses in the midterms. And Trump also remains largely unpopular.\n\nIn fact, the corporate parties and candidates have become so profoundly disliked that if the working class doesn’t build a major new populist party free of corporate money, billionaires will create an astroturf version themselves to co-opt the half of the country that is now independent. France offers a preview of how elites respond after they milk the establishment parties for all they’re worth and run them into the ground. For decades the center-left Socialist Party was the largest party on the left in France. A few years ago it became so unpopular that elites formed a new neoliberal party, La République En Marche, and ran Emmanuel Macron for president. The ruse worked and Macron was elected president twice. There are indications that billionaires are already engineering such a ploy in the US.\n\nAs Jimmy told me, if non-voters were counted, they would win every presidential election in this country. He is the kind of unconventional, outrageous, principled and hilarious candidate who could inspire them to vote again. Voters already tried to elect populist outsiders in the primaries in both parties in 2016, Bernie and Trump, but the corporate parties will never allow truly anti-establishment candidates to win their primaries and run in the general election. The Democratic and Republican Parties have the power to simply refuse to list a candidate who threatens them on the ballot, and they’ve done it before.\n\nIn 2016 I believed in someone and gave every ounce of energy I had to elect him president. Then he betrayed me and millions of his supporters. He had the power to run [as an] independent, build a new party, and finally break this wretched system. But he sold out instead.\n\nWhen I walked out at Our Revolution after Bernie tried to take billionaire money — while he kept signing every email and T-shirt with “Paid For By Bernie Sanders, Not The Billionaires” — I never thought I would believe in anyone that way again.\n\nThe day after Trump won as a result of what the Democrats had done, I pulled over and wrote an article on my phone at a New Jersey rest stop saying that we need a major new party free of corporate money in this country. It was my goodbye letter to politics and the belief that things could change. I was giving up.\n\nBut the article went viral and hundreds of people reached out to me in every way enthusiastically saying, “yes we need this, how can we help.” And I said, “you’ve got the wrong person. I’m not a leader. And I’m burned out. Done with politics.” And they said, “that’s exactly why you have to do it. Because you don’t want to. Because you’ll do it for the right reasons.”\n\nI never thought I would believe in someone again like I had believed in Bernie, until I got to know Jimmy. And that’s why Jimmy Dore should run for president. Because so many thousands of us who thought we would never believe in anyone again believe in him. Everywhere Jimmy goes people tell him that he keeps them sane. Everywhere they bring him thoughtful personal gifts as a token of their appreciation. There’s only one other person I’ve ever seen inspire that kind of love and support and hope.\n\nThey call us nihilists and say we believe in nothing. But they’re wrong. We believe in Jimmy’s integrity. We believe in his outrage. And we believe that with him and Stef, we can change this country.\n\nYou can reach the People's Party here:\n\n https://peoplesparty.org/\n\n https://www.facebook.com/peoplespartyusa", "opengraph": {"site_name": "The Greanville Post", "title": "Jimmy Dore is considering running for president. He could win. | The Greanville Post", "description": "NICK BRANA—The corporate media is now so discredited that their attacks amount to free publicity and rally mass support. Trump and Rogan grew rapidly while being attacked by the media. If their attacks could make Trump president six years ago, despite him being the antithesis of his working class voters, imagine what they’ll do today for a no-bullshit comedian with real populist principles and policies. The way Jimmy triggers liberals is one of his greatest advantages. It gets people rooting for him. The more he’s attacked, the more people will tune into his show to see him shred the establishment.", "url": "https://www.greanvillepost.com/2022/07/15/jimmy-dore-is-considering-running-for-president-he-could-win/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2022/07/Jimmy-Dore-show-scaled.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greanvillepost.com/wp-content/uploads/2022/06/NickBrana-DN.jpg", "https://youtu.be/ZzMV9miZksk", "https://www.thedailybeast.com/these-dirtbag-left-stars-are-flirting-with-the-far-right", "https://peoplesparty.org/", "https://www.facebook.com/peoplespartyusa"], "authors": [], "publish_date": "July 15, 2022"}