{"result_id": "295011", "URL": "https://www.greanvillepost.com/2021/12/11/the-assange-case-is-the-us-defending-its-right-to-lie-notes-from-the-edge-of-the-narrative-matrix/", "timestamp": "2023-04-25 17:22:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.greanvillepost.com/2021/12/11/the-assange-case-is-the-us-defending-its-right-to-lie-notes-from-the-edge-of-the-narrative-matrix/", "encoding": "UTF-8"}, "image": null, "domain": "www.greanvillepost.com", "title": "The Assange Case Is The US Defending Its Right To Lie: Notes From The Edge Of The Narrative Matrix", "cleaned_text": "Listen to a reading of this article:\n\nhe Assange case is the most powerful government in the world defending its right to lie to you.\n\nQ: What’s the difference between how the US deals with journalists it hates and how Saudi Arabia deals with journalists it hates?\n\nThe US is currently building a network of long-range missile systems on a chain of islands near China’s coast for the explicit purpose of threatening China. You can tell who is the aggressor in US-China tensions by asking yourself what would happen if this situation was reversed.\n\nPer Washington’s own logic it would be perfectly reasonable, and indeed responsible, for China to set up military arsenals along both US coastlines to “contain” it and “deter” attacks on Latin American nations, as the US has an extensive history of launching such attacks and will surely try to again. But we all know what the US response to such behavior would be.\n\nIt’s a bit annoying living in a world that’s ruled by a dying empire whose increasing desperation to retain control could lead it to initiate a dangerous military confrontation with a major power at any time.\n\nThe rise of China crashing into the Washington doctrine that US unipolar hegemony must be preserved at all cost is an unstoppable-force-meets-immovable-object situation that could very easily end in nuclear Armageddon.\n\nIf the preservation of US unipolar hegemony requires continually escalating military brinkmanship against nuclear-armed Russia and China as well as powerful forces like Iran, then the claim that US unipolar hegemony makes the world a more peaceful place is plainly false.\n\nYou currently have a much higher chance of dying as a result of a nuclear war instigated by your government or its allies than as a result of someone else refusing to take a Covid vaccine. You hear about the latter threat but not the former because the mass media exist to protect imperialist agendas from scrutiny.\n\nYou know you’re getting scammed when your government ends a long and expensive war and then the military budget goes up.\n\nThere is no sector of US government policy more significant and consequential than the command of the most powerful military force ever assembled. There is also no sector of US government policy with less oversight, accountability, or press scrutiny.\n\nBesides a brief window after 9/11 the US has never really been able to sell the narrative that governments it wants to ramp up aggression against are about to attack its easily-defended shores. So instead it does ridiculous things like claiming those governments are about to invade Ukraine and Taiwan.\n\nThe US empire never attacks, it only “defends”. All its aggressions are always about “defending” freedom and democracy, “defending” human rights, “defending” nations that can’t defend themselves, etc. Often it even “defends” preemptively, before the attacker has done anything. Sometimes the attacker is the last to find out that they were planning an attack.\n\nEver since getting our eviction notice I’ve struggled to be creative because my mind is so focused on the daunting task of finding a nice yet affordable place for my family to live, and it really makes me feel for everyone for whom housing security is a chronic creativity drain. All to pay for the privilege of living on the fucking planet we were fucking born on.\n\nI mean, think about how much creativity and innovation our species is missing out on because our dopey, primitive societal models force people to spend so much brainpower just figuring out how to stay fed and housed. That brainpower could have gone toward improving our world.\n\nReally I’m just a mother. I’m just a mum who wants a healthy planet and a healthy society for her kids, and I advocate the things I believe will facilitate that. You can add whatever -ists and -isms you want on top of that, but my true ideology is motherhood.\n\nRight now being smart and informed is a detriment to happiness because things are shitty and the more you understand the harder it is to be happy. Once we create a healthy world this will reverse; the more you understand about the world the more uplifted and optimistic you’ll be.", "opengraph": {"site_name": "The Greanville Post", "title": "The Assange Case Is The US Defending Its Right To Lie: Notes From The Edge Of The Narrative Matrix | The Greanville Post", "description": "CAITLIN JOHNSTONE—Besides a brief window after 9/11 the US has never really been able to sell the narrative that governments it wants to ramp up aggression against are about to attack its easily-defended shores. So instead it does ridiculous things like claiming those governments are about to invade Ukraine and Taiwan. The US empire never attacks, it only “defends”. All its aggressions are always about “defending” freedom and democracy, “defending” human rights, “defending” nations that can’t defend themselves, etc. Often it even “defends” preemptively, before the attacker has done anything. Sometimes the attacker is the last to find out that they were planning an attack.", "url": "https://www.greanvillepost.com/2021/12/11/the-assange-case-is-the-us-defending-its-right-to-lie-notes-from-the-edge-of-the-narrative-matrix/", "type": "article", "image": "https://www.greanvillepost.com/wp-content/uploads/2021/12/Assange-extradition-to-the-US-protest.jpg", "article:section": "AMERICAN BRAINWASH", "article:publisher": "https://www.facebook.com/facebook"}, "tags": [], "tweets": [], "movies": [], "links": ["https://soundcloud.com/going_rogue/the-assange-case-is-the-us-defending-its-right-to-lie", "https://soundcloud.com/going_rogue", "https://soundcloud.com/going_rogue/the-assange-case-is-the-us-defending-its-right-to-lie", "https://asia.nikkei.com/Politics/International-relations/Indo-Pacific/US-to-build-anti-China-missile-network-along-first-island-chain", "https://news.antiwar.com/2021/03/05/us-pacific-commander-chief-defends-27-billion-plan-to-confront-china/", "https://www.greanvillepost.com/wp-content/uploads/2021/12/Assange-extradition-to-the-US-protest.jpg", "https://caitlinjohnstone.com/2021/11/17/renting-sucks/", "https://scholar.harvard.edu/files/sendhil/files/976.full_.pdf"], "authors": [], "publish_date": "December 11, 2021"}