{"result_id": "296001", "URL": "https://healthranger.com/", "timestamp": "2023-04-25 17:23:21 CEST+0200", "meta": {"description": "Mike Adams (aka the \"Health Ranger\") is a pro-liberty, pro-America, pro-life author, inventor, publisher, prepper, podcaster and platform architect for free speech platforms.", "lang": "en", "keywords": "Mike Adams, Health Ranger, Bio, Podcast, Laboratory, Books", "favicon": "//www.healthranger.com/Images/favicon.ico", "canonical": "https://healthranger.com/", "encoding": "utf-8"}, "image": null, "domain": "healthranger.com", "title": "Mike Adams the Health Ranger", "cleaned_text": "Mike Adams (aka the \"Health Ranger\") is a pro-liberty, pro-America, pro-life author, inventor, publisher, prepper, podcaster and platform architect for free speech platforms. Adams publishes NaturalNews.com (a health freedom news site) and founded HealthRangerStore.com, an online retailer of laboratory tested clean foods, superfoods, nutritional supplements and personal care solutions. As part of his work in promoting and protecting free speech, Adams founded Brighteon.com (a free speech video platform), launched Brighteon.social (a free speech alternative to Twitter), created Brighteon.TV (a live streaming news and commentary platform with 50+ hosts), launched BrighteonRadio.com (an audio stream platform with 12+ additional hosts) and is currently developing several additional projects to support free speech and independent voices around the world.\n\nAdams is well known for his daily \"Situation Update\" podcast on Brighteon which features a comedy-infused overview of the day's most important news and trends, spanning energy, finance, culture, prepping, medicine, science and more.\n\nOn the science side, Adams is a published analytical scientist and the founder a lab director of CWC Labs, an ISO-accredited clean foods laboratory specializing in mass spec analysis of heavy metals, pesticides, herbicides and microbiology. He is the co-developer of a mass spec method to quantitate cannabinoids from hemp extracts using LCMS without requiring post-column derivatization. Adams holds two patents with the U.S. Patent and Trademark Office, called \"Cesium Eliminator\" (an invention that removes radioactive cesium isotopes from the human body) and \"Heavy Metals Defense\" (an invention that binds with dietary heavy metals to speed their elimination from the body.\n\nAdams is the author of the book Food Forensics, which reached #1 in science books on Amazon.com. He has already published six additional audio books which are being published in paperback, including Survival Nutrition and Resilient Prepping. His audio books are given away freely, and downloads are available at: https://Audiobooks.NaturalNews.com\n\nFor telling the truth about vaccines, prescription drug dangers, global depopulation and natural nutritional cures for degenerative disease, Adams has been one of the most heavily censored persons in the world and was deplatformed from all conventional platforms in 2015 - 2016. Accused of successfully building a \"content empire\" by the controlled corporate media, Adams' analysis has proven correct again and again, often many years in advance. Adams was among the very first to warn that covid vaccines would kill large numbers of people and cause widespread infertility and population reduction - claims that have since been proven to be entirely accurate.\n\nAdams is known for pledging profits to small alternative media publishers and recently oversaw the distribution of $150,000 to alt media platforms. He is also known for offering free promotions for small American businesses in his podcast.", "opengraph": {"type": "website", "site_name": "HealthRanger.com", "title": "Mike Adams the Health Ranger", "description": "Mike Adams (aka the \"Health Ranger\") is a pro-liberty, pro-America, pro-life author, inventor, publisher, prepper, podcaster and platform architect for free speech platforms.", "url": "//www.healthranger.com", "image": "//www.healthranger.com/Images/SocialImage.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["//www.naturalnews.com", "//www.healthrangerstore.com", "brighteon.com", "//www.brighteon.social", "//www.brighteon.tv", "//www.brighteonradio.com", "//www.brighteon.com/channels/hrreport", "//www.cwclabs.com", "//www.brighteonbooks.com/product/food-forensics-the-hidden-toxins-lurking-in-your-food-and-how-you-can-avoid-them-for-good-health", "//audiobooks.naturalnews.com"], "authors": [], "publish_date": null}