{"result_id": "297009", "URL": "https://www.thehealthyamerican.org/classes/p/state-laws-for-new-jersey", "timestamp": "2023-04-25 17:23:29 CEST+0200", "meta": {"description": "You get a well-researched comprehensive list and description of your state \r\nand federal laws that protect you from discrimination.\r\n\r\nYou also get the name and address of the state agency that handles civil \r\nrights complaints in your state.\r\n\r\nPlus, additional laws that protect you from being discriminated against, \r\nfalse imprisonment, false charges of arrest and more!\r\n\r\nInstant .pdf download.\r\n\r\n(Link expires 24 hours after first download, so save it to your computer.)\r\n\r\nThese laws are to educate you, your loved ones and businesses. We ask that \r\nyou do not embed on any website without written permission. Thank you for \r\nyour support.", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/classes/p/state-laws-for-new-jersey", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "NEW JERSEY State and Federal Laws — THE HEALTHY AMERICAN.org", "cleaned_text": "You get a well-researched comprehensive list and description of your state and federal laws that protect you from discrimination.\n\nYou also get the name and address of the state agency that handles civil rights complaints in your state.\n\nPlus, additional laws that protect you from being discriminated against, false imprisonment, false charges of arrest and more!\n\nThese laws are to educate you, your loved ones and businesses. We ask that you do not embed on any website without written permission. Thank you for your support.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "NEW JERSEY State and Federal Laws — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/classes/p/state-laws-for-new-jersey", "type": "product", "description": "You get a well-researched comprehensive list and description of your state and federal laws that protect you from discrimination.  You also get the name and address of the state agency that handles civil rights complaints in your state.  Plus, additional laws that protect you from being discriminate", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/5f2e592e36afb473e473f785/6035242fb0fe0037ab16a4d9/1614095409461/Screen+Shot+2021-02-23+at+7.49.55+AM.png?format=1500w", "image:width": "428", "image:height": "259", "product:price:amount": "20.00", "product:price:currency": "USD", "product:availability": "instock"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}