{"result_id": "297027", "URL": "https://www.thehealthyamerican.org/freedom-learning-1", "timestamp": "2023-04-25 17:23:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/freedom-learning-free-sample-class", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "BETTER THAN HOMESCHOOLING -- FREEDOM LEARNING! —", "cleaned_text": "WHAT you will learn:\n\nThe philosophy, approach and opportunities for Freedom Learning “Outside the Box” How to say no to textbooks, no to boring worksheets, no to remote learning…\n\nHow to say yes to discovery, yes to exploration, yes to fun!\n\nHow to take the next step in our three-tiered Freedom Learning “Outside the Box” Certificate Program!\n\nWHY do you need this information?\n\nImagine you and your child starting the day fresh and excited, curious and eager to discover and explore amazing opportunities for natural learning!\n\nImagine feeling confident and relaxed, competent and accomplished, knowing your kids are in the best situation and circumstances where they can thrive!\n\nImagine your kids engaged and enthusiastic, teaching YOU about their discoveries and experiments as they excel and grow!\n\nImagine running your own learning group — or even your own learning center, and we show you exactly how to do so!\n\nHOW can you apply this information?\n\nReaffirm your commitment to providing superior learning alternatives for your child\n\nOversee and facilitate your own child’s real-life learning; or\n\nDevelop a learning group / co-op / pod of like-minded parents, or teach your own group; or\n\nCreate your own learning center, based on a blueprint that can help you launch your own business!\n\nNOTE: These ideas above will be covered in detail in upcoming modules in the Freedom Learning “Outside the Box” Certificate Program\n\nWHO is teaching this class:\n\nPeggy Hall, founder of THE HEALTHY AMERICAN and former Director of Education at the University of California, Irvine Extension with a speciality in teaching teachers how to teach.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "BETTER THAN HOMESCHOOLING -- FREEDOM LEARNING! — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/freedom-learning-free-sample-class", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5f7c0c9e8a0d711d1d68414e/1591988015216/school-kids-healthyamerican-peggy-hall.jpg?format=1500w", "image:width": "1100", "image:height": "712"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}