{"result_id": "297024", "URL": "https://www.thehealthyamerican.org/medical-rights", "timestamp": "2023-04-25 17:23:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/medical-rights", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "Your Medical Rights — THE HEALTHY AMERICAN.org", "cleaned_text": "Have you been discriminated against because you do not wear a mask and refuse to get tested? Did you know you have MEDICAL RIGHTS that may not be denied? Learn all the details about the PATIENT’S BILL OF RIGHTS, what to do before you get medical care, what to do if you or a lived one are denied care, and how and where to file complaints so you can get the protection and relief you are due.\n\nThis 3-hour seminar includes a video and documents you can download and use, and adapt to your own medical situation. You get a detailed complaint letter that you can use in any situation, whether at a hospital, clinic, eye doctor, dentist, etc. Learn exactly where and how to file complaints with which agencies and how to STOP the UNLAWFUL DISCRIMINATION in your medical care!\n\nIMPORTANT: After your purchase, you will get:\n• None an automatic receipt for your purchase\n• None another email with the link to the online course and resources\n\nCHECK YOUR SPAM OR TRASH IF YOU DON’T SEE THE EMAIL with the link to the online course.\n\nYour email provider may not recognize this email address (peggy@thehealthyamerican.org) so be sure to check spam or trash folders if you don’t see the email with the link to the online course.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "Your Medical Rights — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/medical-rights", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5fc44db8fa04221c71a8c633/1592257049474/Healthy-American-no-mask.jpg?format=1500w", "image:width": "1100", "image:height": "619"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}