{"result_id": "297023", "URL": "https://www.thehealthyamerican.org/the-healthy-american-story", "timestamp": "2023-04-25 17:23:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/the-healthy-american-story", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "THE HEALTHY AMERICAN Story — THE HEALTHY AMERICAN.org", "cleaned_text": "In March of 2020, when the governor of CA shut things down, deeming certain people and businesses “non-essential,” I knew things weren’t right.\n\nAfter being told on Friday, March 13 by my two government employers (where I was contracting as an instructor for community education) to no longer show up for work because I was “non-essential,” I posted a comment on Facebook that simply said, “Life is cancelled until further notice.”\n\nLittle did I know how true that would turn out to be.\n\nLike many, I was excoriated for my views, where I expressed compassion for all the millions who would be harmed through no fault of their own.\n\nI was concerned for my water fitness who would be denied their choice to exercise; for the homeless who certainly would not be able to do physical distancing or masking (so why was I being forced to do so?); for the children and animals who would likely be at the hands of abusers who had reached their breaking point; for people trying to put food on the table for their family; for those being denied crucial medical care; for the elderly and incapacitated in nursing homes-turned-prisons.\n\nCertainly everyone could see there was train wreck that was about to happen, right?\n\nSadly, certain friends and family members who I had thought were clear-minded and compassionate turned out to be closed-minded and caustic.\n\nSo rather than focus on the emotional rollercoaster of trying to convince others that there were NO facts regarding the science of this “outbreak,” I focused on researching the irrefutable back-and-white laws that would either provide the authority — or not — for imposing such unconstitutional, liberty-stealing and life-threatening measures.\n\nYou see, when someone tells me to do something, I don’t say “OKAY” — instead, I ask “WHY?”\n\nAs a researcher and writer with hundreds of published articles in health and learning, I love to dig deeper. I go straight to the source and do not rely on the media for my information.\n\nAha! It turns out there is NO authority for such sweeping, suffocating, unconstitutional, unethical and immoral measures. Zero, none, not a one.\n\nAnd that is called tyranny. Yes: exercising power without legal authority is called tyranny. And the person seizing such power without legal authority is called a tyrant.\n\nOur Republic form of government in the United States does not allow for tyrants, or one-man rule.\n\nNo one person can make a law.\n\nAnd certainly, no health officer can make a law.\n\nLaws are only made by a law-making body such as your state legislature, your county board or your city council. No one person can proclaim anything — emergency or not — whereby it becomes law.\n\nI was astonished and outraged that these tyrants across the country were getting away with murder.\n\nYes, literally murder. Countless individuals have died in this chaos, not because of a mystery “virus” but because of despair, of not receiving life-saving medical treatment, of drug overdoses, of abuse, of suicide.\n\nGrowing tired of arguing with people on Facebook, where I was posting original research on the data of past flu seasons that showed there was NO pandemic, epidemic or even outbreak that could ever reach the nature of a true “emergency,” I decided to do what I do best, and EDUCATE others.\n\nGOING VIRAL AND HITTING A NERVE WITH FREEDOM-LOVING PEOPLE\n\nOn May 6, 2020, I created a youtube video titled, “STATE OF EMERGENCY IN CALIFORNIA IS INVALID AND UNLAWFUL,” which got nearly 2 million views across different social platforms until it was pulled of of youtube.\n\nI re-uploaded that viral video to my HEALTHY AMERICAN youtube channel, which I created in order to post that first video. My youtube channel has since grown to over 135+ in-depth, well-researched videos designed to educate, inspire and empower you to take positive action. Please join us and subscribe there! My backup channel is on Bitchute, where I recommend you also subscribe.\n\nThus, I created THE HEALTHY AMERICAN website as a resource to educate people on how to research laws, learn about civil rights, and how to take action to defend truth and freedom.\n\nThis movement has grown to hundreds of thousands of HEALTHY AMERICANS across this country and all over the world — because the American spirit is one of freedom, and that flame burns brightly in the hearts of so many, regardless of location.\n\nTHE HEALTHY AMERICAN is a culmination of my life’s experience,\n\npassion and purpose\n\nWith my background as an educator for 30+ years with a focus in communications and health, with a degree in political science, and a master’s degree in international policy studies, I’ve been a life-long advocate for the underdog, literally — as I’ve been involved in animal rescue, outreach and advocacy for my entire life.\n\nWhen all this nonsense started, my discernment radar went on high alert and my research supported what my intuition indicated: there is NO lawful authority for any of these government measures at any level of government — regardless of any declared emergency.\n\nThat means the state government is acting unlawfully, the county governments are acting unlawfully, the city governments are acting unlawfully, the school boards and acting unlawfully and likely even your local homeowner’s association and employment unions are acting unlawfully.\n\nAlong with the government tyrants are the corporate tyrants, deeming themselves medical experts and law enforcement officers, denying law-abiding people their free and equal access to places of public accommodation, as required by state and federal laws in the United States.\n\nFree and peaceable law-abiding citizens are being denied entry into grocery stores to put food on the table? In THE UNITED STATES OF AMERICA?!\n\nI will not stand for this, and I know you won’t either.\n\nBuilding on my research and my three pillars of connection, education and action, thousands of HEALTHY AMERICANS have take action with these encouraging results:\n\n—> We are helping many people get successful RELIGIOUS EXEMPTIONS from their college and employer\n\n—> The unlawful mask mandate was reversed in Orange County, CA.\n\n—> We stopped the dreaded vaccine passport program in Orange County, CA!\n\n—> We got the USPS to admit IN WRITING that they will not refuse service to mask-free customers.\n\n—> Those horrible “wash your hands, stay home, save lives” highway signs are down in most places around the country.\n\n—> Several counties are terminating their unlawful local health emergencies.\n\n—> Lawsuits are being filed against retailers, schools, medical clinics and governments. Please donate if you can help us in this fight.\n\n—> Thousands of businesses are defying these unlawful orders and are staying open lawfully. See my OPEN FOR BUSINESS educational seminar here to learn or educate others on their rights as business owners or customers who want to shop freely, without harassment.\n\n—>Thousands of children and their families are thriving with my FREEDOM-LEARNING approach to education, which works for all ages, and all situations, regardless if you are a single parent or working parent. No experience needed, and your kids will excel beyond your imagination, while loving what they are learning!\n\n—> We are inspiring FREEDOM COMMUNITIES with thousands of HEALTHY AMERICANS with networks of support in areas such as legal education, emotional support, prayerful support, homeschool support, medical professionals network, and more!\n\n—> After my series of videos pointing out that “No governor can make a law,” I got the Governor of CA to admit on camera that he “can’t mandate anything!”\n\nNone of these successes could be possible without your support.\n\nThe purpose and function THE HEALTHY AMERICAN is to help people connect with others for support, educate themselves and others on our laws and rights, and to take positive action to defend life, liberty, truth and freedom.\n\nThe tagline of THE HEALTHY AMERICAN is “Breathing Life Back into Liberty!”\n\nWill you join us?\n\nWe need “All Hands on Deck!” to turn this ship around and turn the tide back from tyranny.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "THE HEALTHY AMERICAN Story — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/the-healthy-american-story", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5faf6f3a54d7bd32bafeff10/1589961431057/Healthy-American-Peggy-Hall-flag-in-sand.jpg?format=1500w", "image:width": "1200", "image:height": "745"}, "tags": [], "tweets": [], "movies": [], "links": ["https://youtu.be/SrmqsEwsZ0A", "https://www.youtube.com/channel/UCwC7VpIHS2uJzJ0q5I11oQA", "https://www.bitchute.com/channel/bWZSESyGIP2E/", "https://www.thehealthyamerican.org/subscribe", "/peggys-story", "/religious-exemption-letter", "/documents", "/donate", "/business-help", "/freedom-learning", "/donate"], "authors": [], "publish_date": null}