{"result_id": "297041", "URL": "https://www.thehealthyamerican.org/employee-rights-on-demand", "timestamp": "2023-04-25 17:23:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/employee-rights-on-demand", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "Employee Rights - Covid —", "cleaned_text": "(3) Letter to request religious accommodation from employer click here\n\n(4) Getting an exemption from your employer for masks/testing/vaccines click here\n\n(5) Protection for Religious Freedom in the workplace click here\n\n(6) Sample religious letter to your employer (editable in word doc) click here\n\n(6) Religious Discrimination in the workplace click here\n\nExcerpt from document:\n\nMaking an exception to dress and grooming rules\n\nWhen an employer has a dress or grooming policy that conflicts with an employee’s religious beliefs or practices, the employee may ask for an exception to the policy as a reasonable accommodation. Religious grooming practices may relate, for example, to shaving or hair length. Religious dress may include clothes, head or face coverings, jewelry, or other items. Absent undue hardship, religious discrimination may be found where an employer fails to accommodate the employee’s religious dress or grooming practices.\n\nSome courts have concluded that it would pose an undue hardship if an employer was required to accommodate a religious dress or grooming practice that conflicts with the public image the employer wishes to convey to customers. While there may be circumstances in which allowing a particular exception to an employer’s dress and grooming policy would pose an undue hardship, an employer’s reliance on the broad rubric of “image” to deny a requested religious accommodation may amount to relying on customer religious bias ( “customer preference”) in violation of Title VII. There may be limited situations in which the need for uniformity of appearance is so important that modifying the dress code would pose an undue hardship. However, even in these situations, a case-by-case determination is advisable.\n\nReligious harassment in violation of Title VII occurs when employees are: (1) required or coerced to abandon, alter, or adopt a religious practice as a condition of employment\n\n(8) New OSHA Emergency Regulations for CA click here\n\n(9) NEW! EEOC Guidelines for employers click here\n\nSee excerpts below from the EEOC Guidelines:\n\n“K.4. Where can employers learn more about Emergency Use Authorizations (EUA) of COVID-19 vaccines? (12/16/20)\n\nSome COVID-19 vaccines may only be available to the public for the foreseeable future under EUA granted by the FDA, which is different than approval under FDA vaccine licensure. The FDA has an obligation to:\n\nThe FDA says that this information is typically conveyed in a patient fact sheet that is provided at the time of the vaccine administration and that it posts the fact sheets on its website. More information about EUA vaccines is available on the FDA’s EUA page. “\n\nK.6. If an employer requires vaccinations when they are available, how should it respond to an employee who indicates that he or she is unable to receive a COVID-19 vaccination because of a sincerely held religious practice or belief? (12/16/20)\n\nOnce an employer is on notice that an employee’s sincerely held religious belief, practice, or observance prevents the employee from receiving the vaccination, the employer must provide a reasonable accommodation for the religious belief, practice, or observance unless it would pose an undue hardship under Title VII of the Civil Rights Act. Courts have defined “undue hardship” under Title VII as having more than a de minimis cost or burden on the employer. EEOC guidance explains that because the definition of religion is broad and protects beliefs, practices, and observances with which the employer may be unfamiliar, the employer should ordinarily assume that an employee’s request for religious accommodation is based on a sincerely held religious belief. If, however, an employee requests a religious accommodation, and an employer has an objective basis for questioning either the religious nature or the sincerity of a particular belief, practice, or observance, the employer would be justified in requesting additional supporting information.\n\nK.7. What happens if an employer cannot exempt or provide a reasonable accommodation to an employee who cannot comply with a mandatory vaccine policy because of a disability or sincerely held religious practice or belief? (12/16/20)\n\nIf an employee cannot get vaccinated for COVID-19 because of a disability or sincerely held religious belief, practice, or observance, and there is no reasonable accommodation possible, then it would be lawful for the employer to exclude the employee from the workplace. This does not mean the employer may automatically terminate the worker. Employers will need to determine if any other rights apply under the EEO laws or other federal, state, and local authorities.\n\n(10) FDA information about “authorized” vs approved click here", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "Employee Rights - Covid — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/employee-rights-on-demand", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5ec4ba9622e75637b50991b8/1589951129230/real+american+logo.jpg?format=1500w", "image:width": "800", "image:height": "800"}, "tags": [], "tweets": [], "movies": [], "links": ["/s/EMPLOYEE-RIGHTS.pdf", "/s/Employee-Rights-Chat.pdf", "/s/LETTER-TO-REQUEST-RELIGIOUS-ACCOMMODATION.pdf", "/s/GETTING-AN-EXEMPTION-FROM-YOUR-EMPLOYER.pdf", "/s/PROTECTION-FOR-RELIGIOUS-FREEDOM-IN-THE-WORKPLACE.pdf", "/s/LETTER-TO-REQUEST-RELIGIOUS-ACCOMMODATION.docx", "https://www.eeoc.gov/laws/guidance/questions-and-answers-religious-discrimination-workplace#q1", "/s/FEDERAL-LAWS-PROHIBITING-DISCRIMINATION-IN-THE-WORKPLACE.pdf", "/s/OSHA-NEW-REGS.pdf", "https://www.eeoc.gov/wysk/what-you-should-know-about-covid-19-and-ada-rehabilitation-act-and-other-eeo-laws", "https://www.fda.gov/vaccines-blood-biologics/vaccines/emergency-use-authorization-vaccines-explained", "https://www.fda.gov/vaccines-blood-biologics/vaccines/emergency-use-authorization-vaccines-explained", "https://www.eeoc.gov/laws/guidance/questions-and-answers-religious-discrimination-workplace", "https://www.eeoc.gov/wysk/what-you-should-know-about-covid-19-and-ada-rehabilitation-act-and-other-eeo-laws#exclude", "https://www.fda.gov/vaccines-blood-biologics/vaccines/emergency-use-authorization-vaccines-explained"], "authors": [], "publish_date": null}