{"result_id": "297011", "URL": "https://www.thehealthyamerican.org/success-stories", "timestamp": "2023-04-25 17:23:30 CEST+0200", "meta": {"description": "Use these comprehensive documents for religious exemption success with your \r\nemployer, school, organization or other purpose", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/success-stories", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "How to get a religious exemption for employer or college — THE HEALTHY AMERICAN.org", "cleaned_text": "“I just wanted to write a BIG thank you! Today is my son's first day of college as a Freshman! That is a big deal in itself, but what makes it more special is that he is ON CAMPUS!!!!!! We live in the communist state of New Jersey. All the colleges here required \"the shot\" for all students, faculty, and staff. We struggled with this for a year worrying when it should be a time of joy. We stopped worrying when we found The Healthy American! RELIGIOUS EXEMPTION GRANTED. I learned so much from this program. We will continue to use the tools you gave us and continue to give us for all aspects of our lives. You gave us the confidence to question EVERYTHING! Keep fighting Peggy and team. You ARE making a huge difference! God Bless You and The Best is Yet to Come!!!!” - Greta L. I am writing you, Peggy, and David to thank you all from the bottom of my heart! Last month, I was formally granted my religious exemption from the horrific (and deeply un-Constitutional, un-Nuremburg, Un-UNESCO) New York City Vaccine Mandate! Thanks to the amazing legal guidance and spiritual empowerment my participation in the Concierge program provided me, I was able to write a pretty fearsome document with great conviction and confidence. I was also able to conduct a thoroughly pleasant \"limited inquiry\" meeting with the head of HR, Corporate Counsel, and assistant head of HR; a pretty intimidating group of people to meet with! Thanks to the HA team, I was able to proceed in peace, power, and security in my knowledge of my God-given, American legal rights! I never even mentioned Title VII because I knew that my organization was WELL-AWARE of rights. They were banking on my ignorance of my own legal and employment rights. I can't tell you what a blessing my affiliation with HA has been! I am horrified by the numbers of people who are suffering and being terminated by employers right now because they weren't as fortunate as me to have learned their legal rights or subscribe to the Healthy American! I am planning to leave my current employment for a better opportunity in the near future. But again, I cannot thank the team and Peggy and David enough! I'm thrilled to continue to peruse the Healthy American content and watch Peggy's videos. It's been an ABSOLUTE BALM to my soul! God bless you good-hearted legal and spiritual warriors! — Sincerely, N.W.\n\nAfter MONTHS of waiting to see if my religious accommodation was approved or not, I finally got my approval today. This whole situation has been awful and mentally draining and taxing! Couldn’t have done this without your help and guidance. To everyone that is waiting. It’s worth the fight, your religious rights and freedoms matter. Thank you. - S. Thank you for the education that you provided regarding the federal laws that protect my sincerely held religious belief. My employer (Raytheon) at first asked only 3 questions. Once I submitted my response, then the employer sent me 5 page forum with about 50+ questions for me to answer about my sincerely held religious belief. If it was not for your education that you provide I would have been overwhelmed with these 50+ questions and would have just quit and started looking for other job. But your education equipped me to answer these questions in accordance with the law, and my vaccine exemption was granted. -Max K.\n\nI am one of 160,500 unvaccinated municipal city employees out of a total of 330,000 who are under Mayor Bill Deblasio's mandate to get vaccinated. I work for the New York City Department of Health & Mental Hygiene. After listening to your free material over the summer and joining your Concierge service on October 25th, I submitted my religious exemption on the deadline Wednesday, October 27th or I would have faced Leave Without Pay (LWOP) status. Your teachings, videos and love filled me with such confidence and banished my doubts. God led me to you both and I am so grateful that He did. After weeks of enduring stress over the prospect of losing my job, I received approval for my religious exemption today. I share this with you as a practitioner of a yoga meditation path that includes an integration of Christianity and Hinduism with meditation as the practice. Please know that you are in my prayers. You are truly a blessed couple.\n\nI don't even know how to thank YOU!! My son and I made the investment in your program and watched your videos. After submitting his religious exemption letter to his local community college, it was granted! But it didn't stop there. One of my dear friends who is a Kaiser nurse was about to lose her job. She initially received a \"provisional approval\" as you know and had to respond within 3 days. So, we decided that this was the time to go all out. In 11 hours we tailored a 2 page letter in response to their questions and then let our faith take over. I happened to check my email at an unusual time the following day and saw that you were doing a livestream for Kaiser employees. You instilled confidence in us and lo and behold, my friend received her approval which is \"valid until further notice.\" She can keep her job after working at Kaiser for almost 14 years and continue to support her 2 children. I know we're just a couple of grains of sand on the beach of everyone you've helped but in our eyes, \"the worth of a soul is great in the sight of God.\" Thank you from the depths of my heart for helping me help my son and my friend. You are an angel. Thank you for speaking up, teaching us all down here in the ranks, and for helping us all come together in our testimonies of God and our freedoms. There really are more that are with us than against us. God Bless You and we will continue to fight and spread the word.\n\nI can't say how much your work means to me. I am no longer scared and intimidated by my employer and I am helping others to be strong also. GOD BLESS YOU and your team and keep you strong for all of us. ~ Sherry H I want to thank The Healthy American for having our backs in regards to religious exemption education. I just received my approval for exemption on 9/1/2021. I work at a hospital and love my job, coworkers, and patients. I thought I knew about the laws, but after listening to Peggy and her husband, I realized, \"I don't know jack.\" It was definitely worth it having you professionals guide us. If you are unsure if this is the right fit for you, I urge you to pray over this and do what is best for you and your family. For me and my family-this was a great investment as I kept my job and can continue serving patients at my facility until I am called to move. Thank you Healthy American for all you have done, it is truly appreciated!\n\n“I would cry after every vaccine and TB test…”\n\nPastor David,\n\nI wanted to reach out and express how much your ministries have changed my life. I’ve been following your ministries for a year and a half now and I can’t thank you enough. Prior to finding your ministry I had no clue about my religious rights. I have declined vaccinations in the past but the last 5 years I had lost all hope and gave into the yearly vaccines against my will against what the Holy Spirit has told me. I had been defying my God and my own power. I would cry after every vaccine and TB test. Thanks to your ministries my eyes have been spread wide open and I now listen to our God with no fear of losing what I have. I am not defined by what I have no longer or by a job. I have learned all I need Is my faith in God and to keep my temple as pure as I can and he will provide. Your ministries came into my life by a patient I was caring for and again thank you for helping me reconnect and now I am Born again and no one will ever touch my body or inject my body with things I don’t believe in.\n\n“Although I cannot tell you much about what my son does for the army, he has invested a great deal of blood, sweat, and tears in training and three deployments for this country. He is, in fact, a Christian and was about to face the September mandate UNTIL I sent him all your religious exemption education. He submitted the request, they accepted it, and thus will keep his job at this point. So, I just wanted to say thank you and to let others know that there can be success in this process. It was a very small price for this education compared to the BIG price he would have had to have paid with the alternative of losing his job. Thank you for all you do. I would ask that you not use my name should you choose to share this with your viewers and I certainly would not be hurt if you didn't. My heart is overflowing; I so wanted to say God bless you and your husband.”\n\n“I’m an assistant principal in a large school district, and I wanted to thank you. I submitted my documents for religious exemption and I am going to be accommodated to be able to continue working remotely and not have to get a covid test or vaccine. Thank you for all of your support and work.” — M. Williams Thank you very much for being an instrument through which God has provided both wisdom and self-empowerment to others! — Michael S. You both are such a rich blessing in my life right now! I pray for both of you May the Lord God bless Peggy and Pastor David richly! We love you both! — David Custer I’m so grateful for the both of you! Thank you for pouring into all of us!!! — Pam Brown Such great information!!! Thank you guys so much for giving us hope — Deanna Catchatoorian God bless you Peggy for your efforts. —Franz Santander This means so much to me. Thank you for All you do! May our Lord bless you always. — Gina Y’all are doing Gods work! we just found you all and truly are Godsent. THANK YOU!!! —Ms. P Thank you!!! I really appreciate everything you guys are doing for us — Wendy Monreal Thank you Peggy for educating us! —Lorraine WA here, So glad The Healthy American is here in these times of such challenge. I walk my spiritual path. — Gee Thank you Peggy and David! God bless you for empowering and educating others! — E Johnson This is worth every penny. Thank you guys. MY ATTORNEY SAYS MY LETTER IS VERY GOOD — Laura Garcia I refer so many others to your website! — Deanna C. CLICK TO GET HELP WITH YOUR RELIGIOUS EXEMPTION", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "How to get a religious exemption for employer or college — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/success-stories", "type": "website", "description": "Use these comprehensive documents for religious exemption success with your employer, school, organization or other purpose", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/61267a5e27d0ad14e5fb9a1c/1594623766934/The-Healthy-American-Peggy-Hall-Banner.jpg?format=1500w", "image:width": "1200", "image:height": "776"}, "tags": [], "tweets": [], "movies": [], "links": ["/religious-exemptions"], "authors": [], "publish_date": null}