{"result_id": "297036", "URL": "https://www.thehealthyamerican.org/statement-of-purpose", "timestamp": "2023-04-25 17:23:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/statement-of-purpose", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "\"MASK-FREE\" INFO CARDS for Businesses and Individuals —", "cleaned_text": "The Healthy American exists to provide education and information to inspire others to take positive action to defend truth and liberty.\n\n1. We focus on \"Education and Inspiration\" to activate others to get involved. We are not protesting on people's front lawns, instigating violent protests or threatening others. While we are passionate and committed to the principles of truth, freedom and liberty, we strive to act with professionalism and empathy so we don't poke holes in the ship with negativity and intimidation.\n\n2. Our main areas of focus are:\n\n(a) Understanding the laws and policies affecting us related to masks/distancing/contact tracing/vaccines.\n\n(b) Staying informed on the ever-changing health orders and guidelines.\n\n(c) Contacting government representatives and public servants with our concerns and developing allies within government organizations.\n\n(d) Educating school administrators, business establishments and individuals as to their right, roles, and responsibilities.\n\nAt this time we are not involved with issues related to BLM, Antifa, or fundraising for political candidates. There are other groups and efforts addressing these issues.\n\n3. This is not a political action group, but a grass-roots community awareness group. At this time, THE HEALTHY AMERICAN is organized as an educational and consulting services business under the umbrella of a Limited Liability Company (LLC) registered in the state of California. We are a not-for-profit in that 100% of financial support goes directly to keeping this ship afloat in terms of running the website, research, outreach, video production and networking.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "\"MASK-FREE\" INFO CARDS for Businesses and Individuals — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/statement-of-purpose", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5f136a7b3546c13c465bad2b/1589961817967/Healthy-American-Peggy-Hall-Bill-of-Rights.jpg?format=1500w", "image:width": "1100", "image:height": "512"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}