{"result_id": "297038", "URL": "https://www.thehealthyamerican.org/classes/p/legal-federal-religious-exemption-ks-lazrg-5y9ss-a5yxs-228am-xfgs4-ehle4-grles-tz9km-8xr6x-8292s-62nfp-xnage-fadyl-bggmf-xl27p-8zdtk", "timestamp": "2023-04-25 17:23:49 CEST+0200", "meta": {"description": "This is an informational and educational document that states your legal, \r\nfederal, religious exemption based on the authority of state and federal \r\nlaws. It does not guarantee your entrance into any establishment, although \r\nmany people use it for that purpose.\r\n\r\nThis document can be used to communicate and notify business owners, \r\nmerchants, managers, agents and others of your rights, protected, secured \r\nand guaranteed by law, including your right to FREE and EQUAL access to any \r\nbusiness establishment of any kind, whatsoever.\r\n\r\nNOTE: This is not designed for you to use or file with your employer. To \r\nnotify your employer of your legal, federal, religious exemption, go here \r\nfor info: https://www.thehealthyamerican.org/religious-exemptions\r\n\r\nIMPORTANT INFORMATION:\r\n\r\n(1) This document will be automatically available for immediate download \r\nupon purchase.\r\n\r\n(2) Print it out, and fill out the portion with your name and details.\r\n\r\n(3) NOTE! DO NOT SIGN THE DOCUMENT UNTIL YOU ARE IN FRONT OF THE NOTARY \r\nPUBLIC.\r\n\r\n(4) Take the document to a Notary Republic and sign it in the Notary’s \r\npresence.\r\n\r\n(5) Place your document in a plastic sleeve protector.\r\n\r\n(6) OPTIONAL: Clip the document (in the sleeve protector) on a clipboard \r\nand carry that with you into places of public accommodation to present to \r\nanyone who is requiring you to wear a mask or show proof of vaccines.\r\n\r\nWe have spent hours researching and creating this document and thank you \r\nfor your purchase, as it helps us continue to do this important work of \r\ncreating “tools against tyranny.” We cannot do it without your support.\r\n\r\nThis version references federal laws and laws in the STATE OF KANSAS. More \r\nstates are being added, so check back soon.", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/classes/p/legal-federal-religious-exemption-ks-lazrg-5y9ss-a5yxs-228am-xfgs4-ehle4-grles-tz9km-8xr6x-8292s-62nfp-xnage-fadyl-bggmf-xl27p-8zdtk", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "LEGAL FEDERAL RELIGIOUS EXEMPTION (KS) — THE HEALTHY AMERICAN.org", "cleaned_text": "This is an informational and educational document that states your legal, federal, religious exemption based on the authority of state and federal laws. It does not guarantee your entrance into any establishment, although many people use it for that purpose.\n\nThis document can be used to communicate and notify business owners, merchants, managers, agents and others of your rights, protected, secured and guaranteed by law, including your right to FREE and EQUAL access to any business establishment of any kind, whatsoever.\n\nNOTE: This is not designed for you to use or file with your employer. To notify your employer of your legal, federal, religious exemption, go here for info: https://www.thehealthyamerican.org/religious-exemptions\n\n(1) This document will be automatically available for immediate download upon purchase.\n\n(2) Print it out, and fill out the portion with your name and details.\n\n(3) NOTE! DO NOT SIGN THE DOCUMENT UNTIL YOU ARE IN FRONT OF THE NOTARY PUBLIC.\n\n(4) Take the document to a Notary Republic and sign it in the Notary’s presence.\n\n(6) OPTIONAL: Clip the document (in the sleeve protector) on a clipboard and carry that with you into places of public accommodation to present to anyone who is requiring you to wear a mask or show proof of vaccines.\n\nWe have spent hours researching and creating this document and thank you for your purchase, as it helps us continue to do this important work of creating “tools against tyranny.” We cannot do it without your support.\n\nThis version references federal laws and laws in the STATE OF KANSAS. More states are being added, so check back soon.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "LEGAL FEDERAL RELIGIOUS EXEMPTION (KS) — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/classes/p/legal-federal-religious-exemption-ks-lazrg-5y9ss-a5yxs-228am-xfgs4-ehle4-grles-tz9km-8xr6x-8292s-62nfp-xnage-fadyl-bggmf-xl27p-8zdtk", "type": "product", "description": "This is an informational and educational document that states your legal, federal, religious exemption based on the authority of state and federal laws. It does not guarantee your entrance into any establishment, although many people use it for that purpose.  This document can be used to communicate", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/5f2e592e36afb473e473f785/6283f3c212c0c646eef4d446/1661201132788/KS_RE.png?format=1500w", "image:width": "1080", "image:height": "1080", "product:price:amount": "29.00", "product:price:currency": "USD", "product:availability": "instock"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}