{"result_id": "297046", "URL": "https://www.thehealthyamerican.org/how-to-win-in-court", "timestamp": "2023-04-25 17:23:54 CEST+0200", "meta": {"description": "Can't find a lawyer to take your case? Can't afford one? Learn how I did to \r\nprepare for a win in court. This is the exact program I am using to learn - \r\nand it's EASY and step-by-step.", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/how-to-win-in-court", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "HOW TO WIN IN COURT — THE HEALTHY AMERICAN.org", "cleaned_text": "NEW! This is the program I am studying to get ready for the lawsuit I am filing against the county and the health officer.\n\nCLICK HERE to get the world's best \"HOW TO WIN IN COURT\" Law Course! Why go to law school when you can learn it here? This amazing course is teaching me how to win my case in court. It's easy to follow (opens in new website)\n• None Can’t find a lawyer who will take your case?\n• None Do you want to find out how I have learned what I know about the law?\n\nClick to order now — even if you don’t have a case in court yet.\n\nThis is an amazing resource class — and you learn it step-by step!\n\nTake the mystery out of the law and court… and learn EXACTLY what you need to do to win your case.\n\nOne of the tips I learned (about the importance of referencing APPELLATE COURT RULINGS) is more than worth the cost of this course!\n\nLearn like I am doing as preparing for my case against the government (County Board of Supervisors and Health Officer).\n\nOrder \"HOW TO WIN IN COURT\" today and be smarter by tomorrow!", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "HOW TO WIN IN COURT — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/how-to-win-in-court", "type": "website", "description": "Can't find a lawyer to take your case? Can't afford one? Learn how I did to prepare for a win in court. This is the exact program I am using to learn - and it's EASY and step-by-step.", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/611b624d60a9ed2e90fccaff/1594623766934/The-Healthy-American-Peggy-Hall-Banner.jpg?format=1500w", "image:width": "1200", "image:height": "776"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.HowToWinInCourt.com?refercode=HP0040", "https://www.HowToWinInCourt.com?refercode=HP0040", "https://www.HowToWinInCourt.com?refercode=HP0040"], "authors": [], "publish_date": null}