{"result_id": "297045", "URL": "https://www.thehealthyamerican.org/classes/state-laws", "timestamp": "2023-04-25 17:23:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://images.squarespace-cdn.com/content/v1/5ec33703d876e52434d8b91c/1610257604641-P2G6XSK58UJPDH9CXZAZ/favicon.ico?format=100w", "canonical": "https://www.thehealthyamerican.org/classes", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "State Laws — Healthy American Classes and Products — THE HEALTHY AMERICAN.org", "cleaned_text": "The information provided on this website does not, and is not intended to, constitute legal advice; instead, all information, content, and materials available on this site are for general informational and educational purposes only. Information on this website may not constitute the most up-to-date legal or other information. This website contains links to other third-party websites. Such links are only for the convenience of the reader, user or browser are not under the control of The Healthy American.\n\nReaders of this website should contact their attorney to obtain advice with respect to any particular legal matter. No reader, user, or browser of this site should act or refrain from acting on the basis of information on this site without first seeking legal advice from counsel in the relevant jurisdiction. Only your individual attorney can provide assurances that the information contained herein – and your interpretation of it – is applicable or appropriate to your particular situation. Use of, and access to, this website or any of the links or resources contained within the site do not create an attorney-client relationship between the reader, user, or browser and website authors and contributors. The material and images on this website are protected by copyright and may not be used without permission.", "opengraph": {"site_name": "THE HEALTHY AMERICAN.org", "title": "State Laws — Healthy American Classes and Products — THE HEALTHY AMERICAN.org", "url": "https://www.thehealthyamerican.org/classes", "type": "website", "image": "http://static1.squarespace.com/static/5ec33703d876e52434d8b91c/t/5fb9db4b13fa9636584e1fd2/1606015831123/Healthy+American+postcard+-+front.png?format=1500w", "image:width": "1500", "image:height": "970"}, "tags": [], "tweets": [], "movies": [], "links": ["/terms-conditions", "/privacy-policy", "/refund-policy", "/statement-of-purpose", "/pre-contact"], "authors": [], "publish_date": null}