{"result_id": "297039", "URL": "https://www.thehealthyamerican.org/campaigns/view-campaign/HWLXZZAwlPERopfXAy2n-nf76s7OWU3ZkHaWKCsnHkDO3LKtmX9Ps6Qz1TwuPwV-rPBAa8L-mzLc15sSEiy0CaMUhLwOKQfh", "timestamp": "2023-04-25 17:23:50 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "", "canonical": "https://www.thehealthyamerican.org/campaigns/view-campaign/HWLXZZAwlPERopfXAy2n-nf76s7OWU3ZkHaWKCsnHkDO3LKtmX9Ps6Qz1TwuPwV-rPBAa8L-mzLc15sSEiy0CaMUhLwOKQfh", "encoding": "utf-8"}, "image": null, "domain": "www.thehealthyamerican.org", "title": "THANKSGIVING RECAP + NEW EVENTS COMING UP!", "cleaned_text": "Stay tuned for a fun video recap of the event…coming very SOON!! For now, enjoy a few of the photos of the incredible time we had! Be sure to join us for a future event! A big thank you to the helpers, including Nari, Claudia, Linda, Rosalba, Gregg for the music, Russ, Anthony, Mark, Pastor David… and all who drove near and far to join us! We had a wonderful event with over 200 in attendance! We had Healthy Americans join us from Florida, Texas, Colorado, Nevada, Arizona -- as well as from Orange County, San Diego, San Bernardino, Coachella Valley, the Inland Empire, Los Angeles, Ventura and San Jose. Patriots included folks from all walks of life, including small business owners, pastors, parents, teens and tots -- and dogs! We started the afternoon saying the Pledge of Allegiance, focusing on the meaning of each word in the pledge. We shared our definitions and importance of liberty, freedom and justice for all. The weather was perfect, the assembly peaceful, and we enjoyed exercising our 1st Amendment Rights. We feasted comfort food such as deep fried turkey, mac-n-cheese, mashed potatoes and pies... served family style! We were pleased to see a Sheriff's deputy nearby, and we offered him a plate of delicious food. Everything unfolded without incident. Several patriots gave supportive messages of encouragement. Pastor David Hall (my husband) gave the invocation, Mark Durham shared how to get petitions signed to recall Gavin Newsom, Anthony Rose talked about connecting patriots locally, and Russ Taylor encouraged Californians to ignore the unlawful 10:00 pm curfew (and to join his California Curfew Breakers group). I read from the Declaration of Independence, gave a mini-lesson about the Constitution and celebrated the recent court rulings reaffirming our God-given rights. Thank you for sharing your photos, as well! I’ll add more to the website events page, so if you don’t see the one you sent it, I’ll be adding it shortly! IF YOU HAVE BEEN DENIED MEDICAL CARE, you have got to watch this online seminar, which I will teach LIVE online on Friday December 4 at 2:00 pm Pacific Time. Whether you can make it at that time or not, you will get the recording to keep forever, along with all the valuable documents, exact how-to’s, letters, and step-by-step actions to defend your medical rights and how to fight back if they are violated! Click here to register now! Discover what it means to be personally prepared for uncertain times ahead. Learn how to put together a personal “Go Bag,” and what items you can’t leave out! Develop confidence and situational awareness to deal with the unexpected! Trained professionals will deliver high-impact value, and you’ll leave with valuable know-how for the days ahead. This is an in-person live event hosted by Peggy Hall and special guests Eric DiLeo and the team at United Defense Tactical. CLICK HERE TO REGISTER, so you never have to feel vulnerable again! Learn all the ins-and-outs of your EMPLOYEE RIGHTS in this jam-packed online LIVE seminar with Peggy Hall. You get all the documents plus sample letters to send to your HR department. Find out about exemptions, and why a medical exemption might be a mistake — and what to do instead. This seminar will be taught live on Tuesday, December 29, at 2:00 pm Pacific, and the recording is yours to keep forever. In a separate email, you will get the link to watch the video live after you register for this event. And the recording is yours to keep forever. What a wonderful time I had this last week where I was the featured speaker for the Santa Clarita Republican Women Federated! I LOVE speaking to community groups to encourage, educate and empower more people to take positive action against this tyranny that is growing at a break-neck speed! Friends — be sure you connect with like-minded PATRIOTS in local groups! Search online for political groups, community groups, and ask friends and neighbors for recommendations! Let me know if you’d like me to speak at your next event! I post new videos just about everyday on Youtube. The videos are later uploaded to THE HEALTHY AMERICAN channels on Bitchute, Brand New Tube and Brighteon. I am the most active commenting on Youtube. I will always create free content for as long as these free platforms allow. In order to protect my content from censorship, I will be adding a private, paid platform for those who want additional EXCLUSIVE, uncensored premium content. Coming soon! I’m very GRATEFUL for all of you writing in with your support and prayers and stories of success! I could not do it without your support! Thank you to those who have donated so I can keep doing this work, which I am dedicated to do. I will never stop. EVER. P.S. I am also archiving my newsletters so you can GO HERE to READ past issues of the Newsletter. I have added them since September and will continue to add all of them, so keep checking back. Reading past issues of THE HEALTHY AMERICAN newsletters will give you an EXCELLENT and comprehensive understanding of your God-Given rights, and the laws that protect them.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thehealthyamerican.org/products?tag=Medical%20Rights", "https://www.thehealthyamerican.org/https:/www.thehealthyamerican.org/news-and-events/personal-prepping", "https://www.thehealthyamerican.org/products?tag=Personal%20Prepping", "https://www.thehealthyamerican.org/https:/www.thehealthyamerican.org/news-and-events/online-seminar-employee-rights", "https://www.thehealthyamerican.org/products?tag=EMPLOYEE%20RIGHTS", "https://www.youtube.com/channel/UCwC7VpIHS2uJzJ0q5I11oQA", "https://www.bitchute.com/channel/bWZSESyGIP2E/", "https://brandnewtube.com/@TheHealthyAmericanPeggyHall", "https://www.brighteon.com/channels/thehealthyamericanpeggyhall", "https://www.thehealthyamerican.org/take-action", "https://www.thehealthyamerican.org/subscribe"], "authors": [], "publish_date": null}