{"result_id": "298006", "URL": "https://theheartysoul.com/court-order-employees-reinstated-no-comply-mandate/", "timestamp": "2023-04-25 17:24:00 CEST+0200", "meta": {"description": "The New York City Supreme Court ordered that employees fired because of vaccine mandates should be reinstated with back pay.", "lang": "en", "keywords": "", "favicon": "https://theheartysoul.com/wp-content/themes/theme/assets/images/logo/favicon.ico", "canonical": "https://theheartysoul.com/court-order-employees-reinstated-no-comply-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "theheartysoul.com", "title": "Judge orders NYC to reinstate workers fired for not complying with COVID vaccine mandate", "cleaned_text": "During the pandemic, New York City implemented a vaccine mandate that resulted in the firing of 1,700 employees. Many of those fired were police officers and firefighters. On October 25, however, the New York Supreme Court ordered that those employees all be rehired – and that they receive back pay. This is why.\n\nNew York Supreme Court Says Employees Fired Because Of Mask Mandate Must Be Reinstated\n\nEarlier this year, a New York City vaccine mandate meant that many workers were fired because they did not want to receive the vaccine. In total about 1,700 employees were let go, including firefighters and police officers. When vaccine mandates were lifted, New York City Mayor Eric Adams also said that employees fired because of their vaccine status would not be reinstated. Interestingly enough, however, the Mayor made allowances for unvaccinated athletes and performers. Upon hearing this, FDNY-Uniformed Firefighters Association President Andrew Ansbro and FDNY-Uniformed Fire Officers Association President Lt. James McCarthy called on the city to extend this exception to, well, all citizens of New York City.\n\n\n\n“We support the revocation of the mandate for the athletes and performers that work in New York City. We think that the people that work for New York City should also have the mandate relocated for them.” McCarthy said. (1)\n\n\n\nAnsbro agreed: “If you’re going to follow the science, science is going to tell you there isn’t any danger right now, and putting hundreds of firefighters, police officers and other emergency workers out of work is not in the best interest of the city. It’s not safe.”\n\nTheir call was answered, not by the city, but by the New York Supreme Court. Not only did they say that all employees fired over the vaccine mandate be reinstated, but they also said that these employees should receive back-pay. The reason for the decision, the court said, is because of the new evidence that shows that the vaccine doesn’t actually stop transmission of the virus. What it does is protect you from having a severe case should you get it, if you experience any symptoms at all.\n\n\n\n“Being vaccinated does not prevent an individual from contracting or transmitting COVID-19,” said Judge Ralph J. Porzio. (2)\n\n\n\nThe judge continued to say that his judgment is not to say that the vaccine is not useful or important. He still agrees that the vaccine has helped and continues to help save lives from the COVID-19 virus. The reason why vaccine mandates went into effect, however, was because people were under the impression that the non-vaccinated could spread the illness whereas the vaccinated could not. We now know, however, that this is not the case. Both groups can spread the illness, just one group may experience more severe symptoms than the other.\n\nA Different Decision Based On The Same Facts\n\nNaturally, there was also the question of fairness brought into play. Why were athletes and performers allowed to work while essential workers, such as police officers, firefighters, and others, were not? Judge Porzio called the action of firing important workers such as these people “arbitrary and capricious”. He also said the order violated the rights of city workers “who showed up to work, at great risk to themselves, during the pandemic”. He even went so far as to call it “unconstitutional”. In regards to the discrepancy between city employees and athletes and performers, Judge Porzio wrote this in his decision:\n\n\n\n“The Mayor, in issuing his executive order no. 62, made a different decision for similarly situated people based on identical facts. There is nothing in the record to support the rationality of keeping a vaccination mandate for public employees, while vacating the mandate for private sector employees or creating a carveout for certain professions, like athletes, artists, and performers. This is clearly an arbitrary and capricious action because we are dealing with identical unvaccinated people being treated differently by the same administrative agency.”\n\n\n\nKeep Reaidng: Doctors Still Struggle to Diagnose a Condition That Kills More Americans Than Stroke\n• “New York Supreme Court reinstates all employees fired for being unvaccinated, orders backpay” Fox News. October 25, 2022.\n• Supreme Court of the State of New York. October 24, 2022.", "opengraph": {"locale": "en_US", "type": "article", "title": "Judge orders NYC to reinstate workers fired for not complying with COVID vaccine mandate", "description": "The New York City Supreme Court ordered that employees fired because of vaccine mandates should be reinstated with back pay.", "url": "https://theheartysoul.com/court-order-employees-reinstated-no-comply-mandate/", "site_name": "The Hearty Soul", "article:publisher": "https://www.facebook.com/theheartysoul", "article:author": "https://www.facebook.com/TheTasteArchives/", "article:published_time": "2022-11-08T02:31:09+00:00", "article:modified_time": "2022-11-08T02:31:10+00:00", "image": "https://theheartysoul.com/wp-content/uploads/2022/11/10242022_part04_61fb.jpg", "image:width": "1200", "image:height": "630"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/us/new-york-supreme-court-reinstates-all-employees-fired-being-unvaccinated-orders-backpay", "https://eddsa.blob.core.usgovcloudapi.net/public/85163_2022_George_Garvey_et_al_v_City_of_New_York_et_al_DECISION___ORDER_ON_37.pdf", "https://theheartysoul.com/doctors-struggle-to-diagnose-sepsis/", "https://www.foxnews.com/us/new-york-supreme-court-reinstates-all-employees-fired-being-unvaccinated-orders-backpay", "https://eddsa.blob.core.usgovcloudapi.net/public/85163_2022_George_Garvey_et_al_v_City_of_New_York_et_al_DECISION___ORDER_ON_37.pdf"], "authors": [], "publish_date": "2022-11-08T02:31:09+00:00"}