{"result_id": "298003", "URL": "https://theheartysoul.com/holland-first-countr-zero-stray-dogs/", "timestamp": "2023-04-25 17:23:56 CEST+0200", "meta": {"description": "Holland's stray dogs were a huge problem. Now, they have none. This is how they ended dog homelessness without euthanization.", "lang": "en", "keywords": "", "favicon": "https://thepremierdaily.com/wp-content/themes/theme/assets/images/logo/favicon.ico", "canonical": "https://thepremierdaily.com/holland-breaks-record-as-first-country-ever-to-have-zero-stray-dogs/", "encoding": "UTF-8"}, "image": null, "domain": "theheartysoul.com", "title": "Holland breaks record for first country ever to have zero stray dogs", "cleaned_text": "The World Health Organization estimates that there are over 200 million stray dogs worldwide. Though some will say fixing this is impossible, Holland’s stray dogs will tell you otherwise. The Dutch nation has become the first country to successfully eradicate dog homelessness. This is how they did it.\n\nHolland’s Stray Dogs Now All Have Happy Homes\n\nHolland might not be the first country you think of when you think about places with homeless dog problems, but they certainly did. In the 1800s, having a dog was a status symbol in Dutch homes. The more dogs you had, the better. An outbreak of rabies in the 1900s, however, caused many people to abandon their pets, leaving them to fend for themselves on the streets. (1)\n\nRoaming free, these animals of course mated and multiplied. Fast forward to the 21st century, and Holland’s stray dogs were everywhere. Finally, officials decided it was time to do something about the problem. (1, 2)\n\nTo find a solution to the stray dog problem without culling (selective slaughter to reduce an animal population), a team of people came together. This team included (1, 2):\n\nWorking together, they came up with a comprehensive plan to make Holland completely free of stray dogs.\n\nRead More: Blue dogs seen roaming near abandoned Russian chemical factory\n\nThe largest contributing factor to the proliferation of the homeless dog population in Holland was procreation. Two dogs have a litter of puppies, the puppies that survive into adulthood then go off and have their own litters, and the cycle continues. \n\nHolland implemented a strict sterilization program for all stray dogs across the country. In just a few months over 75% of this population had been neutered so that far fewer puppies were being born on the streets. \n\nEach neutered dog was then put through a comprehensive check-up and received all necessary vaccinations that they did not receive as puppies. This was to control the spread of rabies and other diseases. (1, 2)\n\nLegislation to protect dogs and other animals was a necessary step in preventing dogs from being abandoned and abused.\n\nAn animal welfare legislation was put into effect that granted all animals, including strays, the right to live a quality life. If anyone is caught breaking the new laws, they could be fined up to $16,000 and spend up to three years behind bars. (1, 2)\n\nOf course, you need a team of people to enforce the new laws or it won’t have an impact. For this, Holland created a special domestic animal task force to enforce the new laws and investigate reports of anyone who may be breaking them. (1, 2)\n\nLegislation was also put into place which increased the taxes on store-bought pets. The goal here was to encourage people to adopt instead of buying from a pet store or breeder and to make operations such as puppy mills less lucrative for people to run. (1, 2)\n\nThe last objective, of course, was to find homes for all the formerly homeless dogs. The Dutch put on country-wide campaigns that encouraged people to adopt instead of purchasing from a breeder. (1, 2) They showed people that when you adopt a dog you are rescuing it from a life of abuse, neglect, and hunger. You are giving it something that it was previously unable to have: a loving home.\n\nWe’re All In This Together\n\nThe thing that made this campaign so successful was that the government and the citizens worked together to solve this problem, rather than against each other. Today, 90% of Holland’s population own dogs that are loved and cared for, and over 1 million dogs have been rescued from the streets. (1, 2)\n\nCongratulations, Holland! Perhaps other places in the world can take note and follow suit.\n\nKeep Reading: Dogs are Born with Ears and Tails. They Should Get to Keep Them\n• ‘How did the Netherlands manage to become the first country to have no stray dogs?’ Dutch Review Freya Sawbridge. Published August 18, 2020.", "opengraph": {"locale": "en_US", "type": "article", "title": "Holland breaks record for first country ever to have zero stray dogs", "description": "Holland's stray dogs were a huge problem. Now, they have none. This is how they ended dog homelessness without euthanization.", "url": "https://thepremierdaily.com/holland-breaks-record-as-first-country-ever-to-have-zero-stray-dogs/", "site_name": "The Premier Daily", "article:published_time": "2021-04-23T20:47:23+00:00", "article:modified_time": "2021-04-23T20:47:41+00:00", "image": "https://thepremierdaily.com/wp-content/uploads/2021/04/holland.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.pasadenastarnews.com/2019/11/25/imagine-a-world-with-no-stray-dogs-holland-did-it-heres-how/", "https://www.pasadenastarnews.com/2019/11/25/imagine-a-world-with-no-stray-dogs-holland-did-it-heres-how/", "https://dutchreview.com/culture/society/how-did-the-netherlands-manage-to-become-the-first-country-to-have-no-stray-dogs/", "https://dutchreview.com/culture/society/how-did-the-netherlands-manage-to-become-the-first-country-to-have-no-stray-dogs/", "https://thepremierdaily.com/blue-dogs-abandoned-russian-chemical-factory/", "https://thepremierdaily.com/dogs-should-keep-ears-and-tails/", "https://www.pasadenastarnews.com/2019/11/25/imagine-a-world-with-no-stray-dogs-holland-did-it-heres-how/", "https://dutchreview.com/culture/society/how-did-the-netherlands-manage-to-become-the-first-country-to-have-no-stray-dogs/"], "authors": ["Julie Hambleton"], "publish_date": "2021-04-23T20:47:23+00:00"}