{"result_id": "298001", "URL": "https://theheartysoul.com/bus-terminal-opens-doors-shelter-stray-dogs/", "timestamp": "2023-04-25 17:23:54 CEST+0200", "meta": {"description": "A bus terminal has opened up its doors to shelter stray dogs from bad weather conditions. Here's what you can do to help stray dogs too.", "lang": "en", "keywords": "", "favicon": "https://theheartysoul.com/wp-content/themes/theme/assets/images/logo/favicon.ico", "canonical": "https://theheartysoul.com/bus-terminal-opens-doors-shelter-stray-dogs/", "encoding": "UTF-8"}, "image": null, "domain": "theheartysoul.com", "title": "Bus Station Opens Its Doors to Stray Dogs so They Have a Warm Place to Stay", "cleaned_text": "With winter fast approaching it’s not just humans that are looking to escape the cold. Animals everywhere are cozying up for warmth in any way that they are able to, even if it means sleeping in unexpected places with the help of some kind-hearted humans. One bus terminal has opened its doors to stray dogs in need.\n\nIn a large act of kindness, employees at the Barreirinha bus terminal in Curitiba, Brazil opened their doors and provided food, water, and shelter to a few local stray dogs that were searching for a place to lay their heads. Not only that, but the employees also provided the dogs with beds made out of old tires covered in blankets. They named the dogs Max, Pitoco, and Zoinho.\n\nFabiane Rosa, a local politician and animal lover sent praise to the bus station for their selfless act, and had this to say on Facebook:\n\n“Congratulations to the terminal staff, everyone understands that these angels are there and have a right to be. So many companies in Curitiba could follow this example, adopting a pet. Of course, it is not the ideal, but at least there are those who are looking after them.”\n\nStray Dogs – a Growing Problem In the U.S.\n\nThere is no way to know exactly how many stray dogs there are worldwide, but the current estimation is believed to be over 500 million stray dogs[2]. Of that number, approximately 3.3 million dogs enter shelters in the United States, and while the number is declining, 670,000 of those dogs are still being euthanized due to lack of space and funding in the shelters[3].\n\nNot only do stray dogs live without a family to care for them, but they often also live with infections and diseases with no means of treatment. Rabies is common in many stray animals and is spread to people through bites or scratches. In up to 99% of rabies cases, dogs are responsible for transmission of rabies to humans[4], yet rabies is preventable through proper vaccination of pets, which stray dogs rarely receive.\n\nRead More: Animal Shelter Creates ‘Real-Life’ Living Room for Dogs to Show off Their Personalities\n\n\n\nHow You Can Help Keep Dogs Off the Street\n\nIf your household is ready to accept a new furry member of the family, seriously consider adopting a dog from your local animal shelter instead of buying from a breeder. Unfortunately, the first few months after the winter holidays see a surge of returned pets who were gifted to family members unwisely.\n\nIf you aren’t able to provide a long-term home to a pet, you can also consider fostering. Many animal shelters rely on foster families with animal experience to help provide loving homes for strays until an appropriate permanent family is found.\n\nThe best way pet owners can help minimize the problem of stray dogs and cats who aren’t being cared for is to prevent unexpected litters in the first place. Make sure your pets are spayed or neutered and monitor them any time they’re outside.\n\nMany people might find it surprising just how many stray animals we have in North America. Share this article with a friend to help spread awareness and encourage more kindhearted people to protect their local animals.\n\nKeep Reading: Holland breaks record as first country ever to have zero stray dogs", "opengraph": {"locale": "en_US", "type": "article", "title": "Bus Station Opens Its Doors to Stray Dogs so They Have a Warm Place to Stay", "description": "A bus terminal has opened up its doors to shelter stray dogs from bad weather conditions. Here's what you can do to help stray dogs too.", "url": "https://theheartysoul.com/bus-terminal-opens-doors-shelter-stray-dogs/", "site_name": "The Hearty Soul", "article:publisher": "https://www.facebook.com/theheartysoul", "article:author": "https://www.facebook.com/inruffcompany/", "article:published_time": "2017-02-14T14:22:08+00:00", "article:modified_time": "2021-03-04T16:25:03+00:00", "image": "https://theheartysoul.com/wp-content/uploads/2017/12/Rover_Part08_02_Bus-Station-Opens-Its-Doors-to-Stray-Dogs.jpg", "image:width": "800", "image:height": "419"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/9q_WAl8_xBI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/9q_WAl8_xBI"}], "links": ["https://theheartysoul.com/tiny-homes-rescue-dogs/", "https://theheartysoul.com/animal-shelter-real-life-living-room/", "https://theheartysoul.com/holland-first-countr-zero-stray-dogs/"], "authors": [], "publish_date": "2017-02-14T14:22:08+00:00"}