{"result_id": "299037", "URL": "https://thehighwire.com/news/%E2%80%8B%E2%80%8Bphysicians-who-post-covid-19-vaccine-misinformation-may-lose-license-medical-panel-says/", "timestamp": "2023-04-25 17:26:24 CEST+0200", "meta": {"description": "The Federation of State Medical Boards warned July 29 that physicians and other healthcare professionals could be at risk of losing their medical licenses if they spread COVID-19 vaccine misinformation on social media, online and in the media.", "lang": "en", "keywords": "Federation of State Medical Boards, digital marketing, healthcare marketing, health marketing, healthcare IT, health IT, health tech, healthcare information technology, COVID-19, coronavirus, coronavirus pandemic, digital transformation, health innovation,", "favicon": "/favicon.ico", "canonical": "https://www.beckershospitalreview.com/digital-marketing/physicians-who-post-covid-19-vaccine-misinformation-may-lose-license-medical-panel-says.html", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "​​Physicians who post COVID-19 vaccine misinformation may lose license, medical panel says", "cleaned_text": "The Federation of State Medical Boards warned July 29 that physicians and other healthcare professionals could be at risk of losing their medical licenses if they spread COVID-19 vaccine misinformation on social media, online and in the media.\n\nFSMB, a nonprofit that represents all U.S. state medical boards, said any clinicians who create or spread vaccine misinformation or disinformation risk disciplinary action by state medical boards, including suspension or revocation of their medical license, according to a statement emailed to Becker's Hospital Review.\n\n\"Due to their specialized knowledge and training, licensed physicians possess a high degree of public trust and therefore have a powerful platform in society, whether they recognize it or not,\" FSMB said. \"They also have an ethical and professional responsibility to practice medicine in the best interests of their patients and must share information that is factual, scientifically grounded and consensus-driven for the betterment of public health.\"\n\nFSMB has not yet formally defined \"misinformation\" or \"disinformation\" in its policy, but the organization's ethics committee is studying the issues of physician misinformation and disinformation and plans to provide more guidance at a later date, an FSMB spokesperson said in an emailed statement to Becker's.\n\n\"However, we currently view misinformation as sharing or distributing verifiably false information,\" the spokesperson said. \"We define disinformation as sharing or distributing information that the distributor knows is false.\"\n\nWhile FSMB has not formed a recommendation yet for the definitions of misinformation and disinformation, state and territorial medical boards may use various terms, such as \"professional misconduct\" or \"ethics violation,\" in their own procedures to address concerns surrounding misinformation and disinformation, FSMB said.\n\nIn July, President Joe Biden called out social media platforms like Facebook for allowing vaccine misinformation to spread on its services, claiming that disinformation about the vaccines is \"killing people,\" according to CNBC.\n\nFSMB's statement comes as the country grapples with an uptick in COVID-19 cases and hospitalizations. As of July 29, national cases are up 439.7 percent from the lowest average in June 2021, and just 49 percent of Americans are fully vaccinated, The New York Times reported.\n\nAbout 97 percent of hospitalized COVID-19 patients aren't vaccinated, according to the report.\n\nEditor's note: This article was updated Aug. 5 at 4:45 p.m. CST to include additional statements from FSMB on the terms \"misinformation\" and \"disinformation.\"", "opengraph": {"title": "​​Physicians who post COVID-19 vaccine misinformation may lose license, medical panel says ", "image": "https://www.beckershospitalreview.com/templates/beckers/assets/images/bhr-new-logo.png", "description": "The Federation of State Medical Boards warned July 29 that physicians and other healthcare professionals could be at risk of losing their medical licenses if they spread COVID-19 vaccine misinformation on social media, online and in the media. "}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.beckershospitalreview.com/healthcare-information-technology/they-re-killing-people-biden-sounds-off-on-covid-19-misinformation-on-facebook.html", "https://www.beckershospitalreview.com/quality/national-cases-up-439-from-june-5-other-covid-19-trends-to-know.html"], "authors": ["Jackie Drees"], "publish_date": "Thursday, August 5th, 2021"}