{"result_id": "299028", "URL": "https://thehighwire.com/news/osha-withdraws-emergency-enforcement-of-covid-vaccine-mandate/", "timestamp": "2023-04-25 17:25:26 CEST+0200", "meta": {"description": "Following the U.S. Supreme Court ruling Jan. 13 against enforcing the emergency vaccination mandate while it's in the appeal process, the Occupational Safety and Health Administration said it's withdrawing the standard while it crafts a new one.", "lang": "en", "keywords": "", "favicon": "https://s3-prod.modernhealthcare.com/app-icons/CoverArt.svg", "canonical": "https://www.modernhealthcare.com/policy/osha-withdraws-covid-vaccine-mandate-employers", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "OSHA withdraws COVID vaccine mandate for employers", "cleaned_text": "The Occupational Safety and Health Administration is scrapping its COVID-19 vaccination mandate for large employers, but noted it's still working on a revised rule.\n\nThe withdrawal, which takes effect Jan. 26, follows the U.S. Supreme Court's 6-3 decision on Jan. 13 to stop enforcement of the rule while appeals are pending at lower courts. OSHA said Tuesday it also plans to ask the Sixth Circuit Court of Appeals to dismiss the related cases pending before it.\n\nOSHA's emergency temporary standard had sought to require employers with at least 100 employees to develop, implement and enforce vaccination policies, with exceptions for those that instead required employees to either get vaccinated or undergo regular testing for COVID-19 and wear face coverings at work.\n\nOSHA wrote in a filing Tuesday that emergency temporary standards, like the one being withdrawn, also serve as proposed rules. The agency noted the vaccination policy still exists as a proposed rule, which received \"robust participation\" from more than 100,000 commenters that will be available for public review.\n\n\"OSHA is evaluating the record and the evolving course of the pandemic,\" a U.S. Labor Department spokesperson said in a statement. \"OSHA has made no determinations at this time about when or if it will finalize a Vaccination and Testing rule.\"\n\nThe Supreme Court also ruled that the Biden administration's COVID-19 vaccine requirement for healthcare workers could continue during appeals. OSHA also intends to issue a final standard that will protect healthcare workers from COVID-19 hazards, the agency's statement said.\n\n\"Notwithstanding the withdrawal of the Vaccination and Testing ETS, OSHA continues to strongly encourage the vaccination of workers against the continuing dangers posed by COVID-19 in the workplace,\" the agency said.", "opengraph": {"site_name": "Modern Healthcare", "type": "article", "url": "https://www.modernhealthcare.com/policy/osha-withdraws-covid-vaccine-mandate-employers", "title": "OSHA withdraws COVID vaccine mandate for employers", "description": "Following the U.S. Supreme Court ruling Jan. 13 against enforcing the emergency vaccination mandate while it's in the appeal process, the Occupational Safety and Health Administration said it's withdrawing the standard while it crafts a new one.", "image": "https://s3-prod.modernhealthcare.com/s3fs-public/styles/1200x630/public/vaccine-mandate_i.jpg", "image:url": "https://s3-prod.modernhealthcare.com/s3fs-public/styles/1200x630/public/vaccine-mandate_i.jpg", "updated_time": "2022-01-25T15:26:40-05:00", "article:author": "https://www.facebook.com/*", "article:section": "Policy", "article:published_time": "2022-01-25T12:48:55-05:00", "article:modified_time": "2022-01-25T15:26:40-05:00"}, "tags": ["Letters", "Northeast", "Vital Signs Blog", "Bold Moves", "Breaking Bias", "Commentaries", "From the Editor", "West", "Midwest", "South"], "tweets": [], "movies": [], "links": ["https://www.modernhealthcare.com/legal/supreme-court-allows-healthcare-worker-vaccine-mandate-continue", "https://public-inspection.federalregister.gov/2022-01532.pdf"], "authors": ["Tara Bannow"], "publish_date": "2022-01-25T12:48:55-05:00"}