{"result_id": "299033", "URL": "https://thehighwire.com/news/uk-backs-down-no-vaccine-passports-pm-to-set-out-winter-covid-19-plan/", "timestamp": "2023-04-25 17:25:44 CEST+0200", "meta": {"description": "British Prime Minister Boris Johnson will set out on Tuesday his plans to manage the COVID-19 pandemic in the winter months, announcing a decision to scrap the introduction of vaccine passports and steps to end some emergency powers.", "lang": "en", "keywords": "GEN,GENHLT,HCPOL,HEA,HECA,HUMDIS,INFDIS,MCE,MEDST,NEWS1,POL,PUBHEA,UK,VACCIN,GB,WEU,EUROP,ECON,COVID", "favicon": "/pf/resources/images/reuters/favicon/favicon.ico?d=138", "canonical": "https://www.reuters.com/world/uk/no-vaccine-passports-uk-pm-set-out-winter-covid-19-plan-2021-09-12/", "encoding": null}, "image": null, "domain": "thehighwire.com", "title": "No vaccine passports: UK PM to set out winter COVID-19 plan", "cleaned_text": "LONDON, Sept 12 (Reuters) - British Prime Minister Boris Johnson will set out on Tuesday his plans to manage the COVID-19 pandemic in the winter months, announcing a decision to scrap the introduction of vaccine passports and steps to end some emergency powers.\n\nJohnson, under fire from some in his governing Conservative Party for raising taxes to fix a health and social care crisis, looks set to try to soothe those critics by ditching plans to introduce passports despite an increasing number of coronavirus cases. read more\n\nSpeaking to broadcasters, Health Minister Sajid Javid said he did not anticipate more lockdowns and that the vaccine passports would not be introduced in England, as the government depends instead on vaccines and testing to defend the public.\n\n\"Now that we're entering autumn and winter ... the prime minister this week will be setting out our plans to manage COVID over the coming few months and in that we will be making it clear that our vaccine programme is working,\" Javid told Sky News.\n\nHe told the BBC he was not \"anticipating any more lockdowns\" but would not take the measure off the table, that the government would not go ahead with vaccine passports to allow people to attend mass events and he wanted to \"get rid of\" PCR tests for travellers as soon as possible.\n\nJavid added the government would remain \"cautious\", but \"the vaccine programme, our testing programme, our surveillance programme, the new treatments ... this is all our wall of defence and whilst there's a lot of virus around, it is working\".\n\nThe night-time industry welcomed the U-turn on vaccine passports, with Michael Kill, the chief executive of the Night Time Industries Association (NTIA) trade body, saying he hoped businesses would be able to \"start to rebuild a sector that has consistently been at the sharp end of this pandemic\".\n\nThe government also said it expected Britain's Joint Committee for Vaccination and Immunisation (JCVI) to confirm the details of a vaccination booster programme to begin this month.\n\nBritain, which has one of the highest official COVID-19 death tolls in the world, has seen the number of cases climb over the last few months after easing restrictions in July, when the government first bet on vaccines to protect the public.\n\nThe government was handed sweeping emergency powers in March 2020 with the introduction of the Coronavirus Act, which included measures to shut down businesses, to close down sectors of the economy and the right to detain infectious people.\n\n\"These extraordinary times required necessary but intrusive measures. But I'm determined to get of rid of any powers we no longer need because of our vaccine defences,\" said Johnson in a statement.\n\nThe opposition Labour Party said it agreed it was a \"reasonable\" approach to take some measures off the statute book but warned the government that winter could punish the National Health Service (NHS).\n\n\"We know that winter is going to be difficult, the NHS are fearing the worst winter in living memory, we know we're going to have more flu, respiratory problems,\" Labour's health policy chief Jonathan Ashworth told Times Radio.\n\n\"So we need to prepare our NHS for the winter.\"", "opengraph": {"title": "No vaccine passports: UK PM to set out winter COVID-19 plan", "type": "article", "image": "https://www.reuters.com/resizer/oWOw99tldU8rIOTVx5_mYSjqaC0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/LOOZGBF6XRKNNIRTMNXOOHI3GM.jpg", "url": "https://www.reuters.com/world/uk/no-vaccine-passports-uk-pm-set-out-winter-covid-19-plan-2021-09-12/", "description": "British Prime Minister Boris Johnson will set out on Tuesday his plans to manage the COVID-19 pandemic in the winter months, announcing a decision to scrap the introduction of vaccine passports and steps to end some emergency powers.", "locale": "en_US", "site_name": "Reuters", "locale:alternate": "jp_JP", "article:published_time": "2021-09-12T15:46:59Z"}, "tags": [], "tweets": [], "movies": [], "links": ["/world/uk/uk-pm-johnson-address-lawmakers-social-care-plan-2021-09-06/", "https://www.thomsonreuters.com/en/about-us/trust-principles.html"], "authors": ["Elizabeth Piper"], "publish_date": "2021-09-12T15:46:59Z"}