{"result_id": "299030", "URL": "https://thehighwire.com/news/modernas-new-variant-busting-covid-vaccine-starting-trial-in-israel/", "timestamp": "2023-04-25 17:25:34 CEST+0200", "meta": {"description": "Study will assess how well special shot built to be Omicron-proof protects against infection; expert says Israel helping lead way in ‘the future of the fight against the pandemic’", "lang": "en", "keywords": "", "favicon": "https://static.timesofisrael.com/www/uploads/2018/11/toi_icon_512-200x200.png", "canonical": "https://www.timesofisrael.com/modernas-new-variant-busting-covid-vaccine-starting-trial-in-israel/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Moderna’s new variant-busting COVID vaccine starting trial in Israel", "cleaned_text": "An Israeli hospital announced Monday that it is part of a trial for Moderna’s new variant-busting coronavirus vaccine.\n\nModerna and Pfizer are both racing to release vaccines that have been updated to counter new variants of the coronavirus, as vaccines currently in use were formulated to deal with the original strain of the virus.\n\nSheba Medical Center announced that it is taking part, along with other hospitals internationally, in the testing phase for Moderna’s shot.\n\nAnnouncing the trial, the pharmaceutical giant noted that the Israeli hospital had pioneered research throughout the pandemic.\n\nProf. Gili Regev-Yochay, Sheba’s top vaccine researcher whose studies have been closely followed around the world, said her hospital considers it a “professional duty to continue to lead global research in the field.”\n\n“The whole world is still managing the coronavirus waves, and the significant challenge we face is to find vaccines and drugs that will address the various variants and enable safe life alongside the virus,” she said.\n\nExperts say that the testing and launch of variant-proof vaccines will be a game-changer for the pandemic. Epidemiologist Prof. Michael Edelstein of Bar Ilan University, who is not part of the Sheba study, told The Times of Israel that it was an important step.\n\n“This is exciting because it’s testing for what will be one of the first bivalent vaccines, which means it will expand the range of variants it defends against,” he said.\n\n“This is really the future of the fight against the pandemic unfolding. It’s the start of regularly-updated vaccines responding to the emergence of new variants, and it’s good that Israel is playing a role,” Edelstein said.\n\n“The Omicron component in this new vaccine works alongside the original vaccine formulation that targets the original strain. And while the Omicron component was made to target early Omicron variants, it is likely to also target well newer sub-variants of Omicron, including those that haven’t yet emerged,” he said.\n\nRegev-Yochay, research leader and Director of the Infection Prevention and Control Unit at Sheba, said that volunteers in the new study will be divided into three groups: one will receive two doses of the new vaccine; another will receive the new vaccine followed by a placebo; and the third will receive two doses of the original Moderna vaccine.\n\nInfection levels within the groups will be studied to assess the efficacy of the new shot.\n\n“We are pleased to partner with Sheba Medical Center to gain further data on the effectiveness, durability, and safety of our COVID-19 bivalent vaccine candidate, mRNA-1273.214,” he said.\n\n“The Sheba Medical Center has been a pioneer in COVID-19 research throughout the pandemic, and we thank the clinical trial teams and the study participants for helping to advance our understanding of mRNA-1273.214,” Burton said.", "opengraph": {"url": "https://www.timesofisrael.com/modernas-new-variant-busting-covid-vaccine-starting-trial-in-israel/", "type": "article", "title": "Moderna’s new variant-busting COVID vaccine starting trial in Israel", "description": "Study will assess how well special shot built to be Omicron-proof protects against infection; expert says Israel helping lead way in ‘the future of the fight against the pandemic’", "image": "https://static.timesofisrael.com/www/uploads/2022/07/AP22004571472459-1024x640.jpg", "image:width": "1024", "image:height": "640"}, "tags": ["pandemic", "Full Coverage ToI Original Video", "Full Coverage Israeli judicial overhaul", "COVID-19 Omicron variant", "Listen now", "Full Coverage What Matters Now", "Full Coverage Liveblog", "Moderna", "COVID-19", "Sheba Medical Center", "coronavirus", "See All", "Moderna vaccine"], "tweets": [], "movies": [], "links": ["/terms"], "authors": [], "publish_date": null}