{"result_id": "299039", "URL": "https://thehighwire.com/editorial/as-pandemic-officially-ends-biden-keeps-covid-alive-with-future-funding/", "timestamp": "2023-04-25 17:26:31 CEST+0200", "meta": {"description": "Despite ending the COVID pandemic, Biden pledged at least $5b to Big Pharma to develop future mRNA-based COVID vaccines & therapies.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/as-pandemic-officially-ends-biden-keeps-covid-alive-with-future-funding/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "As Pandemic Officially Ends, Biden Keeps COVID Alive With Future Funding", "cleaned_text": "Despite the blatant failure of the experimental mRNA COVID-19 injections—and the declaration by thousands of physicians around the world that natural immunity proves to be the most protective and longest-lasting solution against COVID-19—the Biden administration intends to use at least another $5 billion of taxpayer money to accelerate the development of new COVID vaccines and therapies. That’s right, as the president finally put an end to the COVID national emergency after three years of devastating pandemic policy, at the urging of FDA biologics center Director Peter Marks, the White House initiative “Project Next Gen” will “catalyze scientific advancement” of “next-generation” vaccine development through public-private partnerships.\n\nThough not mentioned in the Pfizer-controlled mainstream media, the lucrative announcement follows last week’s 2023 World Vaccine Congress, which took place in Washington D.C., bringing together over 3000 of “the most senior and informed industry experts across the entire vaccine landscape.” Joining the likes of Dr. Peter Hotez and puppets from Moderna, DARPA, and BARDA, to name a few, as a keynote speaker at the event, Marks stressed the importance of ensuring vaccines “continue to be effective against current and future strains” of the COVID virus.\n\nCertainly, big pharma must keep the COVID-19 vaccine focus active—especially now that its current long-awaited mRNA COVID clinical trial has opened the door for other mRNA-based treatments. With laser-focus, the industry has entirely ignored the inherent healing power of a healthy human body. Alas, dismissing that the COVID-19 pandemic destroyed small businesses and the lives of millions, the ineffective mRNA COVID jabs from the manufactured disaster have pumped billions into the pharmaceutical industry, the pockets of its CEOs, and government leaders supporting drugs over health at any cost.\n\nYet, trouble has been brewing on the horizon. After the WHO revised its vaccine guidance following a March 2023 SAGE meeting, coupled with an expected decrease in global demand for the gene-damaging COVID jabs, the vaccine industry—and to a more significant extent, the WHO, WEF, Bill Gates, SAGE, Wellcome Trust, and corrupt governments preaching climate change and the Great Reset—was faced with a real threat. Specifically, on April 10, 2023, the same day Biden secured future funds for the Big Pharma goliaths to revamp the COVID shots, GlobalData issued a statement warning about the effects the WHO update would have on the “future of COVID-19 vaccine rollouts.” Titled “Recent developments threaten COVID-19 vaccine demand and revenues,” GlobalData’s announcement correctly underscores the significance of natural immunity following exposure to the Omicron variant while also highlighting the precarious position confronting vaccine companies whose livelihood hinges on pushing COVID injections. GlobalData shared:\n\n“Significant drops in global demand and revenue for COVID-19 vaccines are expected in the coming years, as the threat of the pandemic winds down and vaccination guidance by health authorities loosens. The massive outbreaks caused by the Omicron variant led to the currently high levels of immunity observed in all age groups through both vaccination efforts and infections across the globe.\n\nCombined with recent guidance calling for decreased use of boosters and the U.S. Senate’s decision to end the national emergency declaration early, COVID-19 revenue streams may fade quickly for vaccine developers.”\n\nFurther jeopardizing the COVID-19 jab landscape connected to boosters, SAGE also reported there is no evidence indicating the bivalent BA.5-specific vaccine is more effective in preventing severe disease, the threat of which has significantly diminished. Therefore, with no menacing COVID-19 variant eruption to strong-arm society, GlobalData noted that health agencies and governments are currently shifting resources to vaccinate against other non-pandemic related diseases, such as RSV and influenza. But clearly, the industry is aware that the real money-maker lies behind scaring humanity into believing COVID-19 might keep them locked inside or kill them and their grandparents. And without question, Joe Biden and his federal agencies are eager to play along.\n\nAccording to the Washington Post, “Project Next Gen” is the follow-up to the Trump-era “Operation Warp Speed,” which financed the rapid development of the first COVID-19 jabs in the early days of the pandemic. With Marks advising vaccine makers to expand their manufacturing capacity in case an entirely new variant materializes that requires a different vaccine composition, Biden’s new effort will aim to expedite the development of unexplored vaccines and therapies. Likewise, Marks noted that facilities also need trained personnel ready to produce vaccines on the fly in the event of future outbreaks. With that in mind and offering yet another glimpse into the evolution of their tyrannical strategy, Marks said the FDA might consider increasing its vaccine center to respond to a “new normal” of severe disease outbreaks every few years.\n\nWhile speaking at the World Vaccine Congress, Marks remarked that “the COVID vaccine’s breadth of protection is the most critical focus moving forward.” Altogether giving up on prevention, he shared it would be nice if it were possible to have a vaccine that stops transmission, adding, “But I’m not going to hold my breath because you might become very blue in the face.” OK, at least Marks and his vaccine-fiend colleagues finally admit prevention of COVID-19 is not achievable. Although self-serving, the admission better fits their noticeable shift towards concocting new worries of unknown doom tied to the aberration of their COVID-19 virus. Ready to move forward battling the virus, with an attack date of June to pick a COVID strain to focus on for the fall and winter, Marks pointed out that COVID tends to do “funny things,” and a new variant may emerge over the summer that the annual vaccines won’t be able to target directly.\n\nBesides needing to revamp the fear around COVID, a Biden blunder last fall just in time for elections, no doubt contributed to the unspoken motive behind the president’s new billion-dollar pledge to Big Pharma. In a September 2022 interview on 60 Minutes, despite acknowledging that “we still have a problem” with COVID-19, the words “the pandemic is over” stumbled out of the president’s mouth. Following Biden’s untimely yet truthful admission, MarketWatch reported that the “three key vaccine makers,” Moderna, Pfizer, and BioNTech, saw stock shares take a deep plunge. Reporting on the dramatic fall in shares, the Financial Times suggested the sell-off reflected “concerns over demand” for COVID vaccines “during increasing public apathy” fueled by the public belief that the crisis phase of the pandemic was coming to an end.\n\nThus, with an official end to the COVID-19 pandemic dated yesterday, the failure of the current COVID-19 injections blaringly apparent, and the Biden administration committed to controlling and destroying freedom in America, it makes perfect sense the president would, on the very same day he ends the pandemic, ensure that Americans—at least those not yet wise to his plan—remain fearful of losing their freedoms yet again unless there are new, more advanced mRNA COVID-19 injections and therapies to fight future COVID battles. And more importantly, Biden extended a hand to guarantee Big Pharma remains in business and the Great Reset stays alive.", "opengraph": {"locale": "en_US", "type": "article", "title": "As Pandemic Officially Ends, Biden Keeps COVID Alive With Future Funding", "description": "Despite ending the COVID pandemic, Biden pledged at least $5b to Big Pharma to develop future mRNA-based COVID vaccines & therapies.", "url": "https://thehighwire.com/editorial/as-pandemic-officially-ends-biden-keeps-covid-alive-with-future-funding/", "site_name": "The HighWire", "article:modified_time": "2023-04-12T15:15:13+00:00", "image": "https://thehighwire.com/wp-content/uploads/2023/04/hgh.png", "image:width": "974", "image:height": "689", "image:type": "image/png"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Project Next Gen = Project Next Genocide.</p>— Toby Rogers, Ph.D., M.P.P. (@uTobian) <a href=\"https://twitter.com/uTobian/status/1645540159478288387?ref_src=twsrc%5Etfw\">April 10, 2023</a></blockquote> \n"], "movies": [], "links": ["https://doctorsandscientistsdeclaration.org/", "https://doctorsandscientistsdeclaration.org/home/supporting-evidence/#recovered", "https://apnews.com/article/joe-biden-covid19-coronavirus-national-emergency-e3a52722b57a6b4f24187426c27b3b39", "https://www.uncoverdc.com/2022/11/11/fda-director-violated-the-agencys-covid-19-vaccine-eua-conditions/", "https://www.terrapinn.com/conference/world-vaccine-congress-washington/?&pk_campaign=PageNotFound&pk_kwd=AF&pk_source=terrapinn&pk_medium=link", "https://www.uncoverdc.com/2021/10/21/the-assault-on-ivermectin/", "https://www.uncoverdc.com/2022/05/04/moderna-sec-filing-massive-mrna-product-pipeline-strategic-alliances-risk-factors/", "https://www.uncoverdc.com/2021/08/30/the-mrna-vaccine-clinical-trial-on-humans/", "https://thehighwire.com/editorial/mrna-is-not-going-away/", "https://vaccinenation.org/global-health/sage-revises-roadmap-for-covid-19-vaccination-use/", "https://www.uncoverdc.com/2022/01/19/bill-gates-future-pandemics-reducing-the-population-tracking-vaccines/", "https://www.globaldata.com/media/pharma/recent-developments-threaten-covid-19-vaccine-demand-revenues-says-globaldata/", "https://vaccinenation.org/global-health/sage-revises-roadmap-for-covid-19-vaccination-use/", "https://www.uncoverdc.com/2022/10/31/covid-19-opens-door-to-fast-tracked-mrna-jabs-for-rsv/", "https://twitter.com/uTobian/status/1645540159478288387?ref_src=twsrc%5Etfw", "https://www.uncoverdc.com/2022/07/19/big-pharma-gets-richer-as-american-taxpayers-foot-the-bill-twice/", "https://vaccinenation.org/technology/biden-declares-pandemic-over-sends-shares-plummeting/", "https://thehighwire.com/editorial/terrified-of-discovery-massive-implications-in-pfizer-whistleblower-case/", "https://www.uncoverdc.com/2021/08/05/covid-profiteering-big-pharma-and-big-profits/"], "authors": [], "publish_date": "7:15 AM EDT, Wed April 12, 2023"}