{"result_id": "299044", "URL": "https://thehighwire.com/news/judge-blocks-navy-from-enforcing-covid-19-vaccine-mandate-against-sailors-with-religious-objections/", "timestamp": "2023-04-25 17:26:49 CEST+0200", "meta": {"description": "A judge has expanded an earlier preliminary injunction on behalf of a group of U.S. Navy personnel opposed to taking the COVID-19 vaccine on religious grounds to include thousands more seeking religious exemptions.", "lang": "en", "keywords": "COVID-19, vaccine, mandate, Navy", "favicon": "https://cdn.christianpost.com/assets/img/favicons/apple-touch-icon.png", "canonical": "https://www.christianpost.com/news/judge-expands-injunction-against-navy-covid-19-vaccine-mandate.html", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "Judge blocks Navy from enforcing COVID-19 vaccine mandate against sailors with religious objections", "cleaned_text": "A federal judge has expanded an earlier preliminary injunction on behalf of a group of U.S. Navy sailors opposed to taking the COVID-19 vaccine on religious grounds, with the case now including thousands of personnel seeking religious exemptions.\n\nEarlier this year, a group of Navy SEALs and other military personnel sued the Department of Defense and others over a COVID-19 vaccine mandate, with a major issue being the Navy’s failure to grant any religious exemptions.\n\nU.S. District Court Judge Reed O’Connor issued an order Monday that granted a request to broaden a lawsuit against the Defense Department to include over 4,000 Navy service members who have requested a religious exemption from the mandate.\n\n“Plaintiffs decided to pursue a class action on behalf of 4,095 Navy servicemembers who have filed religious accommodation requests,” wrote O’Connor.\n\n“Here, the potential class members have suffered the ‘same injury,’ arising from violations of their constitutional rights. Each has submitted a religious accommodation request, and each has had his request denied, delayed, or dismissed on appeal.”\n\nThe decision added that a “finding in favor of the Named Plaintiffs on their [Religious Freedom Restoration Act] and First Amendment claims also resolves the RFRA and First Amendment claims of the class.”\n\n“By resolving the Navy Class’s common questions, this Court may provide relief to all servicemembers in the class and subclasses,” continued the decision. “Even though their personal circumstances may factually differ in small ways, the threat is the same — get the jab or lose your job.”\n\nThe plaintiffs are being represented by the First Liberty Institute, a conservative law firm based in Texas that has often handled religious liberty cases.\n\nMike Berry, general counsel and director of Military Affairs at First Liberty, explained to The Christian Post how this latest injunction worked in relation to a recent U.S. Supreme Court ruling that allowed the Defense Department to reassign those opposed to the COVID-19 vaccine.\n\n“Judge O’Connor’s order granting class certification and classwide preliminary injunction does not inhibit the Navy’s ability to consider vaccination status when making personnel assignment decisions,” said Berry.\n\n“But it does, for example, prohibit the Navy from punishing a sailor because of his/her vaccination status.”\n\nLast November, 35 Navy personnel, including 26 Navy SEALs, filed suit against the government over the COVID-19 vaccine mandate, arguing that the Navy has failed to provide a proper religious exemption to the mandate.\n\nFor its part, the Pentagon has contended that the mandate for all branches of the military is necessary in order to maintain combat readiness for the Armed Forces.\n\n“Now that the Pfizer vaccine has been approved, the department is prepared to issue updated guidance, requiring all service members to be vaccinated,” stated Pentagon Press Secretary John F. Kirby last year.\n\n“These efforts ensure the safety of our service members and promote the readiness of our force, not to mention the health and safety of the communities around the country in which we live.”\n\nIn January, O’Connor granted the Navy personnel a preliminary injunction against the mandate, noting in part that the Navy has failed to properly process religious exemption requests.\n\n“The Navy provides a religious accommodation process, but by all accounts, it is theater. The Navy has not granted a religious exemption to any vaccine in recent memory. It merely rubber stamps each denial,” wrote O’Connor in January.\n\n“The Navy servicemembers in this case seek to vindicate the very freedoms they have sacrificed so much to protect. The COVID-19 pandemic provides the government no license to abrogate those freedoms. There is no COVID-19 exception to the First Amendment. There is no military exclusion from our Constitution.”\n\nIn February, the Navy announced that it had approved an exemption to the COVID-19 vaccine for a member of their branch, the first such approval in seven years, according to U.S. Naval Institute News.\n\nHowever, noted the USNI, the exemption approval came under the condition that the unnamed sailor, who was in the Individual Ready Reserve, is not called up to active duty. At that point, the individual would have to be vaccinated against COVID-19.", "opengraph": {"ttl": "2419200", "site_name": "The Christian Post", "url": "https://www.christianpost.com/news/judge-expands-injunction-against-navy-covid-19-vaccine-mandate.html", "type": "website", "title": "Judge blocks Navy from enforcing COVID-19 vaccine mandate against sailors with religious objections", "description": "A federal judge has expanded an earlier preliminary injunction on behalf of a group of U S Navy sailors opposed to taking the COVID-19 vaccine on religious grounds, with the case now including ...", "image": "https://cdn.christianpost.com/files/original/thumbnail/24/75/247502.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://firstliberty.org/wp-content/uploads/2022/03/SEALS-Order.2022.03.28.pdf", "https://news.usni.org/2022/03/28/supreme-court-rules-navy-can-reassign-unvaxxed-seals", "https://www.defense.gov/News/News-Stories/Article/Article/2742785/dod-intends-to-mandate-pfizer-vaccine-pentagon-official-says/", "/news/judge-sides-with-navy-seals-seeking-vaccine-mandate-exemption.html", "https://news.usni.org/2022/02/16/navy-approves-first-religious-covid-19-vaccine-exemption-with-conditions", "https://twitter.com/MichaelGryboski?hc_ref=SEARCH&fref=nf", "https://www.facebook.com/MichaelCGryboski/"], "authors": [], "publish_date": "2022-03-31T07:45:51-04:00"}