{"result_id": "299002", "URL": "https://thehighwire.com/editorial/evidence-of-risk-harms-mount-as-fda-forces-new-covid-booster-without-human-testing/", "timestamp": "2023-04-25 17:24:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/evidence-of-risk-harms-mount-as-fda-forces-new-covid-booster-without-human-testing/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Evidence of Risk, Harms Mount as FDA Forces New Covid Booster Without Human Testing", "cleaned_text": "You could probably see it coming from a mile away. Throughout the pandemic response, the US Food and Drug Administration (FDA) has become increasingly reckless rubber stamping Covid shots into circulation. At the start of the FDA’s vaccine vetting process, the agency promised transparency.\n\nWhat the public received was nothing of the sort. Greeted with science-by-press release instead of data sets, taking vaccine-makers at their word on efficacy and safety, and eventually doing away with their once vaunted ‘independent’ outside advisers comprising VRBPAC.\n\nThe public was warned in late June that the FDA was attempting to ram through new edicts that would allow them to ‘flu shot’ the Covid vaccine. A simple but vastly unscientific switch where the vaccine platform would remain the same and companies would load it with all kinds of different strains sans the need for human testing.\n\nWe’ve went from rushing experimental vaccines onto the market with short, improper testing during an emergency to rushing experimental vaccines onto the market and eliminating all human testing in the face of no emergency. The logic fails here.\n\nFast-forward to present day. Without convening outside advisors to discuss the data or allow for public comment and without any human trials, a new version of the Covid booster has been given the go ahead by the FDA. How do we know? They said so in a press release.\n\nThere is reassurance however as the new technology loaded with new Covid strains were tested on a whooping 8 mice according to publicly available data. FDA head Peter Marks, in a short two minute clipped interview with Time lauding the new shot, used versions the word ‘hope’ five times when describing the expected performance of the shot.\n\nThe FDA’s own press release is equally evangelical in their religious faith in [lack of] science stating:\n\n“Based on the data supporting each of these authorizations, the bivalent COVID-19 vaccines are expected to provide increased protection against the currently circulating omicron variant.”\n\nThe atmosphere has changed overnight. Where once the CDC enjoyed heaps of blame and criticism, the FDA now is spotlighted by the public garnering ‘most disliked agency’ status. Best attempts to normalize the lack of science, testing and data and calm the public are backfiring in spectacular fashion as evidenced by a local Cleveland news interview from Dr. Amy Edwards, and infectious disease expert at University Hospitals, who stated,\n\n“Like it’s a pretty normal thing, once you tested the vaccine when you make tweaks to it, especially when you have to make frequent tweaks to it like the yearly flu shot, you don’t often get human data. So that’s pretty standard. I know that’s something that people, especially anti-vaxxers and anti-COVID people are going to make a big deal out of it…”\n\nUnfortunately for Dr. Edwards, the once impervious echo-chamber where bad science, improper testing and the lack of thorough vetting from the FDA could (bizarrely) be blamed somehow on ‘anti-COVID people’ is over.\n\nThere is information and data we do know from recent studies out in just over a week alone. A new study now shows that pre-exposure components of the mRNA Covid vaccines create ‘long-term unexpected’ changes to the immune system.\n\nThe changes in the immune system, which shockingly the authors found can be generational (passed down to offspring) in mouse studies, center around the lipid nano particles (LNP) accompanying the spike protein within Covid vaccines. \n\n\n\nThe same LNP’s that were found to distribute to every major organ and system of the body within hours according to Pfizer’s clinical research once omitted from public view.\n\n“Two weeks post-inoculation, we found that even mice injected four weeks post pre-exposure showed a significant decrease of anti-HA responses. At week eight post-exposure, the GC B cell responses were still significantly lower in the mRNA-LNP exposed mice, but not the anti-HA antibody levels.”\n\nThey conclude: “…data all together support that the immune changes induced by the mRNA-LNP vaccine in parents can be passed down to the offspring”\n\nWhat else do we know from just the recent studies?\n\nResearchers have found that mRNA vaccines appear to pose a higher risk of harms from a secondary analysis performed on the Pfizer and Moderna mRNA COVID-19 vaccine phase III trial data.\n\n“Combined, there was a 16 % higher risk of serious adverse events in mRNA vaccine recipients…” the researchers wrote in the newly released study.\n\nIn the study’s discussion, the authors state,\n\n“The excess risk of serious adverse events found in our study points to the need for formal harm-benefit analyses, particularly those that are stratified according to risk of serious COVID-19 outcomes. These analyses will require public release of participant level datasets.”\n\nThe public release of participant level datasets have been demanded by the scientific community for many years. It’s unfortunate that ‘science’ still couldn’t manage to allow basic data transparency before embarking on thelargest experiment in human history involving novel injectable genetic therapies delivered on mRNA platforms.\n\nWith Covid vaccine uptake still dismal in infants and young children, it is uncertain if the newly formulated, untested boosters will find a home in the arms of unwitting vaccine test subjects facing no emergency and most likely, a high prevalence of herd immunity.", "opengraph": {"locale": "en_US", "type": "article", "title": "Evidence of Risk, Harms Mount as FDA Forces New Covid Booster Without Human Testing", "description": "You could probably see it coming from a mile away. Throughout the pandemic response, the US Food and Drug Administration (FDA) has become increasingly reckless rubber stamping Covid shots into circulation. At the start of the FDA’s vaccine vetting process, the agency promised transparency.  What the public received was nothing of the sort. Greeted with […]", "url": "https://thehighwire.com/editorial/evidence-of-risk-harms-mount-as-fda-forces-new-covid-booster-without-human-testing/", "site_name": "The HighWire", "article:modified_time": "2022-09-01T15:38:36+00:00", "image": "https://thehighwire.com/wp-content/uploads/2021/08/FDA-Bldg-SignWeb-1080x675-1.jpeg", "image:width": "1080", "image:height": "675", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thehighwire.com/videos/fda-attempts-to-flu-shot-future-covid-vaccines/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-pfizer-biontech-bivalent-covid-19-vaccines-use", "https://www.science.org/content/article/omicron-booster-shots-are-coming-lots-questions", "https://time.com/6208623/omicron-boosters-animals-clinical-trials/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-pfizer-biontech-bivalent-covid-19-vaccines-use", "https://www.biorxiv.org/content/10.1101/2022.03.16.484616v2.full"], "authors": [], "publish_date": "7:38 AM EDT, Thu September 1, 2022"}