{"result_id": "299022", "URL": "https://thehighwire.com/news/floridas-new-surgeon-general-skeptical-of-vaccines-opposes-masks/", "timestamp": "2023-04-25 17:25:17 CEST+0200", "meta": {"description": "Ladapo signed the Great Barrington Declaration and suggests embracing \"the reality of viral spread.\"", "lang": "en", "keywords": "", "favicon": "https://cdn.arstechnica.net/favicon.ico", "canonical": "https://arstechnica.com/science/2021/09/floridas-new-surgeon-general-skeptical-of-vaccines-opposes-masks/", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "Florida’s new surgeon general skeptical of vaccines, opposes masks", "cleaned_text": "Florida Gov. Ron DeSantis announced Tuesday that the state's new surgeon general will be Joseph Ladapo, a UCLA researcher known for opposing evidence-based mask mandates, vaccine mandates, and lockdowns.\n\nInstead, Dr. Ladapo advocates for the controversial idea of embracing \"the reality of viral spread\" to achieve herd immunity.\n\n\"Florida will completely reject fear as a way of making policies in public health,\" Ladapo said in a press conference Tuesday after DeSantis announced his appointment. Fear, he said, has \"been unfortunately a centerpiece of health policy in the United States ever since the beginning of the pandemic and it's over here. Expiration date: it's done.\"\n\nFlorida has been one of the hardest-hit states in the pandemic, particularly amid the current wave driven by the hypertransmissible delta coronavirus variant. In early August, the Sunshine State accounted for 20 percent of all COVID-19 cases occurring in the US. Throughout the wave—which is finally receding in Florida—DeSantis has opposed vaccine mandates and fiercely fought mask mandates in schools.\n\nLadapo appears to share his thinking. In a series of opinion pieces in The Wall Street Journal, Ladapo has argued against mask mandates and vaccine mandates and played up fears about the safety of COVID-19 vaccines, which have been found to be remarkably safe as well as effective. Meanwhile, Ladapo has pointed to unproven and ineffective drugs, such as ivermectin and hydroxychloroquine, as treatments for COVID-19.\n\nIn the press conference Tuesday, Ladapo declined to say that he would promote vaccines and downplayed their role in helping bring an end to the pandemic.\n\n\"The state should be promoting good health, and vaccination isn't the only path to that,\" Ladapo said. \"It's been treated almost like a religion, and that's just senseless. There's a lot of good pathways to health, and vaccination is not the only one. So, we support measures for good health—that's vaccination, losing weight, it's exercising more, it's eating more fruits and vegetables, everything. We support it all.\"\n\nTo be clear, while losing weight, exercising, and eating fruits and vegetables are generally good for health, they will not prevent SARS-CoV-2 infection or transmission.\n\nBut preventing spread of the pandemic coronavirus does not appear to be a priority for Ladapo. In the press conference, he noted that he has signed the Great Barrington Declaration, a controversial document written last year that promotes the idea of obtaining herd immunity by allowing the virus to spread.\n• Switch to Moderna booster after Pfizer shots better against omicron in 60+\n• Fauci confirms parents’ nightmare: FDA may delay COVID vaccines for kids under 5\n• Combo COVID booster is the way to go this fall, Moderna data suggests View more stories The document has been roundly rebuked by leading health experts and public health agencies, including the World Health Organization.\n\n\"It's scientifically and ethically problematic,\" WHO Director-General Tedros Adhanom Ghebreyesus said of the document at the time. Allowing the virus to run free \"means allowing unnecessary infections, suffering, and death,\" he added.\n\nTo date, there have been more than 42 million cases of COVID-19 in the US and more than 676,000 people have died. The COVID-19 pandemic is now the deadliest disease event in US history, exceeding the estimated 675,000 US deaths during the 1918 Spanish flu pandemic.\n\nIn addition to being done with fear, Ladapo also said he was done with misinformation. Over the past year, \"people have been taking the science, and they've been misrepresenting it,\" Ladapo said. With DeSantis standing behind him, Ladapo vowed: \"That will never be a problem here.\"\n\nJust last week, DeSantis quietly stood by at another press conference while a Gainesville city employee spread misinformation about COVID-19 vaccines, saying, \"the vaccine changes your RNA,\" which is false.\n\nIn taking the title of surgeon general, Ladapo will be the top health official in Florida and oversee the state's health department. Ladapo will also be leaving his position at UCLA, where he focused on cardiovascular diseases and the cost-effectiveness of diagnostics. He will take a new position at the University of Florida, he said.", "opengraph": {"site_name": "Ars Technica", "url": "https://arstechnica.com/science/2021/09/floridas-new-surgeon-general-skeptical-of-vaccines-opposes-masks/", "title": "Florida’s new surgeon general skeptical of vaccines, opposes masks", "image": "https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1235004597-760x380.jpeg", "description": "Ladapo signed the Great Barrington Declaration and suggests embracing \"the reality of viral spread.\"", "type": "article"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer.php?u=https%3A%2F%2Farstechnica.com%2F%3Fpost_type%3Dpost%26p%3D1797234", "https://twitter.com/share?text=Florida%E2%80%99s+new+surgeon+general+skeptical+of+vaccines%2C+opposes+masks&url=https%3A%2F%2Farstechnica.com%2F%3Fpost_type%3Dpost%26p%3D1797234", "https://www.reddit.com/submit?url=https%3A%2F%2Farstechnica.com%2F%3Fpost_type%3Dpost%26p%3D1797234&title=Florida%E2%80%99s+new+surgeon+general+skeptical+of+vaccines%2C+opposes+masks", "https://www.wsj.com/articles/masks-are-a-distraction-from-the-pandemic-reality-11603927026", "https://www.facebook.com/watch/live/?v=461972724929378&ref=watch_permalink&t=251", "https://www.wsj.com/articles/masks-are-a-distraction-from-the-pandemic-reality-11603927026", "https://www.wsj.com/articles/vaccine-mandate-covid-19-unvaccinated-breakthrough-delta-boosters-fluvoxamine-antibodies-11631820572", "https://www.wsj.com/articles/are-covid-vaccines-riskier-than-advertised-11624381749", "https://arstechnica.com/science/2020/10/white-house-informally-endorses-letting-pandemic-spread-unchecked/", "https://arstechnica.com/science/2022/05/older-adults-got-higher-omicron-protection-by-switching-from-pfizer-to-moderna/", "https://arstechnica.com/science/2022/04/fauci-confirms-parents-nightmare-fda-may-delay-covid-vaccines-for-kids-under-5/", "https://arstechnica.com/science/2022/04/combo-covid-booster-is-the-way-to-go-this-fall-moderna-data-suggests/", "https://arstechnica.com/science/2022/04/delta-stops-calling-sars-cov-2-ordinary-seasonal-virus-after-backlash/", "https://arstechnica.com/science/2022/04/wearing-a-mask-cleans-nothing-florida-judge-vacates-cdc-travel-mask-mandate/", "https://arstechnica.com/series/covid-19-coverage/", "https://www.washingtonpost.com/politics/2021/09/14/florida-desantis-vaccine-misinformation-rna/"], "authors": ["Beth Mole"], "publish_date": "2021-09-21T22:39:37Z"}