{"result_id": "299046", "URL": "https://thehighwire.com/editorial/a-global-compensation-program/", "timestamp": "2023-04-25 17:26:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/a-global-compensation-program/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "A Global Compensation Program?", "cleaned_text": "On Monday, Feb 22, 2021, The World Health Organization (WHO) announced a no-fault injury compensation program for COVID-19 vaccines. WHO has designated 92 low- and middle-income countries and economies eligible for support via the GAVI COVAX Advance Market Commitment (AMC) of the COVAX Facility.\n\nThe COVAX Facility is co-led by the Coalition for Epidemic Preparedness Innovations (CEPI), Gavi and the World Health Organization (WHO), the United Nations and alongside key delivery partner UNICEF. Its aim is to accelerate the development and manufacture of COVID-19 vaccines, and to guarantee fair and equitable access for every country in the world.\n\nGavi, created in 2000 with start-up funding from the Bill and Melinda Gates Foundation, is an international organization — a global Vaccine Alliance, bringing together public and private sectors with the shared goal of creating equal access to new and underused vaccines for children living in the world’s poorest countries.\n\nWith this announcement, WHO is promoting this compensation program as the world’s first global program to provide for those who have suffered allegedly rare, serious adverse events associated with COVID-19 vaccines. In the COVAX announcement, it appears that the cutoff date, or statute of limitations to file a petition, is June 30, 2022.\n\nCreating a compensation program is not a new process for the WHO or United Nations. After the Iraqi invasion of Kuwait, the United Nations created the UN Compensation Commission in 1991, evaluating nearly 2.7 million claims and issuing 1.5 million awards, totaling over $50 billion dollars.\n\nAs early as 2006, the International Federation of Pharmaceutical Manufacturers and Associations, the global pharmaceutical-industry lobbying group, publicly demanded that manufacturers be granted liability protection from vaccine-related adverse events if they were going to participate in pandemic response initiatives.\n\nThe world has attempted to control other epidemics through the use of vaccines to mitigate the spread of the disease. During the 2009 H1N1 outbreak, one specific vaccine used in the UK and Northern Europe caused an increase in narcolepsy, which resulted in substantial compensation claims.\n\nDuring the Ebola outbreaks in Western Africa, some nations refused to accept liability for vaccine injuries. The dilemma for these nations and others that are considered low income involves whether to continue to refuse to offer manufacturers liability protection or to go without vaccines. In the current situation, that means going without COVID-19 vaccines. Is the end game for this collaboration, to allow pharmaceutical industry to remove itself from any liability and member nations to cede away their citizens and the nation’s right to sue for damages?\n\nThe COVAX compensation program will start on March 31, 2021 through its web portal (www.covaxclaims.com). Individuals who have been injured may apply for compensation for a COVAX vaccine administered before March 31, 2021. The funding will come from a levy on all distributed COVAX-19 vaccines.\n\nIn the US, the White House committed $2 Billion for 2021 and another $2 billion for 2022 for the purchases and development of COVID vaccines for the COVAX facility.\n\nThe levy to create the compensation fund will be on vaccines paid for by taxpayers from several nations. No liability for the manufacturers, just as under existing US law. Nor do the WHO, GAVI, or the UN expend any resources. This is a global consumer tax to pay for vaccine injuries.\n\nThe COVAX cutoff date seems arbitrary. They give no reason why. But it does raise some serious questions. The COVID facility released a forecast of vaccination for these 92 nations. The forecast calls to vaccinate one-third of the population of all eligible nations by the end of 2021. If that holds true, will they be able to vaccinate the remaining two-thirds or approximately 67% by the end of 2022? Highly doubtful.\n\nThis must be a great concern to the COVAX Facility to reach this goal whereas on Friday, February 19, 2021, leaders of the Group of Seven industrial powers said they would accelerate global vaccine development and deployment and support “affordable and equitable access to vaccines” and treatments for COVID-19. They cited a collective $7.5 billion from the G-7 to U.N.-backed efforts. WHO Director-General Tedros Adhanom Ghebreyesus thanked the G-7 countries for their “significant” pledges. But he said after talks Monday with German President Frank-Walter Steinmeier that “even if you have the money, if you cannot use the money to buy vaccines … having the money does not mean anything.” He said some rich countries’ approaches to manufacturers to secure more vaccines are “affecting the deals with COVAX, and even the amount that was allocated for COVAX was reduced because of this.”\n\nWill citizens of these low income nations be ineligible for compensation because of the cutoff date? Will this compensation program be transparent with reporting and data? It seems highly unlikely, given that the “gold standard” for this new COVAX Facility, according to three prominent authors, is the Countermeasures Injury Compensation Program (CICP) of the United States. The authors published their proposal specifically for the WHO in the New England Journal of Medicine December 2020. The CICP is notorious as a program in which “you can file and lose,” according to attorney Renee Gentry.\n\nRobert Krakow, a New York City attorney and former prosecutor who represents persons injured by vaccines said in an interview, “The most notable feature of The Who announcement about a “no-fault” vaccine injury compensation program for “low and middle income countries” touted as a “fast, fair, robust and transparent process”, it its lack of transparency. The program is presented as a way to “reduce the need for recourse to the law courts, a potentially lengthy and costly process.” What the WHO announcement fails to mention is the primary purpose of the program is to pave the way for massive distribution of vaccines by insulating vaccine manufacturers from liability for serious vaccine injuries – injuries that everyone agrees will inevitably happen. The WHO program is likely modeled after the U.S. PREP Act Countermeasures Injury Compensation Program (CICP), which uses an opaque process that severely limits the access vaccine injury victims have to compensation for serious injuries.”\n\nIn announcing its vaccine injury compensation program, the WHO also announced its partnership with Chubb, an US insurance company. Chubb promotes itself as the world’s largest publicly traded Property & Casualty Insurance Company, located in over 54 countries worldwide. Yet another “public-private” partnership, with the clear implication that other insurance companies will also be involved.\n\nTied with the Chubb announcement, its subsidiary ESIS, Inc. signed an agreement to administer the compensation program. ESIS provides claim and risk management services to a wide variety of commercial clients. So will ESIS have the medical expertise to interpret a flood of COVID-related injury claims? Is there a known COVID injury profile? We probably will not know the answer to that question for some time, maybe longer, if the promised transparency of the program is opaque.\n\nIn the US, the CICP already is receiving many petitions for alleged injuries related to COVID vaccines and also from other “countermeasures,” including medical devices and drugs. Among other glaring deficiencies of the CICP system is that the petitioner may not call on medical experts to testify to their injury and the mechanism of harm. Since the CICP does not reimburse attorneys and medical experts, very few will have the resources to assemble convincing proof of causation. Without experts to help guide petitioners through the administrative process, to evaluate their injury, and to help provide a course of medical treatment for future needs, most petitioners will be lost and completely unable to recover any compensation. COVID vaccines, which many regard to be more aptly described as gene therapies, are completely novel, thus the injuries related to them will likely be unique, hard to prove, and sadly, also hard to treat.\n\nHow will ESIS handle these COVAX petitions? The proposed structure appears to be solely administrative, with no appeal to a judicial system of any sort. Thus, it is extremely like the CICP in the United States, which many consider to be unconstitutional. Who will have access to the decisions granting or denying compensation?\n\nWe must ask questions about the other nations contributing funds and other resources to the COVAX facility. Most do not have compensation programs for injuries from COVID-19 vaccines. For those countries that have already begun vaccination programs, how are they handling injury claims? Canada announced a program nationwide in early December 2020 for COVID-19 vaccine injuries but did not release details. And a few personal injury attorneys have said they are unaware of any details. Did Canada make an announcement just too calm legitimate fears without a program in place?\n\nThe nations of Singapore, Indonesia, Vietnam, and Nepal have COVID vaccine injury compensation programs. Several others have announced they will review how their existing medical systems can deliver proper care. Is that another way of saying that if you get injured, we will take care of your medical needs, and that is it? No compensation for any injury? Sounds more and more like people are being induced and coerced into playing COVID-19 vaccine roulette.\n\nThe overall concerning issue is the establishment and implementation of a global compensation program. Last fall, I wrote about how The PREP Act took the first step of federalizing vaccination policy by allowing pharmacists to administer the childhood vaccination schedule. Now we have a partial-global compensation program for 92 countries to be run by the WHO, UN, GAVI, and UNICEF collaboration. Will countries with existing compensation programs eventually merge with this new compensation program? Will Pharma along with WHO/GAVI/UN/UNICEF apply coercive pressure to nations to join up or wait at the end of the line for vaccines? Will we see in a few years a complete indemnified pharmaceutical industry and countries and their citizens unable to sue for damages? Truly, a global compensation program with a global liability free pharmaceutical industry.\n\nWayne Rohde is the author of The Vaccine Court-Dark Truth of America’s Vaccine Injury Compensation Program and The Vaccine Court 2.0. He is also the host of the Right On Point podcast, a candid legal discussion of your civil liberties, the NVICP, The PREP Act, and the CICP.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Global Compensation Program?", "description": "By Wayne Rohde On Monday, Feb 22, 2021, The World Health Organization (WHO) announced a no-fault injury compensation program for COVID-19 vaccines. WHO has designated 92 low- and middle-income countries and economies eligible for support via the GAVI COVAX Advance Market Commitment (AMC) of the COVAX Facility. The COVAX Facility is co-led by the Coalition […]", "url": "https://thehighwire.com/editorial/a-global-compensation-program/", "site_name": "The HighWire", "image": "https://thehighwire.com/wp-content/uploads/2021/07/Webp.net-resizeimage-96.jpg", "image:width": "1500", "image:height": "932", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.covaxclaims.com", "http://www.thevaccinecourt.com", "http://www.rightonpoint.online", "https://scholarlycommons.law.emory.edu/cgi/viewcontent.cgi?article=1056&context=elj"], "authors": [], "publish_date": "4:22 PM EST, Fri February 26, 2021"}