{"result_id": "299003", "URL": "https://thehighwire.com/news/large-german-insurance-company-estimates-2-5-3-million-people-in-germany-under-treatment-for-side-effects-of-vaccination-after-covid-shot/", "timestamp": "2023-04-25 17:24:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/news/large-german-insurance-company-estimates-2-5-3-million-people-in-germany-under-treatment-for-side-effects-of-vaccination-after-covid-shot/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Large German Insurance Company Estimates 2.5-3 Million People in Germany 'under treatment for side effects of vaccination after Covid shot'", "cleaned_text": "“An analysis of millions of insured persons’ data from the BKK company health insurance company comes to significantly higher figures for side effects than the Paul Ehrlich Institute. The new data is an “alarm signal,” says BKK board member Andreas Schöfbeck.” reports German news outlet Welt.de.\n\n“For the first time, the figures from a large German health insurance association are available on the side effects of Covid vaccines. The board of directors of BKK ProVita, Andreas Schöfbeck, had the data of millions of insured persons of the BKK group analyzed.“\n\nUsing the company’s nearly 11 million insured participants, they ran a query using International Classification of Diseases (ICD) codes for vaccine side effects. Looking at just the first half of 2021 and “about half for the third quarter of 2021” found that 216,695 people had already been treated for vaccine side effects from Covid vaccination. BKK board member Schöfbeck sent a letter detailing this “alarm signal” to the Paul Ehrlich Institute – the agency of the German Federal Ministry of Health responsible for vaccines and medicines regulation.\n\nThe letter continues, “…with regard to the number of vaccinated people in Germany, this means that about 4-5% of the vaccinated people were under medical treatment for side effects of vaccination.”\n\nThis event marks the first time that a private insurance company has audited its data to challenge a governmental heath agency on the widespread underreporting of vaccine side effects.\n\nUpon deeper inspection, it has been consistently found that vaccine side effects are chronically underreported. In the United States, a study funded by Health and Human Services conducted by Harvard Medical School tracked reporting to the Vaccine Adverse Events Reporting System (VAERS) over a three-year period at Harvard Pilgrim Health Care involving 715,000 patients and found that “fewer than 1% of vaccine adverse events are reported.”\n\n\n\nA U.S. House Report similarly stated: “Former FDA Commissioner David A. Kessler has estimated that VAERS reports currently represent only a fraction of the serious adverse events.”\n\nMeanwhile, during the Covid pandemic, myocarditis has presented as one of the first line vaccine injuries to garner worldwide attention. A recent study published in JAMA used VAERS to look at myocarditis cases after vaccination and found a several fold increase after the second dose in young boys. The authors concluded:\n\n“…as a passive system, VAERS data are subject to reporting biases in that both underreporting and overreporting are possible.38 Given the high verification rate of reports of myocarditis to VAERS after mRNA-based COVID-19 vaccination, underreporting is more likely. Therefore, the actual rates of myocarditis per million doses of vaccine are likely higher than estimated.”\n\nAnother study tracked rates of Myopericarditis after mRNA vaccination in the Kaiser Permanente health system and concluded:\n\nWe identified additional valid cases of myopericarditis following an mRNA vaccination that would be missed by the VSD’s search algorithm, which depends on select hospital discharge diagnosis codes. The true incidence of myopericarditis is markedly higher than the incidence reported to US advisory committees.", "opengraph": {"locale": "en_US", "type": "article", "title": "Large German Insurance Company Estimates 2.5-3 Million People in Germany 'under treatment for side effects of vaccination after Covid shot'", "description": "By Jefferey Jaxen “An analysis of millions of insured persons’ data from the BKK company health insurance company comes to significantly higher figures for side effects than the Paul Ehrlich Institute. The new data is an “alarm signal,” says BKK board member Andreas Schöfbeck.” reports German news outlet Welt.de. “For the first time, the figures from […]", "url": "https://thehighwire.com/news/large-german-insurance-company-estimates-2-5-3-million-people-in-germany-under-treatment-for-side-effects-of-vaccination-after-covid-shot/", "site_name": "The HighWire", "article:modified_time": "2022-02-24T00:35:34+00:00", "image": "https://thehighwire.com/wp-content/uploads/2022/02/coronavirus-covid-vaccine-hero.jpeg", "image:width": "678", "image:height": "446", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">MORE – The letter from Schöpfbeck, BKK board member, on the subject matter to the Paul-Ehrlich Institute, an agency of the German Federal Ministry of Health. The English version is auto-translated (Yandex Translate). h/t <a href=\"https://twitter.com/Tim_Roehn?ref_src=twsrc%5Etfw\">@Tim_Roehn</a> <a href=\"https://t.co/gVgLM9XLuL\">pic.twitter.com/gVgLM9XLuL</a></p>— Disclose.tv (@disclosetv) <a href=\"https://twitter.com/disclosetv/status/1496577835477180425?ref_src=twsrc%5Etfw\">February 23, 2022</a></blockquote> \n"], "movies": [], "links": ["https://www.welt.de/politik/deutschland/plus237106177/Coronavirus-Mehr-Impf-Nebenwirkungen-als-bisher-bekannt.html", "https://twitter.com/disclosetv/status/1496577835477180425/photo/1", "https://twitter.com/disclosetv/status/1496577835477180425/photo/1", "https://twitter.com/Tim_Roehn?ref_src=twsrc%5Etfw", "https://t.co/gVgLM9XLuL", "https://twitter.com/disclosetv/status/1496577835477180425?ref_src=twsrc%5Etfw", "https://jamanetwork.com/journals/jama/fullarticle/2788346", "https://www.medrxiv.org/content/10.1101/2021.12.21.21268209v1"], "authors": [], "publish_date": null}