{"result_id": "299056", "URL": "https://thehighwire.com/news/ny-gov-hochul-says-vaccines-are-from-god-sends-out-her-own-apostles-to-push-jabs-a-day-before-healthcare-workers-axed/", "timestamp": "2023-04-25 17:27:46 CEST+0200", "meta": {"description": "Gov. Kathy Hochul, D-N.Y., claimed from a pulpit in Brooklyn on Sunday that citizens should be thankful to God for the COVID-19 vaccines, which she claimed were divinely inspired", "lang": "en", "keywords": "", "favicon": "//static.foxnews.com/static/orion/styles/img/fox-news/favicons/favicon.ico", "canonical": "https://www.foxnews.com/politics/ny-gov-hochul-claims-covid-19-vaccines-from-god-sends-out-her-own-apostles", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "NY Gov. Hochul says vaccines are 'from God,' sends out her own 'apostles' to push jabs", "cleaned_text": "Gov. Kathy Hochul, D-N.Y., preached from a pulpit in Brooklyn on Sunday that citizens should be thankful to God for the COVID-19 vaccines, which she claimed were divinely inspired.\n\nHochul, who assumed office in August after Andrew Cuomo resigned amid allegations of sexual misconduct, also urged her listeners to be her \"apostles\" by convincing their friends to get vaccinated, an act she said demonstrates the love Jesus commanded his followers to exhibit.\n\n\"We are not through this pandemic,\" Hochul said during her homily at the Christian Cultural Center, a non-denominational megachurch. \"I wished we were, but I prayed a lot to God during this time and you know what, God did answer our prayers. He made the smartest men and women, the scientists, the doctors, the researchers — he made them come up with a vaccine. That is from God to us and we must say, ‘Thank you, God. Thank you.'\"\n\nHochul then showed off her necklace that indicated her vaccination status before alleging those who refuse the COVID-19 vaccine \"aren't listening to God and what God wants.\"\n\n\"I need you to be my apostles,\" Hochul told her audience. \"I need you to go out and talk about it and say, ‘We owe this to each other. We love each other.’ Jesus taught us to love one another and how do you show that love but to care about each other enough to say, ‘Please get the vaccine because I love you and I want you to live? I want our kids to be safe when they're in schools? I want to be safe when you go to a doctor's office or to a hospital and are treated by somebody?' You don't want to get the virus from them. You're already sick or you wouldn't be there.\"\n\n\"And here is my promise to you, my friends. I will use the inspiration of God in my life and fight for you every single day as your governor and beyond,\" Hochul added.\n\nHochul has spoken dismissively regarding those who would seek a religious exemption to the COVID-19 vaccine.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I'm not aware of a sanctioned religious exemption from any organized religion,\" she told reporters during a Sept. 16 press briefing. \"In fact, they are encouraging the opposite. Everybody from the pope on down is encouraging people to get vaccinated.\"\n\nHochul said her administration will \"defend the right of New York to ensure that anyone in a health care facility can meet a patient and that patient does not have to worry when they go in there for health care, that they're gonna contract a virus from one of the people that are supposed to protect their health.\"", "opengraph": {"title": "NY Gov. Hochul says vaccines are 'from God,' sends out her own 'apostles' to push jabs", "description": "Gov. Kathy Hochul, D-N.Y., claimed from a pulpit in Brooklyn on Sunday that citizens should be thankful to God for the COVID-19 vaccines, which she claimed were divinely inspired", "type": "article", "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21236010272634.jpg", "url": "https://www.foxnews.com/politics/ny-gov-hochul-claims-covid-19-vaccines-from-god-sends-out-her-own-apostles", "site_name": "Fox News", "article:opinion": "false"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "http://video.foxnews.com/v/6274513508001", "https://www.foxnews.com/us/kathy-hochul-becomes-new-yorks-first-female-governor", "https://www.foxnews.com/category/person/andrew-cuomo", "https://www.foxnews.com/apps-products?pid=AppArticleLink"], "authors": [], "publish_date": "2021-09-27T22:05:45-04:00"}