{"result_id": "299013", "URL": "https://thehighwire.com/news/facebook-files-shows-cdc-led-censorship-efforts-on-vaccine-safety-criticism-of-fauci-and-covid-origins-discussion-on-platform/", "timestamp": "2023-04-25 17:24:27 CEST+0200", "meta": {"description": "Throughout the pandemic, the CDC was in constant contact with Facebook, vetting what users were allowed to say on the social media site.", "lang": "en", "keywords": "", "favicon": "https://d2eehagpk5cl65.cloudfront.net/wp-content/themes/reason-dot-com-theme/dist/images/favicon/apple-icon-57x57_30d0df5c.png", "canonical": "https://reason.com/2023/01/19/facebook-files-emails-cdc-covid-vaccines-censorship/", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "Inside the Facebook Files: Emails reveal the CDC's role in silencing COVID dissent", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) played a direct role in policing permissible speech on social media throughout the COVID-19 pandemic. Confidential emails obtained by Reason show that Facebook moderators were in constant contact with the CDC, and routinely asked government health officials to vet claims relating to the virus, mitigation efforts such as masks, and vaccines.\n\nFor a broader analysis of the federal government's pandemic-era efforts to suppress free speech—and whether they violated the First Amendment—see Reason's March 2023 cover story on the ramifications of these emails. This article provides screenshots of the emails themselves.\n\nAfter Elon Musk took control of Twitter, he permitted several independent journalists to peruse the company's previous communications with the FBI, the CDC, the White House, and government officials elsewhere. These disclosures, which have become known as the Twitter Files, reveal that government bureaucrats put substantial pressure on Twitter to restrict alleged misinformation relating to elections, Hunter Biden, and COVID-19.\n\nThe Facebook Files, which were obtained by Reason as a result of the state of Missouri's lawsuit against the Biden administration, reveal that the CDC had substantial influence over what users were allowed to discuss on Meta's platforms: Facebook and Instagram.\n\nThe messages reveal an environment where the CDC kept tabs on Meta's moderation practices and regularly told the company what the agency wanted it to do.\n\nFor instance, in May 2021, CDC officials began routinely vetting claims about COVID-19 vaccines that had appeared on Facebook. The platform left it up to the federal government to determine which assertions were accurate.\n\nFacebook's moderator notes that some of the above claims \"would already be violating\"—an implicit admission that the CDC's opinion on the other claims would be a deciding factor in whether the platform would restrict such content. Facebook was clearly a willing participant in this process; moderators repeatedly thanked the CDC for its \"help in debunking.\"\n\nClaims vetted by the CDC included whether \"COVID-19 is man-made.\" The CDC told Facebook that it was \"theoretically possible, but extremely unlikely.\"\n\nFor months, it was Meta policy to prohibit users from asserting that the pandemic may have originated from a lab leak. The platform revised this policy around the same time that the above email exchange took place.\n\nBy July 2021, the CDC wasn't just evaluating which claims it thought were false, but whether they could \"cause harm.\"\n\nThen, in November, the Food and Drug Administration granted emergency authorization for children to receive Pfizer's COVID-19 vaccine. Meta proudly informed the CDC that it would remove false claims—\"i.e. the COVID vaccine is not safe for kids\"—from Facebook and Instagram. Meta also provided the CDC with a list of new claims about vaccines and asked whether the government thought they could \"contribute to vaccine refusals.\"\n\nThe CDC determined that this label applied to all such claims.\n\nIt's important to consider the ramifications. Meta gave the CDC de facto power to police COVID-19 misinformation on the platforms; the CDC took the position that essentially any erroneous claim could contribute to vaccine hesitancy and cause social harm. This was a recipe for a vast silencing across Facebook and Instagram, at the federal government's implicit behest.\n\nMeta frequently gave the CDC lists of pandemic-related topics that had gone viral, seeking guidance on how to handle them. And the CDC informed Meta \"to be on the lookout\" for misinformation stemming from specific alleged misconceptions.\n\nMeta also kept the CDC apprised of criticism of Anthony Fauci, the White House's COVID-19 advisor and head of the National Institute of Allergy and Infectious Diseases (NIAID). One email warned the CDC that Facebook users were mocking Fauci for changing his mind about masking and double-masking. The CDC replied that this information was \"very helpful.\"\n\nIf the tone of Meta's communications seems overly friendly, it's worth noting that staffers viewed government employees at the CDC as their \"colleagues.\" In one email, Meta discussed providing said colleagues with access to a \"reporting channel\" for COVID-19 misinformation. The list of individuals with access included CDC staff, as well as employees at Reingold, a communications firm advising government health agencies.\n\nThis is just a snapshot of the messages exchanged between the CDC and Meta. They also had regular conference calls. The CDC was not the only arm of the federal government engaged in this work, of course: White House staffers also castigated Meta for not deplatforming alleged misinformation fast enough. President Joe Biden himself accused Facebook of \"killing people\" in July 2021.\n\nOne wonders whether these condemnations, from Biden and others in his administration—which included the specific threat of punitive regulation if demands for greater censorship were not met—influenced Meta's decision to delegate COVID-19 content moderation to the CDC.", "opengraph": {"article:tag": "White House", "article:section": "Health", "locale": "en_US", "type": "article", "title": "Inside the Facebook Files: Emails reveal the CDC's role in silencing COVID dissent", "description": "Throughout the pandemic, the CDC was in constant contact with Facebook, vetting what users were allowed to say on the social media site.", "url": "https://reason.com/2023/01/19/facebook-files-emails-cdc-covid-vaccines-censorship/", "site_name": "Reason.com", "article:publisher": "https://facebook.com/Reason.Magazine", "article:published_time": "2023-01-19T11:00:47+00:00", "article:modified_time": "2023-01-19T13:24:43+00:00", "image": "https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2023/01/cdc-1024x576.jpg", "image:width": "1024", "image:height": "576", "image:type": "image/jpeg"}, "tags": ["White House", "Biden Administration", "Coronavirus", "Censorship", "First Amendment", "Free Speech", "Pandemic", "CDC"], "tweets": [], "movies": [], "links": ["https://reason.com/2023/01/19/how-the-cdc-became-the-speech-police/", "https://nclalegal.org/state-of-missouri-ex-rel-schmitt-et-al-v-biden-et-al/", "https://reason.com/2021/06/04/lab-leak-misinformation-media-fauci-covid-19/", "https://www.wsj.com/articles/white-house-covid-censorship-machine-social-media-facebook-meta-executive-rob-flaherty-free-speech-google-11673203704", "https://reason.com/2021/07/19/biden-charges-facebook-with-homicide-while-his-surgeon-general-recommends-legal-and-regulatory-measures-to-suppress-covid-19-misinformation/", "https://www.dailymail.co.uk/news/article-9806823/White-House-communications-director-Kate-Bedingfield-says-theyre-reviewing-section-230.html"], "authors": ["Robby Soave"], "publish_date": "2023-01-19T11:00:47+00:00"}