{"result_id": "299047", "URL": "https://thehighwire.com/editorial/no-thankspfizer-profound-neurologic-response-to-the-covid-jab/", "timestamp": "2023-04-25 17:26:56 CEST+0200", "meta": {"description": "Angelia Desselle was mocked & discredited after sharing a video and #ThanksPfizer to bring attention to her injuries following the COVID jab.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/no-thankspfizer-profound-neurologic-response-to-the-covid-jab/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "NO #ThanksPfizer: Profound Neurologic Response to the COVID Jab", "cleaned_text": "An extensive list of vaccine injuries stemming from the experimental COVID-19 gene therapy jabs is significant and well-documented. The CDC’s vastly underreported Vaccine Adverse Events Reporting System (VAERS) lists 22,800 cases where the specific side effect “tremor” is listed following COVID-19 vaccination. Yet that important fact didn’t stop an indoctrinated social media mob, mainstream media, free language company Duolingo, and others like journalist and seeker of “unreported truths” Alex Berenson from mocking vaccine-injured Angelia Desselle last week following her tweet detailing the devastating tremors she began experiencing after one dose of the Pfizer jab. Desselle received the billion-dollar company’s windfall shot on January 5, 2021, and now, two years later—after pleading with Pfizer and the Biden administration and relentlessly sharing her story on Facebook and Twitter—she continues to suffer from serious adverse issues.\n\nFollowing last week’s steady attempts to discredit Desselle, Dr. Pierre Kory, her treating physician, remarked that the onslaught of misplaced aggression has all the hallmarks of propaganda. Speaking to vaccine risk awareness champion Del Bigtree, Kory explained, “this is a narrative that’s being generated, and there’s a clear reason why they would want to do it.” He added, “The scope and the scale of the vaccine tragedy, the millions of Americans injured and/or dead, wouldn’t it be convenient if they could somehow dispel it and calm it down by characterizing these people as making it up.” Pointing out that there is obvious gaslighting in today’s COVID narrative, Kory said Desselle’s injuries are real, and he has numerous other patients with similar vaccine injuries. He reiterated:\n\n“So now you have an entire medical system that has propagated and promoted the most toxic and lethal medical intervention in history, leaving thousands to millions injured. Wouldn’t it be convenient to make them go away [by labeling them] as people who fabricate this and are somehow looking for attention and sympathy? The opposite is true.”\n\nTaking a closer look at how this latest round of COVID propaganda—at Desselle’s expense—got underway, on January 21, 2023, Elon Musk opened the door to a conversation about vaccine injury by tweeting that he experienced “major side effects” after receiving a second booster shot. Musk commented he felt like “he was dying for several days” and was uncertain if the damage was permanent.\n\nDesselle, a previously healthy 45-year-old surgery center manager, still experiences debilitating tremors resulting from her COVID jab injury. Therefore, wanting to bring attention to the life-altering damage she and many others endure, she responded to Musk’s tweet by sharing her story and a video (with nearly 73 million views) of herself as she struggled to walk, trembling violently three days after receiving Pfizer’s COVID jab.\n\nNearly nine months earlier, on May 7, 2022, Desselle posted a video of her legs shaking uncontrollably with the caption, “Thanks Pfizer.” The carelessly misinformed responses to Desselle’s videos on both occasions, along with the massive explosion of #ThanksPfizer memes, are nothing short of horrendous. Surprisingly, social media influencer Ian Miles Cheong, who “say[s] the quiet part out loud,” was quick to discredit Desselle. Cheong has a massive following on Twitter, including from numerous heroes whose selfless mission is spreading the truth about the tyrannical COVID narrative. Replying to Desselle’s May 7 video, Cheong tweeted, “Get yourself checked into a psych ward.“\n\nIt is unclear if Cheong’s cruel response to Desselle was fueled by a user-generated Twitter “Community Notes” message (above) attached to Desselle’s May 7 tweet. The notice references CDC data that falsely states tremors following vaccines are a myth. Whatever motivated Cheong’s comment towards Desselle, on January 28, 2023, he switched gears, tweeting a link to a partial list of extensive side effects reported for Pfizer’s COVID jab.\n\nCheong’s conflicting tweets underscore the influence of the ongoing, inconsistent, and insufficient data coming from those responsible for manufacturing and pushing the taxpayer-funded experimental vaccines. Unfortunately, it also exposes the effectiveness of their chaotic methods of madness. Without question, this open-ended false narrative continues to discount and discredit serious COVID vaccine injuries like the tremors experienced by Desselle.\n\nMoving forward past Cheong’s May 7 tweet and the rabid social media mob that wasted no time mocking Desselle following her January 21 tweet—the most unexpected and unwarranted outburst toward Desselle came from Alex Berenson, who is not a doctor. Shockingly, Berenson implied Desselle is faking her tremors, commenting that her video is instead “performative nonsense.” Moreover, the generally well-respected Berenson berated not just Desselle but anyone suffering from the long list of life-altering COVID jab injuries that are largely ignored by the U.S. government. More broadly, he essentially admonished women in general.\n\nFollowing Berenson’s initial rant discrediting Desselle, who he does not know, communication strategist TexasLindsay, replied to him, tweeting, “It is inexcusable and horrific to accuse anyone now suffering from neurological disorder after their C-19 shot as all being ‘middle age conservative women.'” Berenson then asserted that Desselle and anyone else who speaks of whatever vaccine injury he apparently has decided not to acknowledge is fueling COVID conspiracy idiocy. He replied to TexasLindsay, tweeting:\n\n\n\n\n\n“I hear from tons of people who have suffered serious mRNA injuries. Usually cardiac, sometimes autoimmune (or other). Performative nonsense does not help their cause any more than the magnet/5G idiocy helped vaccine skeptics in 2021, and I’m going to call it out.”\n\nIt is worth highlighting that before her COVID-19 vaccine injury, Desselle firmly believed in vaccines. Without a doubt, she is not an “anti-vaxxer.” She got her first COVID jab because she is “pro-science and pro-vaccine.” If Berenson had cared enough to scroll through her Twitter account, he would have discovered that Desselle has been on a mission to bring awareness to vaccine injury, including hers, for over two years. In an episode titled “They Don’t Want to See People Like Us,” Desselle first appeared on The Highwire in April 2021 to discuss her injuries, sharing with Del Bigtree the complete denial the medical community has towards vaccine-injured people seeking help.\n\nSince her vaccine injury, Desselle has reached out to Pfizer, the FDA, the Louisiana Department of Health, and the CDC, to no avail. In a change.org petition she started in November 2021, Desselle begged for a meeting with President Biden, the CDC, Dr. Fauci, and Bill Gates. Emphasizing that “no one should be ignored when pleading for medical help,” Desselle urged these COVID tyrants to “see us, hear us, study us, and help us!” Her petition’s heartfelt plea states, in part:\n\n“We were all pro-science and pro-vaccine. We were innocent people trying to do our part to help put an end to the horrific pandemic our nation was faced with. We are real people whose lives have been completely devastated and destroyed by our deteriorating health conditions after we followed your recommendation and trusted the science regarding the safety of the COVID vaccines.\n\nWe listened to you, President Biden, and Dr. Anthony Fauci as you told us these vaccines were safe. Unfortunately, they were not safe for those injured, and we desperately need your help for medical treatment and acknowledgement of the adverse reactions we have occurred.”\n\nConsidering the scope and the scale of the COVID-19 vaccine tragedy, as pointed out by Dr. Kory, social media platforms with prominent voices must step it up and perform solid research before speaking out. They must advocate for those suffering from vaccine injuries—it’s the only way. Ignorantly participating in the underlying narrative intent on dispelling the COVID jab tragedy by discrediting vaccine-injured American citizens is inhumane and completely unacceptable.", "opengraph": {"locale": "en_US", "type": "article", "title": "NO #ThanksPfizer: Profound Neurologic Response to the COVID Jab", "description": "Angelia Desselle was mocked & discredited after sharing a video and #ThanksPfizer to bring attention to her injuries following the COVID jab.", "url": "https://thehighwire.com/editorial/no-thankspfizer-profound-neurologic-response-to-the-covid-jab/", "site_name": "The HighWire", "article:modified_time": "2023-02-01T18:53:55+00:00", "image": "https://thehighwire.com/wp-content/uploads/2023/01/DESSELLE_ARTICLE_THUMB-scaled.jpg", "image:width": "2560", "image:height": "1440", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Dr Pierre Kory on why Alex Berenson was right once, but now continues to get it all wrong. <br/><br/>Watch the full interview with Dr. Kory, Del Bigtree, and Angelia Desselle, here: <a href=\"https://t.co/u1R4VxsAAE\">https://t.co/u1R4VxsAAE</a> <a href=\"https://t.co/08cvbDcTuh\">pic.twitter.com/08cvbDcTuh</a></p>— The HighWire (@HighWireTalk) <a href=\"https://twitter.com/HighWireTalk/status/1619086747216003073?ref_src=twsrc%5Etfw\">January 27, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">This is me after 1 dose of Pfizer on 1/5/2021 in the hospital. I was a very healthy 45 year old who managed a surgery center. Two years later I am still having major issues <a href=\"https://t.co/x026LRy6L8\">pic.twitter.com/x026LRy6L8</a></p>— Angelia Desselle (@AngeliaDesselle) <a href=\"https://twitter.com/AngeliaDesselle/status/1616809591928688641?ref_src=twsrc%5Etfw\">January 21, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">I hear from tons of people who have suffered serious mRNA injuries. Usually cardiac, sometimes autoimmune (or other). Performative nonsense does not help their cause any more than the magnet/5G idiocy helped vaccine skeptics in 2021, and I’m going to call it out. <a href=\"https://t.co/l7aQdEDnZ1\">https://t.co/l7aQdEDnZ1</a></p>— Alex Berenson (@AlexBerenson) <a href=\"https://twitter.com/AlexBerenson/status/1617328597936521217?ref_src=twsrc%5Etfw\">January 23, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Finally we are being heard! <a href=\"https://twitter.com/hashtag/wewanttobeheard?src=hash&amp;ref_src=twsrc%5Etfw\">#wewanttobeheard</a> <a href=\"https://t.co/LRqzZwCquD\">https://t.co/LRqzZwCquD</a></p>— Angelia Desselle (@AngeliaDesselle) <a href=\"https://twitter.com/AngeliaDesselle/status/1414395517757542400?ref_src=twsrc%5Etfw\">July 12, 2021</a></blockquote> \n"], "movies": [], "links": ["https://www.uncoverdc.com/2022/05/04/moderna-sec-filing-massive-mrna-product-pipeline-strategic-alliances-risk-factors/", "https://www.realnotrare.com/", "https://www.rollingstone.com/culture/culture-features/anti-vax-movement-new-misinformation-injuries-deaths-1234666611/", "https://twitter.com/tracybeanz/status/1619735314775556101?s=20&t=9EeirpoCQFlBnC03kL5KVA", "https://www.uncoverdc.com/2021/08/05/covid-profiteering-big-pharma-and-big-profits/", "https://www.medalerts.org/vaersdb/findfield.php", "https://www.uncoverdc.com/2022/07/06/dr-pierre-kory-there-is-hope-against-the-march-toward-totalitarianism/", "https://www.uncoverdc.com/2022/08/11/the-irrefutable-failure-of-covid-19-vaccines/", "https://t.co/u1R4VxsAAE", "https://t.co/08cvbDcTuh", "https://twitter.com/HighWireTalk/status/1619086747216003073?ref_src=twsrc%5Etfw", "https://react19.org/", "https://t.co/x026LRy6L8", "https://twitter.com/AngeliaDesselle/status/1616809591928688641?ref_src=twsrc%5Etfw", "https://twitter.com/AngeliaDesselle/status/1522948044043468800?s=20&t=XE4gVBK3dFeJthHnvfOlrA", "https://www.forbes.com/sites/conormurray/2023/01/25/how-a-thanks-pfizer-covid-misinformation-meme-went-viral/?sh=4a865d6362aa", "https://twitter.com/stillgray?s=20&t=_uDxlSj4x5DIf9-30gePeQ", "https://www.uncoverdc.com/2022/06/10/dark-to-light-a-big-announcement/", "https://www.uncoverdc.com/2022/07/07/something-is-happening-can-you-feel-it/", "https://www.uncoverdc.com/2021/07/02/the-great-reset-covid-19-cyberattacks-china-blackrock/", "https://twitter.com/stillgray/status/1523145221378248710?s=20&t=XE4gVBK3dFeJthHnvfOlrA", "https://twitter.com/CommunityNotes?s=20&t=F3A_wqwh4YlRnn0qaXyTLQ", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://twitter.com/stillgray/status/1619226856993206273?s=20&t=3Lj_ad8IKdgRyxcyPZd_Mw", "https://twitter.com/AlexBerenson/status/1617247807101980673?s=20&t=AmE27f7041niWeL6fXd8aw", "https://www.merriam-webster.com/dictionary/performative", "https://twitter.com/AlexBerenson/status/1617328597936521217?s=20&t=Wwja5HS7A-WFpBNkBV5URA", "https://twitter.com/AlexBerenson/status/1617328597936521217?s=20&t=lY1_P4UhDcuEFJ8tpi0kTw", "https://t.co/l7aQdEDnZ1", "https://twitter.com/AlexBerenson/status/1617328597936521217?ref_src=twsrc%5Etfw", "https://rumble.com/vm0x2j-angelia-desselle-has-full-body-convulsions-after-covid-19-vaccine..html", "https://twitter.com/AngeliaDesselle/status/1414395517757542400?s=20&t=AsbZlir4mO717adU8BOnvg", "https://thehighwire.com/videos/they-dont-want-to-see-people-like-us/", "https://twitter.com/hashtag/wewanttobeheard?src=hash&ref_src=twsrc%5Etfw", "https://t.co/LRqzZwCquD", "https://twitter.com/AngeliaDesselle/status/1414395517757542400?ref_src=twsrc%5Etfw", "https://twitter.com/AngeliaDesselle/status/1433760706084679680?s=20&t=AsbZlir4mO717adU8BOnvg", "https://www.uncoverdc.com/2022/06/20/cdc-now-targeting-20-million-u-s-infants-young-kids-for-covid-jab/", "https://www.uncoverdc.com/2021/07/14/faucis-emergency-teleconference-the-players/", "https://www.uncoverdc.com/2022/01/19/bill-gates-future-pandemics-reducing-the-population-tracking-vaccines/", "https://www.change.org/p/president-of-the-united-states-we-need-acknowledgment-medical-treatment-and-help-not-abandonment-by-our-government-please-hear-us-please-see-us-we-are-real-people?recruiter=930918901&recruited_by_id=6364af30-4345-11ec-8f21-e3817cdc5c5b&utm_source=share_petition&utm_campaign=share_petition&utm_term=petition_dashboard&utm_medium=copylink&utm_content=cl_sharecopy_31264286_en-US%3A3Dr.%20Anthony%20Fau"], "authors": [], "publish_date": "8:53 AM EST, Wed February 1, 2023"}