{"result_id": "299057", "URL": "https://thehighwire.com/news/cdc-investigating-whether-pfizer-covid-vaccine-increases-stroke-risk-for-people-over-65/", "timestamp": "2023-04-25 17:27:47 CEST+0200", "meta": {"description": "The CDC is investigating whether the Bivalent Pfizer-BioNTech vaccine creates an increased risk of ischemic stroke in people 65 and older.", "lang": "en", "keywords": "Health,Lifestyle,cdc,Coronavirus,COVID vaccine,vaccines", "favicon": "https://nypost.com/wp-content/themes/nypost-2016/static/images/apple-icons/nypost/apple-icon.png", "canonical": "https://nypost.com/2023/01/14/cdc-investigating-pfizer-covid-vaccine-for-stroke-risk/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "CDC investigating whether Pfizer COVID vaccine increases stroke risk for people over 65", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) says that a preliminary COVID-19 vaccine “safety signal” has been identified and is investigating whether the Bivalent Pfizer-BioNTech vaccine creates an increased risk of ischemic stroke in people 65 and older.\n\nIn the Friday statement, the CDC said that the preliminary signal hasn’t been identified with the Bivalent Moderna COVID-19 vaccine.\n\n“Following the availability and use of the updated (bivalent) COVID-19 vaccines, CDC’s Vaccine Safety Datalink (VSD), a near real-time surveillance system, met the statistical criteria to prompt additional investigation into whether there was a safety concern for ischemic stroke in people ages 65 and older who received the Pfizer-BioNTech COVID-19 Vaccine, Bivalent,” the CDC said.\n\n“Rapid-response investigation of the signal in the VSD raised a question of whether people 65 and older who have received the Pfizer-BioNTech COVID-19 Vaccine, Bivalent were more likely to have an ischemic stroke in the 21 days following vaccination compared with days 22-44 following vaccination.”\n\nAccording to the CDC, an ischemic stroke “occurs when blood clots or other particles block the blood vessels to the brain.”\n\nIn the statement, the CDC pointed out that a large study of updated bivalent vaccines from Pfizer-BioNTech “using the Centers for Medicare and Medicaid Services database revealed no increased risk of ischemic stroke.”\n\nThe agency also said that the Vaccine Adverse Event Reporting System (VAERS) managed by CDC and FDA has not seen an increase in reporting of ischemic strokes following the updated (bivalent) vaccine.\n\nIn a statement to Fox News Digital, a spokesperson for Pfizer said, “Pfizer and BioNTech have been made aware of limited reports of ischemic stroke that have been observed in the CDC Vaccine Safety DataLink (VSD) database in people 65 and older following vaccination with the Omicron BA.4/BA.5-adapted bivalent COVID-19 Vaccine by Pfizer and BioNTech.”\n\n“Neither Pfizer and BioNTech nor the CDC or the U.S. Food and Drug Administration (FDA) have observed similar findings across numerous other monitoring systems in the U.S. and globally and there is no evidence to conclude that ischemic stroke is associated with the use of the companies’ COVID-19 vaccines,” the spokesperson continued.\n\n“Compared to published incidence rates of ischemic stroke in this older population, the companies to date have observed a lower number of reported ischemic strokes following the vaccination with the Omicron BA.4/BA.5-adapted bivalent vaccine. The CDC continues to recommend vaccination with the Pfizer-BioNTech Omicron BA.4/BA.5-adapted bivalent COVID-19 vaccine for all authorized ages and indications.”\n\nFox News medical contributor Dr. Marc Siegel said that this isn’t “proof” of a link between the vaccine and strokes.\n\n“This is not proof. This is that they see there may be a link here, and they want to investigate it, and they’re trying to be transparent,” he said.", "opengraph": {"article:opinion": "false", "article:content_tier": "free", "type": "article", "title": "CDC investigating whether Pfizer COVID vaccine increases stroke risk for people over 65", "url": "https://nypost.com/2023/01/14/cdc-investigating-pfizer-covid-vaccine-for-stroke-risk/", "description": "The Centers for Disease Control and Prevention (CDC) says that a preliminary COVID-19 vaccine “safety signal” has been identified and is investigating whether the Bivalent Pfizer-BioNTe…", "article:published_time": "2023-01-14T17:39:12+00:00", "article:modified_time": "2023-01-14T17:39:23+00:00", "site_name": "New York Post", "image:width": "1024", "image:height": "683", "locale": "en_US", "image:type": "image/jpeg", "image": "https://nypost.com/wp-content/uploads/sites/2/2023/01/NYPICHPDPICT000004918704.jpg?quality=75&strip=all&w=1024", "image:secure_url": "https://nypost.com/wp-content/uploads/sites/2/2023/01/NYPICHPDPICT000004918704.jpg?quality=75&strip=all&w=1024", "article:publisher": "https://www.facebook.com/nypost"}, "tags": ["Coronavirus", "vaccines", "cdc", "COVID vaccine"], "tweets": [], "movies": [], "links": ["http://foxnews.com", "https://www.foxnews.com/health/fear-flu-flare-ups-holidays-didnt-happen-says-cdc", "https://www.foxnews.com/video/6318676038112", "https://www.foxnews.com/lifestyle/bible-quiz-how-much-know-bible-test", "https://nypost.com/2023/01/12/moderna-under-fire-for-400-price-hike-for-its-covid-vaccine/", "https://nypost.com/2022/10/21/pfizer-says-covid-19-vaccine-will-cost-110-130-per-dose/", "https://nypost.com/2023/01/14/omicron-subvariant-xbb-1-5-possibly-more-likely-to-infect-the-vaccinated-officials/", "https://nypost.com/2023/01/14/omicron-subvariant-xbb-1-5-possibly-more-likely-to-infect-the-vaccinated-officials/", "https://nypost.com/2023/01/14/omicron-subvariant-xbb-1-5-possibly-more-likely-to-infect-the-vaccinated-officials/"], "authors": [], "publish_date": "2023-01-14T17:39:12+00:00"}