{"result_id": "299016", "URL": "https://thehighwire.com/editorial/flu-shot-pushed-on-pregnant-women-despite-unanswered-safety-risks/", "timestamp": "2023-04-25 17:24:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/flu-shot-pushed-on-pregnant-women-despite-unanswered-safety-risks/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Flu Shot Pushed On Pregnant Women Despite Unanswered Safety Risks", "cleaned_text": "Statnews recently reported, “there’s reason to believe two of the four choices made last winter for this upcoming season’s vaccine could be off the mark.” In other words, this year’s flu vaccine is mismatched. Statnews explains, “the Northern Hemisphere vaccine didn’t match the strains of those viruses that are now dominant.” Despite these significant questions over the efficacy of this year’s flu shot, media headlines are buzzing with impassioned pitches for everyone, from children to the elderly, and even expecting mothers, to run out and get their ‘safe and effective’ flu shot today.\n\nWhy does the media adhere to the dogma of ‘safe and effective’, even in the face of doubts raised by the the World Health Organization? And does the science back up the assertion of ‘safe for all’. What experts refer to as ‘robust’ vaccine safety science leaves many questions unanswered, especially for pregnant women. Most popular flu shots recommended by the U.S. Centers for Disease Control and Prevention (CDC), including Flucelvax, FluLaval, Flublok, Fluarix, Afluria, Fluzone, and Fluvirin, contain variations of the following statement on their product insert:“\n\n“Available data on [name of vaccine] administered to pregnant women are insufficient to inform vaccine-associated risks in pregnant women.”\n\nBelow is the information contained in each flu vaccine insert required by the U.S. Food and Drug Administration (FDA) and the specific language surrounding the lack of science to inform pregnant women of the risks from the shot.\n\nIn addition, every flu shot listed above states the following on its insert:\n\n“has not been evaluated for carcinogenic or mutagenic potential”\n\nDespite what your health practitioner, media outlet, or regulatory agency will say as they attempt to convince you to get the flu vaccine, the shot has not been evaluated for overall cancer risks or safety in pregnant women. In addition, pregnant women who receive the flu vaccine are considered phase 4 test subjects. Having been enrolled in research without their knowledge, these expecting mothers have been injected with a vaccine with unknown health consequences to themselves and their child.\n\nBeyond the ethical and scientific issues inherent when targeting pregnant women with the flu shot, there also exists a licensing issue which falls squarely on the shoulders of the FDA. \n\n\n\nAfter failing to produce the clinical trials and safety studies relied upon to license both the flu and TdaP vaccines for use in pregnant women when presented with a FOIA request, the FDA was taken to court. The agency conceded, “Clinical studies for TdaP and inactivated influenza vaccines did not specifically enroll pregnant women.” The FDA legal response went on to admit they “have no records responsive to your [plaintiff’s] request.” In short, the agency licensed the shots for use in pregnant women without the required scientific studies to ensure safety. In addition to the FDA licensing the flu and TdaP vaccines outside of law and their own policy, the agency also actively promotes and markets the flu shot to pregnant women on social media.\n\nGoing beyond the above-stated issues, it’s technically impossible to test flu vaccines properly.\n\nAs explained by Dr. Mark Geier, PhD, the CDC does not follow the law for vaccines in requiring long-term safety testing for the influenza vaccine like they do with other vaccines, as it is impossible to test a vaccine that changes every year.\n\nThe Department of Justices’ quarterly reports of vaccine injury reveal that the flu shot remains the most dangerous vaccine based on injuries and death compensated by the U.S. Government. According to the report, Guillain-Barre Syndrome is the most frequent complication from the flu vaccine. Other complications include fibromyalgia, transverse myelitis, chronic inflammatory demyelinating polyneuropathy, acute disseminated encephalomyelitis, and death.\n\nA recent survey conducted by NORC at the University of Chicago on behalf of the National Foundation for Infectious Diseases found only 52 percent of respondents overall said they plan to get a flu shot this season. The survey was conducted in August before it was publicly announced that the World Health Organization did not select the correct strain dominant in the Northern Hemisphere signaling suboptimal efficacy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Flu Shot Pushed On Pregnant Women Despite Unanswered Safety Risks", "description": "By Jefferey Jaxen Statnews recently reported, “there’s reason to believe two of the four choices made last winter for this upcoming season’s vaccine could be off the mark.” In other words, this year’s flu vaccine is mismatched. Statnews explains, “the Northern Hemisphere vaccine didn’t match the strains of those viruses that are now dominant.” Despite […]", "url": "https://thehighwire.com/editorial/flu-shot-pushed-on-pregnant-women-despite-unanswered-safety-risks/", "site_name": "The HighWire", "image": "https://thehighwire.com/wp-content/uploads/2021/07/The-HighWire-LIVE.jpg", "image:width": "800", "image:height": "450", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.statnews.com/2019/09/30/flu-vaccine-selections-may-be-an-ominous-sign-for-this-winter/", "https://abc7chicago.com/health/cdc-concerned-not-enough-pregnant-women-getting-flu-shot/5602216/", "https://youtu.be/KTLDLD7vi-M?t=3253", "https://youtu.be/KTLDLD7vi-M?t=3279", "https://twitter.com/US_FDA/status/1045341663277838336", "https://www.youtube.com/watch?v=nvXIqUyOdK4", "https://vaccineimpact.com/2019/september-government-report-shows-206-million-paid-so-far-in-2019-for-vaccine-injuries-and-deaths/", "https://medicalxpress.com/news/2019-10-survey-adults-flu-vaccine.html"], "authors": [], "publish_date": "10:50 AM EDT, Thu October 10, 2019"}