{"result_id": "299040", "URL": "https://thehighwire.com/news/outrage-as-university-of-toronto-becomes-one-of-first-places-to-require-booster-shot/", "timestamp": "2023-04-25 17:26:32 CEST+0200", "meta": {"description": "While vaccine mandates are now long gone in settings ranging from bars and restaurants to hospitals and airplanes across Canada, the University of ...", "lang": "en", "keywords": "u,of,t,university,of,toronto,covid,booster,shot,vaccine,policy", "favicon": "https://static.blogto.com/static/img/favicon/apple-touch-icon.png", "canonical": "https://www.blogto.com/city/2022/07/people-arms-u-t-first-places-require-booster-shot/", "encoding": "utf-8"}, "image": null, "domain": "thehighwire.com", "title": "People are up in arms as U of T becomes one of first places to require a booster shot", "cleaned_text": "While vaccine mandates are now long gone in settings ranging from bars and restaurants to hospitals and airplanes across Canada, the University of Toronto has introduced an even more rigorous inoculation policy than during the peak of the pandemic, and it's proving to be quite controversial.\n\nThe institution released an updated COVID planning policy this week that outlined new rules for students and employees planning to stay on campus this coming school year, and they're more stringent than many anticipated.\n\n\"U of T has reinstated the vaccination requirement for students and employees living in university residences,\" a release from Thursday reads, going on to state that \"students living in residences this fall will be required to have a primary series of a COVID-19 vaccine and at least one booster dose before moving in.\"\n\nMany are wondering if this is one of the first places in Ontario or even all of Canada to require such a measure, as the standard up until this point — a standard that has, again, been nixed across the board as of late — is only two doses, not a third or fourth as the school is now requiring.\n\nStudents and staff are being asked to submit vaccination documentation for verification through a proprietary portal called UCheck, which the university says \"will minimize disruption should conditions require vaccine requirements to be reimposed,\" such as for in-person classrooms, which is apparently a possibility down the line.\n\nU of T is also strongly encouraging the use of masks in high-density indoor spaces on campus, stating that its mask mandate is \"paused.\" The use of masks is no longer required in any setting aside from in-flight air travel in Canada.\n\nThe justification the university provided is that living in residence means living in close quarters, and that being up-to-date on COVID vaccination \"reduces isolation requirements of those who are sick with COVID-19.\"\n\nStill, tons of people are taking issue with the requirement, and it doesn't appear to be just the usual anti-vax groups of yore, either.\n\nThe province just opened up eligibility for fourth doses/second boosters of the COVID vaccine to all adults earlier this month, though the Chief Medical Officer of Health said that \"while we're making this option available, it is important to note that healthy, currently-vaccinated individuals continue to have significant persistent protection against severe disease\" and did not recommend it for these groups.\n\nU of T remains the top university in the country, and attracts tens of thousands of international students — who are most likely to live in residence, the most affordable and practical option — per semester.", "opengraph": {"article:tag": "Social Issues", "site_name": "blogTO", "url": "https://www.blogto.com/city/2022/07/people-arms-u-t-first-places-require-booster-shot/", "title": "People are up in arms as U of T becomes one of first places to require a booster shot", "image": "https://media.blogto.com/articles/20220729-u-of-t.jpg?w=1200&cmd=resize_then_crop&height=630&quality=70", "image:width": "1200", "image:height": "630", "description": "While vaccine mandates are now long gone in settings ranging from bars and restaurants to hospitals and airplanes across Canada, the University of ...", "type": "article"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The vaccines are great as they reduce serious illness and which can overload our healthcare system.<br/>\n<br/>&#13;\nBUT, the vaccines no longer prevent transmission so this can only be about a paternalistic \"we know better than you what is good for your health\" intervention. Not U of T's role!</p>&#13;\n— David Hume (@DavidHu20354920) <a href=\"https://twitter.com/DavidHu20354920/status/1553053633494732802?ref_src=twsrc%5Etfw\">July 29, 2022</a></blockquote>\n \n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">First case I've noticed of a firm or agency requiring three doses to qualify as safely vaccinated.<br/>\n<br/>&#13;\n(Note the provincial vaccine certification system is no longer operating so I'm not sure how of U of T intends to verify this) <a href=\"https://t.co/snFXoXbHZW\">https://t.co/snFXoXbHZW</a></p>&#13;\n— John Michael McGrath (@jm_mcgrath) <a href=\"https://twitter.com/jm_mcgrath/status/1553032673177870336?ref_src=twsrc%5Etfw\">July 29, 2022</a></blockquote>\n \n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">I haven't commented on this, but I will now.<br/>\n<br/>&#13;\nI am glad that the U of T has removed its mask mandate and I hope it doesn't return.<br/>\n<br/>&#13;\nHowever, renewing a vaccine mandate for young adults in residence is needlessly divisive.<br/>\n<br/>&#13;\nMost have had Omicron by now -- natural immunity. <a href=\"https://t.co/h4gtqUTU68\">https://t.co/h4gtqUTU68</a></p>&#13;\n— Questions-in Ontario (@QuestionsinOnt1) <a href=\"https://twitter.com/QuestionsinOnt1/status/1553037427891134465?ref_src=twsrc%5Etfw\">July 29, 2022</a></blockquote>\n \n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Their justification is astoundingly flimsy - based ONLY on government/PH isolation policy. This cannot be allowed to stand as a valid reason for violation of informed consent or medical privacy <a href=\"https://t.co/Hxq85VU037\">pic.twitter.com/Hxq85VU037</a></p>&#13;\n— 🚚🚚 Unacceptable 51% Tin Foil For a Minute (@FoolForaMinute) <a href=\"https://twitter.com/FoolForaMinute/status/1552819161876791297?ref_src=twsrc%5Etfw\">July 29, 2022</a></blockquote>\n \n"], "movies": [], "links": ["https://www.cbc.ca/news/canada/toronto/ontario-covid19-march-14-2022-1.6384087", "https://www.blogto.com/travel/2022/06/canada-ending-vaccine-mandates-travel/", "https://www.utoronto.ca/utogether/covid-19-planning-update", "https://twitter.com/DavidHu20354920/status/1553053633494732802?ref_src=twsrc%5Etfw", "https://t.co/snFXoXbHZW", "https://twitter.com/jm_mcgrath/status/1553032673177870336?ref_src=twsrc%5Etfw", "https://t.co/h4gtqUTU68", "https://twitter.com/QuestionsinOnt1/status/1553037427891134465?ref_src=twsrc%5Etfw", "https://t.co/Hxq85VU037", "https://twitter.com/FoolForaMinute/status/1552819161876791297?ref_src=twsrc%5Etfw", "https://www.blogto.com/city/2022/07/book-fourth-dose-covid-vaccine-ontario/", "https://www.blogto.com/city/2022/07/u-of-t-ranked-best-canadian-university"], "authors": [], "publish_date": "2022-07-29 13:15"}