{"result_id": "299050", "URL": "https://thehighwire.com/editorial/why-covid-vaccine-trials-should-alarm-everyone/", "timestamp": "2023-04-25 17:27:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/why-covid-vaccine-trials-should-alarm-everyone/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Why COVID Vaccine Trials Should Alarm Everyone", "cleaned_text": "The corporate media is breathlessly chronicling a vaccine arms race against coronavirus. They’ve not done much to keep Americans up to date about the multiple oddities and inconsistencies that have emerged.\n\nFor starters: Both the Lancet and New England Medical Journal (NEMJ)—fresh off being forced to retract fraudulent studies that attempted to debunk hydroxychloroquine—published reviews of coronaries vaccines from Moderna (U.S.) and Oxford (U.K.).\n\nBoth vaccine-makers previously chose to release their science by press release, where it was easily and eagerly gobbled up and regurgitated by a long-neutered press too scared for their employment and funding to ever question an injectable medical product.\n\nThen there’s Bill Gates, whose measured persona of Dr. Evil channeled through Mr. Rogers folded like a lawn chair under the softest of softball questions in a recent CBS interview about vaccine’s adverse reactions (or, harms).\n\nThrough all his bizarre and distracting hand waving, like a sorcerer missing his wand, Gates stumbled and flubbed his way through the interview. He finally managed to eke out a plaintive plea to authority, hinging coronavirus vaccine safety on FDA’s ‘gold standard.’\n\nAh yes. The FDA ‘gold standard.’ A ‘standard’ that, in the past, has allowed multiple fixtures of the childhood immunization schedule to be freely injected into American children with laughably limited safety testing windows. And by “laughable,” we mean “tragic.”\n\nThe two Hepatitis B vaccines licensed in the United States for newborns are Recombivax HB (Merck) and Engerix-B (GSK). Both were licensed based on clinical trials, which reviewed so-called solicited and unsolicited reactions for no longer than five days after vaccination.\n\nApril in the U.K., headlines reported Britain’s AstraZeneca would join forces with Oxford University in an effort to “accelerate the globalization of a vaccine,” according to their CEO.\n\nMore recently, Reuters reported AstraZeneca was granted legal protection from future product liability claims related to its COVID-19 vaccine. This shocks no one who’s followed the long track record of poor vaccine safety science, and the refusal of manufacturers to stand behind their product. But that fact is one the corporate media keeps quite quiet, so share it with everyone you can.\n\n“This is a unique situation where we as a company simply cannot take the risk if in … four years the vaccine is showing side effects,” Ruud Dobber, a member of Astra’s senior executive team, told Reuters.\n\nThe report went on to explain:\n\n“E.U. officials told Reuters this week product liability was among contentious points in European efforts to secure supply deals for potential COVID-19 vaccines from Pfizer, Sanofi and Johnson & Johnson. The United States, however, already has a law to exclude tort claims from products that help control a public-health crisis in the form of the 2005 Public Readiness and Emergency Preparedness, or PREP Act.”\n\nWhile some of Moderna’s key leadership dumped all their stocks and cashed out, the NEJM reported on Moderna’s shot:\n\nOxford’s shot didn’t fare much better with its early studies on rhesus monkeys. Its data was released in May.\n\nNevertheless, they proceeded with full speed to human safety, then efficacy trials. In late July, researchers from Oxford University and AstraZeneca released results from a Phase I/II trial.\n\nEven wired.com, an outlet regularly quick to discriminately label anyone who questions vaccine safety ‘anti-vax,’ was forced to write that both Moderna and Oxford’s trials were “not off to a good start.” Wired admitted, “The evidence so far suggests that we’re getting blinkered by these groups’ P.R., and so seduced by stories of their amazing speed that we’re losing track of everything else.”\n\nNIAID director and non-protest-opining Dr. Anthony Fauci continued to grandstand before Congress, however. Fauci claimed that only data from a randomized, placebo-controlled trial would be the gold standard to evaluate hydroxychloroquine.\n\nThis brings us to Oxford’s newest vaccine trial results, published in the Lancet. Remember, the Lancet just delivered one of the biggest retractions in modern history, attempting to debunk hydroxychloroquine using fraudulent data. Early on in the process, Oxford researchers switched out the true inert placebo for the meningococcal vaccine MenACWY. “Use of saline as a placebo would risk unblinding participants as those who had notable reactions would know they were in the ChAdOx1 nCoV-19 vaccine group,” the researchers claimed as an excuse to not run a proper scientific study.\n\nThe study stated it would use 1077 “healthy adults aged 18–55 years with no history of laboratory-confirmed SARS-CoV-2 infection or of COVID-19-like symptoms.”\n\nYet the study goes on to seemingly contradict those words by then stating, “A small number (four [4%] of 98) participants had neutralizing antibody titers greater than 8 against SARS-CoV-2 spike protein before vaccination (Marburg V.N.), and 11 (4%) of 270 participants had high ELISA titers at baseline, representing possible prior asymptomatic infection.”\n\nOnly ten of the 543 participants received a booster dose through non-randomized, unblinded choosing. Many experts have speculated that COVID antibodies wane and an eventual COVID vaccine will require a second booster. Yet researchers only chose to do the study with ten [non-randomized, unblinded] participants.\n\nAnother questionable act came when the researchers did “a protocol amendment in two of the five sites,” allowing prophylactic paracetamol to be administered before vaccination. The drug appeared to be given to lessen the severity of adverse events. No discussion of how it may harm the integrity of the trial results was explored.\n\nCOVID vaccine recipients had more adverse reactions in the trial than those receiving the placebo-turned-comparator meningococcal vaccine:\n\nWhat would the harms look like if paracetamol wasn’t given?\n\nOn May 21, the U.S. gave AstraZeneca $1 billion in funding for Oxford’s coronavirus vaccine development. Yet, researchers appear to have taken a less-than-ideal approach showing difficulty in being able to fully analyze samples.\n\nWith questionable-at-best players like Gates and Fauci marketing unproven mRNA and DNA vaccines using unclear science during their studies, while being cheered on by a mostly acquiescent hero-worshipping corporate news media, it has been left to the public and independent journalists to call them out at every turn.\n\nWith increasingly draconian censorship of critical analysis and those who give it, there is no greater time to stand up. Now is the time to speak out and share the information you find most important. You might never get another chance.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why COVID Vaccine Trials Should Alarm Everyone", "description": "By Jefferey Jaxen The corporate media is breathlessly chronicling a vaccine arms race against coronavirus. They’ve not done much to keep Americans up to date about the multiple oddities and inconsistencies that have emerged.  For starters: Both the Lancet and New England Medical Journal (NEMJ)—fresh off being forced to retract fraudulent studies that attempted to […]", "url": "https://thehighwire.com/editorial/why-covid-vaccine-trials-should-alarm-everyone/", "site_name": "The HighWire", "image": "https://thehighwire.com/wp-content/uploads/2021/07/Screen-Shot-2020-08-02.png", "image:width": "800", "image:height": "420", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/jb_handley/status/1287601151106408455?s=20", "https://twitter.com/jb_handley/status/1287601151106408455?s=20", "https://www.icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://www.icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://uk.reuters.com/article/us-astrazeneca-results-vaccine-liability/astrazeneca-to-be-exempt-from-coronavirus-vaccine-liability-claims-in-most-countries-idUKKCN24V2EN", "https://uk.reuters.com/article/us-astrazeneca-results-vaccine-liability/astrazeneca-to-be-exempt-from-coronavirus-vaccine-liability-claims-in-most-countries-idUKKCN24V2EN", "https://www.statnews.com/2020/05/27/moderna-executives-cashed-out-shares-stock-price-soared/", "https://www.nejm.org/doi/full/10.1056/NEJMoa2022483#figures_media", "https://www.forbes.com/sites/williamhaseltine/2020/05/16/did-the-oxford-covid-vaccine-work-in-monkeys-not-really/#1e1e506b3c71", "https://www.washingtonpost.com/world/europe/oxford-coronavirus-vaccine-phase-1-lancet/2020/07/20/12fbbc92-c857-11ea-a825-8722004e4150_story.html", "http://wired.com/", "https://thehighwire.com/wp-content/uploads/2020/08/Fauci.mp4", "https://www.theguardian.com/commentisfree/2020/jun/05/lancet-had-to-do-one-of-the-biggest-retractions-in-modern-history-how-could-this-happen", "https://www.thelancet.com/action/showPdf?pii=S0140-6736%2820%2931604-4"], "authors": [], "publish_date": "12:43 PM EDT, Sun August 2, 2020"}