{"result_id": "299025", "URL": "https://thehighwire.com/editorial/experts-weigh-in-mrna-spike-lnps-invade-entire-body-stop-jabs-now/", "timestamp": "2023-04-25 17:25:23 CEST+0200", "meta": {"description": "Numerous experts have confirmed that the toxic experimental mRNA jabs travel and then settle inside every organ in the human body.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/experts-weigh-in-mrna-spike-lnps-invade-entire-body-stop-jabs-now/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Experts Weigh In: mRNA Spike & LNPs Invade Entire Body, Stop Jabs Now", "cleaned_text": "Humanity reached a critical turning point in medicine when untested mRNA lipid nanoparticle-based injections were introduced to the world during COVID-19. Unlike any synthetic drug before it, these mass-distributed mRNA shots, functioning via lipid nanoparticles (LNPs), will no doubt help facilitate the rapid development and unification of NBIC technologies—nanotechnology, biotechnology, information technology, and cognitive science—which, some say, seek to end disease, aging, and perhaps even death. Significantly, it is at this juncture that the integration of technology will undoubtedly manipulate human performance. Yet, in a dangerous foreshadowing of what lies ahead, the lipid nanoparticles (LNPs) delivering the spike protein in the COVID-19 gene therapy jabs did little to end disease or death. Instead, both the mRNA spike and LNPs are causing considerable illness and mortality as they travel through the bodies of those injected, crossing the blood-brain barrier and settling into essentially every organ in the human body.\n\nControversial at the time—and completely ignored by the CDC, FDA, the Biden administration, and others—its been nearly two years since the eye-opening Japanese Pfizer biodistribution study was made public by viral immunologist Dr. Byram Bridle thanks to a freedom of information request made to the Japanese government. The groundbreaking research presented Bridle and other research scientists with a first-hand and more reliable understanding of where the experimental COVID “vaccine” product travels in the body following injection. At the time, Bridle answered the question of whether the harmful mRNA-LNP jab stays in the shoulder muscle as claimed by those demanding society be injected, asserting:\n\n“The short answer—is absolutely not. It’s very disconcerting. The spike protein gets into the blood, circulates through the blood in individuals over several days post-vaccination. Once it gets in the blood, it accumulates in a number of tissues such as the spleen, the bone marrow, the liver, [and] the adrenal glands. And of particular concern for me is it accumulates in the ovaries, in quite high concentrations.”\n\nIndeed, far from what the deliberately frightened public was told—that the wonder-drug COVID jab would stay in the arm and enter the muscle cells at the injection site to prevent COVID-19—the injection site is simply the point of departure for a journey intended to take the highly inflammatory mRNA-LNP product instead to the lymph nodes, where the toxic shot has been shown to linger for at least sixty days. Perhaps even longer, but sixty days is as far as it has been tracked. Yet regulators remain silent. And as explained by Dr. Robert Malone, along with the highly inflammatory LNPs, the mRNA, which is not actually mRNA but a highly modified molecule containing pseudouridine, is, among other things, immunosuppressive. Noting that the immunosuppression was intentional to overcome the LNPs inflammatory response, Malone added:\n\n“But this is like a sword that cuts both ways. It shuts down the inflammatory response due to the drug product, but it also nonspecifically shuts down other forms of immune response. So the highly pseudouridine-modified mRNAs are intrinsically immunosuppressive.\n\nAnother thing—when they did the lymph node biopsy—that [big] pharma and the government told everyone, including the docs, [was] that the RNA just stuck around for a couple of hours. It doesn’t. The study showed that they could still detect the intact “RNA” in people’s lymph nodes for 60 days, which is as long as they tested after injection.”\n\nWith the mRNA-LNP product lingering at various places throughout the body for at least 60 days, Malone notes that it produces the toxic spike protein during that time. Thus, the CDC’s assertion that adverse events related to the jab occur in a short window of roughly two weeks after injection is altogether false. According to Malone, if the drug product is still there and “potentially still biologically active for up to 60 days later,” then all the data we have on adverse events and the deaths coming from official sources is “garbage” because it is based on false assumptions.\n\nIn agreement with Dr. Malone is Dr. Jessica Rose. Early in the COVID vaccine program, Rose asserted what is now known to be true—that the so-called “COVID vaccines” are not actual vaccines but rather injections of genetic material with toxic foreign proteins. Rose has seen “off-the-charts” unusual safety signals in VAERS (Vaccine Adverse Event Reporting System), including the rise of unusual cancers, myocarditis, particularly in young males, and fertility and menstrual challenges faced by thousands of women.\n\nRegarding the LNPs, which have a known toxicity profile, Rose explained that both the Pfizer-BioNTech and Moderna shots are composed of four different lipids, including a “highly charged, positive cationic lipid.” The safety data sheet for one of Moderna’s lipids, SM-102, plainly states it is not for human or veterinary use. According to Rose, the known toxicity of LNPs is the primary reason the technology has not been successfully utilized in humans on a large scale “before now.” With an extensive and essentially involuntary clinical trial currently underway with the COVID “vaccine” program, Rose commented:\n\n“So it raises more question marks about why and how did both of these manufacturers manage to come up with a different cationic lipid that all of a sudden is safe. The answer is they’re not. PEG is also questionable. This is another lipid that both of them use in their formulations. Everyone has heard of PEG producing anaphylactic reactions in certain people, and this is definitely a problem.\n\nAgain, toxicity and allergenic profiles are known in the constituents of these lipid nanoparticles. And for those who don’t know, these [LNPs] are the packages for the modified mRNA, which are specifically modified to be very stable and durable, so they don’t break down quickly like we were told. And the LNPs are slippery and slidey and designed to basically go everywhere. They go everywhere. They bioaccumulate, and they dump their payload wherever they land. And that could be in the ovaries, in the heart, in the liver, in the adrenal glands, the spleen, and in the brain.\n\nWherever they land [in the body], they’re going to dump their payload, which is this modified mRNA, and the cells are going to start manufacturing mass amounts of protein, toxic foreign protein. It’s shocking to me, and it’s hard to swallow. How do you tell people that this thing they’re being injected with is not supposed to be being injected into humans?”\n\nAlso extremely concerned, Dr. Ryan Cole has spoken relentlessly about what he describes as the COVID-19 “failed vaccine program.” Speaking recently in the U.S. Senate, Cole explained that human cells are meant to make human proteins, not the “foreign toxic proteins” in the mRNA jabs. Calling the technology “harmful,” Cole confirmed that COVID-19 injections are just the tip of the iceberg, saying, “they’re going to try and do lipid nanoparticles plus influenza genes, plus RSV genes, and for all these other shots going forward.” He added that it is interesting where the spike lands and chooses to deposit, which is not necessarily in all organs. According to Cole, where the spike chooses to deposit depends on age, gender, and other factors; for example, examining an apparent cardiac death may reveal an adrenal gland death instead, all due to the toxic mRNA gene therapy products.\n\nMoreover, commenting on the rise in cancers, Cole noted that inside every cancer cell, he’s seeing spike protein. Similarly, after the vaccine rollout, Cole said he noticed a surge in endometrial cancers, adding that “the women have been getting younger and younger.” Describing his concern over big pharma and the government’s constant push of this tyrannical agenda, Cole talked about the harm it wreaks on the bodies of those injected, stating:\n\n“And does it damage the brain? You bet it does. Does it damage the heart? Yes. The liver? Yes. The bone marrow? Yes. It causes all sorts of harm in the human body. We should have stopped this before it ever started.\n\nThis is a new technology that many, many people have gotten. This platform is sufficiently proven to be dangerous that not only do the COVID shots need to be stopped, but also the platform and these agencies that have taken upon themselves carte blanche to keep pushing this forward as though they’ve done ten years of safety studies. They have not, and that is my biggest scientific concern.\n\nWe see enough things already happening wrong that going forward, I think that the message to humanity, to regulatory agencies, to government officials that are willing to step in and block regulatory corruption, is [quit] allowing something experimental to continue going forward that is proven to be harmful and has no signal of safety.”\n\nScreenshot / YouTube / Combating the Pandemic: Breaking the Wall to mRNA Vaccines | Özlem Türeci\n\nThere is no question whether the experimental mRNA COVID-19 gene jabs travel to and settle in nearly all body parts and cross the blood-brain barrier. Dr. Peter McCullough, who has been vocal regarding his concerns related to myocarditis and other vaccine-related heart adverse events, recently reported that young people suffering from myocarditis have “freely circulating” whole spike protein from the vaccine settled directly in their heart. “It’s found in the heart and staying by the heart,” he asserted, adding, “so the vaccines install the genetic code through lipid nanoparticles, which circulate in the body for easily a month or more, they install the genetic code in the heart directly damaging the heart, damaging blood vessels, causing blood clots.” Looking ahead, McCullough emphasized the fact we have “no idea” what will happen long term now that the vaccine products are in the body. Frightening to think about, he indicated studies suggest that the vaccines and the spike protein that is produced from them “never leaves the human body.”\n\nThe maddening fact that COVID-19 jabs haven’t been pulled strictly due to young people suffering from myocarditis is terrible enough. Knowing infants are still being given the contaminated jab is simply incomprehensible. And the list of reasons the injections should be stopped immediately grows daily. Adding to that list, as discussed by Dr. Peter McCullough last November, is a comprehensive study establishing that those “who have worked so hard to remain healthy and free of COVID-19 vaccination” are instead now “grappling with the issue of nucleic acid and Spike protein shedding as a potential concern.” Yes, thanks to the shedding of the experimental DARPA-funded gene therapy product the unvaccinated very intentionally strived to avoid, they are also at risk. The study, conducted by Helene Banoun, a Pharmacist biologist, former Inserm researcher, and Member of the Independent Scientific Council, Marseille, 13000, France, immediately asserts:\n\n“The massive COVID-19 vaccination campaign is the first time that mRNA vaccines have been used on a global scale. The mRNA vaccines correspond exactly to the definition of gene therapy of the American and European regulatory agencies. The regulations require excretion studies of these drugs and their products (the translated proteins). These studies have not been done for mRNA vaccines (nor for adenovirus vaccines). There are numerous reports of symptoms and pathologies identical to the adverse effects of mRNA vaccines in unvaccinated persons in contact with freshly vaccinated persons. It is therefore important to review the state of knowledge on the possible excretion of vaccine nanoparticles as well as mRNA and its product, the spike protein.”\n\nIn line with the notion that the mRNA vaccine spike protein encapsulated in LNPs spreads throughout the body, the study declares that after injection, LNPs (or their natural equivalent, exosomes or extracellular vesicles (EVs)) can be excreted through bodily fluids (sweat, sputum, breast milk) and pass the transplacental barrier. Additionally, the study states, “these EVs are also able to penetrate by inhalation and through the skin (healthy or injured) as well as orally through breast milk,” and conceivably through semen during sexual intercourse. With that frightening knowledge, Banoun insists:\n\n“It is urgent to enforce the legislation on gene therapy that applies to mRNA vaccines and to carry out studies on this subject while the generalization of mRNA vaccines is being considered.”\n\nScreenshot / YouTube / Combating the Pandemic: Breaking the Wall to mRNA Vaccines | Özlem Türeci\n\nWith rapid manufacturing “on demand” the intended future for mRNA vaccines—as stated by DARPA, Moderna, and Özlem Türeci, Co-Founder and Chief Medical Officer of BioNTech, and Pfizer—there is an urgent need for strict regulations surrounding any mRNA rollout. Rushed or no testing won’t cut it, and humans can’t continue to be the guinea pigs. Stunned by the COVID-19 vaccine program and incredible misinformation, Dr. James A. Thorp, a Maternal Fetal Medicine Doctor, spoke of the madness surrounding the situation, declaring:\n\n“It’s misinformation from the CDC, the FDA, the American Board of Obstetrics and Gynecology, the American College of OB/GYN, and the Society of Maternal Fetal Medicine. It’s misinformation from those organizations that are causing a lot of death and injury in my women of reproductive age, my pregnant women, and my pre-born babies. And it’s gotta stop. And it’s gotta stop now.\n\nThe first and most important thing—don’t take any more vaccines, don’t take any more boosters. Do not take any more dangerous experimental therapies.”\n\nAs aptly put by Dr. Lynn Fynn, who is taking necessary action to ensure reliable testing moving forward, “those of us paying attention are fully aware that the LNPs and spike from the jab have the capacity to infiltrate nearly every part of the body.” For her clinical trials post-COVID, given the massive impact of the mRNA spike protein and LNPs on the body, Dr. Fynn shared that her study participants will be asked whether or not they are vaccinated, as she doesn’t want to use vaccinated subjects to test a study medication. She will also include the added expense of serology tests of IgG spike and IgG Nucleocapsid on screening. She explained:\n\n“When randomizing patients for clinical trials, we require clean health, no drug or alcohol abuse, or anything else that would be exclusion criteria in order to keep the study medication data as clean as possible. Screening only uncovers so much.\n\nUnfortunately, what we are seeing is that, since we cannot sequester based on vax and booster status, many of the vax side effects or underlying pathology will be attributed to the study medications under review instead of pre-existing jab pathology.”\n\nDr. Pierre Kory has also repeatedly shared his trepidation over the mRNA-LNP shots, stating, “the federal government is captured, and it’s captured by corporate interests,” including big pharma, which has made billions off the pandemic. He insists the entire U.S. population, as well as the world, must understand they can no longer take the COVID vaccines, summarizing:\n\n“They are toxic, lethal, and ineffective—they have completely failed. They can only be viewed as harmful, and they need to be stopped.”\n\nWhy isn’t the Biden administration, the CDC, FDA, big pharma, other governments, the World Health Organization, the World Economic Forum, and the United Nations listening to these experts as they share their warnings? Especially since, as pointed out by Dr. Banoun and others, the mRNA “vaccines” fit the definition of gene therapy defined by the American and European regulatory agencies, demanding the need for more extensive studies.\n\nIt is not an exaggeration to state that it is possible to continue at length delivering overwhelming evidence—both documented and anecdotal—on the extensive nature in which the toxic spike protein and LNPs travel and then settle throughout the body, wreaking havoc wherever they land. In addition, it is worth mentioning that there is also considerable unease around the DARPA-funded gene therapy jab technology that extends into areas that may, for now, be regarded as “conspiracy theory.” For example, we could ponder the assertion by some that the injections contain graphene oxide and hydrogels (which are listed in Moderna’s patent for Modified Polynucleotides for the Production of Secreted Proteins, pg. 129), and so on. Those opinions might seem preposterous, but they’re worth pointing out, given the current state of affairs and the unmistakable forced path of integrating human beings with NBIC technologies—or, as some call it, transhumanism. For now, the long list of adverse events, life-altering injuries, and death resulting from the massive biodistribution of the toxic mRNA spike protein-LNPs throughout the entire body is undoubtedly enough to stop the vaccine campaign immediately.", "opengraph": {"locale": "en_US", "type": "article", "title": "Experts Weigh In: mRNA Spike & LNPs Invade Entire Body, Stop Jabs Now", "description": "Numerous experts have confirmed that the toxic experimental mRNA jabs travel and then settle inside every organ in the human body.", "url": "https://thehighwire.com/editorial/experts-weigh-in-mrna-spike-lnps-invade-entire-body-stop-jabs-now/", "site_name": "The HighWire", "image": "https://thehighwire.com/wp-content/uploads/2023/03/ddddd.png", "image:width": "587", "image:height": "474", "image:type": "image/png"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Dr. Robert Malone Says New Data on COVID Vaccine mRNA May Uncover More Adverse Events<br/><br/>\"If the drug product is still there, and potentially still biologically active for up to 60 days later, you gotta open that window [for adverse events] way up\"<a href=\"https://twitter.com/RWMaloneMD?ref_src=twsrc%5Etfw\">@RWMaloneMD</a> <a href=\"https://twitter.com/aubrey_huff?ref_src=twsrc%5Etfw\">@aubrey_huff</a> <a href=\"https://t.co/gOnjghL1CW\">pic.twitter.com/gOnjghL1CW</a></p>— Chief Nerd (@TheChiefNerd) <a href=\"https://twitter.com/TheChiefNerd/status/1628799473244577794?ref_src=twsrc%5Etfw\">February 23, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/drcole12?ref_src=twsrc%5Etfw\">@drcole12</a>: The Entire Lipid Nanoparticle Platform Needs to End<br/><br/>\"They're going to try to do lipid nanoparticles plus influenza genes and plus RSV genes for all these other shots going forward,\" informed Dr. Cole.<br/><br/>\"This platform is sufficiently proven to be dangerous, that not… <a href=\"https://t.co/9kpJZSiaG9\">https://t.co/9kpJZSiaG9</a> <a href=\"https://t.co/aN3AJn0xyq\">pic.twitter.com/aN3AJn0xyq</a></p>— The Vigilant Fox 🦊 (@VigilantFox) <a href=\"https://twitter.com/VigilantFox/status/1629267605495185408?ref_src=twsrc%5Etfw\">February 24, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Dr. James Thorp, an OBGYN &amp; expert in women’s reproductive health, discusses the 57-fold increase in miscarriages, as well as a significant increase in still births, fetal demises and more—all linked to the mRNA C•19 shots—and based on the FDA &amp; CDC’s data. <a href=\"https://t.co/sv9MP7Mqg6\">pic.twitter.com/sv9MP7Mqg6</a></p>— TexasLindsay™ (@TexasLindsay_) <a href=\"https://twitter.com/TexasLindsay_/status/1628975543164055553?ref_src=twsrc%5Etfw\">February 24, 2023</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">It’s such an excellent therapy to push by our public health authorities, don’t you think? We are talking about MASS use, multiple times (every 2 months) in healthy individuals. On what planet was this a good idea? <a href=\"https://twitter.com/_HeartofGrace_?ref_src=twsrc%5Etfw\">@_HeartofGrace_</a> <a href=\"https://twitter.com/RWMaloneMD?ref_src=twsrc%5Etfw\">@RWMaloneMD</a> <a href=\"https://t.co/deOfw6rXVP\">https://t.co/deOfw6rXVP</a></p>— Dr. Lynn Fynn-derella🐭 (@Fynnderella1) <a href=\"https://twitter.com/Fynnderella1/status/1624174285521551361?ref_src=twsrc%5Etfw\">February 10, 2023</a></blockquote> \n"], "movies": [], "links": ["https://obamawhitehouse.archives.gov/sites/default/files/microsites/ostp/bioecon-%28%23%20023SUPP%29%20NSF-NBIC.pdf", "https://singularityhub.com/2015/10/12/ray-kurzweils-wildest-prediction-nanobots-will-plug-our-brains-into-the-web-by-the-2030s/", "https://www.cdc.gov/niosh/topics/nanotech/default.html", "https://pubmed.ncbi.nlm.nih.gov/29269142/", "https://www.docdroid.net/xq0Z8B0/pfizer-report-japanese-government-pdf", "https://www.uncoverdc.com/2021/05/31/vaccine-expert-warns-we-made-a-big-mistake/", "https://www.uncoverdc.com/2022/05/10/vaccine-expert-a-year-later-a-moratorium-on-mrna-vaccines-is-needed/", "https://twitter.com/RWMaloneMD?ref_src=twsrc%5Etfw", "https://twitter.com/aubrey_huff?ref_src=twsrc%5Etfw", "https://t.co/gOnjghL1CW", "https://twitter.com/TheChiefNerd/status/1628799473244577794?ref_src=twsrc%5Etfw", "https://brownstone.org/articles/cdc-lied-mrna-not-meant-to-stay-in-arm/", "https://www.cell.com/iscience/fulltext/S2589-0042(21)01450-4?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS2589004221014504%3Fshowall%3Dtrue", "https://twitter.com/TheChiefNerd/status/1628799473244577794?s=20", "https://www.frontiersin.org/articles/10.3389/fcell.2021.789427/full", "https://www.jessicasuniverse.com/_files/ugd/eabd45_2dda8bc9bcb94091a4b14924e8297dad.pdf", "https://www.uncoverdc.com/2022/09/27/top-uk-cardiologist-pause-the-covid-vaccine-program/", "https://www.jessicasuniverse.com/interviews-1", "https://pubmed.ncbi.nlm.nih.gov/18720854/#:~:text=Lipid%20A%2C%20the%20hydrophobic%20group,has%20the%20function%20of%20endotoxin", "https://twitter.com/drcole12?ref_src=twsrc%5Etfw", "https://t.co/9kpJZSiaG9", "https://t.co/aN3AJn0xyq", "https://twitter.com/VigilantFox/status/1629267605495185408?ref_src=twsrc%5Etfw", "https://t.me/childcovidvaccineinjuriesuk/2755", "https://pubmed.ncbi.nlm.nih.gov/10565819/", "https://petermcculloughmd.substack.com/p/mrna-circulates-at-least-30-days", "https://petermcculloughmd.substack.com/p/health-of-pure-bloods-threatened", "https://www.tmrjournals.com/public/articlePDF/20221114/483e983160eb24f1ef94bdd666603ac9.pdf", "https://youtu.be/u4QNO5EJl_0", "https://t.me/ShankaraChetty/505", "https://t.co/sv9MP7Mqg6", "https://twitter.com/TexasLindsay_/status/1628975543164055553?ref_src=twsrc%5Etfw", "https://twitter.com/_HeartofGrace_?ref_src=twsrc%5Etfw", "https://twitter.com/RWMaloneMD?ref_src=twsrc%5Etfw", "https://t.co/deOfw6rXVP", "https://twitter.com/Fynnderella1/status/1624174285521551361?ref_src=twsrc%5Etfw", "https://assets.modernatx.com/m/197fe68e2047ca6a/US10703789.pdf"], "authors": [], "publish_date": "9:17 AM EST, Sat March 4, 2023"}