{"result_id": "299036", "URL": "https://thehighwire.com/news/washington-state-gov-inslee-issues-permanent-covid-vaccine-mandate-for-state-workers/", "timestamp": "2023-04-25 17:26:22 CEST+0200", "meta": {"description": "A June 30 memo issued by Gov. Jay Inslee says you’re going to need to be vaccinated – and continue to get boosted against COVID-19 before July 2023.", "lang": "en", "keywords": "MyNorthwest.com - Seattle news, sports, weather, traffic, talk and community., Home, MyNorthwest.com", "favicon": "", "canonical": "https://mynorthwest.com/3542986/gov-inslee-imposes-permanent-vaccine-mandate-state-workers/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "Dori: With ongoing emergency powers, Gov. Inslee imposes permanent vaccine mandate for state workers", "cleaned_text": "Want to get hired by Washington state or keep a state job?\n\nA June 30 memo issued by Gov. Jay Inslee says you’re going to need to be vaccinated – and continue to get boosted against COVID-19 before July 2023 – or you can’t work for the state or a state contractor.\n\n“It’s mindboggling,” Washington Policy Center’s Elizabeth Hovde told The Dori Monson Show after reviewing the memo.\n\n“[COVID] is no longer a public health crisis,” Hovde told Dori’s listeners. “This is not reasonable or appropriate. It doesn’t serve the public or the state workforce.”\n\nDori: Will KC health director appointee push for mask mandate return after St. Louis finger-flip fray?\n\nThe move, according to Hovde, is bold because the governor is making the requirement permanent. And new to his mandates: keeping boosters up to date, as recommended by the Center for Disease Control. While the governor’s office has not offered any clarification, this could mean that to be an eligible state worker, you would need a COVID booster every three months.\n\n“Staffing shortages in the public sector and among healthcare workers are exacerbated by the governor’s vaccine mandate – but he’s harming state services and ruining careers,” Hovde continued. “It makes no sense.”\n\nInslee – who has held emergency powers in the state for almost 850 days – also wants other leaders in Washington to follow his lead.\n\nInslee’s memo also calls “upon our higher education institutions, boards and commissions, and other separately elected officials to consider similar requirements within their agencies and jurisdictions.”\n\nHovde, a policy analyst and director for WPC’s Centers for Health Care and Worker Rights, told Dori’s listeners that the directive “just blows my mind.” She writes about it here.\n\n“A lot of people have lost their livelihood and their career because of this mandate,” she said. “We should be saying `no.’ We’re coming into a recession. This is the last time we need people to be out of work.”\n\nListen to Dori Monson weekday afternoons from noon – 3 p.m. on KIRO Newsradio, 97.3 FM. Subscribe to the podcast here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dori: With ongoing emergency powers, Gov. Inslee imposes permanent vaccine mandate for state workers", "description": "A June 30 memo issued by Gov. Jay Inslee says you’re going to need to be vaccinated – and continue to get boosted against COVID-19 before July 2023.", "url": "https://mynorthwest.com/3542986/gov-inslee-imposes-permanent-vaccine-mandate-state-workers/", "site_name": "MyNorthwest.com", "article:publisher": "http://www.facebook.com/mynorthwest/", "article:published_time": "2022-07-01T23:18:13+00:00", "article:modified_time": "2022-07-01T23:50:17+00:00", "image": "https://mynorthwest.com/wp-content/uploads/2022/07/COVIDvaxx.jpg", "image:width": "900", "image:height": "506"}, "tags": [], "tweets": [], "movies": [], "links": ["https://protect-us.mimecast.com/s/bPjaC31KyVF7LyORigowB0?domain=governor.wa.gov", "https://mynorthwest.com/3538591/dori-will-kc-health-director-appointee-push-for-mask-mandate-return-after-st-louis-finger-flip-fray/", "https://protect-us.mimecast.com/s/LO67C4xYzGFYLDq7UxxITO?domain=washingtonpolicy.org", "https://mynorthwest.com/category/podcast_results/?sid=1004&n=The%20Dori%20Monson%20Show"], "authors": [], "publish_date": "2022-07-01T23:18:13+00:00"}