{"result_id": "299024", "URL": "https://thehighwire.com/news/fda-authorizes-4th-5th-booster-doses-for-various-groups-ages-bypasses-expert-vote/", "timestamp": "2023-04-25 17:25:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/news/fda-authorizes-4th-5th-booster-doses-for-various-groups-ages-bypasses-expert-vote/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "FDA Authorizes 4th, 5th Booster Doses for Various Groups, Ages – Bypasses Expert Vote", "cleaned_text": "According to their now-preferred method of scientific communication, the U.S. Food and Drug Administration’s ( FDA) press release has recently dictated to the medical community and public at large that it has authorized a second booster dose of both Moderna and Pfizer COVID shots for various groups and ages.\n\nThe agency has now amended its Emergency Use Authorization (EUA) to include a second booster dose of Moderna or Pfizer for 50 years of age and older at least 4 months after a first booster dose, a second dose of Pfizer for individuals 12 years of age and older with certain kinds of immunocompromise at least 4 months after a first booster dose, and a second dose of Moderna 4 months after the first booster dose for 18 years of age and older who are immunocompromised.\n\nThis was all done without convening its expert voting committee adding further division and contention among the medical and scientific community. It was exactly the agency’s [first] expedited booster push, sans robust data, in August of 2021 that led two senior scientists to resign in protest.\n\nThe FDA appears to have adopted Plotkin’s commandment in stride by incorporating the wordplay into its latest press release by stating:\n\n“The FDA previously authorized a single booster dose for certain immunocompromised individuals following completion of a three-dose primary vaccination series. This action will now make a second booster dose of these vaccines available to other populations at higher risk for severe disease, hospitalization and death.“\n\nIn case you have lost count, the FDA’s new vaccine edicts gives the green light to shots/boosters four and five.\n\nNo one was speaking about a 3-shot series until after August 30, 2021 – the date of a CDC advisory committee meeting in which Stanely Plotkin called in to make a comment and effect vaccine policy – or as StatNews stated reported at the time ‘when Stanley Plotkin speaks, people listen.’\n\n“Calling the third dose a booster is immunologically incorrect and also gives the wrong impression that somehow the vaccines failed…” stated Plotkin.\n\nSo if you are immunocompromised, two shots plus a (third) booster is your primary series and the added (forth) booster previously meant you fell under the ‘fully vaccinated’ definition. Now, today’s FDA decision makes a second (fifth) booster available, which, minus the medical doublespeak, would be the fifth shot being injected into your arm presumably making you fully vaccinated once again.\n\nRather than being transparent and linking to the data the FDA used to inform their decision, the press release gave a basic summary. For safety, the FDA relied on open population surveillance imported from Israel’s Ministry of Health along with one study of 120 people. For immunogenicity data, the FDA looked at a publication provided to them from an ongoing study in healthcare workers at a single center in Israel.\n\nIn Janurary 2022, The Financial Times reported about the dismal findings of an Israeli study at the Sheba Medical Center writing:\n\n“Healthcare workers at the Sheba Medical Center who received a fourth dose of the vaccine continued to get infected even though blood tests showed an increase in two key kinds of antibodies, according to professor Gili Regev-Yochay who led the research.\n\nEnough of them tested positive for coronavirus two weeks after their fourth jabs to indicate that the level of antibodies needed to protect against infection from Omicron was “probably too high” for the vaccine to induce, said Regev-Yochay.“\n\nMoving into the vote, professor of epidemiology and biostatistics at the University of California, San Francisco Vinay Prasad observed that the FDA vaccine regulation was sliding further into the abyss by writing “If the FDA moves forward on authorizing either product, it will cement a dangerous precedent: inadequate evidence being used to justify widespread vaccination for years to come.”\n\nMeanwhile, Johns Hopkins Marty Makary, M.D. took to Twitter for a series of comments:\n\nThe U.K. appears to be heading in the same direction with its Health Minister Sajid Javid recently saying it was ‘possible’ there would be an autumn booster ‘probably for those that are 50 and over.’ Currently in the U.K., over-75 year olds, care home residents and patients with weak immune systems are receiving invitations for a spring boosters.\n\nIf they are offered another jab in the autumn, it will be their fifth. Some immunocompromised adults will have already had five by then according to a Daily Mail report.", "opengraph": {"locale": "en_US", "type": "article", "title": "FDA Authorizes 4th, 5th Booster Doses for Various Groups, Ages – Bypasses Expert Vote", "description": "By Jefferey Jaxen According to their now-preferred method of scientific communication, the U.S. Food and Drug Administration’s (FDA) press release has recently dictated to the medical community and public at large that it has authorized a second booster dose of both Moderna and Pfizer COVID shots for various groups and ages. The agency has now […]", "url": "https://thehighwire.com/news/fda-authorizes-4th-5th-booster-doses-for-various-groups-ages-bypasses-expert-vote/", "site_name": "The HighWire", "article:modified_time": "2022-03-29T20:35:20+00:00", "image": "https://thehighwire.com/wp-content/uploads/2021/11/R2GTRXQOLFBTXJ6S32Q7OWFT5Q.jpeg", "image:width": "932", "image:height": "582", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">There is zero clinical data that a 4th dose reduces hospitalization risk. There isn't even any evidence that a 3rd dose reduces hospitalization risk in young people.</p>— Marty Makary MD, MPH (@MartyMakary) <a href=\"https://twitter.com/MartyMakary/status/1508784683940646914?ref_src=twsrc%5Etfw\">March 29, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Political interference over boosters was the issue behind 2 high-level FDA departures in the fall. There is no greater slap in the face of science than bypassing the customary FDA external expert voting process over an authorization with insufficient supporting clinical data.</p>— Marty Makary MD, MPH (@MartyMakary) <a href=\"https://twitter.com/MartyMakary/status/1508784686469844997?ref_src=twsrc%5Etfw\">March 29, 2022</a></blockquote> \n"], "movies": [], "links": ["https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.bloomberg.com/news/articles/2021-08-31/two-fda-vaccine-officials-to-step-down-after-covid-clearances", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.statnews.com/2021/09/02/the-debate-over-covid-19-vaccine-boosters-what-to-call-them-and-whether-theyre-needed/", "https://www.city-journal.org/the-case-for-a-fourth-covid-vaccine-dose-is-thin?utm_source=Twitter&utm_medium=Organic_Social", "https://twitter.com/MartyMakary/status/1508784683940646914?ref_src=twsrc%5Etfw", "https://twitter.com/MartyMakary/status/1508784686469844997?ref_src=twsrc%5Etfw", "https://www.dailymail.co.uk/news/article-10634889/Sajid-Javid-says-50s-probably-need-Covid-booster-later-year.html", "https://www.dailymail.co.uk/news/article-10634889/Sajid-Javid-says-50s-probably-need-Covid-booster-later-year.html"], "authors": [], "publish_date": null}