{"result_id": "299004", "URL": "https://thehighwire.com/editorial/tracking-the-elusive-vaccine-debate-%e2%80%8b/", "timestamp": "2023-04-25 17:24:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://thehighwire.com/editorial/tracking-the-elusive-vaccine-debate-​/", "encoding": "UTF-8"}, "image": null, "domain": "thehighwire.com", "title": "TRACKING THE ELUSIVE VACCINE DEBATE ​", "cleaned_text": "Those who have been patiently waiting for a true vaccine debate to occur have been out of luck. It started with assurances that vaccines were safe despite no discussion of a laundry list of possible risks, no informed consent. Then came the reality that vaccines are not tested against inert placebos during pre-licensure safety testing. The inconvenient truths mounted. No studies has ever compared total health outcomes of the CDC’s vaccine schedule between vaccinated and unvaccinated groups. Broken adverse event reporting systems and an adversarial vaccine court continued to tarnish the government assurances backing the vaccine medical products of multinational corporations. Greed, conflict of interest, regulatory agency revolving doors and billions paid in criminal fines by Big Pharma from past product failures and frauds has been demanding for open debate to occur.\n\nMany were relieved to learn a debate was set to occur in full public display, just down the road from the CDC, in Atlanta last October. Doctors, researchers, journalists, professors and vaccine developers were set to give the public the facts. Until the entire ‘settled science’ side of the vaccine debate withdrew. Most cited communications from their superiors and medical groups as their excuses for not confidently appearing to present their exhaustive, settled science the public keeps hearing so much about. Nevertheless, the debate turned presentation we on, televised and attended by a live audience, comprising several hours of inconvenient facts about vaccines often from the governments and vaccine manufacturers own data and admissions. Among the Atlanta debaters with cold feet was Dr. Peter Hotez; vaccine developer, collaborator with Merck and recipient of $52M from the Bill and Melinda Gates Foundation.\n\nThe public was again anticipating some form of soft debate, or at the very least, challenging questions when Hotez announced he was going to appear on the Joe Rogan Experience show recently. Sounding like a questionable used car salesman instead of a man with confidence in his settled science, Hotez wiggled and squirmed through the livestream on two occasions when asked by Rogan if he would debate. After listening to Hotez complain about ‘the anti-vaccine lobby’ and ‘anti-vaccine media empire,’ Rogan stated: “It seems like there should be some sort of a debate..some sort of monitored conversation where you can have you versus someone else and break this down.”\n\nHotez recoiled, “It would give some false legitimacy to the anti-vaccine side. It’s like debating does smoking cause cancer.”\n\nIronically, Big Tobacco also avoided debate and employed the now infamous ‘tobacco science’ during their reign to hide the harms of their products for decades while industry-influenced doctors and researchers ran cover for the industry. Hotez instead suggested to Rogan, “Maybe Amazon, maybe Facebook should…[be] putting some stops on the dissemination of information.” In short, Hotez prefers heavy-handed censorship over open debate.\n\nAs the interview went on, Rogan asked, “…Robert Kennedy Jr.,..seems like a very intelligent guy. How could he not be aware of the science behind this. What is he getting wrong?”\n\nHotez answered by claiming he’s getting “just about everything wrong…it’s all nonsense.” Rogan again asked, “Would he be a guy you would want to have a debate with or have a discussion with?” Hotez squirmed, “I’m uncomfortable with the idea of a debate.”\n\nMeanwhile, the one-sided ‘debate’ continues to play out with great success in the public space. Hartford’s Legislative Office Building was the site of another hopeful vaccine debate/forum put together by Connecticut Rep. Josh Elliot. The forum included three Yale doctors representing its Schools of Public Health, Epidemiology and Medicine respectively. And for good measure, a 35 year pediatrician and longtime member of the American Academy of Pediatrics. The group would face none other than Robert F. Kennedy Jr. Yet less than 10 hours before the forum was set to start, Rep. Elliot abruptly cancelled the debate for unclear and conflicting reasons.\n\nIn a Facebook post he first said “negative attention” was the reason. Then he claimed “Yale didn’t bail” in another post which then went on to contract itself in subsequent sentences saying “As of 10p last night, the majority of the panel had decided they did not want to participate.” Rep. Elliot, who is co-sponsoring a vaccine bill aiming to mandate the HPV Vaccine for 9th and 12th grade students and the meningococcal vaccine for 12th grade students, was largely absent from what turned out to be a debate-turned solo presentation by Kennedy Jr. Videos from which have since went viral across the internet of an impassioned Kennedy Jr. challenging the local media in attendance, “All vaccines should undergo the same safety testing that we require for other drugs. That’s all I’m asking. Is this radical?…Is this something you’re not allowed to print?”\n\n​\n\nRailing on the Democratic party for turning its back on vaccine-injured mothers and denouncing the censorship of open debate all against a four-hour backdrop of, among many points, Merck’s HPV pre-licensure safety study documents showing manipulation of data to hide increases in severe adverse vaccine reactions. \n\n\n\nDebate and open communication surrounding the topic of vaccination has been shut down, demoted and blocked by most major social media outlets. Amazon has pulled documentaries and books, while Instagram is blocking vaccine hashtags, GoFundMe is going after funding streams. The social media vaccine Gestapo-like moves were supercharged at the demand of Rep Adam Schiff in his letter, which contained falsehoods/misinformation, to Facebook and Amazon. At the exact moment in time America needed to openly debate this impending vaccine legislation, the opportunity has been willfully removed not by some invading force or occupying army, but by the very government representatives we have entrusted to protect our inalienable rights.\n\nAmerican ideals, bedrocks on which the country was built, are being cast aside in a frantic rush to mandate pharmaceutical product lines. The ‘settled science’ vaccine narrative is being aggressively forced muting common sense and medical inconsistencies in full view of many who are watching. Perhaps more importantly, informed consent, protection of religious rights, free speech, open debate and parental choice are being bullied by coercion, overt censorship, media-directed discrimination campaigns and political corruption. \n\n​\n\nThe American public is currently facing 158 vaccine-related bills in 35 states at various stages in the legislative process. In a normal society, with its democracy intact, now would be the exact time when debate and discussion should flourish. The rippling impact on society to this wild assortment of legislation deserves full American engagement in the open marketplace of ideas. Unpleasant facts, competitive values, inconvenient truths and uncomfortable falsehoods must all be waded through at this very moment in order for The People to better judge where their truths lie. With the current deluge of active vaccine legislation on deck, American history continually confirms free and open debate allows the best ideas and courses to be decided upon by our free society.\n\nAt this stage, simple insulting slogans like ‘the science is settled’ and ‘safe and effective’ droned on about in hearings to justify the passage of bills does little to ease the ugly reality that America has slipped into the authoritarian-leaning practices of so many despotic regimes history has warned about. A growing, vocal resistance who are seeing these early warning signs serve as reminders that our long-inherited ideals that have made this country great will always overshadow corporate product lines, pharmaceutically-influenced politicians and low information legislators in the universe’s long arc towards justice.", "opengraph": {"locale": "en_US", "type": "article", "title": "TRACKING THE ELUSIVE VACCINE DEBATE ​", "description": "By Jefferey Jaxen Those who have been patiently waiting for a true vaccine debate to occur have been out of luck. It started with assurances that vaccines were safe despite no discussion of a laundry list of possible risks, no informed consent. Then came the reality that vaccines are not tested against inert placebos during […]", "url": "https://thehighwire.com/editorial/tracking-the-elusive-vaccine-debate-​/", "site_name": "The HighWire", "image": "https://thehighwire.com/wp-content/uploads/2021/07/The-HighWire-LIVE.jpg", "image:width": "800", "image:height": "450", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=hc5yHU61jVk", "https://youtu.be/a3EHrjfLXaw?t=618", "https://youtu.be/ztcHfadQ3J0?t=2120", "https://www.facebook.com/staterepjoshelliott/posts/2481613431863271", "https://www.facebook.com/staterepjoshelliott/posts/2482399281784686?__xts__%5B0%5D=68.ARBNGzQuh4SJbN92n5xHKxP89H2QK7cg9IYIKcU6nJpMyTU--QpNwYw6hwwlXpBqwQGhNwFD-uOB7u3vbCLxmphfl0b_z1HIiVOxfZHl53VhP6eO0ZGSb2oxDPMYaVeJJrwqZZbk3hk9yd7-3DSQFknPwbo2Plm42Z8n1_RuZvpMLDiuKAF8lXvsnIL_TO5fQKuaGgBNpM74pG4H2EjCppT1tqSvzvQwuxQizzuJEdvN1Vvx97HG2uPENjBtHHtWV2Xi16sMdI0LDg2BOGilT1zT-u1yNfGqlBwFHqQ3bP_uk-yMlkOZgjfX_AluQq6O7r_bnTMQnmuN1P2TXUw7GJVRKOG8&__tn__=K-R", "https://www.cga.ct.gov/asp/CGABillStatus/cgabillstatus.asp?selBillType=Bill&bill_num=HB7199", "http://www.ctn.state.ct.us/ctnplayer.asp?odID=16125", "https://twitter.com/jeremyrhammond/status/1101647286608769025", "https://youtu.be/ztcHfadQ3J0?t=2514", "https://www.youtube.com/watch?v=NWPHiCivn0I"], "authors": [], "publish_date": "12:16 PM EDT, Sun March 24, 2019"}