{"result_id": "300037", "URL": "https://www.thelibertybeacon.com/8x-increase-in-excess-deaths-among-children-in-europe-since-covid-vaccine-roll-out/", "timestamp": "2023-04-25 17:29:02 CEST+0200", "meta": {"description": "There is an excess mortality rate among European children of almost 700% which coincides with the months of Covid vaccination during 2021 and 2022.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/8x-increase-in-excess-deaths-among-children-in-europe-since-covid-vaccine-roll-out/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "8x Increase in Excess Deaths Among Children in Europe Since COVID Vaccine Roll-out | The Liberty Beacon", "cleaned_text": "Official mortality figures for Europe show that there has been a shocking 691% increase in excess deaths among children since the European Medicines Agency extended the emergency use authorisation of the Pfizer Covid-19 vaccine for use in children aged 12 to 15 in May.\n\nBefore this decision by the European Medicines Agency, deaths among children in 2021 were below the expected rate. But following the emergency use authorisation, excess deaths among children by the end of the year had risen by a deeply troubling 1,599% compared to the 2017 to 2020 average.\n\nUnfortunately, this trend has continued into 2022, with Europe officially recording a 381% increase in excess deaths among children this year so far, compared to the 2018 to 2021 average.\n\nEuroMOMO is a European mortality monitoring activity. The organisation states that its aim is to “detect and measure excess deaths related to seasonal influenza, pandemics and other public health threats”.\n\nOfficial national mortality statistics are provided weekly from the 29 European countries or subnational regions in the EuroMOMO collaborative network, supported by the European Centre for Disease Prevention and Control (ECDC) and the World Health Organization (WHO), and hosted by Statens Serum Institut, Denmark.\n\nThe following chart shows the weekly excess deaths throughout 2020 and 2021 among children aged 0 to 14 across Europe. The graph has been taken from the EuroMOMO website and can be accessed here.\n\nAs you can see from the above, deaths among children throughout 2020 were generally below the expected number of deaths. This trend continued throughout 2021 up to week 22, at which point excess deaths were recorded week on week until the end of the year.\n\nWhat’s interesting about the fact excess deaths began to be recorded among children in week 22 of 2021 is that it coincides with the week the European Medicines Agency (EMA) granted “an extension of indication for the COVID-19 vaccine Comirnaty (Pfizer) to include use in children aged 12 to 15″.\n\nJust a few months later, the EMA also gave emergency use approval for the Pfizer vaccine to be administered to children as young as 5.\n\nThe following chart, extracted from the EuroMOMO website, shows the cumulative total number of excess deaths throughout both 2020 and 2021 from week 22 (the week the Covid-19 vaccine was approved for children) to week 52 (the end of the year).\n\nAccording to EuroMOMO, Europe recorded 1,015 excess deaths among children during this time frame in 2021, whilst recording 491 fewer deaths than expected during this time frame in 2020.\n\nThe following chart shows the weekly excess deaths throughout 2022 among children aged 0 to 14 across Europe. The graph has been taken from the EuroMOMO website and can be accessed here.\n\nThe data so far covers up to week 33 of 2022 (mid-August), and as you can see, the majority of weeks have seen deaths among children well above the expected rate. Week 24 saw a record 101 excess deaths among children aged 0 to 14.\n\nThe following chart, extracted from the EuroMOMO website, shows the cumulative total number of excess deaths throughout 2020, 2021 and 2022, up to week 33.\n\nAccording to EuroMOMO, Europe recorded 841 excess deaths among children during this time frame compared to the expected rate.\n\nSince the EMA first approved the Pfizer Covid-19 injection for use in children in May 2021, Europe has recorded 1,856 excess deaths among children aged 0 to 14 against the expected rate. This statistic alone is sickening because it represents an unbelievable 185,600% increase in deaths.\n\nHowever, because that number is so unbelievably high, it would be fairer to actually compare excess deaths among children post-Covid-19 vaccination against the average number of deaths among children in the previous few years.\n\nThe following chart shows the total number of excess deaths among children aged 0 to 14 in 2021 before EMA approval of the Covid-19 vaccine for 12 to 15-year-olds in week 22, compared to the same time frame in other years. The numbers have been extracted from the EuroMOMO website and can be accessed here.\n\nThe 2018 to 2020 average number of excess deaths among children across Europe between week 1 and week 21 equates to 191.3. But during the first 21 weeks of 2021, there were actually 198 fewer deaths among children than expected and 389.3 fewer deaths than the 2018 to 2020 average.\n\nThe following chart shows the total number of excess deaths among children aged 0 to 14 in 2021 following EMA approval of the Covid-19 vaccine for 12 to 15-year-olds in week 22, compared to the same time frame in other years. The numbers have been extracted from the EuroMOMO website and can be accessed here.\n\nThe 2017 to 2020 average number of excess deaths among children across Europe between week 22 and week 52 equates to 59.75. But during the same period in 2021, following EMA approval of the Pfizer Covid-19 vaccine for children, there were 1,015 more deaths among children than expected, and 955.25 more deaths than the 2017 to 2020 average.\n\nThis means excess deaths among children throughout 2021 after EMA approval of the Covid-19 injection for children aged 12 to 15, increased by 1,599% compared to the 2017 to 2020 average.\n\nThe following chart shows the total number of excess deaths among children aged 0 to 14 in 2022 so far (Week 33) compared to the same time frame in other years. The numbers have been extracted from the EuroMOMO website and can be accessed here.\n\nIn 2022, children aged 5 and over across Europe have been offered the Covid-19 injection, and children aged 12 and over have been offered up to three (3) doses of the Covid-19 injection.\n\nThe 2018 to 2021 average number of excess deaths among children between week 1 and week 33 equates to 175. But during the first 33 weeks of 2022, there were 841 more deaths among children than expected and 666 more deaths than the 2018 to 2021 average.\n\nThis means excess deaths among children throughout 2022 so far after EMA approval of the Covid-19 injection for children aged 5 and above, have increased by 381% compared to the 2018 to 2021 average.\n\nOnce we combine the figures for week 22 in 2021 onwards, up to week 33 of 2022 (1,856 excess deaths), and compare them against the combined 2017 to 2020 & 2018 to 2021 average (234.75 excess deaths), we find that excess deaths among children across Europe have increased by 691% since the European Medicines Agency first approved a Covid-19 vaccine for children aged 12 to 15 in May 2021.\n\nIs this just an unfortunate coincidence to add to the long list of “coincidences” that have occurred since early 2020? The authorities would most definitely like you to think so. But they still need to explain why thousands more children are dying than normally expected across Europe.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "8x Increase in Excess Deaths Among Children in Europe Since COVID Vaccine Roll-out | The Liberty Beacon", "description": "There is an excess mortality rate among European children of almost 700% which coincides with the months of Covid vaccination during 2021 and 2022.", "url": "https://www.thelibertybeacon.com/8x-increase-in-excess-deaths-among-children-in-europe-since-covid-vaccine-roll-out/", "article:published_time": "2022-09-14T10:07:24+00:00", "article:modified_time": "2022-09-14T10:08:26+00:00"}, "tags": ["European Medicines Agency (EMA)", "Excess mortality children", "The Expose", "excess death children", "Covid 19 vaccines children", "Pam Barker", "Europe Reloaded", "EUMomo"], "tweets": [], "movies": [], "links": ["https://www.euromomo.eu/", "https://en.ssi.dk/", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-346.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.ema.europa.eu/en/news/first-covid-19-vaccine-approved-children-aged-12-15-eu", "https://www.ema.europa.eu/en/news/first-covid-19-vaccine-approved-children-aged-12-15-eu", "https://www.ema.europa.eu/en/news/comirnaty-covid-19-vaccine-ema-recommends-approval-children-aged-5-11", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-350.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-351.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-349.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-357.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-356.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://www.euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/image-354.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps", "https://expose-news.com/2022/09/13/urope-children-killed-covid-vaccine/"], "authors": [], "publish_date": "2022-09-14T10:07:24+00:00"}