{"result_id": "300031", "URL": "https://www.thelibertybeacon.com/biden-world-leaders-sign-declaration-to-adopt-vaccine-passports/", "timestamp": "2023-04-25 17:28:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/biden-world-leaders-sign-declaration-to-adopt-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Biden & World Leaders sign Declaration to adopt VVV Passports | The Liberty Beacon", "cleaned_text": "President Joe Biden signed a G20 Bali Leaders’ Declaration agreeing to adopt vaccine passports to “facilitate” all international travel.\n\nParagraph 23 of the declaration pertains to “facilitating seamless international travel” by pledging to commit to international dialogue and collaboration to establish a “trusted global digital health networks that should capitalize and build on the success of the existing standard and digital COVID-19 certificates.”\n\nThe White House states it supports “the WHO mRNA Vaccine Technology Transfer hub” as well as other tracing programs used throughout the world designed to share technology, joint research and joint production of vaccines, “including enhanced cooperation among developing countries.” It also acknowledges “the importance of shared technical standards and verification methods, under the framework of the IHR (2005), to facilitate seamless international travel, interoperability, and recognizing digital solutions and non-digital solutions, including proof of vaccinations.”\n\nEstablishing a global health tracing and vaccine passport system is important to prevent a future global socio-economic shutdown that could occur as a result of a future pandemic the world leaders say they anticipate. To facilitate this, the White House said, “We support continued international dialogue and collaboration on the establishment of trusted global digital health networks as part of the efforts to strengthen prevention and response to future pandemics, that should capitalize and build on the success of the existing standards and digital COVID-19 certificates.”\n\nIn a separate update, the G20 leaders affirm their commitment to “move towards interoperability of systems including mechanisms that validate proof of vaccination, whilst respecting the sovereignty of national health policies, and relevant national regulations such as personal data protection and data-sharing.”\n\nTheir declaration followed a B20 Summit at which a similar sentiment was expressed. At it, Indonesia Minister of Health Budi Sadikin proposed creating “a digital certificate acknowledged by WHO” to restrict and regulate international travel.\n\n“If you have been vaccinated or tested properly, you can move around so for the next pandemic instead of stopping the movement of people 100% and [stopping] the economy globally, you can still provide some movement of the people,” he said.\n\nIndonesia has agreed to do this, he said, and will submit its plan to be implemented globally “at the next World Health Assembly as the revision to international health regulation,” he said.\n\nSimilarly, in August 2021, the WHO published a 99-page “guidance document for countries and implementing partners on the technical requirements for developing digital information systems for issuing standards-based interoperable digital certificates for COVID-19 vaccination status … for the purposes of … proof of vaccination.” It states, “a health pass based solely on individual vaccination status may increase the risk of disease spread.”\n\nAlso involved in the G20 and B20 summits was Klaus Schwab, chair of the World Economic Forum, and architect of its “Great Reset.” In his book, “COVID-19: The Great Reset,” he suggests the socio-economic losses caused by lockdowns presented an “opportunity” to create the “new world order” he envisions.\n\nSchwab, who attended the G20 and B20 summits, said in his B20 keynote address, “What we have to confront is a deep, systemic and structural re-structuring of our world. And this will take some time. And the world will look differently after we have gone through this transition process.”\n\nMark Steyn with GBNews says it’s obvious from the world leaders’ remarks that they’ve “taken this virus and the world they built in response to it to make it permanent.” After a Pfizer executive admitted the company “hadn’t tested its vaccine to stop transmission of the virus,” Dutch legal philosopher Eva Vlaardingerbroek told Steyn, “everything is out in the open now. Everyone knows it doesn’t work. … It’s become so obvious that they’ve thrown logic out the window.”\n\nShe also points out that what is being stated is disingenuous. When world leaders say, “We will facilitate movement,” she says, they really mean, “we will restrict movement if you don’t do what we say.”\n\n“The fundamental question” to be addressed, she said is, “People have forgotten what the state is for, and the state serves the citizens, not the other way around. You have an entire population that apparently seems to forget that they pay up to half of their income in taxes. … You do that so that the state – supposedly – does things in your interest. Instead, the state treats us as criminals … every citizen is proven guilty until proven innocent.”\n\nOf the declaration, Liberty Counsel Founder and Chairman Mat Staver said, “Digital health or vaccine passports along with tracking and tracing apps present a serious threat to freedom. Vaccine passports and tracking apps are about collecting data and control. The vaccine passport is being promoted worldwide to limit a person’s ability to leave home, work, shop, dine, travel, attend a public event, or even worship. COVID is being used to advance this dangerous threat to freedom. We must never accept vaccine passports or tracking apps as the new normal. The implications for freedom are significant.”\n\nIn April 2021, he said, “Let me be clear that the government is not now, nor will we be supporting a system that requires Americans to carry a credential. There’ll be no federal vaccination database, no federal mandate requiring everyone to obtain a single vaccination credential.”\n\nSix months later, the CDC implemented a COVID-19 vaccination requirement, still in effect, for all non-U.S. citizens who aren’t immigrants “(not a U.S. citizen, U.S. national, lawful permanent resident, or traveling to the United States on an immigrant visa)” prohibiting entry to the U.S. by air unless they “show proof of being fully vaccinated against COVID-19.”\n\nThe policy doesn’t apply to the millions who’ve illegally entered the U.S. from over 150 countries through the southern border since Biden’s been in office.\n\n(TLB) published this article with permission of John Solomon at Just the News. Click Here to read about the staff at Just the News", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Biden & World Leaders sign Declaration to adopt VVV Passports | The Liberty Beacon", "url": "https://www.thelibertybeacon.com/biden-world-leaders-sign-declaration-to-adopt-vaccine-passports/", "article:published_time": "2022-11-23T15:38:30+00:00", "article:modified_time": "2022-11-23T18:10:17+00:00"}, "tags": ["vaccine passports", "Biden", "G20 Bali", "international travel", "JOHN SOLOMON", "Leaders’ Declaration", "Mat Staver", "The Center Square Staff", "Just The News", "COVID-19 certificates", "threat to freedom", "(TLB) the liberty beacon"], "tweets": [], "movies": [], "links": ["https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf", "https://twitter.com/TimHinchliffe/status/1592232822483419138", "https://www.youtube.com/watch?app=desktop&v=9NMGag1iuYw", "https://justthenews.com/nation/states/center-square/biden-world-leaders-sign-declaration-adopt-vaccine-passports", "https://justthenews.com/john-solomon", "https://justthenews.com/our-staff", "https://kiowacountypress.net/content/world-leaders-sign-declaration-adopt-vaccine-passports-international-travel"], "authors": [], "publish_date": "2022-11-23T15:38:30+00:00"}