{"result_id": "300040", "URL": "https://www.thelibertybeacon.com/the-smallpox-vaccine-the-covid-vaccines-and-myocarditis/", "timestamp": "2023-04-25 17:29:07 CEST+0200", "meta": {"description": "Smallpox vaccines have a history of heart problems attached to them as shown by the US military.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/the-smallpox-vaccine-the-covid-vaccines-and-myocarditis/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "The SmallPox Vaccine, The Covid Vaccines And Myocarditis | The Liberty Beacon", "cleaned_text": "ER Editor: Just to be crystal clear, our governments are now buying and pushing smallpox vaccines on people who exhibit ‘monkeypox’ symptoms. As we published just this week, symptoms of monkeypox are shared with other herpes-related diseases, such as chickenpox, etc. So there is likely to be an elevated rate of monkeypox diagnosis in the current climate. And an opportunistic dishing out of smallpox vaccines. Guess what? Smallpox vaccines, rather risky according to Dr. Meryl Nass below, share one of the same side effects as the Covid vaccines, namely myocarditis and periocarditis. The smallpox vaccination on the US public was stopped in the early 1970s. How common is myocarditis? It hugely depends how hard you look. For smallpox vaccine in military recruits, 1 in 30 had clinical or subclinical myo or pericarditis/PLOS One For smallpox vaccine in military recruits, 1 in 30 had clinical or subclinical myo and/or pericarditis/PLOS One\n\nIn 2015, US military physicians described a study of 1,081 healthy young soldiers who received a smallpox vaccine as part of their military service. [Smallpox vaccine is not used in the civilian population.] It is known to cause a high rate of side effects, including myo- and peri-carditis, heart attacks and heart failure.\n• 5 soldiers or 0.046% (about 1 in 216 vaccine recipients) developed a clinical case of myo or pericarditis. This is over 200 times the expected rate!\n• But an additional 31 vaccine recipients had elevated cardiac enzymes\n• Adding these 2 groups together (36 out of 1,081 soldiers) we find that one in 30 soldiers had lab-diagnosed cardiac inflammation. The 31 didn’t complain of symptoms. But in the military, it never pays to complain.\n• They too were at elevated risk of a cardiac arrhythmia and/or reduced cardiac function, and may have been at higher risk of a myocardial infarction. We don’t know how common mild or subacute myo/pericarditis is in young Americans after Covid vaccines, because the US health agencies have neither performed a similar study, demanded such a study from the vaccine manufacturers (while it is the responsibility of both FDA to request and the manufacturers to perform), and the FDA and CDC have kept the databases hidden that might help at least identify the “clinical” cases, the ones who complained and sought medical care. The CDC or FDA could also have contracted with this group of military physicians to perform a similar study of Covid vaccine recipients. Dr. Michael Nelson, this study’s second author, was made a member of the FDA vaccine advisory committee for Covid vaccines. But he has been mum about the potential similarities between the covid and smallpox vaccine side effects, and didn’t publicly mention this study when he spoke at the VRBPAC meetings. In 2003, another group of military and civilian physicians (including at least 2 vaccine zealots as coauthors: Greg Poland and John Grabenstein) published a study of US soldiers receiving smallpox vaccine, in which they did not look carefully for cases. How common was myocarditis in their study? One case in 12,818 soldiers. They found 400 times fewer cases than the authors of the 2015 study. The full text can be downloaded here as a pdf. How hard are CDC and FDA looking for Covid vaccine myo-pericarditis cases? We heard about no prospective studies at the VRBPAC and ACIP (the FDA and CDC vaccine advisory committees’) meetings in June. Below is the abstract, and here is the full text of the 2015 military study: New onset chest pain, dyspnea, and/or palpitations occurred in 10.6% of SPX-vaccinees and 2.6% of TIV-vaccinees within 30 days of immunization (relative risk (RR) 4.0, 95% CI: 1.7-9.3). Among the 1081 SPX-vaccinees with complete follow-up, 4 Caucasian males were diagnosed with probable myocarditis and 1 female with suspected pericarditis. This indicates a post-SPX incidence rate more than 200-times higher than the pre-SPX background population surveillance rate of myocarditis/pericarditis (RR 214, 95% CI 65-558). Additionally, 31 SPX-vaccinees without specific cardiac symptoms were found to have over 2-fold increases in cTnT (>99th percentile) from baseline (pre-SPX) during the window of risk for clinical myocarditis/pericarditis and meeting a proposed case definition for possible subclinical myocarditis. This rate is 60-times higher than the incidence rate of overt clinical cases. No clinical or possible subclinical myocarditis cases were identified in the TIV-vaccinated group. If you think one in thirty is impossibly high, a Finnish study of military recruits published in 1978 found the same 3% rate after smallpox and DTP vaccination, based on EKG changes. Covid vaccines may be causing similar high rates of cardiac inflammation, too. But today, who’s counting? And did this cause the military to stop vaccinating for smallpox, a disease wiped out in 1977? No. Military smallpox vaccinations continued. Published to The Liberty Beacon from EuropeReloaded.com\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "The SmallPox Vaccine, The Covid Vaccines And Myocarditis | The Liberty Beacon", "description": "Smallpox vaccines have a history of heart problems attached to them as shown by the US military.", "url": "https://www.thelibertybeacon.com/the-smallpox-vaccine-the-covid-vaccines-and-myocarditis/", "article:published_time": "2022-05-27T07:42:16+00:00", "article:modified_time": "2022-05-27T07:42:16+00:00"}, "tags": ["US military smallpox vaccine", "DR. MERYL NASS", "Covid and smallpox vaccines", "Pam Barker", "Europe Reloaded", "smallpox vaccine myocarditis"], "tweets": [], "movies": [], "links": ["https://www.reuters.com/business/healthcare-pharmaceuticals/britain-offers-smallpox-shot-monkeypox-cases-spread-europe-2022-05-19/", "https://fortune.com/2022/05/19/monkeypox-vaccine-purchase-2022-us-government/", "https://www.politico.eu/article/countries-administer-monkeypox-vaccine-as-who-warns-of-limited-supplies/", "https://www.europereloaded.com/is-monkeypox-being-used-to-cover-up-the-fact-the-covid-19-vaccines-cause-acquired-immune-deficiency-syndrome/", "https://www.eugyppius.com/p/open-thread-zero-monkeypox-edition?token=eyJ1c2VyX2lkIjoxODg3NzAwNiwicG9zdF9pZCI6NTY2NzE1MjYsIl8iOiJxblpMdyIsImlhdCI6MTY1MzYzNjY5MSwiZXhwIjoxNjUzNjQwMjkxLCJpc3MiOiJwdWItMjY4NjIxIiwic3ViIjoicG9zdC1yZWFjdGlvbiJ9.rOQfBOCQVN8ocGWsfmS2tXVsRrOZaCt2zSuh3cTvnRc&s=r", "https://jamanetwork.com/journals/jama/fullarticle/196808", "https://jamanetwork.com/journals/jama/fullarticle/196808", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4368609/", "https://pubmed.ncbi.nlm.nih.gov/736507/", "https://merylnass.substack.com/p/how-common-is-myocarditis-it-hugely?s=r", "http://www.europereloaded.com/", "http://www.europereloaded.com/", "https://pinterest.com/pin/create/button/?description=The SmallPox Vaccine, The Covid Vaccines And Myocarditis&media=&url=https://www.thelibertybeacon.com/the-smallpox-vaccine-the-covid-vaccines-and-myocarditis/", "https://www.linkedin.com/shareArticle?title=The SmallPox Vaccine, The Covid Vaccines And Myocarditis&url=https://www.thelibertybeacon.com/the-smallpox-vaccine-the-covid-vaccines-and-myocarditis/"], "authors": [], "publish_date": "2022-05-27T07:42:16+00:00"}