{"result_id": "300016", "URL": "https://www.thelibertybeacon.com/unvaccinated-blood-now-in-very-high-demand/", "timestamp": "2023-04-25 17:28:18 CEST+0200", "meta": {"description": "A “Safe Blood” donation campaign has been formed to match blood donors and recipients who have not had COVID-19 shots ...", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/unvaccinated-blood-now-in-very-high-demand/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Unvaccinated Blood Now in ‘Very High Demand’ | The Liberty Beacon", "cleaned_text": "\n• A growing number of people in need of blood transfusions are requesting blood that comes from people who haven’t received COVID-19 shots\n• Pathologist Dr. Ryan Cole compared the current unknowns regarding “vaccinated blood” with HIV-tainted blood that was used for transfusions in the 1980s\n• Directed donations and autologous donations, or self-donation, are options for receiving blood free of mRNA, but in both cases you’ll need your doctor to submit a Red Cross Special Collections Order form\n• A “Safe Blood” donation campaign has also been formed to match blood donors and recipients who have not had COVID-19 shots\n\nUnvaccinated Blood Is Now in Very High Demand\n\nIt’s unknown whether blood donated by people who’ve received mRNA COVID-19 shots poses a risk to those who receive it. A growing number of people aren’t willing to take any chances, however, and are requesting blood that comes from unvaccinated patients. One high-profile case involves a 4-month-old baby, Will Savage-Reeves, in New Zealand, who needs surgery for a heart valve disorder.\n\nHis parents, Samantha and Cole, requested the infant receive blood only from donors who have not received COVID-19 shots. While unvaccinated blood is available, the doctors and hospital refused to grant the request. The case was heard before a New Zealand court, which sided with the doctors and took guardianship of the child to proceed with the surgery using vaccinated blood.1,2\n\nThe outcome of baby Will’s case may serve as a harbinger of things to come. The hospital argued that the surgery should proceed using vaccinated blood because of the importance of finding a quality match. A large pool of donor blood raises the possibility of finding the highest quality match.\n\nIn addition, according to Steve Kirsch, executive director of the Vaccine Safety Research Foundation, another of their arguments is, “If there were a safety signal from using vaccinated blood for transfusions, it would have surfaced by now.” They also want to keep up appearances, and allowing one patient to use unvaccinated blood may open the floodgates to others requesting the same. Kirsch noted:3\n\nFurther, the New Zealand Blood Service (NZBS) manages blood donations and collections in New Zealand. Only a specialist doctor can request directed donation for the baby to received unvaccinated blood.\n\nBut, Kirsch noted, “The clinicians responsible for the surgery determined that there was insufficient evidence to make a special request … The hospital cannot compel the NZBS to do what it says, e.g., even if the doctors agreed with the parents, NZBS can still refuse to supply the blood if it doesn’t think the request is justified.”4\n\nThe hospital also claimed mRNA shots “to date remain safe.”5 According to Kirsch, “The court, lacking the legal and technical ability to second guess the doctors, therefore sided with the expert opinion of the doctors.”6\n\nThe media, meanwhile, are painting the reasonable request to honor the precautionary principle as a conspiracy theory and disinformation dreamed up by fringe “anti-vaxxers.” Case in point, The New York Times reported:7\n\nNot only did the New Zealand health service refuse the family’s request, but New Zealand’s High Court granted two doctors authority to make medical decisions regarding baby Will.8 It didn’t need to go this far, supporters have stated, since there is ready availability of blood from unvaccinated donors.9\n\nIn a similar case in Italy, however, a judge also ruled against parents who requested blood transfusions only from unvaccinated donors be used during their 2-year-old son’s heart surgery.10\n\nRichard Hirschman, a board-certified embalmer and funeral director with more than 20 years of experience, has come forward stating that, in the time period since COVID-19 shots were rolled out, starting around the middle of 2021, he’s been finding “strange clots” in the bodies of the deceased.\n\n“When I do the embalming, I have to go into the vein. And in order for the embalming process, I have to allow blood to be drained. So I actually pulled this huge, long clot — fibrous looking clot — out prior to an embalming,” Hirschman said.11\n\nThe beginning of the clot, which resembles a white, rubbery worm, appears red and like a normal clot. But the majority of the clot is different: It’s composed of a white, fibrous material. “It just isn’t normal,” he said, adding:12\n\nWhat’s important to note is embalmers have reported finding unusual clots not only in deceased people who’ve received the shots but also in those who have had a blood transfusion. So while we don’t know what risk there is from receiving blood from someone who’s had COVID-19 shots, “the risk is not zero,” Kirsch said.13\n\nAnother case involves a baby, Alexander, who received a vaccinated blood transfusion and developed “an enormous clot that eventually stretched from his left knee, all the way to his heart,” and died.14 According to Kirsch, the hospital then went on to delete all related medical records:15\n\nIs the Blood Supply Safe? Nobody Knows\n\nIn the U.S., a person is in need of blood every two seconds.16 If you have a medical emergency, getting a blood transfusion can be life-saving. But should patients have the option of choosing to receive blood that hasn’t been exposed to mRNA COVID-19 shots?\n\nThe Red Cross states they’re following the U.S. Food and Drug Administration’s blood donation eligibility guidance, which states, “In most cases, there is no deferral time for individuals who received a COVID-19 vaccine as long as they are symptom-free and feeling well at the time of donation.”17\n\n“While the antibodies that are produced by the stimulated immune system in response to vaccination are found throughout the bloodstream, the actual vaccine components are not,” Jessa Merrill, Red Cross director of biomedical communications, told The Daily Beast.18 Further, after speaking to Dr. Peter McCullough, cardiologist, internist and epidemiologist, Kirsch reported:19\n\nPathologist Dr. Ryan Cole compared the current unknowns regarding “vaccinated blood” with HIV-tainted blood that was used for transfusions in the 1980s:20\n\nSimilarly, in January 1983, after the U.S. Centers for Disease Control and Prevention revealed evidence strongly suggesting blood and blood products transmitted AIDS and the disease was sexually transmitted, it recommended blood banks directly question donors about their sexual behavior and run blood donations through a series of screening tests.21\n\nThe blood bank community issued a statement soon after, stating “direct or indirect questions about a donor’s sexual preference are inappropriate” and not recommending any laboratory screening tests.22 As noted by Encyclopedia.com:23\n\nIn the 1980s, increasing fears over tainted transfusions led many people to say they’d refuse donated blood entirely. One man, whose wife died of AIDS contracted through a contaminated transfusion, told the AP in 1985, “You want to play Russian Roulette? Even if it were an emergency — and I had some say in the matter — I wouldn’t take blood out of the pool.”24\n\nNow, decades later, doctors are hearing similar concerns from patients regarding vaccinated blood. Dr. Davinder Sidhu, the division head for transfusion and transplant medicine for southern Alberta, Canada, told CTV News he gets requests for blood from unvaccinated donors “at least once or twice a month over the last several months.”25\n\nIs it Your Right to Receive ‘Unvaccinated’ Blood?\n\nAs it stands, blood donation centers may ask about vaccines their donors have received,26 but it’s not guaranteed that this information will be passed on to consumers. The Red Cross also states, “If you’ve received a COVID-19 vaccine, you’ll need to provide the manufacturer name when you come to donate.”27\n\nStill, it’s unlikely that most hospitals will readily divulge this information when it comes to receiving a blood transfusion. So what are your options if you’re looking for blood from a donor that’s hasn’t received a COVID-19 shot? Directed donations, in which a donor donates blood for a specified receiver, are an option, but they’re typically only used in cases where matched blood is unavailable due to extremely rare blood types.28\n\nAutologous donations, or self-donation, is another option, in which you donate blood for your own use, such as before a medical procedure like surgery. In both cases, you’ll need your doctor to submit a Red Cross Special Collections Order form to complete an autologous or directed blood donation.29\n\nA “Safe Blood” donation campaign has also been formed to match blood donors and recipients who have not had COVID-19 shots. For now, they’re acting as a resource to match donors with those in need of blood, but the hope is that an mRNA-free blood bank will be established:30\n\nAs for baby Will, whose parents’ hopes for an mRNA-free blood transfusion have been dashed, Kirsch said:31", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Unvaccinated Blood Now in ‘Very High Demand’ | The Liberty Beacon", "description": "A “Safe Blood” donation campaign has been formed to match blood donors and recipients who have not had COVID-19 shots ...", "url": "https://www.thelibertybeacon.com/unvaccinated-blood-now-in-very-high-demand/", "article:published_time": "2022-12-18T15:16:56+00:00", "article:modified_time": "2022-12-18T21:35:26+00:00"}, "tags": ["mRNA free Blood", "vaccinated blood", "New Zealand Blood Service", "embalmer", "Dr Ryan Cole", "blood transfusions", "AIDS", "Red Cross Special Collections Order", "Will Savage-Reeves", "Huge fibrous looking clots", "mRNA", "Dr. Joseph Mercola", "Vaccine Safety Research Foundation", "The Red Cross", "Anti-Vaxxers", "unvaccinated blood", "Safe Blood Supply", "COVID-19 shots"], "tweets": [], "movies": [], "links": ["https://www.bitchute.com/video/5WPaUXD4yM7l/", "https://pinterest.com/pin/create/button/?description=Unvaccinated Blood Now in ‘Very High Demand’&media=&url=https://www.thelibertybeacon.com/unvaccinated-blood-now-in-very-high-demand/", "https://www.linkedin.com/shareArticle?title=Unvaccinated Blood Now in ‘Very High Demand’&url=https://www.thelibertybeacon.com/unvaccinated-blood-now-in-very-high-demand/"], "authors": [], "publish_date": "2022-12-18T15:16:56+00:00"}