{"result_id": "300004", "URL": "https://www.thelibertybeacon.com/study-more-infant-vaccines-higher-infant-mortality/", "timestamp": "2023-04-25 17:27:58 CEST+0200", "meta": {"description": "The sharp decline in infant vaccinations began in early March 2020 (lockdown), the same month that infant deaths started declining ... coincidence?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/study-more-infant-vaccines-higher-infant-mortality/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Study: More Infant Vaccines = Higher Infant Mortality | The Liberty Beacon", "cleaned_text": "\n• In 2011, Neil Miller, Ph.D., and Gary Goldman, Ph.D., published a paper in the journal Human & Experimental Toxicology showing infant mortality rates correlated with childhood vaccination rates, with high-uptake countries having higher child mortality\n• In January 2022, Goldman discussed the CDC’s suppression of undesirable vaccine data in an interview. In December that year, the Miller Lab at Brigham Young University in Utah, as part of the BYU Bioinformatics Capstone course, reanalyzed the Miller-Goldman paper in an effort to debunk it\n• In response to the critique, Miller and Goldman conducted their own reanalysis, which was published in the peer-reviewed journal Cureus in early February 2023. The paper confirmed their 2011 conclusion that there’s a positive correlation between vaccine doses and infant mortality rates\n• Data from the first few months of the pandemic seem to confirm this link, as the death rate for American children under 18 dropped during lockdowns, from an average of 700 per week to fewer than 500 per week during the months of April and May in 2020\n• The decades-long work of Christine Stabell Benn, a clinical professor at University of Southern Denmark and her colleague Peter Aaby, a vaccine scientist, shows six of the 10 vaccines investigated increase infant mortality by rendering children more susceptible to other lethal diseases\n\nDo childhood vaccines impact a child’s mortality risk? While controversy around this issue continues to swirl, peer-reviewed research suggests the answer is a yes.\n\nIn 2011, Neil Miller, Ph.D., and Gary Goldman, Ph.D., published a paper in the journal Human & Experimental Toxicology showing infant mortality rates correlated with childhood vaccination rates, with high-uptake countries having higher child mortality. As detailed in the abstract:1\n\n“The U.S. childhood immunization schedule specifies 26 vaccine doses for infants aged less than 1 year — the most in the world — yet 33 nations have lower IMRs. Using linear regression, the immunization schedules of these 34 nations were examined and a correlation coefficient of r = 0.70 (p < 0.0001) was found between IMRs and the number of vaccine doses routinely given to infants. Nations were also grouped into five different vaccine dose ranges: 12–14, 15–17, 18–20, 21–23, and 24–26. The mean IMRs of all nations within each group were then calculated. Linear regression analysis of unweighted mean IMRs showed a high statistically significant correlation between increasing number of vaccine doses and increasing infant mortality rates, with r = 0.992 (p = 0.0009). Using the Tukey-Kramer test, statistically significant differences in mean IMRs were found between nations giving 12–14 vaccine doses and those giving 21–23, and 24–26 doses. A closer inspection of correlations between vaccine doses, biochemical or synergistic toxicity, and IMRs is essential.”\n\nThrough the years, the Miller-Goldman paper has often been cited as evidence that the U.S. childhood vaccination schedule may be doing more harm than good. And, aside from an early debunking attempt by Dr. David Gorski, a surgical oncologist, the paper has stood the test of time.\n\nGorski argued that Goldman and Miller had conflicts of interest that swayed their analysis — Miller, because he operates a website that promotes informed consent, and Goldman because he founded a medical journal that published papers that were critical of vaccines.2\n\nGoldman had initially joined the CDC thinking that it was the gold standard in unbiased research, but over the years, he realized that wasn’t the case. The CDC barred him from publishing any findings that linked the vaccination program with negative health outcomes, which led to his resignation in 2002, as he did not want to participate in research fraud.\n\nHe discussed the CDC’s suppression of undesirable vaccine data in a January 2022 interview.4 Then, all of a sudden, in December 2022, members of the Miller Lab at Brigham Young University in Utah, as part of the BYU Bioinformatics Capstone course, reanalyzed5 the Miller-Goldman paper and tried to debunk it yet again.\n\nThe critique, posted on the preprint server medRxiv (which is not peer-reviewed), claimed Miller and Goldman had employed “inappropriate data exclusions” to reach their conclusion, as they didn’t analyze the full dataset, which included 185 nations.\n\nIn response to the critique, Miller and Goldman conducted their own reanalysis, which was published in the peer-reviewed journal Cureus in early February 2023. The paper, “Reaffirming a Positive Correlation Between Number of Vaccine Doses and Infant Mortality Rates: A Response to Critics,”6 not only examines the critics’ claims and methods, but also includes additional analyses to assess the reliability of their original findings. As explained in the abstract:7\n\n“The critics’ reanalysis combines 185 developed and Third World nations that have varying rates of vaccination and socioeconomic disparities. Despite the presence of inherent confounding variables, a small, statistically significant positive correlation of r = 0.16 (p < .03) is reported that corroborates the positive trend in our study. Multiple linear regression analyses report high correlations between IMR and HDI, but the number of vaccine doses as an additional predictor is not statistically significant. This finding is a likely consequence of known misclassification errors in HDI. Linear regression of IMR as a function of percentage vaccination rates reports statistically significant inverse correlations for 7 of 8 vaccines. However, several anomalies in the scatter plots of the data suggest that the chosen linear model is problematic. Our odds ratio analysis conducted on the original dataset controlled for several variables. None of these variables lowered the correlation below 0.62, thus robustly confirming our findings. Our sensitivity analysis reported statistically significant positive correlations between the number of vaccine doses and IMR when we expanded our original analysis from the top 30 to the 46 nations with the best IMRs. Additionally, a replication of our original study using updated 2019 data corroborated the trend we found in our first paper (r = 0.45, p = .002). Conclusions: A positive correlation between the number of vaccine doses and IMRs is detectable in the most highly developed nations but attenuated in the background noise of nations with heterogeneous socioeconomic variables that contribute to high rates of infant mortality, such as malnutrition, poverty, and substandard health care.”\n\nIn 2020, health authorities bemoaned the fact that COVID fears and lockdowns had the “unfortunate” side effect of lowering routine childhood vaccination rates. Vaccine safety advocates, on the other hand, predicted the decline might actually have a positive impact.\n\nChildhood vaccines have long been suspected of being a contributing factor to sudden infant death syndrome (SIDS).8 As noted by Australian researcher Viera Scheibner, Ph.D.:9\n\nInterestingly, data from the first few months of the pandemic seemed to confirm this link. According to a white paper10,11 by Amy Becker and Mark Blaxill, published June 18, 2020, the death rate among children under the age of 18 in the U.S. mysteriously dropped during the lockdowns, from an average of 700 per week to fewer than 500 per week during the months of April and May, as shown in the following graph.\n\nWhile Becker and Blaxill12 admitted there were “no specific data on the SIDS trend during the pandemic,” the data did show that the drop was related to a dramatic reduction in infant death specifically, not older children or teens.\n\nWhat’s more, according to researchers at the U.S. Centers for Disease Control and Prevention and Kaiser Permanente, the sharp decline in infant vaccinations began in early March 2020 — the same month that infant deaths started declining.13 Is that coincidence or a sign of causality?\n\nBecker’s and Blaxill’s findings were addressed in a June 16, 2020, BMJ commentary. Responding to the authors of a paper titled “Fewer American Infants Are Dying During the COVID-19 Lockdown. Why?” retired pediatrician Allan S. Cunningham wrote:14\n\nSome of strongest evidence linking SIDS and infant vaccines comes from Japan.17,18 Between 1970 and 1974, the Japanese compensation system paid out claims for 57 permanent vaccine injury cases related to the diphtheria, tetanus and pertussis (DTP) vaccine, and 37 deaths.\n\nThe cluster triggered a boycott of the vaccine by doctors in one of the prefectures. As a result of that boycott, the Japanese government raised the minimum age for DTP vaccination from 3 months to 2 years.19\n\nIn the six years that followed (1975 through 1980), Japan became known for having the lowest infant death rate in the world, and there were only eight severe reactions and three deaths following the DTP vaccine — an 85% and 90% reduction in severe injuries and deaths respectively.20\n\nIn contrast, the U.S. has the highest infant mortality rate — and the highest vaccination rate as well. If infant vaccinations improve health and save lives, why do statistics not support such claims? As noted in Miller’s and Goldman’s 2011 paper:21\n\nSIDS and SADS — Two Sides of the Same Coin?\n\nIn the August 2022 Substack article “The Century of Evidence That Vaccines Cause Infant Deaths,” a doctor who goes by the moniker A Midwestern Doctor reviewed the link between vaccination and SIDS:22\n\nSix of 10 Vaccines Investigated Found to Increase Mortality\n\nOther compelling evidence linking vaccines and infant mortality comes from the decades-long work of Dr. Christine Stabell Benn, a clinical professor at University of Southern Denmark and her colleague Dr. Peter Aaby, a vaccine scientist and promoter of vaccination commissioned by the WHO to study the effects of vaccines used in charitable programs.\n\nA review of their four decades of investigation was published in Clinical Microbiology and Infections in August 2019,23 and reported by Science News DK in December that year.24\n\nBenn and Aaby also published a study25 in 2017, which showed the DTP program in Africa was a disaster, as vaccination was associated with a fivefold higher mortality, on average, than being unvaccinated — 3.93 times higher for boys and 9.98 times higher for girls.\n\nIn summary, Benn and Aaby, having studied the effects of 10 different vaccines on overall mortality, came to the shocking conclusion that six of the 10 increase mortality by rendering children more susceptible to other lethal diseases.\n\nOverall, inactivated (non-live) vaccines increased mortality, especially among girls, even when they offered a high degree of protection against the target disease. This was true for the DTP, pentavalent vaccine, inactivated polio vaccine, H1N1 influenza vaccine and the hepatitis B vaccine.\n\nGlaxoSmithKline’s antimalarial vaccine (RTS, S/AS01 or RTS,S, sold under the brand name Mosquirix), which appears to offer between 18% and 36.3% protection against malaria depending on the age group,26 was also found to increase overall mortality, in this case by a whopping 24%. As Stabell Benn told Science News DK:27\n\nLive attenuated vaccines, on the other hand — such as the older measles vaccine, the bacillus Calmette-Guerin against tuberculosis, oral polio vaccine and the smallpox vaccine — seemed to offer nonspecific protection against deadly diseases, contributing to a lowering of overall mortality.\n\nThat simultaneous administration of multiple vaccines might be particularly risky seems obvious, yet it’s routinely done. A Midwestern Doctor writes:28\n\nAn analysis31 of data in the Vaccine Adverse Events Reporting System (VAERS) by Miller, published in 2021, also found that “Of 2,605 infant deaths reported to VAERS from 1990 through 2019, 58 % clustered within three days post-vaccination and 78.3 % occurred within seven days post-vaccination, confirming that infant deaths tend to occur in temporal proximity to vaccine administration.”\n\nAs noted by Steve Kirsch, until or unless we have full data transparency, the question of whether the harm done by vaccines outweighs the benefits cannot be settled:32\n\n“Is it possible that the more vaccines, the more deaths? That’s what the data says. Isn’t it time we stop hiding the record-level data on mortality and vaccines for the COVID vaccines and release it publicly? The CDC is keeping these vaccine-death records under wraps because they don’t want to create vaccine hesitancy. It makes sense; when everyone finds out that they were duped they are going to be pissed. But sooner or later, one country is going to release the data and the cat will be out of the bag. Any state in the US could publicly release their vax/death records. It could even be released in any county as well. Why is every county, state, and world government HIDING this data? … It’s public information. It doesn’t benefit the public when it is kept under lock and key. Release the data! What is everyone afraid of? The truth? Note that the ‘privacy’ excuse is just that; an excuse. I point out that the data can be easily adjusted so that nobody can find even their own record without affecting any analysis.”", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Study: More Infant Vaccines = Higher Infant Mortality | The Liberty Beacon", "description": "The sharp decline in infant vaccinations began in early March 2020 (lockdown), the same month that infant deaths started declining ... coincidence?", "url": "https://www.thelibertybeacon.com/study-more-infant-vaccines-higher-infant-mortality/", "article:published_time": "2023-03-14T12:03:47+00:00", "article:modified_time": "2023-03-14T20:13:50+00:00"}, "tags": ["childhood immunization schedule", "infant vaccines", "pandemic", "Infant Mortality", "increased mortality", "SIDS", "VAERS", "lethal diseases", "hexavalent vaccines", "vaccine doses", "Dr. Joseph Mercola", "Miller-Goldman paper", "SADS", "CDC suppresses vaccine data", "lockdowns", "CDC"], "tweets": [], "movies": [], "links": ["https://pinterest.com/pin/create/button/?description=Study: More Infant Vaccines = Higher Infant Mortality&media=&url=https://www.thelibertybeacon.com/study-more-infant-vaccines-higher-infant-mortality/", "https://www.linkedin.com/shareArticle?title=Study: More Infant Vaccines = Higher Infant Mortality&url=https://www.thelibertybeacon.com/study-more-infant-vaccines-higher-infant-mortality/"], "authors": [], "publish_date": "2023-03-14T12:03:47+00:00"}