{"result_id": "300022", "URL": "https://www.thelibertybeacon.com/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "timestamp": "2023-04-25 17:28:29 CEST+0200", "meta": {"description": "Dr. Denis Rancourt has devised a formula for working out how many Covid vaccinated people have died, at 13 million worldwide so far.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "New paper: An estimated 13 million people worldwide killed by the COVID vaccines | The Liberty Beacon", "cleaned_text": "Firstly, this COVID gene injection, whether mRNA or DNA platform, and as such any of these gene injections that end in the spike protein to build the immune response, MUST be stopped! Immediately. Complete, based on the ‘body of evidence’ that has accumulated on ineffectiveness and harms.\n\nWe know from autopsy studies and adverse effect monitoring that the COVID-19 vaccines can cause death. The evidence landscape is now firm that the COVID gene injection (mRNA- or DNA platform) is ineffective, gets to negative effectiveness, drives infection in the vaccinated, drives immune tolerance (IgG class-switch induced antibodies), drives original antigenic sin immune fixation or imprinting (recall antibodies), drives paradoxical priming, drives viral immune escape, drives antibody-dependent enhancement of infection (ADEI) and also of disease (ADED), and drives infectious variants as well as causes deaths across all age-groups administered.\n\nFor this examination, vaccine-dose fatality rate (vDFR) is the ratio of vaccine-induced deaths to delivered/administered vaccine doses.\n\nResearchers found that the ‘vDFR increases dramatically with age for older adults, being exponential with a doubling time of approximately 5.2 ± 0.4 years. As a result the vDFR is an order of magnitude greater in the most elderly population than the all-population value, reaching 0.6 % for the 80+ years age group in Israel and 1% for the 85+ years age group in Australia, compared to < 0.01 % for young adults (< 45 year olds).’ The results indicate that it is dangerous and deadly to focus vaccinating (or prioritize) those deemed to be at greatest need of protection.’ This being the elderly.\n\nI have been against these COVID vaccines en toto, day one. We have said that vaccine may be, based on informed consent, risks and benefits properly explained, focused on the high-risk. Yet this data is clearly showing that we are even wrong to administer this to our high-risk precious elderly. They have early treatment available. We know of Vitamin D3 as potent in reducing severity and mortality especially if serum levels remain above 50 to 60. I again state as firmly as I can that all we needed day one in this pandemic and still today is to:\n\n1)isolate and quarantine ONLY sick and unwell persons; never ever isolate well asymptomatic persons in a society or at the border; I do not mean FORCED quarantine, I mean also that unwell persons will take the steps needed as we have always done e.g. a a sick persons typically know they are sick and stays away from work etc. and we were always dealing with a largely benign flu, cold like respiratory ILI pathogen. This was never Nipah or Ebola etc. (Marius reminded me it must never be forced and this has always been the view for THIS pathogen); never ever MASS test asymptomatic persons especially with a process like the RT-PCR that was 95% false-positive being over-cycled beyond 24 cycles that then only detect viral dust and fragments and unculturable non-infectious, non-lethal pathogen\n\n2) you strongly double and triple down protect the vulnerable e.g. elderly and other high-risk persons; this is a key component for any move towards achieving population herd immunity; this is no call to ‘let it rip’; the vulnerable often cannot take vaccine or be exposed directly so we use the low-risk ‘recovered’ population to protect the vulnerable\n\n3)we allow the vast rest of the low-risk, healthy persons, including children, to live freely, unfettered lives, no lockdowns, no school closures, just taking reasonable precautions.\n\n4)use early treatment as needed, used Vitamin D3 lavishly, use nasal-oral rinses, and ventilate homes, and if needed in homes, use oxygen support.\n\nThis is the reason why we should not have used the population as guinea pigs to trial these vaccines as to the long-term effects. The data is showing what would have emerged had Pfizer and Moderna been phased properly and to sample size and duration and this data underscores that the regulator FDA failed the American population. Health Canada failed the Canadian population. All such regulators caused deaths to their populations.\n\nYou have to bear in mind that the median/mean age of death from end-stage COVID was 82 to 83 years in February 2020 and remains so today February 2023, 3 years out, and with 2-3 underlying medical conditions. Evidence indicates that those over 70 who died in the US had as many as 5 underlying conditions. COVID spared our children unlike seasonal influenza that kills our children and today, the death rate is near zero for children 10 and under and 0.0003% for those 0-19 years. The IFR is settling out to be 0.05% globally ranging I argue and based on superb work by Ioannidis from 0.03 to 0.07% in those up to 70 years. This means that the death rate is at or below seasonal influenza, estimated to be about 0.1%. COVID kills at median of about 82 years while life expectancy is about 79 years. This means that COVID did not cut lives short and killed beyond life expectancy. Bear that in mind.\n\nThis is my assessment this morning.\n\nSee also Awakenotwoke substack, please take a look at this good scholarship:", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "New paper: An estimated 13 million people worldwide killed by the COVID vaccines | The Liberty Beacon", "description": "Dr. Denis Rancourt has devised a formula for working out how many Covid vaccinated people have died, at 13 million worldwide so far.", "url": "https://www.thelibertybeacon.com/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "article:published_time": "2023-02-12T11:56:26+00:00", "article:modified_time": "2023-02-12T11:56:26+00:00"}, "tags": ["all-cause mortality", "Dr. Paul Alexander", "Peter Halligan", "Excess Mortality", "vaccine dose fatality rate (vDFR)", "Jeremie Mercier", "Dr. Denis Rancourt", "Joseph Hickey", "Pam Barker", "Europe Reloaded", "Marine Baudin", "Steve Kirsch"], "tweets": [], "movies": [], "links": ["https://www.researchgate.net/publication/368389701_Age-stratified_COVID-19_vaccine-dose_fatality_rate_for_Israel_and_Australia", "https://substack.com/profile/88409534-awakenotwoke?utm_source=account-card", "https://palexander.substack.com/p/shocking-yet-we-told-them-so-age?utm_source=post-email-title&publication_id=579356&post_id=102283173&isFreemail=true&utm_medium=email"], "authors": [], "publish_date": "2023-02-12T11:56:26+00:00"}