{"result_id": "300041", "URL": "https://www.thelibertybeacon.com/fda-documents-confirm-pfizers-2021-mrna-vaccine-lots-had-different-formulations-based-on-lot/", "timestamp": "2023-04-25 17:29:09 CEST+0200", "meta": {"description": "FDA documents show that Pfizer unleashed several different mRNA formulations in their injections on the public.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/fda-documents-confirm-pfizers-2021-mrna-vaccine-lots-had-different-formulations-based-on-lot/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "FDA Documents Confirm Pfizer’s 2021 mRNA Vaccine Lots Had Different Formulations Based on Lot# | The Liberty Beacon", "cleaned_text": "When the emergency use (EUA) COVID-19 mRNA vaccines were first rolled out in the United States, many Americans questioned if different formulations were being distributed. Why? Because some people became severely injured or died after vaccination, while others seemed completely fine. Furthermore, some vaccine lots had higher incidences of severe injuries and deaths, while other lots and little to no adverse events per the VAERS database.\n\nIn a court of law, it would be difficult to argue that the incidence of adverse events by lot number is evidence that the EUA mRNA vaccines varied in formulation. One could simply counter argue that people respond differently to biologics and drugs. The varying rates of adverse events can easily be dismissed as a coincidence or potentially attributed to some other factor affecting residents in that region, such as higher rates of obesity.\n\nWhat one can’t argue against is Pfizer’s and the FDA’s (CBER) own admission that Pfizer’s EUA mRNA vaccines vary in formulations.\n\nPer the FDA’s approval of Pfizer’s Biological License Application (BLA); Dr. Ramachandra Naik, of the FDA/CBER, specifically asked Pfizer, “What EUA mRNA vaccine lots are the same as the FDA approved formulation of COMIRNATY?”\n\nPfizer’s answer should have been, ‘All of them.’ Why? Because in 2021 the American people were told that there was only one formulation for Pfizer’s EUA COVID-19 mRNA vaccines. But that wasn’t Pfizer’s response. Not even close.\n\nInstead, Pfizer responded to Dr. Naik and the FDA by saying, “Here’s a list of lot numbers for EUA mRNA vaccines that are the same formulation as COMIRNATY.”\n\nThis means that throughout 2021, there were some Pfizer EUA mRNA lots that had the same formulation as COMIRNATY and a whole bunch of lots that had different mRNA formulations.\n\nPfizer’s and the FDA’s own BLA document confirms that Pfizer unleashed on the American people and our children.\n\nOn December 11, 2020, Dr. Peter Marks, Director of the Center for Biologics Evaluation and Research (CBER), assured the American people that, “…the available safety and effectiveness data support the authorization of the Pfizer-BioNTech COVID-19 Vaccine because the vaccine’s known and potential benefits clearly outweigh its known and potential risks.”\n\nMy key issue with Dr. Peter Marks’ statement is that he does not clarify which Pfizer COVID-19 mRNA formulation he claims to know the risks outweigh the benefit for.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "FDA Documents Confirm Pfizer’s 2021 mRNA Vaccine Lots Had Different Formulations Based on Lot# | The Liberty Beacon", "description": "FDA documents show that Pfizer unleashed several different mRNA formulations in their injections on the public.", "url": "https://www.thelibertybeacon.com/fda-documents-confirm-pfizers-2021-mrna-vaccine-lots-had-different-formulations-based-on-lot/", "article:published_time": "2022-11-24T07:16:58+00:00", "article:modified_time": "2022-11-24T07:16:58+00:00"}, "tags": ["Comirnaty", "Pfizer Covid vaccine lot numbers", "FDA", "Karen Kingston", "mRNA formulations Pfizer", "Pam Barker", "Europe Reloaded", "Pfizer Covid vaccine batch numbers"], "tweets": [], "movies": [], "links": ["https://www.fda.gov/media/151733/download", "https://www.fda.gov/media/151733/download", "https://www.comirnaty.com/", "https://www.fda.gov/media/151733/download", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19", "https://karenkingston.substack.com/p/fda-documents-confirm-pfizers-2021?utm_source=post-email-title&publication_id=1103773&post_id=85977514&isFreemail=true&utm_medium=email"], "authors": [], "publish_date": "2022-11-24T07:16:58+00:00"}