{"result_id": "300028", "URL": "https://www.thelibertybeacon.com/spanish-govt-refuses-to-disclose-vaccine-contracts-despite-court-ruling/", "timestamp": "2023-04-25 17:28:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/spanish-govt-refuses-to-disclose-vaccine-contracts-despite-court-ruling/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Spanish Govt Refuses to Disclose Vaccine Contracts Despite Court Ruling | The Liberty Beacon", "cleaned_text": "PALMA – Asociación Liberum, a national human rights association, had requested this evidence as part of its lawsuit against the Covid passport, but both the Ministry of Health and the drug agency have refused to comply with this court order by the deadline set. Asociación Liberum announced this on 6 September. The government’s justification for the contracts were confidential because they were drawn up by a coordination committee and were part of the “pre-contractual agreements concluded by the European Commission” with the pharmaceutical companies. Moreover, the publication of the data could harm the vaccine market. (ER: incredible)\n\nIn an interview, Ascociación Liberum spokesperson Luis Maria Pardo said: “Can you imagine the Guardia Civil entering the Ministry of Health to seize these documents?”\n\nBecause this is exactly what has to happen now, he said, since the Supreme Court’s decision is legally binding. Added to this is the fact that the government had not appealed against this order. The Ministry of Health and the AEMPS are obliged to hand over the original documents to the judiciary.\n\nThere was no discussion about this, Pardo stressed. That is why his organisation has again demanded that the Supreme Court of the Balearic Islands implement the ruling. The lawyer hopes that this request will be granted as soon as possible.\n\nIn addition, Pardo pointed out that those responsible in the Ministry of Health and the Medicines Agency could be prosecuted “for disregarding the court’s decision”. In that case, the state security forces would indeed have to be deployed – and the Guardia Civil would have to storm the Ministry of Health to seize the documents.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Spanish Govt Refuses to Disclose Vaccine Contracts Despite Court Ruling | The Liberty Beacon", "url": "https://www.thelibertybeacon.com/spanish-govt-refuses-to-disclose-vaccine-contracts-despite-court-ruling/", "article:published_time": "2022-09-18T10:12:05+00:00", "article:modified_time": "2022-09-18T10:12:05+00:00"}, "tags": ["Association Liberum", "Spanish govt vaccine contracts", "Balearic Islands Court", "Spanish Guardia Civil", "FreeWest Media", "AEMPS pharmaceutical agency", "Asociacion Liberum", "Pam Barker", "Europe Reloaded"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=Xnfm-Fq8ltY", "https://freewestmedia.com/2022/09/18/spanish-government-refuses-to-disclose-vaccine-contracts-despite-court-ruling/"], "authors": [], "publish_date": "2022-09-18T10:12:05+00:00"}