{"result_id": "300011", "URL": "https://www.thelibertybeacon.com/cdc-study-finds-covid-vaccine-can-cause-children-to-suffer-vaccine-associated-enhanced-disease/", "timestamp": "2023-04-25 17:28:10 CEST+0200", "meta": {"description": "A study by the CDC and University of Colorado show 2 adolescents who go on to suffer serious vaccine-enhanced diseases following 2 doses of Pfizer.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/cdc-study-finds-covid-vaccine-can-cause-children-to-suffer-vaccine-associated-enhanced-disease/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "CDC Study Finds COVID Vaccine Can Cause Children to Suffer Vaccine-Associated Enhanced Disease | The Liberty Beacon", "cleaned_text": "The study aimed to prove that Covid-19 vaccination effectively protects children against multisystem inflammatory syndrome. But unfortunately, they discovered the study authors discovered the complete opposite.\n\nMultisystem inflammatory syndrome (MIS) is a condition that mainly affects children, and causes dangerous inflammation throughout the body, including in the:\n\nThe condition can be both severe and life-threatening. Unfortunately, experts have no idea what causes it, but this hasn’t stopped the U.S. Centers for Disease Control from attributing the condition to complications of the alleged Covid-19 disease.\n\nResearchers from the University of Colorado carried out a detailed study of two otherwise healthy, fully vaccinated children in the USA who were diagnosed with multisystem inflammatory syndrome.\n\nIn the first case, headache and myalgia developed in a healthy 14-year-old boy, but by day 7 of suffering illness, fever, abdominal pain, diarrhoea, emesis, bloodshot eyes, red cracked lips, and rash had also developed. On day 10, he was brought for treatment to the emergency department and admitted to a quaternary-care pediatric hospital.\n\nThree months earlier, he had completed the Pfizer-BioNTech 2-dose COVID-19 vaccine series. One month later, he experienced three days of coughing and congestion and tested positive by PCR for SARS-CoV-2 infection, from which he allegedly recovered.\n\nAt hospital admission, an examination by doctors noted a sickly appearance, fever (39.1°C), tachycardia, rash, conjunctivitis, cracked lips, and abdominal tenderness.\n\nAn echocardiogram revealed trivial pericardial effusion. While abdominal ultrasound and chest radiograph results were unremarkable. Tests for SARS-CoV-2 spike and nucleocapsid IgG returned a positive. Other infectious condition test results were negative (Table 2).\n\nOn the patient’s first day of hospitalization, the infectious diseases section was consulted, and it was determined that the patient’s illness met the Centers for Disease Control and Prevention multisystem inflammatory syndrome criteria.\n\nTreatment improved the rash, headache, and conjunctivitis but fever, malaise, and nausea persisted, and cardiac markers rose. After further treatment, the child was eventually discharged on day 5 of hospitalisation.\n\nCardiology follow-up 6 weeks after hospital discharge, unfortunately, revealed ongoing fatigue and a new mild left main coronary artery enlargement.\n\nIn the second case, fever and fatigue, followed by congestion, cough, myalgias, headache, nausea, and vomiting, developed in an otherwise healthy 14-year-old girl.\n\nOn day 3 of illness, rapid SARS-CoV-2 and influenza test results were negative, then on day 12, she was brought to the emergency department due to suffering persistent fever, headache, cough, and vomiting. This time she tested positive for Covid-19.\n\nThree months before her illness, she had completed the 2-dose Pfizer-BioNTech COVID-19 vaccine series.\n\nThe child was prescribed amoxicillin for possible sinusitis and discharged. But then on day 14, she returned to the hospital for dyspnea and required low-flow oxygen for hypoxemia. Electrocardiogram, troponin, and NT-proBNP test results were normal.\n\nShe was admitted and criminally received 1 dose of remdesivir, which was discontinued because of elevated liver function test results (Table 1).\n\nThe child improved and was discharged on day 18. However, she returned the next day with a recrudescent fever, emesis, and a new diffuse rash, including on her palms and soles.\n\nAt readmission on day 19, differential diagnoses included multisystem inflammatory syndrome, acute COVID-19 with hyper inflammation, sepsis, toxic shock syndrome, drug reaction, and vasculitis or another autoimmune disease.\n\nA SARS-CoV-2 nucleocapsid IgG test was positive. Additional infectious and rheumatologic test results were negative (Table 2). After discussion among multidisciplinary specialists, doctors considered multisystem inflammatory syndrome most likely.\n\nEventually, the child was discharged on day 9 of readmittance to the hospital.\n\nWhat does the Study tell us?\n\nFirst, let’s take a look at some of the horrific illnesses that were suffered by these two children.\n• Hyponatremia: This is a condition characterized by low levels of sodium in the blood. Its symptoms are similar to those caused by dehydration. In severe cases, the brain may swell, which can lead to headaches, seizures, coma, and even death\n• Thrombocytopenia: This is a deficiency of platelets in the blood. This causes bleeding into the tissues, bruising, and slow blood clotting after injury.\n• Lymphopenia: This is a disorder in which your blood doesn’t have enough white blood cells called lymphocytes, which play an essential protective role in your immune system.\n• Sepsis: This is a life-threatening reaction to an infection. It happens when your immune system overreacts to an infection and starts to damage your body’s own tissues and organs.\n• Toxic shock syndrome: This is a rare but life-threatening condition caused by bacteria getting into the body and releasing harmful toxins.\n• Vasculitis or another autoimmune disease: Vasculitis is an autoimmune disease that causes inflammation and narrowing of blood vessels. Autoimmune disease happens when the body’s natural defence system can’t tell the difference between your own cells and foreign cells, causing the body to mistakenly attack normal cells.\n\nIt’s hard to believe that two children could possibly suffer all of these horrendous conditions following infection with Covid-19, when we know that children are at negligible risk of suffering illness worse than the common cold.\n\nBut the reason these two otherwise healthy children suffered these conditions is because they had received two doses of the Pfizer Covid-19 injection and unfortunately went on to suffer Vaccine-Associated Enhanced Disease once they were exposed to the alleged Covid-19 virus.\n\nHow do we know this? Because it’s all in the confidential Pfizer documents that the U.S Food & Drug Administration (FDA) has been forced to publish by court order.\n\nVaccine-associated enhanced diseases (VAED) are modified presentations of clinical infections affecting individuals exposed to a wild-type pathogen after having received a prior vaccination for the same pathogen.\n\nEnhanced responses are triggered by failed attempts to control the infecting virus, and VAED typically presents with symptoms related to the target organ of the infection pathogen. According to scientists VAED occurs as two different immunopathologies, antibody-dependent enhancement (ADE) and vaccine-associated hypersensitivity (VAH).\n\nIntensive research conducted by health experts throughout the years has brought to light increasing concerns about “Antibody-Dependent Enhancement” (ADE), a phenomenon where vaccines make the disease far worse by priming the immune system for a potentially deadly overreaction.\n\nADE can arise in several different ways but the best-known is dubbed the ‘Trojan Horse Pathway’. This occurs when non-neutralizing antibodies generated by past infection or vaccination fail to shut down the pathogen upon re-exposure.\n\nInstead, they act as a gateway by allowing the virus to gain entry and replicate in cells that are usually off limits (typically immune cells, like macrophages). That, in turn, can lead to wider dissemination of illness, and over-reactive immune responses that cause more severe illness.\n\nHere’s a short video of the Chief Medical Advisor to the U.S. President, Dr Anthony Fauci, explaining the undesirable consequence. In it, he confirms it could be a possible danger of the Covid-19 injections and that this would not be the first time it has happened.\n\nNow, thanks to an uncorrupted judge, we know it does.\n\nThe US Food and Drug Administration (FDA) attempted to delay the release of Pfizer’s COVID-19 vaccine safety data for 75 years despite approving the injection after only 108 days of safety review on December 11th, 2020.\n\nBut in early January 2022, Federal Judge Mark Pittman ordered them to release 55,000 pages per month. They released 12,000 pages by the end of January.\n\nSince then, PHMPT has posted all of the documents to its website.\n\nOne of the documents contained in the data dump is ‘reissue 5.3.6 postmarketing experience.pdf’. Table 5, found on page 11 of the document shows an ‘Important Potential Risk’, and that risk is listed as ‘Vaccine-Associated Enhanced Disease (VAED), including Vaccine-Associated Enhanced Respiratory Disease (VAERD)’.\n\nPfizer claim in their confidential document that up to 28th Feb 2021, they had received 138 cases reporting 317 potentially relevant events indicative of Vaccine-Associated Enhanced Disease. Of these 71 were medically significant resulting in 8 disabilities, 13 were life-threatening events, and 38 of the 138 people died.\n\nOf the 317 relevant events reported by 138 people, 135 were labelled as ‘drug ineffective’, 53 were labelled as dyspnoea (struggling to breathe), 23 were labelled as Covid-19 pneumonia, 8 were labelled as respiratory failure, and 7 were labelled as seizure.\n\nPfizer also admitted that 75 of the 101 subjects with confirmed Covid-19 following vaccination had severe disease resulting in hospitalisation, disability, life-threatening consequences or death.\n\nBut Pfizer still definitively concluded, for the purposes of their submitted safety data to the Food and Drug Administration, the very data that was needed to gain emergency use authorisation and make them billions and billions of dollars, that ‘None of the 75 cases could be definitively considered as VAED’.\n\nBut Pfizer then went on to confirm that, based on the current evidence, VAED remains a theoretical risk.\n\nFurther evidence from the confidential document also shows that both the FDA and Pfizer knew the Covid-19 injection has killed at least 12 people who developed an autoimmune disorder, by February 2021. That doesn’t mean these are the only people to have died due to autoimmune conditions induced by the jabs: these are just the ones that were officially reported to Pfizer in the first two months of their vaccine roll-out.\n\nConfidential data proves that the Covid-19 injections should never have been granted emergency use authorisation, and should have been pulled from distribution by the FDA as soon as they sighted the figures.\n\nBut the FDA failed to act, and that is precisely why we’re now seeing studies published containing horrific details of fully vaccinated children suffering brain swelling, internal bleeding and blood clotting, life-threatening reactions to infections, decimated immune systems, and autoimmune diseases following Covid-19 infection.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "CDC Study Finds COVID Vaccine Can Cause Children to Suffer Vaccine-Associated Enhanced Disease | The Liberty Beacon", "description": "A study by the CDC and University of Colorado show 2 adolescents who go on to suffer serious vaccine-enhanced diseases following 2 doses of Pfizer.", "url": "https://www.thelibertybeacon.com/cdc-study-finds-covid-vaccine-can-cause-children-to-suffer-vaccine-associated-enhanced-disease/", "article:published_time": "2022-09-20T09:50:52+00:00", "article:modified_time": "2022-09-20T09:50:52+00:00"}, "tags": ["antibody dependent enhancement (ADE)", "FDA", "vaccine-associated hypersensitivity (VAH)", "multisystem inflammatory syndrome", "Vaccine-associated enhanced disease", "The Expose", "Pfizer documents", "Pam Barker", "Europe Reloaded", "Covid vaccines children", "Dr. Anthony Fauci", "CDC"], "tweets": [], "movies": [], "links": ["https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560-t1", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560-t2", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560-t1", "https://expose-news.com/2021/09/02/remdesivir-causes-renal-failure-hospital-protocols-are-killing-people/", "https://expose-news.com/2022/04/23/you-gave-up-twp-years-life-midazolam-covid-lie/", "https://www.google.com/search?sa=X&hl=en&sxsrf=ALiCzsa4YLp2DlqJili-Gf_8njERlHglfQ:1663665128088&q=What+is+midazolam+called+in+the+USA%3F&ved=2ahUKEwi9kfDHg6P6AhUV_BoKHVjLDrIQzmd6BAgOEAU&biw=1200&bih=708&dpr=1.25", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560-t1", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560-t2", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8427162/", "https://www.fda.gov/", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine#:~:text=The%20first%20EUA%2C%20issued%20Dec,trial%20of%20thousands%20of%20individuals.", "https://phmpt.org/pfizers-documents/", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-88.png?ssl=1", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-89.png?ssl=1", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://wwwnc.cdc.gov/eid/article/28/7/22-0560_article", "https://expose-news.com/2022/09/20/cdc-covid-vaccine-children-suffer-vaed/"], "authors": [], "publish_date": "2022-09-20T09:50:52+00:00"}