{"result_id": "300050", "URL": "https://www.thelibertybeacon.com/75322-dead-5938318-injured-recorded-in-europe-usa-following-covid-vaccines-babies-and-toddlers-hallucinating-and-having-seizures-after-shots/", "timestamp": "2023-04-25 17:29:27 CEST+0200", "meta": {"description": "Combined the true number of deaths due to Covid vaccines in EU & USA may be 7.5 million with almost 600 million vaccine injuries.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/75322-dead-5938318-injured-recorded-in-europe-usa-following-covid-vaccines-babies-and-toddlers-hallucinating-and-having-seizures-after-shots/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "75,322 Dead 5,938,318 Injured Recorded in Europe & USA Following COVID Vaccines – Babies and Toddlers Hallucinating and Having Seizures After Shots | The Liberty Beacon", "cleaned_text": "Meaning that we need to multiply reports of vaccine injuries and death by AT LEAST 100 times.\n\nAdverse events from drugs and vaccines are common, but underreported. Although 25% of ambulatory patients experience an adverse drug event, less than 0.3% of all adverse drug events and 1-13% of serious events are reported to the Food and Drug Administration (FDA). Likewise, fewer than 1% of vaccine adverse events are reported. Low reporting rates preclude or slow the identification of “problem” drugs and vaccines that endanger public health. New surveillance methods for drug and vaccine adverse effects are needed. …\n\nER Editor: Brian Shilhavy below reminds us that underreporting of vaccine injuries is a significant problem by way of Dr. Jessica Rose ‘s work and that of the Harvard Pilgrim Healthcare Study from 2011 . To quote it:\n\nAll Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThe European Medicines Agency (EMA) database of adverse drug reactions is now reporting 46,160 deaths and 4,623,724 injuries following COVID-19 vaccines, while the United States’ Vaccine Adverse Events Recording System (VAERS) is now reporting 29,162 deaths and 1,314,594 injuries following COVID-19 vaccines. (Source.)\n\nWe know that as huge as these numbers are, which are official government statistics, they only represent a very small fraction of the total number of deaths and injuries suffered by those who chose to receive COVID-19 vaccines during the past 18 months.\n\nLast year, Dr. Jessica Rose did a comprehensive analysis to determine the “under-reported factor” in VAERS, and came up with 41X, meaning that the recorded data for adverse reactions to COVID-19 vaccines in VAERS had to be multiplied by 41 to get more accurate numbers. See:\n\nHowever, now that more time has elapsed since this study was performed, many feel that 41X is significantly too low, and should be closer to 100X, which is the number that was previously used based on a 2011 report by Harvard Pilgrim Health Care, Inc. for the U.S. Department of Health and Human Services (HHS).\n\nSo if we take the publicly available data from VAERS and the European EMA and multiply by 100, these would be the true numbers of adverse events following COVID-19 vaccines:\n\n7,532,200 deaths and 593,831,800 injuries in Europe and the U.S.\n\nThe European (EEA and non-EEA countries) database of suspected drug reaction reports is EudraVigilance, verified by the European Medicines Agency (EMA), and they are now reporting 46,160 fatalities, and 4,623,724 injuries following injections of five experimental COVID-19 shots:\n\nFrom the total of injuries recorded, almost half of them (2,106,816) are serious injuries.\n\n“Seriousness provides information on the suspected undesirable effect; it can be classified as ‘serious’ if it corresponds to a medical occurrence that results in death, is life-threatening, requires inpatient hospitalisation, results in another medically important condition, or prolongation of existing hospitalisation, results in persistent or significant disability or incapacity, or is a congenital anomaly/birth defect.”\n\nA Health Impact News subscriber in Europe ran the reports for each of the four COVID-19 shots we are including here. It is a lot of work to tabulate each reaction with injuries and fatalities, since there is no place on the EudraVigilance system we have found that tabulates all the results.\n\nSince we have started publishing this, others from Europe have also calculated the numbers and confirmed the totals.*\n\nHere is the summary data through July 2, 2022.\n\nTotal reactions for the mRNA vaccine Tozinameran (code BNT162b2,Comirnaty) from Pfizer: 21,746 deaths and 2,387,920 injuries to 02/07/2022\n\nTotal reactions for the mRNA vaccine SPIKEVAX/mRNA-1273 (CX-024414) from Moderna: 12,143 deaths and 758,215 injuries to 02/07/2022\n\nTotal reactions for the vaccine AZD1222/VAXZEVRIA (CHADOX1 NCOV-19) from Oxford/ AstraZeneca: 9,241 deaths and 1,308,248 injuries to 02/07/2022\n\nTotal reactions for the COVID-19 vaccine JANSSEN (AD26.COV2.S) from : 3,030 deaths and 166,334 injuries to 02/07/2022\n\nTotal reactions for the COVID-19 vaccine NUVAXOVID (NVX-COV2373) from : 0 deaths and 3,007 injuries to 02/07/2022\n\n*These totals are estimates based on reports submitted to EudraVigilance. Totals may be much higher based on percentage of adverse reactions that are reported. Some of these reports may also be reported to the individual country’s adverse reaction databases, such as the U.S. VAERS database and the UK Yellow Card system. The fatalities are grouped by symptoms, and some fatalities may have resulted from multiple symptoms.\n\nParents Offer Up Their Babies and Toddlers to the Demonic Vaccine Cult – Hallucinations Among Reported Side Effects\n\nLast month (June, 2022) the FDA gave parents authorization to start offering their babies and toddlers to the COVID-19 Vaccine Cult, and injections began in children under the age of 5.\n\nThere are currently 476 cases of COVID-19 injuries in this age group in VAERS (source), although many of these cases were before the authorization was given.\n\nI have listed all current 476 cases on one page that can be viewed here. The most current cases, after the authorization, can be seen at the bottom.\n\nRemarkably, many of the cases listed prior to the authorization were entries made by health officials because. after injecting the child, they found out that the child was under the age of 5, and not yet authorized to receive the shots.\n\nIn other words, the parents were so desperate to inject their toddlers, they lied about their child’s age to get the shot, which would have been a dose made for older children, and the health official felt compelled to enter it into VAERS to cover themselves legally after they found out.\n\nStaff was misled by mother regarding the patient’s age. This resulted in the child being vaccinated despite being ineligible (due to being 4). The vaccination process otherwise went without incident. Patient was observed for approx. 15 minutes after, in accordance with current guidelines. Afterwards, the patient left with her mother again without incident. (VAERS ID 2264666) The patient received a pediatric Pfizer Covid vaccine, but she is only 4 years old, which is under the approved age. The parents falsified the child”s date of birth during check in and on the paperwork. They called the pharmacy the next day (4/21/22) to apologize and let us know that she was actually under age. There were no adverse effects reported during the time of the vaccine, at the time of the phone call on 4/21/22 or at the time of the follow up call on 4/25/22. (VAERS ID 2250179) Patient falsified DOB when registering for vaccination, stating the minor was born 10 days earlier than actual DOB. Guardian consented to the vaccination. Department of Health verified with statistical records the patients actual DOB, which made the vaccine a contraindication. No known adverse reactions noted. (VAERS ID 2283077)\n\nIn at least one case, a doctor approved the shot even though it was not yet authorized by the FDA:\n\nCases where the new vaccines were given to the babies and toddlers under the age of 5 after the FDA authorization and there was an adverse reaction are just now starting to trickle in.\n\nIn one case, a 2-year-old baby girl started hallucinating within 6 hours of being injected:\n\nOne mother reported on Twitter that her 8-year-old daughter started hallucinating and having feelings of suicide after the shots.\n\nEarly reports in VAERS show that the poor toddlers are putting up a good fight in trying to reject the shots, but sadly, they are over-matched and sometimes just end up getting jabbed twice for resisting.\n\nPatient moved during vaccination attempt and over half of COVID 19 vaccine was not injected intramuscularly. Patient returned on 6/23/22 to another mobile vaccine clinic to receive full dose appropriate for her age. (3 years old – VAERS ID 2329682) Vaccinator inserted needle into pt’s arm. Mother did not have a good hold and pt moved. Needle came out before vaccinator was able to inject. Pt was then vaccinated with full dose. (3 years old – VAERS ID 2327250) Nurse stuck needle in child’s arm to vaccinate, but child pulled arm away before vaccine was administered. Nurse wasted that dose and administered the vaccine in the opposite arm. (2 years old – VAERS ID 2326989) EUA – young moderna dose 1. Patient moved away during administration and only received a partial dose (majority of solution was not injected). Parent informed and clinical team. Patient was re-vaccinated per guidelines. (2 years old – VAERS ID 2328918) Needle inserted into patients L thigh, but vaccine was not administered. Patient slapped the syringe and the needle bent. RN was able to remove entire needle. Small scratch noted on L thigh. (2 years old – VAERS ID 2325671)\n\nSteve Kirsch reported that nurses told him that many of these children 2 and 3 years old are having seizures.\n\nMeanwhile, state legislators and the U.S. Congress are overwhelmingly passing laws to criminalize anyone who denies that millions of Jews were killed in the Holocaust during WW II, but if you deny the fact that millions of children and adults are being killed and harmed by COVID-19 shots, you can have your own corporate news show and earn tons of money from Big Pharma ads, or you can be given a job working at the FDA or CDC.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "75,322 Dead 5,938,318 Injured Recorded in Europe & USA Following COVID Vaccines – Babies and Toddlers Hallucinating and Having Seizures After Shots | The Liberty Beacon", "description": "Combined the true number of deaths due to Covid vaccines in EU & USA may be 7.5 million with almost 600 million vaccine injuries.", "url": "https://www.thelibertybeacon.com/75322-dead-5938318-injured-recorded-in-europe-usa-following-covid-vaccines-babies-and-toddlers-hallucinating-and-having-seizures-after-shots/", "article:published_time": "2022-07-08T11:02:26+00:00", "article:modified_time": "2022-07-08T11:02:26+00:00"}, "tags": ["VAERS", "underreporting vaccine injuries", "Brian Shilhavy Health Impact News", "Dr. Jessica Rose", "COVID Vaccine Deaths", "Covid vaccine adverse events", "Pam Barker", "Eudravigilance until July 2 2022", "Europe Reloaded"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://healthimpactnews.com/determining-the-vaers-under-reporting-multiplier/", "https://healthimpactnews.com/wp-content/uploads/sites/2/2022/07/ahrq-vaers-report-2011.pdf", "http://www.adrreports.eu/en/index.html", "https://dap.ema.europa.eu/analytics/saw.dll?PortalPages&PortalPath=%2Fshared%2FPHV%20DAP%2F_portal%2FDAP&Action=Navigate&P0=1&P1=eq&P2=%22Line%20Listing%20Objects%22.%22Substance%20High%20Level%20Code%22&P3=1+40983312", "https://dap.ema.europa.eu/analytics/saw.dll?PortalPages&PortalPath=%2Fshared%2FPHV%20DAP%2F_portal%2FDAP&Action=Navigate&P0=1&P1=eq&P2=%22Line%20Listing%20Objects%22.%22Substance%20High%20Level%20Code%22&P3=1+42325700", "https://dap.ema.europa.eu/analytics/saw.dll?PortalPages&PortalPath=%2Fshared%2FPHV%20DAP%2F_portal%2FDAP&Action=Navigate&P0=1&P1=eq&P2=%22Line%20Listing%20Objects%22.%22Substance%20High%20Level%20Code%22&P3=1+40995439", "https://dap.ema.europa.eu/analyticsSOAP/saw.dll?PortalPages&PortalPath=%2Fshared%2FPHV%20DAP%2F_portal%2FDAP&Action=Navigate&P0=1&P1=eq&P2=%22Line%20Listing%20Objects%22.%22Substance%20High%20Level%20Code%22&P3=1+42287887", "https://dap.ema.europa.eu/analyticsSOAP/saw.dll?PortalPages&PortalPath=%2Fshared%2FPHV%20DAP%2F_portal%2FDAP&Action=Navigate&P0=1&P1=eq&P2=%22Line%20Listing%20Objects%22.%22Substance%20High%20Level%20Code%22&P3=1+42287687", "http://www.adrreports.eu/en/background.html", "http://www.adrreports.eu/en/background.html", "https://mobile.twitter.com/jennifer5584/status/1542123277803560961", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&PERPAGE=500&ESORT=VAX-DATE&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=5", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&PERPAGE=500&ESORT=VAX-DATE&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=5", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2264666", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2250179", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2283077", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2281214", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2329230", "https://mobile.twitter.com/jennifer5584/status/1542123277803560961", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2329682", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2327250", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2326989", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2328918", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2325671", "https://stevekirsch.substack.com/p/two-and-3-year-old-kids-with-seizures", "https://stevekirsch.substack.com/p/two-and-3-year-old-kids-with-seizures", "https://healthimpactnews.com/2022/this-bill-promoted-internet-censorship-and-violations-of-the-1st-amendment-rep-massie-lone-vote-against-anti-semitism-bill/", "https://www.globalresearch.ca/75322-dead-5938318-injured-recorded-europe-usa-following-covid-vaccines-babies-toddlers-hallucinating-having-seizures-after-shots/5785941"], "authors": [], "publish_date": "2022-07-08T11:02:26+00:00"}