{"result_id": "300020", "URL": "https://www.thelibertybeacon.com/killing-children-for-profit-europe-suffers-1580-spike-in-child-deaths-following-ema-approval-of-covid-vaccine-for-children/", "timestamp": "2023-04-25 17:28:25 CEST+0200", "meta": {"description": "EuroMomo stats show that excess mortality in children rose significantly with Covid vaccine rollout; during Covid, there was negative excess mortality.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/killing-children-for-profit-europe-suffers-1580-spike-in-child-deaths-following-ema-approval-of-covid-vaccine-for-children/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Killing Children for Profit: Europe suffers 1580% spike in Child Deaths following EMA approval of COVID Vaccine for Children | The Liberty Beacon", "cleaned_text": "The alleged COVID-19 pandemic has affected every aspect of our lives, and the approval of the COVID-19 vaccine for children was seen as a ray of hope by those who believe everything that their television tells them.\n\nHowever, recent statistics given to EuroMOMO by the official authorities of 27 countries across Europe, including the UK, France, Italy, Spain and most of Germany, have shown a significant increase in excess deaths among children ever since the European Medicines Agency (EMA) approved the COVID-19 injection for 12 to 15-year-olds in 2021, and then 5 to 11-year-olds just a few months later.\n\nSo much so, that they have increased by a worrying 1,580% compared to the same period of time when it was both the height of the alleged pandemic, and the Covid-19 injection was not being offered to children.\n\nPrior to the approval of the Covid-19 vaccine for children, the number of excess deaths among children in Europe was non-existent.\n\nAccording to EuroMOMO, in the first 21 weeks of 2021, there were 346 fewer deaths than expected, meaning there were minus-346 or 0 excess deaths.\n\nHowever, as soon as the EMA approved the Covid-19 vaccine for 12 to 15-year-olds in week 22 of 2021, the number of excess deaths began to rise, significantly.\n\nThis increase in excess deaths was of course not publicised in the mainstream media. But came as no surprise to those who were already aware of the heavily censored damage that Covid-19 vaccination was doing to adults.\n\nIf it had been publicised, instead of being swept under the carpet, it would have sparked widespread concern among parents who had chosen to vaccinate their children due to believing everything they are told on the television.\n\nIt would have also prevented other parents from forcing their children to get a vaccine they simply did not, and do not need, when the European Medicines Agency (EMA) extended the emergency use authorisation of the Pfizer Covid-19 injection for use in 5 to 11-year-old children just a few months later.\n\nThis may have, therefore, prevented the shocking increase in excess deaths that have been recorded among children in Europe up to the end of 2022.\n\nBut as it stands, the consequences of the choice to extend the emergency use authorisation of the Covid-19 vaccine to children has had far-reaching implications.\n\nAnd it is evidence of the authorities’ priorities and inhumane approach to public health due to so carelessly disregarding the health and safety of children in the pursuit of a vaccine campaign that has done nothing but cause widespread devastation and created huge profits for Big Pharma.\n\nAccording to EuroMOMO, there were 466 fewer deaths than expected among children in Europe throughout the whole of 2020 at the height of the alleged pandemic.\n\nHowever, as we know the alleged pandemic didn’t really hit Europe until around March 2020.\n\nUnfortunately, for the authorities, this makes the decision to jab children even worse, as 616 fewer deaths were recorded among children at the height of the alleged pandemic.\n\nCouple this with the fact this trend continued in 2021 up to the EMA extending the emergency use authorisation of the Pfizer Covid-19 injection for use in 12-15-year-old children, then you can see why these figures raise serious questions as to why Governments, NGOs, Medicine Regulators, and tax-payer funded scientists and doctors were so eager to get an experimental mRNA gene therapy into the arms of children.\n\nThe figures prove that the alleged Covid-19 virus was posing no risk to children, and they were in fact in better shape than ever.\n\nThis is why it is truly unbelievable that children have been subjected to experimental vaccines with known side effects and unknown long-term consequences.\n\nTragically, following the emergency approval of the Covid vaccine for children, a staggering 1,953 excess deaths were recorded between week 22 of 2021 and week 52 of 2022.\n\nFor comparison, there were 334 excess deaths recorded among children between week 22 and week 52 of 2019.\n\nTherefore, between week 22 of 2019 and week 52 of 2020, there were 132 fewer deaths than expected among children aged 0-14 across Europe.\n\nThis allows us to do a side-by-side comparison against the post-Covid-19 vaccine authorisation figures.\n\nBut due to the fact a negative number of excess deaths were recorded prior to authorisation of the Covid-19 vaccine for children and at the height of the Covid-19 pandemic, it is hard for us to equate the exact increase in excess deaths.\n\nThe percentage increase of 1,953 excess deaths between week 22 of 2021 and week 52 of 2022 against -132 excess deaths between week 22 of 2019 and week 52 of 2020 equates to -1,580%. Of course, we know that excess deaths have in fact increased and not decreased so we could say that excess deaths have increased by 1,580% / 16.8x.\n\nOr we could turn the -132 excess deaths in 19/20 into the number 1, and add the same difference to the 1,953 excess deaths in 21/22. This equates to 2,086 excess deaths. The increase in excess deaths then equates to a shocking and unbelievable 208,500% / 2,086x increase.\n\nBut whichever way we look at it, both the figures and correlation are clear. EMA approval of the Covid-19 vaccine for children caused a significant increase in excess deaths across Europe when they were suffering fewer deaths than expected prior to the approval.\n\nIn conclusion, the increase in excess deaths across Europe since the approval of the COVID-19 vaccine for children raises important questions about the safety of the vaccine and the choices made by authorities.\n\nThe fact that authorities continue to push for the vaccination of children, despite the overwhelming evidence of harm, is both inhumane and a betrayal of public trust.\n\nIt is imperative that an immediate investigation is launched to uncover the reasons behind this tragedy and to hold those responsible accountable.\n\nWe cannot allow this to continue any longer. The safety and well-being of our children must be our top priority. We must demand transparency, accountability and an end to this ongoing vaccine experiment on our children.\n\nIt is time for parents, educators, and healthcare professionals to unite and take a stand against this devastating reality.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Killing Children for Profit: Europe suffers 1580% spike in Child Deaths following EMA approval of COVID Vaccine for Children | The Liberty Beacon", "description": "EuroMomo stats show that excess mortality in children rose significantly with Covid vaccine rollout; during Covid, there was negative excess mortality.", "url": "https://www.thelibertybeacon.com/killing-children-for-profit-europe-suffers-1580-spike-in-child-deaths-following-ema-approval-of-covid-vaccine-for-children/", "article:published_time": "2023-02-13T10:51:52+00:00", "article:modified_time": "2023-02-13T10:51:52+00:00"}, "tags": ["Euromomo", "The Expose", "Covid 19 vaccine children", "Excess mortality children", "Pam Barker", "Europe Reloaded", "excess deaths children"], "tweets": [], "movies": [], "links": ["https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.ema.europa.eu/en/news/first-covid-19-vaccine-approved-children-aged-12-15-eu", "https://www.ema.europa.eu/en/news/comirnaty-covid-19-vaccine-ema-recommends-approval-children-aged-5-11", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-106.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://expose-news.com/2023/02/12/killing-children-for-profit-covid-vaccine/"], "authors": [], "publish_date": "2023-02-13T10:51:52+00:00"}