{"result_id": "300018", "URL": "https://www.thelibertybeacon.com/alert-the-eu-is-preparing-a-new-massive-vaccination-campaign/", "timestamp": "2023-04-25 17:28:22 CEST+0200", "meta": {"description": "A leaked document shows a mRNA vaccine campaign for the entire European Parliament & staff which will likely be planned for everybody in the fall.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/alert-the-eu-is-preparing-a-new-massive-vaccination-campaign/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "ALERT: the EU Is Preparing a New Massive Vaccination Campaign | The Liberty Beacon", "cleaned_text": "We will use mRNA vaccines (including a component directly targeting the Omicron variant), authorized by the European Medicines Agency as a 2nd booster dose. It won’t be possible to choose the exact type of your vaccine.\n\nIn proposing this booster dose, we hope to permit our deputies and colleagues to increase their immune response at the right time, before the autumn/winter season, a period during which an elevated number of infections are expected.\n\nIn the days and weeks to comes, staff and trainees will receive a personal invitation by e-mail. The timing of the invitation will depend on the capacity of the centre and the demand. The medical team will invite each new group as soon as possible. In September, priority will be given to people 50 and above, and to people with a vulnerability to the virus. From October, all deputies and staff of the European Parliament will receive an invitation.\n\nIf you want to benefit from this opportunity, please check your e-mail inbox and make an appointment via the MCM platform as soon as you receive an invite.\n\nThe call centre for vaccinations in Brussels is at your service from now on. You can contact them by e-mail at [ ] or by telephone at 41111 for questions and to get help with setting up an appointment.\n\nWhen you come to the vaccination centre, bring your vaccination card with you if you have one. If your vaccination took place outside the European Parliament, please bring a copy of your EU Covid certificates showing the date and type of vaccine(s) as well as the country in which they were given.\n\nPlease note the new location of the vaccination centre. It is now located in the Spinelli building, where the sandwich restaurant used to be (on the floor near to where the statue of the horse used to be, at the southern most point of the corridor).", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "ALERT: the EU Is Preparing a New Massive Vaccination Campaign | The Liberty Beacon", "description": "A leaked document shows a mRNA vaccine campaign for the entire European Parliament & staff which will likely be planned for everybody in the fall.", "url": "https://www.thelibertybeacon.com/alert-the-eu-is-preparing-a-new-massive-vaccination-campaign/", "article:published_time": "2022-09-17T09:31:21+00:00", "article:modified_time": "2022-09-17T09:31:48+00:00"}, "tags": ["European Parliament Covid vaccination", "fall vaccination campaign EU", "Pam Barker", "Le Courrier de Strateges", "Europe Reloaded", "mRNA"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-09-17T09:31:21+00:00"}