{"result_id": "300034", "URL": "http://thelibertybeacon.com/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia/", "timestamp": "2023-04-25 17:28:52 CEST+0200", "meta": {"description": "A legal tussle exists between a single mom & the Malaysian govt. This is due to her statements concerning the safety of COVID vaccines for 12-17 year-olds ...", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia/", "encoding": "UTF-8"}, "image": null, "domain": "thelibertybeacon.com", "title": "The Plight of a Woman Who Questioned Vaccine Safety in Malaysia | The Liberty Beacon", "cleaned_text": "The Plight of a Woman Who Questioned Vaccine Safety in Malaysia\n\nSince 2021, a legal tussle has persisted between a single mother, Liyana Razali, and the Malaysian government. This is due to her statements concerning the safety of COVID-19 vaccines for 12-17 year-olds. The government outlawed Razali’s statement for fear that the public would develop negative perceptions of the vaccine, which could jeopardize the vaccination program. She was allegedly subjected to police harassment, media defamation, and a 30-day detention at Ulu Kinta Mental Hospital. TrialSite is following the controversial issue of vaccinating children against COVID-19, as well as the medical community’s perspective on this topic.\n\nRazali made her speech on September 28, 2021, in front of the Ministry of Higher Education. She said, “Here I would like, on behalf of today’s parents who are present at the Ministry of Higher Education Malaysia … to express our solidarity with parents.” She went on to name three families whose children were experiencing side effects following COVID-19 vaccinations, or had passed away shortly after receiving the vaccines. She also referred to three other children who had died after being vaccinated: two students at Sekolah Menengah Kebangsaan Tasik Damai in Ipoh, and one teenager in Lahad Datu, Sabah.\n\nAs well as expressing solidarity, she called on listeners to report side effects through the proper channels. “Report it to the authorities,” she said. “Do not just post them on social media. Come forward, and send your information, and we will try to fight for your rights.”\n\nPolice Intervention and Possible Misinterpretation of Razali’s Speech in Mainstream Media\n\nFive days later (October 3), Razali was called to the police station for questioning. They asked her, without having official paperwork, to appear at a magistrates court. When she was asked to appear at Ipoh Magistrates Court on November 30, 2021, they cancelled the court appointment.\n\nMeanwhile, the news of the police looking for Razali was published in mainstream media, including her photograph and home address. The reports stated that she had made “false COVID vaccine claims,” and that her allegations that students had died after receiving the vaccine were untrue.\n\nThe police returned on May 20, 2022, with an arrest warrant from Putrajaya Magistrates Court. They took Razali to court, where she refused to enter a plea for lack of a verified criminal complaint against her. The deputy public prosecutor (DPP) proposed a 30-day observation in Ulu Kinta Mental Hospital, to which the magistrate agreed.\n\nLawyers’ attempts to get Razali out were rejected. The DPP took a long time in building a case against her, and the trial began on November 22, 2022.\n\nRazali has been charged under Penal code 505 (b), which states, “Whoever makes, publishes, or circulates any statement, rumor, or report with intent to cause, or which is likely to cause, fear or alarm to the public, or to any section of the public whereby any person may be induced to commit an offense against the State or against the public tranquility.” This implies that the government is claiming that her words were intended to cause public distress, which might incite the public to rally against the state.\n\nRazali’s lawyers petitioned the DPP to apply the exception to penal code 505 (b), which reads, “It does not amount to an offense within the meaning of this section, when the person making, publishing, or circulating any such statement, rumor, or report has reasonable grounds for believing that such statement, rumor, or report is true and makes, publishes or circulates it without any such intent as aforesaid.”\n\nBased on this exception, if Razali had reasonable grounds to believe her statement was true at the time she said it, her actions were not against the law. Her representation was rejected without reason, and the case was motioned to continue.\n\nThe Appearance of Seven Witnesses in Razali’s Case\n\nAfter Razali’s speech, over a period of almost one year, the DPP arranged for a range of people to testify against her. Seven of them have since appeared in court to testify and under cross-examination they have admitted that their previous statements had been influenced rather than being their own stand.\n\nTwo Ministry of Health (MOH) workers participating in the vaccine rollout claimed that they had been ordered to write their reports. Two MOH doctors and Ipoh school’s headmaster said that they had filed reports with the police out of fear of jeopardizing the vaccination program. Fathers of the two deceased Ipoh children had been summoned and instructed to testify that their children had died before vaccination.\n\nThe witnesses helped to shed some light on Razali’s case and how the public had perceived her speech, and the failure to stand their ground for fear of the government.\n\nThe doctors who have so far testified have claimed that the COVID-19 vaccine’s side effects were not severe and included allergies, Bell’s palsy, and myocarditis.\n\nAt least one witness for the government, a medical doctor, also said that when seeking consent from parents or guardians, there was no need to spend time on obtaining fully informed consent because it was all too complex for most people to understand, so there was no point wasting time like this. These witnesses also stated, however, that once consent had been given, patients must be responsible for any negative effects.\n\nAccording to the Centers for Disease Control and Prevention (CDC), COVID-19 vaccines are safe and effective at preventing severe illness, hospitalization, or death.\n\nSeveral studies have further demonstrated the effectiveness of these vaccines. One such study is a Hong Kong population-based observational study conducted in 2022. Results from this study revealed that two doses of the CoronaVac or BNT162b2 vaccines offered protection against severe illness or death within 28 days of a positive SARS-CoV-2 test.\n\nAnother study previously reported by TrialSite on COVID-19 vaccines for teens 12-17 years old has been carried out and continues in various regions globally. Pfizer-BioNTech and Moderna mRNA vaccines are indicated by the vaccine companies to be safe and effective at preventing severe infections for this age bracket.\n\nFurthermore, in 2021, the Global Advisory Committee on Vaccine Safety (GACVS) resolved that the benefits of mRNA COVID-19 vaccines far outweighed their risks.\n\nThere is data from around the world showing safety warning signals following the COVID-19 vaccine (including severe disability and death). However, according to the World Health Organization (WHO) there are only a few cases of very rare adverse severe events, namely myocarditis and pericarditis, that have been reported so far. These conditions were mainly observed in younger men aged 16-24 years and occurred after the second dose of an mRNA COVID-19 vaccine. Generally, the conditions appeared within a few days after vaccination. The WHO indicates that these injuries were mild and responsive to conservative treatment.\n\nThe Malaysian Ministry of Health (KKM) informed the media in January 2023 that over 94% of reported vaccine reactions to Pfizer-BioNTech’s Comirnaty had been mild, but that “a small number” amounting to 1,162 serious cases of effects such as anaphylaxis, acute facial paralysis, myocarditis, and intravenous thrombosis had been recorded. This followed more than one year of claims by KKM that there had been no serious post-vaccine injuries reported in Malaysia.\n\nThese figures are similar to those reported by the CDC for teen vaccine reactions, which found 91.6% of cases were nonserious, and only 8.4% were severe. Common side effects after vaccination include headaches, muscle or joint soreness, fever, nausea, and vomiting. The injected area may redden, swell, itch, or have some pain. Most people recover quickly from the side effects, including the rare myocarditis and pericarditis cases reported after vaccination, which are claimed to be not as severe as those caused by COVID-19 infection.\n\nThese claims have been contested by world-leading cardiologists, such as Dr. Peter McCullough in the U.S. and Dr. Aseem Malhotra from the UK, who cite research showing that identified myocarditis and pericarditis from the vaccines is more severe than COVID-19-induced cardiac effects. The CDC continues to investigate the long-term effects of myocarditis after COVID-19 vaccination.\n\nIn addition, results from randomized control trial data from Pfizer, released under a court order in the U.S., demonstrated that over 1228 deaths occurred after the administration of the Pfizer vaccine. Additionally, 42,086 individuals reported 158,893 adverse events within a 3-month period.\n\nA study done in Thailand in mid-2022 showed that 3.5% of boys showed evidence of pericarditis or myocarditis after the second dose of the Pfizer-BioNTech COVID-19 vaccine.\n\nResearch from other countries, such as that done on 12th-grade South Korean students, has shown a low rate of serious adverse events and no vaccine-related deaths. Other studies that targeted Israeli adolescents 16-19 years old put the risk of myocarditis at 1.34 per 100,000 within twenty days after the first dose and 15.07 per 100,000 after the second dose. In the U.S., the rates were 12 cases per million people (12-39 years) who received the second dose of the mRNA vaccine.\n\nHowever, in March 2023, the Israeli Ministry of Health covertly released a new study showing large numbers of deaths within 60 days of receiving an mRNA COVID-19 vaccine.\n\nIn December 2021, health officials in Vietnam had to suspend the use of the Pfizer vaccine after the hospitalization of over 120 children following a group vaccination at school. Additionally, three children died from an overreaction to the vaccine in Bac Giang, a province near Hanoi, and Binh Phuoc, a province in the south.\n\nDespite the Malaysian Ministry of Health’s firm stance that the COVID-19 vaccines are perfectly safe, Razali is not the only person flagging potential adverse reactions. In the same week that Razali delivered her speech, a vaccination program in Malaysia’s Kajang prison resulted in 18 serious adverse events and two deaths in under 2,500 people. The prison director’s letter to the regulatory department and health office went viral after being leaked.\n\nThe health minister claimed that there were no deaths in Malaysia linked to the COVID-19 vaccine while confirming that 535 deaths reported as adverse events “were not directly linked to the vaccines” according to postmortem results. However, an autopsy of 40 people who died within two weeks of vaccination conducted at the University of Heidelberg in Germany showed that specific techniques and stains are required to detect the effect of the vaccine at a cellular level on postmortem. The head of the autopsy project, Peter Schirmacher, concluded that between 30 to 40% of the deaths his team examined had resulted from the vaccination, and might have been missed by regular postmortem protocols.\n\nAs with anyone accused of breaking the law, Razali deserves a fair hearing before a court of law to establish whether or not her public statements were in any way a violation of Penal code paragraph 505 (b), especially given the exception that is an integral part of that clause.\n\nAs research on COVID-19 vaccine administration to teens between 12-17 years continues, organizations urge parents or guardians to report serious cases for further assessment.\n\nClick Here to Visit the TLBTalk.com Site\n\nWelcome to the TLB Project Neighborhood", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "The Plight of a Woman Who Questioned Vaccine Safety in Malaysia | The Liberty Beacon", "description": "A legal tussle exists between a single mom & the Malaysian govt. This is due to her statements concerning the safety of COVID vaccines for 12-17 year-olds ...", "url": "https://www.thelibertybeacon.com/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia/", "article:published_time": "2023-04-11T14:28:04+00:00", "article:modified_time": "2023-04-11T14:28:04+00:00"}, "tags": ["Liyana Razali", "myocarditis", "safe and effective", "Vaccine Safety", "Malaysia", "CDC", "police harassment", "medical community", "Kajang prison", "Vaccine side-effects", "Bell’s Palsy", "mainstream media", "Ministry of Health", "12-17 year-olds", "Simay B", "Doctors’ Testimonies", "media defamation", "Vaccine deaths", "Social Media"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "380", "embed_code": "<iframe title=\"TLBTALK SOCIAL MEDIA SITE - TLBTALK.COM\" src=\"https://www.youtube.com/embed/R36LeEe4UsA\" width=\"680\" height=\"380\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/R36LeEe4UsA"}], "links": ["https://www.trialsitenews.com/a/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia-cf6c85c9", "https://www.trialsitenews.com/p/simaybayatli", "https://pixabay.com/users/quincecreative-1031690/?utm_source=link-attribution&utm_medium=referral&utm_campaign=image&utm_content=3576969", "https://pixabay.com//?utm_source=link-attribution&utm_medium=referral&utm_campaign=image&utm_content=3576969", "https://www.thelibertybeacon.com/the-inherent-deceit-of-modern-medicine/", "https://www.thelibertybeacon.com/the-inherent-deceit-of-modern-medicine/", "https://tlbtalk.com/", "https://tlbtalk.com", "https://republicbroadcasting.org/", "https://thelibertybeacon.com", "https://weirdwilbur.wordpress.com", "https://pinterest.com/pin/create/button/?description=The Plight of a Woman Who Questioned Vaccine Safety in Malaysia&media=&url=https://www.thelibertybeacon.com/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia/", "https://www.linkedin.com/shareArticle?title=The Plight of a Woman Who Questioned Vaccine Safety in Malaysia&url=https://www.thelibertybeacon.com/the-plight-of-a-woman-who-questioned-vaccine-safety-in-malaysia/"], "authors": [], "publish_date": "2023-04-11T14:28:04+00:00"}