{"result_id": "300029", "URL": "https://www.thelibertybeacon.com/the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/", "timestamp": "2023-04-25 17:28:44 CEST+0200", "meta": {"description": "The evidence against Covid vaccines, their efficacy and harms, is overwhelming to the point where they will be allowed to die.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "The COVID Vaccine Narrative Has Taken On So Much Water, The Powers That Be Have Stopped Bailing | The Liberty Beacon", "cleaned_text": "ER Editor: For a little reveal on how our governments have had to lie their way over how many have got vaccinated, see this report –\n\nUK Govt Report Admits 19.2 Million People in England Have Not Had a Single Dose of a Covid-19 Vaccine, Another 12 Million Have Refused a 2nd or 3rd Dose\n\nCOVID persists, but the COVID vaccine narrative has taken on so much water, the powers that be have stopped bailing\n\nThey are going to let these vaccines slowly sink\n\nThere has been so much bad news about the vaccines in the last few months, it even leaked into the mainstream media. I think the cabal’s plan, at least in the US but probably everywhere, is to stop propping the ludicrous vaccine claims up and allow them to die a natural death. I explain why below.\n\nThere was just too much bad news, too few getting boosted, too much resistance from parents. Getting 8 or 10 doses into everyone was not going to happen. The terrified obedient masses were becoming fewer and fewer.\n\nFor example, here is one story that got lots of traction: ABC News covered the fact that “At least 72 COVID cases in the fully vaccinated resulted from the Gridiron dinner.” Not only did Nancy Pelosi test positive, but several other members of Biden’s Cabinet and many other Washingtonian glitterati did too. All of whom had to have been vaccinated in order to attend.\n\nThere was plenty of happy talk that the afflicted politicians in DC had only mild COVID cases. Good for them. But, if vaccinations caused them to become asymptomatic spreaders instead of spreaders with symptoms, who would know to stay home while sick, the vaccines could actually be doing more harm than good in terms of transmission. They could be causing more COVID cases, not less.\n\nBy now, it has to be apparent to everyone who walks by a newsstand or turns on the TV that the media are begging much too hard for more shots.\n\nIt must be obvious to all that the shots do not prevent spread and therefore there is no logical way you can mandate them. Because if my shot does not protect you (and only with lots of fairy dust will it protect me), why would you have any interest in whether or not I am vaccinated?\n\nOnce YOU stop caring about MY vaccination status, the cabal’s nexus of control starts to fall apart. That was their ace in the hole. Time for them to move on to something else.\n\nThe kicker for childhood vaccines: the NY state Department of Health study of vaccine efficacy in children. After 2 months, efficacy in the 5-11 year olds had fallen to 12%. In other words, 7 out of 8 vaccinated kids derived no benefit after 2 months, only risk. The data were derived from 365,000 children, and apparently there was no way CDC could spin them, or 12% was the best spin they could put on the data. This report is a huge obstacle to universal child vaccinations. The cabal cannot surmount it.\n\nIt is important to mention again–because we keep forgetting–that while the vaccines are nominally licensed for adults, in fact you can only find the EUA (unlicensed) product in the US, and legally an EUA is experimental–and therefore forcing someone to be vaccinated is a Nuremberg violation and a violation of federal law.\n\nThe imposition of mandates for these experimental gene therapy products is therefore a crime, being committed by states, federal government and certain companies and other institutions. It seems that because US law was not designed for situations in which the government is the criminal, it has been very difficult to use the judicial system to change what is happening. But surely if this persisted much longer, an honest judge somewhere would finally rule that the vaccines are experimental and the COVID mandate house of cards would then collapse. Like Humpty Dumpty (it is Easter today after all):\n\nAll the king’s horses and all the king’s men\n\n Couldn’t put COVID mandates together again\n\nWhat else has been happening that undermines the vaccine story? Well, in addition to all the collapsing athletes, there is now a large collection of mayors suddenly dropping dead throughout Germany.\n\nIn Australia, Queensland’s health minister just admitted that ambulances are being summoned for a lot more calls for cardiac events and sudden deaths: 40% more to be exact. Thanks to Igor Chudov for following this story, and including a video of the clueless minister admitting it, but having no idea why…\n\nThen there were the 3 insurance companies, one each from the US, India and Germany, that admitted there were about 40% more deaths than expected in working-age people in the second half of 2021. The German official who blew the whistle, a CEO or VP, was immediately fired, which is a strong indication he was telling the truth.\n\nThree doctor whistleblowers released a large cache of data from the military’s DMED database showing huge increases in service-member deaths. There has been a lot of confusion about these data. In part, that is because the military then reissued its data for the preceding several years, making the 2021 comparison look less dire. Mathew Crawford has some ideas about what really happened to the data. The only thing that is absolutely clear so far is that there has been a coverup, and the health of vaccinated members of the military appears to have taken a dive. But we don’t know how deep.\n\nEveryone in the world must have heard the term ‘myocarditis’ by now, and knows that it is a vaccine injury. A lot of people also know that CDC Director Rochelle Walensky said post-vaccination myocarditis was extremely “rare but mild,” except it isn’t and she lied. The rate of myocarditis she cited is at least 10 times too low. About 1 in 2000 young men aged 18-24 sought care for this diagnosis after getting their second mRNA shot.\n\nIn fact, CDC was so intensely worried about blowback regarding its recommendation to vaccinate teens (despite the risk of myocarditis) it got the heads of about 20 professional medical organizations to sign on to a declaration supporting CDC’s recommendation. Wonder how much CDC paid for that. Getting such back-up was an unusual move, but perhaps unsurprising for risk-averse bureaucrats who worry about their own butt but not anyone else’s. Rochelle even mentions these “cosigners” from many medical organizations in her ABC-TV interview. Collecting a bunch of “co-signers” is actually the proof that CDC knew its vaccine recommendation was going to considerably harm children.\n\nWhile no one in a federal health agency has admitted it, many people must be aware that myocarditis is only the tip of the COVID vaccine injury iceberg. Myocarditis got attention because it’s life-threatening and almost always happens within 4 days of the second shot–it can’t be written off as coincidence, the way heart attacks, strokes, pulmonary emboli, sudden deaths and perhaps many other diagnoses have been.\n\nAs if there wasn’t enough bad vaccine news, there was information from the Medicare database that FDA posted last July, but it only recently got attention. FDA revealed that heart attacks, pulmonary emboli, disseminated intravascular coagulation (DIC, a life-threatening, bleeding plus clotting disorder) and ITP (another bleeding disorder) were related to the Pfizer vaccination in Medicare beneficiaries. FDA promised to study this rigorously, but instead remained silent, and subsequently has never denied the relationship.\n\nAnd then there is ivermectin. So many ivermectin stories have been leaking into the popular press. Tennessee’s legislature made ivermectin essentially an over-the-counter drug last week. New Hampshire’s house voted in favor of this as well, while the NH Senate is now taking it up. Kansas and several other states gave healthcare providers an immunity guarantee for the use of ivermectin and hydroxychloroquine for COVID. Kansas also strengthened religious exemptions, effectively undermining school vaccine mandates.\n\nCoupled with stories about lawsuits against hospitals for refusing to supply ivermectin to dying relatives, like this one, people are finally realizing there is probably something to this drug, and they have been cheated. They were given a shot that barely works, is unsafe, and they were stopped from getting the good drug. And what if they lost their business to the lockdowns? There must be a lot of anger simmering by now. I imagine the Great Reset cabal must be worried about this, and has decided to loosen its grip for the moment and hopefully let off some citizen steam.\n\nThere is more surprising vaccine news. While many institutions are still imposing mandates (and we need to find out what $ carrots were given to universities and other entities to impose illegal mandates of experimental vaccines) in other, surprising places the mandates are disappearing. Out west in Woke Land, the Washington state Department of Health said it would not require COVID vaccines to attend school after all. Despite Gavin Newsom’s 2021 executive order mandating vaccines for school kids as soon as they are licensed, California’s Department of Health has just done the same thing that Washington’s did: killed the COVID vaccine mandate for the 2022-23 school year.\n\nThis is why I am convinced the ship is turning. Those states’ health departments take their orders from CDC and DC. I do not think FDA is going to be issuing any more fake licenses for COVID vaccines. [I say fake because a) the vaccines do not meet licensure criteria, and b) after issuing the Moderna and Pfizer vaccines licenses for adults, neither licensed product has been distributed in the US for actual use.] The unvaxxed kids will be spared. Hallelujah!\n\nDuring the April 6, 2022 Vaccine and Related Biological Products Advisory Committee (VRBPAC) meeting, which I live-blogged and summarized, both briefers and committee members acknowledged that the neutralizing antibody titers, which have been used as a surrogate for immunity in order to issue EUAs, were in fact not valid surrogates.\n\nThis had been obvious for awhile, but a recent Israeli study in healthcare workers made it crystal clear. While neutralizing antibody titers rose tenfold after a fourth vaccination, by 2 months out the Pfizer vaccine had only 30% efficacy against infection, and the Moderna vaccine had only 11%. So the high antibody titers were, in fact, meaningless.\n\nThis is really important, because Pfizer and Moderna have been relying on titers to get their vaccines okayed for the younger age groups, those below 16 and 18 respectively. They don’t have data showing the vaccines are actually reducing cases by 50% or more, which is the standard FDA said was necessary. They don’t have data showing that the vaccines prevent serious cases or deaths, another standard.\n\nUp until now, FDA accepted titers in lieu of actual efficacy results from clinical trials to issue its EUAs for children–but with the recent VRBPAC admissions, which must have been planned in advance (otherwise why did multiple people at the meeting discuss it as settled fact when they had never mentioned it before?), FDA can no longer do so.\n\nAnother thing that happened at the VRBPAC meeting was that Peter Marks, the head of FDA’s Center for Biologics and highest FDA official there, said that if a new type of COVID vaccine is developed for the next booster, then the current vaccines would no longer be used, because it would be too confusing (according to STAT). I believe this was another effort to prepare us for the demise of the current mRNA vaccines.\n\nThe fall of the vaccines means the fall of the vaccine passports. This ought to slow down the imposition of CBDCs and all-digital money for a bit. If we don’t have to show our vaccine certificate to go shop, eat, etc., (and people stop being fearful of catching something from each Other) people will be a lot less inclined to “show their papers” to go about their lives. It’s our job to explain over and over that this was how the Nazis maintained control.\n\nIf there is a new vaccine waiting in the wings, FDA and its briefers were not telling us about it at the VRBPAC meeting, which was the time to do so. For right now, I think the current crop of vaccines and the vaccine passports are going away. I don’t think the authorities anticipate another severe COVID wave in the foreseeable future… as most people now have Omicron immunity. The COVID fear will dissipate.\n\nThe original Wuhan strain appeared out of nowhere. No natural progenitor could be found. And the original Omicron strain appears to have also originated in a lab. If I was a member of the Great Reset cabal, I would be quite hesitant about releasing yet a third lab-engineered virus on the population. Because millions of people will be looking for one, and it won’t take long before its laboratory provenance is discovered. Then the pitchforks might really come out.\n\nOn the other hand, I do believe the cabal has bet the farm on their Reset, they can’t go back, and they are simply moving on to another means of accomplishing it besides COVID. The over-the-top WHO Treaty/Constitution and its amendments designed to assume sovereignty over the world in the event of a pandemic is an ambitious Plan B.\n\nBut I don’t think it will fly. Too many people know the WHO was wrong about virtually everything regarding management of this pandemic, not to mention the 2009 swine flu. And then there was that little matter of WHO undertaking the SOLIDARITY Trial, in which WHO officials deliberately poisoned over 1,000 COVID patients with excessive doses of hydroxychloroquine and in many cases failed to obtain signed informed consents. The WHO could be liable for manslaughter.\n\nWill Russia and China really agree to give up their sovereignty to Tedros? China, maybe. Brazil? India? Indonesia? Japan? Nigeria? Can all of their leaders, and their local power centers, have been sufficiently corrupted to turn over their nations to the cabal? I think that could be a stretch.\n\nI suspect the cabal will try their best to get a legal OK to take over the world with the upcoming WHO pandemic treaty, but it won’t fly. Too many people already know about these plans.\n\nAfter the WHO, the cabal will move on to something else, Plan C. Climate catastrophe? Aliens? I’m guessing it will be a few years before we get hit with another nasty bug. By then maybe the fiat currencies will have finally crashed, and the cabal won’t have as tight control of the reins. By then, Fauci, Walensky, Biden, Macron, Johnson, Trudeau, Draghi will hopefully be unpleasant memories.\n\nI am not thinking we will all sing kumbaya. I expect a good deal of misery as the cabal pushes all the levers at its disposal.\n\nThe Shanghai city and port closure (China’s largest city and the world’s largest port) seems to me a deliberate attempt to interfere with worldwide transit of goods and to reduce food availability. The Chinese know how to treat COVID. They make the drugs and herbs. There is no need for them to lock down.\n\nWe are finally understanding that all these awful government policies were deliberate — intended to cement control over and impoverish us. But maybe we can start to build something a whole lot better.\n\nWe are shaking loose of the educational indoctrination system, the ruination of our foods, the user-unfriendly and health-damaging healthcare system. We are starting to grasp that our governments acted with malice aforethought to stupefy and eventually enslave us.\n\nPeople are breaking free and taking responsibility for their future. Where I live, people are learning self-sufficiency skills, creating home-schooling coops, building greenhouses and growing food. The migration to the countryside was deliberate.\n\nA better life? It just takes everybody waking up. Despite all the acrimony we have faced, the time is ripe to help our fellows see things clearly. We have to love them, help them, meet them where they are at. Maybe it is just to talk about the Gridiron dinner. Or ivermectin. They won’t get it in a day. But keep trying. It is our only solution.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "The COVID Vaccine Narrative Has Taken On So Much Water, The Powers That Be Have Stopped Bailing | The Liberty Beacon", "description": "The evidence against Covid vaccines, their efficacy and harms, is overwhelming to the point where they will be allowed to die.", "url": "https://www.thelibertybeacon.com/the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/", "article:published_time": "2022-04-19T09:11:37+00:00", "article:modified_time": "2022-04-19T09:11:37+00:00"}, "tags": ["neutralizing antibody titers", "US states health departments", "FDA", "fall of the vaccines", "DR. MERYL NASS", "myocarditis", "COVID Vaccine mandates", "Vaccine passes", "Pam Barker", "Ivermectin", "Europe Reloaded", "Covid vaccine narrative", "the government is the criminal", "CDC"], "tweets": [], "movies": [], "links": ["https://www.europereloaded.com/uk-govt-report-admits-19-2-million-people-in-england-have-not-had-a-single-dose-of-a-covid-19-vaccine-another-12-million-have-refused-a-2nd-or-3rd-dose/", "https://abcnews.go.com/Health/coronavirus/", "https://www.nytimes.com/2022/02/28/health/pfizer-vaccine-kids.html", "https://anthraxvaccine.blogspot.com/2022/04/update-jaw-dropping-769-athletes-have.html", "https://rairfoundation.com/epidemic-german-and-austrian-mayors-under-60-aresuddenly-and-unexpectedly-dropping-dead/", "https://igorchudov.substack.com/p/health-authorities-are-the-biggest?s=r", "https://highlandcountypress.com/Content/Opinions/Opinion/Article/Life-insurance-CEO-claims-deaths-are-up-40-among-people-ages-18-64/4/22/75780", "https://www.ronjohnson.senate.gov/2022/2/sen-johnson-to-secretary-austin-has-dod-seen-an-increase-in-medical-diagnoses-among-military-personnel", "https://www.campfire.wiki/doku.php?id=rounding_the_earth:the_dmed_saga", "https://abcnews.go.com/GMA/News/video/cdc-director-weighs-risk-myocarditis-covid-19-vaccine-78460627", "https://www.medrxiv.org/content/10.1101/2021.12.21.21268209v1", "https://www.hhs.gov/about/news/2021/06/23/statement-following-cdc-acip-meeting-nations-leading-doctors-nurses-public-health-leaders-benefits-vaccination.html", "https://www.hhs.gov/about/news/2021/06/23/statement-following-cdc-acip-meeting-nations-leading-doctors-nurses-public-health-leaders-benefits-vaccination.html", "https://abcnews.go.com/GMA/News/video/cdc-director-weighs-risk-myocarditis-covid-19-vaccine-78460627", "https://www.fda.gov/vaccines-blood-biologics/safety-availability-biologics/initial-results-near-real-time-safety-monitoring-covid-19-vaccines-persons-aged-65-years-and-older", "https://www.newschannel5.com/news/dont-run-to-the-farm-store-tennessee-lawmakers-approve-ivermectin-availability", "https://www.kcur.org/politics-elections-and-government/2022-03-24/kansas-senate-passes-bill-boosting-access-to-ivermectin-and-weakening-school-vaccine-rules", "https://www.theepochtimes.com/florida-hospital-stops-ivermectin-without-telling-family-fires-nurse-for-advocating-for-it_4396469.html", "https://www.kiro7.com/news/local/board-health-opts-against-new-school-vaccine-requirement/XX5X46HSQJDWZL7MVYR3MDGU2I/", "https://abcnews.go.com/US/california-delay-covid-19-vaccine-mandate-students/story?id=84093350", "https://anthraxvaccine.blogspot.com/2022/04/right-now-i-am-live-blogging-fda.html", "https://www.medrxiv.org/content/10.1101/2022.02.15.22270948v1.full.pdf", "https://www.statnews.com/2022/04/06/tracking-fda-advisory-panel-meeting-covid-19-vaccines-boosters/", "https://www.who.int/news/item/30-03-2021-global-leaders-unite-in-urgent-call-for-international-pandemic-treaty", "https://merylnass.substack.com/p/who-and-uk-trials-used-potentially", "https://alethonews.com/2022/04/17/covid-persists-but-the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/", "http://www.europereloaded.com/", "http://www.europereloaded.com/", "https://pinterest.com/pin/create/button/?description=The COVID Vaccine Narrative Has Taken On So Much Water, The Powers That Be Have Stopped Bailing&media=&url=https://www.thelibertybeacon.com/the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/", "https://www.linkedin.com/shareArticle?title=The COVID Vaccine Narrative Has Taken On So Much Water, The Powers That Be Have Stopped Bailing&url=https://www.thelibertybeacon.com/the-covid-vaccine-narrative-has-taken-on-so-much-water-the-powers-that-be-have-stopped-bailing/"], "authors": [], "publish_date": "2022-04-19T09:11:37+00:00"}