{"result_id": "300009", "URL": "https://www.thelibertybeacon.com/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/", "timestamp": "2023-04-25 17:28:06 CEST+0200", "meta": {"description": "The COVID vaccines are not a one-off. Rather, they share most of the same problems as the vaccines that came before them ...", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Should Amnesty Be Granted to Those Who Were A-OK with the ‘Other Vaccines’ Being Mandated? | The Liberty Beacon", "cleaned_text": "Should Amnesty Be Granted to Those Who Were A-OK with the ‘Other Vaccines’ Being Mandated?\n\n“That” article (Let’s Declare a Pandemic Amnesty) about amnesty—the one so many found infuriating—fired me up too, but for a different reason than most. The hypocrisy of the mass, indignant reaction to it was almost too much for me to bear.\n\nA contingent has formed of the newly outraged—those who held blind faith in the “safe, necessary and effective” slogan without ever having done any research on vaccines, who are now reeling because they just learned some actual facts about one. However, most of the newly outraged have only advanced slightly in their thinking, to now believing there is one highly flawed vaccine being pushed on the public. And they’re outraged that any of those who once favored it being mandated would now seek forgiveness on the grounds of lack of information. They point to ample information available throughout the BS-demic which made it obvious that the “official” story about COVID-19, and about COVID-19 jabs, was mostly bunk.\n\nWell—pot, kettle, black. Pre-COVID-19, many of the newly outraged supported childhood vaccine mandates or, at the very least, sat idly by without voicing any opposition to them, despite information being available of serious problems with the childhood vaccines.\n\nThe truth is, at various times nearly all of us failed to do our due diligence before forming opinions about vaccines, including this author many years ago. Almost all of us could use redemption on that front.\n\nOne taking the time to look will find that COVID-19 vaccines are not a one-off. Rather, they share most of the same problems as the vaccines that came before them. Below, is a stroll through just some of the information which demonstrates this, most of which has been there all along and overlooked by the newly outraged.\n\n1. The safety testing of the childhood vaccines has also been reckless.\n\nThe recent addition of COVID-19 vaccines to the CDC’s childhood schedule increased the schedule from 54 injections (72 antigens) to 72 injections (90 antigens). It’s pure mythology that the vaccines on the schedule prior to this recent addition underwent rigorous safety testing.\n\nIn fact, in one regard, the childhood vaccines were tested even less rigorously than COVID-19 vaccines because the latter were tested against true placebo control groups. Of course, COVID-19 vaccines were only tested in this manner because the vaccine manufacturers were made to do so by the FDA. This occurred on the heels of Del Bigtree’s Informed Consent Action Network (ICAN) filing a petition with the FDA in June of 2020 demanding true placebo testing of COVID-19 vaccines.\n\nICAN knew to demand this because it had been studying up on the childhood vaccines. Most of them never underwent testing using a control group administered a non-inert substance. Even worse, other vaccines were sometimes used as the substance administered to the control group. A fifth grader could recognize this for the junk science it is. This is tantamount to assessing the safety of a diet of Sour Cream and Onion chips by using a control group fed a diet of BBQ chips.\n\nICAN publicly posted its December 31, 2018 letter to HHS which contains extensive discussion of the use of non-inert placebos in clinical trials for vaccines used in children, along with tables identifying for each vaccine the non-inert substances given to controls groups. As the letter discusses, only one out of the approximately 30 vaccine brands then routinely injected into US children was licensed based on a clinical trial which had a true placebo control group. This discussion is set forth on pages 3 through 17 of the letter.\n\nFor example, a clinical trial conducted for Merck’s Gardasil 9 vaccine used the original Gardasil vaccine as the “placebo” in the control group, and both vaccines contain an aluminum adjuvant.\n\nAluminum is increasingly being recognized as a potentially dangerous vaccine ingredient. Research indicates that it plays a role in causing Alzheimer’s disease, asthma, autism, and other conditions. A significant amount of aluminum is delivered to children via vaccines. In addition to HPV vaccines, these vaccines on the CDC’s childhood schedule contain aluminum: Hep B vaccine, DTaP vaccine, Hib vaccine, Pneumococcal vaccine, Hep A vaccine, DTaP/inactivated polio/Hep B vaccine, DTaP/inactivated polio/Hib vaccine, Meningococcal B vaccine, and Tdap vaccine.\n\nDr. Christopher Exley is a world-renowned expert on aluminum and its effects. His research found high aluminum content in the brain tissues of those with autism and, to a lesser extent, those with Alzheimer’s. These findings and their implications for aluminum-containing vaccines have earned him exile to the land of the censored and smeared. But, like many of those relegated to that land, he refuses to shut up. His Substack newsletter is an excellent resource for those wanting to learn about the health effects of aluminum.\n\nLack of true placebo testing is just one of the deficiencies in the safety testing of the childhood vaccines. Contrary to popular belief, most of them did not undergo lengthy periods of pre-approval testing for adverse reactions. ICAN’s December 31, 2018 letter contains in-depth discussion of the shockingly short periods of such testing. This discussion is set forth on pages 17 through 23 of the letter. Parents unwilling to read all six of these pages may want to, at the very least, glance at the table on pages 19 and 20. It lists eleven of the childhood vaccines and their corresponding diseases, along with the short “duration of safety review after injection” for each. The table is a stunner, to put it mildly.\n\nFor example, of the two hepatitis B vaccines licensed by the FDA for injection into newborns, Merck’s was licensed based upon clinical trials which reviewed for adverse reactions for only five days after injection and GlaxoSmithKline’s was licensed based upon such trials which reviewed for them for only four days after it. As other examples, Merck’s Hib vaccine and Sanofi Pasteur’s polio vaccine were each licensed based upon clinical trials which reviewed for adverse reactions for only three days post injection.\n\nA common complaint by the newly outraged is that there’s been inadequate post-vaccination monitoring in the populace for adverse reactions to COVID-19 vaccines. Because of COVID-19 vaccines, the newly outraged have finally learned of the existence of the Vaccine Adverse Event Reporting system (VAERS). VAERS is operated by HHS. HHS funded a 2011 study by Harvard Medical School which tracked reporting to VAERS over a three-year period at Harvard Pilgrim Health Care and concluded that “fewer than 1% of vaccine adverse events are reported.” Despite receiving this study result, HHS did nothing to cure VAERS’ ineffectiveness and let it continue humming along, failing to capture most vaccine adverse reactions.\n\nIt should be dawning on the newly outraged that the same lousy system that hasn’t captured most COVID-19 vaccine adverse reactions also hasn’t captured most adverse reactions to the childhood vaccines. The “one in a million” myth was never anchored to any facts, or any reliable system for recording adverse reactions. It was made-up—pulled out of a Pharma shill’s derrière and repeated ad nauseum throughout the decades.\n\nIt’s impossible to comprehensively cover the inadequacies in the safety testing of the childhood vaccines in one article. For the sake of brevity and because I’ve provided a link to ICAN’s December 31, 2018 letter which covers more of that ground, I’ll move on.\n\n2. There’s been no showing of necessity for the childhood vaccines.\n\nThe newly outraged are irate that COVID-19 vaccines were added to the childhood schedule despite an obvious lack of necessity for children’s health. According to the schedule, COVID-19 vaccines are to be given to babies beginning at 6 months of age. What could be worse than giving a child a vaccine it doesn’t need with potential adverse effects at 6 months of age? Giving a child such a vaccine at birth is worse, like is done with the hepatitis B vaccine.\n\nThe CDC recommends a hepatitis B vaccine at birth, 1-2 months of age, and 6-18 months of age and nearly all states mandate the vaccine for school attendance. These are clearly unnecessary vaccinations.\n\nHepatitis B is not spread through casual contact. It’s spread when blood, semen, or other body fluids from a person infected with the virus enters the body of someone who is not infected and this can happen through sexual contact; sharing needles, syringes, or other drug-injection equipment; or from mother to baby at birth. Therefore, newborns are generally at no risk of getting hepatitis B unless their mothers harbor the virus, which can be determined through routine prenatal blood testing. Further, hepatitis B vaccines given to newborns are expected to wear off before the age of any likely exposure to the hepatitis B virus.\n\nIt’s also impossible to comprehensively cover the issue of the lack of necessity for the childhood vaccines in one article There’s far too much to review. This lack of necessity discussion began with the first vaccine children receive according to the CDC’s schedule, but one could throw a dart at the schedule and land on a vaccine with plenty of facts to work with to show lack of necessity. Below are examples of articles and videos touching upon the lack of necessity issue with respect to a few more of the childhood vaccines: chickenpox, DTaP and HPV.\n•An October 4, 2019 article posted by Children’s Health Defense entitled “Chickenpox: The Dirty Dozen Facts You Should Know Before Vaccinating” contains information demonstrating the lack of necessity for children to be vaccinated for chickenpox, including discussion of the low risk posed by the disease. The article also discusses problems associated with mass vaccination for chickenpox, such as an increase in the rate of shingles infections. Nearly all states mandate the chickenpox vaccine for schoolchildren.\n•A February 2, 2023 segment of The HighWire (HW) (Episode 305) discusses research which indicates that being vaccinated for pertussis (with the DTaP vaccine) makes children more susceptible to pertussis throughout their lifetimes, not less, which certainly refutes any argument that it’s necessary for children’s health to be vaccinated for the disease. The segment also discusses research which indicates that being vaccinated for pertussis unknowingly makes one an infected, asymptomatic carrier of the disease. All states mandate the DTaP vaccine upon schoolchildren.\n•A March 9, 2023 interview of attorney Michael Baum by Del Bigtree (HW Episode 310) discusses information which clearly establishes a lack of necessity for children to receive the HPV vaccine (i.e., clinical trials never tested for whether vaccination actually prevents cervical cancer, there’s been no showing that cervical cancer rates have dropped as a result of HPV vaccination, most HPV infections clear from the body naturally, cervical cancer is largely treatable if caught early and is effectively detected through yearly pap smears, the vaccines only create antibodies to a small number of the HPV strains that exist, and use of the vaccines create a strain replacement issue). As an aside, the proposed California legislation (CA AB 659) discussed in HW Episode 310 has been amended since the episode, to shift the proposed HPV vaccine mandate from eighth graders to college students. The amendments to the bill are discussed in HW Episode 312. Four jurisdictions already mandate the HPV vaccine for schoolchildren.\n\nLack of necessity is not just a problem with respect to the individual vaccines on the childhood schedule, but also with respect to the entire schedule. The CDC has never conducted a study comparing the health of children vaccinated in accordance with the schedule with that of unvaccinated children. Unfortunately for the CDC, others have done so. Below are a couple of examples of what’s been found.\n•A study published in April of 2017 comparing 650 vaccinated and unvaccinated homeschooled children in the US found that, compared to completely-unvaccinated children, fully-vaccinated children had increased risks for allergies, ADHD, autism, eczema, learning disabilities, and neuro-developmental delay. Additionally, fully vaccinated-pre-term infants were found to have an increased risk for neurodevelopmental disorders compared to completely unvaccinated preterm infants.\n•A study published in November of 2020 concerning a retrospective analysis of the health records of approximately 3,300 children covering a period of about ten years compared the health outcomes of the children (unvaccinated v. vaccinated to varying extents) and found that the unvaccinated children were significantly healthier. The vaccinated children were diagnosed with a broad range of conditions at much higher rates than their unvaccinated counterparts and saw a doctor markedly more often than the unvaccinated children. Jeremy R. Hammond has discussed the study in depth in his June 14, 2021 article posted on CHD and in his book, The War on Informed Consent: The Persecution of Dr. Paul Thomas by the Oregon Medical Board. Pay no mind to the fact that the study was retracted after publication. A follow up study was conducted which demonstrated that the purported basis for the retraction was unfounded. Even the newly outraged have come to understand that retraction is being used as a tool to unfairly delegitimize those putting forth findings that conflict with Big Pharma’s narrative.\n\nIn 2023, evidence which refutes the notion that vaccination makes children healthier keeps rolling in. A 2023 study using 2019 data found a positive statistical correlation between infant mortality rates and the number of vaccine doses received by the infants. The study confirmed findings made by the same researchers about a decade ago using 2009 data.\n\nLet’s circle back to the amnesty issue. There’s a meme circulating these days stating, “They think you’re stupid.” Anyone who believes that governments and Big Pharma just started lying about vaccines when COVID-19 came along is, at the very least, woefully naïve. At this point, after the 24/7, multi-year, orchestrated lying about COVID-19 vaccines, it’s inexcusable to keep getting one’s child injected with products one hasn’t thoroughly researched, meaning with resources that aren’t Big Pharma funded or influenced. It’s even more inexcusable to support the mandating of any of the childhood vaccines, or to meekly accept such mandates through silence. No amnesty is warranted for doing so moving forward.\n\nClick Here to Visit the TLBTalk.com Site\n\nWelcome to the TLB Project Neighborhood", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Should Amnesty Be Granted to Those Who Were A-OK with the ‘Other Vaccines’ Being Mandated? | The Liberty Beacon", "description": "The COVID vaccines are not a one-off. Rather, they share most of the same problems as the vaccines that came before them ...", "url": "https://www.thelibertybeacon.com/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/", "article:published_time": "2023-04-02T12:47:53+00:00", "article:modified_time": "2023-04-02T12:47:53+00:00"}, "tags": ["informed consent", "ICAN", "pandemic amnesty", "childhood vaccine schedule", "CDC", "Aluminum", "VAERS", "No amnesty", "Gardasil vaccine", "Children’s Health Defense", "Davis Taylor", "unvaccinated children healthier", "Alzheimer’s Disease", "flawed vaccine", "big pharma", "vaccine mandates", "Vaccine safety testing", "HPV vaccine", "Vaccine Adverse Events", "autism", "Infant Mortality", "Dr. Christopher Exley", "Covid-19 jabs"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "380", "embed_code": "<iframe title=\"TLBTALK SOCIAL MEDIA SITE - TLBTALK.COM\" src=\"https://www.youtube.com/embed/R36LeEe4UsA\" width=\"680\" height=\"380\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/R36LeEe4UsA"}], "links": ["https://www.theatlantic.com/ideas/archive/2022/10/covid-response-forgiveness/671879/", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://tobyrogers.substack.com/p/the-iatrogenocide-accelerates", "https://icandecide.org/article/fda-requires-placebo-control-following-ican-demand/", "https://icandecide.org/", "https://www.regulations.gov/document/FDA-2020-P-1601-0001", "https://icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://www.fda.gov/media/90064/download", "https://childrenshealthdefense.org/defender/aluminum-infant-vaccines/", "https://childrenshealthdefense.org/defender/aluminum-exposure-brain-alzheimers-disease-cola/", "https://childrenshealthdefense.org/defender/aluminum-childhood-vaccines-asthma-cola/", "https://icandecide.org/article/how-aluminum-adjuvants-in-vaccines-can-cause-autism/", "https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.sciencedirect.com/science/article/pii/S0946672X17308763", "https://www.sciencedirect.com/science/article/pii/S0946672X16303777", "https://drchristopherexley.substack.com/p/a-sobering-anniversary", "https://drchristopherexley.substack.com/about", "https://icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://www.fda.gov/media/74274/download", "https://www.fda.gov/media/119403/download", "https://www.fda.gov/media/80438/download", "https://www.fda.gov/media/75695/download", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://icandecide.org/wp-content/uploads/2019/09/ICAN-Reply-1.pdf", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://stevekirsch.substack.com/p/scientists-from-harvard-and-johns", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://childrenshealthdefense.org/defender/hepatitis-b-vaccine-newborns-safety-data-cola/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://www.immunize.org/laws/hepb.asp", "https://childrenshealthdefense.org/news/the-flawed-logic-of-hepatitis-b-vaccine-mandates/", "https://www.cdc.gov/hepatitis/hbv/index.htm", "https://www.cdc.gov/mmwr/preview/mmwrhtml/rr5516a1.htm", "https://childrenshealthdefense.org/news/chickenpox-the-dirty-dozen-facts-you-should-know-before-vaccinating/", "https://www.immunize.org/laws/varicella.asp", "https://thehighwire.com/ark-videos/dels-debut-with-dr-drew/", "https://pubmed.ncbi.nlm.nih.gov/30793754/", "https://pubmed.ncbi.nlm.nih.gov/31333640/", "https://www.immunize.org/laws/dtap.asp", "https://thehighwire.com/ark-videos/new-ca-bill-seeks-to-mandate-dangerous-hpv/", "https://www.wisnerbaum.com/prescription-drugs/gardasil-lawsuit/", "https://www.globenewswire.com/news-release/2023/03/02/2619644/0/en/Parents-Up-in-Arms-Over-California-Assembly-Bill-That-Would-Require-all-8th-through-12th-Grade-Teens-to-Receive-Gardasil-Vaccine.html", "https://legiscan.com/CA/text/AB659/id/2707933", "https://thehighwire.com/ark-videos/update-ca-hpv-vaccine-mandate-for-schools/", "https://www.immunize.org/laws/hpv.asp", "https://www.oatext.com/pdf/JTS-3-186.pdf", "https://www.oatext.com/pdf/JTS-3-187.pdf", "https://www.mdpi.com/1660-4601/17/22/8674", "https://childrenshealthdefense.org/defender/state-medical-board-shut-down-dr-paul-thomas-pediatrician/", "https://www.jeremyrhammond.com/product/the-war-on-informed-consent/", "https://ijvtpr.com/index.php/IJVTPR/article/view/59", "https://childrenshealthdefense.org/defender/study-unvaccinated-healthier-vaccinated-kids/", "https://www.cureus.com/articles/134233-reaffirming-a-positive-correlation-between-number-of-vaccine-doses-and-infant-mortality-rates-a-response-to-critics#!/", "https://childrenshealthdefense.org/defender/infant-mortality-vaccine-doses/", "http://ronpaulinstitute.org/archives/featured-articles/2023/april/01/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/", "http://ronpaulinstitute.org/", "http://ronpaulinstitute.org/archives/featured-articles/?author=Davis+Taylor", "http://ronpaulinstitute.org/", "https://www.thelibertybeacon.com/the-inherent-deceit-of-modern-medicine/", "https://www.thelibertybeacon.com/the-inherent-deceit-of-modern-medicine/", "https://tlbtalk.com/", "https://tlbtalk.com", "https://republicbroadcasting.org/", "https://thelibertybeacon.com", "https://weirdwilbur.wordpress.com", "https://pinterest.com/pin/create/button/?description=Should Amnesty Be Granted to Those Who Were A-OK with the ‘Other Vaccines’ Being Mandated?&media=&url=https://www.thelibertybeacon.com/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/", "https://www.linkedin.com/shareArticle?title=Should Amnesty Be Granted to Those Who Were A-OK with the ‘Other Vaccines’ Being Mandated?&url=https://www.thelibertybeacon.com/should-amnesty-be-granted-to-those-who-were-a-ok-with-the-other-vaccines-being-mandated/"], "authors": [], "publish_date": "2023-04-02T12:47:53+00:00"}