{"result_id": "300010", "URL": "https://www.thelibertybeacon.com/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/", "timestamp": "2023-04-25 17:28:08 CEST+0200", "meta": {"description": "An Israeli study shows that sperm concentration and motility are negatively, significantly impacted up to 6 months after taking the Pfizer vaccine.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Pfizer Vaccine Effects on Total Motile Count in Sperm Donors | The Liberty Beacon", "cleaned_text": "ER Editor: The total motile count is the number of moving sperm per ejaculation.\n\nReaders may also be interested in this LifeSite News piece, titled Male fertility drops ‘significantly’ in months following Pfizer’s COVID jab: study.\n\nOne of the great early misapprehensions about mRNA vaccines is that they would not have widespread, systematic effects, instead remaining relatively localized. This was rapidly debunked and early studies showed widespread penetration of organs with a particular and perhaps unfortunate preference for concentration in ovaries and testes. (This was discovered early in japan, then denied vehemently by armies of “fact checkers” only to wind up proven in pfizer’s own documents gained through FOIA and lawsuit.)\n\nThese mRNA drugs are broadly systemic and concentrate in (amongst others) reproductive organs and effects on menstrual cycles are widely documented.\n\nIn light of this quite worrying fact (especially with a compound carrying high CG enrichment relative to high virus and the attendant risks thereof), it has been surprising to me that there have not been more studies on this topic.\n\nBut a few are starting to emerge. This Israeli study was published 2 days ago:\n\nBnd the results are, well, nuts. (sorry)\n\nThere was strong a priori reason to suspect effects, especially in light of the higher and more persistent prevalence of vaccine induced S proteins vs natural infection and the CG enrichment issued mentioned above.\n\nThe study was performed and followed up according to the following timeline around vaccination.\n\nAnd from this, substantial effects on sperm concentration and overall motile count were discovered.\n\nThe authors draw a set of conclusions from this:\n\nAnd from this state:\n\nBut I am left wondering about these claims and fear they may provide an example of the sort of “nerf or refute your own findings in the abstract so that we can publish this without massive controversy” behavior that has become all too common in medical and scientific journals who withhold peer review from those whose findings look too worrying if stated plainly. (But that will often let such data out if buried deep in supplements and appendixes)\n\nThis is why you should always read these data repositories. Because they often tell quite a different tale than the abstract.\n\nHere’s table two from this same study. Notice anything?\n\nI’m struggling to see how one could call this “recovery.”\n\nPost day 150, sperm concentration was -15.9% vs baseline, lower even than in the 75-120 day period. average time post vaxx for T3 collection was 174 +/- 26.8 days so we’re talking about 6 months post vaxx with NO recovery in sperm concentration.\n\nTotal motile count was slightly recovered from T2, but was still down 19.4% vs baseline, seeming to make up somewhat in volume what is lost in concentration.\n\nBoth results were statistically significant at a 95% confidence interval.\n\nThere is a greater than 97% chance that the TMC figure is real and not random.\n\nThose are not odds you want to buck.\n\nThis raises some serious concerns for a number of reasons:\n• Obviously, this is a significant and unforeseen impact not only missed in the rush-job drug trials, but that the drug makers assured us was basically impossible and spent the better part of a year vehemently denying.\n• This effect looks durable to at least 6 months and from this data, we really do not know when or even if (or to what extent) it will attenuate.\n• The role of boosters here is not known, but there is every reason to expect they will have similar effects and either extend or possibly worsen this effect. That seems like a study that should be being performed immediately.\n• Even if this condition does moderate and TMC return to prior levels over time, that timescale looks quite long. It’s certainly more than 6 months. This would seem to imply low motile counts could be near constant in a regimen of annual or bi-annual boosters.\n\nWhen you rush vaccines to market, especially vaccines using an entirely new and poorly understood modality that has never before been approved or even used in humans, you’re going to get all manner of nasty surprises and this looks to be yet another.\n\nAnd clearly, it was missed. This was not even mentioned as a possibility in any FDA proceedings of which I am aware.\n\nAnd THAT is why vaccine development generally takes place over 5-10 years, not 5-7 months.\n\nBest I can tell, we cannot even yet rule out that these effects are permanent.\n\nAnd, of course, we have zero idea what they might do to pre-adolescents and possible impacts on their healthy sexual development and ultimate fertility.\n\nAnd yet the US is bucking the trend in most of Europe and approving this drugs for not just the young and healthy but for kids from 6mo-5 yr. This feels reckless.\n\nAe have little idea what this may be doing to ovaries and eggs either as these are much more difficult and invasive to study (and will likely need to be assessed by autopsy). This is another analysis that desperately needs to take place because unlike sperm, eggs do not replenish, so if you damage them, that’s that.\n\nAdd to this effects on normal development and it could take decades to see what happened.\n\nPeople have historically trusted vaccines because they underwent serious, long term testing before being pushed wide. Assessment was measured in decades, not months and even a tiny number of adverse events would pull them off the market.\n\nTo trade upon that trust while abandoning all the safeguards that enabled it is bad science and worse public health policy.\n\nHow many more examples of unforeseen outcomes must we endure before this simple truth is accepted?\n\n… additional take on the israeli sperm count data\n\nPublished to The Liberty Beacon from EuropeReloaded.com\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Pfizer Vaccine Effects on Total Motile Count in Sperm Donors | The Liberty Beacon", "description": "An Israeli study shows that sperm concentration and motility are negatively, significantly impacted up to 6 months after taking the Pfizer vaccine.", "url": "https://www.thelibertybeacon.com/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/", "article:published_time": "2022-06-21T07:52:14+00:00", "article:modified_time": "2022-06-21T08:30:07+00:00"}, "tags": ["Covid vaccine impacts sperm", "Pfizer vaccine sperm count", "Andrology journal", "Pfizer vaccine male fertility", "Covid vaccine impairs semen", "Pam Barker", "el gato malo", "Europe Reloaded"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/male-fertility-drops-significantly-in-months-following-pfizers-covid-jab-study/", "https://boriquagato.substack.com/p/pfizer-vaccine-effects-on-total-motile", "https://www.westernstandard.news/business/pfizer-s-own-study-finds-nanoparticles-in-covid-vaccines-enter-organs/article_5b3955f6-d146-11ec-a272-cf3264db392b.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share", "https://boriquagato.substack.com/p/cg-enrichment-in-covid-vaccine-mrna", "https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://i0.wp.com/substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd6b3e4aa-4f83-4070-a6e2-eb284a8b1aa1_1548x947.jpeg?ssl=1", "https://i0.wp.com/substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fb47ab45e-c494-4e07-a81d-57324c830e72_2159x1111.png?ssl=1", "https://i0.wp.com/substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1a4c9e4e-2a00-4447-b728-e7cbbba591f1_1456x1178.png?ssl=1", "https://boriquagato.substack.com/p/additional-take-on-the-israeli-sperm", "https://alethonews.com/2022/06/19/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/", "http://www.europereloaded.com/", "http://www.europereloaded.com/", "https://pinterest.com/pin/create/button/?description=Pfizer Vaccine Effects on Total Motile Count in Sperm Donors&media=&url=https://www.thelibertybeacon.com/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/", "https://www.linkedin.com/shareArticle?title=Pfizer Vaccine Effects on Total Motile Count in Sperm Donors&url=https://www.thelibertybeacon.com/pfizer-vaccine-effects-on-total-motile-count-in-sperm-donors/"], "authors": [], "publish_date": "2022-06-21T07:52:14+00:00"}