{"result_id": "300038", "URL": "https://www.thelibertybeacon.com/conflicts-of-interest-pfizers-secret-collusion-with-the-nih/", "timestamp": "2023-04-25 17:29:03 CEST+0200", "meta": {"description": "Stop and consider that ... As the largest federal grant-maker, the NIH has a monopoly on what research gets done and what doesn’t ...", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/conflicts-of-interest-pfizers-secret-collusion-with-the-nih/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Conflicts of Interest: Pfizer’s Secret Collusion With the NIH | The Liberty Beacon", "cleaned_text": "\n• Under the 1984 Bayh-Dole Act, government scientists can collect royalties from drug companies for discoveries they make while working on the public’s dime\n• Taxpayers fund government research, while Big Pharma, the National Institutes of Health and NIH scientists keep all the profits\n• As a patent holder who profits from royalties, the NIH has a significant stake in regulations that impact patents and vaccine mandates, and may use its influence to benefit itself rather than the public\n• The NIH distributes $32 billion of taxpayer funds as research grants each year. As the largest federal grant-maker, the NIH has a monopoly on what research gets done and what doesn’t\n• Scientists vying for grants also recognize that in order to get funding, they have to play by the rules, and that means doing work that supports establishment narratives on public health policy\n\nConflicts of Interest: Pfizer’s Secret Collusion With the NIH\n\nIn late February 2023, Moderna agreed to pay $400 million to the National Institute of Allergy and Infectious Diseases (NIAID) for the patent it holds on Moderna’s mRNA shot.1\n\nThe patent process is a part of the COVID mRNA shots that the media haven’t really addressed and people in general don’t know anything about — probably because it’s a total racket. Based on internal documents and correspondence, it appears the NIAID funded the creation of SARS-CoV-2. At the same time, it patented and receives royalty payments for the “vaccine” against said virus.\n\nThe National Institutes of Health (NIH) is supposed to be the primary government agency responsible for public health research, but by the looks of it, it appears instead to be in the business of creating public health threats in order to profit from them.\n\nAnd the agency itself isn’t the only one raking in profits. Many patents are held by individuals working at the NIH/NIAID. So, taxpayers fund research that may or may not work out, while Big Pharma, the NIH and individuals at the NIH profit from products that end up on the market. This is a clear conflict of interest that can hurt public health in any number of ways.\n\nFor starters, it incentivizes the NIH to support and promote potentially dangerous drugs, as we’ve clearly seen during the COVID pandemic. The NIH also has a significant stake in regulations that impact patents and vaccine mandates, and may use its influence to benefit itself rather than the public.\n\nIn the Full Measure video above, investigative journalist Sharyl Attkisson reports the findings of watchdog group Open The Books, which recently took a deep dive into “the issue of government scientists collecting royalty payments from pharmaceutical companies for discoveries made while working on your dime.”\n\nAccording to OpenTheBooks.com founder and CEO Adam Andrzejewski, the NIH distributes $32 billion of taxpayer funds as research grants each year to an estimated 56,000 different entities. “That basically buys you the entire American health care space,” he says.\n\nAs the largest federal grant-maker, the NIH has a monopoly on what research gets done and what doesn’t, as it decides which scientists and projects get that money. Scientists vying for grants also recognize that in order to get a piece of that pie, they have to play by the rules, and that means doing work that supports establishment narratives on public health policy.\n\nBut that’s not all. The NIH is also gobbling up patents, which further weakens its incentive to protect and promote what’s truly in the public’s best interest due to the financial conflicts of interest that come into play.\n\nAs explained by Andrzejewski, under the 1984 Bayh-Dole Act, government scientists can collect royalties from drug companies for discoveries they make while working on the public’s dime:\n\nIn fact, these royalty payments are kept under such closed wraps, scientists who receive them aren’t even required to divulge them on their financial statements, let alone to the public. Congress can’t even access those data.\n\nIn mid-June 2022, Sen. Rand Paul questioned then-NIAID chief Dr. Anthony Fauci about whether he’d ever received royalty payments from an entity to which he had given a research grant, and whether he or anyone else on the vaccine committee had ever received payments from vaccine makers.2 Fauci suffered one of his now-famous lapses of memory and wouldn’t answer.\n\nPaul’s questioning of Fauci came on the heels of a lawsuit filed against the NIH to obtain these payment disclosures. The lawsuit was filed by Open The Books in October 2021. But while the NIH eventually did release them, many of the most crucial pieces of information were redacted, and Paul’s attempt to get answers led nowhere. As noted by Andrzejewski:\n\nCOVID Jabs Are Rife With Conflicts of Interest\n\nConflicts of interest also appear to have played a role in the U.S. government’s preferential treatment of Pfizer and Moderna during the pandemic. Pfizer was the first to receive government authorization for its COVID jab, and it just so happens to be part of an NIH royalty-sharing agreement.\n\nModerna also has such an agreement. What this all means is that the NIH helped invent certain technologies that went into these shots, and then licensed those technologies to Pfizer and Moderna in return for royalty payments.\n\nSo, the NIH has been making tens of millions of dollars from the COVID shots. Could that financial incentive influence the NIH’s stance on vaccine mandates? What do you think?\n\nAs you may recall, Johnson & Johnson’s COVID jab was vilified for causing blood clots, and the U.S. Food and Drug Administration even limited the authorized use of the Janssen shot to people over the age of 18 who have no access to Moderna’s or Pfizer’s jabs, and/or those who voluntarily opt for the Janssen shot, understanding the risks.3\n\nMeanwhile, Pfizer’s and Moderna’s shots also cause blood clots, but neither of them was placed under restrictions. Instead, both were added to the U.S. childhood and adult vaccination schedules. Janssen wasn’t.\n\nThe NIH’s secret royalties and the conflicts of interest these payments create were also addressed by “Rising” hosts Robby Soave and Briahna Joy Gray in a recent episode (video above). Alexander Zaitchik, author of “Owning the Sun: A People’s History of Monopoly Medicine from Aspirin to COVID-19 Vaccines,” also joined them on the program.\n\nIn Zaitchik’s view, the biggest scandal is not that government scientists are receiving royalty payments from drug companies but, rather, the intimate relationship that exists between government and “an industry that is using the monopoly system to price gouge the American people.”\n\nPublic Gets Fleeced Coming and Going\n\nWhen public monies are being used for research, any scientific discoveries ought to be used for the public’s benefit, and the patents should remain public property with broad licensing rights.\n\nThis used to be the default position, but not anymore. In the 1970s, Big Pharma convinced Congress that this policy was slowing down innovation, and that if companies were allowed to claim exclusive rights to the patents, they’d be more apt to innovate. The Bayh-Dole Act was an outgrowth of this.\n\nBut we can now see why and how that doesn’t work. Public health is literally being sacrificed for profit, and since government agencies are in on it, there’s no one left to look out for the public’s interests.\n\nAdditionally, the public ends up getting fleeced twice. First, our tax dollars are being used to fund the research that private companies then lay claim to, and then we end up paying top dollar for the products we funded the development of, as there’s no price competition.\n\nAs noted by Zaitchik, while the Bayh-Dole Act is a bad law, it does have a rider that says generic production of drugs created with government funding can be mandated. However, every time patient groups have approached the NIH and asked for this provision to be enforced, as the monopoly is hurting patients who cannot afford the exorbitant prices, the NIH has rejected those requests.\n\nFor example, the U.S. Army invented a breakthrough prostate cancer drug, and Americans are paying six times the price for this drug compared to other parts of the world. But even though the government has the power to lower the price by mandating generic production, it refuses to do so.\n\nIn closing, I’d like to draw attention to a paper published in Surgical Neurology International in October 2022, titled “The Pharmaceutical Industry Is Dangerous To Health. Further Proof With COVID-19.”4\n\nDeruelle’s paper reviews a long list of techniques that drug companies use to shape and control the science, including the following:\n• Concealment of the fact there is no knowledge of the long-term effects of the COVID-19 jab\n• Dubious composition of the COVID shots, with many ingredients remaining unlisted\n• Conflicts of interest within governments and international organizations\n• Government use of behavior modification and social engineering techniques to impose isolation, masks wearing and vaccine acceptance\n\nDeruelle points out that all but one of the primary drug companies producing COVID “vaccines” — Pfizer, Moderna, AstraZeneca, Merck and Johnson & Johnson — have long criminal histories, having been busted and fined huge sums for illegal marketing, recommending drugs for off-label use, misrepresenting trial results and concealing information about known dangers of their drugs. Moderna is the only exception, as it’s only been around since 2010. Deruelle writes:5\n\nTrue to form, Pfizer is also accused of scientific fraud in its COVID-19 jab trial. Brook Jackson, who worked at one of Pfizer’s trial sites, sued Pfizer in 2021 for violating the False Claims Act.6 U.S. District Judge Michael Truncale heard oral arguments on the motions to dismiss, March 1, 2023.\n\nAs reported by The Epoch Times March 2, 2023,7 defense attorneys for Pfizer argued that “whether protocol violations occurred was ultimately irrelevant because the federal government was made aware of them but still granted emergency authorization to Pfizer’s vaccine.”\n\nJackson’s lawyers countered by saying the FDA authorized the vaccine before reviewing Jackson’s complaint. Judge Truncale has not issued a ruling as of this writing, and Jackson’s attorney suspects it may be weeks or even months before the judge issues his opinion.8\n\nDeruelle also specifically delves into the conflicts of interest and relationships between the drug companies involved during COVID-19 and governments, international organizations and media — and how they worked the COVID “emergency” for their own benefit. Here are some select excerpts:9\n\n“In 2009, the H1N1 episode should already have been enough to reveal that governments and the WHO are not autonomous. Work has shown that the 2009 H1N1 pandemic seems (based on case fatality rates [CFRs]) to have been the mildest influenza pandemic on record. Following investigations by the BMJ, it appears that this event declared by the WHO is significantly tainted by conflicts of interest. A report by the Parliamentary Assembly of the Council of Europe has heavily criticized the WHO, national governments, and EU agencies for their handling of the swine flu pandemic: distortion of priorities of public health services all over Europe, waste of huge sums of public money, provocation of unjustified fear among Europeans, and creation of health risks through vaccines and medications which might not have been sufficiently tested before being authorized in fast-track procedures. According to former head of health at the Council of Europe, W. Wodarg, the swine flu outbreak was a false pandemic driven by drug companies that influenced scientists and official agencies … During the COVID-19 period, France hired private consulting firms, mainly McKinsey and Company, which is known for working with pharmaceutical companies. The Senate Inquiry Commission reports that McKinsey contributed on all aspects of the health crisis, notably for social engineering strategies on the vaccination campaign and the extension of the health pass … The suppression of good science and scientists is not new, but COVID-19 unleashed state corruption on a grand scale, suppressing science for political and financial reasons … Since the beginning of COVID-19, much scientific data and expert opinion have been censored or labeled as false or misleading by many internet platforms … In June 2019, the World Economic Forum (WEF) and the United Nations signed a partnership (2030 agenda). In the field of health, this alliance is designed to combat key emerging global health threats and achieve universal health coverage. In October 2019, in New York City, the Johns Hopkins Center for Health Security and its partners the WEF and the Gates Foundation, hosted Event 201, a fictional coronavirus pandemic … Among the partners of the WEF, there are: Pfizer, AstraZeneka, Johnson and Johnson, Moderna, McKinsey, and Facebook et Google. A few months later, a coronavirus pandemic is declared, accompanied by its highly mediatized universal solution, the vaccine … In addition to Event 201, other pandemic simulations, civil (MARS and SPARS in 2017) and military (Dark Winter in 2001, Atlantic Storm in 2003 and 2005, Global mercury in 2003, and Crimson Contagion in 2019), have taken place over the past 20 years. All these simulations correspond to fear programs induced by false media. For the general welfare of the population, all these scenarios lead to the same methods (identical to those used during COVID-19): Isolation, control of movements and liberties, censorship, propaganda, and coercive vaccination of the population … [T]here is no doubt that this is an event manipulated by governments, international agencies, pharmaceutical industries, and the media. In addition to the huge profits obtained by the pharmaceutical groups involved, the primary goal of this ‘pandemic’ seems to be compulsory vaccination, because the introduction of a European vaccine passport had already been planned since 2019 … The objective of the WHO is to impose the Chinese model to become the norm. That is to say, a system with centralization of each person’s health data and restriction of freedoms for the unvaccinated … A period such as COVID-19 represents a powerful lever for increasing the effectiveness of global governance.”\n\nIn the final analysis, conflicts of interest and the collusion between government and industry does more than rob us of our hard-earned money. It now threatens our very freedom, as these monopolies are being used to further a totalitarian takeover of global proportions.\n\nAs such, we can no longer turn a blind eye or accept excuses such as “these relationships don’t influence our decision-making.” They absolutely influence the decisions being made, and the public is consistently on the losing end. Congress needs to start taking this seriously, and revisit laws such as the Bayh-Dole Act, which is currently allowing private monopolies to profit while no one is looking out for our interests.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Conflicts of Interest: Pfizer’s Secret Collusion With the NIH | The Liberty Beacon", "description": "Stop and consider that ... As the largest federal grant-maker, the NIH has a monopoly on what research gets done and what doesn’t ...", "url": "https://www.thelibertybeacon.com/conflicts-of-interest-pfizers-secret-collusion-with-the-nih/", "article:published_time": "2023-03-21T15:24:07+00:00", "article:modified_time": "2023-03-21T21:13:37+00:00"}, "tags": ["National Institutes of Health", "Third-Party Royalty", "collusion", "COVID Pandemic", "COVID Responses", "Endangering Public Health", "establishment narratives", "mRNA shot", "vaccine patents", "NIH", "big pharma", "Dr. Joseph Mercola", "vaccine mandates", "Pfizer", "Anthony Fauci", "Bayh-Dole Act", "NIAID", "NIH Conflicts of Interest"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "380", "embed_code": "<iframe id=\"iFrameResizer0\" class=\" mlazyloaded\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/7yabbZrGxsc?wmode=transparent&amp;rel=0\" width=\"680\" height=\"380\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\" data-mlazyload-src=\"https://www.youtube.com/embed/7yabbZrGxsc?wmode=transparent&amp;rel=0\" data-mce-fragment=\"1\"><p style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" data-mce-type=\"bookmark\" class=\"mce_SELRES_start\">﻿</p></iframe>", "src": "https://www.youtube.com/embed/7yabbZrGxsc?wmode=transparent&rel=0"}], "links": ["https://pinterest.com/pin/create/button/?description=Conflicts of Interest: Pfizer’s Secret Collusion With the NIH&media=&url=https://www.thelibertybeacon.com/conflicts-of-interest-pfizers-secret-collusion-with-the-nih/", "https://www.linkedin.com/shareArticle?title=Conflicts of Interest: Pfizer’s Secret Collusion With the NIH&url=https://www.thelibertybeacon.com/conflicts-of-interest-pfizers-secret-collusion-with-the-nih/"], "authors": [], "publish_date": "2023-03-21T15:24:07+00:00"}