{"result_id": "300007", "URL": "https://www.thelibertybeacon.com/the-message-of-general-christian-blanchon-paying-tribute-to-the-non-vaccinated/", "timestamp": "2023-04-25 17:28:03 CEST+0200", "meta": {"description": "France's General Christian Blanchon delivered a stunning message of support and admiration for all citizens who resisted the pressure against vaccination.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/the-message-of-general-christian-blanchon-paying-tribute-to-the-non-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "The Message of General Christian Blanchon Paying Tribute to the Non-vaccinated | The Liberty Beacon", "cleaned_text": "ER Editor: From this Facebook page, it seems that General Christian Blanchon has joined Florian Philippot‘s Les Patriotes party. We’ve mentioned this often before, but Florian Philippot, after leaving Marine Le Pen’s party as her second in command, started his own party and has been leading Saturday marches against all manner of health tyranny and more since the middle of 2020. He provides daily news updates and political commentary on Youtube. Establishment politicians are scared to face him off in television interviews. Bravo to General Blanchon.\n\nIt was Philippot’s demonstration in Paris two weekends ago that Russian media were there for, and which French MSM denied had even happened. See\n\nFrench TV Channel Accuses Russian Television of Broadcasting Propaganda About France When It Was Inconveniently True\n\nThe message of General Christian Blanchon paying tribute to the non-vaccinated\n\nThey are there, by your side, they seem normal, but they are superheroes. Even if I were fully vaccinated, I would admire the unvaccinated for standing up to the greatest pressure I have ever seen, including from spouses, parents, children, friends, colleagues and doctors. People who have been capable of such personality, such courage and such critical ability undoubtedly embody the best of humanity. * They are found everywhere, in all ages, levels of education, countries and opinions. They are of a particular kind; these are the soldiers that any army of light wishes to have in its ranks. They are the parents that every child wishes to have and the children that every parent dreams of having. They are beings above the average of their societies, they are the essence of the peoples who have built all cultures and conquered horizons. They are there, by your side, they seem normal, but they are superheroes. They did what others couldn’t, they were the tree that withstood the hurricane of insults, discrimination and social exclusion. And they did it because they thought they were alone, and believed they were alone. Excluded from their families’ Christmas tables, they have never seen anything so cruel. They lost their jobs, they let their careers sink, they had no more money… but they didn’t care. They suffered immeasurable discrimination, denunciations, betrayals and humiliations… but they continued. Never before in humanity has there been such a casting, we now know who the resisters are on planet Earth. Women, men, old, young, rich, poor, of all races and all religions, the unvaccinated, the chosen ones of the invisible ark, the only ones who managed to resist when everything fell apart, collapsed. It’s you, you’ve passed an unimaginable test that many of the toughest marines, commandos, green berets, astronauts and geniuses couldn’t pass. You are made of the stuff of the greatest that ever lived, those heroes born among ordinary men who shine in the dark.”\n\nPublished to The Liberty Beacon from EuropeReloaded.com\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "The Message of General Christian Blanchon Paying Tribute to the Non-vaccinated | The Liberty Beacon", "description": "France's General Christian Blanchon delivered a stunning message of support and admiration for all citizens who resisted the pressure against vaccination.", "url": "https://www.thelibertybeacon.com/the-message-of-general-christian-blanchon-paying-tribute-to-the-non-vaccinated/", "article:published_time": "2022-09-13T10:07:27+00:00", "article:modified_time": "2022-09-13T10:07:27+00:00"}, "tags": ["Florian Philippot", "General Christian Blanchon", "praise for unvaccinated", "Les Patriotes", "tribute to unvaccinated", "Pam Barker", "Profession Gendarme", "Europe Reloaded"], "tweets": [], "movies": [], "links": ["https://www.facebook.com/MvtLesPatriotes/photos/le-g%C3%A9n%C3%A9ral-christian-blanchon-rejoint-les-patriotes-et-devient-notre-r%C3%A9f%C3%A9rent-na/199321353943869/", "https://www.youtube.com/c/FLORIANPHILIPPOT1", "https://www.europereloaded.com/french-tv-channel-accuses-russian-television-of-broadcasting-propaganda-about-france-when-it-was-true/", "https://i0.wp.com/www.profession-gendarme.com/wp-content/uploads/2022/09/general-christian-blanchon.png?ssl=1", "https://www.profession-gendarme.com/le-message-du-general-christian-blanchon-rendant-hommage-aux-non-vaccines/", "http://www.europereloaded.com/", "http://www.europereloaded.com/", "https://pinterest.com/pin/create/button/?description=The Message of General Christian Blanchon Paying Tribute to the Non-vaccinated&media=&url=https://www.thelibertybeacon.com/the-message-of-general-christian-blanchon-paying-tribute-to-the-non-vaccinated/", "https://www.linkedin.com/shareArticle?title=The Message of General Christian Blanchon Paying Tribute to the Non-vaccinated&url=https://www.thelibertybeacon.com/the-message-of-general-christian-blanchon-paying-tribute-to-the-non-vaccinated/"], "authors": [], "publish_date": "2022-09-13T10:07:27+00:00"}