{"result_id": "300044", "URL": "https://www.thelibertybeacon.com/austrian-minister-of-health-confirms-doctors-are-responsible-for-vaccine-damage/", "timestamp": "2023-04-25 17:29:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/austrian-minister-of-health-confirms-doctors-are-responsible-for-vaccine-damage/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "Austrian Minister of Health Confirms – Doctors Are Responsible for Vaccine Damage | The Liberty Beacon", "cleaned_text": "A parliamentary question from the ambitious FPÖ MP Mag. Gerald Hauser has put the Green Minister of Health Johannes Rauch (right) under considerable pressure. But the impact on the hard ground of reality will hit that part of the medical profession in particular who naively believed the evidence-less assurances from the ministry that the corona preparations were safe.\n\nIn the ten-page answer to the questions about liability for the Covid injections, it has become clear: Rauch apparently gets scared and brushes himself off at the vaccinators. They would have to fulfill their obligation to provide information. Otherwise, repeated disregard could result in horrendous penalties of up to 14,000 euros.\n\nAs early as July of last year, Wochenblick reported that the vaccination doctor could very likely be held responsible in the event of vaccination damage. This is when the patient has not been sufficiently informed in advance about the possible negative consequences of the injection, such as the many well-known and serious side effects. Because, as Hauser repeatedly emphasized: “Vaccination is the problem, not the disease!” And now the corona jab could become a problem for many vaccination doctors. The tireless FPÖ MP Mag. Gerald Hauser, who has repeatedly presented the government with its many sophisticated inquiries, emphasized to Wochenblick : “Without my incredible team, this enormously high number of hits would not have been possible. Just the many hours of research that are necessary to prepare a well-founded inquiry; I would never be able to do that on my own,” says the man from Freedom, emphasizing the importance of his team.\n\nBecause that is exactly what the Minister of Health’s answer to the parliamentary question confirms. He seems to be trying to pull his own head out of the ever-tightening noose and to want to shirk responsibility. Although he has prescribed the “vaccinations”, liability is shifted entirely to the medical profession.\n\nDoctors have to clarify – otherwise there are disciplinary and liability consequences\n\nDoctors would have to provide sufficient information about the benefits and risks of the treatment in advance so that the person concerned can make an informed and free decision. The consequences for doctors are also mentioned in the answer: “The function of the information is to protect the freedom of decision of the person concerned” of medical professional duties. This can be punished under administrative and/or disciplinary law as well as have consequences under liability law.”\n\nThis could lead to an extremely painful awakening for those vaccinators who have relied on statements from the Ministry of Health that the syringes are safe. Because a veritable tsunami of lawsuits could come to the gullible physicians.\n\nThe answer to the Hauser query also reveals another point that Wochenblick has already discussed in detail (including here, here, here, here and here): the enormous influence of the pharmaceutical industry on the medical profession and the entire healthcare system. In 2020 alone, Pfizer pumped over 31 million euros into the Austrian healthcare system. Rauch’s answer shows that there have been a total of 143 training courses for vaccination doctors on the subject of Covid vaccinations. The organization DFP, which runs these events according to its website, is sponsored by the pharmaceutical companies Sanofi, Merck Sharp & Dohme, Valneva and Johnson & Johnson. So the question arises as to how detailed vaccination damage is dealt with at such events.\n\nFines of up to 14,000 euros for doctors\n\nThe answers to questions four to seven make it clear that the medical profession bears full responsibility and liability in connection with the vaccination and its side effects and is left hanging by the Ministry of Health. Because Rauch has cleaned himself up with the following statement: “The scope of medical education has been shown in the Austrian vaccination plan for years and I can assume that doctors work in accordance with the recommendations and the state of the art.”\n\nAs Wochenblick reported in detail last year, the penalty for violating the obligation to report side effects or lack of effectiveness (according to the Medicines Act) is 7,500 euros, and up to 14,000 euros in repeated cases. However, oddly enough, not a single notification of this kind has yet been received. As it seems, those affected have to take action themselves .\n\nSuspected side effects should always be reported, said Rauch. This report must be sent to the Federal Office for Safety in Health Care (BASG). In addition, patients and their relatives could also voluntarily report side effects directly to the BASG. A side effect is any reaction to the vaccine that is harmful and unintended. In the case of vaccines, this also includes the lack of an effect.” So the question arises: Is it already a reportable side effect if a gene-treated person subsequently becomes infected with corona and actually becomes ill – i.e. has a so-called “vaccination breakthrough”?\n\nA particularly explosive point is dealt with in the answer to question eight: Is the vaccination status recorded at all? When a doctor takes the medical history (anamnesis) of a patient, all information about medication taken and vaccinations administered would also have to be recorded. Because otherwise, a connection between symptoms and a previous injection cannot be established.\n\nMany doctors who treat vaccination side effects complain that precisely this information on corona vaccinations is very often missing in the medical history. According to the Minister of Health, “there is no explicit legal obligation to collect a ‘vaccination status'”. But: “As part of the anamnesis, all information that is necessary for the clarification of a clinical picture must be obtained. If there is a suspicion of a vaccination side effect or the lack of the expected effectiveness”, doctors are obliged to report to the BASG immediately.\n\nOn page five of the answer, another spicy point comes up. The Minister of Health writes: “If fully vaccinated people contract COVID-19, this is called a vaccine breakthrough. In order to counteract underreporting, the data from the epidemiological reporting system EMS is compared with that from the e-vaccination card. This raises the question of whether this procedure is even legal under data protection law. As is well known, ELGA refused to keep the vaccination register in order not to make itself legally vulnerable (Wochenblick reported ).\n\nMinistry of Health does nothing\n\nWhen asked what the ministry is doing to ensure the reporting of side effects, Rauch replies that all responsibility lies with the doctors. So the Ministry of Health itself is doing absolutely nothing!", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "Austrian Minister of Health Confirms – Doctors Are Responsible for Vaccine Damage | The Liberty Beacon", "url": "https://www.thelibertybeacon.com/austrian-minister-of-health-confirms-doctors-are-responsible-for-vaccine-damage/", "article:published_time": "2022-07-02T06:59:09+00:00", "article:modified_time": "2022-07-02T06:59:09+00:00"}, "tags": ["paul craig roberts", "Austrian doctors responsible for vaccine damage", "Pam Barker", "Gerald Hauser MP FPO", "Johannes Rauch Austrian health minister", "Wochenblick.at", "Europe Reloaded"], "tweets": ["<blockquote class=\"twitter-tweet\" data-twitter-extracted-i1656682198723225926=\"true\">\n<p dir=\"ltr\" lang=\"de\">“Today we spoke to a doctor friend of ours:</p>\n<p>Doctors are not allowed to report any vaccine damage, not even suspected cases! Strict instructions from the Medical Association. Anyone who violates this is revoked the right to ordain</p>\n<p>— MarsMensch🇩🇪✊️🇷🇺🤥🤧 (@rulezof909) <a href=\"https://twitter.com/rulezof909/status/1538861221558075398?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">June 20, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.parlament.gv.at/WWER/PAD_35515/index.shtml#", "https://www.wochenblick.at/corona/corona-impfungen-ehrliche-aufklaerung-statt-propaganda/", "https://twitter.com/rulezof909/status/1538861221558075398?ref_src=twsrc%5Etfw", "https://www.wochenblick.at/brisant/immer-wieder-pfizer-impfexperten-der-regierung-und-ihre-verbindungen-zu-big-pharma/", "https://www.wochenblick.at/brisant/skandaloese-pharmaverbindungen-des-covid-19-beraterstabes-und-immer-wieder-pfizer/", "https://www.wochenblick.at/brisant/bedenkliche-pharma-verbindungen-impf-berater-der-regierung-mit-interessenkonflikten/", "https://www.wochenblick.at/brisant/naechster-skandal-impfexperten-der-regierung-mit-finanz-verbindungen-zur-pharma/", "https://www.wochenblick.at/corona/im-sold-der-pharmaindustrie-so-eng-verflochten-ist-der-covid-19-beraterstab/", "https://www.pfizer.at/verantwortung/transparenz/", "https://www.meindfp.at/akademie-lernwelt/ueberblick/webinarreihe-fokus-impfen", "https://www.wochenblick.at/corona/mutanwaelte-die-geimpften-sind-versuchskaninchen/", "https://nebenwirkung.basg.gv.at/expired.php", "https://nebenwirkung.basg.gv.at/meldende-person.php", "https://www.wochenblick.at/corona/impfpflicht-vor-dem-aus-elga-erteilt-stich-plaenen-der-regierung-abfuhr/", "https://www.wochenblick.at/wp-content/uploads/2022/06/Beantwortung-der-Anfrage.pdf", "https://www.wochenblick.at/wp-content/uploads/2022/06/Beantwortung-der-Anfrage.pdf"], "authors": [], "publish_date": "2022-07-02T06:59:09+00:00"}