{"result_id": "300036", "URL": "https://www.thelibertybeacon.com/world-council-of-health-appeal-to-stop-vaccines/", "timestamp": "2023-04-25 17:29:00 CEST+0200", "meta": {"description": "Given the research by former pro-vaccine doctor Aseem Malhotra, the World Council for Health are appealing to stop the Covid vaccines due to health risks.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2017/03/cropped-TLB-Favicon.png?fit=32%2C32&ssl=1", "canonical": "https://www.thelibertybeacon.com/world-council-of-health-appeal-to-stop-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.thelibertybeacon.com", "title": "World Council of Health Appeal to Stop Vaccines | The Liberty Beacon", "cleaned_text": "ER Editor: Dr. Aseem Malhotra has been making positive waves recently for having dramatically reversed his position on Covid vaccines following the death of his own vaccinated father, a doctor and deputy chair of the BMJ (British Medical Journal). On this he’s published a research paper.\n\nHere is Malhotra’s story and a summary of his paper for Journal of Insulin Resistance by the Naked Emperor, Ivor Cummings: Peer-reviewed Paper – Curing the pandemic of misinformation on COVID-19 mRNA vaccines through real evidence-based medicine\n\nBy way of introduction:\n\nA British doctor, Aseem Malhotra, has just had a two part, peer-reviewed paper published in the Journal of Insulin Resistance. The aim of the paper was to gain a better understanding of the true benefits and potential harms of the mRNA Covid vaccines. You can read Part 1 and Part 2 in full by clicking on the links. Dr Malhotra. a cardiologist by trade, was originally a strong Covid vaccine advocate. He volunteered in a vaccine centre, was one of the first people to be double dosed and appeared on morning television to encourage everyone to get vaccinated. He was surprised and concerned at vaccine-hesitant patients when they asked about ‘anti-vax’ propaganda. That was until, sadly, in July 2021, his father suffered a cardiac arrest and died. His father had been the former deputy chair of the British Medical Association (BMA) and honorary vice president. The 73 year old gentleman was extremely fit and active and heart scans from a few years earlier had revealed no significant problems. Dr Malhotra was shocked to read his father’s post mortem which found that two out of three of his major arteries had severe blockages. Aseem couldn’t explain the post mortem findings and became more concerned in November 2021 after reading a peer-reviewed abstract in Circulation Journal. In the study, the mRNA vaccine was associated with significantly increasing the risk of a coronary event within five years from 11% pre-mRNA vaccine to 25% 2-10 weeks post vaccine. He began to question his father’s death and wondered whether the Pfizer vaccination he had received six months earlier could have contributed in some way. After six months of critically appraising the data and speaking to eminent scientists, he reluctantly concluded that, contrary to his own dogmatic beliefs, Pfizer’s vaccine was far from being as safe and effective as first thought. …\n\nHere is Dr. Paul Alexander‘s reaction: Top CARDIOLOGIST prior pushed COVID vaccine, now says NO more COVID vaccine! STOP! Dr. Aseem Malhotra continues to pound away at mRNA COVID injections, slamming fraud Pfizer & Moderna.\n\nThe World Council for Health gave a press conference on this 3 days ago featuring Dr. Malhotra as well as some other by now famous medical names. Check out what Malhotra has to say on the phenomenon of ‘wilful blindness’ and the illusion of knowledge. Dr. Ryan Cole joins in the discussion later in the video. A lot of evidence on the harms of the vaccines is given in review form. The video, albeit long, is a keeper.\n\nPress Conference: Dr. Aseem Malhotra’s New Peer-Reviewed Paper Calls for Immediate and “Complete Suspension” of Covid-19 Vaccine", "opengraph": {"locale": "en_US", "site_name": "The Liberty Beacon | Bringing Alternative Media Sources Together™", "type": "article", "title": "World Council of Health Appeal to Stop Vaccines | The Liberty Beacon", "description": "Given the research by former pro-vaccine doctor Aseem Malhotra, the World Council for Health are appealing to stop the Covid vaccines due to health risks.", "url": "https://www.thelibertybeacon.com/world-council-of-health-appeal-to-stop-vaccines/", "article:published_time": "2022-09-30T08:51:23+00:00", "article:modified_time": "2022-09-30T08:51:23+00:00"}, "tags": ["Dr. Paul Alexander", "stop Covid vaccines", "Dr Ryan Cole", "World Council for Health", "Dr. Aseem Malhotra", "Europe Reloaded", "Pam Barker", "Dr. Tess Lawrie"], "tweets": [], "movies": [], "links": ["https://nakedemperor.substack.com/p/peer-reviewed-paper-curing-the-pandemic", "https://insulinresistance.org/index.php/jir/article/view/71/224", "https://insulinresistance.org/index.php/jir/article/view/72/228", "https://palexander.substack.com/p/top-cardiologist-prior-pushed-covid", "https://insulinresistance.org/index.php/jir", "https://insulinresistance.org/index.php/jir/article/view/71", "https://doctoraseem.com/", "https://worldcouncilforhealth.org/news/news-releases/peer-reviewed-papers-suspension-covid-19-vaccines/", "https://worldcouncilforhealth.org/news/news-releases/peer-reviewed-papers-suspension-covid-19-vaccines/", "https://draseemmalhotra.co.uk/", "https://insulinresistance.org/index.php/jir/article/view/71", "https://insulinresistance.org/index.php/jir/article/view/72", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/resources/spike-protein-detox-guide/", "https://odysee.com/@WorldCouncilForHealth:3/press-conference-dr-aseem-malhotra:d", "https://rumble.com/v1lnncp-press-conference-dr.-aseem-malhotra-calls-for-immediate-and-complete-suspen.html", "https://gettr.com/streaming/p1saji5e4d0", "https://www.youtube.com/watch?v=ojPT9TWBikU", "https://www.facebook.com/WorldCouncilforHealth/videos/452210436712818/?__cft__%5B0%5D=AZWhayBhMDZJ2Lfl16QANddMRZIMTQ_Fte119PznaH_dq0qblmf9LiLLvyFcU9BIk3DsZa_BtGA_sVtzl1h82IrhpssPxiRQv6KF4m1RKQo9HBtqkpxiThEkNL2rvYjaaRiB-Ida2BsykaRR85kwUfC18SSLntMO6QpZWDEQzjfk9JZdjZ50rpLlHvdjuwhqVr4&__tn__=%2CO%2CP-R"], "authors": [], "publish_date": "2022-09-30T08:51:23+00:00"}