{"result_id": "301029", "URL": "https://themindunleashed.com/2019/04/psilocybin-magic-mushrooms-trend-cannabis.html", "timestamp": "2023-04-25 17:30:13 CEST+0200", "meta": {"description": "Psilocybin, the substance found in 200+ species of magic mushrooms, may be the next health and legalization trend after cannabis.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2019/04/psilocybin-magic-mushrooms-trend-cannabis.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Psilocybin & Magic Mushrooms – The Next Wellness & Legalization Trend After Cannabis?", "cleaned_text": "Psilocybin, the substance found in 200+ species of magic mushrooms, may be the next health and legalization trend after cannabis. Magic mushrooms have been used in many cultures all over the world for therapeutic and spiritual purposes. Many scientific studies and clinical trials have found positive evidence of their benefits to the human body, especially in the area of mental health. With the state of Oregon and the city of Denver (Colorado) about to vote on legalizing magic mushrooms later this year, will psilocybin become the next trend after cannabis?\n\nCurrent Legal Status of Psilocybin in the USA\n\nLike cannabis (marijuana), MDMA (Ecstasy or Molly), peyote and heroin, psilocybin is classified as a Schedule I drug. The definition of this category is substances with no medical use and the high potential for abuse. Possession of psilocybin mushrooms is a felony. Given the incredible benefits which magic mushrooms containing psilocybin offer mankind, this kind of classification is clearly ignorant, heavy-handed and contradictory. How can such benign substances as magic mushrooms be on the same level as the highly addictive, artificially manufactured and deadly heroin?\n\nWhat the Science Says About Psilocybin\n\nIt turns out magic mushrooms are already being closely studied all over the world by many different scientists. So far, the science shows psilocybin bestows many health benefits. In a nutshell, scientific studies including pre-clinical and clinical trials show that psilocybin helps beat depression, anxiety, addiction and even cancer. On a higher level, it helps increase joy, peace and altruism. However, looking closely at the results provides even more insight.\n\nAutism rates are skyrocketing across the US, with many suspecting vaccines (thimerosal/mercury) and GMOs (glyphosate) as possible causes. Whatever the cause, it’s a serious neurological disorder. Asperger’s used to be considered its own disorder but was recently reorganized to come under the ASD (Autism Spectrum Disorder) and is now considered a mild form of autism. Asperger’s is characterized by a rigidity of thought and routine, and by a lack of empathy and social/emotional awareness. Interestingly enough, this is exactly what psilocybin can heal according to a recent January 2019 study, which found that psilocybin increased flexibility, creativity and empathy. Here’s what the author of the study Natasha Mason said:\n\n“Examples of processes that have been found to be decreased in these pathologies include creative, flexible thinking and empathy. Specifically, individuals are characterized by repetitive and rigid patterns of negative and compulsive thoughts, as well as reduced empathic abilities. Thus we wanted to assess whether psilocybin enhanced these processes, and if so, how long effects lasted …We found that psilocybin, when taken in a naturalistic setting, increased aspects of creativity and empathy the morning after, and 7 days after use. Furthermore, psilocybin also enhanced subjective well-being. Interestingly, changes in well-being correlated with changes in empathy after psilocybin use.”\n\nThis also has implications for other mental disorders such as depression, anxiety and PTSD, as the study notes in its Introduction:\n\nBreaking Down the Ego and “Default Mode Network”\n\nIf you want to learn more about psilocybin and what science is beginning to show about its benefits and effects, check out the work of Michael Pollan, author of How to Change Your Mind: What the New Science of Psychedelics Teaches Us about Consciousness, Dying, Addiction, Depression and Transcendence. He discusses how psychedelics, contrary to a common misconception, actually make you more sane than crazy. This is because substances like psilocybin decrease the activity of a brain network called the default mode network, which is in charge of perception of self. Psilocybin halts the functioning of this network, thus allowing a space for new neural connections – a re-wiring of the brain.\n\nPsilocybin: Naturally in Sync with Our Biology\n\nAnother person to check out is Dr. Roland Griffiths, Professor in the Departments of Psychiatry and Neurosciences at Johns Hopkins University. He has some online videos such as this one where he shows that psilocybin helps people release fear, old patterns and negative beliefs. On a higher level, it helps increase joy, peace and altruism. Studies have also found that it can engender mystical-type experiences in people which are identical to those that occur naturally, suggesting psilocybin is naturally in sync with our biology.\n\nFurther Evidence of Psilocybin’s Potential as a Healing Agent\n\nLastly, take a look at the studies reported here and here on Waking Times. The latter showed that psilocybin strongly helped patients with depression:\n\n“Amazingly, after the participants were given two doses of psilocybin (10 mg and 25 mg), with the second dose a week after the first – their brains showed pronounced, decreased blood flow to the areas of the brain implicated in depression. Researchers also found increased stability on parts of the brain related to depression – and these effects lasted up to five weeks. The team described the immediate results of patients’ symptoms disappearing after the initial trip as an “afterglow” and a “disintegration” – with the compound also reintegrating brain networks afterward. The afterglow included marked improvements in mood and stress relief. Patients used a lot of computer metaphors to describe how their brains felt afterward – defragged, rebooted, and reset.”\n\nFinal Thoughts: Psilocybin is a Gift of Nature which will Hopefully Soon be Widely Legalized\n\nPsilocybin has a long history of use across the world, especially among South American tribes (like the Aztecs, whose word for it was teonanacatl, which translates to “divine mushroom”). There are several prehistoric rock art drawings depicting psilocybin mushrooms, such as the one in Spain, near Villar del Humo, approximately 6,000 years old, another in Tassili n’Ajjer (a national park in the Sahara Desert, Algeria) which is around 7,000-9,000 years old, and the one pictured above from Guatemala. My prediction and hope is that it will become the next health and legalization trend after cannabis, which, for the USA, also started in Denver, Colorado. We shall see.\n\nThis article (Psilocybin & Magic Mushrooms – The Next Wellness & Legalization Trend After Cannabis?) was originally created and published by The Freedom Articles and is re-posted here with permission.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2019/04/psiioo.jpg", "url": "https://themindunleashed.com/2019/04/psilocybin-magic-mushrooms-trend-cannabis.html", "title": "Psilocybin & Magic Mushrooms – The Next Wellness & Legalization Trend After Cannabis?", "description": "Psilocybin, the substance found in 200+ species of magic mushrooms, may be the next health and legalization trend after cannabis.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Health", "updated_time": "2019-04-05T00:04:31-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2019/04/psiioo.jpg", "image:width": "1862", "image:height": "1048", "image:alt": "Psilocybin & Magic Mushrooms – The Next Wellness & Legalization Trend After Cannabis?", "image:type": "image/jpeg", "article:published_time": "2019-04-04T23:55:22-05:00", "article:modified_time": "2019-04-05T00:04:31-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://psi-2020.org/", "https://ballotpedia.org/Denver,_Colorado,_Psilocybin_Mushroom_Initiative_(May_2019)", "https://www.psypost.org/2019/03/a-single-dose-of-psilocybin-enhances-creative-thinking-and-empathy-up-to-seven-days-after-use-study-finds-53283", "https://www.tandfonline.com/doi/full/10.1080/02791072.2019.1580804", "https://www.amazon.com/gp/product/1594204225/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=wakitime09-20&creative=9325&linkCode=as2&creativeASIN=1594204225&linkId=1f6e428030c3211c3e0d98e27e1156a1", "https://www.youtube.com/watch?v=6bu3q3GMHfE", "https://www.wakingtimes.com/2012/11/01/psilocybin-and-the-ego-centric-brain/", "https://www.wakingtimes.com/2017/10/16/psilocybin-appears-reset-brain-activity-depressed-patients-stunning-results/", "http://wakingtimes.com/", "http://freedom-articles.toolsforfreedom.com/psilocybin-mushrooms-health-legalization-trend/", "http://freedom-articles.toolsforfreedom.com/", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Makia Freeman"], "publish_date": "2019-04-04T23:55:22-05:00"}