{"result_id": "301012", "URL": "https://themindunleashed.com/2020/04/india-officials-cow-urine-prevents-covid-19-muslims-corona-jihad.html", "timestamp": "2023-04-25 17:29:45 CEST+0200", "meta": {"description": "The consumption of cow urine is being touted by officials for its alleged immunity-boosting properties and abilities to protect people from COVID-19.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/04/india-officials-cow-urine-prevents-covid-19-muslims-corona-jihad.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "People in India Claim Cow Urine Prevents COVID-19 as Muslims Blamed for \"Corona Jihad\"", "cleaned_text": "(TMU) — As India struggles with the deadly impact of the coronavirus pandemic, the South Asian nation has been placed under lockdown by the government of Prime Minister Narendra Modi. At the same time, locals have improvised ways to prevent infections amid fears that the country’s healthcare services are woefully underprepared for what could be a major disaster.\n\nIn the state of Gujarat, one of these remedies has been the consumption of cow urine, which is being touted by officials for its alleged immunity-boosting properties and abilities to protect people from CoViD-19. The state has long been a stronghold for the Hindu supremacist ideology or Hindutva that Modi’s ruling Bharatiya Janata Party (BJP) upholds.\n\nEconomic Times reports that the sale of the cow urine—referred to locally as goumutra—has been on the rise since the outbreak of the disease, with locals drinking the piddle in fresh liquid form or drinking and gargling it in condensed form.\n\nAccording to Vallabh Kathiria, the chairman of the Rashtriya Kamdhenu Aayog—an agency established by Modi for the “conservation, protection and development of cows,” according to a government press release—cow urine can even be used as a body spray that would ward off “malicious microbes” like the coronavirus.\n\nKathieria, who previously served as a Union minister of state for health and family welfare, told Economic Times:\n\nLabhshankar Rajgore, another so-called “cow activist” in the region, also told the newspaper that he planned to develop cow urine-based hand sanitizers, noting that the urine-based body spray he had invented in 2007 had proven “useful to keep the virus away along with many other harmful germs.”\n\nThe reported surge in cow urine sales comes after an activist with the ruling BJP was arrested after he organized a party last month where participants drank cow urine to combat the novel coronavirus. One of the participants who drank the cow urine eventually became sick.\n\nDilip Ghosh, the president of the BJP’s West Bengal branch, complained to AFP that the arrest of the party leader was “unfortunate” and ran contrary to the “democratic” nature of India. Ghosh added that “everyone has the right to express his opinion.”\n\nThe popularity of the remedy—which hasn’t been proven to have any medicinal qualities whatsoever—shows the extent to which a historically secular Indian society is being transformed by superstitious ideology of religious Hindu supremacists, who venerate cows as holy and embodying goddess-like properties.\n\nThe rise in superstitions surrounding the excrement of supposedly “sacred” cows has coincided with a rise in anti-Muslim violence by Hindutva adherents, as well as controversial attempts to pass laws like the Citizenship Amendment Act (CAA) and National Register of Citizens (NRC) that India’s 200 million Muslims fear would effectively strip them of their citizenship. India’s minorities fear that the actions of the ruling BJP, a party that originated in a political movement inspired in part by Adolf Hitler’s Nazi Party, could lead to a “Muslim Holocaust” if they are unchecked.\n\nUnrest surrounding the CAA and NRC saw months of protests earlier this year culminated in February with deadly anti-Muslim mob violence and riots in the capital, New Delhi.\n\nMuslims are now being blamed for the spread of CoViD-19 after dozens of cases of the novel virus were linked to a Muslim missionary group’s annual conference in March. This has led to social media users spreading false rumors and fake news about the Islamic community in India waging a so-called “corona jihad” or “bio jihad.”\n\nThe “corona jihad” builds on the Hindu nationalist claim that Muslims are trying to “Islamicize” India. A similar concept, “love jihad,” claims that Muslim men are targeting Hindu women for seduction in order to convert them to Islam.\n\nLast year, BJP leader Ranjit Bahadur Srivastava also accused Muslims of waging “love jihad” against the so-called “Hindu nation”—this time by keeping cattle in their homes. The BJP leader added that the bovine creatures were not only Hindus themselves, but should also be treated as mothers.\n\nSpeaking to Asian News International, the BJP leader said:", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/04/hhjff.png", "url": "https://themindunleashed.com/2020/04/india-officials-cow-urine-prevents-covid-19-muslims-corona-jihad.html", "title": "People in India Claim Cow Urine Prevents COVID-19 as Muslims Blamed for \"Corona Jihad\"", "description": "The consumption of cow urine is being touted by officials for its alleged immunity-boosting properties and abilities to protect people from COVID-19.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Animals", "updated_time": "2020-04-06T13:33:09-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/04/hhjff.png", "image:width": "1200", "image:height": "630", "image:alt": "Cow Urine", "image:type": "image/png", "article:published_time": "2020-04-06T12:56:00-05:00", "article:modified_time": "2020-04-06T13:33:09-05:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The regressive cultural politics of Hindutva promises to make the COVID-19 crisis in India an unmitigated catastrophe.</p>\n<p>6,000 liters of cow urine is being consumed everyday as a vaccine in Modi’s state of Gujarat.<a href=\"https://t.co/iYKKWZJEId\" target=\"_blank\">https://t.co/iYKKWZJEId</a></p>\n<p>— CJ Werleman (@cjwerleman) <a href=\"https://twitter.com/cjwerleman/status/1245489378421428224?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">April 1, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Until some years back, the Notion of Hindus consuming Cow urine was used only by Pakistan Army &amp; hardliner Islamic preachers. In 2020 many Muslims abuse or degrade Hindus calling them \"Cow Urine drinker\"<br/>This proves that how Hardliner Islamists have hijacked our institutions.</p>\n<p>?</p>\n<p>— Prⓞud ?afi̵r (@twwettierr) <a href=\"https://twitter.com/twwettierr/status/1246653324725612544?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">April 5, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">14th March 2020.</p>\n<p>Haan ji, any arrests/ FIRs for the famed Gaumutra party? </p>\n<p>200 people were in attendance, no social distancing was observed and no masks were spotted. <a href=\"https://t.co/zPrBEiVA1J\" target=\"_blank\">https://t.co/zPrBEiVA1J</a></p>\n<p>— Sidrah (@SidrahDP) <a href=\"https://twitter.com/SidrahDP/status/1244714725113344003?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 30, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://themindunleashed.com/", "https://www.theguardian.com/world/2020/feb/20/hindu-supremacists-nationalism-tearing-india-apart-modi-bjp-rss-jnu-attacks", "https://m.economictimes.com/news/politics-and-nation/thousands-of-litres-of-cow-urine-consumed-in-gujarat-daily/amp_articleshow/74922747.cms", "https://t.co/iYKKWZJEId", "https://twitter.com/cjwerleman/status/1245489378421428224?ref_src=twsrc%5Etfw", "https://pib.gov.in/newsite/PrintRelease.aspx?relid=188146", "https://twitter.com/twwettierr/status/1246653324725612544?ref_src=twsrc%5Etfw", "https://www.bangkokpost.com/world/1882000/india-political-activist-arrested-for-selling-cow-urine-to-combat-virus", "https://t.co/zPrBEiVA1J", "https://twitter.com/SidrahDP/status/1244714725113344003?ref_src=twsrc%5Etfw", "https://foreignpolicy.com/2020/02/21/india-muslims-deported-terrified-citizenship-amendment-act-caa/", "https://theintercept.com/2019/09/21/howdy-modi-trump-anders-brevik/", "https://www.dailysabah.com/opinion/op-ed/is-india-sleepwalking-toward-a-muslim-holocaust", "https://thediplomat.com/2020/04/the-2020-delhi-riots-implications-for-southeast-asia/", "https://time.com/5815264/coronavirus-india-islamophobia-coronajihad/", "https://www.indiatoday.in/india/story/muslims-keeping-cows-is-love-jihad-barabanki-bjp-leader-ranjit-bahadur-srivastava-1574952-2019-07-29", "https://themindunleashed.com/author/eliasmarat", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2020/04/india-officials-cow-urine-prevents-covid-19-muslims-corona-jihad.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Elias Marat"], "publish_date": "2020-04-06T12:56:00-05:00"}