{"result_id": "301016", "URL": "https://themindunleashed.com/2019/02/mexican-doctor-cure-hpv.html", "timestamp": "2023-04-25 17:29:51 CEST+0200", "meta": {"description": "Led by scientist Eva Ramon Gallegos, the team was able to eradicate HPV in 29 patients through a non-invasive technique known as photodynamic therapy.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2019/02/mexican-doctor-cure-hpv.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Women-Led Team of Mexican Scientists Develop Cure for HPV, a Leading Cause of Cancer", "cleaned_text": "Researchers at Mexico’s National Polytechnic Institute (IPN) are celebrating a major scientific achievement: a new treatment that they claim can completely cure the human papillomavirus (HPV), helping to curb a leading cause of deadly cancer among women.\n\nLed by scientist Eva Ramon Gallegos, the team was able to eradicate HPV in 29 patients through a non-invasive technique known as photodynamic therapy, according to El Universal.\n\nThe treatment involves the use of a drug called a photosensitizer or photosensitizing agent, alongside a wavelength of light that is used to treat affected areas of the body.\n\nProfessor Gallegos and her team, consisting mostly of women scientists, had studied the therapeutic method for about two decades in hopes to find approaches to prevent or roll back precancerous abnormalities and tumors including melanoma and the early stages of breast cancer.\n\nAbout 420 patients in the Mexican states of Oaxaca and Veracruz were treated with the therapy, along with 29 women in Mexico City.\n\nThe team’s accomplishment is being hailed as a major breakthrough, especially because of the complete lack of any known side effects or damage to those who have undergone the therapy.\n\nWhat’s remarkable about this research is that this therapy doesn’t have any collateral damage to the human body, meaning it has no side effects.\n\n“Unlike other treatments, it only eliminates damaged cells and does not affect healthy structures. Therefore, it has great potential to decrease the death rate from cervical cancer,” Gallegos explained to Cuba’s Radio Guama.\n\nPrior to the treatment, patients underwent a colposcopy, pap smear, hybrid capture test, polymerase chain reaction and a biopsy to diagnose any premalignant lesions or HPV infections.\n\nHuman papillomavirus is a sexually-transmitted disease (STD) that results from skin-to-skin contact between genitalia. Over 150 different types of HPV exist worldwide, and while most cases of the virus disappear shortly after up to several months following transmission, a small percentage of infections can lead to genital warts or cervical, anal, oral and other cancers.\n\nOn the global scale, cervical cancer is the fourth most common type of cancer among women, with 550,000 new cases diagnosed every year, according to the World Health Organization (WHO).\n\nIn 2018, about 311,000 women died of cervical cancer, with 85 percent of deaths occurring in the developing and undeveloped world.\n\nCervical cancer is one of the leading causes of death among Mexican women, claiming 32,439 lives last year, or the equivalent of 89 per day, according to Leticia Rocha Zavaleta of the Institute of Biomedical Research at the National Autonomous University of Mexico.\n\nA dearth of sexual education and the prevalence of various stigmas and macho attitudes relating to sexual activity in Mexican society has seen unplanned pregnancies and STDs such as HPV proliferate among young women and adolescents, with girls as young as 12 contracting the disease, according to Sin Embargo.\n\nReligious groups and conservative associations continue to combat the implementation of sexual education courses by the country’s Ministry of Public Education.\n\nOne of the 29 women who was cured, Lorena Guzman, 52, explained that she had long felt the stigma of carrying the virus, “as if the only cause was sexual promiscuity” and not the need for trust, hygiene, and self-discipline between both partners.\n\nFollowing 12 months of treatment, Guzman was completely freed from HPV, which she described as a “dream come true.”\n\n“Now that tranquility has returned, I can make long-term plans and enjoy every day of my life,” she explained.\n\nProfessor Gallegos, who feels happy that she has achieved her goal “to cure women,” warned that progress in the fight against diseases is complicated by bureaucratic stalling and state budget cuts that choke off resources for the scientific community.\n\n“When there are budget cuts, the first affected are science and the arts – as if they are not necessary. I think the main problem is money and bureaucracy, these are a great burden because the process is so slow to ask for supplies and receive them. Actually, I think that (the government) should facilitate funds so that everything required for these studies arrives quickly, so we have more of a stimulus in terms of researchers and scientists.”", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2019/02/cure-vph.jpg", "url": "https://themindunleashed.com/2019/02/mexican-doctor-cure-hpv.html", "title": "Women-Led Team of Mexican Scientists Develop Cure for HPV, a Leading Cause of Cancer", "description": "Led by scientist Eva Ramon Gallegos, the team was able to eradicate HPV in 29 patients.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Health", "updated_time": "2019-02-11T21:06:03-06:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2019/02/cure-vph.jpg", "image:width": "768", "image:height": "400", "image:alt": "Women-Led Team of Mexican Scientists Develop Cure for HPV, a Leading Cause of Cancer", "image:type": "image/jpeg", "article:published_time": "2019-02-11T20:22:53-06:00", "article:modified_time": "2019-02-11T21:06:03-06:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"es\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Investigaci%C3%B3nIPN?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#InvestigaciónIPN</a> Eliminan cien por ciento virus del papiloma humano. En el marco del Día Mundial Contra el Cáncer 2019, la científica Eva Ramón Gallegos, compartió los resultados del trabajo que ha realizado durante 20 años. <a href=\"https://t.co/XrrWvtZC44\" target=\"_blank\">https://t.co/XrrWvtZC44</a> <a href=\"https://t.co/yHxQL8FOxo\" target=\"_blank\">pic.twitter.com/yHxQL8FOxo</a></p>\n<p>— IPN (@IPN_MX) <a href=\"https://twitter.com/IPN_MX/status/1092137076689035264?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">February 3, 2019</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The discovery, made by a team led by Mexican woman Eva Ramon Gallegos, could save countless lives. <a href=\"https://t.co/U5RSl3TpiI\" target=\"_blank\">pic.twitter.com/U5RSl3TpiI</a></p>\n<p>— teleSUR English (@telesurenglish) <a href=\"https://twitter.com/telesurenglish/status/1093660801213157376?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">February 8, 2019</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Worldwide, <a href=\"https://twitter.com/hashtag/CervicalCancer?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#CervicalCancer</a> remains one of the gravest threats to women's lives. </p>\n<p>We can eliminate cervical <a href=\"https://twitter.com/hashtag/cancer?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#cancer</a> as a public health problem through intensified vaccination against HPV, screening and treatment. ?<a href=\"https://t.co/4Iue1yxwLC\" target=\"_blank\">https://t.co/4Iue1yxwLC</a>  <a href=\"https://twitter.com/hashtag/WorldCancerDay?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#WorldCancerDay</a> <a href=\"https://t.co/BFE3h1GAq2\" target=\"_blank\">pic.twitter.com/BFE3h1GAq2</a></p>\n<p>— World Health Organization (WHO) (@WHO) <a href=\"https://twitter.com/WHO/status/1092400607615422465?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">February 4, 2019</a></p></blockquote>\n"], "movies": [], "links": ["https://www.eluniversal.com.mx/english/mexican-scientist-cures-human-papilloma-virus", "https://twitter.com/hashtag/Investigaci%C3%B3nIPN?src=hash&ref_src=twsrc%5Etfw", "https://t.co/XrrWvtZC44", "https://t.co/yHxQL8FOxo", "https://twitter.com/IPN_MX/status/1092137076689035264?ref_src=twsrc%5Etfw", "http://www.rguama.icrt.cu/en/mexican-scientist-discovers-cure-for-100-elimination-of-human-papillomavirus/", "https://t.co/U5RSl3TpiI", "https://twitter.com/telesurenglish/status/1093660801213157376?ref_src=twsrc%5Etfw", "https://www.publimetro.com.mx/mx/nacional/2019/02/03/mueren-89-mexicanas-al-dia-cancer-cervicouterino.html", "https://www.sinembargo.mx/08-02-2019/3532812", "https://www.eluniversal.com.mx/nacion/el-arduo-camino-para-eliminar-el-virus-del-papiloma-humano", "https://twitter.com/hashtag/CervicalCancer?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/cancer?src=hash&ref_src=twsrc%5Etfw", "https://t.co/4Iue1yxwLC", "https://twitter.com/hashtag/WorldCancerDay?src=hash&ref_src=twsrc%5Etfw", "https://t.co/BFE3h1GAq2", "https://twitter.com/WHO/status/1092400607615422465?ref_src=twsrc%5Etfw", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Elias Marat"], "publish_date": "2019-02-11T20:22:53-06:00"}