{"result_id": "301027", "URL": "https://themindunleashed.com/2020/04/restaurants-across-turn-parking-lots-into-drive-in-movie-theaters.html", "timestamp": "2023-04-25 17:30:09 CEST+0200", "meta": {"description": "Since social distancing rules began in March, restaurants across America have begun turning their parking lots into drive-in cinemas.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/04/restaurants-across-turn-parking-lots-into-drive-in-movie-theaters.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Restaurants Across the US Turn Parking Lots Into Drive-In Movie Theaters and Find Huge Success", "cleaned_text": "(TMU) — The coronavirus pandemic has put most of our social lives on hold or reduced it to a pale shadow of what it was. And for many of us, there is a definite limit to how much fun we can inject into our quarantine lifestyles through games and binge-watching Netflix.\n\nBut what if it was possible to enjoy a good date with a loved one while still respecting the physical distancing guidelines put in place to curb the spread of COVID-19?\n\nWith precisely that solution in mind—and amid a brutal economic downturn primarily slamming small businesses—restaurants across the United States have devised a novel solution that draws on American nostalgia, brings in paying clientele, while also offering a safe option for entertaining crowds.\n\nSince social distancing rules began in March, restaurants across America have begun turning their parking lots into drive-in cinemas, offering an opportunity to stir-crazy couples and families craving a social outing such as dinner and a movie.\n\nPeoples Restaurant and Lounge in Corpus Christi, Texas, is a popular eatery that has seen revenue dry up since the outbreak of the novel coronavirus.\n\nHowever, when it announced on April 18 that it would begin screening films in its parking lot—beginning with Toy Story 4—customers old and new quickly flocked back to snatch up tickets.\n\n“We are in awe on how quickly we sold out of tickets this week. The community’s response to our drive-in has really made a huge impact for us.”\n\nThe idea was a result of family brainstorming as well as a trend that has swept the U.S. and other countries in recent months.\n\n“We were having a hard time trying to stay afloat through carry-out and delivery. It was costing us more money to stay open that way.\n\n“But when one of my daughters came up with the drive-in idea, our whole family was on board and went straight to work to make it a reality.”\n\nUp north in Mingus, Texas, another restaurant also decided last month that it would be a good idea to revive drive-in theaters.\n\nIn a Facebook post, Clint Gibson, the owner of BJ’s Restaurant and Bar, announced that his restaurant would begin start films, beginning with baseball classic The Sandlot, while also offering old-school car-side service.\n\n“When the world is shutting down we have to go back to our roots for entertainment.”\n\nOver the past weekend, BJ’s also screened Tombstone and Dirty Dancing, charging $10 per vehicle while urging patrons to show up early to reserve a highly sought-after spot.\n\nMeanwhile in Arizona, Food & Wine reports that the Ajo Al’s group of Mexican restaurants set up inflatable screens in the parking lots of its various in order to screen the beloved Pixar film Coco to guests while they park their cars six feet apart and enjoy some takeout chips and queso, brisket tacos, and bean dip.\n\nAnd in Omaha, Nebraska, Tex-Mex cantina The Corner Kick brought about 35 vehicles to their parking lot when they screened the classic comedy The Three Amigos on three different screen across the side of the building.\n\nHowever, the idea of pop-up drive-in theaters has had its challenges, with some, like V Pizza in North Carolina, them being shut down for violating stay-at-home orders, while others have faced legal problems from movie studios due to licensing issues.\n\nAs Food & Wine notes, drive-in theaters first began operating in 1933, long before the polio vaccine was developed. Prior to the widespread introduction of the vaccine, drive-ins were frequently advertised to parents “who fear to expose their children or themselves to local epidemics,” and as a place where one could “be flu and polio protected.”\n\nDrive-ins had their hey-day roughly up until the 1960s, but a number of different factors—including the availability of color television, VCRs, and video rental shops—contributed to their decline.\n\nBut for Joe Gonzalez in Corpus Christi, the revival of drive-in theaters is a matter of not just entertainment or business, but hope.\n\n“We really appreciate the backing we are getting from the public right now.\n\n“This drive-in gives us the opportunity to give back to our community and help us stay open. It really makes us feel like things can really go back to normal again.”", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/04/rwerewruewrio.png", "url": "https://themindunleashed.com/2020/04/restaurants-across-turn-parking-lots-into-drive-in-movie-theaters.html", "title": "Restaurants Across the US Turn Parking Lots Into Drive-In Movie Theaters and Find Huge Success", "locale": "en_US", "description": "Nearly a century ago, drive-ins were frequently advertised to parents “who fear to expose their children or themselves to local epidemics.", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Good News", "updated_time": "2020-04-26T15:11:33-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/04/rwerewruewrio.png", "image:width": "1200", "image:height": "630", "image:alt": "Drive-In Movie Theaters", "image:type": "image/png", "article:published_time": "2020-04-26T15:07:59-05:00", "article:modified_time": "2020-04-26T15:11:33-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://themindunleashed.com/", "http://www.peoplesrestaurant.com/", "https://www.facebook.com/peoplesrestaurant1/", "https://www.facebook.com/peoplesrestaurant1/posts/10158247608300797", "https://www.caller.com/story/news/local/2020/04/24/coronavirus-things-to-do-corpus-christi-restaurant-drive-in-movie/3007949001/", "https://themindunleashed.com/2020/04/drive-in-movie-theaters-could-make-massive-comeback-as-crisis-shuts-cinemas-worldwide.html", "https://www.facebook.com/clint.gibson.35", "https://www.facebook.com/clint.gibson.35/posts/905386416550753", "https://www.facebook.com/bjsrestaurantandbar/", "https://www.facebook.com/bjsrestaurantandbar/photos/a.557401774426999/1487611538072680/?type=3", "https://www.foodandwine.com/news/restaurants-drivein-theaters?utm_source=facebook.com&utm_term=312A0B24-8590-11EA-B31B-8BF5C28169F1&utm_content=link&utm_medium=social&utm_campaign=foodandwine_foodandwine", "https://www.facebook.com/ajoalsmexicancafe/photos/a.460552453956186/3154011271276944/?type=3&theater", "https://www.facebook.com/VPizzaCary/posts/145994450227933?__xts__%5b0%5d=68.ARDWAQ1fVXu5gsNjXonX4qrx0QNB_k61H2fj1Ov41VYBd0gotnNOS3OjIzNlhDhqN9uwTM40PlzWxL1afnljbrWmmJycL3iz0rm5yX_MG2RM8GKhX1zG5BkfhcJfzNBuApj7myfq46wrgl4X_cUvvCMlxaC1Pnch6MCzMcGpWv0ULXbWsdxN8U-6loM_N1Z1ano6QUf-B35A32bbxUup6Lrf03XDDg-_DNr7SodJET1YUVWJJCNIPwNIw9jiamnKka19OtUTUDTZNMY38hf6P-HYuCOrfg5HOIX295oHiuZJt8SubNPz01mwxIdmwzeICCO2Pe3BA4WVmKPi9lIvWmE&__tn__=-R", "https://www.facebook.com/peoplesrestaurant1/videos/901057360358438/", "https://www.facebook.com/peoplesrestaurant1/", "https://www.presstelegram.com/2012/09/12/tim-grobaty-drive-in-theaters-were-a-great-place-not-to-catch-polio/", "https://themindunleashed.com/author/eliasmarat", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2020/04/restaurants-across-turn-parking-lots-into-drive-in-movie-theaters.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Elias Marat"], "publish_date": "2020-04-26T15:07:59-05:00"}