{"result_id": "301007", "URL": "https://themindunleashed.com/2020/11/we-are-going-to-have-famines-of-biblical-proportions-in-2021-un-food-agency-warns.html", "timestamp": "2023-04-25 17:29:38 CEST+0200", "meta": {"description": "The head of the United Nations World Food Program (WFP) has delivered a stark message to the world: huge populations across the globe are facing severe “famines of biblical proportions” in the near future due to the coronavirus pandemic.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/11/we-are-going-to-have-famines-of-biblical-proportions-in-2021-un-food-agency-warns.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "'We Are Going To Have Famines of Biblical Proportions in 2021,' UN Food Agency Warns", "cleaned_text": "The head of the United Nations World Food Program (WFP) has delivered a stark message to the world: huge populations across the globe are facing severe “famines of biblical proportions” in the near future due to the coronavirus pandemic.\n\nWFP head David Beasley has warned for the past several months that due to the novel coronavirus pandemic and accompanying lockdowns, nations in the developing world are faced with devastating famine and mass starvation unless action is finally taken.\n\nHowever, with countries in the developed Global North facing their own budget crises and sharp economic downturns due to the ongoing health emergency, funding for the WFP that was previously available to help alleviate hunger and avert global famine won’t be available in 2021.\n\nSpeaking to The Associated Press, Beasley noted that his agency’s staffers regularly risk their lives feeding millions of hungry people in refugee camps, conflict zones, and the sites of natural disasters, but the current global crisis makes it important for him to send “a message to the world that it’s getting worse out there … (and) that our hardest work is yet to come.”\n\nIn April, Beasley delivered a similarly urgent message to the U.N. Security Council, where he remarked that despite the breakout of the coronavirus pandemic, the world also stood “on the brink of a hunger pandemic” that could see “multiple famines of biblical proportions” within months if critical action wasn’t taken.\n\nAnd with the Nobel Peace Prize for 2020 being awarded to the World Food Program last month for its vital work providing alleviating mass hunger and boosting food security in conflict zones, Beasley has been struggling to use the win to break through the news cycle and remind people of “the travesty that we’re facing around the world.”\n\n“We were able to avert [famine] in 2020,” Beasley said, adding that the WFP needs further funding or “we are going to have famines of biblical proportions in 2021.”\n\nThe agency is currently hoping that it can get an additional $15 billion for the next year to deal with the growing scope of the crisis.\n\n“If I could get that coupled with our normal money, then we avert famine around the world,” he said.\n\nWorld leaders must be prepared for the looming disaster as well as the critical role the WFP plays. As the organization says: “Until the day we have a medical vaccine, food is the best vaccine against chaos.”\n\nIn April, Beasley warned that about 135 million people faced “crisis levels of hunger or worse” in 2020 and that the number could rise by 130 million may be pushed to the brink of starvation by next year. However, on Wednesday he told AP that the number of people facing severe, crisis-level hunger had already risen to 270 million.\n\nHe added that three dozen countries could experience critical levels of hunger or famine if the WFP isn’t given the funding it requires.\n\nAccording to a joint analysis by WFP and the U.N. Food and Agriculture Organization, these countries include Afghanistan, Burkina Faso, Cameroon, Central African Republic, Congo, Ethiopia, Haiti, Lebanon, Mali, Mozambique, Niger, Nigeria, Sierra Leone, Somali, South Sudan, Sudan, Syria, Venezuela, Zimbabwe, and Yemen.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/11/famines.jpeg", "url": "https://themindunleashed.com/2020/11/we-are-going-to-have-famines-of-biblical-proportions-in-2021-un-food-agency-warns.html", "title": "'We Are Going To Have Famines of Biblical Proportions in 2021,' UN Food Agency Warns", "description": "The head of the United Nations World Food Program (WFP) has delivered a stark message to the world: huge populations across the globe are facing severe “famines of biblical proportions” in the near future due to the coronavirus pandemic.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "News", "updated_time": "2020-11-19T02:36:00-06:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/11/famines.jpeg", "image:width": "1400", "image:height": "788", "image:alt": "famines", "image:type": "image/jpeg", "article:published_time": "2020-11-19T02:35:59-06:00", "article:modified_time": "2020-11-19T02:36:00-06:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://apnews.com/article/famine-david-beasley-nobel-prizes-coronavirus-pandemic-united-nations-f2c0e3b3d85b457a97b81c2c5fed08bd", "https://www.nobelprize.org/prizes/peace/2020/press-release/", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Elias Marat"], "publish_date": "2020-11-19T02:35:59-06:00"}