{"result_id": "301023", "URL": "https://themindunleashed.com/2017/07/shadow-people-stories-sleep-paralysis-strange-entities.html", "timestamp": "2023-04-25 17:30:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2017/07/shadow-people-stories-sleep-paralysis-strange-entities.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "\"Shadow People\": Stories of Sleep Paralysis and Strange Entities", "cleaned_text": "Have you ever heard of sleep paralysis, or people seeing shadowy figures/entities in the state of sleep paralysis?\n\nThe concept came up in my life recently when my little sister was forced to get a DTaP vaccine, and she started having some strange experiences.\n\nShe didn’t have sleep paralysis, where you wake up and can’t move (usually in a state of terror), but she saw some shadowy figures moving throughout her room. She saw her cat meow and hiss in an unusual state of terror at the shadow figures.\n\nThis interested me, and so I started to research “shadow people” and sleep paralysis.\n\nSurprisingly the phenomena is so common Wikipedia even has an article about it. According to Wiki:\n\n“A shadow person (also known as a shadow figure, shadow being or black mass) is the perception of a patch of shadow as a living, humanoid figure, particularly as interpreted by believers in the paranormal or supernatural as the presence of a spirit or other entity.\n\nA number of religions, legends, and belief systems describe shadowy spiritual beings or supernatural entities such as shades of the underworld, and various shadowy creatures have long been a staple of folklore and ghost stories.”\n\nThis reminded me of an experience I had 3 years ago. When I didn’t have a place to live in Seattle, my friend and I would sleep in the back of a truck that our friend would park for us to sleep in.\n\nOne morning, my friend got sleep paralysis and woke up unable to move next to me in the truck. He saw shadowy figures surrounding the truck, and he was filled with what he described as the worst terror he’d ever felt. Then when I sat up awake, his paralysis stopped and the entities disappeared.\n\nSo here are some other accounts I found online about “shadow people.”\n\nAccording to an anonymous comment on the forum Godlikeproductions:\n\n“The black shadow entity always pounces on me and when I try to scream for help or move I’m paralysied, but recently I am able to break out of the paralysis right before it pounces, and when I do I am just where I thought I was and was not dreaming. The whole episode lasts only a few moments, but I have trained my body to be aware of the paralysis coming on.\n\nComing out of the paraylisis is kind of hard but if I can do it so could anyone.\n\nThats why I think its not sleep paralysis my body makes to protect me from moving around while dreaming…cause I move around while dreaming, so does my girlfriend.\n\nIts induced paralysis, done by the shadow entities, and used to access my body for some reason. The shadow entities use it to subdue the “victim”.\n\nSince I have also had an “old hag experience”, where a gargoyle looking creature was sitting on my chest looking at me, and me being totally paralysied in my bed looking at it, I have come to the conclusion the shadow entities and gargole like creatures are probably the same type of “shadow animal”.\n\nFor some reason they usually only attack when I am sleeping on my back.”\n\nAccording to another comment on the thread:\n\n“Interesting topic indeed. If only I had the desire to elaborate my stories in finite detail. But I don’t. By now I have become a bit protective of my stories, especially any strange metaphysical ones. I will share a little however, as I think it may be beneficial to some. Its a bit “woo wooic” but I experienced it so in my world it is real.\n\nI used to practice OBE, starting around age 14. I became proficient at it by 16. One of the key components of OBE is a state similar to “sleep paralasis” where the body becomes so relazed it is practically numb. There are many other sensations and whatnot, but this is a part of the experience, where the experiencer disassociates themselves form the body. That part should be in bold, disassociates from the body.\n\nI know of many types of entities. These ones that you are calling Shadow Entities well your title is …inconclusive. You could more accurately define them as “Powerful men and women who know very special techniques for assuming control of a physical body of another human”. This would be a mouthful I suppose but accurate. I know I know your very evident arguement “but they are NOT men and/or women”. Once the energetic essence is capable of travel (without the corperal shell) a practitioner of such arts could form themselves into nearly any immaginable or unimmaginable shape or form.\n\nNow, I give a gift of my collected knowledge, OP you may find this very handy. When you see or suspect a nearby “strange entity or energy form” point your pinky finger at it, and in your mind (or aloud if you so choose) say “True form” with the clear intent of seeing their true form. You will see your shadow turn into a blob of “light” with a strange hue, take note of the shape and hue, humans are roundish, as are most organics… It will take them weeks to recover from this one simple maneuver (you basically “broke” their form, which they can and will repair). The entity may return, but it is unlikely, as you have made it known to them that you are not completely powerless. Also remember that the FEELING of being powerless makes you so. This could be called “the Dark side of The Secret”, the very art that governments and religious institutions use for the “benefit of humanity”.\n\nRule of thumb: Only one conciousness can have control of your vehicle at any given time. If someone steals your car, and gets into an accident, you might not be held accountable. It is not the same with your Body, as all evidence points to You.\n\nReccommendation: If you are plagued by these things, learn as much as you can about your abilities to protect yourself, shield yourself, and repel them. I prefer letting them taste, and see for themselves that I am not palatable to them at all, most people are quite tastey however!!”\n\nAccording to another comment on the same thread:\n\n“You’re not gonna find any ‘Psychology Report’ on it…\n\nBecause that shit is REAL. It ain’t no dream.\n\nI think it has to do with the time of the year and the spirit world, I believe… but that was happening frequently to me about a year ago. My experiences were somewhat different though.\n\nI’d wake up, sit up, or just open my eyes, and there would be a white mist in a corner of the ceiling in my bedroom, or “standing” in the corner by my bedroom door. They like corners. One morning, really early, I woke up to a “Person” walking across my bedroom, by the foot of my bed. I think it was a woman. But I couldn’t see the face. It was walking strangely. Almost like in the movies, just not as dramatized. And guess where the “Person” was headed? For the corner by my bedroom door. I was sitting up in bed watching it and they walked over to the corner, and just stood there facing the wall. Scared the hell out of me. I covered my head up with the blankets.\n\nThat was the worst experience. They gradually stopped happening after that.\n\nI’ve never experienced sleep paralysis. Even though I’ve been quite scared while seeing these things.\n\nI’ve never seen a black figure though. It’s usually always with the black figure that people experience sleep paralysis. And that makes sense doesn’t it?”\n\nWhat do you think about shadow people or sleep paralysis? This appears to be a very common phenomena.\n\nI’ve never personally experienced it, but it’s become very interesting to me. If you also find it interesting, research away. There is interesting info all over the internet if you search hard.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2017/07/seeeep.jpg", "url": "https://themindunleashed.com/2017/07/shadow-people-stories-sleep-paralysis-strange-entities.html", "title": "\"Shadow People\": Stories of Sleep Paralysis and Strange Entities", "description": "Have you ever heard of sleep paralysis, or people seeing shadowy figures/entities in the state of sleep paralysis? The concept came up in my life recently when my little sister was forced to get a DTaP vaccine, and she started having some strange experiences. She didn’t have sleep paralysis, where you wake up and can’t […]", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Consciousness", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2017/07/seeeep.jpg", "image:width": "994", "image:height": "562", "image:alt": "“Shadow People”: Stories of Sleep Paralysis and Strange Entities", "image:type": "image/jpeg", "article:published_time": "2017-07-19T11:46:53-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Shadow_person", "http://www.godlikeproductions.com/forum1/message317884/pg1", "http://www.godlikeproductions.com/forum1/message317884/pg1", "http://www.godlikeproductions.com/forum1/message317884/pg1", "http://www.followingthenerd.com/site/wp-content/uploads/shadowpeople.jpg", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Markab Algedi"], "publish_date": "2017-07-19T11:46:53-05:00"}