{"result_id": "301018", "URL": "https://themindunleashed.com/2022/01/thank-you-to-the-haters-joe-rogan-breaks-his-silence-on-spotify-controversy.html", "timestamp": "2023-04-25 17:29:54 CEST+0200", "meta": {"description": "Rogan apologized to those who he had unintentionally offended.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2022/01/thank-you-to-the-haters-joe-rogan-breaks-his-silence-on-spotify-controversy.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "\"Thank You To The Haters\": Joe Rogan Breaks His Silence On Spotify Controversy", "cleaned_text": "Joe Rogan finally spoke out about the controversy surrounding his podcast in a 10-minute video posted to Instagram, hours after Spotify said in a statement that it would modify its content policies – which Joe Rogan did not violate, the company clarified – and implement a “content advisory” for certain podcast episodes.\n\nRogan apologized to those who he had unintentionally offended in the video, which was a kind of frank confessional that appeared to have been shot by Rogan himself using his own phone. Then he launched into a poignant, carefully crafted explanation that gently nudged and reminded objectors about why Rogan’s show is a must-listen and a leader in the modern-day podcast gold rush.\n\nRogan requested that listeners disregard certain “disparaging” headlines that he believes distort what he is doing on the show.\n\nHe notes that both physicians have excellent credentials and have opinions on SARS-CoV-2 and how to battle it that are “different” from the dominant narrative on the virus.\n\nSome people, however, are afraid of what these two physicians have to say and assume that they are somehow directly responsible for the current COVID epidemic.\n\nThis is the problem: since the start of the pandemic, public health authorities have seen their guidance proven wrong again and again.\n\nRogan makes a similar assertion, arguing that almost every item of “misinformation” has been shown to be right later on.\n\nHe continued: 8 months or a year ago, “…if you said ‘I don’t think cloth masks work’ you would be banned from social media, now that’s openly and repeatedly stated on CNN. If you said ‘I think it’s possible COVID may have come from a lab’ you would be banned from many social media platforms – now it’s on the cover of Newsweek.”\n\nThroughout the video, Rogan maintained that he is not supporting the opinions of his guests, nor is he declaring them to be somehow accurate or immutable: he is merely examining a variety of perspectives in order to assist his audience in reaching their own conclusions.\n\nDr. Sanjay Gupta and Dr. Michael Osterholm (a member of President Biden’s COVID advisory group), among others, were mentioned by Rogan as examples of how he is interested in hearing a varied variety of perspectives and viewpoints.\n\nAs for Neil Young, Rogan joked that he’s “sure there are other things going on behind the scenes.” For example, it’s possible that Young is doing this to attempt to get a greater price for his lifetime music repertoire in advance of a sale of his estate (like Bob Dylan did).\n\nBut still, Rogan, on the other hand, asserted that he has always been a major Neil Young admirer, even relating a humorous tale about a Neil Young performance he attended while working concert security in his younger years.\n\nAs for the “interviews” he conducts with his guests, “…they are just conversations…often times I have no idea what I’m going to talk about until I sit down…that’s also the appeal of the show, it’s one of the things that makes it interesting.”\n\nToward the end of the video, Rogan said this to sum up:\n\n“I’m not trying to promote misinformation, I’m not trying to do anything controversial, I’m just trying to have regular conversations with these people.” “My pledge to you is that I will do my best to balance out these more controversial viewpoints with other people’s perspectives so that we can maybe find a better view. I don’t just want to just show the contrary opinion to what the prevailing narrative is. I want to show all kinds of opinions so that we can figure out what’s going on – and not just about COVID, about health, about fitness, wellness, the state of the world itself.\n\nAnd finally, he even thanked “the haters” for helping to keep him sharp.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2022/01/Joe-Rogan.jpeg", "url": "https://themindunleashed.com/2022/01/thank-you-to-the-haters-joe-rogan-breaks-his-silence-on-spotify-controversy.html", "title": "\"Thank You To The Haters\": Joe Rogan Breaks His Silence On Spotify Controversy", "description": "Rogan apologized to those who he had unintentionally offended.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/TheMindUnleashed", "article:section": "Opinion", "updated_time": "2023-01-12T10:57:27-06:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2022/01/Joe-Rogan.jpeg", "image:width": "1303", "image:height": "733", "image:alt": "“Thank You To The Haters”: Joe Rogan Breaks His Silence On Spotify Controversy", "image:type": "image/jpeg", "article:published_time": "2022-01-31T13:37:44-06:00", "article:modified_time": "2023-01-12T10:57:27-06:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/political/thank-you-haters-joe-rogan-breaks-silence-spotify-controversy-rejects-disinformation", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["The Mind Unleashed"], "publish_date": "2022-01-31T13:37:44-06:00"}