{"result_id": "301003", "URL": "https://themindunleashed.com/2020/03/the-worlds-fastest-supercomputer-has-been-tasked-with-finding-cure.html", "timestamp": "2023-04-25 17:29:32 CEST+0200", "meta": {"description": "The world’s smartest and fastest supercomputer is just one tool in the arsenal of those racing to find a cure for COVID-19.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/03/the-worlds-fastest-supercomputer-has-been-tasked-with-finding-cure.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "The World's Fastest Supercomputer Has Been Tasked With Finding Cure", "cleaned_text": "(TMU) — The world’s smartest and fastest supercomputer is just one tool in the arsenal of those racing to find a cure for COVID-19.\n\nThe Energy Department’s Summit supercomputer at Oak Ridge National Laboratory is being used by researchers to comb through a database of more than 8,000 existing compounds to see which combinations might prevent cell infection of COVID-19.\n\nThe research is currently ongoing, but with the help of Summit scientists have already been able to perform simulations that resulted in outputs they believe will help pave the way for experimentation that can support researchers on their quest for a cure for the novel coronavirus.\n\n“Energy in 2014 partnered with IBM, NVIDIA and Mellanox in a contract worth hundreds of millions to produce the Summit supercomputer to enhance civilian-focused scientific research, and also the Sierra supercomputer, which was designed for nuclear weapons simulations and is located at Lawrence Livermore National Laboratory. An Oak Ridge official confirmed Wednesday that Summit had not previously been used to address public health emergencies or virus outbreaks in the past. But following the speedy outbreak of the new coronavirus strain, Smith found a relevant study recently published by Chinese scientists and realized he and his team “could take their work further,” with Summit’s help.”\n\nTo infect our cells, viruses bind to “spike” proteins (S-protein), injecting their genetic substance into host cells. However, if drug compounds bind to a the spike proteins on a virus they could potentially block it from infecting humans. Unfortunately, the process of effectively narrowing down the range of drugs that could work in blocking the virus is very slow. Beyond that, each variable holds millions to billions of unique pieces of data. To make that effort faster researchers are using a supercomputer.\n\n“In any situation where time is a critical factor—for example, a health issue or a company trying to get a new product out to market—supercomputers can play a critical role through digital simulation. It would be prohibitively time-consuming for researchers to grow virus cultures and test them with the near infinite amount of molecular compounds that exist in the physical world,” IBM’s Vice President, Exascale Systems Dave Turek told Nextgov. “So supercomputers like Summit can speed up that process by digitally simulating the effect to narrow down the range of possibilities researchers can look into.”\n\nIn other words, to put the Summit supercomputer’s advanced capabilities into perspective, Turek expressed to Nextgov that “if every person on Earth completed one calculation per second, it would take 305 days to do what Summit can do in 1 second!”\n\nThe team found 77 small-molecule compounds, such as medications and natural compounds, that they suspect may be of value for experimental testing according to a press release announcement on the study.\n\nSeveral researchers have already claimed to have a vaccine for COVID-19. However, whether or not they used research from Summit is unknown. In fact, CNBC reports that there are at least nine companies working on a vaccine or treatment for COVID-19. While some have sensationally claimed to have a vaccine already developed like Medicago and Inovio Pharmaceuticals, which is backed by the Bill Gates foundation.\n\nAn Israeli research lab has also claimed to have created a vaccine or is weeks away from doing so. However, the Defense Ministry later denied those claims. Australia has also made claims to have developed a vaccine which was alleged to have been produced by researchers at the University of Queensland. And Chinese scientists claim to have developed a vaccine as well, according to China’s ambassador in Russia Zhang Hanhui, as quoted by Interfax.\n\n“The vaccine has already been developed in China; it shows the immunity [‘s capability to fight the virus]. But that’s just preliminary; one needs further checks and developments,” the diplomat said.\n\nHe also claimed that an effective medication against coronavirus was found.\n\n“The practice shows that Chinese drugs are effective. There hasn’t been a single case of complication, as long as the medicine is taken. The overall effectiveness rate of Chinese medications exceeds 85 percent [of all cases], in some areas it exceeds 90,” the Chinese diplomat said.\n\nOthers like Serum Institute the world’s largest vaccine manufacturer by volume claims that a vaccine won’t be available until 2022, a whopping two years.\n\nMeanwhile here in the U.S. health officials are claiming that testing for a coronavirus vaccine can begin within just six weeks. Which means there may be a potential promising breakthrough for a vaccine, but that doesn’t ensure safety. If all else fails there is still Summit to aid in the search for drugs that could help combat the highly infectious virus.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/03/640px-IBM_Blue_Gene_P_supercomputer.jpg", "url": "https://themindunleashed.com/2020/03/the-worlds-fastest-supercomputer-has-been-tasked-with-finding-cure.html", "title": "The World's Fastest Supercomputer Has Been Tasked With Finding Cure", "description": "The world’s smartest and fastest supercomputer is just one tool in the arsenal of those racing to find a cure for COVID-19.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Science & Tech", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/03/640px-IBM_Blue_Gene_P_supercomputer.jpg", "image:width": "640", "image:height": "424", "image:alt": "The World’s Fastest Supercomputer Has Been Tasked With Finding Cure", "image:type": "image/jpeg", "article:published_time": "2020-03-14T14:58:14-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://themindunleashed.com/", "https://newsroom.ibm.com/US-Dept-of-Energy-Brings-the-Worlds-Most-Powerful-Supercomputer-the-IBM-POWER9-based-Summit-Into-the-Fight-Against-COVID-19", "https://www.nextgov.com/emerging-tech/2020/03/researchers-oak-ridge-national-lab-tap-supercomputing-help-combat-coronavirus/163708/", "https://www.cnet.com/news/ibm-nvidia-land-325-million-supercomputer-deal/", "https://www.ornl.gov/news/ornl-launches-summit-supercomputer", "https://computing.llnl.gov/newsroom/llnl-unveils-sierra", "https://www.ornl.gov/news/early-research-existing-drug-compounds-supercomputing-could-combat-coronavirus", "https://www.marketwatch.com/story/these-nine-companies-are-working-on-coronavirus-treatments-or-vaccines-heres-where-things-stand-2020-03-06", "https://www.defenseone.com/technology/2020/03/breaking-weve-got-vaccine-says-pentagon-funded-company/163739/", "https://www.cbsnews.com/news/coronavirus-vaccine-san-diego-lab-inovio-pharmaceuticals-discovered-drug-testing/", "https://www.sandiegouniontribune.com/business/biotech/story/2020-03-12/inovio-pharm-gets-5m-from-gates-foundation-to-further-covid-19-vaccine-project", "https://www.haaretz.com/israel-news/.premium-israeli-research-center-to-announce-it-developed-coronavirus-vaccine-sources-say-1.8665074", "https://www.timesofisrael.com/defense-ministry-denies-breakthrough-on-vaccine-for-covid-19/", "https://www.tasnimnews.com/en/news/2020/02/22/2208707/australia-claims-it-developed-vaccine-for-covid-19", "https://www.interfax.ru/world/696486", "https://www.businesstoday.in/sectors/pharma/coronavirus-serum-institute-claims-covid-19-vaccine-to-be-market-ready-by-2022/story/397920.html", "https://www.cnbc.com/2020/02/25/us-health-officials-say-human-trials-on-coronavirus-vaccine-to-start-in-6-weeks.html", "https://themindunleashed.com/author/akesel1", "https://creativecommons.org/licenses/by/4.0/", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Aaron Kesel"], "publish_date": "2020-03-14T14:58:14-05:00"}