{"result_id": "301028", "URL": "https://themindunleashed.com/2020/03/covid-19-panic-hits-us-as-global-markets-implode-oil-crashes.html", "timestamp": "2023-04-25 17:30:11 CEST+0200", "meta": {"description": "Stocks plummeted on Monday as worries about the COVID-19 outbreak and an oil price war weighed on global financial markets.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/03/covid-19-panic-hits-us-as-global-markets-implode-oil-crashes.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Panic Hits US as Global Markets Implode, Oil Crashes", "cleaned_text": "(TMU) — Stocks plummeted on Monday as worries about the COVID-19 outbreak and an oil price war weighed on global financial markets. The Dow opened 1,800 points—or 7 percent—lower, the S&P 500 dropped 6.9 percent, and the Nasdaq Composite dropped 7.1 percent. The New York Stock Exchange then halted stock trading for 15 minutes after tripping a circuit breaker.\n\nThe Atlantic revealed on Friday that only 1,895 people in the United States had been tested for CoViD-19 thus far based on interviews and surveys of local data from across the country.\n\nAt least 21 people in the U.S. have died but lack of testing and conflicting reports of recent deaths are causing many people to question those numbers.\n\nTMU is continuing to stay on top of the latest coronavirus headlines and developments, summarizing the most important points for you.\n\nTwo New Yorkers that attended the American Israel Public Affairs Committee’s (AIPAC) annual conference have tested positive for CoViD-19.\n\nA Conservative Political Action Conference (CPAC) attendee has also tested positive. U.S. President Donald Trump and U.S. Vice President Mike Pence were in attendance at CPAC but reportedly had no contact with the infected person.\n\nTexas Senator Ted Cruz confirmed on Sunday that he recently interacted with someone at CPAC who tested positive for the novel coronavirus, so he’s decided to self-quarantine.\n\nArizona Congressman Paul Gosar also announced that he, along with three of his senior staff, are officially under self-quarantine after sustained contact with someone at CPAC who tested positive for CoViD-19.\n\nMeanwhile, the Massachusetts Department of Public Health announced 15 new presumptive positive CoViD-19 cases in the state, all of which had a direct connection to the Biogen employee conference in Boston late February.\n\nThe total number of CoViD-19 cases in Massachusetts is now 28.\n\nState of Emergency in US as COVID-19 Cases Explode\n\nAs we suggested last week, the New York Times is now also reporting that CoViD-19 may have spread in the U.S. for weeks already. Two cases in Washington state detected weeks apart had genetic links, suggesting that many more people are likely infected.\n\nOn Friday, the NBA told teams to prepare for the possibility of playing games without fans in attendance in the event “it were to become necessary to play a game with only essential staff present” due to the effects of the novel coronavirus.\n\nThe entire state of New York declared a state of emergency has cases jumped 72 percent in only 24 hours. At the same time New York City has asked the Centers for Disease Control and Prevention (CDC) for more CoViD-19 test kits. One city official said, “Slow federal action on this matter has impeded our ability to beat back this epidemic,” according to the New York Times.\n\nNew York City Mayor Bill de Dlasio said on Sunday, “If you are a smoker or a vaper that does make you more vulnerable.” He told New Yorkers, “If you are a smoker or a vaper this is a very good time to stop that habit and we will help you.”\n\nThe recorded U.S. death toll has risen to twenty-one as two deaths in Florida were announced on Friday and two more deaths in Washington state were announced on Sunday.\n\nIn Missouri, a father took his daughter to the school dance, disobeying a COVID-19 quarantine and prompting her school to close. The man’s family was asked to self-quarantine on Thursday, March 5, after his other daughter called the county’s health hotline and told them her symptoms.\n\nMayor Muriel Bowser announced Washington DC’s first positive case in a tweet on Saturday.\n\nCommunity spread is suspected in Arizona after the third case was discovered. The newest case is a healthcare worker with no known confirmed contacts and no travel history to areas where CoViD-19 is present.\n\nCommunity spread is likewise suspected in Chicago in what is the seventh confirmed case in the state of Illinois.\n\nChicago Department of Public Health Commissioner Dr. Allison Arwady said, “Though this may be the first case of community transmission in Chicago, it does not mean that widespread transmission of COVID-19 is happening here.”\n\nTotal U.S. cases have increased in multiple U.S. cities states over the last few days including Georgia (5 cases), Massachusetts (13 cases), San Francisco (8 cases), California (114 cases), and Iowa (3 cases).\n\nDr. Grant Colfax, director of health, said of San Francisco’s new cases:\n\nIowa Department of Health (IDPH) Medical Director and State Epidemiologist, Dr. Caitlin Pedati said:\n\nOn Sunday, health officials in Contra Costa County, California announced five new cases, four of which “did not travel or have known contact with a coronavirus case.”\n\nIn North Carolina, a hazmat decontamination tent has been put up at a hospital in Port Charlotte amid the outbreak. A supervisor at the hospital refused to confirm or deny if there is a CoViD-19 patient at the facility.\n\nNASA staff has been ordered home “until further notice” at one of its biggest facilities after an employee tested positive for CoViD-19. The space agency’s Ames Research Center went lockdown and staff have been informed that it has gone into “MANDATORY telework status effective immediately and until further notice.”\n\nA new report suggests that the US Congress could be suspended overs fears that CoViD-19 could move in on Capitol Hill. “Members are very nervous,” a senior Democratic leadership aide told NBC. ”There’s a lot of concern that members could bring it home.”\n\nCanada continues to confirm more cases while Colombia and Costa Rica both confirmed first confirmed cases of CoViD-19. Costa Rica’s confirmed case is that of a woman from the United States who is visiting the country with her husband.\n\nIn a rare bit of good news, the largest study to date coming out of Wuhan has revealed that children aged 0-10 years have 67 percent lower odds of a severe infection than adults aged 20-40. And women appear to have 11 percent lower odds of severe infection than men.\n\nBut compared to adults age 20-40, adults age 40-60 have 44 percent higher odds of a severe infection and the odds only get worse from there.\n\nDoctors in Italy are warning Europe of the devastating impact CoViD-19 will have on hospitals. Doctors have warned medics to “get ready” in a letter that states up to 10 percent of those infected need intensive care, resulting in overwhelmed hospitals. As of Saturday, 5,883 patients in Italy were confirmed to be infected while 233 people had died.\n\nThe Italian Society of Anesthesia, Analgesia, Resuscitation and Intensive Care said in a document titled Recommendations of clinical ethics for admission to intensive treatments and for their suspension, in exceptional conditions of imbalance between needs and available resources:\n\nThe World Health Organization (WHO) continues to urge countries to follow China’s drastic containment measures.\n\nA grim analysis suggests that all hospital beds in the United States will be filled by May 8 in what is expected to be a complete overwhelming of the U.S healthcare system.\n\nOfficials in Iran are expecting CoViD-19 to infect 40 percent of the capital city’s population in the next two weeks while yet another Iranian official has fallen ill and died due to the virus.\n\nNational Nurses United (NNU) recently released survey results indicating the U.S. is “wildly unprepared” for the coronavirus. Only 44 percent of those polled (out of 6,500) reported having been provided information on “how to recognize and respond to possible cases” of the coronavirus by their employer.\n\nTMU has been in contact with a nurse in Michigan who claims patients with clear signs of CoViD-19 are being refused testing and simply sent home. The nurse has since been alerted that they had been exposed to the virus, despite there being no confirmed cases in the state. The nurse is being denied a test as well.\n\nA leaked presentation reveals that U.S. hospitals are preparing for millions of hospitalizations due to the outbreak. The February 26 presentation titled What healthcare leaders need to know: Preparing for the COVID-19 included representatives from National Ebola Training and Education Center and suggested there may be up to 96 million cases in the United States, 4.8 million hospitalizations, and 480,000 deaths.\n\nOn Thursday, a residential street in Rocklin, California was placed under quarantine after a resident with CoViD-19 died. “Law enforcement partners are currently responding to enforce a health officer’s order. We cannot share any additional information to protect patient confidentiality,” Katie Pritchard, Placer County Health Spokesperson, said.\n\nRocklin Police were unable to answer questions from TMU or provide an update. Instead they are referring all inquiries to Placer County.\n\nItaly has announced a massive quarantine of the entire region of Lombardy until April 3. Also in Italy, one of the most powerful politicians in the country, Democratic Party leader Nicola Zingarelli, tested positive for the virus. The massive quarantine provoked panic and triggered stock markets to plunge 11 percent.\n\nItalians who attempt to flee the quarantine may face three months’ in prison, Italy’s interior minister has warned.\n\nThe Italian military airlifted a coronavirus patient between hospitals in Lombardy on Saturday, using a special bio-containment unit to reduce the risk of infecting other people.\n\nIn France, the government has banned gatherings of more than 1,000 people nationwide. “The priority is to do all we can to slow the transmission of the virus,” health minister Olivier Veran said.\n\nThe British government announced on Monday it had set up a team to tackle “interference and disinformation” around the COVID-19 outbreak. The counter-disinformation team will try to establish the impact of false information aimed at misleading people “either for the purposes of causing harm, or for political, personal or financial gain.” The team will then aim to identify and respond to the disinformation.\n\n“Defending the country from misinformation and digital interference is a top priority,” Digital and Culture Minister Oliver Dowden said in a statement. “This work includes regular engagement with the social media companies, which are well placed to monitor interference and limit the spread of disinformation, and will make sure we are on the front foot to act if required.”\n\nThe Philippines declared a health emergency on Monday amid growing anxiety that CoViD-19 is already spreading undetected.\n\nIn Saudi Arabia, images security forces have quarantined the Qatif province and restricted traffic in it.\n\nThe office of Portugal’s 71-year-old president announced on Sunday that President Marcelo Rebelo de Sousa has canceled all public activities and will self-quarantine at home amid the CoViD-19 outbreak. His office said that the president had no symptoms.\n\nJapan is set to alter a law this week allowing Prime Minister Shinzo Abe to declare a state of emergency over the COVID-19 outbreak if needed. Critics of Abe have called out his initial lack of leadership.\n\nAnd in China, a hotel being used to house people in quarantine collapsed in the city of Quanzhou. At least ten people were killed and others remain missing.\n\nAn infectious diseases expert at the forefront of the search for a coronavirus vaccine said on Friday that it was the most “frightening disease” he’s ever encountered, and that “war is an appropriate analogy” for what the U.S. is facing, as “50-70% of the global population” may become infected.\n\nDr. Richard Hatchett sat on the White House Homeland Security Council in 2005-2006 and was a principal author of the National Strategy for Pandemic Influenza Implementation Plan. He currently leads the Coalition for Epidemic Preparedness Innovations.\n\nHe feels this way “because of the combination of infectiousness, and a lethality that appears to be many-fold higher than the flu.”\n\nPlease continue to check TMU for important updates and follow along with the very latest news on Telegram.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/03/iruewoiruwieor.png", "url": "https://themindunleashed.com/2020/03/covid-19-panic-hits-us-as-global-markets-implode-oil-crashes.html", "title": "Panic Hits US as Global Markets Implode, Oil Crashes", "description": "Stocks plummeted on Monday as worries about the outbreak and an oil price war weighed on global financial markets.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/emma.fiala.7", "article:section": "News", "updated_time": "2020-03-09T16:09:14-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/03/iruewoiruwieor.png", "image:width": "1200", "image:height": "630", "image:alt": "COVID-19 Panic", "image:type": "image/png", "article:published_time": "2020-03-09T09:58:14-05:00", "article:modified_time": "2020-03-09T16:09:14-05:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Important Update: Coronavirus </p>\n<p>As emailed to Policy Conference attendees, participants, speakers, administration and Hill offices.<a href=\"https://t.co/0mkWeuRErA\" target=\"_blank\">https://t.co/0mkWeuRErA</a> <a href=\"https://t.co/EHl694pkgJ\" target=\"_blank\">pic.twitter.com/EHl694pkgJ</a></p>\n<p>— AIPAC (@AIPAC) <a href=\"https://twitter.com/AIPAC/status/1236056463740735488?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 6, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Important Health Notification for CPAC 2020 participants and attendees. <a href=\"https://t.co/NtahNO8st3\" target=\"_blank\">pic.twitter.com/NtahNO8st3</a></p>\n<p>— ACU (@ACUConservative) <a href=\"https://twitter.com/ACUConservative/status/1236415113265102852?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 7, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">1. I am announcing that I, along with 3 of my senior staff, are officially under self-quarantine after sustained contact at CPAC with a person who has since been hospitalized with the Wuhan Virus.  My office will be closed for the week.</p>\n<p>— Paul Gosar (@DrPaulGosar) <a href=\"https://twitter.com/DrPaulGosar/status/1236821135964004352?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 9, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Late this afternoon, testing at the Public Health Lab at the DC Department of Forensic Sciences yielded its first presumptive positive coronavirus (COVID-19) case. Join me live at 7:30 p.m. for a briefing at the John A. Wilson Building.</p>\n<p>— Mayor Muriel Bowser (@MayorBowser) <a href=\"https://twitter.com/MayorBowser/status/1236422174958895104?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 7, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">CHILDREN’ RISK vs ADULTS: Children 0-10 years old have 67% lower odds of severe infection compared to Adults (age 20-40), Odds Ratio=0.33 (95%CI: 0.14-0.82) according to the largest study to date in Wuhan of 25,961 lab ? positive <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#COVID19</a> cases. This is very good news. <a href=\"https://t.co/US0RD6Rtbc\" target=\"_blank\">https://t.co/US0RD6Rtbc</a> <a href=\"https://t.co/inFd8hk4r0\" target=\"_blank\">pic.twitter.com/inFd8hk4r0</a></p>\n<p>— Eric Feigl-Ding (@DrEricDing) <a href=\"https://twitter.com/DrEricDing/status/1236853299736989696?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 9, 2020</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"Panic Hits US as Global Markets Implode, Oil Crashes!\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/y-vRUpQOpQQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/y-vRUpQOpQQ?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"Coronavirus patient transported in bio-containment unit\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/vAAzbLGSUO0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/vAAzbLGSUO0?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"Coronavirus expert: 'War is an appropriate analogy'\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/dcJDpV-igjs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/dcJDpV-igjs?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"The Mind Unleashed Tackles Today's BIGGEST STORY!\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/3eAtKrIt00U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/3eAtKrIt00U?feature=oembed"}], "links": ["https://themindunleashed.com/", "https://www.theatlantic.com/health/archive/2020/03/how-many-americans-have-been-tested-coronavirus/607597/", "https://www.aljazeera.com/news/2020/03/coronavirus-death-toll-reaches-19-york-declares-emergency-200308064614290.html", "https://t.co/0mkWeuRErA", "https://t.co/EHl694pkgJ", "https://twitter.com/AIPAC/status/1236056463740735488?ref_src=twsrc%5Etfw", "https://t.co/NtahNO8st3", "https://twitter.com/ACUConservative/status/1236415113265102852?ref_src=twsrc%5Etfw", "https://www.axios.com/ted-cruz-coronavirus-self-quarantine-0c85ef4e-8022-43c9-9196-ab2d43db3aba.html", "https://www.azfamily.com/news/continuing_coverage/coronavirus_coverage/arizona-congressman-paul-gosar-self-quarantines-after-contact-with-coronavirus/article_88c2d488-61a5-11ea-9235-6b8e08e4c3b0.html", "https://twitter.com/DrPaulGosar/status/1236821135964004352?ref_src=twsrc%5Etfw", "https://www.wcvb.com/article/massachusetts-health-officials-announce-15-new-presumptive-coronavirus-cases-all-connected-to-biogen-conference/31274340", "https://www.nytimes.com/2020/03/01/health/coronavirus-washington-spread.html", "https://www.si.com/nba/2020/03/07/nba-coronavirus-fans-impact-games", "https://www.nytimes.com/2020/03/07/nyregion/coronavirus-new-york-queens.html", "https://www.nytimes.com/2020/03/06/nyregion/coronavirus-new-york.html", "https://sg.news.yahoo.com/smoking-vaping-increases-risks-those-022927038.html", "https://www.kgw.com/article/news/health/coronavirus/seven-new-coronavirus-cases-found-in-oregon-governor-declares-state-of-emergency/283-5458942c-2f5a-4ffe-b5ec-f5d977afa46e", "https://www.usatoday.com/story/news/health/2020/03/08/coronavirus-live-updates-grand-princess-cruise-ship-bound-oakland/4953496002/", "https://www.nbcmiami.com/news/local/2-dead-in-florida-2-test-presumptive-positive-for-covid-19-in-broward-county/2201904/", "https://www.aljazeera.com/news/2020/03/coronavirus-death-toll-reaches-19-york-declares-emergency-200308064614290.html", "https://www.kmov.com/news/local-school-cancels-classes-after-learning-student-is-sister-of/article_41ec34a4-6179-11ea-b3e3-6fbf809e7778.html", "https://twitter.com/MayorBowser/status/1236422174958895104?ref_src=twsrc%5Etfw", "https://www.maricopa.gov/CivicAlerts.aspx?aid=1015", "https://wgntv.com/news/coronavirus/7th-case-of-covid-19-confirmed-in-chicago/", "https://www.usnews.com/news/best-states/georgia/articles/2020-03-07/kemp-3-more-cases-of-covid-19-found-in-georgia", "https://www.bostonglobe.com/2020/03/07/nation/five-new-cases-coronavirus-reported-bringing-mass-total-12/", "https://www.sfchronicle.com/bayarea/article/Virus-concerns-leave-thousands-stranded-off-coast-15113601.php", "https://www.nbcnews.com/health/health-news/live-blog/coronavirus-updates-live-1st-case-confirmed-washington-d-c-u-n1152416", "https://ktiv.com/2020/03/08/iowa-confirms-3-cases-of-coronavirus/", "https://www.kron4.com/health/coronavirus/5-new-coronavirus-cases-reported-in-contra-costa-county/", "https://www.nbc-2.com/story/41867319/hazmat-decontamination-tent-set-up-at-fawcett-memorial-hospital-in-port-charlotte", "https://www.independent.co.uk/news/world/americas/nasa-coronavirus-ames-research-center-staff-a9387346.html", "https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-congress-ted-cruz-paul-gosar-quarantine-cpac-a9386632.html", "https://bc.ctvnews.ca/6-new-cases-of-covid-19-in-b-c-including-2-long-term-care-home-residents-1.4843279", "https://sputniknews.com/latam/202003061078497873-colombia-confirms-first-case-of-coronavirus/", "https://www.usnews.com/news/world/articles/2020-03-06/costa-rica-confirms-first-coronavirus-case-in-central-america", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://t.co/US0RD6Rtbc", "https://t.co/inFd8hk4r0", "https://twitter.com/DrEricDing/status/1236853299736989696?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/news/health/coronavirus-italy-doctors-intensive-care-deaths-a9384356.html", "https://www.news1.news/u/2020/03/coronavirus-intensive-care-doctors-in-lombardy-timely-actions-or-disastrous-health-calamity-the-access-priority-hypothesis-whoever-has-the-most-chance-of-survival-first.html", "https://www.who.int/news-room/detail/07-03-2020-who-statement-on-cases-of-covid-19-surpassing-100-000", "https://themindunleashed.com/2020/03/all-hospital-beds-in-the-us-will-be-filled-by-may-8th-according-to-analysis.html", "https://english.alarabiya.net/en/views/news/middle-east/2020/03/05/Coronavirus-to-infect-up-to-40-of-Tehran-s-population-within-next-two-weeks.html", "https://www.straitstimes.com/world/middle-east/iranian-mp-dies-from-coronavirus-tasnim-news-agency", "https://www.theguardian.com/world/2020/mar/06/us-coronavirus-outbreak-nurses-cdc", "https://www.businessinsider.com/presentation-us-hospitals-preparing-for-millions-of-hospitalizations-2020-3", "https://sacramento.cbslocal.com/video/4473394-placer-county-health-issues-health-officers-order-on-rocklin-street/", "https://www.wibw.com/content/news/-Police-enforced-quarantine-hits-Calif-residential-block-after-mans-coronavirus-death--568561901.html", "https://www.theguardian.com/world/2020/mar/07/italy-set-to", "https://www.jpost.com/International/Leader-of-Italys-co-ruling-democratic-party-tests-positive-to-coronavirus-620096", "https://www.cnbc.com/2020/03/09/italys-quarantine-provokes-panic-italian-stocks-plunge.html", "https://www.cnn.com/2020/03/09/europe/coronavirus-italy-lockdown-intl/index.html", "https://sg.news.yahoo.com/france-bans-large-gatherings-coronavirus-033926581.html", "https://sg.news.yahoo.com/britain-sets-team-tackle-coronavirus-034251026.html", "https://www.straitstimes.com/asia/se-asia/coronavirus-philippines-declares-health-emergency-amid-fears-of-community-spread", "https://english.iswnews.com/12132/deploying-of-saudi-army-in-the-qatif-province/", "https://www.mercurynews.com/2020/03/08/portugals-president-self-isolates-amid-virus-outbreak/", "https://www.channelnewsasia.com/news/asia/coronavirus-covid-19-japan-shinzo-abe-emergency-12517574", "https://www.independent.co.uk/news/world/asia/china-hotel-collapse-coronavirus-quarantine-fujian-province-death-latest-a9384546.html", "https://themindunleashed.com/2020/03/covid-19-outbreak-6-breaking-news-stories-you-need-to-know.html", "https://themindunleashed.com/2020/03/covid-19-update-five-things-you-need-to-know-today.html", "https://themindunleashed.com/2020/03/us-botching-covid-19-testing-outbreak-spreads-22-states.html", "https://t.me/s/covid19report", "https://themindunleashed.com/author/emmafiala", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2020/03/covid-19-panic-hits-us-as-global-markets-implode-oil-crashes.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Emma Fiala"], "publish_date": "2020-03-09T09:58:14-05:00"}