{"result_id": "301015", "URL": "https://themindunleashed.com/2017/04/elon-musk-promises-human-human-machine-telepathy-neuralink.html", "timestamp": "2023-04-25 17:29:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2017/04/elon-musk-promises-human-human-machine-telepathy-neuralink.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Elon Musk Promises Human to Human (and to Machine) Telepathy with Neuralink", "cleaned_text": "As if solar-powered homes, and cars, and gigawatt factories along with his Space X ventures weren’t enough already, billionaire entrepreneur Elon Musk has another outlandish plan for humanity – a wizard-hat you might say, for our brains. Tesla and Space X are already redefining humanity’s future, but Neuralink, a platform that would use futurist technology to augment our brains could alter our world even more.\n\nWith a 36K explainer showing us exactly how Neuralink supported brain-hacking will work, Elon Musk has laid out plans to bring us to the future in a few short years. Among other claims, Neuralink promises to make human to human telepathy possible. This news makes some very excited, but others are wary. Is Neuralink going to be bigger and better than Tesla, and Space X combined, or is it a sneaky ploy to convince us to embrace a transhumanist future?\n\nMusk has already laid the groundwork for this endeavor by saying that artificial intelligence (AI) is smarter than us, and thereby dangerous, so we must become cyborgs to some degree ourselves to survive. He is arguing that we must merge with machines to continue human civilization. Sounds about as transhumanist as it gets, but before we assume the worst, let’s dive a little deeper into Neuralink.\n\nMusk’s concept is shared with sci-fi writers like Iain M. Banks in his novels about a galactic civilization. The Defense Advanced Research Projects Agency (DARPA) is also investing at least $60 million over the next four years to develop implantable neural interface technology. This program called the Neural Engineering System Design (NESD), aims to “dramatically enhance research capabilities in neurotechnology and provide a foundation for new therapies,” at least according to DARPA’s website.\n\nMusk’s Neuralink works much like the sci-fi version. In the sci-fi version, a mesh-like device called neural lace would be implanted in a person directly through their bloodstream, controlling the release of certain neurons that control thought.\n\nIn Musk’s version, the neural lace seems to allow AI to work symbiotically with the human brain – some argue — allowing human consciousness to take precedence over any AI over-ride.\n\nSignals would be picked up and transmitted wirelessly, but without any interference of our natural neurological processes. Essentially, it would be like the movie Limitless on steroids – instead of a pharmaceutical upgrade, it would be a digital brain upgrade. For instance, imagine writing and sending texts just using your thoughts.\n\nNanotechnology experts have already developed an ultra-fine mesh of electronics that can seamlessly merge with the brain, but there are also PSI experiments showing that human beings can already communicate telepathically without any AI interference and technological enhancement. Declassified documents have shown that the government has extensively studied human telepathy, telekinesis and other “woo-woo” abilities, proving that these are not mere contrivances of wishful thinkers, but actual traits which are already inherent within us.\n\nThis brings us to the transhumanist vs. transcendental argument which has now become more important than ever.\n\nFirstly, any AI technology can be manipulated to control the end-user. We’ve already learned that the deep state is using current technologies like our cell phones, computers, and televisions to guide our thinking, if not outright brainwash us, and spy on us, so it begs the question whether we should trust technology companies, even those with seemingly good intentions like Elon Musk’s Neuralink, to “hack” into our brains.\n\nSecondly, person-to-person telepathy is a birthright, some would argue, that has been deeply suppressed by dumbing-down our past heritage, clogging us up with brain-altering pharmaceuticals, toxins in vaccines, GMO foods, pesticides, herbicides, fluoridated water, etc. It is a documented fact that the pineal gland, the tiny gland located in the center of the brain is responsible for telepathic communication.\n\nIf this gland is calcified beyond recognition due to our environmental conditions, many of us who might already be showing high-level mastery of telepathy will not do so. We’ve basically been given a light lobotomy. Brain hacking has already happened, you might say, and not for the better.\n\nMany ancient traditions have taught that we don’t need any AI or fancy technology to tap into the “tech” that already exists within us. As we raise our conscious awareness, not only can we communicate with others seamlessly, we can even influence material reality.\n\nThe Yoga Sutras specifically mention obtaining powers called “siddhis” which include clairvoyance, clairaudience, telepathy between people, and telepathy between animals, for instance.\n\nThere also exists a text known as the Nine Yin Manual, that is a compilation of numerous scrolls and ancient scriptures pertaining to psychic powers, healing techniques, martial arts classics and Taoist philosophy. It was compiled by Huang Shang (黃裳) on the commission of Emperor Huizong during the Song Dynasty.\n\nThe ancient shamans of the Aboriginal culture could speak not only with people using telepathy but with spirit entities. You can read texts which are direct translations of accounts provided in the Aboriginal language by three Central Australian shamans, referred to commonly as “traditional healers” or “clever people” in Aboriginal English and as ngangkari in the native Pitjantjatjara.\n\nThese are but a few of the many esoteric texts which humanity must heed before accepting the transhumanist agenda to become a cyborg.\n\nBefore we agree to having entities like DARPA, or even Musk insert nanotech AI in us, shouldn’t we revisit the wisdom of our ancient past? This might save us from another possibility – that once we become human-machine cyborgs, we will have made humanism – truth, beauty, liberty, and equality – completely obsolete. It is a mistake to think we can augment ourselves without humility and grace, no matter how advanced our material technology.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2017/04/Screen-Shot-2017-04-25-at-10.31.05-PM.png", "url": "https://themindunleashed.com/2017/04/elon-musk-promises-human-human-machine-telepathy-neuralink.html", "title": "Elon Musk Promises Human to Human (and to Machine) Telepathy with Neuralink", "description": "As if solar-powered homes, and cars, and gigawatt factories along with his Space X ventures weren’t enough already, billionaire entrepreneur Elon Musk has another outlandish plan for humanity – a wizard-hat you might say, for our brains. Tesla and Space X are already redefining humanity’s future, but Neuralink, a platform that would use futurist technology to […]", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/TheMindUnleashed/", "article:section": "News", "updated_time": "2017-04-26T15:46:29-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2017/04/Screen-Shot-2017-04-25-at-10.31.05-PM.png", "image:width": "1916", "image:height": "1076", "image:alt": "Elon Musk Promises Human to Human (and to Machine) Telepathy with Neuralink", "image:type": "image/png", "article:published_time": "2017-04-25T22:32:57-05:00", "article:modified_time": "2017-04-26T15:46:29-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ft.com/content/64e70fac-155e-11e7-b0c1-37e417ee6c76", "http://waitbutwhy.com/2017/04/neuralink.html", "https://en.wikipedia.org/wiki/Transhumanism", "http://www.wired.co.uk/article/elon-musk-humans-must-become-cyborgs", "http://io9.gizmodo.com/354739/welcome-to-the-culture-the-galactic-civilization-that-iain-m-banks-built", "http://www.darpa.mil/news-events/2015-01-19", "http://www.darpa.mil/program/neural-engineering-system-design", "https://en.wikipedia.org/wiki/Limitless_(film)", "https://wearechange.org/elon-musks-transhumanist-agenda-neuralink-create-cyborgs/", "http://www.nature.com/nnano/journal/v10/n7/full/nnano.2015.115.html", "http://www.wakingtimes.com/2016/12/02/declassified-document-suggests-thousands-may-superhuman-powers/", "http://ourultimatereality.com/telepathy-telekinesis-and-clairvoyance.html", "https://www.gaia.com/article/pineal-third-eye-chakra", "http://medicinal-foods.com/pineal-awakening-protocol/", "https://www.bookish.com/articles/can-yoga-give-you-superpowers-this-expert-thinks-so/", "https://en.wikipedia.org/wiki/Emperor_Huizong_of_Song", "https://en.wikipedia.org/wiki/Song_Dynasty", "http://www.multidimensionalevolution.com/blog/category/aboriginal-australia-psychic-phenomena", "https://forums.theregister.co.uk/forum/1/2009/06/29/darpa_machine_reading_bbn/#c_525957", "http://www.brainwaveinc.com/video/video-8frames.gif", "https://i0.wp.com/highstrangenessshow.com/wp-content/uploads/2013/08/fajb_brain_hacking_01_sep2012.gif", "http://money.cnn.com/2017/03/28/technology/musk-neuralink-brains-computers-ai/", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Christina Sarich"], "publish_date": "2017-04-25T22:32:57-05:00"}