{"result_id": "301008", "URL": "https://themindunleashed.com/2019/06/leaked-documents-google-pinterest-censorship-alternative-media.html", "timestamp": "2023-04-25 17:29:39 CEST+0200", "meta": {"description": "Newly leaked documents from Google and Pinterest reveal ongoing efforts to censor independent media, Christian websites, and unpopular opinions.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2019/06/leaked-documents-google-pinterest-censorship-alternative-media.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Leaked Documents From Google and Pinterest Reveal Censorship of Alternative Media", "cleaned_text": "Newly leaked documents from Google and Pinterest reveal ongoing efforts to censor independent media, Christian websites, and unpopular opinions.\n\n(TMU) — As more and more Americans question the practices of tech companies like Google, Facebook, and Amazon, the topic of censorship on social media and in search results continues to be a hotly debated topic. Do these companies essentially act as publishers, and if so, should they be regulated as such? Should the government make efforts to break up the tech giants? These questions and more need answering as the public grapples with the reality that “Big Tech” is gaining more control over what we see, hear, and read while surfing the internet.\n\nNow, more fuel has been added to the fire as the controversial conservative investigative outlet Project Veritas has released leaked documents which show Pinterest blocking links of alternative media websites and search terms related to Christianity and abortion. The apparent blacklist is part of a “porn domain block list” designed to keep the social media platform free of sexually explicit content. Veritas published the internal documents and reportedly interviewed a company insider who claimed Pinterest directly and indirectly censors content related to pro-life and Christian themes, as well as alternative health sites, and several independent news websites known for challenging the U.S. government narrative on a range of topics, including the War on Terror. These sites include ZeroHedge, The Anti-Media, NewsWars (operated by Alex Jones’ Infowars), The PedoGate, Tracking Vaccinations, and Organic Healthy Tips.\n\nOther documents leaked to Project Veritas include a large text file titled “Sensitive Terms List” containing search terms that Pinterest considers “sensitive.” A user searching one of these “sensitive” terms will received modified search results per Pinterest internal policy. The documents note that search terms are assigned an “abusive,” “sensitive,” and “brand unsafe” value. Pinterest employees have the option to either block auto-complete results in the search bar, show the user a warning, or remove the term from recommended or trending feeds. The so-called “Sensitive Terms List” reveals that Christianity-related terms like “christian easter” and “bible verses” were marked as “brand unsafe.”\n\nThis is not the first time Pinterest made the news for censoring certain material. In February, the platform also blocked searches related to “anti-vaccination” material.\n\nHowever, the company is not alone in their efforts to remove unpopular opinions and alternative media from their platforms. One day after Project Veritas‘ report, the Daily Caller reported that a whistleblower within Google leaked screenshots of two apparent blacklists of websites which are being scrubbed from the search engine’s results. The Daily Caller reviewed documents and found that employees are instructed to add the line “# REMOVE url” to ensure that a “fringe” website is removed from Google’s “featured snippets” search results. The “featured snippets” feature is responsible for finishing users sentences when they type questions into Google’s search box. The document suggests that the removal of certain websites from featured snippets is being conducted manually by a human employee rather than the result of a mistake by an algorithm or artificial intelligence.\n\nThe Caller also reports that a second blacklist, called “all_fringe_domains,” is designed to block websites labeled “fringe.” Some of the websites being blocked include “the American Spectator, Breitbart, Breaking911, the website of pastor Brian Jones, the website of Bring Your Bible to School Day, Consortium News (published by Robert Parry), St. Philip the Deacon Lutheran Church, speakerryan.com, The Franklin Society (a cryptocurrency blog), Free Thought Project, The Gateway Pundit, and The Gorka Briefing”.\n\nThe leaked documents reported on by the Daily Caller and Project Veritas raise a number of questions regarding how much control and influence the Big Tech giants have over public discourse. Even more worrisome is the fact that websites like the Free Thought Project, the Anti-Media, and ZeroHedge have been facing waves of censorship for over a year, with both the Anti-Media and the Free Thought Project being purged from Facebook in October 2018.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2019/06/tertretretret.jpg", "url": "https://themindunleashed.com/2019/06/leaked-documents-google-pinterest-censorship-alternative-media.html", "title": "Leaked Documents From Google and Pinterest Reveal Censorship of Alternative Media", "description": "Newly leaked documents from Google and Pinterest reveal ongoing efforts to censor independent media, Christian websites, and unpopular opinions.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "News", "updated_time": "2019-06-15T23:13:08-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2019/06/tertretretret.jpg", "image:width": "1200", "image:height": "630", "image:alt": "Leaked Documents From Google, Pinterest Reveal Censorship of Alternative Media", "image:type": "image/jpeg", "article:published_time": "2019-06-13T00:10:42-05:00", "article:modified_time": "2019-06-15T23:13:08-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://themindunleashed.com", "https://www.projectveritas.com/2019/06/11/tech-insider-blows-whistle-on-how-pinterest-listed-top-pro-life-site-as-porn-bible-verses-censored/", "http://zerohedge.com", "http://theantimedia.com", "https://www.wsj.com/articles/next-front-in-tech-firms-war-on-misinformation-bad-medical-advice-11550658601", "https://dailycaller.com/2019/06/11/revealed-two-google-blacklists-fringe-domains-special-search-results/", "http://consortiumnews.com", "http://thefreethoughtproject.com", "https://themindunleashed.com/2018/10/facebook-attack-independent-media.html", "https://themindunleashed.com/author/derrickbroze1", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2019/06/leaked-documents-google-pinterest-censorship-alternative-media.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Derrick Broze"], "publish_date": "2019-06-13T00:10:42-05:00"}