{"result_id": "301004", "URL": "https://themindunleashed.com/2019/11/new-virus-kill-cancer.html", "timestamp": "2023-04-25 17:29:33 CEST+0200", "meta": {"description": "The virus is vased on cowpox, and scientists hope that successes in lab tests on mice could translate into similar success treating cancer in humans.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2019/11/new-virus-kill-cancer.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Potential Breakthrough as Scientists Create New Virus That Could Kill Every Type of Cancer", "cleaned_text": "CORRECTION: a previous version of this article stated that the new virus kills “every type of cancer,” but a recent fact-check by Health Feedback found that the Daily Mail published false, misleading information. The new treatment has actually only been tested on certain cancer cells, namely pancreatic, lung, colon and breast cancer cells. We have updated the headline.\n\n(TMU) — A new cowpox-style virus has been created by scientists that has shown huge potential in the fight to defeat cancer.\n\nCalled CF33, the virus was developed by Australian company Imugene and has already shown success defeating every type of cancer tested so far in a petri dish while shrinking actual tumors in mice.\n\nThe treatment is being engineered by U.S. cancer expert Prof. Yuman Fong, who is hoping that successes in lab tests on mice could translate into similar success treating humans.\n\nImugene will be targeting patients with triple-negative breast cancer, melanoma, lung cancer, bladder, gastric, and bowel cancer, according to the Daily Telegraph.\n\nThis isn’t the first time that a virus has been used against cancer. Indeed, the very ability of viruses to infect and kill human cells reveals some of their potential in treating cancer.\n\nA genetically engineered herpes virus has been used to treat types of skin cancer and cowpox itself—a virus originating in bovine udders—provided the basis for smallpox vaccines used to treat humans.\n\nAnd now cowpox is being used in CF33 to treat cancer.\n\n“There was evidence that viruses could kill cancer from the early 1900s when people vaccinated against rabies had their cancer disappear, they went into remission. The problem was if you made the virus toxic enough to kill cancer you were worried it would also kill man.”\n\nFong hopes that his new formula will be able to help humans beat back cancerous tumors.\n\nIn human trials, the virus will be directly injected into the tumors in hopes that it will multiply and eventually kill it.\n\nHowever, experts are urging caution before Fong’s treatment is hailed as some major new breakthrough that will be ready for medical use in the near future.\n\n“When it is tested in a human we will see whether the immune system mounts a defense against the virus and knocks it off before it gets to the cancer or there could be nasty side effects. Cancer cells are very clever, they are true Darwinians that mutate to survive and there is a likelihood they will evolve to become resistant to the virus as they do now to become resistant to chemotherapy and immunotherapy.”", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2019/11/new-virus-kill-cancer.png", "url": "https://themindunleashed.com/2019/11/new-virus-kill-cancer.html", "title": "Potential Breakthrough as Scientists Create New Virus That Could Kill Every Type of Cancer", "description": "Scientists hope that successes in lab tests on mice will translate into similar success treating humans.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:section": "Science & Tech", "updated_time": "2019-11-26T11:43:28-06:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2019/11/new-virus-kill-cancer.png", "image:width": "740", "image:height": "410", "image:alt": "New Virus Kill Cancer", "image:type": "image/png", "article:published_time": "2019-11-08T15:37:04-06:00", "article:modified_time": "2019-11-26T11:43:28-06:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://healthfeedback.org/evaluation/daily-mail-article-misleads-with-clickbait-headline-claiming-cowpox-derived-virus-will-kill-every-type-of-cancer-zoe-zaczek/", "https://themindunleashed.com/", "https://www.dailytelegraph.com.au/human-trials-to-begin-next-year-using-a-virus-to-kill-cancer/news-story/f38cd02d2652a2ff3ae90a51b4893423", "https://themindunleashed.com/author/eliasmarat", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2019/11/new-virus-kill-cancer.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Elias Marat"], "publish_date": "2019-11-08T15:37:04-06:00"}