{"result_id": "301024", "URL": "https://themindunleashed.com/2016/10/ongoing-syrian-war-causes-first-withdrawal-from-bill-gates-doomsday-seed-vault.html", "timestamp": "2023-04-25 17:30:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2016/10/ongoing-syrian-war-causes-first-withdrawal-from-bill-gates-doomsday-seed-vault.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Ongoing Syrian War Causes First Withdrawal from Bill Gates’ Doomsday Seed Vault", "cleaned_text": "Deep in the Arctic half way between mainland Norway and the North Pole rises an ominous, glowing trapezoid that looks like something out of a sci-fi movie. It isn’t an alien structure, but the Svalbard Global Seed Vault, a doomsday project funded by some very suspect institutions: The Rockefeller Foundation, Monsanto, Syngenta, and the Bill and Melinda Gates Foundation, among others, with the Gates’ pouring in a $30 million dollar investment alone.\n\nStarting from 2015, the Syrian war brought the first withdrawal from the seed vault. Previously no withdrawals were made of the over 83,000 seed varieties said to be kept within the vault. The ongoing war meets the promoted purpose of the vault – as Cary Fowler, the former director of the Global Crop Diversity Trust has said, the ostensible goal of this system is to preserve crop diversity in regions plagued by war and civil turmoil.\n\nResearchers apparently asked to withdraw seeds that they had previously deposited into the bank. The withdrawn seeds were sought to replace plant material stored in a gene bank near the war-torn city of Aleppo in Syria.\n\nOthers claim that the seed vault is meant to force genetically altered crops on areas that are already agriculturally vulnerable – largely through the machinations of the same cabalistic groups that helped to fund the seed bank originally.\n\nAs Russia, a nation which has eschewed genetically modified seed for fear of harming its nations’ health and environment, readies a missile system for Syria’s Port of Tartus, we have to wonder what investors like Bill Gates, Syngenta, DuPont/Pioneer Hi-Bred, and the soon-to-be-bought-out-by-Bayer; Monsanto, stand to gain from turmoil in Syria and other nations.\n\nSome argue the seed vault is part of a depopulation agenda, along with other Gates’ projects. This claim comes in part because there are already other seed banks scattered around the world. Moreover, as detailed in Seeds of Destruction,\n\n“. . . in 1960 the Rockefeller Foundation, John D. Rockefeller III’s Agriculture Development Council and the Ford Foundation joined forces to create the International Rice Research Institute (IRRI) in Los Baños, the Philippines.1 By 1971, the Rockefeller Foundation’s IRRI, along with their Mexico-based International Maize and Wheat Improvement Center and two other Rockefeller and Ford Foundation-created international research centers, the IITA for tropical agriculture, Nigeria, and IRRI for rice, Philippines, combined to form a global Consultative Group on International Agriculture Research (CGIAR). CGIAR was shaped at a series of private conferences held at the Rockefeller Foundation’s conference center in Bellagio, Italy. Key participants at the Bellagio talks were the Rockefeller Foundation’s George Harrar, Ford Foundation’s Forrest Hill, Robert McNamara of the World Bank and Maurice Strong, the Rockefeller family’s international environmental organizer, who, as a Rockefeller Foundation Trustee, organized the UN Earth Summit in Stockholm in 1972. It was part of the foundation’s decades long focus to turn science to the service of eugenics, a hideous version of racial purity, what has been called The Project.”\n\nTo wit, the commonly used term ‘genetic’ engineering is a re-coined term for eugenics, the idea put forth by Sir Francis Galton that more ‘smart’ people should have children, while the rest of us troglodytes should use as much birth control as they can throw at us. The term means ‘well-born,’ and it has come to be embraced by individuals like Bill Gates, family (Bill Gates Sr.) started Planned Parenthood to further this ideology. Only recently the Gates Foundation gave $117 million to two of the largest abortion businesses and also used 30,000 indigenous Indian girls to test Merck’s questionable HPV vaccine Gardasil, later being sued by the Indian government for killing several of them, and injuring many more.\n\nThis same eugenicist plan has been heavily financed by the Rockefeller Foundation, also responsible for starting the “Green Revolution,” which Vandava Shiva has utterly debunked.\n\nIt does seem odd that the same corporations and foundations that have funded GM terminator seeds (the Gates Foundation has been heavily invested in Monsanto) would also be interested in “protecting seed diversity” by storing copious numbers of seeds in a vault in the middle of nowhere. These same companies have also contributed to agricultural unrest, and their seeds have contaminated heirloom and indigenous seed varieties that are thousands of years old – seeds that have withstood drought, war, floods, and many political regimes.\n\nThis unholy alliance stands in direct opposition to anything that would protect seed diversity. As the war in Syria rages on, what other withdrawals will we observe, and at what point will these institutions start to reveal their true aims for creating the Svalbard Seed Bank?", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2016/10/doomsss.jpg", "url": "https://themindunleashed.com/2016/10/ongoing-syrian-war-causes-first-withdrawal-from-bill-gates-doomsday-seed-vault.html", "title": "Ongoing Syrian War Causes First Withdrawal from Bill Gates’ Doomsday Seed Vault", "description": "Deep in the Arctic half way between mainland Norway and the North Pole rises an ominous, glowing trapezoid that looks like something out of a sci-fi movie. It isn’t an alien structure, but the Svalbard Global Seed Vault, a doomsday project funded by some very suspect institutions: The Rockefeller Foundation, Monsanto, Syngenta, and the Bill […]", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/TheMindUnleashed/", "article:section": "News", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2016/10/doomsss.jpg", "image:width": "728", "image:height": "380", "image:alt": "Ongoing Syrian War Causes First Withdrawal from Bill Gates’ Doomsday Seed Vault", "image:type": "image/jpeg", "article:published_time": "2016-10-06T10:42:06-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.croptrust.org/about-crop-trust/donors/", "http://theantimedia.org/why-are-bill-gates-and-monsanto-funding-a-doomsday-seed-vault/", "http://www.livescience.com/52291-first-withdrawal-doomsday-seed-vault.html", "http://www.sciencemag.org/news/2015/05/new-film-traces-cary-fowler-s-quest-build-doomsday-seed-vault", "http://www.huffingtonpost.com/entry/global-seed-vault-svalbard-syria_us_560152ebe4b00310edf87694", "http://www.bbc.com/news/world-middle-east-37557138", "http://eugenicsanddepopulation.blogspot.com/2008/01/doomsday-seed-vault-in-arctic-bill.html", "http://exhibits.hsl.virginia.edu/eugenics/2-origins/", "https://en.wikipedia.org/wiki/William_H._Gates_Sr.", "http://www.lifenews.com/2014/06/16/gates-foundation-gave-117-million-to-the-two-biggest-abortion-businesses/", "http://ireport.cnn.com/docs/DOC-1170073", "http://truthstreammedia.com/2014/01/12/how-the-rockefeller-foundations-quietly-funded-the-anti-fertility-vaccine/", "http://www.trabal.org/courses/pdf/greenrev.pdf", "http://articles.mercola.com/sites/articles/archive/2011/03/05/wikileaks-exposes-unholy-alliance-of-us-government-bill-gates-and-monsanto.aspx", "http://eugenicsanddepopulation.blogspot.com/2008/01/doomsday-seed-vault-in-arctic-bill.html", "https://www.theguardian.com/science/2015/may/20/the-doomsday-vault-seeds-save-post-apocalyptic-world", "http://www.activistpost.com/2015/06/why-are-bill-gates-and-monsanto-funding.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Christina Sarich"], "publish_date": "2016-10-06T10:42:06-05:00"}