{"result_id": "301025", "URL": "https://themindunleashed.com/2019/12/sexual-exploitation-epidemic-in-england-as-nearly-19000-children-identified-as-victims.html", "timestamp": "2023-04-25 17:30:06 CEST+0200", "meta": {"description": "In the past year, nearly 19,000 children have been sexually groomed in England, according to official numbers. But some say the real figure is much higher.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2019/12/sexual-exploitation-epidemic-in-england-as-nearly-19000-children-identified-as-victims.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Sexual Exploitation ‘Epidemic’ in England as Nearly 19,000 Children Identified as Victims", "cleaned_text": "(TMU) — There’s a new official epidemic in England and it can’t be tackled with increased hand washing or a new vaccine. In the past year, nearly 19,000 children have been sexually groomed, according to official numbers. But some say the real figure is much higher.\n\nFive years ago, 3,300 suspected victims of child sexual exploitation were identified by authorities. That number rose to a shocking 18,700 in 2018-2019.\n\nGrooming was not officially recorded as an assessment factor during referral to social care until 2013.\n\nSarah Champion, the Labour MP for Rotherham, told the Independent that the grooming of children “remains one of the largest forms of child abuse in the country.”\n\n“Too many times, government has said it will ‘learn lessons’, yet 19,000 children are still at risk of sexual exploitation. The government has singularly failed to tackle this issue head on. Its approach has been piecemeal and underfunded.”\n\nAccording to the Independent, the Home Office has begun an analysis of data regarding the cases and will use the results to inform new policy and prevention strategies, but the Queen’s Speech did not mention anything about a public review.\n\nThe Independent also reports that investigations into grooming gangs are ongoing throughout the country. In fact, abusers in Huddersfield have already been jailed.\n\nWoodhouse, who isn’t surprised by the newly released numbers, helped expose a sandal in 2012 that involved the abuse of an estimated 1,500 victims.\n\n“I still hear a lot about the authorities aren’t doing things as they should. It’s not very often I hear something good and for all different reasons—if the police won’t act on reports, people feel they’re not being listened to or supported properly, or information not being shared,” Woodhouse explained.\n\nWoodhouse also noted the likelihood that many victims won’t report what is or has happened to them.\n\nSimon Bailey, the National Police Chiefs’ Council lead for child protection, says officers are “doing all we can to pursue and prosecute criminals who exploit and abuse young people” but that “more must be done to stop abuse happening in the first place.” Bailey suggests “honest conversations, education, and appropriate safeguarding.”\n\nA spokesperson for the Home Office said:\n\n“The Home Office is committed to tackling child sexual abuse and will leave no stone unturned in tackling this abhorrent behavior. This is why we launched the Independent Inquiry into Child Sexual Abuse to get to the truth, expose what has gone wrong and learn lessons for the future. The inquiry operates independently of government and, within its terms of reference, decides for itself what it investigates. The inquiry is investigating institutional responses to child sexual exploitation by organized criminal networks with public hearings set for the spring of 2020.”\n\n“We cannot allow grooming to fall out of the spotlight, because sexual exploitation always flourishes in the shadows,” Champion contends.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2019/12/ewurewoiurewoi.png", "url": "https://themindunleashed.com/2019/12/sexual-exploitation-epidemic-in-england-as-nearly-19000-children-identified-as-victims.html", "title": "Sexual Exploitation ‘Epidemic’ in England as Nearly 19,000 Children Identified as Victims", "description": "In the past year, nearly 19,000 children have been sexually groomed, according to official numbers. But some say the real figure is much higher.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/emma.fiala.7", "article:section": "News", "updated_time": "2019-12-29T14:14:25-06:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2019/12/ewurewoiurewoi.png", "image:width": "1200", "image:height": "630", "image:alt": "England", "image:type": "image/png", "article:published_time": "2019-12-29T14:13:39-06:00", "article:modified_time": "2019-12-29T14:14:25-06:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://themindunleashed.com/", "https://www.independent.co.uk/news/uk/home-news/grooming-child-sex-abuse-exploitation-rotherham-rochdale-police-a9215261.html", "https://www.independent.co.uk/news/uk/home-news/grooming-child-sex-abuse-exploitation-rotherham-rochdale-police-a9215261.html", "https://themindunleashed.com/author/emmafiala", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2019/12/sexual-exploitation-epidemic-in-england-as-nearly-19000-children-identified-as-victims.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Emma Fiala"], "publish_date": "2019-12-29T14:13:39-06:00"}