{"result_id": "301022", "URL": "https://themindunleashed.com/2020/03/grim-reality-in-us-quarantines-emergencies-lockdowns-deaths.html", "timestamp": "2023-04-25 17:30:01 CEST+0200", "meta": {"description": "A total of 17 U.S. states have now declared states of emergency or made disaster declarations due to the COVID-19 outbreak.", "lang": "en", "keywords": "", "favicon": "https://themindunleashed.com/wp-content/uploads/2020/06/cropped-2022-32x32.jpg", "canonical": "https://themindunleashed.com/2020/03/grim-reality-in-us-quarantines-emergencies-lockdowns-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "themindunleashed.com", "title": "Grim Reality in US Emerges: Quarantines, Emergencies, Lockdowns, Deaths", "cleaned_text": "(TMU) — According to the map of global CoViD-19 cases provided by the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University (JHU), the total number of confirmed cases in the United States is 808 while the total cases worldwide has climbed to 118,101. The map indicates that there are 4,262 deaths worldwide with 29 occurring in the U.S.\n\nThe map uses data from WHO, CDC, ECDC, NHC, DXY, and local media reports. The map is only as accurate as the data coming from these organizations and local media. It is important to remember that only those patients who are tested can be confirmed and thus accounted for in the data.\n\nAt least 17 U.S. states have now declared states of emergency or made disaster declarations including New Jersey, Oregon, California, New York, Washington, Kentucky, Maryland, Ohio, North Carolina, Massachusetts, Florida, Colorado, Illinois, Rhode Island, Iowa, Pennsylvania, and Indiana.\n\nThe CDC is warning that people over 60 in addition to those with underlying health conditions such as diabetes, heart disease, and lung disease, take precautions including reducing travel and stocking up on food and medications.\n\nThe World Health Organization (WHO) has finally said that the coronavirus is starting to look like a “real pandemic.” Dr. Tedros Adhanom Ghebreyesus said on Monday that WHO is “encouraged” by Italy’s quarantine.\n\nPlease continue to check TMU for important updates and follow along with the very latest news on Telegram.\n\nLack of Testing in US Still a Major Concern\n\nThe state of Colorado has thus far tested 184 people for CoViD-29, with 12 cases identified.\n\nDespite recent announcements from U.S. Vice President Mike Pence during a Coronavirus Task Force press briefing at the White House on Monday in which he said “testing is now available in all state labs in every state in the country” and that more than “a million tests have been distributed,” the Kirkland Life Care Center just outside of Seattle remains unable to test its workers.\n\nThe nursing home said on Monday that it had no kits to test its employees that are showing symptoms, more than a third of the nursing home’s 180 employees.\n\nSpokesman Tim Killian said, “We would like more kits to test employees.” Adding, “We’ve been asking the various government agencies that have been supplying us with test kits.”\n\nA first responder has told CNN that none of the Life Care Center’s 200 employees have been tested despite 65 of them showing symptoms and that test kits from first responders have been held up so long at a overwhelmed lab that they have now expired.\n\nDuring the briefing at the White House, Pence revealed that he has not yet been tested for CoViD-19 despite recently attending a conference with a person who has had a positive test. Pence also indicated he did not know whether or not U.S. President Donald Trump had been tested.\n\nGlobal COVID-19 Cases to Multiply by 10 Every 19 Days\n\nAccording to a study out of China, global CoViD-19 cases “will increase tenfold every 19 days if no drastic measures are taken to contain its spread.” The researchers said, “The situation is dangerous … we call on the world to take strong actions on public health, using experiences learned from China and Singapore.”\n\nAnother Chinese study has found that the novel coronavirus can travel twice as far as the “safe distance” previously advised by world health authorities. According to the study, the virus can travel nearly 15 feet and can linger in the air for 30 minutes. They also found that the virus can last for days on surfaces where respirator droplets have landed. According to the study, it can last for two to three days on surfaces like glass, metal, plastic, paper, and fabric at around 98ºF.\n\nHowever, the South China Morning Post now notes that the study was retracted by the journal Practical Preventative Medicine without explanation in what is a perfect example of the confusing, conflicting, and constantly changing news and research surrounding both the novel coronavirus and CoViD-19.\n\nDr. Nancy Messonnier, director of the CDC’s National Center for Immunization and Respiratory Diseases, said Monday during a news conference, “China describes this as being highly contagious, and there essentially is no immunity against this virus in the population because it’s a new virus,” indicating that the virus does indeed warrant a two-week quarantine.\n\nMessonnier also said, “It’s fair to say that as the trajectory of the outbreak continues, many people in the United States either this year or next year will be exposed to this. And there is a good chance many will become sick.”\n\nBut even a 14-day quarantine may not suffice in some cases. According to the Baltimore Sun, “There will be people who develop symptoms and remain contagious after being released from the 14-day quarantine.” And that number may be around 101 people for every 10,000 cases.\n\nDr. Dean Sidelinger, a public health officer with the Oregon Health Authority said at a press conference on Monday:\n\nAuthorities in Oregon expect the number of cases to increase as testing becomes more widely available.\n\nCanada has reported the country’s first death has their total infected rises to 79.\n\nIt has become apparent that the coronavirus spreads easily and rapidly in contained environments, from conferences to nursing homes to cruise ships.\n\nAs of Monday, eight cases of CoViD-19 have been confirmed in the state of Iowa. Seven of the eight cases are located in Johnson County and are all seven of those individuals traveled on the same cruise in Egypt, known as both the NS River Anuket or Asara, according to authorities. A disaster proclamation has been declared in the state, as the results of 11 tests remain pending. 67 people are being monitored by health officials.\n\nA Taiwanese-American tourist who was a passenger on the cruise was the first to be confirmed positive after returning to Taiwan.\n\nIt was reported on March 5 that the Grand Princess cruise ship had 3,533 people on board including 2,422 passengers and 1,111 crew members. On March 6, Vice President Pence reported that 46 tests were run which revealed 19 crew members and 2 passengers to be positive. On March 7, a critically ill passenger and a passenger traveling with that person were airlifted off the ship.\n\nThe Grand Princess docked in Oakland, California on Monday after being held off the coast of California for days. Filmmaker and area resident Robbie Martin visited the docking as news helicopters filmed the scene from above.\n\nMartin got as close to ship as possible and was surprised to find no visible U.S. government officials or significant activity outside of what was happening immediately next to the ship. No Oakland City Council members or representatives were present and there appeared to be no plans for a press conference or briefing from government officials dealing with the disembarking of passengers. Martin indicated that the area was surprisingly unsecure.\n\nA third Princess cruise ship is now being kept at sea, according to the Independent. The Caribbean Princess was schedule to dock on Monday in Grand Cayman but passengers and crew will first be required to undergo testing before disembarking. Two crew members on the Caribbean Princess transferred from the Grand Princess, sparking concern that the novel coronavirus may now be spreading throughout the ship.\n\nThe number of positive cases of CoViD-19 associated with the Biogen conference that was held in Boston in February continues to increase. More than two dozen people from around the country who attended the conference have now tested positive.\n\nGrim Reality in US: From Preparations to Spread\n\nMartin Makary, a renowned Johns Hopkins surgeon, researcher and policy expert, told CNBC on Tuesday, “What happened in Wuhan could happen here. Why do we think otherwise?” Makary pointed out that the immune system of the average American is “not stronger than the Chinese immune system.”\n\nTwo years ago, U.S. President Donald Trump ordered the shutdown of the White House National Security Council’s global health security unit. The president has struggled to justify this decision amidst the coronavirus pandemic.\n\nAnd in 2018, Rear Admiral Timothy Ziemer, Senior Director for Global Health Security and Biodefense at the National Security Council starting in April 2017, was responsible for leading pandemic preparedness and response efforts but abruptly left the position. Following his departure, the team he oversaw was disbanded by then national security adviser John Bolton, as TMU previously reported.\n\nRegardless of what actions have been taken since the emergence of the novel coronavirus, it is becoming quite clear the the United States was already ill-prepared for dealing with anything of this nature.\n\nAccording to the Independent, U.S. health officials are suggesting that hospitals in the U.S. need to at least double their available beds in order to deal with the expected surge of patients who will need in patient care. Health officials report that there are fewer than 100,000 intensive care beds available in the U.S. while the American Hospital Associate puts that number at 45,000.\n\nIt is estimated that upwards of 865,000 people will require hospitalization if the outbreak proves to be moderate while 9.9 million will require hospitalization in the event it is severe.\n\nUC San Francisco Medical Center is preparing by setting up two outdoor tents to care for patients with respiratory symptoms, according to the SF Gate.\n\nNew Jersey’s first coronavirus case is speaking out about his experience that he says “happened so quick.” The 32-year-old has been hospitalized since Tuesday after first going to urgent care. James Cai says he has experienced “Dirarrhea, watery eyes, shortness of breath, chest pain, you name it. High fever,” he said. “Every day is getting worse.”\n\nCai’s doctor believes he contracted the virus while attending a medical conference in New York City’s Times Square.\n\nThe nursing home at the center of Washington state’s outbreak is reporting grim news of the virus’ effect on some patients who have died.\n\nTim Killian, the Life Care Center’s press liaison claims, “some residents go from no symptoms to death in just a matter of a few hours.”\n\n“It was surprising and shocking to us that we have seen that level of escalation from symptoms to death.”\n\nIn an attempt to find a vaccine, UK researchers are looking for volunteers willing to be infected with the virus. They will be offered £3,500 for their trouble.\n\nThe entire country of Italy is now under lockdown as the country struggles to contain the outbreak. There are now more than 10,000 confirmed cases and 631 deaths.\n\nAs a result, the movement of more than 60 million people has been restricted. The decree bans all public events, closes cinemas, theaters, gyms, clubs, bars, funerals, weddings, and all sporting events, including Series A matches. All schools and universities will remain closed until April 3.\n\nTuesday morning Mongolia announced the barring of anyone from entering of leaving its cities for six days after also announcing the country’s very first case. Mongolia had already sealed its border with China and banned flights from South Korea. Despite those efforts, an employee of a French energy company who flew in from Moscow was confirmed to be infected.\n\nNew York City Mayor Bill de Blasio suggested a citywide quarantine akin to what happened in northern Italy may be appropriate for the city.\n\n“It’s a possibility but I think people are getting a little ahead of ourselves and we should be careful,” he said Monday on CNN.\n\nIn a Monday press conference the governor of New York said that the state will begin making 100,000 gallons of hand sanitizer a week that will be given to schools, prisons, government agencies, and the MTA. Prisoners will make the hand sanitizer.\n\nThe New York National Guard was deployed on Tuesday to a health department command post in New Rochelle.\n\nThe governor of Washington said on Tuesday that the entire state of more than 7.5 million people may need to be quarantined due to the outbreak. Governor Jay Inslee said that cases may increase to 64,000 in less than two months if action isn’t taken. The quarantine would include mandatory restrictions on travel, according to KOMO. The state would expand unemployment benefits to assist those unable to work.\n\nIsrael is requiring that anyone arriving in the country self-quarantine for 14 days. Prime Minister Benjamin Netanyahu said in a tweet, “All those coming to Israel from abroad will be placed in isolation for 14 days.” Interior Minister Aryeh Deri reports that the measure is effective immediately.\n\nMoscow is now on “high alert” and is threatening 5 years of jail time for people who fail to self-isolate for two weeks after visiting countries experiencing outbreaks including China, South Korea, Iran, France, Germany, Italy, and Spain.\n\nOfficials in the U.S. state of Georgia have designated a state park as a potential location for isolating and monitoring people who have been exposed to coronavirus. And the largest county in Georgia has cancelled school after an employee tested positive.\n\nWhat to Expect During a Global Pandemic\n\nImages and viral videos of empty planes are popping up across social media as the novel coronavirus continues to impact the travel industry.\n\nAn epidemiologist in Washington is warning, “It is likely that people you know will die from CoViD-19.”\n\nThe U.S. Military has cancelled military exercises and is quarantining ships as the virus spreads. The Pentagon has reportedly been planning how to continue operations in the event CoViD-19 spreads amongst its employees.\n\nU.S. officials are reportedly worried about the drug supply chain as China continues to suffer the effects of the pandemic. “Basically we’ve outsourced our entire industry to China,” retired Brig. Gen. John Adams told NBC.\n\nAuthor Rosemary Gibson, who wrote a book on this very subject, explained, “If China shut the door on exports of medicines and their key ingredients and raw material, U.S. hospitals and military hospitals and clinics would cease to function within months, if not days.”\n\nNew York, San Francisco, and Seattle are all showing lower weekend traffic than average in the midst of the global pandemic.\n\nPearl Jam has cancelled their upcoming scheduled tour due to the CoViD-19 outbreak in Seattle.\n\nThe band said, “Having no examples of our national health department’s ability to get ahead of this, we have no reason to believe that it will be under control in the coming weeks ahead.”\n\nPrinceton has told students to stay home after spring break as classes go virtual and Harvard has told students to move out of their dorms by Sunday at 5 pm.\n\nThe campaigns of Bernie Sanders and Joe Biden said on Monday that they were consulting with health experts about the risk posed by the virus. In response to the question of holding rallies in the midst of a pandemic, Sanders said, “We do not hold a rally without first conferring with local public health officials,” and Biden said, “I’m looking to the CDC for advice on that.” Trump reportedly has no plans to cancel rallies.\n\nOn Tuesday, the Sanders campaign cancelled and upcoming rally in Cleveland, Ohio, saying they would evaluate all future events on a case by case basis.\n\nThe death toll in Iran surges as reports indicate medical staff is unable to get the equipment needed. A nurse told the Independent, “we do not have the most basic personal and disinfectant protection.” Iran is currently under sanctions from the U.S. government.\n\nAnd in a positive development, South Korea’s infection rate is falling despite not implementing massive lockdowns. The fall is being attributed to widespread and easily accessible testing and the use of advanced technology.\n\nAt the same time China is offering to send Italy lung ventilators, face masks, protective suits, and test kits to assist in their fight against the novel coronavirus.\n\nPlease continue to check TMU for important updates and follow along with the very latest news on Telegram.", "opengraph": {"type": "article", "image": "https://themindunleashed.com/wp-content/uploads/2020/03/grim-reality-covid-19.png", "url": "https://themindunleashed.com/2020/03/grim-reality-in-us-quarantines-emergencies-lockdowns-deaths.html", "title": "Grim Reality in US Emerges: Quarantines, Emergencies, Lockdowns, Deaths", "description": "A total of 17 U.S. states have now declared states of emergency or made disaster declarations due to the COVID-19 outbreak.", "locale": "en_US", "site_name": "The Mind Unleashed", "article:publisher": "https://www.facebook.com/TheMindUnleashed/", "article:author": "https://www.facebook.com/emma.fiala.7", "article:section": "News", "updated_time": "2020-03-11T16:37:24-05:00", "image:secure_url": "https://themindunleashed.com/wp-content/uploads/2020/03/grim-reality-covid-19.png", "image:width": "740", "image:height": "410", "image:alt": "Grim Reality COVID-19", "image:type": "image/png", "article:published_time": "2020-03-10T16:47:26-05:00", "article:modified_time": "2020-03-11T16:37:24-05:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">LIVE: Daily media briefing on <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#COVID19</a> with <a href=\"https://twitter.com/DrTedros?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">@DrTedros</a> <a href=\"https://twitter.com/hashtag/coronavirus?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#coronavirus</a> <a href=\"https://t.co/cN3WfNcsyd\" target=\"_blank\">https://t.co/cN3WfNcsyd</a></p>\n<p>— World Health Organization (WHO) (@WHO) <a href=\"https://twitter.com/WHO/status/1237049051058561024?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 9, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">2/ Those 7 firefighters now must be re-tested and remain in quarantine/isolation longer.  </p>\n<p>The first responder also says that they are being told by Life Care Center that none of the nearly 200 employees from Life Care have been tested. (65 employees reportedly have symptoms.)</p>\n<p>— Jake Tapper (@jaketapper) <a href=\"https://twitter.com/jaketapper/status/1237452362823983106?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 10, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">?OMG. The top WH official responsible for preparedness &amp; response to a deadly <a href=\"https://twitter.com/hashtag/pandemic?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#pandemic</a> quit, and the global health security team he oversaw was DISBANDED by then-NSA John Bolton in *May 2018*.<a href=\"https://twitter.com/thespybrief?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">@thespybrief</a><br/>h/t <a href=\"https://twitter.com/911CORLEBRA777?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">@911CORLEBRA777</a> <a href=\"https://twitter.com/hashtag/coronavirus?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#coronavirus</a> <a href=\"https://twitter.com/hashtag/2019_nCov?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#2019_nCov</a> <a href=\"https://t.co/BwpRSHFgAY\" target=\"_blank\">https://t.co/BwpRSHFgAY</a></p>\n<p>— Dena Grayson, MD, PhD (@DrDenaGrayson) <a href=\"https://twitter.com/DrDenaGrayson/status/1221852065972006912?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">January 27, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">This man was one of only a handful of passengers aboard a flight to France because of coronavirus fears — so he did the worm down the aisle <a href=\"https://t.co/kzlUmBLf22\" target=\"_blank\">pic.twitter.com/kzlUmBLf22</a></p>\n<p>— NowThis (@nowthisnews) <a href=\"https://twitter.com/nowthisnews/status/1237408623069761536?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 10, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">(1/10) As residents of the city of Seattle, we’ve been hit hard and have witnessed firsthand how quickly these disastrous situations can escalate. Our kids’ schools have closed along with universities and businesses. <a href=\"https://t.co/SRcZasIVsk\" target=\"_blank\">pic.twitter.com/SRcZasIVsk</a></p>\n<p>— Pearl Jam (@PearlJam) <a href=\"https://twitter.com/PearlJam/status/1237181665501425664?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 10, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">INBOX: Citing <a href=\"https://twitter.com/hashtag/Covid19?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#Covid19</a> concerns, Senator Bernie Sanders cancels rally scheduled for tonight in Cleveland. </p>\n<p>\"All future Bernie 2020 events will be evaluated on a case by case basis,\" the campaign says in a press release. <a href=\"https://t.co/KNaKQSSgM9\" target=\"_blank\">pic.twitter.com/KNaKQSSgM9</a></p>\n<p>— Adam Klasfeld (@KlasfeldReports) <a href=\"https://twitter.com/KlasfeldReports/status/1237478570823426049?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 10, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">China to the rescue of Italy- “Chinese government has offered to send Italy 1000 lung ventilators, 2 million face masks, 20,000 protective suits and 50,000 test kits.” <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">#COVID19</a> <a href=\"https://t.co/C8uu3Qgsu8\" target=\"_blank\">pic.twitter.com/C8uu3Qgsu8</a></p>\n<p>— Eric Feigl-Ding (@DrEricDing) <a href=\"https://twitter.com/DrEricDing/status/1237435123072667649?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 10, 2020</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"A Grim Reality in US Emerges!\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/WMSvF_pzABw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/WMSvF_pzABw?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"Princess Cruise docking Oakland live\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/M8qogBTLs3k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/M8qogBTLs3k?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"WATCH LIVE: Grand Princess cruise ship to dock in Oakland amid coronavirus concerns\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/35dAw5_EM_A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/35dAw5_EM_A?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "740", "height": "416", "embed_code": "<iframe loading=\"lazy\" title=\"More passengers disembark from Grand Princess\" width=\"740\" height=\"416\" src=\"https://www.youtube.com/embed/_RX36qBaq7A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/_RX36qBaq7A?feature=oembed"}], "links": ["https://themindunleashed.com/", "https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.ecdc.europa.eu/en/geographical-distribution-2019-ncov-cases", "http://www.nhc.gov.cn/xcs/yqtb/list_gzbd.shtml", "https://3g.dxy.cn/newh5/view/pneumonia?scene=2&clicktime=1579582238&enterid=1579582238&from=singlemessage&isappinstalled=0", "https://www.independent.co.uk/news/world/americas/coronavirus-usa-cases-how-many-map-total-new-york-death-toll-a9388666.html", "https://philadelphia.cbslocal.com/2020/03/09/coronavirus-new-jersey-officials-announce-5-new-presumptive-positive-coronavirus-cases-bringing-total-to-11/", "https://www.portlandmercury.com/blogtown/2020/03/09/28113055/good-morning-news-coronavirus-puts-oregon-in-state-of-emergency-shutters-italy-and-quarantines-ted-cruz", "https://www.latimes.com/california/newsletter/2020-03-05/coronavirus-cruise-emergency-newsletter", "https://www.nytimes.com/2020/03/07/nyregion/coronavirus-new-york-queens.html", "https://www.governor.wa.gov/news-media/inslee-issues-covid-19-emergency-proclamation", "https://www.courier-journal.com/story/news/2020/03/06/what-is-state-of-emergency-coronavirus/4974968002/", "https://governor.maryland.gov/2020/03/05/governor-larry-hogan-declares-state-of-emergency-expands-statewide-response-to-novel-coronavirus/", "https://www.dispatch.com/news/20200309/coronavirus-what-does-state-of-emergency-mean-for-ohio", "https://thehill.com/policy/healthcare/state-issues/486853-north-carolina-gov-declares-state-of-emergency-over", "https://www.nbcboston.com/news/local/gov-baker-to-speak-on-states-coronavirus-preparedness/2088681/", "https://www.fox35orlando.com/news/gov-ron-desantis-declares-state-of-emergency-amid-coronavirus-spread-in-florida", "https://www.thedenverchannel.com/news/national/coronavirus/colorado-governor-declares-state-of-emergency-to-increase-covid-19-testing-implement-paid-sick-leave", "https://chicago.cbslocal.com/2020/03/09/coronavirus-disaster-declaration-governor-jb-pritzker-11-cases-four-new-covid-19/", "https://www.providencejournal.com/news/20200309/raimondo-declares-state-of-emergency-in-ri-over-coronavirus", "https://kwwl.com/2020/03/09/kim-reynolds-signs-disaster-proclamation-due-to-the-coronavirus/", "https://www.governor.pa.gov/newsroom/gov-wolf-signs-covid-19-disaster-declaration-to-provide-increased-support-for-state-response/", "https://www.abc57.com/news/governor-declares-public-health-emergency-with-indianas-first-coronavirus-case", "https://www.businessinsider.com/cdc-americans-over-60-stock-up-on-groceries-stay-home-2020-3", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/DrTedros?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/coronavirus?src=hash&ref_src=twsrc%5Etfw", "https://t.co/cN3WfNcsyd", "https://twitter.com/WHO/status/1237049051058561024?ref_src=twsrc%5Etfw", "https://t.me/s/covid19report", "https://www.denverpost.com/2020/03/09/colorado-coronavirus-testing-2/", "https://www.whitehouse.gov/briefings-statements/remarks-president-trump-vice-president-pence-members-white-house-coronavirus-task-force-press-briefing/", "https://www.channelnewsasia.com/news/world/coronavirus-covid-19-seattle-nursing-home-united-states-12520678", "https://twitter.com/jaketapper/status/1237452362823983106?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-trump-mike-pence-cpac-testing-a9389221.html", "https://www.scmp.com/news/china/science/article/3074080/coronavirus-global-infections-could-increase-tenfold-every-19", "https://www.scmp.com/news/china/science/article/3074351/coronavirus-can-travel-twice-far-official-safe-distance-and-stay", "https://www.baltimoresun.com/coronavirus/bs-hs-coronavirus-incubation-period-20200309-7zxjr4t5qzez3pumbahgwxoksq-story.html", "https://www.baltimoresun.com/coronavirus/bs-hs-coronavirus-incubation-period-20200309-7zxjr4t5qzez3pumbahgwxoksq-story.html", "https://www.koin.com/news/health/coronavirus/oha-press-conference-monday-march-9/", "https://www.channelnewsasia.com/news/world/canada-reports-first-covid-19-death-coronavirus-12520238", "https://www.kcrg.com/content/news/Eight-cases-of-COVID-19-in-Iowa-according-to-Department-of-Public-Health-568641981.html", "https://www.marinevesseltraffic.com/coronavirus-cruise-ships-live-map", "https://www.independent.co.uk/news/world/americas/coronavirus-news-princess-cruise-ship-quarantine-a9388941.html", "https://www.newsobserver.com/news/local/article240960201.html", "https://www.cnbc.com/2020/03/10/dr-marty-makary-on-coronavirus-wuhan-could-happen-here.html", "https://www.msnbc.com/rachel-maddow-show/trump-struggles-explain-why-he-disbanded-his-global-health-team-n1153221", "https://www.independent.co.uk/news/world/americas/us-politics/white-house-pandemic-response-john-bolton-global-health-team-disband-nsc-a8346346.html", "https://themindunleashed.com/2020/01/john-bolton-disbanded-global-health-security-team-in-charge-of-pandemic-response-efforts.html", "https://twitter.com/hashtag/pandemic?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/thespybrief?ref_src=twsrc%5Etfw", "https://twitter.com/911CORLEBRA777?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/coronavirus?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/2019_nCov?src=hash&ref_src=twsrc%5Etfw", "https://t.co/BwpRSHFgAY", "https://twitter.com/DrDenaGrayson/status/1221852065972006912?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/news/world/americas/coronavirus-us-hospital-beds-numbers-intensive-care-outbreak-states-a9388356.html", "https://www.sfgate.com/bayarea/article/UC-San-Francisco-triage-tents-coronavirus-patients-15117064.php", "https://www.msn.com/en-us/news/us/coronavirus-update-new-jersey-s-1st-patient-speaks-out-says-it-happened-so-quick/ar-BB10Wafc", "https://theweek.com/speedreads/900862/washington-nursing-home-coronavirus-outbreak-reported-shocking-escalation-from-no-symptoms-death", "https://www.newshub.co.nz/home/world/2020/03/coronavirus-volunteers-to-be-infected-in-race-to-find-vaccine.html", "https://news.sky.com/story/coronavirus-whole-of-italy-put-on-lockdown-11954097", "https://www.channelnewsasia.com/news/asia/coronavirus-mongolia-lock-down-first-covid-19-case-12520786", "https://nypost.com/2020/03/09/de-blasio-says-a-citywide-quarantine-a-possibility-as-are-limited-school-closures/", "https://www.businessinsider.com/new-york-state-made-hand-sanitizer-produced-by-prisoners-announced-2020-3", "https://www.timesunion.com/news/article/National-Guard-in-New-Rochelle-to-assist-15119388.php", "https://komonews.com/news/coronavirus/inslee-up-to-64000-coronavirus-cases-in-wash-by-may-if-we-dont-take-action", "https://www.bbc.com/news/world-middle-east-51809818", "https://www.reuters.com/article/us-health-coronavirus-russia-prison/moscow-threatens-with-prison-for-failure-of-self-isolation-over-coronavirus-idUSKBN20V0I7", "https://www.fox5atlanta.com/news/officials-preparing-georgia-state-park-for-coronavirus-patient-isolation-location", "https://www.independent.co.uk/news/world/americas/coronavirus-fulton-county-us-georgia-cases-atlanta-school-close-latest-a9389071.html", "https://t.co/kzlUmBLf22", "https://twitter.com/nowthisnews/status/1237408623069761536?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/news/world/americas/coronavirus-cdc-1918-flu-pandemic-death-toll-symptoms-a9389171.html", "https://www.cnn.com/2020/03/09/politics/pentagon-coronavirus-preparations/index.html", "https://www.nbcnews.com/health/health-care/u-s-officials-worried-about-chinese-control-american-drug-supply-n1052376", "https://www.zerohedge.com/markets/all-3-us-cities-hit-covid-19-show-markedly-lower-weekend-traffic", "https://t.co/SRcZasIVsk", "https://twitter.com/PearlJam/status/1237181665501425664?ref_src=twsrc%5Etfw", "https://www.usatoday.com/story/news/education/2020/03/09/coronavirus-princeton-university-mandates-remote-classes-after-spring-break/5000118002/", "https://boston.cbslocal.com/2020/03/10/coronavirus-harvard-classes-online-spring-break/", "https://sg.news.yahoo.com/biden-sanders-consider-changing-campaign-031740323.html", "https://twitter.com/hashtag/Covid19?src=hash&ref_src=twsrc%5Etfw", "https://t.co/KNaKQSSgM9", "https://twitter.com/KlasfeldReports/status/1237478570823426049?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/news/health/coronavirus-st-patricks-day-parade-dublin-cancelled-ireland-latest-a9388486.html", "https://www.independent.co.uk/news/world/middle-east/coronavirus-iran-death-toll-outbreak-tehran-hospital-china-italy-latest-a9388256.html", "https://www.scmp.com/week-asia/health-environment/article/3074469/coronavirus-south-korea-cuts-infection-rate-without", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://t.co/C8uu3Qgsu8", "https://twitter.com/DrEricDing/status/1237435123072667649?ref_src=twsrc%5Etfw", "https://themindunleashed.com/2020/03/covid-19-outbreak-6-breaking-news-stories-you-need-to-know.html", "https://themindunleashed.com/2020/03/covid-19-update-five-things-you-need-to-know-today.html", "https://themindunleashed.com/2020/03/us-botching-covid-19-testing-outbreak-spreads-22-states.html", "https://themindunleashed.com/2020/03/covid-19-panic-hits-us-as-global-markets-implode-oil-crashes.html", "https://t.me/s/covid19report", "https://themindunleashed.com/author/emmafiala", "https://creativecommons.org/licenses/by/4.0/", "https://themindunleashed.com/2020/03/grim-reality-in-us-quarantines-emergencies-lockdowns-deaths.html", "https://signup.themindunleashed.com/subscribe", "mailto:Contact@TheMindUnleashed.com"], "authors": ["Emma Fiala"], "publish_date": "2020-03-10T16:47:26-05:00"}