{"result_id": "303038", "URL": "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists", "timestamp": "2023-04-25 17:30:53 CEST+0200", "meta": {"description": "Is climate change happening? Of course, climate change has always been happening, long before the industrial revolution. Earth has gone through multiple cycles of extreme climate change and so have other planets, like Mars, for example. But the question today is, how much does human activity influence modern day climate change? The general public has been primed to believe that climate change is predominantly the result of human activity, and that we are headed towards a complete climate catastrophe within the next couple of decades.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "Where Did The Claim That \"97% of Scientists\" Believe Climate Change Is A Man-Made, Urgent Problem Come From? Is It True?", "cleaned_text": "Is climate change happening? Of course, climate change has always been happening, long before the industrial revolution. Earth has gone through multiple cycles of extreme climate change and so have other planets, like Mars, for example.\n\nBut the question today is, how much does human activity influence modern day climate change? The general public has been primed to believe that climate change is predominantly the result of human activity, and that we are headed towards a complete climate catastrophe within the next couple of decades.\n\nThe public has also been told that approximately 97 percent of scientists agree with the catastrophe narrative, but is this really true? Where did this number come from?\n\nThe truth is, there is quite a large group of climate scientists and academics in the field that disagree with the oversimplified view of climate change that is constantly being spouted, but the public is not told this.\n\nIt’s similar to what we saw with COVID-19, where a large minority, or perhaps majority of doctors, scientists, vaccine developers and renowned infectious disease experts opposed lockdowns, mask, and vaccine mandates. Many of them were censored and referred to as “conspiracy theorists.”\n\nI’ve said it before and I’ll say it again, the mainstream can make the minority feel like the majority, and the majority feel like the minority. Perhaps this is something we’ve seen with this “97%” figure?\n\nThe History of Climate Science & The Origins of Doomsday Scenarios\n\nIn the 1980s, the Rockefeller Brothers Fund became the sole authority of the global warming agenda. The fund boasts of being one of the first major global activists by citing its strong advocacy for both the 1988 formation of the United Nations Intergovernmental Panel on Climate Change (IPCC) and the 1992 creation of the UN Framework Convention on Climate Change.\n\nThis is when most of the messaging regarding climate ‘alarmism’ began, with consistent articles in the mainstream predicting doom-like armageddon scenarios.\n\nFor example, on June 29, 1989, the Associated Press (AP) ran a story containing an interview with Noel Brown, the director of the New York office of the United Nations Environment Program at the time. In it he stated:\n\n“Entire nations could be wiped off the face of the Earth by rising sea levels if the global warming trend is not reversed by the year 2000.”\n\nThis of course did not happen, yet it resembles the same type of predictions we see happening today. It begs the question, what is driving these 10 year predictions, and are they accurate? Do most scientists agree with them?\n\nWhen Did The “97 Percent Consensus” Number Enter Mainstream Consciousness?\n\nIt appears that an article by Naomi Oreskes, a Professor of Science History and Affiliated Professor of Earth and Planetary Sciences at Harvard University, got the ball rolling.\n\nOreskes’ 2004 article included an analysis of 928 papers containing the keywords “global climate change.” It stated, “none of the papers disagreed with the consensus position” of man made global warming. She claimed that any remaining professional dissent is exceedingly minor.\n\nFurthermore, in 2010 academic William R. Love Anderegg found that 97% to 98% of the 200 “most prolific” writers on climate change believed that man made greenhouse gases have been responsible for most of the warming we are experiencing. This received a lot of attention, despite the fact that 200 researchers and “writers” out of the thousands who had contributed to the climate science debate is nowhere close to a consensus.\n\nA 2013 paper by Cook, et al., seemed to be the most significant publication to popularize the 97% figure. The authors used methodology similar to Oreskes but based their analysis on abstracts rather than full content or a real examination of the science.\n\nThe paper looked at 12,000 papers published between 1991 and 2011 that contained the words “global warming” or “global climate change.” It claimed that 97% of climate scientists agreed with the idea that ‘humans are changing the climate.’ It went on to become one of the most popular papers of all time, reaching well over 1 million downloads.\n\nIs There Really A Consensus?\n\nAccording to Roy Spencera, a meteorologist and principal research scientist at the University of Alabama in Huntsville, who served as senior scientist for climate studies at NASA’s Marshall Space Flight Center, and Joseph Bast, a Senior Fellow at The Heartland Institute,\n\nThere is available evidence showing that many experts in the field do not agree that humans are solely responsible for an ‘armageddon level’ climate change type of scenario, and that there are a myriad of factors that are not being considered when it comes to other factors that influence our climate. It appears many scientists who are not actually climate scientists have simply jumped on the bandwagon.\n\nA 2012 survey, for example, found strong skepticism among members of the American Meteorological Society. A petition signed by 31,000 scientists states that \"there is no convincing scientific evidence that human release of [...] carbon dioxide, methane, or other greenhouse gases is causing or will, in the foreseeable future, cause catastrophic heating of the Earth's atmosphere and disruption of the Earth's climate.\" They key word there is “catastrophic.”\n\nOne of the methods used to assert the claim that there is an overwhelming consensus seems to be by asking or polling scientists as to whether they agree that C02 levels in the atmosphere have increased, that the Earth has been warming (albeit only a little) and that man has played some part.\n\nThe problem with that is this is something almost all climate scientists can agree on. What’s not agreed upon is the fact that this has no obvious implication of danger, yet that narrative is and has been constantly portrayed as support for catastrophism and alarmism.\n\nAs a result of alarmism, political policy and major decisions regarding how we live are put into motion, all which seem to further take away our privacy, freedom, and increase the already strong surveillance state which eventually puts more wealth and control into the hands of the already wealthy “one percent.” Some are even concerned that climate lockdowns may be implemented one day in the future.\n\nPresident Obama and Secretary of State John Kerry were two of many who repeatedly used the 97 percent tagline. Kerry went so far as to say that “97 percent of peer-reviewed climate studies confirm that climate change is happening and that human activity is largely responsible.” This is still the messaging we get today from big politics.\n\nFurthermore, an important consideration in this discussion is that we are attempting to define a single number to represent a range of opinions which have many nuances.\n\nAs Oreskes says in her article, “Often it is challenging to determine exactly what the authors of the paper[s] do think about global climate change.”\n\nDoomsday scenarios may generate clicks and sell advertisements, but they truly fail to convey that science is nuanced. Apocalyptic predictions are not at all evidence based, they simply contribute to unnecessary panic and fear offering false narratives that can overwhelm readers, leading to inaction and hopelessness, especially among today’s youth.\n\nWhere have we seen this politicization before? Several researchers from various academic institutions in the United Kingdom, United States and Canada published a paper in February 2022 titled, “The Unintended Consequences of COVID-19 Vaccine Policy: Why Mandates, Passports, and Segregated Lockdowns may cause more Harm than Good.” In it, they explain,\n\nThere are many examples that can be found to illustrate how politics dominates climate reports. For example, if we go back to the 1995 2nd Assessment Report of the UN IPCC, we can see how much the agenda overshadowed and muted the actual science. The scientists included these three statements in the draft:\n• None “None of the studies cited above has shown clear evidence that we can attribute the observed (climate) changes to the specific cause of increases in greenhouse gases.”\n• None “No study to date has positively attributed all or part (of observed climate change) to anthropogenic (i.e. man-made) causes.”\n• None “Any claims of positive detection of significant climate change are likely to remain controversial until uncertainties in the natural variability of the climate system are reduced.”\n\nYet, the “summary” and conclusion statement of the IPCC report was written by politicians, not scientists. On many occasions, multiple climate scientists have explained that the rules force the scientists to change their reports to match the politicians’ final ‘summary. Those three statements by scientists above were replaced with this:\n\nThe New York Times briefly covered the fact that many “skeptics” were making these accusations, that the report was overplaying and inaccurately connecting human activity to the potential for catastrophic climate change, with no science to back that assertion.\n\nDr. Richard Lindzen, lead author of Chapter 7, \"Physical Climate Processes and Feedbacks,\" of the IPCC’s Third Assessment Report on climate change, and retired Alfred P. Sloan Professor of Meteorology at the Massachusetts Institute of Technology expresses his concern,\n\nThere are basically three groups of people dealing with the issue of climate change. Groups 1 and 2 are scientists, and group three consists of politicians, environmental groups and media.\n\nIn the video below, Lindzen does a great job of breaking down of where scientists are really at.\n\nIt’s always seemed odd to me that major environmental disasters, like the recent chemical spill/train derailment in East Palestine, Ohio, and catastrophic human activity that has led to massive deforestation and the extreme pollution of our fresh water lakes, air, soils, and oceans, continue to be ignored and not presented as urgent. There’s no doubt about it, we are destroying our mother. We have to ask ourselves, do governments really care about the well being of Earth, or are they simply using climate change for selfish purposes and ulterior motives, like big business?\n\nIt’s frustrating to watch, because humans have the potential to create a world and an environment where all life can thrive.\n\nFurthermore, ground breaking technologies that are 100 percent environmentally friendly continue to be ignored. You can see a few examples we’ve covered here, and here.\n\nThe complex science behind the CO2 narrative specifically is a topic for another article. The correlation between C02 and temperature has many holes in it.\n\nAnother quote from Lindzen stressing this point:\n\nLindzen mentions that believing in the CO2 narrative is pretty close to believe in “magic.” How could such an expert in the field, and thousands of others, come to this conclusion? And why is there such a polarizing viewpoint from big media and politicians?\n\nPerhaps he and many others are wrong, but the point is that there is never a discussion or presentation of opposing viewpoints within the mainstream. Instead, scientists who speak out against the status quo viewpoint are constantly demonized, ridiculed, character assassinated and censored.\n\nDuring a World Economic Forum (WEF) anti-disinformation panel in September last year, the United Nations Under-Secretary-General for Global Communications, Melissa Fleming, announced that they \"own the science.” She was specifically referencing their new climate change agenda, and their efforts to censor “misinformation.”\n\nFrom my perspective, all I see is dogma due to political actors and others seeking to exploit the opportunities that abound in the multi-trillion dollar energy sector, and leaders that hide behind the guise of actually caring about our planet. But perhaps I am wrong.\n\nI’ve been a big advocate for clean energy technologies and the preservation of our planet for many years. It’s the main drive behind my work. I am all for clean green initiatives, but the consciousness and intention behind these initiatives is what concerns me.\n\nWhat type of world will we create if we can’t discuss basic ideas? What type of world will we create when we choose to run, hide and censor as opposed to having important conversations? How can we stop identifying so deeply with positions, so that we can be more free to shift ideas when new information helps us understand things better?\n\nI’d like to point you to our documentary, Regenerate, Beyond The C02 Narrative. One of the most important aspects of Regenerate is that we are looking at our environment from such a limited point of view that we can’t identify the real issues we face, and that our level of thinking, or consciousness, is completely disconnected from the solutions required to truly shift our relationship with our planet. Thus, we are creating solutions that don’t truly address making the environment cleaner or better long term.", "opengraph": {"url": "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists", "type": "article", "title": "Where Did The Claim That \"97% of Scientists\" Believe Climate Change Is A Man-Made, Urgent Problem Come From? Is It True?", "description": "Is climate change happening? Of course, climate change has always been happening, long before the industrial revolution. Earth has gone through multiple cycles of extreme climate change and so have other planets, like Mars, for example. But the question today is, how much does human activity influence modern day climate change? The general public has been primed to believe that climate change is predominantly the result of human activity, and that we are headed towards a complete climate catastrophe within the next couple of decades.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8663e186-57b7-4e53-ab83-28f2422d126e_1000x773.jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/OwqIy8Ikv-c?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/OwqIy8Ikv-c?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/dM7wE4CETr8?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/dM7wE4CETr8?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8663e186-57b7-4e53-ab83-28f2422d126e_1000x773.jpeg", "https://tpulse.substack.com/p/the-pyramids-the-face-and-the-case", "https://twitter.com/Snowden/status/1623481143457611776?lang=en", "https://tpulse.substack.com/p/for-the-first-time-in-history-vaccine", "https://apnews.com/article/bd45c372caf118ec99964ea547880cd0", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcdeee168-f8d4-4f69-9af8-bfcb3b0e00dd_596x593.webp", "https://www.science.org/doi/pdf/10.1126/science.1103618", "https://iopscience.iop.org/article/10.1088/1748-9326/8/2/024024", "https://www.wsj.com/articles/SB10001424052702303480304579578462813553136", "http://www.climatechangecommunication.org/report/american-meteorological-society-member-survey-global-warming-preliminary-findings-february", "http://www.petitionproject.org/", "https://wattsupwiththat.com/2017/06/30/life-on-earth-was-nearly-doomed-by-too-little-co2/", "https://tpulse.substack.com/p/climate-lockdowns-may-be-next-heres-what-that-may-look-like", "https://www.pbs.org/newshour/politics/john-kerry-criticizes-florida-governor-banning-words-climate-change", "https://pubmed.ncbi.nlm.nih.gov/35618306/", "https://previous.iiasa.ac.at/web/home/research/ResearchPartners/Climate-Change-1995--IPCC-Second-Assessment-Report.en.html", "https://www.nytimes.com/1996/06/17/us/un-climate-report-was-improperly-altered-overplaying-human-rolecritics-say.html", "https://www.youtube.com/watch?v=3Xe5VeMYD7Y", "https://www.youtube.com/watch?v=s3a-SJecEOQ", "https://www.youtube.com/watch?v=MHTEmM6rxhQ", "https://www.thegwpf.org/content/uploads/2018/10/Lindzen-2018-GWPF-Lecture.pdf", "https://www.instagram.com/tv/Cjsj2T7jnLR/?utm_source=ig_embed&utm_campaign=loading", "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Arjun Walia"], "publish_date": "2023-02-25T14:43:21+00:00"}