{"result_id": "303025", "URL": "https://www.thepulse.one/p/how-to-think-critically-about-the-film-died-suddenly", "timestamp": "2023-04-25 17:30:44 CEST+0200", "meta": {"description": "A widely popular film called Died Suddenly came out several weeks ago and has since garnered many millions of views. The film brings up an important question regarding the prevalence of fibrous clots being pulled out of dead bodies by embalmers. The film presents the questions, is this being caused by COVID vaccines, and is this the cause of sudden deaths? The sentiment and nature of the film is rather sensational, and sometimes misleading. Regardless of how bad a job the filmmakers did with this, the importance of the questions raised in it cannot be ignored - we just have to do a better job of raising them.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/how-to-think-critically-about-the-film-died-suddenly", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "How To Think Critically About The Film \"Died Suddenly\"", "cleaned_text": "A widely popular film called Died Suddenly came out several weeks ago and has since garnered many millions of views. The film brings up an important question regarding the prevalence of fibrous clots being pulled out of dead bodies by embalmers.\n\nThe film presents the questions, is this being caused by COVID vaccines, and is this the cause of sudden deaths? The sentiment and nature of the film is rather sensational, and sometimes misleading. Regardless of how bad a job the filmmakers did with this, the importance of the questions raised in it cannot be ignored - we just have to do a better job of raising them.\n\nIn this article I will break down several things to examine as you critically think about this film and the story it is portraying. For the sake of simplicity, it's largely true that the 'mainstream viewpoint' (if you want to call it that) will be to shun this film as an evidence-less joke, continuing the sentiment that COVID vaccines are safe and effective.\n\nPerhaps on the flip side people will believe the film is undeniable proof that the vaccine is killing those who take it, and that all these sudden deaths are a result of COVID vaccines.\n\nBefore I get beat down for suggesting issues with the film, note that I believe strongly in being strategic and careful in how we spread information. I am passionate about the issues within society that were brought to light via COVID-19. Things like a lack of government transparency, pharmaceutical companies manipulating data and overselling their products, and the rise of authoritarian mindsets. A lot of people got hurt as a result of what governments chose to do, and senselessly continued to do when data came in. We have to think critically about that. With that, my focus is on good sensemaking and dialogue so we can make good decisions as a collective.\n\nHow Will The Film Be Received?\n\nI believe the film Died Suddenly will do very little to convince anyone who needs to hear the message of vaccine safety signals. By that I mean, those who are convinced COVID vaccines are completely safe and effective will only be more turned off from moving their position given the nature of this film. It may however embolden the existing choir of extreme viewpoints who already think these vaccines are responsible for every sudden death that occurrs - it may even radicalize their view slightly.\n\nFor those looking at this subject critically and for those on the fence about COVID vaccines, I'm sure a small portion will be swayed by the film, but most will likely see the problems with it more than anything. That said, I will move onto some thoughts here.\n\nLet's not lose the script: we were oversold on the safety and effectiveness of these vaccines. Doctors and scientists around the world who raised questions were censored and told they were 'anti-vaccine' without addressing the warning signals they raised, many of which are now proven to be true. The safety signals from these vaccines suggest these are some of the most dangerous vaccines we have ever seen to date, and as time goes on that suspicion many had and reported on is being confirmed by more data.\n\nWhere there is risk there must be choice, and therefore mandating these vaccines is/was highly problematic. This is one of the primary issues around why so many people are/were upset.\n\nBy now we have been hearing about deaths in the news, many of them sudden. However, with the announcement of sudden deaths, social media users and some media personalities will bring an onslaught of suggestions it was the vaccine - even before any basic research is done. It is correct to think that some of these sudden deaths are the result of COVID vaccines because we know this is occurring, however it looks silly when that is the assumption even when reliable explanations are given. Don't add noise to the conversation. Slow down, take a breath, think critically.\n\nWe know that some of these deaths are vaccine related. Not only do we have instances of people dying right after vaccination, but we have studies. One revealed that of 25 autopsied bodies of people who died suddenly, 5 deaths were linked heavily to COVID vaccines. This gives us an incredibly high signal that COVID vaccines are killing some people suddenly. But why aren't some of us also asking what killed the other 20 people who died suddenly in that study? The vast majority, according to this study, didn't die suddenly from vaccines, so why aren't we translating that to real world cases as well? Why are some assuming every sudden death must be the vaccine?\n\nWhat we know is this:\n• None not everyone who dies suddenly died of the vaccine.\n• None The vaccine is killing some people suddenly.\n• None It does not make sense for government and mainstream media to continue creating a false sentiment that these products are as safe as they claimed - especially since COVID is now so mild.\n\nOn this note, in the Died Suddenly film we see montages of people dropping to the floor over and over again. As researcher Matthew Crawford points out, many of these are not even linked to COVID vaccines:\n\nWe see all these people dropping in a montage, but no discussion of who was vaccinated or who died. Thinking critically, why aren't these basic questions asked and why wasn't basic fact checking on these cases performed?\n\nWhen pressed about why these basic facts were not addressed, the filmmakers of Died Suddenly stated: they \"did not have the budget for a fact checker.\"\n\nWhat?! No fact checking? One should know it is out of their depth to make a film like this if they are not going to check basic facts - leave the subject for someone else. Further, if Stew Peters, host of the Stew Peters Show, is part of the production team, shouldn't they know how to check basic facts?\n\nThe subject matter of this film is important and perhaps the filmmakers and Stew Peters were not the best candidates for the job, especially given Peters' poor track record and lack of basic journalistic rigor - think of the simple to fact-check Pat King story and the 'snake venom' story, as just a couple of examples. On the other hand, no one else had stepped up to make the film, so why not these guys?\n\nIn the end this lack of basic fact checking suggests this was not likely a good faith attempt to get to the truth, but maybe an opportunity to gain views ($$$) and popularity. The end result is yet more noise in an information landscape around an important topic that will likely turn even more people away from seeking the truth in good faith.\n\nThe film is trying to heavily suggest that clotting and sudden deaths are from the COVID vaccines, and in no way attempts to offer a clearer picture.\n\nRecall that back in 2020, before any COVID vaccines came about, there were reports that COVID infection was producing outcomes of heart attacks, strokes, myocarditis and even gel-like blood clots in patients.\n\nOn April 22, 2020 an article appears in the Washington Post titled A mysterious blood-clotting complication is killing coronavirus patients. The by line read: \"Once thought a relatively straightforward respiratory virus, covid-19 is proving to be much more frightening.\"\n\nCertainly we have learned a lot since then about the mild nature of future COVID variants and relatively low infection fatality rates the virus carried all along. Still, there have been some odd side effects of the now famous virus that was almost certainly engineered in a lab - let's not forget that detail.\n\nThis reminds me of the interview I did with Dr Madhava Setty called What Doctors Say In Private About COVID Jabs. We explore conversations that took place in an online doctors only forum that discussed what doctors were seeing early on with COVID, before we knew much about it. Dr. Setty revealed quotes from doctors reporting cases of myocarditis in some patients. And other patients were dying of heart attacks and strokes during highly symptomatic COVID infection.\n\nThe WaPo article goes on to say that doctors were finding:\n\nWe also have a paper published in the British Medical Journal suggesting that there is an increased risk of deep vein thrombosis (a blood clot in the leg) up to three months after covid-19 infection, pulmonary embolism (a blood clot in the lung) up to six months, and a bleeding event up to two months.\n\nThe primary point here is: extensive blood clots can come from COVID infection and may kill patients or require surgery to remove. They also can come from COVID vaccination as has been pointed out by numerous studies and experts. The FDA themselves admits the Pfizer vaccine was found to create clotting in elderly people.\n• None Are clots we find in dead bodies caused by COVID or the COVID vaccines? Perhaps both? If both, is one a greater culprit? How can we know?\n• None Why have there not been more morticians and embalmers saying this as of yet? Perhaps it's fear, perhaps it's not as widespread? What can be done here? (Our team has reached out to several to see if we can better make sense of this story.)\n\nA study from Aug 2021 pointed that what is seen with blood clotting as a result of the SARS-COV-2 spike protein.\n\nThe study pulled blood from various bodied and observed them in their unique characteristics. Researchers used:\n• None Blood from COVID-19 patients on the first day of symptoms before any treatment\n\nAll were then exposed to a key clotting factor called thrombin. Clotting in each scenario was observed and the study found the following:\n• Small amounts of amyloid (abnormal protein aggregations) were present in the fibrin clots formed.\n• Much more (a statistically significant increase) in amyloid was present in the fibrin clots formed by normal blood mixed with diluted spike protein.\n\nA doctor who has been extensively studying this clotting phenomenon and vaccine adverse notes on his Substack:\n\nHere is yet another study that illustrated the same thing.\n\nAs pointed out above, many researchers have proposed that the SARS-COV-2 spike protein is a big part in causing issues - whether from infection or vaccination.\n\nWhen I put my researcher and journalist hat on, I have wondered since the start of the vaccine program why the spike protein is the mechanism used to induce immunity given we knew the spike protein was so problematic early on. Speaking with physicians and scientists, they have assured me that another mechanism for immunity could have been used.\n\nKeep in mind we are dealing with a virus that is likely not natural at all. The idea this originated in a lab in Wuhan where scientists sought to create characteristics for a more damaging and \"sticky\" virus cannot get lost in this discussion. If this is a bioweapon, why are we using some of the most dangerous parts to create another bioweapon or sorts?\n\nWe know that there are some differences in the spike protein produced from infection and the vaccine. It is believed that COVID spike protein stays in the system for several days during infection, and can stick around in some patients for many months, likely causing 'long COVID.'\n\nWe know that it is unclear how long the spike protein in some people will last when it comes to the vaccine. Sure, it's fairly well established that for the majority of people, it could be about 48 hours. But for how many people does it last weeks or months? A year? In the end, we aren't sure if the mechanism creating spike protein from vaccination ever turns off in some people. The CDC themselves removed their estimation for how long the spike protein remains in the body from vaccination. This is because they don't know anymore.\n\nSo how long might that spike protein be running around causing damage? We have to be asking these questions.\n\nThe onus to prove what is going on here with COVID vaccines should not be on the general public, it should be on the manufacturer. However, they were given immunity by governments and there has been a great deal of deception along the way. Trials were not done properly, evidence was hidden, and some manufacturers have been trying to not reveal what went on in their trials. Why?\n\nGovernments should not be accepting the sudden deaths of so many individuals without seeking to understand why. They have the resources to do so, why not perform autopsies at a higher rate? We can open deceased bodies from COVID, or suspected vaccination injury, stain for the spike protein or nucleocapsid protein. If we find only spike protein we can likely assume a vaccine induced death, however if we find nucleocapsid protein (or perhaps other viral markers), we can likely assume it was from COVID infection. The same can be done with these clots - look for the markers.\n\nWhy is this not being done? Why do public health agencies not care to find this, yet they do everything in their power to avoid the conversation and call people crazy who question what is going on?\n\nThis is where I think we find a solution to this conundrum: we don't have to argue all day long about which is causing more sudden deaths and why they are happening etc. We should all be demanding the same thing regardless of what the conclusion states - autopsy these bodies and be transparent about the results.\n\nPublic trust is GONE, and it should be given how governments have conducted themselves. How do you rebuild it? Stop lying, stop hiding, and make an earnest attempt to give people answers.\n\nWhat Was The Goal of The Film?\n\nOver the last 15 years when training our journalists I have often asked them: \"what is the goal of the piece you are writing or creating? What do you want readers to think about? What are you bringing attention to? Is there an emotion you're trying to elicit? Are you trying to draw them to a conclusion?\"\n\nIf you care about a good and ethical sensemaking process, these questions help you remove noise and manipulation from your piece. If I were to look at Died Suddenly and ask these questions I would assume: they wanted virality, they wanted shock value, they would use anything at all costs to prove their biased perspective - even if it was false or not relating to their argument. Perhaps they wanted to profit and grow their audience, something that certainly can come of a viral film.\n\nThis may be why they failed to get basic facts right and why they butchered the idea of giving a full picture of this story. I'm being somewhat harsh because I have seen the damages of poor sensemaking like this, and it's time people standup and respectfully call for something better. Don't give governments and social media more fuel to convince others that censorship is necessary.\n\nAnother argument that often arises is to the effect of \"but we shouldn't we just let everyone speak and let people discern for themselves.\" Well, simply, yes. But my take is this:\n• None If you are an audience member viewing and reading content, learn to look for the signal in the noise of a piece of content. Don't assassinate any single source because even the worst ones get it right sometimes. But also think critically... like actually. Don't assume that because you watch alt media or mainstream media you're already a critical thinker.\n• None If you are a content creator, put out as little noise and possible. Slow down, think more deeply, and do your best to not muddy conversations. Be part of movement putting balance and good faith sensemaking FIRST.\n\nIf we can follow this we have nowhere to go but towards improvement.\n\nWe have many resources in our membership for becoming more embodied and think more critically, key ingredients to making sense of the chaotic times we are in. I truly believe we are in this together. If we come together in good faith and mutual respect we will get a lot further than calling each other idiots, meme-ing the other side, and irrationally trying to prove our points at all costs. Following the evidence, where ever it leads. And don't leave your heart behind.", "opengraph": {"url": "https://www.thepulse.one/p/how-to-think-critically-about-the-film-died-suddenly", "type": "article", "title": "How To Think Critically About The Film \"Died Suddenly\"", "description": "A widely popular film called Died Suddenly came out several weeks ago and has since garnered many millions of views. The film brings up an important question regarding the prevalence of fibrous clots being pulled out of dead bodies by embalmers. The film presents the questions, is this being caused by COVID vaccines, and is this the cause of sudden deaths? The sentiment and nature of the film is rather sensational, and sometimes misleading. Regardless of how bad a job the filmmakers did with this, the importance of the questions raised in it cannot be ignored - we just have to do a better job of raising them.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F5f8c86e8-830a-4cea-a9c9-bac83f642266_1856x1040.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F5f8c86e8-830a-4cea-a9c9-bac83f642266_1856x1040.png", "https://www.collective-evolution.com/2022/11/02/ep-3-sensemaking-fake-news-censorship/", "https://thepulse.one/2022/10/01/woman-dies-in-shoppers-drug-mart-7-minutes-after-covid-19-vaccine-booster/", "https://thepulse.one/2022/12/12/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination/", "https://roundingtheearth.substack.com/p/stew-peters-chaos-credibility-that", "https://twitter.com/thereal_truther/status/1597283685417377792?t=yUMF5PPvCfaQq2TJJL50UA&s=03", "https://www.cnn.com/2020/12/15/sport/florida-gators-player-breathing-talking/index.html", "https://www.ndtv.com/offbeat/woman-cheats-death-after-fainting-and-falling-under-moving-train-in-argentina-2902888", "https://stevekirsch.substack.com/p/answering-the-critics-of-died-suddenly", "https://roundingtheearth.substack.com/p/stew-peters-chaos-credibility-that", "https://thepulse.one/2021/08/04/patrick-king-not-responsible-for-alberta-ending-covid-mandates/", "https://childrenshealthdefense.org/defender/watch-the-water-remdesivir-snake-venom-theory/", "https://www.washingtonpost.com/health/2020/04/22/coronavirus-blood-clots/", "https://www.washingtonpost.com/health/2020/04/22/coronavirus-blood-clots/", "https://youtu.be/DXQc7jIx1CU", "https://www.bmj.com/company/newsroom/study-finds-increased-risk-of-serious-blood-clots-up-to-six-months-after-covid-19/", "https://amidwesterndoctor.substack.com/p/what-is-causing-the-died-suddenly", "https://archive.vn/t6fmo", "https://portlandpress.com/bioscirep/article/41/8/BSR20210611/229418/SARS-CoV-2-spike-protein-S1-induces-fibrin-ogen", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F3ead4b00-e621-4369-b63d-be4e25781dcc_1017x1024.png", "https://amidwesterndoctor.substack.com/p/what-is-causing-the-died-suddenly?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://www.biorxiv.org/content/10.1101/2021.10.12.464152v1", "https://amidwesterndoctor.substack.com/p/what-is-causing-the-died-suddenly", "https://thepulse.one/2022/08/18/the-cdc-just-quietly-dramatically-changed-their-claims-about-mrna-vaccine-safety/", "https://thepulse.one/2022/09/29/the-fda-has-still-not-investigated-ventavia-for-falsifying-data-during-pfizers-covid-vaccine-trials/", "https://thepulse.one/2022/01/07/judge-orders-fda-to-produce-55000-pages-of-confidential-covid-vaccine-data-per-month/", "https://stevekirsch.substack.com/p/how-to-assess-whether-a-death-was", "https://join.explorerlounge.one/", "https://signup.cetv.one/bias-masterclass/"], "authors": ["Joe Martino"], "publish_date": "2022-12-21T14:00:00+00:00"}