{"result_id": "303043", "URL": "https://www.thepulse.one/p/project-veritas-and-pfizer-how-far", "timestamp": "2023-04-25 17:30:57 CEST+0200", "meta": {"description": "On Project Veritas' recent investigation and what it reflects about our society.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/project-veritas-and-pfizer-how-far", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "Project Veritas & Pfizer: How Far Are We Willing To Go To Get 'The Truth?'", "cleaned_text": "Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this.\n\nTwo days ago Project Veritas released a video that shows consultant Jordan Walker, who works with Pfizer, suggesting Pfizer performed research to ‘mutate’ COVID-19 intentionally for their own benefit. He referred to it as ‘direction evolution.’\n\nThis suggestion would mean Pfizer’s mRNA product would become more profitable because the company would be artificially speeding up mutations so they could sell new iterations of their ‘vaccine.’\n\nProject Veritas, a media company, obtained this admission (if true) from Walker by means of an undercover journalist posing as a date. The admission was recorded through a secret camera and can be seen here.\n\nBefore we go on, there has been talk that this encounter may have been inauthentic or staged, perhaps that’s worth asking, but whether it is or not doesn’t take away from what needs to be talked about here.\n\nIf what Walker is saying is true, a corporation is playing with fire to create billions on profit while not disclosing any of this to the public. We can of course argue that maybe Walker was lying, or that perhaps something was taken out of context, but given what we already know about the existence of gain of function research and the lack of moral compass on the part of pharmaceutical companies for decades, what Walker states has to be given consideration.\n\nFurther, vaccine companies need viruses to make profit. The more ways they can find to inject products into arms, the better for them. This is true for many for profit companies who work to create the perception their product is absolutely necessary, even if it isn.’t So whether this interaction is authentic or not, is it really far fetched to imagine Pfizer would do this? After all, our systems incentivize Pfizer to behave this way.\n\nOf course mainstream media is likely terrified to touch this story, with the exception of Fox news. You could say this is partly for good reason: perhaps it is better to go slow on this story, get all the facts, and verify all we can. But they are also likely not talking about it because most are sponsored by Pfizer in some way, and of course these revelations would show just how clueless [or maybe not ;)] mainstream media was for the last 2.5 years. Wait, scratch clueless, irresponsible!\n\nA touch of context here. Many see me as a journalist, I don’t. I see myself as more of a polymath. I philosophize, I analyze culture, I focus on personal transformation and societal re-design. I exercise many disciplines to produce my work and perspectives. Journalism happens to be one tool to talk about and explore these subjects. Finally, I have been training for 3 years in the nervous system health and trauma space. (I hope to have several certifications by years end to indicate how serious this training is to me.)\n\nThat said, if you watch part two of the video released by Project Veritas you see a moment where Walker is confronted by James O’Keefe, CEO of Project Veritas, and his team about what Walker stated. The scene breaks out into a hysterical outburst where Walker is aimlessly running around the restaurant, calling the cops, is seen in disbelief, and is even claiming he is in danger because “5 white people” are in the restaurant filming him.\n\nOne look at this video and I notice this man is not thinking clearly, and that’s because his biology is taking over. He was blind sided and likely all of his worst fears have come true. His nervous system is running in pure survival mode which produces a biological state that shuts off higher order thinking and reason. Typical social engagement goes out the window as well. In very primal terms, this man’s nervous system is telling him a lion is about to tear his body apart. In nature, he’d be running from that lion with all his might, thinking about nothing less. In human society this is reflected by doing a series of irrational actions that align with what we do in our culture to ‘get away’ from a situation and seek safety. It looks irrational and it can be easy to chuckle at because it makes little sense without a nervous system perspective on board.\n\nI can’t help but get away from the fact that watching Walker, or anyone else, go through this is a bit sad. Don’t get me wrong, I’m very clear on how many lives were needlessly destroyed during COVID and have been deeply saddened by that as well. It has angered me many times over the last two years to see how incredibly destructive government, Big Pharma, and health authority behaviour has been. But I’m not one for vengeance. I feel for this person, so it leads me to think bigger as to how we even got to this point.\n\nTo me, this situation is a symptom of our current culture and societal design.\n\nTo be honest, I don’t think I would approach this situation the way Project Veritas did here. But I still ask the question “how did Project Veritas arrive at feeling the need to go THIS FAR (and in THIS WAY) to get the truth?”\n\nYou could say they are unethical, and that’s fair to some extent, but think about how governments have misled and lied to people for many years. Much of what they claimed as truth has now been fully acknowledged as false. They worked to censor legitimate and credentialed doctors and scientists, and protected companies like Pfizer all day long. They proceeded to gaslight the public on levels we have likely never seen before, and destroyed millions of lives through nonsensical mandates. People felt powerless, unheard, and poorly represented. Eventually, THIS is what it took to get to the truth in the eyes of Project Veritas. Their actions are a symptom of our current culture and society.\n\nOur societal design is built on bad incentive structures, lies, propaganda, and authoritarian mindsets. This has produced the destruction of millions of people’s lives through COVID restrictions and the style of journalism that imploded Walker’s life. It’s no use to judge who is more right or wrong, or who lost more than the other - we have to have the courage to get out of our ideological belief systems and think bigger. What the heck kind of a world is producing this constant chaos and destruction? What type of thinking or consciousness is feeding into this world, and do we want to stay on this path?\n\nHow we respond to this situation and the conversation we hold around it is an opportunity to discuss not just what I’m bringing up here but how we move forward.\n\nI trust it’s clear that everything in life has its ups and downs. Nothing is black and white. It’s when we choose to focus on only one or the other (the ups or downs) that we get stuck and fail to holistically see what life can teach us at all times.\n\nThus, we can end our inquiry at “ha, he got caught red handed and now Pfizer will go down!” But I suspect it will only be another couple of years before we have another major ‘symptom’ happen in our society as a result of how it’s designed and what its incentive structures are. Little will change\n\nOr, we can choose to examine the bigger picture and perhaps start facing some larger facts about how our current surface level analysis of the ‘good guys’ and the ‘bad guys’ is not solving much and distracts us from the larger issue of how our society is designed and the type of thinking that drives it.\n\nTo be clear, I hope Walker’s statements build an investigation into Pfizer with regards to this claim. That cannot get lost. And yes, let’s hold to truth and make sure ‘bad actions’ are stopped, but we still have to live amongst one another. Do we want to live amongst chaos and deeply hurt people, or encourage the cycle of learning and healing? It’s truly our choice.\n\nI don’t want to see a world where we cannot trust each other in anyway. Where a simple coffee with a ‘friend’ now feels nerve wracking because who knows if they are going to record the conversation and use it against us. I don’t want to see a world where governments refuse to listen to people. Where people will do whatever it takes to ‘win.’ Yes, we are in an information war right now, but something tells me we can navigate this war more strategically, and with heart.\n\nI don’t consider myself naive. Perhaps this is the necessary path forward to see truth, but I hope we don’t see it as the only path forever. I believe a better world is possible. And I believe that taking a moment to step back and consider what went down here as a symptom of a larger problem can bring a sense of neutrality to the larger question of whether it’s time for us to question the nature of our systems, consciousness, and societal design. To question whether each are truly creating an environment for us to thrive or an environment for us to destroy one another.\n\nIt’s my feeling that when we begin looking at our world from this meta perspective, we will have the opportunity to truly begin solving problems.\n\nI recommend checking out my essay series below to explore the discussion of societal re-design and how we might get to that conversation.", "opengraph": {"url": "https://www.thepulse.one/p/project-veritas-and-pfizer-how-far", "type": "article", "title": "Project Veritas & Pfizer: How Far Are We Willing To Go To Get 'The Truth?'", "description": "On Project Veritas' recent investigation and what it reflects about our society.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5433a35-13e5-47ec-ae50-51edb287c35d_800x417.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa5433a35-13e5-47ec-ae50-51edb287c35d_800x417.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://rumble.com/v274lsi-pfizer-exposed-for-exploring-mutating-covid-19-virus-for-new-vaccines-via-d.html", "https://rumble.com/v274lsi-pfizer-exposed-for-exploring-mutating-covid-19-virus-for-new-vaccines-via-d.html", "https://youtu.be/u5n7RRKgDog", "https://www.thepulse.one/p/project-veritas-and-pfizer-how-far?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://tpulse.substack.com/p/you-defeat-the-great-reset-then-what?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://www.thepulse.one/p/project-veritas-and-pfizer-how-far?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Joe Martino"], "publish_date": "2023-01-27T22:43:09+00:00"}