{"result_id": "303027", "URL": "https://www.thepulse.one/p/new-emails-show-biden-administration", "timestamp": "2023-04-25 17:30:45 CEST+0200", "meta": {"description": "It may seem like a “duh” moment for many, but for what could very well be the majority of people out there, the perception that any ‘negative’ information pertaining to COVID vaccines was the product of “misinformation,” “fake news,” or a “conspiracy theory” still reigns true.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/new-emails-show-biden-administration", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "New Emails Show Biden Administration Actively Censored \"True Content\" About COVID Vaccines With An Army of Federal Censors", "cleaned_text": "It may seem like a “duh” moment for many, but for what could very well be the majority of people out there, the perception that any ‘negative’ information pertaining to COVID vaccines was the product of “misinformation,” “fake news,” or a “conspiracy theory” still reigns true.\n\nThat’s why it’s so important to continue to share information like this, and keep supporting those who do it.\n\nLegitimate safety and efficacy issues regarding COVID vaccines have been raised throughout the pandemic by thousands of experts all over the world, only to go mostly unheard. You can see some examples I’ve written about in the past here, and here.\n\nSome CDC, FDA, and NIH officials have even openly expressed that they are embarrassed by the lack of science that has guided COVID vaccine policy.\n\nNew emails released during litigation against the Biden administration reveal incredible efforts to silence the concerns of many scientists, doctors, journalists and other experts in the field.\n\nThe lawsuit shows that the White House pressured Facebook to control information that might harm Biden’s COVID-19 vaccine policy. Facebook obviously complied.\n\nEmails show that a Facebook employee emailed White House officials Andy Slavitt and Rob Flaherty, the White House’s director of digital media, detailing how the social media giant would reduce the virality of vaccine stories that might discourage the administration’s vaccine policies, like vaccine mandates, even if they contained “true content.”\n\nOne of the emails reads as follows,\n\nThe lawsuit against the Biden administration was initiated by the New Civil Liberties Alliance, who is suing the federal government along with the attorney generals of Missouri and Louisiana.\n\nIt is believed that the US government is breaking the First Amendment by coercing, forcing, and pressuring companies to censor people for expressing views which the government disapproves of.\n\nFlaherty's emails are simply one of many examples that demonstrate how the Biden administration intentionally sought to suppress true content that it believed threatened the administrations agenda.\n\nEven well before this, an article published in the British Medical Journal (BMJ) by journalist Laurie Clarke in May 2021 revealed that Facebook had already removed at least 16 million pieces of content from its platform and added warnings to approximately 167 million others. So, it appears that Big Tech companies like Facebook have been in cahoots with governments for quite some time.\n\nThroughout the pandemic, fact-checkers have not really been fact-checking, but rather narrative checking. Social media has been one of the many long arms of the government to enforce their narrative control tactics.\n\nThere are countless examples of “true content” being censored. For example, the BMJ ran a story proving that Pfizer falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events reported in Pfizer’s pivotal phase III trial for COVID vaccines.\n\nHealth agencies still have not investigated this matter.\n\nFacebook removed this BMJ story from its platform and labelled it as “false” news and “missing context.”\n\nThe BMJ criticized the fact checkers as “inaccurate, incompetent and irresponsible.”\n\nHere at The Pulse, we also had our reporting on the BMJ piece removed, including many accurate stories throughout COVID. In fact, we began experiencing this censorship in 2016. As a result we went from a thriving independent media organization to now struggling to stay afloat financially. Thankfully the world has become much more aware of just how vast and coordinated censorship efforts are during the COVID-19 pandemic.\n\n\n\nWe are grateful for those who support us through either paid or free subscriptions here on Substack. We hope to continue doing what we do and sustain ourselves with your continued support.\n\nThe cosy and corrupt relationship between Big Tech and social media companies like Facebook seems to have been constantly revealed throughout the pandemic, not just with this new release of emails from the Biden administration.\n\nTech companies – including Twitter, Facebook, Reddit, Discord, Wikipedia, Microsoft and LinkedIn – met with the FBI and other government agencies every month, before and since the 2020 election to talk about this. Facebook even set up a special portal for “takedowns” that requires a law enforcement email to access.\n\nBefore the 2020 election, Big Tech companies also met on a monthly basis with the FBI, CISA, and other government representatives.\n\nIn fact, last year the US Department of Homeland Security stated that sharing “misinformation” online may be considered domestic terrorism. Secretary Alejandro Mayorkas testified 10 months ago that the Department of Homeland Security has created a “Disinformation Governance Board” to combat misinformation. Thankfully they scrapped this project, or did they? Perhaps it’s “classified” to protect “national security.”\n\nThis is not anything new,\n\nA declassified document from the CIA archives from 1991 in the form of a letter from a CIA task force addressed to the Director of the Central Intelligence Agency details the close relationship that exists between the CIA and mainstream media and academia.\n\nI’ve mentioned this in several articles. The document states that the CIA task force “now has relationships with reporters from every major wire service, newspaper, news weekly, and television network in the nation,” and that “this has helped us turn some ‘intelligence failure’ stories into ‘intelligence success’ stories.”\n\nThis more recent New Civil Liberties Alliance lawsuit also discovered that federal officials across at least eleven federal agencies secretly communicated with social-media platforms to censor and suppress speech that the government disfavoured.\n\nFurthermore, Big Tech companies have dozens of high ranking employees that were once employed by various Federal agencies.\n\nFor example, Aaron Berman the, Senior Product Policy Manager for Misinformation at Meta, left his job at the CIA as senior analytic manager a 2019 to join Meta. There are a number of other ex-CIA agents working in these fields.\n\nKeith Alexander, director of the NSA under Barack Obama now works for Amazon. Regina Dugan, who was the Director of The Defense Advanced Research Projects Agency (DARPA) from 2009 to 2012 held executive positions at both Google and Facebook after that.\n\nDeborah Berman spent 10 years as a data and intelligence analyst at the CIA before recently being brought on as a trust and safety project manager for Meta.\n\nBetween 2006 and 2010, Bryan Weisbard was a CIA intelligence officer, his job entailing, in his own words, leading “global teams to conduct counter-terrorism and digital cyber investigations,” and “Identif[ying] online social media misinformation propaganda and covert influence campaigns”. After that he became a diplomat and is currently a director of trust and safety, security and data privacy for Meta.\n\nEmily Vacher, who Facebook/Meta recruited to be a director of trust and safety, worked at the FBI from 2001 to 2011, becoming a supervisory special agent.\n\nSherif Kamal, trust and safety program manager at Meta, worked as a program manager at the Pentagon until 2020.\n\nThere are literally countless examples and it’s quite shocking just how many there are.\n\nIndependent media is crucially important right now. As Facebook, Google and other corporations strip funding from organizations like us, our reach stops, our work slows down, and the propaganda voices of the mainstream get louder. This is the agenda at work.\n\nThis is also why we moved to Substack. The platform allows us to fund our work and reach YOU, our community, with our work. We now rely much less on Big Tech.\n\nThis is a time for us to come together and truly choose which direction we go forward in. Not only do we have to choose our media carefully, but I believe we must also work to improve our overall sensemaking processes. If we cannot make sense of what is going on around us reliably, how can we make good decisions?\n\nThe good thing is, the more censorship efforts increase, it creates an equal and opposite reaction within the “mainstream” and acts as a catalyst for more people to really see what’s happening, and question what’s going on.\n\nCertain nefarious actions by government, although hard to stop, are always done under the guise of good will, backed by massive propaganda campaigns that attract the support of many. The way things are going, governments and mainstream media organizations continue to lose support, rapidly.", "opengraph": {"url": "https://www.thepulse.one/p/new-emails-show-biden-administration", "type": "article", "title": "New Emails Show Biden Administration Actively Censored \"True Content\" About COVID Vaccines With An Army of Federal Censors", "description": "It may seem like a “duh” moment for many, but for what could very well be the majority of people out there, the perception that any ‘negative’ information pertaining to COVID vaccines was the product of “misinformation,” “fake news,” or a “conspiracy theory” still reigns true.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F910319f8-5fbc-4932-8e38-394188cf4669_1000x750.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F910319f8-5fbc-4932-8e38-394188cf4669_1000x750.jpeg", "https://tpulse.substack.com/p/for-the-first-time-in-history-vaccine", "https://tpulse.substack.com/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination", "https://tpulse.substack.com/p/circulating-spike-protein-discovered?utm_source=%2Fsearch%2Fspike&utm_medium=reader2", "https://tpulse.substack.com/p/cdc-fda-nih-scientists-embarrassed-by-lack-of-science-guiding-covid-vaccine-policy", "https://www.ag.state.la.us/Article/13106", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F66dd4a5d-8d93-4e87-91d8-0efd96420462_1170x1034.jpeg", "https://nclalegal.org/2023/01/the-white-house-covid-censorship-machine/", "https://www.bmj.com/content/373/bmj.n1170", "https://twitter.com/DrJBhattacharya/status/1629973445294555136", "https://twitter.com/DrJBhattacharya/status/1629973445294555136", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://www.youtube.com/watch?v=RaLxhFiOBYk", "https://theintercept.com/2022/10/31/social-media-disinformation-dhs/", "https://www.youtube.com/watch?v=OmEgtQELbBE", "https://web.archive.org/web/20131025035711/http://www.carlbernstein.com/magazine_cia_and_media.php", "https://en.wikipedia.org/wiki/1953_Iranian_coup_d%27%C3%A9tat", "https://en.wikipedia.org/wiki/CIA_activities_in_Guatemala", "https://en.wikipedia.org/wiki/Radio_Free_Europe/Radio_Liberty#Early_history", "https://www.theatlantic.com/magazine/archive/2000/06/harvard-and-the-making-of-the-unabomber/378239/", "https://en.wikipedia.org/wiki/1948_Italian_general_election#Foreign_interference", "https://en.wikipedia.org/wiki/Project_Mockingbird", "https://en.wikipedia.org/wiki/Operation_CHAOS", "https://edwardsnowden.substack.com/p/americas-open-wound", "https://www.cia.gov/readingroom/docs/DOC_0005524009.pdf", "https://aaronkheriaty.substack.com/p/our-lawsuit-uncovers-army-of-federal?utm_source=brownstone&utm_medium=web", "https://www.linkedin.com/in/regina-dugan-321687121", "https://www.mintpressnews.com/wp-content/uploads/2022/07/FireShot-Capture-018-29-Deborah-Berman.-LinkedIn-www.linkedin.com_.png", "https://www.mintpressnews.com/wp-content/uploads/2022/07/FireShot-Capture-020-29-Experience-Bryan-Weisbard-LinkedIn-www.linkedin.com_.png", "https://www.youtube.com/watch?v=5qEuKCS-czU&t", "https://www.thepulse.one/p/new-emails-show-biden-administration?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Arjun Walia"], "publish_date": "2023-02-28T17:37:26+00:00"}