{"result_id": "303003", "URL": "https://www.thepulse.one/p/136-healthcare-workers-suspended-for-refusing-vaccine-kingston-ontario", "timestamp": "2023-04-25 17:30:28 CEST+0200", "meta": {"description": "Vaccine hesitancy amongst healthcare workers has been prominent during this pandemic, and the latest example is seen in Kingston, Ontario, Canada, where 136 healthcare workers have been suspended without pay for refusing to get vaccinated against COVID.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/136-healthcare-workers-suspended-for-refusing-vaccine-kingston-ontario", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "136 Healthcare Workers Suspended For Refusing Vaccine: Kingston, Ontario", "cleaned_text": "Vaccine hesitancy amongst healthcare workers has been prominent during this pandemic, and the latest example is seen in Kingston, Ontario, Canada, where 136 healthcare workers have been suspended without pay for refusing to get vaccinated against COVID.\n\nThe policy at Kingston Health Sciences Centre requires all staff, including physicians and students, to provide proof of having received at least their first dose of a COVID vaccine.\n\nAs mandates rolled in, vaccine uptake, of at least one dose, at the Kinston Health Sciences Centre increased to 95%, while a handful of them have been granted a medical exemption. The Kingston Health Sciences Centre includes Kingston General Hospital, the Hotel Dieu Hospital, and the Cancer Centre of Southeastern Ontario.\n\nAs of the 22nd of September, the centre placed the 136 workers on an unpaid two-week administrative leave. If they do not receive their first dose within the leave period they will be terminated.\n\nKHSC COVID-19 incident commander Elizabeth Bardon stated the policy is necessary to avoid an outbreak similar to what Kingston General Hospital faced earlier this summer.\n\nThis is becoming a common theme in the healthcare industry where a minority of workers refused to be vaccinated until mandates arrived, then when they did, still a portion of them were willing to lose their jobs to stick to what they feel is right. These healthcare workers would argue they remain unheard, and their concerns and reasons as to why they do not want to get vaccinated continue to not be addressed reasonably. They instead are essentially bullied into being vaccinated.\n\nAccording to the Canadian Federal government, there are currently more than 7 million Canadians who have yet to receive any dose of the COVID vaccines. This represents approximately 20 percent of the population. Many of these millions of unvaccinated Canadians are doctors, scientists, and nurses.\n\nThere also seems to be a risk healthcare staff shortages in parts of Canada as a result of vaccine requirements for employment. For example, the B.C. Nurses’ Union disagrees with vaccine mandates and is concerned that there will be a shortage of healthcare workers as a result. This is why, so far, they've refused to implement the policy despite ongoing government pressure.\n\nVaccine hesitancy has been an issue for healthcare workers throughout the world. For example, Lewis County General Hospital in Lowville, New York has announced that it will stop delivering babies after September 24th due to the fact that too many maternity unit workers have resigned over COVID vaccine mandates.\n\nPerhaps this is why many hospitals in SouthWest Michigan are allowing healthcare workers to provide proof of immunity gained via a COVID infection, because of the consequences of staffing shortages.\n\nCulturally we keep hearing from mainstream media that we need to \"trust the science\", yet it's rare to see natural immunity, and the science that supports it, enter as an option for vaccine passports. It's good to see this happening in Michigan and the acknowledgement of the latest science regarding how strong natural immunity may be.\n\nA survey conducted at Chicago’s Loretto Hospital in January showed that 40 percent of healthcare workers at that hospital would refuse vaccination. With mandates now, this number likely changed.\n\n50 percent of healthcare workers and hospital staff in Riverside County, which is comprised of approximately 2 million people, were refusing to take the COVID-19 vaccine early on in the pandemic.\n\nEric T. Payne, MD, MPHD, FRCP, Pediatric Neurocritical Care & Epilepsy at Alberta Children's Hospital and Professor of Pediatrics & Neurology at the University of Calgary recently put out a report that may provide more insight around the concerns being raised about COVID as well as mandatory vaccination requirements.\n\nThe Canadian Covid Care Alliance, a group of more than one hundred doctors, scientists and other academics, offer a resource you can use to explore a scientific perspective around COVID vaccination that is not shared in a balanced manner via mainstream media.\n\nWhy does mainstream media continue to label vaccine hesitant people, many of whom are renowned scientists, doctors and healthcare workers, as anti vaccine conspiracy theorists? Perhaps it's due to towing a cultural line without questioning. One thing we can say, we're not making an attempt to understand one another's position and why it matters. This is contributing to a culture of righteous and divide that is hardening identities into ideologies that are not flexible enough to evolve with emerging information and science.\n\nIn an attempt to help provide a solution to this culture of division via bias and ideology, The Pulse has developed a course called Overcoming Bias & Improving Critical Thinking which you can learn more about here.", "opengraph": {"url": "https://www.thepulse.one/p/136-healthcare-workers-suspended-for-refusing-vaccine-kingston-ontario", "type": "article", "title": "136 Healthcare Workers Suspended For Refusing Vaccine: Kingston, Ontario", "description": "Vaccine hesitancy amongst healthcare workers has been prominent during this pandemic, and the latest example is seen in Kingston, Ontario, Canada, where 136 healthcare workers have been suspended without pay for refusing to get vaccinated against COVID.", "image": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fwww.thepulse.one%2Ftwitter%2Fsubscribe-card.jpg%3Fv%3D-1147294755%26version%3D9"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ottawa.ctvnews.ca/kingston-ont-hospital-suspends-136-employees-without-pay-for-violating-vaccine-mandate-1.5597765", "https://thepulse.one/2021/09/23/b-c-nurses-union-president-resigns-nurses-says-no-to-mandatory-vaccines/", "https://thepulse.one/2021/09/13/ny-hospital-closes-maternity-ward-as-healthcare-workers-resign-over-vaccine-mandates/", "https://thepulse.one/2021/09/13/some-michigan-hospitals-allow-naturally-immune-employees-to-work-no-vaccine-required/", "https://thepulse.one/?s=natural+immunity+", "https://www.npr.org/2021/01/01/952716705/some-health-care-workers-are-hesitant-about-getting-covid-19-vaccines", "https://www.latimes.com/california/story/2020-12-31/healthcare-workers-refuse-covid-19-vaccine-access", "https://www.jccf.ca/wp-content/uploads/2021/09/Sep-15-FINAL-PAYNE-CPSA-letter.pdf", "https://www.canadiancovidcarealliance.org/", "https://signup.cetv.one/bias-masterclass"], "authors": ["Arjun Walia"], "publish_date": "2021-09-26T10:32:16+00:00"}