{"result_id": "303007", "URL": "https://www.thepulse.one/p/how-lies-become-reality", "timestamp": "2023-04-25 17:30:31 CEST+0200", "meta": {"description": "Built on fear, and following a dismantling of curiosity, propaganda created a false perception that will take years for us to undo.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/how-lies-become-reality", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "How Lies Become Reality", "cleaned_text": "Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this.\n\nThis is a story of how years of bad information, censorship, and authoritarian decision making created a situation where large portions of the public cannot share a reality and are fighting each other at every step.\n\nIt’s a reflection of what happens when we lose sight of kindness, respect, connection, and curiosity. Now, this story can act as medicine in repairing all that has been fractured.\n\nI was sent an article about a court ruling in Newmarket, Ontario where a judge ruled that a father, who does not want his children vaccinated against COVID-19, can call an expert witness at a trial against the mother of the children.\n\nThe Toronto Star covered this story, and I wanted to discuss a greater phenomenon unfolding that is the result of a citizenry not carefully checking the lies of pharmaceutical companies, government corruption, and mainstream media propaganda.\n\nThe title of the piece in the Star is “Citing misinformation, GTA judge sides with anti-vax father on ‘extremely controversial’ COVID-19 vaccine.”\n\nThe headline colors Superior Court Justice Richard T. Bennett in the public eye as having done something wrong, precisely the sentiment this article is trying to portray. Not because of reality, but because of a perception built from lies.\n\nAs the article title claims, the judge made his decision partly based on ‘misinformation.’ What misinformation did the judge cite? The article doesn’t tell you, they merely say:\n\nThey don’t provide the doctors name, nor what they said. This careful trick helps the paper continue and perpetuate their belief that COVID vaccines are safe, and pushes that sentiment onto their readers without having to truly check whether this belief is true.\n\nThrough this, the narrative that ‘vaccine misinformation’ is causing people to not get vaccinated continues, and the lack of safety and effectiveness of COVID vaccines doesn’t have to be addressed. Neither does the question of “why people are actually choosing not to get vaccinated.”\n\nThis is misleading the public disguised as journalism. We see a lack of curiosity, respect, and loss of connection.\n\nLet’s take a look at how judge Bennett built his ruling.\n\nHe ruled that he could not take “judicial notice” of the fact that COVID vaccines are safe and effective. Judicial notice is used when something is widely known as true, and accepted as non-controversial. When this is the case, the judge does not require evidence to confirm if that thing is true because it is extremely well established.\n\nBy not taking judicial notice, Bennett is acknowledging reality, that there is no reason to assume COVID vaccines are ‘safe and effective,’ and that just because governments say it over and over again, it doesn’t mean there is science or data to support it.\n\nTo be clear, the government has been projecting a sense of certainty about something they could not have been certain about.\n\nFor example, it’s useful to remember liberal MPs blew the whistle on Justin Trudeau stating he has no science to back up his constant claim that his government is “following the science.” The MP's even claimed that his policies are simply political and a punishment to citizens.\n\nAs everyone figured out, Trudeau’s claims were empty.\n\nThis is exactly what ‘safe and effective’ is. A piece of rhetoric backed by nothing. Yet it has managed to confuse most court systems, scientists, the citizenry at large, and most mainstream journalists.\n\nHe concluded by saying that he has seen no evidence to suggest public health authorities have determined that COVID-19 vaccines are safe.\n\nThe family will now continue their battle in a trial where the father has been granted the right to have an expert witness testify to the claim that COVID vaccines are not ‘safe and effective.’\n\nThis judge acknowledged that government statements around COVID vaccine safety are “extremely controversial” and that “reasonable people,” who have expertise, have a different opinion.\n\nHe’s right. In fact, entire countries have different opinions around COVID vaccines and have provided public recommendation to their citizenry that these vaccines need not be taken by young people because they may pose more risk than the virus itself. So have a number of experts in the field.\n\nI wonder, how does mainstream media in Canada make sense of these facts? What decision making process rolls through the heads of Canadian journalists when they see governments in other countries coming to the same conclusions as the ‘anti-vaxxers’ in Canada? Do they believe these governments are all ‘anti-vax?‘ Or do they, behind closed doors, realize that they’ve been spreading nonsense for three years?\n\nHow Lies Put Us in This Mess\n\nFirstly, by claiming these vaccines are not ‘safe and effective,’ it doesn’t mean they are killing everyone, or that every conspiracy about these vaccines is true.\n\nIt simply means that for some age groups, these vaccines may pose more risk than benefit. It means that injuries, hospitalizations, and deaths, as a result of these vaccines, may actually be higher than governments want to admit.\n\nFaulty narratives disseminated from the highest levels produced a split reality between people who thought critically during COVID and those who simply believed what the government was saying.\n\nThis small flap of a butterfly’s wings created chaos in every layer of society, and exposed how easy it is to throw kindness, respect, connection, and curiosity out the window when the right buttons are pushed.\n\nThey Could Not Have Made Those Claims\n\nPart of our goal with our reporting during COVID was to dismantle the narratives coming from governments and health authorities. Trying to explain exactly what ‘the agenda’ was or tell a story of exactly what was going on would be futile. Nobody knew.\n\nBut we could see that what government was saying did not make sense much of the time, and in truly checking their narratives factually, we can look for a way to find a shared reality much more easily.\n\nProbably the best piece we have done to sum up the fact that these vaccines cannot be considered safe and effective, with balance, is here.\n\nIn short, governments could not possibly claim this given vaccine trials were already revealing that effectiveness was poor and that safety was questionable. By omitting these details, a tiny seed was a planted, a lie that grew in ways that will take years to undo.\n\nPeople and experts who looked at the early science and questioned government were labelled as being “anti-vaccine” and had their image tarnished. This began the process of removing curiosity amongst the public and incentivizing them to join group think.\n\nThen constant fear and paranoia further emboldened the choice to forgo critical thinking and questioning of government and media narratives by hijacking the brains and physiology of the public.\n\nBy nature, the fear and paranoia furthered the disdain towards those who were critically thinking. This not only encouraged people to stay quiet, but also encouraged people to not even consider what the critical thinkers are saying.\n\nThe media, who plays the important role of informing the public, was sadly regulated by this same fear. Media companies did not want to lose their pharmaceutical sponsors, or lose credibility by questioning government. Journalists who worked there feared stepping outside of group think for many reasons, including not wanting to lose their jobs.\n\nThrough all of this, an entire machine began moving in one direction, regulating itself through fear, to forego all critical thinking and proper sensemaking. Giving blind faith to government and squashing anyone who had a different opinion.\n\nThis all ends in examples like this case of a husband and wife that cannot share a reality around these vaccines. They needed to make a choice but could not do so effectively because of the mess that clouded this entire conversation.\n\nIrresponsible messaging, starting all the way at the top of government, will always produce downline effects in media, public health, culture, and other societal institutions.\n\nWhen a Prime Minister of a country calls people who question his rhetoric “anti-vax, racist, mysoginistic, and extreme,” it’s going to create division and hostility. Hasn’t rhetoric like this in the past always been shown to be damaging and not representative of truth? Why did we forget this in real-time? How did we ‘lose our minds?’\n\nIf you are Canadian and supported Trudeau and his statements over the course of this pandemic, take some time to listen to folks with a different perspective about Trudeau. Focus on the facts they present, not rhetoric. Can we honestly say Trudeau acted with quality leadership through lies and name calling? What made you trust Trudeau? Where did those ideas come from?\n\nIf you are in media and have chosen to use statements like ‘anti-vax’ and ‘misinformation’ ad nauseam, without considering the validity of the statements coming from experts, reflect whether this path truly made sense. If you find one or two narratives now to be false, is it worthwhile to go back and re-check the narratives around the entire pandemic?\n\nAlso think about whether you might have chosen to not notice the difference between counter-culture pundits like Stew Peters and legitimate experts, scientists and journalists. Is it possible you were foregoing nuance for certainty where there was none?\n\nThe job of the media isn’t to grant legitimacy to governments and public health blindly. It’s to check if what they are saying is actually true, especially when highly qualified experts are pushing back. The media is ‘the fourth estate.’ It’s the important service of making sure that the system driven incentive of corruption is held at bay.\n\nFinally, for those that did critically think during the pandemic, don’t lose sight of what we know for sure vs. what has uncertainty attached to it - don’t jump to conclusions. This will only further divide us and hinder us in coming to a shared reality together.\n\nName-calling and “I told ya so’s” also don’t provide healing. We want to be careful not to elicit the same behavior the authoritarian approach took during COVID. After all, we all have the capability to enact destructive behavior when we lose sight of kindness, respect, connection, and curiosity.", "opengraph": {"url": "https://www.thepulse.one/p/how-lies-become-reality", "type": "article", "title": "How Lies Become Reality", "description": "Built on fear, and following a dismantling of curiosity, propaganda created a false perception that will take years for us to undo.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6d6b1ee7-972a-4a1e-b425-784844078a0e_5000x3200.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6d6b1ee7-972a-4a1e-b425-784844078a0e_5000x3200.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://archive.is/HDdHw#selection-1533.0-1538.0", "https://archive.is/HDdHw#selection-1533.0-1538.0", "https://www.youtube.com/watch?v=BbrRecCIPL4", "https://tpulse.substack.com/p/sweden-denmark-pause-moderna-vaccine-for-people-under-30-due-to-myocarditis-pericarditis?utm_source=%2Fsearch%2Fdenmark&utm_medium=reader2", "https://tpulse.substack.com/p/for-the-first-time-in-history-vaccine?utm_source=%2Fsearch%2Fexperts&utm_medium=reader2", "https://youtu.be/4kf5VK0djBY", "https://www.thepulse.one/p/how-lies-become-reality?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Joe Martino"], "publish_date": "2023-02-16T18:02:43+00:00"}