{"result_id": "303031", "URL": "https://www.thepulse.one/p/australias-lockdown-and-vaccine-narrative-has-fallen-apart", "timestamp": "2023-04-25 17:30:48 CEST+0200", "meta": {"description": "Australia’s former Prime Minister (PM) Scott Morrison has created a political firestorm for having himself sworn in with five additional ministerial portfolios, mostly without the knowledge of the cabinet collectively or the individual minister concerned. The first of these was the health portfolio, done with the knowledge and concurrence of the health minister.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/australias-lockdown-and-vaccine-narrative-has-fallen-apart", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "Australia’s Lockdown and Vaccine Narrative Has Fallen Apart", "cleaned_text": "Australia’s former Prime Minister (PM) Scott Morrison has created a political firestorm for having himself sworn in with five additional ministerial portfolios, mostly without the knowledge of the cabinet collectively or the individual minister concerned. The first of these was the health portfolio, done with the knowledge and concurrence of the health minister.\n\nThe justification was the realization that the declaration of a biosecurity emergency had transformed the health minister into a de facto dictator with the power to ignore Parliament and override all existing laws, including human rights protections against state excesses. Yet, the chief problem is the law itself that grants such sweeping power to one person and should thus be repealed or amended. I’m not holding my breath.\n\nThe biggest mistake was to hand over control of the Covid agenda, in the name of The Science™, to federal and (especially) state chief health officers who tend to be bureaucrats more than leading scientists engaged in cutting-edge medical research. In the blink of an eye, they morphed from obscure officials to petty tyrants.\n\nThe former federal chief medical officer Brendan Murphy’s footnote in history might yet be his refusal to define a woman in Senate hearings because “it’s a very contested space.” Timidity ensured he prioritized career ambitions over biological fact. Then again, Rochelle Walensky, director of the Centers for Disease Control and Prevention (CDC) talks of “pregnant people,” so maybe I’m the one who needs to get with the zeitgeist.\n\nAustralian authorities in effect copied New Zealand PM Jacinda Ardern’s doctrine of the health ministry as the “single source of truth” on coronavirus. The unavoidable consequence of this was attempts, with legacy and social media help, to marginalize and silence all dissenting voices. The more the latter’s warnings come true, the greater is the loss of trust in experts, institutions and ministers.\n\nOn August 13 the Australian Medical Professionals’ Society published a wide-ranging letter addressed to all Australian colleges and associations of health, medicine and science. Along with the attached report by Dr Phillip Altman, the letter is an authoritative catalogue of mistakes made in Australia’s pandemic management and the many harms resulting from it, the dubious science behind it, the limitations of vaccines, and the questionable efforts of regulators to come between doctors and patients.\n\nThe Covid report from New South Wales Health for the week of July 10–16 said: “The minority of the overall population who have not been vaccinated are significantly overrepresented among patients in hospitals and ICUs with Covid-19.” Just two pages later, the same report gave the number of unvaccinated people admitted to hospital and ICU as zero.\n\nThe sentence is repeated verbatim in the latest weekly report for August 7–13, with the number of unvaccinated people admitted to hospital just one and to ICU zero. By contrast, of those whose vaccination status was known, 98.7 percent of Covid patients admitted to hospital and 98.2 percent admitted to ICU during the week (and 84.8 percent of the dead) had received two or more vaccine doses.\n\nEven by the standards of public health authorities across the world gaslighting the people in order to nudge them into docile – and often performative – compliance with official edicts, this level of internal contradiction of narrative with data is breathtaking.\n\nCovid vaccines are undeniably leaky. Their real-world effectiveness lasts a disappointingly short time. One explanation could be that with mass infections and the resulting naturally-acquired immunity, the vaccinated have lost their “competitive advantage.” Mass vaccination campaigns in the middle of a pandemic can possibly also give an evolutionary advantage to mutations with greater vaccine escape properties.\n\nProfessor Kenji Yamamoto of the Okamura Memorial Hospital reinforced a warning from the European Medicines Agency of the potential for frequent booster shots to harm the immune system. Another study in the New England Journal of Medicine shows infections among double-vaccinated and boosted people can last somewhat longer. An Icelandic study showed a significantly higher probability of reinfection of the boosted. The Epoch Times reported on studies showing successive doses of mRNA vaccines can desensitize the body and teach it to become more coronavirus spike protein-tolerant.\n\nConversely, ‘breakthrough reports’ in the mainstream media of evidence of the deadly long-term harms of lockdowns themselves are growing. On August 18 the UK Telegraph’s science editor Sarah Knapton reported official statistics indicate that “The effects of lockdown may now be killing more people than are dying of Covid.”\n\nThe causes are exactly what many had predicted from the start:\n• None monomaniacal focus on Covid to the neglect of all other health concerns meant many ailments that are treatable with routine early screening went undetected until too late;\n• None excessive test, track and trace and isolation requirements took many healthcare personnel out of circulation;\n• None some people avoided consultations out of concern they would take away doctors from treating Covid patients while others avoided presenting to hospitals for fear of catching the virus there;\n• None and deaths by despair and loneliness from the enforced separations from family and the fellowship of friends.\n\nEven now, however, as Will Jones points out, there is a great reluctance to discuss the serious adverse events, including deaths, associated with and caused by vaccines themselves. Concerning safety signals continue to grow. For example, a preprint study in June by several experts analyzed data from Pfizer and Moderna Covid vaccine trials. They found that the risk of hospitalization from a vaccine-related adverse event was higher than the risk of hospitalization from Covid itself. Until such time that these are properly investigated, we will lack accurate and reliable data on the scale and severity of the problem.\n\nAustralia’s relative success in 2020–21 was helped by fortuitous circumstances. Being an isolated island country, geographically distant from the world’s major international traffic hubs and population centres, made border controls easier to institute, police and enforce. The international and domestic restrictions on travel, movement and activities kept Covid-related deaths to around 1,000 until September 2021.\n\nThen they exploded (Figure 1). In 2020–21, the governments’ response to the harsh international spotlight on the curtailment of many freedoms was to point to results. By now the performance-based international comparison has lost lustre. Australia’s rate of cumulative Covid cases per million people has surpassed the US, UK and EU rates. Both case and mortality figures track the rise in the boosted since mid-December 2021. To be fair, though, the death toll is still well below the European, British, US and South American figures (Figure 2).\n\nIt’s worth looking more closely at the change from 2020–21 (Figure 3) to the trajectory this year (Figure 4).\n\nUntil the end of last year, European, North and South American countries experienced the worst of Covid-19-related fatalities while the Asia-Pacific was mostly clustered towards the bottom. This year, by contrast, despite Omicron not being as deadly as the earlier variants, this region has suffered quite badly, as can be seen in the shift of the eleven countries’ death totals from Figure 2 to Figure 3.\n\nOnce again, this is suggestive of the intuition that ‘virus gonna virus’ and waves are regional and policy-invariant. Even for Japan, the cumulative death rate for 7.5 months this year has already reached its total death rate for 22 months until the end of 2021.\n\nThe mantra that vaccines are “safe and effective” has become a tiresome cliche. They are partially protective for a limited time, certainly not effective and may not even be all that safe. The best pathway to herd immunity was through the combination of natural immunity from prior infection and vaccines.\n\nCountries that avoided mass infection through strict isolation measures built up an immunity debt that left their populations more vulnerable once they reopened to globally circulating pathogens.\n\nWhen the highly infectious if less lethal Omicron variant struck, vaccines developed to combat the original Wuhan strain proved unfit for purpose in controlling the spread.\n\nMeanwhile Denmark has banned vaccines for anyone under 18 unless prescribed by a doctor based on an individual assessment of high risk. Similarly, people under 50 will no longer get a booster unless recommended by a doctor.\n\nBowing to the growing body of studies and the weight of accumulating data, on August 11 the globally influential CDC issued new guidance. It marks a quiet yet major retreat from previous Covid management, based on the triple acknowledgment of “transient” protection from vaccination and boosters against infection and transmission, breakthrough infections among vaccinated, and naturally-acquired immunity through infection. The CDC also quietly dropped the false claim that the mRNA and spike protein “do not last long in the body.”\n\nThe guidelines have moved sharply away from social distancing, quarantining, track-and-tracing, asymptomatic testing and even vaccine requirements, abolishing the distinction by vaccination status for most settings. Their net threefold effect is to transfer much of the responsibility for risk reduction from institutions to individuals, to prioritize preventing severe illness over slowing transmission, and to switch from sweeping population-wide precautions to targeted advice for vulnerable populations.\n\nIf this looks similar to the much-reviled Great Barrington Declaration of October 2020 that merely restated the pre-Covid-19 medical-scientific consensus, that’s because it is.\n\nThis is a revised and updated version of an article first published in The Weekend Australian on August 20–21. Republished via The Brownstone Institute.", "opengraph": {"url": "https://www.thepulse.one/p/australias-lockdown-and-vaccine-narrative-has-fallen-apart", "type": "article", "title": "Australia’s Lockdown and Vaccine Narrative Has Fallen Apart", "description": "Australia’s former Prime Minister (PM) Scott Morrison has created a political firestorm for having himself sworn in with five additional ministerial portfolios, mostly without the knowledge of the cabinet collectively or the individual minister concerned. The first of these was the health portfolio, done with the knowledge and concurrence of the health minister.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fec20930e-0471-41f3-9051-4c22ba5622f2_1024x682.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theaustralian.com.au/nation/politics/politicsnow-lockdown-secrets-must-be-released-before-victorian-state-election/live-coverage/367a6a3693cff9231c287948543d3aea", "https://www.news.com.au/technology/science/human-body/health-boss-brendan-murphy-unable-to-define-woman-in-senate-estimates/news-story/bad3124ed5e0d97cd666563d7f60ac7d", "https://www.cdc.gov/media/releases/2021/s0811-vaccine-safe-pregnant.html", "https://www.nzherald.co.nz/nz/coronavirus-jacinda-ardern-dismisses-nationwide-lockdown-speculation-on-social-media/I2FTKPSA36LJIDNLBFIYECXDHM/", "http://npaq-8630368.hs-sites.com/covid-19-an-update-of-evidence-based-information", "https://8630368.fs1.hubspotusercontent-na1.net/hubfs/8630368/AMPS/Altman%20Report%20Final%20Version%2011-8-22%20(1).pdf?utm_source=hs_email&utm_medium=email&_hsenc=p2ANqtz--0mkY9bpaznz9TS1A77R5cakACkrqes0dzyB3_Idupuld1h1rxv6cGoQvUnpcnxnK_Xo_1", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20220716.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20220813.pdf", "https://sciencebasedmedicine.org/are-vaccines-driving-the-emergence-of-escape-mutant-variants-of-covid-19/", "https://www.bloomberg.com/news/articles/2022-01-11/repeat-booster-shots-risk-overloading-immune-system-ema-says", "https://pubmed.ncbi.nlm.nih.gov/35659687/", "https://www.nejm.org/doi/full/10.1056/NEJMc2202092", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2794886", "https://www.theepochtimes.com/new-science-shows-vaccines-h%E2%80%A6mys89xSkkcjA5AMp6M%2F8H76Vd5uRsBzfODlkHCyVx%2FSE8aA%3D%3D", "https://www.telegraph.co.uk/news/2022/08/18/lockdown-effects-feared-killing-people-covid/", "https://dailysceptic.org/2022/08/21/the-medias-culpable-refusal-to-consider-the-role-of-the-vaccines-in-driving-excess-deaths/", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4125239", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fec20930e-0471-41f3-9051-4c22ba5622f2_1024x682.png", "https://ourworldindata.org/coronavirus", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa6e74d1f-ec8d-4257-bcd8-80bd2c6d7d11_1024x659.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fdc96df2a-69d1-40b7-96ed-b99aedd341ed_1024x544.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8c5d3833-2563-4ca6-96e3-36af3faea8c7_1024x547.png", "https://alexberenson.substack.com/p/denmark-ends-covid-vaccinations-for/comments", "https://www.sst.dk/en/English/Corona-eng/Vaccination-against-covid-19/Vaccination-fall-and-winter-2022-2023", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7133e1.htm", "https://gbdeclaration.org/", "https://www.theaustralian.com.au/inquirer/uncertain-science-blighted-pandemic-management/news-story/74fc01d56c2f56676f328cc8da4e94e6", "https://brownstone.org/articles/australias-lockdown-and-vaccine-narrative-has-fallen-apart/"], "authors": ["Ramesh Thakur"], "publish_date": "2022-08-31T06:20:00+00:00"}