{"result_id": "303030", "URL": "https://www.thepulse.one/feed", "timestamp": "2023-04-25 17:30:47 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "https://www.thepulse.one/feed", "encoding": "UTF-8"}, "image": null, "domain": "www.thepulse.one", "title": "", "cleaned_text": "https://www.thepulse.one/p/consciousness-creates-reality-is Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. “Despite the unrivalled empirical success of quantum theory, the very suggestion that it may be literally true as a description of nature is still greeted with cynicism, incomprehension and even anger.” The fascinating connection between mind and matter has given birth to a saying used by many, from quantum physicists and academics to ancient and “new age” philosophers. The saying goes, “Consciousness creates reality.” The question is, where did this saying come from? What does it mean? And how should we interpret it? In the 17th century, the ideas of philosopher Rene Descartes played a significant role in shaping what science would one day become. Among his influential contributions, Descartes brought to light the characteristics of mind and matter, identifying them as the two primary ingredients of reality. These views, originating largely from Aristotle and Plato, have made their way throughout the ages to the present day and have been further validated by quantum mechanics (QM). It’s always fascinating when ancient ideas, which seemed to have originated from one’s own heart/mind, are validated by modern-day experiments, technology and science. It truly makes one ponder whether or not the burning questions of existence and the mysteries regarding the true nature of reality are somehow accessible somewhere inside all of us in some extraordinary way. Do we have all of the answers inside of us? Perhaps. To dive deep into this subject we must examine consciousness and its relationship with physical material matter. The existence of this relationship has, in my opinion, been demonstrated without a doubt through the birth of quantum mechanics (QM). QM is the catalyst for the term, “consciousness creates reality.” Quantum mechanics, or quantum physics, examines physical material matter and how it behaves at the smallest observable level. It attempts to describe and account for the properties of molecules and atoms and their constituents—electrons, protons, neutrons, and other particles such as quarks and gluons. Basically, it’s the examination of atomic and subatomic particles and trying to understand them, given the fact that these particles make up everything that we perceive to be physical material matter, including me and you. The modern scientific worldview is largely based on the idea that materialism dominates and that matter is the only reality. But this isn’t true, as renowned theoretical physicist Dr. John Wheeler emphasized, \"No point is more central than this, that empty space is not empty. It is the seat of the most violent physics.\" QM threw the supposed material foundations of the world out the window and demonstrated that much of what we call “reality” is not even perceivable to our senses. QM has shown that atoms and subatomic particles, of which everything is made, are not really solid objects and do not exist in space and time at definite spatial locations and times. Perhaps most importantly, QM has demonstrated that the mind, or consciousness, is directly intertwined somehow with what we call physical material matter. This is why all of the ‘founding fathers’ of QM could not deny the relationship between consciousness and matter. In fact, many believed and do believe that consciousness is a fundamental aspect and required for matter to even exist. Max Planck, a theoretical physicist who originated quantum theory which won him the Nobel Prize in Physics in 1918 emphasized this in a 1931 interview with The Observer of London, “I regard consciousness as fundamental. I regard matter as derivative from consciousness. We cannot get behind consciousness. Everything that we talk about, everything that we regard as existing, postulates consciousness.” Nikola Tesla also emphasized his belief with regards to where matter is birthed from, which he referred to as the “luminiferous either” in his work, “Man’s Greatest Achievement.” “All perceptible matter comes from a primary substance, or tenuity beyond conception, fill all space, the akasha or luminiferous ether, which is acted upon by the life-giving Prana or creative force, calling into existence, in never-ending cycles all things and phenomena.” QM introduced the mind into its basic structure since it was found that the particles being observed and the observer—the physicist and the method used for observation—are linked. This implies that the consciousness of the observer is vital to the existence of the physical events being observed and that mental events can affect the physical world. The results of multiple experiments support this interpretation which suggests that the physical world is not the only component of reality. The physical world cannot be fully understood without making reference to the mind. The quantum double-slit experiment is often cited to illustrate this connection. When physicists watch a particle pass through two slits, the particle goes through one slit or the other. If a person doesn't watch it, it acts like a wave and can go through both slits simultaneously and/or split in half, go through both, then join up as one after it has passed through both slits. This means its behaviour changes based on a person's perception or the act of observing to see what slit it went through. Neils Bohr, known for his work in atomic/quantum theory which won him the Nobel Prize in Physics in 1922 explains, “When we measure something we are forcing an undetermined, undefined world to assume an experimental value. We are not measuring the world, we are creating it.” When someone is watching to see what slit it goes through, the particle acts differently compared to when no one is watching. And when no one is watching its behaviour is spooky, impossible and not comprehensible. When it is not being watched the particle acts as a wave and exhibits all potential possibilities, being anywhere, everywhere or nowhere at all — until clicked into substantiality by a conscious observer. “Observations not only disturb what has to be measured, they produce it...We compel (the electron) to assume a definite position...We ourselves produce the results of the measurement.” - M. Mermin, Boojums All the Way Through: Communicating Science ina Prosaic Age, Cambridge University Press, Cambridge, UK, 1990. Referenced by Dr. Dean Radin in a paper published in Physics Essays regarding the quantum double slit experiment There are other experiments as well, like the delayed choice experiment. Like the quantum double slit experiment the delayed choice/quantum eraser has been demonstrated and repeated multiple times. It basically brings up the point that, after the particle passes through the slit(s), it is not only until we observe, after the fact, that the particle chooses what direction it takes. This means that observation in the present is changing the past. Physicists at the Australian National University (ANU) have conducted John Wheeler’s delayed-choice thought experiment, and the findings were published in the journal Nature Physics. To make the experiment easier to understand, Wheeler used a cosmic scale explanation. Imagine a star emitting photons billions of years ago, heading in the direction of planet Earth. In between there is a galaxy. As a result of what’s known as “gravitational lensing,” the light will have to bend around the galaxy in order to reach Earth. So, it has to take one of two paths, going left or going right. Billions of years later, if one decides to set up an apparatus to “catch” the photon, the resulting pattern would be an interference pattern, as explained above in the double-slit experiment. This demonstrates that the photon took one way, and it took the other way. A \"wave\" of possibilities, but the way it took has not been defined. One could also choose to “peek” at the incoming photon, setting up a telescope on each side of the galaxy to determine which side the photon passed to reach Earth. The very act of measuring or “watching” which way the photon comes in means it can only come in from one side. The pattern will no longer be an interference pattern representing multiple possibilities, but a single clump pattern showing “one” way. What does this mean? It means how we choose to measure “now” affects what direction the photon took billions of years ago. Our choice in the present moment affected what had already happened in the past. Below is a great video of Wheeler explaining. Beyond the experiments above, research in psychoneuroimmunology indicates that our thoughts and emotions can markedly affect the activity of the physiological systems (e.g., immune, endocrine, cardiovascular) connected to the brain. In other respects, neuroimaging studies of emotional self-regulation, psychotherapy, and the placebo effect demonstrate that mental events significantly influence the activity of the brain. Another form of mind and matter interaction. Perhaps my favourite are parapsychological studies. “Studies of the so-called “psi phenomena” indicate that we can sometimes receive meaningful information without the use of ordinary senses, and in ways that transcend the habitual space and time constraints. Furthermore, psi research demonstrates that we can mentally influence—at a distance—physical devices and living organisms (including other human beings). Psi research also shows that distant minds may behave in ways that are non-locally correlated, i.e. the correlations between distant minds are hypothesized to be unmediated (they are not linked to any known energetic signal), unmitigated (they do not degrade with increasing distance), and immediate (they appear to be simultaneous). These events are so common that they cannot be viewed as anomalous nor as exceptions to natural laws, but as indications of the need for a broader explanatory framework that cannot be predicated exclusively on materialism.” I’ve cited many times a document titled “Research Into Paranormal Ability To Break Through Spatial Barriers” which reviews experiments conducted by the Aerospace Medicine Engineering Institute in Beijing. The document highlights experiments involving the videotaping and high-speed photography of the transfer of test specimens (nuts, bundles of matches, pills, nails, thread, photosensitive paper, chemically treated paper, sponges dipped in FeCl3, etc.) through the walls of sealed paper envelopes, double layered KCNS-type paper bags, sealed glass bottles, tubes with sealed caps, and sealed plastic film canisters without the walls of any of these containers being breached. All of the experiments used gifted children and young adults who apparently possessed well-known extraordinary PK (psychokinetic) ability that allowed them to teleport the various test specimens. According to a declassified Air Force study by scientist Eric W. Davis entitled Teleportation Physics Study, “The experiments were well-controlled, scientifically recorded, and the experimental results were always repeatable.” A quote from the Chinese Institute of Atomic Energy pointed out in 1991, in a study archived by the CIA: “Such phenomena and paranormal abilities of the human body are unimaginable for ordinary people. Nevertheless they are really true.” In all the experimental cases that were reported, the test specimens teleported were completely unaltered or unchanged from their initial state. Experiments like these suggest that mind/matter interaction is a phenomenon that has been observed beyond the quantum scale. Be sure to access the document, read through it, and examine the study and the methods and experiments used if you want a deeper analysis. Other psi phenomena like remote viewing and studies of Near Death Experiences (NDE’s) suggest that the mind/consciousness is not dependent on a physical biological system to exist. A paper published in Frontiers of Neuroscience Emphasizes just how fascinating psi phenomenon is and why some of the world’s most eminent scientists have been interested in it for more than a century. “Research on parapsychological phenomena (psi) is being carried out in various accredited universities and research centers throughout the world by academics in different disciplines trained in the scientific method (e.g., circa 80 Ph.D.s have been awarded in psi-related topics in the UK in recent years). This research has continued for over a century despite the taboo against investigating the topic, almost complete lack of funding, and professional and personal attacks (Cardeña, 201). The Parapsychological Association has been an affiliate of the AAAS since 1969, and more than 20 Nobel prizewinners and many other eminent scientists have supported the study of psi or even conducted research themselves.” Has much changed? When science breaks the boundaries and exposes the reality of the metaphysical and spiritual aspects of our reality, is it too much for academia? After all, research in this area completely shatters what we believe to be true sometimes. The Connection Is Clear. But What Does It Mean? “It was not possible to formulate the laws of quantum mechanics in a fully consistent way without reference to consciousness.” Robert Lanza, a stem cell and regenerative medicine expert famous for the theory of biocentrism, argues that consciousness is the driving force for the existence of the universe. He argues that everything that we experience and know about is created by our consciousness. Lanza postulates that the physical world we perceive is not something that’s separate from us but instead created by our minds as we observe it. According to his biocentric view, space and time are a result of the “whirl of information” in our head that is weaved together by our mind into a coherent experience. In a paper he co-authored by Dmitriy Podolskiy and Andrei Barvinsky, theorists in quantum gravity and quantum cosmology, they explain how observers influence the structure of our reality. According to Lanza and his colleagues, observers can significantly affect the behaviour of observable quantities both at microscopic and massive spatiotemporal scales. Again, according to theories like this the world is not something that is formed outside of us and simply existing on its own. Observers ultimately define the structure of physical reality itself not just at the quantum scale, but at large scales as well. In 2005 Professor of Physics and Astronomy at Johns Hopkins University Richard Conn Henry published a paper in the journal Nature titled “The Mental Universe.” In it he writes the following: “A fundamental conclusion of the new physics also acknowledges that the observer creates the reality. As observers, we are personally involved with the creation of our own reality. Physicists are being forced to admit that the universe is a “mental” construction....Pioneering physicist Sir James Jeans wrote: “The stream of knowledge is heading toward a non-mechanical reality; the universe begins to look more like a great thought than like a great machine. Mind no longer appears to be an accidental intruder into the realm of matter, we ought rather hail it as the creator and governor of the realm of matter… The universe is immaterial-mental and spiritual.” Writing about this topic could span thousands of pages and multiple books, but for the sake of reading length and time, the basic conclusion that seems to be inarguable is the fact that mind and consciousness have a direct relationship with matter and may be required in the first place for matter to exist. Matter may be birthed from the non material void, and perhaps some type of consciousness is the catalyst that is required for its birth. This article represents a very basic explanation of where the idea comes from and what it means. It suggests that, in some way we don’t yet understand, we are all playing a part in co-creating this reality. But what about other intelligence elsewhere in the multi-universe/multi-dimensional realm? It gets very complicated when you think about it. What about the consciousness that exists beyond death, beyond our perception of space and time? Does consciousness itself exist on its own beyond physical systems? Can everything that’s made up of matter posses some type of consciousness? As far as being what we perceive to be as ‘individuals,’ which could simply be one small facet of the whole if we are all indeed one, does this mean that one can ‘manifest’ a particular life with regards to whatever they desire? I don’t know. I do believe that our thoughts, feelings, emotions and perceptions do indeed play a large role in creating or influencing our reality. What about concepts of determinism and free will? That being said it’s not that simple. For example, if we have certain goals and desires in life it may require years of work and dedication to get there. We can’t simply snap it into existence instantaneously, which some people out there seem to imply. In some ways, science like this has been hijacked and misinterpreted for money making purposes. Furthermore, everybody seems so convinced regarding manifestation that they become engulfed with their own personal desires. This is fine, but let’s not forget about the collective, let’s not forget about others, let’s not forget that we are all connected and that some souls are having an experience on this planet that no one would desire. What can we do to help them? Another strange and inaccurate interpretation seems to be the idea that focusing on the “bad” or exposing the immoral and unethical actions of various governments and corporations will simply continue to manifest this reality. This doesn’t make sense to me and is not aligned with quantum theory at all. In fact, if we don’t shed light on the “dark” we simply allow it to be part of the human experience and permeate even more. Theories like the one discussed above also bring into play our emotions, feelings, perceptions and state of being. If consciousness and mind are directly intertwined and in some way help to create our experience, we must ask ourselves, from what collective state of being are we creating from? These discussions also lend belief to the idea of God, although I won’t go there because that’s also a deeper discussion. There are many different ideas of what “God” may constitute. What do you think? Please share your thoughts and opinions in the comments section below! ]]>\n\nhttps://www.thepulse.one/p/cbc-upset-as-twitter-labels-them Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. Twitter recently began adding labels to various news organizations that are publically or government funded, and some are taking great issue with it. Twitter defines a “government-funded” media outlet as an outlet “where the government provides some or all of the outlet’s funding and may have varying degrees of government involvement over editorial content.” CBC in Canada is one of the latest organizations to receive the rating, initially being labelled “government-funded media,” but now labelled as “69% government-funded media.” This of course is entirely true. CBC received $1.24 billion in 2021-2022 in federal government funding. This sum is for all of CBCs content, not just news, but it doesn’t change the fact that CBC News is largely funded by government money. CBC was not happy about the label and publicly took to Twitter stating: “Our journalism is impartial and independent. To suggest otherwise is untrue. That is why we are pausing our activities on @Twitter” They followed up with an article stating: “We cannot in good conscience continue to post fact-based news and information to Twitter, or engage on it, while a false impression of government involvement in our work is allowed to stand.” They are stating that by being labelled “government-funded” people will assume they won’t be impartial. But who would decide if someone is impartial? How would we know other than to look at the type of content CBC produces? Doesn’t CBC realize people think they are partial because of their heavy bias on events like COVID and the Freedom Convoy? CBC and the rest of the mainstream media world had little issue supporting the all-out ban of Russia Today on Big Tech at the start of the Russia-Ukraine war because RT is “Russian state-sponsored.” But now that they are being given that label and it’s suddenly a problem? This is where I think the word ‘independent’ is used too loosely. No one is suggesting there is a corporation or government official controlling every story that comes out of the CBC, but to think there isn’t a culture of omission and propaganda that protects the government on important issues is disingenuous. Further, it’s a matter of public record that governments have used their connections with mainstream media organizations to change stories. How do we know CBC isn’t affected by this? Every country uses propaganda and it’s very rare mainstream media outlets are going to call it out regularly. In fact, they are how the propaganda disseminates. People are losing trust in mainstream media for this very reason. But for some reason, the institution of mainstream media remains too blind to recognize the game they are part of. Have they reflected on how many things they were wrong about during COVID? Or are they pretending that never happened? BBC News and NPR were both recently labelled by Twitter as well. The move upset NPR so much that they decided to leave Twitter. The BBC objected to the labelling but has stuck around. The CBC, the BBC, nor NPR left YouTube after they were labelled publicly or government funded. Why? Perhaps they don’t want to go against Google because it’s not fashionable to do so. Whereas attacking Twitter ever since Musk took it over has become ‘a thing.’ Perhaps to the mainstream Musk acts as someone whose unpredictable and who may have it out for holding them and the damage they cause accountable. What do you think? Is the mainstream afraid of what’s happening? Are they truly free from the perils of audience capture? Or are they too just pandering to narratives their audience will like? See the YouTube labels below: CBC’s label came about as Canada’s Conservative party leader Pierre Poilievre took to Twitter to ask owner Elon Musk to “accurately” label CBC. While I’m sure it’s obvious Poilievre has his own political agenda here, it isn’t false to label CBC as government-funded. The important question here is, if someone other than a politician could get Musk’s attention to check whether CBC is government-funded, would he have changed it? We don’t want politicians to have preferential access to change the actions of Big Tech. Facts have to be facts, no matter who sheds light on them or how they invite us to change our minds. NDP leader Jagmeet Singh stated the Conservatives “have an unhealthy adversarial relationship with the media,” where Poilievre has refused to “answer questions and to wrongfully accuse journalists of bias when he doesn’t like tough questions or fact checks.” While Singh is correct, sometimes politicians do wrongly accuse journalists of bias, and it is highly fashionable for conservatives to go to war with mainstream media, it is also a fact that mainstream journalism is famous for lying by omission. This is where we must see politics for what it is: a game. Justin Trudeau, Jagmeet Singh, nor Pierre Poilievre care about the truth, they want to win. They want to be the leader, and they will do what it takes to get that done. This is why it’s best to not get lost in the words of politicians within our existing system. Instead, develop your ability to seek and discern truth as a citizen. Democracy is only valuable when those voting are truly informed, and when the system is not an oligarchy. Sadly virtually all Western countries, including Canada, function as an oligarchy at the moment. Some people don’t quite grasp the difference between CBC and other major outlets like CTV and Global News in Canada. Only CBC gets money from the government, even though a common belief is the federal government has bought them all. While covering the Freedom Convoy in Ottawa in 2022, I regularly heard some participants stating that a $600 million dollar bailout was given by the Canadian government to Canadian mainstream media. CTV, Global, nor CBC News got any of that $600 million bailout money. It almost entirely went to small local and independent outlets, including The Epoch Times. Yes, that’s right, the Epoch Times, an alternative news source collected $455,097 of that money. Although it’s easy to argue “you shouldn’t take government money because now you will be beholden to them,” it isn’t true that IF you take government money your reporting will change. The Epoch Times is not suddenly about to be kind to Trudeau, are they? Further, independent outlets are at a huge disadvantage by not taking grant money. They can’t compete with other organizations that do, and frankly, it’s hard to operate from reader support alone as there is so much competition. People and organizations are regulated by more than just money. We have to think deeper than money. We have to reflect on the level of culture, worldview, and the courage it takes to think outside the box and truly live that authentically. This is where mainstream media deeply fails: it has almost no courage to go where the evidence leads. That has been the job of independent journalists, and most of us have lost all we have built as a result. As I’ve stated before, mainstream media will protect its corporate interests and funders, is captured by their audience, and also protects their access. It can be tough to fully grasp how mainstream media becomes controlled. They aren’t simply lying all the time. Most of the deception is in what they don’t say, and the questions they choose not to ask. Plus, there is an entire ‘fact-checking‘ infrastructure and culture there to protect them. (See my piece called “How We’re being Misled”) The image depicts how the MSM often functions, you mostly get a piece of the story: This is why coming out and yelling “mainstream media is all bullshit and lies” doesn’t bring a meaningful conversation to the table - because it isn’t true. It’s more complex than that. As an owner of an independent media organization that has been falsely smeared by Google, Facebook, YouTube, fact-checking orgs, and outfits like NewsGuard, it’s nice to see mainstream media face some challenges for once. I’ve lost almost my entire business as a result of censorship nonsense, and events like this make me think the grip of authoritarianism is going to be seriously challenged. To me, this is inspiring because what mainstream media has been doing protects powerful individuals and their rule over people. I believe we are in a time of great change. The old story and the purveyors of it are being exposed. I don't see this as a war, more of an evolution. This is the first time a Big Tech platform has been willing to stop giving preferential treatment to major media organizations, and instead are calling them what they are. For years, Big Tech has been extremely unfair to indie journalists, downgrading them, de-platforming them, and smearing outlets that use facts to challenge mainstream narratives. Perhaps this is a sign of things to change. We of course can’t know for sure. And I’m not about to trust a billionaire who can change his mind at any second, but it doesn’t change the fact that what’s happening here is important. Once again to my friends who believe all this Twitter drama since Musk took it over is just ‘theatre’, this is yet another example of why we need to embrace more complexity. Narratives are breaking and people are losing trust in mainstream authoritarianism. The more we create a culture of audiences who can truly think for themselves, and not get lost in narrative capture, the less chance they will fall for any agenda coming from any powerful person. Share this important story with others through email or social media. Thank you for reading The Pulse! ]]>\n\nhttps://www.thepulse.one/p/the-story-of-otis-t-carr-the-man Major Wayne Aho (left) and Otis T. Carr (second from left). The two men on the right are unknown. Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. It’s astonishing how the topic of \"anti-gravity\" technology is still placed in the “conspiracy theory” realm by some. This isn’t the stuff of conspiracy theories or “fringe” science, it’s a field full of reputable scientists, scholars, and real-world examples that have come not only from hard evidence but from extremely credible witness testimony. History is littered with supposed examples that are surrounded by controversy. This article explores the story of a man by the name of Otis T. Carr (1904-1982). Professor Theodore C. Loder, a professor emeritus of Earth Sciences at the University of New Hampshire, published a paper in 2002 exploring the existence of these supposed technologies, including ones like Carr claimed to have invented. In the paper he writes how research activity seemed to disappear by the mid 1950s. It then addresses recently reported scientific findings and witness testimonies that show us that this research and technology is alive and well and very advanced. “The revelations of findings in this area will alter dramatically our 20th century view of physics and technology and must be considered in planning for both energy and transportation needs in the 21st century.” In the late 1950s, OTC Enterprises, Inc. of Baltimore, Maryland put out a statement that was published in the April 3rd edition of the Baltimore Enterprise. The statement claimed that the company was ready to manufacture a flying saucer that was capable of travelling outside of the Earth’s atmosphere. All that was needed was a massive amount of funding, approximately 20 million dollars. The equivalent to that today is about 250 million. Now keep in mind that this is the 1950s. There was a big wave of UFO sightings at this time, especially after the atomic bomb was dropped in Japan. The topic was getting a lot of mainstream media attention. Rumors of “crashed craft, and bodies recovered,” that Apollo 14 astronaut Edgar Mitchell claimed were real were running rampant at this time. President Harry Truman even said on national television that they discuss these \"UFOs\" at every conference his government has had with the military. According to him at the time, \"there's always stuff like that going on.\" This correlates with more recent mainstream disclosures. In March 2019, renowned astrophysicist Eric W. Davis, who spent years working as a consultant for the Pentagon UFO program and is now a defense contractor, gave a classified briefing to the Defense Department on what he called “off-world vehicles not made on this Earth.” Even in the 1950s, Wernher Von Brauns mentor Hermann Oberth, the founding father of rocketry and astronautics, also known as the 'father of Spaceflight' stated his belief that \"flying saucers are real\" and that \"they are space ships from another solar system. I think that they possibly are manned by intelligent observers who are members of a race that may have been investigating our Earth for centuries.\" Did ‘the powers that be’ or ‘the military-industrial complex’ have flying saucer technology when Carr was alive? It's not far fetched if you sift through the research. Take, for example, this document from the Central Intelligence Agency’s Electronic reading room. The agency was keeping tabs on news regarding the UFO topic abroad. There are tens and thousands of files that have been declassified showing this, including ones pertaining to Carr which we will get to later. The document reads as follows: “A German newspaper recently published an interview with George Klein, famous German engineer and aircraft expert, describing the experimental construction of ‘flying saucers’ carried out by him from 1941 to 1945.” The document goes on to describe how many people believed ‘flying saucers’ to be a postwar development and what this particular one was capable of. “The “flying saucer” reached an altitude of 12,400 meters within 3 minutes and a speed of 2,200 kilometers per hour. Klein emphasized that in accordance with German plans, the speed of these “saucers” would reach 4,000 kilometers per hour. One difficulty, according to Klein, was the problem of obtaining the materials to be used for the construction of the “saucers,” but even this had been solved by German engineers toward the end of 1945, and construction on the objects was scheduled to begin, Klein added.\" Otis T. Carr had similar claims. These claims, although few in number, were global. Apparently, Carr put on numerous demonstrations for the public and amassed millions of dollars from extremely wealthy people to do so. If they did not believe him and if he had not shown some promise, how did he receive all of this funding? In an interview \"with Long John\" Nebel (WOR Radio, NY) in 1957, Carr stated the following, \"We have invented an electrified system which makes it possible for a propulsion system which put into operation can carry human beings, with a fuel system which is not expendable and take them into space and bring them back and return in this craft. If I had the tools now, and those tools are available in large plants, if those tools were available to me we could have this craft on the moon in six months from this date.\" You can listen to that entire interview here if you're interested. It's quite in-depth and Carr explains the technology and science behind his invention. In that interview he also mentions his work and discussions with Albert Einstein and Nikola Tesla, which is interesting to note. In 2019 I myself interviewed someone who is allegedly Carr's Great Nephew. He wished to remain anonymous but told me the following, “I know and have known that Tesla took an interest in my uncle or vice versa. At any rate Otis Carr and Tesla became quite close and before Tesla died he wanted to impart his knowledge and or theories onto someone younger who could possibly take his ideas and bring them to fruition. I do not have a lot of information about my uncle and Tesla but they were in fact very close and were great friends. All this information passed down by our family and unfortunately I never met my Uncle Otis.” Prior to the interview with Nebel, Carr wrote a book called “Dimensions of Mystery.” The book was mostly written in ‘code.’ According to Carr it was the complete layout of his plan and how his machine worked. Yet for a reader like me, or anyone for that matter, it’s impossible to understand. He did switch from using code and poetry to actually writing real statements regarding his inventions for a public demonstration, as you can see below: A Supposed Demonstration and a Trip To The Moon Here’s where things get really interesting. Major Wayne Aho (see picture above), a former Army Combat Intelligence Officer during World War II, announced that he would take the craft to the moon with Carr on December 7, 1959. The trip would take 5 hours and he would remain in orbit for 7 days before returning. The 45 diameter craft he was to use weighed 30 tons and “was powered by the Utron engine”. So, what happened? According to independent writer and researcher Doug Yurchey, “Carr and his team constructed a number of fully functional flying saucers in the late 1950s. The flying disk worked and was demonstrated. Carr was serious about taking his craft to the Moon. However, two weeks after a dramatic test flight their laboratory was forcibly closed, Federal agents confiscated equipment as well as all documentation. Authorities told them Carr’s project would ‘destroy the monetary system of the United States.” When exploring this topic it’s not hard to find dates and supposed demonstrations, but it’s quite controversial and it’s hard to find anything solid. I did some more digging and came across a man by the name of Ralph Ring. A seemingly brilliant man who claimed to have worked closely with Carr. You can watch an interesting interview with him conducted by Project Camelot here if you’re interested. In it he goes in to detail with his experience with Carr. Ring unfortunately passed away and I managed to find the contact for a close friend of his, Duane Barker. I did my due diligence and verified Barkers’ background, which is quite impressive. He’s had long stints as a senior engineer with the US Air Force and Lockheed Martin, for example. “Ralph was an inventor and a really bright guy, here on this earth to help mankind ascend. As a demonstration, his own words, he helped Otis Carr build a flying saucer in the 1950s that could instantly teleport anywhere in the universe. And Ralph flew this vehicle successfully also. It was confiscated by the US Army at gunpoint and is now stored at an AF base in full secrecy. It is useless to the military as it won’t allow weapons to be mounted and requires a high consciousness to fly it, something noticeably missing in our government.” The National Security State Gets Involved With Otis T. Carr The document below, released by the Federal Bureau of Investigation, also hints to the idea that Carr’s device works and had been tested. The idea that what Carr and his colleagues were doing could be some sort of “national security threat” pops up in this document. Carr was not only gaining interest from the FBI but also the Office of Naval Intelligence (ONI), The Air Force Office of Special Investigations (OSI) and The Technical Intelligence Field Agency, ACSI, a branch of the U.S. Army (as you can see in the document below). If this was some sort of hoax that had no potential, why were these agencies getting involved and seeing it as a potential threat? How could the Soviets, as mentioned in the document above, stand to gain from such a hoax? Shortly after this attention trouble began brewing for Carr. Like other great inventors Carr’s work was seized by the government. This happened in January 1961 when Louis J. Lefkowitz, the Attorney General of New York at the time, stated that “Carr had swindled $50,000” and later that year True Magazine labelled him as a “hoaxer.” By then his laboratory had apparently been raided and destroyed and the group of engineers had been ordered to disband and cease contact with one another. Carr was denied an appeal on March 1st, 1961 for his ‘crime’. He could not pay the fine and served part of a 14-year jail term. After that, little is known about what became either of Carr himself or the craft, but they never flew again. Carr is reported to have suffered from ill-health. A broken man, he passed away, apparently in Gardnerville, Nevada, in 1982. If Carr’s inventions were real could they have been subjected to a campaign by the US government to stop them from moving forward? Did they have their eye on technology that could, according to them, disrupt national security? Or was he a charlatan? I guess we’ll never really know. You can view the entire trove of FBI documents pertaining to Carr here. The “Invention Secrecy Act” was written up in 1951. Under this act, patent applications on new inventions can be subject to secrecy orders. These orders can restrict their publication if government agencies believe that their disclosure would be harmful to national security. “National security” has become an excuse and justification for the classification of large amounts of information on a variety of topics that the public is deliberately kept in the dark about. Much of the information kept from public eye may not have anything to do with actual national security, but could be for the purposes of protecting corporate interests and government reputation. How many people would be out of business from a so called “free energy” device? Why is Julian Assange in prison for exposing war crimes? How is this protecting national security? Shouldn’t exposing war crimes be praised and not punished? So what type of technology is under restriction under the Invention Secrecy Act? We don’t really know, but a previous list from 1971 was obtained by researcher Michael Ravnitzky. Most of the technology listed seems to be related to various military applications. You can view that list here. As Steven Aftergood from the Federation of American Scientists reports: “The 1971 list indicates that patents for solar photovoltaic generators were subject to review and possible restriction if the photovoltaics were more than 20% efficient. Energy conversion systems were likewise subject to review and possible restriction if they offered conversion efficiencies in “excess of 70-80%.” Why would highly efficient new energy generators be subjected to secrecy orders? An interesting admittance from Dr. Hal Puthoff, a long time Department of Defense scientist, as he explained to Dr. Steven Greer in 2013, a well known UFO researcher, “I’ve been taken out on aircraft carriers by the Navy and shown what it is we have to replace if we have new energy sources to provide new fuel methods.” On a side note, here we explore the test results of an energy device that we have been tracking for almost a decade. Inventor Paramahamsa Tewari showing his over-unity results which are replicated by another team. Fast Forward To Today, What Is Known? In 2021, documents obtained by The Drive show that revolutionary technology that has the capability to alter space-time may actually be “operable,” according to (now former) Naval Aviation Enterprise Chief Technology Officer Dr. James Sheehy. We’re talking about a craft that alters the space around itself. In 2018, inventor Salvatore Cezar Pais presented a paper, “Room Temperature Superconducting System for Use on a Hybrid Aerospace Undersea Craft” at the 2019 American Institute of Aeronautics and Astronautics SciTech Forum in San Diego in January 2019. In the paper, Pais writes that “the achievement of room temperature superconductivity (RTSC) represents a highly disruptive technology, capable of a total paradigm change in Science and Technology,” and adds that its “military and commercial value is considerable.” He also expressed a year ago that these technologies, like his, do not need to be weaponized. Furthermore, he claimed that they were not operable. There was confusion around why Sheehy would say such a thing. Perhaps he was not supposed to disclose that? The granted patent application for the HAUC describes this craft, with its capabilities to alter space-time around the craft. After reading this it reminded me of what’s known as the Alcubierre Drive, which would involve placing a craft within a space that is moving faster than the speed of light. Therefore the craft itself does not have to travel at the speed of light from its own type of propulsion system. Just think of a flat escalator in an airport. The escalator moves faster than you are walking. In this case, the space encompassing the ship would be moving faster than the ship could fly, keeping all of the matter of the ship together and intact. It’s one supposedly theoretical way to travel faster than the speed of light. Steve Justice, a recently retired Director of Advanced Systems at Lockheed Skunkworks, has also alluded to the idea that this type of technology is real. He has been quite outspoken about the “black budget” world, and crafts that can mimic the capabilities that are observed in unidentified aerial phenomenon by, as he once said, employing a driver system that alters the space-time metric. He once stated, as I’ve quoted before, that. “We have glimpses of how the physics of this works, but we need to harvest technologies from the Science Division to “realize” the capability.” This stuff is definitely going mainstream. In 2021, Gianni Martire, scientist at Applied Physics, and his team announced the first model of physical warp drives. The group’s study was conducted in close contact with distinguished researchers in warp field mechanics. Their work was published in Classical and Quantum Gravity. Carr was certainly ahead of his time. In his interview with Nebel (linked and mentioned earlier in the article) he mentions, “We believe that there are unidentified electrified objects in the air. We have seen three on three separate occasions.[….} In the air, they were going at great velocity and they were definitely electrified because we have been working on the same principle for many years and we recognize what we saw.” The Lore of The “Black Budget World” and “Breakaway Civilizations.” Have groundbreaking technologies been invented that could help transform humanity and our perception of reality and what we believe to be possible? Are these technologies concealed due to the threat they pose to various corporate and government agendas which, above all else, seem to crave power and control? Was Otis T. Carr subjected to this type of censorship and ridicule? The black budget world encompasses a separate civilization (Richard Dolan, “Breakaway Civilization”) that has used tremendous amounts of resources in all areas, from science to archaeology, to move itself far ahead of the mainstream world technologically. How many people does it employ? Who is operating it? Many of these questions remain unknown. Any civilian who invents technology that rivals the black budget world has always been subjected to harassment and has difficulty getting their innovations or inventions out to the public. That’s because these technologies have been ‘classified’ and the classification of them seems to be justified in eyes of the national security state. The United States has a history of government agencies existing in secret for years. The National Security Agency (NSA) was founded in 1952, its existence was hidden until the mid 1960’s. Even more secretive is the National Reconnaissance Office, which was founded in 1960 but remained completely secret for 30 years. We are talking about Special Access Programs (SAP). From these we have unacknowledged and waived SAPs. These programs do not exist publicly, but they do indeed exist. They are better known as ‘deep black programs.’ A 1997 US Senate report described them as “so sensitive that they are exempt from standard reporting requirements to the Congress.” In 2013, the Washington Post revealed that the “black-budget” documents report a staggering 52.6 billion dollars that was set aside for operations in the fiscal year 2013. Although it’s great to have this type of documentation in the public domain proving the existence of these black budget programs, the numbers seem to be off according to some statements made by some very prominent people who have been involved in the defense sector for years. There is a lot of evidence to suggest that these programs are not using billions of dollars, but trillions of dollars that are unaccounted for. “It is ironic that the U.S. would begin a devastating war, allegedly in search of weapons of mass destruction when the most worrisome developments in this field are occurring in your own backyard. It is ironic that the U.S. should be fighting monstrously expensive wars allegedly to bring democracy to those countries, when it itself can no longer claim to be called a democracy when trillions, and I mean thousands of billions of dollars have been spent on projects which both congress and the commander in chief no nothing about.” We are talking about large amounts of unaccounted-for money going into programs we know nothing about. There have been several congressional inquiries that have noted billions, and even trillions of dollars that have gone missing from the federal reserve system. On July 16, 2001, in front of the house appropriations committee, Secretary of Defense Donald Rumsfeld stated that the Department of Defense cannot account for more than $2 trillion dollars in transactions that exist. Michigan State University economist teamed up with multiple researchers, including Catherine Austin Fitts, former assistant secretary of Housing and Urban Development and they found $21 trillion of unaccounted for dollars missing from housing & D.O.D. Our world is far from transparent. ]]>\n\nhttps://www.thepulse.one/p/8-useful-tools-for-discerning-truth Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. I wanted to present a quick collection of ideas, thoughts, and reflections that can act as tools for navigating the information landscape. It can be confusing out there, hopefully these tools make things easier. I want to point out that we have the potential to live in a world where we would not have to have this level of discernment. It would be possible if we were less blinded by political ideologies, emotions, social media algorithms and censorship. But given this is the landscape we find ourselves in today, knowing how to weather the storm is essential. This is first and foremost to me. Navigating our world and information has become purely cognitive. But we are not purely cognitive beings. We have gut and heart intelligence on top of our mental capacity, so why not bring it on board and master it? Further, how we feel about something can give us insight into the beliefs, resistances, and emotions that may be shaping our perspectives. How do we become aware of how we feel and activate our other forms of intelligence? By staying present and connected to our body. Solution: Use the “Set Your Pulse” reminder we have above. It’s a fancy way of saying “take a breath and be human! You may have gotten lost in pure cognition. Come back to your body, to presence, and expand your consciousness a bit.” It also won’t hurt to have some sort of practice that regularly teaches interoception, the ability to track your internal experience, sensations and emotions. Conscious breathing, somatic movement, yoga, and martial arts all build our interoception muscle. It’s a crucial aspect to exploring our world with clarity. We can sometimes look for answers where it’s most convenient to, even if it’s a terrible place to look. This one can be best summed up in a parable featuring the Seljuk Sufi mystic Nasrudin Hodja. The Indologist Wendy Doniger quotes this parable in her book, The Hindus: An Alternative History. Someone saw Nasrudin searching for something on the ground. “What have you lost, Mulla?” he asked. “My key,” said the Mulla. So they both went down on their knees and looked for it. After a time the other man asked: “Where exactly did you drop it?” “In my own house.” “Then why are you looking here?” “There is more light here than inside my own house.”‘ It’s funny, but what’s even funnier is how true this is today. People tend to search for answers where it is easiest to look. Whether it’s from the 1 or 2 news sources they follow, a 15 second reel, or a 2 minute clip that their friend sends to them that lacks important context. Whatever is simple and easy can often be how opinion is shaped. Social media trends, best selling books, what the ‘experts’ are saying are a few of many examples. But just because it’s easy and it’s where everyone is looking doesn’t mean it’s the best approach. Solution: Our world is complex. Be willing to read full articles, even multiple at times. Watch more than just reels, 15 second clips and shorts - you’re likely not going to learn much from these. Instead of trying to be right, try to be less wrong. “When not taken to the extreme, attentiveness to one's cognitive limitations does not undermine one's confidence and erode one's character (that is, when it does not become pathological), epistemic humility can afford great benefits. Having a humble and self-questioning attitude toward one's cognitive repertoire can lead to many epistemic achievements and advantages.” The key here is, you don’t have to obsess over your own thoughts and cognition. After all, we are beings with gut and heart intelligence as well, but we should not neglect our thinking in favour of other intelligences. It’s common for people to believe they can derive all they need to know from intuition alone - I don’t align with this idea. Intuition is incredibly important, but we have a brain, cognition, and complex thinking for a reason. We use it everyday, why not master it along with heart and gut intelligence? Solution: Keep an eye on your desire to become certain about something. Be comfortable with being uncertain. Often times it is hard to know an absolute truth. It is better to understand how to be less wrong than trying to be absolutely right. No, I’m not saying people can’t be experts. In fact, I think we need highly skilled and focused people like experts. But to me there are two reasons to think critically about what experts say:\n• None For every PhD that is out there, there is another PhD that was granted proving the opposite thesis. This simply means experts can present conclusions that are the complete opposite to one another, and it’s not uncommon for experts to completely disagree.\n• None People are people, yet it’s easy to forget that. When certain individuals have some letters after their name and rise up in the ranks of fame, we tend to not think as critically about what they have to say as we can become mesmerized by their ‘social proof.’ These people all poo and wipe their butt. This, of course, is a way of saying, they are human just like you and me. They are fallible and prone to having shortsighted views at times - especially as they get busier and busier in the unrealistic schedule that’s demanded of them in order to keep up with all of their fame. (And this is only one potential source of bias.) In a world driven by trends, constant social media posting to stay relevant, and the need to have ‘a take’ on everything popular, the ecosystem of information incentivizes people to join conversations they know little about - yes, even the ‘experts.’ Solution: Be open to arguments from opposing experts. Don’t pedestal an expert or turn them into a guru. Remember, they may not have looked into something they post as deeply as you think. They are busy. Check out our conversation on what to do when experts don’t agree. One of the most common things I see today on social media and real life is people taking strong positions on things they haven’t considered deeply. As someone who loves asking questions and understanding why people feel the way they do, when people claim strong positions on something I often dig deeper to understand how they arrived at their positions and what evidence, feelings, experiences, or intuitions might back it. Sometimes people will smile and admit they don’t really know the subject too well. Others will repeat talking points they heard from their favourite presenter or someone at work. While others will lay out a really beautiful explanation to which we can discuss and build upon - which is a lot of fun. Because people often don’t like changing their mind or feel embarrassed if they have to, taking strong positions without true consideration can be problematic. Solution: Before taking a strong stance on an issue, check whether you have taken the time to inquire deeply on it. Have you listened to multiple sides and perspectives? Do you even need to take a STRONG stance right now? We’ve all see the mash up videos showing mainstream new sources saying the same key phrases over and over again, smashing home an idea and sentiment with repetition - even when the idea is not true or solid. The truth is, I could make the same mash up videos with many indie news creators spouting equally incomplete information. Indoctrination occurs through echo chambers and repetition. This is done when creators of this content find news that will continue to fit their view, without honestly bringing up greater context or differing perspectives. Solution: Regularly explore different news sources. I check out anything from alt sources to the New York Times, to the Atlantic etc. Clashing perspectives is healthy. Sure, you can set aside extreme voices if you like, but there are many grounded people sharing opposing arguments. Seek to understand them and integrate their experience of life. Doing this helps us become more resistant to being fooled. This is often seen in woke ideology, but isn’t uncommon in truth seekers and other circles as well. Noble cause corruption is when people do bad things in the name of ‘good.’ ‘The ends justifying the means’ so to speak. People are convinced of their self- righteousness and will do anything within their power to get the result they want. We saw this deeply with censorship during COVID. Good and intelligent people got caught in a place of being certain about what their governments and health authorities were saying. They also deeply believed in government propaganda that stated “those questioning things are bad.” This led to the acceptance that people should be fined, jailed, censored, smeared, and become financially unstable. All of these means were justified by the end of stopping critical thought about COVID policy so people would ‘shut up and follow the rules.’ To be fair, some people were willing to publish false, sensational, and misleading information about vaccine injuries for ‘the greater good of waking people up’ as well. It’ sounds like a good idea at the time, but truthfully only hurts the cause. The ‘in crowd’ might like it, but everyone else only walks further away. Generally, there is enough good and grounded information out there to invite people to open their minds. Solution: Keep and eye on and reflect on self-righteousness and ideas that seek to control other people in the name of ‘the greater good.’ If we have to trick people or force people into accepting ideas, they probably aren’t well thought out and clear enough. Sometimes when navigating information about a subject we might WANT or prefer something to be true. For example, we might prefer that Donald Trump is a bigger criminal than Hillary Clinton, so we might only look at information or evidence that suggests this to be true and ignore the rest or call it “conspiracy.” Further, our desires make it so only a tiny shred of evidence is needed to prove the thing we want to be true, while mountains are needed to change our mind. Notice this isn’t confirmation bias here. We’re talking about something deeper. A feeling, a desire, an emotion, something that is pulling at us for a deeper reason. Solution: Notice your feelings. Notice your emotions. Notice the ways in which you might have resistances to certain outcomes and how quickly you disqualify some evidence while making tiny shreds into gold. See if you can strip your own desires and wishful thoughts out of the equation and explore more holistically. Dive deeper into exploring critical thinking from an embodied state with our course Mastering The Art of Critical Thinking. You'll learn to see where your own bias' exist, and how to clearly see bias in other people, news articles, and in situations.\n• None Learn to attune to your heart to think & feel more clearly\n• None Get a grasp on cognitive distortions and how they affect our thinking and perception\n• None Learn to communicate more effectively with others\n• None Develop skills to stay connected to yourself and body while taking in information and communicating ]]>\n\nhttps://www.thepulse.one/p/a-massive-ufo-incident-from-1942 Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. The picture you see above is of an object that hovered over Los Angeles in the early morning hours of February 25th, 1942. The small white dots around the object are artillery bursts from when the military fired upon the object. An artillery burst is the detonation of an explosive device such as an anti-aircraft artillery shell or a nuclear weapon in the air instead of on contact with the target. This incident happened only three months after Pearl Harbour (which may have been a false flag event). There was a lot of attention placed on the US, and the country was on high alert at the time this incident occurred. Several radars detected the object approximately 120 miles west of Los Angeles, and within minutes anti-aircraft batteries were on alert. At around 2:20 am the object was tracked on radar to within a few miles off the coast. A city wide blackout was ordered. Shortly after 3:00 am the object appeared right over the city and anti-aircraft batteries opened fire. Approximately 1500 rounds were fired into the sky, not over the ocean but directly over the city. The event lasted at least one hour. Five citizens died from the shelling or complications attributed to the shelling that fell to the ground. Many buildings and homes were also heavily damaged, and multiple car accidents were reported. All of this came from US weaponry and nothing else. Dr. Bruce Maccabee, an expert in photographic analysis, believed the object to be roughly 100 feet or more in diameter. The event was witnessed by approximately 1 million people. Just imagine alarms going off in the middle of the night and the sound of heavy weaponry lighting up the sky. Imagine seeing that large object in the sky as you see in the photo below, which is the headline that the Los Angeles Times printed the very next day after the incident. Scott Littleton, who was a Professor of Anthropology, Emeritus, Occidental College, Los Angeles, CA, was one of many survivors who recounted their experience of the ordeal. “The two of us stood side by side in front of the house, huddling together in the chill night air and staring up into the sky. The planes we’d heard were not in sight, but what captured our rapt attention was a silvery, lozenge-shaped “bug,” as my mother later described it, that was clearly visible in the searchlight beams that pinpointed it. Although it was a clear moonlit night, no other details could be discerned, despite the fact that when we first saw it the object was hanging motionless almost directly overhead. Its altitude is hard to estimate, especially after all these years but I’d guess that it was somewhere between 4,000 and 8,000 feet. This may explain why we didn’t see the orange glow reported by several eyewitnesses in Santa Monica and Culver City where the object was apparently much lower. One witness suggests that this glow may simply have been the reflection of shell bursts against the object’s “silvery” body.” Littleton also expressed that the object caused a US plane to crash simply from getting within the vicinity of the object. I found this interesting because. fast forward to today and we know that planes that approach some of these unknown objects lose their ability to operate properly. I put an example from an incident in Iran in this article if you’re interested. There are hundreds of examples of this. Wilbert B. Smith, a radio engineer and one of the first Canadians to take an interest in the UFO phenomenon, joined the Department of Transport in 1939 and was in charge of establishing a network of ionospheric measurement stations. He told Paul Hellyer, the former Canadian Defence Minister, the following: “We were informed that although a few of our aircraft had come to an unfortunate end by what they considered the colossal stupidity of our pilots, they (UFOs) were now taking corrective measures to avoid our aircraft.” I’m reminded of a statement from 1947 made by General Nathan Twining, the former Chief of Staff for the United States Air Force, which reads as follows, “The phenomenon reported is something real and not visionary or fictitious...The reported operating characteristics such as extreme rates of climb, maneuverability, (particularly in roll), and actions which must be considered evasive when sighted or contacted by friendly aircraft and radar, lend belief to the possibility that some of the objects are controlled either manually, automatically or remotely.” The key word there is evasive The “official” explanation for the event over Los Angeles in 1942 ranged from “nothing happened” to “weather balloons,” to the idea that these were Japanese planes. Many headlines even claimed to have shot down a few Japanese planes but there was no evidence for this. The military and government explanation did not at all match what many people had seen or experienced, yet they insisted that hundreds of Japanese planes were flying through the sky. Maybe it’s the truth? It still doesn’t explain the multiple witness accounts and picture you see above, and the fact that no planes, balloons or other objects were brought down as a result of the shootings. Some speculate that the image was retouched and enhanced in some way in order to focus in more on the object, but regardless, witnesses saw what they saw, and radar picked up what it picked up. There was also a lot of flip flopping with the stories. The Navy declared the entire matter a false alarm but a day later, the War Department presenting the Army's side of the story, claimed at least one and possibly five unidentified aircraft were over the city that night. Multiple US representatives called for an investigation into the incident. The New York Times claimed that the military and city’s guns had been firing at absolutely nothing at all, that it was a sign of “expensive incompetence.” The Japanese claimed that they had never sent any planes to the area on that night. Many journalists noted that it was fitting that the incident had taken place in the home of the film industry. The New York Times also wrote that as the “world’s preeminent fabricator of make-believe,” Hollywood appeared to have played host to a battle that was “just another illusion.” In the end, decades later, in 1983 the Office of Air Force History outlined the events of the L.A. air raid and noted that meteorological balloons had been released prior to the barrage to help determine wind conditions. Their lights and silver color could have been what first triggered the alerts. Once the shooting began, the disorienting combination of searchlights, smoke and anti-aircraft fire probably led gunners to believe they were firing on enemy planes, even though none were actually present. If this was the official explanation and they admitted that no planes were present in 1983, why did the government, in 1942, lie? And if that object in the picture was indeed some sort of weather balloon, how did it stay up there with all of that weaponry used against it? What’s interesting to me, from a UFO researchers perspective, is the fact that this object looks similar to the classic disk/cylindrical shape with a small dome on top. And if this was a mistake, and the armed forces were firing at nothing and had their spotlights concentrated on nothing for over an hour, why was their confirmation of the object from multiple radars and witnesses? It just doesn’t make any sense. ]]>\n\nhttps://www.thepulse.one/p/the-us-is-still-not-following-the Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. The COVID \"crisis,\" as claimed by governments, began over three years ago. Most countries have long moved on from restrictions associated with the pandemic, yet the United States still does not allow unvaccinated foreigners into their country. For many months now, they remain one of just a handful of countries in the world still holding to this policy. I trust it's clear up to this point that virtually every person has had COVID at least once or twice, and natural immunity is on par or sometimes better than being \"fully vaccinated\". Recall that being \"fully vaccinated\" means two doses of a COVID vaccine. If someone got vaccinated when vaccines were first made available, those doses would have long worn off and would be offering no added protection. Whereas someone who had COVID just a couple of months ago would have added protection, yet still can't enter the US. Further, current COVID variants are the mildest they have ever been. When considering these factors, how does this policy make any sense at all? That's a rhetorical question of course. Perhaps what's most wild is that only a couple of months ago the US actually extended their COVID state of emergency, giving more weight to this policy. All the while almost every other country had let go of the pseudo-pandemic for months. The State of Emergency will end on May 11th, 2023, but so far, this does not mean their travel restrictions will. I know it feels ad nauseam at this point to state the obvious: to say governments were \"following the science\" was only ever talk. In most cases, this was never about \"the science\". Djokovic as an Example I am not only reminded of this unscientific policy because I can't visit family I have in the US as a Canadian citizen, but I recently came across a news article stating that Novak Djokovic had to withdraw from several major tournaments in the US recently because he remains unvaccinated. This wasn't a surprise. But what was interesting were the comments on the article. \"Novak always thinks he is special. He thinks that because he is one of the best tennis players, he has to be treated differently than every other tennis player.\" \"A rule is a rule. He knew what would happen, but thinks he is entitled and would get in anyway.\" \"He's had a year to get with the program. No sympathy.\" \"He knows the rules. Choices have consequences. I have no sympathy.\" \"Selfish person. Even if you don't believe in the science, you should get jabbed to protect others.\" \"We all know he is an utter machine when it comes to tennis, but he is not above the law. There is no reason why he couldn't have had vaccinations like anyone else if his game is so important.\" \"He has brought all these problems on himself. Being unvaccinated is socially unacceptable.\" It goes on like this many times over, on many articles, and no, they are not all \"bots\". Real people still believe these things, not because \"they are dumb,\" but because of the power of an effective propaganda campaign. Most of these people do not have anywhere near all the facts because the government and media did not provide them to people. It's easy when we see this type of stuff to say all the people in power are \"crooks\" or \"criminals,\" etc. But I'm significantly more fascinated by looking deeper at why our culture and systems function the way they do. It's here where I think we can find solutions versus complaining decade after decade. One question might be: What are all the possible reasons why the government does not want to provide people with facts to make informed decisions? Back in 2009, I created Collective Evolution to explore the connection between individual and collective trauma and our society. Throughout my life I've had a tough time accepting so much of human behaviour and culture as 'normal.' I find it significantly more interesting and useful to explore how we arrived at our current cultural and behavioural norms. In the specific case of the United States continuing unscientific vaccine policy, it's likely it’s about just plain 'politics.' It’s not about democracy or what people want, it’s about gaining and holding political leverage. We then might assume that \"this is just human nature.\" But I don't agree. I personally feel it's a form of illness to brush off dishonest and destructive behavior as \"just politics.\" Yet, this practice is normal in our society. Thus we have to ask, is our society sick? Has our society been sick for hundreds, if not thousands of years? What does it mean to be 'sick' in this case? Approaching From A Different Level of Consciousness Looking from a different level of consciousness, there are a multitude of factors that pile on top of one another, decade after decade. These factors are built on a worldview of competition, separation, and dominance - all further instilling cultures that aren't well-equipped to process trauma. And the truth is, I don't think our current society can exist in the way it does unless the masses are traumatized to some degree. Trauma can be a word that has different meanings and thus people can become confused by the idea of ‘collective trauma.’ In one sense, you could say that \"blunt force trauma to the head\" is a harsh hit to the head. A trauma surgeon might even be involved in helping to heal a person this type of trauma happens to. But trauma can also be defined as what happens to a person’s physiology when their nervous system becomes dysregulated through life's experiences. Chronic stress, chronic illness, poor mental health, trouble connecting with ourselves or others, etc. All of these symptoms are often a result of 'trauma' and how it shapes the nervous system and thus behavior. Difficult life events, violence, accidents, and developmental experiences where our basic human needs are not met repeatedly can result in trauma, especially if these experiences are not integrated. Collective trauma is the idea of expanding an individuals trauma into a collective environment where it interacts with others individual trauma. Further, collective trauma can include the unhealed effects of historical tragedies and events that our ancestors experienced but did not process and integrate. This trauma can be passed on cellularly, through story, and behavior. Grudges or hatred toward other nations or people that are held long after the events that caused them are an example of collective trauma being passed on. Government propaganda and narratives about how “bad” enemy nations are can often be the result of prior events now expressing as trauma. For these reasons, I personally find it incomplete to examine the state of our world without acknowledging the trauma we all hold to some extent. After all, why would creatures live in environments and societies that are the antithesis of wellness if they were healthy? They wouldn't. Hence, I do not believe us to be collectively 'healthy.' This is also why since 2009, my work has focused on the invitation to embrace personal transformation and healing if we wish to create a better world. Simply, I believe we need to heal our individual and collective trauma to create a better world. Getting To The Root Of The Challenges We Face Right now the masses look to the rich and powerful to make the world better. Yet my decade long research on the nature of our system and those who run it makes this an odd place to look for change. I’ve studied the trauma and conditioning that some wealthy and powerful families inflict on their youth through ritual. They prepare their youth in this way as they inevitably will have to make difficult decisions in their positions of power. They are taught to disconnect themselves from, and therefore not care about, the average person. It's here where I become intrigued by all of the downstream effects of decades and centuries of these types of preparations, decisions, and styles of leadership. Even is so-called ‘democratic countries,’ leaders are immesnely corrupt and making decisions that benefit a few. All this said, I’m not naive. I'm almost 15 years into my work and I know that it doesn't seem practical or obvious that we have to think about our society on this level. But where does this notion of it not seeming practical or obvious come from? It comes from our existing society, which is likely sick and not solution-oriented. Our current society suggests we should continue acting out in our trauma. Fight over political positions, make fun of others, create more division, and believe that those who don't agree with us are 'commies' or 'stupid.' Perhaps it’s time for something new. Perhaps it’s time to take a moment and notice how you feel in your body when you look at the state of the world. Truly take a moment: notice and digest how you feel about the state of the world. It’s common people want to say “oh just focus on what’s positive” or to just jump to another piece of internet content. But if we can’t digest what is in our world, how do we expect to respond to it as a collective? Perhaps another reflection is: do you need someone to intellectually tell you our society is troubled? Or can you feel it in your body and being? Are we looking in the right places for why corruption, greed, and dominance happen? Without asking these deeper questions, is it not naive to think our existing systems will fix the issue without addressing who and what is driving them? Does our society reflect individual and collective trauma that births out petty political actions? Do we tend to believe “it’s human nature” when it comes to petty politics, vs. acknowledging this behavior is a result of culture built from individual and collective trauma? Does pride or ego overrule decisions that would help society thrive? What does it mean to truly be free? Is it just about borders and freedom of travel, or is it something more, like being free within our minds and being? Free from the shadow aspects of ourselves? ]]>\n\nhttps://www.thepulse.one/p/tom-delonge-makes-some-very-irresponsible Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. Former Blink 182 Star Tom DeLonge recently made some very irresponsible comments about the UFO phenomenon. In a tweet on March 23, he stated the following, “Greer has gotten a lot of people into the subject. Anyone saying UAP/UFOs are peaceful and have our best interest in mind, are choosing to lie, or disregard the facts. Do not trust anyone that spreads these views. Read GODS, MAN and WAR from Peter Lavenda. The gods are NOT kind.” Steven Greer is a long time UFO researcher who brought out hundreds of verified military personnel of all ranks from around the world to testify about their experiences with UFOs while serving in the military. He has long been touting the idea that UFOs are extraterrestrial in origin, that they are peaceful and do not represent any type of threat. A few years ago DeLonge got tapped by several people in the intelligence community, one being Jim Semivan. Semivan had a long career in the Central Intelligence Agency (CIA) and still works with them. Luis Elizondo, a former US Army Counterintelligence Special Agent and former employee of the Office of the Under Secretary of Defense for Intelligence, was also involved. Another was Christopher Mellon, the former Deputy Assistant Secretary of Defense for Intelligence in the Clinton and George W. Bush administrations. He formerly served as the Staff Director of the United States Senate Select Committee on Intelligence and is a member of the influential Mellon family. Together they created To The Stars and began bringing the reality of the UFO phenomenon into the mainstream. Why did they chose DeLonge? Probably because he already had a heavy interest in the subject and was someone popular who came with millions of followers. Mellon and Elizondo have since left the organization, while others have joined. To The Stars played a critical role in conveying to the public that UFOs were real and legitimizing the topic within the mainstream. They were responsible for leaking multiple US Navy videos of UFO encounters that made headlines in the New York Times in 2017. It was, and still is, a very influential organization. They were able to coordinate such a vast mainstream type of disclosure while UFO researchers and whistleblowers in the past have been completely ignored. This raised concerns among many in the UFO community about the intentions of To The Stars and whether or not they were a government or ‘establishment’ mouthpiece attempting to control the narrative around the subject. It’s important to ask, have these people been presenting a holistic and accurate view of the phenomenon? It seems, to me at least, throughout the years there has always been an irresponsible threat narrative that has been attached to UFOs via To The Stars. This is further emphasized by Tom’s recent tweet. After his tweet, DeLonge went back and forth engaging with multiple people who agree and disagree. On March 24, he tells someone to read the work of John Mack, a former Dean of Psychiatry of Harvard Medical School and Pulitzer winner. He has interviewed and worked with hundreds of thousands of supposed experiencers, abductees and contactees on multiple continents and from multiple decades. The children from the Ariel School Encounter are an excellent example. But DeLonge doesn’t seem to realize that Mack would most likely strongly disagree with his comment. For example, as Mack once explained, “…if one were to put oneself in the position of an alien or some visitor from outer space and look at the Earth they would see that what we were about was destroying the greenery and the life of the planet and making it into a desert. That seems to be what we’re good at, or what we’re doing…It may be, and I have some evidence for this from the communications the aliens have brought to the people that I work with, that those beings are very aware of this desertification of the planet, and they tell us, they show the people who’ve had these experiences these incredibly beautiful images of the planet…and then they show that juxtapose with scenes of utter destruction, forests destroyed by acid rain, and rivers polluted where the fish won’t live. And so the beings convey through those images to the experiencers that we are in fact destroying life on the planet. They don’t pull any punches about that, they’re very direct… His (The Dalai Lama) explanation of why these beings were coming here now was they were disturbed by what was happening on the Earth that in some sense we were destroying their, their home, in whatever dimension that might be whether it’s physical on the Earth or in another dimension. So they were coming here as part of a process to wake us up to what we were doing, and that, that view for me has been confirmed over and over again by people that I’ve interviewed. The point is that a plethora of evidence exists suggesting that in some cases the UFO phenomenon is a peaceful one and that the beings associated with them actually do have humanity’s best interests in mind. Much of it also comes from multiple high ranking military personnel. Despite this fact, DeLonge claims that those who make this claim are “choosing to lie, or disregard the facts.” He says that we should not trust anyone who spreads these views, yet one of the most respected researchers in the field, Mack, who DeLonge cites the very next day, has expressed this view countless times. This is not to say that the opposite isn’t true either and that the UFO phenomenon has not been indicative of some concerning threatening behaviour as well. There are many examples, as DeLonge is most likely aware of, that may suggest this. But stating that the opposite is a complete lie is simply not true and should be obvious to any UFO researcher in the field. DeLonge is basically stating the phenomenon only represents something threatening. “We have to stop reacting to intrusions by UFOs as a threat, I mean that’s the whole thing behind this new task force (To The Stars), as much as I respect, you know, the task force, my colleagues and I want to cooperate with them to the extent that we can bring information or resources to what they do. But there is more, this is not, should not be looked at specifically as a threat…Obviously that’s not what it’s all about, and this idea of just labelling it all as a threat because it’s unknown, that’s the wrong idea.” - Scientist and long time UFO researcher Jacque Vallée, as seen on the Joe Rogan Podcast. I am curious, where does DeLonge’s perspective come from? Perhaps it comes from those he was tapped by? Another one I didn’t mention above was Hal Puthoff, a physicist who was the Co-Founder of To The Stars. Hal was nominated for the Nobel in Physics (with two colleagues Haisch & Rueda) for a fundamental vacuum physics model for inertia. He directed the STARGATE program for the CIA at Stanford Research Institute in the 1970s and 80s, and has worked within and for the Department of Defense for many years. The STARGATE program ran for more than two decades and was used to investigate ‘paranormal’ abilities in human beings and military personnel. I’ve been in touch with an army veteran who was part of that program for a decade. For privacy purposes he shall remain nameless, but this is what he told me in an email exchange, “I've had numerous conversations with Hal Puthoff about this. In fact, I've even asked him whether in his opinion ETs were more like the movie \"ET\" or like the movie \"Independence Day.\" He didn't even hesitate in saying, \"Independence Day\"! \n\n\n\nNow, he wasn't saying that _all_ alien/UFO/human encounters have been hostile. But there have been human casualties--injuries and even deaths. Some seem to have been inadvertent--there are forces at work that humans don't necessarily recognize as inherently dangerous (for example, when approaching grounded ET vehicles). But there apparently have been encounters where the vehicles were aggressive, or even attacked. He said he couldn't give me specifics (that was before the recent Pentagon program was revealed). And there is still quite a bit that hasn't been declassified (I know of one pretty spectacular instance but, at least as of now, can't talk about it). The TTSA (To The Stars) folks are working on getting DoD to declassify more stuff. And allegedly there is progress being made towards that. We'll have to see what happens.” It seems quite clear that these people are very concerned and have only been privy to information from inside the government that points towards something threatening. This is concerning given all of the evidence suggesting that there is a significant portion of the phenomenon that appears to be benevolent in nature. We could go back and forth all day regarding the “good” and \"bad” narrative, it’s pointless. At the end of the day, I simply look at nature, humanity and what we have here on Earth when it comes to human beings as a microcosm for what could represent what’s ‘out there.’ I am sure there are all kinds of different groups with different perspectives and their own interests, who knows? I do feel the evidence showing that the phenomenon is quite old and ancient is quite strong, and take comfort in the idea that if there were such malevolent intentions, they probably would have already manifested. On the flip side, I think putting our world, interests and future in the hands of someone else and waiting for some type of saviour is also quite damaging. If we want our world to change, we are probably the ones we’ve been waiting for to do it. This also seem to be a common message from many experiencers. Governments seem to thrive off of pushing fear, and capitalize on anything they deem threatening or malevolent. This is usually done to put more control in the hands of the ‘elite’ few, and to justify unethical and immoral actions. Who knows, in this case it may be to justify even more surveillance as well as a network of space based weapons. We will see what happens. ]]>", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/u54IPWqF6no?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/u54IPWqF6no?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/GvH9knS46c0?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/GvH9knS46c0?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/U9PBM7_IBIQ?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/U9PBM7_IBIQ?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/lWm4ftt1-9g?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/lWm4ftt1-9g?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/lWm4ftt1-9g?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/lWm4ftt1-9g?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb5ae427f-924c-472f-838b-66569a10c29b_800x417.jpeg", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2eae8d73-27a5-4aec-aaba-3854981666e8_1380x1502.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Febf38534-3169-447d-aeb4-86d92532b6b1_1260x968.png", "https://www.regulations.gov/document/FDA-2023-P-0360-0001", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb463bb5c-c462-48d0-b1a1-2f362f5b5fa0_1264x354.png", "https://www.regulations.gov/docket/FDA-2023-P-0360", "https://www.thepulse.one/p/for-the-first-time-in-history-vaccine", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm", "https://www.eurosurveillance.org/content/10.2807/1560-7917.ES.2021.26.39.2100822", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8481107/", "https://www.medrxiv.org/content/10.1101/2021.07.31.21261387v2", "https://www.ucdavis.edu/health/covid-19/news/viral-loads-similar-between-vaccinated-and-unvaccinated-people", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4381627", "https://www.thepulse.one/p/renowned-scientists-ask-fda-to-change?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe6f510f3-394c-4018-b5a7-7cc2ed3e695b.avif", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "http://www.deanradin.com/", "https://www.researchgate.net/publication/258707222_Consciousness_and_the_double-slit_interference_pattern_Six_experiments", "http://www.nature.com/nphys/journal/v11/n7/full/nphys3343.html", "https://www.thepulse.one/p/consciousness-creates-reality-is?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://www.researchgate.net/publication/264463775_Manifesto_for_a_Post-Materialist_Science", "https://www.cia.gov/readingroom/docs/CIA-RDP96-00792R000300390001-2.pdf", "https://www.baylor.edu/casper/doc.php/285520.pdf", "https://fas.org/sgp/eprint/teleport.pdf", "https://www.cia.gov/readingroom/docs/CIA-RDP96-00792R000200650002-3.pdf", "https://www.cia.gov/readingroom/docs/CIA-RDP96-00792R000300390001-2.pdf", "https://www.thepulse.one/p/57-year-old-dead-man-describes-his?utm_source=%2Fsearch%2Fnear%2520death&utm_medium=reader2", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3902298/#B5", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3902298/#B4", "https://www.robertlanza.com/biocentrism-how-life-and-consciousness-are-the-keys-to-understanding-the-true-nature-of-the-universe/", "https://iopscience.iop.org/article/10.1088/1475-7516/2021/05/048", "https://www.nature.com/articles/436029a", "https://www.thepulse.one/p/consciousness-creates-reality-is?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4395387b-bb4e-45de-b424-45398beb1d96_1920x1080.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.thepulse.one/p/detaching-from-scientific-consensus", "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists", "https://www.whitehouse.gov/ostp/legal/", "https://www.washingtonpost.com/climate-environment/2023/02/27/geoengineering-security-war/", "https://nap.nationalacademies.org/catalog/25762/reflecting-sunlight-recommendations-for-solar-geoengineering-research-and-research-governance", "https://www.science.org/doi/10.1126/science.372.6537.19", "https://www.skywaterventures.com/uploads/7/0/6/1/70616003/wmr_documents.final_27_april_1.final.pdf", "https://archive.org/stream/weatificat00unit#page/n1/mode/2up", "https://www.forbes.com/sites/arielcohen/2021/01/11/bill-gates-backed-climate-solution-gains-traction-but-concerns-linger/", "https://youtu.be/_pz4W0NAckU", "https://www.solargeoeng.org/non-use-agreement/open-letter/", "https://www.reuters.com/article/us-china-agriculture-weather-idUSKBN28D01N", "https://apps.dtic.mil/sti/citations/ADA333462", "https://www.thepulse.one/p/the-white-house-and-billionaires?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d6e68df-93d5-4391-8b18-f123b7df6ce7_1920x1080.jpeg", "https://www.thepulse.one/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/Twitter", "https://www.cbc.ca/news/editorsblog/cbc-twitter-news-1.6813747", "https://www.thepulse.one/p/how-the-u-s-government-works-with-big-tech-to-censor-people-on-social-media?utm_source=%2Fsearch%2Fbig%2520tech&utm_medium=reader2", "https://www.thepulse.one/p/every-country-uses-propaganda-heres", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F505be12b-366d-437e-a93b-306e38d90d1d_1238x752.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff2a00d89-5c32-4f3e-9b78-c9cd14027ede_1224x1120.png", "https://www.thepulse.one/p/you-just-lied-elon-musk-shuts-down", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff4f9f642-a0c1-4503-910a-554fba9023bf_1934x1356.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcc9f3d26-65f0-437c-aafc-1f5745191b70_1924x1326.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8bfa604e-0d95-4e6d-b745-92ead6f2ef0d_1950x1354.png", "https://www.thepulse.one/p/cbc-upset-as-twitter-labels-them/comments", "https://substack.com/notes/post/p-109802097", "https://www.thepulse.one/p/how-we-are-being-misled", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb4b5362a-90aa-4d8e-88e5-fa9cfb9242c1_776x774.png", "https://www.thepulse.one/p/cbc-upset-as-twitter-labels-them?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff2f0e7d9-3050-4d85-854c-324aa19b3c6c_1000x576.jpeg", "https://open.spotify.com/episode/2YTpiafJ6eOu0TDl92Jzfn", "https://podcasts.apple.com/us/podcast/collective-evolution-with-joe-martino/id1327602180", "https://youtu.be/0PY_-4cdQvM", "https://www.collective-evolution.com/podcasts/collective-evolution-with-joe-martino/episodes/2147918400", "https://exoconsciousness.com/", "https://www.thepulse.one/p/the-transhumanist-agenda-is-there?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9865883c-8a50-4e29-ac48-f6988b29f809_1465x848.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/TheChiefNerd/status/1644107524797345793?s=20", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2719747/", "https://www.thepulse.one/p/where-did-the-claim-that-97-of-scientists?utm_source=%2Fsearch%2F97&utm_medium=reader2", "https://twitter.com/akheriaty/status/1645937691920568320?s=43&t=K7yxC7_YmO0qqpXj0mVeTw", "https://www.ag.state.la.us/Article/13106", "https://www.thepulse.one/p/new-emails-show-biden-administration?utm_source=%2Fsearch%2Ftrue%2520content&utm_medium=reader2", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30418-9/fulltext", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30418-9/fulltext", "https://www.wsj.com/articles/covid-origin-china-lab-leak-807b7b0a", "https://edition.cnn.com/2023/02/28/politics/wray-fbi-covid-origins-lab-china/index.html", "https://www.thepulse.one/p/new-emails-show-biden-administration?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://brownstone.org/articles/those-who-chose-shaming-over-science/", "https://gh.bmj.com/content/7/5/e008684", "https://www.thepulse.one/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination?utm_source=%2Fsearch%2Fautopsy&utm_medium=reader2", "https://www.thepulse.one/subscribe?", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F870c8ca7-150a-4825-ad82-b4f6d493d2ec_800x500.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10027302/pdf/main.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10027302/pdf/main.pdf", "https://twitter.com/TracyBethHoeg/status/1645446746317918209", "https://www.thepulse.one/p/for-the-first-time-in-history-vaccine?utm_source=%2Fsearch%2Ffirst%2520time%2520in%2520history&utm_medium=reader2", "https://www.thepulse.one/p/new-analysis-shows-how-the-cdc-spread", "https://legacy.thepulse.one/2022/04/28/12-year-old-girl-severely-injured-after-pfizer-jab-told-its-all-in-her-head/", "https://www.thepulse.one/p/new-analysis-shows-how-the-cdc-spread", "https://www.thefp.com/p/us-public-health-agencies-arent-following?r=abaxo&s=r&utm_campaign=post&utm_medium=web", "https://www.thepulse.one/p/senior-editor-of-british-medical-journal-speaks-out-about-covid-19-vaccine-safety-concerns?", "https://legacy.thepulse.one/2023/01/23/former-head-of-israels-defense-ministrys-biological-institute-speaks-out-against-covid-19-vaccines/", "https://www.thepulse.one/p/circulating-spike-protein-discovered?utm_source=%2Fsearch%2Fspike%2520protein&utm_medium=reader2", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://meridian.allenpress.com/aplm/article/doi/10.5858/arpa.2021-0435-SA/477788/Autopsy-Histopathologic-Cardiac-Findings-in-Two", "https://www.instagram.com/jab_injuries_australia/?hl=en", "https://www.thepulse.one/p/healthy-14-year-old-girl-dies-2-days?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F54d2dfe3-ec09-4c22-bbfa-28e931e3b37b_1546x918.png", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.youtube.com/watch?v=IflfP4XwzAI", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F028d9a4b-b0cf-4484-9b21-9eaaa70da31d_1276x1408.png", "https://www.thepulse.one/p/cochrane-review-masks-dont-work", "https://www.thepulse.one/p/a-team-of-international-scientists", "https://www.thepulse.one/p/new-analysis-shows-how-the-cdc-spread", "https://www.thepulse.one/p/8-useful-tools-for-discerning-truth", "https://www.thepulse.one/p/you-just-lied-elon-musk-shuts-down?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc5f2098b-5ddb-4457-bbeb-9f3eab675d19_1446x1122.png", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F331af082-7ec6-4b5d-abb9-64999d88eb34_500x466.png", "https://arc.aiaa.org/doi/10.2514/6.2002-1131", "https://youtu.be/OibqdwHyZxk?t=40", "https://www.youtube.com/watch?v=uN37MlR_Vbo", "https://nymag.com/intelligencer/2020/07/ufo-report-pentagon-has-off-world-vehicles-not-from-earth.html", "https://www.tandfonline.com/doi/abs/10.1080/07341512.2012.723340?journalCode=ghat20", "https://www.cia.gov/readingroom/docs/DOC_0000015471.pdf", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F34a57928-9042-458b-91d5-9b8eeadf3c9b_810x1032.png", "https://vimeo.com/51557405?embedded=false&source=video_title&owner=12951332", "http://projectcamelot.org/dimensions_of_mystery_otis_carr.pdf", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0a4f25f4-8570-46f4-ae45-675c3177022f_622x423.png", "https://archive.org/stream/OtisT.CarrAndTheTeslaSaucersbyDougYurchey/OtisTCarrTeslaSaucers_djvu.txt", "https://projectcamelotportal.com/2007/11/16/project-camelot-interviews-ralph-ring/", "https://www.linkedin.com/in/duaneabarker", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc4efc4f6-723a-4b55-87fc-8a9e7740df9d_712x672.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F76b4e30e-a4f6-45ef-8e6c-c548859cb148_703x660.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb43ae5b8-39de-4f20-bed6-39ce22126d65_791x713.png", "https://documents2.theblackvault.com/documents/fbifiles/paranormal/otiscarr-fbi1.pdf", "https://sgp.fas.org/othergov/invention/35usc17.html", "https://www.thepulse.one/p/13-years-ago-julian-assange-published", "https://sgp.fas.org/othergov/invention/pscrl.pdf", "http://fas.org/expert/steven-aftergood/", "https://www.youtube.com/watch?v=blojNMW-Ias", "https://www.thepulse.one/p/free-energy-generator-that-works-tewari-demonstrates-his-over-unity-machine?utm_source=%2Fsearch%2Ffree%2520energy&utm_medium=reader2", "https://www.thedrive.com/the-war-zone/38937/navy-ufo-patent-documents-talk-of-spacetime-modification-weapon-detail-experimental-testing", "https://patents.google.com/?inventor=Salvatore+Cezar+Pais", "https://arc.aiaa.org/doi/abs/10.2514/6.2019-0869", "https://www.youtube.com/watch?v=5E6QyAhTB3o", "https://patents.google.com/patent/US10144532B2/en", "https://www.prnewswire.com/news-releases/to-the-stars-academy-of-arts--science-launches-today-300534912.html", "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fdoi.org%2F10.1088%2F1361-6382%2Fabdf6e&esheet=52381576&newsitemid=20210218005846&lan=en-US&anchor=Classical+and+Quantum+Gravity&index=2&md5=710f7476677a7a0d289850b5a69a8772", "https://www.govinfo.gov/app/details/GPO-CDOC-105sdoc2", "https://www.washingtonpost.com/wp-srv/special/national/black-budget/", "https://www.youtube.com/watch?v=_Uah5vduKvg", "https://www.youtube.com/watch?v=4FWFAs9ffGk", "https://msutoday.msu.edu/news/2017/msu-scholars-find-21-trillion-in-unauthorized-government-spending-defense-department-to-conduct", "https://www.thepulse.one/p/the-story-of-otis-t-carr-the-man?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffb92b837-ba01-4916-ac9a-adff6f69b2a6_2024x1102.png", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.thepulse.one/p/what-the-vaccine-industry-says-behind#details", "https://www.thepulse.one/p/part-2-what-the-vaccine-industry?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e22adc8-b2b4-4a11-b363-c01ce4a37c98_1000x562.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.thepulse.one/p/another-big-foi-update-coming?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://www.thepulse.one/p/freedom-convoy-we-may-have-to-sue?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://www.thepulse.one/p/key-update-on-our-freedom-convoy?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://www.thepulse.one/p/another-big-foi-update-coming?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F539c42d5-2607-46a2-a985-04632fa265b5_1692x1120.png", "https://www.thepulse.one/p/what-the-vaccine-industry-says-behind?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F345fd298-eb30-4cf3-8778-273f19ccb865_2156x1206.png", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/wikileaks/status/1643629817508818944", "https://collateralmurder.wikileaks.org", "https://twitter.com/wikileaks/status/1643629817508818944", "https://www.youtube.com/watch?v=3ihPGtcHjNk", "https://www.lewrockwell.com/2019/05/karen-kwiatkowski/pray-and-weep/", "https://www.instagram.com/p/B_xaDQJHjxt/", "https://www.crowdjustice.com/case/assangeappeal/", "https://www.thepulse.one/p/13-years-ago-julian-assange-published?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9c073307-a63f-49c6-b12c-2773b57c53b7_1000x665.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://en.wikipedia.org/wiki/Nasreddin", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe2ffec67-b2fd-4eda-8671-07b1a73e819e_1120x484.png", "https://www.youtube.com/watch?v=b5dZBv3dzHM", "https://www.collective-evolution.com/mastering-the-art-of-critical-thinking", "https://www.collective-evolution.com/mastering-the-art-of-critical-thinking", "https://www.thepulse.one/p/8-useful-tools-for-discerning-truth?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe41de9bb-4dde-4ecf-9260-9eeaf914169e_1020x680.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.medrxiv.org/content/10.1101/2022.12.06.22283145v2.full-text", "https://www.bmj.com/content/376/bmj.o102?ijkey=9a79b58caf29472211bbb9f163d1d74e395279ce&keytype2=tf_ipsecsha", "https://www.aljazeera.com/news/2021/3/15/which-countries-have-halted-use-of-astrazenecas-covid-vaccine", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.medrxiv.org/content/10.1101/2022.12.06.22283145v2.full-text", "https://www.thepulse.one/p/a-team-of-international-scientists", "https://www.thepulse.one/p/new-analysis-shows-how-the-cdc-spread", "https://www.thepulse.one/p/circulating-spike-protein-discovered", "https://www.thepulse.one/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination", "https://www.thepulse.one/p/renowned-medical-researcher-and-colleague?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe58007a-3bca-4371-98d3-0be521a3dd07_2119x1192.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/DrAseemMalhotra/status/1641322215143530497", "https://theprint.in/world/british-indian-medic-backs-legal-review-of-covid-vaccine-in-south-africa-high-court-2/1482253/", "https://theprint.in/world/british-indian-medic-backs-legal-review-of-covid-vaccine-in-south-africa-high-court-2/1482253/", "https://twitter.com/DrAseemMalhotra", "https://twitter.com/DJEloff/status/1641496586206208000", "https://twitter.com/DJEloff/status/1641496586206208000", "https://www.thepulse.one/p/for-the-first-time-in-history-vaccine?utm_source=%2Fsearch%2Ffirst%2520time%2520in%2520history&utm_medium=reader2", "https://www.thepulse.one/p/senior-editor-of-british-medical-journal-speaks-out-about-covid-19-vaccine-safety-concerns?utm_source=%2Fsearch%2FBRITISH%2520MEDICAL&utm_medium=reader2", "https://doi.org/10.1016/j.vaccine.2022.08.036", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://www.thepulse.one/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination?utm_source=%2Fsearch%2Fautopsy&utm_medium=reader2", "https://meridian.allenpress.com/aplm/article/146/8/925/477788/Autopsy-Histopathologic-Cardiac-Findings-in-2", "https://www.thepulse.one/p/a-team-of-international-scientists?utm_source=substack&utm_medium=email&utm_content=share&action=share", "http://In a new study published on January 3, 2023, in the journal Circulation, the authors describe how “free spike antigen” was “detected in blood of adolescents & young adults who developed post-mRNA vaccine myocarditis, advancing insight into potential underlying cause” of vaccine induced myocarditis.", "https://www.instagram.com/jab_injuries_australia/?hl=en", "https://www.westernsydney.edu.au/nicm/about_us/board_and_committees/nicm_advisory_board/kerryn_phelps", "https://www.starobserver.com.au/features/community-spotlight/closet-case-kerryn-phelps-jackie-stricker/134620", "https://www.thepulse.one/p/former-president-of-australian-medical", "https://www.thepulse.one/p/12-year-old-girl-severely-injured-after-pfizer-jab-told-its-all-in-her-head?utm_source=%2Fsearch%2Fall%2520in%2520her%2520head&utm_medium=reader2", "https://www.thepulse.one/p/new-emails-show-biden-administration?utm_source=%2Fsearch%2Ftrue%2520content&utm_medium=reader2", "https://pubmed.ncbi.nlm.nih.gov/21532766/", "https://www.crimejusticejournal.com/article/view/888", "https://www.thepulse.one/?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F8a538c50-27e2-47d7-a53b-699f2b0cf64a_970x615.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.thepulse.one/p/most-major-threats-these-days-are?utm_source=%2Fsearch%2Ffalse%2520flag&utm_medium=reader2", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbbb1dc58-9f0d-4835-9e8a-1cf690b496e6_1582x910.png", "https://www.youtube.com/watch?v=YY1saJ80vL4", "https://www.thepulse.one/p/tucker-carlsons-claim-of-troops-dying?utm_source=%2Fsearch%2Ftucker&utm_medium=reader2", "https://www.thepulse.one/p/a-massive-ufo-incident-from-1942?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://biblio.uottawa.ca/atom/index.php/smith-wilbert-b", "https://www.youtube.com/watch?v=_Uah5vduKvg", "https://static1.squarespace.com/static/5cf80ff422b5a90001351e31/t/5d02ec11935aac0001691dde/1560472596796/narcap_TR-8_2002.pdf", "https://www.thepulse.one/p/a-massive-ufo-incident-from-1942?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4758eb23-37dc-4b71-92b0-7d8b506876f2_800x500.webp", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4381627", "https://www.thepulse.one/p/new-emails-show-biden-administration", "https://twitter.com/TracyBethHoeg/status/1638922016509300736", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4381627", "https://twitter.com/TracyBethHoeg/status/1638922016509300736", "https://twitter.com/VPrasadMDMPH/status/1638909321072214018", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4381627", "https://twitter.com/VPrasadMDMPH/status/1638909321072214018", "https://www.nejm.org/doi/full/10.1056/NEJMc2026670", "https://www.mcri.edu.au/sites/default/files/media/documents/covid-19_and_childrens_surveillance_report_13_210322-v2.pdf", "https://gh.bmj.com/content/7/5/e008684", "https://www.thefp.com/p/us-public-health-agencies-arent-following?r=abaxo&s=r&utm_campaign=post&utm_medium=web", "https://www.thefp.com/p/us-public-health-agencies-arent-following?r=abaxo&s=r&utm_campaign=post&utm_medium=web", "https://twitter.com/VPrasadMDMPH/status/1638909328445829121", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4381627", "https://twitter.com/VPrasadMDMPH/status/1638909328445829121", "https://usrtk.org/wp-content/uploads/2016/10/CDC_SPIDER_Letter-1.pdf", "https://usrtk.org/", "https://www.thepulse.one/p/new-analysis-shows-how-the-cdc-spread?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F193219a5-c36f-4ae5-bcca-8d00dbd25290_1000x664.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://www.thepulse.one/p/the-cdc-finally-acknowledges-the-power-of-natural-immunity", "https://www.collective-evolution.com/", "https://www.thepulse.one/p/the-us-is-still-not-following-the?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff16f4ce5-aa9e-4e13-81ba-25669223a933_1500x844.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/tomdelonge/status/1638955069709373441", "https://tothestars.media/en-ca/pages/about", "https://www.nytimes.com/2017/12/16/us/politics/pentagon-program-ufo-harry-reid.html", "https://twitter.com/tomdelonge/status/1639270808332783622", "https://arielphenomenon.com/", "https://www.youtube.com/watch?v=dLVKtVHdLiM", "https://www.youtube.com/watch?v=U8Ibolcw8dw", "https://youtu.be/TukvVnadRic", "https://www.thepulse.one/p/tom-delonge-makes-some-very-irresponsible?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": [], "publish_date": null}