{"result_id": "303035", "URL": "https://www.thepulse.one/p/a-curious-case-of-aluminum-vaccines", "timestamp": "2023-04-25 17:30:52 CEST+0200", "meta": {"description": "Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. As I've said before, the COVID pandemic marked the first time in history when a plethora of experts (vaccine developers, doctors, renowned scientists)", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/a-curious-case-of-aluminum-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "A Curious Case of Aluminum, Vaccines, Autism & Censorship Before COVID", "cleaned_text": "Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this.\n\nAs I've said before, the COVID pandemic marked the first time in history when a plethora of experts (vaccine developers, doctors, renowned scientists) were labelled as \"anti-vaccine conspiracy theorists\" for presenting science, data and opinions that called into question what we were being told about mRNA COVID vaccines since their inception.\n\nOfficial government programs that monitored and tracked academics, journalists and others who engaged in this type of behaviour have now been exposed, but is the general public aware of this? Unfortunately not.\n\nMany people still don't know that the censorship of academics has been an ongoing issue for years. One of many excellent examples comes from Dr. Christopher Exley, a renowned chemist and one of the world's foremost experts in aluminum toxicology/biochemistry. He was the group leader at the Birchall Centre at Keele University, which researches the role of metals in biology and materials science. He was also a Professor of Bioinorganic Chemistry there for many years. He has published more than 200 papers/studies in various scientific and medical journals, but when he decided to study aluminum adjuvants in vaccines, all hell broke loose and a smear campaign began.\n\nExley explains in a post written in February of 2022 on his Substack,\n\nHe goes on,\n\n\"Why has the aluminium industry chosen this time to use its influence in bringing our research to an end? I contend that it is because it is running scared of recent research published by my group. Specifically, our research on Alzheimer’s disease showing unequivocally that susceptibility to developing Alzheimer’s disease equates to a predisposition to accumulate aluminium in brain tissue. This is the alarming (for industry) conclusion of our recent research on familial Alzheimer’s disease. Aluminium is a cause of Alzheimer’s disease and while the aluminium industry may not have known this already they certainly suspected this for many years. However, perhaps the straw that broke the camel’s back was not our research on Alzheimer’s disease but our work on aluminium adjuvants used in vaccination. We showed how infiltrating cells at vaccination sites accumulate aluminium adjuvant in their cytoplasm. How these cells laden with aluminium migrate not only to lymph nodes but throughout the body and most critically into brain tissue. We identified a mechanism whereby neurotoxic amounts of aluminium could be rapidly transported and deposited in brain tissue. A mechanism whereby aluminium adjuvants could produce and encephalopathy in a vaccinated infant. The aluminium industry heard this bell tolling for aluminium adjuvants and recognized that it had to be silenced immediately.\"\n\nA 2020 study published by Exley and his group found that the aluminum content in brain tissue of people with Alzheimer's disease, familial Alzheimer's disease, autism spectrum disorder, and multiple sclerosis is significantly higher compared to tissues used in the study as controls.\n\nFor Exley, the controversy seemed to start in 2017-2018 when his group published a paper in the Journal of Trace Elements in Medicine & Biology showing very high amounts of aluminum in the brain tissue of people with autism. The elevated aluminum levels rivalled the very high levels historically reported in victims of dialysis encephalopathy syndrome, a serious iatrogenic disorder resulting from aluminum-containing dialysis solutions.\n\nThe paper has since been downloaded more than one million times, and was obviously heavily criticized within the mainstream due its lack of controls and small sample size. But when he published the 2020 study with controls mentioned above, there was complete silence.\n\nHis group has looked at more than 100 brains, and he has emphasized multiple times that what he has seen in these autistic and Alzheimer's brains is clearly and obviously not normal.\n\n“What we had the opportunity to do was to measure the aluminum content of the brain of individuals who died with a diagnosis of autism. So we were able to do two things, we were able to measure how much aluminum is in the brain of individuals who died with autism, but also we were able to look at the aluminum in the tissue using a microscopy technique called Florence. The amount of aluminum in the brain tissue was, I would say, extraordinarily high, very high. My group has measured the aluminium content of probably more than 100 human brains, and, these brain tissues taken from the individual’s with a diagnosis of autism were some of the highest we’ve measured bar none, the only ones we’ve seen that are similar were a recent study in familial Alzheimer’s. So, in this relatively young group of people…we saw more aluminum than we’ve seen in almost any other circumstance. So this in itself is a very important finding. Perhaps equally important, if not more important, were the microscopy studies. The microscopy studies enabled us to identify where the aluminum was in the brain tissue. When we looked at our brains from people with a diagnosis of autism, we found something completely different and something we’ve never seen before as yet in any other set of human brains. We found that the majority of aluminum was actually inside cells, intracellular, some of it was inside neurones, but actually the majority of it was inside non neuronal cell populations. So we found that these cells were heavily loaded with aluminum. We also saw evidence that cells in the lymph and in the blood were passing into the brain. So they were carrying with them a cargo of aluminum from the body into the brain. This is the first time in any human brain tissue we have seen this, so this is a standout and as yet unique observation in autism. For myself, it very much implicates aluminum in the etiology of autism. That doesn’t mean aluminum causes it, but it means it’s almost certainly playing a role in the disease. Before we did this piece of research, there were a number of possible links between aluminum and autism. I did not see that the science there was strong enough in any way to make that a really positive link. So I did not see a role for aluminum in autism and I didn’t see a role for aluminum in vaccines for autism. I have to change my mind now on both of these… But now, because I have seen the same cells that we would see at an injection site carrying a cargo of aluminum into the brain tissue of individuals who died with autism, I would now say that we have to think very carefully about who receives a vaccine which includes an aluminum adjuvant. \n\n\n\nYou know we need to think carefully, is this vaccine a life saving vaccine or not, and if it isn’t, don’t have it with an aluminum adjuvant. We’re not necessarily talking about immediate effects either, we’re talking about potential long term effects…\n\n\n\nIt is incredibly difficult to do this research, no government funded this research. This research came because of philanthropy, it came because of individuals who wanted to know answers and were prepared to use their own money. We pay our government and our government should really be using our money to fund this type of research.”\n\nAs he explains, his research does not mean aluminum is causing these conditions, but simply hypothesizes that it can't be excluded, may play a role, and further research is needed. But academic institutions don't seem to be interested in this important research, and won't encourage it. In fact, they won't even allow it to happen.\n\nFollowing up the papers mentioned above, Exley published a paper titled “The role of aluminum adjuvants in vaccines raises issues that deserve independent, rigorous and honest science.” In the publication, the authors provide evidence for their position that:\n\nExley wasn't the only. I remember when I first came across this research and asked, \"well, doesn't everybody ingest aluminum through foods, medicines etc, so what's the difference?\"\n\nDr. Christopher Shaw, a professor and neuroscientist from the University of British Columbia, Canada explains,\n\nIn 2018 Shaw published a paper in the Journal of Inorganic Biochemistry that found almost 100 percent of the intramuscularly injected aluminum in mice as vaccine adjuvants was absorbed into systemic circulation and traveled to different sites in the body such as the brain, the joints, and the spleen where it accumulated and was retained for years post-vaccination.\n\nThere are in fact multiple correlating studies like this. A 2015 study published in BMC medicine explains,\n\nInterestingly, fact checkers critical of our reporting on Exley did not seem to have the same expertise as the people who have spent their careers studying aluminum. Health Feedback, an opinion website representing themselves as fact checkers, was critical of an article I wrote, and claimed that aluminum in vaccines cannot cause brain damage. Here is what they said about my piece:\n\nThey went on to quote the Children’s Hospital of Philadelphia:\n\nEven the hospital is unaware of what the research says about the difference between injected and ingested aluminum. Why would they be debunking my piece that clearly discussed the differences between ingested and injected aluminum by stating infants get more in their diet? This are the literal points I am being nuanced about and they gloss over it.\n\nLet's get back to Exley. Another video below will give you a good idea of the implications of Exley's research.\n\nI'd like to leave you with a quote from Arnold Seymour Relman (1923-2014), Harvard Professor of medicine and former Editor in Chief of the New England Medical Journal. I've used it many times, but is extremely powerful.", "opengraph": {"url": "https://www.thepulse.one/p/a-curious-case-of-aluminum-vaccines", "type": "article", "title": "A Curious Case of Aluminum, Vaccines, Autism & Censorship Before COVID", "description": "Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this. As I've said before, the COVID pandemic marked the first time in history when a plethora of experts (vaccine developers, doctors, renowned scientists)", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffafcc60c-8e1b-422a-8b55-6a36bc37de4b_1000x648.jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe src=\"https://www.youtube-nocookie.com/embed/Ju4-lKwQ4ak?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" frameborder=\"0\" loading=\"lazy\" gesture=\"media\" allow=\"autoplay; fullscreen\" allowautoplay=\"true\" allowfullscreen=\"true\" width=\"728\" height=\"409\"/>", "src": "https://www.youtube-nocookie.com/embed/Ju4-lKwQ4ak?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffafcc60c-8e1b-422a-8b55-6a36bc37de4b_1000x648.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://tpulse.substack.com/p/for-the-first-time-in-history-vaccine", "https://twitter.com/Snowden/status/1620149295407308800", "https://drchristopherexley.substack.com/p/the-aluminium-aluminum-industry-is", "https://www.nature.com/articles/s41598-020-64734-6", "https://www.nature.com/srep/highlights/top-articles", "https://www.nature.com/collections/feidhcahdd", "https://drchristopherexley.substack.com/p/censorship-again", "https://www.sciencedirect.com/science/article/pii/S0946672X17308763", "http://www.nejm.org/doi/full/10.1056/NEJM197601222940402", "https://rumble.com/v1ui5ew-dr.-chris-exley-makes-an-astonishing-discovery-regarding-autism.html", "https://www.sciencedirect.com/science/article/pii/S0946672X20301978", "https://youtu.be/FfTo35UrFPA", "https://www.sciencedirect.com/science/article/pii/S0162013417304749", "https://pubmed.ncbi.nlm.nih.gov/26082187/", "https://www.youtube.com/watch?v=Ju4-lKwQ4ak&embeds_euri=https%3A%2F%2Ftpulse.substack.com%2F&feature=emb_logo", "https://healthfeedback.org/claimreview/vaccines-do-not-cause-neurological-damage-aluminum-levels-in-vaccines-are-safe-collective-evolution/", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccine-ingredients/aluminum", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1126053/", "https://www.thepulse.one/p/a-curious-case-of-aluminum-vaccines?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Arjun Walia"], "publish_date": "2023-02-13T14:36:10+00:00"}