{"result_id": "303041", "URL": "https://www.thepulse.one/p/a-team-of-international-scientists", "timestamp": "2023-04-25 17:30:56 CEST+0200", "meta": {"description": "The lawsuit suggests there has been an unprecedented rise in vaccine injuries, and that data reveals an association with increasing death from both COVID & non-COVID causes in the vaccinated.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/a-team-of-international-scientists", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "A Team of International Scientists & Leading Medical Professionals Are Taking Pfizer To Court In South Africa", "cleaned_text": "Set Your Pulse: Take a breath. Release the tension in your body. Place attention on your physical heart. Breathe slowly into the area for 60 seconds, focusing on feeling a sense of ease. Click here to learn why we suggest this.\n\nRenowned scientists and medical experts calling into question the safety and efficacy of multiple vaccines is nothing new and has been happening throughout the pandemic.\n\nThe latest example comes from South Africa. A case filed on March 23 in the high court of Pretoria, South Africa by international scientists and leading medical professionals demands urgent judicial review of Pfizer’s mRNA COVID vaccine products. They are arguing that the products are unsafe and ineffective.\n\nThe suit claims that there has been an unprecedented rise in vaccine injuries, and cites data that apparently reveals an association with increasing death from both COVID and non-COVID causes in the vaccinated compared to the unvaccinated.\n\nAccording to the Freedom Alliance of South Africa (FASA), who has initiated the case,\n\nFASA has approached the court to review and set aside the authorization of Pfizer’s vaccine products on the basis that the authorization was “unlawful.” If successful, this could result in the removal of COVID mRNA vaccines from the South African market and also have global implications.\n\nDr. Herman Edeling, a specialist neurosurgeon with over 40 years of experience, claims in the affidavit that the mRNA vaccine administered as Comirnaty in South Africa should “never have been branded as ‘safe’ and ‘effective.’\n\nAccording to him,\n\nDr. Aseem Malhotra, who prior to the pandemic was known as one of the most influential cardiologists in Britain and a world-leading expert in the prevention, diagnosis and treatment of heart disease, is another scientist supporting the case.\n\nAccording to him,\n\n“Having critically appraised the literature and the Pfizer trial data, the evidence is unequivocal. For the overwhelming majority of people, the Pfizer COVID mRNA vaccine is significantly more harmful than beneficial and likely should never have been approved to be administered to a single human being,” said Malhotra, who himself took two doses of the Pfizer vaccine and is now backing the show cause notice. It is alarming to me that the local regulators are encouraging the vaccination of young children in the circumstances. The rollout of the Pfizer vaccine products should, in my opinion, be halted pending a full investigation into how we got this so very wrong. That is, without question, the responsible and ethical move.”\n\nMalhotra believes the case is “factually, medically and scientifically sound”. He’s been quite active on twitter writing about it.\n\nDaniel Eloff, the attorney in the case, recently tweeted the following:\n\nLike I said, renowned experts in the field questioning COVID vaccine safety and efficacy is nothing new.\n\nAccording to Dr. Peter Doshi, a senior editor at the British Medical Journal (BMJ) and associate professor at the University of Maryland School of Pharmacy,\n\nDoshi was part of an international group of eminent academics and physicians who went back and analyzed safety data from the original clinical trials that were the backbone of the FDA’s decision to authorize the mRNA vaccines in December 2020. It was published in the peer-reviewed journal, Vaccine in September 2022.\n\nThe analysis showed that mRNA vaccines were associated with 1 additional serious adverse event for every 800 people vaccinated. This would normally have a vaccine taken off the market. The authors also found that the trial data showed that the increase in serious adverse events following mRNA vaccination surpassed the reduction in risk of ending up hospitalized with COVID-19.\n\nOther questionable publications have writers like me confused. For example, A paper published in Clinical Cardiology on November 27, 2022 titled \"Autopsy-based histopathological characterization of myocarditis after anti-SARS-CoV-2-vaccination\" describes the cardiac autopsy findings in five persons who died unexpectedly within seven days following COVID-19 vaccination. They point out the high likelihood that these deaths were a result of the vaccine, and explain why.\n\nNote that 20 of 25, also vaccinated days earlier, were determined to have died of other causes. You can read more about that story in detail, here.\n\nThere are other similar autopsy reports that have concluded that cause of death was a result of COVID vaccines.\n\nThere are also concerning reports from the Vaccine Adverse Events Report System (VAERS) that are never really included in official 'data' which include autopsy reports as well. The number of injuries and deaths reported to VAERS for COVID vaccines represents at least 50 percent of vaccine injuries since the inception of VAERS, so this is another concerning signal.\n\nThen there is other concerning science I’ve come across, along with hundreds, if not thousands of people sharing what they believe to be severe injuries as a result of COVID vaccines across social media throughout the pandemic. Jab injuries Australia is one of many examples.\n\nAs I write about Australia, I am reminded of Dr. Kerryn Phelps, an advisory board member and conjoint professor at the NICM Health Research Institute, and the first woman elected president of the Australian Medical Association. She also raised concerns regarding various COVID vaccine injuries.\n\nFurthermore, no response from the manufacturer or health authorities regarding these safety signals has been given. They are also, under the law, completely protected from any wrongdoing. Maddie De Garay, for example, was a healthy and active 12 year old girl up until receiving her second dose of Pfizer's COVID vaccine. She received it during the clinical trial for 12-15 year olds at Cincinnati Children's Hospital. She has been debilitated ever since, but has been told “it’s all in her head.”\n\nWhy is nobody hearing about these signals? Why are they commonly presented, if at all, as baseless “conspiracy theories” by mainstream media? Why did the Biden administration work with Big Tech to censor what they admitted to be “true content” regarding COVID vaccines just because it threatened government policy? Why doesn’t anybody know that Pfizer has paid some of the largest criminal fines in history?\n\nEven if only 0.5 percent of people who have taken an mRNA COVID vaccine suffer health consequences as a result of it in the short and/or long term, it would be something unprecedented.\n\nTo finish, I would like to draw your attention to a quote taken from a paper published in the International Journal for Crime, Justice and Social Democracy by professor Paddy Rawlinson, from Western Sydney University.\n\n“Critical criminology repeatedly has drawn attention to the state-corporate nexus as a site of corruption and other forms of criminality, a scenario exacerbated by the intensification of neoliberalism in areas such as health. The state-pharmaceutical relationship, which increasingly influences health policy, is no exception. That is especially so when pharmaceutical products such as vaccines, a burgeoning sector of the industry, are mandated in direct violation of the principle of informed consent. Such policies have provoked suspicion and dissent as critics question the integrity of the state-pharma alliance and its impact on vaccine safety. However, rather than encouraging open debate, draconian modes of governance have been implemented to repress and silence any form of criticism, thereby protecting the activities of the state and pharmaceutical industry from independent scrutiny. The article examines this relationship in the context of recent legislation in Australia to intensify its mandatory regime around vaccines. It argues that attempts to undermine freedom of speech, and to systematically excoriate those who criticize or dissent from mandatory vaccine programs, function as a corrupting process and, by extension, serve to provoke the notion that corruption does indeed exist within the state-pharma alliance.”", "opengraph": {"url": "https://www.thepulse.one/p/a-team-of-international-scientists", "type": "article", "title": "A Team of International Scientists & Leading Medical Professionals Are Taking Pfizer To Court In South Africa", "description": "The lawsuit suggests there has been an unprecedented rise in vaccine injuries, and that data reveals an association with increasing death from both COVID & non-COVID causes in the vaccinated.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe58007a-3bca-4371-98d3-0be521a3dd07_2119x1192.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbe58007a-3bca-4371-98d3-0be521a3dd07_2119x1192.jpeg", "https://tpulse.substack.com/p/a-new-media-approach-for-improved-sense-making-through-physiological-coherence", "https://twitter.com/DrAseemMalhotra/status/1641322215143530497", "https://theprint.in/world/british-indian-medic-backs-legal-review-of-covid-vaccine-in-south-africa-high-court-2/1482253/", "https://theprint.in/world/british-indian-medic-backs-legal-review-of-covid-vaccine-in-south-africa-high-court-2/1482253/", "https://twitter.com/DrAseemMalhotra", "https://twitter.com/DJEloff/status/1641496586206208000", "https://twitter.com/DJEloff/status/1641496586206208000", "https://www.thepulse.one/p/for-the-first-time-in-history-vaccine?utm_source=%2Fsearch%2Ffirst%2520time%2520in%2520history&utm_medium=reader2", "https://www.thepulse.one/p/senior-editor-of-british-medical-journal-speaks-out-about-covid-19-vaccine-safety-concerns?utm_source=%2Fsearch%2FBRITISH%2520MEDICAL&utm_medium=reader2", "https://doi.org/10.1016/j.vaccine.2022.08.036", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://www.thepulse.one/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination?utm_source=%2Fsearch%2Fautopsy&utm_medium=reader2", "https://meridian.allenpress.com/aplm/article/146/8/925/477788/Autopsy-Histopathologic-Cardiac-Findings-in-2", "https://www.thepulse.one/p/a-team-of-international-scientists?utm_source=substack&utm_medium=email&utm_content=share&action=share", "http://In a new study published on January 3, 2023, in the journal Circulation, the authors describe how “free spike antigen” was “detected in blood of adolescents & young adults who developed post-mRNA vaccine myocarditis, advancing insight into potential underlying cause” of vaccine induced myocarditis.", "https://www.instagram.com/jab_injuries_australia/?hl=en", "https://www.westernsydney.edu.au/nicm/about_us/board_and_committees/nicm_advisory_board/kerryn_phelps", "https://www.starobserver.com.au/features/community-spotlight/closet-case-kerryn-phelps-jackie-stricker/134620", "https://www.thepulse.one/p/former-president-of-australian-medical", "https://www.thepulse.one/p/12-year-old-girl-severely-injured-after-pfizer-jab-told-its-all-in-her-head?utm_source=%2Fsearch%2Fall%2520in%2520her%2520head&utm_medium=reader2", "https://www.thepulse.one/p/new-emails-show-biden-administration?utm_source=%2Fsearch%2Ftrue%2520content&utm_medium=reader2", "https://pubmed.ncbi.nlm.nih.gov/21532766/", "https://www.crimejusticejournal.com/article/view/888", "https://www.thepulse.one/?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Arjun Walia"], "publish_date": "2023-04-02T13:40:12+00:00"}