{"result_id": "303046", "URL": "https://www.thepulse.one/p/former-head-of-israels-defense-ministrys", "timestamp": "2023-04-25 17:31:00 CEST+0200", "meta": {"description": "Professor Shmuel Shapira, M.D., MPH, who served as the Director General of the Israel Institute for Biological Research (IIBR) between 2013 and 2021, is one of thousands of renowned scientists who have raised serious concerns with COVID-19 mRNA vaccines.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/former-head-of-israels-defense-ministrys", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "Former Head of Israels Defense Ministry’s Biological Institute & Vaccine Developer Speaks Out Against COVID-19 mRNA Vaccines", "cleaned_text": "Professor Shmuel Shapira, M.D., MPH, who served as the Director General of the Israel Institute for Biological Research (IIBR) between 2013 and 2021, is one of thousands of renowned scientists who have raised serious concerns with COVID-19 mRNA vaccines.\n\nThe COVID-19 pandemic marked the first time in history when renowned vaccine experts, developers, scientists and doctors were ridiculed and labelled as “anti-vaxxers” en masse. I provide more examples in an article I published on January 9, 2023.\n\nShapira is also the former head developer of Israel’s experimental coronavirus vaccine. He played a central role in the original development of Israel’s BriLife COVID-19 vaccine. It was a protein based live virus vaccine, not an mRNA shot.\n\nThe IIBR was tapped early in the pandemic, in February 2020, to develop a vaccine and seemed to be making significant progress until efforts were slowed and Israel launched its mass vaccination campaign with the Pfizer-BioNTech shot last December.\n\nThe vaccine was eventually scraped, and ever since he has been quite critical about mRNA based COVID-19 vaccines. Despite having been vaccinated himself, Shapira feels that he and many others were coerced, pressured, and forced to take the jab. Lest we forget, many people lost their ability to work, put food on the table, pay their bills, travel, and more for choosing not to get vaccinated.\n\nAccording to Shapira, the approval and distribution of COVID-19 mRNA vaccines was not done from a place of ‘good’ and with the intention to serve others, but rather to “rake in billions.” He stated that they are “mediocre” vaccines and calling them even moderately effective is “pretty generous.”\n\nLast May, Shapira stepped down from the directorship of the Biological Institute in a surprise turn of events that cast doubt on the future of the local inoculation venture. In a new book, he claimed that heavy government interference, unexplained regulatory delays, and some level of “sabotage” were also at play.\n\nShapira isn’t the only prominent figure in Israel to make such “controversial” comments. The head of the Department of Microbiology and Immunology at Tel Aviv University, Professor Ehud Qimron, has criticized the government for their pandemic policies. In a letter written to the Ministry of Health he outlines the failure of lockdowns, vaccines, and the failure to acknowledge natural immunity and vaccine injuries. The letter was very critical, you can access it here.\n\nIf you’re curious about the difference between protein based COVID vaccines and mRNA shots, you can find out more from this article published by Maryanne Demasi, PhD.\n\nIf you’re curious as to why people like myself didn’t get vaccinated, and reasons that go beyond what’s mentioned in this particular article, I provide a science/evidence based explanation in this article I published last month on December 12, 2022.\n\nThe next question becomes, with so much data, information and evidence that, at the very least, warrants freedom of choice, what can we do when governments who have so much power restrict our freedom for not complying?\n\nIn a world where our movement and ability to make a living may be threatened via non-compliance again in the future, what steps can we take to change this? How can we ensure the survival of information against governments and mainstream media organizations who only present a one sided, black and white perspective, while simultaneously ridiculing information and evidence that counters what they say?\n\nI like to feel that when I look at the general public’s response at this moment to what happened during COVID, if something like this happens again, governments may have a very hard time enforcing mandates. This was in part thanks to many people, including experts in the field, speaking out against measures that were not really backed by science, but rather, propaganda.", "opengraph": {"url": "https://www.thepulse.one/p/former-head-of-israels-defense-ministrys", "type": "article", "title": "Former Head of Israels Defense Ministry’s Biological Institute & Vaccine Developer Speaks Out Against COVID-19 mRNA Vaccines", "description": "Professor Shmuel Shapira, M.D., MPH, who served as the Director General of the Israel Institute for Biological Research (IIBR) between 2013 and 2021, is one of thousands of renowned scientists who have raised serious concerns with COVID-19 mRNA vaccines.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5429b27d-56e8-498e-ade2-9995e90a049a_1361x849.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5429b27d-56e8-498e-ade2-9995e90a049a_1361x849.jpeg", "https://tpulse.substack.com/p/for-the-first-time-in-history-vaccine", "https://twitter.com/shmuelcshapira/status/1616642939630895105", "https://twitter.com/shmuelcshapira/status/1616642939630895105", "https://www.timesofisrael.com/ex-head-developer-of-israeli-covid-vaccine-slams-genesis-prize-for-pfizer-ceo/", "https://www.ynetnews.com/magazine/article/ry38h13wt", "https://tpulse.substack.com/p/leading-israeli-immunologist-slams-israeli-ministry-of-health-for-all-covid-policies", "https://maryannedemasi.com/publications/f/is-spike-protein-%E2%80%9Ctoxic%E2%80%9D", "https://tpulse.substack.com/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination", "https://www.thepulse.one/p/former-head-of-israels-defense-ministrys?utm_source=substack&utm_medium=email&utm_content=share&action=share"], "authors": ["Arjun Walia"], "publish_date": "2023-01-23T13:30:54+00:00"}