{"result_id": "303033", "URL": "https://www.thepulse.one/p/circulating-spike-protein-discovered", "timestamp": "2023-04-25 17:30:50 CEST+0200", "meta": {"description": "In a new study published on January 3, 2023, in the journal Circulation, the authors describe how “free spike antigen” was “detected in blood of adolescents & young adults who developed post-mRNA vaccine myocarditis, advancing insight into potential underlying cause” of vaccine induced myocarditis.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/circulating-spike-protein-discovered", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "Circulating Spike Protein Discovered In Blood of Children & Young Adults With Vaccine Induced Myocarditis", "cleaned_text": "In a new study published on January 3, 2023, in the journal Circulation, the authors describe how “free spike antigen” was “detected in blood of adolescents & young adults who developed post-mRNA vaccine myocarditis, advancing insight into potential underlying cause” of vaccine induced myocarditis.\n\nThe researchers collected blood from 16 patients who were hospitalized at Massachusetts General for Children or Boston Children’s Hospital for myocarditis shortly after COVID-19 vaccination. Collection was done from January 2021 through February 2022, and their results were compared with those from 45 healthy, asymptomatic, age-matched vaccinated control subjects.\n\nThe spike protein was detected in the blood of adolescents and young adults who developed post-mRNA vaccine myocarditis, but not in the healthy control subjects who didn’t.\n\nThis study, among others, begs the question, what happens after vaccination? What are the mechanisms of action? Where do the contents of the vaccine go and what do they do inside of the body? Why is what happens different for each person? Do the vaccine contents simply stay at the injection site, or do they travel elsewhere? And if they travel elsewhere, are there potential health consequences associated with that?\n\nWe are told that it’s simple, that mRNA vaccines simply give your cells instructions for how to make the spike protein found on the surface of the COVID-19 virus. After vaccination, your muscle cells begin making the spike protein pieces and displaying them on cell surfaces. This causes your body to create antibodies against the virus.\n\nThis may be true for some, but evidence continues to suggest it’s not as simple as we’ve been told. The findings of this new study may be key to understanding as to why serious vaccine injuries, including death, are being reported in record amounts.\n\nBio-distribution studies are a standard practice of drug safety testing. But given the rush and ‘speed-up’ of the production of COVID-19 mRNA vaccines, normal safety testing and the usual long term studies were not able to be conducted. In essence, the human race became one giant human clinical trial – even though that’s a controversial statement to make.\n\nAs early as May 2021, Pfizer and Moderna did not respond to The British Medical Journal (BMJ) and their questions regarding why no bio-distribution studies were conducted on their mRNA products. According to a piece written by Dr. Peter Doshi, Senior Editor at the British Medical Journal,\n\nWhen I first read this I was quite concerned, because mRNA molecules have been deliberately manipulated to become more stable once inside the cell. A “pseudouridine” molecule has been added to the mRNA to give it a longer half-life than normal mRNA. Therefore, the production of spike protein within the cell, of those who have been vaccinated, is not being turned off. The implications of this are not well understood, and it is unknown for how long spike protein production continues within the cell. This is a big deal.\n\nThe concerning thing about this is that studies, like the one above, show that spike protein can leak outside of the cell and enter into the blood stream. This is one possible way vaccine injuries, like myocarditis, are occurring.\n\nPerhaps if appropriate bio-distribution studies were conduced this safety signal would have been recognized before mass deployment.\n\nAt the time the BMJ raised these concerns, a May 2021 study was published showing that spike protein could be detected in the blood of 11 of the 13 participants following vaccination with the Moderna mRNA vaccine.\n\nA study by Röltgen et al. published in early 2022 found that the vaccine mRNA persists in the body up to 60 days, with 60 days being the end point of their study. It would be interesting to see a study up to one year post vaccination, but even 60 days is concerning.\n\nA March 2022 study published in the journal Cell, showed that vaccine-derived spike protein and mRNA persist for up to two months in the germinal centres of lymph nodes.\n\nDuring an autopsy of a vaccinated person that had died after mRNA vaccination, it was found that the vaccine disperses rapidly from the injection site and can be found in nearly all parts of the body. These findings were published in June 2021 in the International Journal of Infectious Diseases.\n\nPharmacokinetics data provided by Pfizer to the European Medicines Agency (EMA) also showed that the contents of the vaccine did not stay at the injection site, and that one major site of distribution was the liver. As a result, the animals that received the Pfizer injection experienced adverse effects. The vaccine contents are distributed by what are called Lipid Nanoparticles (LNP), and it has been shown that empty LNP without mRNA does not result in any significant liver injury.\n\nThis was the motivation behind a study published from scientists in Sweden examining the Pfizer vaccines effect on human liver cell line Huh7 in vitro.\n\nPerhaps this is why Big Pharma didn’t provide the BMJ with this data? Because after it was requested, the data was leaked showing these concerns. The document from Japan below is a Pfizer document.\n\nThe Japanese government released this bio-distribution data showing the accumulation of spike in various organs in rats. It is also true that the rats were given a dose 1333X greater than that of what humans received through vaccination. That said, the vaccine’s contents still did not stay at the injection site, which human studies are now confirming.\n\nThe point is, the mRNA vaccines were supposed to remain at the injection site and be taken up by the lymphatic system. This assumption proved to be wrong. Gene-based vaccines result in an unregulated amount of spike protein being manufactured inside cells throughout the body.\n\nNormally, mRNA from natural infection breaks down within a few minutes to hours, however, the mRNA in these vaccines is modified in a way as to reduce potential innate immune recognition. It’s designed to bypass the body’s defence and detection mechanisms. This is one of the biggest differences between vaccine induced spike protein, and the spike protein from natural infection. Other proteins in the body usually only last up to a couple of weeks at most.\n\nThe long term significance of the accumulation of vaccine induced mRNA-lipid nanoparticles in various organs, especially after repeated boosters remains unknown.\n\nProfessor Nikolai Petrovsky from Flinders University in South Australia, who developed a protein-based vaccine called COVAX-19 (or Spikogen) which received emergency use authorization in Iran, explains,\n\nDr. Bonnie Mallard, Professor, BSc, MSc, PhD from the University of Guelph in Ontario, Canada, explains further,\n\n“These are genetic vaccines, and so you get the recipe for the spike, you don’t get the spike protein, and so you’re given the recipe. And each individual, man woman or child, has their own metabolism, their own genetics and they will produce different amounts of spike. So, clearly, when you take a drug that you did not know what dose you were taking, and that every person was getting some different dose, I don’t think so. And nobody knows that, and that’s the problem. So one, you don’t know the dose and it’s in lipid nano particles which we know deliver the message for spike throughout the body. And so normally for vaccines you want them to stay in the muscles and draining lymph-nodes. You don’t want the foreign protein to go everywhere and be widely distributed, particularly when the spike protein is not the same as the spike protein on the virus, it’s being modified, it’s synthetic and it has different characteristics and one of the characteristics it now seems that we’re coming to understand is that it stays in the circulation and in certain cells such as exosomes, little bubbles which allow communication between cells and non classical monocytes.“\n\nVaccine induced accumulation of spike protein in the blood, where it gets transported to various places like the cardiovascular system for example, is one of multiple reasons I chose not to get vaccinated. I believe someone of my age in good health is much better off dealing with natural infection. To read other reasons why I chose not to get vaccinated, you can access this article I published last month.", "opengraph": {"url": "https://www.thepulse.one/p/circulating-spike-protein-discovered", "type": "article", "title": "Circulating Spike Protein Discovered In Blood of Children & Young Adults With Vaccine Induced Myocarditis", "description": "In a new study published on January 3, 2023, in the journal Circulation, the authors describe how “free spike antigen” was “detected in blood of adolescents & young adults who developed post-mRNA vaccine myocarditis, advancing insight into potential underlying cause” of vaccine induced myocarditis.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb64ffc86-bb78-43b6-b9c1-8b2da06b01b6_800x500.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb64ffc86-bb78-43b6-b9c1-8b2da06b01b6_800x500.jpeg", "https://pubmed.ncbi.nlm.nih.gov/36597886/", "https://tpulse.substack.com/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination", "https://www.bmj.com/content/373/bmj.n1244", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab465/6279075?login=false", "https://pubmed.ncbi.nlm.nih.gov/35148837/", "https://www.cell.com/cell/pdf/S0092-8674(22)00076-9.pdf?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0092867422000769%3Fshowall%3Dtrue", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8051011/", "https://www.bitchute.com/video/muB0nrznCAC4/", "https://www.mdpi.com/1467-3045/44/3/73/htm", "https://www.mdpi.com/1467-3045/44/3/73/htm", "https://www.mdpi.com/1467-3045/44/3/73/htm", "https://www.docdroid.net/xq0Z8B0/pfizer-report-japanese-government-pdf", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F944fbfe3-bab4-4ea1-89f3-5834e0a6ff92_1070x1548.png", "https://maryannedemasi.com/publications/f/is-spike-protein-“toxic”", "https://ovc.uoguelph.ca/pathobiology/people/faculty/Bonnie-Mallard", "https://rumble.com/v1czdb9-dr-bonnie-mallard-stop-the-shots.html", "https://tpulse.substack.com/p/autopsy-results-from-people-who-died-unexpectedly-within-days-of-covid-19-vaccination"], "authors": ["Arjun Walia"], "publish_date": "2023-01-18T19:12:58+00:00"}