{"result_id": "303045", "URL": "https://www.thepulse.one/p/26-new-york-firefighter-stations-shut-down-over-vaccine-mandates", "timestamp": "2023-04-25 17:30:59 CEST+0200", "meta": {"description": "Politicians are calling for a reversal of vaccine mandates in New York after 26 firefighter stations closed due to a shortage of employees. On October 30th, Nicole Malliotakis, a politician serving as the U.S. representative for New York's 11th congressional district, met with New York City Councilman and Chair of the Committee on Fire & Emergency Management Joe Borell. They urged New York City Mayor Bill de Blasio to immediately reverse the COVID-19 vaccine mandate which has led to the closure of 26 FDNY stations across New York City and a shortage of thousands of city employees.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/26-new-york-firefighter-stations-shut-down-over-vaccine-mandates", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "26 New York Firefighter Stations Shut Down Over Vaccine Mandates", "cleaned_text": "Politicians are calling for a reversal of vaccine mandates in New York after 26 firefighter stations closed due to a shortage of employees.\n\nOn October 30th, Nicole Malliotakis, a politician serving as the U.S. representative for New York's 11th congressional district, met with New York City Councilman and Chair of the Committee on Fire & Emergency Management Joe Borell. They urged New York City Mayor Bill de Blasio to immediately reverse the COVID-19 vaccine mandate which has led to the closure of 26 FDNY stations across New York City and a shortage of thousands of city employees.\n\nThe Press Release reads as follows:\n\n\"As of 7:30 this morning, 26 FDNY stations, including five in my district, have closed due to Mayor de Blasio's decision to lock unvaccinated firefighters out of work,\" said Congresswoman Malliotakis. \"The shortage of potentially thousands of firefighters will undoubtedly result in longer response times, leading to an increased potential for injury or death. Likewise, at a time when crime is skyrocketing, our city simply cannot afford to lose experienced detectives, police officers, and first responders. I urge the Mayor to reverse this mandate immediately before someone is hurt as a result. If not, I fear the consequences will be dire.\" “I’m not sure anyone cares the vaccine status of a first responder as they apply defibrillators to their chest, and I can say for certain that first responders aren’t checking the vaccine cards of those they are trying to save,\" said Borelli. \"The mayor’s mandates have made the city less safe and, and we are losing only employees that have been tested within the week and do not have Covid. It makes little sense.”\n\nToday the public was notified by Uniformed Firefighters Association, which represents New York City firefighters, that members of Engine 243 and Ladder 168 have been turned away from their firehouse that serves the neighbourhoods of Bath Beach and Bensonhurst, Brooklyn.\n\nWith members being sent home, this firehouse was out of service.\n\n\"The Mayor's vaccine mandate has now created a life or death situation for residents of New York City who may need access to timely emergency services. If something unfortunate happens to any of my constituents as a result of slower response times caused by this mandate, I will hold the Mayor personally responsible. The Mayor should immediately lift this mandate and reinstate the testing option to ensure our streets remain protected from fires, crime and ensure our residents and first responders remain safe.\"\n\nWhy aren't people who are not sick and present a negative COVID test allowed to work? Why aren't people who've acquired natural immunity allowed to work?\n\nMany hospitals in Michigan are allowing naturally immune healthcare workers to keep their jobs.\n\nDr. Günter Kampf, Consultant hospital epidemiologist and Associate Professor for hygiene and environmental medicine at the University Medicine Greifswald Germany, recently published an article explaining why this is not a \"pandemic of the unvaccinated\" as so many politicians have claimed.\n\nIf the vaccine doesn't stop transmission of the virus, but instead protects one from severe disease and death, how is one protecting someone other than themselves by choosing to get vaccinated? Are mandates really necessary? Do vaccine mandates as a requirement for employment stop the spread of COVID? There is zero data available suggesting it does.", "opengraph": {"url": "https://www.thepulse.one/p/26-new-york-firefighter-stations-shut-down-over-vaccine-mandates", "type": "article", "title": "26 New York Firefighter Stations Shut Down Over Vaccine Mandates", "description": "Politicians are calling for a reversal of vaccine mandates in New York after 26 firefighter stations closed due to a shortage of employees. On October 30th, Nicole Malliotakis, a politician serving as the U.S. representative for New York's 11th congressional district, met with New York City Councilman and Chair of the Committee on Fire & Emergency Management Joe Borell. They urged New York City Mayor Bill de Blasio to immediately reverse the COVID-19 vaccine mandate which has led to the closure of 26 FDNY stations across New York City and a shortage of thousands of city employees.", "image": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fwww.thepulse.one%2Ftwitter%2Fsubscribe-card.jpg%3Fv%3D-1147294755%26version%3D9"}, "tags": [], "tweets": [], "movies": [], "links": ["https://malliotakis.house.gov/media/press-releases/malliotakis-borelli-cancel-mandate-reopen-firehouses-now", "https://urldefense.com/v3/__https:/r20.rs6.net/tn.jsp?f=001C0EwN7eNiORjfq0CYKl1MrH7MV1lp2KtcroQQmh6JEqP8vqQYolEgAEoGcbwL9wcks4-6_oB7aOzSFMOFQyynRWpEHanrdPHL_mWPEt7SSvrU-bXuPfVjvrcM2I-3xnana120mlI4IIALEAxbrSKBV4axXh2hI5QFZvd16PaRZjEx7368ni6HQfO1ScVqtWz&c=dO_kb4RB5WQbT4tcEzaueiVq5_QjumnxHH2uroIqUDeWslvr5GvNSQ==&ch=BogOo9bHOUrV_5XnYJEYbsJkCmZZNXIamkjfKUaYmF5QzD-ASArbbQ==__;!!Bg5easoyC-OII2vlEqY8mTBrtW-N4OJKAQ!aW-9_O3Ee5yzfb3kXzp3hRXSY1khYyC7M9sokz8exHnqbg8UDm7pFVXGXi_LSNi4ZPXK2I-ckH7j$", "https://malliotakis.house.gov/media/press-releases/malliotakis-ladder-engine-companies-across-nyc-continue-close-bath-beach", "https://thepulse.one/2021/10/15/john-hopkins-medical-prof-explains-natural-covid-immunity-is-very-strong/", "https://thepulse.one/2021/09/13/some-michigan-hospitals-allow-naturally-immune-employees-to-work-no-vaccine-required/", "https://brownstone.org/articles/this-is-not-a-pandemic-of-the-unvaccinated/"], "authors": ["Arjun Walia"], "publish_date": "2021-11-01T13:40:00+00:00"}