{"result_id": "303032", "URL": "https://www.thepulse.one/p/the-serious-adverse-events-of-mrna-covid-19-vaccine-trials", "timestamp": "2023-04-25 17:30:49 CEST+0200", "meta": {"description": "In December 2020, the US FDA authorised the Moderna and Pfizer mRNA covid-19 vaccines, claiming “the benefits outweighed the harms.” Now, a group of international researchers has gone back to re-analyse the original trial data upon which that claim was made.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/the-serious-adverse-events-of-mrna-covid-19-vaccine-trials", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "The Serious Adverse Events of mRNA Covid-19 Vaccine Trials", "cleaned_text": "In December 2020, the US FDA authorised the Moderna and Pfizer mRNA covid-19 vaccines, claiming “the benefits outweighed the harms.”\n\nNow, a group of international researchers has gone back to re-analyse the original trial data upon which that claim was made.\n\nA pre-print study (not yet peer-reviewed by Fraiman and colleagues contradicts the FDA's claim that the benefits outweigh the harms of the mRNA vaccines. In fact, the authors conclude that the vaccines are associated with an \"increased risk of serious adverse events\" that surpass the \"risk reduction for covid-19 hospitalization\" relative to the placebo group.\n\nThe conclusion is provocative. While some have criticized the study for fuelling 'anti-vax' sentiment, many have welcomed the independent scrutiny of the trial data.\n\nThe researchers focused on analyzing serious adverse events - specifically, they narrowed it to serious adverse events of \"special interest\" which were derived from a predefined list by the Brighton Collaboration, an established framework for vaccine safety used for over two decades.\n\nThe advantage of this method is that it removes adverse events that are unlikely to be vaccine-related such as gunshot wounds and car accidents, thereby removing ‘noise’ from the analysis.\n\nThey also pooled the trial data for the two mRNA vaccines which increased the sample size and achieved higher confidence in the results (more precision).\n\nThe upshot of the analysis was that mRNA vaccines were associated with an absolute risk increase of serious adverse events of 12.5 per 10,000 vaccinated people (95% CI 2.1 to 22.9) over placebo.\n\nPut another way, 1 in 800 people experienced a serious adverse event following either one of the mRNA vaccines (95% CI: 437 to 4762).That is very high for a vaccine.\n\n\"No other vaccine on the market comes close,\" says Martin Kulldorff, professor of medicine at Harvard (on leave) and former CDC vaccine safety committee member who was not involved in the study.\n\nKulldorff says the closest any other vaccine on the US market comes to this is the MMRV vaccine which is no longer recommended for 1-yr-olds because they found the excess risk of febrile seizures was 1 in 2300 compared to separate MMR and Varicella vaccines (no excess risk in 5-yr olds).\n\nThe Fraiman study found that coagulation disorders and cardiovascular problems were driving most of the serious adverse event in the trials, which seems to corroborate reports in the pharmacovigilance databases.\n\nKulldorff says that while randomized trials offer high level evidence for a causal association between the vaccine and harms, we can acquire valuable information from pharmacovigilance data which are based on millions of vaccinations.\n\nThe superior databases for recording adverse events comes from the CDCs Vaccine Safety Datalink (VSD) and the FDA's Biologics and Effectiveness Safety System (BEST). But there's a problem - the agencies do not analyze the data and present them to the public.\n\n\"It's a scandal\" says Kulldorff. \"In July 20221, the FDA came out with a press release saying that it had found a signal with cardiovascular problems but there's been no published follow up. A signal may be real or an artifact, but it's the FDA and CDC’s obligation to be open and transparent with the public, showing that vaccines are safe when they are safe and to be honest when there are adverse reactions” he adds.\n\nKulldorff says these agencies have been derelict in their duty and the result has been vaccine hesitancy.\n\n\"That's why we do this vaccine safety work, to build trust for the vaccines - measles, polio, rotavirus vaccines, the list is long.\"\n\nThe way that the FDA and CDC have fumbled with the covid-19 vaccine, I think has had extremely bad consequences on the trust in other vaccines as well as in public health generally,” says Kulldorff.\n\nDo the harms outweigh the benefits?\n\nJay Bhattacharya, professor of Medicine at Stanford University says that determining whether the benefits outweigh the harms is not black and white. It depends on a person’s age since there’s a 1000-fold difference in the infection fatality rate between young and old.\n\nLooking back at the pivotal mRNA trials, Bhattacharya says,\n\nWhat about those aged between 30 and 65 years?\n\nIt's one reason why Kulldorff has argued against mandating the vaccines. “If you don't know the risks, you should let people make their own decision, give all the information you have and not force people to take it,” says Kulldorff.\n\n\"Also, the FDA should have demanded that the original trials be designed for important outcomes, like hospitalizations, and deaths, and they should have done the trial with older people because they were poorly represented in the original trials,” adds Kulldorff.\n\nIn 2020, only a small proportion of subjects in the original clinical trials had prior exposure to the virus, but today the situation has changed -- a large proportion of people in the west have natural immunity.\n\n\"If people have been previously exposed to the virus and recovered, they have better immunity than the vaccine itself can provide, and I think now it's going to be of limited use, population wise, compared to 2021,” says Bhattacharya.\n\nThe Fraiman analysis has revealed that the FDA and the CDC underplayed the harms of the mRNA vaccines in Dec 2020. By authorising and recommending a population-wide vaccination campaign, authorities neglected to focus on protecting the elderly, and exposed many younger people to unnecessary harm. As the pandemic progresses, and new variants emerge, the benefits of the mRNA vaccines will continue to diminish, while the harms are likely to compound.\n\nFor more on making sense of COVID vaccines, please see our presentation below.", "opengraph": {"url": "https://www.thepulse.one/p/the-serious-adverse-events-of-mrna-covid-19-vaccine-trials", "type": "article", "title": "The Serious Adverse Events of mRNA Covid-19 Vaccine Trials", "description": "In December 2020, the US FDA authorised the Moderna and Pfizer mRNA covid-19 vaccines, claiming “the benefits outweighed the harms.” Now, a group of international researchers has gone back to re-analyse the original trial data upon which that claim was made.", "image": "https://substackcdn.com/image/fetch/f_auto,q_auto:best,fl_progressive:steep/https%3A%2F%2Fwww.thepulse.one%2Ftwitter%2Fsubscribe-card.jpg%3Fv%3D-1147294755%26version%3D9"}, "tags": [], "tweets": [], "movies": [], "links": ["https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4125239", "https://www.respectfulinsolence.com/2022/06/29/peter-doshi-vs-covid-19-vaccines-the-latest-round/", "https://brownstone.org/articles/are-the-covid-mrna-vaccines-safe/?utm_medium=onesignal&utm_source=push", "https://publications.aap.org/pediatrics/article-abstract/126/1/e1/68346/Measles-Mumps-Rubella-Varicella-Combination", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://thepulse.one/wp-admin/post.php?post=203379&action=edit", "https://www.fda.gov/vaccines-blood-biologics/safety-availability-biologics/initial-results-near-real-time-safety-monitoring-covid-19-vaccines-persons-aged-65-years-and-older", "https://maryannedemasi.substack.com/p/the-serious-adverse-events-of-mrna-covid-19-vaccine-trials?utm_source=%2Fprofile%2F41994660-maryanne-demasi-phd&utm_medium=reader2"], "authors": ["The Pulse"], "publish_date": "2022-08-29T07:00:00+00:00"}