{"result_id": "303040", "URL": "https://www.thepulse.one/p/the-fda-has-still-not-investigated-ventavia-for-falsifying-data-during-pfizers-covid-vaccine-trials", "timestamp": "2023-04-25 17:30:55 CEST+0200", "meta": {"description": "Brook Jackson, who was employed at the organization Ventavia Research Group, told The British Medical Journal in 2021 that Pfizer falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events reported in Pfizer’s pivotal phase III trial for COVID vaccines.", "lang": "en", "keywords": "", "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0110b53c-84b1-44bc-8b40-9324f06c8060%2Ffavicon.ico", "canonical": "https://www.thepulse.one/p/the-fda-has-still-not-investigated-ventavia-for-falsifying-data-during-pfizers-covid-vaccine-trials", "encoding": "utf-8"}, "image": null, "domain": "www.thepulse.one", "title": "The FDA Has Still Not Investigated Ventavia For Falsifying Data During Pfizer's COVID Vaccine Trials", "cleaned_text": "Brook Jackson, who was employed at the organization Ventavia Research Group, told The British Medical Journal in 2021 that Pfizer falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events reported in Pfizer’s pivotal phase III trial for COVID vaccines.\n\nVentavia is a contract research company that helped carry out the main Pfizer COVID-19 vaccine trial for adults.\n\nJackson didn't just come out with claims, she provided proof. In the video below Jackson explains what happened.\n\nThe editor-in-chief of The British Medical Journal (BMJ) at the time, Fiona Godlee, alongside Kamran Abbasi, an executive editor of the BMJ who will replaced Godlee on January 1st 2022, published a piece in the journal criticizing Mark Zuckerberg and Facebook “fact checkers” for trying to discredit and dismiss this story.\n\nIn it, Godlee and Abbasi criticize Facebook for putting a “fake news” label on an article published in the British Medical Journal by award winning investigative journalist Paul Thacker, who was commissioned by the BMJ to write up the story about Brook Jackson.\n\nThis of course isn't the first time \"fact-checkers\" have been wrong, especially during the pandemic.\n\nThe BMJ commissioned Thacker to cover the story as Jackson began providing The BMJ with dozens of internal company documents, photos, audio recordings, and emails in September of 2021.\n\nWe covered this story in depth as it happened, and published three pieces about it on November 3rd, November 5th, and more recently December 7th, if you’d like to learn more about it.\n\nWhile there are not new updates in this story at the moment one must as \"why has the FDA still not investigated her claims?\" What Jackson is alluding to is extremely serious scientific fraud, and yet regulators are silent. Why?\n\nThis forces one to question the motivations and incentive systems tied to our health agencies, as well as pharmaceutical companies in general. For years, multiple scientists from within big 'health' organizations like the FDA and CDC for example, have been blowing the whistle with regards to fraud and the falsification of data. What's happening at these organizations is not representative of science, but rather political and elite agendas that use 'science' to push forth political and other agendas.\n\nPrior and current actions paint a clear picture that these organizations can not be relied upon as the \"gold standard\" when it comes to all this science and health.\n\nWhat's even more concerning is that these organizations have a stranglehold on the medical industry, as well as medical education itself. Not to mention the fact that mainstream media seems to refuse to challenge or investigate the claims coming from these agencies.\n\nIf things don't change, the already large lack of trust in 'medicine' that we are seeing from the masses will simply continue to grow.\n\nThe question is, what is the solution here? Can one really expect more regulation or a change of leadership will make a difference? Or must we consider that these companies and regulators are incentivized to engage this behaviour by our underlying economic systems and likely won't stop because there is no incentive for them to. Since when has ethics mattered in politics?", "opengraph": {"url": "https://www.thepulse.one/p/the-fda-has-still-not-investigated-ventavia-for-falsifying-data-during-pfizers-covid-vaccine-trials", "type": "article", "title": "The FDA Has Still Not Investigated Ventavia For Falsifying Data During Pfizer's COVID Vaccine Trials", "description": "Brook Jackson, who was employed at the organization Ventavia Research Group, told The British Medical Journal in 2021 that Pfizer falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events reported in Pfizer’s pivotal phase III trial for COVID vaccines.", "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c4d6664-857d-4351-b221-f8b3b45c0251_800x500.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F2c4d6664-857d-4351-b221-f8b3b45c0251_800x500.jpeg", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://www.bmj.com/content/375/bmj.n2635", "https://thepulse.one/2021/12/19/3-times-fact-checkers-had-to-retract-false-labels-on-our-articles/", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://thepulse.one/2021/11/03/whistleblower-claims-pfizer-falsified-data-from-their-clinical-trials/", "https://thepulse.one/2021/11/05/setty-report-pfizer-whistleblower-claims-falsified-data-during-jab-trials/", "https://thepulse.one/2021/12/07/new-documents-confirm-pfizer-whistleblower-was-directly-involved-in-pfizers-covid-vaccine-trials/", "https://thepulse.one/2022/07/29/cdc-fda-nih-scientists-embarrassed-by-lack-of-science-guiding-covid-vaccine-policy/"], "authors": ["Arjun Walia"], "publish_date": "2022-09-29T08:30:00+00:00"}