{"result_id": "304017", "URL": "https://thepuristonline.com/2021/04/turning-inward/", "timestamp": "2023-04-25 17:31:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/04/turning-inward/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Turning Inward with Ram Dass", "cleaned_text": "“Compassion, the practice of seeing that others are the same as us, the heart of the wisdom of oneness—all contribute to our sense of interdependence and harmony.” —Ram Dass\n\nWhile the vaccine rollout ramps up, the coronavirus remains part of life, so you likely may still be experiencing stress, anxiety and physical isolation. The tools for working on yourself that Ram Dass taught over a lifetime as a psychologist, psychedelic explorer and meditator can help you navigate this stressful, chaotic time. Here are some of the spiritual strategies Ram Dass taught and employed in his own life.\n\nSeeing yourself and others as a soul or spiritual being of consciousness, wisdom, compassion and joy—instead of identifying with your role in the world—can free you from feeling isolated and separate. When you can look at someone and realize they are another being, of the same essence, you begin to become one. You begin to see with eyes of love.\n\nWatching yourself, witnessing your karma as an embodied being, gives you compassion for yourself. You witness yourself from your soul, your deep intuitive true nature. You witness the times you forget who you are, when you get lost in your thoughts, feelings and experiences. And then you begin to see how you identify with your thoughts. As Ram Dass often said, “Who you really are is not who you think you are.” Witnessing from the soul, you watch it all go by,“… gently down the stream, merrily, merrily, merrily, merrily, life is but a dream.”\n\nRepeating sacred syllables (mantras) or prayers, whether aloud or silently, can extricate you from stressful thoughts, allowing you to become peaceful and open. The mantra or prayer sets up a counter-vibration to replace the negative thoughts. Be patient—repetition furthers.\n\nChanting or singing mantras, prayers or divine names helps you attune to your inner being. You may start chanting mechanically, but as you continue, repetition carries you inward. Krishna Das, who’s been leading chanting for decades, says it’s like getting on a train. Even though you may be running in the opposite direction on the train, it still takes you to the destination. The destination is your soul.\n\nMeditation takes you beyond your thinking mind. Thoughts are like ripples on the surface of a lake—as the surface calms, you see more clearly into the depths. The practice of meditation also helps you get perspective on anxiety and fear. The object or focus of your meditation can be the breath, a mantra, a candle flame, an image, a photo of a saint, or a thought such as, “Who am I?” Meditating for 20 minutes is a good start. Going on a meditation retreat can help. Intensive practice is a good way to learn. Meditation helps integrate the stuff of daily life into your awareness. Learn to perceive the world, and how you live in it, as food for your spiritual growth. As Ram Dass put it, everything in life is grist for the mill of your awareness.\n\nYoga asanas and the breathing techniques of pranayama reduce stress and wear and tear on your body. They are an essential way to release tension, to stay healthy and fit, and to open to your deeper being. Physical reality is truly not separate from the spiritual. Many styles of yoga integrate with meditation. Restorative yoga is especially helpful for stress. Breathing is the meeting of your autonomic nervous system with your conscious awareness. Slow your breath, calm your mind.\n\nThe Bhagavad Gita, the immortal Indian classic, is a dialog on a battlefield between a warrior prince, Arjuna, and his divine charioteer, Krishna. It goes deeply into yoga, especially karma yoga, the yoga of action. Krishna tells Arjuna to do his work without attachment, as selfless service or seva, giving up the fruits of his action. Do everything you can to help, with love and devotion, but don’t worry how it will turnout. The Gita tells us that you don’t have to wait until you’re enlightened to serve, and you don’t need to withdraw from the world to become enlightened. Conscious social action serves others and is a vehicle for your own awakening.\n\nContentment, or santosha, is a yoga practice. Contentment is different from satisfaction. It’s being present with whatever’s on your plate in an open, loving way. Our guru used to quote the devotional poet Kabir, “I walk through the market, and I am neither a buyer nor a seller.” Practicing contentment helps quiet the cacophony of desire that constantly distracts from your true being.\n\nBE HERE NOW\n\nBeing present with whatever comes your way takes you out of what Ram Dass terms “time-binding,” getting caught in regrets for the past or expectations for the future. The past is a memory, the future is unknown. If you can just be with whatever is happening this moment, you are simply here. When you live in this moment, you live in the eternal now. If you burrow into the moment, everything is. If you live fully in this moment, even death is just another moment.\n\nMeditation is called a practice because, while sudden breakthroughs or insights may occur, more often there are subtle changes overtime. Keep practicing.\n\nPeople think the guru is someone outside, but the real guru is your innermost, intuitive self. If you can allow that inner guide to be a mirror for your mind and heart, the guru becomes a homing beacon to bring you back on track, to rest in your soul. That feeling of being home in the heart, in deep harmony with your true being is the grace of the guru.\n\nSpiritual teachings and practices are widely available. The Be Here Now Network of podcasts, and Ram Dass’ recorded teachings on ramdass.org, are two good sources. Retreat centers like Insight Meditation Society (dharma.org) or Spirit Rock (spiritrock.org) are places to learn meditation. Listen inside for what you need at any given moment. As Ram Dass said, “Take what you can use, and lose the rest.”\n\nRameshwar Das is a writer, photographer and co-author of several Ram Dass books, including Be Love Now, Polishing the Mirror and Being Ram Dass (January 2021). He lives in East Hampton, Long Island.\n\nBorn Richard Alpert in 1931, Ram Dass is known for his spiritual talks and is the author of the classic Be Here Now, Walking Each Other Home, Polishing the Mirror, Be Love Now, Paths to God, Still Here, The Only Dance There Is and many other books. He founded the Hanuman Foundation and the Love Serve Remember Foundation, and was a co-founder of the Seva Foundation, the Lama Foundation and the Neem Karoli Baba Ashram in Taos, New Mexico. Ram Dass died in 2019. For talks, podcasts and more information, visitramdass.org", "opengraph": {"locale": "en_US", "type": "article", "title": "Turning Inward with Ram Dass - The Purist", "description": "Spiritual and cultural icon Ram Dass passed away in December 2019, but the teachings in his newly published memoir, Being Ram Dass, continue to help us to “be here now”—to bring presence and love to difficulties, and enduring change to how we live our lives.", "url": "https://thepuristonline.com/2021/04/turning-inward/", "site_name": "The Purist", "article:published_time": "2021-04-01T14:31:15+00:00", "article:modified_time": "2021-04-07T16:39:39+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/03/thumbnail_RamDassMaharaj-ji_Kainchi-India_Copyright-Rameshwar-Das-copy-1024x734.jpg", "image:width": "2560", "image:height": "1834", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["http://ramdass.org", "http://dharma.org", "http://spiritrock.org", "http://ramdass.org", "https://thepuristonline.com/2022/08/the-power-of-being/", "https://thepuristonline.com/2022/08/our-bodies-our-choice-a-womans-scorn/", "https://thepuristonline.com/2022/05/coaches-krystal-lamiroult/", "https://thepuristonline.com/2022/10/embracing-the-change/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2021-04-01T14:31:15+00:00"}