{"result_id": "304011", "URL": "https://thepuristonline.com/2020/12/donna-dcruz-winter-reset/", "timestamp": "2023-04-25 17:31:18 CEST+0200", "meta": {"description": "Donna D'Cruz on turning over a new leaf and the winter reset.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/12/donna-dcruz-winter-reset/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Donna D'Cruz on the Winter Reset", "cleaned_text": "With a nod and apologies to Aldous Huxley, who I’m sure didn’t intend the title of his groundbreaking book used this way—doesn’t it feel like a Brave New World out there? No matter which side of the sociopolitical fence you occupy, change is afoot for us all, and the times they are a-changin’.\n\nSome of us are finding the uncertainty of the coming weeks hobbling our ability to look confidently to that light that we know will come. The pandemic is still having its way with us—not only as a country, but as a species.\n\nBy turns, it’s possible right now to feel hopeful and hopeless, powerful and powerless, pleased and pleasureless. All four of lobes of my brain are in tight knots of apprehension despite heartening news of a successful vaccine. It feels like being back in grade school, when weeks and months to the end of the term felt like an eternity. The question becomes then, how to fully acknowledge the roiling angst inside while attempting to quell negativity and subdue the justified apprehension in our collective spirit.\n\nIt all begins and ends with small, halting steps that I hope will become surer as we all progress toward strength, healing and positivity.\n\nRereading Winston Churchill’s timeless speeches helps me enormously. The rousing talks he gave in the darkest days of the war are today’s clarion call when the ongoing daily drudgery of the pandemic leaves us listless and spiritless. Read or listen to one of humankind’s matchless inspirers and you’ll feel those words span the decades and bolster your flagging spirit: “Do not let us speak of darker days; let us speak rather of sterner days. These are not dark days: these are great days—the greatest our country has ever lived.”\n\nMore than ever, your choice of what to read, what to listen to, becomes an active way to channel your mind and mood into positive and hopeful paths. Read what comforted and gave you pleasure in the past, never forgetting the classics are called so for a reason. I find myself granted salve as I immerse myself in the works of Rumi, Maya Angelou and William Shakespeare. Of course, the most potent way to navigate all is the daily practice of meditation and gratitude journaling.\n\nKeep enduring the niggling irritation of eyeglasses fogging up due to your mask (get some anti-fogging spray—it works!) and all the other minor COVID irritations, from hands chapped from the sharp disinfectants in sanitizers to the interminable lines just about everywhere. For everything.\n\nRemember that you’re doing all that’s required of you in this respect for the greater good. Know beyond certainty that masking, social distancing and hand washing, now more than ever, are the hallmarks of the modern, unlauded patriot.\n\n“How many goodly creatures are there here! How beauteous mankind is! O brave new world, That has such people in’t.” (The Tempest, William Shakespeare) donnadcruz.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Donna D'Cruz on the Winter Reset - The Purist", "description": "Donna D'Cruz on turning over a new leaf and the winter reset.", "url": "https://thepuristonline.com/2020/12/donna-dcruz-winter-reset/", "site_name": "The Purist", "article:published_time": "2020-12-13T21:17:19+00:00", "article:modified_time": "2020-12-14T16:03:14+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/12/aaron-burden-RgTI2KaQ5N4-unsplash-2-1024x781.jpg", "image:width": "2560", "image:height": "1951", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["http://donnadcruz.com", "https://thepuristonline.com/2022/08/our-bodies-our-choice-natural-born-leader/", "https://thepuristonline.com/2022/06/the-power-of-acceptance/", "https://thepuristonline.com/2022/06/exploring-ketamine-therapy/", "https://thepuristonline.com/2022/06/clear-the-way/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-12-13T21:17:19+00:00"}