{"result_id": "304008", "URL": "https://thepuristonline.com/2020/05/protect-yourself/", "timestamp": "2023-04-25 17:31:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/05/protect-yourself/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Protect Yourself", "cleaned_text": "COVID-19 has given us a new world paradigm. This submicroscopic pathogen has changed how we live, how we interact and how we work. Most of all, it has made us realize how vulnerable we are. How do we handle this new world order? Hand washing, facial coverings and gloves give us some protection, but the reality is that the best protection is our own internal defense system. Known as our immune system, the intricate network of cells and proteins that work to defend our bodies from invaders like viruses, bacteria and parasites is our most stalwart defender. This complex system seeks out and destroys unwanted invaders. This indispensable system then keeps record of these intruders and makes special proteins called antibodies to protect you from future attacks from this same pathogen.\n\n Our goal moving forward should be to support this critical system. Here are four simple ways to support your immune system so it can support you.\n\nEat a whole-foods diet that includes daily consumption of fruits, vegetables, nuts, seeds and whole grains.\n\nYou have heard this a million times before, but there is a good reason for it. These foods are rich in organic compounds called phenols. These phenolic compounds, present in the highest concentrations in the seeds, leaves and skins of plant-based foods, are easily absorbed by the intestinal walls. Phenols act as potent antioxidants. The antioxidants’ job is to squelch free radicals, which are destructive partial molecules—otherwise known as the “bad guys.” Free radicals create stress in the body, which weakens the immune system. In this time when we are focusing on immune system support, it is more important than ever to give your body as many of the “good guys” as you can. This means eating a plant-centric diet—one that is comprised of 50 percent fruits and vegetables (the more colorful the better), 25 percent well-sourced proteins, and 25 percent nuts, seeds and high-quality fats.\n\n The foods that work against your immune system and create more free radicals are the usual suspects—soda, processed foods, foods high in refined sugars, refined carbohydrates and alcohol. Think cookies, breads, chips and sugary sports drinks. Keep these to a bare minimum (none is best).\n\nSleep, especially deep, restorative sleep, is protective of the immune system. During sleep the body releases protective proteins called cytokines. These cytokines seek out and destroy infections, as well as control inflammation in the body. Without these cytokines your body is left vulnerable to infections. A 2017 study of otherwise healthy college students showed a significant reduction in antibody protection from the flu vaccine in those who suffered from chronic sleep loss. This means that insufficient sleep can hinder your body’s ability to launch a healthy response to an unwanted invader like COVID-19. Don’t skimp on shut-eye!\n\nSo how much do we need? The National Sleep Foundation recommends:\n\nGet 30 Minutes of Exercise Every Day\n\nExercise has been shown to be a potent immune system modulator. Exercise, especially consistent, habitual exercise, has the ability to decrease inflammatory response, increase metabolic activity, decrease stress hormones and increase healthy cytokine levels. Most of us have heard that when you exercise you release hormones called endorphins. Why is that important? Most immune cells require endorphins for proper functioning. These protective chemicals activate the white blood cells that make up our immune system. Inadequate endorphins have been shown to make us more vulnerable to disease.\n\n Thirty minutes of daily exercise does not need to look like high-intensity training. Exercise can be taking a walk, having a home dance party, gardening or taking a bike ride. What is important is that every day you get out and move your body.\n\nGet Your Daily Dose of D\n\nVitamin D is a fat-soluble vitamin that supports both innate and adaptive immune responses. Known as the sunshine vitamin, D is present in very few foods. Rather, it is derived from exposure to the sun. When exposed to UVB rays, the skin synthesizes this essential nutrient from cholesterol present in our skin. While it is true that too much sun exposure can cause skin cancers and other sun damage such as wrinkles and brown spots, a small amount is vital for our well-being. The issue that we have is that we have come to fear the sun and, as a result, cover up with UVB protection. Because sunscreen blocks the body’s ability to create D, it is important to spend some time outside without it on. For most people, 15 to 20 minutes outside every day without it is all that is needed. Once you hit the 20-minute mark put your sunscreen on! \n\n So, arm yourself against the virus. It’s not hard. A healthy foundation for a well-functioning immune system is simply good food, sleep, exercise and sunshine.\n\nTapp Francke is Purist’s Contributing Health Editor and the founder of STANDwellness, STANDwellness.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Protect Yourself - The Purist", "description": "Now more than ever we must all fortify our bodies. Here are four easy, actionable ways to support your immune system.", "url": "https://thepuristonline.com/2020/05/protect-yourself/", "site_name": "The Purist", "article:published_time": "2020-05-12T16:15:28+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/05/15784596125e1561dc43633.jpg", "image:width": "598", "image:height": "597", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://standwellness.com/", "https://thepuristonline.com/2022/06/pure-good-5/", "https://thepuristonline.com/2022/10/nutrition-talk-with-tapp-francke-at-canoe-place-in-hampton-bays-october-1/", "https://thepuristonline.com/2022/12/dance-to-detox/", "https://thepuristonline.com/2022/06/ask-the-dr-12/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-05-12T16:15:28+00:00"}