{"result_id": "304003", "URL": "https://thepuristonline.com/2020/03/staying-radiant-in-uncertain-times/", "timestamp": "2023-04-25 17:31:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/03/staying-radiant-in-uncertain-times/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Staying Radiant in Uncertain Times", "cleaned_text": "What are some things people can do at home to look and feel their best?\n\nIf you’re going to cocoon you might as well come out a butterfly on the other end. This is a time when people are lacking structure in their day and are also highly concerned about their own health. Extreme change can cause stress to many. I have always been someone who enjoys change and thrives in controlled chaos.\n\nHowever, the stress of change can manifest its way into people’s daily lives, resulting in them bingeing on food or alcohol, and falling off their workout regimen. Focusing on fitness, nutrition, skin care and much-needed family time grounds us during these chaotic times. The best way to prevent illness is through health.\n\nWhat beauty regimen do you suggest to women whose skin is stressed and dry right now?\n\nI am sitting on a mountain of expiring Botox, microneedle tips and filler, just waiting to find a good home! We planned on turning our East Hampton pool house into a mini med-spa outpost; however, the full quarantine developed before we were able to have our first guest.\n\nBut until they release us, my patients and followers are stuck with skin care at home. Choosing the right products for your skin type and needs can be a daunting task, especially when there are so many options. Everyone seems to be overwhelmed by the influencer skin-care routines and the bounty of products available. Here is what I suggest:\n\nThis product is a living, breathing hydration seal for your body. The brand’s name comes from Non-Invasive Options in Dermal Science, and NIOD is a part of a cool company called Deciem. This novel approach stands in sharp contrast to moisturizers that offer oils and lubricants as a method of hiding dehydration instead of respecting the skin’s own barrier to water loss. Antarctic blue algae protects from water loss. Fungi Composite Organisms act as water reservoirs to protect against losing skin elasticity. If you don’t like it, you could probably eat it or grow a garden in it so during this time it’s definitely our favorite product.\n\nFor hair protection we are using 100% Plant-Derived Hemi-Squalane from my favorite skin-care company The Ordinary. It”s 100% pure, 100% colorless, 100% nongreasy and comes from 100% sustainable sugarcane. Its molecular weight makes the formula incredibly light and dry to the touch; at the same time, it prevents ongoing loss of hydration that weakens dermal elasticity and suppleness. It’s great for the hair and the skin and it’s just $4.\n\nHow can we ramp up our hygiene during this difficult time?\n\nSimple things you can do are to eat well, get plenty of sleep, and drink lots of water. To kick-start your immune system, our daily regimen involves Lypo-Spheric Vitamin C and glutathione combined with elderberry gummies and silver hydrosol under the tongue.\n\nYour wife, Lauren, is a fitness guru who also offers post-op fitness routines to your clients. She is doing Instagram live classes—Legs by Lauren—right now for people at home. Tell us about that.\n\nI met my wife Lauren two-and-a-half years ago on a yoga retreat in Nicaragua. She has a natural energy and aura about her that makes you want to be around her and be the best version of yourself. It does not matter if she is training runway models or suburban housewives; she makes you feel like you’re the most important person in the room. Her mix of Pilates, yoga and high-intensity training helps women achieve long, lean bodies. Her workouts are high energy—that’s why they call her the energizer Barbie—but they come with a sense of community and mutual elevation. She has been working with some of her nutrition and fashion friends to find ways of giving everyone everywhere some great free fitness routines. It has been a lot of fun. She is doing three or four a week at 9:30AM.\n\nDoes she have you on a fitness routine at home right now?\n\nThis time at home has allowed Lauren ample time to work on my “dad bod” and bad habits. Even though I work out a ton in the city I have not been diligent on getting rid of vices like Diet Coke and poor snacking habits because of my schedule. I am working on my core strength daily with Lauren and drinking a ton of water. I feel better, I look better, my body is healthier.\n\nWhat are your concerns about COVID-19 as it pertains to the future of aesthetics?\n\nWhen something new comes into our lives, we tend to change our perspective on things. I am seeing unprecedented amounts of inquiries and visits to both my Instagram account and website. People are seeing the immense value of personal health and wellness and they clearly want to emerge from this quarantine with a plan to look and feel great about themselves. My unique position in the aesthetic industry focuses on how aesthetics complement a healthy lifestyle, not replace one. My procedures are safe, predictable, and have limited downtime. I predict there will be a huge increase in the number of minimally invasive and noninvasive procedures coming out of COVID-19.\n\nAre your virtual consults happening now, and are you conducting them yourself?\n\nMy nurse practitioner, Tara, is handling the bulk load of our patient follow-ups virtually, and I am doing the new consults. I was able to pivot quickly and add virtual consultations almost immediately to the platform. We are doing them on Facetime, WhatsApp and Zoom. It has allowed patients who may not feel comfortable coming into a surgeon’s office to get the information they need and want in a very safe setting. There has been a great sense of community around the world and it’s been an interesting and rewarding experience getting to know so many new patients.\n\nTell me about your new center you are planning to open in NYC in the fall.\n\nI am currently building out a multi-operating room surgical center and body spa overlooking Central Park above the iconic Bergdorf Goodman. I have recruited two amazing young surgeons. They share my passion for expertise in body sculpting and love for patient care. This new space will not only be the world’s center of excellence for body contouring, but we will have the space we need to have a full body spa, which will have lymphatic-drainage massage therapists, our Emsculpt muscle-building technology and new skin-tightening technology. Given we have some outdoor space overlooking the park we will be able to have my wife give some free outdoor workout classes!\n\nAre you nervous given the current economy?\n\nNo, not at all! If you remember the movie Forrest Gump, during the biggest storm was when Bubba Gump Shrimp proved who they were and became the leader in their industry. While the story is fictional, the concept is real. Those who weather the storm will come out stronger on the other side.\n\nMany great things were started during times of economic uncertainty or downturn. I am looking at this time as an opportunity for us to emerge. Decisive leadership, a strong staff, and a detailed but moldable plan will help us weather this storm. Our commitment to being the absolute best and most experienced at minimally invasive body contouring with the ultimate customer service team will always give patients confidence and certainty with choosing us.\n\nWhat services will you be offering?\n\nOur most common surgical procedure is a minimally invasive liposculpting procedure I have pioneered. I help get rid of the stubborn areas of fat and loose skin in an easy way. Our procedures do not require general anesthesia and use the latest in fat melting, fat removal and skin-tightening technology.\n\nTo complement our procedures we will be offering lymphatic-drainage massage therapy to help enhance healing in surgical patients, along with detoxifying nonsurgical patients.We will also be offering facial injectables and nonsurgical body contouring.\n\nWhere is it located?\n\nThe new office is on the 12th floor of 4 West 58th Street, which is above Bergdorf Goodman overlooking Central Park.\n\n @drneinstein, neinsteinplasticsurgery.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Staying Radiant in Uncertain Times - The Purist", "description": "Dr. Ryan Neinstein, NYC’s pioneer in minimally invasive body sculpting, shares expert advice for at-home skin care.", "url": "https://thepuristonline.com/2020/03/staying-radiant-in-uncertain-times/", "site_name": "The Purist", "article:published_time": "2020-03-30T22:37:29+00:00", "article:modified_time": "2020-03-30T22:39:02+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/03/F055E2A9-0D01-478F-9A98-28FAA9E160E8-1-683x1024.jpg", "image:width": "1707", "image:height": "2560", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://niod.deciem.com/product/hydration-vaccine-50ml?ccm=6afb414ca0a748bd85ed7ead6c4e6729f133993f2fd49d2697d9aa1f3700dc05f70102cb1d00da802a8fe86a4f7a904b2cc58b019d79610ab89b7e00b33f328bc753a4096d6833cfdfd104393f7b6d2e84dd3ebf03201d39b9ba718c630b116a4f2c7adae27815ac37b3a6589ba10935142f8a84ebd194d0bb0f49e40250a5d12becd65fbd8b40c324db76ebace95364&ccvis=1", "https://theordinary.deciem.com/product/rdn-100pct-plant-derived-hemi-squalane-30ml?redir=1", "https://neinsteinplasticsurgery.com/", "https://thepuristonline.com/2022/08/know-thyself/", "https://thepuristonline.com/2022/10/mind-body-nourishment/", "https://thepuristonline.com/2022/12/tis-the-giving-season/", "https://thepuristonline.com/2022/08/how-to-acknowledge-mental-health-concerns-following-roe-v-wade/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-03-30T22:37:29+00:00"}