{"result_id": "304015", "URL": "https://thepuristonline.com/2021/04/pumpkin-pet-care-puppy-love/", "timestamp": "2023-04-25 17:31:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/04/pumpkin-pet-care-puppy-love/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Pumpkin Pet Care: Puppy Love", "cleaned_text": "Pet ownership has been linked to longer life span, decreased stress levels and lower blood pressure. During the height of the pandemic while many felt fearful or isolated, the unconditional love of a pet could bring solace. Securing the long-term health of animal companions is pertinent, and comprehensive medical care provides valuable peace of mind. Here, Purist chats with Dr. Stacy Choczynski Johnson, a veterinarian with 12 years of clinical experience and over 20 years of field experience. Working across the spectrum of the animal kingdom, from kittens to beluga whales, Dr. Choczynski Johnson currently works for Pumpkin, a pet insurance and wellness provider that’s on a mission to help keep pets healthy.\n\nPURIST: COVID brought with it a dramatic increase in pet adoptions. We heard some shelters had no more dogs and cats left to adopt! What impact does owning a pet have on human health and well-being?\n\nStacy Choczynski Johnson: Pet ownership is believed to decrease stress, help children with social skills, alleviate depression and improve heart health. While scientists are conducting research to prove the benefits of the human-animal bond, one thing that is undeniable is that pets provide true companionship. This companionship has been critical during COVID as we’ve experienced social isolation. In some cases, pets have truly been man’s best friend.\n\nPURIST: How will pets react when more pet parents return to the office? Is separation anxiety a real thing?\n\nSCJ: We refer to pets that have made their way into our hearts and homes during COVID as “pandemic pets.” They are often well cared for and receive a significant amount of attention from their human family members. Since we’ve been quarantined, most puppies have not had much exposure to other dogs or environmental stimuli. This is a recipe for a variety of anxiety-related behavioral conditions. We expect to see many cases of separation anxiety as pet parents return to work and students return to school.\n\nAs we gear up to return to work, we can ease the transition by starting to form habits in our homes today. I recommend simulating a typical work day for both you and your pet. Going back to the office may be anxiety producing for everyone if it is left to the last minute! For your fur family, this may mean starting a feeding schedule, purchasing & trying out a feline enrichment toy, doing a working interview with a dog walker or spending a day at doggie daycare. It’s also a good idea to inform your trusted neighbors that you are no longer teleworking. They can clue you in to nuisance behaviours like excessive barking or crying triggered by your departure. There are a variety of nutraceuticals, supplements and even apparel items that may help with pet anxiety.\n\nPURIST: We all want our pets to live the longest and healthiest lives. What are some tips to help your pet live a healthy life?\n\nSCJ: It’s important to have a wellness-forward approach that includes excellent nutrition, exercise and preventive medical care. As a veterinarian, I work with pet parents to find a food and treat plan that works for the breed, age and underlying health conditions of the pet—and of course, the lifestyle of the family. Pets require regular exercise just like their human counterparts. For pets with orthopedic issues, water treadmill use is even an option for low joint-impact exercise.\n\nThe level of medical care that we are able to offer pets has come a long way in the past 10 years, and newer pet insurances on the market have taken this into consideration. The best offerings automatically include rehabilitation coverage as part of the standard insurance policies.\n\nPreventive medical care is key to the success of our feline and canine friends. Regular vaccinations, providing flea and heartworm-disease prevention and regular fecal parasite screening with deworming are all essential. Regular screening for chronic diseases is key since our fur babies cannot describe their aches, pains and maladies to us.\n\nPumpkin offers a Preventative Essentials Pack that is an optional add-on to accident and illness pet insurance coverage. It covers the annual wellness exam, vaccines and key lab tests in full. At Pumpkin, we say that the “best treat is a healthy life.” Preventive and comprehensive veterinary care is the best way to create a healthy life for our pets.\n\nPURIST: What are some of the things pet parents should look for when they are comparing different insurance providers?\n\nSCJ: First and foremost, the coverage should align with the high level of care that your veterinarian provides and the high-quality services that you want to seek out for your pet. The purpose of pet insurance is to provide the gold standard of care if your pet gets sick or hurt. It is for peace of mind. A pet parent should make sure that their plan covers high-level procedures like behavioral therapy, rehabilitation services and stem-cell therapy. Not all plans cover these services. Similarly, you should look for a plan that covers dental disease. A pet insurance plan should also cover sick and ill office exams for your pet. It is important that we are able to bring our pets in for care and follow-up appointments and have them covered. In my mind, this is a no-brainer.\n\nPumpkin’s pet insurance is truly extensive and covers everything that I mentioned—sick exam fees, behavioral therapies, rehab, alternative therapies and dental disease.\n\nHave more questions for Dr. Stacy? She will be answering audience questions on @cristinacuomo’s Pet Wellness Instagram Live, April 15 at 11AM EST.\n\nTo learn more about Pumpkin, visit www.pumpkin.care\n\nPumpkin Advertiser Disclosure: Pumpkin Pet Insurance policies do not cover preexisting conditions. Waiting periods, an annual deductible, coinsurance, benefit limits and exclusions may apply. For full terms, visit pumpkin.care/insurancepolicy. Products, discounts, and rates may vary and are subject to change. Pumpkin Insurance Services Inc. (“Pumpkin”) (NPN #19084749) is a licensed insurance agency, not an insurer. Insurance is underwritten by United States Fire Insurance Company, a Crum & Forster Company (NAIC #21113, Morristown, NJ) and produced by Pumpkin. Pumpkin Preventive Essentials is not an insurance policy. It is offered as an optional add-on non-insurance benefit. Pumpkin is responsible for the product and administration. Pumpkin Preventive Essentials is not available in all states. For full terms, visit pumpkin.care/customeragreement.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pumpkin Pet Care: Puppy Love - The Purist", "description": "Veterinarian Stacy Choczynski Johnson urges pet parents to Invest in the future of our furry friends.", "url": "https://thepuristonline.com/2021/04/pumpkin-pet-care-puppy-love/", "site_name": "The Purist", "article:published_time": "2021-04-07T00:03:44+00:00", "article:modified_time": "2021-04-13T00:18:06+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/04/Pumpkin_Lifestyle_Zelda_4-768x1024.png", "image:width": "768", "image:height": "1024", "image:type": "image/png"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://www.pumpkin.care/", "https://www.pumpkin.care/", "https://www.pumpkin.care/", "https://www.pumpkin.care/", "https://www.instagram.com/cristinacuomo/", "http://www.pumpkin.care", "http://pumpkin.care/insurancepolicy", "http://pumpkin.care/customeragreement", "https://thepuristonline.com/2022/06/backyard-bliss/", "https://thepuristonline.com/2022/10/embracing-the-change/", "https://thepuristonline.com/2023/03/highway-to-well-2/", "https://thepuristonline.com/2023/04/the-om-of-home/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2021-04-07T00:03:44+00:00"}