{"result_id": "304029", "URL": "https://thepuristonline.com/2020/03/greetings-from-light-harmonics-institute/", "timestamp": "2023-04-25 17:31:49 CEST+0200", "meta": {"description": "We at Light Harmonics Institute believe that it is most important to keep your immune system supported.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/03/greetings-from-light-harmonics-institute/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Greetings From Light Harmonics Institute", "cleaned_text": "Many patients have been requesting protocols and instructions during the Novel Coronavirus. If you do get symptoms, please act quickly. Instructions below will help you navigate this illness, that is why we suggest you have them on hand.\n\nThe main focus that we have when a new virus or super bug comes along is to identify how it is spread and utilize preventative measures by bolstering our immune systems. Many of the basic recommendations, like hand-washing are used to also prevent Flu and common colds. Please be diligent and if possible avoid travel on planes, buses, subways, taxis, crowds etc. Basically, self-quarantine is recommended, as much as possible under these circumstances.\n\nOne difference with this virus and others, is how much more contagious it is. The incubation period seems to be somewhere between 14-30 days and the life of the virus on surfaces may be anywhere from a few hours to multiple days. It is spread through droplets in the breath, sneezing, coughing and other mucous membranes including the eyes and possibly passed through feces. Patients who test positive may be asymptomatic, have mild cold-like symptoms or more severe Flu-like symptoms including dry cough, shortness of breath and fever. People at high risk or have compromised immune systems due to other chronic illnesses can develop pneumonia easier and are at a greater threat from this virus. Note that in severe cases the Coronavirus attacks lung tissue possibly leading to respiratory and kidney failure. Hopefully, you have been following the path of Light Harmonics and are building your immune system daily. It is extremely important to stay on a good diet, avoiding sugar, processed foods, dairy, wheat and alcohol. If you are unsure about diet we recommend the Modified Liver Cleansing diet in “Harmonic Healing” book by Dr. Linda Lancaster.\n\nHere are some important tips to help prevent the spread of colds/flu and Coronavirus:\n\n–Wash your hands often – The only way airborne viruses can get into your bloodstream is if it comes in contact with your mucous membranes (eyes, mouth, nose etc.) After touching public surfaces make sure you wash your hands for at least 20 seconds before you touch your face. In addition *Briotech Topical Skin Spray (Hypochloric Acid) can be used on the face and skin to help the body fight off Virus, Bacteria, and even Spores. HOCL is a known natural biocide that also encourages healing of epithelial tissue, breaks down scars and is anti-inflammatory. Instead of scratching your face or itching your eyes, try spraying your face instead.\n\nGet enough Sleep – Sleep lets your body rebuild and keep your immune system strong.\n\nDrink enough Water – 8 – 8oz glasses of clean water per day, a pinch of sea salt in the water helps for better hydration.\n\nEat well – Keep your body strong with Vitamin/mineral rich vegetables, especially leafy greens, whole grains, legumes and lean meats. Fatty foods, such as fried foods, nuts and cheese, can slow down metabolism and compromise the immune system.\n\nAvoid alcohol – Alcohol can be an immune suppressant making you more vulnerable to viruses.\n\nKeep active – Exercise and breathing exercises oxygenate the body. A high blood oxygen level keeps viruses dormant.\n\nStay calm – Practicing prevention is about making smart decisions to mitigate risk and spread of virus. Considering social distancing like avoiding hand shaking, large public gatherings and non-essential travel can lower risk of infection.\n\nIf sick, stay home – Whether it is the flu or coronavirus, it is important to mitigate spread of disease by staying home. If symptoms become severe, please seek medical attention.\n\n*HOCL Spray by Briotech We recommend Hypochlorous acid, An effective topical biocide that can be used to spray on face, skin and even surfaces while out in public. Clorox wipes is preferred on surfaces and frequent Hand washing is of course most important!", "opengraph": {"locale": "en_US", "type": "article", "title": "Greetings From Light Harmonics Institute - The Purist", "description": "We at Light Harmonics Institute believe that it is most important to keep your immune system supported.", "url": "https://thepuristonline.com/2020/03/greetings-from-light-harmonics-institute/", "site_name": "The Purist", "article:published_time": "2020-03-13T18:26:50+00:00", "article:modified_time": "2020-03-23T15:28:46+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/03/cooking-food-ginger-256318-e1537020115966-1170x878-1-1024x768.jpg", "image:width": "1170", "image:height": "878", "image:type": "image/jpeg"}, "tags": ["healthy living", "immunity"], "tweets": [], "movies": [], "links": ["https://lightharmonics.com/", "https://thepuristonline.com/2023/04/saved-by-the-milk-cleanse/", "https://thepuristonline.com/2023/03/health/", "https://thepuristonline.com/2022/06/wellness-on-demand-4/", "https://thepuristonline.com/2022/10/shining-a-light-on-lyme/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-03-13T18:26:50+00:00"}