{"result_id": "304001", "URL": "https://thepuristonline.com/2020/12/covid-19-vaccine-update/", "timestamp": "2023-04-25 17:31:01 CEST+0200", "meta": {"description": "With three potential COVID-19 vaccine types in play, the end of the pandemic could be in sight.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/12/covid-19-vaccine-update/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "COVID-19 Vaccine Update", "cleaned_text": "Amid reports of COVID-19 vaccine candidates requiring ultra-cold storage and multiple doses, one critical fact is overlooked: A silent, civilian army has bravely done its part to help put an end to the pandemic. They are the healthy people who have not contracted the novel coronavirus, and stick their arms out as test subjects in vaccine trials. Without these volunteers, the options from Pfizer, Moderna and soon, AstraZeneca, could not have materialized at warp speed.\n\nBoth a practicing physician and a clinical researcher, Dr. Martin Bäcker is the associate director of the Vaccine Center at NYU Langone’s Long Island campus and clinical assistant professor of medicine in infectious diseases at NYU Long Island School of Medicine. He encourages all his patients—and all Americans—to join the lifesaving volunteer effort by visiting coronaviruspreventionnetwork.org. “I encouraged my parents to sign up for clinical trials,” he says. “They’re in their mid-70s, and they both took a vaccine candidate.” After the recent nail-biting presidential election, finally America has options for COVID-19 prevention that everybody can get behind, regardless of party affiliation.\n\n“I’m very excited that we are in the process of demonstrating that there will likely be not one, not two, but three vaccine candidates,” Bäcker adds, “and I’m optimistic that soon, we’ll have even more vaccines that are going to help us get out of this awful pandemic, and eventually return to a sense of normalcy, the way we used to know it.”\n\nFront-line medical heroes staffing our nation’s hospitals are priority No. 1 to be inoculated—and they’re eagerly awaiting injection day. Says Dr. Nick Fitterman, executive director of Northwell Health’s Huntington Hospital on Long Island: “I’ve told my hospital staff that I’ll be first in line to take it.” One of Fitterman’s fellow front-line staffers, a Huntington nurse practitioner, also happens to be his wife, Jennifer. “She’ll take it too,” the doctor says.\n\nWith global pharmaceutical giants running neck and neck in the vaccine race, it’s not yet known which hospitals will administer which serum. “That will depend on availability, approval time and distribution dates,” Fitterman explains. “To me, it won’t matter which one is administered first, because the efficacy of both the Pfizer and Moderna vaccines is much higher than we were even hoping for: They prevent infection and severe disease by over 90 percent. Compared to influenza vaccines—which, in the best scenario, are maybe 50 to 60 percent effective—these will really help protect us.“\n\nOur expectations are for an effective vaccine that really activates our immune system,” Fitterman adds. After the shot, “You’re going to get some muscle ache and a low-grade fever for a day or two—and in my mind, that’s a good thing. It means the vaccine isimmunogenic: It’s generating a nice, healthy, robust response. It’s awakened my immune system, and my immune system is generating antibodies to fight this virus when I get exposed to it.”\n\nAs the majority of the population won’t receive a vaccine right away, the medical community cautions everyone not to slack on following CDC guidelines. “Until we get full protection from vaccines, we need to take care of each other,” Bäcker concludes. “We all must adhere to wearing our masks, maintaining social distance and avoiding unnecessary crowding. There’s a lot of virus going around. We can have an effect on the curve by wearing masks and avoiding unnecessary crowds: I cannot emphasize that enough.”", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccine Update - The Purist", "description": "With three potential COVID-19 vaccine types in play, the end of the pandemic could be in sight.", "url": "https://thepuristonline.com/2020/12/covid-19-vaccine-update/", "site_name": "The Purist", "article:published_time": "2020-12-14T20:01:12+00:00", "article:modified_time": "2020-12-16T19:35:52+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/12/pexels-alena-shekhovtcova-6074934-1-1024x683.jpg", "image:width": "2560", "image:height": "1707", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["http://coronaviruspreventionnetwork.org", "https://thepuristonline.com/2022/12/tis-the-giving-season/", "https://thepuristonline.com/2022/05/pure-good-4/", "https://thepuristonline.com/2022/12/clearly-speaking/", "https://thepuristonline.com/2023/03/highway-to-well-2/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-12-14T20:01:12+00:00"}