{"result_id": "304026", "URL": "https://thepuristonline.com/2021/05/lucky-dog/", "timestamp": "2023-04-25 17:31:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/05/lucky-dog/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Lucky Dog", "cleaned_text": "An internet meme jokes that “pets are the new kids, and plants are the new pets.” The term “pet parent” has become increasingly popular, reflecting a cultural notion that many people’s animal children are just as spoiled as their human ones. The pandemic has only added to the fur-baby boom, with such a dramatic increase in adoption rates last year that some animal shelters ran out of dogs.\n\nDiet is a cornerstone of well-being, and healthy food can extend the life expectancy of animals. A majority of common pet food brands are created with “feed grade” rather than “human grade” ingredients, lowering the threshold for the amount of chemicals, allergens, harmful animal by-products and fillers allowed in each bag of chow. The production of pet food can also hinder the health of the planet: Dogs in the U.S. consume over 32 billion pounds of protein per year, which accounts for 25 to 30 percent of meat consumption’s environmental impact, according to a UCLA study. For a sustainable, hypoallergenic alternative to mystery meat, opt for dog foods like Jiminy’s (jiminys.com), a line made with a blend of insect protein and plant-based nutrients.\n\nMany pets dread bath time, and toxin-riddled grooming products only make spa day worse. Humans have been avoiding sulfates, parabens and artificial fragrances like the plague, and your dog’s ’do deserves the same treatment. Try Pride + Groom’s (prideandgroom.com) natural bath products, which are formulated for specific fur types, with great-smelling botanicals to detangle, soften and shine.", "opengraph": {"locale": "en_US", "type": "article", "title": "Lucky Dog - The Purist", "description": "Keep your canine friend happy and healthy with all-natural wellness essentials from Jiminy’s, Pride & Groom and Pumpkin Pet Care.", "url": "https://thepuristonline.com/2021/05/lucky-dog/", "site_name": "The Purist", "article:published_time": "2021-05-21T15:31:32+00:00", "article:modified_time": "2021-05-21T15:33:28+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/05/friends-1149841-1024x603.jpg", "image:width": "2560", "image:height": "1506", "image:type": "image/jpeg"}, "tags": ["pets"], "tweets": [], "movies": [], "links": ["http://jiminys.com", "http://prideandgroom.com"], "authors": ["Gabby Echevarrieta"], "publish_date": "2021-05-21T15:31:32+00:00"}