{"result_id": "304028", "URL": "https://thepuristonline.com/2020/07/dr-frank-lipman-2/", "timestamp": "2023-04-25 17:31:47 CEST+0200", "meta": {"description": "Dr. Frank Lipman on how to protect yourself in a post-COVID-19 lockdown world.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/07/dr-frank-lipman-2/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Dr. Frank Lipman: Ask The Doctor", "cleaned_text": "With each passing day, we learn more about SARS-CoV-2, the novel coronavirus that causes COVID-19, and how it behaves. That in turn inches us closer to winning the battle against it. But we’re still in the early stages, with more questions than answers. Regardless, our federal and state governments are forging ahead with plans to reopen various parts of the economy and relax many of the lockdown measures that have helped slow COVID-19’s spread. Though the wisdom of these steps may be up for debate, one thing is not: Many people are concerned for their safety going forward.\n\nWe’re stepping back out into a world that involves increased risk of exposure to the virus we’ve all been trying to avoid. Exactly how much risk is unclear, but safeguarding health during the reentry process is all about prevention. And prevention is not only about continuing to engage in behaviors that we know help keep a lid on the spread of the virus and avoiding the ones that don’t. Just as important, if not more so, is fortifying your body against the scourge now, before an anticipated viral surge in the fall.\n\nif you’re waiting around for some miraculous, fast-tracked vaccine, it could be a long wait—at least, for a vaccine that’s reasonably safe, effective and doesn’t trigger a host of devastating side effects. So we need rational protection right now, and it’s up to us as individuals. To get started on a healthy, natural, self-inoculation path, here are the essentials to reduce risk right now, and during the months to come:\n\nCOVID-19 flies with the greatest of ease\n\nTo keep the virus at bay, it helps to understand the basics of how a coronavirus like the one that causes COVID-19 spreads. The average sneeze or cough releases hundreds of thousands of virus-laced respiratory droplets into the air. Even breathing, speaking loudly or singing can send thousands of droplets, both large and microscopic, flying through the air, leaving behind viral clouds that by some estimates can linger for about 15 minutes. So it’s easy to see how the virus can land on other people, as well as nearby surfaces, regardless of whether or not the person who launched the droplets (who may be asymptomatic and not taking special precautions) is still on scene. How far the viral particles travel and how long they linger will be influenced by things like the force of a cough or a sneeze (some particles can hit 200 mph), how good or bad the ventilation is, and which way the proverbial wind is blowing.\n\nShould you cross paths with a cloud of viral particles, researchers believe that it doesn’t take much—possibly as little as a few thousand or even a few hundred—to cause infection and illness. Though we don’t yet know the exact number of coronavirus particles that constitute the minimal infectious dose, we do know that a number of outbreaks have been traced to events like religious services, funerals and family celebrations, where one asymptomatic person in relatively close quarters sickened many others, sometimes fatally.\n\nWhen it comes to COVID-19, it’s believed that the bigger the viral load you’re exposed to—as in, the more particles that find their way into your system—the more severe the symptoms of the disease. Prolonged exposure is very likely to make matters worse. While a quick trip to the pharmacy would be considered fairly low risk, a full day of work in a busy office or manufacturing plant is not—far from it. But low risk or high, keeping the virus out is critical, which is why masks are so important. When you wear a mask, you’re primarily helping to prevent any virus you’re harboring (unknowingly, if you’re asymptomatic) from infecting others, and you’re also creating somewhat of a physical barrier between yourself and the viral droplets (large or small). Another mask-wearing bonus: You’ll be a lot less likely to transfer viral particles from your hands into your nose or mouth.\n\nGet in, get out\n\nSo what do those viral clouds mean in the real world? In enclosed spaces, even with social distancing, they increase risk for contagion, so the modern open-plan office is a major concern. If you’re one of the millions who are being called back to work in an office, at a time when a COVID-laced sneeze or two can potentially infect most of the room, insist on finding out what protocols management will be implementing to minimize infection risk. In addition to work-from-home options and flexible hours, on-site basics like increased physical distance between colleagues, physical barriers, upgraded sanitizing procedures, upgraded ventilation/airflow, ending the practice of “hot desking” (where different people use the same workspace at different times), and making masks mandatory for all—are a good place to start.\n\nAs we return to our offices and public transportation, masks and gloves are simple and effective barriers that will go a long way toward keeping you safe from viral invaders, so use them without fail (style be damned). If you need a bit more peace of mind, you might also want to consider wearing safety glasses to prevent particles from entering through the eyes. Keep spare masks, gloves and eyewear in sealed plastic bags, and be sure to store them in your desk drawer or in briefcases and backpacks, so you’re\n\n not caught short.\n\nIf your commute is a manageable one, instead of taking the bus or train, consider walking, riding a bicycle or using a scooter to minimize exposure to both asymptomatic and symptomatic commuters, as well as infected surfaces, along the way.\n\nAt the office, dispense with handshakes, fist bumps, elbow bumps and business card exchanges, and always be sure to maintain social distance. Keep in-person meetings to a minimum or, when feasible, consider conducting meetings outdoors, where distancing, sunshine and breezes can help minimize viral exposure. Why step outside? One preliminary Japanese study recently found that risk of transmission indoors was almost 19 times higher compared to an outdoor environment.\n\nIndoors, be conscious of shared office equipment and high-touch surfaces: break-room fridges and microwave handles, coffee-making equipment, door handles, elevator buttons, shared printers, copiers. Thoroughly wash your hands with soap and water (gloved or not) every chance you get, turning faucets on and off with paper towels as a barrier to help prevent infection.\n\nWith obesity, high blood pressure and heart disease being closely associated with poor COVID-19 outcomes, I cannot stress enough how important it is that you take your nutrition seriously, and work on getting those issues under control now. If you’ve made it through these first few months unscathed, that’s great, but you may not be so lucky when the next COVID-19 wave likely returns in the fall. And if you’re already on a healthy path, now is the time to upgrade your wellness regimens even more. The more you can fortify your body with nutrition and healthy habits, the better equipped it will be to repel the viral invaders. Here are a few essential tweaks to start with:\n\nManage your stress, with meditation moments through-out the day and restorative yoga before bed.\n\nSupport your mental health, which will in turn support physical resilience.\n\nMove more, walk more. Work out when possible; just don’t\n\n overdo it and undermine your immunity.\n\nGet a few minutes of morning sun, to help regulate sleep/ wake cycles, and to get a dose of vitamin D.\n\nRetrain yourself to sleep well, to give your body the time it needs to repair, restore and become more resilient.\n\nIf you snore, periodically wake up choking or gasping, or find it hard to remain asleep during the night, get checked for sleep apnea, which disrupts sleep and can weaken the heart, which can have dire, even fatal consequences.\n\nDitch vegetable oils (including canola oil) and switch to healthier fats to cook with, such as extra-virgin olive oil or avocado oil.\n\nLoad up on immunity-boosting, delicious medicinal foods rich in phytochemicals, anti-virals and anti-fungals.\n\nPour on turmeric, ginger, basil and other spices with medicinal benefits.\n\nGet into intermittent fasting and practices that encourage immunity-boosting autophagy.\n\nStrengthen immunity with supportive botanicals and nutraceuticals like curcumin, quercetin, N-acetylcysteine, zinc, vitamins C and D, and elderberry. drfranklipman.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Frank Lipman: Ask The Doctor - The Purist", "description": "Dr. Frank Lipman on how to protect yourself in a post-COVID-19 lockdown world.", "url": "https://thepuristonline.com/2020/07/dr-frank-lipman-2/", "site_name": "The Purist", "article:published_time": "2020-07-02T14:40:08+00:00", "article:modified_time": "2020-11-22T21:05:13+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/07/@culinarydots-copy-1024x1024.jpg", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["COVID-19"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/06/face-forward/", "https://thepuristonline.com/2022/08/lead-with-love-our-bodies-our-choice/", "https://thepuristonline.com/2022/10/the-language-of-trees/", "https://thepuristonline.com/2022/10/good-hair-day/"], "authors": ["James"], "publish_date": "2020-07-02T14:40:08+00:00"}