{"result_id": "304004", "URL": "https://thepuristonline.com/2021/09/who-rescued-who/", "timestamp": "2023-04-25 17:31:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/09/who-rescued-who/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Who Rescued Who?", "cleaned_text": "The ASPCA estimates that over 6.3 million companion animals across the country pass through the shelter system each year, all in search of the perfect fur-ever home. In comparison to the same period in 2019, adoptions of dogs and cats skyrocketed over 250 percent during the first eight months of the COVID-19 pandemic, peaking in March through April 2020, according to a report from Frontiers in Veterinary Science. While shelter euthanasia has dropped significantly since 2011 due to an uptick in adoptions, according to some estimates, approximately 56 percent of dogs and 71 percent of cats that enter animal rescue facilities are put to sleep. The statistics can be heartbreaking, but animal lovers can make a huge impact by adding a rescue pet to the family.\n\nBy opting to adopt an animal rather than purchasing one from a pet shop or breeder, you can save the life of both your new companion and other fur-babies in need. Removing one dog or cat from the shelter system makes room for another homeless pet to receive essential care, and your new pet’s adoption fee can help cover the shelter’s operating costs. Adoption is certainly a more cost-efficient route of pet ownership. Breeder fees can reach thousands, while shelters typically charge between $50-$350 per animal, which may—or may not—include spay/neuter services and vaccinations.\n\nCommon misconceptions about rescue pets contribute to rampant shelter overpopulation across the nation. Many regard shelter pets as “damaged”: either riddled with behavioral issues or medical conditions. In reality, most homeless pets land in shelters due to changes in their owner’s lives, whether it be a move, a divorce or the birth of a child. This means many shelter animals are already housebroken and have basic training down pat, which can save time, money and energy for a new pet parent.\n\nRescuing a canine companion can be the best way to eliminate puppy mills, a term given to factory-style breeding facilities that put profit above the welfare of dogs. Animals being bred in puppy mills live in shockingly poor conditions and can suffer serious health problems as a result, and many of the dogs sold in pet stores may be taken straight from these cruel environments.\n\nHamptonites looking to adopt a furry friend can consult with an abundance of rescues out East (see below). Animal Rescue Fund of the Hamptons executive director and CEO Scott Howe, owner of two rescue pets, says, “Adopting a shelter pet is a small, personal way of putting some good into the world. It’s intentional living and being mindful of what you’re doing.” After over 50 years of operation, ARF broke ground on a new state-of-the-art adoption facility, slated to open in 2022. “It will give animals the best home possible while they wait for their forever home,” says Howe. “The new kennels will have air conditioning and 100 percent fresh air circulation to fight against airborne animal pathogens. We are also building an 8,000-square-foot indoor training center, which is like a gymnasium for the community’s dogs!”", "opengraph": {"locale": "en_US", "type": "article", "title": "Who Rescued Who? - The Purist", "description": "Whether you’re fostering or adopting, a new best friend is waiting for you.", "url": "https://thepuristonline.com/2021/09/who-rescued-who/", "site_name": "The Purist", "article:published_time": "2021-09-28T16:40:09+00:00", "article:modified_time": "2021-09-28T16:41:31+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-28-at-12.41.14-PM.png", "image:width": "700", "image:height": "846", "image:type": "image/png"}, "tags": ["pets", "animal rescue"], "tweets": [], "movies": [], "links": ["http://www.arfhamptons.org", "http://www.bideawee.org", "http://www.gimmeshelteranimalrescue.org", "http://www.lcarescue.org", "http://www.southamptonanimalshelter.com", "https://thepuristonline.com/2022/08/numerology-beyonce/", "https://thepuristonline.com/2022/05/pure-good-4/", "https://thepuristonline.com/2022/06/be-the-change/", "https://thepuristonline.com/2022/10/good-hair-day/"], "authors": ["James"], "publish_date": "2021-09-28T16:40:09+00:00"}