{"result_id": "304014", "URL": "https://thepuristonline.com/2020/05/resilience-in-the-time-of-the-pandemic-2/", "timestamp": "2023-04-25 17:31:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/05/resilience-in-the-time-of-the-pandemic-2/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Resilience in the Time of the Pandemic", "cleaned_text": "As leaders in the field of mental health, we are dealing with a lot of questions about how the current pandemic is going to impact the mental health-related wellness of our nation over the long term.\n\nWhat we see is that the country has been swept by a tidal wave of anxiety, and much of it stems from the basic existential fears related to unstable employment, uncertain health risks, lack of food, a tenuous sense of belonging and lost human connections.\n\nThe most recent numbers from crisis help hotlines across the nation paint an even more ominous picture. One of the major mental health-crisis hotlines (SAMHSA’s Disaster Distress Helpline) experienced an 891 percent increase in call volume when compared to the same period last year. The call center has received more than 22,000 calls and texts from people seeking help.\n\nJust recently, the National Crisis Text Line handled about 6,000 text conversations, double their usual, with an increasing number of texts coming from paramedics, nurses, cashiers, unemployed workers, victims of intimate-partner violence and grieving family members. The crisis text line data reveals the emergent and growing mental health challenges facing our nation. Here are some of the preliminary insights:\n\n84% of those who reached out and identified as essential workers (in food, retail, health care or construction) reported experiencing coronavirus-related stress.\n\n80% of texts came from individuals feeling lonely and isolated.\n\n74% of people were distressed because of uncertainty about the future.\n\n67% indicated distress over their loss of routine due to the pandemic.\n\n47% of people were feeling financial distress as a direct result of the pandemic.\n\n44% said they were more fearful about their loved ones contracting the virus than themselves.\n\nThis data highlights only some of the current issues facing the general public. Just as importantly, these findings highlight the fact that people are reaching out and seeking help. The anxiety that people are experiencing, especially concerning job security, is very real and can produce very harmful mental health consequences. A plethora of research shows that financial stress and uncertainty about employment often have spillover effects for certain other types of risk, including relationship problems, substance abuse issues and mental health concerns. In addition, economists have long observed the hand-in-hand connection between financial crises such as the global recession in 2007-2008 and commensurate increases in the levels of clinical depression, anxiety and suicide.\n\nSo, the question about how the COVID crisis will impact mental health is not an easy one to unpack. With over 100,000 deaths due to COVID-19 in the US alone and the uncertainty surrounding when this virus will be brought to heed through widespread testing, therapeutics and a vaccine, there remains too much we still do not know. But we are able to look at other crises our country has faced throughout history to try to draw some reasonable expectations concerning what to expect moving forward. Whether it’s the lessons learned from the terrorist attacks of 9/11, the humanitarian crisis caused by Hurricane Katrina or the carnage resulting from mass shootings such as Parkland, our country has overcome many tragedies before. Each of these tests to our humanity has produced lessons we must now consider in our current fight. Below, we offer five key areas that we believe will define the mental health landscape across our nation in the wake of COVID-19.\n\nThe sorrow and devastation our nation is already experiencing will continue for a long time. We must first remember that loss comes in various forms. From otherwise healthy people facing their imminent death, to millions of Americans losing their livelihoods, to nurses and doctors losing patients en masse, to children losing their parents and grandparents without the opportunity to say goodbye—loss can be debilitating. And loss on the scale and the depth of suffering we are currently experiencing is virtually unprecedented in US history. Yet, previous experiences with the nation’s ability to withstand loss and to eventually make meaning of these tragic experiences should provide all of us hope. For example, I [Kelly Posner Gerstenhaber] know from my direct work with the Parkland community that long-term outcomes for survivors are improved with the help of community connections and ongoing access to mental health support. Our job then is to make sure this help will be available, when and where it is needed.\n\nWhile serving as a civilian military leader after 9/11 and during the buildup of mental health and family programming associated with the global war on terror, I [Keita Franklin] observed the power of leadership in buffering the impact of trauma exposure. This lesson must be transferred to business leaders across the nation. Put simply, the health of your workplace will largely depend on how well leaders lead during times of crisis. Compassionate, empathetic and flexible approaches that take into account the stressors facing the workforce will be needed for the foreseeable future. And leaders must be able to communicate and “over-communicate” with their employees concerning available resources. Such communication reduces employee anxiety and lessens the real-world impact of crisis. Finally, it is important for leaders to recognize that every employee will process the stressors associated with the current pandemic differently. Disparate factors such as whether the employee has experienced previous traumatic situations and the strength of the employee’s social network will lead to different reactions and experiences for employees. During my time leading a large program in the Pentagon, I was amazed at how resilient people can be and how many people who have been exposed to trauma are able to process events as a “normal reaction to an abnormal event.” But we know that many employees will need help processing the trauma. As one military general office once told me, “We need everyone to realize that it’s OK if you are not OK.” Leaders must encourage employees to seek help.\n\nAnxiety can happen to anyone. Even as a mental health professional, I [Keita Franklin] have experienced it throughout my lifetime—it’s the body’s natural way of responding to extreme stress. Anxiety is one of those emotions that you can physically feel in your chest, or in the palms of your hands or in the pit of your stomach. Yet anxiety also has behavioral indicators, including increased irritability, difficulty concentrating and even trouble sleeping. During the current emotional environment, anxiety is a fairly common reaction to dealing day in and day out with unknowns and the fear presented by the COVID-19 pandemic. Even with the physical-distancing guidelines in place and rudimentary personal protective equipment such as homemade face masks, it is natural to worry about the risk of personal exposure, as well as the risk to our loved ones. As a military spouse and a social worker, these are experiences that feel quite familiar. Following the events of 9/11, during which America was attacked without warning, I witnessed a military community that was immediately thrust into action. In a matter of days, airmen left their families to deploy halfway across the globe to fight an enemy that was often hard to identify. They left behind spouses, children, mothers, fathers and friends filled with fear, uncertainty and anxiety. I knew then, as I know now, that social support and a feeling of belonging would be critical to the mental well-being of those left behind. Physical or emotional isolation is detrimental to the mental health of all of us. COVID-19 has introduced America to the concept of “social distancing” as a public health measure. Yet, physical or social distancing does not have to mean emotional distancing. We need to stay emotionally connected to those we love and care about and use these emotional connections to help us ease the anxiety we are experiencing about the pandemic.\n\nAs a nation, we are going to have to prepare not only for the delivery of mental health care as part of business as usual, but also prepare for the long-term mobilization of resources to buffer or mitigate the signs of post-traumatic stress disorder, anxiety, depression and suicide risk. Asking each other direct questions about difficult thoughts and feelings gives us all permission to be human and to heal from the stress and trauma together. One significant barrier to this is the lack of screening for suicidal thoughts. We know that nearly 50 percent of those who die by suicide visit their primary-care doctor in the month before they die, and most adolescents who have tried to end their own lives present to the ER for nonpsychiatric reasons. How do we identify those at risk for suicide? The answer is surprisingly simple: We must screen and monitor like we do for blood pressure, hearing or vision. Resources such as The Columbia Protocol are already at our fingertips, and with even wider implementation, we can support communities and all their members to identify suicide risk, so that we can reach those at risk before they are in crisis.\n\nDespite the trauma, grief and feelings of anxiety we are currently experiencing, there is hope. We are reminded of the term “post-traumatic growth” used in our field to help understand how individuals often “come out on the other side” of trauma stronger than when it all started. As humans we learn how to grow, how to reach out for help when we need it most, and how to support one another through these devastating experiences. Even now, we can feel the hope in the kindness of others. Since COVID-19 began, we have seen the kindness of strangers reaching out to elder nursing home residents through windows. We have seen children with “drive-by birthday parties” so every child feels special on their special day. And we have seen neighbors rallying resources for those most in need in their community. These everyday acts of kindness are demonstrations of what Americans are about, especially during times of crisis. These patriotic acts will help carry us through the long road ahead and promise a better future in a post-COVID new normal.\n\nDr. Kelly Posner Gerstenhaber, director and founder of The Columbia Lighthouse Project, is a recipient of the Secretary of Defense Medal for Exceptional Public Service. Dr. Keita Franklin, former director of suicide prevention for the Department of Defense and Veterans Affairs and chief clinical officer at Psych Hub, has received numerous federal and civilian awards for her efforts leading military, family, mental health, and suicide prevention programs.", "opengraph": {"locale": "en_US", "type": "article", "title": "Resilience in the Time of the Pandemic - The Purist", "description": "Two leading mental health experts share vital insights on recognizing  the stress and hurt right now, and finding hope going forward. By Kelly Posner Gerstenhaber, PhD, and Keita Franklin, PhD", "url": "https://thepuristonline.com/2020/05/resilience-in-the-time-of-the-pandemic-2/", "site_name": "The Purist", "article:published_time": "2020-05-29T17:41:48+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/05/guillaume-bleyer-GDoh9pYC_W4-unsplash-683x1024.jpg", "image:width": "800", "image:height": "1200", "image:type": "image/jpeg"}, "tags": ["mental health", "COVID-19"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/08/how-to-acknowledge-mental-health-concerns-following-roe-v-wade/", "https://thepuristonline.com/2022/10/conversation-for-a-cause-hope-for-depression-research-foundation/", "https://thepuristonline.com/2022/10/mind-body-nourishment/", "https://thepuristonline.com/2022/06/mediterranean-makeover/"], "authors": ["James"], "publish_date": "2020-05-29T17:41:48+00:00"}