{"result_id": "304013", "URL": "https://thepuristonline.com/2020/12/eks-events-aspen-event-planner/", "timestamp": "2023-04-25 17:31:21 CEST+0200", "meta": {"description": "Aspen’s premier events planner, Elizabeth Slossberg of EKS Events, teams with the Aspen Education Foundation to greet new families.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/12/eks-events-aspen-event-planner/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "EKS Events: The Aspen Event Planner", "cleaned_text": "While it’s decidedly not the year of the Big Fat Greek Wedding, Aspen-based events planner Elizabeth Slossberg is doing her best to keep the spirit of celebration alive in more intimate ways.\n\nSlossberg, who describes herself as “100 percent Greek,” is the owner and founder of EKS Events, a prominent private party organizer based in Aspen. Her wedding and charity events—including Action in Africa, at which Coldplay’s Chris Martin performed, and Aspen Education Foundation (AEF)—are the talk of the town, and raise funds for important causes. Fashion houses such as Gucci regularly sponsor her charity events.\n\nAnd her recent virtual fundraisers for Joe Biden, in the Zoom format, drew the likes of former President Barack Obama, Bruce Springsteen, Dwayne “The Rock” Johnson, Sting and Melissa Etheridge, among others. All of the performers spoke and played live music, mostly from their homes.\n\nYet the pandemic has taken its toll on the business of elaborate philanthropic galas, birthdays, weddings and bar mitzvahs. “Most of the planned events have been postponed until summer,” she says. “And we’ve recommended it.”\n\nTaking modest steps out of the limelight, Slossberg of late has been replacing receptions, per se, for receptions of new arrivals to the Aspen community with a pop and a clink (at a distance). Slossberg and her fellow AEF members concocted a “party box” given to newcomers to the city’s public school system. “We ordinarily throw a cocktail party for every new family,” she says. Hand-delivered under COVID guidelines to residences throughout the mountains and valleys, the box includes all the ingredients to mix cocktails, along with a custom shaker, a recipe card and other “goodies,” she says, “to help each parent celebrate the school year.”\n\nFor those who choose to let the show go on, 20-year-old EKS Events has downsized the majority of get-togethers with a focus on family and dear friends in smaller settings.\n\n“We love winter weddings in Aspen,” she says. “It’s one of the most romantic of settings—the snow, the sparkle and grandeur of the mountains. It’s a dream come true.”\n\nThe daughter of a large Greek family, long in the restaurant business, Slossberg had planned on becoming an environmental lawyer, but was detoured from law school into the service industry in Aspen. She began at the Hotel Jerome, working her way up to becoming the food and beverage director there. That led to her appointment as the special-events director for the city of Aspen. She used that experience to start her own high-end events business. “I then knew that service was in my blood,” she says. “Nothing makes me happier than helping to create memories.” From budgets and transportation to décor and catering, she does it all. The luxury brand specializes in personal celebrations as well as corporate events and charity fetes.\n\nFor her own wellness of being, she says that she is an avid snowboarder and skier. “I have eight boys who keep me busy, and I have three German shepherds that are my world. I do everything outdoors with them: hike, play in the snow, all the doggy fun.”\n\nHer diet takes its cues from her Greek background. “It’s a very Mediterranean-style diet. Lots of olive oil in all of my recipes,” she says. She recommends that visitors try Aspen’s seasonal pop-up restaurants: “We’re really known for them.”\n\nWith the COVID vaccines expected in the new year, Slossberg is optimistic. “I think this time next year we’re going to have some of the most joyous celebrations we’ve ever had. We’ve all earned the right to toast life at its fullest.” eksevents.com", "opengraph": {"locale": "en_US", "type": "article", "title": "EKS Events: The Aspen Event Planner - The Purist", "description": "Aspen’s premier events planner, Elizabeth Slossberg of EKS Events, teams with the Aspen Education Foundation to greet new families.", "url": "https://thepuristonline.com/2020/12/eks-events-aspen-event-planner/", "site_name": "The Purist", "article:published_time": "2020-12-14T22:40:12+00:00", "article:modified_time": "2020-12-17T17:29:50+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/12/olena-sergienko-JjGLEN7T8xI-unsplash-683x1024.jpg", "image:width": "800", "image:height": "1200", "image:type": "image/jpeg"}, "tags": ["Aspen", "events planner"], "tweets": [], "movies": [], "links": ["http://www.eksevents.com", "https://thepuristonline.com/2022/06/singular-sanctuary/", "https://thepuristonline.com/2022/06/at-a-glance-aspen-2/", "https://thepuristonline.com/2022/12/her-treasure/", "https://thepuristonline.com/2023/04/fire-ice-gala-in-aspen/"], "authors": ["James"], "publish_date": "2020-12-14T22:40:12+00:00"}