{"result_id": "304007", "URL": "https://thepuristonline.com/2021/12/the-benefits-of-walking-meditation/", "timestamp": "2023-04-25 17:31:11 CEST+0200", "meta": {"description": "The Benefits of Walking Meditation are vast. We can often focus much more when we are engaged in some form of movement.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/12/the-benefits-of-walking-meditation/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "The Benefits of Walking Meditation", "cleaned_text": "There’s a Yiddish word, shpatzir, which means a constitutional walk taken without any particular destination, for pleasure. The appealingly non-goal-oriented idea of a shpatzir, and the proven benefits of walking in nature, are two reasons why I’ve never owned a treadmill or belonged to a gym. I’ve been walking in Central Park, which is a block from my apartment, every morning for the past 25 years. Often while I walk, I meditate. There are many traditions of walking meditation, from Zen gardens to Japanese forest bathing, and plenty of modern research that shows that it actually helps us to focus when we are engaged in some form of movement.\n\nMy daily meditations involve visualizations and mantra recitations prescribed as daily commitments as part of Tibetan Buddhist Vajrayana practice. The park tends to offer enough solitude that I can become absorbed in reciting these prayerful meditations without much distraction. It takes me about one hour a day to complete my formal meditation commitments, during which I often stroll, immersing myself in the park, an oasis of nature smack-dab in the middle of Manhattan.\n\nThen came the pandemic, and the joy of my morning walk in Central Park became fraught with calculations about exposure to a potentially fatal viral load, and the more mundane discomforts of mask wearing. Until then, the thought of walking or running on a treadmill always struck me as about as appealing as being a hamster on a wheel. Not only because you’re indoors, going nowhere, but because it reduces exercise to a means to an end. But last year, as autumn turned colder and slushier, and then New York was battered by major snowstorms, and new, more dangerous COVID variants began to spread, I found myself scanning Amazon reviews for small foldable treadmills.\n\nBecause I live in New York and don’t manage a hedge fund, my apartment is only marginally larger than a full-size treadmill. So I found one that could reasonably be considered portable (it weighs 75 pounds) and began to use it on days when the weather was too cold or rainy.\n\nAs winter turned to spring, and for a moment it seemed we had COVID under control (remember that brief moment when we were told we could throw away our masks if we were vaccinated?), I thought I would give up on the treadmill. But with the rise of the Delta variant, staying indoors has once again proved to be the safest way to avoid exposure. And so, in the prolonged crisis of the pandemic, I’ve discovered another benefit of having a treadmill at home that has nothing to do with health or fitness.\n\nIf you enjoy walking meditation, having a treadmill at home means fewer distractions. You won’t bump into an old friend. You can almost close your eyes, or set up your treadmill to face a white wall or a favorite painting, and get into the zone more easily. You can walk in silence and allow your mind to focus on whatever you like—whether it’s a visualization, a mantra or just the movement of your breath.\n\nI never would have thought of a treadmill as a spiritual tool, but among many terrible consequences of the pandemic, this has been one small bright spot. There’s no denying that Central Park is more beautiful than my apartment, but the park is also full of distracting sights and sounds. My treadmill has become my altar. I can walk in privacy and relative solitude (not counting occasional interruptions by my 6-year-old son) and focus my mind, walking in peace, or at least taking a few daily steps toward it.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Benefits of Walking Meditation", "description": "The Benefits of Walking Meditation are vast. We can often focus much more when we are engaged in some form of movement.", "url": "https://thepuristonline.com/2021/12/the-benefits-of-walking-meditation/", "site_name": "The Purist", "article:published_time": "2021-12-04T04:59:19+00:00", "article:modified_time": "2022-08-15T15:09:46+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/11/pexels-leticia-azevedo-9307242-768x1024.jpg", "image:width": "800", "image:height": "1067", "image:type": "image/jpeg"}, "tags": ["walking", "meditation"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/06/eco-therapy/", "https://thepuristonline.com/2023/04/cara-buono-what-wellness-means-to-me/", "https://thepuristonline.com/2022/10/five-easy-ways-to-stop-your-aging-clock/", "https://thepuristonline.com/2022/12/wellness-central-2/"], "authors": ["James"], "publish_date": "2021-12-04T04:59:19+00:00"}