{"result_id": "304025", "URL": "https://thepuristonline.com/2020/12/neinstein-plastic-surgery-beautification-central/", "timestamp": "2023-04-25 17:31:42 CEST+0200", "meta": {"description": "NYC’s largest, most innovative private center for cosmetic enhancement, Neinstein Plastic Surgery, makes a splash at Bergdorf Goodman.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/12/neinstein-plastic-surgery-beautification-central/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Neinstein Plastic Surgery: The Beautification Central", "cleaned_text": "Lipo in the time of the coronavirus is getting a big plumping in Manhattan with the January debut of the largest private plastic surgery facility in the city. Located in Fifth Avenue’s grand dame—the 121-year-old Bergdorf Goodman—and helmed by Dr. Ryan Neinstein, the 4,500-square-foot space will cater to the ladies who lunch and shop, as well as a modern-day bold face clientele, the celebrity drag queen. (Dr. Neinstein makes it a point to mention that his office proudly welcomes the drag and transgender communities—what he calls “the new diversity.”)\n\nThe facility has its own private entrance next to the women’s store. “There maybe unanticipated bills,” jokes Neinstein, a Toronto-born Tribeca resident, who did quite an about-face, leaving the Israeli army, where he was a volunteer paramedic, to pursue the beauty-preserving profession. His wife, Lauren Duhamel Neinstein, founder of Legs by Lauren and a prominent fitness trainer, will lead body-sculpting classes in an outdoor space.\n\nBesides the unreal estate space, Neinstein says that the practice will stand out in the overrun land of nip and tuck—the crossroads of the Upper East Side—by focusing upon subtle body contouring. “Coming up, I was doing every type of plastic surgery, but I was drawn to body contouring. It was the perfect blend of art, engineering and psychology—and allowed me to work with men and women of all ages.”\n\nDr. Chris Funderburk will helm the male body-sculpting plastic surgery practice. And another standout staffer, Fay Jouni, a registered nurse, “was once the queen of New York City nightlife,” according to Neinstein. “Fay has a patient-focused, individualistic approach to facial injectables. She is from the Middle East, which gives her a worldly sense of fashion and style. New York is nothing if not a melting pot of people from all over the world.”\n\nThat Neinstein began building the facility at the outbreak of the coronavirus was a Hail Mary for the city and its cosmetically conscious residents. “Being put together during the pandemic, we have had to evolve and seek experts from all disciplines to ensure we have new air filtering, scanning, mobilization technology—along with innovative traffic flows, IT and personal-space protection capacity to ensure safety and privacy…all the while maintaining luxury.”\n\nNeinstein emphasizes that the facility will bring all ages and walks up to speed on the latest of innovations in the plastic surgery industry—such as EMSculpt, nonsurgical muscle-building with electromagnetic energy to complement liposuction, and adding ionized helium technology for collagen tightening. “We’re not forcing patients into outdated procedures,” he says.\n\nThis is decidedly not a Brooke Astor/C.Z. Guest-era salon. More so, say, Carrie Bradshaw, frequently featured shopping at Bergdorf for incoming Louboutins on Sex and the City. “Our views of Central Park are amazing, inspiring,” says Neinstein. In the years before securing the lease, Neinstein confides that he’d never entered the Fifth Avenue stalwart. Asked what will be the first thing that he buys at the department store—a scene-stealing location in films like Arthur, Ocean’s 8 and The Muppets Take Manhattan—the plastic surgeon said: “A mezuzah.” He may want to second-check that BG shopping site. neinsteinplasticsurgery.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Neinstein Plastic Surgery: The Beautification Central", "description": "NYC’s largest, most innovative private center for cosmetic enhancement, Neinstein Plastic Surgery, makes a splash at Bergdorf Goodman.", "url": "https://thepuristonline.com/2020/12/neinstein-plastic-surgery-beautification-central/", "site_name": "The Purist", "article:published_time": "2020-12-14T18:59:27+00:00", "article:modified_time": "2020-12-16T19:32:33+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/12/@nude_yogagirl-2-820x1024.jpg", "image:width": "1500", "image:height": "1873", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["http://neinsteinplasticsurgery.com", "https://thepuristonline.com/2022/06/main-street-masterpiece/", "https://thepuristonline.com/2022/12/sage-sound-curated-wellness/", "https://thepuristonline.com/2023/04/a-touch-of-france/", "https://thepuristonline.com/2022/05/pure-property-12/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-12-14T18:59:27+00:00"}