{"result_id": "304030", "URL": "https://thepuristonline.com/2022/05/pure-good-4/", "timestamp": "2023-04-25 17:31:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2022/05/pure-good-4/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Pure Good", "cleaned_text": "ADAM ROSANTE: For anyone who’s not familiar, what is Maureen’s Haven?\n\nDANIEL O’SHEA: Maureen’s Haven provides homeless support services and programs for the homeless in our community. We also operate an Emergency Winter Shelter Program, which offers overnight shelter to 35 individuals each night from Nov. 1 to April 30. The Kay Kidde Achievement Center, which is in Riverhead and is open year-round, gives our guests access to critical support services. They can meet with case management and our social worker, they have access to programs and support services, they can obtain essential items such food, clothing and toiletries, and they have a safe, welcoming place to seek respite and compassionate care.\n\nAR: What would people be surprised to learn?\n\nDO: Most people who are familiar with Maureen’s Haven know about our Emergency Winter Shelter Program. However, it is the day-to-day activities that happen at our Day Center that truly makes a difference in the lives of those we help. Our staff works tirelessly to help our guests find housing and/or complete housing applications, we connect them to treatment providers, we help them find jobs, and we coordinate medical care, mental health care and substance abuse counseling. We also assist with many of the basic things we take for granted such as obtaining ID, transportation to required appointments or simply charging a cellphone. What people are also unaware of is the actual number of homeless we help each year. Typically, volunteers only see the 30 to 35 guests we send to the shelter each night. In reality, we assisted over 300 individuals in 2021, most of them from communities here on the East End.\n\nAR: What’s your biggest challenge right now?\n\nDO: Our biggest challenge is always funding. We are a private nonprofit, and less than 14 percent of our annual budget comes from Suffolk County and the four East End towns. The rest of our operating budget comes from private donations, grant writing, foundations and fundraising events. COVID-19 also placed tremendous challenges on the agency, especially from a staffing standpoint. Since the start of the pandemic, we’ve had to adapt our services to meet these challenges, which required us to increase our staffing levels, increase cleaning and safety protocols, and fill in any of the gaps that volunteers did in the past, such as laundry and food costs.\n\nDO: We have many, but the one that stands out recently is helping a family with a small child. While we don’t normally work with children, this case was unique, and we had no other option but to help them. The mother is a victim of domestic abuse, the grandmother had come from Ecuador to help her daughter, and an adorable 6-year-old son was now caught in the terrible situation. They told him that they were camping, but in reality, they were living in a parking lot in Amagansett. The biggest challenge was that the mom is undocumented and ineligible for many social services. They truly had nowhere to go, but we didn’t give up hope. Eventually, we were able to get them placed in a domestic abuse shelter that accepted all three, which is very unusual. We helped them obtain legal services, we made sure they had food, and we even bought new clothes and a few toys for the child. Today, mom is working, the son is in school and they are working on putting the pieces back together. Most of all, they are safe, warm and moving toward a better life.\n\nAR: Why is it important to use your life to be of service?\n\nDO: I can’t think of a better way to serve those most in need in our community than Maureen’s Haven. It truly is a gift to everyone involved. For me, it is making a difference in a person’s life and knowing that the efforts I took helped someone who was struggling through life. Maureen’s Haven also plays a role in community engagement and volunteerism. Not only do we provide critical lifesaving services, but we are also very involved in the local communities we serve, which is deeply important to so many. We see volunteers from throughout the East End coming together to support our mission, and it is an incredible thing to witness.\n\nAR: How can people get involved with Maureen’s Haven?\n\nDO: The best way to support our mission is through financial support. Your contributions put gas in our vans, pay for programs and help us pay our staff. The COVID-19 pandemic has forced us to adapt our services, but that comes at a cost. For example, we have worked tirelessly to get our guests vaccinated and so far, we have taken guests to over 25 vaccination sites across Suffolk County. And of course, we are always looking for volunteers. maureenshaven.org; 631.727.6831", "opengraph": {"locale": "en_US", "type": "article", "title": "Pure Good - The Purist", "description": "Tackling homelessness in the Hamptons with Maureen’s Haven Executive Director  Daniel O’Shea.", "url": "https://thepuristonline.com/2022/05/pure-good-4/", "site_name": "The Purist", "article:published_time": "2022-05-20T18:47:07+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2022/05/jonas-denil-F5YZ90QWYBQ-unsplash-668x1024.jpg", "image:width": "1670", "image:height": "2560", "image:type": "image/jpeg"}, "tags": ["Maureen's Haven", "nonprofit"], "tweets": [], "movies": [], "links": ["http://www.maureenshaven.org", "https://thepuristonline.com/2023/04/aspen-films-youth-culture/", "https://thepuristonline.com/2022/06/concierge-medicine/", "https://thepuristonline.com/2023/04/adapt-leadership-awards-gala/", "https://thepuristonline.com/2022/08/sophisticated-senior-living/"], "authors": ["James"], "publish_date": "2022-05-20T18:47:07+00:00"}