{"result_id": "304005", "URL": "https://thepuristonline.com/2021/06/captain-fantastic/", "timestamp": "2023-04-25 17:31:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/06/captain-fantastic/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Captain Fantastic", "cleaned_text": "Peace of mind is turning over the keys to a trustworthy caretaker, knowing that one’s home is secure. Such an individual is never easy to find; now meet Benjamin Vaschetti, whose new business, Maison Benjamin, is a premium lifestyle concierge service offering property management, travel arrangements, catering and more for residents of the Hamptons, New York City and Miami. “Our goal is to become a valuable resource for our clients, to deal with all those annoying things they would rather not do,” Vaschetti says.\n\nYears of manning gourmet galleys aboard mega-yachts, plus cooking on land for kings (including the royal family of Greece) prepped this Michelin-caliber chef for keeping things shipshape in all areas of the home, indoors and out. In 2018, Vaschetti opened Mokum on NYC’s Upper West Side; COVID spurred the eatery’s closure as well as the creative pivot that is now Maison Benjamin, incorporated last year. “My partner and wife, Natalia, and I had this business in mind for a while; then Mokum closed and we weren’t able to go out, so we said, let’s bring the service to the clients. COVID basically made this happen.” Naturally, the comprehensive travel plans the co-founders coordinate include keeping abreast of changing COVID vaccine regulations around the globe.\n\n“While clients are away, that’s when we take over their house,” Vaschetti says. “We do any work that has to be done: painting the kitchen, fixing the elevator, tending the tennis court, watering plants, improving anything that needs to be improved. The day before the clients return, we do the grocery shopping and fill the fridge.”\n\nBut it’s not all fix-its—there’s plenty of fantastique to the menu of Maison Benjamin services, all aiming to make patrons feel like royalty. Should clients need any accessories, from lingerie to lamps to spiffy sofa slipcovers, Natalia’s realm is personal shopping and artful décor. Poolside brunch, anyone? “After a swim, we give you a towel, a refreshing slice of watermelon and a glass of Champagne,” Vaschetti says. “We are here to pamper our clients.” maisonbenjamin.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Captain Fantastic - The Purist", "description": "Maison Benjamin keeps your home running safe and sublime while you’re away.", "url": "https://thepuristonline.com/2021/06/captain-fantastic/", "site_name": "The Purist", "article:published_time": "2021-06-25T19:52:29+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/06/Maison-LC-15-993x1024.jpeg", "image:width": "800", "image:height": "825", "image:type": "image/jpeg"}, "tags": ["catering", "lifestyle concierge"], "tweets": [], "movies": [], "links": ["http://www.maisonbenjamin.com", "https://thepuristonline.com/2022/08/sophisticated-senior-living/", "https://thepuristonline.com/2022/12/indulge-in-travel/", "https://thepuristonline.com/2022/06/the-state-of-aspens-short-term-stays/", "https://thepuristonline.com/2022/08/safe-and-secure/"], "authors": ["James"], "publish_date": "2021-06-25T19:52:29+00:00"}