{"result_id": "304021", "URL": "https://thepuristonline.com/2020/04/cristina-cuomo-corona-protocol-week-3/", "timestamp": "2023-04-25 17:31:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/04/cristina-cuomo-corona-protocol-week-3/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Cristina Cuomo Corona Protocol, Week 3", "cleaned_text": "On this 50th anniversary of Earth Day, show kindness toward our planet and every creature who inhabits it, as the transcendent photographer, adventurer, preservationist and raconteur Peter Beard advised us. My old friend’s recent death offers an eerily timely punctuation on this virus and a reminder that we can’t forget to protect one another, and the animals that roam the Earth.\n\nOne’s character will truly be evident now as things begin to open and people begin to recirculate in public. Are we going to behave like locked-up wild animals set free? Maybe we take a cue from them and emerge slowly, quietly, trepidatiously. How will we greet one another? How will we behave when those we know get sick, because this virus is not going away? This is a great challenge America is facing now as we organize re-entry. It’s also an opportunity to be consciously aware of the good in our lives and also to learn how to keep our health strong.\n\nI am aware that what I am about to talk about are remedies for people who are already in a privileged situation–we have a roof over our head, enough food to eat and clean drinking water, and not everyone has that. Many of the treatments that I relied on are actually cheaper than conventional medicine, like the broth of cayenne pepper, ginger and garlic or the lemon and ginger tea or vitamin C.\n\nWe need to take care of ourselves in a different way than many of us have before. It’s about strengthening the immune system and having the body working optimally with self-care and good diet so that we don’t get sick in the first place. But if we do, we will be in better shape to manage the symptoms and the illness. This comes from what we eat, breathe, drink, and surround ourselves with. Once you commit to managing this lifestyle, it’s actually the easiest and least expensive way to manage health.\n\nThe point of sharing my story is to help people become aware of the various options that are available beyond the overstrained medical system and to give a voice to the scientific advances that could have a real impact on our collective health. Sharing new knowledge is not elitist, it’s revolutionary. This is the driving intention behind Purist, with good health as its north star.\n\nThis past week was very challenging. What started as a sinus cold escalated into nightly sinus headaches and tough breathing. Since there is no proven treatment for COVID-19 and I did not want to embark on a side-effects nightmare of unproven drugs, I was ready to try alternatives to ease my symptoms. Consistent with medical standards of care, none of these natural remedies below should be taken without consulting a doctor or naturopath. I enlisted Dr. Linda Lancaster, who put my husband on a path of natural remedies to strengthen his immune system—and now mine–and it seems to be working for us. If you think these are far-fetched treatments as I once did, think again. I went through tons of antibiotics for chronic Lyme disease last year, which did not help eradicate the Lyme. I did some tests and found out that certain strains of bacteria in my body are resistance to certain antibiotics. After almost a year of doctors’ differing prescriptions and one experimental anti-parasite medication that sent my body into an inflammatory mess, not to mention the toll they all took on my gut, I decided to take a natural course with Dr. Lancaster. Only then did I get better. We decided to apply that information to this virus because currently, there is no proven remedy for it. My doctor’s medical treatment prescribed for my indications/symptoms of, and immune response to, coronavirus listed below are not cures to coronavirus.\n\nWe are all trying to find tools to help stay healthy. The fact is, there are no standardized treatments for this virus yet. I am very grateful I have the ability to research and educate myself on natural remedies and try them and write about them for a living. I’m sharing my journey, and many of these things are not widely available—I know how lucky I am to be able to have access to these things I write about as well as access to doctors through the work that I do. My hope is to share information and alternatives that many might not have access to and are interested in hearing about. Access to health care and medicine should be a human right, not a privilege. Regardless of accessibility, I wanted to give my immune system a fighting chance. Dr. Lancaster teaches people to “access and care for the body’s vital force to heal…to switch on our body’s ability to stay well in a world of challenging forces and help our body to heal when we are sick. This force exists within everyone, no matter their age, current health concerns, or predispositions.”\n\nFirst and foremost, sleep is the most important thing. I was able to get some good, restorative sleep of about eight to 10 hours on a few nights during the week of moderate symptoms, and I had a hard time getting up most mornings. My goal was to steer the sinus cold away from getting into my lungs and avoid getting a fever. Rest, recovery, reflection. Some form of meditation eased the high cortisol levels (stress) too. Resonance breathing and Pranayama helped expand my lungs. “The breathing exercises we work with are designed to boost vitality and uplift consciousness. Through them, we utilize the ‘breathing mechanism’ (inhale and exhale) to influence, or direct, the flow of vital life energy deep within the physical body (as well as the energetic body),” says yogi Erika Halweil of the breathing exercises she teaches. “Beyond expanding the shoulders, upper back and rib cage; beyond stretching the lung tissue from within; these conscious, deep breathing exercises activate a life force within us to help us attain a higher state of vibratory energy. They create space in the body and a feeling of joy and ease in the mind and heart.” I like Deepak Chopra and Eddie Stern’s Breathing app, as well as Calm, which my kids listen to at bedtime.\n\nI did not mix the vitamins and minerals Dr. Lancaster sent me with any traditional prescriptions and, again, a naturopath or doctor should be consulted.\n\nI made Dr. Lancaster’s “liver-cleansing” beverage with ingredients that offer support by blending one raw garlic clove, one orange, one lemon, a teaspoon of cayenne pepper, a spoonful of olive oil, fresh ginger and a piece of fresh turmeric. On the days I was also in isolation, I made a big batch in advance and kept it in the fridge.\n\nAlka C—3000 mg per day (helps reduce the inflammation this virus causes all over the body)\n\nVitamin D (read this preliminary report exploring the possible role of vitamin D in the prevention of coronavirus disease.)\n\nGlutathione powder (liposomal glutathione is available in tablet form from Bulletproof)\n\nViracid from Orthomolecular—while this is available online at a markup now, Pretty Healthy NYC offers it for $40.\n\nOn Tuesday, my sinus congestion was so painful that I called Dr. Roxanna Namavar from Pretty Healthy NYC, who suggested I do a vitamin drip. She also comes to your home, and does testing for COVID-19 and other viruses. Doctors suggested the drip because “New York hospitals and hospitals all over the world are using the vitamin C drip as part of their COVID-19 treatments (not a cure) since vitamin C may have anti-viral properties,'” says Dr. Namavar, who shows up in a hazmat outfit and 3M mask because I couldn’t leave the house. In March, Dr. Andrew Weber of Northwell Health services said of the Vitamin IVs hospitals have been administering to patients: “The patients who received vitamin C did significantly better than those who did not get vitamin C” in this article on how a hospital turns to high-dose Vitamin C to fight coronavirus. Vitamin C is best known for its antioxidant properties, “being able to scavenge damaging reactive oxygen species, thus protecting the body’s cells and tissues from oxidative damage and dysfunction. However, the vitamin also has numerous other important functions within the body, many of which are known to support healthy immune function,” the National Institutes of Health reported in its announcement that a new clinical trial to test high-dose vitamin C in patients with COVID-19 is underway in China. “Orally you can’t absorb the amount of vitamin C comfortably that is required for the anti-viral properties to combat this virus. The IV version is a safe alternative. You have to be really sick to go to a hospital, which may charge a fortune for a pharmaceutical treatment that might not be effective,” says Namavar. In my vitamin-packed drip: magnesium, NAC (a precursor to glutathione, said to be possibly helpful against COVID-19), vitamin C with lysine, proline, and B complex, folic acid, zinc, selenium, glutathione and caffeine (to combat severe sinus headaches). NAC is N-Acetyl-Cystine—an antioxidant amino acid (which is used for respiratory health; see here,) and replenished glutathione. NAC is also available in capsule form from thorne.com. After two hours, this pricier investment paid off and my intense sinus pain was gone. IVs are not cheap: A vitamin drip costs around $300–less than the price of a hospital IV–and both are out of reach for most people.\n\nThen, Dr. Lancaster, who reminded me that this is an oxygen-depleting virus, created a therapy that might offer benefits for my flu-like indications (symptoms), as allowed under AMA Ethics Opinion 3.04. Among the many things she prescribed was a type of homeopathic bath, a water-and-dilute sodium hypochlorite bath (commonly referred to as a water-and-bleach bath), to combat the radiation and pollutants in my system and oxygenate it. Before considering this affordable evidence-based doctor recommendation, I turned to into the most credible sources of health information, where I found her bath prescription of water and sodium hypochlorite endorsed in multiple clinical practice guidelines, mostly for treatment of skin conditions like atopic dermatitis and some bacterial infections.\n\nTo ensure the safety of these baths, I found they are medically validated by a number of randomized clinical trials, including from the American Academy of Dermatology and the Mayo Clinic, (the No. 1 hospital in the United States per the U.S. News & World Report, the water-and-bleach bath is reported as not only safe, but an efficacious supplemental home intervention for several medical conditions including eczema and cutaneous lymphoma. A rigorous meta-analysis found on the National Institutes of Health’s website and published in the Annals of Allergy, Asthma & Immunology indicates that regular 10-minute water-and-bleach baths at high dilution, followed by a warm rinse with clear water, can significantly reduce the severity of medical symptoms of atopic dermatitis and infantile atopic dermatitis. My doctor, homeopathic physician Linda Lancaster, gave me this medical rationale for the use of these baths in relief of COVID-19 symptoms like body aches and fatigue: “COVID-19 causes hypoxia, which is a form of oxygen deprivation, and the bleach-and-water bath has been used for over 75 years to help oxygenate the cells and decrease inflammation.” She further noted that she has successfully treated many patients who exhibited COVID-19 symptoms with this protocol in the past few months, always resulting in both symptom alleviation and no reports of adverse side effects.\n\n\n\nThe Mayo Clinic’s suggested dilution for a skin-treating sodium hypochlorite bath*: 1/2 cup of household sodium hypochlorite per 40 gallons of water in a bathtub (the same dilution recommended by Dr. Lancaster). I doubled the amount of water in my tub to 80 gallons of water and added the recommended amount of sodium hypochlorite (unscented; full-strength; not concentrated). This minimal, safe and effective dilution mentioned by the Mayo Clinic notes, “If properly diluted and used as directed, a bleach bath is safe for children and adults.” In an additional article about infantile atopic dermatitis, the Mayo Clinic, consistent with medical standards, recommends that one should consult with one’s pediatrician about “trying bleach baths to ease symptoms.”\n\n\n\nFurther reasoning in support of this treatment to alleviate indications from Dr. Lancaster: “We want to neutralize heavy metals because they slow up the electromagnetic frequency of our cells, which is our energy field, and we need a good flow of energy.” Having read Dr. Lancaster’s Harmonic Healing book and the chapter on heavy metals, and her article on the Elimination of Metals, I then found more articles stating water-and-dilute sodium hypochlorite baths are used in both the medical and the alternative medicine worlds. This one, from New York Times best-selling author Ann Louise Gittleman PhD, CNS in Bathe Away Toxins, states, “This (1/2 cup) amount of bleach in this volume of water will not harm your skin.” Hoping for some relief from my symptoms, I climbed into my bathtub with the understanding that it has been determined to be ethical to try unproven remedies (for that particular novel illness) during a pandemic outbreak–see the WHO 2014 Ethical Statement (about Ebola, but the argument applies to COVID too). https://www.who.int/mediacentre/news/statements/2014/ebola-ethical-review-summary/en/\n\nNoting that there have been no clinical trials on water-and-dilute sodium hypochlorite baths as a treatment for COVID-19, nor have there been more than a handful of completed clinical trials on any treatment for COVID-19 as of April, 2020, I asked Dr. Namavar—an integrative physician who completed her residency at the University of Virginia, is a board certified psychiatrist, and a fellow in the American Academy of Anti-Aging and Functional Medicine—to explain the reason why the biochemistry of the baths might be an effective symptom alleviator: “One of the main ways the body detoxifies itself is through the skin. In the body, there are a number of different important electrolytes, including sodium and chloride, that are necessary for healthy cellular functioning. Submerging the skin in water containing a small amount of these same minerals found in bleach, which act as electrolytes, may cause a beneficial shift in cellular osmolarity (the balance of the mineral levels inside and outside the cells). Having the right osmolarity is necessary for ideal cellular health, functioning and detoxification. Optimally functioning cells also help to decrease inflammation in the body. When the body is responding to an attack, such as from a virus, it stimulates a healthy level of inflammation in order to combat the virus. However, excess inflammation may lead to impaired functioning of healthy cells (as in the case with autoimmune disorders). During an infection of COVID-19, excess inflammation can inhibit the red blood cells from safely carrying oxygen to all the organs, potentially causing organ failure. Perhaps this mechanism of inflammation reduction and cellular optimization is the way by which baths containing various mineral contents, such as bleach baths, can help alleviate inflammatory symptoms and support healthy oxygen levels.”\n\n“We are all exposed to radiation (phone/Wi-Fi) and that agitates our cells,” says Lancaster, who also recommended a sea salt (1 pound) and baking soda (1 full box) bath to help with this, too. “We have never recommended the baths as any type of cure. We utilize this bath to aid the body in the detox process of chemicals and environmental pollutants.” I was the only member of my family to try this bath. In no way does Dr. Lancaster tout this is as a treatment for coronavirus–this is one of her institute’s methods for detoxing chemicals that suppress the immune system. The result: After her recommended 20 minutes, my skin was a little flushed (I did not submerge my shoulders, neck or head), and I felt relaxed and tired. I rinsed off with a cool shower. I experienced no negative side effects. I found it soothing for my skin. The oximeter (which tracks oxygen levels in the body) read 96 pre-bath and 98 post-bath; both are in the normal range. I’m not suggesting anyone follow this, but I wanted to be honest about my experience.\n\nEvery day, Chris and I both ate Ayurvedic food from Corey de Rosa at Tapovana to-go in Bridgehampton; his menu treats food as medicine. Aside from improving digestion, Tapovana’s Southeast Indian dishes are also nourishing and cleansing. They focus on having balanced proportions of essential healing micro (vitamins and minerals) and macro (proteins, carbs and fats) nutrients. I had also ordered some comfort Italian cuisine to go from Acquolina; that way, I could freeze some and have it on hand for the kids to simply heat up. I had ordered ingredients online for soups, and some helpful friends and family members dropped off some local, fresh items. While my appetite did not wane much and I’d like to tell you it was all delicious, I couldn’t taste it. I do know it was good for me.\n\nHere is an interesting video with an Ayurvedic doctor speaking of how she treated the virus, speaking with Dr. Junger, the author of CLEAN: Dr. Junger.\n\nHere’s what we ate for good food as medicine, in small portions and with lots of soups (note to self: must step up my cooking game in general after this week):\n\nBreakfast: Organic coffee with oat milk; the vascular shrinkage of the caffeine helped my raging sinus headache from the inflamed pressure. Liver-cleansing drink. Chris had English muffins with almond butter.\n\nLunch: Chickpeas and spinach, which is high in B vitamins; lemon rasam—a high immunity-building soup; and mango chutney for digestion.\n\nLunch: Cabbage, asparagus—a kidney cleanser—and chayote sambar (chayote is a tropical squash that hydrates the body and is high in vitamin C), with a lentil stew; mango with cardamom and cashews, a tissue-builder that’s also delicious.\n\nBreakfast: Organic coffee with oat milk. Liver-cleansing smoothie. Chris had scrambled eggs on seven-grain toast.\n\nLunch: Pongal, made of mung beans and rice, which strengthens and fortifies all bodily systems; and rose lassi, a yogurt-based drink packed with natural probiotics.\n\nBreakfast: Organic coffee with oat milk. Liver-cleansing smoothie. Chris had scrambled eggs with spinach and tarragon on seven-grain toast.\n\nLunch: Chai tea, a tissue-builder and digestive aid; mashed mung daal, green chile and cilantro, all of which help remove environmental impurities; butternut squash with toasted lentils and red pepper, a dish high in vitamins A and C.\n\nDinner: For Chris and the kids, steak with broccoli rabe, egg noodles; for me, zucchini-and-mint soup.\n\nBreakfast: Ginger lemon tea. Liver-cleansing drink. Chris had pancakes with the kids.\n\nDinner: Lasagna and chicken for the kids and Chris; butternut squash soup from Acquolina for me, and a little vegetable lasagna.\n\nDinner: Miso soup with added chopped asparagus. I ordered boxes of Edward & Son’s Organic Miso soup on Amazon.\n\nAfter nine days, I was feeling better and the virus seemed to be gone. I am keeping up with my routine of vitamins and good, cooked foods. In addition to the food providers above that we ordered from to get us through the week, a million special thanks to our friends and family: Dr. Frank Lipman, Roxine Brown; Donna McCue; Yvette Corporon; Stephen McKnight; Maria Cuomo Cole; Madeline Cuomo O’Donoghue and Tess O’Donoghue; Andrea Greeven Douzet; my parents; Dr. Lea Lis for sharing information on our live Instagram chat on how to quarantine your kids; Lumi Juices’ organic fresh juices and turmeric shots; the organic and vegan hot Bend Sauce to test whether taste buds were returning; Organic Krush; Eden and Declan Williams. We love you and appreciate your immense kindnesses. Note: none of these brands are paying me in any way to be included. I’m grateful.\n\nFor anyone currently suffering with COVID-19, please speak with your doctor about treatments for your symptoms—both more traditional types and types that you might not have considered before. Remember, until there is a vaccine or other proven treatment, we’re all in uncharted waters here, and most treatments are treating symptoms on a trial-and-error basis. Not all of the treatments I talk about here are for everyone, but we can all benefit from eating well and keeping our immunity up. “Returning hate for hate multiplies hate, adding deeper darkness to a night already devoid of stars. Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate, only love can do that,” said Martin Luther King Jr. And, as our trusted New York governor said, “Love wins.”\n\n*Additional articles referenced regarding clinical trials on safety of highly diluted water-and-bleach baths:", "opengraph": {"locale": "en_US", "type": "article", "title": "Cristina Cuomo Corona Protocol, Week 3 - The Purist", "description": "Just as my husband, Chris, began to finally kick this, I was stricken with the coronavirus. I spent a week in isolation battling COVID-19. Here’s what I learned—and my road to recovery.", "url": "https://thepuristonline.com/2020/04/cristina-cuomo-corona-protocol-week-3/", "site_name": "The Purist", "article:published_time": "2020-04-21T22:15:24+00:00", "article:modified_time": "2020-05-28T22:34:08+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/04/b9e57e56300f94359b7f430543eca3ae.jpeg", "image:width": "968", "image:height": "1000", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://www.researchsquare.com/article/rs-21211/v1", "https://www.prettyhealthynyc.com/", "https://www.prettyhealthynyc.com/", "https://www.nutraingredients.com/Article/2020/03/25/Hospital-turns-to-high-dose-vitamin-C-to-fight-coronavirus?utm_source=copyright&utm_medium=OnSite&utm_campaign=copyright", "https://www.cebm.net/covid-19/n-acetylcysteine-a-rapid-review-of-the-evidence-for-effectiveness-in-treating-covid-19/", "https://www.3ho.org/therapeutic-baths-elimination-radiation-chemicals-and-metals", "https://annlouise.com/2019/06/18/bathe-away-toxins/", "https://www.who.int/mediacentre/news/statements/2014/ebola-ethical-review-summary/en/", "http://www.tapovana.com/south-indian-lunches.html", "https://acquolinacatering.com/", "https://www.facebook.com/drjunger/videos/358575021765696/", "https://organickrush.com/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2957745/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5726436/", "https://www.mayoclinic.org/diseases-conditions/dermatitis-eczema/diagnosis-treatment/drc-20352386", "https://www.mayoclinic.org/diseases-conditions/cutaneous-t-cell-lymphoma/diagnosis-treatment/drc-20351057", "https://www.mayoclinic.org/diseases-conditions/atopic-dermatitis-eczema/expert-answers/baby-eczema/faq-20450999", "https://www.mayoclinic.org/diseases-conditions/atopic-dermatitis-eczema/expert-answers/eczema-bleach-bath/faq-20058413", "https://thepuristonline.com/2022/12/transformative-skin-care/", "https://thepuristonline.com/2022/05/star-power-earth-stars-ode-to-moms/", "https://thepuristonline.com/2022/11/health-first/", "https://thepuristonline.com/2022/08/the-super-tuskers/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-04-21T22:15:24+00:00"}