{"result_id": "304023", "URL": "https://thepuristonline.com/2019/12/is-msg-really-bad/", "timestamp": "2023-04-25 17:31:38 CEST+0200", "meta": {"description": "The oft-maligned food additive is now touted by some as harmless. But take a closer look - Is MSG really bad?", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2019/12/is-msg-really-bad/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Is MSG Really Bad?", "cleaned_text": "Impassioned foodies and celebrity chefs have lately been championing the return of MSG, the additive used to enhance the flavor of processed foods and some restaurant fare. Even fitness magazines and health websites are spearheading its resurrection from health pariah—a purported source of symptoms like headaches, irritability, mood and neurological problems, and even seizures—to benign (and even hipster) taste-enhancer, one whose reputation was undeservedly trashed. Claim sensitivity to MSG—a product manufactured by fermenting GMO corn or sugar beets that stimulates receptors in the mouth and tongue so that flavors seem heightened—and you’re dubbed hysterical. Deluded. Paranoid. MSG, its proponents claim, is as safe as Celtic sea salt.\n\nBut maybe not so fast. Look a little deeper into the wave of media stories—so uniform in messaging, a skeptic might wonder if a powerful lobbying force unleashed it—and you find reason to be cautious. Health practitioners who treat migraine sufferers and neurological patients as well as children with autism and behavioral issues say that the active ingredient in MSG is free glutamic acid, aka glutamate, an isolated amino acid that in nature, exists in a chain of other amino acids (the building blocks of protein). Glutamate acts as an excitatory neurotransmitter that “revs things up” in the brain and body, says Tim Culbert, MD, a developmental and behavioral pediatrician at PrairieCare, an affiliate of the University of Minnesota Medical School. MSG, Culbert continues, exists in “dynamic balance with the inhibitory neurotransmitter GABA,” so that excitation and inhibition are in balance. But when dumped into the bloodstream in its processed, isolated form as a food additive, that feedback loop is overwhelmed.\n\nContinuously consuming foods that contain MSG “can create an unbridled glutamatergic storm that can flood the inside of the cell with calcium ions, resulting in nasty cellular damage and even cell death,” says ancestral nutrition and ketogenic expert Nora Gedgaudas, who connects a glutamatergic overload with a host of neurological conditions (including autism, dementia, Alzheimer’s and Parkinson’s). This has earned MSG the status of excitotoxin, similar to aspartame. Tim Culbert points out that regular intake of MSG “may also contribute to metabolic and reproductive problems and promote inflammation”—the trifecta of modern-day health challenges.\n\nNaysayers mention the “MSG myth,” founded on decades-old, racist untruths about MSG-enriched Chinese restaurant food. But they overlook two inconvenient truths: First, that some people legitimately may be more sensitive to excess glutamate than others; secondly (and more critically), that processed foods (including meats, soups, salad dressings and many more categories) can, thanks to a labeling loophole, contain any of 50 ingredients that contain free glutamic acid, but are legally not labeled MSG. These include hydrolyzed vegetable protein, autolyzed yeast and yeast extract, carrageenan, soy extract, protein isolate, and even “natural flavors” and “seasoning.” Study the labels on an array of processed foods or (if you can find them!) fast food ingredient lists, and you’ll see these ingredients listed multiple times over, often in a single product. (Advocacy group Truth in Labeling reports that the ingredient is also hidden in personal-care products, supplements and medications; according to the CDC, MSG can be found in five of the most common vaccines, too, including the flu vaccine.)\n\nSeen through this light, could the reason that a home-cooked, whole-foods diet has such power to turn health and behavior disturbances be due to the removal of MSG-like additives? Maybe so. Especially for children, who Culbert says “may be more susceptible to the negative effects of MSG because their developing nervous system is easily damaged by toxic chemicals” and for whom “successful daily behavioral, cognitive and emotional functioning are closely tied to neurotransmitter balance.” If your family is navigating life with autism or behavioral regulation, or with migraines, or dementia—or frankly any chronic condition—at the very least get hip to where MSG and its cronies are hiding. Read labels like a sleuth; steer (way) clear of fast foods, and feed yourself and your kids fresh, whole foods you prep and cook yourselves. Then closely monitor what happens, and come to your own conclusions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Is MSG Really Bad? - The Purist", "description": "The oft-maligned food additive is now touted by some as harmless. But take a closer look - Is MSG really bad?", "url": "https://thepuristonline.com/2019/12/is-msg-really-bad/", "site_name": "The Purist", "article:published_time": "2019-12-13T21:29:20+00:00", "article:modified_time": "2019-12-19T00:40:36+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2019/12/iStock-1148195507-1024x678.jpg", "image:width": "800", "image:height": "530", "image:type": "image/jpeg"}, "tags": ["nutrition", "healthy living"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/05/oral-care/", "https://thepuristonline.com/2022/10/mind-body-nourishment/", "https://thepuristonline.com/2022/06/mediterranean-makeover/", "https://thepuristonline.com/2022/12/farmer-and-chef-local-flavor/"], "authors": ["James"], "publish_date": "2019-12-13T21:29:20+00:00"}