{"result_id": "304024", "URL": "https://thepuristonline.com/2021/12/spring-cafe-aspen-joins-the-new-york-city-foodscape/", "timestamp": "2023-04-25 17:31:40 CEST+0200", "meta": {"description": "Spring Cafe Aspen offers a variety of healthy foods and enlightens downtown dining from breakfast till dinner.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2021/12/spring-cafe-aspen-joins-the-new-york-city-foodscape/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Spring Cafe Aspen Joins the New York City Foodscape", "cleaned_text": "When it comes to clean eating in New York City, some of the early go-tos have vanished in recent years. Gone are the days of Souen Soho, where $10 could get you a macro plate and a seat next to Karlie Kloss. Lost to this generation of the young, eccentric and perhaps a tad kooky is Angelica Kitchen, the East Village eatery whose signature comfort dish, the Dragon Bowl, was served with a sighting of Anthony Kiedis. Perhaps these kids have all grown up with no place to dine. They are me, the 30–to 40-something moms and dads, the matured artists who traded in their guitars for a seat behind a desk at J.P.Morgan, but still craving their macrobiotic youth paired with a grown-up glass of Burgundy.\n\nWelcome Spring Cafe Aspen to the New York City foodscape, enlightening downtown dining from breakfast till dinner. “It was important to me that all elements of Spring Cafe Aspen support health and well-being, from the building materials and cookware used within the space to the water filtration system, which removes unwanted bacteria, heavy metals, fluoride and other chemical by-products,” says Sabrina Rudin, serial restaurant entrepreneur and mother. “I wanted the space to be more than just a café.” In fact, Rudin is a forerunner in the face-lift of health food, which rejects cardboard diet denial and 100% abstinence. Replacing consuming for health with eating for vibrancy, Rudin’s philosophy includes indulging here and there on a decadent dessert paired with a bottle of meticulously curated organic wine to complement a sumptuous meal.\n\n“I really believe the foundation of well-being begins with the food you eat, and I practice this with my family. Beyond an all-organic and mostly vegetarian diet, I rely on supplements to help boost immunity, reduce inflammation and fight off viruses,” she says. A few of Rudin’s supplement hacks include daily doses of liposomal vitamin C, glutathione, DHA, D3/K2, quercetin and curcumin. “I’m a big fan of V Clear EPs by Integrated Therapeutics. It’s a homeopathic supplement and a game changer at the first sign of a cold or virus.”\n\nThe new year is upon us. Let’s ring it in by boosting our immune systems with more than just the latest Moderna or Pfizer vaccine. Conscientious choices serve up goals we can keep, and a lifestyle that is both rewarding and sustainable. Although I can’t go back in time to my 20s, I can add a little spring to my step with my downtown destination dining list. Look for me at Spring Cafe Aspen, on the corner of West 4th and Mercer streets. Who knows, I may get a seat next to Torch’d star Isaac Calpito or Tracy Anderson.", "opengraph": {"locale": "en_US", "type": "article", "title": "Spring Cafe Aspen Joins the New York City Foodscape", "description": "Spring Cafe Aspen offers a variety of healthy foods and enlightens downtown dining from breakfast till dinner.", "url": "https://thepuristonline.com/2021/12/spring-cafe-aspen-joins-the-new-york-city-foodscape/", "site_name": "The Purist", "article:published_time": "2021-12-29T16:13:42+00:00", "article:modified_time": "2022-08-15T14:07:13+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2021/12/IMG_5432.jpeg", "image:width": "540", "image:height": "675", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/06/sex-and-the-beach/", "https://thepuristonline.com/2023/03/supporting-challenge-aspen-with-roberto-coin/", "https://thepuristonline.com/2022/06/the-state-of-aspens-short-term-stays/", "https://thepuristonline.com/2022/12/indulge-in-travel/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2021-12-29T16:13:42+00:00"}