{"result_id": "304032", "URL": "https://thepuristonline.com/2020/12/aspen-real-estate-pure-property/", "timestamp": "2023-04-25 17:31:54 CEST+0200", "meta": {"description": "Fabulous new homes to nestle in appeared on the real estate market, from New York and the Hamptons to Aspen and South Florida.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/12/aspen-real-estate-pure-property/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Aspen Real Estate And More: Pure Property", "cleaned_text": "Home for the holidays. The expression has never held so much meaning as this year, when residents everywhere are hunkering down, and nest-seekers are searching for the perfect abode. Here are some of our favorites across the country.\n\nIt overlooks scenic Hook Pond on Ocean Avenue in East Hampton, and Patricia Wadzinski of Sotheby’s International Realty brings to market this gorgeous, renovated traditional home, complete with entrance hall, large living room with fireplace, dining room, a kitchen that opens up to covered and en plein air terraces, and a media room/office that’s perfect for working from home. The second floor features a primary bedroom suite with private study, as well as a junior suite and two more bedrooms. Down the rolling hills and expansive lawn, filled with mature landscaping, sits a stunner of a gunite pool. The location here, between Main Beach and the Village, makes this home as geographically desirable as it is charming. Asking $5,995,000.\n\nAlso in East Hampton, with ocean views from every side, Corcoran’s Gary DePersia lists two single and separate properties at 26 and 32 Windmill Lane, adding up to a one-of-a-kind compound that is nothing short of breathtaking. Set on almost 7 lush acres with 300 feet of pure Atlantic beachfront, the gated entry opens up to a Zwirko & Ortmann-designed sprawling home featuring a vaulted great room as its beating heart. Anchored with a fireplace on one end and a dining room on the other, the home also has a large eat-in kitchen opening up to alfresco dining. Bedrooms come with terraces and fireplaces, and a glass enclosed office is well-suited for modern living. The exterior encompasses sweeping stone terraces and a 50-foot pool—and the private guesthouse blends in seamlessly with its own pool. A detached garage was creatively converted to a spacious gym. Beautiful as it is, there is plenty of room to remodel and expand—an owner could rebuild with a 12,500-square-foot oceanside residence and a 6,000-square-foot guesthouse. Endless possibilities for the asking price of $72,000,000.\n\nIn Palm Beach, a home known as Tarpon Cove is on the market, asking $35,500,000 and listed with Cristina Condon of Sotheby’s International Realty. A true Bermudan-style stunner with a jaw-dropping entryway, this address features a backyard that brings the water right up to the living space in a unique and compelling design. Situated on the Intracoastal Waterway with golf course views, the home won the 2017 Schuler Award from the Preservation Foundation for its new architecture, and the American Institute of Architects (AIA) award for excellence in design. This smart home features a fully equipped gym, spa bathrooms, a five-car garage, retractable glass walls and sweeping landscaping, as well as a full-house generator and a water purification system.\n\nIn Manhattan, Gwyneth Paltrow may have gathered early inspiration for her GOOP empire from the peace and tranquility of her former family home. Listed with Paula DelNunzio of Brown Harris Stevens, this exquisite town house is on the market, asking $15,500,000. With seven bedrooms, the Carnegie Hill residence was built in 1908 in the beaux arts style with a front area, a garden with an orange tree, a deck and a terrace. Inside, there are six wood-burning fireplaces on five floors, a grand foyer leading to an eat-in kitchen with views of the lush outdoor landscaping, a living room, a formal dining room and butler’s pantry, and a library, in addition to seven generous bedrooms and seven bathrooms. The 92nd Street property is 20 feet wide with exceptionally large windows and high ceilings that take advantage of the natural light streaming in from every direction.\n\nIn Aspen, Colorado, there is no more covetable location than The Mother Lode. With the name a nod to turn-of-the-century silver mining days, this rare, legacy property with over 9,000 square feet of residential space in the heart of Aspen’s downtown core is indeed a bit like hitting the mother lode of homes. It offers extraordinary protected views of the mountain slopes from 2,500 square feet of outdoor private decks and features top-of-the-line, luxurious natural wood and stone finishes. One private deck features a hot tub, fireplace and outdoor kitchen, making it the perfect perch from which to entertain in high style. The “Club” level features a spa, golf simulator, arcade games, sleek bar, pool table, private fitness studio and theater. With a two-car private garage, this property has no commercial space associated with the building and it never will. Carrie Wells of Coldwell Banker Mason Morse has this exclusive listing. Asking $37,500,000, it’s a complete sanctuary in the heart of it all.", "opengraph": {"locale": "en_US", "type": "article", "title": "Aspen Real Estate And More: Pure Property - The Purist", "description": "Fabulous new homes to nestle in appeared on the real estate market, from New York and the Hamptons to Aspen and South Florida.", "url": "https://thepuristonline.com/2020/12/aspen-real-estate-pure-property/", "site_name": "The Purist", "article:published_time": "2020-12-14T20:03:45+00:00", "article:modified_time": "2020-12-16T20:24:51+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2020/12/1-2632-Windmill_Aerial_-East-Hampton-NY-2-Photo-Credit-Dead-on-Design-for-Gary-DePersia-of-The-Corcoran-Group-100120-1-1024x682.jpg", "image:width": "1024", "image:height": "682", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/2022/08/pure-property-11/", "https://thepuristonline.com/2022/10/pure-property-14/", "https://thepuristonline.com/2022/05/pure-property-12/", "https://thepuristonline.com/2022/06/pure-property-13/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2020-12-14T20:03:45+00:00"}