{"result_id": "304012", "URL": "https://thepuristonline.com/2022/08/figures-transformed-at-southampton-arts-center/", "timestamp": "2023-04-25 17:31:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2022/08/figures-transformed-at-southampton-arts-center/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Figures Transformed at Southampton Arts Center", "cleaned_text": "(Southampton, New York… July 2022) Showcasing the works of three artists who use the figure as the central imagery in their work, Southampton Arts Center’s [SAC – southamptonartscenter.org] new exhibition, FIGURES TRANSFORMED, is a multimedia exhibition that will span the galleries and grounds. Curated by Christina Mossaides Strassfield, the exhibition includes the works of Deborah Buck, Hal Buckner, and Strong-Cuevas. Sponsored by Sylvia Hemingway and Lana Jokel, the exhibition opens on Saturday, July 30. Learn more at southamptonartscenter.org/figures-transformed.\n\n“This exhibition uses art to create a connection between SAC’s galleries and grounds,” shares SAC executive director Tom Dunn. “In addition to painting and sculpture indoors, we also have larger sculptures by two of the artists currently on the West Lawn. It’s an opportunity for the community to experience the show even when the galleries closed, as our grounds are always open. Furthering this connection is all of the artists’ interpretations of the human form, which plays a central role in their respective works.”\n\nDeborah Buck uses anthropomorphic and imaginary figures to create an other-worldly environment that beckons us to partake in a world beyond ours. Hal Buckner utilizes the female figure to empower, celebrate, and alter the art historical canon. Strong-Cuevas focuses on the figure’s head as a representation of the whole, exploring inner consciousness, outer space and communication through space and time.\n\n“It is truly an honor to have been asked to curate this exhibition for the Southampton Arts Center and to be able to work with three artists that I truly admire; Deborah Buck, Hall Buckner and StrongCuevas,” shares Strassfield, who also serves as director and chief curator of Guild Hall. “Ever since Paleolithic man chose to create their own likeness in their cave dwellings, the practice of depicting the human form has gone un-deterred for thousands of years. This inspiration to use the human form, whether it be painted or sculpted, and alter its appearance, challenges, enchants, and motivates artists to constantly create. All three of these artists have used the human form or versions of it in their own way and have created their unique approach and style. One views the works and is mesmerized by the creativity, innovations, and inner life that the works imbue.”\n\nComplementing the exhibition will be talks, tours, films, and workshops, including curator-led tours and discussions with the artists, and a special film program with Lana Jokel on Sunday, August 7 at 5 PM. This particular program will feature two of Jokel’s films – Hal Buckner – Art is How You See It and StrongCuevas Sculpture II – I Like to Be Awed. Both artists will be present for a discuss on the films, followed by a reception in SAC’s Caesar Garden.\n\nSAC’s galleries will be open Thursday through Monday from 12 to 5 PM. Gallery admission is $5 per person, or free for members and children 12 and under. Films are free for members. FOR IMMEDIATE RELEASE Contact: Rachel Bosworth rachel@rachelbosworth.com 631.220.1220 SAC continues to follow all New York State and CDC guidelines for all programs and events. Proof of vaccination or a negative COVID test is required for all indoor events. Select Southampton Arts Center programs are made possible by the New York State Council on the Arts with the support of Governor Kathy Hochul and the New York State Legislature. ECO Programs at SAC are made possible by Dorothy & Michael Reilly. FIGURES TRANSFORMED is presented by Sylvia Hemingway and Lana Jokel, with media partners Purist and WLIW. FILM @ SAC is sponsored by Brown Harris Stevens. Wellness @ SAC media partner is The Purist. Financial Literacy Partner: J.P. Morgan Private Bank. General operating support is provided by Bank of America. The SAC Summer Stage 2022 is sponsored by Primary Care and Reproductive Medicine at Weill Cornell Medicine and NewYork-Presbyterian.\n\nSouthampton Arts Center is committed to community building through the arts. We present and produce inspiring, inclusive, socially and regionally relevant programs across all disciplines – welcoming, connecting, and collaborating with the diverse members of New York’s East End community and beyond. SAC is a not for profit 501(c)(3) organization.\n\nFor more information about Southampton Arts Center, located at 25 Jobs Lane, Southampton, New York 11968, visit southamptonartscenter.org or call 631.283.0967. Follow SAC on Facebook and Instagram @southamptonartscenter. For press inquiries, contact Rachel Bosworth via email at rachel@rachelbosworth.com or by phone at 631-220-1220.", "opengraph": {"locale": "en_US", "type": "article", "title": "Figures Transformed at Southampton Arts Center - The Purist", "description": "--", "url": "https://thepuristonline.com/2022/08/figures-transformed-at-southampton-arts-center/", "site_name": "The Purist", "article:published_time": "2022-08-09T15:31:51+00:00", "article:modified_time": "2023-04-13T21:12:19+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2022/08/Artwork-by-Strong-Cuevas-1024x646.jpg", "image:width": "2560", "image:height": "1614", "image:type": "image/jpeg"}, "tags": ["2017 ARCHIVE", "2022 ARCHIVE", "2018 ARCHIVE", "2019 ARCHIVE", "2021 ARCHIVE", "2020 ARCHIVE"], "tweets": [], "movies": [], "links": ["https://thepuristonline.com/wp-content/uploads/2022/08/Artwork-by-Deborah-Buck-for-FIGURES-TRANSFORMED-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Artwork-by-Hal-Buckner-for-FIGURES-TRANSFORMED-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Artwork-by-Strong-Cuevas-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Blake-Dunn-Tom-Dunn-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Christina-Madden-Strong-Cuevas-Lana-Jokel-Leonard-Tourne-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Crowd-at-FIGURES-TRANSFORMED-Opening-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Deborah-Buck-Tom-Dunn-Strong-Cuevas-Christina-Mossaides-Strassfield-Hal-Buckner-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Dr.-Paula-Angelone-Deborah-Buck-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Elyn-Kronemeyer-Joe-Diamond.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Eric-Bregman-Paul-Travis-scaled.jpg", "https://thepuristonline.com/wp-content/uploads/2022/08/Gallery-Guests-at-FIGURES-TRANSFORMED-Opening-scaled.jpg", "http://southamptonartscenter.org/figures-transformed", "https://thepuristonline.com/2022/10/the-language-of-trees/", "https://thepuristonline.com/2022/06/southampton-arts-centers-second-annual-summer-cocktail-party/", "https://thepuristonline.com/2022/09/celebrate-fall-in-southampton/", "https://thepuristonline.com/2022/10/hamptons-happenings/"], "authors": ["Gabby Echevarrieta"], "publish_date": "2022-08-09T15:31:51+00:00"}