{"result_id": "304031", "URL": "https://thepuristonline.com/2020/04/hope-for-today-understanding-social-isolation/", "timestamp": "2023-04-25 17:31:53 CEST+0200", "meta": {"description": "Kelly Posner Gerstenhaber, PhD, director and founder of the Columbia Lighthouse Project, shares her thoughts about identifying and treating depression.", "lang": "en", "keywords": "", "favicon": "https://thepuristonline.com/wp-content/uploads/2020/04/cropped-favicon-32x32.png", "canonical": "https://thepuristonline.com/2020/04/hope-for-today-understanding-social-isolation/", "encoding": "UTF-8"}, "image": null, "domain": "thepuristonline.com", "title": "Understanding and Preventing Tragedies | The Columbia Lighthouse Project", "cleaned_text": "Connectedness is one of the strongest vaccines we have for mental health and thanks to modern technology, we can reach out, connect and be there for each other during uncertain times. It is more important than ever to pay attention to our own mental health, take care of ourselves and each other. The more we reach out, we learn that depression is treatable, suicide is preventable and that we can all be part of the solution to save lives. We have tools that help us connect with friends, neighbors, and coworkers to check in on their mental wellbeing. One of these tools is the Columbia Protocol that gives us the words to ask one another about a difficult topic –suicide risk. Asking brings us together at a crucial time. At one point in history, learning how to properly wash our hands began saving lives. At this point in history, we have tools to take care of each other’s well-being and save lives.\n\nSocial distancing does not have to mean social isolation. The CDC tells us that feeling connected is one of the most important things we can do for our mental health. In fact, a study showed that loneliness is equivalent to smoking 15 cigarettes a day and can be more lethal than obesity.\n\nThe single largest contributor to global disability in the world is not cancer, AIDS or heart disease. It’s depression. Success, financial stability and resources do not grant immunity. And depression, this medical illness, is the main cause of suicide. Suicide is the word that stops us in our tracks, filled with incomprehensible suffering, fear, anger, shame and anguish—a tragic paradox that takes more lives than car accidents, more U.S. soldiers than combat, more firefighters than fire, more police officers than crime. It is the No. 1 cause of death in older adolescent girls across the globe and the second leading cause of death in young people in the US, according to the Centers for Disease Control and Prevention; nearly 10 percent of high schoolers say they’ve tried to take their own life in the past year.\n\nSuicide and depression do not discriminate: celebrity or high school student, black or white, rich or poor. When a person dies by suicide, 135 people are significantly affected and these effects linger across generations because of the silence that often follows. With the current onslaught of deaths due to the global Corona Virus pandemic, the effects on our nation are magnified and we are all left reeling, trying to understand why. What we suicide-prevention experts know is that suicide is our most preventable cause of death. This is the good news, but we have lots of work to do as a society. There are many deeply entrenched barriers that have been built up over generations; our very first imperative is tearing down the walls of stigma and misunderstanding.\n\nOne of the most insidious problems is that we don’t think of depression as a treatable medical illness like we think of diabetes or cancer. You never hear the word “choice” when it comes to cancer. This common misperception—that suicide is somehow a choice, a rational choice with “13 Reasons Why” that make it understandable (or that it has no reasons at all)—is pervasive and deadly.\n\n“Depression? That’s not a real illness.” “I can snap out of it.” “Real men don’t get depressed.” “Someone will think I am weak if I ask for help.” “There’s no hope for me.”\n\nSince modern antidepressants, the suicide rate has dropped dramatically across the world and across age groups. Yet 50 to 75 percent of those in need do not receive the treatment they need. Why? A societal misperception that doesn’t view depression like any other illness, but as something shameful, prevents people from seeking help and even from letting others know they are suffering. Autopsies invariably show us that suicide is connected to a lack of treatment—not treating depression is what kills. Someone with asthma wouldn’t think twice about using an inhaler; a diabetic would take insulin.\n\nIn the past 50 years, we have managed to drastically reduce mortality from some of the most pernicious diseases, like leukemia and AIDs. Not suicide. But we can begin to reverse this devastation. And it is not complicated. Imagine if we were all as concerned with mental health as we are about physical health: pediatricians, school nurses, ob/gyns would all be asking about emotional well-being alongside physical checkups and integrating mental health alongside physical education in schools. What would change? For one, we would have a higher chance of preventing the scariest and most tragic forms of violence—suicide and homicide. This is not hyperbole: 50 percent of people who die by suicide see their primary care doctor during the month before they die, so medical professionals need to ask about people’s mental health, just like we monitor for blood pressure, or we will not find the people who are suffering in silence.\n\nWe actually know that people in pain don’t often have the will to ask for help and too often they will not. Asking about emotional well-being should be as routine as vision checkups. But even that is not enough. We must go beyond the “medical model.” Everyone must be, and can be, part of the solution. Friend, coach, teacher, spouse: All can play a vital role in connecting people to the help they need, before they ever get to (if they ever get to) a health professional. We need to find them where they are and where they live, and loved ones should be empowered and not be left feeling powerless. We have seen the incredible results of empowering the whole community. In the hands of everyone from legal assistants to clergy, the Columbia Protocol—a series of questions designed to act as a prevention tool—helped the Marines reduce suicide by 22 percent and the state of Utah reverse their suicide rate for the first time in a decade. Another misperception about suicide is that asking a person about suicide will make them suicidal. This is a myth born out of shame, fear and misunderstanding—it actually is liberating for those who are suffering to talk about their pain. People want to be asked and need to be asked. The Columbia Protocol, one of our most effective prevention methods, offers a few simple questions that can be used by everyone at home, over the phone with loved ones.\n\nKevin Hines jumped off the Golden Gate Bridge—among the only 1 percent who have survived. He wanted to be saved; he says if just one person had asked him if he was OK, he wouldn’t have done it. He needed someone to save him—and we need a culture where no one is afraid to ask. As he jumped, he realized that all of the problems in his life were fixable except for the fact that he just jumped. The man who goes up to the gun counter does not want to die but does not know there’s help.\n\nIn addition to the importance with checking in with loved ones, “means” is also of particular importance. For example, if you or a loved one have firearms or prescription medication at home and you know they might be vulnerable, make sure those are safely stored or taken out of the home temporarily.\n\nSimply asking carries an enormous positive power. When we ask a student, an elder, a partner, it signals that someone cares about them; that no matter how scary their thoughts, they are not alone. Asking brings us together, normalizes the conversation about emotionally difficult, stigmatized topics and lessens suffering. Asking promotes connectedness—a powerful shield against suicide and other problems. This common language makes this connectedness unstoppable. And the power of social networks is on our side to propagate a method with a message that fights loneliness and hopelessness, and builds understanding and resilience across generations.\n\nAt one point in history, learning how to properly wash our hands began saving lives. Look what it’s doing today. Simple tools like The Columbia Protocol that bring us together are more important than ever. Learning to just ask can help us save lives now. Generations of stigma and misunderstanding have taken far too many lives—this is the history we can stop from repeating. Due to depression escalating at home from isolation for people at risk, there has been a dramatic increase in calls to crisis lines. Quarantine doesn’t have to mean isolation. Now more than ever, we really need to be there for each other. Connectedness is the preventative measure right now and that means more FaceTime, Skype, Zoom, and phone calls. The more we reach out, understand that depression is treatable, suicide is preventable and that we can all be part of the solution, the more lives we will save.\n\nDr. Kelly Posner Gerstenhaber, PhD is a recipient of the Secretary of Defense medal for Exceptional Public Service.\n• Crisis Text Line: text CONNECT to 741741 in the US. For crisis support in Spanish, call 1-888-628-9454.", "opengraph": {"locale": "en_US", "type": "article", "title": "Understanding and Preventing Tragedies | The Columbia Lighthouse Project", "description": "Kelly Posner Gerstenhaber, PhD, director and founder of the Columbia Lighthouse Project, shares her thoughts about identifying and treating depression.", "url": "https://thepuristonline.com/2020/04/hope-for-today-understanding-social-isolation/", "site_name": "The Purist", "article:published_time": "2020-04-13T14:07:34+00:00", "article:modified_time": "2020-04-21T17:22:08+00:00", "image": "https://thepuristonline.com/wp-content/uploads/2018/07/MorganMaassen_LosAngeles-83_F-1024x681.jpg", "image:width": "1024", "image:height": "681", "image:type": "image/jpeg"}, "tags": ["depression", "suicide"], "tweets": [], "movies": [], "links": ["https://urldefense.proofpoint.com/v2/url?u=http-3A__cssrs.columbia.edu_the-2Dcolumbia-2Dscale-2Dc-2Dssrs_cssrs-2Dfor-2Dfamilies-2Dfriends-2Dand-2Dneighbors_&d=DwMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=8YmC-j6_r8MhcAl4siwpVzCylHk10CVAQwP7tS_Eo1E&m=gExWO0wXOSrZIYBUNRlIwgEbxN8OwSSchDP9N8aS2Ks&s=N3AAxvLcgBBUcJHVn9mlZpUK3AN_sAZW3wuCnmhJ1Ek&e=", "http://cssrs.columbia.edu/the-columbia-scale-c-ssrs/cssrs-for-families-friends-and-neighbors/", "https://thepuristonline.com/2022/08/how-to-acknowledge-mental-health-concerns-following-roe-v-wade/", "https://thepuristonline.com/2022/10/conversation-for-a-cause-hope-for-depression-research-foundation/", "https://thepuristonline.com/2022/10/mind-body-nourishment/", "https://thepuristonline.com/2022/06/race-for-mental-wellness/"], "authors": ["Charlotte"], "publish_date": "2020-04-13T14:07:34+00:00"}