{"result_id": "305007", "URL": "https://therundownlive.com/us-citizens-were-given-secret-covid-decree-violation-scores/", "timestamp": "2023-04-25 17:32:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/us-citizens-were-given-secret-covid-decree-violation-scores/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "US Citizens Were Given Secret COVID “Decree Violation” Scores", "cleaned_text": "These Covid-19 decree violation scores were calculated by analyzing nearly two billion global positioning system (GPS) pings to get “real-time, ultra-granular locations patterns.” People who were “on the go more often than their neighbors” were given a high Covid-19 decree violation score while those who mostly or always stayed at home were given a low Covid-19 decree violation score.\n\nNot only did PredictWise use this highly sensitive location data to monitor millions of Americans’ compliance with Covid lockdown decrees but it also combined this data with follow-up surveys to assign “Covid concern” scores to the people who were being surveilled. PredictWise then used this data to help Democrats in several swing states to target more than 350,000 “Covid concerned” Republicans with Covid-related campaign ads.\n\nIn its white paper, PredictWise claims that Democrats were able to “deploy this real-time location model to open up just over 40,000 persuasion targets that normally would have fallen off” for Mark Kelly who was running for Senate at the time and has now been elected.\n\n“PredictWise understood that there were potential pockets of voters to target with Covid-19 messaging and turned high-dimensional data covering over 100 million Americans into measures of adherence to Covid-19 restrictions during deep lockdown,” the company states in the white paper.\n\nPredictWise doesn’t provide the exact dates when this location data was collected but its white paper does note that the data was collected during Covid lockdowns and used during Senator Kelly’s 2020 election campaign. State-level US lockdowns began on March 15, 2020 and Kelly was elected on November 4, 2020 so the data appears to have been collected during the first few months of this 11 month period.\n\nLocation data and survey data are just two of the many types of data PredictWise claims to have access to. According to its white paper, PredictWise also tracks “telemetry data” (which is “passively sourced cell-phone data”), media consumption data, and unregistered voter data (which contains verified data on over 50 million unregistered voters that’s updated daily and sourced from credit files and portal registration data). Additionally, PredictWise claims that “Crate&Barrel” (which seems to be a reference to the online furniture and home decor shopping portal Crate & Barrel) is one of the portal registration data sources it has access to.\n\nIn total, PredictWise says its data “tracks the opinions, attitudes, and behaviors” of over 260 million Americans – a figure that represents 78% of the entire US population of 333 million.\n\nPredictWise uses the data it collects to create scores on 13 issue preference clusters and 7 value-frame, or psychometric clusters. These clusters use more than 30 million behavioral data points. PredictWise also claims to be able to use this data to predict the party of unregistered voters.\n\nThis mass surveillance of location data and lockdown compliance is just one of the many examples of the large-scale data harvesting that occurred during the pandemic. Private companies tracked the everyday activities of citizens, pushed remote learning surveillance technologies, increased surveillance in the workplace, and more. Meanwhile, governments ushered in numerous forms of surveillance such as forcing citizens to wear ankle bracelet trackers, secretly surveilling vaccine recipients via their phones, and combining vaccine passports with digital IDs.", "opengraph": {"type": "article", "title": "US Citizens Were Given Secret COVID “Decree Violation” Scores", "url": "https://TheRundownLive.com/us-citizens-were-given-secret-covid-decree-violation-scores/", "description": "Via Reclaim The Net Mass surveillance during the first months of the US lockdowns.   Voter analytics firm PredictWise harvested location data from tens of millions of US cellphones during the …", "article:published_time": "2022-10-26T20:15:05+00:00", "article:modified_time": "2022-10-26T20:15:05+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2022/10/c19-2.webp?fit=1200%2C800&ssl=1", "image:width": "1200", "image:height": "800", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/us-analytics-firm-covid-19-decree-violation-scores/", "https://www.predictwise.com/whitepaper", "https://www.census.gov/popclock/", "https://www.space.com/astronaut-mark-kelly-senate-win", "https://TheRundownLive.com/former-dogwalker-for-ghislaine-maxwell-speaks-out/", "https://www.worldometers.info/world-population/us-population/", "https://reclaimthenet.org/covid-surveillance-tech-remains-open-to-exploitation/", "https://reclaimthenet.org/hong-kong-ankle-bracelet-trackers-covid/", "https://reclaimthenet.org/uk-vaccine-recipients-were-secretly-surveilled/", "https://reclaimthenet.org/taiwan-combines-vaccine-passport-with-digital-id-number/"], "authors": [], "publish_date": "2022-10-26T20:15:05+00:00"}