{"result_id": "305001", "URL": "https://therundownlive.com/international-group-of-attorneys-proceed-with-covid-19-crimes-against-humanity-grand-jury/", "timestamp": "2023-04-25 17:31:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/international-group-of-attorneys-proceed-with-covid-19-crimes-against-humanity-grand-jury/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "International Group Of Attorneys Proceed With Covid-19 Crimes Against Humanity Grand Jury", "cleaned_text": "\n• A group of attorneys from around the world have convened a model grand jury in Germany in order to provide testimony from various expert witnesses attesting to the crimes against humanity committed amidst government responses to covid-19.\n• The various witnesses, consisting of professors, doctors, journalists, military, and government officials will testify regarding a number of topics including Project Dark Winter, psychological operations, economics, eugenics, and more.\n\nA collective of lawyers and attorneys, and one judge, from around the globe representing an independent organization known as the Peoples’ Court of Public Opinion on behalf of the German based Corona Investigative Committee, have come together to begin criminal investigation proceedings to present what they allege to be evidence of crimes against humanity committed by policy makers in response of the covid-19 pandemic.\n\nThe Grand Jury is a model proceeding, meaning that at the present moment it holds no legitimate legal standing. However, the aim of this undertaking is to provide to a grand jury, in this case the general public, throughout the proceedings, legal statements and evidentiary materials — including testimony, affirming that willful criminal activity took place on behalf of the accused. In hopes that the exposure of this evidence may provoke actual criminal charges and indictments in the future.\n\nThe committee consists of Attorney at Law Virginie de Araujo Recchia, (France); Judge Rui Fonseca E Castro, (Portugal); Attorney at Law Claire Deeks, (New Zealand); Attorney at Law Viviane Fischer, (Germany);.Attorney at Law Dr. Reiner Fuellmich, (Germany); Attorney at Law N. Ana Garner, (USA); Attorney at Law Dr. Renate Holzeisen, (Italy); Attorney at Law Tony Nikolic, (Australia); Attorney at Law Dipali Ojha, (India); Attorney at Law Dexter L-J. Ryneveldt (Adv.), (South Africa); Attorney at Law Deana Sacks, (USA); and Attorney at Law Michael Swinwood, (Canada).\n\nWithin a six page press release, they assert the charges against world leaders and policy makers, stating —\n\nOn Saturday, February 5th, the committee convened to issue opening statements beginning with Dr. Reiner Fuellmich.\n\nDuring the course of the proceedings Dr. Fuellmich asserted the following —\n\n“But when you put together all those pieces of the puzzle as we will do for you with the help of renowned experts, you will see four sets of facts:\n\nOne, there is no corona pandemic, but only a PCR test ‘plandemic’ fueled by an elaborate psychological operation designed to create a constant state of panic among the world’s population,” explained Fuellmich. “This agenda has been long-planned.”\n\n“Its ultimately unsuccessful precursor was the swine flu some 12 years ago, and it was cooked up by a group of super rich psychopathic and sociopathic people who hate and fear people at the same time, have no empathy, and are driven by the desire to gain full control over all of us, the people of the world,” he continued, adding that they’re using “governments and the mainstream media” to spread “panic propaganda 24/7.”\n\nFuellmich went on to mention the coordinated deliberate suppression of effective covid-19 treatments such as vitamin C, vitamin D, zinc, Ivermectin, and hydroxychloroquine. Done so by an establishment determined to prioritize “ineffective and lethal experimental injections”.\n\nThen going on to acknowledge what we here at The Rundown Live have referred to ad nauseam — The capture of governmental institutions the world over by globalist bodies such as the World Economic Forum.\n\n“Our governments are not our governments anymore, rather they have been taken over by the other side through their main platform, the World Economic Forum, which had started to create their own global leaders through their ‘Young Global Leaders’ program as early as 1992,” Fuellmich said, adduncing figures such as former German Chancellor Angela Merkel and Bill Gates as being among its first graduates.\n\nLater mentioning the tie-in of the eugenics agenda;\n\n“This involves population control which, in their view, requires both a massive reduction of the population and manipulating the DNA of the remaining population with the help – for example – of mRNA experimental injections,”\n\nAnd the replacement of national sovereignty with a more centralized globalist power structure;\n\n“But it also requires the deliberate destruction of democracy, of the rule of law, and of our constitutions through chaos so that ultimately, we will agree to losing our national and cultural identities and instead will accept a One World Government under the UN – which is now under the full control of them and their World Economic Forum – a digital passport through which each and every move is monitored and controlled, and one digital currency which we will only be able to receive from one World bank — theirs, of course,”\n\nFinally concluding with the recommendation of indictment of six key figures:\n\nContinuing, Fuellmich elaborates upon the panel of experts, to be presented in the coming weeks. Including former military insider James Bush, investigative journalist Whitney Webb, former employees of the World Health Organization, British intelligence officials, and others to explain the historical and geopolitical significance of the ongoing crisis. Beginning with Operation Dark Winter, and continuing into the Rockefeller Lockstep Scenario, and Event201 into the current day.\n\nFurther adding to the testimony, the next group of witnesses will consist of an assortment of lung experts, professors, a pharmaceutical executive, and biologists; who Fuellmich stated in part will –\n\n“explain to us what is behind the legend of the Wuhan wet market outbreak. They will show that the virus is no more dangerous than the common flu. The PCR test cannot tell us anything about infections, but is the only basis for all anti-Corona measures, including the ultimate measure, the so-called vaccines and the so-called vaccines are not only ineffective, but extremely dangerous.”\n\nThe next group of experts comprised of doctors from around the world including Switzerland, Texas, South Africa, England, and Germany. All who will attest to the misguided policies of government bodies intentionally suppressing effective treatments capable of mitigating the spread and severity of the virus.\n\nContinuing on, they will then call the next group of experts including Dr. Mike Eaton, professor Sucharit Bhakdi, and Dr. Robert Malone, among others from France and Germany.\n\n“They will show us, that while the virus did not cause any excess mortality, it has a survival rate of 99.97%, the shots are now killing people and have been causing excess mortality of up to 40% since September, as a result of a poisoning with a spike protein and of shutting off our immune system.”\n\nThe committee will further proceed by calling numerous experts from the US, France, Belgium, and Germany; including renowned psychology professor Dr. Mattias Desmet.\n\nWho will elucidate the facts upon how various authoritarian measures were introduced into society, and maintained through induced apathy via a massive psychological fear campaign.\n\nFinally concluding with the last two groups of experts, various professors and economists from the United States and Germany to elaborate as to the controlled implosion of the world’s economy through the imposition of economically destructive measures. Moving towards a technocratic end goal of digital currency and global digital passport programs.\n\nLastly, the committee will hear an assortment of testimonies including those from an investigative journalist, a Holocaust survivor, and a technocracy expert among them. Specifically detailing the role of eugenics and depopulation.\n\nThough this committee has been nearly two years in the making, its opening statements are timely. Coming only days after the release of a bombshell report from John Hopkins University, coincidentally echoing much of the same sentiment, concluding once and for all that lockdowns were ineffective at preventing the spread of the virus. Adding to the continually mounting evidence asserting the same now causing a shift in public dialogue.\n\nAs reported previously, primary among any other coronavirus policy, lockdowns have arguably had the most devastating impact on civilization. Not only in facilitating the largest wealth transfer in history to the rich and powerful, coinciding with an unprecedented economic catastrophe pushing an excess of 130 million plus humans into poverty.\n\nBut also having disastrous consequences on public health. Causing massive spikes in several mental health disorders, self harm, suicide, drug addiction and overdose, child abuse, domestic assault, starvation, and a slew of preventable deaths from untreated illnesses. Ultimately killing more people than they saved.\n\n“After you have heard all the evidence, we have no doubt that you will recommend indictments against all our putative defendants for crimes against humanity. Thank you.”\n\nThe entire day one proceedings of the Grand Jury can be viewed in full below.", "opengraph": {"type": "article", "title": "International Group Of Attorneys Proceed With Covid-19 Crimes Against Humanity Grand Jury", "url": "https://TheRundownLive.com/international-group-of-attorneys-proceed-with-covid-19-crimes-against-humanity-grand-jury/", "description": "• A group of attorneys from around the world have convened a model grand jury in Germany in order to provide testimony from various expert witnesses attesting to the crimes against humanity committ…", "article:published_time": "2022-02-08T10:26:58+00:00", "article:modified_time": "2022-02-08T16:13:33+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2022/02/IMG_20220207_234723.png?fit=1000%2C446&ssl=1", "image:width": "1000", "image:height": "446", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe style=\"display: block; margin: 0px auto;\" id=\"_ytid_78320\" width=\"1200\" height=\"675\" data-origwidth=\"1200\" data-origheight=\"675\" src=\"https://www.youtube.com/embed/RJPoggzWdnI?enablejsapi=1&amp;autoplay=0&amp;cc_load_policy=0&amp;cc_lang_pref=&amp;iv_load_policy=1&amp;loop=0&amp;modestbranding=0&amp;rel=1&amp;fs=1&amp;playsinline=0&amp;autohide=2&amp;theme=dark&amp;color=red&amp;controls=1&amp;\" class=\"__youtube_prefs__  no-lazyload\" title=\"YouTube player\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"/>", "src": "https://www.youtube.com/embed/RJPoggzWdnI?enablejsapi=1&autoplay=0&cc_load_policy=0&cc_lang_pref=&iv_load_policy=1&loop=0&modestbranding=0&rel=1&fs=1&playsinline=0&autohide=2&theme=dark&color=red&controls=1&"}], "links": ["http://Twitter.com/donviajr", "http://Therundownlive.com", "https://grand-jury.net/", "https://corona-ausschuss.de/en/", "https://grand-jury.net/Media%20Release%20Grand%20Jury%20Proceeding%2002-05-2022.pdf", "https://therundownlive.com/klaus-schwab-admits-to-criminal-conspiracy-plan-of-world-domination/", "https://unlimitedhangout.com/2020/04/investigative-series/all-roads-lead-to-dark-winter/", "https://www.activistpost.com/2020/03/rockefeller-blueprint-for-police-state-triggered-by-pandemic-exposed.html", "https://theconsciousresistance.com/the-pcr-deception-continues-to-crumble-2/", "https://TheRundownLive.com/as-durham-closes-in-fbis-trump-russia-origin-story-is-harder-to-believe/", "https://www.corbettreport.com/bioethics/", "https://thefreethoughtproject.com/study-finds-lockdowns-had-little-to-no-effect-on-covid-deaths-but-had-enormous-social-economic-costs/", "https://brownstone.org/articles/more-than-400-studies-on-the-failure-of-compulsory-covid-interventions/", "https://thefreethoughtproject.com/new-report-highlights-how-covid-lockdowns-helped-the-rich-get-richer-and-decimated-the-poor/", "https://thefreethoughtproject.com/new-research-shows-coronavirus-lockdowns-cost-more-lives-than-they-saved/"], "authors": [], "publish_date": "2022-02-08T10:26:58+00:00"}