{"result_id": "305019", "URL": "https://therundownlive.com/feds-using-antiterrorism-ai-to-spy-on-vaccine-critics-election-sceptics/", "timestamp": "2023-04-25 17:32:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/feds-using-antiterrorism-ai-to-spy-on-vaccine-critics-election-sceptics/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "Feds Using Antiterrorism AI To Spy On Vaccine Critics, Election Sceptics", "cleaned_text": "Despite criticisms of the experimental injection proven right time and again that hasn’t stopped the state from using its vilification of critics to justify even more illegal mass surveillance.\n\nThe US federal government is adopting military-grade AI that was used to crack down on ISIS to censor dissent by US citizens on issues like election fraud and vaccine hesitancy, according to the executive director of the Foundation for Freedom Online, Mike Benz.\n\nPrivate firms and universities have received millions of dollars in grants from the National Science Foundation (NSF), a federal agency, to develop tools similar to those developed by the Defense Advanced Research Projects Agency’s Social Media in Strategic Communications (SMISC) program in 2011.\n\nSMISC’s tools were used “to help identify misinformation or deception campaigns and counter them with truthful information,” in the Middle East. In a report, Mike Benz detailed how the NSF and other organizations are using this technology to censor the speech of Americans.\n\n“One of the most disturbing aspects of the Convergence Accelerator Track F domestic censorship projects is how similar they are to military-grade social media network censorship and monitoring tools developed by the Pentagon for the counterinsurgency and counterterrorism contexts abroad,” reads the report.\n\nSpeaking to Just the News, he said: “DARPA’s been funding an AI network using the science of social media mapping dating back to at least 2011-2012, during the Arab Spring abroad and during the Occupy Wall Street movement here at home. They then bolstered it during the time of ISIS to identify homegrown ISIS threats in 2014-2015.”\n\nAccording to Benz, the NSF has adopted DARPA’s technology to target two groups of Americans: those skeptical of recent election results and those who claim COVID-19 vaccines could be harmful.\n\n“The terrifying thing is, as all of this played out, it was redirected inward during 2016 — domestic populism was treated as a foreign national security threat,” Benz said.\n\n“What you’ve seen is a grafting on of these concepts of mis- and disinformation that were escalated to such high-intensity levels in the news over the past several years being converted into a tangible, formal government program to fund and accelerate the science of censorship,” he said.\n\n“You had this project at the National Science Foundation called the Convergence Accelerator,” Benz recounted, “which was created by the Trump administration to tackle grand challenges like quantum technology. When the Biden administration came to power, they basically took this infrastructure for multidisciplinary science work to converge on a common science problem and took the problem of what people say on social media as being on the level of, say, quantum technology.\n\n“And so they created a new track called the track F program … and it’s for ‘trust and authenticity’; but what that means is, and what it’s a code word for is, if trust in the government or trust in the media cannot be earned, it must be installed. And so they are funding artificial intelligence, censorship capacities, to censor people who distrust government or media.”\n\nBenz noted how mainstream media and fact-checkers have become arbiters of truth, determining what is acceptable and unacceptable to post online, and how the pandemic has normalized “censorship in the name of public health.”\n\n“What happened now is the government says, ‘Okay, we’ve established this normative foothold in it being okay to [censor political speech], now we’re going to supercharge you guys with all sorts of DARPA military grade censorship, weaponry, so that you can now take what you’ve achieved in the censorship space and scale it to the level of a U.S. counterinsurgency operation,’” Benz explained.", "opengraph": {"type": "article", "title": "Feds Using Antiterrorism AI To Spy On Vaccine Critics, Election Sceptics", "url": "https://TheRundownLive.com/feds-using-antiterrorism-ai-to-spy-on-vaccine-critics-election-sceptics/", "description": "Despite criticisms of the experimental injection proven right time and again that hasn’t stopped the state from using its vilification of critics to justify even more illegal mass surveillanc…", "article:published_time": "2023-02-08T20:06:59+00:00", "article:modified_time": "2023-02-08T20:06:59+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-08_15-04-54.jpg?fit=1200%2C798&ssl=1", "image:width": "1200", "image:height": "798", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/feds-using-it-against-its-own-citizens", "https://justthenews.com/politics-policy/ai-algorithm-used-track-terrorists-now-being-turned-us-citizens-fight", "https://archive.ph/mGSJv", "https://TheRundownLive.com/study-finds-people-with-higher-cognitive-ability-care-more-about-free-speech-than-political-correctness/", "https://reclaimthenet.org/topics/ai"], "authors": [], "publish_date": "2023-02-08T20:06:59+00:00"}