{"result_id": "305025", "URL": "https://therundownlive.com/associated-press-issues-correction-after-publishing-false-report-that-couldve-started-ww3/", "timestamp": "2023-04-25 17:32:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/associated-press-issues-correction-after-publishing-false-report-that-couldve-started-ww3/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "Associated Press Issues Correction After Publishing False Report That Could’ve Started WW3", "cleaned_text": "The Associated Press recently published a fake that could have set off a chain of events leading to world war three. Now after the propaganda was exposed, the MSM is backpedaling to save face.\n\n: The Associated Press has issued an official correction for its not-so-inconsequential bit of reporting Tuesday that could have easily set off a chain of events leading to a WWIII scenario. “The Associated Press reported erroneously, based on information from a senior American intelligence official who spoke on condition of anonymity” …and we the know rest which unleashed a day of incessant warmongering based on the allegation that Russia attacked a NATO member. The incredibly embarrassing correction further states, “Subsequent reporting showed that the missiles were Russian-made and most likely fired by Ukraine in defense against a Russian attack.” And the next time this happens will it be too late for a “correction”? : A fresh White House statement has backed the Poland and NATO assessment that the Tuesday Polish border explosion was “most likely the result of a Ukrainian air defense missile that unfortunately landed in Poland.” The statement by National Security Council Spokesperson Adrienne Watson additionally said the US has “full confidence” in the Polish government’s ongoing investigation. “We have seen nothing that contradicts President Duda’s preliminary assessment that this explosion was most likely the result of a Ukrainian air defense missile that unfortunately landed in Poland,” she said. But like NATO chief Jens Stoltenberg’s prior remarks, she still blamed Russia for the episode: “That said, whatever the final conclusions may be, it is clear that the party ultimately responsible for this tragic incident is Russia, which launched a barrage of missiles on Ukraine specifically intended to target civilian infrastructure. Ukraine had — and has — every right to defend itself.” Meanwhile, former Texas Congressman Ron Paul asks the question, did we almost get lied into WWIII? Did Ukraine Try To Lie Us Into WWIII? – today on the Liberty Report:https://t.co/DuDCDIlCbg\n\nAll of these belated admissions that no, it was not a Russian attack, conveniently come well after the US president had seized the ‘fog of war’ moment yesterday to unveil another massive $37 billion emergency aid package for Ukraine almost simultaneous to the border incident.\n\nSo $37.6 billion more from the US taxpayer and counting… at a moment that some apparently have motive to drag Washington and the American people into another major war based on deception.\n\nA mere less than 24 hours ago, before the dust had settled from the explosion and before investigators could come to any definitive conclusions after the deadly incident on the Polish border village of Przewodów, the Western public was already being harangued and forewarned to stay away from ‘conspiracy theories’ as the early mainstream headlines – pushed especially based on an anonymous US official in an Associated Press report – were fast out the gate with “Russian missiles hit Poland, killing two”.\n\n“Article 5” – the NATO collective defense treaty which many had long worried would be the first invoked act leading to WWIII, began trending on Twitter, as Western officials issued confident statements of ‘solidarity’. Almost immediately and without evidence, Ukraine’s President Volodymyr Zelensky demanded “action” from the West over the supposed brazen aggression against a NATO member. “Hitting NATO territory with missiles… This is a Russian missile attack on collective security! This is a really significant escalation. Action is needed,” Zelensky said his Tuesday night video address.\n\nAnd then as missile crash site images widely circulated on the internet, leading even Western sources to express doubt that the projectile was launched by Russia, enter no less than the foreign minister of Ukraine, who attempted to preempt what he slammed as a developing Russia-promoted “conspiracy theory”. Like with many other aspects to this war, some of the most obvious common sense questions were quickly declared “off limits” before they could even be asked.\n\nWarsaw then stopped just short of any talk of Article 5, but then floated Article 4 as the basis of an emergency NATO security meeting for Wednesday, which calls for “consultations” in the event a NATO country is under threat.\n\nBut what a difference a few hours, and a skeptical refusal to blindly jump on the war! bandwagon, makes. First, as we reported overnight, President Joe Biden explicitly said that based on preliminary information, it is “unlikely” that the rocket strike in Poland originated in Russia. Oops. This as based on the available emerging evidence it seemed clear the culprit was more likely an errant Ukrainian anti-air missile. “It’s unlikely in the minds of [sic] the trajectory that it was fired from Russia. But we’ll see,” Biden had said. But this admission conveniently came well after the US president seized the ‘fog of war’ moment to unveil another massive $37 billion emergency aid package for Ukraine almost simultaneous to the border incident.\n\nNow on Wednesday, Poland and NATO officials have also done a reversal of the initial kneejerk ‘blame Russia’ reporting which momentarily sent the world into a frenzy of anxiety over the prospect of WWIII. Polish President Andrzej Duda has said the explosion that killed two people now appears to be an “unfortunate accident” and not an “intentional attack.”\n\nWhat is left to say after all of this? Here are the facts…\n\nRecall that the initial reaction out of Moscow was that either Ukraine or Poland was staging a “deliberate provocation” in so quickly hurling blame on Russia for an aggressive act. Warsaw officials had even in the hours after demanded that Russia make an apology if it was an accident.\n\nBut President Duda alongside NATO HQ is quickly reversing the entire narrative, according to more from Axios:\n• Duda added that the projectile that caused the blast was “most likely” Russian-made, but officials have “no proof at the moment that it was a missile fired by the Russian side.”\n• Ukraine has previously denied it was to blame for the blast and accused Moscow of a “serious escalation.” Russia also denied responsibility.\n\nOf course, it’s always been the case that Ukraine’s anti-air missile arsenal is entirely “Russian-made” – particularly its S-300s.\n\nNATO Secretary General Jens Stoltenberg issued a similar assessment, saying it was most likely an errant Ukrainian missile:\n\nTo be expected, he quickly followed by still laying blame on Russia for the overall war and series of events which led to the deadly border explosion. “But let me be clear. This is not Ukraine’s fault. Russia bears ultimate responsibility, as it continues its illegal war against Ukraine,” the NATO chief said.\n\nWithout addressing Zelensky’s prior day shrill rush to get NATO to declare military action based on collective security, Stoltenberg stressed, “this is not Ukraine’s fault.” As NATO defense officials continue to meet to determine a way forward, and as the whole drama has clearly fizzled out (again, only after it emerged it was Ukraine’s rocket), likely the alliance will quietly move on in a “nothing to see here” manner.\n\nBut what about the next time a similar border tragedy or incident on NATO-land plays out? Will the same “Russia is attacking NATO!” narrative prevail before anyone is allowed to ask simple questions? Will the war drums beat before there’s so much as a forensic investigation? Will there be a mushroom cloud before pesky rational skepticism disrupts the “consensus”? As the past ten years of war in Syria and Western intervention there have demonstrated, this is the likely inevitable scenario of how NATO and Russia will stumble into direct conflict at this rate.\n\nIn the meantime, as for the below still lingering question, we won’t hold our breath…", "opengraph": {"type": "article", "title": "Associated Press Issues Correction After Publishing False Report That Could’ve Started WW3", "url": "https://TheRundownLive.com/associated-press-issues-correction-after-publishing-false-report-that-couldve-started-ww3/", "description": "The Associated Press recently published a fake that could have set off a chain of events leading to world war three. Now after the propaganda was exposed, the MSM is backpedaling to save face. &nbs…", "article:published_time": "2022-11-18T19:00:14+00:00", "article:modified_time": "2022-11-18T19:12:18+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2022/11/Russia-Poland-Bombing.jpg?fit=880%2C495&ssl=1", "image:width": "880", "image:height": "495", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Did Ukraine Try To Lie Us Into WWIII? – today on the Liberty Report:<a href=\"https://t.co/DuDCDIlCbg\">https://t.co/DuDCDIlCbg</a></p>\n<p>— Ron Paul (@RonPaul) <a href=\"https://twitter.com/RonPaul/status/1592936045850824704?ref_src=twsrc%5Etfw\">November 16, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">US funding for war in Ukraine in 9 months:</p>\n<p>Mar: $ 13.6 billion<br/>May: $ 40b <br/>Nov: $ 37.7b: Biden's new request</p>\n<p>That $ 91.3 billion is 33% more than Russia's *total military spending for the year*</p>\n<p>It's *double* the US's average annual expenditure for its own war in Afghanistan</p>\n<p>— Glenn Greenwald (@ggreenwald) <a href=\"https://twitter.com/ggreenwald/status/1592896349431009280?ref_src=twsrc%5Etfw\">November 16, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Russia now promotes a conspiracy theory that it was allegedly a missile of Ukrainian air defense that fell on the Polish theory. Which is not true. No one should buy Russian propaganda or amplify its messages. This lesson should have been long learnt since the downing of <a href=\"https://twitter.com/hashtag/MH17?src=hash&amp;ref_src=twsrc%5Etfw\">#MH17</a>.</p>\n<p>— Dmytro Kuleba (@DmytroKuleba) <a href=\"https://twitter.com/DmytroKuleba/status/1592632386751434752?ref_src=twsrc%5Etfw\">November 15, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">UKRAINE tried to start WW3 yesterday when a UKRAINIAN missile struck a NATO country and killed innocent civilians.</p>\n<p>Ukrainian leaders LIED and BLAMED RUSSIA. The AP wrote it up unquestioningly.</p>\n<p>Ukrainian Leaders LIED to try and initiate full-blown WW3.</p><div class=\"inline-post clearfix\"><div id=\"block-wrap-27850\" class=\"block-wrap-native block-wrap block-wrap-23 block-css-27850 block-wrap-classic columns__m--1 elements-design-1 block-ani block-skin-0 tipi-box block-wrap-thumbnail ppl-m-1 clearfix\" data-id=\"27850\" data-base=\"0\"><div class=\"tipi-row-inner-style clearfix\"><div class=\"tipi-row-inner-box contents sticky--wrap\"><div class=\"block block-23 clearfix\"><article style=\"--animation-order:0\"><div class=\"preview-mini-wrap clearfix\"><div class=\"mask\"><a href=\"https://TheRundownLive.com/biden-signs-executive-order-instructing-ai-development-to-promote-equity/\" class=\"mask-img\"><img width=\"100\" height=\"100\" src=\"https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=100%2C100&amp;ssl=1\" class=\"attachment-thumbnail size-thumbnail zeen-lazy-load-base zeen-lazy-load  wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=150%2C150&amp;ssl=1 150w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=125%2C125&amp;ssl=1 125w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=300%2C300&amp;ssl=1 300w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=100%2C100&amp;ssl=1 100w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?zoom=2&amp;resize=100%2C100&amp;ssl=1 200w\" sizes=\"(max-width: 100px) 100vw, 100px\" loading=\"lazy\"/><noscript><img width=\"100\" height=\"100\" src=\"https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=100%2C100&amp;ssl=1\" class=\"attachment-thumbnail size-thumbnail zeen-lazy-load-base zeen-lazy-load  wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=150%2C150&amp;ssl=1 150w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=125%2C125&amp;ssl=1 125w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=300%2C300&amp;ssl=1 300w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?resize=100%2C100&amp;ssl=1 100w, https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/02/photo_2023-02-28_14-07-50.jpg?zoom=2&amp;resize=100%2C100&amp;ssl=1 200w\" sizes=\"(max-width: 100px) 100vw, 100px\" loading=\"lazy\"/></noscript></a></div></div></article></div></div></div></div></div>\n<p>These are the facts.</p>\n<p>— Benny Johnson (@bennyjohnson) <a href=\"https://twitter.com/bennyjohnson/status/1592877424475529218?ref_src=twsrc%5Etfw\">November 16, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The missile that hit Poland killing two people was a Ukrainian air defense missile and there is no evidence to suggest the incident was an intentional attack by Russia, Poland's President Andrzej Duda said on Wednesday. <a href=\"https://t.co/UBcRxX6lSQ\">https://t.co/UBcRxX6lSQ</a></p>\n<p>— Nick Short ‎‎ (@PoliticalShort) <a href=\"https://twitter.com/PoliticalShort/status/1592854795278508033?ref_src=twsrc%5Etfw\">November 16, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.zerohedge.com/markets/poland-nato-agree-deadly-poland-border-russian-attack-was-errant-ukrainian-missile", "https://www.washingtonpost.com/politics/zelenskyy-battle-for-kherson-was-d-day-like-watershed/2022/11/15/8f553f1e-64c9-11ed-b08c-3ce222607059_story.html", "https://i0.wp.com/www.zerohedge.com/s3/files/inline-images/APcorrex.png?ssl=1", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/statement-by-national-security-council-spokesperson-adrienne-watson-2/", "https://t.co/DuDCDIlCbg", "https://twitter.com/RonPaul/status/1592936045850824704?ref_src=twsrc%5Etfw", "https://www.zerohedge.com/political/biden-unveils-37bn-more-emergency-ukraine-aid-heels-polish-border-attack-incident", "https://twitter.com/ggreenwald/status/1592896349431009280?ref_src=twsrc%5Etfw", "https://www.reuters.com/world/europe/us-official-says-russian-missiles-hit-poland-killing-2-associated-press-2022-11-15/", "https://www.zerohedge.com/markets/futures-tumble-after-report-stray-rockets-hit-polish-town-near-ukraine-killing-two", "https://twitter.com/UAWeapons/status/1592629251161075712", "https://twitter.com/hashtag/MH17?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/DmytroKuleba/status/1592632386751434752?ref_src=twsrc%5Etfw", "https://www.zerohedge.com/political/biden-unveils-37bn-more-emergency-ukraine-aid-heels-polish-border-attack-incident", "https://TheRundownLive.com/biden-signs-executive-order-instructing-ai-development-to-promote-equity/", "https://twitter.com/bennyjohnson/status/1592877424475529218?ref_src=twsrc%5Etfw", "https://www.axios.com/2022/11/16/poland-president-ukraine-russia-missile?stream=top&utm_source=alert&utm_medium=email&utm_campaign=alerts_all", "https://www.euronews.com/my-europe/2022/11/16/nato-chief-holds-emergency-meeting-over-poland-explosion", "https://t.co/UBcRxX6lSQ", "https://twitter.com/PoliticalShort/status/1592854795278508033?ref_src=twsrc%5Etfw", "https://www.independent.co.uk/voices/douma-syria-opcw-chemical-weapons-chlorine-gas-video-conspiracy-theory-russia-a8927116.html", "https://i0.wp.com/www.zerohedge.com/s3/files/inline-images/sdavistwt.png?ssl=1"], "authors": [], "publish_date": "2022-11-18T19:00:14+00:00"}