{"result_id": "305006", "URL": "https://therundownlive.com/sweden-now-using-injectable-microchips-for-vaccine-passports/", "timestamp": "2023-04-25 17:32:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/sweden-now-using-injectable-microchips-for-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "Sweden Now Using Injectable Microchips For Vaccine Passports", "cleaned_text": "* Sweden has made available microchips to be injected anywhere on the body for use as vaccine passports as the country moves forward with vaccine mandates.\n\n* After successfully defeating Covid-19 without the use of authoritarian dictates Sweden has now done a 180-degree turnaround imposing strict mandates across the nation\n\nThings are starting to get really weird.\n\nWhat I am about to share with you sounds very strange, but it is all true. Before I get into it, let me ask you a question. If you could have a vaccine passport permanently embedded into your hand, would you do it? Amazingly, some people in Sweden are willingly doing this to themselves. They are putting microchips that contain their vaccine passport information into their hands, and they are raving about how convenient this is. You can actually watch a video of this being done to someone right here. The video is not in English, but you will be able to understand what is happening.\n\nI was absolutely floored when I first watched that.\n\nDo they not understand where this could lead?\n\nSociety is increasingly being divided into two classes of people, and the class of people that is willingly conforming is being granted many “privileges” that the other group is being denied.\n\nMany believe that this is “just a phase” and that things will eventually go back to normal.\n\nBut the truth is that this is not “just a phase” at all.\n\nFor a long time, health authorities were promising us that if we all did exactly what they asked that the pandemic would come to an end.\n\nUnfortunately, now they are openly admitting that COVID is going to be with us permanently…\n\nThe White House’s chief medical adviser, Anthony Fauci, says it’s unlikely that the Covid-19 coronavirus will ever be wiped out, and insists the world is just going to have to start living with it. During an interview with CBS’s ‘Face the Nation’ on Sunday, Fauci said he didn’t believe Covid-19 was ever going to entirely go away. He noted that the world had only ever eliminated one infection completely: smallpox. “We’re going to have to start living with Covid. I believe that’s the case because I don’t think we’re going to eradicate it,” Fauci told CBS.\n\nIf we are “going to have to start living with COVID”, that means that all of the infrastructure that they are now putting in place will be with us from now on.\n\nThat means that there isn’t going to be an end to the vaccine passports, the mandates or the injections.\n\nIn fact, the CEO of Pfizer says that “we’re going to have an annual revaccination”…\n\nYou are going to keep getting shots year after year after year in order to keep earning the “privileges” that you have been granted.\n\nHow sick is that?\n\nThey want to make their authoritarian measures a permanent part of our lives, and this is what our society is going to look like from now on unless we take a stand.\n\nThe good news is that some courts here in the United States are starting to reject the mandates that Joe Biden tried to implement. On Monday, a federal court blocked Biden’s mandate for health care workers in 10 states, and on Tuesday a different court blocked that same mandate on a nationwide basis…\n\nBut just because they have a legal setback or two does not mean that they are going to stop trying.\n\nOver in Germany, it is being reported that incoming Chancellor Olaf Scholz wants to impose a vaccine mandate on every single German starting in February…\n\nOther major industrialized nations are considering similar measures.\n\nIf I was living in Germany, I would leave. Of course the same thing could be said about Australia, New Zealand and a bunch of other countries that have gone in a deeply authoritarian direction.\n\nOnce vaccines become mandatory for an entire population, vaccine passports will be absolutely necessary for anyone that still wants to live anything that even resembles a “normal life”.\n\nWhether it is on your phone, on a card that you show or actually embedded in your skin, you will need to take it with you wherever you go in case you are stopped by law enforcement authorities.\n\nNeedless to say, all of this sounds eerily similar to what we witnessed back in the 1930s.\n\nThe people that are doing this to us have taken their masks off and they are showing us who they really are.\n\nThese are such dark times, and I have a feeling that they are about to get a whole lot darker.", "opengraph": {"type": "article", "title": "Sweden Now Using Injectable Microchips For Vaccine Passports", "url": "https://TheRundownLive.com/sweden-now-using-injectable-microchips-for-vaccine-passports/", "description": "* Sweden has made available microchips to be injected anywhere on the body for use as vaccine passports as the country moves forward with vaccine mandates. * After successfully defeating Covid-19 w…", "article:published_time": "2021-12-03T11:43:28+00:00", "article:modified_time": "2021-12-03T21:34:56+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2021/12/0000000micro.jpg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [], "links": ["http://themostimportantnews.com/archives/a-microchip-containing-your-vaccine-passport-information-can-now-be-embedded-in-your-hand", "https://twitter.com/SikhForTruth/status/1465327182826332163", "https://www.amazon.com/dp/B099HNN8CJ", "https://www.rt.com/usa/541660-fauci-living-with-covid-virus/", "http://themostimportantnews.com/archives/i-think-were-going-to-have-an-annual-revaccination-and-that-should-be-able-to-keep-us-really-safe", "https://www.lifenews.com/2021/11/30/federal-judge-blocks-biden-vaccine-mandate-nationwide-protects-health-care-workers-across-america/", "https://TheRundownLive.com/432422-2/", "https://www.politico.eu/article/scholz-wants-mandatory-vaccination-for-germans-by-february/"], "authors": [], "publish_date": "2021-12-03T11:43:28+00:00"}