{"result_id": "305010", "URL": "https://therundownlive.com/everything-on-demand/", "timestamp": "2023-04-25 17:32:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/everything-on-demand/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "Everything on Demand", "cleaned_text": "Competition makes entertainment better and cheaper.\n\n ——–\n\n Don’t miss a single video from Stossel TV, sign up here: <a href=”https://johnstossel.activehosted.com/f/1″ target=”_blank” rel=”nofollow”>https://johnstossel.activehosted.com/f/1\n\n ———\n\n “Reporters always complain about business. We rarely cover good things businesses do — the constant improvements that happen slowly,” says John Stossel.\n\nFortunately, a new video essay by Sean Malone of the Foundation for Economic Education does exactly that.\n\nHe shows the limited options for entertainment we had during his childhood and how “now just about anything I’ve ever wanted to watch is available at the click of a button.”\n\nWhy did this happen?\n\n“The astounding wealth of home entertainment options we have today are the result of entrepreneurial start-ups.”\n\nThe video explains that 20 years ago, “Blockbuster dominate[d] the rental video space… but tack[ed] on substantial fees for returning movies late … $40 in late fees at Blockbuster annoyed Reed Hastings enough to start a new subscription-based company built around mail-order movie rentals with no late fees, called Netflix.”\n\nBy 2005, the video notes, Blockbuster had lost 75% of its market share.\n\nStossel says, “There is an economics lesson in that. When entrepreneurs face competition, they may lose, but the fight makes life better for almost all of us. Austrian economist Joseph Schumpeter explained how that works.”\n\n“He introduced the term “Creative Destruction” as a defining feature of free market economies … older companies like Blockbuster have to become more innovative themselves or be destroyed by their competition. This process is how our standards of living continually increase,” says Malone.\n\n“We see this in most every industry. Think how much our phones have changed,” Stossel continues. “… Competition drove innovation. We got the blackberry, then the iPhone … Now we have budget smartphones that are even better.”\n\nStossel adds, “Of course, not every new idea is a good one. That’s why markets and prices are important. Prices are not just money, they’re information. They tell us where to put our money.”\n\nThe FEE video explains, “This is the biggest reason why trying to centrally plan an economy just doesn’t work. Politicians and bureaucrats don’t know what people are going to value.”\n\nDon’t monopolies stop progress? In 2007, Netflix had what some people claimed was a monopoly over streaming. But that monopoly disappeared almost as soon as it formed.\n\n“ … Jeff Bezos … launched a small movie streaming app called Amazon Unbox. A year later, NBC Universal decided to put its big library of content into a new service called Hulu … Other companies caught up real fast,” says Malone.\n\nWhen Malone was a kid, a basic cable package cost about $73 (adjusted for inflation).\n\n“Now we get much more choice for 1/10 th the price,” adds Stossel.\n\n“None of this was the result of any kind of grand, coordinated political plan. It’s something that could only happen in a market economy,” says Malone, “Disney+ is amazing. So is Netflix. And Hulu, and Amazon Prime. And they’re all getting better and better.”\n\n“As long as politicians don’t do something stupid, the future looks really good,” Malone concludes.", "opengraph": {"type": "article", "title": "Everything on Demand", "url": "https://TheRundownLive.com/everything-on-demand/", "description": "Competition makes entertainment better and cheaper. ——– Don’t miss a single video from Stossel TV, sign up here: <a", "article:published_time": "2020-01-24T15:29:13+00:00", "article:modified_time": "2020-01-24T05:52:41+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2020/01/kIvoWK_GVGQ-1.jpg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "506", "height": "304", "embed_code": "<iframe src=\"https://www.youtube.com/embed/kIvoWK_GVGQ?&amp;rel=0\" title=\"YouTube video player\" class=\"ayvpp responsive\" width=\"506\" height=\"304\" data-ratio=\"16:9\" frameborder=\"0\" allowfullscreen=\"\" allowtransparency=\"true\"/>", "src": "https://www.youtube.com/embed/kIvoWK_GVGQ?&rel=0"}], "links": ["https://TheRundownLive.com/cnn-journalist-defends-censorship-of-conservatives/"], "authors": [], "publish_date": "2020-01-24T15:29:13+00:00"}