{"result_id": "305015", "URL": "https://therundownlive.com/cdc-pushed-for-covid-19-boosters-without-clinical-trials-emails/", "timestamp": "2023-04-25 17:32:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/cdc-pushed-for-covid-19-boosters-without-clinical-trials-emails/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "CDC Pushed for COVID-19 Boosters Without Clinical Trials: Emails", "cleaned_text": "\n• A new batch of emails obtained by a Judicial Watch amid ongoing litigation against the Biden Administration has shown the Centers for Disease Control pushed for the FDA to authorize Covid-19 vaccine booster shots while Pfizer and Madera still had not yet completed their clinical trials.\n\nCDC officials relayed to counterparts at the Food and Drug Administration (FDA) in early August 2021 that they wanted authorization for Moderna and Pfizer boosters as data began showing that the vaccines weren’t working as well as initially promoted.\n\nThe conversation took place on a call that was described by Dr. Phil Krause, a top FDA official, to several other FDA workers.\n\n“Take a deep breath before reading this next paragraph. On that call, the CDC evidently stated that they will assemble all the data they are aware of on third dosing in this setting and send it to us in the hope that we will (very soon) authorize the third dose for immunocompromised as part of the EUA,” Krause wrote in the Aug. 5, 2021, email ( pdf ).\n\nAll of the COVID-19 vaccines were authorized under emergency conditions at that time.\n\nNo boosters had been authorized and no clinical data were available for the boosters.\n\nThe emails show that “the CDC wanted the booster approved without a trial,” Dr. Jay Bhattacharya, a professor of medicine at Stanford University, wrote on Twitter.\n\nThe CDC didn’t respond to a request for comment.\n\nKrause was responding to Doran Fink, who also works for the FDA’s Center for Biologics Evaluation and Research, charged with evaluating vaccines.\n\nFink sent along a post that had been made to an infectious diseases forum regarding whether doctors should be giving additional vaccine doses to patients with compromised immune systems despite the lack of authorization.\n\nDr. Richard Nathan of Idaho had written that other countries, including Israel, had cleared boosters.\n\n“Pfizer recommends it and I trust their guidance over the turmoil at our federal agencies. With millions of doses of vaccine set to expire, you should do what you think is best for your patients. I can’t believe you would get pushback from anyone. Keep in mind, nearly everyone in this group is six to seven months out from the second dose of the vaccine and many have significant daily exposure to the virus,” Nathan wrote.\n\nFink said the post “accurately reflects more widespread thinking that I am hearing in other forums as well,” including among doctors who advise the CDC on vaccines.\n\n“Providers are losing confidence in FDA/CDC to do the right thing for their patients,” Fink said.\n\nThe agency said that “a thorough review of the available data” concluded the group “may benefit” from a third dose.\n\n“As we’ve previously stated, other individuals who are fully vaccinated are adequately protected and do not need an additional dose of COVID-19 vaccine at this time,” Dr. Janet Woodcock, the FDA’s top official said.\n\nIn September 2021, the FDA and CDC authorized Pfizer boosters for many other Americans. The authorization was expanded to Moderna and Johnson & Johnson shots, and virtually all other Americans, later in the year.\n\nJudicial Watch obtained the newly published emails as part of ongoing litigation against the Biden administration for not properly responding to a Freedom of Information Act request.\n\n“We need to be given time to consider their data and cannot be pushed by these companies and, for that matter the Administration, who try to impose timeless [sic] that make no sense,” Gruber wrote to Dr. Peter Marks, a top FDA official.\n\n“These FDA records further document top officials’ concerns about the controversial COVID-19 booster shots,” Judicial Watch President Tom Fitton said in a statement. “That it has taken months and a federal lawsuit to uncover this critical material is a scandal.”", "opengraph": {"type": "article", "title": "CDC Pushed for COVID-19 Boosters Without Clinical Trials: Emails", "url": "https://TheRundownLive.com/cdc-pushed-for-covid-19-boosters-without-clinical-trials-emails/", "description": "A new batch of emails obtained by a Judicial Watch amid ongoing litigation against the Biden Administration has shown the Centers for Disease Control pushed for the FDA to authorize Covid-19 vaccin…", "article:published_time": "2022-10-31T20:30:04+00:00", "article:modified_time": "2022-10-31T05:43:11+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2022/10/sw.webp?fit=931%2C524&ssl=1", "image:width": "931", "image:height": "524", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": [], "movies": [], "links": ["https://archive.ph/o/pavBV/https://www.theepochtimes.com/author-zachary-stieber", "https://www.theepochtimes.com/cdc-pushed-for-covid-19-boosters-without-clinical-trials-emails_4821710.html", "https://TheRundownLive.com/under-musk-twitter-continues-to-promote-us-propaganda-networks/", "https://archive.ph/o/pavBV/https://www.theepochtimes.com/t-centers-for-disease-control-and-prevention", "https://archive.ph/o/pavBV/https://www.judicialwatch.org/wp-content/uploads/2022/10/JW-v-HHS-Boosters-Prod-4-00293-1.pdf", "https://archive.ph/o/pavBV/https://www.theepochtimes.com/fda-approves-booster-covid-19-shots-for-vulnerable-immunocompromised-people_3947003.html", "https://archive.ph/o/pavBV/https://www.nejm.org/doi/full/10.1056/NEJMc2108861", "https://archive.ph/o/pavBV/https://www.nejm.org/doi/full/10.1056/NEJMc2111462", "https://archive.ph/o/pavBV/https://www.theepochtimes.com/biden-admin-recommends-covid-19-booster-shots-will-start-wide-distribution-on-sept-20_3954303.html", "https://archive.ph/o/pavBV/https://www.theepochtimes.com/fda-leaders-other-scientists-say-most-people-dont-need-vaccine-boosters_3994852.html", "https://archive.ph/o/pavBV/https://www.theepochtimes.com/top-fda-officials-concerned-about-pressure-to-authorize-covid-19-vaccine-boosters-emails_4630913.html"], "authors": [], "publish_date": "2022-10-31T20:30:04+00:00"}