{"result_id": "305004", "URL": "https://therundownlive.com/microsofts-patent-666-wearable-technology-monitor-brain-waves-and-subconscious-thoughts/", "timestamp": "2023-04-25 17:32:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2023/03/cropped-Therundownlive512.png?fit=32%2C32&ssl=1", "canonical": "https://TheRundownLive.com/microsofts-patent-666-wearable-technology-monitor-brain-waves-and-subconscious-thoughts/", "encoding": "UTF-8"}, "image": null, "domain": "therundownlive.com", "title": "Microsoft’s Patent 666, Wearable Technology to Monitor Brain Waves and Subconscious Thoughts", "cleaned_text": "*Microsoft Technology Will Monitor Your Brainwaves, Activities and Memories\n\n*Potential for Every Interaction or Thought to Become a Transaction Where You Can Gain or Lose Points/Coins\n\n*World Religious Leaders Worry Patent 060606 is Biblical Prophecy of the Mark of the Beast in Revelations Chapter 13\n\nA patent filed on March 26, 2020 by Microsoft titled “Cryptocurrency System Using Body Activity Data” brings us one step closer to a Twilight Zone future. In 2002 a CNET Report dubbed a similar technology, the “Soul Catcher 2025,” that records all memories and behaviors and this is a more adaptable, commercial version. One that can be used as a wearable or implantable.\n\nHowever, according to computer antivirus guru, John McAffee, the patent is for a implantable “cryptocurrency system using humans who have been chipped as the ‘Miners’.”\n\nPatent WO2020060606 or 666 for the non-techie out there is basically as it sounds. Microsoft wants to turn living humans into cryptocurrency minors and pay you based on your behaviors. The patent is not clear on whether the technology will be used in implantable form or as wearable technology or both. So what can this technology all do.\n\nAccording to the futuristic patent, “Human body activity associated with a task provided to a user may be used in a mining process of a cryptocurrency system. A server may provide a task to a device of a user which is communicatively coupled to the server. A sensor communicatively coupled to or comprised in the device of the user may sense body activity of the user. Body activity data may be generated based on the sensed body activity of the user.”\n\nSounds harmless right? Then you get into the deep details and learn that the implant will monitor much more than your vitals, but your brain waves and thought process. The legal document within the section “Detailed Description of Embodiments, article 36, goes in detail of what type of body activity Microsoft intends to track.\n\n“At operation 320, when or after user 145 performs the task(s) provided by task server 110, sensor 140 may sense the body activity of user 145 that is a body response related to the task provided by task server 110, and then transmit the sensed body activity of user 145 to user device 130. The body activity may include, for example, but not limited to, radiation emitted from human body, brain activities, body fluid flow (e.g. blood flow), organ activity or movement, body movement, and any other activities that can be sensed and represented by images, waves, signals, texts, numbers, degrees, or any other form of information or data. Examples of body radiation emitted from human body may include radiant heat of the body, pulse rate, or brain wave. Brain waves may comprise, for example, but not limited to, (i) gamma waves, involved in learning or memory tasks, (ii) beta waves, involved in logical thinking and/or conscious thought, (iii) alpha waves, which may be related to subconscious thoughts, (iv) theta waves, which may be related to thoughts involving deep and raw emotions, (v) delta waves, which may be involved in sleep or deep relaxation, or (vi) electroencephalogram (EEG), which may be measurement used to evaluate the electrical activity in the brain, such as deep concentration. Examples of the body movement may include eye movement, facial movement or any other muscular movements. Furthermore, brain activity can be sensed using the fMRI. The fMRI measures brain activity by detecting changes associated with blood flow. This technique relies on the fact that cerebral blood flow and neuronal activation are coupled. When an area of the brain is in use, blood flow to that region also increases.\n\nSo, per say, Microsoft could pay you for learning something they decide is beneficial or performing a certain behavior and reward you with cryptocurrency similar to Bitcoin. However if you have too many unapproved subconscious thoughts or interactions you could be penalized, banned or even arrested in the future. How long before we merge social credit scores, wallets and ID’s,\n\nMicrosoft also has ties to an eerily similar project called ID2020 in which they plan to distribute Digital Identification Numbers to everyone and consolidate a “variety of forms of identification to go about our lives: our driver’s license, passport, work badge and building access cards, debit and credit cards, transit passes, and more,” according to their website. The initiatives website claims ID2020 will also be our access key to “e-passports to digital wallets, online banking to social media accounts, these new forms of digital ID allow us to travel, conduct business, access financial and health records, stay connected, and much more.”\n\nIt turns out ID2020 is planning a business certification program that will benefit local businesses that decide they would like to be an outstanding community store, or only want business from individuals who are ID2020 customers, which will lead to a whole new form of segregation by social credit scores class. The Identification program website claims their business “Certification Mark gives direction to companies’ product development road maps, steering the market towards ethical, inclusive technologies. Certification also allows companies meeting our technical requirements to market themselves as-such and gives those implementing these technologies confidence in adopting certified solutions.”\n\nMicrosoft’s ID2020 just collaborated to create a digital tattoo implant for vaccine compliance.\n\nBill Gates’ quantum dot digital tattoo implant already tracks vaccine compliance. “The invisible “tattoo” accompanying the vaccine is a pattern made up of minuscule quantum dots – tiny semiconducting crystals that reflect light – that glows under infrared light. The pattern – and vaccine – gets delivered into the skin using hi-tech dissolvable microneedles made of a mixture of polymers and sugar,” according to Science Alert.\n\nCombining all these technologies into one ID chip is not an unreasonable leap. DARPA already does.\n\nSo why the conspiracy over patent 060606?\n\nWhether coincidence or conspired the patent ending in 060606 has controversy in its number alone. So here is some interesting public knowledge surrounding Bill Gates, Microsoft and the number 666.\n• Bill Gates’ father, William H. Gates Sr., has long been involved with the , a rebranded organization birthed out of the pseudoscience group, American Eugenics Society. Eugenics is a pseudoscience based on selective depopulation based on beneficial traits.\n• Microsoft founder Bill Gates, purchased 500,000 back in 2010 valued at more than $23 million. Monsanto used consensus science to fraudulently cover up studies of known harmful side effects from their product Roundup Glyphosate.\n• Gates has on at least 6 or more occasions visited with Jeffery Epstein who was arrested for trafficking underage teens to the rich and famous.\n• He promotes depopulation to combat global warming “through vaccination, healthcare and reproductive services,” according to his Ted Talk 2010 speech.\n• Is Bill Gates an Aleister Crowley Satanist? Microsoft just filmed a commercial with top Satanist, Marina Abramović, dropped it on YouTube Good Friday, it was pulled in less than 48 hours and received 90% negative rating. Abramović was linked to the notorious Wikileaks release involving Hillary Clinton’s campaign manager, John Podesta’s email inviting him and his brother over for an Aleister Crowley occult ritual of “Spirit Cooking and Dinner.” Podesta was accused of being a gatekeeper of child trafficking in the United States by infamous journalist, Andrew Breitbart.\n• Bill Gates Estate was site of a child pornography sting resulting in 6,000 child rape, fetish photos. An employee happened to be involved.\n• This Patent resembles the Beasts mark 666 in Revelations 13:18 “Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six.”\n• Religious leaders believe Bill Gates could contribute to the prophetic mark of the beast.\n\nFor further reading, visit the patent, read it, then visit Snopes, who basically acted like article 36, doesnt even exist, further showing how unreliable they are and the satirical truth behind the Babylon Bee‘s article, “Concerning Survey Finds Too Many People Believe Snopes is a Fact Checking Website.” They suggest the patent does not specifically say implantable technology in the patent. But what Snopes does not let you know it could just as well 100% be used with implantable technology. They also do not mention the potential for collaboration of technology with ID2020. The truth is we do not know, but we can all speculate.\n\nThis article is free and open source. You have permission to republish this article with attribution to the author and TheRundownLive.com. Tune-in to the THERUNDOWNLIVE Monday-Friday @ 9pm EST; 6pm PST.", "opengraph": {"type": "article", "title": "Microsoft’s Patent 666, Wearable Technology to Monitor Brain Waves and Subconscious Thoughts", "url": "https://TheRundownLive.com/microsofts-patent-666-wearable-technology-monitor-brain-waves-and-subconscious-thoughts/", "description": "*Microsoft Technology Will Monitor Your Brainwaves, Activities and Memories *Dreams, Subconscious Thoughts-Not off Limits to Futuristic Technology *Microsoft to Reward Cryptocurrency Based on Behav…", "article:published_time": "2020-04-21T01:25:05+00:00", "article:modified_time": "2020-04-22T04:40:13+00:00", "site_name": "The Rundown Live", "image": "https://i0.wp.com/TheRundownLive.com/wp-content/uploads/2020/04/bill-gates-global-vaccinations-id2020-digital-identification-event-201-microsoft-vaccine-mark-of-the-beast-revelation-13.jpg?fit=950%2C450&ssl=1", "image:width": "950", "image:height": "450", "locale": "en_US"}, "tags": ["kristan t harris", "the rundown live", "kristan harris", "rundown live", "don via jr"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Microsoft owns International patent # 060606 …</p>\n<p>A cryptocurrency system using humans who have been chipped as the “Miners”.</p>\n<p>I shit thee not.<a href=\"https://t.co/S7wbcjzi8w\">https://t.co/S7wbcjzi8w</a></p>\n<p>— John McAfee (@officialmcafee) <a href=\"https://twitter.com/officialmcafee/status/1251580245733449729?ref_src=twsrc%5Etfw\">April 18, 2020</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe style=\"display: block; margin: 0px auto;\" id=\"_ytid_44527\" width=\"1200\" height=\"675\" data-origwidth=\"1200\" data-origheight=\"675\" src=\"https://www.youtube.com/embed/c5P0J-eXUek?enablejsapi=1&amp;autoplay=0&amp;cc_load_policy=0&amp;cc_lang_pref=&amp;iv_load_policy=1&amp;loop=0&amp;modestbranding=0&amp;rel=1&amp;fs=1&amp;playsinline=0&amp;autohide=2&amp;theme=dark&amp;color=red&amp;controls=1&amp;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"/>", "src": "https://www.youtube.com/embed/c5P0J-eXUek?enablejsapi=1&autoplay=0&cc_load_policy=0&cc_lang_pref=&iv_load_policy=1&loop=0&modestbranding=0&rel=1&fs=1&playsinline=0&autohide=2&theme=dark&color=red&controls=1&"}], "links": ["http://facebook.com/kristantharris", "https://wp.me/p3DPVX-1K7W", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTBIBLIO", "https://www.cnet.com/news/a-new-memory-chip-for-the-brain/", "https://t.co/S7wbcjzi8w", "https://twitter.com/officialmcafee/status/1251580245733449729?ref_src=twsrc%5Etfw", "https://www.webopedia.com/TERM/C/cryptocurrency-mining.html", "https://www.webopedia.com/TERM/C/cryptocurrency-mining.html", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTBIBLIO", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTDESCRIPTION", "https://id2020.org/", "https://id2020.org/", "https://id2020.org/", "https://www.biometricupdate.com/201909/id2020-and-partners-launch-program-to-provide-digital-id-with-vaccines", "https://www.biometricupdate.com/201909/id2020-and-partners-launch-program-to-provide-digital-id-with-vaccines", "https://www.sciencealert.com/an-invisible-quantum-dot-tattoo-is-being-suggested-to-id-vaccinated-kids", "https://www.sciencealert.com/an-invisible-quantum-dot-tattoo-is-being-suggested-to-id-vaccinated-kids", "https://therundownlive.com/pentagon-rolls-out-darpa-plan-to-implant-chip-in-soldiers-brain/", "https://TheRundownLive.com/pentagon-rolls-out-darpa-plan-to-implant-chip-in-soldiers-brain/", "https://www.bibliotecapleyades.net/sociopolitica/sociopol_globalelite83.htm", "https://www.bibliotecapleyades.net/ciencia/ciencia_monsanto.htm", "https://www.aei.org/carpe-diem/for-earth-day-michael-crichton-explains-why-there-is-no-such-thing-as-consensus-science/", "https://www.scientificamerican.com/article/study-linking-genetically-modified-corn-to-cancer/", "https://www.zerohedge.com/news/2019-04-21/new-roundup-cancer-lawsuit-exposes-cozy-relationship-between-monsanto-and-epa", "https://www.zerohedge.com/news/2019-04-21/new-roundup-cancer-lawsuit-exposes-cozy-relationship-between-monsanto-and-epa", "https://www.zerohedge.com/health/bill-gates-was-much-closer-jeffrey-epstein-he-intially-let", "https://www.nytimes.com/2019/10/12/business/jeffrey-epstein-bill-gates.html", "https://www.youtube.com/watch?v=LmzeYYWntxw&t=13s", "https://wikileaks.org/podesta-emails/emailid/15893", "https://wikileaks.org/podesta-emails/emailid/15893", "https://wearechange.org/spirit-cooking-disturbing-podesta-email-yet-warning-graphic-content/", "https://wearechange.org/spirit-cooking-disturbing-podesta-email-yet-warning-graphic-content/", "https://www.washingtontimes.com/news/2016/nov/28/andrew-breitbart-tweet-before-death-adds-fuel-to-o/", "https://www.kiro7.com/news/man-arrested-bill-gates-estate-reportedly-trading-/43531857/", "https://www.endtime.com/podcast/is-bill-gates-preparing-to-administer-the-mark-of-the-beast/", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTBIBLIO", "https://www.snopes.com/fact-check/microsoft-own-patent-666/", "https://babylonbee.com/news/concerning-survey-finds-too-many-people-think-snopes-is-a-real-fact-checking-website", "https://babylonbee.com/news/concerning-survey-finds-too-many-people-think-snopes-is-a-real-fact-checking-website", "https://web.archive.org/web/20170727145925/http://therundownlive.com/", "https://web.archive.org/web/20170727145925/http://therundownlive.com/live"], "authors": [], "publish_date": "2020-04-21T01:25:05+00:00"}