{"result_id": "306029", "URL": "https://stream.org/not-just-misinformation-in-emails-to-white-house-facebook-admits-suppressing-often-true-content-on-covid-19-vaccines/", "timestamp": "2023-04-25 17:33:59 CEST+0200", "meta": {"description": "Facebook told an official at the Biden White House that the Big Tech company not only suppressed misinformation but took action against the “virality” of “often-true content” regarding the COVID-19 vaccines.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/not-just-misinformation-in-emails-to-white-house-facebook-admits-suppressing-often-true-content-on-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Not Just Misinformation: In Emails to White House, Facebook Admits Suppressing ‘Often-True Content’ on COVID-19 Vaccines", "cleaned_text": "Facebook told an official at the Biden White House that the Big Tech company not only suppressed misinformation but took action against the “virality” of “often-true content” regarding the COVID-19 vaccines.\n\nMissouri Attorney General Andrew Bailey released the documents earlier this week. Bailey obtained them through a court case, Missouri v. Biden, alleging that some of President Joe Biden’s top officials “colluded with Big Tech social media companies to violate Americans’ right to free speech under the First Amendment.”\n\n“I want to protect Missourians and the freedoms they enjoy, which is why as attorney general, I will always defend the Constitution,” Bailey told The Daily Signal in an email Thursday. “This case is about the Biden administration’s blatant disregard for the First Amendment and its collusion with Big Tech social media companies to suppress speech it disagrees with.”\n\n“I will always fight back against unelected bureaucrats who seek to indoctrinate the people of this state by violating our constitutional right to free and open debate,” the Missouri attorney general pledged.\n\nIn an email to the White House dated March 21, 2021, a Facebook staff member discussed “levers for tackling vaccine hesitancy content” with Andrew Slavitt, then a senior adviser on Biden’s COVID-19 response team, and Rob Flaherty, White House director of digital strategy.\n\n“You also asked us about our levers for reducing virality of vaccine hesitancy content,” wrote the Facebook staffer, whose identity was redacted. “As you know, in addition to removing vaccine misinformation, we have been focused on reducing the virality of content discouraging vaccines that does not contain actionable information. This is often-true content, which we allow at the post level because it is important for people to be able to discuss both their personal experiences and concerns about the vaccine, but it can be framed as sensation, alarmist, or shocking.”\n\n“We’ll remove these Groups, Pages, and Accounts when they are disproportionately promoting this sensationalized content,” the Facebook staffer added. He or she then promised, “More on this front as we proceed to implement.”\n\nIn this email to the White House, the Facebook representative admitted to preventing exposure of content that doesn’t violate Facebook’s policies — content that isn’t “actionable.” The staffer also suggested that the White House had asked Facebook to take these measures.\n\nIn an April 22, 2021, email, Flaherty told Google staff that the White House remains “concerned that Youtube [sic] is ‘funneling’ people into hesitance and intensifying people’s hesitancy. We certainly recognize that removing content that is unfavorable to the cause of increasing vaccine adoption is not a realistic—or even good—solution.”\n\nThe White House’s digital strategy chief added that combating vaccine hesitancy “is a concern that is shared at the highest (and I mean highest) levels of the WH [White House],” an apparent reference to the president himself.\n\nIn an April 14, 2021, email to Facebook, Flaherty suggested the social media platform should take action to suppress Fox News host Tucker Carlson and conservative journalist Tomi Lahren.\n\n“Since we’ve been on the phone—the top post about vaccines today is tucker [sic] Carlson saying they don’t work,” Flaherty wrote. “Yesterday was Tomi Lehren [sic] saying she won’t take one. This is exactly why I want to know what ‘Reduction’ actually looks like—if ‘reduction’ means ‘pumping our most vaccine hesitant audience with tucker [sic] Carlson saying it doesn’t work’ then … I’m not sure it’s reduction!”\n\nIn a May 12, 2021, email, the White House’s Flaherty faulted Instagram, which Facebook owns, for failing to remove “bad information” from its search function. He appears aggressive in pushing for censorship.\n\n“You know and I know that the universe of undecided people searching Instagram for ‘vaccines’—as compared to, say, Google—is probably low,” Flaherty wrote. “But ‘removing bad information from search’ is one of the easy, low-bar things you guys do to make people like me think you’re taking action. If you’re not getting that right, it raises even more questions about the high bar stuff.”\n\n“You say in your note that you remove accounts that discourage vaccination from appearing in recommendations (even though you’re using ‘primarily’ to give yourself wiggle room),” Flaherty added. “You also said you don’t promote those accounts in search.”\n\nThen Flaherty compared Instagram to other social media platforms.\n\n“Youtube [sic], for their warts, has done pretty well at promoting authoritative info in search results while keeping the bad stuff off of those surfaces,” the White House official said. “Pinterest doesn’t even show you any results other than official information when you search for ‘vaccines.’ I don’t know why you guys can’t figure this out.”\n\nNeither Facebook nor the White House responded to The Daily Signal’s requests for comment.\n\nThese documents confirm the close relationship between the federal government and Big Tech companies revealed in the recently reported “Twitter Files.”\n\nInternal Twitter documents, released under the direction of new CEO Elon Musk, showed the Justice Department and FBI pressuring tech companies such as Twitter to stifle and suppress “misinformation,” particularly on the COVID-19 pandemic. In some cases, Twitter executives and government officials took aim at scientists who shared their professional opinions on the social media platform.\n\nThe FBI also paid Twitter more than $3 million while the intelligence community was pressuring the tech company to suppress news about Hunter Biden, the president’s son.\n\nBig Tech’s censorship has not abated, either. In December, YouTube removed a video presentation featuring two doctors and a Heritage Foundation expert, claiming the video violated its misinformation policy on COVID-19 vaccines. YouTube didn’t identify which of the four speakers supposedly had violated the policy.\n\nRoger Severino, former director of the Office for Civil Rights at the Department of Health and Human Services and currently vice president for domestic policy at The Heritage Foundation, called the move “Kafkaesque.” (The Daily Signal is The Heritage Foundation’s news outlet.)\n\n“I wish I knew exactly what triggered YouTube’s ire, but they remain imperiously vague,” Severino told The Daily Signal. “It is Kafkaesque to be placed in YouTube jail and not be told what the alleged crime was or even who committed it.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Not Just Misinformation: In Emails to White House, Facebook Admits Suppressing ‘Often-True Content’ on COVID-19 Vaccines - The Stream", "description": "Facebook told an official at the Biden White House that the Big Tech company not only suppressed misinformation but took action against the “virality” of “often-true content” regarding the COVID-19 vaccines.", "url": "https://stream.org/not-just-misinformation-in-emails-to-white-house-facebook-admits-suppressing-often-true-content-on-covid-19-vaccines/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2023-01-13T17:19:18+00:00", "image": "https://stream.org/wp-content/uploads/white-house-and-facebook.jpg", "image:width": "900", "image:height": "546", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://www.dailysignal.com/category/big-tech", "https://ago.mo.gov/home/news/2023/01/09/missouri-attorney-general-releases-more-documents-exposing-white-house's-social-media-censorship-scheme", "https://www.dailysignal.com/author/tyler-oneil/", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-1.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-1.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-1.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-2.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-2.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Bailey-White-House-Docs-2.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Tucker-and-Tomi.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Tucker-and-Tomi.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Baily-White-House-bad-information.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Baily-White-House-bad-information.pdf", "https://first-heritage-foundation.s3.amazonaws.com/live_files/2023/01/Baily-White-House-bad-information.pdf", "https://www.dailysignal.com/2023/01/03/twitter-files-reveal-left-uses-big-tech-create-illusion-sceintific-consensus-stifle-debate-especially-covid-19/", "https://stream.org/donate/", "https://www.dailysignal.com/2022/12/20/fbis-orwellian-suppression-hunter-biden-laptop/", "https://www.dailysignal.com/2023/01/09/exclusive-youtube-censors-doctors-heritage-foundation-expert-medical-misinformation-covid-19/", "https://www.dailysignal.com/author/roger-severino/", "http://dailysignal.com/2023/01/12/not-just-misinformation-emails-white-house-facebook-admits-suppressing-often-true-content-covid-19-vaccines/"], "authors": ["Aliya Kuykendall"], "publish_date": "2023-01-13T17:19:18+00:00"}