{"result_id": "306012", "URL": "https://stream.org/dcnf-exclusive-marines-describe-sham-religious-vaccine-exemption-process/", "timestamp": "2023-04-25 17:33:20 CEST+0200", "meta": {"description": "The COVID-19 vaccine exemption process in the Marine Corps gives no consideration to the faiths of individual soldiers and could hamper military readiness,", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/dcnf-exclusive-marines-describe-sham-religious-vaccine-exemption-process/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "DCNF Exclusive: Marines Describe 'Sham' Religious Vaccine Exemption Process", "cleaned_text": "The COVID-19 vaccine exemption process in the Marine Corps gives no consideration to the faiths of individual soldiers and could hamper military readiness, according to Marines fighting the Pentagon’s vaccine mandate on religious grounds who spoke to the Daily Caller News Foundation anonymously out of fear of retribution.\n\nAs of Friday, 95% of active duty members of the Marine Corps were fully vaccinated, and another 2% were partially vaccinated, Department of Defense (DOD) spokesperson Maj. Charlie Dietz told the DCNF. A total of 334 Marines have been separated with a vaccine refusal discharge code. The Marine Corps has received 3,538 religious exemption requests, and only three were approved, out of 3,414 requests that were processed.\n\nThe Secretary of Defense issued a memorandum on Aug. 24, requiring that all service members be fully vaccinated against COVID-19 as a matter of readiness.\n\n“To defend this Nation, we need a healthy and ready force. After careful consultation with medical experts and military leadership, and with the support of the President, I have determined that mandatory vaccination against coronavirus disease 2019 (COVID-19) is necessary to protect the Force and defend the American people,” the memo stated. The Marine Corps issued its mandate on Sept. 1.\n\nAll current requests for religious exemptions, according to Dietz, are being reviewed on a “case-by-case basis” and are “given full consideration with respect to the facts and circumstances submitted in the request.”\n\nA 23-year Marine Corps officer went so far as to call the religious exemption process a “sham.”\n\nLike many others, the officer’s religious exemption request was denied, as was her earlier medical exemption request. The officer, who is now appealing the Marine Corp’s denial, told the DCNF she believes the Pentagon “intends to dismiss all of us.”\n\n“When the appeals come back, and we know that they’re gonna come back denied, the guidance I’ve seen was that the individual’s supposed to receive a written order with enough time to comply, which they’re saying 30 days, 40 days, something like that,” she said. “And, at that time, if they’ve failed to comply, then they’re gonna get out-processed from the military. And, so far, I’ve started to see that take shape.”\n\n“For some of us, we’ve already been told, ‘hey, go do [a] transition readiness seminar,’ which is basically you have one foot out of the door, and also get your final physical,” she added. “We’ve already been told to do that.”\n\nThe officer, who spends a lot of time speaking with a chaplain, said her chaplain was regretful over getting the shot.\n\n“Sitting down with my chaplain was not an issue,” the officer said. “In fact, he had voiced to me his regrets for having gotten the shot, and he felt like he was spiritually dead. And I prayed with him actually, and prayed for him because of that.”\n\nA 17-year Marine officer, who previously fought in combat and is also seeking the accommodation, said the religious exemption process from the start was stacked against service members.\n\n“At this point, because this mandate and betrayal that we’re facing, I’m not just gonna walk away with nothing that I’ve earned, but I’m likely walking away as a criminal and facing serious consequences both within the military justice system as well as civil penalties, and things like that,” said the officer, who is close to receiving his full retirement.\n\n“I’m not necessarily anti-vaccine, but I’m very anti-mandate. I’m fighting this on religious grounds,” he added. “Personally, I’ve got very strong, sincerely held beliefs and convictions that prevent me from participating in this, but I also see this as it’s an individual choice. If somebody wants to do that, that is their decision and it’s their right to make.”\n\nThe process, he said, is “complex and layered, to say the least.” When he met with a chaplain, another step in the accommodation vetting process, he felt the process was contentious.\n\n“It was not an interview, it was an interrogation,” he said. “You know, usually the chaplains are very supportive of you following your conscience, but in this case it was going as far as trying to look at my diet and what products I have in my home. It was combative and there’s a lot of traps in every question to try to see if you know there was a flaw in my logic, so to speak … ”\n\nAt every step of the vetting process, the officer said he was told by commanders to “just comply, this is not going to get approved anyway.”\n\nThe officer’s request was subsequently denied, and he is now awaiting the fate of his appeal. He said the denials for every Marine have been identical.\n\n“It was word for word verbatim exactly the same denial letter that every other Marine has received,” he said. “So, with the template notes and then the denial letter, my suspicion is that religious accommodation requests are supposed to be reviewed on a case by case basis on their own individual merits. That is not happening, and it is just a rubber stamp process to get to no in order to separate us.”\n\nThe Marine is charged with helping maintain military retention, a job that has been key to keeping the Marine Corps experienced, capable and ready, he said.\n\n“I am on internal Marine Corps videos where my face is used to keep Marines in the force, and, yet, here they are they can’t wait to separate me because I won’t bend the knee in political loyalty. It’s a political loyalty test because of my religious convictions and doing the right thing, which I have been trained to do my entire career,” he said.\n\nIn the meantime, the officer said he offered his early retirement, but expects the offer to be denied. If that’s the case, he said he will “start from zero.”\n\n“I have no retirement in place, the GI bill benefits that I’ve earned and hope to pass on to my child will not be available either,” he said. “More importantly though, the choice is if I do not comply and if I separate, I will be separated via either a board of inquiry or a court martial.”\n\n“What that means … is I’m basically admitting fault, I’m admitting that I’m breaking the law and I’ll get off slightly lighter, or I could choose to not comply and it will go to a court martial, which is a federal criminal court, it holds that same weight,” he added. So, if I’m convicted, I will now be a federally convicted felon. All for standing firm in my religious beliefs.”\n\nThe officer said he’s fought the mandate internally and also with the help of Republican California Rep. Darrell Issa.\n\n“I’m from Texas and I’ve got a California Congressman fighting for me,” he said. “And I can’t thank him enough.”\n\nIssa, an Army veteran, who has received two doses and a booster of the Pfizer vaccine, told the DCNF that the mandate will likely affect the future of the military as a whole.\n\n“You can’t replace morale,” Issa said. “We can find bodies. You saw the Democrats voting to expand reserve benefits, they will be expanding active duty benefits to try to bribe people to come into a demoralized military. But, you know, pay does not create morale. No recruiting program takes the place of a seasoned veteran who’s motivated to train hard so we don’t have to fight the next war.”\n\n“This issue is bigger than the men and women who are being dismissed. This is a real question of Constitutional authority, both because of the tradition of these exemptions being ignored, but also because of what we know about the vaccines’ current variant. It’s extremely important to understand that if you have the current variant against the current vaccine is ignoring to a great extent the vaccine. There’s a real question of why is the mandate in place against the current variant. And that’s even if you made the assumption that the mandate was necessary against the Delta variant, would it be medically justified? And it seems like there’s no willingness to consider that any more than there is a willingness to consider the exemptions for even one soldier, sailor, Marine, or airman.”\n\nIssa sent a letter to the Marine Corps Commandant on Jan. 17, demanding to know about the “recent purported approval of religious accommodations to the COVID-19 vaccine mandate.” He’s also part of a group of Republican members of Congress that have asked the House Appropriations Committee to prohibit funding to the military vaccine mandate.\n\nThe three Marines that were granted exemptions were already making their exits from the Corps, according to a Jan. 21 letter to Issa. In the letter, Deputy Legislative Assistant in the Marine Corps’ Office of Legislative Affairs J.J. Daly disclosed that “in two cases, the Marines are on terminal leave and in the other the Marine has transitioned into … a 180-day training program in private industry.”\n\n“Not one single Marine who wants to remain in the Corps has received a religious accommodation. It’s not a coincidence,” Issa spokesman Jonathan Wilcox told the DCNF.\n\nA 17-year Marine Corps officer and combat veteran told the DCNF his request for a religious accommodation has not yet been denied. He said it could be because of the lengthy and complex process, or it could be because he’s separately involved in a federal lawsuit challenging the authorization of the vaccine. He said he expects it will eventually be denied.\n\n“When the official submission was done, I had already done the chaplain interview. He determined that my faith and my beliefs were sincere and I then received negative command endorsements all the way up through the chain of command and then I stopped seeing visibility on it,” he said.\n\n“The vast majority of the people, to include the people that gave me negative recommendations on my religious accommodation, have told me that that they believe in what I’m doing and they’re glad somebody’s standing up,” he explained.\n\nAnother 17-year Marine, who is a triple vaccinated and previously had a breakthrough COVID-19 infection, said that military readiness, the very reason the Pentagon put the mandate in place, is what’s at stake when the corps denies religious exemptions.\n\n“I can’t go out and buy another 17 year major, 18 year chief warrant officer,” he said. “You just can’t replace that experience.”\n\n“The idea that ‘oh, we’ve gotta vaccinate everybody to protect the force’ is a lie because the stomach virus would be more debilitating to the combat power the force could project than COVID would,” he added.\n\nThe mandate, he said, could do more harm than good to the force.\n\n“I do think it gets to the point where you hurt recruiting, you hurt combat power, so eventually it has to come to that conversation to where you know maybe you do have to say ‘hey, look, this is hurting the force way more than it’s helping the force, it’s actually impacting how lethal we can be. To that point, it is a risk to force because now I’m getting rid of Marines that have all this experience and all these years.”\n\nWilcox added that the military, like it has before, should allow for the same process as any other religious accommodation process the military offers to servicemembers.\n\n“All these Marines want is access to the same military process that accommodates Sikhs to wear turbans, Muslims to wear beards, and provides cash to buy meals due to dietary restrictions,” he said. “We got the Marines to admit that isn’t happening.”\n\n“If the goal of the mandate was vaccination, it’s been a success. We don’t understand how the DOD can brag about a 98% vaccination rate and they seek to destroy everyone else. There has to be a better way,” he added.\n\nWilcox concluded that he rejects the notion “that this is about President Biden’s power,” saying rather it’s “about his abuse of power.”", "opengraph": {"locale": "en_US", "type": "article", "title": "DCNF Exclusive: Marines Describe 'Sham' Religious Vaccine Exemption Process - The Stream", "description": "The COVID-19 vaccine exemption process in the Marine Corps gives no consideration to the faiths of individual soldiers and could hamper military readiness,", "url": "https://stream.org/dcnf-exclusive-marines-describe-sham-religious-vaccine-exemption-process/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-02-06T16:00:30+00:00", "article:modified_time": "2022-02-06T13:43:53+00:00", "image": "https://stream.org/wp-content/uploads/67564677_10156087433655194_556988229576818688_n-compressed.jpg", "image:width": "900", "image:height": "600", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I am leading the fight in Congress to end the military COVID vaccine mandate.</p>\n<p>I refuse to stay silent as Biden ends the caeers of thousands and thousands of selfless warriors. <a href=\"https://t.co/z9sktVTifZ\">https://t.co/z9sktVTifZ</a></p>\n<p>— Darrell Issa (@DarrellIssa) <a href=\"https://twitter.com/DarrellIssa/status/1489262946551164941?ref_src=twsrc%5Etfw\">February 3, 2022</a></p></blockquote>\n"], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://dailycaller.com/2022/01/31/canada-ottawa-truckers-protest-covid-19-coronavirus-trudeau/", "https://stream.org/devout-or-extreme-media-treats-catholicism-in-vastly-different-ways-depending-on-politics/dcnf-small-e1561137528596/", "https://www.marines.mil/News/Messages/Messages-Display/Article/2761259/mandatory-covid-19-vaccination-of-marine-corps-active-and-reserve-components/", "https://stream.org/donate/", "https://dailycaller.com/2021/10/08/coast-guard-vaccine-mandate-joe-biden-covid-coronavirus/", "https://dailycaller.com/2022/01/03/navy-covid-19-vaccine-mandate-religious-exemptions/", "https://t.co/z9sktVTifZ", "https://twitter.com/DarrellIssa/status/1489262946551164941?ref_src=twsrc%5Etfw", "https://issa.house.gov/media/press-releases/congressman-issa-questions-marine-commandant-biden-vaccine-mandate", "https://drive.google.com/file/d/1H0X-tODHS84dCnjRmjVPFZVI32euFpPd/view", "https://news.yahoo.com/3-religious-exemptions-granted-military-215852625.html"], "authors": ["Al Perrotta"], "publish_date": "2022-02-06T16:00:30+00:00"}