{"result_id": "306017", "URL": "https://stream.org/tracking-our-vaccine-status-the-road-to-totalitarianism/", "timestamp": "2023-04-25 17:33:31 CEST+0200", "meta": {"description": "We must stand against vaccine passports, digital IDs, social credit systems and Central Bank Digital Currencies.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/tracking-our-vaccine-status-the-road-to-totalitarianism/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Tracking Our Vaccine Status: The Road to Totalitarianism", "cleaned_text": "The CDC, Medicare and Medicaid have introduced ICD (International Classification of Diseases) “diagnosis codes” for being unvaccinated or partially vaccinated for Covid 19, and also for “other under-immunization status.” These new codes, designated ICD-10, quietly went into effect on April 1, 2022, and were broadly adopted nationwide by January 2023, but we are just learning about them now.\n\n“Diagnosis” is a word to designate disease. Is being unvaccinated now considered a disease?\n\nWill medical and health services provided by insurance, Medicare or Medicaid be affected by the patient’s vaccination status?\n\nThis new move cannot be entirely for health reasons. Recent science shows that natural immunity is more robust than that conferred by vaccines. The reality of “breakthrough infections” demonstrates that a person’s vaccination status is not predictive of whether he will contract or spread the disease. If the tracking were for health reasons alone, they would exclude those who are Covid-recovered and have natural immunity.\n\nEven more disturbing, why do the new codes track the reason for being unvaccinated, or being in “Delinquent Immunization Status,” for Covid-19? Some of the reasons include “patient refusal,” or “belief or group pressure.” Will parents who choose not to get the many booster shots now being required for children be penalized for that? Will their children be penalized?\n\nIn my opinion, tracking the Covid-19 unvaccinated is a way to identify “resisters,” people who don’t just go along with the government narrative, who are unmoved by heavy propaganda, who think for themselves and who are willing to take the heat for going against the flow. Many of these people are conservatives and pro-life Christians, some of whom refused the jab because the injections were made using the cells of an aborted fetus. Is the government identifying the unvaxxed in order to characterize them as somehow “unclean,” or selfish, or even “grandma killers”? Will these codes be used to separate the unjabbed from society and ultimately, to persecute them?\n\nFor example, according to a report by Teachers for Choice, unvaccinated teachers in New York City have had their fingerprints and “problem codes” (indicating misconduct) in their personnel files sent to the FBI and the New York Criminal Justice Services. Are they — and others who have refused vaccination and express their reasons for doing so — being set up as purveyors of “disinformation” (a term coined by Stalin) or worse, as domestic threat actors? Tracking immunization status is nothing new, but have those who lack a vaccination other than Covid-19 been treated this way?\n\nICD-10 codes were created by the World Health Organization (WHO), and are maintained by the CDC under WHO authorization. Will WHO receive this information? Will it be shared internationally, including with China? Ultimately, tracking vaccination status could be used as the pretext for requiring internationally interoperable vaccine passports, smart health cards, or other digital IDs.\n\nThe idea for a “good” digital ID was developed with globalist NGOs like George Soros’s Open Society Foundations, and the Rockefeller Foundation. Indeed, the World Bank is promoting a digital ID to assess corporate compliance with the U.N Agenda 2030 17 Sustainable Development Goals. SDG 16.9 calls for, “by 2030, provide legal identity for all, including birth registration.”\n\nAt the November 2022 G20 meeting in Bali, Indonesia, the Declaration, published on the White House website, stated:\n\nIn addition, the WHO is pressing for international vaccine passports. It has already contracted with Deutsche Telekom to create it.\n\nAt the Brink of Total Enslavement\n\nAny mandatory digital ID can give rise to a “social credit system,” a tool the Chinese Communist Party uses for mass surveillance and totalitarian control. Is that the goal? It sure looks that way. According to reports, China’s social credit system has already been used to restrict travel, loans, purchases, applying for jobs, even getting a date.\n\nAnd worse, it provides a means for others to make unsolicited comments about you. In some areas of China, if you call a blacklisted person, you will hear a siren, followed by a warning that the person being called is on the blacklist. In Beijing, a blacklisted person driving through certain intersections may reportedly be identified by facial recognition software and his photo and ID will appear on a large digital billboard. Do we want this dystopian nightmare to come to an intersection near us?\n\nVaccine passports are one of the major vehicles to create an international digital ID. And that effort is well on the way. Indeed, Research and Markets has estimated that the “Worldwide Social Credit Infrastructure” represents a $16.1 billion business opportunity by 2026.\n\nHumanity stands at the brink of total enslavement. We must stand against vaccine passports, digital IDs, social credit systems and Central Bank Digital Currencies. To take action, click HERE.\n\nReggie Littlejohn is President of Women’s Rights Without Frontiers and Co-Chair of the Stop Vaccine Passports Task Force.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tracking Our Vaccine Status: The Road to Totalitarianism - The Stream", "description": "We must stand against vaccine passports, digital IDs, social credit systems and Central Bank Digital Currencies.", "url": "https://stream.org/tracking-our-vaccine-status-the-road-to-totalitarianism/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2023-02-25T00:00:57+00:00", "article:modified_time": "2023-02-24T17:18:44+00:00", "image": "https://stream.org/wp-content/uploads/Totalitarian-edit.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/reggielittlejohn/", "https://stream.org/author/reggielittlejohn/", "http://www.daisurvey.com/StreamWebsite", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=e8a264b595&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=3d2342cab2&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=309ff0d3bf&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=b176949072&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=d2e2f96bc2&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=614f1e0db5&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=7ebbd37d5d&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=3bf1c5f3d2&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=23116c2cf2&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=7504674f31&e=ef6f0ec003", "https://stream.org/donate/", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=2ad25238b1&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=3001665514&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=42ae8b7dfc&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=3e923198ba&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=80fd167d30&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=d5892ce368&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=07452739d4&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=3c79a3fdeb&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=0002933b37&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=25f2ea33bd&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=757e9cda0a&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=89aca1c6b2&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=6fbd8e321d&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=0aadb51a11&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=8eb94c9a5d&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=231ab3b1f1&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=a0bef97b47&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=64051a5e40&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=906e073e0b&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=5b44813e93&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=e76aa8f50c&e=ef6f0ec003", "https://truthpr.us13.list-manage.com/track/click?u=c42848a03537a7f08765c5e4b&id=af66fe8427&e=ef6f0ec003"], "authors": ["Reggie Littlejohn"], "publish_date": "2023-02-25T00:00:57+00:00"}