{"result_id": "306043", "URL": "https://stream.org/my-response-to-john-piper-urging-christians-to-get-vaccinated/", "timestamp": "2023-04-25 17:34:29 CEST+0200", "meta": {"description": "It’s important to look at both sides of the COVID vaccination debate and respect the convictions of both the vaccinated and the unvaccinated.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/my-response-to-john-piper-urging-christians-to-get-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "My Response to John Piper Urging Christians to Get Vaccinated", "cleaned_text": "In response to Pastor John Piper encouraging vaccination, I want to share a very brief video that responded to Pastor Robert Jeffress saying that people have no biblical grounds to reject the vaccine. The video is relevant to both issues, but was removed from YouTube within an hour. You can view it here.\n\nAlthough I appreciate Pastor John’s heart, it’s important to look at both sides, especially in light of the fact that numbers are often skewed and cannot be trusted. For instance, it’s common knowledge that only about 1% of complications from vaccines actually get inputted into the national database that tracks adverse reactions.\n\nAdditionally, can we really trust the numbers coming in about the hospital and death rates of the unvaccinated? Maybe, but we shouldn’t jump right in. We’ve been fooled many times before. Doesn’t the Bible encourage us to use wisdom? Doesn’t it encourage us to be patient and to use discernment?\n\nI love studying microbiology — everything from autophagy to creating energy in the mitochondria — fascinates me. Granted, I’m not an expert on this topic, but I have learned over the years that the medical industry is not always focused on health. That responsibility often falls on our shoulders. Sadly, when we do our own research and question science (by the way, a tenet of science is to question science), the media mocks and scorns us. When Hollywood and the media ban, remove, falsify, and fact-check the other side, that’s a big red flag. Why aren’t they open to opposing views? So much for tolerance.\n\nMost understand that all vaccines come with warnings and cautions and that sometimes, the good outweighs the bad. So why are those wanting to wait for more information scorned and ridiculed? From pericarditis to blood clotting, the side effects are real. Shouldn’t we do our due diligence and investigate, and at least listen to whistleblowers such as Jodi O’Malley?\n\nThe Temple of the Holy Spirit\n\nI asked my doctor, who has been a pro-vaccine physician for 30 years, what his thoughts were. He not only cautioned me against the mRNA but added that he is not seeing any difference between the unvaccinated and the vaccinated as it pertains to their level of sicknesses.\n\nGranted, if you ask nurses and doctors the same question, you will get different responses, but I’ve noticed that those with bias and skin-in-the-game seem to sway the numbers to support their view. This is why I do not trust the death rate numbers. We are told that such and such died of COVID, but how do we know that they wouldn’t have died from the flu or pneumonia? I’m not minimizing even one death, but wisdom encourages us to evaluate what we are being told.\n\nWhen Trump initiated Warp-Speed, there were (and are) good people on the medical teams whose heart is to simply help people, but in the mix, there is also Big Pharma with big agendas. Many people are simply trying to find a balance between wisdom and folly, and faith and presumption.\n\nWisdom also reminds me that our body is the Temple of the Holy Spirit. Things such as mercury (thimerosal) and formaldehyde are added to vaccines to prevent bacteria from building up in the vial, and aluminum was added as an adjuvant to excite the immune system. Mercury was eventually removed, except for in the flu shot. Many products are removed after being approved, thus showing that we don’t always get it right. (I went into more detail about the ingredients in this video.)\n\nAgain, science questions science. Some of the ingredients mentioned earlier occur naturally in our environment, but I’m not sure how wise it is to put them directly into our bloodstream on a regular basis. Because they break through the blood-brain barrier, many even speculate that these types of ingredients could be fueling autism, Alzheimer’s, and dementia. The buildup of neurotoxins in the brain is a very real problem. Granted, the mRNA vaccine has a different list of ingredients, but the ramifications of them are still unclear. Many are simply waiting for more information on something they can’t even pronounce the ingredients for.\n\nWhy is there little, if any talk, about natural immunity? Where is the outcry against the epidemic of obesity and diet-related diseases that are severely taxing our healthcare system? This gives me great pause for concern. Could it be that because it lacks the ability to earn revenue, and, as they say, “a healthy patient is a patient lost”? Granted, I know many wonderful physicians and nurses whose ultimate goal is to help people, but not all of them are educated on health.\n\nThe healthcare mess that we are leaving for our children will not be corrected easily. Poor health, based on lifestyle choices, is taxing the system. Granted, we shouldn’t shame people and discourage them, but we should motivate and encourage them to improve their health. All of my books on health and fitness are available here as free downloads for this very reason.\n\nMost recognize that much of the hysteria on both sides is driven by fear. When I surveyed nurses, most said that half the people visiting the hospitals are there because of fear. We have a real virus on our hands, but fear is causing a lot of people to react instead of respond. The shaming and belittling that is happening is also heartbreaking.\n\nWhether it’s removing a family from a plane because a three-year-old wouldn’t wear a mask, or telling grandparents that they can’t see their grandchildren unless they’re vaccinated, fear is driving a lot of us away from common sense. For example, those who have been vaccinated can still pass the virus on to others. Just this week, a friend of mine said that he believes that his vaccinated wife passed COVID on to him and he ended up in the hospital. Of course, no one knows for certain, but it does beg the question: Do we really know as much as we think we know about the mRNA vaccine?\n\nSo what is the Christian response to all of this? We must respect both convictions. A 67-year-old adult may view the vaccine much differently than the 25-year-old pregnant mom who is concerned about the mRNA affecting her as well as her newborn. I hope that Pastor Piper recognizes that. Most critics are not acting brazenly with a spirit of rebellion (although some are); most I know have compassion for humanity, especially for their own children. A great deal of people are also convicted about the use of fetal tissue.\n\nWhether it’s to see their grandkids, remain on the mission field, or keep their job, solid Christians have sought God in prayer and have decided to get vaccinated. My prayer is that it works for them. I’m not anti-vaccine; I’m for what works. But we also must respect those who feel forced, manipulated, and shamed into taking something they don’t feel good about. Ultimately, it’s unwise to push an agenda: “Wisdom is the principal thing; therefore get wisdom: and with all thy getting get understanding” (Proverbs 4:7). People need hope and we need to point them to the source of hope.\n\nHow do we know that this virus isn’t a judgment to wake us up? Only repentance, not vaccination, will set us free. Take time now, repent and turn your life over to Jesus Christ. That’s the key to ultimate victory.\n\nShane Idleman is the founder and lead pastor of Westside Christian Fellowship in Southern California and the creator of the WCF Radio Network. His program, Regaining Lost Ground, points us back to God and reminds us that although times change, truth does not. His books, blogs, and sermons can all be found at ShaneIdleman.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "My Response to John Piper Urging Christians to Get Vaccinated - The Stream", "description": "It’s important to look at both sides of the COVID vaccination debate and respect the convictions of both the vaccinated and the unvaccinated.", "url": "https://stream.org/my-response-to-john-piper-urging-christians-to-get-vaccinated/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-10-20T22:00:32+00:00", "article:modified_time": "2021-10-20T19:48:03+00:00", "image": "https://stream.org/wp-content/uploads/Vax-edit.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/shaneidleman/", "https://stream.org/author/shaneidleman/", "http://www.daisurvey.com/StreamWebsite", "https://www.christianheadlines.com/contributors/michael-foust/john-piper-urges-christians-get-vaccinated-and-resist-right-wing-pressure-god-alone-owns-you.html?utm_medium=fbpage&utm_source=Facebook&utm_campaign=chupdate&fbclid=IwAR38wRCJYHtXSmKVc5sq1aiKYOJGt90l2wprUHAXNlyNU26Tjv56D8q5lVU", "https://rumble.com/vmskb8-my-response-to-no-credible-biblical-argument-against-the-jab.html", "https://youtu.be/kxk6Uc8nZ7A", "https://rumble.com/vmskb8-my-response-to-no-credible-biblical-argument-against-the-jab.html", "https://stream.org/donate/", "https://westsidechristianfellowship.org/free-ebooks/", "https://wcfradio.org/", "https://shaneidleman.com/"], "authors": ["Shane Idleman"], "publish_date": "2021-10-20T22:00:32+00:00"}