{"result_id": "306009", "URL": "https://stream.org/vaccine-mandates-target-americans-of-faith-and-its-time-for-us-to-take-a-stand/", "timestamp": "2023-04-25 17:33:14 CEST+0200", "meta": {"description": "What happened to individual choice, the rights of businesses and employees to engage in private negotiations and limited government?", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/vaccine-mandates-target-americans-of-faith-and-its-time-for-us-to-take-a-stand/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Vaccine Mandates Target Americans of Faith, and It’s Time for Us to Take a Stand", "cleaned_text": "There’s been an outcry across America in response to President Biden’s incredible COVID-19 vaccine mandate overreach, and rightly so: what happened to individual choice, the rights of businesses and employees to engage in private negotiations and limited government?\n\nBut for people of faith, what’s even more concerning is how President Biden’s Surgeon General, Dr. Vivek Murthy, made clear his mistrust of religious exemptions for the vaccine. Any person who says their faith prevents them from taking the vaccine in good conscience must be “monitored,” according to Dr. Murthy, to weed out supposedly ingenuine claims.\n\nAs Christians, Dr. Murthy’s words should be deeply alarming. The Biden administration is making itself judge and jury on who gets a religious exemption and who doesn’t, whose beliefs are “sincerely held” and whose aren’t. “Unfortunately, as a country, we have experience in dealing with exemptions,” he said. Unfortunate, isn’t it, how religious liberty stands in the gap to protect Americans from government tyranny?\n\nNow local government officials are taking the cue from Biden’s administration, Mayor Bowser in Washington D.C. just announced that city employees’ religious exemption requests will be “reviewed vigorously.”\n\nThis isn’t the first-time people of faith have seen discrimination by government entities during the pandemic. California closed churches in early 2020, until a Supreme Court decision defended religious liberty — pointing out that regulations targeted churches more so than movie and TV studios.\n\nIn April 2020, New York City mayor Bill de Blasio went with police to disperse a crowd of Orthodox Jews gathered for a rabbi’s funeral in Williamsburg, Brooklyn. His Tweet addressed the “Jewish community,” reading in part, “I have instructed the NYPD to proceed immediately to summons or even arrest those who gather in large groups.”\n\nYet de Blasio issued no such threats to protesters gathering in the streets after the death of George Floyd.\n\nWhile de Blasio issued a months-late apology for targeting the Orthodox Jewish community, the state of New York learned little from his experience. In its own vaccine mandate, the legislature didn’t even provide an option for religious exemption, despite many Orthodox Jews expressing hesitancy about the vaccine.\n\nIt’s not just government agencies, either — corporations now believe they have the authority to target the convictions of religious employees. In Arkansas, a hospital chain is forcing any employee claiming a religious exemption to “prove it,” and United Airlines announced any employee claiming a religious exemption to the COVID-19 vaccines will be placed on unpaid leave.\n\nThis skepticism of personal religious beliefs is a new phenomenon. Until recently, faith played a central role in America, and enjoyed protections under our Constitution and laws.\n\nReligious liberty is not theoretical; Supreme Court rulings show it has real policy implications. In 2014, justices ruled Hobby Lobby, a privately held company, should have the freedom to not provide free abortifacients to its employees. In 2020, the Supreme Court doubled down on its 2012 ruling that religious schools have the right to hire and terminate educators without interference from the government.\n\nAs the Court has recognized time and again, faith — and the faithful — matter in America.\n\nWhile these Americans should never have to “prove” the sincerity of their beliefs to a skeptical audience, many already are.\n\nSincerely Held Religious Beliefs and Those Who Follow Theirs\n\nAndrew Kurtyko, a registered nurse in New York who previously lived under Communism, says his Catholic beliefs prohibit him from taking a vaccine associated with production and testing with the cells of aborted babies. He’d rather move than take it.\n\nAn assistant coach for the Navy Football team resigned because the Navy refused to honor his request for a religious exemption.\n\nA Christian singer’s performance at an NFL game was canceled by the NFL because she was unvaccinated.\n\nAre these Americans’ beliefs — for which they’re willing to sacrifice their jobs and their homes — “sincerely held” enough for Mr. Biden? Do we really want to live in a country where the government is so oppressive, it demands “proof” of Americans’ faith?\n\nRules for Thee, Not for Me\n\nMost distastefully, the politicians monitoring religious Americans for their compliance are writing loopholes ensuring their allies are not subjected to the blanket mandate. Due to collective bargaining agreements, unions — huge donors to Biden’s campaign — may be exempt. In April of this year, House Speaker Nancy Pelosi defended Congress’ lack of a mandate, calling the decision to get vaccinated a “matter of privacy.” As usual, rules for thee and not for me.\n\nWe’re not asking for a free-for-all. Religious exemptions can’t be employed without reason, as the Third Circuit Court of Appeals determined a few years ago for a hospital employee making medical arguments against the flu vaccine, not faith-based ones.\n\nAmericans of faith are not asking for a blanket panacea; we are asking to be treated with the same respect and deference as afforded previous generations of Americans, and as demanded by the Constitution.\n\nDespite the Constitutional precedent — and the Supreme Court’s call for equal protection, respecting faithful Americans, and protecting religious liberty — tyrants all over America continue to treat us with undue skepticism and scrutiny. Enough.\n\nIt is time for us to unite in defense of our God-given liberty, and resist tyrannical hypocrisy coming from all sides. Perhaps this is our Esther moment. Perhaps God placed us here for such a time as this.\n\nDave Kubal is the President of Intercessors for America.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Mandates Target Americans of Faith, and It’s Time for Us to Take a Stand - The Stream", "description": "What happened to individual choice, the rights of businesses and employees to engage in private negotiations and limited government?", "url": "https://stream.org/vaccine-mandates-target-americans-of-faith-and-its-time-for-us-to-take-a-stand/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-09-30T15:00:02+00:00", "article:modified_time": "2021-09-30T13:46:19+00:00", "image": "https://stream.org/wp-content/uploads/iStock-665515600-1.jpg", "image:width": "900", "image:height": "552", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://www.foxnews.com/health/surgeon-general-monitor-vaccine-exemptions", "https://wjla.com/news/local/dc-workers-requesting-religious-exemption-vaccination-dc-fire-ems", "https://www.npr.org/2021/02/06/964822479/supreme-court-rules-against-california-ban-on-in-person-worship-amid-the-pandemi", "https://nypost.com/2020/04/29/de-blasio-slammed-over-tweets-about-massive-brooklyn-funeral/", "https://www.npr.org/2021/04/22/988812635/how-israel-persuaded-reluctant-ultra-orthodox-jews-to-get-vaccinated-against-cov", "https://www.beckershospitalreview.com/workforce/prove-it-hospital-asks-unvaccinated-employees-claiming-religious-exemption.html", "https://embryo.asu.edu/pages/burwell-v-hobby-lobby-2014", "https://embryo.asu.edu/pages/burwell-v-hobby-lobby-2014", "https://apnews.com/article/joe-biden-health-religion-los-angeles-arkansas-3ba53f2f00e1ab7105d7d128f2b1e65d", "https://www.uspresidentialelectionnews.com/2021/09/more-troubling-exemptions-from-bidens-covid-vaccine-mandate/", "https://nypost.com/2021/04/29/nancy-pelosi-will-not-mandate-lawmakers-to-get-vaccinated/", "https://stream.org/donate/", "https://www.laborandemploymentlawcounsel.com/2018/01/no-religious-bias-against-hospital-employee-who-refused-to-get-flu-shot/"], "authors": ["Nancy Flory"], "publish_date": "2021-09-30T15:00:02+00:00"}