{"result_id": "306030", "URL": "https://stream.org/the-cell-lines-used-for-covid-19-vaccines-came-from-carefully-planned-abortions-not-miscarriages/", "timestamp": "2023-04-25 17:34:02 CEST+0200", "meta": {"description": "Fr. Nicanor Austriaco made a nonsense claim that the cell line used by coronavirus vaccine developers may have come from a miscarried child.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-cell-lines-used-for-covid-19-vaccines-came-from-carefully-planned-abortions-not-miscarriages/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Cell Lines Used for COVID-19 Vaccines Came from Carefully Planned Abortions, Not Miscarriages", "cleaned_text": "Editor’s note: Some may find the discussion of abortion, miscarriage and post-mortem cell death disturbing.\n\nIn an article published last year, M.I.T.-trained scientist Fr. Nicanor Austriaco passed along speculation that the HEK-293 cell line may have been developed using tissue from a miscarriage. This cell line is in the news because it has played a role in the development and/or testing of the three vaccines currently authorized for emergency use for COVID-19.\n\nThe point of Fr. Austriaco’s conjecture, I presume, was to reduce worry that this cell line started with an abortion. But worry we should.\n\nThis conjecture seems to have become a full-fledged rumor. In recent months, many Catholics and other Christians have cited that rumor when defending these vaccines.\n\nBut the rumor, to put it bluntly, is nonsense.\n\nThere’s nothing in the scientific literature dealing with this claim, and for good reason. No competent biologist would even try to establish a living cell line from dead tissue.\n\nThis fact becomes clear when we examine two things:\n• The biological process of miscarriage and stillbirth\n• Post-mortem changes at the cellular level\n\nTake the first point. A mother’s body tends to expel tissues related to pregnancy between four and twenty days following fetal demise. Most spontaneous abortions in early pregnancy (1st trimester) are caused by abnormalities in the chromosomes. In these cases, an embryo does not form. What tissue is expelled would be useless for establishing a cell line.\n\nThe other causes of miscarriage and stillbirth result in the death of the embryo or fetus. This demise happens several days to a few weeks before the expulsion of tissue. (See here for more.)\n\nThat time gap is critical, and bears on the second point.\n\nWhen an embryo or fetus dies, its cells change fast. Autolysis begins within minutes after the vital functions of the brain, heart and lungs cease. This is a process of decomposition or “self-digestion,” where the cell membranes break down and release enzymes. Since oxygenated blood has ceased to circulate, the levels of carbon dioxide in the cells begin to rise and the pH within cells becomes ever more acidic. This rising acidity causes membranes within the cell to rupture. This includes the membrane of the lysosome, which contains a variety of enzymes for the digestion of nucleic acids, fats, proteins, and so forth.\n\nThe rate of autolytic spread varies throughout the organism. Two of the main variables are the concentration of enzymes in the type of tissue and its temperature. Some organ tissues have relatively high concentrations of enzymes. The liver, kidneys and pancreas are examples, given their functions within the body. Smooth muscle tissue and lung tissue, in contrast, have relatively low levels of these enzymes. This is key, since researchers seek organ tissue as the source of cells for a cell line.\n\nScientists can’t reverse this process. As a result, they can’t establish a living cell line using the tissues expelled from a miscarriage or stillbirth.\n\nTemperature is also a major factor in miscarriage, since it has the greatest impact on the spread and progress of autolysis. The higher the temperature, the faster the autolytic reaction. Very low temperatures can slow the autolytic process dramatically, which explains how people have been revived after apparently drowning in very cold water, suffering no permanent ill effects.\n\nIn the case of a miscarriage or stillbirth, the temperature of the expired fetus remains at core body temperature inside its mother until it is expelled. This warm setting speeds up the progress and spread of autolysis.\n\nNow, recall that the time between the fetal demise of a miscarriage and expulsion of the pregnancy tissues is measured in days. That means that by the time the tissue is expelled, there is no metabolic function anywhere in the fetal body. In fact, the expired fetus goes through a process of maceration (autolytic fermentation) prior to expulsion. This has the appearance of putrefaction: The skin separates and the tissue underneath becomes darkly discolored — though putrefaction is bacterial decomposition, whereas the amniotic sac is a sterile environment.\n\nThese are gory details of course. But they should make it clear why scientists would not use tissue from a miscarriage to establish a living cell line.\n\nBut what about perfectly-timed fetal death and then delivery in a hospital? Could that provide material for a living cell line? Almost certainly not. In fact, even a run-of-the-mill abortion probably wouldn’t suffice. For research purposes, fetal tissue must be harvested and cooled within minutes of the abortion. The scientific literature strongly implies that the abortions are carefully coordinated with tissue harvesting. One gets the clear sense that the abortion and the harvesting of the desired tissue were planned to preserve the integrity of the tissue.\n\nIn summary, establishing a living cell line from dead tissue is not possible. The cell lines used to test and/or develop the available COVID-19 vaccines came from abortion and deliberate planning, not spontaneous miscarriage or stillbirth. Resurrection of the dead requires far more than a medical degree or a PhD. It requires the direct power of God.\n\nJosé L. Trasancos, Ph.D. is the President of the Board and Chief Executive Officer of Children of God for Life. He is delighted and blessed to be working there alongside his wife, Stacy, advancing pro-life causes, advocating for the preservation of human dignity and fighting to end the use of aborted fetal tissue in science and commerce. José and Stacy live in Hideaway, Texas, surrounded by their five children, one granddaughter (one of six grandchildren), two German Shepherds and a Bassett Hound.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Cell Lines Used for COVID-19 Vaccines Came from Carefully Planned Abortions, Not Miscarriages - The Stream", "description": "Fr. Nicanor Austriaco made a nonsense claim that the cell line used by coronavirus vaccine developers may have come from a miscarried child.", "url": "https://stream.org/the-cell-lines-used-for-covid-19-vaccines-came-from-carefully-planned-abortions-not-miscarriages/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-04-30T11:00:51+00:00", "article:modified_time": "2021-04-30T16:08:21+00:00", "image": "https://stream.org/wp-content/uploads/iStock-515648076-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/jose-l-trasancos/", "https://stream.org/author/jose-l-trasancos/", "http://www.daisurvey.com/StreamWebsite", "https://www.thepublicdiscourse.com/2020/05/63752/", "https://stream.org/would-you-take-a-vaccine-based-on-mengeles-nazi-experiments-should-the-government-force-you/", "https://blog.utp.edu.co/doctorgaviria/files/2015/11/Obstetrics-Ginecology-ACOG.pdf", "https://www.merckmanuals.com/en-ca/professional/gynecology-and-obstetrics/abnormalities-of-pregnancy/spontaneous-abortion", "https://www.scientificamerican.com/article/experts-cell-metabolism-after-death/", "https://www.ncbi.nlm.nih.gov/books/NBK539741/", "https://stream.org/donate/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5152558/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "https://cogforlife.org/"], "authors": ["José L. Trasancos"], "publish_date": "2021-04-30T11:00:51+00:00"}