{"result_id": "306015", "URL": "https://stream.org/twitter-suspends-account-of-prominent-vaccine-scientist-and-skeptic/", "timestamp": "2023-04-25 17:33:26 CEST+0200", "meta": {"description": "Twitter suspended the account of Dr. Robert W. Malone, a prominent scientist and virologist instrumental in developing mRNA vaccine technology who has been criticized for his skepticism of the COVID-19 vaccines’ safety.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/twitter-suspends-account-of-prominent-vaccine-scientist-and-skeptic/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Twitter Suspends Account of Prominent Vaccine Scientist and Skeptic", "cleaned_text": "Twitter suspended the account of Dr. Robert W. Malone, a prominent scientist and virologist instrumental in developing mRNA vaccine technology who has been criticized for his skepticism of the COVID-19 vaccines’ safety.\n\n“We all knew it would happen eventually. Today it did,” Malone wrote on his Substack blog Wednesday, saying the suspension was permanent. “Over a half million followers gone in a blink of an eye.”\n\nMalone’s account, @RWMaloneMD, is no longer active and has been labeled with an “account suspended” notice. Twitter did not immediately respond to the Daily Caller News Foundation’s request for comment on why the account was suspended.\n\nMalone contributed to the development of mRNA vaccine technology, performing an experiment as a graduate student at the Salk Institute for Biological Studies in which he blended strands of mRNA with fat droplets which, when applied to human cells, caused the cells to start producing proteins, Nature reported. Malone hypothesized that this newfound technology could be used to treat illnesses as a drug.\n\nDuring the COVID-19 pandemic, Malone attracted criticism for allegedly spreading misinformation, both on his Twitter account and in public appearances, about mRNA vaccines used to treat COVID-19. Malone’s commentary included questions about the safety of the vaccines for children and young adults.\n\nRecent posts on his blog suggest a link between athletes dying from heart illnesses and vaccination.\n\nU.S. health officials have pushed back on such suggestions, and the Centers for Disease Control and Prevention (CDC) consider the vaccines safe.\n\n“I do believe that the short cuts that the USG have taken in bringing the mRNA and the adenovirus vaccines to market for this pandemic have been detrimental and contrary to globally accepted standards for developing and regulating safe and effective licensed products,” Malone wrote on his website.\n\nOther prominent vaccine skeptics, including former New York Times columnist Alex Berenson, have been permanently suspended from Twitter for violating the site’s COVID-19 misinformation policy.\n\n“Tomorrow I am on the Joe Rogan show,” Malone said in his Wednesday blog post regarding his suspension from Twitter.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected]", "opengraph": {"locale": "en_US", "type": "article", "title": "Twitter Suspends Account of Prominent Vaccine Scientist and Skeptic - The Stream", "description": "Twitter suspended the account of Dr. Robert W. Malone, a prominent scientist and virologist instrumental in developing mRNA vaccine technology who has been criticized for his skepticism of the COVID-19 vaccines’ safety.", "url": "https://stream.org/twitter-suspends-account-of-prominent-vaccine-scientist-and-skeptic/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-12-30T16:38:11+00:00", "image": "https://stream.org/wp-content/uploads/Robert-Malone-Twitter-account.jpeg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://rwmalonemd.substack.com/p/permanently-suspended-on-twitter", "https://twitter.com/RWMaloneMD", "https://www.nature.com/articles/d41586-021-02483-w", "https://www.theatlantic.com/science/archive/2021/08/robert-malone-vaccine-inventor-vaccine-skeptic/619734/", "https://stream.org/donate/", "https://rwmalonemd.substack.com/p/were-never-going-to-learn-about-how", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety.html", "https://www.rwmalonemd.com/", "https://thehill.com/homenews/media/569908-twitter-bans-conservative-author-Alex-Berenson", "/cdn-cgi/l/email-protection#a2cecbc1c7ccd1cbccc5e2c6c3cbcedbc1c3cecec7d0ccc7d5d1c4cdd7ccc6c3d6cbcdcc8ccdd0c5"], "authors": ["Aliya Kuykendall"], "publish_date": "2021-12-30T16:38:11+00:00"}