{"result_id": "306033", "URL": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-i-a-freezer-full-of-murder-victim-sandwiches/", "timestamp": "2023-04-25 17:34:07 CEST+0200", "meta": {"description": "There's something profoundly sinister about a global, elite conspiracy to hijack our medical autonomy, and make us all complicit in abortion.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-i-a-freezer-full-of-murder-victim-sandwiches/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Vaccine Is a Toxic Sacrament of Globalism, Paternalism, and Abortion, Part I: A Freezer Full of Murder Victim Sandwiches", "cleaned_text": "I’ll be completely straight with you. I don’t just oppose vaccine mandates, though of course I do. I oppose the COVID vaccines themselves, because every one of them is intimately and proximately linked to the gravest evil imaginable: the ongoing murder of the innocent. Without such murders, and the abuse of human remains, these vaccines wouldn’t exist. Our own NIH is paying doctors to perform more abortions, on intact babies with beating hearts, to harvest still more organs for COVID research. Today. See The Stream’s five-part expose revealing all this, with links to the medical articles and lab catalogs selling human-mouse organ “sandwiches.”\n\nI don’t think such vaccines should be mandatory. Or even voluntary. They shouldn’t be legal, any more than it’s legal to sell the organs stolen from Chinese political prisoners. (That’s why China sells them on the black market instead.) Our government, which allows abortion and even funds it, promoting a vaccine made from aborted babies is exactly and perfectly parallel to the Nazi government making vaccines out of Ann Frank’s DNA while the death camp ovens still smoldered.\n\nOne Betrayal Leads to the Next\n\nGeorge W. Bush betrayed the pro-life movement when he approved the use of “already-aborted” embryonic stem cells in 2001, and the pro-life leaders who stayed mum back then proved themselves opportunists or cowards. The U.S. bishops were right in 2019 when they warned Donald Trump against producing such vaccines, and wrong in 2020, when they flipped because Pope Francis snapped his fingers once Biden was safely elected. (And yes, I also blame Trump for not insisting on at least one pro-life vaccine alternative.)\n\nThough I’m in a higher risk group for COVID (because I’m overweight, which is my fault, not the fault of some aborted kid), I decided early on: I would much rather die of COVID than profit from abortion. I won’t say that’s the bare minimum appropriate Christian stance. But it’s what my conscience demands.\n\nThe Cannibalism Loophole: Smaller Than You Think\n\nThe right way to think about medicines that could not exist without abortion is to treat them like flesh taken from the body of a murder victim. If you’re in a prison camp on the brink of starving, and the only nourishment available is some fellow prisoner shot by the guards, you may reluctantly use his murdered flesh to avoid imminent death. This “cannibalism loophole” is the only way that Christian ethicists have managed to make an even plausible case that abortion-tainted vaccines are morally acceptable.\n\nBut the logic doesn’t flow. You’re not in danger of imminent death from COVID. Instead, you’re considering taking an experimental gene therapy for a disease that 1) You might not catch, and 2) Is rarely fatal and 3) Can be treated by safe, ethical medicines.\n\nNo, taking the COVID vaccine to raise your odds of surviving the pandemic is more like filling your freezer with murder victim sandwiches, in case there should be a famine. I know that many good Christian people were unaware of these brute facts, and got jabbed early on. I’m not here to condemn them. But it’s time to stop candy-coating the unappetizing truth.\n\nIn reality, there’s just one situation where the cannibalism loophole applies to abortion-tainted medicine: If you are actually gravely sick with a disease like COVID, and have tried other innocent therapies (Ivermectin, Hydroxychloroquine, etc), and none of them are working. At that point, when you are in imminent mortal danger, you might reluctantly and under protest take a medicine (not a “vaccine”) that is tainted by abortion, such as the leading variety of monoclonal antibodies. Even then, you wouldn’t be obligated to do so, and the more heroic choice would be to refuse.\n\nThis is how bad it is. This is the monstrosity that our government is wielding all its brute force to impose on our consciences and our bodies.\n\nWe Are All Lab Rats Now\n\nNow, beyond the moral horror of the vaccines’ origins in abortion, there are serious health concerns about rushed products released on the public without safety testing, by huge pharmaceutical companies totally immune to lawsuits. These billionaires and their public health enablers like Anthony Fauci and Francis Collins, are treating the global population as lab rats, and trashing the reputations of eminent doctors who disagree.\n\nYet strangely, these technocratic researchers don’t want a “control” group of unvaccinated even to exist. We must be squeezed by every means fair and foul to comply, comply, comply. Even some of our churches are demanding we get the “Mark of the Best” on our bodies, as the price of entering a church or attending a seminary. Meanwhile, dying patients whose families want to even try alternative therapies such as Ivermectin are getting their wishes flouted by hospitals. This despite growing research and real-world case evidence of such medicines’ effectiveness.\n\nIf you don’t think there’s something profoundly sinister going on, you’re not paying attention. In Part II, I’ll try to unfold precisely what I think lies behind the desperate rush to make COVID vaccines the only legally and medically possible response to this Chinese bioweapon unleashed on the world.\n\nSee Part Two here.\n\nJohn Zmirak is a senior editor at The Stream and author or co-author of ten books, including The Politically Incorrect Guide to Immigration and The Politically Incorrect Guide to Catholicism. He is co-author with Jason Jones of “God, Guns, & the Government.”", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccine Is a Toxic Sacrament of Globalism, Paternalism, and Abortion, Part I: A Freezer Full of Murder Victim Sandwiches - The Stream", "description": "There's something profoundly sinister about a global, elite conspiracy to hijack our medical autonomy, and make us all complicit in abortion.", "url": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-i-a-freezer-full-of-murder-victim-sandwiches/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-12-29T18:00:37+00:00", "article:modified_time": "2022-01-20T02:34:28+00:00", "image": "https://stream.org/wp-content/uploads/Freezer-Sandwiches-e1640738248221.jpg", "image:width": "900", "image:height": "473", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "five-part expose", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/johnzmirak/", "https://stream.org/author/johnzmirak/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/the-abortion-ties-of-the-covid-vaccines-a-deal-killer-or-no-big-deal/", "https://stream.org/to-save-ourselves-from-covid-were-sacrificing-children-part-3-more-baby-parts-are-needed-all-the-time/", "https://stream.org/tag/sacrificingchildren/", "https://stream.org/the-vaticans-alliance-with-china-more-evil-than-we-thought/", "https://stream.org/would-you-take-a-vaccine-based-on-mengeles-nazi-experiments-should-the-government-force-you/", "https://stream.org/profile-in-cowardice-how-catholic-leaders-botched-the-abortion-linked-covid-vaccines/", "https://stream.org/innocent-as-serpents-wise-as-doves-americas-church-leaders-and-the-covid-vaccine-betrayal/", "https://stream.org/to-save-ourselves-from-covid-were-sacrificing-children-part-v/", "https://stream.org/donate/", "https://amgreatness.com/2021/12/23/anatomy-of-a-quick-decisive-takedown/", "https://stream.org/they-dont-care-how-many-die-the-branch-covidians-want-power/", "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-ii-our-fascist-moment/", "https://stream.org/author/johnzmirak/", "https://www.amazon.com/Politically-Incorrect-Guide-Immigration-Guides/dp/1621576736", "https://www.amazon.com/Politically-Incorrect-Guide-Catholicism/dp/1621575861", "https://stream.org/secondamendment/"], "authors": ["John Zmirak"], "publish_date": "2021-12-29T18:00:37+00:00"}