{"result_id": "306036", "URL": "https://stream.org/new-vaccine-science-shows-mandates-are-unwise/", "timestamp": "2023-04-25 17:34:14 CEST+0200", "meta": {"description": "New scientific findings in the Lancet Infectious Diseases journal blow a hole in the argument that workers need to get vaccinated to protect those around them.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/new-vaccine-science-shows-mandates-are-unwise/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "New Vaccine Science Shows Mandates are Unwise", "cleaned_text": "New scientific findings in the prestigious Lancet Infectious Diseases journal blow a hole in the argument that workers need to get vaccinated to protect those around them. The findings prove the foolishness of forcing police and other public employees to get jabbed or lose their pay. And President Joe Biden should retract his order to the Occupational Safety and Health Administration to compel large employers to mandate vaccines.\n\nThe journal reported Thursday that COVID-19 vaccines have “minimal” impact on preventing transmission of the delta strain. Delta is the COVID strain currently causing over 99% of U.S. cases.\n\nVaccines protect the people getting the shots from serious illness, but they don’t stop the delta variant from spreading to others.\n\nDon’t get me wrong. Americans should choose to get vaccinated. The key word is “choose.” Though shots are no guarantee against getting infected and spreading it to others, they provide significant protection (90% or more) against hospitalization and death. I’m triple jabbed.\n\nChoosing not to get vaccinated is choosing to risk your own life. The health risk to others is minimal.\n\nMost vaccines — against polio, smallpox, measles and other diseases — prevent infection and spread. But not COVID-19 vaccines. Now that the battle is against the delta variant, they’ve become disease-tamers rather than infection preventers.\n\nTell that to Mayor Bill de Blasio, who gave New York City employees until Monday to get at least one shot or be sent home without pay. As of Monday, 9,000 are on unpaid leave because they have refused the shots. Twenty FDNY companies were shuttered because many of New York’s bravest refuse the vaccine. Police Commissioner Dermot Shea claims the mandate will not further diminish the number of New York’s finest on the street. That remains to be seen.\n\nGovernors and mayors from Maine to Los Angeles are demanding that public employees, and even nurses and doctors, hailed just months ago as heroes, get vaxxed or go without a job.\n\nPoliticians Don’t Keep Up With the Science\n\nMaine Gov. Janet Mills says, “just as vaccination defeated smallpox and vaccination defeated polio, vaccination is the way to defeat COVID-19.” Sorry, Governor, but you don’t know what you’re talking about.\n\nJust as politicians don’t read the bills before voting on them, they don’t keep up with science but still want to tell the rest of us what to do.\n\nThe groundbreaking findings in Lancet show that fully vaccinated people who came down with COVID infected others in their household at the same rate (about 25%) as unvaccinated people did (about 23%). The vaccinated had just as much viral load in their upper respiratory tract, making them just as contagious. “Our findings show that vaccination alone is not enough to prevent people from being infected with the delta variant and spreading it,” study co-author Ajit Lalvani said.\n\nThe British researchers also found that vaccinated people were only somewhat less likely to contract the virus (25%) compared with the unvaccinated (38%). That conflicts with Centers for Disease Control and Prevention data showing the vaccinated are far less likely to contract COVID.\n\nOne thing is for sure: The science is uncertain on this. So, government should not be using a heavy hand to impose mandates claiming to make workplaces safer.\n\nMeanwhile, the White House is pressing large companies to mandate vaccinations and calling on OSHA to enforce that policy with hefty penalties. The Build Back Better bill increases the penalties tenfold to as much as $700,000 per incident for hazardous conditions, threatening bankruptcy for all but the largest enterprises. The Biden administration expects to publish the rules in the Federal Register in the coming days, affecting about two-thirds of the private sector workforce.\n\nYet the new science undercuts OSHA’s claim that unvaccinated people are a workplace hazard. So far, workplace mandates have been challenged at least 39 times in federal courts with little success, but the new scientific evidence may change that.\n\nLancet Infectious Diseases stressed the urgency of improving current vaccines or developing new ones to actually “protect against asymptomatic infections and onward transmission.”\n\nFoolishly, the Biden administration and Democrats in Congress vilify the vaccine developer Moderna for making a profit and threaten to seize its patents. It’s possible COVID will continue morphing into new variants, requiring new vaccines from companies like Moderna.\n\nWhen you’re fighting a war — in this case, against a killer disease — attacking your own ammunitions maker is no way to win it.\n\nBetsy McCaughey is a former lieutenant governor of New York and author of The Next Pandemic, available at Amazon.com. Follow her on Twitter @Betsy_McCaughey. To find out more about Betsy McCaughey and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Vaccine Science Shows Mandates are Unwise - The Stream", "description": "New scientific findings in the Lancet Infectious Diseases journal blow a hole in the argument that workers need to get vaccinated to protect those around them.", "url": "https://stream.org/new-vaccine-science-shows-mandates-are-unwise/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-11-04T09:00:49+00:00", "article:modified_time": "2021-11-03T23:02:10+00:00", "image": "https://stream.org/wp-content/uploads/iStock-1253358164-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/betsymccaughey/", "https://stream.org/author/betsymccaughey/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/donate/"], "authors": ["Betsy McCaughey"], "publish_date": "2021-11-04T09:00:49+00:00"}