{"result_id": "306007", "URL": "https://stream.org/the-cdc-finally-admitted-the-science-on-natural-immunity-why-did-it-take-so-long/", "timestamp": "2023-04-25 17:33:08 CEST+0200", "meta": {"description": "The CDC is late to the party admitting the science on natural immunity. Many Americans have suffered because of it.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-cdc-finally-admitted-the-science-on-natural-immunity-why-did-it-take-so-long/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The CDC (Finally) Admitted the Science on Natural Immunity. Why Did It Take So Long?", "cleaned_text": "In August 2021 Science Magazine, a peer-reviewed academic journal of the American Association for the Advancement of Science, highlighted groundbreaking research out of Israel that upended the public health establishment.\n\nThe research, which relied on a database enrolling some 2.5 million Israelis and was led by Tal Patalon, head of the KSM Research and Innovation Center at Maccabi Healthcare Services, and deputy Sivan Gazit, found that previous infection from COVID-19 conferred considerably stronger and longer-lasting protection against the Delta variant than vaccines.\n\n“The newly released data show people who once had a SARS-CoV-2 infection were much less likely than never-infected, vaccinated people to get Delta, develop symptoms from it, or become hospitalized with serious COVID-19,” Science staff writer Meredith Wadman noted.\n\nWadman also noted that the research showed that “never-infected people who were vaccinated in January and February were, in June, July, and the first half of August, six to 13 times more likely to get infected than unvaccinated people” who had previously had COVID.\n\n“It’s a textbook example of how natural immunity is really better than vaccination,” Charlotte Thålin, a physician and immunology researcher at Danderyd Hospital and the Karolinska Institute, told Science.\n\nThe timing of these findings was important.\n\nIn the summer of 2021, many countries across the world, as well as U.S. cities, were in the process of implementing vaccine passports. Other governments, at the national, state, and local level, were considering coercive measures to compel people to get vaccinated, an ethically dubious policy that runs against a basic human right: bodily autonomy.\n\nThe results of the Israel study should have caused public health officials to reconsider these policies. Harvard Medical School professor Martin Kulldorff observed that the findings seemed to destroy the rationale for vaccine mandates.\n\n“Prior COVID disease (many working class) provides better immunity than vaccines (many professionals),” wrote Kulldorff, an epidemiologist and biostatistician who has studied infectious diseases for decades, “so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical.”\n\nDespite these findings and other clear and compelling evidence that natural immunity offered powerful protection against COVID, governments continued to pass and enforce mandates.\n\nIn December, President Biden imposed stringent vaccine rules for federal workers, corporations, and health care workers that CNN estimated could apply to 100 million Americans.\n\n“We have the tools to combat the virus if we come together to use those tools,” Biden said.\n\nThe policy meant that many U.S. workers would be fired if they didn’t get vaccinated, even if they previously had COVID. (It’s worth noting that while campaigning for president, Biden said “I don’t think [vaccination] should be mandatory. I wouldn’t demand it to be mandatory.”)\n\nWhile the Supreme Court blocked parts of Biden’s vaccine order, other portions of it are still in effect. Moreover, numerous states and local governments also passed coercive vaccination policies because of recommendations from the CDC.\n\nNine months later, the CDC is singing a very different tune.\n\nUpon releasing new pandemic guidelines last week, CDC epidemiologist Greta Massetti explained to reporters what many have been saying for more than a year: both vaccines and prior infection offer protection from severe symptomatic COVID.\n\n“Both prior infection and vaccination confer some protection against severe illness,” Massetti told reporters. “And so it really makes the most sense to not differentiate with our guidance or our recommendations based on vaccination status at this time.”\n\nBecause of this, the CDC’s new guidelines treat vaccinated and unvaccinated people the same. Less than a year after declaring COVID “a pandemic of the unvaccinated,” the Biden administration is building a midterm campaign around the “triumphant return to normalcy,” The Atlantic reports.\n\nWe should be grateful that the CDC’s policies have finally caught up to the science, and that state epidemiologists are now recognizing the basic “textbook” science of natural immunity.\n\nHowever, the change also invites questions, the most important one being, Why did it take so long?\n\nWe had compelling scientific evidence more than a year ago that people with natural immunity were far less likely to develop symptomatic COVID with the illness than vaccinated people who never had the disease.\n\nYet Americans who were unvaccinated were fired, shamed, and ostracized because public health officials refused to acknowledge then what they acknowledge today: natural immunity protects humans. So why did it take a year for public health officials to acknowledge the “textbook science”?\n\nThere’s no easy answer to this question. One hypothesis is that the government created perverse incentives, what critics of the government’s approach such as Stanford epidemiologist Dr. Jay Bhattacharya call “the COVID Industrial Complex.”\n\n“We’ve created an interest group to keep the pandemic going,” Bhattacharya said in a recent interview with British journalist Lucy Johnston.\n\nThis might sound cynical, but economics teaches us to look at politics without romance.\n\nPfizer has a market cap of $275 billion, and from March 2020 to December 2021 its stock price more than doubled — from $26.04 a share to $59.48. Moderna’s growth was even more impressive. Prior to the pandemic, its stock traded at $19. By September 2021 its share price had eclipsed $449, an increase of more than 2,000 percent.\n\nIt’s not an exaggeration to say that billions of dollars were at stake over whether COVID vaccines were mandatory or voluntary, which might explain why Pfizer alone spent more than $10 million lobbying in 2021 and even more in 2020.\n\nTo suggest that something as crude as financial incentives could have played a role (even a small one) in COVID policy might shock people, but it’s important to remember that forcing people to buy or use goods (ostensibly for their own benefit) is a tried and true tactic of crony capitalism.\n\nWhen people think of crony capitalism, they often think of government grants to mega-corporations, but this is hardly the only method Big Government and Big Business use to advantage themselves.\n\nThe nineteenth century French economist Frédéric Bastiat once observed that “the state is the great fictitious entity by which everyone seeks to live at the expense of everyone else.” Unlike common brigands, street robbers or marauders, however, Bastiat explained that state actors and their allies pilfer subjects through legal means, and find elaborate ways to do so — such as lobbying lawmakers to mandate the use of products they have no desire to use, doubling their revenues in the process and enriching shareholders.\n\n“When plunder becomes a way of life for a group of men in a society, over the course of time they create for themselves a legal system that authorizes it and a moral code that glorifies it,” Bastiat observed in “Economic Sophisms.”\n\nNone of this is to say that vaccines are not effective or don’t offer protection from COVID. They do, and evidence suggests that vaccines give people who’ve had COVID more protection still. (Though like all vaccines, they do not come without risks.)\n\nBut the decision to take a vaccine should only ever belong to one person: the individual.\n\nAnd the fact that the CDC — an agency plagued by missteps throughout the pandemic, according to its own director — was so late in recognizing the basic science of natural immunity shows precisely why important medical decisions should be made by individuals, not bureaucrats or special interests.\n\nJonathan Miltimore is the Managing Editor of FEE.org. His writing/reporting has been the subject of articles in TIME magazine, The Wall Street Journal, CNN, Forbes, Fox News, and the Star Tribune.\n\nOriginally published at FEE.org under a CC BY 4.0 license.", "opengraph": {"locale": "en_US", "type": "article", "title": "The CDC (Finally) Admitted the Science on Natural Immunity. Why Did It Take So Long? - The Stream", "description": "The CDC is late to the party admitting the science on natural immunity. Many Americans have suffered because of it.", "url": "https://stream.org/the-cdc-finally-admitted-the-science-on-natural-immunity-why-did-it-take-so-long/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-08-22T17:03:30+00:00", "image": "https://stream.org/wp-content/uploads/Rochelle_Walensky_CDC_Director-edit.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">We won.</p>\n<p>An important reminder to always be ungovernable when they come for your civil liberties. <a href=\"https://t.co/rTMGpnrNC8\">pic.twitter.com/rTMGpnrNC8</a></p>\n<p>— Hannah Cox (@HannahDCox) <a href=\"https://twitter.com/HannahDCox/status/1557875975546961921?ref_src=twsrc%5Etfw\">August 11, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"We've created Billionaires – I call it the Covid Industrial Complex.\"</p>\n<p>\"We've created an interest group to keep the pandemic going. Their argument is 'we're keeping people safe when in fact we're just keeping the anxiety going.\"<a href=\"https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw\">@DrJBhattacharya</a></p>\n<p>Podast: <a href=\"https://t.co/sLe5Q37xYs\">https://t.co/sLe5Q37xYs</a> <a href=\"https://t.co/xQar3pODAy\">pic.twitter.com/xQar3pODAy</a></p>\n<p>— sketchnoteson (@sketchnoteson) <a href=\"https://twitter.com/sketchnoteson/status/1559495775104671744?ref_src=twsrc%5Etfw\">August 16, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://stream.org/author/jonmiltimore/", "https://stream.org/author/jonmiltimore/", "http://www.daisurvey.com/StreamWebsite", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1.full.pdf", "https://www.voanews.com/a/covid-19-pandemic_thousands-canada-and-france-protest-vaccine-passports/6209589.html", "https://www.nytimes.com/2021/08/04/technology/vaccine-passport-ny-privacy.html", "https://www.rchsd.org/2019/12/seven-steps-to-teaching-children-body-autonomy/#:~:text=Body%20autonomy%20is%20the%20right,be%20taught%20and%20to%20understand.", "https://fee.org/articles/harvard-epidemiologist-says-the-case-for-covid-vaccine-passports-was-just-demolished/", "https://stream.org/donate/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00676-9/fulltext", "https://www.cnn.com/2021/09/09/politics/joe-biden-covid-speech/index.html", "https://www.washingtonexaminer.com/opinion/op-eds/joe-biden-promised-no-vaccine-mandates-the-senate-will-vote-to-overturn-his-private-employee-mandate", "https://www.cnbc.com/2022/01/13/supreme-court-ruling-biden-covid-vaccine-mandates.html", "https://abcnews.go.com/Health/senate-republicans-target-biden-vaccine-mandate-fauci-supports/story?id=80970010", "https://apnews.com/article/health-pandemics-coronavirus-pandemic-9845c7257300ff6546c20489e642a1ea", "https://www.msn.com/en-us/travel/news/the-pandemic-e2-80-99s-soft-closing/ar-AA10J3fD", "https://t.co/rTMGpnrNC8", "https://twitter.com/HannahDCox/status/1557875975546961921?ref_src=twsrc%5Etfw", "https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw", "https://t.co/sLe5Q37xYs", "https://t.co/xQar3pODAy", "https://twitter.com/sketchnoteson/status/1559495775104671744?ref_src=twsrc%5Etfw", "https://www.econlib.org/politics-without-romance/", "https://robinhood.com/stocks/PFE", "https://robinhood.com/stocks/MRNA", "https://endpts.com/how-much-pfizer-leads-top-pharma-companies-ramped-up-lobby-spending-on-congress/", "https://en.wikipedia.org/wiki/Crony_capitalism#:~:text=Crony%20capitalism%2C%20sometimes%20called%20cronyism,class%20and%20the%20political%20class.", "https://fee.org/articles/mega-corporations-are-not-your-enemy/", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-buy-global-blood-therapeutics-54-bln-deal-2022-08-08/", "https://www.econlib.org/library/Bastiat/basSoph.html", "https://www.econlib.org/library/Bastiat/basSoph.html", "https://fee.org/articles/natural-immunity-offered-more-protection-against-omicron-than-3-vaccine-doses-new-england-journal-of-medicine-study-finds/", "https://www.cdc.gov/vaccines/vac-gen/side-effects.htm", "https://www.bloomberg.com/news/articles/2022-08-17/cdc-overhaul-director-walensky-lays-out-new-course-after-pandemic-missteps", "https://fee.org/articles/the-cdc-finally-admitted-the-science-on-natural-immunity-why-did-it-take-so-long/"], "authors": ["Jon Miltimore"], "publish_date": "2022-08-22T17:03:30+00:00"}