{"result_id": "306046", "URL": "https://stream.org/isnt-this-more-dangerous-than-alleged-vaccine-misinformation/", "timestamp": "2023-04-25 17:34:36 CEST+0200", "meta": {"description": "While being pressured about vaccines, how much concern is there for the obesity epidemic that's killing hundreds of thousands?", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/isnt-this-more-dangerous-than-alleged-vaccine-misinformation/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Isn’t This More Dangerous Than Alleged Vaccine Misinformation?", "cleaned_text": "After being placed on hold during a phone call to a medical clinic, a service announcement kept playing in my ears, telling me that 90% of those hospitalized today were not vaccinated. This was something important that this medical clinic wanted me to know, and I can understand why. After all, for millions of people around the world, this has been a matter of life and death.\n\nFor those in the pro-vaccine camp, there is a two-fold concern for those who choose not to be vaccinated. First, they are endangering their own lives. Second, they are potentially endangering the lives of others should they get infected and spread the virus.\n\nFor those who are skeptical about the vaccines, there is also a two-fold concern. First, do these vaccines really work? Second, long term or short term, could these vaccines do more harm than good?\n\nAccordingly, there has been passionate debate about these issues, with many in the pro-vaccine camp seeking to censor or deplatform those who raise questions about the vaccines. After all, the pro-vax camp reasons, with your anti-vax misinformation, you are dissuading people from getting vaccinated, and that could be fatal.\n\nBut I’m not here to weigh in on these issues (other than to say that everyone should be allowed to present their relevant views publicly without fear of censorship). I want to focus instead on something far more dangerous than alleged vaccine misinformation, namely, our active promoting of unhealthy foods that lead to obesity and death.\n\nIn this case, we know for a fact that obesity is deadly. We also know for a fact that much of our American diet contributes to obesity and premature death. Yet we celebrate our unhealthy culture with a constant bombardment of sumptuous ads on TV and internet, calling us to feast afresh on the latest decadent meals.\n\nOr do you actually think that a steady diet of sugary drinks (like Coke), pizza, donuts, ice cream, pasta, burgers, and fried foods is not dangerous, but COVID is?\n\nDr. Joel Fuhrman, whose research my wife Nancy and I relied on in our book Breaking the Stronghold of Food, notes that obesity contributes to: increased overall premature mortality; adult-onset diabetes; hypertension; degenerative arthritis; coronary artery disease; cancer; lipid disorders; obstructive sleep apnea; gallstones; fatty infiltration of liver; restrictive lung disease; gastrointestinal diseases; and more.\n\nAccording to a 2011 report, “Obesity is one of the leading causes of preventable death in the United States, second only to smoking. The annual number of deaths attributed to obesity is estimated to be as high as 400,000. Nearly 70% of the adult U.S. population is overweight or obese.” And that was 2011. I believe we have gotten fatter since then.\n\nA 2018 article began with these words: “Obesity is Killing America.” That is pretty direct — and true.\n\nThe same article noted that, in the previous year reported by the CDC, 633,842 Americans died of heart disease. Yet the vast majority of heart disease is related to diet and lifestyle. Obesity really is killing America.\n\nTo illustrate the point, this weight loss article stated:\n\nOur bodies are not built to function with extra weight and it’s only a matter of time before things shut down. Think about carrying two buckets full of water, one in each hand. No problem – at first. But then, your hands start pounding from the bucket handle…your arms start shaking a bit… give it a little time and your hands and muscles will completely give out. We blame it on weak hands or arms, but the truth is: they wouldn’t have given out if they weren’t supporting extra weight. Our bodies can only handle so much weight until it gives out. It is becoming increasingly clear that being overweight is setting the body up to shut down. It is evident by the obesity deaths per year in America.\n\nI Know the Power of Food Addictions\n\nI can speak to this subject with some level of authority, albeit not medical authority. Instead, I can speak with the authority of personal experience, having been a lifelong unhealthy eater until the age of 59 (in 2014).\n\nFor years of my life (and I mean years), I had pizza at least once a day. (I’m talking about New York pizza, where the slices are real slices.) I was a chocoholic, having chocolate or other sweets at least twice a day. And, despite exercising regularly and being disciplined with how much I ate, as the years went on, the weight went up.\n\nI developed high blood pressure. I was obese (weighing a high of 275 lbs. at 6 feet 2 inches). My cholesterol was at unhealthy levels. Who knows how much damage I was doing to my heart? And the list goes on.\n\nBut with God’s help (and the help of Nancy), I was able to make a radical lifestyle change, going from 275 lbs. to 180 lbs. in less than eight months, not by dieting, but by healthy eating. And everything (I mean that literally) turned around dramatically.\n\nThat’s why, by God’s grace, I have continued to live this super-healthy lifestyle to this day. It has literally saved my life. (For the record, I live by a “no exceptions” policy. But the issue is not so much about having a rare, unhealthy meal. The issue is a consistently unhealthy lifestyle.)\n\nThat being said, I know how powerful food addictions can be, and I do not sit in judgment of you or your weight or your lifestyle. Not for a split second.\n\nI’m simply saying that with today’s hyper-charged atmosphere when it comes to alleged COVID misinformation (on either side of the debate, understandably so), I find it quite ironic that, at the same time, we advertise and celebrate a decadent lifestyle that is undeniably deadly.\n\nPerhaps this deserves more attention?\n\nDr. Michael Brown (www.askdrbrown.org) is the host of the nationally syndicated Line of Fire radio program. His latest book is Revival Or We Die: A Great Awakening Is Our Only Hope. Connect with him on Facebook, Twitter or YouTube.", "opengraph": {"locale": "en_US", "type": "article", "title": "Isn’t This More Dangerous Than Alleged Vaccine Misinformation? - The Stream", "description": "While being pressured about vaccines, how much concern is there for the obesity epidemic that's killing hundreds of thousands?", "url": "https://stream.org/isnt-this-more-dangerous-than-alleged-vaccine-misinformation/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-03-07T22:05:29+00:00", "image": "https://stream.org/wp-content/uploads/pizza-edit-1.jpg", "image:width": "900", "image:height": "545", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/michaelbrown/", "https://stream.org/author/michaelbrown/", "http://www.daisurvey.com/StreamWebsite", "https://smile.amazon.com/Breaking-Stronghold-Food-Addictions-Discovered-ebook/dp/B01HX2U3S6/ref=sr_1_1?crid=33LB7BSAAKJGK&keywords=breaking+the+stronghold+of+food+michael+brown&qid=1646627836&sprefix=breaking+the+st%2Caps%2C91&sr=8-1", "https://pubmed.ncbi.nlm.nih.gov/21881014/#:~:text=Obesity%20is%20one%20of%20the%20leading%20causes%20of,the%20adult%20U.S.%20population%20is%20overweight%20or%20obese.", "https://weightlosssurgeon.com/surgical-weight-loss-tips/obesity-deaths-per-year-america", "https://stream.org/donate/", "https://stream.org/author/michaelbrown/", "http://www.askdrbrown.org/", "http://www.lineoffireradio.com/", "https://smile.amazon.com/Revival-We-Die-Great-Awakening/dp/0768452880/ref=sr_1_1?keywords=revival+or+we+die&qid=1631290494&sr=8-1", "https://www.facebook.com/AskDrBrown", "https://twitter.com/DrMichaelLBrown", "https://www.youtube.com/channel/UCbINn3x-intLp88Zrf8acpg"], "authors": ["Michael Brown"], "publish_date": "2022-03-07T22:05:29+00:00"}