{"result_id": "306010", "URL": "https://stream.org/biden-administration-making-lists-of-religious-vaccine-objectors/", "timestamp": "2023-04-25 17:33:16 CEST+0200", "meta": {"description": "A tiny administrative agency in the District of Columbia announced Tuesday its plan to assemble lists of religious vaccine objectors.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/biden-administration-making-lists-of-religious-vaccine-objectors/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Biden Administration Making Lists of Religious Vaccine Objectors", "cleaned_text": "A tiny administrative agency in the District of Columbia announced a new policy Tuesday that will likely serve as a model for a whole-of-government push to assemble lists of Americans who object on religious grounds to a COVID-19 vaccine.\n\nThe Pretrial Services Agency for the District of Columbia — a federal independent entity that assists officers in the District of Columbia courts in formulating release recommendations and providing supervision and services to defendants awaiting trial — announced a new records system that will store the names and “personal religious information” of all employees who make “religious accommodation requests for religious exception from the federally mandated vaccination requirement.”\n\nThe announcement does not explain why the agency needs to create this list except to say that it will “assist the Agency in the collecting, storing, dissemination, and disposal of employee religious exemption request information collected and maintained by the Agency.” In other words, the list will help the agency make a list.\n\nThe announcement also does not say what the agency will do with this information after it has decided an employee’s religious accommodation request.\n\nAnd neither does the announcement explain why the Biden administration chose to test this policy in an agency with a majority-black staff, who are both more religious and less vaccinated than other groups. So much for the president’s commitment to “racial equity.”\n\nWe’re starting to suspect that President Joe Biden is not keeping his promise to have the most transparent administration in history.\n\nWhat’s really going on with this announcement at this tiny agency? Likely, the Biden administration is using it to stealth test a policy it intends to roll out across the whole government.\n\nAlmost nobody has ever heard of the Pretrial Services Agency for the District of Columbia, and very few people pay close attention to it or are covered by its policies. Indeed, at of the time of publication of this article, the announcement has been viewed only 16 times.\n\nHowever, had Biden announced, for example, that the Department of Labor intended to adopt this policy, it would be big news. The Federal Register where announcements like this are made would be flooded with comments that the department would have to address.\n\nThat would, of course, delay the policy’s rollout. With the Pretrial Services Agency, Biden likely expected that the policy would land quickly and without a splash. As it is, the notice of a new announcement provides less than 30 days for public comment.\n\nBiden may not be winning points for transparency, but he’s doing his best to win first place in subjecting Americans with sincerely held religious beliefs to differential treatment.\n\nTake the Department of Defense, for example — which has failed to grant a single religious exemption on behalf of any service members requesting one for the federal vaccine mandate. A group of Navy SEALS was recently successful in its federal lawsuit against the Biden administration on claims that its conscience rights under the First Amendment and the Religious Freedom Restoration Act were violated.\n\nFrom the outset of his administration, Biden voiced support for passage of the patently faith-hostile Equality Act — a bill that would gut the Religious Freedom Restoration Act entirely when it intersects with LGBTQ+ protections and entitlements in public accommodations.\n\nThe president also swiftly revoked the Mexico City policy that had been reinstated by former President Donald Trump, thereby ensuring that religious Americans would be forced to fund abortions overseas by way of their tax dollars, despite their religious objections to the act.\n\nWhile employers, employment agencies, or unions with 100 employees or more are prohibited under Title VII of the Civil Rights Act of 1964 from engaging in disparate treatment and from maintaining policies or practices that result in unjustified disparate impact based on religion, this administration doesn’t seem to have gotten the memo.\n\nThat, at bottom, is what this policy is about.\n\nSarah Parshall Perry and GianCarlo Canaparois are legal fellows in the Edwin Meese III Center for Legal and Judicial Studies at The Heritage Foundation.", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden Administration Making Lists of Religious Vaccine Objectors - The Stream", "description": "A tiny administrative agency in the District of Columbia announced Tuesday its plan to assemble lists of religious vaccine objectors.", "url": "https://stream.org/biden-administration-making-lists-of-religious-vaccine-objectors/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-01-12T16:00:40+00:00", "article:modified_time": "2022-01-14T15:25:22+00:00", "image": "https://stream.org/wp-content/uploads/iStock-665515600-1.jpg", "image:width": "900", "image:height": "552", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://www.federalregister.gov/documents/2022/01/11/2021-28135/privacy-act-of-1974-system-of-records", "https://www.dailysignal.com/2021/11/11/why-every-american-vaccinated-or-not-should-oppose-vaccine-mandates/", "https://www.dailysignal.com/2021/12/19/bidens-covid-vaccine-mandate-faces-showdown-at-supreme-court/", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwj4_bO_tKr1AhW5knIEHQGBDcAQFnoECAYQAQ&url=https%3A%2F%2Fwww.csosa.gov%2Fwp-content%2Fuploads%2Fbsk-pdf-manager%2F2021%2F03%2F2020-FEVS-CSOSA-Subagency-Report.pdf&usg=AOvVaw3y_zKDTlN5N5qOxK5XKQ2l", "https://www.pewresearch.org/fact-tank/2018/04/23/black-americans-are-more-likely-than-overall-public-to-be-christian-protestant/", "https://coronavirus.dc.gov/data/vaccination", "https://www.dailysignal.com/2021/03/12/the-many-ways-biden-has-kicked-culture-wars-into-overdrive/", "https://www.foxnews.com/media/associated-press-piece-knocks-biden-falling-short-transparency-news-conferences.amp", "https://www.federalregister.gov/documents/2022/01/11/2021-28135/privacy-act-of-1974-system-of-records", "https://news.usni.org/2021/11/30/navy-does-not-approve-any-religious-exemptions-as-covid-19-vaccine-deadline-passes", "https://www.dailysignal.com/2022/01/04/court-delivers-win-to-military-members-denied-religious-exemptions-from-pentagon-vaccine-mandate/", "https://stream.org/donate/", "https://www.dailysignal.com/2021/03/16/equality-act-would-cancel-religious-freedom/", "https://www.nbcnews.com/politics/white-house/biden-readies-sweeping-rollback-trump-era-abortion-crackdown-n1254552", "https://www.dailysignal.com/2022/01/11/breaking-biden-administration-making-lists-of-religious-vaccine-objectors/"], "authors": ["Austin Roscoe"], "publish_date": "2022-01-12T16:00:40+00:00"}