{"result_id": "306035", "URL": "https://stream.org/vaccine-mandate-feels-like-coercion-says-boston-teacher-who-fears-being-fired/", "timestamp": "2023-04-25 17:34:12 CEST+0200", "meta": {"description": "Special needs teacher Angela Jones could be fired from her job with the Boston school system. Why? Because she is unvaccinated.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/vaccine-mandate-feels-like-coercion-says-boston-teacher-who-fears-being-fired/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Vaccine Mandate 'Feels Like Coercion,' Says Boston Teacher Who Fears Being Fired", "cleaned_text": "Special needs teacher Angela Jones could be fired from her job with the Boston school system. Why? Because she is unvaccinated.\n\nJones teaches elementary students in Boston Public Schools, where she has taught for nearly 20 years. She says she is one of more than 400 teachers there who have declined to take a COVID-19 vaccine.\n\nNow, Jones and her unvaccinated colleagues face termination.\n\nThe vaccine mandate for Boston teachers “feels like coercion,” Jones, 52, told The Daily Signal during a phone interview Friday.\n\n“We don’t want to put this [vaccine] in our bodies,” she said, adding that all she and her colleagues want to do is “live our lives and teach children, which is our livelihood.”\n\n“If we are not allowed to choose what goes in our body,” Jones said, “ … that to me is the ultimate loss of freedom.”\n\nAngela Jones isn’t her actual name, but a pseudonym used by The Daily Signal to protect the teacher’s identity.\n\nLast month, Boston Mayor Michelle Wu, a Democrat, announced Dec. 20 that all city employees would be required to receive at least one dose of a COVID-19 vaccine by Jan. 15. Following that order, Boston Public Schools announced that all its staff “will adhere to the announced vaccine policy for City of Boston employees.”\n\nThe stay comes after three unions — the International Association of Fire Fighters Local 718, the Boston Police Superior Officers Federation, and the Boston Police Detectives Benevolent Society — filed a lawsuit over the vaccine mandate.\n\nThe city has until Feb. 3 to file a response before the court’s final ruling. The Wu administration paused enforcement of the vaccine mandate while the legal process plays out.\n\n“The stay decision means the vaccine verification policy is paused, and no educators will be placed on administrative leave or terminated at this time,” Becky Shuster, assistant superintendent of equity for Boston Public Schools, told The Daily Signal in an email Friday.\n\nWu said Thursday that 95% of city employees already have been vaccinated.\n\nThe concern for teachers such as Jones is that if the court rules in favor of the city and the vaccine mandate remains in place, they risk losing their jobs because they’re not vaccinated.\n\nJones applied for a religious exemption in early January, but it was denied.\n\nThose denied religious exemptions are not allowed to appeal the decision, the Boston teacher said, but may add information to their request and resubmit the paperwork.\n\nJones herself did this, only to be denied a second time.\n\nJones sent The Daily Signal a copy of the email she received from Shuster denying this second request for a religious exemption.\n\n“We have not approved any religious accommodations because the safety of students and staff is our highest priority,” Shuster told The Daily Signal.\n\nMichael King, director of community alliances for Massachusetts Family Institute, says he finds that troubling.\n\n“Denying the religious exemptions of these teachers is a tragedy not only for these teachers, but for the thousands of students in their care,” King told The Daily Signal.\n\nShuster did say that the Boston school system’s Office of Equity “has approved numerous accommodations should the policy ultimately be implemented.”\n\nOf those asking for a medical exemption to the vaccine, Jones said, she is aware only of some who have received temporary exemptions—such as until the end of a pregnancy.\n\nTeachers who refuse a COVID-19 shot are “from all races and creeds and walks of life,” Jones said.\n\nThe school system’s vaccine mandate “affects black and Latino teachers more than any other group,” she said. “They’re at a higher rate of not getting the vaccine.”\n\nAsked about the mandate’s adverse effect on Latino and black teachers, Shuster said: “Boston Public Schools has been diligently working to engage its staff to explore their vaccination options and to provide timely information about the vaccine.”\n\nThe assistant superintendent listed seven “action steps,” including holding two open forums on Zoom to answer questions and provide access to public health experts as well as a session specifically for educators of color.\n\nAlthough unions for law enforcement officers and first responders have led efforts against the vaccine mandate imposed on city employees, Jones said, she and other unvaccinated teachers have felt little support from their own union, the Boston Teachers Union.\n\n“What my union is saying is that I should get vaccinated,” Jones said.\n\n“They say that they’ve been bargaining … but they refuse to go to court,” she added. “They said they wouldn’t win, they had no chance of winning.”\n\n“The facts show that [Boston Teachers Union] has taken numerous steps to advance flexibility and access for members with regard to city vaccination policies,” a union spokesperson told The Daily Signal in an email Friday.\n\nThe spokesperson added that the union is working to support all teachers, writing in part:\n\n“We’re not trying to say that people shouldn’t be vaccinated,” Jones said. “You can do what you would like to do, but we are very strongly saying we need help, we need representation.”\n\nJones called the situation “devastating” for teachers like herself and argued that she is taking all the precautions necessary to keep students and colleagues safe.\n\nUnvaccinated Boston teachers are “testing every week, we’re wearing masks, we’re practicing everything the [Centers for Disease Control and Prevention] says to practice,” she said.\n\nThe Students the Ones to Suffer\n\nJones said she believes that students ultimately are the ones who will suffer if unvaccinated teachers are fired.\n\n“It’s going to be awful,” Jones said, adding that the sudden loss of teachers would be “very detrimental to the children.”\n\nAmericans, she said, need to recognize that vaccine mandates will “eventually affect everybody if we are not given the right to be able to choose what we want to do with our health care choices.”\n\nVirginia Allen is a news producer for The Daily Signal. She is the co-host of The Daily Signal Podcast and Problematic Women. Send an email to Virginia.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Mandate 'Feels Like Coercion,' Says Boston Teacher Who Fears Being Fired - The Stream", "description": "Special needs teacher Angela Jones could be fired from her job with the Boston school system. Why? Because she is unvaccinated. ", "url": "https://stream.org/vaccine-mandate-feels-like-coercion-says-boston-teacher-who-fears-being-fired/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-01-30T21:00:25+00:00", "article:modified_time": "2022-01-30T15:39:14+00:00", "image": "https://stream.org/wp-content/uploads/forced-injection-e1643557044632.jpg", "image:width": "900", "image:height": "625", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://www.dailysignal.com/2022/01/18/nearly-a-third-of-democrats-support-unvaccinated-losing-custody-of-kids/", "https://www.dailysignal.com/2022/01/13/business-leaders-rejoice-supreme-court-blocks-biden-vaccine-mandate/", "https://www.dailysignal.com/2021/10/12/how-to-save-freedom-discourse-debate-are-good-places-to-start/", "https://www.boston.gov/news/plan-require-proof-covid-19-vaccination-indoor-dining-fitness-and-entertainment-locations", "https://www.boston.gov/sites/default/files/file/2021/12/BPHC-Indoor-Vaccination-Order-12-20-21.pdf", "https://www.bostonpublicschools.org/Page/8757#calendar21760/20220128/month", "https://stream.org/?attachment_id=482759", "https://stream.org/donate/", "https://www.dailysignal.com/2022/01/10/more-covid-19-school-closures-spell-the-end-of-teachers-unions-empire/", "https://www.dailysignal.com/2021/11/11/why-every-american-vaccinated-or-not-should-oppose-vaccine-mandates/", "https://www.dailysignal.com/2022/01/23/biden-voter-explains-her-stand-against-covid-19-vaccine-mandate/", "/cdn-cgi/l/email-protection#4e38273c292720272f602f22222b200e2a2f2722373d2729202f22602d2123"], "authors": ["Al Perrotta"], "publish_date": "2022-01-30T21:00:25+00:00"}