{"result_id": "306022", "URL": "https://stream.org/court-blasts-bidens-anti-work-vaccine-mandate/", "timestamp": "2023-04-25 17:33:42 CEST+0200", "meta": {"description": "Working Americans got good news on Friday. They may not have to worry about getting laid off because of qualms about the COVID-19 vaccine.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/court-blasts-bidens-anti-work-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Court Blasts Biden's Anti-Work Vaccine Mandate", "cleaned_text": "UPDATE: OSHA announced Wednesday it will comply with the 5th Circuit Court of Appeals decision ordering a temporarily halt to Biden’s vaccine mandate.\n\nWorking Americans got good news on Friday. They may not have to worry about getting laid off because of qualms about the COVID-19 vaccine. A federal appeals court suspended the Biden administration’s attempt to mandate the shots at private sector workplaces with 100 or more employees.\n\nUnder President Joe Biden’s order, which would go into effect January 4, employees who refuse the shots have to submit to weekly testing at their own expense or lose their jobs.\n\nVaccines are not required to collect welfare or food stamps, or to come across the southern border and apply for asylum. They’re just required to work. Go figure.\n\nJustifying the mandate, Biden said his “patience” was “wearing thin” and “too many people remain unvaccinated.”\n\nBut a three-judge panel in the Fifth Circuit Court of Appeals slammed Biden’s ends-justifies-the-means approach. The Constitution limits what the federal government can make people do, even in emergencies.\n\nThe Judges’ Ruling and the Media’s Exasperation\n\nIt’s in the public’s interest, Judge Kurt D. Engelhardt wrote, to protect “our constitutional structure and” maintain “the liberty of individuals to make intensely personal decisions according to their own convictions — even, or perhaps particularly, when those decisions frustrate government officials.”\n\nAnd exasperate their liberal media allies. CNN bashed the Fifth Circuit as “notoriously conservative.” Vox dismissed it as a “right-wing panel.” Washington Post columnist Ruth Marcus slammed the judges’ “stingy vision of the federal government’s powers” and threw up her hands: “Maintaining our constitutional structure? How about saving lives?”\n\nConspicuously lacking in the left’s response is a legal defense of the mandate. It’s indefensible. Even before Friday’s ruling, Biden’s spokesperson Karine Jean-Pierre told employers to bulldoze ahead, disregarding legal challenges.\n\nThat shows how little the Biden administration and Democrats care about the rule of law and individual freedoms.\n\nThe Mandate is ‘Overinclusive’ and ‘Underinclusive’\n\nThe Fifth Circuit judges deemed the mandate recklessly “overinclusive.” Rather than using “a delicately handled scalpel” to identify workplaces where unvaccinated workers may pose a severe risk — such as meatpacking plants, where employees work shoulder to shoulder — federal regulators used “a one-size-fits-all sledgehammer.”\n\nAt the same time, said the judges, the mandate is inexplicably “underinclusive,” not affecting anyone in smaller workplaces, as if the virus passes over them.\n\nAnd how about people who don’t work? The judges didn’t raise the issue, but the public keeps asking about it.\n\nThe Fifth Circuit also balked at using the Occupational Safety and Health Administration to weasel through a mandate that far exceeds that agency’s authority and circumvents Congress. Some reports called it “the ultimate work-around.”\n\nNot that congressional action would have done the trick. The judges doubted Congress has the authority to compel individuals to get vaccinated, like states and local governments do.\n\nThe Constitution’s commerce clause has been stretched like a rubber band over the last century to support expansions of federal power in economic areas, but it can’t support mandatory vaccination, which the judges called a “noneconomic inactivity.”\n\nUnlikely to Survive the Supreme Court\n\nThis case is headed for the U.S. Supreme Court, where the mandate is unlikely to survive. As Justice Neil Gorsuch opined in another COVID-19 case, “civil liberties face grave risks when governments proclaim indefinite states of emergency.”\n\nIn the meantime, Republicans in Congress are seizing the opportunity to highlight how the mandate makes working people into suckers, while no one else is being forced to choose between their personal freedom and putting food on the table.\n\nUsing the Congressional Review Act, a handy tool to overturn agency regulations, Republicans will be calling for a vote of disapproval against the vaccine mandate. Even if it passes both houses, Biden will likely veto it. Getting two-thirds of both houses to override Biden is unlikely. Even so, calling the vote will be a pretty sight, with moderate Democrats squirming about forcing vaccine mandates on their constituents, when members of Congress and their staffs don’t have to get the jabs to keep their jobs.\n\nIt’s the typical Washington D.C. hypocrisy: Rules good enough for thee but not for me.\n\nBetsy McCaughey is a former lieutenant governor of New York and author of The Next Pandemic, available at Amazon.com. Follow her on Twitter @Betsy_McCaughey. To find out more about Betsy McCaughey and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Court Blasts Biden's Anti-Work Vaccine Mandate - The Stream", "description": "Working Americans got good news on Friday. They may not have to worry about getting laid off because of qualms about the COVID-19 vaccine.", "url": "https://stream.org/court-blasts-bidens-anti-work-vaccine-mandate/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-11-17T18:00:15+00:00", "article:modified_time": "2022-01-20T02:32:27+00:00", "image": "https://stream.org/wp-content/uploads/Doctor-with-COVID-19-coronavirus-vaccine-compressed.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/betsymccaughey/", "https://stream.org/author/betsymccaughey/", "http://www.daisurvey.com/StreamWebsite", "https://ohsonline.com/articles/2021/11/17/osha-suspends-ets.aspx?m=1", "https://stream.org/donate/"], "authors": ["Betsy McCaughey"], "publish_date": "2021-11-17T18:00:15+00:00"}