{"result_id": "306019", "URL": "https://stream.org/update-on-california-efforts-to-mandate-vaccinations/", "timestamp": "2023-04-25 17:33:35 CEST+0200", "meta": {"description": "California residents face proposals to make vaccine mandates permanent. How far will California Democrats go to impose their despotism?", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/update-on-california-efforts-to-mandate-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Update on California Efforts to Mandate Vaccinations", "cleaned_text": "Californians gained a reprieve from a bill that would force workers to get COVID-19 vaccines. But residents still face proposals to make vaccine mandates permanent elsewhere.\n\nOn March 29, Assembly Member Buffy Wicks pulled AB 1993 from a committee hearing less than 24 hours before its first reading. Had the Legislature passed AB 1993, all employees and contractors would have to prove they received two doses of an approved COVID-19 vaccine within 45 days, as The Stream reported. California’s Department of Fair Employment and Housing, the Department of Public Health, and the Division of Occupational Safety and Health would determine exemptions.\n\nBut Wicks and her fellow members of the self-titled Vaccine Work Group introduced six other bills that would give the state unprecedented power concerning vaccine mandates. The group’s seven members — all Democrats — include Assembly Members Cecilia Aguiar-Curry, Evan Low, and Akilah Weber, and Senators Josh Newman, Richard Pan, and Scott Wiener.\n\nWhen the Legislature reconvened Jan. 3, the Vaccine Work Group got busy. On Jan. 20, Wiener and Pan introduced SB 866, which would allow teens aged 12-18 to get COVID-19 vaccines without their parents’ knowledge.\n\nFour days later, Pan proposed SB 871, which requires children to be immunized against COVID-19. On Feb. 7, Weber introduced AB 1797, which forces doctors and pharmacists to send vaccination information on children to the state’s immunization registry. That information must be grouped by race and ethnicity.\n\nWicks joined Aguiar-Curry, Low, and Weber to introduce AB 1993 on Feb. 10. On Feb. 14, Low presented AB 2098, which would allow the state to suspend the license of any doctor who spreads “misinformation” about COVID-19 or vaccines. Pan finished the onslaught Feb. 18 with two bills. SB 1464 would require police and sheriffs to enforce public health orders or lose state funding. SB 1479 would force all schools to test teachers, students, and staff members for COVID-19.\n\nIronically, all that legislation disregards the science Democrats claim to revere. Four of the bills concern children and teenagers, yet The Lancet showed children are far less likely to contract COVID-19 because they have natural immunity. The British Joint Committee on Vaccination and Immunization agreed.\n\nIn June, the Vaccine Adverse Event Reporting System (VAERS) followed by publishing data that showed the mRNA vaccine’s dangers for children and teenagers. The chance of developing heart problems increased dramatically for anyone aged 12-17 who received a second dose of a COVID-19 vaccine with mRNA. A second study published in September revealed similar findings. In both studies, boys experienced an especially dangerous risk.\n\nA Brazilian study published in February showed that mRNA vaccines increase the production of substances that trigger myocarditis and sudden death.\n\nStephanie Seneff, a senior research scientist from MIT, and Kathy Dopp, an independent policy analyst, found even more frightening tendencies after analyzing vaccination data. Children and teenagers were 51 times more likely to die from the vaccine itself than from COVID-19 if they had never been inoculated. Seneff and Dopp also found that the mRNA vaccines actually increase the chance of contracting and dying from COVID-19.\n\nTheir finding corresponds with a study published in August in the Journal of Infection, a peer-reviewed magazine from the British Infection Association. The study found that the mRNA vaccine increased the chances of being infected with the Delta variant. The researchers even recommended that manufacturers change their vaccines to reduce the risk.\n\nIn December, the Journal published another study showing that a second COVID-19 shot failed to increase immunity in anyone who had the disease and already had been vaccinated.\n\nIn its Feb. 24 report on COVID-19, the United Kingdom’s Health Security Agency disclosed that between Jan. 24 and Feb. 20:\n• 72.8 percent of vaccinated British patients contracted COVID-19, including 50.5 percent of the triple vaccinated.\n• Among patients hospitalized with COVID-19, 72.8 percent took the vaccine, and 53.5 percent received three shots.\n• 88.5 percent of those who died from COVID-19 were vaccinated, including 64.2 percent of the triple vaccinated. Out of the total number of deaths, only 11.5 percent were not vaccinated.\n\n“There is no evidence that vaccines reduce community spread and transmission,” Seneff and Dopp wrote. “Thus, vaccine mandates are not based on sound science and are ill-advised.”\n\nSo what’s the point? Well, by proposing legislation that makes mandates permanent, legislators repay the drug companies that fill their campaign treasuries, as The Stream reported.\n\nFour members of the Vaccine Work Group plus two of AB 1993’s co-authors accepted large donations from pharmaceutical corporations and trade associations for the legislators’ 2020 campaigns. Those donations represent Big Pharma’s attempt not only to influence state legislators, but the federal government as well.\n\nBut something more sinister is at play. The Vaccine Work Group’s activism illustrates the Democratic Party’s embrace of despotism under the guise of promoting the common good. Extending a public emergency and instilling mass fear become effective techniques for amassing power.\n\n“Perpetual states of emergency have replaced perpetual states of war as the preferred vehicle for increasing authoritarian power,” wrote Breitbart’s John Hayward. “Emergencies also encourage a more submissive mindset, which is essential for political power to grow. Obedience is the necessary fuel for power…. Submission nourishes obedience.”\n\nSubmission also demands suppressing information, as AB 2098 would do.\n\n“The pandemic greatly increased the free world’s appetite for ‘controlled’ authoritarianism,” Hayward wrote. “A good emergency can be kept rolling indefinitely. People are prone to consuming misinformation and turning against their wise rulers. They can thwart the noble efforts of visionary politicians by voting them out of office.”\n\nNow imagine that most of the Vaccine Work Group’s remaining legislation, if not all of it, passes. How far would California’s Democrats go, given the Left’s alliance with Silicon Valley?\n\nWould they demand vaccine passports on smartphones, as leaders around the world did last summer, as The Stream also reported? What would happen to Californians who refuse to get COVID-19 vaccines or to doctors who refuse to prescribe state-mandated treatments? What would happen to Californians who organize or participate in peaceful protests against oppressive mandates?\n\nMost importantly, would California’s Democrats stop at COVID-19?\n\nJoseph D’Hippolito has written commentaries for such outlets as the Jerusalem Post, the American Thinker and Front Page Magazine. He works as a free-lance writer.", "opengraph": {"locale": "en_US", "type": "article", "title": "Update on California Efforts to Mandate Vaccinations - The Stream", "description": "California residents face proposals to make vaccine mandates permanent. How far will California Democrats go to impose their despotism?", "url": "https://stream.org/update-on-california-efforts-to-mandate-vaccinations/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-04-06T21:00:16+00:00", "article:modified_time": "2022-04-06T16:34:26+00:00", "image": "https://stream.org/wp-content/uploads/california-covid-passport.jpg", "image:width": "900", "image:height": "640", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/joseph-dhippolito/", "https://stream.org/author/joseph-dhippolito/", "http://www.daisurvey.com/StreamWebsite", "https://www.latimes.com/california/story/2022-03-29/one-of-the-most-far-reaching-vaccine-mandate-bills-in-california-will-not-move-forward", "https://albr.assembly.ca.gov/sites/albr.assembly.ca.gov/files/Agenda%203-30-22.pdf", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB1993", "https://stream.org/california-marriage-to-big-pharma-breeds-mandate-mania/", "https://sd06.senate.ca.gov/news/2022-01-19-legislators-form-vaccine-work-group-boost-public-health-policies", "https://calmatters.org/health/coronavirus/2022/03/california-vaccine-laws/", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB866", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB871", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB1797", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB2098", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB1464", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB1479", "https://www.thelancet.com/journals/lanchi/article/PIIS2352-4642(21)00066-3/fulltext", "https://www.theepochtimes.com/the-alarming-trends-in-covid-jab-side-effects_4319841.html?utm_source=ref_share&utm_campaign=copy&rs=SHRWCNMH&", "https://www.theepochtimes.com/the-alarming-trends-in-covid-jab-side-effects_4319841.html?utm_source=ref_share&utm_campaign=copy&rs=SHRWCNMH&", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://www.researchgate.net/profile/Cadegiani-Flavio/publication/358834540_Catecholamines_are_the_key_trigger_of_mRNA_SARS-CoV-2_and_mRNA_COVID-19_vaccine-induced_myocarditis_and_sudden_deaths_a_compelling_hypothesis_supported_by_epidemiological_anatomopathological_molecular/links/621b97b99947d339eb6e529a/Catecholamines-are-the-key-trigger-of-mRNA-SARS-CoV-2-and-mRNA-COVID-19-vaccine-induced-myocarditis-and-sudden-deaths-a-compelling-hypothesis-supported-by-epidemiological-anatomopathological-molecul.pdf?origin=publication_detail", "https://www.skirsch.com/covid/Seneff_costBenefit.pdf", "https://www.journalofinfection.com/article/S0163-4453(21)00392-3/fulltext", "https://www.journalofinfection.com/article/S0163-4453(21)00593-4/fulltext", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1057599/Vaccine_surveillance_report_-_week-8.pdf?fbclid=IwAR1BzxlfpPgI7PNnE3twD8bL7dWSDYANBrfK4wktcVM8Fn48McDClFUb0T0", "https://dailyexpose.uk/2022/03/01/russia-distraction-uk-gov-revealed-triple-vaccinated-account-9-in-10-covid-deaths/", "https://www.skirsch.com/covid/Seneff_costBenefit.pdf", "https://stream.org/california-marriage-to-big-pharma-breeds-mandate-mania/", "https://stream.org/donate/", "https://twitter.com/Doc_0/status/1493575465956696066", "https://twitter.com/Doc_0/status/1493575465956696066", "https://stream.org/vaccine-passports-a-beastly-sign-of-things-to-come/", "https://twitter.com/Doc_0/status/1496481556734656523"], "authors": ["Joseph D'Hippolito"], "publish_date": "2022-04-06T21:00:16+00:00"}