{"result_id": "306005", "URL": "https://stream.org/can-mrna-vaccines-alter-human-dna-new-study-blows-debate-wide-open/", "timestamp": "2023-04-25 17:33:04 CEST+0200", "meta": {"description": "The CDC scoffed at evidence that COVID vaccines can alter our DNA. Now evidence is mounting that it's true.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/can-mrna-vaccines-alter-human-dna-new-study-blows-debate-wide-open/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Can mRNA Vaccines Alter Human DNA? New Study Blows Debate Wide Open", "cleaned_text": "Surprise, surprise. Will “conspiracy theorists” be proven right again? If findings are accurate in a newly published study conducted by researchers at Sweden’s Lund University, then yes. The title — “Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line” — is also the study’s premise. Researchers found that messenger RNA (mRNA) from Pfizer’s COVID-19 vaccine can enter human liver cells and then be converted into DNA. Using an in-vitro liver cell line, scientists detected “changes in gene expression of long interspersed nuclear element-1 (LINE-1), which is an endogenous reverse transcriptase.”\n\nSo what does this mean in laymen’s terms? It means that Pfizer’s COVID vaccine, does, in fact, interact with human DNA, through a process called “reverse transcription.” DNA is “remade” or altered from RNA when this reverse transcription occurs.\n\nConversely, in the normal transcription process, a portion of the DNA serves as a template to make an mRNA molecule inside the nucleus, which is then sent out into the cell to make a protein needed for normal function.\n\nTime will tell if the findings prove to be the truth bomb the CDC wasn’t prepared for. Just to be clear, the CDC and Swedish researchers can’t both be right.\n\nThe Centers for Disease Control and Prevention devotes an entire web page to dispelling myths and dishing out “facts” regarding COVID-19 vaccines. Deep down on the “CDC’s COVID Vaccine Myth List” (BTW, the first eight are debatable as well), Myth #9 says:\n\nFACT: COVID-19 vaccines do not change or interact with your DNA in any way. Both messenger RNA (mRNA) and viral vector COVID-19 vaccines work by delivering instructions (genetic material) to our cells to start building protection against the virus that causes COVID-19. After the body produces an immune response, it discards all the vaccine ingredients just as it would discard any information that cells no longer need. This process is a part of normal body functioning. The genetic material delivered by mRNA vaccines never enters the nucleus of your cells, which is where your DNA is kept. [Remember that part.] Viral vector COVID-19 vaccines deliver genetic material to the cell nucleus to allow our cells to build protection against COVID-19. However, the vector virus does not have the machinery needed to integrate its genetic material into our DNA, so it cannot alter our DNA. [Remember that part, too.]\n\nWhether the CDC wants to deal with the diametrically opposed Swedish research findings or not, it would behoove the Center to respond immediately or risk losing its last remaining shards of credibility.\n\nFurthermore, the Swedish study backs up what Stephanie Seneff, a senior research scientist at MIT, predicted in May 2020. On Feb. 26, 2022, Seneff tweeted, “More surprises from the mRNA jabs. Dr. Greg Nigh and I predicted that the RNA would get converted into DNA by LINE-1 last May. Guess what? New research proves it’s happening, at least in vitro.” That’s exactly what the Swedes found:\n\nConversion to DNA by LINE-1. In the nucleus of the cell. Where the CDC said the vaccine didn’t have “the machinery needed to integrate its genetic material into our DNA.”\n\nAccording to renowned cardiologist and COVID-19 thought leader Dr. Peter McCullough, “Code for spike found in the nucleus is worrisome for installation into human chromosomes.”\n\nIf the bombshell findings from Lund University are upheld through future research, the implications are far-reaching, profound, and disconcerting. It would challenge the “safe and effective” premise upon which the entire vaccine narrative was built, while begging a response from the CDC itself. If necessary, the removal of current vaccines should be nonnegotiable considering the inherent risks to global public health and safety.\n\nOvernight, the vaccine’s reputation would change from pandemic-ending poster child to Big Pharma’s irreversible global experiment injected into a trusting world population.\n\nImagine that the DNA in the nucleus of your cells is like an accordion that expands and contracts to make various notes of music to come out of it. In the same way, “the notes” or “bars of music” coming out of your “accordion-like” DNA are the much smaller messenger mRNA being sent into the cytoplasm of the cell.\n\nThe messenger RNA are small segments of genetic instructions of the much, much greater composition that the symphonic DNA is playing. The mRNA gives instructions for important small proteins to be assembled and sent out throughout the whole body, much as small bars and stanzas in a musical composition are the sequential instructions of which notes are to be played, in what order, and for how long. These “bars of music” are very important to the overall identity of the greater musical composition.\n\nIn reverse transcription, the small messenger RNA is transcribed and written back into the original composition of the much larger DNA. This insertion thereby changes the genetic material if the mRNA came from an outside source. Going back to our analogy, it’s as if foreign bars and new notes of music got injected into the cell, which essentially rewrites a portion of the original masterpiece.\n\nIf we were talking about Beethoven’s Ninth Symphony, this “foreign insertion of extraneous bars of music” fundamentally changes the composition and it is no longer what it was: a masterpiece of classical music. In fact, when reversed transcribed back into the original composition, the foreign instructions — whether we are talking about bars of music or mRNA — can throw other parts out of tune, thereby ruining the symphony.\n\nAnnemarie McLean is a writer for Liberty Counsel, a nationwide public interest civil liberties law firm committed to restoring the culture, advancing religious freedom, protecting the unborn, and strengthening the family. In 2012, she founded 3D Missions, an international outreach taking the Gospel to the nations through the performing arts, and co-founded Brave & Beautiful, a platform empowering young women to live, love, and lead courageously. She holds a journalism degree from Oral Roberts University, with post-graduate work in organizational leadership at Palm Beach Atlantic University.", "opengraph": {"locale": "en_US", "type": "article", "title": "Can mRNA Vaccines Alter Human DNA? New Study Blows Debate Wide Open - The Stream", "description": "The CDC scoffed at evidence that COVID vaccines can alter our DNA. Now evidence is mounting that it's true.", "url": "https://stream.org/can-mrna-vaccines-alter-human-dna-new-study-blows-debate-wide-open/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-03-19T17:00:01+00:00", "article:modified_time": "2022-03-22T20:06:13+00:00", "image": "https://stream.org/wp-content/uploads/Doctor-Syringe-Euthanasia-Scary-Dangerous-Executioner-900-e1622658745892.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/annemarie-mclean/", "https://stream.org/author/annemarie-mclean/", "http://www.daisurvey.com/StreamWebsite", "https://archive.ph/Cavk5", "https://www.theepochtimes.com/t-pfizer", "https://www.theepochtimes.com/t-covid-19", "https://www.theepochtimes.com/t-liver", "https://www.theepochtimes.com/t-dna", "https://www.theepochtimes.com/pfizers-covid-19-vaccine-goes-into-liver-cells-and-is-converted-to-dna-study_4307594.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/facts.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mRNA.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/viralvector.html", "https://twitter.com/stephanieseneff/status/1497653765251362819", "https://twitter.com/P_McCulloughMD", "https://stream.org/donate/"], "authors": ["Annemarie McLean"], "publish_date": "2022-03-19T17:00:01+00:00"}