{"result_id": "306047", "URL": "https://stream.org/the-brew-why-bother-with-a-human-press-secretary-also-pfizer-records-dead-babies-as-resolved-adverse-effects-of-the-vaccine/", "timestamp": "2023-04-25 17:34:38 CEST+0200", "meta": {"description": "When a pregnant woman takes Pfizer's COVID vaccine and her baby dies, Pfizer records that as a \"resolved adverse effect.\"", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-brew-why-bother-with-a-human-press-secretary-also-pfizer-records-dead-babies-as-resolved-adverse-effects-of-the-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Brew: Why Bother With a Human Press Secretary? Also, Pfizer Records Dead Babies as ‘Resolved Adverse Effects’ of the Vaccine", "cleaned_text": "[Al Perrotta is still on vacation. He’s not answering his phone. He seems to have clawed out the tracking device we implanted under his skin … . ]\n\nWe’re coming to the time of year when we’re called to remember what’s good about our lives, what blessings we’ve received, and all the things in our country for which we should be thankful. That’s an important exercise, and The Stream is running columns that highlight these good and uplifting things. Our weekly feature, The Sunny Side of the Stream, collects such bright spots all in a single place.\n\nBut that’s not why you click on a column with my byline, is it? I know my niche in the divine economy, and it is “scourge of God.” Think of me as a refreshing shower of brimstone or a rumbling horde of Assyrians, or else as the note that blows from the trump of Doom to mark the opening of the Seventh Seal.\n\nWith all that in mind, let’s review the recent news.\n\nYoung Turk Host Has His Mind in the Boys Room\n\nOkay, it’s bad enough that Cenk Uygur named his leftist commentary program The Young Turks, in honor of the gang that organized the Armenian Genocide. It’s kind of like calling your talk show “The Waffen SS.” But now Uygur is spewing baseless charges that Republicans only worry about the sexual grooming of children because … the GOP is full of pedophiles.\n\nUygur uses the term “psychological projection” in his rant. Yeah, that might well be what’s happening, if not in the sense he means.\n\nWhy Even Go Through the Motions of Holding White House Press Conferences?\n\nI wonder if the Biden White House even needs a press secretary. When serious journalists ask difficult questions, they just get smacked down or silenced. The sycophants tossing softballs to Karine Jean-Pierre don’t really need a human being to answer them.\n\nMaybe the White House should just set up a kiosk, like those robot fortune-tellers at old-fashioned carnivals. Those who ask friendly questions will get a prefab answer, while those who diverge off script get a mild electrical shock. The Blaze reports on a White House event where a mechanized gypsy would have performed exactly as well:\n\nThe White House daily press briefing spiraled out of control on Tuesday when a reporter dared ask Dr. Anthony Fauci whether he has investigated the origins of COVID-19. As Fauci and Dr. Ashish Jha, the White House COVID response coordinator, were answering questions at the press briefing, Daily Caller White House correspondent Diana Glebova attempted to ask Fauci what he has done to investigate the origins of the COVID pandemic. Glebova shouted her question when Fauci finished answering a previous question, a routine practice when in a gaggle of reporters. White House press secretary Karine Jean-Pierre responded by scolding Glebova. “We have a process here. I’m not calling out on people who yell. You’re being you’re being disrespectful to your colleagues, and you’re being disrespectful to our guest,” Jean-Pierre said. “I will not call on you if you yell. And also you’re taking time off the clock, because Dr. Fauci has to leave in a couple of minutes.”\n\nAt this point a journalist from Africa, a continent where most media are still anachronistically free, joined in to support Glebova: “Today Africa News correspondent Simon Ateba intervened on behalf of his colleague, blurting out that Glebova had asked a ‘good question.’ ‘You need to call [on] people across the room! She has a valid question.’”\n\nOf course it received no answer. But we may squeeze some responses out of Fauci under oath yet:\n\nFor Pfizer, the Problem is ‘Resolved’ When Your Baby is Dead\n\nOkay, this next item is kind of a perfect storm of coolness: Steve Bannon interviewing Naomi Wolf on Lindell TV, as posted on Gettr by Tommy Robison. That brings together four of the bravest, most important activists on earth in a single media snippet. Too bad the subject matter is so depressing.\n\nNaomi Wolf tells Bannon what she discovered from poring over thousands of pages of Pfizer documents that truthtellers managed to pry from the U.S. government’s hands: When Pfizer got a report of a pregnant woman who miscarried after getting its vaccine, it categorized such deaths of unborn babies as “recovered, resolved Adverse Effects.” That sounds suspiciously like “Mission Accomplished.”\n\n\n\n So there’s more than one reason to call it the Dead Baby Vax.\n\nJoe Biden signed a G20 Bali Leaders’ Declaration pledging for America to adopt vaccine passports to “facilitate” international travel. Paragraph 23 of the declaration explains that “facilitating seamless international travel” in the future will require “trusted global digital health networks that should capitalize and build on the success of the existing standard and digital COVID-19 certificates.” The Biden regime also called for the “the establishment of trusted global digital health networks as part of the efforts to strengthen prevention and response to future pandemics,” based on “existing standards and digital COVID-19 certificates.” In the G20’s updated action plan regarding the United Nation’s 2030 Agenda for Sustainable Development, the global elite vowed to “move towards interoperability of systems including mechanisms that validate proof of vaccination, whilst respecting the sovereignty of national health policies, and relevant national regulations such as personal data protection and data-sharing.” This comes after Indonesia Minister of Health Budi Sadikin at the adjacent B20 Summit last week called for the creation of a “digital certificate acknowledged by WHO” to control the population’s movements.\n\nJust move along, people, nothing to see here.\n\nOur Woke Military is Preparing for CIVIL War\n\nPresident Joe Biden and his administration are weakening the U.S. military with a “woke” political ideology, according to a new report published on Monday by Sen. Marco Rubio (R-FL) and Rep. Chip Roy (R-TX). The 18-page report, titled “WOKE WARFIGHTERS: How Political Ideology is Weakening America’s Military,” documents several instances of both uniformed and civilian military leaders promoting racially charged theories … The Republican report points to Defense Secretary Lloyd Austin’s order in February of 2021 for a standdown to discuss extremism within the ranks of the military. The report states that the military expended more than 5,359,000 personnel hours on these standdown discussions on extremism. At the same time, the Biden Administration’s “Countering Extremist Activity Working Group” (CEAWG) found that “cases of prohibited extremist activity among service members were rare,” with only 100 cases among the more than 2.1 million personnel in the active and reserve components of the U.S. military. Keep in mind that in 2019, Pentagon diversity advisor Bishop Garrison “publicly tweeted that support for former President Donald Trump is support for extremism and racism.” FBI Admits It Can Hijack Your Cell Phone, Promises to Use Its Powers for Good Instead of Evil The always alarming Conservative Treehouse reveals something we’d rather not think about: Pegasus is “no click” targeting spyware that can be deployed against cellular phones, simply by inputting the phone number and transmitting to it. The Guardian previously reported, “Claudio Guarnieri, who runs Amnesty International’s Security Lab, said once a phone was infected with Pegasus, a client of NSO could in effect take control of a phone, enabling them to extract a person’s messages, calls, photos and emails, secretly activate cameras or microphones, and read the contents of encrypted messaging apps such as WhatsApp, Telegram and Signal.” [T]he U.S. FBI under Director Chris Wray purchased the Pegasus program for “FBI experiments” and “exploration” into how the spyware program could be used domestically. The FBI was initially reluctant to reveal their ownership of the Pegasus program, however, within FOIA documents related to the potential for domestic surveillance and concerns about fourth amendment constitutional protections, the FBI admitted they retain the capability – but promised it has not been deployed. Oh, okay then. Nothing to worry about. Of course the Special Counsel investigating pretty much every Trump supporter as potentially an “insurrectionist” won’t cite “national security” to hack your phone. Like stolen elections, a censored media, and autocratic restrictions on our freedom of movement, that kind of thing would never happen in America. Don’t miss Part II of the fun thought experiment “Dating the Donald,” which explains a presidency in terms of high school popularity contests. It’ll be up later this morning. For much more serious, but edifying fare, see Aliya Kuykendall’s latest installment of reports from the persecuted Church.\n\nJohn Zmirak is a senior editor at The Stream and author or co-author of ten books, including The Politically Incorrect Guide to Immigration and The Politically Incorrect Guide to Catholicism. He is co-author with Jason Jones of “God, Guns, & the Government.”", "opengraph": {"locale": "en_US", "type": "article", "title": "The Brew: Why Bother With a Human Press Secretary? Also, Pfizer Records Dead Babies as ‘Resolved Adverse Effects’ of the Vaccine - The Stream", "description": "When a pregnant woman takes Pfizer's COVID vaccine and her baby dies, Pfizer records that as a \"resolved adverse effect.\"", "url": "https://stream.org/the-brew-why-bother-with-a-human-press-secretary-also-pfizer-records-dead-babies-as-resolved-adverse-effects-of-the-vaccine/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-11-23T12:00:36+00:00", "article:modified_time": "2022-11-23T16:41:46+00:00", "image": "https://stream.org/wp-content/uploads/Fortune-Teller-e1669177034287.jpg", "image:width": "900", "image:height": "600", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/johnzmirak/", "https://stream.org/author/johnzmirak/", "http://www.daisurvey.com/StreamWebsite", "https://twitter.com/ben_kew/status/1595258788164009990?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1595258788164009990%7Ctwgr%5E9e1dd01823a7c5a07e2d3f85607912e5cd8b4b91%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fstream.org%2Fwp-admin%2Fpost.php%3Fpost%3D518705action%3Dedit", "https://en.wikipedia.org/wiki/Fortune_teller_machine", "https://www.theblaze.com/news/jean-pierre-shuts-down-reporter-covid-origins", "https://stream.org/donate/", "https://www.washingtonexaminer.com/policy/healthcare/rand-paul-dr-fauci-covid-coronavirus-origins-investigation", "https://gettr.com/post/p1zbnya7ea5?fbclid=IwAR2tkGAi6qklmpRoD8C5LwnB83IsuqNZQzhGDQ9j1Yhjw52m_AhDSsj34dU", "https://stream.org/to-save-ourselves-from-covid-were-sacrificing-children-part-3-more-baby-parts-are-needed-all-the-time/", "https://www.infowars.com/posts/biden-signs-g20-declaration-agreeing-to-force-americans-to-use-vaccine-passports-for-international-travel/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf", "https://americanmilitarynews.com/2022/11/rubio-roy-release-woke-military-investigative-report/", "https://www.rubio.senate.gov/public/_cache/files/ee1d7a86-6d0c-4f08-bd15-24e5b28e54b7/3756824FA9C21B819BB97AAB16221530.woke-warfighters-report-3.pdf", "https://www.defense.gov/News/News-Stories/Article/Article/2492530/austin-orders-military-stand-down-to-address-challenge-of-extremism-in-the-ranks/", "https://twitter.com/bishopgarrison/status/1155284928323620864", "https://theconservativetreehouse.com/blog/2022/11/22/foreboding-signals-amid-discovery-the-fbi-can-launch-pegasus-cell-phone-targeting-with-appointment-of-special-counsel/", "https://www.theguardian.com/world/2021/jul/18/revealed-leak-uncovers-global-abuse-of-cyber-surveillance-weapon-nso-group-pegasus", "https://stream.org/iranian-christian-imprisonment-rape-torture-sharing-gospel/", "https://stream.org/author/johnzmirak/", "https://www.amazon.com/Politically-Incorrect-Guide-Immigration-Guides/dp/1621576736", "https://www.amazon.com/Politically-Incorrect-Guide-Catholicism/dp/1621575861", "https://stream.org/secondamendment/"], "authors": ["John Zmirak"], "publish_date": "2022-11-23T12:00:36+00:00"}