{"result_id": "306041", "URL": "https://stream.org/government-expands-list-of-unvaccinated-now-tracking-both-medical-and-religious-exemptions/", "timestamp": "2023-04-25 17:34:25 CEST+0200", "meta": {"description": "The Commerce Department is going to keep a record of all employees seeking a medical exemption from President Joe Biden’s COVID-19 vaccine mandate, under a proposed regulation.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/government-expands-list-of-unvaccinated-now-tracking-both-medical-and-religious-exemptions/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Government Expands List of Unvaccinated, Now Tracking Both Medical and Religious Exemptions", "cleaned_text": "The Commerce Department is going to keep a record of all employees seeking a medical exemption from President Joe Biden’s COVID-19 vaccine mandate, under a proposed regulation.\n\nThe new rule, placed on the Federal Register on Tuesday, will be the subject of public comment until March 28. The proposal comes as the Biden administration considers keeping a list of workers who apply for religious exemptions to the vaccine mandate for federal employees.\n\nThe Commerce Department has about 47,000 employees and an $11.4 billion annual budget.\n\nThe new rule would undermine the personal freedom of federal employees, Sen. Ron Johnson, R-Wis., a critic of federal COVID-19 policies, said.\n\n“As I have said repeatedly, these pointless vaccine mandates are a direct violation of the personal freedom of Americans,” Johnson told The Daily Signal in a written statement. “Treating COVID-19 medical exemptions as ‘disability accommodations’ shows how little the Biden administration and the COVID gods value liberty and informed consent.”\n\nIn the short term, the Biden administration’s move might be a moot point as a federal judge last week blocked the administration from enforcing the president’s executive order that every federal worker must be vaccinated.\n\nRep. Chip Roy, R-Texas, who has pushed an effort in Congress to defund vaccine mandates, also criticized the Commerce Department rule.\n\n“First it was tracking religious dissenters, now it is those who — for the best interest of their health — are advised not to get the COVID-19 vaccine,” Roy told The Daily Signal in a written statement, adding:\n\nGuidelines from the Safer Federal Workforce Task Force, used by federal agencies, puts the processing of exemption applications on hold while an executive order has been enjoined.\n\nThe Daily Signal first reported Jan. 11 that the Biden administration was testing a policy at a small federal agency, the Pretrial Services Agency for the District of Columbia, that likely would serve as a model for government-assembled lists of Americans who object to taking the COVID-19 vaccines on religious grounds.\n\nFour days later, The Daily Signal reported that 18 other federal agencies are considering doing so.\n\nThe Supreme Court on Jan. 13 rejected a Biden administration mandate requiring all private employers with 100 or more workers to make sure those employees are vaccinated or undergo regular tests for COVID-19. However, the high court upheld the administration’s vaccine mandate for employees of health care facilities that accept Medicare and Medicaid.\n\nIn a separate action, Biden imposed the vaccine mandate on federal employees and contractors.\n\nAccording to the Federal Register, the process continues with two steps at the Commerce Department, explaining:\n\nThe agency will be required to keep confidential any medical information provided, subject to the applicable Rehabilitation Act standards. This medical exemption form is necessary for Commerce to determine legal exemptions to the vaccine requirement under the Rehabilitation Act. The form ‘Request for a Medical Exception to the COVID-19 Vaccine Requirement’ will be completed by employees who seek a medical exception to the federal employee vaccine mandate, and by their personal medical providers. To request a medical exemption from the COVID-19 vaccination requirement, an employee must complete Part 1 of the medical exemption form and their medical provider must complete Part 2. The [department’s] reasonable accommodation coordinators would receive this form from the requester and use it to make a recommendation to the supervisor based on the medical information provided in the form.\n\nThis development should concern liberals, libertarians, and conservatives, said Cully Stimson, deputy director of the Meese Center for Legal and Judicial Studies at The Heritage Foundation, which is the parent organization of The Daily Signal.\n\n“This means, in other words, the government will list every single person claiming a medical exemption,” Stimson told The Daily Signal. “Everyone who pushes back against this government overreach, even if a doctor says they can’t take the vaccine, will be part of a list, which is really creepy.”\n\nStimson said the Commerce Department probably will be a model for the rest of the federal government in adding the requirement.\n\nHe noted that the provision says that once an employee fills out the form, the “reasonable accommodation coordinators” within the Commerce Department would use the form “to make a recommendation to the supervisor based on the medical information provided in the form.”\n\nA spokesperson from the Commerce Department did not respond to The Daily Signal’s phone and email inquiries Wednesday for this report.\n\nCollecting certain information is necessary, but employee privacy will be protected, an Office of Management and Budget spokesperson told The Daily Signal.\n\n“To process an employee’s medical exception, agencies need to collect certain information, including, for example, the employee’s name, the request for an exception and, if they are provided one, that they have been granted an exception,” the OMB spokesperson said in an email, adding:\n\nThe Pretrial Services Agency will begin storing names and “personal religious information” of employees who make “religious accommodation requests for religious exemption from the federally mandated vaccination requirement,” Sarah Parshall Perry and GianCarlo Canaparo, legal fellows with Heritage’s Meese Center for Legal and Judicial Studies, wrote in their Jan. 11 article in The Daily Signal breaking the news on the pilot program.\n\nPerry and Canaparo followed up Jan. 15 by reporting that 18 other federal agencies were considering making similar lists of religious objectors to the vaccine mandate.\n\nThis week, 41 House Republicans signed onto a letter to Biden accusing his administration of targeting Americans who seek religious exemptions, The Daily Signal’s Mary Margaret Olohan first reported.", "opengraph": {"locale": "en_US", "type": "article", "title": "Government Expands List of Unvaccinated, Now Tracking Both Medical and Religious Exemptions - The Stream", "description": "The Commerce Department is going to keep a record of all employees seeking a medical exemption from President Joe Biden’s COVID-19 vaccine mandate, under a proposed regulation.", "url": "https://stream.org/government-expands-list-of-unvaccinated-now-tracking-both-medical-and-religious-exemptions/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-01-27T15:03:23+00:00", "image": "https://stream.org/wp-content/uploads/51432857318_9324fbd04e_o-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/fredlucas/", "https://stream.org/author/fredlucas/", "http://www.daisurvey.com/StreamWebsite", "https://www.federalregister.gov/documents/2022/01/25/2022-01431/agency-information-collection-activities-submission-to-the-office-of-management-and-budget-omb-for", "https://www.dailysignal.com/2022/01/15/18-more-federal-agencies-eye-making-vaccine-religious-objector-lists/", "https://www.linkedin.com/company/u-s-department-of-commerce/", "https://www.cnbc.com/2022/01/21/biden-covid-vaccine-rules-judge-blocks-mandate-for-federal-workers.html", "https://townhall.com/tipsheet/rebeccadowns/2022/01/26/rep-chip-roy-is-willing-to-shut-down-government-over-vaccine-mandates-n2602417", "https://www.saferfederalworkforce.gov/downloads/FAQs_compliance_injunction_EO%2014043_20220124.pdf", "https://www.dailysignal.com/2022/01/11/breaking-biden-administration-making-lists-of-religious-vaccine-objectors/", "https://www.dailysignal.com/2022/01/24/doctors-highlight-problems-with-nations-covid-19-response/", "https://www.dailysignal.com/2022/01/13/supreme-court-kills-bidens-covid-19-vaccine-mandate-for-private-employers/", "https://www.eeoc.gov/statutes/rehabilitation-act-1973", "https://stream.org/donate/", "https://www.dailysignal.com/2022/01/11/breaking-biden-administration-making-lists-of-religious-vaccine-objectors/", "https://www.dailysignal.com/2022/01/15/18-more-federal-agencies-eye-making-vaccine-religious-objector-lists/", "https://www.dailysignal.com/2022/01/24/exclusive-republican-lawmakers-accuse-biden-administration-of-targeting-federal-employees-seeking-religious-exemptions-from-covid-vaccine/", "https://www.dailysignal.com/2022/01/26/exclusive-government-expands-list-of-unvaccinated-now-tracking-both-medical-and-religious-exemptions/"], "authors": ["Fred Lucas"], "publish_date": "2022-01-27T15:03:23+00:00"}