{"result_id": "306044", "URL": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-ii-our-fascist-moment/", "timestamp": "2023-04-25 17:34:31 CEST+0200", "meta": {"description": "Our elites seek to overturn the verdict of the 20th century, and use the Vaccine to reinstate Soviet/Fascist totalitarianism.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-ii-our-fascist-moment/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Vaccine Is a Toxic Sacrament of Globalism, Paternalism, and Abortion, Part II: Our Fascist Moment", "cleaned_text": "In my last column, I detailed the appalling contempt for innocent human life entailed in making COVID vaccines that depend on body parts stolen from unborn children. Here I will explain why our elites have chosen to make those vaccines the sacrament of their new and intolerant religion. (Teachers have children writing hymns to the Vax, and researchers are making it in the form of communion hosts. But I’m sure there’s a scientific explanation for that.)\n\nYes, there are billions of dollars to be made. No, our godless elites don’t believe in an afterlife. In fact, they are mostly pagan cowards obsessed by the fear of death. Such cowardice is contagious, from president to pastor, from pulpit to pew. But there’s something else much simpler happening. More fundamental.\n\nOligarchs and their courtiers want to reverse the verdict of the 20th century, here in the 21st. The fall of the Soviet Union on Christmas Day, 1991, marked the reading of that verdict. The trial had been long and brutal, the issue long in doubt. Was mankind the image of God endowed by Him with dignity and freedom? Or was he the fruit of brute biological accident and strife as Darwin and Hitler taught? A trousered beast best governed in a colony like a termite, as Marx and Lenin taught?\n\nI wrote my first book in 2000 on social philosopher and economic Wilhelm Röpke, the first professor fired by the Nazis for his politics — and later the intellectual father of the Christian Democratic movement and the German economic miracle. Let me quote from it here:\n\nIn 1933, when Röpke chose exile over compromise, he joined what appeared to be the losing side of history. All around the world — even in the bastion of classical liberalism, the United States — the leaders of respectable opinion embraced the growing power of the state. The notion of a “planned” economy, centrally directed by state managers, appealed to men who had been dazzled by the success of mass manufacturing, who had watched as Henry Ford broke down the work of individual craftsmen into the efficient operations of the automobile assembly line, generating billions of dollars in new wealth. So-called “efficiency experts,” led by F.W. Taylor, proclaimed a new science of work (or “ergonomics”), by which human labor could be analyzed, dissected, and reassembled for maximum productivity. If this could be done on the factory floor — with such a vast increase of efficiency over the old, individualized production of craftsmen — surely the same methods must succeed on a grand scale. The labor of an entire society could be rationalized, coordinated and optimized after the metaphor of a great factory, eliminating the waste, turbulence and inequities of capitalism just as mass manufacturing had smoothed out the flaws and inefficiencies of small-scale, artisan production. It seemed intuitively obvious: that the economies of scale which applied to individual businesses could be extended to whole industries and ultimately to the economy as a whole. Totalitarian regimes had triumphed in Russia, Italy, and now Germany, crushing internal opposition and enacting bold measures to change a corrupt, unjust economic system. The New Deal in the United States proposed (through the National Recovery Act, later declared unconstitutional) to set wage and price levels across whole industries — a measure inspired by similar efforts in Italy. Meanwhile, the intelligentsia in France seemed divided about evenly between authoritarian nationalists, led by the Action Française, and socialists aligned with Stalin’s Popular Front. Even in old liberal England, so talented a politician as Sir Oswald Mosley had left the (Marxist-tinged) Labor Party to lead the British Fascist movement, confident that he had joined “the conquering force of the modern age.” In speech and article, Mussolini crowed, “Liberalism is dead.” Certainly, he had reason to be confident; few men at the time were willing to defend the creaking old system.\n\nHuman Dignity Won the Battle. But the War Is Still On\n\nFrom the Battle of Britain in 1940 until the collapse of the Soviet Union, that conflict continued to rage. But with the collapse of the Eastern Bloc, the old “liberalism” that treasured freedom seemed to be vindicated. No, it was not “more efficient” or “rational” to let a few bureaucrats in centralized governments make all economic decisions. In fact, that path led to chaos, famines, shortages, squalor, censorship, prison camps and secret police.\n\nNo, free societies and the free economies suited to them did not amount to “anarchy,” as the dictators and intellectuals had claimed. In fact, these free institutions generated spontaneous order — as free men following their own minds explored different paths to prosperity, knowledge, and health. That was why thousands died at the Berlin Wall, always trying to get out of a socialist planned society. No one ever stubbed a toe attempting to get in.\n\nThat verdict seemed final in the 1990s and for a decade or so after. But it never satisfied everyone. In fact, it outraged many. Elites who have abandoned the God of the Bible find it hard to let ordinary people live, or work, or breed in peace. That’s why a modern Ivy League professor is much more of a tyrant than any blood-stained medieval warlord. The professor sees the “Deplorables” as frightening, ignorant menaces, who are shockingly ungrateful when they reject his wise plan for their lives.\n\nMargaret Sanger had proposed back in 1934 a National Baby Code, a fascist-inspired federal plan to require “baby licenses” for would-be parents. By the 1990s her group had shed its eugenic Klan hood for the white coat of a specialist in “overpopulation.” Unable to claim with a straight face, in the ashes of the Soviet Bloc, that socialist economics were more “efficient,” our elites grabbed onto ecology. They claimed that climate change, instead of the global proletarian revolution, licensed strict controls by the likes of themselves over how ordinary people lived, worked, and bred.\n\nThat didn’t sell. Not well enough. Post-Christian Westerners couldn’t be convinced to adopt austerity now for the sake of grandchildren they weren’t sure they even wanted.\n\nElites who wished to reverse the freedom verdict of 1991 needed more urgent methods. They required a threat that imperiled people today, threatened them with losing years or decades of this mortal earthly life. To those without a firm belief in the afterlife, that means … literally everything. If you feel as if the universe winked into life with your birth, and might as well wink out at your moment of death, you’re the ideal tool for tyrants. If the authorities you trust — the 23-year-olds who control the news feed on your Yahoo account — tell you that your neighbor is a mortal threat to you if he defies a lockdown or refuses a vaccine? You’re all too prone to believe it. You tremble at any threat.\n\nAnd lo, we saw that the new tyrants’ strategy succeeded around the world. Citizens live in lockdown for months and years at a time — not complaining of their lost freedoms, but scapegoating those who resist it. People who claim to believe that absolute bodily autonomy and “privacy” license legal abortion will gladly produce their vaccine passport for the right to eat at McDonalds.\n\nAnd they’ll fear, hate, blame and persecute those of us whose faith in an afterlife goads us to demand freedom in this one. They’ll celebrate the silencing of eminent doctors, like MRNA vaccine inventor Robert Malone, just permanently banned from Twitter, with the same satisfaction as “Good Germans” watching dissenters get dragged off to prison camps.\n\nNo, COVID hasn’t vanished. Yes, it’s worse in locked-down cities like New York City and Washington, D.C. Yes, the death rate is higher in places that ruined their small businesses and wrecked children’s school years than in open states such as Florida. No, the vaccine doesn’t make anyone feel safe. In fact, it is killing thousands. But the elites intent on control for its own sake, on a public health dictatorship, control the flow of information as ruthlessly as the Soviets — and much more effectively.\n\nLockdowns and the Vaccines are the Five Year Plan, which cannot be questioned, lest it undermine our elites’ authority. Anthony Fauci is the sole source of medical wisdom. His critics must be silenced, lest alternative solutions discredit his. A single, global, top-down solution to the virus must be imposed on every nook and cranny of Earth, lest the success of dissenters and their medical free market expose this massive political scam for grabbing unchecked power.\n\nAfter failing spectacularly to generate prosperity or happiness, collectivism has risen from its Russian grave as the patron of this Chinese virus, which it uses to threaten us with death.\n\nLet’s laugh at those threats, and the cowards who repeat them. Our faith in the afterlife will redeem this short life as well.\n\nJohn Zmirak is a senior editor at The Stream and author or co-author of ten books, including The Politically Incorrect Guide to Immigration and The Politically Incorrect Guide to Catholicism. He is co-author with Jason Jones of “God, Guns, & the Government.”", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccine Is a Toxic Sacrament of Globalism, Paternalism, and Abortion, Part II: Our Fascist Moment - The Stream", "description": "Our elites seek to overturn the verdict of the 20th century, and use the Vaccine to reinstate Soviet/Fascist totalitarianism.", "url": "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-ii-our-fascist-moment/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-12-30T20:00:41+00:00", "article:modified_time": "2022-01-20T02:33:38+00:00", "image": "https://stream.org/wp-content/uploads/Hitler-in-Paris.jpg", "image:width": "900", "image:height": "832", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "climate change", "Abortion", "COVID", "Biden Scandal", "Banking Crisis", "Revival", "China", "Anthony Fauci", "Transgender", "Robert Malone"], "tweets": [], "movies": [], "links": ["https://stream.org/author/johnzmirak/", "https://stream.org/author/johnzmirak/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/the-vaccine-is-a-toxic-sacrament-of-globalism-paternalism-and-abortion-part-i-a-freezer-full-of-murder-victim-sandwiches/", "https://stream.org/tag/covid/", "https://stream.org/should-teachers-force-public-school-kids-to-compose-prayers-to-the-vaccine-asking-for-a-friend/", "https://www.lifesitenews.com/news/researchers-develop-vaccine-technology-in-wafer-form-identical-to-catholic-host-used-at-mass/", "https://stream.org/sgt-pepper-and-the-fall-of-the-soviet-union/", "https://stream.org/what-if-the-nazis-had-really-lost-world-war-ii-part-2-imagining-such-a-timeline/", "https://stream.org/to-elites-we-are-mystery-meatballs-nothing-more/", "https://stream.org/donate/", "https://www.amazon.com/gp/product/1882926676/ref=dbs_a_def_rwt_bibl_vppi_i11", "https://www.humancoalition.org/2019/04/11/the-abcs-of-the-american-baby-code/", "https://stream.org/tag/climate-change/", "https://stream.org/tag/robert-malone/", "https://stream.org/tag/anthony-fauci/", "https://stream.org/author/johnzmirak/", "https://www.amazon.com/Politically-Incorrect-Guide-Immigration-Guides/dp/1621576736", "https://www.amazon.com/Politically-Incorrect-Guide-Catholicism/dp/1621575861", "https://stream.org/secondamendment/"], "authors": ["John Zmirak"], "publish_date": "2021-12-30T20:00:41+00:00"}