{"result_id": "306024", "URL": "https://stream.org/like-an-old-style-jim-crow-racist-washingtons-mayor-is-keeping-black-kids-out-of-school/", "timestamp": "2023-04-25 17:33:47 CEST+0200", "meta": {"description": "For solid historical reasons, black parents distrust government vaccine mandates. So why is D.C.'s mayor kicking 40% of black kids out of school?", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/like-an-old-style-jim-crow-racist-washingtons-mayor-is-keeping-black-kids-out-of-school/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Like an Old-Style Jim Crow Racist, Washington's Mayor Is Keeping Black Kids Out of School", "cleaned_text": "“Civil Rights” and community leaders, like cowards, refuse to address the disproportional abuse and injustices of Mayor Muriel Bowser and Washington D.C. schools via mandated Covid vaccines. Community leaders’ silence on issues of Leftist/Progressives’ confirmed injustice is typical. They never go against their “overlords” (including the CDC, NIH, and other nefarious Left-dominated agencies) who demand complete obedience and conformity to vaccine mandates.\n\nIt’s quite illuminating to recognize that as onerous mandates disproportionally and negatively impact black students this school year, “community leaders” ignore any harmful impacts on students and their families.\n\nConsider the fact that approximately 40%+ of black students in the D.C school districts have not received the Covid 19 “vaccination.” But Washington, D.C., school districts confirm a willingness to prevent all “un-vaxed” students from receiving education. The schools are expressly aiming to deny approximately 40% of black kids an education.\n\nThat move adds another burden to students already traumatized by “community lockdowns,” Covid- related deaths of family and friends (including suicide), exacerbated learning “gaps” due to lack of in-person classroom studies, and myriad other issues. These students are now being forced to either get “the jab” or miss another year of schooling.\n\nWith new revelations about the Covid “vaccines” (mostly confirming ineffectiveness and significant health “issues”), the stance of Washington, D.C., schools gives unnecessary ultimatums, facing parents with an untenable dilemma. Mayor Bowser and associated school boards should be roundly condemned for abusively brutish tactics and reprobation toward students.\n\nFacts confirm children have nearly 100% resiliency against Covid 19. They represent the most resilient demographic! Parents know those facts and are aware of the various side effects (some life-threatening) caused by the “vaccines.” Covid 19 vaccines have a spotty and risky track record of effectiveness with younger demographics. In particular, Covid 19 “vaccines” seem to correlate with marked increases in unexplained side effects (including heart failure and “sudden death”) in school-aged children. Since children are confirmed to be the most resilient to Covid 19, the “risk” vs. “reward” calculus seems to justify vaccine hesitancy.\n\nThe Washington, D.C., school vaccine mandate demonstrates gross disregard and callous disrespect for parents and students as they prudently consider the best and safest way to protect the children’s health. This issue is especially problematic for black parents. Ever since prior incidents, such as when the U.S government used forced sterilizations and grotesque syphilis experiments against the black community in the early 1900s, blacks have been suspicious, wary, and naturally wary of government “mandates” for vaccines and associated experiments.\n\nRemember, the U.S. government used mandates to mercilessly and insidiously sterilize over 60,000 women (overwhelmingly black) under the guise of “mandates” from the 1920s through the 1970s. The Buck v. Bell Supreme Court precedent allowed state governments to sterilize people it considered “genetically unfit.” Likewise, the U.S government experimented with syphilis on 600+ unwitting black men in the Tuskegee study from the 1930s through the 1970s.\n\nThe targeting of black Americans was and remains evil. The black community has not forgotten the history of vaccines that were used against it, and is now naturally vaccine and experimentation “hesitant.” This should be understood and respected, not maligned and neglected!\n\nIt seems the Washington D.C. mayor, school districts, and associated community groups are more motivated to appease the demands of pharmaceutical overlords and special interests. Yet, at the same time, concerned parents are determined to prioritize the need to protect their children. Who’s right?\n\nLong-term health effects of Covid 19 vaccines are being uncovered daily, and it’s clear that health outcomes for children far outweigh the need for the “vaccines” themselves. So instead of withholding learning using threats, grotesque coercion, and pressure, the school systems should be commending parents for exercising wisdom and prudence over concerns about their children’s well-being. Likewise, instead of withholding all options for learning, Washington D.C. schools should offer non-vaxed children the ability to (at least) attend school virtually.\n\nRecent health disclosures by the CDC, foreign governments, and other agencies require parents to exercise prudence. My organization, Every Black Life Matters (EBLM) respects parents and stands with them in defiance of D.C Mayor Bowser and all other agencies that are trampling fundamental parental rights.\n\nEBLM rebukes the callousness of Mayor Bower, and asks that, in recognition of myriad issues affecting “vaccine hesitancy,” all children be allowed to learn and excel. Just as recent rulings found Washington, D.C’s vaccine mandates for government workers to be unconstitutional, we believe the onerous mandates for children to be vaccinated before school participation are also unconstitutional. Education should not be used as a tool of coercion to meet the demands of pharmaceutical companies and politicians. Our children mean more to the future success of our community than compliance with abusive schemes that enrich greedy pharmaceutical companies while accelerating health risks for future generations.\n\nWhether it’s vaccines, racist propaganda (like CRT) or “comprehensive sex education” curricula, EBLM stands with parents everywhere who exercise wisdom and prudence on behalf of their children. In our minds, “vaccine hesitancy” to protect your children is not ignorant or reckless – it’s commendable!\n\nKevin McGary is an entrepreneur, author, and public speaker. In the arena of civic engagement, Kevin serves as President of Every Black Life Matters, Chairman of the Frederick Douglass Foundation of California and is an executive with the Douglass Leadership Institute and the Northstar Leadership PAC.", "opengraph": {"locale": "en_US", "type": "article", "title": "Like an Old-Style Jim Crow Racist, Washington's Mayor Is Keeping Black Kids Out of School - The Stream", "description": "For solid historical reasons, black parents distrust government vaccine mandates. So why is D.C.'s mayor kicking 40% of black kids out of school?", "url": "https://stream.org/like-an-old-style-jim-crow-racist-washingtons-mayor-is-keeping-black-kids-out-of-school/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-09-07T17:00:13+00:00", "article:modified_time": "2022-09-07T14:39:13+00:00", "image": "https://stream.org/wp-content/uploads/Mayor-Muriel-Bowser.jpg", "image:width": "900", "image:height": "600", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/kevin-mcgary/", "https://stream.org/author/kevin-mcgary/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/donate/"], "authors": ["Kevin McGary"], "publish_date": "2022-09-07T17:00:13+00:00"}