{"result_id": "306011", "URL": "https://stream.org/victims-vs-vectors-the-ethics-of-giving-covid-19-vaccines-to-children/", "timestamp": "2023-04-25 17:33:18 CEST+0200", "meta": {"description": "Fifty years ago, I began medical school. Through this half century, I have provided, prescribed, promoted, and supported vaccine use. As a physician in retirement, I am fully vaccinated and boosted for COVID-19, as are my grown sons and three of my young adult grandchildren.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/victims-vs-vectors-the-ethics-of-giving-covid-19-vaccines-to-children/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Victims vs. Vectors? The Ethics of Giving COVID-19 Vaccines to Children", "cleaned_text": "Fifty years ago, I began medical school. Through this half century, I have provided, prescribed, promoted, and supported vaccine use. As a physician in retirement, I am fully vaccinated and boosted for COVID-19, as are my grown sons and three of my young-adult grandchildren.\n\nVaccine development has a proud history that has prevented millions of children and adults from becoming the victims of infectious diseases. But are children’s COVID-19 vaccines now being used to prevent serious illness in children or as a vector-control mechanism to protect adults?\n\nI rejoiced as the Hemophilus influenza type b vaccine saved thousands of infants and children from death or serious disease caused by meningitis and sepsis. I followed the public health science that tracked data and research on the risks, costs, and benefits of vaccines to prevent chickenpox, rotavirus, and many other — now preventable — diseases.\n\nThe Hemophilus influenza type b, or Hib, vaccine was a classic study in recognizing and responding to a health threat in children. Data were collected on the frequency of hospitalizations, permanent disabilities, sepsis, meningitis, and death associated with Hib infection in infants and toddlers. Risk, benefit, and cost analyses were developed. Immunized children were monitored for efficacy and adverse effects, both short-term and long-term. The success of that vaccine is a win for nations as well as families.\n\nThe ethics of child vaccines should reflect the high standards like this, which have been used since the enactment of the National Childhood Vaccine Injury Act in 1986.\n\nI know this well, as I practiced pediatrics through the turbulent era of rare but serious side effects associated with the pertussis vaccine, which a National Institutes of Health study concluded caused severe reactions in children such as seizures, hypotonic-hyporesponsive episodes, high fevers, and persistent crying.\n\nThis led to the passage of the National Childhood Vaccine Injury Act of 1986 Vaccine Injury Compensation Program, which helps promote development of safe vaccines, addressed compensation for injured vaccine recipients, and simultaneously mandated tracking of vaccine distribution and adverse effects, leading to better vaccine programs and fewer preventable infectious diseases.\n\nFew Children Suffer Serious Infections From COVID\n\nTwenty-four months of the SARS-CoV-2 pandemic has demonstrated that few healthy children infected with the virus become victims of severe illness and that those most likely to need intensive care already have previously diagnosed significant health conditions. Most children and youth experience a relatively short duration of illness with low rates of hospitalizations and few deaths. Children are a magnificently resilient group. They appear to develop robust natural immunity.\n\nAlthough children can be asymptomatic spreaders, some studies indicate that transmission rates between children and within families are lower than between adults. School environments, with some precautions and good ventilation, are surprisingly safe places.\n\nBased on how rapidly the SARS-CoV-2 virus mutates, it may be difficult to develop effective vaccines to keep pace with new mutations, such as the omicron variant. It is possible that youth have been blessed with the capacity to respond successfully, and much more rapidly, to these variants than the scientists who are manufacturing the vaccines!\n\nWhy Push the COVID Vaccine on Children?\n\nConsidering the above, what is the ethical framework for promoting widespread or mandated pediatric COVID-19 vaccination?\n\nRecognizing that children make up a minuscule percentage of severe COVID-19 cases, why are so many health, education, pharmaceutical, and political leaders vigorously promoting pediatric vaccination? Where are the data-based risk-cost-benefit analyses to support their recommendations?\n\nLocal and systemic vaccine reactions occur in 30 to 60% of children 5 to 11 years old, according to the Centers for Disease Control and Prevention. Myocarditis, or inflammation of the heart, is rare in that age group but increases in teen and early adult years, especially for males, as noted in multiple countries. Only short-term observations inform our understanding of the vaccine in children and youth. Long-term efficacy and side effects need to be monitored.\n\nIn the setting of a highly infectious, highly prevalent virus that appears to be approaching an endemic state, much like colds or the flu, are children to assume the ethical burden of vaccination to protect the larger society when the resulting benefit to them may be minimal and the potential long-term risks and benefits are not fully understood?\n\nHistory Will Judge How We’re Treating Our Children\n\nIf we are concerned that children would serve as the distributors of disease, much as a mosquito is for malaria, does that reduce the obligation of researchers, clinicians, and public health experts to analyze — both medically and ethically — the full spectrum of risks, benefits, and potential impacts of this vaccine on children? Are we fulfilling the medical, regulatory, and ethical standards that have developed since the 1986 National Childhood Vaccine Injury Program?\n\nChildren with chronic or immunocompromised conditions and/or who are living with close family members with such conditions should be vaccinated, but one must ask whether the promotion of universal child vaccination for COVID-19 is driven by the evidence-based risk of severe disease, death, or disability in children, or by fear and expediency to benefit adults.\n\nIn another 50 years, I wonder if historians will observe that we treated children as disease vectors rather than potential victims of a viral illness.\n\nAlma Golden is a pediatrician who practiced for 35 years. She served as the assistant administrator for global health at the U.S. Agency for International Development and as the deputy assistant secretary for population affairs at the U.S. Department of Health and Human Services.", "opengraph": {"locale": "en_US", "type": "article", "title": "Victims vs. Vectors? The Ethics of Giving COVID-19 Vaccines to Children - The Stream", "description": "Fifty years ago, I began medical school. Through this half century, I have provided, prescribed, promoted, and supported vaccine use. As a physician in retirement, I am fully vaccinated and boosted for COVID-19, as are my grown sons and three of my young adult grandchildren.", "url": "https://stream.org/victims-vs-vectors-the-ethics-of-giving-covid-19-vaccines-to-children/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-03-01T18:00:57+00:00", "article:modified_time": "2022-02-28T23:04:21+00:00", "image": "https://stream.org/wp-content/uploads/iStock-1315887649-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["http://www.daisurvey.com/StreamWebsite", "https://pubmed.ncbi.nlm.nih.gov/8502521/", "https://www.justice.gov/civil/vicp", "https://stream.org/donate/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-12-16/05-COVID-Su-508.pdf", "https://jamanetwork.com/journals/jamapediatrics/fullarticle/2789584?guestAccessKey=d3f469e1-539d-42c6-b8c0-2fce1cb4b49e&utm_source=silverchair&utm_medium=email&utm_campaign=article_alert-jamapediatrics&utm_content=olf&utm_term=022522", "https://www.dailysignal.com/2022/02/28/victims-vs-vectors-the-ethics-of-giving-covid-19-vaccines-to-children/"], "authors": ["Aliya Kuykendall"], "publish_date": "2022-03-01T18:00:57+00:00"}