{"result_id": "306027", "URL": "https://stream.org/the-lefts-vaccine-hypocrisy/", "timestamp": "2023-04-25 17:33:53 CEST+0200", "meta": {"description": "If Americans capitulate, how many times will they be forced to bare their arms and take whatever an ambitious politician requires? That decision has to be voluntary.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-lefts-vaccine-hypocrisy/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Left's Vaccine Hypocrisy", "cleaned_text": "The left wants liberty for pregnant women but tells the rest of us to pound salt.\n\nOn Monday, lame-duck New York City Mayor Bill de Blasio announced, “Omicron is here, and it looks very transmissible.” So, de Blasio, ignoring scientific evidence that current COVID-19 vaccines will not stop the variant from spreading, decreed all private sector workers in businesses of all sizes must be vaccinated by Dec. 27.\n\nThe mandate also applies to children as young as 5, who must take the vaccine to participate in school activities such as band or be taken to a restaurant or movie theater.\n\nThere will be no testing alternative, though the city says it will offer exemptions for valid religious or medical reasons, whatever that means.\n\nA mayor who professes to defend bodily autonomy is doing the opposite, forcing everyone to take the shots, regardless of personal qualms. This is the same de Blasio who warned at a recent Brooklyn pro-abortion rights rally that “You cannot have your government attempt to take away your right to control your body. It cannot happen in America.”\n\nWell, it can, as long as you’re something other than a childbearing female. Across the country, states and cities run by Democrats are imposing vaccine mandates.\n\nAbortion Okay, but No Bodily Autonomy When It Comes to the Vaccine\n\nAt the same time, Democratic politicians, civil rights groups and their media allies are in a frenzy that the Supreme Court might allow states to restrict abortion. Congressional Democrats are even willing to pack the Supreme Court to stop it, a scheme most Americans oppose.\n\nNew York Times columnist Michelle Goldberg slams abortion restrictions as “an infinitely more invasive form of biopolitical control” than mandatory vaccines. The View host Whoopi Goldberg (no relation except their shared hypocrisy on this issue) is OK with compulsory vaccines but when it comes to limiting access to abortion, she says, “How dare you?”\n\nThe pro-abortion rights American Civil Liberties Union sees “no civil liberties problem with requiring COVID-19 vaccines,” calling mandates a “justifiable intrusion” because bodily autonomy “does not include the right to inflict harm on others.”\n\nThat would make sense if science showed unvaccinated people are a risk to others. But research indicates that COVID-19 vaccines protect the person getting the shots from severe disease but don’t reliably prevent transmission, according to findings in Lancet Infectious Diseases.\n\nWhat We Know\n\nWhat little we know about omicron suggests it’s more contagious than delta, less likely to be contained by current vaccines and the next dominant strain in the U.S. It has already overtaken delta in parts of South Africa.\n\nThis week, the Supreme Court will vote whether to hear a challenge to Maine’s mandate that all health care workers get vaccinated.\n\nBut that ruling is irrelevant. In 1905, the smallpox vaccine had been in use for over a century, while the COVID vaccines are brand-new and evolving. Back then, smallpox killed over one-third of those infected, while the death rate from COVID is under 1%. The smallpox vaccine prevented infection, protecting not just the vaccinated but the community — a powerful argument to make it mandatory. The COVID vaccines are disease tamers, reducing the risk of death or serious illness but not preventing spread.\n\nCenters for Disease Control and Prevention director Rochelle Walensky says she’s unsure current vaccines will contain omicron but hopes “they can prevent severe disease and keep people out of the hospital.” In that case, getting jabbed is your own business and nobody else’s.\n\nNew Formulas Mean New Shots\n\nTop executives at vaccine maker Moderna predict their current vaccine will not do well against omicron. The company is already starting on a new formulation.\n\nExpect that pattern — a new variant followed by new shots — to be repeated. National Institutes of Health head Francis Collins said that omicron possibly won’t be the last variant we face.\n\nIf Americans capitulate, how many times will they be forced to bare their arms and take whatever an ambitious politician requires? I am pro-vaccine and I’ve had three jabs — but that decision has to be voluntary.\n\nBetsy McCaughey is a former lieutenant governor of New York and author of The Next Pandemic, available at Amazon.com. Follow her on Twitter @Betsy_McCaughey. To find out more about Betsy McCaughey and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Left's Vaccine Hypocrisy - The Stream", "description": "If Americans capitulate, how many times will they be forced to bare their arms and take whatever an ambitious politician requires? That decision has to be voluntary.", "url": "https://stream.org/the-lefts-vaccine-hypocrisy/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-12-08T22:00:29+00:00", "article:modified_time": "2021-12-08T19:02:45+00:00", "image": "https://stream.org/wp-content/uploads/48609242923_b6be34e6d2_k-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/betsymccaughey/", "https://stream.org/author/betsymccaughey/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/donate/"], "authors": ["Betsy McCaughey"], "publish_date": "2021-12-08T22:00:29+00:00"}