{"result_id": "306013", "URL": "https://stream.org/new-york-supreme-court-reinstates-unvaccinated-employees-with-back-pay-it-was-about-compliance/", "timestamp": "2023-04-25 17:33:22 CEST+0200", "meta": {"description": "A New York judge ordered Monday that Department of Sanitation employees terminated for refusing to get vaccinated be reinstated to their full employment status, writing that the vaccination mandate for city employees was “not just about safety and public health; it was about compliance.”", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/new-york-supreme-court-reinstates-unvaccinated-employees-with-back-pay-it-was-about-compliance/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "New York Supreme Court Reinstates Unvaccinated Employees With Back Pay: ‘It Was About Compliance’", "cleaned_text": "A New York judge ordered Monday that Department of Sanitation employees terminated for refusing to get vaccinated be reinstated to their full employment status, writing that the vaccination mandate for city employees was “not just about safety and public health; it was about compliance.”\n\nJudge Ralph J. Porzio wrote in his ruling that if the vaccine mandate was about “safety and public health, unvaccinated workers would have been placed on leave the moment the order was issued.”\n\n“If it was about safety and public health, the Health Commissioner would have issued city-wide mandates for vaccination for all residents,” he continued. “In a City with a nearly 80% vaccination rate, we shouldn’t be penalizing the people who showed up to work, at great risk to themselves and their families, while we were locked down.”\n\nPorzio’s ruling states that the Oct. 20, 2021, and Dec. 13, 2021, rulings from the commissioner of health and mental hygiene ordering that all employees get vaccinated are “arbitrary and capricious,” ordering that the petitioners be reinstated to their full employment status, and entitled to back pay in salary from date of termination.\n\n“Yesterday marked a historic victory for sanitation workers, all the brave NYC employees who serve the public and our representative democracy,” attorney Chad LaVeglia told The Daily Signal. “The court struck down NYC’s draconian, arbitrary, vaccine mandate on multiple constitutional and legal grounds. The thousands of city employees who were ignored now have a voice. And as the court recognized, they deserve better.”\n\n“The court also recognized a commonsense principle that has somehow eluded politicians like Eric Adams: Forcing one — and only one — segment of the population to get vaccinated during a worldwide outbreak is unconstitutional and arbitrary,” he added. “Sixteen sanitation workers fought back against tyranny. And won. This is a historic victory for individual rights, and the system of government mandated by the Constitution.”\n\nThe plaintiffs’ attorney did not immediately respond to a request for comment from The Daily Signal. According to the court filing, the Department of Sanitation employees were terminated in February 2022 for “failure to comply with vaccination requirements” after the health commissioner of the City of New York, David Chokshi, issued a vaccination mandate requiring all city employees to show “proof of at least one dose of vaccination against COVID-19” by Oct. 29.\n\n“On March 24, 2022, Mayor Adams enacted Executive Order No. 62, which provided blanket exemptions from the private employers’ vaccine mandate for athletes, performers, and other artists,” the ruling said. The judge highlighted the petitioners’ central argument that Adams’ order “rendered the public employee vaccination mandate arbitrary and capricious or unconstitutional.”\n\n“Furthermore,” the judge wrote, “the Petitioners all claim, and provided laboratory documentation, that they have natural immunity to COVID-19 from prior infection(s). Respondents’ central argument is that the private employers’ exemption order and the public employee vaccination mandates were ‘created separately, and exist independently, of each other.’”\n\n“The city strongly disagrees with this ruling as the mandate is firmly grounded in law and is critical to New Yorkers’ public health,” a New York Law Department spokesman said on Tuesday. “We have already filed an appeal. In the meantime, the mandate remains in place as this ruling pertains solely to the individual petitioners in this case. We continue to review the court’s decision, which conflicts with numerous other rulings already upholding the mandate.”", "opengraph": {"locale": "en_US", "type": "article", "title": "New York Supreme Court Reinstates Unvaccinated Employees With Back Pay: ‘It Was About Compliance’ - The Stream", "description": "A New York judge ordered Monday that Department of Sanitation employees terminated for refusing to get vaccinated be reinstated to their full employment status, writing that the vaccination mandate for city employees was “not just about safety and public health; it was about compliance.”", "url": "https://stream.org/new-york-supreme-court-reinstates-unvaccinated-employees-with-back-pay-it-was-about-compliance/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-10-26T15:36:51+00:00", "image": "https://stream.org/wp-content/uploads/iStock-1406960186-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/mary-olohan/", "https://stream.org/author/mary-olohan/", "http://www.daisurvey.com/StreamWebsite", "https://www.dailysignal.com/wp-content/uploads/85163_2022_George_Garvey_et_al_v_City_of_New_York_et_al_DECISION___ORDER_ON_38.pdf", "https://www.dailysignal.com/2022/02/02/big-board-dc-bar-defies-vaccine-mandate-rand-paul/", "https://www.dailysignal.com/wp-content/uploads/85163_2022_George_Garvey_et_al_v_City_of_New_York_et_al_DECISION___ORDER_ON_38.pdf", "https://www.dailysignal.com/2022/01/26/grappling-with-dc-vaccine-mandate-capitol-hill-restaurant-owner-pleads-for-decency/", "https://www.dailysignal.com/2021/09/22/as-vaccine-mandates-increase-religious-exemptions-come-under-fire/", "https://stream.org/donate/", "https://www.dailysignal.com/2022/01/23/biden-voter-explains-her-stand-against-covid-19-vaccine-mandate/", "https://www.dailysignal.com/2022/10/25/new-york-supreme-court-reinstates-unvaccinated-employees-with-backpay/"], "authors": ["Mary Margaret Olohan"], "publish_date": "2022-10-26T15:36:51+00:00"}