{"result_id": "306008", "URL": "https://stream.org/the-nuremberg-code-informed-consent-and-vaccine-mandates/", "timestamp": "2023-04-25 17:33:12 CEST+0200", "meta": {"description": "Can Americans really be forced to get \"fully vaccinated\" for COVID? A look at the Nuremberg Code, \"informed consent\" and vaccine mandates.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/the-nuremberg-code-informed-consent-and-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "The Nuremberg Code, 'Informed Consent' and Vaccine Mandates", "cleaned_text": "Can Americans really be forced to get “fully vaccinated” for COVID? It depends on whom you ask. One newsletter reader asked us about coercion when it comes to medical treatment.\n\nThe Nuremberg Code was established after World War II and the horrific discovery that the Nazis, under the direction of “mad scientist” Dr. Josef Mengele, used medicines and procedures, including experimental ones, on Jews against their will in the name of “scientific research.” It was determined that this should never happen again.\n\nDo a search on “Nuremberg Code COVID-19 vaccine,” and several “fact-”check websites come up, so we assume this question has been asked numerous times. POLITIFACT predictably rated this claim “false.” No, they say, the Nuremberg Code does not apply because the COVID-19 vaccines are not experimental, as they received emergency-use FDA approval.\n\nPOLITIFACT says, “One of the Nuremberg principles is that humans should not be subject to medical experiments without their voluntary consent. The COVID vaccines have been tested in clinical trials with people who gave their consent.” (Ah, those people gave their consent.) POLITIFACT says an “expert” told them that the premise that COVID-19 vaccinations are medical experiments is “not true.”\n\nThey attempt to cover their bases by pointing out that the Nuremberg Code is not part of U.S. law.\n\nMary Ellen O’Connell, a law professor (not a doctor) at the University of Notre Dame School of Law, said, “No one taking the vaccine is being subjected to experimentation. If you refuse for reasons other than medical issues or religious teaching, you may lawfully be barred from certain activities where you may infect other people. That is your choice, not coerced by the government.”\n\nPOLITIFACT reports that “while vaccine skeptics often use the term ‘experimental agent’ when referring to the vaccines, the FDA refers to them as ‘investigational vaccines.’” Ah, that’s very different!\n\n“During public health emergencies,” POLITIFACT says, “like the coronavirus pandemic, the FDA has the legal power to grant emergency use authorization to certain products if they meet specific standards and if there’s no adequate, approved and available alternative to treat the malady.”\n\nRight off the bat, we see problems with their verdict of “false” and enormous room for debate on the question. We’re not lawyers, but we’re confident of winning the ethical debate.\n\nFirst, is a treatment not in any way “experimental” just because the FDA approved it? If all it takes is FDA approval to miraculously take that label away, then there needs to be a lot more trust in our health care bureaucracy than currently exists.\n\nParticularly when it comes to giving these vaccines to children, they are still experimental. During the recent eight-hour meeting that led into an FDA advisory committee vote to approve the vaccines for youngsters 5-11, Dr. Eric Rubin said, “We’re never going to learn about how safe the vaccine is unless we start giving it, and that’s just the way it goes. That’s how we found out about rare complications of other vaccines.”\n\nThat sounds pretty experimental to us.\n\nDr. Cody Meissner, a pediatrician with Tufts Medical Center, voiced a concern that “if we say yes, then the states are going to mandate this vaccine for children to go to school, and I do not agree with that.”\n\nA temporary committee member, Dr. James Hildreth, expressed concerns about the estimated 40 percent of children who already have some form of immunity to COVID-19. It sounds as though, among these doctors, there are significant unanswered questions. So we do not agree that the COVID vaccines are not experimental, regardless of the FDA vote.\n\nPOLITIFACT says that during a public health emergency, the FDA has the power to grant emergency use authorization. That was to make the vaccine available, not to force people to take it.\n\nAs for the idea that people aren’t being forced, that it’s their choice after being barred from certain places and activities, we take strong exception to this interpretation by POLITIFACT’S chosen “expert.” If a person is denied the ability to make a living, or to leave his home, or a child is denied the right to go to school, that is duress, which is clearly a violation of the Code. (Also, some employers are not granting medical or religious exemptions.) To reiterate what our reader Allen said in his letter, “the first principle of the Nuremberg Code states that the voluntary consent of the human subject is absolutely essential…[the person must] be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion.”\n\nThis principle also stresses the need for informed consent. At present, with so much censorship and control of the narrative by the medical/pharmaceutical community and the government, it could be argued that many Americans don’t know the risks they’re consenting to, and they’re even made to sign a waiver before they get “jabbed.” They only know their boss told them they need to do it if they want to keep coming to work.\n\nAccording to employment attorney Daniel A. Gwinn, “The Equal Employment Opportunity Commission has decreed [EDITORIAL NOTE: “decreed”??] that an employer may require its workers to be vaccinated as a condition of employment, unless they are medically unable to safely receive the vaccine or have bona fide religious objections.” But he also supports what we said earlier: “If you have been given a choice between getting the shot or losing your job, your decision is not voluntary, and being forced (on pain of losing your job) to sign a form that states the decision to be vaccinated is [made] voluntarily won’t make it so.”\n\nClearly the mandate is unethical. But one thing is true: the Nuremberg Code is not codified into U.S. or state law. (We would add that even so, it’s been cited multiple times in case law, even before the Supreme Court; see link, especially cases 9 and 10, which involve the COVID mandate.) Does that mean it’s just another vestige of our history, to be discarded by our society when leaders find it inconvenient? Perhaps the states that care about individual rights should look into making it law, and without delay. No one should be forced to experiment with his or her health.\n\nMike Huckabee is the former governor of Arkansas and longtime conservative commentator on issues in culture and current events. A New York Times best-selling author, he hosts the weekly talk show Huckabee on TBN.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Nuremberg Code, 'Informed Consent' and Vaccine Mandates - The Stream", "description": "Can Americans really be forced to get \"fully vaccinated\" for COVID? A look at the Nuremberg Code, \"informed consent\" and vaccine mandates.", "url": "https://stream.org/the-nuremberg-code-informed-consent-and-vaccine-mandates/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-11-10T20:00:16+00:00", "article:modified_time": "2022-01-20T02:36:28+00:00", "image": "https://stream.org/wp-content/uploads/Freedom-not-force-edit-2-1.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/mikehuckabee/", "https://stream.org/author/mikehuckabee/", "http://www.daisurvey.com/StreamWebsite", "https://www.politifact.com/factchecks/2021/aug/20/facebook-posts/covid-19-vaccination-does-not-violate-nuremberg-co/", "https://www.westernjournal.com/buried-6-hours-fda-video-doctor-makes-chilling-admission-child-covid-vax/", "https://stream.org/donate/", "https://ahrp.org/the-significance-of-the-nuremberg-code/", "https://stream.org/author/mikehuckabee/", "https://www.tbn.org/huckabee", "https://www.mikehuckabee.com/latest-news?id=A88EEBAC-6E69-42DB-9628-D55573E458C6"], "authors": ["Mike Huckabee"], "publish_date": "2021-11-10T20:00:16+00:00"}