{"result_id": "306001", "URL": "https://stream.org/natural-immunity-versus-vaccine-immunity/", "timestamp": "2023-04-25 17:32:54 CEST+0200", "meta": {"description": "Natural immunity provides more robust and durable protection against COVID-19 than the current COVID-19 vaccines have proven to provide.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/natural-immunity-versus-vaccine-immunity/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "Natural Immunity Versus Vaccine Immunity", "cleaned_text": "You never know when something you say will go viral. It has happened a number of times in my career, the latest being comments I made on my national radio talk show a few weeks ago when I had COVID-19. I said that I had hoped I would attain natural immunity, since science — evidenced, for example, in a major study from Israel, one of the most pro-vaccine and highly vaccinated societies in the world — strongly suggests that natural immunity provides more robust and durable protection against COVID-19 than the current COVID-19 vaccines have proven to provide.\n\nSpecifically, I said that I had hugged and taken photos with thousands of people from the beginning of the pandemic. I had two reasons for doing this: 1) I decided very early on that I would not live my life in fear, but instead live normally; and 2) if I did get the virus I had confidence that the prophylactic therapeutics and nutrients I had been taking for more than a year — ivermectin, hydroxychloroquine, zinc, megadoses of vitamin D, vitamin C and selenium (and a monoclonal antibody infusion once I tested positive for COVID-19) — would protect me from serious consequences. Most importantly, I repeatedly said from the beginning of 2020 that I chose to live normally, not hide in my house. As much as I want to live a long life, I have always believed that the purpose of life is to live fully, not necessarily long (though, of course, I want that too — just not at the expense of normal living).\n\nMy COVID-19 symptoms consisted of chills for three days, a cough and fatigue for about a week and loss of taste for a day. I missed three days of radio but did not miss a speech (I flew from California to Florida to deliver a speech five days after testing negative).\n\nFrom CNN to the Washington Post, I was mocked by much of the national mainstream media. Needless to say, not one of them bothered to interview me or invite me to respond either in writing or in person. That is how things now work in America: the media attack and mock those with whom they differ but offer no opportunity for the attacked party to respond. On the basis of a few sentences provided by a lie-based attack site (Media Matters), the Washington Post, for example, wrote an entire article on me and those comments. More on that in the next column.\n\nNatural Immunity is More Robust Than a Vaccine\n\nLet’s begin with my premise — that natural immunity is more robust than a vaccine (or at least the vaccines we currently have). That is what a large study out of Israel — one of the most pro-vaccine and highly vaccinated countries in the world — reported.\n\nOn August 25, 2021, medRxiv published a “preprint” study by ten Israeli scientists, all associated with an Israeli research institute, Maccabitech, in Tel Aviv. Among the 10 are three MDs, three professors of epidemiology, two professors at the Tel Aviv University School of Public Health and an adjunct researcher at the Division of Cancer Epidemiology and Genetics at the National Institutes of Health in the United States. The study’s conclusion: “This study demonstrated that natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity …”\n\nOn August 26, 2021, Science, one of the world’s most widely cited science magazines, published by the American Association for the Advancement of Science, published an article on the Israeli study. Its opening sentence reads: “The natural immune protection that develops after a SARS-CoV-2 infection offers considerably more of a shield against the Delta variant of the pandemic coronavirus than two doses of the Pfizer-BioNTech vaccine, according to a large Israeli study …”\n\nMartin Kulldorff, a professor of medicine at Harvard Medical School, confirmed the Israeli study: “In Israel, vaccinated individuals had 27 times higher risk of symptomatic COVID infection compared to those with natural immunity from prior COVID disease … ”\n\nA Cleveland Clinic study came to the same conclusion. Published on June 5, 2021, also on medRxiv, it concluded that “Individuals who have had SARS-CoV-2 infection are unlikely to benefit from COVID-19 vaccination … ”\n\nEven before the Israeli and Cleveland Clinic studies, a New York University study comparing vaccine immunity to natural immunity concluded that people who had had COVID-19 were better protected against the virus: “In COVID-19 patients, immune responses were characterized by a highly augmented interferon response which was largely absent in vaccine recipients.”\n\nA Rockefeller University study published on August 24, 2021, concluded, as the Israeli study did, that “a natural infection may induce maturation of antibodies with broader activity than a vaccine does.” The study immediately added that getting natural immunity entails contracting COVID-19, and “a natural infection can also kill you.” But that valid warning does not negate its conclusion in favor of natural immunity. Nor does the study warn that getting the vaccine may also induce harmful consequences. To its everlasting shame, that is a taboo subject in America’s medical community despite the fact that the Vaccine Adverse Event Reporting System (VAERS) website of the Centers for Disease Control and Prevention lists over 700,000 cases of suspected injury and more than 17,000 otherwise unexpected deaths temporally associated with COVID-19 vaccines.\n\nLast week, the media reported that the CDC announced that vaccines provided greater immunity than natural immunity. But the way in which the CDC came to this conclusion is all but indecipherable, if not simply dishonest.\n\nHere’s how Dr. Peter Hotez, a pro-vaccine spokesman and co-director of the Center for Vaccine Development at Texas Children’s Hospital, summarized the Kentucky study:\n\n“The Centers for Disease Control in their ‘MMWR’ (Morbidity and Mortality Weekly Report) published a very interesting study out of Kentucky comparing individuals who were infected and recovered and chose not to get vaccinated versus those who are infected and recovered and then got vaccinated in addition. And clearly, those who chose not to get vaccinated were reinfected at much higher rates, several times higher, than those who were infected and recovered and vaccinated.”\n\nThose comments are completely irrelevant to the issue at hand. The comparison I and others make is between natural immunity and vaccine immunity. The CDC-Kentucky study is not a comparison between natural immunity and vaccine immunity; it is a comparison between those who received a vaccine after natural immunity and those who did not receive a vaccine after attaining natural immunity.\n\nNIH director Francis Collins also used the Kentucky study to avoid the question of COVID-recovered immunity versus vaccine immunity. On August 12, 2021, he said on Fox News: “There was a study published by CDC just ten days ago in Kentucky … So, what was the protection level? It was more than two-fold better for the people who had had the vaccine in terms of protection than people who had had natural infection. That’s very clear in that Kentucky study. You know that surprises people. Kind of surprised me that the vaccine would actually be better than natural infection …”\n\nThis CDC report and deliberate conflation by Dr. Peter Hotez and NIH director Collins of two completely different groups — COVID-recovered (with or without vaccine) and vaccinated who never had COVID-19 — are among the many reasons so many Americans no longer trust the American medical establishment.\n\nDennis Prager is a nationally syndicated radio talk-show host and columnist. His latest book, published by Regnery in May 2019, is The Rational Bible, a commentary on the book of Genesis. His film, “No Safe Spaces,” was released to home entertainment nationwide on September 15, 2020. He is the founder of Prager University and may be contacted at dennisprager.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Natural Immunity Versus Vaccine Immunity - The Stream", "description": "Natural immunity provides more robust and durable protection against COVID-19 than the current COVID-19 vaccines have proven to provide.", "url": "https://stream.org/natural-immunity-versus-vaccine-immunity/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2021-11-11T17:00:08+00:00", "article:modified_time": "2021-11-11T14:00:09+00:00", "image": "https://stream.org/wp-content/uploads/iStock-1326666679-1.jpg", "image:width": "900", "image:height": "549", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": [], "movies": [], "links": ["https://stream.org/author/dennisprager/", "https://stream.org/author/dennisprager/", "http://www.daisurvey.com/StreamWebsite", "https://stream.org/donate/"], "authors": ["Dennis Prager"], "publish_date": "2021-11-11T17:00:08+00:00"}