{"result_id": "306042", "URL": "https://stream.org/cdc-natural-immunity-offered-stronger-protection-against-covid-than-vaccines-during-delta-wave/", "timestamp": "2023-04-25 17:34:28 CEST+0200", "meta": {"description": "Vaccinated individuals and those who had recovered from COVID-19 both showed significant defense against the Delta variant, the CDC announced.", "lang": "en", "keywords": "", "favicon": "https://stream.org/wp-content/themes/TheStreamBuzz/images/home_icons/apple-touch-icon-57x57.png", "canonical": "https://stream.org/cdc-natural-immunity-offered-stronger-protection-against-covid-than-vaccines-during-delta-wave/", "encoding": "UTF-8"}, "image": null, "domain": "stream.org", "title": "CDC: Natural Immunity Offered Stronger Protection Against COVID Than Vaccines During Delta Wave", "cleaned_text": "On Wednesday, the U.S. Centers for Disease Control and Prevention (CDC) provided new research showing that, during the recent Delta wave, individuals who had previously contracted COVID-19 had more protection against the virus than those who had been vaccinated.\n\n“Before the Delta variant, COVID-19 vaccination resulted in better protection against a subsequent infection than surviving a previous infection,” CDC epidemiologist Benjamin Silk told The Wall Street Journal. “When looking at the summer and fall of 2021, when Delta became predominant in this country, however, surviving a previous infection now provided greater protection.”\n\nBoth vaccinated individuals and those who had recovered from the virus showed significant defense, scientists added. (The CDC released its findings to reporters, but its research was not yet available online as of Thursday morning.)\n\nPrevious research suggests receiving vaccination after a COVID infection can offer additional protection against the virus.\n\n“Recent research,” the Mayo Clinic says, “suggests that people who got COVID-19 in 2020 and then received mRNA vaccines produce very high levels of antibodies that are likely effective against current and, possibly, future variants. Some scientists call this hybrid immunity.”\n\nThe findings are significant and dovetail with recent scientific research out of Israel that showed previous infection from COVID-19 conferred longer-lasting and more robust protection than vaccines against the Delta variant.\n\nFollowing the Israel study, prominent scientists argued that the fact that natural immunity offered more protection than vaccines made mandatory vaccination unscientific and unethical.\n\n“Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical,” wrote Harvard Medical School professor Martin Kulldorff, an epidemiologist and biostatistician.\n\nThe CDC’s findings were released days after the Supreme Court ruled that President Joe Biden’s vaccinate-or-test requirement for businesses with more than 100 employees was unconstitutional.\n\nThe high court’s decision prompted some businesses, including Starbucks, to scrap their vaccine mandates for employees.\n\n“We respect the Court’s ruling and will comply,” John Culver, COO and group president for North America at Starbucks, told employees on Tuesday.\n\nDespite the protection offered by previous COVID infection, many public officials and countries have been reluctant to recognize natural immunity.\n\nNovak Djokovic, the world’s top-ranked tennis player, recently had his visa seized by Australian authorities when he arrived (unvaccinated) to play in the Australian Open, even though he was initially granted a medical exemption because of a recent COVID infection. Meanwhile, Austria’s conservative government recently announced it will make vaccination compulsory for adults, who will face steep fines — up to 3600 euros — if they fail to comply, even if they have already had the virus.\n\nIn the United States, universities have been inclined to expel students not considered “fully vaccinated,” which in some cases reportedly includes students who’ve had multiple vaccine shots, have previously had COVID, and have received a medical exemption from a physician.\n\nRecent evidence, however, suggests the reluctance to treat individuals who’ve had COVID as “fully vaccinated” may be waning. The NCAA, for example, recently announced in its winter guidelines that athletes who previously had COVID will be considered “fully vaccinated” if the infection took place within three months.\n\nThe CDC’s announcement that previous infection offered more protection than vaccination against the Delta variant is likely to fuel calls to end vaccine mandates, particularly for individuals who’ve already been infected.", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC: Natural Immunity Offered Stronger Protection Against COVID Than Vaccines During Delta Wave - The Stream", "description": "Vaccinated individuals and those who had recovered from COVID-19 both showed significant defense against the Delta variant, the CDC announced.", "url": "https://stream.org/cdc-natural-immunity-offered-stronger-protection-against-covid-than-vaccines-during-delta-wave/", "site_name": "The Stream", "article:publisher": "https://www.facebook.com/TheStream.org/", "article:published_time": "2022-01-22T10:00:46+00:00", "article:modified_time": "2022-01-21T16:57:08+00:00", "image": "https://stream.org/wp-content/uploads/CDC-edit.jpg", "image:width": "900", "image:height": "506", "image:type": "image/jpeg"}, "tags": ["Russia-Ukraine War", "Religious Liberty", "Abortion", "Biden Scandal", "Banking Crisis", "Revival", "China", "Transgender"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical. <a href=\"https://t.co/d14kTPnCWk\">https://t.co/d14kTPnCWk</a></p>\n<p>— Martin Kulldorff (@MartinKulldorff) <a href=\"https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw\">August 27, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://stream.org/author/jonmiltimore/", "https://stream.org/author/jonmiltimore/", "http://www.daisurvey.com/StreamWebsite", "https://www.wsj.com/articles/prior-covid-19-infection-offered-better-protection-than-vaccination-during-delta-wave-11642619009", "https://twitter.com/apoorva_nyc/status/1483876541822029836", "https://www.mayoclinic.org/coronavirus-covid-19/vaccine-if-already-had-covid#:~:text=Recent%20research%20also%20suggests%20that,Further%20research%20is%20needed.", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://fee.org/articles/harvard-epidemiologist-says-the-case-for-covid-vaccine-passports-was-just-demolished/", "https://t.co/d14kTPnCWk", "https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw", "https://www.cnn.com/2022/01/19/business/starbucks-vaccine-mandate/index.html", "https://fee.org/articles/the-djokovic-fiasco-exposes-the-absurdity-of-australias-zero-covid-measures/", "https://au.sports.yahoo.com/warm-welcome-djokovic-returns-home-174500062.html", "https://www.reuters.com/world/europe/austria-introduces-lottery-covid-vaccine-incentive-2022-01-20/", "https://stream.org/donate/", "https://twitter.com/esaagar/status/1483946762012401664", "https://fee.org/articles/athletes-who-had-covid-will-be-considered-fully-vaccinated-ncaa-says-in-new-guidelines/", "https://fee.org/articles/cdc-natural-immunity-offered-stronger-protection-against-covid-than-vaccines-during-delta-wave/"], "authors": ["Jon Miltimore"], "publish_date": "2022-01-22T10:00:46+00:00"}