{"result_id": "307020", "URL": "https://www.thetrumpet.com/27174-german-politics-reveal-a-world-of-lies", "timestamp": "2023-04-25 17:34:54 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/27174-german-politics-reveal-a-world-of-lies", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "German Politics Reveal a World of Lies", "cleaned_text": "He told millions of Germans what to do—but he appears to have lied about his own past to get the authority he commanded.\n\nThe recent revelation published by Welt that the German health minister allegedly falsified his résumé in 1995 to get a professorship once again points to a world full of lies. Welt wrote on March 13, “Lauterbach Has Had a Problem With Sincerity Since the Beginning of His Career.” But it wasn’t just Lauterbach who misled people.\n\nFrom the crooked résumé with which Lauterbach fooled the University of Tübingen as a 32-year-old to the coronavirus crisis, there is a Lauterbachian motif: not being quite so precise. In retrospect, it began with the falsification of biographical data. It ended with his insistence, long since in ministerial office, that the coronavirus vaccines were devoid of side effects.\n\n —Welt\n\nOf course, Lauterbach wasn’t the only one who claimed that lockdowns were good and vaccines were safe. Politicians, scientists and media outlets around the world said the same. But how many of the so-called experts got where they are due to cheating?\n\n“There is a major crisis in the world of higher education: the large and growing number of fake universities and fake degrees,” Allen Ezell and John Bear write in Degree Mills: The Billion-Dollar Industry That Has Sold Over a Million Fake Diplomas. “[T]here are more than 3,300 unrecognized universities worldwide, many of them outright fakes, selling bachelor’s, master’s, doctorates, law and medical degrees to anyone willing to pay the price.”\n\nThis trend is concerning as our March cover story, “Navigating Our Fake World,” highlights:\n\nIn today’s world, no nation, people, age, race or sex is immune. Politics, government, media, economics, education, fashion, entertainment: There’s an element of phoniness in them all. Every one is, to some degree, propped up by exaggeration, embellishment, clever marketing and branding, obfuscation and lies. Perhaps the most remarkable and tragic reality is this: Most people are either ignorant of or comfortable with the fakery.\n\nAs this article brings out, we live in a world filled with lies. Jeremiah 7:28 says that “truth is perished.” This prophecy speaks of a time when every man “will deceive … his neighbour, and will not speak the truth: they have taught their tongue to speak lies …” (Jeremiah 9:5). We live “in the midst of deceit …” (verse 6).\n\nRead “Navigating Our Fake World” and get a free subscription to our Trumpet magazine, which reveals the truth in a world of deceit.", "opengraph": {"url": "https://www.thetrumpet.com/27174-german-politics-reveal-a-world-of-lies", "site_name": "theTrumpet.com", "title": "German Politics Reveal a World of Lies", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjMvMDMvMTMvM2xmNjEwZmoyNF8yMDIzMDMxM19LYXJsX0dldHR5SW1hZ2VzXzEyMzk0ODY2NTguanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/7e80f0fd8b87701a/20230313-Karl-GettyImages-1239486658.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.welt.de/politik/deutschland/plus244225919/Karl-Lauterbach-Der-dunkle-Fleck-in-seiner-Vergangenheit.html", "https://www.welt.de/debatte/plus244257011/Frisierter-Lebenslauf-Karl-Lauterbach-ist-von-Anfang-an-ein-Irrtum-gewesen-Ein-Kommentar.html", "/26884-navigating-our-fake-world", "/26884-navigating-our-fake-world"], "authors": [], "publish_date": null}