{"result_id": "307006", "URL": "https://www.thetrumpet.com/25291-you-are-living-in-an-experiment/print", "timestamp": "2023-04-25 17:34:46 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25291-you-are-living-in-an-experiment/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "The last two years of human history have been changed by an experiment. It most likely began with a laboratory biologist grafting proteins from one type of coronavirus onto another to observe whether it would bind to certain receptors in a mouse that are also found in humans. It did—inside the lab and far, far beyond it.\n\nWhat is certain is that humanity’s response to the virus has been a gigantic experiment composed of multiple experiments: in masking, in distancing, in treatment, in business, in economics, in information sharing, in vaccine formulation, in live vaccination testing, in restaurants, in schools, in nursing homes, on the elderly, on the middle-aged, on children. Governments tested drugs on millions of people and, more importantly, examined their test subjects’ receptivity to losing their rights. They forced millions of people into history’s largest scientific experiment, and it’s not over yet.\n\nAfter 18 months of these radical, often bizarre, mass life-and-death decisions, the Biden administration stated, “[T]he United States must lean forward and catalyze the advances in science, technology and core capabilities required to protect the nation against future and potentially catastrophic biological threats, whether naturally occurring, accidental or deliberate” (Sept. 3, 2021). More experimentation is coming, in America and beyond, on your health and your rights.\n\nThe world is a giant trial-and-error lab. But this didn’t start in March 2020.\n\nOne leading scientist wrote in 2012 that “the benefits of such experiments and the resulting knowledge outweigh the risks. It is more likely that a pandemic would occur in nature, and the need to stay ahead of such a threat is a primary reason for performing an experiment that might appear to be risky.” That same scientist funded gain-of-function research at the exact same lab where the covid-19 outbreak almost certainly occurred.\n\nAnd that same scientist, Dr. Anthony Fauci, has been entrusted to lead America’s attempt to counteract how that virus functions.\n\nFauci was among the chorus of government-approved doctors in the U.S. and elsewhere who have experimented quite radically with the truth. Virologists discussed the possibility early on that the virus originated in a lab. But after a January 2020 meeting, they condemned the concept. A Dutch scientist wrote that “further debate about such accusations would … do unnecessary harm to science in general and science in China in particular.”\n\nThe orthodox doctrine became: It came from a bat next to the lab, not the lab. Any other explanation could “harm science.” Scientists, politicians and executives in news media and social media collaborated to define (and redefine) “the science” and to censor such heretics to preserve people’s faith in their medical “saviors.” Only then could the experiment continue.\n\nThe experiment quickly “jumped species” from the purely biological kingdom to the political kingdom. It started with the hypothesis, advanced by the World Health Organization and Imperial College London, that multitudes could die from covid-19. But rather than compare the actual results to the hypothesis and adjust the hypothesis, public health officials adjusted the results to match the hypothesis. They counted everyone who tested positive as a covid-19 case, regardless of the efficacy of the test, and, unbelievably, everyone who died with covid as if they had died from it. (In January, the total in Britain was 17,000 people had died from covid-19, and 150,000 had died with it.) They observed then ignored the evidence that most covid-19 deaths occurred among the elderly and others who had health conditions. They observed then ignored the evidence that the “pandemic” largely equated to a bad flu season. The medical, social and political experimentation continued.\n\nAnd what was the result of splicing radical social, financial and governmental coercion onto our societies? Undoctored information is hard to come by, but a February analysis of numerous international studies by Johns Hopkins University estimated that all the onerous and costly interventions that upended society only reduced the coronavirus death rate by a paltry 0.2 percent.\n\nThe last two years have been a crossfire of financial and political motivations branded as “science.” Many of those pushing the vaccine are the same people who benefit professionally, politically and financially from it.\n\nDevelopment and approval of three vaccines in particular were rushed through at warp speed. Governments proclaimed that approved vaccines, including the never-before-used mrna vaccines, were safe, were no longer “emergency use,” and were certainly not experimental. The development was proclaimed one of humanity’s greatest modern achievements.\n\nThe government granted “emergency use authorization.” Drug companies were shielded from lawsuits. Doses were administered at the cost of indebted taxpayers. Millions were induced to get vaccinated, informed that this would provide almost absolute protection. Then they were informed that they might suffer a breakthrough case but would not spread it. Then they were informed that they might spread it and experience a breakthrough case, but would be spared serious symptoms themselves. Now it’s increasingly apparent that natural immunity is the strongest protection.\n\nBut information came out that healthy people were suffering unusual, even fatal side effects from the vaccine. Evidence kept coming. More people suffered. More died. Athletes mysteriously collapsed on the field. Children became handicapped. The U.S. Vaccine Adverse Event Reporting System, which usually receives hundreds of reports per year, suddenly received tens of thousands. (This is on top of the estimated 4 million Americans annually who go to emergency rooms due to adverse effects from other drugs.)\n\nThe U.S. Centers for Disease Control and Prevention now admits that those who have had the Johnson & Johnson vaccine should probably not get a booster from the same company due to serious risk of blood clots. But it still advocates getting boosters from Moderna and Pfizer. The potential medium- and long-term negative effects from these companies’ serums we must leave, in faith, to be studied some other time. The cdc admits it is withholding information on covid-19 vaccines and boosters. The U.S. Food and Drug Administration, which reviewed the information and approved the vaccines in 108 days, says it won’t finish releasing the last of that information until 2096.\n\nMeanwhile, the experimentation continues. Politicians—and pharmaceutical ceos—want to see what will happen if we start giving these injections to children under age 5.\n\nWe are well through the hypothesis phase and the experimentation phase of the scientific method. The phase of analyzing data is being hotly contested. But the final phase, reporting your conclusions, has already been decided by the scientific-political elite. Despite the data showing that vaccines are killing people in the short term and the obvious impossibility of knowing the effects longer term, “After covid-19 Successes, Researchers Push to Develop mrna Vaccines for Other Diseases,” as Nature Medicine summed up in its May 2021 issue. Scientist Drew Weissman said, “We are working on about 30 different mrna vaccines, including ones for influenza, hiv, hepatitis C, malaria, tuberculosis and many others.” The experiment plows forward.\n\nBut the origin of this radical, deadly frenzy of wild experimentation with human lives doesn’t trace back to Dr. Anthony Fauci or Pfizer or the Biden regime or even our generation. Sickness, and our way of dealing with it, originated many generations ago.\n\nBefore the cdc, before the bureaucratic state in America, before eugenics in Germany, before socialized health care in Europe, before even the modern era, human beings began an experiment.\n\nIn Babel, one of the earliest civilizations, a leader arose who is identified with the Babylonian deity Marduk, who “held the power to overcome all disease” (Félix Martí-Ibáñez, The Epic of Medicine). He was also a political tyrant—but the people trusted him with their safety. The Physician Throughout the Ages states, “There is no doubt that the Egyptians studied medicine and surgery in the medical colleges of Babylonia and in parts of Mesopotamia, and acquired a complete knowledge of all the Oriental medical practices.”\n\nAssyrian copies of Babylonian texts reveal that “Babylonian health care relied on magic and incantations as much as, if not more than, natural treatment and prescriptions,” as Health & Fitness History points out. “Most of the materials used were likely chosen based on a combination of trial and error with guesswork.”\n\nThis was the foundation of civilization, established by the same man who erected that infamous tower to stand as a monument to mankind’s own ability to solve his own safety, medical, political and other problems. The tyrant Nimrod led mankind in attempting to solve its own problems in defiance of God, completely rejecting reliance on Him.\n\nThousands of years of experiments, at unconscionable cost, have advanced understanding of the human body and diseases. But medicine today is still “a combination of trial and error with guesswork.” We call it the “scientific method.” Doctors discuss the “half-life of knowledge”: the amount of time it will take before half of the treatments, prescriptions and other medical knowledge of today proves, through hard experience, to have been as false as the magic and incantations of old.\n\nThe fundamental theory then, as now, is: “The sufferer has in his body one poison, so we add another poison in the form of medicine,” the late educator Herbert W. Armstrong wrote in The Plain Truth About Healing (see article, page 16).\n\nBut the origin of the grand human experiment traces back even further, back to the very first human beings. They were presented with a choice. They could choose to rely on God for information, for law, for correction, for protection, for safety, for healing, for blessings. Or they could choose to rely on their own minds and five senses to experiment. They could, as Mr. Armstrong enumerated, 1) reject revelation, 2) use observation, 3) use experimentation, and 4) use human reasoning. “And that is precisely the ‘scientific’ method used by modern science today!” (The Missing Dimension in Sex).\n\nThey chose the latter. We have been self-willed, ignorant and law-breaking ever since. Suffering the inevitable consequences, we seek solutions through self-will, ignoring God and breaking His laws further. God still characterizes our modern civilization as “Babylon”—and He exhorts us to come out of it (Revelation 18:4). That means thinking differently. That means recognizing that our human civilization is as foundationally unsound as that long-obliterated tower of Babel. Our experiment has produced an inescapable result, and we must stop trying to escape it. We do not and never have possessed the ability to solve our health problems or any other problems apart from God. That is a scientific fact. Recognize it, and you will see this dark and confusing world completely differently: for the first time, clearly.", "opengraph": {"url": "https://www.thetrumpet.com/25291-you-are-living-in-an-experiment/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/1293-the-plain-truth-about-healing", "/1302-the-missing-dimension-in-sex"], "authors": [], "publish_date": null}