{"result_id": "307026", "URL": "https://www.thetrumpet.com/24973-the-vaccine-cult", "timestamp": "2023-04-25 17:34:57 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24973-the-vaccine-cult", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "The Pandemic of the Vaccinated (28 minutes)\n\nJoe Biden has been promoting the vaccine as bulletproof, but the facts are so overwhelmingly against his claims that even the Atlantic published a piece titled “The Pandemic of the Vaccinated Is Here.” The Washington Post ran a similar story about how the Biden administration is “sidelining vaccine experts.” The Centers for Disease Control and Prevention is also alerting people about “serious blood clots” and “harmful side effects” from the Johnson & Johnson and Moderna vaccines. Big pharmaceutical companies like Pfizer have so little confidence in their vaccine that they’re unwilling to provide the jab to refugees out of fear of “legal risks from harmful side effects” according to an organization that’s attempting to arrange a worldwide vaccination effort. Despite all of these warning signs, this is still the jab that some mayors in America are requiring citizens to have if they want to buy food or keep their jobs.\n\nBible Study: When Your Heart Is in God’s Work (27 minutes) \n\nElisha the prophet performed numerous miracles throughout his ministry. In many cases, these miracles were for those who lovingly supported the work he was doing—the Work of God. These biblical examples teach us a profound truth: God looks out for those who have their hearts in His Work! If you throw your whole heart into God’s Work, He will look after you and your family in ways above and beyond your wildest imaginations.", "opengraph": {"url": "https://www.thetrumpet.com/stephen-flurry/24973-the-vaccine-cult", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}