{"result_id": "307027", "URL": "https://www.thetrumpet.com/25386-what-fda-documents-reveal-about-the-covid-vaccine/print", "timestamp": "2023-04-25 17:34:57 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25386-what-fda-documents-reveal-about-the-covid-vaccine/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "The United States Food and Drug Administration released the first batch of covid-19 vaccine documents on March 1. The fda initially wanted to release the 200,000 pages over a period of 75 years. Under court order, the fda produced 50,000 pages. The most controversial was “5.3.6 Cumulative Analysis of Post-authorization Adverse Event Reports,” which provides Pfizer vaccine data from Dec. 1, 2020, to Feb. 28, 2021. The data is shocking.\n\nWhile the number of vaccines administered was redacted, the report did give the total number of adverse cases, stating: “Cumulatively, through 28 February 2021, there was a total of 42,086 case reports (25,379 medically confirmed and 16,707 non-medically confirmed) containing 158,893 events.” Out of those adverse effects, 1,223 people died. That means 2.9 percent of people who suffered an adverse event from the Pfizer vaccine died as a result of the vaccine. That is a rate of 1 in 34 people.\n\nConsider the swine flu outbreak in 1976. The Ford administration rushed a vaccine, and there were a number of deaths reported. The New York Times reported at the time that the vaccine program was halted in nine states because three people had died from the vaccine. Why wasn’t the most recent program halted or reviewed after 1,223 people died?\n\nThe fda report has a nine-page appendix of “adverse events of special interest.” Over 1,200 different adverse effects are listed, ranging from mild side effects to life-altering injuries. (You can find the full report here and the appendix here.)\n\nThe fda also released a review of the Moderna vaccine, which revealed “post-authorization safety surveillance has identified serious risks of myocarditis and pericarditis, particularly within seven days following the second dose of Moderna covid-19 vaccine. The observed risk is higher in males under 40 years of age than among females and older males. The observed risk is highest in males 18 through 24 years of age. … An increased risk for thrombosis with thrombocytopenia syndrome (tts) has been identified following administration of adenovirus-vectored covid-19 vaccines.” Why are the media and government not warning people about documented adverse effects?\n\nThe Centers for Disease Control and Prevention says the vaccines are “safe and effective.” The side effects listed on the cdc website are called “extremely rare” and include “tiredness, headache, muscle pain, chills, fever and nausea.” If people need to make informed decisions on vaccination, why were the 1,200 adverse effects and fatalities not released to the public until now?\n\nThe vaers website, as of March 28, lists 26,059 deaths caused by the vaccine and 143,554 hospitalizations. Side effects include 14,827 cases of Bell’s palsy, 4,377 miscarriages, 13,360 heart attacks, 37,133 cases of myocarditis/pericarditis, 13,139 shingles, and 48,342 permanently disabled. And these are just the reported cases. Historically, the vaers adverse events are underreported by a factor of 100.\n\nThe reported side effects are just the tip of the iceberg. The New York Post reported on an October 2020 study that warns some covid vaccines can increase the risk of cancer. “A modified virus being used in four covid-19 vaccine contenders—called adenovirus 5 (Ad5)—has been shown to increase transmission of the aids virus in the past, the researchers wrote in a ‘cautionary tale’ published in the Lancet medical journal,” wrote the Post. It will take time to see if this prediction is true, but initial data seem to support this analysis.\n\nSen. Ron Johnson hosted a panel discussion in Washington, D.C., in January called “COVID-19: A Second Opinion.” Attorney Thomas Renz presented data from whistleblowers inside the U.S. medical system. “Mr. Renz outlined data of adverse reaction to the vaccinations including a rate of miscarriages that increased 300 percent over the five-year average, a rate of increased cancer over 300 percent, and an increase in neurological issues over 1,000 percent (from 82,000 yearly average to now 863,000 in one year with the vaccines),” Conservative Treehouse wrote. The longer time goes on, the more and more adverse events become manifested in people.\n\nAnother large-scale adverse effect is tinnitus, ringing or other noises in your ears. vaers reported 12,247 such cases. Yet doctors have no explanation for why the vaccine is causing this issue. ZeroHedge reported:\n\nThe fda has issued a warning that the vaccines can induce a positive syphilis test. But there has been no direct explanation for why this is happening.\n\nAnother study from the Journal of Pediatric and Adolescent Gynecology found that increased use of the Pfizer vaccines in kids 12 years old and over correlated with an increase in post-vaccination genital ulcers. Yet Big Pharma companies continue to push for the vaccine to be approved for children age 6 months to 5 years.\n\nA study in Poland that is yet to be peer reviewed discovered that the mrna vaccine has an effect on the vitro lial cells in the brain. According to the study, the “mrna vaccine produces statistically significant changes in cell nucleus due to histone alterations. The results obtained for mitochondria, lipid droplets, cytoplasm may suggest that covid-19 mrna (Pfizer/BioNT) vaccine reprograms immune responses. The observed alterations in biochemical profiles upon incubation with covid-19 mrna in the specific organelles of the glial cells are similar to those we observe for brain cancer vs grade of aggressiveness.”\n\nThe adverse effects are becoming increasingly clear. Do the vaccines actually protect against infection? In January, Pfizer ceo Albert Bourla said: “We know the two-dose vaccine offers very limited protection, if any.” Bourla then recommended a third dose. On March 14, he said a fourth dose may be needed to fight off new variants. But Bourla promised in 2021 that two doses of Pfizer would provide 100 percent protection from infection and sickness. Importantly, Pfizer has made billions of dollars off of the vaccines.\n\nThe National Health Service in the United Kingdom reported that the February 2022 data sets clearly show there are more vaccinated people in hospitals and becoming infected in nearly every age demographic.\n\nIn the United States, Clayton Fox at RealClearInvestigations used state-released data to show that this has not been a pandemic of the unvaccinated. “Of the eight states publishing detailed, so-called ‘breakthrough’ death data on the vaccinated to the present, RealClearInvestigations found that Massachusetts—with a substantial 75 percent fully vaccinated rate—suffered the highest percentage of vaccinated deaths: 55 percent from January 1 to February 12. … Even a recent little-publicized and less comprehensive cdc report notes that among those 18 years of age or older across 25 U.S. jurisdictions, from early April to late December 2021 … 1 in 5 deaths were associated with the vaccinated, according to the study, suggests protection weaker than the public has been led to believe.”\n\nThe longer the vaccines are around and the more the virus mutates the less effective the vaccines become. The same data from the UK and U.S. showed that the booster’s effectiveness waned 75 percent in a matter of months.\n\nDespite all this evidence, Big Pharma keeps moving forward with the vaccine program. SkyNews reported that Moderna is launching a new three-in-one vaccination program that will target covid, the flu and respiratory syncytial virus. What’s next? Forbes quoted a bioethicist in August 2020, saying a “morality pill” should be developed where it enhances people’s morality and makes them more likely to adhere to masking and other health guidelines.\n\nThe evidence regarding the coronavirus vaccines points not only to a health-care disaster but also a sinister agenda behind the pandemic and the vaccines. The April 2022 Trumpet magazine exposes this corruption and the agenda behind covering up the adverse effects and aggressively pushing the vaccines. Trumpet editor in chief Gerald Flurry wrote in “A Sure Path to Healing and Health”:\n\nWhat should you put your faith in? This is an important question each individual must decide for himself. To find out more about this vital subject, please read “A Sure Path to Healing and Health.”", "opengraph": {"url": "https://www.thetrumpet.com/25386-what-fda-documents-reveal-about-the-covid-vaccine/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/1976/10/13/archives/swine-flu-prograrm-is-halted-in-9-states-as-3-die-after-shots.html", "https://phmpt.org/wp-content/uploads/2021/11/5.3.6-postmarketing-experience.pdf", "https://www.clarkcountytoday.com/wp-content/uploads/2022/03/List-of-Adverse-Events.pdf", "https://thefederalist.com/2022/03/25/why-arent-the-fda-and-cdc-informing-the-public-about-documented-adverse-events-after-mrna-injections/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://openvaers.com/covid-data", "https://nypost.com/2020/10/20/some-covid-19-vaccines-could-increase-hiv-risk-researchers/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32156-5/fulltext", "https://theconservativetreehouse.com/blog/2022/01/24/very-concerning-attorney-testifies-to-compiled-adverse-vaccine-reaction-statistics-provided-by-whistleblowers/", "https://www.zerohedge.com/covid-19/overwhelming-need-investigate-covid-19-vaccine-tinnitus-researchers", "https://www.sciencedirect.com/science/article/pii/S204908012200053X?via%3Dihub", "https://theconservativetreehouse.com/blog/2022/02/21/fda-warns-of-vaccine-induced-positive-syphilis-test/", "https://twitter.com/TheWildDocTN/status/1507102667109277704?cxt=HHwWkIC9kYH5puopAAAA", "https://www.biorxiv.org/content/10.1101/2022.03.02.482639v1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1057599/Vaccine_surveillance_report_-_week-8.pdf", "https://www.realclearinvestigations.com/articles/2022/03/02/correction_mr_president_this_is_a_pandemic_of_the_vaccinated_too_819385.html", "https://www.mass.gov/info-details/covid-19-response-reporting", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7104e2.htm", "https://twitter.com/SkyNewsAust/status/1506496684590702593", "https://www.barrons.com/articles/moderna-announces-new-3-in-1-vaccine-program-51647962648", "https://twitter.com/ConceptualJames/status/1503064462282133508?cxt=HHwWiMC4zcbK-tspAAAA", "https://www.thetrumpet.com/trumpet_issues/244", "https://www.thetrumpet.com/25295-a-sure-path-to-healing-and-health", "https://www.thetrumpet.com/25295-a-sure-path-to-healing-and-health"], "authors": [], "publish_date": null}