{"result_id": "307044", "URL": "https://www.thetrumpet.com/25667-vaccine-makers-target-monkeypox-profits/print", "timestamp": "2023-04-25 17:35:05 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25667-vaccine-makers-target-monkeypox-profits/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "About 200 people worldwide have contracted monkeypox, so Joe Biden is sounding the alarm. On May 27, he told reporters that everyone should be concerned about the monkeypox virus. He also announced that his administration is working hard to determine what vaccines might be available. He did not mention that his administration had already placed a $119 million order with Bavarian Nordic. This Danish company produces the only Food and Drug Administration-approved vaccine for monkeypox. Since this order includes a $180 million option for future purchases, the Biden administration has reserved 13 million Bavarian Nordic vaccine doses. Yet this purchase is more about enriching Big Pharma than helping Americans.\n\nMonkeypox is not a new disease. It has been endemic in Central Africa for decades. It spreads primarily through sexual contact with someone with an active rash. Most of the 200 known cases are homosexual men, so anyone not guilty of promiscuous homosexual sex has a minuscule chance of getting the disease. But Biden administration officials are not interested in discussing the dangers of promiscuous sex or homosexual sex. They would rather spend millions treating the effect instead of the cause, especially when such spending enriches the pharmaceutical representatives that establishment politicians rely on for campaign financing.\n\nThe has revealed that Dr. Anthony Fauci approved $100 million in grants to Bavarian Nordic for research on a smallpox vaccine in preparation for a BioShield contract in 2006. The watchdog group Open the Books has revealed that Fauci often receives undisclosed royalties for such generosity. Meanwhile, documents obtained by National File show that the University of Pennsylvania got paid by Bavarian Nordic to perform clinical trials on the monkeypox vaccine. Since the University of Pennsylvania also hosts the Penn Biden Center, this money went directly to administrators who have paid Biden at least $900,000 for work he did for the university on non-vaccine related issues.\n\nSo while there is no proof that Fauci and Biden are directly receiving funds tied to monkeypox vaccine sales, their links to the pharmaceutical industry illustrate the incestuous relationship between Big Government and Big Pharma. The covid-19 pandemic has spotlighted this relationship by showing how vaccine sales enrich pharmaceutical companies with deep ties to the United States government. A 2016 study published in the bmj medical trade journal found that most retiring Food and Drug Administration officials go on to work for drug companies, often for the same ones whose lucrative drug approvals they oversaw. The bureaucrats who negotiated Biden’s $119 million order of monkeypox vaccines can probably look forward to a lucrative business career at Bavarian Nordic or the University of Pennsylvania in the not-too-distant future.\n\nAn investigative report published by the Children’s Health Defense Team found that two asset management firms primarily control pharmaceutical executives, media executives and much of the government: BlackRock and Vanguard. These two firms are some of the biggest shareholders of Pfizer, Johnson & Johnson and Bavarian Nordic. They are also among the top owners of Comcast, Disney, News Corp and Time Warner. A big reason America no longer has an independent press is that the media is owned by the same oligarchs who control the pharmaceutical industry and, by extension, the Food and Drug Administration.\n\nHow is it possible that all these elites are colluding to such a large extent? Lust for profit and power explains much of it. But the degree to which they are in lockstep, the extent of the power they have seized, and the evils they have been willing to commit cannot be fully explained by profit, power, collaboration or any conspiracy theory. To understand this cabal’s inner workings, you have to look into Bible prophecy.\n\nOne end-time prophecy that reveals why America’s elites have cast truth to the ground is found in the book of Daniel: “Yea, he magnified himself even to the prince of the host, and by him the daily sacrifice was taken away, and the place of his sanctuary was cast down. And an host was given him against the daily sacrifice by reason of transgression, and it cast down the truth to the ground; and it practised, and prospered” (Daniel 8:11-12).\n\nAntiochus Epiphanes fulfilled this prophecy in 168 b.c. when he desecrated the temple in Jerusalem with an idol fashioned in his likeness. But Daniel recorded his book for the end time (Daniel 12:4). This prophecy is being fulfilled in type in America today.\n\nThe monkeypox vaccine is just the latest spotlight revealing the strings of power connecting Big Government, Big Pharma and Big Media. So while the monkeypox virus will probably not wreak as much destruction on America as covid-19 did, the network it partially reveals is the biggest threat to America today. As America Under Attack, by Trumpet editor in chief Gerald Flurry, proves, this network aims to destroy the United States, its Judeo-Christian history, its constitutional form of government, and the biblical principles this unique form of government is primarily based upon.\n\nGod is exposing the corruption in U.S. politics so people have a chance to repent before a lawless spirit destroys America by replacing the rule of law with the horrifying rule of powerful deception and brutal force. When people do not sincerely love the truth, they come to believe lies (2 Thessalonians 2:9-12).\n\nThe values that helped make America great are being cast to the ground. Still, Antiochus and his supporters can only do this by “reason of transgression.” America’s lawlessness and lack of faith is being exploited. God will allow this until people come to truly see the need for repentance toward God.", "opengraph": {"url": "https://www.thetrumpet.com/25667-vaccine-makers-target-monkeypox-profits/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bavarian-nordic.com/investor/news/news.aspx?news=6569", "https://www.who.int/news-room/fact-sheets/detail/monkeypox", "https://khn.org/morning-breakout/dr00034151/", "https://www.openthebooks.com/substack-investigation-faucis-royalties-and-the-350-million-royalty-payment-stream-hidden-by-nih/", "https://nationalfile.com/exclusive-fauci-funded-monkeypox-vaccine-maker-paid-bidens-host-university-for-clinical-trial-of-monkeypox-vaccine/", "https://www.npr.org/sections/health-shots/2016/09/28/495694559/a-look-at-how-the-revolving-door-spins-from-fda-to-industry", "https://www.thetrumpet.com/10458-america-under-attack"], "authors": [], "publish_date": null}