{"result_id": "307045", "URL": "https://www.thetrumpet.com/26899-twitter-files-big-pharmas-disinformation-campaign", "timestamp": "2023-04-25 17:35:06 CEST+0200", "meta": {"description": "The pharmaceutical industry is just as much a node of the “deep state” as Silicon Valley or Wall Street.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26899-twitter-files-big-pharmas-disinformation-campaign", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Twitter Files: Big Pharma’s Disinformation Campaign", "cleaned_text": "Massive pharmaceutical companies used Twitter and other social media companies to promote government lockdowns and to shut down discussion about low-cost covid-19 treatments, even for poor countries. They wanted your government to block you from living a normal life. They wanted you to line up for their dangerous injections to try to get some freedom back. They wanted your tax dollars. And they wanted you to look at social media and believe that this was all normal.\n\nThey got what they wanted.\n\nWe are able to discern this even more clearly with the January 16 batch of Twitter Files, internal e-mails from the social media giant that expose Johnson & Johnson, Moderna and Pfizer as engaging in what journalist Lee Fang described as “a massive lobbying blitz to crush any effort to share patents/IP for new covid-related medicine, including therapeutics and vaccines.”\n\nTwitter Files 16.0 reveals that powerful drug company lobbyists wrote to Joe Biden’s regime soon after it took power, demanding that the United States government “sanction any country attempting to violate patent rights and create generic, low-cost covid medicine or vaccines.” They didn’t just want to mandate their product on Americans; they wanted to all but mandate it on people around the world.\n\nBioNTech, which developed Pfizer’s vaccine, “reached out to Twitter to request that Twitter directly censor users tweeting at them to ask for generic low-cost vaccines” (ibid). In other words, Big Pharma, Big Government and Big Tech used a global epidemic to squash other treatments, even if they were as effective as their own, and to force injections of experimental ribonucleic acid sequences and other chemicals into as many people as possible.\n\nCalling these rapidly deployed injections “vaccines” is charitable. In the midst of the epidemic and injection free-for-all, U.S. government health agencies literally changed the definition of “vaccine.” The term previously applied to “a product that stimulates a person’s immune system to produce immunity to a specific disease, protecting the person from that disease.” Now there is a new definition: “A preparation that is used to stimulate the body’s immune response against diseases.”\n\nIt’s still a for-profit product. It wouldn’t be bringing billions in profits to pharmaceutical companies if it wasn’t. But now it just needed to “stimulate” your immune system—and who knows to what end. Then it could be called a “vaccine” on social media and everywhere else.\n\nMore information is coming out about how debilitating and even deadly these “vaccines” have been. Yesterday, “thanks Pfizer” was trending on Twitter. Yet Pfizer seems to still have some ability to influence what you see. A few of the posts under that heading had to do with people suffering Pfizer covid injection side effects, but otherwise the trend was a stream of joke posts that Pfizer had caused people to dance badly or caused movie characters to spasm.\n\nProject Veritas baited one Pfizer scientist to admitting on hidden camera in 2021 that, “I still feel like I work for an evil corporation, because it comes down to profits in the end. … Basically, our organization is run on covid money now.” Twitter Files 16.0 is more evidence of the same thing.\n\nDuring the covid-19 outbreak, Johnson & Johnson’s worldwide sales declined by about 11 percent, as fewer consumers had elective surgery or bought beauty products and as its vaccine was restricted due to safety concerns. Meanwhile, Pfizer’s revenue jumped by 95 percent and Moderna’s revenue soared by 2,200 percent. Government mandates, non-government mandates, critics being silenced and no alternative treatments meant huge paydays for pharmaceutical executives and stockholders.\n\nTwitter executives responded quickly to BioNTech’s censorship requests, which were backed by the German government, BioNTech being a German company. Yet the spokespeople for Johnson & Johnson, Moderna and Pfizer could recklessly exaggerate the risk of their competitors’ vaccines without censorship.\n\nA previous batch of Twitter Files released by journalist Alexander Berenson showed that Dr. Scott Gottlieb, a former Food and Drug Administration commissioner and current Pfizer board member, personally flagged tweets questioning Pfizer’s vaccine. Gottlieb’s connections in the federal government gave him some powerful influence: Politico called him America’s “shadow coronavirus czar” after he left the fda during the Trump presidency. Gottlieb is also a colleague of Dr. Anthony Fauci, whose household wealth grew by $5 million during the covid-19 pandemic. Did Gottlieb perhaps profit as well?\n\nNone of the first 16 batches of Twitter Files have yet exposed Dr. Fauci’s role in covid censorship, but Elon Musk has been teasing that the “Fauci Files” will be released soon. Perhaps the biggest question surrounding the Twitter Files is—or should be—what haven’t they revealed, and why?\n\nFang admitted in his January 16 article, “Covid-19 Drugmakers Pressured Twitter to Censor Activists Pushing for Generic Vaccine,” that his access to Twitter information was filtered. He was allowed “to make requests without restriction that were then fulfilled on my behalf by an attorney, meaning that the search results may not have been exhaustive.” Why filter Fang’s notional exposé if not to continue censoring information sensitive enough to get Twitter into trouble or someone else into trouble.\n\nThe fact that no Twitter Files journalist has been granted unfettered access is highly significant!\n\nFang wrote something similar when he published Twitter Files 8.0 in December, showing that Twitter leaders colluded with U.S. government propagandists then lied about it. He wrote, “The Twitter searches were carried out by a Twitter attorney, so what I saw could be limited.”\n\nWhat he saw was limited! Obviously so: Nothing he published occurred prior to 2017!\n\nOne of the few voices to point this out, and what it means, goes by the name Sundance.\n\n“Let me be very, very clear,” he wrote, regarding the Twitter Files 8.0 admission. “This release of information was filtered to avoid revealing that President Obama was the originator of this activity. … Barack Obama established the partnership between government and social media, and within this release, Twitter is protecting Barack Obama.”\n\nBarack Obama praised the efficacy of the covid vaccine last year, saying it has been “essentially clinically tested” on “billions of people worldwide.” He characterizes this as positive, but it is, in fact, horrific. We are already seeing ugly results from this massive human experiment, and it won’t stop here.\n\nMy father, Trumpet editor in chief Gerald Flurry, concurred with this analysis in “Barack Obama and the Twitter Files.” “Twitter began in 2006, became popular in 2007 and was an enormously powerful tool for controlling foreign policy and for controlling Americans by 2017 when Donald Trump was inaugurated president. What happened in between?” he wrote. “The 2009–2017 presidency of Barack Obama! Yet this batch of Twitter Files and apparently all the others so far have specifically avoided revealing what happened during those years!”\n\nIn order to secure his sweeping health-care reforms, Obama started colluding with Big Pharma back in 2010, according to memos released by the House Energy and Commerce Committee. And in order to promote private sector cybersecurity information sharing, he started colluding with Big Tech in 2015, according to the White House Office of the Press Secretary. The architect of the Big Government-Big Pharma-Big Tech complex running America is Barack Hussein Obama.\n\nEven Musk’s Twitter Files exposés conspicuously start the year after Obama left office. Few whistleblowers or journalists will even mention that fact, let alone ask why—let alone answer.\n\nDuring his eight years in office, and despite his populist and positive-sounding rhetoric, Obama fundamentally transformed the U.S. economy by growing the government and colluding with Big Business. The system now in place, complete with a false president in the White House, is a complete replacement for America’s constitutional republic.\n\nThis is the hidden story behind the Twitter Files.\n\nMy father’s book America Under Attack compares Obama to Antiochus vi Epiphanes, a Seleucid king who obtained power by pretending to be someone he was not. Through lies and flatteries, he usurped power from the rightful king, attacked people under his rule (the Jews), and tried to extinguish their very faith from existence. He betrayed the people of Jerusalem, slaughtered them, and desecrated the temple of God with an idol bearing his likeness. Among the flatterers, pretenders, deceivers and elite, Antiochus was the master flatterer, pretender, deceiver. Among those who exerted their will on the masses, he exerted his will above all.\n\nAntiochus used his power of deception to rise like a star, seizing power and exerting it for his own benefit, his own ideology, and often even his own whims. And the Bible warns that an end-time Antiochus would come on the scene and “cast down the truth to the ground” (Daniel 8:12). Barack Obama is using Twitter and other Silicon Valley companies to do just that. Radical leftists have taken off the mask, and God is exposing their total corruption. The nation-destroying problems afflicting America are not just the result of a senile president or a few corrupt tech oligarchs using their platforms for their own purposes. They are the successes of a malevolent shadow president running America’s deep state from behind the scenes!\n\nKeep watching for revelations from the Twitter Files and elsewhere—especially for anything prior to 2017.\n\nRequest your free copy of America Under Attack.", "opengraph": {"url": "https://www.thetrumpet.com/26899-twitter-files-big-pharmas-disinformation-campaign", "site_name": "theTrumpet.com", "title": "Twitter Files: Big Pharma’s Disinformation Campaign", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjMvMDEvMjQvOHdnY2hib3pjZF8yMDIzMDEyNF9QZml6ZXJfR2V0dHlJbWFnZXNfMTI5MjU0MTI4Ni5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/8cf861694ae790a5/20230124-Pfizer-GettyImages-1292541286.jpg.jpg", "description": "The pharmaceutical industry is just as much a node of the “deep state” as Silicon Valley or Wall Street.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/lhfang/status/1615008625575202818", "https://www.adweek.com/brand-marketing/johnson-johnson-sales-decline-pandemic/", "https://www.macrotrends.net/stocks/charts/PFE/pfizer/revenue", "https://www.macrotrends.net/stocks/charts/MRNA/moderna/revenue", "https://www.foxbusiness.com/politics/elon-musk-teases-fauci-files-released-this-week-twitter", "https://theintercept.com/2023/01/16/twitter-covid-vaccine-pharma/", "https://twitter.com/lhfang/status/1605304933242343426?s=20&t=-OnQzjH5VQZaXMUIOSmpag", "/26881-barack-obama-and-the-twitter-files", "https://medicalxpress.com/news/2012-06-obama-collaboration-big-pharma-exposed.html", "https://www.google.com/search?client=firefox-b-1-d&q=Office+of+the+Press+Secretary", "https://www.thetrumpet.com/literature/books_and_booklets/3967", "https://www.amazon.com/Rising-Star-Making-Barack-Obama/dp/0062641832", "/25771-america-under-attack"], "authors": [], "publish_date": null}