{"result_id": "307013", "URL": "https://www.thetrumpet.com/23962-where-are-vaccine-passports-leading", "timestamp": "2023-04-25 17:34:50 CEST+0200", "meta": {"description": "Could COVID-19 usher in a brave new world of governmental control?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/23962-where-are-vaccine-passports-leading", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Where Are Vaccine Passports Leading?", "cleaned_text": "Could -19 usher in a brave new world of governmental control?\n\n“Papers please.” These are perhaps the most un-American or un-British words in the English language. The Western world has established and prided itself on love of individual freedom and limited governmental control.\n\nThat time could be ending. In America and Britain, and around the world, governments are planning unprecedented surveillance and control on the pretext of combating covid-19.\n\nThis new surveillance society will require no rustling of papers. Governments are working on the most convenient system of identification and surveillance ever using smartphones and online tools. But the result is the same. New vaccine passports could soon mean the government can track your every move.\n\nHere is what the daily routine of a vaccinated citizen might look like.\n\nIn the morning, you leave for work. On your smartphone, you buy a train ticket to commute. The ticketing app checks your vaccine status, verifying when and where you were vaccinated, before allowing you to buy a ticket. You board one of the more convenient carriages. People unverified as vaccinated must wait in a line for the socially distant carriages, if they are allowed on the train at all.\n\nYou scan your security pass to get into work. Then you scan your covid vaccine app. Your employer only allows vaccinated staff in the office. No jab, no job.\n\nAt lunch, you leave the office to buy a sandwich. There’s a good coffee shop down the road. Scan the vaccine app, and you’re in. Scan the app again to get back to the office, and you are back at the desk.\n\nAfter work, you stop by the gym. They checked your vaccine status when you re-enrolled after lockdown. No vaccine, no membership. After heading home to change, you stop by a friend’s house party. But government rules prohibit group gatherings unless everyone is vaccinated. By law, your friend has to scan all your smartphone vaccine passes with his smartphone. It used to be awkward, but now everyone is getting used to it.\n\nThe result is the government knows where you are at every point of the day. It has a level of surveillance, and therefore control, that until recently the Chinese Communist regime could only dream of. A government record determines if you can work, travel, access entertainment or gather with friends.\n\nDoes this seem far-fetched? It is actually a reasonable picture based on plans already being drawn up by governments around the world.\n\nSome of this is already reality in the State of Israel. Restaurants and sporting venues are open—if you have a vaccine pass. Only with a “green pass” do you have the freedom to stay in a hotel, go to the gym, hold a wedding, or even attend certain religious gatherings. A teaching assistant who refused one has been fired, and lost in court when she tried to recover her job.\n\nGil Gan-Mor, director of the civil and social rights unit at the Association for Civil Rights in Israel, sees no problem with this. “Anybody who is complaining can get the vaccine tomorrow morning,” he said. And this is someone whose job is to uphold citizens’ rights!\n\nOn April 5, the United Kingdom laid out its plans: requirements for vaccine passports to attend concerts, theaters, nightclubs and large sporting events. One contractor working on the pass boasts that the app could deny people tickets or entry to the office for those unvaccinated. It even shows how the app could be used to prevent the unvaccinated from private events like birthday parties.\n\nIt won’t get that dictatorial though, will it? This is Britain, after all, the mother of parliaments, the land of constitutional monarchy. As slippery as all politicians can be, they would never attempt to oppress the people with anything so un-British as a vaccine passport, would they?\n\nThey have guaranteed that they won’t. In December, Vaccines Minister Nadhim Zahawi said, “We have absolutely no plans for vaccine passports.” Cabinet minister Michael Gove said the same month: “I think mandating vaccinations is discriminatory and completely wrong … and I would urge businesses listening to this debate today not to even think about this.” In a later interview, he said, “I certainly am not planning to issue any vaccine passports, and I don’t know anyone else in government who would.”\n\nThe very same month, a consulting firm published a government commissioned report into how vaccine passports could be used to keep unvaccinated people out of pubs, sports events and other crowded venues.\n\nThe government insists that it won’t force pubs and restaurants to require the vaccine. Yet it seems prepared to require these same businesses to enforce measures like social distancing—unless they require vaccine passports. The government claims to be saying, We’re not requiring pubs check vaccine passports, but if they do it voluntarily, we won’t stand in the way. Meanwhile it crafts rules that make it almost impossible for a restaurant to make a profit if it doesn’t require a passport.\n\nFraser Nelson warned in the Telegraph that “the fundamentals of a biosecurity state are now under construction. This is what ministers think the public now want: a big shift in the dial away from liberty so the state can better provide security. It’s happening incrementally, with no real debate” (March 25).\n\nThe European Union is also marching toward vaccine passports. Its efforts involve more than national tracking; with free travel across many European borders, it needs a supranational system. This means a new level of centralization, with data gathered on ordinary citizens across a couple dozen countries to be united in a single centralized system. Never has the EU exerted such control over the lives of Europeans.\n\nVaccine passport plans are underway even in America. New York is rolling out its “Excelsior Pass.” Without it, you cannot attend art and entertainment venues, or have more than a certain number of people attend your private gathering. And you can only get the pass with proof of a recent negative covid-19 test or vaccination.\n\nBut something like this—or even more restrictive than this—could go nationwide. The Biden administration used to say vaccine passports should be left to states. But on March 29, they announced it was working on a federal, standardized system. cnn cited an anonymous government official stating, “Multiple government agencies are engaged in conversations and planning, coordinated by the White House, as this kind of system will play a role in multiple aspects of life, including potentially the workforce.”\n\nLike the British government, the U.S. government has said that citizens will not be forced to accept a vaccine passport. Maybe it will not pass a law explicitly stating that the non-vaccinated shall serve a prison sentence. But if the government gets its way, you will be forced to accept a vaccine passport if you want to resume a somewhat ordinary day-to-day life.\n\nGovernments have made all kinds of promises that the data they collect and track will be private and not subject to tracking. But how much can you trust governments that have been caught surveilling and tracking their citizens in other ways, and have been caught lying specifically about this issue?\n\nEven if the intentions of every powerful member of government are pure and good, the track record of governments and even businesses that engage in mass data collection is poor, to say the least.\n\nNot even the Soviet Union was able to track its citizens’ movements in real time. Such a system could be misused in many ways. Once a government builds it, it could use the same infrastructure to track, check and exclude people for any reason. A big red X could show up on the screen of the train conductor, job interviewer, café cashier, banker, school administrator, social worker, police officer or government agent if the person shows up in the government database as unvaccinated, unregistered in some other government scheme, guilty of something the government has declared a crime, involved in a certain political party, possessing membership in a certain religious group, having contacted certain people, having read certain material, or having posted a certain opinion online.\n\nThe infrastructure for vaccine passports won’t do all these things, but it will do most of the heavy lifting. And crucially, it will break perhaps the first and biggest barrier of all: citizens’ resistance to surrendering their rights.\n\nShould You Be Worried?\n\nThe infrastructure we are talking about—that elites in your national government are talking about—can determine your ability to buy, to sell, to work. This has reminded many people of a particular verse in the Bible: “And that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name” (Revelation 13:17).\n\nThis is describing the “mark of the beast,” a dangerous, ungodly mark that Bible prophecy says will be implemented during a terrible period in modern human history.\n\nConsidering this verse, should Christians be worried about the fact that their governments have begun implementing vaccine passports?\n\nThere are certainly general biblical principles at play that should cause us concern. Jeremiah 17:9 warns, “The heart is deceitful above all things, and desperately wicked: who can know it?” Give flawed human beings such massive governmental power over other human beings, and they will abuse it. Britain’s and America’s forefathers had enough Bible knowledge to know this. That is what motivated them to limit and check the power of the national government. What the Bible reveals about human nature, human government and specific events prophesied for the future should prompt us to pay close attention to what is underway in our governments.\n\nHowever, a covid vaccine or passport is not the biblically prophesied mark of the beast (see sidebar). However, this system could one day be used to set up such a mark—and exclude those that refuse it from business, public transport and the workplace.\n\nEven if opponents to these kinds of passes succeed, look at how much liberty we have already lost over the course of the pandemic. Another assault on that liberty, in order to implement a mark, will be that much easier.", "opengraph": {"url": "https://www.thetrumpet.com/23962-where-are-vaccine-passports-leading", "site_name": "theTrumpet.com", "title": "Where Are Vaccine Passports Leading?", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMDUvMDUvMTUybDhid2MzZl8yMTA1MDVfVmFjY2luZV9QYXNzcG9ydHNKQUdfVmFjY2luZV9QYXNzcG9ydF9XaWRlLmpwZyJdLFsicCIsInRodW1iIiwiMTAyNHgiXSxbInAiLCJlbmNvZGUiLCJqcGciLCItcXVhbGl0eSA4MCJdXQ/531c869853ca061b/210505-Vaccine%20PassportsJAG_Vaccine%20Passport%20Wide.jpg.jpg", "description": "Could COVID-19 usher in a brave new world of governmental control?", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}