{"result_id": "307047", "URL": "https://www.thetrumpet.com/26305-pfizer-cashes-in-on-covid", "timestamp": "2023-04-25 17:35:08 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26305-pfizer-cashes-in-on-covid", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Big Government, Big Pharma and Big Media are colluding to make a mountain of money. Once the Biden administration uses up the last of its 450 million doses of Pfizer-BioNTech vaccine, Pfizer will start charging $130 for a single shot. The company confirmed this price to the Daily Mail on October 21 after Congress refused to approve $15 billion in additional pandemic spending.\n\nDaylight robbery: The People’s Vaccine Alliance described the price hike as “daylight robbery” since the Pfizer vaccine costs only $1.18 to make.\n• Pfizer is selling its vaccine to the U.S. government with a 1,700 percent markup and plans to sell it to U.S. citizens with an 11,000 percent markup.\n• Pfizer’s revenue has tripled since the start of the pandemic, and the company expects to generate $32 billion in vaccine revenue this year.\n• Pfizer Albert Bourla has made $50 million in the past two years.\n• BioNTech Ugur Sahin is one of nine “vaccine billionaires” who emerged during the -19 pandemic.\n\nEndemic corruption: Pfizer and BioNTech executives could never have made so much money if the U.S. Food and Drug Administration did not bypass external experts to authorize covid-19 vaccines. But according to fda executive Christopher Cole, both food companies and vaccine companies “pay us hundreds of millions of dollars a year to hire and keep reviewers to approve their products.” So the government is working with Big Pharma and Big Media to make billions selling vaccines to Americans.\n\nProphecy says: Daniel 8:11-12 reveal that a host of corrupt politicians, unelected bureaucrats, media moguls and pharmaceutical executives will help an end-time Antiochus “cast down the truth to the ground” in the end time. This prophecy describes the “deep state” that is helping Barack Obama grind down America with Communist philosophy. The covid-19 pandemic is only a tiny part of his network’s attack, but tracing vaccine revenues allows us to see the inner workings of the cabal dedicated to fundamentally transforming America. Learn where this trend is leading in our article “Running on ‘COVID Money.’”", "opengraph": {"url": "https://www.thetrumpet.com/26305-pfizer-cashes-in-on-covid", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thetrumpet.com/25289-running-on-covid-money"], "authors": [], "publish_date": null}