{"result_id": "307025", "URL": "https://www.thetrumpet.com/24095-pfizer-vaccine-linked-to-myocarditis-cases", "timestamp": "2023-04-25 17:34:56 CEST+0200", "meta": {"description": "Perhaps even more concerning than the vaccine is the way the media is reporting it.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24095-pfizer-vaccine-linked-to-myocarditis-cases", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Pfizer Vaccine Linked to Myocarditis Cases", "cleaned_text": "A friend of mine recently told me that they had a family member die soon after receiving a covid-19 vaccine. This is not just an isolated case. It has happened a number of times since the release of the vaccines. Yet the media has generally avoided reporting such incidents. Serious concerns are mounting, however. A new study by the Israeli Health Ministry published on June 2 found links between the vaccine and adverse effects on the younger generation.\n\nThe Pfizer-BioNTech vaccine, the first-ever mrna vaccine, is considered one of the most advanced vaccines. But Israel’s Health Ministry reported in a June 1 statement that “there is a probable link between receiving the second dose (of Pfizer) vaccine and the appearance of myocarditis among men aged 16 to 30.”\n\nAs of June 2, the World Health Organization has reported 839,483 confirmed cases of covid-19 in Israel and 6,412 deaths. The chances of dying following a covid-19 infection in Israel is 0.76 percent or less, when you factor in all the mild covid cases that go unreported. Many other underlying health conditions factor into the situations when coronavirus is actually highly harmful or fatal. The chances of someone under the age of 30 dying of covid-19 is close to zero.\n\nYet we are seeing a massive push across society for the younger generation, and everyone else, to get vaccinated. This has consequences.\n\nThe Israeli Health Ministry noted that among the nation’s 5 million vaccinated people, 275 suffered myocarditis. The mainly young men noted the symptom just after receiving the Pfizer’s covid-19 vaccine. The study also noted that most patients spent no more than four days in the hospital and that 95 percent of these cases were classified as mild.\n\nReports often highlight that the number of cases with adverse reactions are low or that the symptoms are mild. But if you consider that this age group is one of the least endangered groups by covid-19, these numbers are concerning. If they had gotten covid-19 itself, statistically speaking, they would barely have noticed it—or not noticed it at all. But instead they got the vaccine and spent days in the hospital. What’s more, long term effects of taking the vaccine are still ongoing—as is the vaccinating. Experts say that the recent findings will likely not affect the government of Israel’s decision to vaccinate 12-to-15-year-olds.\n\nPerhaps in a few weeks, month or years we will learn the adverse effects of this decision.\n\nThis is not to downplay the virus itself. Reports are mounting that it was likely manufactured in a lab in China. But to treat an unknown disease with another untested, partly poisonous substance is, to the very least, concerning and should be viewed critically and examined closely by the media. But across the mainstream media we see suppression of critical views. These are the same news and social media executives who actively suppressed and disparaged as a “conspiracy theory” the idea that the virus originated at a lab in China just one year ago. A year from now, will they be walking back their vociferous attacks on people questioning these experimental vaccines?\n\nTal Brosh, head of the Infectious Disease Unit at Samson Assuta Ashdod Hospital, told the Jerusalem Post, on Nov. 17, 2020: “There is a race to get the public vaccinated, so we are willing to take more risks.” He then noted that there are still many unique and unknown risks associated with the mrna vaccines, including systemic inflammatory responses that could lead to autoimmune diseases.\n\nConcerned about health, the world is risking the health of its citizens. Trumpet executive editor Stephen Flurry commented on Brosh’s statement: “It is too early to tell what the long-term effect of this new technology will ultimately be. But you would think people would take such warnings more seriously.”\n\nPerhaps even more concerning than the vaccine is how the media is reporting any concerns about the vaccine.\n\n“Vaccines have been hailed as the miracle that will help covid-weary society return to normal,” Mr. Flurry noted. “But one ingredient has been missing from the vaccine rollout: honesty.”\n\nAs more and more cases of adverse side effects emerge, we learn more and more. Doctors and experts are far from perfect. No one should expect them to be. That means we shouldn’t blame them for everything that goes wrong, but it also means that we should stop upholding them as if they are gods and our only hope!\n\nIn Psalm 103:2-3, we read: “Bless the Lord, O my soul, and forget not all his benefits: Who forgiveth all thine iniquities; who healeth all thy diseases.” The world has chosen to trust in flawed men instead. This pandemic and our response to it is just one symptom.\n\nI encourage you to read Mr. Stephen Flurry’s article on this important and timely subject: “Gotten Your Jab Yet?” Also request your free copy of The Plain Truth About Healing, by Herbert W. Armstrong.", "opengraph": {"url": "https://www.thetrumpet.com/24095-pfizer-vaccine-linked-to-myocarditis-cases", "site_name": "theTrumpet.com", "title": "Pfizer Vaccine Linked to Myocarditis Cases", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMDYvMDIvMWRuY3JyNTFwcV8yMTA2MDJfVmFjY2luZV9HZXR0eUltYWdlc18xMjMyMTgwOTMxX2NvcHkuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/e15848f11c4e59a4/210602-Vaccine-GettyImages-1232180931%20copy.jpg.jpg", "description": "Perhaps even more concerning than the vaccine is the way the media is reporting it.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.timesofisrael.com/israel-reports-link-between-pfizer-2nd-shot-and-heart-problem-in-males-under-30/", "https://www.timesofisrael.com/israel-reports-link-between-pfizer-2nd-shot-and-heart-problem-in-males-under-30/", "/23961-gotten-your-jab-yet", "/1293-the-plain-truth-about-healing"], "authors": [], "publish_date": null}