{"result_id": "307017", "URL": "https://www.thetrumpet.com/26979-a-war-against-cancer", "timestamp": "2023-04-25 17:34:52 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26979-a-war-against-cancer", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "A War Against Cancer", "cleaned_text": "On January 6, the Germany-based pharmaceutical company BioNTech announced plans to set up a research and development center for cancer therapy in the United Kingdom. For years, BioNTech has been working on a cancer vaccine, but most recently, it has concentrated its efforts together with Pfizer on the covid-19 vaccine. German Chancellor Olaf Scholz visited BioNTech’s headquarters on February 2 and congratulated them for refocusing on cancer vaccines.\n\nCancer has caused more deaths worldwide than covid-19. It accounted for nearly 10 million deaths in 2020 alone. That’s why cancer research has been a priority for nations around the world. And Germany has been at the forefront of cancer research. In the early 20th century, German cancer research was the most advanced in the world. The success in this field continued during Adolf Hitler’s reign, greatly funded by the führer himself.\n\nToday’s leaders also see the importance of fighting cancer. Former German Defense Minister Karl-Theodor zu Guttenberg sits on the Futures Council of the Human Vaccine Project, which published “A Roadmap for Cancer Vaccine Development” in 2016. In the same year, former United States President Barack Obama said: “[L]et’s make America the country that cures cancer once and for all.” In 2019, Joe Biden promised to “cure cancer” if elected president.\n\nOn Jan. 20, 2022, the U.S. government-sponsored National Cancer Institute wrote that “some investigators believe the success of the mrna covid-19 vaccines could help accelerate clinical research on mrna vaccines to treat cancer.” In April 2022, Obama said: “We’ve essentially clinically tested the [covid] vaccine on billions of people worldwide.” The mrna technology now deployed in the cancer vaccine was “clinically tested” on billions of people. This is the basis for the recent success.\n\nIf that’s the basis of the recent scientific breakthrough, we need to be concerned.\n\nThe late Herbert W. Armstrong noted that the first human experiment took place in the Garden of Eden when Eve took from the forbidden fruit. At that point, mankind 1) rejected revelation, 2) used observation, 3) used experimentation, and 4) used human reasoning. “And that is precisely the ‘scientific’ method used by modern science today!” Mr. Armstrong said.\n\nAs Mr. Armstrong wrote in Mystery of the Ages, God has cut mankind off from Himself until mankind repents and realizes that its ways don’t work. Today mankind seeks to cure the diseases that plague our body and society. But the proposed solutions are destructive. To understand the origins of the experiment that we are living in and God’s coming solution, request a free copy of Mystery of the Ages.", "opengraph": {"url": "https://www.thetrumpet.com/26979-a-war-against-cancer", "site_name": "theTrumpet.com", "title": "A War Against Cancer", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjMvMDIvMDYvN292N2FiMXRlbl8yMDIzMDIwNl9PbGFmX0dldHR5SW1hZ2VzXzEyNDY3NDAzOTUuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/63ad3bbe5e2db666/20230206-Olaf-GettyImages-1246740395.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://archive.nytimes.com/www.nytimes.com/books/first/p/proctor-cancer.html?_r=2", "https://www.science.org/doi/10.1126/scitranslmed.aaf0685", "/26510-sudden-deaths-skyrocket-as-white-house-pushes-untested-drugs", "/35-mystery-of-the-ages", "/35-mystery-of-the-ages"], "authors": [], "publish_date": null}