{"result_id": "307039", "URL": "https://www.thetrumpet.com/26796-new-mrna-cancer-vaccine-the-experiment-continues", "timestamp": "2023-04-25 17:35:03 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26796-new-mrna-cancer-vaccine-the-experiment-continues", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Pfizer’s partner BioNTech announced on January 6 trials in the United Kingdom for a new cancer vaccine. The vaccine is “part of a new government partnership to fast-track development of the same mrna technology behind the most successful coronavirus vaccines as companies race to build upon pandemic successes and target other diseases.” Trials will start in September.\n\nAdvancing “science”: By producing and injecting billions of mrna covid vaccine doses, Pfizer and BioNTech have gained important data and funding for the next frontier. But the so-called “pandemic successes” did not come without side effects and deaths. (Read “Sudden Deaths Skyrocket as White House Pushes Untested Drugs,” by Stephen Flurry.)\n\nThe funds: The funding for this next project is also suspicious. Since 2020, the European Union has ordered 4.2 billion vaccine doses for a population of fewer than 450 million—enough to vaccinate almost every citizen 10 times. The vast majority, however, had enough after the second and third shot. Due to the contracts, the EU government must keep paying for the overpriced doses. European Commission President Ursula von der Leyen has refused to publish text messages with Pfizer ceo Albert Bourla that preceded the largest order: €35 billion covering 1.8 billion doses.\n\nThe experiment continues: The dubious way BioNTech is getting the money and scientific data puts this latest apparent success in a different light. Our April 2022 Trumpet issue “Running on ‘COVID Money’” covers this topic in detail. I encourage you to read “What Happens When Government Controls People’s Health?” and “You Are Living in an Experiment.”", "opengraph": {"url": "https://www.thetrumpet.com/26796-new-mrna-cancer-vaccine-the-experiment-continues", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://investors.biontech.de/news-releases/news-release-details/biontech-announces-strategic-partnership-uk-government-provide", "https://www.thetrumpet.com/26510-sudden-deaths-skyrocket-as-white-house-pushes-untested-drugs", "https://www.thetrumpet.com/trumpet_issues/244", "/25292-what-happens-when-government-controls-peoples-health", "/25291-you-are-living-in-an-experiment"], "authors": [], "publish_date": null}