{"result_id": "307032", "URL": "https://www.thetrumpet.com/26838-big-pharma-pressured-twitter-into-shaping-vaccine-dialogue", "timestamp": "2023-04-25 17:35:00 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26838-big-pharma-pressured-twitter-into-shaping-vaccine-dialogue", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Lee Fang released new information from the “Twitter Files” on January 16 on how “the pharmaceutical industry lobbied social media to shape content around vaccine policy.” The drug maker BioNTech somehow caught wind of a campaign “targeting the pharmaceutical companies developing the covid-19 vaccine.” The campaign in question centered around the vaccine patents and intellectual property being shared internationally for the creation of low-cost vaccines. To Big Pharma, this was unacceptable. So they approached Twitter.\n\nCensorship request: They contacted Nina Morschhaeuser, a former Twitter head of Public Policy based in Germany, to put a stop to it, and she brought their concerns to Twitter headquarters.\n\nThe authorities are warning about “serious consequences” of the action, i.e. posts and a flood of comments “that may violate tos [Terms of Service]” as well as the “takeover of user accounts” are to be expected. Especially the personal accounts of the management of the vaccine manufacturers are said to be targeted. Accordingly, fake accounts could also be set up.\n\n —Nina Morschhaeuser\n• The monitoring and shielding of the corporate accounts of Pfizer, BioNTech, Moderna and AstraZeneca from activists\n• Monitoring and “hiding” tweets and hashtags referring to the “People’s vaccine” and joining the -19 Technology Access Pool\n• An open communication channel with recommendations of accounts to suspend from Twitter\n\nThe files don’t show whether Twitter fully complied with these specific requests, but it is clear that several real accounts were suspended, not only for asking for the sharing of vaccine patents but for questioning the impending implementation of vaccine passports.\n\nBig profit: At the core of the matter though wasn’t the campaign’s desire for a shared vaccine. The main problem was the request for transparency. Making the vaccine patents public would have exposed all the cut corners contributing to the dangerous makeup of the vaccine. It would have exposed that the vaccines amounted to a patchwork, high school science experiment.\n\nSuch exposure would have jeopardized the record profits Big Pharma could make from these vaccines. And that was unacceptable.", "opengraph": {"url": "https://www.thetrumpet.com/26838-big-pharma-pressured-twitter-into-shaping-vaccine-dialogue", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://theintercept.com/2023/01/16/twitter-covid-vaccine-pharma/", "https://www.thetrumpet.com/trumpet_issues/244"], "authors": [], "publish_date": null}