{"result_id": "307005", "URL": "https://www.thetrumpet.com/25010-should-pregnant-women-get-the-covid-vaccine", "timestamp": "2023-04-25 17:34:45 CEST+0200", "meta": {"description": "An important question worth considering", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25010-should-pregnant-women-get-the-covid-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Should Pregnant Women Get the COVID Vaccine?", "cleaned_text": "Should pregnant women get the covid vaccine? It’s an important question. But the answer may surprise you.\n\nThere is no data regarding the vaccine’s effect on pregnant women. The vaccine trials excluded pregnant subjects due to the health risks. So no one knows the short- or long-term effects of the vaccine on pregnant women, the fetus in the womb or newborns. However, in a health alert, the Centers for Disease Control and Prevention “strongly recommends covid-19 vaccination either before or during pregnancy because the benefits of vaccination outweigh known or potential risks.”\n\nThe vaers website gives some indication of the potential risks. By September 2021, nearly 4,000 women had reported adverse events, with 1,144 of those reports being miscarriage or premature birth. Reading through the details of each woman’s tragic story brings up some serious questions. Notice a couple first-hand accounts:\n\nI was 28 weeks and 5 days pregnant when I received the first dose of the covid-19 vaccine. Two days later (12/25/2020 in the afternoon), I noticed decreased motion of the baby. The baby was found to not have a heartbeat in the early a.m. on 12/26/2020 and I delivered a 2lb 7oz nonviable female fetus at 29 weeks gestation. … I received the vaccine on 1/15/21. I was 12 weeks and 4 days pregnant. My cell free dna testing was normal that week and it was a boy. My ultrasound four days prior was normal too. On 1/19/21 the baby did not have a heartbeat. My [estimated due date] was 7/26/21.\n\nvaers is a passive reporting site, meaning individuals must proactively log an event with the site, so it is a good indicator, but not considered rock-solid data. So what does the data itself say? It appears that the expecting mothers who are getting the jab are the vaccine trial.\n\nThe cdc’s official guidance that pregnant women should get the vaccine is based on a study that tracked 1,249,634 delivery hospitalizations during the period of March 2020 to September 2021. The study wrote: “Pregnant women are at increased risk for severe covid-19-related illness, and covid-19 is associated with an increased risk for adverse pregnancy outcomes and maternal and neonatal complications.” These findings make sense: Any sickness to a pregnant woman will increase the chance of complications. The study continues: “Among deliveries with covid-19, chronic hypertension, multiple-gestation pregnancy, adverse cardiac event/outcome, placental abruption, sepsis, shock, acute respiratory distress syndrome, mechanical ventilation, and icu admission were associated with a higher prevalence of stillbirth.”\n\nThe pregnant mothers who had an underlying condition and covid had more complications. This again, makes sense because this follows the trend with the general population: If you have comorbidities, covid-19 takes a more negative effect. The study says in the conclusion: “Data on the association between covid-19 in pregnancy and stillbirth are emerging.”\n\nAt the very bottom of the study, the cdc lists seven limitations in the study: “Sixth, it was not possible to assess vaccination status in this analysis. However, because covid-19 vaccines are highly effective, and covid-19 vaccination coverage among pregnant women was approximately 30 percent as of July 2021, most women with covid-19 at delivery were likely unvaccinated.” The study does not consider the vaccination status as a factor in the complications, and makes the assumption that those with covid were unvaccinated. This notion has been thoroughly debunked by the cdc itself, which admits the vaccine does not prevent catching the virus. The vaccination rate for pregnant mothers has been hovering around 30 percent.\n\nThe most up-to-date government studies are advising with incomplete evidence. What other data is out there to help make the picture clearer?\n\nScotland reported a sudden spike of newborn deaths in September 2021. A total of 21 newborns died that month, launching a red alert. The investigation is still ongoing. Stillbirth data has not been released for the last half of 2021, and in Alberta, Canada, a doctor was discouraged from investigating if a stillbirth was caused by the covid vaccine.\n\nNormal vaccine development takes upward of five years before being approved for widespread use. However, the covid vaccine development was condensed to one year, which is leaving many questions without verifiable answers.\n\nThe reports of stillbirths and miscarriages on vaers and many other anecdotes of rising stillbirths in hospitals and pregnancy groups all point to the fact that something changed from 2020 to 2021 and is causing these abnormalities. Only two significant factors have changed: the delta variant and the covid vaccine being available. No study has been done on the effects of mrna vaccines on pregnancy and newborns. The studies being used to justify vaccination of pregnant mothers have excluded vaccine status, have been very limited in scope, or have exclusively focused on health-care workers. However, the reports on vaers keep growing every day.\n\nWhy is the media not covering these reports? And why are the experts recommending vaccines without any trials on pregnancy? Should you get vaccinated?\n\nThese are very important questions. Trumpet executive editor Stephen Flurry wrote:\n\nNow is a good time to be thinking about where you put your trust for health and healing. We all put our trust in something. Most of us place it partly or wholly in the medical establishment—even when that establishment is inherently limited to what human beings can scientifically discover—even when what it discovers is then discovered to be wrong just months or weeks later—even when advancements in science are constantly outpaced by advancements in disease—even when the medical method of “healing” is not to return the body to its natural state but to make it even less natural with chemicals and scalpels—even when much of the medical industry has nothing to do with science or healing and has everything to do with pharmaceutical stockholders and political agendas.\n\nTo learn more on this subject, please read “Gotten Your Jab Yet?” and “Truth About the Vaccine.”", "opengraph": {"url": "https://www.thetrumpet.com/25010-should-pregnant-women-get-the-covid-vaccine", "site_name": "theTrumpet.com", "title": "Should Pregnant Women Get the COVID Vaccine?", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMDEvMDMvbjk1aXV6cW5uXzIyMDEwM19wcmVnb19jb3ZpZF9pU3RvY2tfMTMyODM3MDc1OS5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/067d29bafcc666cb/220103-prego%20covid-iStock-1328370759.jpg.jpg", "description": "An important question worth considering", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://emergency.cdc.gov/han/2021/han00453.asp", "https://stevekirsch.substack.com/p/latest-devastating-news-on-the-vaccine?", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7047e1.htm", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html", "https://www.heraldscotland.com/news/19726487.investigation-launched-abnormal-spike-newborn-baby-deaths-scotland/", "https://www.youtube.com/watch?v=LpJpc0Dm3GA&t=1018s", "https://www.thetrumpet.com/23961-gotten-your-jab-yet", "https://www.thetrumpet.com/23961-gotten-your-jab-yet", "https://www.thetrumpet.com/23729-truth-about-the-vaccine"], "authors": [], "publish_date": null}