{"result_id": "307001", "URL": "https://www.thetrumpet.com/25289-running-on-covid-money/print", "timestamp": "2023-04-25 17:34:43 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25289-running-on-covid-money/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "The coronavirus crisis has decimated the economy and hurt the bottom line of millions of citizens. But it has not been bad for everybody. While the bank accounts of small-business owners and wage earners dwindle from oppressive lockdowns, vaccine mandates and runaway inflation, Big Media, Big Pharma and Big Government are reaping fortunes.\n\nPfizer made nearly $37 billion in covid-19 vaccine sales last year and will likely make another $54 billion this year. Thanks to the coronavirus outbreak, its revenue has doubled. If Pfizer were a country, its gross domestic product would be larger than half the nations on Earth.\n\nceo Albert Bourla recently boasted that opportunities created by Pfizer’s experimental mrna covid-19 vaccine “have fundamentally changed our company forever.”\n\nProject Veritas journalists got one Pfizer scientist to candidly admit on hidden camera, “I still feel like I work for an evil corporation because it comes down to profits in the end. … Basically, our organization is run on covid money now.”\n\nLast year, Moderna sold $18 billion in covid-19 vaccines, AstraZeneca sold $4 billion, and Johnson & Johnson sold $2.4 billion. That means the big four vaccine manufacturers are receiving more than $100,000 off covid-19 every minute.\n\nRivers of taxpayer dollars have poured into these companies as Big Government has signed lucrative contracts with Big Pharma. covid-19 vaccines have created at least nine new billionaires and an untold number of new millionaires.\n\nLittle wonder that this clique of pharmaceutical representatives and government bureaucrats—with the aid of media moguls and tech giants—are silencing concerns over government and private mandates that have forced millions of people to use their vaccines. They do not want people questioning the efficacy and safety of their products. They are conspiring to “cast down truth to the ground” to amass wealth and power. You need to recognize this collusion and understand the spirit that empowers it.\n\nAmerica’s system of government has safeguards to limit the power of big businesses and protect everyday Americans. The fundamental safeguard is government representatives being elected from the people, by the people. Today, however, these representatives are influenced by and often literally paid by Wall Street lobbyists, Silicon Valley oligarchs and pharmaceutical companies.\n\nLong before the average person ever heard the word coronavirus, pharmaceutical executives were perhaps the strongest special-interest influence on American lawmakers. The National Institutes of Health website acknowledges that health and pharmaceutical companies devote more than $300 million annually to political parties, committees and groups, petitioning state and federal bureaucrats and lawmakers, and paying into presidential campaigns. It calls these payments “contributions” and “lobbying,” but they are business investments.\n\nA stat News analysis found that 72 senators and 302 members of the House of Representatives cashed a check from a pharmaceutical representative before the 2020 election. Lobbyists have turned their trade into an art, but the basic idea behind corporations spending money on lawmakers is simple: If we give you the finances you need to achieve your political goals, you give us the policies we need to achieve our financial goals.\n\nThe ones who suffer are the everyday people. We pay the price, in taxation and in freedom, for elites who are motivated not by the truth but by money and power.\n\nAnother safeguard designed to restrict the pharmaceutical executives is the array of government health and safety agencies. But these agencies are controlled by former and future pharmaceutical executives.\n\nOpen Secrets profiled 958 people who have worked for both the government and the pharmaceutical industry. The senior director of Global Trade Policy at Pfizer was on the Senate Finance Committee, and the senior director of Federal Government Relations at Pfizer was on the Senate Budget Committee. The senior adviser to the Food and Drug Administration commissioner was the vice president for Public Policy at Monsanto, and the vice president of Governmental Relations at Sanofi Genzyme had worked for the Department of Health and Human Services. The list goes on and on.\n\nThis “revolving door” between businesses that are for profit and regulators that are supposed to be for the people is an existential threat to the American form of government, which relies on representatives and regulators doing what seems best for the people they represent. It is also a threat to Americans’ actual physical safety.\n\nAbout 65 percent of Americans have been fully vaccinated with multiple doses of Pfizer, Moderna or Johnson & Johnson products (the AstraZeneca vaccine is not authorized for use in the U.S.). But the remaining 35 percent represent a vast market and billions more in profits, so these companies are campaigning to get millions more Americans vaccinated, not just through advertising, but through influence on politicians who can mandate these profits.\n\nRather than holding back such a push, the government is an accessory to it.\n\nAnd they are not just doing this through advertising: Pfizer is leveraging its influence over politicians and bureaucrats. Bourla told cnbc he believes the fda will soon authorize his company’s mrna vaccine for toddlers and infants. Pfizer earns about $39 per double jab. Therefore, the 20 million children under age 5 in America represent an additional market worth almost $800 million at little extra cost.\n\nLuckily for Pfizer, Joe Biden’s new fda commissioner is Dr. Robert Califf, who has worked for Amgen, AstraZeneca, Corgentech, Bristol-Myers Squibb, Daiichi Sankyo, Eli Lily, GlaxoSmithKline, Janssen, Johnson & Johnson, Merck, Portola, Proventys, Regado, Roche and Sanofi. And importantly, he has millions invested in companies like Amgen, Bristol-Myers Squibb, Contessa, Cytokinetics and Gilead Sciences. Many of these companies do business with Pfizer; so if Pfizer makes money, Califf makes money.\n\nMany lawmakers were concerned about Califf’s conflict of interest, but they were overruled. This is just the way business is done in Washington, D.C. A 2016 study published in the BMJ medical trade journal found that most retiring fda officials go on to work for drug companies, often for the same ones whose lucrative drug approvals they oversaw. Scott Gottlieb, for example, was fda commissioner for two years, then joined Pfizer’s board of directors. He is now pushing his former fda colleagues to approve his company’s experimental mrna vaccine for toddlers.\n\nIs this why government is pushing covid-19 vaccinations so hard? fda executive Christopher Cole thinks so. A Project Veritas reporter secretly recorded a series of dinner conversations with Cole, and what he said was shocking.\n\n“It’ll be a recurring fountain of revenue,” Cole said. “If they can get every person required to get an annual vaccine, that is a recurring return of money. The drug companies, the food companies, the vaccine companies, they pay us hundreds of millions of dollars a year to hire and keep reviewers to approve their products.”\n\nCole’s comments comprise some of the most blunt talk by a government insider ever recorded. He admitted that the Biden administration wants to jab every American for covid each year so the drug companies can keep receiving multibillion-dollar profits and keep handing over a share to the government.\n\nAnother safeguard in America’s system is free and independent journalism. But even freedom of speech and of the press is now largely being regulated and controlled by the pharmaceutical industry.\n\nIn colonial times, nearly every town had its own newspaper—and a crosstown rival. French author Alexis de Tocqueville was surprised at “the enormous circulation of the daily press in the United States” in 1831 when there was “scarcely a hamlet which has not its own newspaper.” He wrote that what best explained this was “the utmost national freedom combined with local freedom of every kind.”\n\nBut this state of affairs has changed dramatically. In 1980, 90 percent of the news media was owned by 50 companies. By 2020, 90 percent of the news media was owned by only six. This level of centralization makes news a business easy for the government and megacorporations to dominate and manipulate, which is exactly what is happening. A 2009 study by Fairness and Accuracy in Reporting found that every major media outlet in the U.S. except for cbs shared at least one member of its board of directors with a major pharmaceutical company like Pfizer.\n\nFor example, former Thomson Reuters Foundation chairman James Smith is a top investor and board member for Pfizer. And Reuters has published more than 22,000 articles about Pfizer. How many of those are likely to relay negative facts about Pfizer?\n\nIf you are one of the millions of Americans who watch Good Morning America, Anderson Cooper 360°, cbs Health Watch, abc News Nightline or cnn Tonight, you have undoubtedly noticed the “Brought to You by Pfizer” infomercials. Pfizer spends roughly $1.8 billion on advertising (on top of the millions it spends lobbying politicians, lobbying fda bureaucrats and hiring former fda bureaucrats). According to Forbes, Pfizer spends twice as much on sales, general and administrative expenses than on research and development. Is it any wonder cable news pushes drugs that don’t work while blotting out all news deemed unfavorable to them? Focusing on the facts and the evidence alone would mean letting skeptical scientists speak, and that would slow the flow of money.\n\nAn investigative report published by the Children’s Health Defense Team found that pharmaceutical executives, media executives and much of the government are primarily controlled by two asset management firms: BlackRock and Vanguard. Along with State Street Global Advisors, these two firms are the largest institutional shareholders of both Pfizer and Johnson & Johnson. They are also among the top owners of media giants Comcast, Disney, News Corp and Time Warner.\n\nSo a big reason America no longer has an independent press is that the media is owned by the same oligarchs who control the pharmaceutical industry and, by extension, the fda. At least three former BlackRock executives have now been appointed by Joe Biden to government positions, including the National Economic Council director.\n\nFormer congressional aide Mike Lofgren has warned that a shadow government is taking over the nation. He writes in his 2016 book, The Deep State, that the visible U.S. representatives, judges, president and bureaucrats are only “the tip of an iceberg that is theoretically controllable via elections. The subsurface part of the iceberg operates on its own compass heading regardless of who is formally in power. … Washington is the most important node of the deep state, but it is not the only one. Invisible threads of money and ambition connect the town to other nodes.” Among those “invisible threads” that connect to Wall Street, Silicon Valley and other liberal power centers are those that helped pave Joe Biden’s path to the White House. Vaccine mandates are now exposing these financial, corporate and pharmaceutical nodes of power.\n\nWhile some scientists try to find the truth, even if that means warning Americans that mrna vaccines are dangerous, the political and corporate elites are using their influence to discredit and silence them, suppress the truth, and drug the nation for profit.\n\nAmerica’s original constitutional republic is already essentially overthrown by an authoritarian technocracy run by military leaders, intelligence agents, pharmaceutical executives, media moguls and unelected bureaucrats.\n\nHow is it possible that all these elites are colluding for the same evil purposes? Lust for profit and power explains much of it. But the degree to which they are in lockstep, the extent of the power they have seized, and the evils they have been willing to commit cannot be fully explained by profit, power, collusion or any conspiracy theory. You have to look into Bible prophecy to fully understand the inner workings of the cabal dedicated to fundamentally transforming America.\n\nOne end-time prophecy that reveals why America’s elites have cast truth to the ground is found in the book of Daniel: “Yea, he magnified himself even to the prince of the host, and by him the daily sacrifice was taken away, and the place of his sanctuary was cast down. And an host was given him against the daily sacrifice by reason of transgression, and it cast down the truth to the ground; and it practised, and prospered” (Daniel 8:11-12).\n\nAntiochus Epiphanes fulfilled this prophecy in 168 b.c. when he desecrated the temple in Jerusalem with an idol of Zeus fashioned in his own likeness. But Daniel recorded his book primarily for the end time (Daniel 12:4). This prophecy is being fulfilled in type in America today. Trumpet editor in chief Gerald Flurry explains in America Under Attack that the host referred to in Daniel 8 is an army of demons and evil men who help an end-time Antiochus destroy a nation.\n\nThe most anti-Bible president in American history, Barack Obama, fulfills the role of the political Antiochus. He is out of office, but not out of power. Controlling powerful allies including Joe Biden, he has been at work using deep state nodes of power in Washington, in mainstream media and in Big Pharma, to try to overthrow America as a constitutional republic. Some may think that statement sounds extreme, but look at how drastically America has changed since the beginning of the coronavirus crisis. Government-imposed lockdowns and the resulting economic problems are making it nearly impossible to operate a small business, but America’s political elites don’t care. They view the American people only as a resource they can exploit and abuse to make money while they go about undermining the U.S. Constitution and transforming the nation into something worse than a Communist dictatorship.\n\nThe host empowering Antiochus aims to destroy the U.S., its history, its Constitution and the biblical principles this form of government is based on. God is exposing the corruption so people have a chance to repent before a lawless spirit destroys America by replacing the rule of law with the rule of deception and brute force. The values that helped make America great are being cast to the ground, but Antiochus and his supporters can only do this by “reason of transgression.” The devil is exploiting America’s lawlessness and lack of faith. God will allow this to continue until people wake up and see how badly they need to repent toward God and His law!", "opengraph": {"url": "https://www.thetrumpet.com/25289-running-on-covid-money/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/10458-america-under-attack"], "authors": [], "publish_date": null}