{"result_id": "307037", "URL": "https://www.thetrumpet.com/23738-eu-creates-centralized-vaccine-passports", "timestamp": "2023-04-25 17:35:02 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/23738-eu-creates-centralized-vaccine-passports", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "EU Creates Centralized Vaccine Passports", "cleaned_text": "The European Commission officially introduced a new digital vaccine passport on March 17. The “green passports” are promoted as the solution to the covid-19 lockdown. “With this digital certificate, we want to help our member states responsibly and safely restore freedom of movement,” Commission President Ursula von der Leyen said in Brussels.\n\nThe planned certificates will serve as proof that a European Union citizen has been vaccinated, tested or recovered from covid-19.\n\nThe German Federal Ministry of Health confirmed that several companies, led by the United States firm ibm, will create the digital green passport. One of the German companies involved is the Cologne-based start-up Ubirch, which specializes in blockchain technology; it has developed a type of signature to prevent digital records from being forged.\n\nAll 27 EU countries are expected to recognize these certificates. European nations that do not participate could be bullied into accepting such measures or face isolation. Austrian Chancellor Sebastian Kurz stated clearly in late February that even if member states are unable to come to an agreement, “his country and others would push ahead with their plans.”\n\nEuronews wrote: “Greece has already issued digital vaccination certificates, becoming one of the first EU governments to do so.”\n\nSouth European countries were suffering economically even before covid-19; now, they’re desperate for anything that could bring in tourists.\n\nHowever, implementing these passports means establishing a new level of centralized European bureaucracy. And officials are already talking about using this bureaucracy for more than just the coronavirus.\n\nHayley Tsukayama, a legislative activist for the Electronic Frontier Foundation and former technology journalist at the Washington Post, warned: “There have been many technologies offered up as solutions in this pandemic that have not panned out. … Rushing into using these electronic passports without properly considering the equity, privacy and security risks is a mistake.”\n\nGerman Chancellor Angela Merkel said in a press conference on February 25 that the technical basis for such a digital certificate would be created within three months. EU Commission Vice President Margaritis Schinas told Frankfurter Allgemeine Zeitung it would be ready “by June 1.”\n\nAs Europe rushes through solutions, unelected European officials plan to use the proposed digital green passport for much more than just free travel. Die Welt reported that the law would cover all legal requirements to digitally integrate the European Union.\n\nEU member nations are being forced to give up more of their sovereignty in exchange for normalcy.\n\nThe last few months have shown the power governments can hold over individuals. Strict mandates have led to the closure of small businesses. Stringent measures have regulated whether individuals can leave their homes. Police have roamed and surveilled streets, enforcing strict quarantine and curfew laws. It has become plain throughout the pandemic that governments are willing to take on a more dictatorial role. This latest push for digital centralization based on blockchain technology is another step toward an overarching, centralized European state.\n\nIn “Coronavirus and the Holy Roman Empire,” Trumpet editor in chief Gerald Flurry wrote: “One of the most important effects of the global panic over covid-19 has been almost overlooked. Europe’s response to the pandemic is accelerating the fulfillment of one of the most crucial end-time prophecies of your Bible!”\n\nWe have been warning for 75 years about the eventual resurrection of the Holy Roman Empire—a union of 10 kings that will dominate Europe (Revelation 17:12-13). “The coronavirus is hastening the arrival of the prophesied European Holy Roman Empire,” Mr. Flurry continued. “The Bible says 10 kings will rise in Europe in this end time. These kings will form the Holy Roman Empire and be led by one overarching strongman. The coronavirus pandemic is helping usher in these 10 kings.”\n\nVaccine passports give Europe’s leaders yet another lever of control, bringing them one step closer to the fulfillment of this prophecy. For more detailed information on this specific prophecy, please read “Coronavirus and the Holy Roman Empire.”", "opengraph": {"url": "https://www.thetrumpet.com/23738-eu-creates-centralized-vaccine-passports", "site_name": "theTrumpet.com", "title": "EU Creates Centralized Vaccine Passports", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMDMvMjMvMjg3aTUyMDF0N18yMTAzMjNfVmFjY2luZV9HZXR0eUltYWdlc18xMjMxNzU4MzYyLmpwZyJdLFsicCIsInRodW1iIiwiMTAyNHgiXSxbInAiLCJlbmNvZGUiLCJqcGciLCItcXVhbGl0eSA4MCJdXQ/e572643b78e8590d/210323-Vaccine-GettyImages-1231758362.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.br.de/nachrichten/deutschland-welt/deutscher-impfpass-ibm-soll-digitalen-impfnachweise-entwickeln,SRAT1ok", "http://www.faz.net/aktuell/wirtschaft/digitec/ibm-entwickelt-mit-start-up-ubirch-den-digitalen-impfpass-17235494.html", "https://www.dw.com/en/eu-to-propose-green-pass-vaccine-certificate-this-month/a-56736273", "https://www.gesundheit.de/news/eu-impfpass", "https://www.euronews.com/2021/03/01/brussels-to-issue-draft-law-on-vaccine-passports-this-month-says-eu-chief-von-der-leyen", "https://www.eff.org/", "/22350-coronavirus-and-the-holy-roman-empire", "/22350-coronavirus-and-the-holy-roman-empire"], "authors": [], "publish_date": null}