{"result_id": "307035", "URL": "https://www.thetrumpet.com/26968-pfizer-director-vaccine-damages-womens-reproductive-health", "timestamp": "2023-04-25 17:35:01 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26968-pfizer-director-vaccine-damages-womens-reproductive-health", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Project Veritas released a new video on February 2 that showed Pfizer director of scientific and operational initiatives Dr. Jordon Trishton Walker admitting that for many women who take the vaccine “there is something irregular about their menstrual cycles.”\n\nWell, that’s why I don’t understand that. It’s weird. I hope we don’t find out that somehow this mrna lingers in the body, because it has to be affecting something hormonal to impact menstrual cycles. Yeah, or like the entire next generation is like [messed] up. Could you imagine the scandal? Oh … I would take Pfizer off my resume.\n\n —Jordon Trishton Walker\n\nJewish rabbis in New York learned about this in November 2021 and almost unilaterally forbade the administration of the vaccine.\n\nThis new video exposes the following:\n• Pfizer is and has been aware of these problems for a while. “[P]eople will have to investigate that down the line,” Walker said.\n• According to Walker, Pfizer believes the vaccine is damaging some part of the “hypothalamus, pituitary, gonadal axis” in order to be causing menstrual problems.\n• Pfizer is already moving on from 19 and wants to use m technology to develop gene-editing medicines.\n\nWalker made it clear that Pfizer is aware of just how big a scandal it has on its hands:\n\nI will say if it does come down the line there’s something wrong with the vaccine, then obviously people will criticize the big push because there was a lot of social pressure, government pressure, job pressure to get the vaccine. I had to get the vaccine otherwise I would have gotten fired. If something were to happen downstream and it was really bad, the scale of that scandal would be enormous.\n\nPfizer executives don’t care about people’s health. They care about money. That’s what we cover in our April 2022 Trumpet issue, “Running on COVID Money.” The mainstream media refuses to report on the piles of evidence that the vaccine is dangerous. But we do. To learn more, be sure to tune in to the Trumpet Daily with executive editor Stephen Flurry.", "opengraph": {"url": "https://www.thetrumpet.com/26968-pfizer-director-vaccine-damages-womens-reproductive-health", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/JamesOKeefeIII/status/1621277753063493637", "https://theheavenlycourt.com/", "https://www.thetrumpet.com/25289-running-on-covid-money", "https://www.thetrumpet.com/stephen-flurry"], "authors": [], "publish_date": null}