{"result_id": "307003", "URL": "https://www.thetrumpet.com/26288-new-york-judge-throws-out-vaccine-mandate", "timestamp": "2023-04-25 17:34:45 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26288-new-york-judge-throws-out-vaccine-mandate", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "New York Judge Throws Out Vaccine Mandate", "cleaned_text": "New York City fired over 1,750 workers for refusing to get the covid jab. Last night, Staten Island Supreme Court Justice Ralph Porzio unfired them. He ruled that the Oct. 20, 2021, vaccine mandate “violates the separation of powers doctrine” and that the workers must be reinstated and given back pay.\n\nThe ruling: “The vaccination mandate for city employees was not just about safety and public health; it was about compliance,” wrote Porzio.\n\nThis is exactly what we wrote during the vaccine push:\n\nBut the most salient common denominator in [these vaccine mandates] is that they involve people sacrificing individual freedom, and the government gaining more control over our lives. The pressure is increasing to ignore the risks and get the jab; for a growing number of people it is becoming compulsory if they want to keep their job …. The right to choose is being squeezed out. And once the government grabs that much power over people’s rights, including their health, you can be sure it won’t give it up!\n\nAs refreshing as it is to see a judge stand up for freedom, you can be sure that many of the pushes toward a more authoritarian government will not be rolled back. You can read more about this, and the vaccine, in Trumpet executive editor Stephen Flurry’s article “Gotten Your Jab Yet?”", "opengraph": {"url": "https://www.thetrumpet.com/26288-new-york-judge-throws-out-vaccine-mandate", "site_name": "theTrumpet.com", "title": "New York Judge Throws Out Vaccine Mandate", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMTAvMjYvMWtzYzl6emdqd18yMDIyMTAyNl9WYWNjaW5lX0dldHR5SW1hZ2VzXzEzNTYxNTM0MTEuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/8c58446b966286c0/20221026-Vaccine-GettyImages-1356153411.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/23961-gotten-your-jab-yet", "/23961-gotten-your-jab-yet"], "authors": [], "publish_date": null}