{"result_id": "307036", "URL": "https://www.thetrumpet.com/26320-british-deaths-mysteriously-spike/print", "timestamp": "2023-04-25 17:35:02 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26320-british-deaths-mysteriously-spike/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Weekly deaths in England and Wales are well above their five-year average, at roughly 1,608 excess deaths every seven days. Yet less than half of these deaths are due to covid-19. Data from the Office for National Statistics show that 18,394 Britons died from covid-19 in the past six months, while 21,195 Britons died from other conditions. Experts continue to argue over the reason behind this mysterious death spike.\n\nUnexplained deaths: Normally, mortality rates fall after a pandemic because so many elderly people die early. Yet excess deaths continue to remain high even as covid-19 deaths decline. According to the Telegraph, the British government has made a halfhearted attempt to find out why so many people are dying, but has only concluded that there is a worrying increase in deaths in people who have heart problems or diabetes.\n\nFailed experiment: covid-19 increased the risk of cardiovascular problems, and the pandemic could be partially responsible for the death spike. But Dr. Robert Malone has pointed to a similar rise in excess deaths in the United States as evidence that adverse reactions to mrna vaccines may be killing people.\n\nThe big pharmaceutical companies do not want to talk about this possibility, but the fact that nearly 54 million Britons received one or more mrna vaccinations is significant. Since myocarditis (inflammation of the heart) and pericarditis (irritation of the saclike tissue surrounding the heart) are side effects of the covid-19 vaccine, the government’s vaccine drive could end up being the largest failed experiment on human beings in history.\n\nThe Trumpet said: At the start of the pandemic, we wrote: “These measures will no doubt save lives that would have been cut short by this virus. But they are also coming at incalculable cost—to our economies, our livelihoods, our civil liberties and freedoms, our social cohesion, even mental and physical health. In many ways it appears the ramifications of the reaction to the coronavirus will dwarf and far outlive the virus itself.”\n\nThere is a critical spiritual reason for this. To understand it, read our article “The Cure Is Killing Us.”\n\nRead: “Mass Formation Psychosis” and “A Dangerous New Age of ‘Worshiping the Will’”", "opengraph": {"url": "https://www.thetrumpet.com/26320-british-deaths-mysteriously-spike/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.telegraph.co.uk/news/2022/10/29/disastrous-legacy-left-lockdown-non-covid-excess-deaths-overtake/", "https://www.thedesertreview.com/opinion/columnists/life-insurance-deaths-up-40---dr-robert-malone-s-chilling-analysis/article_d24bccac-6f38-11ec-912f-1f6d8fc5fac4.html", "/22173-the-cure-is-killing-us", "https://www.thetrumpet.com/25151-mass-formation-psychosis", "https://www.thetrumpet.com/22176-a-dangerous-new-age-of-worshiping-the-will"], "authors": [], "publish_date": null}