{"result_id": "307031", "URL": "https://www.thetrumpet.com/25315-german-company-warns-about-vaccine-side-effects", "timestamp": "2023-04-25 17:35:00 CEST+0200", "meta": {"description": "What we see in our world is not just the result of mismanagement; the whole foundation of our society is flawed.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25315-german-company-warns-about-vaccine-side-effects", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "German Company Warns About Vaccine Side Effects", "cleaned_text": "Most Germans (more than 60 million) have been vaccinated against covid-19, despite the mrna vaccines not yet receiving approval by the European Medicines Agency. Even more alarming is the analysis of health insurance company bkk, which came to the conclusion that the vaccines’ side effects are significantly more than officially noted by the Paul Ehrlich Institute. This data should be an “alarm signal,” says bkk-PRoVita member of the board of directors Andreas Schöfbeck. After Schöfbeck published his finding he lost his job. Germany’s Welt first reported on his analysis.\n\n“Last year, we, a health insurer with about 125,000 insured, received a noticeable number of claims for vaccination side effects. That caused us to wonder,” Schöfbeck explained. They searched the entire bkk data pool for comparable signals. Faz.net concluded: “The coronavirus pandemic has now been going on for two years. And we still don’t know exactly what the risks of vaccination are.”\n\nAccording to the report ordered by Schöfbeck, from the beginning of 2021 to the middle of the third quarter, 216,695 bkk-insured persons had been treated for adverse side effects caused by vaccines—the number excludes 7,665 cases of complications from other vaccines. The data is alarming when you consider it covers only 10.9 million insured people and only a period of 7½ months; the vaccination campaign has already been running for 14 months in Germany.\n\nThe Paul Ehrlich Institute (pei) recorded 244,576 adverse events from data collected since Dec. 31, 2021, based on 61.4 million vaccinated individuals. “Our analysis shows that we are dealing with a significant underreporting here,” Schöfbeck noted in a video call with Welt. His calculations alone indicate 400,000 doctor visits “extrapolated to the total population, this figure would be 3 million.”\n\nWhile the data doesn’t indicate how bad the side effects are, they were bad enough to justify a visit to the doctor. Critics, however, claim the lack of information about the severity of the side effects negates its relevance. Alarmingly, a study on how dangerous the vaccines are has not even been conducted.\n\n“It seems more than questionable that the side effect statistics of the pei faithfully reflect reality,” faz.net noted. “Many general practitioners openly admit on request that they often do not report possible side effects of the coronavirus vaccine because this takes 20 to 30 minutes per patient and they are not remunerated for this. In the heat of the (vaccination) battle, they also paid only limited attention to whether a health disorder could be related to the vaccination.”\n\nThe article noted the example of Katja Köhler, a general practitioner in Schmallenberg, who has, since April 2021, performed around 3,000 coronavirus vaccinations and registered about 260 side effects, but reported fewer than 60.\n\nThis is not just poor management; the whole foundation of our society is flawed.\n\nIn December 2021, Trumpet executive editor Stephen Flurry warned that today’s politicians “have no respect for God’s spiritual laws, and they have no respect for His physical laws either. Their theory is: The sufferer has a harmful coronavirus in his body, so we should add a harmful mrna molecule. One poison plus one more poison will equal no poison. Yet in many cases, the sufferer has died from the vaccine instead of the virus.” He further warned:\n\nJoe Biden said as recently as July, “You’re not going to get covid if you have these vaccinations.” Yet millions of vaccinated people are catching covid-19 anyway. What started as a “one and done” shot has become a two-jab, then three-jab, then four-jab decree. Government officials keep telling us to pump their experimental mrna vaccine into our bodies, booster shot after booster shot, until it works. It is amazing the lengths to which humans will go to “cure” themselves rather than submitting to the laws of the Creator of their bodies and minds!\n\n“But the origin of the grand human experiment traces back even further,” we explained in our recent Trumpet magazine, “back to the very first human beings. They were presented with a choice. They could choose to rely on God for information, for law, for correction, for protection, for safety, for healing, for blessings. Or they could choose to rely on their own minds and five senses to experiment. They could, as Mr. Armstrong enumerated, 1) reject revelation, 2) use observation, 3) use experimentation, and 4) use human reasoning. ‘And that is precisely the ‘scientific’ method used by modern science today!’ (The Missing Dimension in Sex). They chose the latter. We have been self-willed, ignorant and law-breaking ever since. ” The article concluded:\n\nSuffering the inevitable consequences, we seek solutions through self-will, ignoring God and breaking His laws further. God still characterizes our modern civilization as “Babylon”—and He exhorts us to come out of it (Revelation 18:4). That means thinking differently. That means recognizing that our human civilization is as foundationally unsound as that long-obliterated tower of Babel. Our experiment has produced an inescapable result, and we must stop trying to escape it. We do not and never have possessed the ability to solve our health problems or any other problems apart from God. That is a scientific fact. Recognize it, and you will see this dark and confusing world completely differently: for the first time, clearly.\n\nYou can read the whole article here: “You Are Living in an Experiment.” I also encourage you to read Mr. Flurry’s article “Would Jesus Jab?”", "opengraph": {"url": "https://www.thetrumpet.com/25315-german-company-warns-about-vaccine-side-effects", "site_name": "theTrumpet.com", "title": "German Company Warns About Vaccine Side Effects", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMDMvMDIvN3B4aWpxdXFjM18yMjAzMDJfdmFjY2luZV9pU3RvY2tfMTMwMzcxMzg0Mi5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/303c88768c04ba2f/220302-vaccine-iStock-1303713842.jpg.jpg", "description": "What we see in our world is not just the result of mismanagement; the whole foundation of our society is flawed.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.welt.de/politik/deutschland/plus236965309/Corona-Impfungen-Fragezeichen-beim-mRNA-Impfstoff.html?", "https://www.welt.de/politik/deutschland/article237236519/Nach-Aussagen-zu-Impfnebenwirkungen-Vorstand-der-BKK-ProVita-ist-fristlos-gekuendigt.html", "https://www.welt.de/politik/deutschland/article237236519/Nach-Aussagen-zu-Impfnebenwirkungen-Vorstand-der-BKK-ProVita-ist-fristlos-gekuendigt.html", "https://www.faz.net/aktuell/wissen/medizin-ernaehrung/corona-impfung-was-der-streit-um-die-daten-verraet-17840693.html?GEPC=s30", "https://www.thetrumpet.com/1302-the-missing-dimension-in-sex", "/25291-you-are-living-in-an-experiment", "/25026-would-jesus-jab"], "authors": [], "publish_date": null}