{"result_id": "307019", "URL": "https://www.thetrumpet.com/25848-25-million-report-coronavirus-vaccine-side-effects-in-germany", "timestamp": "2023-04-25 17:34:53 CEST+0200", "meta": {"description": "The end of a taboo?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25848-25-million-report-coronavirus-vaccine-side-effects-in-germany", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "2.5 Million Report Coronavirus Vaccine Side Effects in Germany", "cleaned_text": "Millions in Germany are suffering or have suffered from coronavirus vaccination side effects. According to the German National Association of Statutory Health Insurance Physicians, 2.5 million citizens went to the doctor in Germany last year because of side effects from the vaccine.\n\nMost Germans have been vaccinated against covid-19, following the advice of the medical industry, media and government. This is not surprising as critical voices have been silenced. This censorship has not only proved to be detrimental to the health of millions but also to the trust in anything the government and media promise.\n\nWhen the member of the board of directors of the health insurance company bkk-PRoVita Andreas Schöfbeck warned four months ago about an unusual increase in vaccine side effects, he lost his job. His analysis at the time differed from official reporting. But the data on which he based his warning now appears to be verified.\n\nGermany’s prestigious magazine Der Spiegel published an article on June 12 titled “Unexplained Symptoms After Coronavirus Vaccination—and Everyone Ducks Away.” It wrote: “They wanted to protect themselves and others; now some vaccinated apparently suffer from diffuse symptoms. Those affected feel abandoned by politicians. Among some doctors, the subject seems to be taboo” (Trumpet translation throughout).\n\nFor almost two years, people around the world have expressed concern about the safety of the vaccine. Millions felt forced to take it, pressured by the government, media and medical institutions. Sixty million people in Germany have taken the vaccine.\n\nThe suppression of this topic speaks to the corruption of the system.\n\n“‘It is a huge taboo subject in the medical profession, although many observe the side effects. Seasoned colleagues don’t want to have anything to do with the topic; it’s too hot for them,” Bernhard Schieffer, clinic director of Cardiology in Marburg. His university hospital is one of only two in Germany that accepts suspected cases of unexplained vaccine-related symptoms.\n\n“Hardly any doctor wants to play into the hands of the vaccination opponents,” wrote Spiegel.\n\nSchieffer added: “Everything to do with vaccination is emotionally heated. Negative reports about the coronavirus vaccination are, after all, not without legal problems.”\n\nA family doctor who contacted Spiegel admitted that there was often not enough time to report possible side effects and that it is difficult to prove that the occurring cases are a direct result of the vaccine. Schieffer noted: “It’s mostly young people who are pulled out of their daily lives; we see a majority of women. Whether their symptoms are actually from the vaccination, we don’t know.”\n\nOf course correlation does not always imply causation, but the sudden emergence of inexplicable cases points to the same culprit. “Nevertheless, the medical profession finds itself in an uncomfortable mixed situation: They have to implement the vaccination campaign promoted by the German government and convince as many of their patients as possible to receive the vaccination,” wrote Spiegel. “At the same time, they usually only see those who subsequently develop complaints weeks or months after the vaccination—it is hardly possible to establish a connection so late.”\n\nShortly after the article was published, German Health Minister Karl Lauterbach addressed the issue, saying the topic is relevant and needs to be researched more. But he quickly added that the benefits of vaccination outweigh the risks. In Spiegel’s case study, however, individuals now fear the vaccine more than the sickness.\n\nThe irresponsible actions of governments around the world have led to untold suffering. People have been censored, ridiculed and mocked. Citizens’ rights were taken away, and the government demanded absolute trust without offering any help when things went wrong.\n\n“Deliver the poor and needy: rid them out of the hand of the wicked. They know not, neither will they understand; they walk on in darkness: all the foundations of the earth are out of course” (Psalm 82:4-5). The foundations of our world are collapsing. Our whole world has been deceived (Revelation 12:9), including the fields of science and medicine. Starting with Adam and Eve’s rejection of God’s way of life, mankind has put its trust in false gods and false science. Request a free copy of The Plain Truth About Healing, by Herbert W. Armstrong, to understand how the scientific world got off track and what God’s solution is. Understanding the truth contained in this short booklet is more important today than ever.", "opengraph": {"url": "https://www.thetrumpet.com/25848-25-million-report-coronavirus-vaccine-side-effects-in-germany", "site_name": "theTrumpet.com", "title": "2.5 Million Report Coronavirus Vaccine Side Effects in Germany", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMDcvMDYvM2lrbDBhMmZkal8yMDIyMDcwNl9WYWNjaW5lX0dldHR5SW1hZ2VzXzEyNDA0ODIxNDMuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/f4688f2c0d2c8353/20220706-Vaccine-GettyImages-1240482143.jpg.jpg", "description": "The end of a taboo?", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.welt.de/politik/deutschland/article237236519/Nach-Aussagen-zu-Impfnebenwirkungen-Vorstand-der-BKK-ProVita-ist-fristlos-gekuendigt.html", "https://www.spiegel.de/gesundheit/post-vac-syndrom-unerklaerliche-symptome-nach-der-corona-impfung-und-alle-ducken-sich-weg-a-6b3ea94e-138f-4ed0-b459-d86377daf08b?sara_ecid=soci_upd_KsBF0AFjflf0DZCxpPYDCQgO1dEMph", "/25848-25-million-report-coronavirus-vaccine-side-effects-in-germany"], "authors": [], "publish_date": null}