{"result_id": "307015", "URL": "https://www.thetrumpet.com/26291-will-game-changing-vaccine-end-the-opioid-epidemic", "timestamp": "2023-04-25 17:34:51 CEST+0200", "meta": {"description": "The war on drugs has been an abject failure because leaders are far more eager to treat the symptoms rather than the root causes.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26291-will-game-changing-vaccine-end-the-opioid-epidemic", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Will 'Game-Changing' Vaccine End the Opioid Epidemic?", "cleaned_text": "The opioid epidemic has devastated America for more than a decade. Last year, more than 100,000 people died from overdoses. Around 200 people die every single day. Eighty percent of those who try to quit relapse. And at the heart of these grim numbers is the synthetic opioid fentanyl.\n\nBut a team of researchers from Houston think they have discovered the solution: a fentanyl vaccine.\n\n“Our vaccine is able to generate anti-fentanyl antibodies that bind to the consumed fentanyl and prevent it from entering the brain,” said lead researcher Dr. Colin Haile, “allowing it to be eliminated out of the body via the kidneys. Thus, the individual will not feel the euphoric effects and can ‘get back on the wagon’ to sobriety.”\n\nMany hope the discovery will limit the dangerous effects of fentanyl. Due to its high potency, it is the cutting agent of choice for drug dealers. Drugs such as cocaine, meth and Xanax are all being laced with fentanyl. It’s 50 times stronger than heroin, 100 times stronger than morphine. And just two milligrams of fentanyl are enough to cause an overdose. Even if the overdose doesn’t result in death, it can still result in permanent brain damage.\n\nThis vaccine might work to prevent this. The experiments held by the research team seem to point toward an effective treatment. But the creation of this vaccine represents a sad reality. America’s war on drugs has been an abject failure because leaders are far more eager to treat the symptoms rather than the root causes.\n\nUnder the Biden administration, the southern border leak has turned into a flood. Over 5 million people have entered the country illegally in the last two years. Data shows that only about 35 percent of those caught are actually expelled. And nearly a million illegal immigrants have been able to evade capture altogether.\n\nThese numbers matter. According to a report by the nonpartisan Congressional Budget Office, “Mexico is the primary source of illegally manufactured fentanyl.” Transnational criminal organizations like the Sinaloa and Jalisco New Generational cartels are central to smuggling fentanyl-laced drugs into the United States. Border patrol agents have seized 14,700 pounds of fentanyl just this year. That’s five times more than were seized in 2017. Yes, agents are becoming better at drug detection, but it is also indicative of how many more people are pouring across the border.\n\nIn April, for example, 201,800 people tried to enter the U.S. illegally; 55,773 were families; 12,221 were unaccompanied children. But the largest group by far was single adults, at 166,814. That amounts to 71 percent of people who tried entering the U.S.\n\nMany of the southern border entrants likely aren’t members of a drug cartel. But such members are far more likely to be found among the single adults than with families or children. And that is precisely how illegal opioids get into America.\n\nAnd that’s a problem a vaccine can’t solve. It’s like applying salve to a tumor. It might soothe the area of affliction for a time, but it won’t make the deadly problem go away. Especially with an administration that isn’t interested in upholding the rule of law.\n\nAnd this same administration isn’t willing to uphold the strongest cure to drug addiction: strong family values.\n\nMany drug users are thrill seekers looking for a high. One in 10 Americans have admitted to using illegal drugs on a monthly basis. But according to the U.S. Department of Health and Human Services, “Fatherless children are at a dramatically greater risk of drug and alcohol abuse.” Broken families are fertile homes for the escapism that drives most drug abuse. That’s something the fentanyl vaccine implicitly encourages.\n\nDr. Haile said one of the advantages of the vaccine is that it could protect people who accidentally or deliberately take drugs. He said a parent could force their child to get vaccinated to protect them in case they “experiment.”\n\nCultivating strong families would be a strong weapon against opioid use. Instead, traditional family is under attack. Divorce among millennials is at an all-time low simply because marriage is at an all-time low. The Respect for Marriage Act passed the Senate last week, so same-sex “marriage” is on the verge of being enshrined into law. Children are being raised more by activist teachers and social media more than by their parents.\n\nStrong borders neutralize dangerous drug cartels. Strong families nullify the need for escapism. Without these, many are pinning their hopes on a vaccine. Doing so means the best-case scenario would be an addiction to cocaine, meth or heroin—only without the potentially fatal danger of fentanyl. Meanwhile, criminals will still roam the streets, and families will continue to crumble.\n\n“For many years we have declared a war on drugs in America,” writes Trumpet editor in chief Gerald Flurry. “What has been the result? Look at the facts and we must concede that we have lost that war. America is overcome by its drug problem.”\n\nMany hope the fentanyl vaccine will bring freedom from addiction. Perhaps it will work once it goes to human trial. Maybe it will actually be able to stop the all-too-easy fentanyl overdose deaths. But until the root causes are addressed, until the law is upheld, there will never be freedom.\n\nMr. Flurry writes in his booklet No Freedom Without Law:\n\nStrong marriages build strong children. We need strong children who are not vulnerable to drugs. Why do children want to take drugs and destroy their minds? The mind is the only thing that really sets us apart from animals. What is lacking in their lives that would make them want to do that to themselves? Why even take a chance on something so destructive? Because their wills are so weakened, they must have something to fill the void their parents have left—in most cases. Of course, drugs don’t truly fill that void at all—they only bring people into slavery of the worst possible kind.\n\nThat is the sad reality. But there is real and lasting hope in God’s law. It protects children and our families. And it brings true freedom into our lives. “Live as free men, yet without using your freedom as a pretext for evil; but live as servants of God” (1 Peter 2:16; Revised Standard Version). That is what God wants for everyone.\n\n“We need to write God’s law on our hearts indelibly—to etch it on our hearts and minds so it will never go away! That will bring true freedom into our lives! We have been deceived to believe just the reverse—that God’s law somehow enslaves us,” Mr. Flurry writes. “That is false! Beware of men—no man can give you true freedom! Only God can do that. God’s law brings us the ultimate, most wonderful freedom of all.”\n\nPlease request your free copy of No Freedom Without Law to learn more.", "opengraph": {"url": "https://www.thetrumpet.com/26291-will-game-changing-vaccine-end-the-opioid-epidemic", "site_name": "theTrumpet.com", "title": "Will 'Game-Changing' Vaccine End the Opioid Epidemic?", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMTEvMjIvYWtyeTB4cWFlXzIwMjIxMTIyX0ZlbnRhbnlsX0dldHR5SW1hZ2VzXzk2ODUzOTcxMi5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/023f3a333542fcf5/20221122-Fentanyl-GettyImages-968539712.jpg.jpg", "description": "The war on drugs has been an abject failure because leaders are far more eager to treat the symptoms rather than the root causes.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thetrumpet.com/25609-us-reached-100000-overdose-deaths-in-2021", "https://www.thecentersquare.com/national/nearly-5-million-foreign-nationals-have-entered-the-u-s-illegally-since-biden-took-office/article_dfaa6376-1e25-11ed-b23d-77891ec8afbf.html", "https://thefederalist.com/2022/09/12/bidens-border-policy-is-taking-us-back-to-pre-9-11-homeland-security/", "https://www.cbo.gov/publication/58532", "https://www.washingtonexaminer.com/policy/defense-national-security/police-seizures-fentanyl-southern-border-reach-all-time-high-biden", "https://www.thetrumpet.com/17535-fentanyl-chinas-secret-weapon-to-destabilize-america", "https://www.thetrumpet.com/26428-republicans-and-democrats-join-forces-to-advance-same-sex-marriage-legislation", "https://www.thetrumpet.com/literature/books_and_booklets/272"], "authors": [], "publish_date": null}