{"result_id": "307040", "URL": "https://www.thetrumpet.com/24174-no-one-fears-germany", "timestamp": "2023-04-25 17:35:03 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24174-no-one-fears-germany", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "No One Fears Germany", "cleaned_text": "Many people consider Germany one of America’s closest allies. For this reason, Germany is often granted inside information that China seeks illegally. For example, with the coronavirus vaccine rollout, few people would trust China to produce a vaccine that is injected into millions of Americans. But the international community has trusted Germany.\n\nBill Gates noted that the recent vaccine distribution was made possible by two decades of work by a German scientist: “The first mrna vaccines, developed by Pfizer-BioNTech and Moderna in 2020, are the product of a variety of ideas and discoveries by German scientist Ingmar Hoerr, who spent 20 years conducting experiments with messenger rna.”\n\nPfizer and the German start-up company BioNTech forged an agreement in 2018 to jointly develop an mrna-based influenza vaccine. This research prepared them to produce one of the first covid-19 vaccines. Millions of Israeli, British and U.S. citizens have received the BioNTech-Pfizer vaccine under government emergency authorization, before long-term results of the vaccine could be tested.\n\nBioNTech is a small German start-up that has suddenly risen to global importance and received substantial funding from the U.S. But a giant in the pharmaceutical industry has also been heavily involved: Bayer AG.\n\nBayer is represented in all strategic business areas in the U.S. and Canada. It had 20,735 employees in North America in 2019 and generated sales of approximately $18.2 billion. Last year, Bayer helped fund additional testing centers, medical staff support and blood drives for covid-19 initiatives in the U.S.\n\nChina’s request to establish testing centers in many U.S. states was refused out of fear that it might use collected dna against the U.S. But no one feared Bayer’s generous offer. Yet it is Bayer that has the scientific understanding and the ability not only to produce bioweapons but to unleash them all over the U.S. Combine the knowledge BioNTech gathered with that of Bayer, and these foreign entities possess a staggering store of information that could be used against Americans.\n\nSince Bayer took over Monsanto, it is not only answerable for the health of millions of U.S. citizens; it is also entrusted with supplying their every meal.\n\nBut the medical and agricultural fields are not the only areas in which the U.S. has put its trust in Germany.\n\nThe German and American armies are cooperating in the field of cyberwarfare. According to an Aug. 4, 2020, report in the Bundeswehr’s Newsletter Verteidigung, “At the end of 2019, Germany and the U.S.A. agreed to intensify their cooperation in the areas of cyber and [information technology]. In the first half of 2020, a bilateral agreement, Cyber-IT Engagement Framework (citef), was signed between the two states at ministerial level ….”\n\nOne main task of the U.S.-German cooperation will be “improving interoperability and building trust,” the newsletter stated.\n\nAmerica trusts Germany profoundly. On May 8, 2020, German Brig. Gen. Jared Sembritzki became the fourth multinational chief of staff for the United States Army–Europe. The tradition of appointing German generals to this position started in July 2014 with Brig. Gen. Markus Laubenthal, who was “practically the right hand of the commanding general of the U.S. land forces in Europe, Lt. Gen. Donald Campbell Jr,” according to the German edition of the Wall Street Journal. U.S. Army–Europe, at the time, was responsible for over 37,000 troops, 90 percent of which are stationed in Germany.\n\nClearly Germany’s geopolitical goals differ from America’s. Nevertheless, the U.S. trusts Germany more than ever. Winston Churchill warned of Germany’s deceit—and his warnings were proved accurate when World War ii erupted. His warning has largely been forgotten today, and an even greater disaster looms.\n\nAs we saw in May, a cyberattack can shut down America’s gas flow or its financial system (article, page 14). It could also critically damage America’s food production and distribution infrastructure. Germany does not have the world’s largest military, but its advances in the agrochemical and medical fields and its insight into America’s cyber defense provide clues as to the leverage it possesses over the U.S. Once the giant is on its knees, all that the German-led European superpower would need to do is send an army large enough to finish the job. This army is also in the making (read “Forging a Superpower” in the April 2019 Trumpet). All these elements are combining to create a perfect storm, revealing the danger of trusting a foreign nation.", "opengraph": {"url": "https://www.thetrumpet.com/24174-no-one-fears-germany", "site_name": "theTrumpet.com", "title": "No One Fears Germany", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMDYvMTcvN3R4YzlwbnQyZl8yMTA1MTdfQnVuZGVzdGFnX2lTdG9ja184OTIzNTQ5MTYuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/1e238e57ef65dfd3/210517-Bundestag-iStock-892354916.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/18695-forging-a-superpower"], "authors": [], "publish_date": null}