{"result_id": "307016", "URL": "https://www.thetrumpet.com/25196-project-veritas-reveals-vaccine-moneymaking-agenda/print", "timestamp": "2023-04-25 17:34:52 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25196-project-veritas-reveals-vaccine-moneymaking-agenda/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "As the Canadian government invokes martial law to crush protests against vaccine mandates, the United States government is preparing to make these oppressive mandates a permanent feature of American life. An undercover reporter working for Project Veritas secretly recorded a series of dinner conversations she had with United States Food and Drug Administration employee Christopher Cole while posing as his date for the evening. What Cole told this reporter is shocking.\n\n“Biden wants to inoculate as many people as possible,” said Cole. “So you’ll have to get an annual shot. I mean, it hasn’t been formally announced yet ’cause they don’t want to, like, rile everyone up. … But yeah, you’ll have to get an annual.”\n\nThis statement is great news for the pharmaceutical industry if Cole is correct. Pfizer made $37 billion in covid-19 vaccine sales last year and expects to make another $54 billion this year. Thanks to the covid-19 outbreak, this company’s revenue has doubled. An annual covid-19 shot would keep covid money pouring into Pfizer and other vaccine manufacturers for the foreseeable future. This point is not lost on Cole and his colleagues at the Food and Drug Administration.\n\nAfter telling his date about a fda plan to vaccinate toddlers, he admitted that cooperation between the government and the pharmaceutical industry is financially motivated. “The drug companies, the food companies, the vaccine companies, they pay us hundreds of millions of dollars a year to hire and keep the reviewers to approve their products. There are almost a billion dollars a year going into fda’s budget from the people we regulate. … If they can get every person required at an annual vaccine, that is a recurring return of money going into their company.”\n\nDuring a follow-up with Project Veritas founder James O’Keefe, Cole said he was tricked during a “hack job” investigation and that his comments were taken out of context. Yet O’Keefe is still demanding that the fda answer the grave allegation that its officials are approving unsafe vaccines so their pharmaceutical allies can make billions of dollars.\n\nChristopher Cole’s comments to his faux-date comprise some of the bluntest talk by a government insider ever recorded, but the details about the close ties between the Food and Drug Administration and the pharmaceutical industry are well known.\n\nA 2016 study in the BMJ medical trade journal found that most retiring fda officials go on to work for private drug companies, often for the same ones whose lucrative drug approvals they oversaw. Former fda commissioner Scott Gottlieb, for example, led the fda for two years, joined Pfizer’s board of directors, and is now pushing his former colleagues to approve his company’s vaccine for toddlers.\n\nIn too many cases, Food and Drug Administration officials are tempted to approve dangerous drugs for use on humans because they know they will soon be making a huge salary working for the companies making these drugs. This level of corruption is reminiscent of a transformation that occurred in ancient Israel during the reign of Jeroboam ii. As Israel expanded its borders and took control of the trade routes connecting Assyria and Egypt, a new class of powerful elites grew rich trading in olive oil, wine and war horses. But these elites used their wealth to exploit their own people, and the gap between the rich and the poor grew larger (Amos 6:1-7). The Prophet Amos condemned these elites, saying they “swallow up the needy, even to make the poor of the land to fail” (Amos 8:4-7).\n\nToday, this same attitude is in America, especially among the oligarchical class pressuring people to inject themselves with an experimental mrna molecule that provides minimal protection against covid-19 just so they can make money. These oligarchs put far away the evil day and refuse to mourn for the affliction of their nation, yet God prophesies that they shall go into captivity first when America is conquered by a foreign enemy. Americans must repent of the sins that brought the nation to the point where a cabal of establishment politicians, “deep state” bureaucrats and medical executrices could take over and start making decisions that empowered themselves and oppressed everyone else.\n\nTo learn more about how the book of Amos gives us a clear indication of where America is in the time frame of Bible prophecy, please read The Lion Has Roared, by Trumpet editor in chief Gerald Flurry.", "opengraph": {"url": "https://www.thetrumpet.com/25196-project-veritas-reveals-vaccine-moneymaking-agenda/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thetrumpet.com/literature/books_and_booklets/611"], "authors": [], "publish_date": null}