{"result_id": "307028", "URL": "https://www.thetrumpet.com/24851-the-disturbing-link-between-abortion-and-covid-vaccines", "timestamp": "2023-04-25 17:34:58 CEST+0200", "meta": {"description": "Vaccines are created with the help of infanticide.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24851-the-disturbing-link-between-abortion-and-covid-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "The Disturbing Link Between Abortion and COVID Vaccines", "cleaned_text": "Two individuals made the covid vaccine possible: They are called hek-293 and per.C6. These are the names for two real human beings. At least, those are the only names we know them by now. Why is that? Because both of these babies were aborted and never given real names. In fact, hek-293 and per.C6 are the names of perhaps hundreds of babies that were aborted, dissected, and used for medical research.\n\nHere is their story. (It contains some pretty graphic descriptions of what happened to these aborted babies. Continue reading at your own discretion.)\n\nAll covid vaccines required the use of fetal cell lines in the development of the vaccine or were used to test the efficacy of the vaccine. The facts of how they acquire and use the cells are gruesome, disturbing, and heart wrenching, but it is the truth.\n\nhek-293 and per.C6 refer to the specific cell lines scientists have created using cells harvested from aborted fetuses. Both cell lines were created from tissue gathered by Dr. Alex van der Eb in the Netherlands.\n\nper.C6 was used to develop the Johnson & Johnson vaccine. This cell line was created from human embryonic retina cells from an 18-week-old fetus aborted in 1985. Dr. van der Eb said in 2001: “So, I isolated retina from a fetus, from a healthy fetus as far as could be seen, of 18 weeks old. … The mother was completely normal. … There was nothing wrong with the mother. She had at least two children afterward in the same hospital in Leiden, which were completely healthy. The father was not known, not to the hospital anymore; what was written down [was there was an] unknown father, and that was, in fact, the reason why the abortion was requested.”\n\nAn 18-week-fetus is about the size of a cucumber, with its own unique fingerprints and capable of hearing sounds outside the womb, including the parents voice. per.C6 was dissected and the cell lines are now used for gene therapy.\n\nhek-293 is probably the most important cell line produced and most widely used by the medical field. The reason for this is because Canadian doctor Frank Graham was able to figure out a way to modify the cells so it has an infinite number of divisions, ensuring doctors will always be able to use it for research. hek-293 was used to test the Moderna and Pfizer vaccines.\n\nhek refers to “human embryonic kidney.” Cells are gathered from kidney tissue from the aborted baby. The number “293” refers to the amount of experimental attempts the researchers need to create a working cell line. It took 293 attempts to make a cell line from aborted kidney tissue—that means it took hundreds of kidneys, from hundreds of aborted babies, in order to create that one cell line.\n\nThe final abortion that enabled the creation of hek-293 was performed in 1970s in the Netherlands. The website Live Action reported:\n\nDr. Alvin Wong, wrote: “In examining the issue further, it appears that in all probability the cells were obtained from the embryo of a willfully induced abortion.”\n\nHowever, the most disturbing fact is how they harvested the kidneys. Kidney tissue must be harvested from the infant while the baby is still alive. Only late-term abortions can be used to harvest kidneys, in order to ensure the organs are fully developed. The infant is removed using a caesarean or by induced labor. Drugs cannot be used during the procedures as that would damage the kidney samples.\n\nIn a story by Fox News, the University of Pittsburgh stated that blood is still flowing from the heart to the kidney while the organ is being removed from the infant. “The documents uncovered by Judicial Watch also show [the University of Pittsburgh] discussing its effort to minimize warm ischemic time, or the amount of time an organ maintains its body temperature after blood flow has been severed,” Fox News wrote.\n\nThe University of Pittsburgh vice-chancellor stated, “Ischemia time refers to the time after the tissue collection procedure and before cooling for storage and transport.” The Center for Medical Progress explained: “Ischemia starts when the organ … is cut off from blood circulation. The Nation Institutes of Health defines ischemia as “lack of blood supply to a part of the body.”\n\nSo, the University of Pittsburgh admitted that the fetal organs do not undergo ischemia—lose their blood supply—until “after the tissue collection procedure.” This means the organs are still receiving blood supply from the fetal heartbeat during the “tissue collection.”\n\nThe documents obtained by Judicial Watch exposed that $2.7 million in federal tax money is being funneled to the university over the past five years for its GenitoUrinary Development Molecular Anatomy Project (gudmap). The Fox News report states: “It was also supported by grants from the National Institute of Allergy and Infectious Diseases (niaid), which is led by top coronavirus adviser Dr. Anthony Fauci.”\n\nThe university has been obtaining samples from aborted babies from six weeks old to 42 weeks old. The University of Pittsburgh stated that it has been “collecting fetal tissue for over 10 years … includ[ing] liver, heart, gonads, legs, brain, genitourinary tissues including kidneys, ureters and bladders.” A 2020 study published by the University of Pittsburgh revealed it was taking scalps from five-month-old fetuses and implanting them onto rats to study immune system responses. The report features photos of the human hair growing on the rats.\n\nper.C6 and hek-293 are just two examples of fetal lines used for vaccines and research. You can view a full list of which vaccines use cell lines here.\n\nThe fetal research industry is a worldwide juggernaut of profit for the medical world. Pfizer and Moderna make $65,000 profit per minute. Worldwide there are 87 abortions per minute, or 40-50 million per year. In the United States alone, there are two per minute. Twenty-two percent of all pregnancies in the United States end in abortion. How many of these are dissected and used for fetal research?\n\nBrenda Bardsley, vice president of the Anatomic Gift Foundation, told Insight in 1999 that 75% of women agree to donate the fetal tissue to research. Those outdated statistics from 1999 would indicate that around 731,250 aborted babies are used for medical research every year in the United States.\n\nIn the United States, it is illegal to sell fetal body parts. But the medical field has created a workaround. Kelly Patricia O’Meara wrote for Insight in 1999: “[T]he harvesters receive the fetal material as a ‘donation’ from the abortion clinic. In return, the clinic is paid a ‘site fee’ for rental of lab space where technicians, employed by the harvesters, perform as many dissections as necessary to fill researcher manifests. The harvesters then ‘donate’ the body parts to the researchers and, rather than pay the harvesters for the actual body parts, ‘donate’ the cost of the retrieval (a service) via a formal price list.”\n\nFox News reported a project funded by the federal government that created a “pull down menu” of baby body parts so they could be ordered and sent to doctors. The Guttmacher Institute wrote: “The National Institutes of Health has been supporting research using fetal tissue since the 1950s, and in … 2014, nih provided roughly $76 million for this work. According to an analysis of nih research grants published in Nature, nih funded 164 projects using fetal tissue in 2014, most often for research on infectious diseases, eye function and disease, and developmental biology.”\n\nThe Insight article from 1999 stated that one particular organization charged $280 per specimen of fetal tissue. Some organizations charged $150 for a liver, $500 for a trunk (with or without limbs) and $325 for a spinal cord. A Seattle Times story indicates these prices have relatively stayed the same.\n\nThis is all on top of the reports of China harvesting organs from Uyghurs and other minority groups for profit on the black market. A healthy liver costs $160,000.\n\nThis is a brief summation of the heart of darkness inside the medical industry and behind the covid vaccines. What does God and the Bible think of abortion and dissecting babies?\n\nReferring to Micah 3:1-3, Trumpet editor in chief Gerald Flurry wrote in the March 2021: “[God’s] evaluation of our justice system here is likely the grisliest metaphor in the Bible! Could America’s courts really be this bad? Consider the legacy of America’s courts. … It was the Supreme Court that legalized abortion in 1973. … The Supreme Court has invented a constitutional right to have an abortion and will strike down any law that violates this ‘right.’ Today, on average, a baby in America is aborted every 36 seconds. That’s nearly a million babies a year being ripped apart or poisoned. This is what America does to the most vulnerable members of society! … Is God extreme to say that courts ‘break their bones, and chop them in pieces’?”\n\nThe covid vaccines are a product of abortion and dissecting infants for research. They would not exist without fetal cell lines. God is wrathful at our nations for allowing such evil to take place. To learn more about what the Bible teaches on abortion please read our reprint article “Is Abortion Really Murder?”", "opengraph": {"url": "https://www.thetrumpet.com/24851-the-disturbing-link-between-abortion-and-covid-vaccines", "site_name": "theTrumpet.com", "title": "The Disturbing Link Between Abortion and COVID Vaccines", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMTEvMjQvYTRvNTYwZzEyXzIxMTEyNF9GZXR1c19pU3RvY2tfMTE2Njg3NTkxNi5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/fde35a7333d862cb/211124-Fetus-iStock-1166875916.jpg.jpg", "description": "Vaccines are created with the help of infanticide.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.health.nd.gov/sites/www/files/documents/COVID%20Vaccine%20Page/COVID-19_Vaccine_Fetal_Cell_Handout.pdf", "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "https://www.webmd.com/baby/interactive-pregnancy-tool-fetal-development?week=18", "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "https://www.foxnews.com/politics/pittsburgh-fetal-tissue-project", "https://www.judicialwatch.org/documents/hhs-cmp-responsive-records-july-2021-pg-170/", "https://www.centerformedicalprogress.org/2021/08/breaking-university-of-pittsburgh-admits-hearts-beating-while-harvesting-aborted-infants-kidneys/", "https://www.cancer.gov/publications/dictionaries/cancer-terms/def/ischemia", "https://www.nature.com/articles/s41598-020-71548-z#Sec7", "https://www.lifenews.com/2020/12/18/scientists-attach-scalps-of-aborted-babies-to-humanized-mice-for-dubious-research/", "https://lozierinstitute.org/update-covid-19-vaccine-candidates-and-abortion-derived-cell-lines/", "https://nairametrics.com/2021/11/16/pfizer-biontech-and-moderna-make-65000-per-minute-pva/", "https://www.worldometers.info/abortions/", "https://www.nrlc.org/archive/Baby_Parts/omeara.html", "https://www.nrlc.org/archive/Baby_Parts/omeara.html", "https://www.guttmacher.org/gpr/2016/fetal-tissue-research-weapon-and-casualty-war-against-abortion", "https://www.nrlc.org/archive/Baby_Parts/omeara.html", "https://www.seattletimes.com/nation-world/who-buys-sells-and-uses-fetal-tissue-acquired-from-abortion-clinics/", "https://www.theepochtimes.com/mkt_breakingnews/borderline-criminal-the-medias-failure-to-report-on-chinas-forced-organ-harvesting_4077644.html?utm_source=share-btn-copylink&st=zhP_nU_Pv8Ex3VXOwL-RiJh6BoWV79Z0fyuDLjluYHd9pd9cG8rCPIKEipJ1tfSfykuNW7v6UkMrRU3TkmjjTgtwzbFDlwvlKDo", "https://www.thetrumpet.com/literature/reprint_article/1957"], "authors": [], "publish_date": null}