{"result_id": "307033", "URL": "https://www.thetrumpet.com/24685-project-veritas-exposes-pfizer", "timestamp": "2023-04-25 17:35:01 CEST+0200", "meta": {"description": "Vaccines have been a financial windfall for big pharma. So never mind natural immunity—just get the jab.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24685-project-veritas-exposes-pfizer", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Project Veritas Exposes Pfizer", "cleaned_text": "Natural immunity to covid-19 is better than a vaccine, the vaccine companies know it, they are pushing for vaccine mandates, and they are doing it for the profits. That’s the revelation from another set of secretly recorded videos by Project Veritas.\n\nProject Veritas is a conservative group that sends undercover reporters to deceive individuals into speaking openly and divulging information about controversial issues while they are secretly being recorded.\n\nThe new videos show employees working for biopharmaceutical giant Pfizer admitting that natural antibodies are much more effective at blocking covid-19 than the vaccines made by Pfizer, Johnson & Johnson and Moderna. This scientific fact has been characterized as a fringe conspiracy theory by the regime of Joe Biden and its mainstream media proxies.\n\n“When somebody is naturally immune—like they got covid—they probably have more antibodies against the virus,” Nick Karl, a scientist who worked on the Pfizer vaccine, said in a covertly recorded interview released on October 4. “When you actually get the virus, you’re going to start producing antibodies against multiple pieces of the virus. … So your antibodies are probably better at that point than the [covid] vaccination.”\n\nChris Croce, a Pfizer senior associate scientist, stated that natural immunity offers more protection than a covid-19 vaccination. This means that Pfizer’s own researchers know that there is no good reason for anyone who has already had covid-19 to get the jab. But they are deliberately hiding this information for financial reasons. “I still feel like I work for an evil corporation because it comes down to profits in the end,” Croce admitted. “Basically, our organization is run on covid money now.”\n\nPfizer made $42 billion in revenue last year. This year, it is anticipating $26 billion in covid-19 vaccine sales alone. This is why Pfizer is highly motivated to squash any discussion of natural immunity, even among its employees.\n\n“There’s ears and eyes everywhere … at Pfizer, like, in the building,” Croce said. “So it’s kind of just, like, you don’t talk about anything that can implicate you or ‘big pharma.’ Even if you shut the door to the office, it’s kind of like, who’s listening?”\n\nPfizer scientist Rahul Khandke told Project Veritas that Pfizer actually demands that its employees conceal information from the public. “We’re bred and taught to be like, ‘vaccine is safer than actually getting covid,’” he said. “Honestly, we had to do so many seminars on this. You have no idea. Like, we have to sit there for hours and hours and listen to like—be like, ‘you cannot talk about this in public.’”\n\nA lot of people are getting rich from covid-19 vaccines, and they don’t want people telling the truth and messing it up! How’s that for following the science?\n\nModerna, another vaccine manufacturer, had a revenue of $4.4 billion for the three months ending June 30, compared to $67 million for that same period in 2020. That means that the plandemic has increased its profits 65-fold. Moderna cofounders Noubar Afeyan and Robert Langer are on Forbes’ list of the 400 richest Americans because of their vaccine sales. Do you think these people care about a 37-year-old mother who died from blood clots after getting the jab? No, they want to make billions and billions of dollars forcing everyone on Earth to buy their vaccines!\n\nThe covid-19 shots at your local Walmart may be free to you, but they are not free. Governments around the world are forking over billions of taxpayer dollars to big pharma. Global spending on covid-19 vaccines is projected to reach $157 billion by 2025, according to a report by iqvia Holdings Inc. This spending is driving up inflation. So, you pay for your Walmart booster shot in the Walmart produce aisle, while the money you slash from your budget makes its way into Pfizer, Moderna and Johnson & Johnson accounts.\n\nAnalysts have found that the world’s 2,365 billionaires enjoyed a $4 trillion boost to their wealth during the first year of the plandemic, while 150 million slipped down the economic ladder from the middle class to the lower class. Society is being fundamentally transformed, as Barack Obama promised back in 2008.\n\nLike our ancestors in the Bible, America is being fatally weakened not by bullets and bombs but by sin.\n\nAnciently, during the time of the Israelite King Jeroboam ii, the Prophet Amos condemned greedy leaders who prioritized selfish interests and enriched themselves while afflicting the people of Israel (Amos 6:1-6). These people “put far away the evil day”—acting as if their lavish lifestyles would last forever and ignoring threats to the nation. God warned that the Assyrians would invade and that these people would be the first to be taken captive!\n\nIf you are interested in obeying the Creator of human health, instead of corporate executives peddling misinformation for profit, request a free copy of The Plain Truth About Healing, by Herbert W. Armstrong. It explains the scriptures proving that God wants to heal us, and how to claim God’s promise to heal!", "opengraph": {"url": "https://www.thetrumpet.com/24685-project-veritas-exposes-pfizer", "site_name": "theTrumpet.com", "title": "Project Veritas Exposes Pfizer", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMTAvMTIvZmJ5YXJmemZpXzIxMTAxMl9QZml6ZXJfaVN0b2NrXzEyODcwNDU2MjIuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/526582363ec888b8/211012-Pfizer-iStock-1287045622.jpg.jpg", "description": "Vaccines have been a financial windfall for big pharma. So never mind natural immunity—just get the jab.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thetrumpet.com/1293-the-plain-truth-about-healing"], "authors": [], "publish_date": null}