{"result_id": "307022", "URL": "https://www.thetrumpet.com/24735-germany-pressures-the-unvaccinated", "timestamp": "2023-04-25 17:34:55 CEST+0200", "meta": {"description": "Refusing the jab makes you an enemy of the state.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24735-germany-pressures-the-unvaccinated", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Germany Pressures the Unvaccinated", "cleaned_text": "After expressing concerns about the covid-19 vaccine on October 23, Joshua Kimmich, one of the best and most popular German national soccer players, sparked a nationwide debate. Kimmich said that he had “a few concerns” because of a lack of long-term studies for the vaccine. He also said, “[It is] very possible that I will be vaccinated in the future.” Kimmich is not against the vaccine, science or even the government’s measures in general. At the beginning of the pandemic, Kimmich and teammate Leon Goretzka started an initiative called “We Kick Corona,” raising millions of dollars for charitable causes.\n\nNevertheless, columnists and government officials are taking advantage of every opportunity to wage a public war against the unvaccinated.\n\nThe media has used passive means to urge the unvaccinated to get the jab. Faz.net, for example, asked on October 25, “Are Unvaccinated People Pushing Hospitals to the Breaking Point?” “The incidence is rising, and there are more and more coronavirus patients in intensive care units,” the article noted. “Experts fear that patients without vaccination protection will overwhelm the health-care system in the winter. How bad will the pandemic of the unvaccinated be?” But for many, such passive pressure is not enough.\n\nIn “Government Still Hopes for Kimmich’s Coronavirus Vaccination,” Der Spiegel wrote: “Now even the German government has commented on the issue. All questions about the vaccinations are of course justified, said government spokesman Steffen Seibert. However, there are ‘clear and convincing answers’ from national and international experts on aspects such as the type and effect of the vaccines or possible consequences of vaccination. He therefore hopes ‘that Joshua Kimmich will let all this information sink in again and then perhaps also decide in favor of vaccination,’ Seibert said. ‘Because as someone who millions look to, he would then all the more have a role model effect.’”\n\nYet Kimmich is not alone in his concerns about vaccines. Bild.de wrote: “With this, Kimmich said what millions of Germans think and feel. Because more than 30 percent of the population is still not vaccinated. The reasons: In a study by the University of Hamburg, 74 percent of the unvaccinated said they were not completely convinced of the vaccine’s safety. Sixty-seven percent said they felt under pressure.” Despite this, the official government stance is that vaccinations are the only way out of the pandemic. Unvaccinated people are now required to pay for a covid test if they want to go to a restaurant or movie theater. In many places, unvaccinated citizens are completely locked out of libraries, cultural venues and restaurants, even if they have tested negative.\n\nIt appears that refusing the vaccination is akin to being an enemy of the state. One of the few supporters Kimmich had was Germany’s far-right party, the Alternative für Deutschland. Kimmich became “a symbolic figure by vaccination opponents or politicians and agitators, even though he probably does not carry their ideas,” Spiegel noted.\n\nAs Trumpet executive editor Stephen Flurry explained in his feature “Gotten Your Jab Yet?” the side effects of the vaccine are concerning. But the alliance between the so-called experts, the media and the government to push the same narrative and to persecute dissenting voices is perhaps even more concerning.\n\nIn “The Tyranny of ‘Science’ Falsely So Called,” Mr. Flurry noted: “There is no evidence that covid-19 is substantially more contagious or deadly than a normal flu, which infects some 9 to 45 million Americans each year. There is no evidence that wearing a paper or cloth mask stops the spread of a 20-nanometer coronavirus particle. But scientists, flanked by leftist politicians and progressive media, pushed these drastic, catastrophic interventions with stunning self-assurance, quashing any dissenting concerns about the broader consequences.”\n\nWe have entered a new stage of propaganda warfare that pushes a narrative that you seemingly can’t escape. Truth has become irrelevant. Trumpet editor in chief Gerald Flurry wrote in “A Dangerous New Age of ‘Worshiping the Will’”: “When human beings reject God’s truth, they start worshiping their own opinions. They start thinking like Satan. When this type of thinking becomes entrenched enough, people stop even caring about the difference between true and false. They start trying to magically ‘create reality where no reality is.’”\n\nI encourage you to read “A Dangerous New Age of ‘Worshiping the Will’” to learn where our world is headed.", "opengraph": {"url": "https://www.thetrumpet.com/24735-germany-pressures-the-unvaccinated", "site_name": "theTrumpet.com", "title": "Germany Pressures the Unvaccinated", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMTAvMjYvNGczeWpyeWZ0c18yMTEwMjZfamFiX0dldHR5SW1hZ2VzXzEyMzA3Mjc4OTEuanBnIl0sWyJwIiwidGh1bWIiLCIxMDI0eCJdLFsicCIsImVuY29kZSIsImpwZyIsIi1xdWFsaXR5IDgwIl1d/87e1f5ae72f47787/211026-jab-GettyImages-1230727891.jpg.jpg", "description": "Refusing the jab makes you an enemy of the state.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.faz.net/aktuell/politik/inland/corona-winter-ueberfordern-ungeimpfte-bald-das-gesundheitssystem-17600420.html?premium", "https://www.spiegel.de/politik/deutschland/joshua-kimmich-regierung-hofft-noch-auf-corona-impfung-a-55b7ce04-c380-466f-bb7e-520ddcb7a53a", "https://www.spiegel.de/politik/deutschland/joshua-kimmich-regierung-hofft-noch-auf-corona-impfung-a-55b7ce04-c380-466f-bb7e-520ddcb7a53a", "/23961-gotten-your-jab-yet", "/24393-the-tyranny-of-science-falsely-so-called", "/22176-a-dangerous-new-age-of-worshiping-the-will", "/22176-a-dangerous-new-age-of-worshiping-the-will"], "authors": [], "publish_date": null}