{"result_id": "307030", "URL": "https://www.thetrumpet.com/27220-new-report-suggests-275000-americans-died-from-covid-19-vaccination-in-2021", "timestamp": "2023-04-25 17:34:59 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/27220-new-report-suggests-275000-americans-died-from-covid-19-vaccination-in-2021", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "A recent survey in the journal BMC Infectious Diseases estimates that the covid-19 vaccine killed somewhere between 217,330 and 332,608 Americans in its first year after rollout.\n\nProf. Mark Skidmore from Michigan State University surveyed 2,840 people in December 2021 and found that 22 percent of them knew one or more people who had been killed or injured by the shot. So assuming the people Professor Skidmore interviewed are representative of the United States population at large, the covid-19 vaccine may have killed 275,000 people and injured 33 million.\n\nDied suddenly: Besides death, Professor Skidmore’s survey found that commonly reported side effects from the covid-19 vaccine included cardiovascular issues, fatigue and blood clotting. Yet the most shocking thing about his survey was the number of people affected.\n\nAccording to the U.S Centers for Disease Control and Prevention, 463,000 Americans died from covid-19 in 2021. If Professor Skidmore’s numbers are anywhere near correct, half as many people died from the cure as died from the disease. And considering that 90 percent of those who died from covid-19 are over age 50, it is likely that the vaccine is more lethal to young and middle-aged people than the coronavirus itself.\n\nCover-up: Dr. Robert Malone, a chief architect of the mrna technology used in most covid-19 vaccines, has outright stated that it is starting to look like “the largest experiment on human beings in recorded history has failed.”\n\nGovernments around the world pressured 5.6 billion people into getting a covid-19 vaccine, and now it looks like 0.1 percent of them (nearly 6 million people) may die from the mrna sequence that was supposed to keep them alive. The big pharmaceutical companies that profited from the vaccine rollout are trying to cover up this scandal. Yet slowly but surely, it is coming to light anyway.\n\nFor more information on the prophetic significance of this cover-up, read our articles “‘Mass Formation Psychosis’” and “Media Blackout Hides Pfizer Corruption.”", "opengraph": {"url": "https://www.thetrumpet.com/27220-new-report-suggests-275000-americans-died-from-covid-19-vaccination-in-2021", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm#SexAndAge", "https://www.thedesertreview.com/opinion/columnists/life-insurance-deaths-up-40---dr-robert-malone-s-chilling-analysis/article_d24bccac-6f38-11ec-912f-1f6d8fc5fac4.html", "https://www.thetrumpet.com/25151-mass-formation-psychosis", "https://www.thetrumpet.com/27082-media-blackout-hides-pfizer-corruption"], "authors": [], "publish_date": null}