{"result_id": "307007", "URL": "https://www.thetrumpet.com/26960-medical-student-admits-medical-community-was-wrong-about-covid/print", "timestamp": "2023-04-25 17:34:46 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26960-medical-student-admits-medical-community-was-wrong-about-covid/print", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "On January 30, Newsweek published an article from seventh-year master’s M.D./Ph.D. student Kevin Bass in which he recanted his support for the medical community’s response to covid-19. “I was wrong,” he wrote. “We in the scientific community were wrong. And it cost lives.”\n\nI can see now that the scientific community from the [Centers for Disease Control and Prevention] to the [World Health Organization] to the [Food and Drug Administration] and their representatives repeatedly overstated the evidence and misled the public about its own views and policies, including on natural vs. artificial immunity, school closures and disease transmission, aerosol spread, mask mandates, and vaccine effectiveness and safety, especially among the young.\n\nWe created policy based on our preferences, then justified it using data. And then we portrayed those opposing our efforts as misguided, ignorant, selfish and evil.\n\nPandemic policy was created by a razor-thin sliver of American society who anointed themselves to preside over the working class—members of academia, government, medicine, journalism, tech and public health, who are highly educated and privileged.\n\nLearn more: The Trumpet has been warning about the dangers of the vaccine, lockdowns, mask mandates and other covid-19 responses since the beginning of the pandemic. Read our May-June 2020 feature, “The Cure Is Killing Us,” and “Truth About the Vaccine.”", "opengraph": {"url": "https://www.thetrumpet.com/26960-medical-student-admits-medical-community-was-wrong-about-covid/print", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/22173-the-cure-is-killing-us", "/23729-truth-about-the-vaccine"], "authors": [], "publish_date": null}