{"result_id": "307043", "URL": "https://www.thetrumpet.com/25114-canada-doubles-down-on-vaccine-pressure", "timestamp": "2023-04-25 17:35:05 CEST+0200", "meta": {"description": "Ironfisted medical tyranny, with a collapsing fake narrative", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/25114-canada-doubles-down-on-vaccine-pressure", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Canada Doubles Down on Vaccine Pressure", "cleaned_text": "There is increasing evidence from all over the world that what we have been told about covid-19 vaccines is not true. A study from Israel found that a fourth shot does not protect against omicron. Several studies show mrna boosters fail to block breakthrough cases of covid-19. Since vaccines do not stop transmission, vaccine mandates are not relevant or necessary. A Centers for Disease Control and Prevention study shows omicron is 91 percent less fatal than the delta variant. A South African study shows omicron is not even a threat for the unvaccinated.\n\nWhat is Canada’s response to this developing situation? Double down. Both the federal government and medical establishment are increasing authority, censorship and penalties against those who question their policies.\n\nOn January 7, Federal Health Minister Jean-Yves Duclos announced that provinces will probably soon announce mandatory vaccination. This implies that unvaccinated Canadians would face some sort of penalty. Only four days later, Quebec Premier François Legault announced that the province would begin taxing the unvaccinated with a “significant fee” that would be integrated on their income taxes. This “health tax” on the unvaccinated is for causing undue health burdens.\n\nThis proposed health tax would violate Section 7 of the Charter of Rights and Freedoms. It also violates the primary principle of the Canada Health Act, which states: “It is hereby declared that the primary objective of Canadian health-care policy is to protect, promote and restore the physical and mental well-being of residents of Canada and to facilitate reasonable access to health services without financial or other barriers” (emphasis added). Under the section on “Universality,” the act clearly states 100 percent of services must be provided to 100 percent of insured persons without differing conditions. As long as you have a health card, you can access health care. That is the basis of universal health care.\n\nNo matter the legality of such policies, they are intended as fear and coercion to increase vaccination numbers. However, these are all underpinned by the narrative that the unvaccinated are putting undue strain on the health-care system. Is that true?\n\nHere are the January 19 case numbers from a few provinces:\n\nTop medical officers in British Columbia and Ontario admitted that 50 percent of people tracked as going to hospitals with covid-19 checked in for another ailment and happened to test positive for the virus. That skewed data has been used to support draconian health measures.\n\nAdditionally, Canada’s health-care system is one of the most expensive and least effective in the world. “Canada currently comes fourth last in terms of intensive care beds available per capita (only Chile, Sweden and Colombia ranked lower),” the National Post reported. “Canada had just 1.97 icu beds for every 100,000 residents. The top-ranked country, Japan, had 7.74 beds per 100,000.” Thirty countries have more icu beds per capita than Canada, including the United States and nations without socialized medicine.\n\nThe Organization for Economic Cooperation and Development (oecd) found that before the coronavirus pandemic Canada had an acute-care bed occupancy of 91.6 percent, placing it in the bottom four in the world. “The latest numbers from the oecd show Canada with just one hospital bed for every 400 citizens, a ratio that put us in the bottom tier of oecd countries,” the National Post continued. For comparison, France had one for every 172 citizens, and Japan one for every 78.\n\nBefore the first case of covid-19 was reported in North America, the mayor of Brampton, Ontario, declared a “health-care emergency” because the hospitals were over 100 percent capacity. The National Post wrote: “In 2011, it only took an unusually busy night to send the Montreal-area Hôpital du Lakeshore into 232 percent capacity. A bad flu season in 2015 sent emergency rooms throughout Quebec City into capacity overages of more than 150 percent.”\n\nBefore the pandemic the oecd placed Canada in last place for wait times for a specialist appointment. A 2014 report showed 26 percent of Canadians had to wait at least four hours before getting into an emergency room. During the pandemic, Canada had the lowest number of hospitalizations per million people, but our health-care system was the most overwhelmed, performing far lower than American and British hospitals. Canada ranks second-to-last in the annual Commonwealth Fund report, only in front of the United States in the “health-care performance compared to spending” category. Health care continues to be a massive expenditure on federal budgets and taxes, but it remains one of the worst in the world.\n\nThe truth is intensive care units were busier before the pandemic than during. The Western Standard reported: “Adrian Dix, B.C. health minister, revealed the hospital beds were at a higher use before the pandemic began. Dix said B.C.’s hospital beds are currently at 95.1 percent capacity, but operated at 103.5 percent during the flu season before covid-19 began.” cbc News published an article in January 2020, just before the pandemic was declared, bemoaning the “hallway medicine” at most Ontario hospitals, writing:\n\nWhat is driving this recent capacity shortage? This is a phenomenon called Alternate Level of Care, when those in intensive care and hospital beds are stabilized and need to go to a long-term care home, but there are such drastic shortages they must stay in the hospital beds. This trend has continued in the pandemic. Yet the government didn’t lock down society when health care was strained before the pandemic.\n\nSince Canada’s health care was already overburdened in normal circumstances, is the current state of hospitals the fault of the unvaccinated, or is it revealing a massive government failure?\n\nThe federal government gave $150 million to Montreal company snc-Lavalin for emergency mobile hospital beds. The beds were built but are still sitting in a warehouse. Why didn’t the government use them to increase capacity instead of issuing lockdowns? The federal government also set aside $82 million to promote vaccines. According to Blacklock’s Reporter, no government documents, e-mails or memos exist to explain how it was spent.\n\nCanada’s top medical officer, Dr. Theresa Tam, issued a year-end report (which she authored in August 2021) that contained many statistics that were not made public or carried by the media. The report states: “Of the 15,300 people who died of covid-19 in 2020, 89 percent had at least one other health condition listed on their death certificate. … [T]he proportion of total covid-19-related deaths associated with [long-term care homes] dropped from 79 percent during the first wave to 50 percent during the second and third waves.” Most deaths were of individuals over 65 years old who had comorbidities and lived in long-term care homes. The report states only 1,600 Canadians under the age of 65 died from covid-19 between March 2020 and March 2021, while 7,150 died from effects of government lockdowns, mainly drug overdoses. Was the cost of government policies worth it?\n\nThe health bureaucracy, the federal courts and the mainstream media have begun an intensive censorship campaign against anyone who questions the vaccine policies. Global News did a special investigative report into a network of doctors in Canada attempting to inform Canadians of the potential side effects of vaccines and provide vaccine and mask exemptions. This report caused the Ontario health minister to announce that the College of Physicians and Surgeons would be investigating 40 doctors for spreading misinformation. Some of the allegations include prescribing ivermectin, warning of vaccine side effects such as blood clots and myocarditis, and issuing vaccine and mask exemptions.\n\nThe Canadian courts have also censored ordinary citizens for expressing any criticism of government policies. Blacklock’s Reporter revealed: “Brampton, Ontario, judge has issued a gag order forbidding a father from criticizing the federal vaccination program within earshot of his 10-year-old son. Anything that ‘calls into question the safety or efficacy of the covid-19 vaccine,’ is not allowed, ruled Ontario Superior Court.” In other cases, judges have removed visitation rights from parents because they were skeptical of government health measures and vaccines.\n\nOn Nov. 26, 2021, Bill C-3 was passed in Parliament, which created new criminal offenses that include “one that prohibits anyone from using fear to stop a health-care worker or those who assist them from performing their duties or who prevent a person from obtaining health services; the other would prohibit obstructing any person from accessing health facilities.” You could go to jail for 10 years if a judge determines you used fear to stop someone from obtaining a health service. But no law prohibits the government from using fear to motivate someone into getting a health service.\n\nIf the courts decide you cannot criticize vaccines or the government, is Canada truly a free country, or is it a Communist dictatorship?\n\nThe federal government has set aside millions to fund vaccine passports for the next three years. The Public Health Agency of Canada admitted to monitoring 33 million phones for geolocation data during the pandemic to track compliance. They plan to continue doing so until 2023. This is an indication that these measures are not going away anytime soon.\n\nAs many other nations begin to open up and remove restrictions, Canada is increasing its totalitarian measures. For years many Western governments have been in the clutches of corrupt, radical-left governments. However, there has been a recent groundswell against these regimes. Editor in chief Gerald Flurry wrote in the February 2022 Trumpet magazine:\n\nThis sudden change will center in the United States but could have ripple effects in other nations like Canada. As the tide turns against the radical left, expect these leaders to enact more totalitarian and extreme measures in a bid to retain power. You need to know where Bible prophecy is leading. To do so, please read the February 2022 Trumpet, “The Fall of the English-Speaking Peoples.”", "opengraph": {"url": "https://www.thetrumpet.com/25114-canada-doubles-down-on-vaccine-pressure", "site_name": "theTrumpet.com", "title": "Canada Doubles Down on Vaccine Pressure", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjIvMDEvMjAvM25jdGtsb3loel8yMjAxMjBfVmFjY2luYXRpb25fcmVxdWlyZWRfR2V0dHlJbWFnZXNfMTIzNjYxNTk3Ni5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/5b614a6b028fef87/220120-Vaccination%20required-GettyImages-1236615976.jpg.jpg", "description": "Ironfisted medical tyranny, with a collapsing fake narrative", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.timesofisrael.com/israeli-trial-worlds-first-finds-4th-dose-not-good-enough-against-omicron/", "https://www.bloombergquint.com/business/mrna-boosters-don-t-block-omicron-south-african-study-shows", "https://unherd.com/thepost/israeli-vaccine-chief-we-have-made-mistakes/", "https://nypost.com/2022/01/13/omicron-91-percent-less-likely-to-be-fatal-compared-to-delta-cdc-study/", "https://nypost.com/2022/01/14/omicron-less-severe-even-for-unvaccinated-south-african-study/", "https://westernstandardonline.com/2022/01/breaking-health-minister-says-provinces-could-make-covid-vaccines-mandatory/", "https://laws-lois.justice.gc.ca/eng/acts/c-6/page-1.html", "https://covid-19.ontario.ca/data", "https://www.alberta.ca/stats/covid-19-alberta-statistics.htm#vaccine-outcomes", "https://news.gov.bc.ca/releases/2022HLTH0016-000063", "https://nationalpost.com/news/canada/why-canadas-hospital-capacity-was-so-easily-overwhelmed-by-the-covid-pandemic", "https://data.oecd.org/healtheqt/hospital-beds.htm", "https://www.journaldemontreal.com/2011/12/09/les-urgences-debordent-a-232-", "https://www.cbc.ca/news/canada/toronto/ontario-hospital-hallway-medicine-healthcare-beyond-capacity-1.5420434", "https://www.blacklocks.ca/few-details-on-lavalin-deal/", "https://www.blacklocks.ca/82m-budget-item-a-mystery/", "https://globalnews.ca/news/8517353/canada-doctors-covid-vaccine-disinformation/", "https://globalnews.ca/news/8524589/ontario-physicians-investigation-covid-19/", "https://www.blacklocks.ca/court-issues-vax-gag-order/", "https://nationalpost.com/news/local-news/unvaccinated-quebec-mans-child-visitation-rights-temporarily-suspended/wcm/6c1ecaec-8d7b-44b6-936c-44dc60cc2719", "https://westernstandardonline.com/2021/12/edmonton-tory-mp-says-liberals-planning-to-keep-vaccine-mandates-for-three-years/", "https://toronto.ctvnews.ca/video?clipId=2134450&jwsource=cl", "https://westernstandardonline.com/2021/12/edmonton-tory-mp-says-liberals-planning-to-keep-vaccine-mandates-for-three-years/", "https://nationalpost.com/news/politics/public-health-agencys-data-tracking-of-canadians-spurs-calls-for-new-laws", "https://www.thetrumpet.com/24983-barack-obama-exposed", "https://www.thetrumpet.com/trumpet_issues/242"], "authors": [], "publish_date": null}