{"result_id": "307023", "URL": "https://www.thetrumpet.com/26031-the-fauci-effect", "timestamp": "2023-04-25 17:34:55 CEST+0200", "meta": {"description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/26031-the-fauci-effect", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "cleaned_text": "Dr. Anthony Fauci announced today he is resigning in December, right before the Republicans are expected to take control of the House of Representatives and investigate Fauci’s funding of the Wuhan lab.\n\nFact-checkers at Reuters proudly corrected social media reports about a COVID-19 study of Thailand teenagers, explaining that only 1 in 6 vaccinated teens developed irregular heartbeats, instead of 1 in 3. Is this supposed to reassure vaccine skeptics? In an interview with Mark Steyn, UK cardiologist Dr. Aseem Malhotra exposed Pfizer and Moderna’s original vaccine trials, which showed that vaccinated people were more likely to have a serious reaction to the vaccine than they were to be hospitalized because of COVID. Democrat megadonor Steve Kirsch exposed the problem of vaccine injuries and deaths on air during an interview with Fox News, but the Pfizer-funded news organization quickly brushed aside his truth bomb.\n\nThe Cure Is Worse Than the Disease (11 minutes)\n\nThe Telegraph reported last week that “around 1,000 more people than usual are currently dying each week from conditions other than the virus,” but this is totally unrelated to vaccine injuries, we’re supposed to believe. The UK is also facing a “silent health crisis linked to the pandemic response rather than to the virus itself,” including a rise in mental health issues. The Trumpet magazine predicted all of this back in the May-June 2020 issue with an article titled “The Cure Is Killing Us.”\n\nStelter, Cheney and Hope for the Free World (10 minutes)\n\nBrian Stelter and Liz Cheney both think they are needed to save the free world from Donald Trump. During his last show, an emotional Stelter said America needs CNN and shows like his Reliable Sources (now canceled) in order to keep the nation strong. In an ABC interview, Cheney declared she would fight against Republican “election deniers” who, according to her, are not fit to hold office—and that she is even willing to support Democrats to prevent these “election deniers” from being elected.\n\nAnti-Trump Republicans would prefer radical Democrats win midterm elections over Republicans who support Donald Trump’s America first agenda. As Conservative Treehouse author Mark Bradman (also known as Sundance) correctly showed in an article today, staying neutral in battle actually helps the enemy. The attack on America from within fully exposes two opposing sides: President Barack Obama and his fellows versus the very few who are willing to stand up and fight for the truth.", "opengraph": {"url": "https://www.thetrumpet.com/stephen-flurry/26031-the-fauci-effect", "site_name": "theTrumpet.com", "title": "World News, Economics and Analysis Based on Bible Prophecy", "image": "https://www.thetrumpet.com/trumpet-icon.png", "description": "theTrumpet.com delivers in-depth news analysis on top stories, world news, weather, economics and society in the light of Bible prophecy.", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}