{"result_id": "307021", "URL": "https://www.thetrumpet.com/24843-europes-persecution-of-the-unvaccinated", "timestamp": "2023-04-25 17:34:54 CEST+0200", "meta": {"description": "What else will Europeans be forced to do?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24843-europes-persecution-of-the-unvaccinated", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Europe’s Persecution of the Unvaccinated", "cleaned_text": "The coronavirus crisis is escalating in Europe—not because of increased cases but because of government-mandated measures. On November 19, Austria announced its goal of becoming the first European country to make vaccines mandatory. Starting on February 1, every adult must be vaccinated unless they can prove medical exemptions. Germany announced a lockdown for the “unvaccinated” on November 18, something the Czech Republic did the day before. The measures and the rhetoric are signs of an unprecedented war on a minority of citizens.\n\nAlong with the vaccine mandate, Austrian Chancellor Alexander Schallenberg (who is holding the position while Sebastian Kurz works through corruption charges) announced the nation’s third nationwide lockdown for at least 10 days, starting on November 22. The new measures are said to come as a consequences of citizens’ unwillingness to get vaccinated, despite prior harsh lockdowns.\n\nThe Austrian government will share more details on how it plans to persecute the unvaccinated, but for now, the nation is an indication of where the rest of Europe may be headed.\n\nThe German federal and state governments agreed on November 18 to enforce a lockdown for the unvaccinated when a certain number of hospitalizations are reached (three people hospitalized with covid-19 per 100,000 inhabitants). Politico noted: “In areas that breach this limit, access to public spaces, such as sporting and cultural venues or restaurants, will be limited to people who are vaccinated against covid, or have previously had the coronavirus and have recovered. Twelve states are currently above that threshold.” Those in the workforce will need to be tested regularly if they don’t have the vaccine or proof of a recent recovery. The tests, however, will be free again.\n\n“Many of the measures we are announcing would not be necessary if more people were vaccinated,” Chancellor Angela Merkel said at a news conference (Trumpet translation throughout).\n\nThe lockdown for the unvaccinated is in full swing. But for many, the measures are not going far enough. Merkel and her party, the Christian Democratic Union, criticized the new measures for not giving the states enough power to break the wave of infections. They agreed to the measures only because they can be reevaluated and possibly tightened in three weeks.\n\nOther politicians also voiced extreme frustration with those who don’t comply with the measures. Social Democrat politician Michael Müller defended the nationwide 2G rule, which says people need to be either vaccinated or recovered from covid-19 to take part in everyday activities. He accused those not vaccinated as acting selfishly and indifferently. He said they must now accept being “excluded from public life.”\n\nThe new measures are said to come in response to a dramatic situation in the hospitals. “If 10 is the apocalypse, we’re at nine,” said Bavarian State Premier Markus Söder in an interview about the coronavirus situation in Bavaria. But the capacity of intensive care units has declined over recent years and even during the pandemic.\n\nIn 2018, Germany had 27,500 intensive care beds. On Aug. 3, 2020, there were as many as 30,202 beds. But currently there are only 24,796. The official explanation for the decline is that some of the beds are now reserved for emergency situations. Lack of enough personnel is another consideration, the authorities state, claiming that the listed number are the ones that are “operational.”\n\nOn November 17, the Local reported: “In total, around 21,344 of the 24,796 intensive care beds in Germany are currently occupied.” This sounds alarming, but the problem is not a dramatic increase in coronavirus patients. The problem is far more complex.\n\nThe proportion of vaccinated coronavirus patients in intensive care units is increasing. Statistics in Bavaria show that more and more covid deaths are from the fully vaccinated. According to data from the State Office for Health, 30 percent of all covid-19 deaths in Bavaria in October were from those who were fully vaccinated.\n\nGermany and Austria claim that their goal is to get a higher vaccination rate to prevent future lockdowns. But countries with high vaccination rates prove this logic to be flawed. Ireland has a 93 percent vaccination rate; yet it is introducing more restrictions and is heading toward another nationwide lockdown. Gibraltar, called the “most vaccinated” place in the world, canceled all its Christmas celebrations due to rising cases.\n\nScientists agree that the vaccinated can also spread covid-19. Why then persecute the unvaccinated? As more and more vaccine side effects are published, the effort to silence doctors who sound the alarm is intensifying. Welt reported: “Again and again, individual doctors express skepticism about the safety of vaccinations against covid-19. But then suddenly they are silent or row back again—out of fear, as they say.”\n\nEven German Vice Chancellor Olaf Scholz admitted that the 50 million vaccinated Germans “were all guinea pigs for those who have waited until now. That’s why I say as one of these 50 million—it went well! Please take part.” Take part of being a guinea pig to learn what the long-term consequences of the vaccine may be.\n\nWhat happened to the free choice that every European is supposed to have? How can millions be forced into taking a vaccine that they clearly don’t want? Early on in the so-called pandemic, Trumpet editor in chief Gerald Flurry warned: “European leaders are increasingly behaving like dictators and assuming dictatorial power. The people of Europe are being conditioned to accept more tyrannical leadership.”\n\nEven opposition leaders notice this trend. “From this day Austria is a dictatorship,” said Herbert Kickl of the far-right Freedom party in light of Austria’s vaccine mandate.\n\nMr. Flurry explained why it is crucial for us to watch the developments in Europe. He wrote:\n\nIf you haven’t already, read Mr. Flurry’s article from the July 2020 Trumpet magazine, and sign up for a free subscription to our monthly print issue to stay abreast of all the important developments—even before they happen.", "opengraph": {"url": "https://www.thetrumpet.com/24843-europes-persecution-of-the-unvaccinated", "site_name": "theTrumpet.com", "title": "Europe’s Persecution of the Unvaccinated", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMTEvMjIvMjNkdTY2dTIxc18yMTExMjJfYXVzdHJpYV9HZXR0eUltYWdlc18xMjM2NjYyMDU2LmpwZyJdLFsicCIsInRodW1iIiwiMTAyNHgiXSxbInAiLCJlbmNvZGUiLCJqcGciLCItcXVhbGl0eSA4MCJdXQ/9b2ed2381db5712d/211122-austria-GettyImages-1236662056.jpg.jpg", "description": "What else will Europeans be forced to do?", "type": "website"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/RTcmH3pY66E?rel=0&amp;showinfo=1&amp;autohide=1&amp;autoplay=0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/RTcmH3pY66E?rel=0&showinfo=1&autohide=1&autoplay=0"}], "links": ["http://www.destatis.de/EN/Press/2020/10/PE20_N064_231.html", "https://www.nordbayern.de/politik/intensivbetten-abgebaut-warum-das-gerucht-nicht-stimmt-1.10990784", "https://www.thelocal.de/20211116/covid-surge-the-german-districts-running-out-of-intensive-care-beds/", "https://www.intensivregister.de/#/faq/18af7107-e098-43e7-a9f6-723b167559ba"], "authors": [], "publish_date": null}