{"result_id": "307009", "URL": "https://www.thetrumpet.com/24770-covid-scandinavia-and-the-end-of-the-world", "timestamp": "2023-04-25 17:34:47 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/24770-covid-scandinavia-and-the-end-of-the-world", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "COVID, Scandinavia and the End of the World", "cleaned_text": "“The world would be more secure and more prosperous if we just had more partners like our Nordic partners.” Then United States President Barack Obama made this statement in May 2016, during a visit from the leaders of Norway, Sweden, Finland, Denmark and Iceland to the White House.\n\n“Why don’t we just put all these small countries in charge for a while?” joked Obama.\n\nAmerica’s ex-president isn’t the only Democrat whose heart beats faster when thinking about Scandinavia. Recall the 2016 Democratic Convention and the endless soliloquies championing the “Scandinavia model.” For months, Bernie Sanders extolled countries like Sweden as the gold standard for democratic socialism. Many radical Democrats admit that their plan for America, as Alexandria Ocasio-Cortez put it, “closely resembles what we see … in Norway, in Finland, in Sweden.”\n\nFor Democrats seeking to fundamentally transform America, Scandinavia is the poster child when it comes to virtually all the big and important parts of being a successful nation: education, welfare, health care, democratic socialism, international relations, the environment. Many Democrats want to follow Sweden’s example in all these areas.\n\nBut when it comes to the way Sweden has handled covid-19, they are totally silent. Why?\n\nIn September, right around the time Joe Biden and Anthony Fauci were mandating masks and vaccines and threatening Americans with more lockdowns, Denmark, Sweden and Norway all announced that they were eliminating the handful of covid restrictions still in place. Today, life is entirely back to normal in these nations—there are no muzzles, no curfews, no travel or work restrictions, no store closures, no social distancing.\n\nWhat effect did this return to normalcy have on the virus? If you live in America, Britain, Canada, Australia or a whole host of other nations, you wouldn’t know because the media and our politicians refuse to talk about it. When it comes to covid, Sweden doesn’t exist.\n\nThe data shows that covid-19 numbers continue to improve in all three nations. Of course, people continue to die from covid and the virus continues to spread. But both the death rate and the infection rate are no higher in these nations than they are in America, Britain and many other nations that imposed lockdowns.\n\nFrom the start of the pandemic, Sweden in particular was incredibly restrained in its approach. The country never entered full lockdown. Children under 16 didn’t miss a single day of school. There were no laws dictating how many people could meet inside homes or how far people were allowed to travel for exercise. For the most part, Sweden’s government issued guidance, not laws. For a short period, there were laws requiring some social distancing, a curfew and meeting sizes. Some businesses had to close for a short while.\n\nSweden’s light touch stood in stark contrast to the heavy-handed, dictatorial actions of Australia, Canada and, to a lesser degree, Britain and America. And how did it go for the Swedes?\n\nRight now, Sweden ranks 54th in the global ranking of covid-19 deaths per capita. That’s below a whole bunch of nations that imposed strict restrictions and lockdowns, including America (16), Italy (23), the United Kingdom (27), Spain (31), and France (35).\n\nRight now, there are more active cases of covid-19 in Australia (30,762) and Canada (25,264) than in Sweden (18,436).\n\nRight now, new coronavirus cases are more than 1,500 percent higher in Lithuania, which recently reinstituted mask mandates and imposed one of the world’s strictest vaccine pass regimes.\n\nI’m not arguing that Sweden handled the pandemic perfectly. But the numbers don’t lie: When it comes to covid-19, Sweden’s light touch, marginally invasive approach was, in the very least, as effective as the heavy-handed, deeply invasive approach taken by the likes of Australia, Canada, the UK, America and others. And compared to many, Sweden’s approach was demonstrably more successful.\n\nWhen we look at this, we should also consider the broader collateral damage caused by the heavy-handed approach to covid-19: the increase in deaths as a result of other causes (from diseases like cancer and others that weren’t diagnosed and treated due to lockdown); the debt racked up by federal governments; the shuttering of businesses; the damage to the labor force; the breakdown of supply chains; the rise in mental health issues, including suicide and depression. (Consider the impact of the lockdowns on our children’s education. How do you even put a figure on that?)\n\nIn 2020, the year of covid-19, Sweden’s economy shrank by only 2.8 percent. Meanwhile, Britain’s shrank by almost 10 percent. By July this year, Sweden’s economy had fully recovered and even surpassed its pre-pandemic level. The country came through the pandemic without taking on any covid-related debt.\n\nMeanwhile, Britain had to borrow an extra £299 billion (us$349.3 billion) from April 2020 to April 2021 (the largest amount it has borrowed since 1946) to pay for its covid measures. This week, Rishni Sunak, the man in charge of Britain’s budget, announced new tax increases required to pay the new debt. If everything goes as expected, Sunak thinks Britain’s economy will return to its pre-pandemic level by the end of this year. In America, the federal government has pumped more than $4 trillion into the U.S. economy in covid-related rescue packages, and it is expected to inject another $2 trillion more.\n\nIn Sweden, the numbers tell an incredible story! Be it the data on covid death or infection rates, the impact on the overall death rate, the impact on jobs and the economy, the impact on national debt, the impact on education, or the impact on the overall mental health and overall happiness—Sweden is doing better than most nations on Earth!\n\nWhy haven’t we heard anything from Anthony Fauci or cnn about this?\n\nHere’s another noteworthy snippet of news you probably haven’t heard: Sweden, Denmark, Norway and Finland all recently announced that they were indefinitely suspending giving the Moderna vaccine to young people. Health authorities in Sweden and Denmark announced that the vaccine would not be administrated to anyone younger than 30.\n\nApparently all four nations looked at the data, which shows a higher risk of myocarditis and pericarditis (inflammation of the heart and its outer lining) in young people, and effectively declared that the Moderna vaccine was unsafe for children.\n\nMeanwhile, here in America, the Biden administration, working in cahoots with big pharma, continues to ramrod its goal of demanding children receive the jab!\n\nThis isn’t to say the Scandinavians are not pro-vaccine. They are. In Sweden, the government actively encourages vaccination, and the vaccination rate is high (around 70 percent). But Sweden’s government isn’t imposing destructive, far-reaching vaccine mandates like America’s president, or threatening to banish the unvaccinated out of society like New Zealand’s prime minister, Jacinda Ardern.\n\nWhat is going on here?\n\nHow is it that when it comes to taxes, curricula and welfare, the leaders of Sweden and Denmark are considered to be innovative and brilliant, but when it comes to covid-19, these same leaders are dolts and ignoramuses? When it comes to health care and government, the Scandinavian model must be studied and followed. But when it comes to covid, Sweden is totally irrelevant. We don’t consider their example. We don’t examine their data.\n\nThe answer is simple: For radicals like Barack Obama, Joe Biden and Anthony Fauci—and all their cronies across the world, in the mainstream media, and figures like Canadian Prime Minister Justin Trudeau, New Zealand Prime Minister Jacinda Ardern and Victorian Premier Daniel Andrews—covid-19 isn’t a health crisis.\n\nDespite what they might tell us, these people don’t seriously consider coronavirus to be a national threat, a disease that stands to inflict catastrophic destruction—financially, demographically or in any other way—on our nations.\n\nThink on it: If this were their genuine interest, they would see that their solutions—their lockdowns and mandates, their muzzles, their vaccine passports, their mandatory vaccines for children—are inflicting much greater damage on our nations than the virus itself!\n\nIf these people had the interests of their people and nation in mind, they’d be encouraged by the data coming out of Sweden and they’d be moving quickly to follow Sweden’s example! Instead, they ignore Sweden. Why?\n\nFor Obama and his Marxist army, the man-made covid “plandemic” is an opportunity to pursue the goal of “fundamentally transforming America.”\n\nThey are using covid-19 as an excuse to systematically destroy virtually all of the fundamental pillars of Western democracy. They are destroying individual rights and freedom of choice; they are attacking the free-market, capitalist economy; they are expanding the powers of federal government and redefining the role of government in the lives of citizens; they are dividing our societies and communities, pitting neighbor against neighbor.\n\nTake an honest look at our nations: covid has brought us closer to colossal political upheaval, economic catastrophe and mass civil unrest and war!\n\nKnow this too: This didn’t happen accidentally. It was planned from the very beginning. And not by Obama and his friends. It has all been planned and executed, as Trumpet editor in chief Gerald Flurry has relentlessly explained, by Satan the devil! (Revelation 12:9).\n\nThe devil’s role in current world events is the essential message of Mr. Flurry’s booklet America Under Attack. “This is a spiritual force of tremendous evil and destructive power!” he writes. “Satan is a liar and a murderer. And he and his evil minions are confined to this Earth. What are they doing? We have to know. We must understand our enemy!”\n\nThe truth is, no human could plan something so brilliant and devastating as what we are now witnessing!\n\nIt’s not just the way covid-19 is being used to fundamentally transform nations like America, Britain, Canada, Australia and New Zealand; it’s the fact that it has been done so quietly, so surreptitiously, without most people even realizing what is happening!\n\nWho would have ever thought it? Here we are facing national collapse and global upheaval—just moments away from the end of the world as we know it—and most of humanity has no idea.\n\nThank God for Bible prophecy, for literature like America Under Attack, which explains this world and how we can escape it, and for Gerald Flurry.", "opengraph": {"url": "https://www.thetrumpet.com/24770-covid-scandinavia-and-the-end-of-the-world", "site_name": "theTrumpet.com", "title": "COVID, Scandinavia and the End of the World", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjEvMTAvMjgvM3kyc2xqbmprdF8yMTEwMjhfU3dlZGVuX2lTdG9ja18xMTU0NzgzMjE3LmpwZyJdLFsicCIsInRodW1iIiwiMTAyNHgiXSxbInAiLCJlbmNvZGUiLCJqcGciLCItcXVhbGl0eSA4MCJdXQ/0f18ac07c847765d/211028-Sweden-iStock-1154783217.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nydailynews.com/sdut-obama-to-welcome-nordic-leaders-to-the-white-house-2016may13-story.html", "https://www.worldometers.info/coronavirus/", "https://www.worldometers.info/coronavirus/", "https://www.reuters.com/article/sweden-gdp-idUSL8N2P53EZ", "https://www.reuters.com/business/healthcare-pharmaceuticals/sweden-pauses-use-moderna-covid-vaccine-cites-rare-side-effects-2021-10-06/", "https://twitter.com/OzraeliAvi/status/1452386787964252160", "/10458-america-under-attack", "/10458-america-under-attack"], "authors": [], "publish_date": null}