{"result_id": "307029", "URL": "https://www.thetrumpet.com/27115-forgotten-history-bioweapons-and-vaccines", "timestamp": "2023-04-25 17:34:59 CEST+0200", "meta": {"description": "See this and more on theTrumpet.com", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.thetrumpet.com/27115-forgotten-history-bioweapons-and-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.thetrumpet.com", "title": "Forgotten History: Bioweapons and Vaccines", "cleaned_text": "As first reported by the Wall Street Journal on February 26, the United States Energy Department concluded that the covid-19 pandemic came from a Wuhan lab leak, confirming that the virus was engineered. Whether or not this makes covid-19 a bioweapon depends on whether it was purposely or accidentally released.\n\nFew realize what a dangerous world the pandemic and the recent vaccine rollout have ushered in. History provides some insight.\n\nIndication is that gain-of-function research caused a pandemic. But even before the pandemic, vaccine companies researched coronavirus vaccines—allegedly to prepare for a scenario in which the virus was transmitted from an animal to a human. Even if all this research occurred with the best intentions, it shows its potential dangers. Over the past few years, vaccine companies have made billions and research has advanced greatly. Imagine what scientists could do with the additional knowledge. Imagine what a scientist working for an evil state actor could do.\n\nHistoric precedent: Could scientists be working on a virus to use as a bioweapon and also a vaccine to protect certain individuals against the virus? One should not dismiss this as unlikely. That’s exactly what Nazi scientists planned during World War ii and came very close to executing.\n\nWell-respected scientists like Dr. Eugen Haagen, Dr. Kurt Blome and surgeon Brig. Gen. Walter Schreiber worked on such plans under Adolf Hitler. If the Allies hadn’t prevailed, bioweapons could have killed millions of people—without harming the German population and soldiers.\n\nThese scientists had a key immoral advantage: human experiments. They could test not only their bioweapons but also their vaccines on prisoners.\n\nIn order to successfully unleash a biological weapon against an enemy force, the attacking army had to have already created its own vaccine against the deadly pathogen it intended to spread. This vaccine would act as the shield for its own soldiers and civilians; its biological weapon would act as the sword.\n\n —Annie Jacobsen, author of Operation Paperclip: The Secret Intelligence Program That Brought Nazi Scientists to America\n\nCould modern scientists employed by an evil state actor finish the work Nazi scientists started—or at least attempt to do so?\n\nProphecy says: Revelation 6 provides insight into the terrible suffering ahead. “And there went out another horse that was red: and power was given to him that sat thereon to take peace from the earth, and that they should kill one another: and there was given unto him a great sword” (verse 4).\n\n“Sword is the word used in the Bible for military equipment,” the late Herbert W Armstrong explained in a 1980 World Tomorrow television program. “This is ‘a great one.’ How about the hydrogen bomb; how about the nerve gas; how about the chemical warfare; how about all of the things that can absolutely annihilate human beings from this Earth?” (To learn more, request a free copy of The Four Horsemen of the Apocalypse.)\n\nThe Bible reveals that weapons of mass destruction are about to be employed—but no vaccine will be able to save mankind. As Jesus Christ noted in Matthew 24:21-22, He will have to intervene to stop man’s self-annihilation.", "opengraph": {"url": "https://www.thetrumpet.com/27115-forgotten-history-bioweapons-and-vaccines", "site_name": "theTrumpet.com", "title": "Forgotten History: Bioweapons and Vaccines", "image": "https://www.thetrumpet.com/files/W1siZiIsIjIwMjMvMDIvMjgvdXY3Mm9udHllXzIwMjMwMjI4X1ZhY2NpbmVfR2V0dHlJbWFnZXNfMTI5MTM3OTMzNC5qcGciXSxbInAiLCJ0aHVtYiIsIjEwMjR4Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/4e63263cd16337c1/20230228-Vaccine-GettyImages-1291379334.jpg.jpg", "description": "See this and more on theTrumpet.com", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ama-assn.org/delivering-care/public-health/how-decade-coronavirus-research-paved-way-covid-19-vaccines", "/1186-the-four-horsemen-of-the-apocalypse"], "authors": [], "publish_date": null}