{"result_id": "308030", "URL": "https://thetruthaboutcancer.com/pfizer-anti-smoking-drug-recalled/", "timestamp": "2023-04-25 17:35:53 CEST+0200", "meta": {"description": "Pfizer is expanding its recall of anti-smoking drug Chantix after testing found high levels of carcinogenic material in the pill.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/pfizer-anti-smoking-drug-recalled/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Pfizer Anti-Smoking Drug Recalled as Carcinogenic: Vaccines Still \"Safe and Effective\"", "cleaned_text": "Pfizer is expanding its recall of anti-smoking drug Chantix after testing found high levels of carcinogenic material in the pill. The leading prescription for smoking cessation, Chantix is prescribed to over half a million people each year and accounts for $1.1 BILLION in revenue for Pfizer each year.\n\nWhile commercial cigarettes are undoubtedly unhealthy, the market for pharmaceutical cessation products is enormous. So is the money spent on advertising. Pfizer spends over $200 million a year to promote the drug (which is over 400% more expensive than it was in 2008).\n\nAs it turns out, patients looking to improve their quality of life and reduce their cancer risk by quitting cigarettes may have been ingesting a potent carcinogen instead. The cancer-causing agent in question – nitrosamines – are part of a large group of genotoxic chemical carcinogens that can be found naturally in some dip and chewing tobacco products.\n\nUnfortunately, the issue of Pfizer making millions of dollars by selling unsafe drugs isn’t new. Pfizer has paid out BILLIONS in fines and settlements for promoting unsafe products, pushing off-label use on doctors, and lying about the safety or efficacy of their products.\n\nIn 2009, Pfizer (and its subsidiary Pharmacia & Upjohn Company) paid $2.3 BILLION to settle criminal and civil liabilities for illegal promotion of their pharmaceutical products. The amount included payment of more than $102 million in civil settlement to six whistleblowers of the company’s fraudulent practices.\n\nBextra, an anti-inflammatory drug that was withdrawn from the market in 2005 due to safety concerns, was marketed by the company for various off-label uses. The company also illegally promoted several other drugs, including antipsychotic drug Geodon, antibiotic Zyvox, and anti-epileptic drug Lyrica. Healthcare providers received payments for prescribing these drugs to patients for off-label use… literally bribing doctors to prescribe untested and unapproved drugs to patients.\n\nFalse claims were submitted to government healthcare programs, allowing them to bypass the insurance programs. Pfizer had to pay approximately $1 BILLION to Medicare, Medicaid, and other government insurance programs under the settlement.\n\nAnd those are just a few examples.\n\nIn 1993, anti-seizure drug gabapentin was widely prescribed for off-label uses such as treatment of pain and psychiatric conditions. Courts ruled that Pfizer utilized propaganda campaigns, paid for favorable research and coverage, and suppressed unfavorable research regarding the drug. Several regulatory bodies found the drug ineffective for the associated ailments, and Pfizer paid $430 million in one of the largest settlements to resolve criminal and civil health care liability charges.\n\nA “whistleblower suit” was filed in 2005 against Wyeth, which was acquired by Pfizer in 2009, alleging that the company illegally marketed sirolimus (Rapamune) for off-label uses, targeted specific doctors and medical facilities to increase sales of Rapamune, tried to get transplant patients to change from their transplant drugs to Rapamune, and specifically targeted African-Americans.\n\nAccording to the whistleblowers, Wyeth also provided doctors and hospitals that prescribed the drug with kickbacks such as grants, donations, and other money. In 2013, the company pleaded guilty to criminal mis-branding violations under the Federal Food, Drug, and Cosmetic Act. By August 2014, it had paid $491 million in civil and criminal penalties related to Rapamune.\n\nIn June 2010, health insurance network Blue Cross Blue Shield filed a lawsuit against Pfizer for allegedly illegally marketing drugs Bextra, Geodon, and Lyrica. Blue Cross alleged that Pfizer used kickbacks and wrongly persuaded doctors to prescribe the drugs. According to the lawsuit, Pfizer handed out ‘misleading’ materials on off-label uses, sent over 5,000 doctors on trips to the Caribbean or around the United States, and paid them $2,000 honoraria in return for listening to lectures about Bextra.\n\nAn internal marketing plan revealed that Pfizer intended to train physicians “to serve as public relations spokespeople.” The case was settled in 2014 for $325 million. Fearing that Pfizer was “too big to fail” (and that prosecuting the company would result in disruptions to Medicare and Medicaid), federal prosecutors instead charged a subsidiary of a subsidiary of a subsidiary of Pfizer, shielding them from virtually all financial responsibility.\n\nIn 2013, Pfizer agreed to a $964 million settlement for selling insulation laden with asbestos.\n\nThat same year, Pfizer withdrew “between $400,000 and a million dollars” worth of ads from Harper’s Magazine following an unflattering article on their depression medication.\n\nIn 1994, Pfizer agreed to pay $10.75 million to settle claims by the United States Department of Justice that the company lied to get approval for defective heart valves that killed roughly 500 people.\n\nIn 1996, an outbreak of measles, cholera, and bacterial meningitis occurred in Nigeria. Pfizer representatives and personnel set up a clinical trial and administered an experimental antibiotic, trovafloxacin, to approximately 200 children. Local officials reported that more than fifty children (over 25%) died in the experiment, while many others developed mental and physical deformities.\n\nWe could continue, but you probably see the pattern here. Pfizer doesn’t care if their products are safe. They’re willing to bribe doctors and silence the opposition to sell more products. They’re willing to KILL CHILDREN to make a buck.\n\nYou may be thinking “Pfizer has paid BILLIONS for their mistakes. Surely they’ve grown.” You should know that Pfizer is currently worth about $275 BILLION. And all of their bribes and suppression count as “business expenses.” A few billion to keep pushing unsafe drugs is a bargain.\n\nYou may also be thinking “What about the FDA? Isn’t the government regulating these companies?” And the answer is:\n\nBut for three years, the commissioner of the FDA was a man named Scott Gottlieb. After resigning his post, Gottlieb took on a new position – on the board of pharmaceutical giant Pfizer. The conflict of interest is repugnant… and not uncommon.\n\nCheck out this article to learn more about the revolving door of pharmaceutical oversight.\n\nThe bigger takeaway is that the pharmaceutical industry is corrupt and willing to lie, steal, and kill to make money. Guess which company has sold the most COVID-19 shots? PFIZER.\n\nIf you’ve heard conflicting information about the Pfizer jab’s safety, seen that conflicting information silenced, or have concerns that Pfizer may have inappropriate sway within regulatory bodies… that’s par for the course.\n\nHonestly, this whole article could be summed up in a Facebook post (if Facebook still allowed free speech):\n\n“Pfizer drugs once again shown to be dangerous. Company continues to thrive.”\n\nStop buying the narrative. Pfizer’s COVID-19 “vaccine” has even less testing than their other drugs. They’ve shown for decades that they’ll do whatever it takes to make a dollar. Lies, bribes, censorship, illegal experimentation, and the murder of children are all documented examples.\n\nIf you still believe that Pfizer is looking out for your best interests, then in the words of George Strait, we’ve got some oceanfront property in Arizona we’d like to sell you….", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer Anti-Smoking Drug Recalled as Carcinogenic: Vaccines Still \"Safe and Effective\"", "description": "Pfizer is expanding its recall of anti-smoking drug Chantix after testing found high levels of carcinogenic material in the pill.", "url": "https://thetruthaboutcancer.com/pfizer-anti-smoking-drug-recalled/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Cancer Causes", "article:published_time": "2021-08-19T16:56:26-04:00", "article:modified_time": "2021-08-25T15:20:25-04:00", "updated_time": "2021-08-25T15:20:25-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210819164611/TTAC-Breaking_News-Pfizer_Anti_Smoking-Website-600x330-02.jpg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-expands-recall-anti-smoking-drug-over-carcinogen-presence-2021-08-13/", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-halts-distribution-anti-smoking-drug-after-finding-carcinogen-2021-06-24/", "https://thetruthaboutcancer.com/smoking-and-lung-cancer-kick-butts/", "https://thetruthaboutcancer.com/google-censorship/", "https://clincalc.com/DrugStats/Drugs/VareniclineTartrate", "https://www.pharmaceutical-technology.com/features/biggest-pharmaceutical-lawsuits/", "https://www.acpjournals.org/doi/10.7326/0003-4819-145-4-200608150-00008", "https://en.wikipedia.org/wiki/Pfizer#cite_note-162", "https://www.cbsnews.com/news/blue-cross-names-and-shames-pfizer-execs-linked-to-massages-for-prescriptions-push/", "https://en.wikipedia.org/wiki/Pfizer#cite_note-169", "https://en.wikipedia.org/wiki/Pfizer#cite_note-171", "https://en.wikipedia.org/wiki/Pfizer#cite_note-170", "https://en.wikipedia.org/wiki/Pfizer#cite_note-172", "https://en.wikipedia.org/wiki/Pfizer#cite_note-177", "https://finance.yahoo.com/quote/PFE/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAM8Q39uG_9iKrsXmrmUsX3uYz_iSwGLQ922-Q7FsZNwSeGrCjnRCi_HDGyisBWmH9kz4UR_49MXunDa3HJoNHk3Pdfpy_RRlPTYVNZDuELXkDbku3pCAiUgdVq4FIbnuNRwW87bvOB0ycI1xW84dezo-RBuNv5F1P3vB_jsWOP1k", "https://thetruthaboutcancer.com/scott-gottlieb-fda-revolving-door/", "https://thetruthaboutcancer.com/orphan-designation-fda/", "https://thetruthaboutvaccines.com/mrna-safety/", "https://thetruthaboutcancer.com/conspiracy-censorship-tyranny/", "https://thetruthaboutcancer.com/conspiracy-censorship-tyranny/", "https://thetruthaboutcancer.com/cdc-corruption-part-1/", "https://thetruthaboutcancer.com/how-to-trust-news-part-1/", "https://thetruthaboutcancer.com/breaking-cdc-fda-faked-covid-testing-protocol-using-human-cells-mixed-common-cold-virus-fragments-pcr-tests-merely-detecting-common-cold/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["lialskraps", "T stromer", "Gary G. Kohls, M", "Kerri", "Sandy Hekking", "Derek Hobbs", "Vicky Del Rossi", "Barrie Johnson"], "publish_date": "2021-08-19T16:56:26-04:00"}