{"result_id": "308031", "URL": "https://thetruthaboutcancer.com/medical-shocker-mrna/", "timestamp": "2023-04-25 17:35:55 CEST+0200", "meta": {"description": "There's a secret layer of information in your cells called messenger RNA, thats located between DNA and proteins...", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/medical-shocker-mrna/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "MEDICAL SHOCKER Scientists Discover mRNA vaccine may cause cancer", "cleaned_text": "(Natural News) There’s a secret layer of information in your cells called messenger RNA, that’s located between DNA and proteins, that serves as a critical link. Now, in a medical shocker to the whole world of vaccine philosophy, scientists at Sloan Kettering found that mRNA itself carries cancer CAUSING changes – changes that genetic tests don’t even analyze, flying completely under the radar of oncologists across the globe.\n\nSo now, it’s time for independent laboratories that are not vaccine manufacturers (or hired by them) to run diagnostic testing on the Covid vaccine series and find out if these are cancer-driving inoculations that, once the series is complete, will cause cancer tumors in the vaccinated masses who have all rushed out to get the jab out of fear and propaganda influence. Welcome to the world of experimental and dirty vaccines known as mRNA “technology.”\n\nPreviously unknown cancer driving messengers are hiding in RNA, not DNA\n\nThis mind-blowing discovery should be published on every medical news site, newspaper, television news broadcast and on the CDC website, but unless you are reading this article and use DuckDuckGo as your search engine, you probably wouldn’t ever see it. That’s because Google is in on the fix, with Big Pharma and the VIC – the vaccine industrial complex. So here’s a more in-depth explanation of what we’re looking at, for real, regarding mRNA and vaccines.\n\nThe information carrying molecule, messenger RNA, can instruct human cells ultimately in the same way as cancer drivers, playing a major role in causing cancer to thrive while inactivating natural tumor-suppressing proteins the human body creates to save you from cancer. This is the complete opposite of what the CDC and the vaccine manufactures are telling everyone right now about the Covid vaccines, and this is based on clinical research by molecular biologists at the Sloan Kettering Institute.\n\nEven sequencing the DNA in cancer cells doesn’t reveal these changes, that’s how sneaky the vaccines are. It’s like a Trojan horse that tells your cells to allow these changes to be made, as if they were safe, but they’re not. All assumptions being made about mRNA being ‘safe’ right now have been completely turned 180 degrees with this research. Consider this very carefully if you have not yet been vaccinated with mRNA technology, and you may want to ‘lawyer-up’ if you already got the jabs.\n\nAfter your Covid vaccination, RNA is transported out of your cell’s nucleus, and will no longer function properly as a cancer tumor suppressor\n\nBill Gates and the Vaccine Industrial Complex are very sinister, as we all know, but to create vaccines that truncate (disable by cutting short) cancer tumor suppressors, and destroy the human body’s ability to protect against cancer, well, that’s just complete insanity. Truncated tumor-suppressor proteins are similar to the DNA mutations that cause cancer cells to mutate and multiply uncontrollably. Will America see cancer cases skyrocket over the next few years due to Covid vaccines? Only time will tell, but right now, science is revealing that it’s likely. Pay close attention.\n\nTherefore, anyone who is scared to death of the Covid vaccines is pro-science rather than anti-science, because the science shows the mRNA technology is very dangerous, especially concerning proteins that fuel cancer tumors. Let’s say that again: Science shows mRNA technology can fuel cancer tumor growth.\n\nSubstantial amount of people with blood cancer have the SAME inactivation of tumor-suppressor genes at the mRNA level\n\nScientists also discovered that a substantial amount of people with blood cancer, a.k.a. chronic lymphocytic leukemia (CLL), have the same exact inactivation of tumor-suppressor genes at the mRNA level. In fact, the mRNA changes they detected could possibly account for the missing DNA mutations, and that spells out bad news for everyone who thinks the Covid vaccine series is “safe and effective.” It’s effective alright, at suppressing anti-cancer proteins, one might conclude.\n\nEven if just half (partial truncation) mRNA changes in human cells take place, it’s enough to “completely override the function of the normal versions that are present,” according to the Sloan Kettering team of scientists. These changes can also apply to 100 different genes at the same time, so the changes can add up quickly and cause horrific health repercussions. Of course, mainstream media will dismiss any connections made by these discoveries, but they’re paid to regurgitate pharma talk, so that’s not surprising at all.\n\nIt is important to note that mRNA changes, according to researchers, are not limited to blood cancer, but have been linked to acute lymphatic cancer and breast cancer. Could this mean we’re looking at a new population control mechanism hidden in messenger RNA?\n\nAbout 20,000 people in the US develop “CLL” chronic lympthocytic leukemia each year. How many will quietly begin developing it now, and then have it suddenly “show up” five years from now? Symptoms include fatigue, enlarged lymph nodes, and night sweats. Did you get mRNA vaccinated and experience those symptoms already? Are those symptoms on the warning label – the vaccine insert? Did you read them?\n\nThere’s only one “treatment” offered right now for CLL by the Pharma Industrial Complex, and that’s stem cell bone marrow transplantation. Oh, but it’s only recommended if your CLL is “likely” to advance. Do your mRNA vaccines now qualify you as “likely” to advance with CLL?\n\nTune your internet dial to Vaccines.news for updates on human challenge trials for people interested in suppressing genes that fight cancer. No wonder Mark Zuckerberg is scared to death about the Covid vaccine.", "opengraph": {"locale": "en_US", "type": "article", "title": "MEDICAL SHOCKER Scientists Discover mRNA vaccine may cause cancer", "description": "There's a secret layer of information in your cells called messenger RNA, thats located between DNA and proteins...", "url": "https://thetruthaboutcancer.com/medical-shocker-mrna/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:tag": "monumentalmyths1", "article:section": "Global Health News", "article:published_time": "2021-03-03T23:28:00-04:00", "article:modified_time": "2021-03-06T14:10:01-04:00", "updated_time": "2021-03-06T14:10:01-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210303235159/MSKCC-3.png", "image:width": "772", "image:height": "416"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.naturalnews.com/author/sdwells", "https://www.naturalnews.com/2021-03-02-scientists-discover-mrna-inactivates-tumor-suppressing-proteins.html", "https://duckduckgo.com/", "https://www.naturalnews.com/2018-08-16-real-video-founder-mike-adams-no-central-authority-should-be-able-to-block-your-speech.html", "https://www.mskcc.org/news/scientists-find-cancer-drivers-hiding-rna-not-dna", "https://www.mskcc.org/cancer-care/types/leukemias/types/chronic-lymphocytic-leukemia-cll", "https://vaccines.news/2021-02-28-uk-to-conduct-first-coronavirus-challenge-trial.html", "https://www.naturalnews.com/2021-02-28-project-veritas-footage-facebook-ceo-concerned-vaccines.html", "https://www.naturalnews.com/2021-03-02-scientists-discover-mrna-inactivates-tumor-suppressing-proteins.html", "https://www.mskcc.org/news/scientists-find-cancer-drivers-hiding-rna-not-dna", "https://vaccines.news/2021-02-28-uk-to-conduct-first-coronavirus-challenge-trial.html", "https://www.mskcc.org/cancer-care/types/leukemias/types/chronic-lymphocytic-leukemia-cll", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Tom", "Tom Bernard", "FRED B BLOCK", "Alissa", "Graham", "Roseller Maalat", "Helen W", "Carol", "Rob", "LuAnn", "Michael McCabe", "Cameron Brooks", "stephen goldstein", "Mary", "Kat", "Paula Connelley", "Wanda", "Robin", "Connie", "Patricia Rasmussen", "Dee Asel", "Erlinda Dolar Sy", "Rudnavs", "Marvin Reitz", "Kim", "KEVIN Hoyt", "Mary J Nelson", "Michael", "Catherine B", "Lisa C.", "Peter Andrew Hamilton", "Ray Renk", "Andrew"], "publish_date": "2021-03-03T23:28:00-04:00"}