{"result_id": "308033", "URL": "https://shop.thetruthaboutcancer.com/pages/propaganda-exposed-uncensored", "timestamp": "2023-04-25 17:35:58 CEST+0200", "meta": {"description": "Early Bird Sale! Save up to 72%", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://shop.thetruthaboutcancer.com/pages/propaganda-exposed-uncensored", "encoding": "utf-8"}, "image": null, "domain": "shop.thetruthaboutcancer.com", "title": "Propaganda EXPOSED! [UNCENSORED]", "cleaned_text": "We’ve been sharing the truth for over 2 decades, and we have traveled the globe to bring you the answers to cancer and the truth about vaccines. We’ve produced 7 documentary films on these topics, and the common thread was censorship and suppression of anything “natural” by Big Pharma and the Medical Industry.\n\n \n\nOver the years, we’ve learned that we aren’t just being lied to about cancer, vaccines, and covid, but we are being brainwashed and propagandized about almost everything by the mainstream media, while our freedoms are slowly being taken. The truth is that if we don’t stand up now, we may lose liberty forever.\n\nThis is WHY we produced this 9-episode Docu-Series -- “Propaganda Exposed!” [UNCENSORED]\n\nThis is truly the most important documentary we’ve ever created and we truly believe that God is going to use it to help save our liberty and health freedom here in the USA and across the globe. It not only contains vital cutting-edge information on cancer and covid and vaccines, but dives into the sordid history of medical experimentation in the USA and the current impact of previous medical transgressions, thus allowing the viewer to “connect the dots” on why history seems to be repeating itself, as well as providing a roadmap to help maintain freedom of choice in medical interventions.\n\nIn total, over 50 health and freedom experts will be highlighted in this “one of a kind” documentary. The production quality is amazing, the interviews were exceptional, and the information will change lives, influence friends and family, and quite possibly “wake up” enough people to create a “tipping point” for truth and liberty.\n\nWith all of this amazing content, we wanted to give you the opportunity to own every episode.\n\nIt’s time to unite to fight back the forces of evil and censorship when it comes to freedom of choice in medical treatments, as well as saying “no” to forced vaccines. If we don’t stand up for health freedom and liberty now, then we may lose it forever.", "opengraph": {"site_name": "The Truth About Cancer", "url": "https://shop.thetruthaboutcancer.com/pages/propaganda-exposed-uncensored", "title": "Propaganda EXPOSED! [UNCENSORED]", "type": "website", "description": "Early Bird Sale! Save up to 72%", "image": "https://cdn.shopify.com/s/files/1/1744/1473/files/PEU_Product_Ad_Patriot_FB_1200X628_dde2a342-6215-445e-b4c9-08ee3e0f9c51.jpg?v=1668011589"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}