{"result_id": "308013", "URL": "https://thetruthaboutcancer.com/mrna-healing-protocol/", "timestamp": "2023-04-25 17:35:22 CEST+0200", "meta": {"description": "It’s been over 2 years since the first shots for COVID-19 were made available and they have been an unmitigated disaster. Here is a protocol to help heal.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/mrna-healing-protocol/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Advanced Healing & Recovery Protocol: How to Neutralize Damage from mRNA Shots", "cleaned_text": "How to Neutralize Damage from mRNA Shots\n\nIt’s been over 2 years since the first shots for COVID-19 were made available and they have been an unmitigated disaster. Not only do the shots fail to stop infection or transmission as promised (stopping the spread was the primary selling point for the jabs), but they have also resulted in a wave of injury and death that is unprecedented in pharmacology.\n\nA CDC safety signal analysis based on VAERS data covering the period from Dec. 14, 2020, when covid jabs were first released, through July 29, 2022, found that the experimental gene-editing injections cause all sorts of thrombo-embolic, cardiac, neurological, hemorrhagic, hematological, immune system, and menstrual adverse events in recipients – not to mention sudden death, which we are now witnessing occur all around the world.\n\nIn total, some 770 different types of adverse events were identified by the CDC as stemming from injecting adults, meaning people 18 years of age and older, for the Fauci Flu. Over 500 of these, or roughly two-thirds, had a larger safety signal than myocarditis and pericarditis, two of the most commonly reported heart-related conditions caused by covid shots.\n\nIn February of 2021, we published an article sharing practical ways to detox and neutralize damage that is being done by these untested mRNA vaccines. You can read that article here.\n\nMany have already been duped into taking these shots. Some just once, others multiple times. The question remains:\n\n“What can I do to get this poison OUT of my body and protect myself from these lethal side effects?”\n\nA prominent doctor and healer (with whom many of you are familiar) has created an advanced recovery protocol for those who were tricked, forced, or coerced into getting these toxic mRNA shots. But with persecution of the truth at an all-time high, this doctor is concerned that sharing this information could result in attacks on their business, family, and even their medical licenses.\n\nThey’ve asked us to share this new protocol with all of you. If you or someone you know received one or more doses of an mRNA shot, please read this protocol below and share with anyone who will listen.\n\nYou might just save a life.\n\nThis program is specifically designed and recommended to support homeostasis by rapidly detoxing and repairing the body. It helps to reactivate the body’s self-healing mechanism. It also helps with DNA repair, nanobot deactivation, biological and man-made synthetic parasite removal, acts as a poison antidote and as a protectant from harmful EMFs and 5G. This Program should be done daily for the first 18 days and then 1x weekly for maintenance.\n\nOrganic Nascent Iodine: Take 1 dropperful 2x daily- in morning and afternoon. (Here’s a product we trust.)\n\nIvermectin Gel: Consider using the Durvet horse gel: squeeze out ¼ inch and take 2x daily with food for the first 9 days, then 1-2x weekly for maintenance. You can order this on amazon. Herxing, or detox reaction is a very real situation, some people may need to begin slower such as 1/2 ivermectin portion 1x/daily or every other day. Gradually build up. Listen to your body. Herxing is not a great feeling and some get better faster than others. People must be ready for this especially if they are very sick!\n\nIvermectin Tablet: Take one 12mg tablet daily. Only if you are not using the gel above.\n\nIVERMECTIN BY AGE: Always take with food. Ages 11-67 – Use normal portions above. 5-10 years – 68+ – those who are very sick – 1/8 inch 1x/day. See how you feel. If you feel good after a week, do 1/8 inch both morning and night. Go up from there each week. Cut the portion down if at any time the herxing becomes horrible. Stay where you are for a while longer. Listen to your body. Nobody knows your body like you do. Listen to it!\n\nFenbendazole – FenBen Pure: Take 4 days on and 3 days off. 2 scoops (scoop included in order) – one scoop in AM and one in the PM. Take the Fenben Pure with avocado, organic almond butter, or right after a meal that contains healthy fats. FenBen Pure contains no additives and needs healthy fats for the best absorption.\n\nSupercharged C60 or C60 (Carbon Nano Onions): (You can find it here.) Take 2 capsules, 2x daily for the first 18 days, then 1 day weekly. (Another great option here.)\n\nPlant-Based Quercetin Phytosome: (You can find it here.) Take 250mg 2x daily\n\nThe Ultimate Probiotic: (You can find it here.) Take three capsules, two times daily.\n\nParatrex: (You can find it here.) Take three capsules, two times daily.\n\nOrganic Plant Based Zinc: (You can find it here.) Take 1 dropperful in the morning with food and 1 dropperful in the afternoon with food\n\nVitamin D3: (You can find it here.) Take 5000 IU 2x daily\n\nCDS/MMS (Chlorine Dioxide): Take as recommended online or as instructed on the label. For more information visit: https://andreaskalcker.com/en/ Andreas Kalcker Telegram thread with CDS/MMS protocols: https://t.me/AndreasKalckerProtocols And join https://t.me/theuniversalantidote for more information\n\nUrotherapy: To learn more, click HERE.\n\nDistilled Water: You must drink ¾ to 1 gallon of distilled water each day when you are doing this program. Distilled water will leach and bind the inorganic or harmful toxins and poisons from your body. It will not leach organic minerals from your body. What we have been told about distilled water being bad for you is a deception and lie. Learn why distilled water should be the only water you drink.\n\nMy purpose in providing this information is to suggest alternatives that may be of benefit for balancing health and wellness. Please approach these ideas critically and with discernment. Consult with your physician or other health care professional before starting this or any other health-supporting program. The above statements have not been evaluated by the Food and Drug Administration. The products referenced are not intended to diagnose, treat, cure or prevent any disease.\n\nMaking a remedy from your own urine: Eagle Research’s Remedy Maker offers a modern way to produce, copy, and utilize homeopathic remedies rapidly and effectively. It is powerful enough for the seasoned practitioner, yet simple enough for a child to operate. Eagle Research produces several attachments and accessories that will allow anyone to be able to take advantage of the Remedy Maker to the fullest extent. Whether you’re trying to recuperate from walking through a patch of poison ivy, you need acupuncture treatments, or your dog has an upset stomach, the Remedy Maker has a way to obtain and utilize the answer!", "opengraph": {"locale": "en_US", "type": "article", "title": "Advanced Healing & Recovery Protocol: How to Neutralize Damage from mRNA Shots", "description": "It's been over 2 years since the first shots for COVID-19 were made available and they have been an unmitigated disaster. Here is a protocol to help heal.", "url": "https://thetruthaboutcancer.com/mrna-healing-protocol/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Vaccine News", "article:published_time": "2023-01-18T11:31:40-04:00", "article:modified_time": "2023-01-26T01:15:20-04:00", "updated_time": "2023-01-26T01:15:20-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230118115305/TTAC_Advanced-Healing-Recovery-Protocol-from-mRNA-Shots_Article_1200x628_Email-FB-web.jpg", "image:width": "1000", "image:height": "523"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutvaccines.com/stop-damage-mrna-vaccines/", "https://globalhealing.com/products/detoxadine", "https://thehappyhealingstore.com/product/fenben-pure/", "https://globalhealing.com/products/supercharged-c60", "https://grafexsuperc60.com/", "https://globalhealing.com/products/quercetin", "https://globalhealing.com/products/probiotic", "https://globalhealing.com/products/paratrex", "https://globalhealing.com/products/zinc", "https://globalhealing.com/products/vitamin-d", "https://andreaskalcker.com/en/", "https://t.me/AndreasKalckerProtocols", "https://t.me/theuniversalantidote", "https://thetruthaboutcancer.com/urotherapy/", "https://globalhealing.com/pages/distilledwaterbenefits", "https://www.eagleresearchllc.com/products/bioenergetics/remedy-maker", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": [], "publish_date": "2023-01-18T11:31:40-04:00"}