{"result_id": "308037", "URL": "https://thetruthaboutcancer.com/facebook-bans-who/", "timestamp": "2023-04-25 17:36:02 CEST+0200", "meta": {"description": "[SATIRE] In violation of content guidelines, Facebook bans the W.H.O from posting on Facebook in a crackdown on “dangerous” accounts.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/facebook-bans-who/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Facebook Bans W.H.O. Due to Recent 'Anti-Vaccine' Comments", "cleaned_text": "MENLO PARK, CA—Explaining that the World Health Organization (WHO) had violated the site’s content guidelines, Facebook reportedly banned the WHO from posting on Facebook in a crackdown on “dangerous” accounts.\n\nIn December 2019, the WHO held the Global Vaccine Safety Summit in Geneva, Switzerland. After the meeting, several WHO scientists posted their comments to the WHO’s Facebook page.\n\nHere are several of the offending quotes that were later posted on Facebook and resulted in the ban:\n• Prof. Heidi Larson, Ph.D. (Director of the Vaccine Confidence Project) admitted that the WHO lacks vaccine safety science and needs “much more investment in safety science.”\n• Prof. Larson stated “We have a very wobbly health professional frontline that is starting to question vaccines” and also mentioned that doctors aren’t confident enough to answer safety questions from parents since they only got a half day of vaccine education in medical school.\n• Dr. Soumya Swaminathan, M.D. (Chief Scientist, WHO) stated “We really don’t have very good safety monitoring systems.”\n• Most alarming was when Dr. Marion Gruber, Ph.D. (Director, Office of Vaccines Research and Review, Center for Biologics Evaluation and Research, FDA) said that we should start to consider “safety concerns” regarding vaccines which are already being injected into people all over the world.\n\nWe cannot have scientists from the W.H.O. questioning vaccine safety. These are the people who make vaccine policy for the entire world. If they continue to question, then the people will continue to question. Pretty soon, nobody will take vaccines. It’ll be anarchy! I could lose my condo in Manhattan and my yacht in the Caribbean!”\n\nConceding that Facebook users who call more vaccine safety studies might have a case, Facebook representatives told reporters Thursday that classifying “anti-vaccine” sentiment can be difficult because some posts actually make very interesting points, especially when the posts are from scientists at the World Health Organization.\n\nNevertheless, in the words of Jenny Manilow, head of global policy management at Facebook:\n\nThe Facebook community should be a ‘safe space’ where our users are protected from having to think logically about vaccines and should not have to be confronted with any Facebook users who question the safety of vaccines. This is why we’ve suspended the account of the World Health Organization.”\n\nSpeaking of Zuckerberg, in what banking experts are calling an “unprecedented liquidation,” he announced last week that, following a swift drop in the value of his Facebook stock holdings, he had no choice but to “sell off” 1.5 million Facebook users. In the most viewed “Facebook live” in history, the men, women, and children (ages 11 and up) were auctioned off to a Los Angeles-based private equity group.\n\nYes, just in case you’re missed “SATIRE” … TWICE … as well as the words “FAKE NEWS” on the photo … this is . It’s just a article that I wrote while I was in a funny mood. Hope you enjoyed it. 😉\n\nTy and Charlene have been on this mission together to reach as many people around the world with the truth that saves lives as they can, and they need your help! As you know, they are being censored with many other truth tellers.Please support their mission by sharing this article! Next, you can support them by going to signing up for their FREE Newsletter!Also, join Ty & Charlene on Alt Social Media platforms where the TRUTH is allowed and join the discussion there! Ty and Charlene have been on this mission together to reach as many people around the world with the truth that saves lives as they can, andAs you know, they are being censored with many other truth tellers.Please support their mission by! Next, you can support them by going to www.thetruthaboutcancer.com andfor their FREE Newsletter!Also,on Alt Social Media platforms where the TRUTH is allowed and join the discussion there!", "opengraph": {"locale": "en_US", "type": "article", "title": "Facebook Bans W.H.O. Due to Recent 'Anti-Vaccine' Comments", "description": "[SATIRE] In violation of content guidelines, Facebook bans the W.H.O from posting on Facebook in a crackdown on \"dangerous\" accounts.", "url": "https://thetruthaboutcancer.com/facebook-bans-who/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:author": "https://www.facebook.com/thetruthaboutcancer", "article:tag": "products1", "article:section": "Global Health News", "article:published_time": "2020-02-07T11:18:09-04:00", "article:modified_time": "2020-02-11T09:46:18-04:00", "updated_time": "2020-02-11T09:46:18-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20200206155509/Satire1.png", "image:width": "1000", "image:height": "563"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.youtube.com/watch?v=s2IujhTdCLE&t=48s", "https://www.youtube.com/watch?v=mI4e7niqNxs&t=12s", "https://www.youtube.com/watch?v=aWZ-LYIlAJw&t=19s", "https://www.youtube.com/watch?v=s2IujhTdCLE&t=53s", "https://www.youtube.com/watch?v=Er3aX__loWU&t=59s", "http://shop.thetruthaboutcancer.com/pages/products/?promo_name=ttac-shop&promo_id=ttac-blog&promo_creative=products1&promo_position=nanobar&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/products/?promo_name=ttac-shop&promo_id=ttac-blog&promo_creative=products1&promo_position=nanobar&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Andrea", "Z", "friv", "Kathryn Miller", "Mary Zachariadou", "Alma Gingrich", "Wendy", "Cool", "Karen", "Noel Edward Gandy", "Sarah O Scoma", "Joyce A Manier", "Kat", "Susan Espinoza", "Tim K", "Peter McAlpine", "Deanne", "Gabrielle", "Charmaine Y Rusin", "Customer Service", "Guy Richer", "Patriciahillips", "Brian James", "Lisa", "Peter"], "publish_date": "2020-02-07T11:18:09-04:00"}