{"result_id": "308046", "URL": "https://thetruthaboutcancer.com/man-made-coronavirus-kills-hundreds/", "timestamp": "2023-04-25 17:36:12 CEST+0200", "meta": {"description": "Discover the truth behind what's really happening with the coronavirus, increased censorship, and what's coming next.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/man-made-coronavirus-kills-hundreds/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Man-Made Coronavirus Kills Hundreds - A Vaccine in the Works?", "cleaned_text": "It’s been 2 weeks since we first wrote about the novel coronavirus (nCoV-2019) originating in China. Since then, the official numbers have skyrocketed from 630 infections and 17 deaths to over 24,000 infections and roughly 500 deaths.\n\nNaturalNews reports that China is actually keeping two sets of numbers, and that the actual numbers are much higher than the “official” numbers, with over 154,000 infected and almost 25,000 dead. Several nations have evacuated their citizens from china, while airlines have shut down flights to China and other countries.\n\nOn January 31st, President Trump declared that the novel coronavirus presents a public health emergency in the United States. That same day, under the guidance of the CDC, the White House Coronavirus Task Force announced a 14-day quarantine for Americans who recently visited Wuhan, China, the epicenter of the coronavirus outbreak.\n\nOver the last two weeks, the Chinese government has quarantined roughly 50 million people in over a dozen cities – the largest quarantine in human history. Cruise liners carrying infected passengers have been denied entry into Japan and passengers will be quarantined on the ships for at least two weeks.\n\nMajor manufacturers like Apple and Adidas have shut down their stores and plants in China, and airlines have placed over 30,000 employees on unpaid leave. In the U.S., hundreds of Americans have been evacuated from the Wuhan area and will be immediately quarantined on military bases.\n\nThe measures being taken by governments around the world are drastic and unprecedented. The authority that these institutions are willing to assume in the face of a “health emergency” is concerning… and it’s only the beginning.\n\nIn the wake of the new virus, Facebook announced that it would remove any content about the coronavirus “with false claims or conspiracy theories that have been flagged by leading global health organizations and local health authorities,” saying such content would violate its ban on misinformation leading to “physical harm.”\n\nThis is a much more aggressive policy than Facebook has taken before. Up to this point, censorship efforts have mostly involved restricting search results and advertising while still allowing the content to remain published. The ban will also apply to Instagram, which will subject users to pop-up ads when they click on hashtags related to the virus.\n\nGoogle has followed suit, pushing updates from the WHO to the top of search results involving the coronavirus. YouTube, owned by Google, will also make it harder to find independent information about the virus, promoting videos from public health organizations and mainstream media outlets.\n\nTwitter said Wednesday that it would begin prompting users who search for the coronavirus to first visit official channels of information about the illness. In the United States, for example, Twitter directs users to the Centers for Disease Control and Prevention, beneath a bold headline that reads: “Know the facts.”\n\nThe campaign is running in 15 locations, including the United States, the United Kingdom, Hong Kong, Singapore, and Australia, and “will continue to expand as the need arises,” the company said in a blog post.\n\nTwitter has even banned financial market website Zero Hedge from the social media platform after it published an article linking a Chinese scientist to the outbreak of the fast-spreading coronavirus last week.\n\nZero Hedge had their account permanently suspended for violating “platform manipulation policy”. The account had 670,000 followers as of its suspension. The suspension was in response to a complaint by Buzzfeed which said Zero Hedge had released the personal information of a scientist from Wuhan in an article that made allegations about coronavirus having been concocted “as a bioweapon.” The article was titled “Is This the Man Behind the Global Coronavirus Pandemic?”\n\nTik-Tok, a Chinese-owned company, already removes posts and blocks users. This is standard practice in communist China, where state-run media and extreme surveillance of its citizens makes it easy to control what information is released.\n\nThe effort in China to silence free speech and control the narrative regarding coronavirus has been aggressive. According to a Reuters report:\n\nTo make matters worse, it turns out that Chinese officials arrested 8 medical professionals who tried to warn people of the disease back in December. Each detainee was part of a medical school’s alumni group on WeChat, a popular social network in China, and they were concerned that SARS, Severe Acute Respiratory Syndrome, was back. (SARS is a type of coronavirus.)\n\nAccording to The Daily Beast:\n\nSince then, the phenomenal spread of the virus has created cracks even within the normally united front of the Chinese Communist Party. “It might have been fortunate if the public had believed the ‘rumor’ and started to wear masks, carry out sanitization measures, and avoid the wild animal market,” a judge of China’s Supreme People’s Court wrote online last Tuesday.\n\nLi Wenliang, a doctor who was among the eight people who tried to sound the alarm before the coronavirus infected many thousands and killed hundreds, was diagnosed as someone infected with the coronavirus and is being treated at a hospital. Authorities are still actively censoring social-media posts and news articles that question the government’s response to the outbreak. One Wuhan man, Fang Bin, uploaded footage of corpses in a van and a hospital in Wuhan and was then tracked down and taken into custody. His laptop was confiscated, and he had to pedal for three hours on a bicycle to get home after he was questioned, warned, and released. His coronavirus video went viral.\n\nExperts agree that this kind of aggressive censorship could make the virus even more lethal. Leaders within the Chinese government have put their political interests before the good of their people, and the results have been catastrophic thus far.\n\nIn recent days, medical experts have found evidence that the origin of the outbreak was not a seafood market in Wuhan, as the Chinese government initially reported. That evidence also suggests that the first human infections occurred in November, if not earlier, rather than in early December.\n\nThe true scope of the disease may be worse than we’ve been told. Public officials have been deleting investigative reports by journalists in the area, while many patients who have died of “regular pneumonia” were never tested for coronavirus.\n\nGiven the rapid spread of the virus and the enormous economic effects expected, censorship and propaganda are certain to continue — and to extend beyond China’s borders — as the regime seeks to protect its hold on power and international reputation. While Chinese authorities assure domestic and international audiences that their efforts will contain the outbreak, censors are busily deleting social media posts and journalists’ reporting that contradict the official narrative.\n\nLies and secrecy are common in most communist nations, and China is no exception. It is well-documented that the information released during the SARS outbreak of 2003 was significantly redacted to minimize its true impact.\n\nBut what about here in America?\n\nWe’ve already reported that, in 2015, a patent was filed by The Pirbright Institute for the live, attenuated coronavirus. The application claims that the new virus could be used to create a vaccine for treating or preventing respiratory viruses. The patent was awarded in 2018.\n\nThe Pirbright Institute is funded by the UK Department for Environment, Food, and Rural Affairs, the WHO, and the Bill and Melinda Gates Foundation. All of these entities have been loud supporters of mandatory vaccinations and more government control based on “health concerns.”\n\nAnd for several years, Bill Gates has been telling us that a pandemic is coming, and in November of 2019, collaborating with the World Economic Forum, the Bill & Melinda Gates Foundation hosted “Event 201” where they ran a simulation of a coronavirus pandemic.\n\nIt should come as no surprise that – just yesterday – Bill and Melinda Gates announced that they would be donating $100 million to coronavirus vaccine research and treatment efforts, which were announced as part of the World Health Organization’s (WHO) request for $675 million in global contributions to fight the spread of the disease.\n\nYou can bet your bottom dollar that this vaccine will be heavily pushed on all Americans, and probably mandated in some states and cities. But what’s the truth behind the coronavirus?\n\nOfficials would have you believe that the new coronavirus began when someone ate contaminated bat soup at a Wuhan seafood and animal market, but that is a flat-out lie. And a paper published in The Lancet last week has the proof.\n\nThe paper, written by a large group of Chinese researchers from several institutions, offers details about the first 41 hospitalized patients who had confirmed infections with what has been dubbed 2019 novel coronavirus (2019-nCoV). In the earliest case, the patient became ill on 1 December 2019 and had no reported link to the seafood market, the authors report.\n\n“No epidemiological link was found between the first patient and later cases,” they state. Their data also show that, in total, 13 of the 41 cases had no link to the marketplace. “That’s a big number, 13, with no link,” says Daniel Lucey, an infectious disease specialist at Georgetown University.\n\nLucey says if the new data are accurate, the first human infections must have occurred in November 2019—if not earlier—because there is an incubation time between infection and symptoms surfacing. If so, the virus possibly spread silently between people in Wuhan—and perhaps elsewhere—before the cluster of cases from the city’s now-infamous Huanan Seafood Wholesale Market was discovered in late December. “The virus came into that marketplace before it came out of that marketplace,” Lucey asserts.\n\nThe much more likely scenario is that a weaponized version of the virus was released (whether intentionally or not) by Wuhan’s Institute of Virology – a level-4 biohazard lab which was studying “the world’s most dangerous pathogens.”\n\nThe institute even has an ad for researchers to help use “bats to research the molecular mechanism that allows Ebola and SARS-associated coronaviruses to lie dormant for a long time without causing diseases.”\n\nThe job is for a lab run by Dr. Peng Zhou, Ph.D., a researcher at the Wuhan Institute of Virology and Leader of the Bat Virus Infection and Immunization Group. Since 2009, Peng has been the leading Chinese scientist researching the immune mechanism of bats carrying and transmitting lethal viruses in the world.\n\nHis primary field of study is researching how and why bats can be infected with some of the most nightmarish viruses in the world including Ebola, SARS and Coronavirus, and not get sick. As part of his studies, Peng also researched mutant Coronavirus strains that overcame the natural immunity of some bats; these are “superbug” Coronavirus strains, which are not resistant to any natural immune pathway, and now appear to be out in the wild.\n\nThe institute is about 13 miles away from the market that China claims as the source of the outbreak.\n\nA study by 5 Greek scientists (published 1/27/2020) examined the genetic relationships of nCoV-2019 and found that “the new coronavirus provides a new lineage for almost half of its genome, with no close genetic relationships to other viruses within the subgenus of sarbecovirus,” and has an unusual middle segment never seen before in any coronavirus.\n\nWhat exactly does that mean? Basically, this means that we are dealing with a brand new type of ‘man-made’ coronavirus. The study’s authors rejected the original hypothesis that the virus originated from random natural mutations between different coronaviruses.\n\nDany Shoham, a former Israeli military intelligence officer who has studied Chinese biological warfare, has also linked the virus to China’s covert biological weapons program. Mr. Shoham holds a doctorate in medical microbiology. From 1970 to 1991, he was a senior analyst with Israeli military intelligence for biological and chemical warfare in the Middle East and worldwide.\n\n“Certain laboratories in the institute have probably been engaged, in terms of research and development, in Chinese [biological weapons], at least collaterally, yet not as a principal facility of the Chinese BW alignment,” Mr. Shoham told The Washington Times. Work on biological weapons is conducted as part of dual civilian-military research and is “definitely covert,” he said.\n\nIn a sad turn of events, the Chinese doctor who tried to warn others about the Wuhan coronavirus, has died. Li Wenliang, a 34-year-old doctor working in Wuhan, raised the alarm about the novel coronavirus on December 30th. Soon after he posted the message, Li was accused of rumor-mongering by the Wuhan police. He was one of several medics targeted by police for trying to blow the whistle on the deadly virus in the early weeks of the outbreak. Li was hospitalized on January 12th after contracted the virus from one of his patients, and he was confirmed to have nCoV-2019 on February 1st.\n\nThe question is … If the Chinese made this virus in a lab, what was their purpose? And why did they arrest the doctor who tried to inform the rest of the world?\n\nThe world needs an answer.\n\nAs long as we continue to believe the lies promulgated by communist state-run media, we’re going to stay in the dark. Government agencies around the world have been happy to sensationalize the virus as an excuse for extreme control over their citizens.\n\nPeople are being detained and quarantined. Travel and business have been seriously disrupted. The global economy is in turmoil. Scientists and journalists are being silenced and even arrested. And social media companies founded in the freest country on earth are deleting any content that suggests that this is a man-made problem.\n\nPeople are scared. Tens of millions have had their lives put on hold. Hundreds have died in the last week.\n\nBut don’t worry… be healthy! There are herbs and natural substances that can have a profound effect on viruses and your immune function.\n\nSurprise surprise! Bill Gates, the WHO, and everyone else in the medical industry are working on a nCoV-2019 vaccine … a vaccine that they patented half a decade before the virus appeared … a virus that was created in a lab.\n\nBut that’s just a “coincidence,” right?\n\nFor several years, Bill Gates has been telling us that a pandemic is coming, and on October 18, 2019 (collaborating with the World Economic Forum), the Bill & Melinda Gates Foundation hosted “Event 201” where they ran a simulation of a coronavirus pandemic.\n\nA meeting of the “globalist health minds” occurred on November 6th to discuss its findings with 9 recommendations.\n\nSurprise surprise! One recommendation, of course, included deleting/erasing/censoring “disinformation” in the WHO’s eyes.\n\nBut that’s just another “coincidence,” right?", "opengraph": {"locale": "en_US", "type": "article", "title": "Man-Made Coronavirus Kills Hundreds - A Vaccine in the Works?", "description": "Discover the truth behind what's really happening with the coronavirus, increased censorship, and what's coming next.", "url": "https://thetruthaboutcancer.com/man-made-coronavirus-kills-hundreds/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:author": "https://www.facebook.com/thetruthaboutcancer", "article:tag": "products1", "article:section": "Global Health News", "article:published_time": "2020-01-31T15:00:48-04:00", "article:modified_time": "2021-06-15T11:14:04-04:00", "updated_time": "2021-06-15T11:14:04-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20200206145410/TTAC-BreakingNews-Coronavirus-Feature-600X330-1.png", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutcancer.com/coronavirus-reaches-united-states/", "https://www.naturalnews.com/2020-02-05-china-two-sets-of-coronavirus-pandemic-numbers-leaked-data-deaths.html", "https://thetruthaboutcancer.com/national-health-emergency-coronavirus/", "https://fox8.com/2020/01/31/coronavirus-declared-public-health-emergency-in-us-white-house-task-force-issues-federal-quarantine/", "https://www.reuters.com/article/us-china-health/china-virus-hits-cruise-ships-carmakers-airlines-and-airbus-idUSKBN1ZZ06L", "https://www.cbsnews.com/news/coronavirus-diamond-princess-cruise-passengers-quarantined-in-japan/", "https://www.nytimes.com/2020/02/05/world/asia/coronavirus-china.html", "https://www.reuters.com/article/us-china-health-facebook/as-coronavirus-misinformation-spreads-on-social-media-facebook-removes-posts-idUSKBN1ZV388", "https://about.fb.com/news/2020/01/coronavirus/", "https://www.cnn.com/2020/01/31/tech/facebook-twitter-google-coronavirus-misinformation/index.html", "https://www.reuters.com/article/us-china-health-twitter-idUSKBN1ZW0PZ", "https://www.zerohedge.com/health/man-behind-global-coronavirus-pandemic", "https://www.reuters.com/article/us-china-health-fakenews/coronavirus-sends-asias-social-media-censors-into-overdrive-idUSKBN1ZY1AC", "https://www.cnn.com/2020/02/03/asia/coronavirus-doctor-whistle-blower-intl-hnk/index.html", "https://www.thedailybeast.com/china-arrested-doctors-who-warned-about-coronavirus-outbreak-now-death-tolls-rising-stocks-are-plunging?ref=scroll", "https://twitter.com/jenniferatntd/status/1223639844829769734", "https://www.latimes.com/opinion/story/2020-02-03/coronavirus-china-media-censorship-propaganda", "https://twitter.com/Dali_Yang/status/1223810350241472514", "https://www.forbes.com/sites/lisettevoytko/2020/02/05/bill-and-melinda-gates-donate-100-million-to-coronavirus-vaccine-research/#552321e76e9e", "https://www.sciencemag.org/news/2020/01/wuhan-seafood-market-may-not-be-source-novel-virus-spreading-globally", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30183-5/fulltext", "http://www.whiov.cas.cn/105341/201911/t20191118_5438006.html", "https://www.biorxiv.org/content/10.1101/2020.01.26.920249v1", "https://www.washingtontimes.com/news/2020/jan/26/coronavirus-link-china-biowarfare-program-possible/", "https://www.washingtontimes.com/news/2020/jan/26/coronavirus-link-china-biowarfare-program-possible/", "https://www.cnn.com/2020/02/06/asia/li-wenliang-coronavirus-whistleblower-doctor-dies-intl/index.html", "https://thetruthaboutcancer.com/national-health-emergency-coronavirus/", "https://www.businessinsider.com/bill-gates-warns-the-next-pandemic-disease-is-coming-2018-4", "https://hub.jhu.edu/2019/11/06/event-201-health-security/", "http://shop.thetruthaboutcancer.com/pages/products/?promo_name=ttac-shop&promo_id=ttac-blog&promo_creative=products1&promo_position=nanobar&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/products/?promo_name=ttac-shop&promo_id=ttac-blog&promo_creative=products1&promo_position=nanobar&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["laurie batz", "freeladyjo", "Tristan", "MK", "chezzer", "Sally", "Thea", "Elizabeth Samways", "Margaret", "J B", "Judith", "Lum", "ROBERT MILLER", "Adena", "Eva", "Chris Bailey III", "Lil", "Live Life", "Peter Richard, - (Former overseas 'Investidative Journalist & Researcher')", "worthit", "Dr Chris Hertzog.", "JB", "Mark van Wyk", "gallinazo", "Mark", "Tony", "GrannyD Daljeet", "Kate", "Steve Arnott", "WD", "Linda Badham", "Rosemary Linseman", "Alan", "Deanne", "sococrro.monamour", "Richard", "Customer Service", "Stefano Leonardi", "David Hill", "Dan Brown", "C", "Anastasia Garomo", "Clabianco", "Thomas Braun RPh", "Joshua Cowan", "robin", "Rotha Jago", "George", "Larry OBrien"], "publish_date": "2020-01-31T15:00:48-04:00"}