{"result_id": "308018", "URL": "https://thetruthaboutcancer.com/medical-establishment-attempts-memory-hole-natural-immunity-post-vaccine-outbreaks-strike-cruise-lines-hundreds-doctors/", "timestamp": "2023-04-25 17:35:32 CEST+0200", "meta": {"description": "The medical establishment is trying to memory hole any mention of “natural immunity,\" hoping that we'll forget about the human immune system.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/medical-establishment-attempts-memory-hole-natural-immunity-post-vaccine-outbreaks-strike-cruise-lines-hundreds-doctors/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Medical establishment attempts to MEMORY HOLE \"natural immunity\" while post-vaccine outbreaks strike cruise lines and hundreds of doctors", "cleaned_text": "TTAC is experiencing heavy censorship on many social media channels since we’ve been targeted by the mainstream media sellouts, social media bullies, and political turncoats. Be sure to get the TRUTH by subscribing to our email list . It’s free .\n\nIn the latest insane push for vaccine fanaticism at the expense of legitimate science, the medical establishment is now trying to memory hole any mention of “natural immunity” in previous pandemics, hoping that humanity will forget about the very existence of the human immune system. The only route to immunity, according to corrupt, quack science “officials” like those from the CDC, FDA and WHO, is to receive a vaccine injection. Thus, natural antibodies don’t count, they claim.\n\nEven the Mayo Clinic is now retroactively removing natural immunity content from its own website. As explained by Children’s Health Defense:\n\nUntil recently, the Mayo Clinic reported that individuals who survived the 1918 influenza pandemic were immune, 92 years later, to H1N1 influenza. However as economist Jon Sanders noted, the Mayo Clinic removed the mention of 1918 influenza immunity from its website this spring. And late last year, the WHO was caught attempting to unscientifically exclude “immunity developed through previous infection” from the very definition of herd immunity.\n\nWhy, asks Sanders, are Americans being kept in the dark about the fact that so many “have faced COVID-19 and won” — and, therefore, “don’t need a vaccine?”\n\nThe answer, of course, is that if health authorities recognized the role of natural immunity, they wouldn’t be able to achieve their depopulation / extermination goals by vaccinating 70% of U.S. adults with a deadly bioweapon. If natural immunity were recognized, then a simple antibody test would confirm a person doesn’t need a vaccine since they’ve already conquered covid on their own.\n\nThe concept of “vaccine passports” is also threatened by natural immunity, since those who developed their own antibodies in response to pathogen exposure shouldn’t need a vaccine passport, nor be required to participate in such a passport scheme. The existence of natural antibodies, by itself, is the only immunity needed. Yet the vaccine zealots (and their complicit bureaucrats and regulators) now pretend natural immunity doesn’t exist, demanding everyone be vaccinated.\n\nThe covid vaccine, of course, contains spike protein bioweapons, engineered at Wuhan and designed to destroy human tissue. This is probably why four British Airways pilots just recently died after receiving vaccine injections.\n\nAirlines and cruise lines are seeing infections, hospitalizations and deaths among vaccinated employees\n\nPost-vaccine deaths are now hitting the transportation sector, with British Airways now confirming that four pilots have died, following the airline’s launch of its own internal vaccine passport program.\n\nCruise line Royal Caribbean is also now canceling another cruise after covid “outbreaks” have struck eight vaccinated crew members, as reported by HotAir.\n\nAnd Reuters is now confirming that hundreds of doctors in Indonesia have been stricken with covid — with many of them hospitalized in serious condition — after being fully vaccinated. From Reuters:\n\nMore than 350 doctors and medical workers have caught COVID-19 in Indonesia despite being vaccinated with Sinovac and dozens have been hospitalised, officials said, as concerns grow about the efficacy of some vaccines against more infectious variants… dozens were in hospital with high fevers and falling oxygen-saturation levels.\n\nReuters blames the outbreak on the “Delta variant” of covid, which is nothing but a cover story to hide the truth that vaccines are causing the infections, hospitalizations and deaths. Why? Because covid vaccines contain spike protein nanoparticles which are genetically engineered biological weapons created in Wuhan and designed to attack and destroy human tissue.\n\nVAERS is currently reporting nearly 6000 post-vaccine deaths in the United States, by the way. That number is sure to accelerate as the HHS data entry teams try to catch up with their six-week backlog in entering VAERS death reports.\n\nGet the full story in today’s Situation Update podcast\n\nI cover more details on this story and many other stories in today’s Situation Update podcast. See the description text for time codes of different topic areas covered. Each day’s podcast always begins with “Insane / Crazy News Headlines” and then continues into economics, politics, vaccines, covid or other similar topics:", "opengraph": {"locale": "en_US", "type": "article", "title": "Medical establishment attempts to MEMORY HOLE \"natural immunity\" while post-vaccine outbreaks strike cruise lines and hundreds of doctors", "description": "The medical establishment is trying to memory hole any mention of \"natural immunity,\" hoping that we'll forget about the human immune system.", "url": "https://thetruthaboutcancer.com/medical-establishment-attempts-memory-hole-natural-immunity-post-vaccine-outbreaks-strike-cruise-lines-hundreds-doctors/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Global Health News", "article:published_time": "2021-06-22T10:29:21-04:00", "article:modified_time": "2021-06-23T10:37:29-04:00", "updated_time": "2021-06-23T10:37:29-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210623103718/HRR-2021-06-18-Situation-Update.jpg", "image:width": "1000", "image:height": "563"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/cdc-aggressive-push-vaccinate-natural-immunity/", "http://depopulation.news/", "https://spikeprotein.news/", "https://www.naturalnews.com/2021-06-18-british-airways-confirms-four-vaccinated-pilots-have-recently-died.html", "https://www.naturalnews.com/2021-06-18-british-airways-confirms-four-vaccinated-pilots-have-recently-died.html", "https://hotair.com/allahpundit/2021/06/16/royal-caribbean-postpones-cruise-after-eight-vaccinated-crew-test-positive-for-covid-n397179", "https://www.reuters.com/world/asia-pacific/hundreds-indonesian-doctors-contract-covid-19-despite-vaccination-dozens-2021-06-17/", "https://www.naturalnews.com/2021-06-18-medical-establishment-attempts-to-memory-hole-natural-immunity-post-vaccine-outbreaks.html"], "authors": [], "publish_date": "2021-06-22T10:29:21-04:00"}