{"result_id": "308028", "URL": "https://thetruthaboutcancer.com/cancer-rates-california-new-york/", "timestamp": "2023-04-25 17:35:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/cancer-rates-california-new-york/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Cancer rates to soar with new vaccine laws in CA & NY?", "cleaned_text": "California, and perhaps soon New York, is facing a possible cancer epidemic of greater proportion than already exists. This is of major concern for all parents and children across the US because “as California goes, so goes the nation.” Bills are being introduced and signed throughout the United States that are removing your medical choice and informed consent. Starting in 2016, California will require all public school children to be injected with known cancer-causing ingredients in order to get an education. In New York, a similar bill has been introduced.\n\nIt’s the Children Who Are at Greatest Risk\n\nOn June 30, 2015, California Governor Jerry Brown signed the highly protested and opposed Senate Bill 277 (SB277). This bill condemns families and children to taking on the full risk of experimental and known carcinogenic vaccines, without legal recourse. New York is also attempting to follow in the footsteps of California with its Bill 6017-2015 that will remove the religious exemption from parents, the only barrier left between their children and unsafe vaccines.\n\nPerhaps the most obvious and heated point for families facing this medical assault is the fact that it is unknown if the vaccines being forced onto the children cause cancer. The actual vaccine paper inserts (or online PDF) for each vaccine states the following:\n\n“This vaccine has not been evaluated for its carcinogenic or mutagenic potentials or impairment of fertility.”\n\nYes, you read that correctly!\n\nWhat this means, legally and ethically, is that children being injected are part of a massive experiment. Furthermore, the National Childhood Vaccine Injury Act of 1986 gives vaccine manufacturers full legal protection from any medical complications or deaths that their vaccines cause. The settled science being used as political talking points to prove vaccines are safe and effective is actually a lie. Every vaccine contains a slew of toxic ingredients, or adjuvants, which are each carcinogenic in their own right.\n\nAluminum has long been known to be toxic to human beings. The documentary Age of Aluminum presents the inconvenient connections the metal has on the development of breast cancer, pancreatic cancer, and neurological disorders in the body. A 2011 study published in Molecular Carcinogenesis showed consistently elevated risks for pancreatic cancer in individuals working in the aluminum production and metalworking industries.\n\nA 2012 study published in the Journal of Applied Toxicology found that the effect of aluminum on cellular proliferation and cellular senescence is strikingly similar to that of activated oncogenes in human epithelial mammary tissue.\n\nGuess what? Aluminum is an ingredient in most vaccines.\n\nThe American Cancer Society and The National Cancer Institute both state unequivocally that exposure to formaldehyde causes cancer in humans and lab animals. According to the Centers for Disease Control’s (CDC) own website, formaldehyde is “known to cause cancer.” The website further states:\n\n“Formaldehyde exposure is a special concern for children and the elderly. Children may become sensitive to formaldehyde more easily, which may make it more likely they will become sick.”\n\nGuess what? Formaldehyde is an ingredient in most vaccines.\n\nAnother compound long known to be toxic, mercury causes degeneration and brain neuron damage. A study in the Scandinavian Journal of Work, Environment and Health concluded that methylmercury chloride causes kidney tumors in male mice and mercury chloride has shown some carcinogenic activity in male rats. The study also stated that epidemiological data points toward the possibility of a risk of lung, kidney, and central nervous system tumors.\n\nGuess what? Mercury is an ingredient in many vaccines.\n\nA Violation of First Amendment and Parental Rights\n\nForty-seven states currently allow the right for religious exemption to vaccines. The overwhelming majority of developed democracies in the world allow parents the final say in what is injected into their children’s bodies. This list includes Canada, Germany, Austria, Ireland, the UK, the Netherlands, Belgium, Sweden, Luxembourg, Denmark, Finland, Norway, Iceland, Japan, and others.\n\nThere are no public health reasons to support this bill. There is no evidence that religious exemptions in New York or anywhere are a barrier to achieving herd immunity, or increase disease rates. Senator Hoylman of New York is proposing a profound violation of First Amendment and parental rights. Senator Hoylman also has a bill in the Senate (S509) that would force all children in the state to get the human papilloma virus (HPV) vaccine.\n\nPlease share this important information with friends and family, and spread the word by posting on social networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cancer rates to soar with new vaccine laws in CA & NY?", "description": "TTAC is experiencing heavy censorship on many social media channels since we've been targeted by the mainstream media...Click to Keep Reading »", "url": "https://thetruthaboutcancer.com/cancer-rates-california-new-york/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Cancer Causes", "article:published_time": "2015-09-23T06:18:48-04:00", "article:modified_time": "2016-03-25T09:00:45-04:00", "updated_time": "2016-03-25T09:00:45-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20190125173027/California-NewYork.jpg", "image:width": "768", "image:height": "512"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutcancer.com/join-free/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Marcela"], "publish_date": "2015-09-23T06:18:48-04:00"}