{"result_id": "308014", "URL": "https://thetruthaboutcancer.com/sordid-history-vaccines-covid-19/", "timestamp": "2023-04-25 17:35:24 CEST+0200", "meta": {"description": "Before discussing the coronavirus vaccine, let’s quickly recap the history of vaccines & reasons that so many of us choose NOT to vaccinate.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/sordid-history-vaccines-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "The Sordid History of Vaccines & COVID-19", "cleaned_text": "Before discussing the coronavirus vaccine, let’s quickly recap the history of vaccines and the reasons that so many of us choose NOT to inject ourselves or our children.\n\nVaccines have long been touted as the medical “saviors” of the modern world. The eradication of diseases like smallpox and measles has largely been attributed to the “miracle” of vaccination.\n\nBut is that the truth?\n\nLet’s review the facts about measles and the MMR vaccine.\n\nFrom 1959-1962 – just before the vaccine was introduced – measles was fatal in only 0.01% of cases. And while the number of unvaccinated children has quadrupled since 2001, from 2000-2016 measles deaths decreased by 84%. But there are other factors at play when it comes to the dangers of measles.\n\nMalnutrition, especially vitamin A deficiency, is a primary cause of about 90,000 measles deaths annually in underdeveloped nations. In the U.S. and other developed countries, up to 92% of hospitalized measles patients are low in vitamin A. Better nutrition and hygiene may explain the decline in measles mortality even before the vaccine existed.\n\nAnd the numbers that are used to scare us into submission are not numbers that you can trust. About 90% of measles cases are benign and go unreported, meaning that reported cases of measles only constitute about 10% of all cases. Using reported cases to calculate mortality rates results in numbers that are artificially inflated by a factor of 10.\n\nOne of the biggest issues with vaccine safety is a lack of research. While most drugs spend months or even years in testing, vaccines can be approved in as little as a few days. There are no “true” placebo control groups, since each vaccine is tested against an older version of the same vaccine or another vaccine. And the side effects listed on the insert often contain all the same symptoms as the disease itself, making it impossible to prove efficacy.\n\nWhat may be worse is that each vaccine is still considered to be in a clinical stage, as adverse reactions continue to be reported and tracked after the vaccine is introduced. Most product inserts for vaccines have the following warning:\n\nNew vaccines are routinely tested against confirmed dangerous ones in order to arrive at what appear to be positive outcomes. Without a control group, these studies are incapable of accurately measuring the frequency and causal relationships of the vaccines they study.\n\nAdditionally, manufacturers in the U.S. are relieved of any liability for injury or death resulting from their products. Plaintiffs are not able to sue the manufacturer for damages but are instead required to go through the Vaccine Injury Compensation Program (VICP), in which victims end up suing their own government in a specially appointed court.\n\nThe lack of adequate studies makes it hard for plaintiffs to prove that vaccine manufacturers are at fault.\n\nAnd a 2011 Supreme Court decision has made it even harder.\n\nTwo hours after Hannah Bruesewitz received her six-month DPT vaccine in 1992, she started developing seizures and was hospitalized for weeks. Hannah continued to suffer from residual seizure disorder that required her to receive constant care.\n\nIn 1995, when Hannah was three-years-old, Russell and Robalee Bruesewitz filed a petition seeking compensation for her injuries. A few years later, in 1998, the Bruesewitz family filed a lawsuit against Wyeth Pharmaceuticals (the manufacturer of the DPT vaccine). They claimed the drug company failed to develop a safer vaccine and should be held accountable for preventable injuries caused by the vaccine’s defective design.\n\nThe US Supreme Court finally ruled in 2011.\n\nIn 2011 in a split decision in Bruesewitz v. Wyeth, the US Supreme Court majority ruled that vaccines are “unavoidably unsafe” and effectively removed all liability from drug companies, even if there was evidence a drug company could have made a vaccine safer. [U.S. Supreme Court. Bruesewitz v. Wyeth 09-152; Feb. 22, 2011. Justices Sotomayor and Ginsberg Dissenting (pg. 30)]\n\nIn other words, the court ruled that there is no way to make a “safe” vaccine. That would be sort of like making a “safe” nuclear weapon.\n\nAnd that brings us to the coronavirus vaccine.\n\nVaccination is germane to the COVID-19 issue because everyone is practically screaming for a new vaccine which will “magically” protect everyone from COVID-19. It is interesting to note that the reason there isn’t a vaccine for coronavirus on the market isn’t because researchers haven’t tried. It’s because their attempts have resulted in “vaccine enhancement, where instead of protecting against infection, the vaccine can actually make the disease worse when a vaccinated person is infected with the virus.” More on that topic in a moment.\n\nIn 2015, a patent was filed by The Pirbright Institute for the live, attenuated coronavirus. The application claims that the new virus could be used to create a vaccine for treating or preventing respiratory viruses. The patent was awarded in 2018.\n\nNow, The Pirbright Institute is funded by the UK Department for Environment, Food, and Rural Affairs, the WHO, and the Bill and Melinda Gates Foundation. All of these entities have been loud supporters of mandatory vaccinations and more government control based on “health concerns.”\n\nAnd for several years, Bill Gates has been telling us that a pandemic is coming, and in November of 2019, collaborating with the World Economic Forum, the Bill & Melinda Gates Foundation hosted “Event 201” where they ran a simulation of a coronavirus pandemic. Coincidence? Or part of a more sinister plan? We’ll let you decide.\n\nBut the push for the vaccine has even the staunchest vaccine advocates and scientists worried. Studies have suggested that coronavirus vaccines carry the risk of what is known as “vaccine enhancement,” where instead of protecting against infection, the vaccine can actually make the disease worse when a vaccinated person is infected with the virus. The mechanism that causes that risk is not fully understood and is one of the stumbling blocks that has prevented the successful development of a coronavirus vaccine.\n\nNormally, researchers would take months to test for the possibility of vaccine enhancement in animals. Given the urgency to stem the spread of the new coronavirus, some drug makers are moving straight into small-scale human tests, without waiting for the completion of such animal tests.\n\n“I understand the importance of accelerating timelines for vaccines in general, but from everything I know, this is not the vaccine to be doing it with,” Dr. Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine, told Reuters.\n\nHotez worked on the development of a vaccine for SARS, the coronavirus behind a major 2003 outbreak, and found that some vaccinated animals developed more severe disease compared with unvaccinated animals when they were exposed to the virus.\n\n“There is a risk of immune enhancement,” said Hotez. “The way you reduce that risk is first you show it does not occur in laboratory animals.”\n\nAnd yet, testing on human subjects has already begun. This week, the first patients in a clinical trial for a potential COVID-19 vaccine were given shots, marking a key step in the global race to find a cure. Kaiser Permanente Washington Research Institute in Seattle developed a COVID-19 vaccine in record time and started administering the shots on Monday.\n\nThe first person to receive a dose of the potential vaccine was 43-year-old Jennifer Haller, an operations manager at a small tech company, according to The Associated Press. “We all feel so helpless. This is an amazing opportunity for me to do something,” Haller said, adding that her two teenagers “think it’s cool” that she’s taking part in the study.\n\nIs it REALLY Cool?\n\nBut is it “cool” to put yourself in harm’s way so that pharmaceutical companies can expedite the rollout of a vaccine that may cause more harm than good? Is this “amazing opportunity” going to orphan her children?\n\nProfessor Jonathan Heeney, Head of the Laboratory of Viral Zoonotics at the University of Cambridge, and one of the people working on a vaccine, says that coronaviruses present a particular challenge to vaccine developers.\n\n“If you make antibodies against the spike, they can end up binding to it and helping the virus invade important immune cells known as monocyte-macrophages. Rather than destroying the virus, these cells can then end up being reprogrammed by the viruses, exacerbating the immune response and making the disease much, much worse than it would otherwise be.”\n\nThis phenomenon is well known, according to Heeney, but it could still slow down the development of a vaccine. “Researchers will want to be confident that their vaccine candidates are safe – that they don’t inadvertently make the disease worse – before they are tested in humans.”\n\nThe promise of a vaccine against Coronavirus is too far off to play a role in ending the deadly and economy- smashing effects of our response to COVID-19. The move to start human trials of COVID-19 vaccines without proper animal safety studies has prompted outcries.\n\nAs one of the leading proponents of vaccination, the man who infamously stated that babies can safely receive 100,000 vaccines at once, one would expect Dr. Paul Offit to go along with and promote the CDC-sponsored COVID-19 story of “impending apocalypse.” But Offit recently posted a statement on his Facebook page regarding this matter. His message is calm, rational, and reasonable.\n\nGiven the catastrophic outcomes in animal safety testing for the SARS coronavirus vaccine, we must understand that the current vaccine trials will likely fail. We must realize also that social distancing alone will be insufficient to bring a reasonably quick end to the need for social distancing and quarantine.\n\nEven if you support the use of vaccines to combat viral infections, you should be scared of this one. The rules are being broken, the safety protocols have been thrown out the window, and the mass hysteria caused by the coronavirus has led to reckless development of a drug that will likely be flawed and definitely be too late.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Sordid History of Vaccines & COVID-19", "description": "Before discussing the coronavirus vaccine, let's quickly recap the history of vaccines & reasons that so many of us choose NOT to vaccinate.", "url": "https://thetruthaboutcancer.com/sordid-history-vaccines-covid-19/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:tag": "monumentalmyths1", "article:section": "Featured Articles", "article:published_time": "2020-06-11T19:15:25-04:00", "article:modified_time": "2021-01-07T14:59:13-04:00", "updated_time": "2021-01-07T14:59:13-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20200611191408/TTAC-Fear_Lies-Part02-Featured.jpg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutcancer.com/fear-lies-covid-vaccine/", "https://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "https://thetruthaboutcancer.com/fear-lies-covid-vaccine/", "https://thetruthaboutcancer.com/covid-19-conspiracies-vaccines-bill-gates/", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Tom", "Guy", "Lisa Heatherly", "Lydia", "julie kolankowski Kolankowski", "Dave", "Helen Chapman", "Ted", "Martha Simmons", "Marie", "Stephen Hardy", "Allan G. Bartlett", "Roy Wood", "Admin", "Amitabha Kar", "Debra Barone", "Ala", "Peter clayton", "Urszula Kur", "Mary", "Domenique Hare", "BP", "Daniel", "Jean", "Anthony", "Cora", "Doug", "Leonard Mehlmauer, ND (ret.)", "Denys", "Jennifer Wall", "Ashton", "Kalyi Amoto", "Jeff", "Linda", "Andrew Hewett", "Ryan Coolbreeze", "Bethanie", "Mr Peter A SHUTTLEWORTH", "sally ashbaugh", "Ty Shlackman", "cal", "Robert", "Colleen Punt", "Rita", "Ginger Duncan", "DP", "Wondering Woman", "Silvia Logan", "Thelma Felix", "Leigh", "Lisa", "Leo", "Annie", "Jeff Mogul"], "publish_date": "2020-06-11T19:15:25-04:00"}