{"result_id": "308038", "URL": "https://thetruthaboutcancer.com/twitter-bans-truth-medical-freedom/", "timestamp": "2023-04-25 17:36:03 CEST+0200", "meta": {"description": "Without warning or reason, Twitter suspended all 3 of our Twitter platforms. We do not bully or troll people, we simply tell the truth.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/twitter-bans-truth-medical-freedom/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Twitter BANS the TRUTH about Vaccines & Medical Freedom", "cleaned_text": "Without warning or reason, Twitter suspended all 3 of our Twitter platforms — TTAC, TTAV, and CancerTruth.\n\nThe first of May, I logged into Twitter to check out what was happening and received a notification that all 3 of our Twitter accounts were suspended: @truthaboutbigc @cancertruthnews and @TTAVOfficial.\n\nThis was a SHOCK! We were not warned. We were not notified. We were simply banned in one moment across all 3 of our Twitter platforms. BOOM! Just like that. Gone!\n\nWe have been on Twitter for quite a few years and have never had a problem. We do not use vulgar language, we do not bully or troll people, we simply tell the truth. And for telling the truth, Twitter rewards us with suspension of our 3 Twitter accounts where we talk to you and reach the world with the truth about life-saving health solutions as well as infusing the world with encouragement and blessing.\n\nI guess there new policy is ZERO STRIKES and your OUT!\n\nWe are very concerned about the looming tyranny we are seeing more and more, day by day. We are concerned by the lies that are being propped up by these platforms and the MSM while at the same time putting a gag on our voice, and our freedom of speech.\n\nWhat are they hiding? And with whom are they working?\n\nClearly, people want to know the truth about vaccines, and millions of people watched the docu-series. So what is Twitter trying to hide by removing us from their platform?\n\nOur good friend, Erin Elizabeth, from Health Nut News tweeted about our TWITTER BAN as she was on the phone with me and it was breaking. Here is the tweet. It went viral! Many of you were very upset.\n\nShortly after Erin tweeted this breaking news about our Twitter ban, another good friend, Ed Szall from TruNews, contacted me for my official statement so they could include it in their daily news broadcast. Here is a link to that show. Start around the 21 minute mark to watch that segment.\n\nTy and I have been working for over 20 years to bring truth to the world – truth which we didn’t know about when our family was plundered by cancer. We have done years of research and are on a mission to educate and save lives through our books and films. For more background on who we are and what we do, you can click here to read.\n\nWe have had over 45 MILLION views on our videos/films which feature Dr Rashid Buttar, Dr Ed Group, Dr Stanislaw Burzynski, Robert F Kennedy Jr, Dr. Judy Mikovits, Sayer Ji, and other experts, leaders, and healers using their gifts and talents to help us tell the truth and save lives.\n\nHere is our list of social media censorship issues we have endured since we started making our films:\n\nPinterest was the first platform to de-platform our channel (which was large) because we told the truth about vaccines.\n\nGoogle has deplatformed our main website: www.thetruthaboutcancer.com So when you search for our names or The Truth About Cancer you will not find our website, rather you will find articles filled with lies written by Big Pharma shills, or you will find our content published on someone else’s website. But you will not find what used to be there – hundreds of articles and dozens of indexed pages of content from our website. We noticed this happen last summer when our organic traffic from Google decreased by over 90%.\n\nFacebook is actively and openingly censoring The Truth About Vaccines Docu-Series Facebook page because we tell the truth about vaccines. So when you search for the title of TTAV docu-series FB letter for letter, your search results will deliver the W.H.O., The Gates Foundation, the CDC, and other vaccine pushers. Clearly this is on purpose. They have also cut our deliverability to our followers down to almost nothing. They openly tell us because we are telling the truth about vaccines, they will no longer deliver our posts to our followers’ newsfeeds.\n\nThey also censor The Truth About Cancer FB. And they have cut down our original FB page, CancerTruth, to where I have watched them delete followers numbers and the numbers went from going viral to nothing at all.\n\nTwitter just hit us hard 2 days ago by suspending all 3 of our Twitter accounts, @truthaboutbigc @cancertruthnews @TTAVOfficial Twitter gave us no warning or reason. They just cut us off their platform completely.\n\nWe have since hired an attorney to help us appeal this Twitter ban and are asking Twitter to reinstate our 3 accounts.\n\nUpon releasing our blockbuster docu-series, The Truth About Vaccines 2020, we have had an outpouring of people that watched and are waking up from around the world that are asking us to bring our film to the POTUS and the White House team. We have a whole host of followers and viewers from around the world who believe in President Trump and feel if he watched the film, then perhaps together we can stop the Big Pharma push to force vaccinate everyone.\n\nWe have been so successful at helping people understand the issues and problems behind vaccinations and the conventional medical monopoly through our films that ‘Big Tech’ has clearly stepped in and is now actively censored our voice. We believe there is an agenda that is not for “We The People” and see an intentional unconstitutional push to silence the truth and force their dark and harmful agenda. And we believe these people are working at achieving their agenda by silencing all whistleblowers, freedom fighters, and heroes in our movement.\n\nCurrently we see Dr. Judy Mikovits telling the truth and being censored for doing so. YouTube is purging it’s platform of high quality videos featuring exposing the truth, including our good friend, Dr Rashid Buttar’s videos warning the viewer that the “fox is guarding the henhouse.” Some of these videos have had up to 6 million views in only a few days time.\n\nTwitter is currently purging it’s platform of Patriots and lovers of freedom, lovers of POTUS, and people telling the truth about vaccines that are tweeting about our films.\n\nWith all this censorship, we are more than hopeful that together and united we are very strong and can overcome this push toward medical tyranny and domination over the people. We believe that we can restore this great Republic.\n\nAs long as God gives us breath, we will continue to spend our lives and our energy fighting for the freedom and goodness of America and everyone in it.\n\nIt is our hope that together we can work to overcome all censorship and restore America to what our Founders intended for it to be, a free society, under God.\n\nMore to come on this big censorship problem. We have solutions and we need your help to bring those solutions to the people of the world! So stay tuned.\n\nUntil next time… be encouraged and keep sharing the truth! Because it’s the TRUTH that sets us FREE!", "opengraph": {"locale": "en_US", "type": "article", "title": "Twitter BANS the TRUTH about Vaccines & Medical Freedom", "description": "Without warning or reason, Twitter suspended all 3 of our Twitter platforms. We do not bully or troll people, we simply tell the truth.", "url": "https://thetruthaboutcancer.com/twitter-bans-truth-medical-freedom/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:tag": "monumentalmyths1", "article:section": "Uncategorized", "article:published_time": "2020-05-09T11:44:46-04:00", "article:modified_time": "2020-05-19T17:51:47-04:00", "updated_time": "2020-05-19T17:51:47-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20200509114113/Twitter-BAN-FINAL.jpg", "image:width": "1000", "image:height": "523"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" style=\"text-align: center;\">Breaking. The truth about cancer, the truth about vaccines and Ty and Charlene Bollinger pages have all been taken down off Twitter. They have been suspended. account suspended. I just hung up with Charlene.</p><p style=\"text-align: center;\">— Erin Elizabeth Health Nut News (@unhealthytruth) <a href=\"https://twitter.com/unhealthytruth/status/1257733988397068288?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">May 5, 2020</a></p></blockquote>"], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://twitter.com/truthaboutbigc", "https://twitter.com/CancerTruthNews", "https://twitter.com/TTAVOfficial", "https://twitter.com/unhealthytruth/status/1257733988397068288?ref_src=twsrc%5Etfw", "https://www.trunews.com/stream/corona-creeps-crush-free-speech-and-free-enterprise", "http://www.thetruthaboutcancer.com/about", "http://www.thetruthaboutcancer.com", "https://www.facebook.com/ttavdocuseries/", "https://www.facebook.com/thetruthaboutcancer/", "https://twitter.com/truthaboutbigc", "https://twitter.com/CancerTruthNews", "https://twitter.com/TTAVOfficial", "https://youtu.be/cHWeJ0f_o3A", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Denise", "Judy + Mark Harvey", "Benay Irwin", "Carri", "Joyce Moore", "Kate Townsend", "Karen Beckman", "David Sorensen", "Lori", "Tine", "Glo Burch", "Dan Mihaita", "Jan Clifford", "Sharon Carthy", "Jan", "Deanna Wu", "Patricia", "Susie", "Nicole Boar", "Rachel", "Annie Stolberg", "Carol N.", "Nancy Callanan", "Doreen", "Diana", "Mr Peter A SHUTTLEWORTH", "kim", "Dave Springer", "Stan", "Robert", "carrie lundberg", "Scotty Mortimer", "Susan Cenkner", "Susan Cameron", "Tom", "Dorothea M Macdonald", "heidi baruch", "Pamela Wojahn", "Gary Paul", "Fiona", "Jessica Woods", "Lorraine Ho", "Marc", "John Chalmers", "Cynthia Strachan", "Reg Kidd", "Manuela", "Lisa M Pruitt", "Marilyn Bodnar", "Laurel Hills", "Joyce", "Megan A. Townsend", "Rei", "Carucci Adenaide", "Pamela", "Zoe", "Richard A Huntoon", "Odelia Tan", "Patti Booth", "Lynne Russillo", "Elaine", "Karen Kline", "Tone", "Sherry", "David d'Albany", "Art", "John", "Heidi", "Carmen", "Jeff Weiss", "Patricia Lund", "Mark Fox", "James", "David Reiter", "Karen", "Christy", "Wendy", "james Reeves", "Bobby Childree", "Stewart Rosen", "Annelies Brink", "lianne boyd", "Arlys", "Cindy Dahlen", "Bill", "Linda", "Lori Carey", "phil", "Gary c richardson", "Gerald George", "Rita", "Silvia Logan", "Christine Battista", "HOWARD KINKAID", "Cheryl Galasso", "Danielle Calhoon", "Michael", "Susan", "Maureen", "Fernando Campos Wirth", "Ross Windust", "Shannon", "martin godden", "Lynn", "Melissa Bever", "Mark Makinney", "Bob Walker", "Donovan", "Susan Gage", "Stuart Knaggs", "RUFUS MIDDLETON", "Josephine", "richard", "Douglas MacKay", "Dr Richard Marcello", "Sharon W", "Debbie Guidi", "Michelle Anderson", "Jill Rogers", "Karen Jensen", "Wayne", "Glo", "Irene", "Kathy", "Peter", "Gail Hurlbert"], "publish_date": "2020-05-09T11:44:46-04:00"}