{"result_id": "308024", "URL": "https://thetruthaboutcancer.com/white-house-colluded-twitter/", "timestamp": "2023-04-25 17:35:44 CEST+0200", "meta": {"description": "Biden officials sought to censor tweets by Robert F. Kennedy, Jr., chairman of Children’s Health Defense, and others.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/white-house-colluded-twitter/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "White House Colluded With Twitter to Censor RFK, Jr., Emails Reveal", "cleaned_text": "A series of Jan. 6 tweets by newly sworn-in Missouri Attorney General Andrew Bailey detailed how Biden officials sought to censor tweets by Robert F. Kennedy, Jr., chairman and chief litigation counsel of Children’s Health Defense (CHD), conservative commentator Tucker Carlson and others.\n\nCiting documents and emails between social media employees and White House officials, Bailey exposed how the White House sought to censor Kennedy for a tweet questioning “suspicious” deaths of elderly individuals after receiving the COVID-19 vaccine and seeking a good faith investigation into the true causes of the deaths.\n\nThe White House specifically targeted Kennedy’s Jan. 22, 2021, tweet about the then-recent death of baseball Hall of Famer Hank Aaron, 18 days after he publicly received the Moderna vaccine.\n\nLouisiana Attorney General Jeff Landry on Jan. 7 also weighed in on Twitter about efforts to censor Kennedy on Facebook:\n\nKennedy responded on Jan. 7 with this pair of tweets:\n\nIn a press release issued today, Landry said, “Government censorship is bipartisan; if they don’t like you, they will censor you — regardless of your political affiliation. No one is safe when the First Amendment is violated.”\n\nMissouri and Louisiana in May 2022 sued President Biden, Dr. Anthony Fauci and other Biden administration officials, alleging they violated the First Amendment by colluding with social media platforms to censor COVID-19-related content and content related to the 2020 U.S. presidential elections that contradicted the official government narrative.\n\n“Throughout our case, we have uncovered disturbing collusion between Big Tech and Big Government,” added Landry. “Today’s reveal is yet another example of the ongoing coercive efforts by the White House to pressure social media companies into censoring American citizens.”\n\nLegal experts familiar with the ongoing Louisiana and Missouri lawsuit told The Defender that Biden administration and federal government officials have until now claimed during their depositions that they never explicitly directed social media companies to remove content.\n\nInstead, they claimed the government provided these platforms with “the science,” with no expectation, partnership or knowledge of what they would do with it.\n\nAccording to legal experts, Meta claimed Kennedy and CHD were never targeted by name in the federal government’s communications with the platform.\n\nHowever, Bailey cited an email showing government officials clearly called for the removal of Kennedy’s tweet about Hank Aaron’s death.\n\nOver a span of nine tweets posted Jan. 6, Bailey revealed several emails and documents showing how Biden officials tried to censor social media content that opposed the government’s COVID-19 narrative.\n\n“When I took office, I swore that I would protect the Constitution. Here’s why,” Bailey tweeted. He followed up with this tweet:\n\nThe first example Bailey used to demonstrate collusion pertained to Kennedy:\n\nThe tweet was accompanied by a screenshot of a Jan. 23, 2021, email by White House official Clarke Humphrey, digital director for the White House’s COVID-19 Response Team, to unidentified individuals at Twitter and copied to Robert Flaherty, White House director of Digital Strategy.\n\nIn the message, Humphrey “wanted to flag the below tweet” and asked about “the process for having it removed ASAP.”\n\nSpecifically, what Humphrey “flagged” in her email was a tweet by Kennedy from Jan. 22, 2021, addressing the death of baseball great Hank Aaron just days after he received the Moderna COVID-19 vaccine.\n\nKennedy’s tweet was accompanied by a link to a story about Aaron’s death published on Jan. 22, 2021, by The Defender.\n\nHumphrey, in the same email, also suggested “we keep an eye out for tweets that fall in this same ~[general] genre,” adding that this “would be great.”\n\nWhen questions arose about Aaron’s death following his COVID-19 vaccination, the federal government and the media sought to quash that conversation, Kennedy told The Defender.\n\n“The White House was working to suppress this, and the implication is that they didn’t want Blacks in particular to understand the risks of vaccination. And so, they asked Twitter to suppress such content.\n\n“At that point, it became clear that I was being shadow banned at that time, because my account simply stopped growing. Instagram, Facebook and Twitter. And I had been growing my audience at a very, very high rate.”\n\nA Jan. 31, 2021, “fact check” by The New York Times claimed that the Fulton County, Georgia, medical examiner determined Aaron’s death was not related to his vaccination.\n\nHowever, Kennedy said that in a conversation he had with the Fulton County medical examiner subsequent to the publication of that article, the medical examiner claimed he had never examined Hank Aaron’s body. A subsequent letter Kennedy wrote to the Times was never published.\n\n“They never printed that letter,” said Kennedy. “They’ve abolished the traditional right to reply. They always gave you a right to reply and they have denied that to me consistently. Apparently, at the same time, the White House was working to suppress this.”\n\nTucker Carlson and others also targeted by the Biden administration\n\nBailey and Landry also cited documents confirming “the Biden White House direct[ed] Facebook to shut down conservative voices Tucker Carlson and Tomi Lahren.”\n\nThis tweet was accompanied by an April 14, 2021, email exchange between Flaherty and an unnamed Facebook official in which Flaherty appeared to suggest the platform was not doing enough to provide “reduction” to posts by these two personalities.\n\n“Since we’ve been on the phone — the top post about vaccines today is Tucker Carlson saying they don’t work. Yesterday was Tomi Lehren [sic] saying she won’t take one.\n\n“This is exactly why I want to know what ‘Reduction’ actually looks like — if ‘reduction’ means ‘pumping our most vaccine hesitant audience with Tucker Carlson saying it doesn’t work’ then … I’m not sure it’s reduction!”\n\nThe Facebook official responded, “Thanks — I saw the same thing when we hung up. Running this down now.”\n\nIn a tweet, Landry then shared this content, adding, “Rob Flaherty told Facebook to censor @tuckercarlson.”\n\nHowever, Landry’s tweet included one additional document, apparently a continuation of the April 14, 2021, email exchange between the White House and Facebook, in which the Facebook official was “working on…running down question on Tucker [Carlson] and working on getting you report [sic] by end of week.”\n\nIn a follow-up tweet, Landry described the above exchange as a “clear effort at government-directed social media censorship,” and tagged Elon Musk.\n\nAnd in two more follow-ups, Landry stated:\n\n“A viral video was demoted 50% pending a 7-day fact checking period. That demotion continued by Facebook even though no ‘fact checking’ actually occurred. Follow [this account] for more coercive and collusive efforts by the @WhiteHouse to pressure @Facebook to censor @TuckerCarlson.”\n\nLandry said, “Facebook continued to demote the Tucker Carlson video even though no fact checking actually occurred.”\n\nIn another tweet, Bailey wrote, “Here is an example of Big Tech toeing the line for Biden.”\n\nThe tweet was accompanied by a July 20, 2021, email from an unnamed Google official to Flaherty, explaining how YouTube (which is owned by Google) was working to limit the distribution of “borderline content” on that platform, stating:\n\n“It is important to keep in mind that borderline content accounts for a fraction of 1% of what is watched on YouTube in the United States. We use machine learning to reduce the recommendations of this type of content, including potentially harmful misinformation.\n\n“In January 2019, we announced changes to our recommendations systems to limit the spread of this type of content which resulted in a 70% drop in watchtime on non-subscribed recommended content in the U.S. and our goal is to have views of non-subscribed, recommended borderline content below 0.5%.\n\n“I will keep you updated with any new policy or product improvements that we make as we continue our work to help people find authoritative health information on YouTube.”\n\nThe tweet referenced an April 9, 2021, email from Flaherty to an official at Facebook, writing in part:\n\n“Will say I’m really mostly interested in what effects the interventions and products you’ve tested have had on increasing vaccine interest within hesitant communities, and which ones have shown promise.\n\n“Really couldn’t care less about products unless they’re having measurable impact. And while the product safari has been interesting, at the end of the day, I care mostly about what actions and changes you’re making to ensure sure [sic] you’re not making our country’s vaccine hesitancy problem worse.\n\n“I definitely have what I believe to be a non-comprehensive list of products you’re building but I still don’t have a good, empirical answer on how effective you’ve been at reducing the spread of vaccine-skeptical content and misinformation to vaccine fence sitters in the now-folded ‘lockdown.’”\n\nBailey also tweeted “evidence that this scheme starts ‘at the highest (and I mean highest) levels of the WH [White House].’”\n\nAn April 22, 2021, email from Flaherty to seven Google officials, on which Humphrey and former White House COVID-19 adviser Andrew Slavitt were copied, was attached, where Flaherty wrote:\n\n“All — Thanks again for the conversation today.\n\n“To recap: As we move away from a supply problem toward a demand problem [apparently referencing the COVID-19 vaccines], we remain concerned that Youtube is ‘funneling’ people into hesitance and intensifying people’s hesitancy.\n\n“We certainly recognize that removing content that is unfavorable to the cause of increasing vaccine adoption is not a realistic — or even good — solution. But we want to be sure that you have a handle on vaccine hesitancy generally and are working toward making the problem better.\n\n“This is a concern that is shared at the highest (and I mean highest) levels of the WH, so we’d like to continue a good-faith dialogue about what is going on under the hood here.”\n\nBailey concluded his Twitter thread with this:\n\nMeta promised to use ‘a spectrum of levers’ to limit distribution and reach of ‘vaccine hesitancy’ content\n\nIn another Jan. 6 tweet, Bailey said, “Here’s more collusion,” and showed a screenshot of a “confidential” document from Meta — the parent company of Facebook — that was apparently directed at the White House.\n\nIn this document, Meta provided a screenshot of a link posted on Facebook to a Feb. 11, 2021, article critical of COVID-19 vaccines that appeared in The Defender.\n\nHighlighting this as a “vaccine hesitancy example,” Meta’s memo stated, in part:\n\n“The following examples of content are those that do not violate our Misinformation and Harm policy, but may contribute to vaccine hesitancy or present a barrier to vaccination.\n\n“We utilize a spectrum of levers for this kind of content that is both proportionate and also helps our users make informed decisions. Actions may include reducing the posts’ distribution, not suggesting the posts to users, limiting their discoverability in Search, and applying Inform Labels and/or reshare friction to the posts.”\n\nIn other words, Meta appeared to tell the White House that while it could not identify a pretext to delete this particular content, it could nevertheless employ “a spectrum of levers” to limit its distribution and reach.\n\nThis was further confirmed by Landry in a Jan. 7 retweet of the Meta memo:\n\nMore legal action coming as pressure on Twitter grows\n\nCharlene Bollinger, co-founder of The Truth About Vaccines and The Truth About Cancer, remarked on these revelations, telling The Defender that if content questioning official narratives regarding the COVID-19 vaccines were not censored, “millions of people would still be alive today.”\n\nBollinger, who told The Defender that four Twitter accounts she was affiliated with, including the accounts for The Truth About Vaccines, The Truth About Cancer and the United Medical Freedom SuperPAC (political action committee) were taken down by Twitter, describing such actions as “a crime against humanity” which “has got to stop.”\n\n“I am grateful for the attorney generals and the Twitter files coming out [with such content], which proves we were right,” she added.\n\nBollinger, along with Kennedy, Dr. Joseph Mercola and others were identified by the “Center for Countering Digital Hate” (CCDH) as being part of the so-called “Disinformation Dozen.” Bollinger has called upon Twitter owner and CEO Elon Musk to reinstate her accounts and others belonging to the “Disinformation Dozen.”\n\nDescribed by Mercola as “a progressive cancel-culture leader,” CCDH has “extensive ties to government and global think tanks that has labeled questioning the COVID-19 injection as ‘threats to national security.’”\n\nOfficials including Fauci, former White House “disinformation” head Nina Jankowicz, Surgeon General Vivek Murthy, and White House Press Secretary Karine Jean-Pierre have been subpoenaed in the ongoing Louisiana and Missouri lawsuit.\n\nFauci, as well as FBI Supervisory Special Agent Elvis Chan — who is also heavily implicated in the “Twitter files” — and other Biden administration officials, have already been deposed, while the scheduled deposition of former White House press secretary Jen Psaki was blocked last week by the 5th Circuit U.S. Court of Appeals.\n\nRecently released “Twitter files” have provided further evidence of collusion between the Biden administration, federal entities including intelligence agencies and Twitter. Further releases of “Twitter files” are widely expected in the coming days, including the release of the so-called “Fauci files.”\n\nThe Epoch Times reports that House Republicans, who now hold a majority in the chamber, have pledged to investigate collusion between the federal government and private companies, including social media platforms, and the establishment of a subcommittee investigating the “weaponization” of the federal government.\n\nThis committee will reportedly be chaired by Rep. Jim Jordan (R-Ohio).\n\nKennedy referenced other ongoing and forthcoming legal cases on related matters, on his part and from CHD, telling The Defender:\n\n“We are already involved in a number of First Amendment cases. We’re involved in the litigation against Facebook on behalf of CHD. I personally am suing Elizabeth Warren. We’re about to file an antitrust suit against the Trusted News Initiative, which includes all of the social media sites.\n\n“And [these new revelations] open up new claims, new opportunities. This is the government and the White House directly. We’re reviewing that right now, as public officials are not allowed to censor.”", "opengraph": {"locale": "en_US", "type": "article", "title": "White House Colluded With Twitter to Censor RFK, Jr., Emails Reveal", "description": "Biden officials sought to censor tweets by Robert F. Kennedy, Jr., chairman of Children's Health Defense, and others.", "url": "https://thetruthaboutcancer.com/white-house-colluded-twitter/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2023-01-10T00:01:48-04:00", "article:modified_time": "2023-01-10T12:48:09-04:00", "updated_time": "2023-01-10T12:48:09-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230110124744/white-house-censorship-twitter-rfk-jr-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://childrenshealthdefense.org/defender/white-house-censorship-twitter-rfk-jr/", "https://twitter.com/AGAndrewBailey/status/1611568518612254722", "https://childrenshealthdefense.org/defender_category/covid/", "https://twitter.com/robertkennedyjr/status/1352748139665645569", "https://agjefflandry.com/Article/13106", "https://nclalegal.org/state-of-missouri-ex-rel-schmitt-et-al-v-biden-et-al/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804/ref=sr_1_1", "https://childrenshealthdefense.org/defender_category/big-tech/", "https://twitter.com/AGAndrewBailey/status/1611568518612254722", "https://www.linkedin.com/in/clarke-humphrey-02212166/", "https://twitter.com/robertkennedyjr/status/1352748139665645569", "https://childrenshealthdefense.org/defender/hank-aaron-dies-days-after-receiving-moderna-vaccine/", "https://www.nytimes.com/2021/01/31/us/hank-aaron-death-covid-vaccine.html", "https://childrenshealthdefense.org/defender/national-media-vaccine-misinformation-hank-aaron/", "https://twitter.com/JeffLandry/status/1611730209203720192", "https://twitter.com/AGJeffLandry/status/1611512252837814272", "https://twitter.com/AGJeffLandry/status/1612434722126176256", "https://twitter.com/AGJeffLandry/status/1612436578097324032", "https://twitter.com/AGAndrewBailey/status/1611568546030522370", "https://twitter.com/AGAndrewBailey/status/1611568570663682050", "https://twitter.com/AGAndrewBailey/status/1611568554188349441", "https://childrenshealthdefense.org/defender/potential-covid-vaccine-related-ticking-time-bomb/", "https://thetruthaboutvaccines.com/", "https://thetruthaboutcancer.com/", "https://www.counterhate.com/disinformationdozen", "https://twitter.com/charlis_beauty/status/1609718555238404096", "https://media.mercola.com/ImageServer/Public/2021/October/PDF/vaccine-fact-checkers-pdf.pdf", "https://off-guardian.org/2020/08/11/ccdh-the-centre-for-cancel-culture-and-digital-hypocrisy-part-1/", "https://www.thegatewaypundit.com/2023/01/newly-discovered-emails-mo-la-government-lawsuit-reveal-biden-regime-pressured-facebook-censor-tucker-carlson/", "https://childrenshealthdefense.org/defender/elon-musk-twitter-files-fbi-censorship/", "https://nclalegal.org/state-of-missouri-ex-rel-schmitt-et-al-v-biden-et-al/", "https://www.thegatewaypundit.com/2023/01/rogue-panel-appellate-judges-steps-blocks-jen-psakis-deposition-missouri-louisiana-lawsuit-protect-biden-regime/", "https://childrenshealthdefense.org/defender/twitter-files-elon-musk-suspend-accounts-journalists/", "https://www.theepochtimes.com/mkt_app/white-house-pushed-facebook-to-censor-tucker-carlson-on-covid-19-vaccines-ag-landry_4968830.html", "https://www.thegatewaypundit.com/2023/01/huge-conservative-hero-jim-jordan-will-chair-weaponization-government-select-committee/", "https://live.childrenshealthdefense.org/chd-tv/events/rfk-v-warren-hearing-oral-arguments/", "https://www.bbc.com/mediacentre/2020/trusted-news-initiative-vaccine-disinformation", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": [], "publish_date": "2023-01-10T00:01:48-04:00"}