{"result_id": "308035", "URL": "https://thetruthaboutcancer.com/biden-orders-sweeping-unprecedented-vaccine-mandates/", "timestamp": "2023-04-25 17:36:01 CEST+0200", "meta": {"description": "President Biden announced vaccine mandates for all federal contractors, healthcare workers and businesses with more than 100 employees", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/biden-orders-sweeping-unprecedented-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Biden Orders 'Sweeping,' 'Unprecedented' Vaccine Mandates for Millions of Americans, Politicians Vow to Fight Back", "cleaned_text": "In his most forceful move yet, President Biden on Thursday ordered sweeping new federal COVID vaccine requirements for as many as 100 million Americans — including private sector employees, healthcare workers and federal contractors — threatening thousands in fines for businesses that do not comply.\n\nIn his speech, Biden made no exception for the millions of Americans with natural immunity, and did not mention exemptions for those with medical conditions or sincerely held religious beliefs — as White House Press Secretary Jen Psaki in a Wednesday press briefing had suggested would be the case.\n\nSpeaking at the White House, Biden sharply criticized millions of Americans who remain unvaccinated, despite months of availability and incentives.\n\n“We’ve been patient. But our patience is wearing thin, and your refusal has cost all of us,” Biden said. The unvaccinated minority “can cause a lot of damage, and they are.”\n\nAccording to the Associated Press (AP), Biden’s latest move is driven at least in part by self-interest, as he tries to defend his own job performance on the issue most important to voters.\n\nThe resurgence of the virus has sent Biden’s poll numbers to the lowest point yet of his presidency, AP reported. An AP-NORC poll conducted in August found 54% of Americans approved of Biden’s stewardship of the pandemic, down from 66% the month before, driven by a drop in support among Republicans and political independents.\n\nBiden announced the U.S. Department of Labor’s Occupational Safety and Health Administration (OSHA) is developing an emergency rule to require all employers with 100 or more employees that together employ more than 80 million workers to ensure their workforces are fully vaccinated or show a negative test at least once a week.\n\nOSHA will issue an Emergency Temporary Standard to introduce the vaccine requirement. Companies that fail to comply could face fines of $14,000 per violation, Biden said.\n\nBiden noted many large companies already require vaccinations. “The bottom line — we’re going to protect vaccinated workers from unvaccinated coworkers,” he said.\n\nThe expansive rules also mandate that roughly 17 million workers at health facilities that receive federal Medicare or Medicaid get fully vaccinated, and require vaccination for employees of the executive branch and contractors who do business with the federal government — with no option to test out, AP reported.\n\nThe U.S. Department of Health and Human Services will separately require vaccinations in Head Start Programs, as well as schools run by the U.S. Department of Defense and Bureau of Indian Education, affecting about 300,000 employees.\n\nAlthough Psaki said Wednesday Biden’s order for executive branch workers and contractors includes exceptions for workers seeking religious or medical exemptions from vaccination, federal workers who don’t comply will be referred to their agencies’ human resources departments for counseling and discipline, to include potential termination.\n\nAs part of the plan, Biden also called on large entertainment venues to require proof of vaccination or testing for entry, and required employers to give their employees paid time off to get vaccinated.\n\nIn addition to vaccination mandates, Biden plans to double federal fines for airline passengers who refuse to wear masks on flights or to maintain face covering requirements on federal property, in accordance with Centers for Disease Control and Prevention (CDC) guidelines.\n\nThe new rules amount to the most dramatic steps to date to get more Americans vaccinated. Once cautious of vaccine mandates, the Biden administration is now wholly embracing them, CNN reported.\n\nAdministration officials acknowledged the requirement for large employers could be challenged in court. But they said their hope was that federal rules would provide legal cover for businesses that want to require vaccines for employees.\n\nChildren’s Health Defense Chairman Robert F. Kennedy, Jr. called out Dr. Anthony Fauci for his role in Biden’s plan.\n\n“Anthony Fauci’s vaccine-centric policies have given America more COVID deaths and cases than any other nation,” Kennedy said. “With 4.2% of the global population, America has suffered 14.5% of all COVID deaths.”\n\nInstead of firing Fauci, Kennedy said, Biden is “doubling down on his failed policies by trying to coerce Americans into taking a shot that doesn’t work and might injure or kill them.”\n\nKennedy said Biden’s admonition that we must “trust the expert” has become a substitute for scientific literacy and common sense and a gateway to tyranny.\n\n“His move to force universal obedience with an unwanted, ineffective and potentially dangerous medical intervention is anti science, anti-democratic and anti American,” Kennedy said.\n\n“Americans don’t respond well to coercion. The White House crusade to silence debate and censor critics of this disastrous policy has further transformed bad policy into an attack on our fundamental values. It is therefore bound to further divide a dangerously polarized nation.”\n\nTexas Gov. Greg Abbott blasted Biden on Thursday after he ordered large employers to require COVID vaccines or get frequent testing, the Texas Tribune reported.\n\nAbbott, who has resisted making vaccinations mandatory in any form in Texas, dubbed Biden’s move a “power grab,” and said Texas is already working to halt it.\n\nShortly after the announcement, Missouri Gov. Mike Parson tweeted a statement that read, “this heavy-handed action by the federal government is unwelcome in our state and has potentially dangerous consequences for working families.”\n\nIn another tweet, Parson said his administration “will always fight back against federal power grabs and government overreach that threatens to limit our freedoms.”\n\nMissouri Attorney General and Republican Senate candidate Eric Schmitt called the mandate an overreach and said it “will not stand in Missouri.”\n\n“This is exactly the kind of big government overreach we have tried so hard to prevent in Arizona — now the Biden-Harris administration is hammering down on private businesses and individual freedoms in an unprecedented and dangerous way,” Ducey wrote in a tweet. “This will never stand up in court.”\n\n“This dictatorial approach is wrong, un-American and will do far more harm than good,” Ducey added in another tweet. “How many workers will be displaced? How many kids kept out of classrooms? How many businesses fined? The vaccine is and should be a choice. We must and will push back.”\n\nSouth Dakota Gov. Kristi Noem said her state is ready to hold the Biden administration legally responsible for the “unconstitutional rule.”\n\n“My legal team is standing by ready to file our lawsuit the minute @joebiden files his unconstitutional rule,” Noem wrote in a tweet. “This gross example of federal intrusion will not stand.”\n\n“This is unconstitutional,” said Rep. Robert Aderholt (R-Ala.) “The U.S. Constitution does not give the president this type of authority. No where in Article 2 of the Constitution will you find anything that even remotely gives the president this kind of power.”\n\n“This is blatantly unconstitutional. The decision to get vaccinated lies between you and your doctor – NOT the federal government. We must fight back against medical tyranny that dangerously violates Americans’ individual freedoms.”\n\nSen. Rand Paul (R-Ky), a physician, said in a tweet, “vaccine mandates that ignore natural immunity ignore the science, are unscientific and should not be adhered to or promulgated by the government.”\n\nIn a statement to Fox News, Rep.Greg Murphy (R-NC), a practicing physician member of the GOP Doctors Caucus, said he is against government vaccine mandates, saying the decision should be made by patients who have consulted with their doctors.\n\n“As I have repeatedly said, the decision about whether or not to take the COVID-19 vaccine, like every other medical decision, is one that should be made between a patient and a doctor,” Murphy said. “The government does not know what is best for each patient, nor do they have the authority to dictate patient-doctor healthcare decisions.”\n\nMore than 177 million Americans (53%) are fully vaccinated against COVID, but confirmed cases have shot up in recent weeks to an average of about 140,000 per day, despite vaccination, according to data from the CDC.\n\nLast month Biden announced plans to make boosters available beginning Sept. 20, even though the U.S. Food and Drug Administration (FDA) had not approved a third dose for the general population.\n\nFederal officials are moving ahead with plans to begin administering booster shots of mRNA vaccines — a decision that created tension between the FDA, CDC and Biden administration and led to two top FDA officials announcing their resignations.\n\nThe FDA is scheduled to hold an advisory meeting Sept. 17 to discuss approval of boosters, just three days before the roll-out is set to begin. Only the Pfizer vaccine will likely have received regulatory approval for a third dose by that time.", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden Orders 'Sweeping,' 'Unprecedented' Vaccine Mandates for Millions of Americans, Politicians Vow to Fight Back", "description": "President Biden announced vaccine mandates for all federal contractors, healthcare workers and businesses with more than 100 employees", "url": "https://thetruthaboutcancer.com/biden-orders-sweeping-unprecedented-vaccine-mandates/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Global Health News", "article:published_time": "2021-09-11T19:47:31-04:00", "article:modified_time": "2021-09-11T19:48:37-04:00", "updated_time": "2021-09-11T19:48:37-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210911194151/Biden-orders-sweeping-vaccine-mandates-feature-1-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://childrenshealthdefense.org/defender/biden-vaccine-mandates-politicians-fight-back", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://www.whitehouse.gov/covidplan/", "https://www.nytimes.com/2021/09/09/us/politics/biden-vaccine-mandates-transcript.html", "https://childrenshealthdefense.org/defender/fully-vaccinated-pfizer-more-likely-get-delta-than-natural-immunity/", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/09/09/press-briefing-by-press-secretary-jen-psaki-september-9-2021/", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://childrenshealthdefense.org/defender/ohio-offers-college-scholarships-entice-people-get-vaccinated/", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-economy-e23b46e3bcc5c1110ece87fb7d63974d", "https://www.cbsnews.com/live-updates/biden-covid-19-vaccine-mandate-live-stream-today-2021-09-09/", "https://www.osha.gov/", "https://childrenshealthdefense.org/defender/biden-federal-workers-must-get-vaccine-regular-testing/", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/09/09/press-briefing-by-press-secretary-jen-psaki-september-9-2021/", "https://www.whitehouse.gov/covidplan/", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://www.cnn.com/2021/09/09/politics/joe-biden-covid-speech/index.html", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/robert-f-kennedy-jr-book-the-real-anthony-fauci/", "https://www.worldometers.info/world-population/us-population/", "https://en.wikipedia.org/wiki/Template:COVID-19_pandemic_data", "https://childrenshealthdefense.org/defender/cdc-stopped-tracking-breakthrough-covid-infections-vaccinated/", "https://childrenshealthdefense.org/defender/vaers-cdc-injuries-reported-covid-vaccines-fda-boosters/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.texastribune.org/2021/09/09/vaccine-mandate-greg-abbott-joe-biden/", "https://twitter.com/GovParsonMO/status/1436091504615845914?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1436091504615845914%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.ksdk.com%2Farticle%2Fnews%2Fpolitics%2Fparson-republican-officials-against-biden-vaccine-mandate%2F63-d58c1067-e5c9-4578-b457-4e1543bd5a28", "https://twitter.com/GovParsonMO/status/1436091507690278913?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1436091507690278913%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.ksdk.com%2Farticle%2Fnews%2Fpolitics%2Fparson-republican-officials-against-biden-vaccine-mandate%2F63-d58c1067-e5c9-4578-b457-4e1543bd5a28", "https://www.ksdk.com/article/news/politics/parson-republican-officials-against-biden-vaccine-mandate/63-d58c1067-e5c9-4578-b457-4e1543bd5a28", "https://twitter.com/dougducey/status/1436061511445729288?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1436061511445729288%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Frepublicans-respond-to-vaccine-mandates-issued-by-biden-absolutely-unconstitutional", "https://twitter.com/dougducey/status/1436061815419523075", "https://twitter.com/KristiNoem/status/1436064909654167558", "https://twitter.com/RepBarryMoore/status/1436073232499716098?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1436073232499716098%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Frepublicans-respond-to-vaccine-mandates-issued-by-biden-absolutely-unconstitutional", "https://twitter.com/RandPaul/status/1436078871854649344", "https://www.foxnews.com/politics/republicans-respond-to-vaccine-mandates-issued-by-biden-absolutely-unconstitutional", "https://www.facebook.com/gopdoctorscaucus", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-total-admin-rate-total", "https://childrenshealthdefense.org/defender/covid-booster-shots-8-months-after-second-dose/", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://childrenshealthdefense.org/defender/2-top-fda-regulators-resign-white-house-approve-boosters/", "https://www.fda.gov/news-events/press-announcements/fda-brief-fda-hold-advisory-committee-meeting-discuss-pfizer-biontechs-application-covid-19-booster", "https://apnews.com/article/joe-biden-business-health-coronavirus-pandemic-executive-branch-18fb12993f05be13bf760946a6fb89be", "https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["EJ Canary"], "publish_date": "2021-09-11T19:47:31-04:00"}