{"result_id": "308010", "URL": "https://thetruthaboutcancer.com/new-studies-destroy-mask-vaccine-mandates/", "timestamp": "2023-04-25 17:35:19 CEST+0200", "meta": {"description": "Two new studies on the effectiveness of mask and vaccine mandates concluded the policies failed to achieve their promised objectives.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/new-studies-destroy-mask-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "New Studies Deliver Harsh Verdicts on Mask Mandates, Vaccine Mandates for U.S. Cities", "cleaned_text": "Two new studies on the effectiveness of mask mandates and city-level COVID-19 vaccine mandates concluded the policies failed to achieve their promised objectives.\n\nResearchers found city-level vaccine mandates to have, at most, a negligible effect on vaccination rates, while conversely having a negative effect on cities’ economies.\n\nCommenting on the study, California attorney Rita Barnett told The Defender:\n\n“Shutting people out of society or denying them employment for refusing to take a medical treatment they do not want, need or trust violates all fundamental ethical principles — and local businesses and leaders who went along with these measures may suffer the consequences for many years to come.”\n\nIn the case of mask mandates, researchers who conducted a meta-analysis found they had no significant impact on curtailing the spread of COVID-19 — regardless of the type of mask studied.\n\nSujata Gibson, a lawyer and lead counsel on multiple lawsuits brought by New York City workers impacted by COVID-19 mandates said the study “shows conclusively that municipal COVID-19 vaccine mandates were a bust.”\n\nGibson, who said the findings should “come as no surprise,” added:\n\n“They did absolutely nothing to reduce death or disease and failed to even meaningfully increase vaccine uptake. The reality is that back in the fall of 2021, when these mandates were imposed, the science already clearly showed that they were irrational.\n\n“We have to ask — since it wasn’t science, what was really driving the municipal mandates? And we have to hold decision-makers and governments accountable for destroying untold thousands of lives for no rational reason.”\n\nIn their working paper, “Indoor Vaccine Mandates in US Cities, Vaccination Behavior, and COVID-19 Outcomes,” three researchers examined city-level vaccine mandates whose stated goal was to increase “the number of people being vaccinated, thereby limiting the spread of COVID-19.”\n\nThe researchers examined mandates in New York, Los Angeles, Chicago, Boston, New Orleans, Philadelphia, San Francisco, Seattle and Washington, D.C.\n\n“City vaccine mandates were arguably among the most restrictive and polarizing regulations ever enacted in the United States. Millions of people were prevented from entering restaurants, bars, gyms, theaters, sports arenas, and other public indoor areas without proof of COVID-19 vaccination.”\n\nAccording to WTOP News, the paper made “no judgments on whether someone should or should not get a vaccine, raises no questions about a vaccine’s effectiveness, and doesn’t try to argue whether someone should get one or not.”\n\nVitor Melo, a Ph.D. candidate in economics at Clemson University and one of the paper’s authors, told WTOP News, “Their [the mandates] intended outcomes were to raise vaccination rates, for people to get more vaccines; and consequently, the expectation was that COVID cases and deaths would go down.”\n\nBut according to the paper, “Indoor vaccine mandates had no significant impact on COVID-19 vaccine uptake, cases, or deaths across all nine cities that implemented the policy.”\n\nCompared with cities that did not enact vaccine mandates, “There’s not much to show for it” on the part of the cities that did enforce mandates, Melo added. “COVID cases were not affected, COVID deaths were not affected, and really, there’s no evidence that people got more vaccinated because of these mandates.”\n\nAccording to the paper:\n\n“Previous research has shown that similar country-level mandates increased vaccine uptake substantially. However, city-level mandates are easier to evade than country-level mandates because it is generally easier to travel to a neighboring city that does not have a mandate than to cross national borders.”\n\nAs a result, the city mandates did not succeed in getting “people who were skeptical or resistant of the vaccine to do something they didn’t want to do,” Melo said. “I guess if you make life difficult enough for people, they’re more likely to do what you want them to do. But in the United States, at the city level, what they did, did not seem to work.”\n\nThe researchers said their “results overwhelmingly support the conclusion that the city-level indoor vaccine mandates in the United States had a statistically negligible effect on vaccine uptake, cases, and deaths, and they were likely less effective when compared to country-level and province-level mandates.”\n\nFor instance, the researchers noted that New York City fired 1,430 municipal workers for not complying with its vaccine mandate. They also referenced a study finding that 90% of the city’s restaurants reported experiencing “customer-related challenges” and 75% reported having “staff-related challenges.”\n\n“Those are just a small fraction of the disruptions caused by the mandates,” the researchers said.\n\nDr. Harvey Risch, professor emeritus and senior research scientist in epidemiology (chronic diseases) at the Yale School of Public Health, told The Defender he found the analysis “interesting,” adding:\n\n“I wondered whether a summary analysis of all of the nine cities taken together might show something different, but my meta-analysis … did not show a benefit. … I can’t speak to the technical methods in this analysis because they are not used in the types of epidemiologic studies that I do, but they seem reasonable.”\n\nDr. Meryl Nass, a member of the Children’s Health Defense scientific advisory committee, said she found it “hard to believe that requiring people to vaccinate to undertake indoor activities like going to work did not increase vaccination rates.”\n\n“I think these now-defunct mandates should have given us a taste of what life would be like in a totalitarian society. It should help us identify the pillars of a totalitarian society that are currently being built around us — such as the loss of freedom of speech.”\n\nCharlene Bollinger, co-founder of The Truth About Vaccines and The Truth About Cancer, remarked:\n\n“I am not surprised by the results of this study. We said from the beginning that masking, social distancing and getting the COVID shots would not stop COVID, nor would any of the mandates prevent the deaths that we are now seeing in much larger numbers in the fully COVID-vaccinated population. We continue to be proven right as the ‘experts’ study the real effects of these COVID mandates.\n\n“Many people who questioned the mandates and refused the unproven COVID shots suffered the loss of their jobs, their businesses, their friends, and worse, their homes and more. The unvaccinated have been hunted down like animals. This is something we never thought we would ever see in America. We must work together to ensure this never happens again.”\n\nA meta-analysis published last month by Oxford University senior associate tutor in epidemiology Dr. Tom Jefferson and 11 other researchers called into question the efficacy of masks in reducing the spread of COVID-19.\n\nThe researchers said they “wanted to find out whether physical measures stop or slow the spread of respiratory viruses, from well-controlled studies in which one intervention is compared to another, known as randomised controlled trials.”\n\nThey sought out studies “that looked at physical measures to stop people acquiring a respiratory virus infection,” and “were interested in how many people in the studies caught a respiratory virus infection, and whether the physical measures had any unwanted effects.”\n\nThe study was conducted for Cochrane, described by New York Times columnist Bret Stephens as “the gold standard for its reviews of health care data,” and by Vox as “a major source of high-quality, reputable meta-analyses.”\n\nThe researchers identified “78 relevant studies” conducted “in low-, middle-, and high-income countries” during various pandemic, epidemic and non-health emergency periods. They included government and pharmaceutical studies, encompassing 610,872 people, including healthcare workers and the general population.\n\nThe researchers assessed the effects of different types of masks, including medical or surgical masks and N95/P2 respirators.\n\nFor medical or surgical masks, the researchers found they “may make little to no difference in how many people caught a flu-like illness/COVID-like illness.”\n\nSimilarly, for N95/P2 respirators, they found the masks “probably [made] little to no difference in how many people have confirmed flu … and may make little to no difference in how many people catch a flu-like illness … or respiratory illness.”\n\n“The pooled results of RCTs [randomized controlled trials] did not show a clear reduction in respiratory viral infection with the use of medical/surgical masks.”\n\n“There were no clear differences between the use of medical/surgical masks compared with N95/P2 respirators in healthcare workers when used in routine care to reduce respiratory viral infection.”\n\nIn an interview with Maryane Demasi, Ph.D., an investigative medical reporter, Jefferson said, “There is just no evidence that [masks] make any difference, full stop.”\n\nRemarking on the findings of the citywide vaccine mandate and mask studies, Barnett said she hopes they “will begin to persuade those who so easily supported widespread, illegal discrimination to resist these kinds of unproven interventions going forward and bring us out of these darkly coercive times.”\n\nStephens, in an op-ed for the Times, said, “No study — or study of studies — is ever perfect. Science is never absolutely settled,” but that “when it comes to the population-level benefits of masking, the verdict is in: Mask mandates were a bust.”\n\n“Those skeptics who were furiously mocked as cranks and occasionally censored as ‘misinformers’ for opposing mandates were right. The mainstream experts and pundits who supported mandates were wrong. In a better world, it would behoove the latter group to acknowledge their error, along with its considerable physical, psychological, pedagogical and political costs.\n\n“But whatever the reason, mask mandates were a fool’s errand from the start. They may have created a false sense of safety — and thus permission to resume semi-normal life. They did almost nothing to advance safety itself. The Cochrane report ought to be the final nail in this particular coffin.”\n\n“The whole idea that mask-wearing would provide infection source control for what is an aerosolized respiratory virus was itself based only on plausibility, not empirical evidence.\n\n“Mask mandates have been unwarranted and numerous studies of mandates show this. Mask-wearing has also been useless in the COVID pandemic, and lots of studies show this too. But these are not the same things.”\n\nFox News reported that the New York Times op-ed elicited a flurry of reactions from notable commentators on Twitter, on both sides of the “mask debate.”\n\nAuthor David Zweig, who has contributed to the release of the “Twitter files,” said:\n\n“The remarkable thing here is that the only way the most prestigious data review on community masks — which found no clear evidence of benefit — made it into the paper of record was in an opinion piece. The NYT Science desk did not deem it newsworthy.”\n\nMark Crispin Miller, Ph.D., professor of media studies at New York University, also remarked on the Times’ running the Cochrane study as an op-ed, telling The Defender:\n\n“I, of course, was struck by the Times’ op-ed. I noticed that it was published as an op-ed, and I was also struck by the article’s complete failure to hold the Times itself accountable.\n\n“Whereas the Times was, as I can attest from having studied it, fanatically committed to promoting the official line, [they] did not merely emphasize how important it was for everybody to wear masks. What they did was much subtler than that: they highlighted stories of ‘anti-maskers’ resorting to violence, usually in retail outlets.\n\n“So that if you were a regular reader of the paper, you would have the distinct impression that ‘anti-maskers’ were the ones who were out there resorting to outright violence.”\n\nMiller said the “true function” of mask mandates “was never to keep people from getting infected or from transmitting the virus,” but instead, “to habituate people to a certain kind of compliance.”\n\n‘Vindication’ for those who questioned mask mandates\n\nThe Cochrane study may vindicate Swedish public health officials who eschewed lockdowns and mask mandates throughout the pandemic.\n\nIn 2020, Swedish state epidemiologist Anders Tegnell said, “We see no point in wearing a face mask in Sweden, not even on public transport,” adding there were “at least three heavyweight reports … which all state that the scientific evidence is weak.”\n\nAs reported by The Defender in April 2022, Sweden recorded fewer COVID-19-related deaths per million people than the U.S. — and 53 other countries.\n\nAccording to The Conversation:\n\n“Face masks were not recommended for the general public [in Sweden] during the first wave, and only in certain situations later in the pandemic … Although Sweden was hit hard by the first wave, its total excess deaths during the first two years of the pandemic were actually among the lowest in Europe.”\n\nA Swedish government commission that investigated the country’s COVID-19 response found the no-lockdown strategy was “fundamentally correct,” and defended the decision to keep schools open, noting the low levels of excess mortality in 2020 and 2021.\n\nThe commission also concluded some lockdown countries had “significantly worse outcomes.”\n\nThe investigation did identify some shortcomings in the country’s response, but said that, at most, masks should have been “recommended.” Soon after the report was released, a Feb. 25, 2022 Boston Herald op-ed stated that Sweden “got it right.”\n\nNevertheless, Vox described the Cochrane study as “scientifically irresponsible,” and placed blame on any problems identified with mask wearing on the government, which it said “bears some responsibility for poor communication about masks.”\n\nVox also referred to a study conducted in Bangladesh supporting mask efficacy.\n\nJefferson, in his interview with Demasi, disputed this, stating it was “not a very good study, because it was not a study about whether masks worked, it was a study about increasing compliance for wearing a mask.”\n\nDemasi said a reanalysis of the Bangladeshi study was later conducted, finding “it had significant bias.”\n\nRisch also took issue with the Bangladeshi study, telling The Defender that Vox chose to “cherry pick” evidence from it and that “even if valid [it] shows only a small benefit of masking” and ignores contrary studies.\n\nIn his interview, Jefferson opined on why mask mandates were imposed when studies showed they were ineffective for respiratory viruses:\n\n“Governments completely failed to do the right thing and demand better evidence [and] had bad advisors from the very beginning … They were convinced by non-randomised studies, flawed observational studies … A lot of it had to do with appearing as if they were ‘doing something.’”\n\nMiller, in a Sept. 4, 2020 paper, outlined the rapid transformation in mask-related advice, noting that Dr. Anthony Fauci, the U.S. Centers for Disease Control and Prevention and the World Health Organization, between March and April 2020, quickly pivoted from not recommending to recommending masks.\n\nAccording to Fox News, “Those recommendations likely played a large part in 39 U.S. states eventually enacting mask mandates.”\n\nJefferson said his team had conducted a review on mask efficacy in early 2020, “but Cochrane held it up for 7 months,” a period he described as “crucial,” because “during that time, it was when policy about masks was being formed.” According to his studies, “the evidence didn’t really change from 2020 to 2023,” he said.\n\nMiller, who taught a class on propaganda at New York University, was targeted in September 2020 for asking his students to review studies from both sides of the “mask debate.” This resulted in an “expedited review” against him by the university. He was cleared in 2021.\n\nMiller told The Defender he found “a certain grim amusement in finding the New York Times, at this late date, coming around to the scientific facts that I was punished for even mentioning in a university class.”", "opengraph": {"locale": "en_US", "type": "article", "title": "New Studies Deliver Harsh Verdicts on Mask Mandates, Vaccine Mandates for U.S. Cities", "description": "Two new studies on the effectiveness of mask and vaccine mandates concluded the policies failed to achieve their promised objectives.", "url": "https://thetruthaboutcancer.com/new-studies-destroy-mask-vaccine-mandates/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Vaccine News", "article:published_time": "2023-02-25T08:44:25-04:00", "article:modified_time": "2023-02-25T08:50:25-04:00", "updated_time": "2023-02-25T08:50:25-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230225084352/covid-mask-vaccine-mandates-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://childrenshealthdefense.org/defender/covid-mask-vaccine-mandates-cities/", "https://www.cochrane.org/CD006207/ARI_do-physical-measures-such-hand-washing-or-wearing-masks-stop-or-slow-down-spread-respiratory-viruses", "https://www.mercatus.org/research/working-papers/indoor-vaccine-mandates-and-covid-19", "https://childrenshealthdefense.org/defender/", "https://ebn.bmj.com/content/16/1/3", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.mercatus.org/research/working-papers/indoor-vaccine-mandates-and-covid-19", "https://wtop.com/dc/2023/02/study-how-effective-was-dcs-indoor-covd-19-vaccine-mandate-in-raising-vaccination-rates/", "https://www.melovitor.com/", "https://www.nysra.org/uploads/1/2/1/3/121352550/vaccine_mandate_forcing_nyc_restaurants_to_lose_customers_face_staffing_challenges.pdf", "https://ysph.yale.edu/profile/harvey-risch/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/meryl-nass-license-suspension-maine-medical-board-hearing/", "https://thetruthaboutvaccines.com/", "https://thetruthaboutcancer.com/", "https://www.cochrane.org/CD006207/ARI_do-physical-measures-such-hand-washing-or-wearing-masks-stop-or-slow-down-spread-respiratory-viruses", "https://drtomjefferson.com/", "https://www.cochrane.org/", "https://www.nytimes.com/2023/02/21/opinion/do-mask-mandates-work.html", "https://www.vox.com/future-perfect/2023/2/22/23609499/masks-covid-coronavirus-cochrane-review-pandemic-science-studies-infection", "https://maryannedemasi.substack.com/p/exclusive-lead-author-of-new-cochrane", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9638642/", "https://uwaterloo.ca/news/media/research-suggests-mask-wearing-can-increase-struggles-social", "https://www.npr.org/2022/01/28/1075842341/growing-calls-to-take-masks-off-children-in-school", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8866197/", "https://www.foxnews.com/media/twitter-divided-after-new-york-times-column-concedes-mask-mandates-did-nothing-conservative-a-hat", "https://childrenshealthdefense.org/defender/twitter-files-biden-officials-collusion-censorship/", "https://markcrispinmiller.com/", "https://fortune.com/2020/07/29/no-point-in-wearing-mask-sweden-covid/", "https://www.euractiv.com/section/coronavirus/news/sweden-bucks-trend-in-refusing-to-recommend-masks/", "https://ourworldindata.org/covid-deaths", "https://theconversation.com/did-swedens-controversial-covid-strategy-pay-off-in-many-ways-it-did-but-it-let-the-elderly-down-188338", "https://www.thelancet.com/article/S0140-6736(21)02796-3/fulltext", "https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Excess_mortality_-_statistics", "https://www.who.int/data/stories/global-excess-deaths-associated-with-covid-19-january-2020-december-2021", "https://coronakommissionen.com/wp-content/uploads/2022/02/summary_20220225.pdf", "https://www.cbc.ca/news/world/sweden-report-coronavirus-1.6364154", "https://www.bloomberg.com/news/articles/2022-02-25/swedish-covid-enquiry-finds-fault-with-nation-s-initial-response#xj4y7vzkg", "https://www.telegraph.co.uk/world-news/2022/02/25/lockdowns-not-necessary-defensible-says-head-inquiry-swedens/", "https://www.bostonherald.com/2022/02/25/moore-in-the-end-sweden-got-it-right-on-covid-restrictions/", "https://www.vox.com/future-perfect/2023/2/22/23609499/masks-covid-coronavirus-cochrane-review-pandemic-science-studies-infection", "https://www.science.org/doi/10.1126/science.abi9069", "https://trialsjournal.biomedcentral.com/articles/10.1186/s13063-022-06704-z", "https://brownstone.org/articles/studies-and-articles-on-mask-ineffectiveness-and-harms/", "https://markcrispinmiller.com/2020/09/masking-ourselves-to-death-corrected-version/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804/ref=sr_1_1", "https://www.foxnews.com/health/face-masks-difference-spread-covid-scientific-review", "https://nypost.com/2020/09/23/nyu-student-wants-professor-fired-over-anti-mask-comments/", "https://www.chronicle.com/article/the-professor-of-paranoia?bc_nonce=jmhidq2kcwgrymjv9zw1je&cid=reg_wall_signup", "https://markcrispinmiller.com/2022/01/mcm-on-nyu-covid-censorship-woke-lunacy-what-digital-technology-hath-wrought-and-more-in-conversation-with-eric-francis-coppolino/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["James"], "publish_date": "2023-02-25T08:44:25-04:00"}