{"result_id": "308042", "URL": "https://thetruthaboutcancer.com/modern-medical-research-part-2/", "timestamp": "2023-04-25 17:36:11 CEST+0200", "meta": {"description": "We take a closer look at the ideology behind modern medicine and its top influencers and the murky origins of the American Cancer Society.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/modern-medical-research-part-2/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Modern Medical Research - Eugenics and the American Cancer Society", "cleaned_text": "Eugenics and The Origins of the American Cancer Society\n\nIn Part 1, we took a look at the origins of our modern medical research model, as well as how you can be a savvy health researcher in today’s highly-censored online environment. If you haven’t had a chance to check that article out, you can read it here.\n\nAs you probably know from your own health journey, it is sometimes important to focus in at the micro level to understand how a condition works or how a natural health substance or modality may help. At other times, you may need to step back and see the big picture. In Part 2, we will be stepping back a bit to look at the ideology behind modern medicine and its top influencers. We will also dive deep into the murky origins of one of the most influential non-profit organizations in the medical sphere, the American Cancer Society.\n\nThe term “ideology” is defined as “the body of doctrine, myth, belief, etc., that guides an individual, social movement, institution, class, or large group.” An ideology can be demonstrated by words and statements but is often most evident through actions.\n\nAs this definition indicates, a person can have an ideology and so can a company, a non-profit organization, or a nation. For example, most Americans value personal freedom. Thus, personal freedom is an individual ideology for many. The U.S. constitution and surrounding documents were put forth by the Founding Fathers to create a structure for protecting personal freedom (which they defined as “inalienable rights,” i.e., rights given by God) in various ways for each citizen, as long as the expression of this freedom did not harm self or others. Because of this, personal freedom is also an integral part of the national ideology of the United States as well.\n\nIdeology is important because it can form the basis for the actions of influential people, organizations, and institutions. In the last article, we saw what has happened over the last 150 years or so to create the modern medical system and its structure of medical research. We also identified those individuals who had a hand in creating it, namely the Rockefellers, the Carnegies, and the Rothschilds (in Europe).\n\nTo put it simply, modern medicine was created by the same guys (mentioned above) who created Big Pharma. So, what is their ideology?\n\n“Well, that’s easy!” you may think. “All those Big Pharma guys want to do is make a buck! It’s all about the money!”\n\nFor many individuals who are getting massively rich by running, working for, and investing in companies like Monsanto, Gilead, and Bayer AG, this is absolutely true. For example, a report put forth by Goldman Sachs for their investors entitled “The Genome Revolution” asks outright if curing patients is a sustainable business model.\n\n“GILD [Gilead Sciences’ treatments for hepatitis C] is a case in point, where the success of its hepatitis C franchise has gradually exhausted the available pool of treatable patients,” writes analyst Salveen Richter, one of the authors of the 2018 document. “In the case of infectious diseases such as hepatitis C, curing existing patients also decreases the number of carriers able to transmit the virus to new patients, thus the incident pool also declines …Where an incident pool remains stable (e.g., in cancer) the potential for a cure poses less risk to the sustainability of a franchise.”\n\nLooking at a quote like this, it is easy to conclude that Big Pharma is simply all about the money. And it also makes perfect sense. After all, as the Goldman Sachs report alludes to, a sick population guarantees a revenue stream ad infinitum while a healthy population cuts into the bottom line.\n\nBut what if there was also a deeper, darker agenda behind Big Pharma? And what if that agenda was tied to a particular ideology that has been steadfastly promoted for generations by those at the top?\n\nIf Big Pharma is the slimy underbelly of modern medicine, then eugenics, and the depopulation goals that go along with it, is the slimy underbelly of Big Pharma.\n\nEugenics is a touchy topic and a scary one for many. It seems appropriate, however, to discuss this little-known aspect of our collective history at this moment when our freedoms on all levels, including our freedom to choose what happens to our own bodies, hang so precariously in the balance.\n\nAccording to Merriam-Webster, eugenics is “the practice or advocacy of controlled selective breeding of human populations (as by sterilization) to improve the population’s genetic composition.”\n\nThe connection between eugenics and modern medicine is well documented. To understand its significance, however, we have to go back to the beginning and fill in some ideological gaps. The term was first coined by Sir Francis Galton, half-brother to Charles Darwin. Darwin himself promoted the concept. In his book “Descent of Man,” Darwin writes:\n\n“With savages, the weak in body or mind are soon eliminated; and those that survive commonly exhibit a vigorous state of health. We civilized men, on the other hand, do our utmost to check the process of elimination; we build asylums for the imbecile, the maimed, and the sick; we institute poor laws; and our medical men exert their utmost skill to save the life of every one to the last moment…Thus the weak members of civilized societies propagate their kind. No one who has attended to the breeding of domestic animals will doubt that this must be highly injurious to the race of man.”\n\nDarwin published those words in 1871. In the early decades of the 20th century, powerful elite individuals embraced them wholeheartedly. In part 1, I discussed the Flexner Report and how its usage in systematically shutting down homeopathic colleges in the United States and promoting schools which were loyal to research around patentable drugs. You may recall that this report was funded by philanthropic organizations created by the Rockefeller and Carnegie families. Stanford, Harvard, Yale, and Princeton were among the institutions which received massive funding from these organizations. These families and their foundations supported eugenics concepts and funded the programs and professionals who promoted it. They began this over 100 years ago, and they still do today.\n\nOne of the most influential eugenicists at the time was Stanford professor David Starr Jordan. Jordan was a student of Charles Darwin, natural genetics and “Mendelian genetics,” which is the belief that individual traits are the “result of discrete units of inheritance.” Jordan believed that the American upper class needed to practice “selective breeding” and that the elites in this country were being “eroded” by the lower classes. He wrote many books on eugenics and was a founding member of an organization called the “Eugenics Committee of the American Breeders Association.”\n\nIn 1904, Jordan, Princeton-educated sociologist Harry Laughlin, and Harvard biology professor Charles Davenport formed the Eugenics Records Office (i.e., ERO, also called the “Station for Experimental Evolution,” or SEE) at the Cold Spring Harbor Laboratory in New York. The ERO was funded by the Carnegie Institution of Washington and the Rockefeller Foundation with significant support from Mrs. E. H. Harriman of the Averell and Harriman railroad empire, as well as John Harvey Kellogg.\n\nThe data collection programs and scientific research that came out of the Eugenics Records Office played a key role in mandatory sterilization laws in the United States. Laughlin’s report entitled “Eugenical Sterilization in the United States” was the catalyst that eventually led to eugenics-based laws across more than two dozen U.S. states, Canada and parts of Europe. Laughlin’s Model Eugenic Sterilization Law described those who were candidates for sterilization as “defective.” Specifically, this includes the “feebleminded, insane, criminalistic, epileptic, inebriate, diseased, blind, deaf; deformed; and dependent” as well as “orphans, ne’er-do-wells, tramps, the homeless and paupers.”\n\nIn a report which upheld the Virginia Sterilization Act of 1924 (Buck vs. Bell, 1924), Supreme Court Justice Oliver Wendell Holmes wrote that “…It is better for all the world if, instead of waiting to execute degenerate offspring for crime or to let them starve for their imbecility, society can prevent those who are manifestly unfit from continuing their kind.”\n\nBy the early 1930s, thousands of Americans, Canadians, and Swiss citizens had been sterilized. Many of these individuals were female. In the United States, the majority of forced sterilizations occurred in Californian institutions.\n\nThe Eugenics Records Office “officially” closed in 1939, but Cold Spring Harbor Laboratory (CSHL) continues to this day, churning out studies and supporting researchers from all over the world. According to its website, its focus is now on “cancer, neuroscience, plant biology and quantitative biology.” It has campuses in Long Island, New York, and Suzhou. It boasts eight Nobel Prize winners.\n\nDoes Cold Springs Harbor, the “No. 1 institution in molecular biology and genetics” according to Reuters, still operate under the eugenics mantle? No doubt, most of the 600 scholars who work at CSHL and its over 12,000 annual visitors probably aren’t even aware of the lab’s history, let alone believe in its foundational ideology.\n\nHowever, eugenics still seems to pervade the thinking (and perhaps even influence the actions) of those at the top of this organization. One of the Nobel Prize winners to come out of CSHL was James Watson. Along with Francis Crick, Watson was responsible for discovering the DNA double helix in 1953. He later went on to serve as the Cold Spring Harbor Laboratory president (1994 to 2003). The CSHL officially severed ties with Watson in 2007 in the wake of questionable statements he made against Africans.\n\n“All our social policies are based on the fact that their (African) intelligence is the same as ours – whereas all the testing says not really,” Watson said in an interview with British journalists at the time.\n\nThose involved with the Eugenics Records Office would eventually be instrumental in the creation of some of the largest nonprofit health organizations known today.\n\nThe American Cancer Society (ACS) is one example. The ACS is the wealthiest non-profit organization on the planet. According to records collected in 2018, it generates more than $800 million per year with net assets of $1.1 billion. Twenty percent of its revenue, or $170 million annually, goes to research grants, mostly on patentable drug therapies and modalities.\n\nACS has close to 7,000 employees. The average salary for a full-time employee is roughly $68,000 a year. That doesn’t include the top brass, however. Gary Reedy, the current ACS CEO, makes close to $750,000 a year, plus another $68,000 from a “related organization.” Former Chief Operations Officer Gregory P. Bontrager received $2.3 million in 2016, including a retirement package deferment worth over a million, and a half a million in severance pay. Bontrager left ACS in 2015. Three years later, in 2018, he apparently came out of retirement to become Chairman of the Board at Memorial Health Care.\n\nLet’s take a look at the founding of this organization. The managing director of what would eventually become the American Cancer Society was the University of Michigan president C.C. Little, who worked at the Cold Spring Harbor Laboratory in the years prior to World War I.\n\nIn a pamphlet which Little wrote in 1927, he stated that “now and again some person calls eugenics an impractical ideal and eugenicists, dreamers; and not infrequently do we find those who take no interest in the subject because it is ‘new.’ The facts about eugenics should be known and understood, by all, for as they are, it will appear that eugenics is as old as the race, intensely practical and money-saving.”\n\nLittle would also go on to be a founding member of Margaret Sanger’s American Birth Control League. The League received initial seed money and ongoing funding from John D. Rockefeller III. This organization would morph into what we now know as Planned Parenthood. An important side note is that one of the later leaders of Planned Parenthood was attorney and philanthropist Bill Gates, Sr., father of Microsoft founder and vaccine promoter extraordinaire Bill Gates.\n\nWhose Interest Does the American Cancer Society Serve?\n\nAccording to their website, for the last 100 years, the American Cancer Society has been “on a mission to free the world from cancer.”\n\nHowever, its eugenics origin, as well as the focus of its current leadership, suggest something quite different. More to the point is the fact that the ACS of today is interested in controlling the cancer market, not finding a cure for it.\n\nStill, one would think that the wealthiest and oldest cancer-centered non-profit organization on the planet would want to have a significant number of physicians (or at least research scientists) on its board of directors. If anything, this would give the appearance of being in the public interest, right? Not so with the American Cancer Society.\n\nThis organization, for the most part, is run by corporate executives, lawyers, and business specialists. Some of the corporations that are represented on its board are 3M, Blackrock, PricewaterhouseCoopers, IBM International Foundation, Origin Ventures (a venture capital firm that specializes in biotech), Delta Airlines, Chevron and Global Kompass Strategies. The three PhDs who sit on the ACS board come from the genetics, biotech, and pharmaceutical industries and have connections with biotech firms such as Anixa Biosciences, ImmunoGen, Idera Pharmaceuticals, GlycoMimetics, Audentes Therapeutics, and Synageva Biopharma. Many in top leadership positions also have connections to the medical insurance industry, including GuideWell, PopHealthCare, and Memorial HealthCare. The current ASC COO, Kris Kim, used to be the Associate VP for communications at Planned Parenthood New York City before joining the ACS in 1999.\n\nThe ACS of today is, of course, very much aligned with the pharmaceutical industry. It is particularly intertwined with multinationals Johnson & Johnson and AstraZeneca. American Cancer Society’s current CEO used to be president of Ortho Biotech, a Johnson & Johnson company. He also held key leadership positions with SmithKline Beecham and Centocor.\n\nAstraZenestra’s involvement with the American Cancer Society is far-reaching as well.\n\n“AstraZeneca, a Big Pharma giant, has made multimillion dollar contributions to ACS, influencing just about everything that the ACS does – every poster, leaflet or commercial product about Breast Cancer Awareness you can think of,” states medical and natural health researcher and journalist Christina Sarich in an article for the online natural health publication Natural Society. “These publications focus almost exclusively on mammography and don’t mention a word about carcinogenic foods, chemtrails, aluminum in deodorants, antiperspirants, as well as vaccines. There is no spoken word of breast cancer prevention via natural, inexpensive means, while touting the ‘cure’ of mammography and cancer drugs.”\n\nAs an important side note, both of these pharmaceutical giants have had questionable deals of their own in their past and in the present day. Johnson & Johnson just signed a $1 billion deal with the U.S. government on March 30th to develop a COVID 19 vaccine (in partnership with Janssen Pharmaceuticals).\n\nAstraZeneca (when it was known as Zeneca) used to be owned by Imperial Chemical Industries, “a leading international manufacturer of industrial chemicals and carcinogenic pesticides” before merging with the Swedish pharma company Astra. They are also a regular contributor to the Clinton Foundation. In addition, AstraZeneca has been accused of paying honorariums, travel, and other expenses to physicians who advise for FDA drug approvals, according to an investigative report published in 2018 in Science magazine.\n\nThe American Cancer Society began with eugenics-leaning leadership. It is easy to see how this ideology still permeates, along with plain old greed at the top levels. Its programs never address the root causes of cancer, and probably never will. The research it sponsors sticks with the “Big 3” (chemo drugs, radiation therapy, and surgery). It continues to brush off any real connections between lifestyle, diet, and cancer, and they never, ever approach the subject of environmental toxins. After all, if they did, they would have to call out the very corporations whose representatives sit on their board and pay their salaries.\n\nWhether they are doing it intentionally as part of an outright eugenics and depopulation agenda or it is just as a sad consequence of their “profits over people” corporate culture, the fact remains that the American Cancer Society has contributed more to cancer mortality than cancer cures throughout its nearly 100 years in existence.\n\nWe Are at a Rare Moment in History\n\nNow that we have taken a brief detour back in time to discover the murky origins of one of today’s largest cancer research non-profits, consider where we are now. Bill Gates, son of one of the early leaders of Planned Parenthood, as well as Big Pharma and the NIH, is pushing mandatory vaccines that may include contact tracing technology as well as hazardous and untested toxins that could lead to infertility and birth defects.\n\nIs this a case of history repeating itself? It sure seems like it, but there is one big difference between then and now. In 2022, because of the power of the internet, good-hearted, freedom-loving people like you and me can arm ourselves with knowledge.\n\nThe best way to make our world a better place now and into the future is to not repeat the mistakes of the past. But we have to learn about those mistakes first!\n\nYou can learn about what happened in the past and share your knowledge with others. Together we can make a difference. This is a time like never before. It is a unique point in history where we can finally come together and say “no more” to the elitist, eugenics, and wealthy-gathering agendas that continue to saturate every aspect of our lives and cause millions to suffer.\n\nIn 2022, the stakes are high. Our freedoms and medical sovereignty are on the line, both personally and nationally.\n\nWill you stand up and make your voice heard? If you do, future generations will thank you!", "opengraph": {"locale": "en_US", "type": "article", "title": "Modern Medical Research - Eugenics and the American Cancer Society", "description": "We take a closer look at the ideology behind modern medicine and its top influencers and the murky origins of the American Cancer Society. ", "url": "https://thetruthaboutcancer.com/modern-medical-research-part-2/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Cancer Treatments", "article:published_time": "2023-01-26T00:01:11-04:00", "article:modified_time": "2023-01-27T20:46:33-04:00", "updated_time": "2023-01-27T20:46:33-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20220709075656/TTAC_Modern-Medical-Research-PART-2_588x330_web.jpg", "image:width": "588", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutcancer.com/modern-medical-research-part-1/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["James Graham Corscadden", "Paul L", "David Whittingstall", "Tag Geren", "Linda Manikas"], "publish_date": "2023-01-26T00:01:11-04:00"}