{"result_id": "308036", "URL": "https://thetruthaboutcancer.com/monkeypox/", "timestamp": "2023-04-25 17:36:02 CEST+0200", "meta": {"description": "We’re going to dive into the truth about monkeypox: what it is, how it transmits, and how to stay safe.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/monkeypox/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "The Truth About Monkeypox: What It Is and What You Need to Know", "cleaned_text": "Monkeypox has been slowly taking the lead when it comes to mainstream media coverage. Despite the food shortages, economic recession, tension with China and Russia, and a pretty major midterm election coming up, this “new” disease is eating up more and more airtime.\n\nUnfortunately, much of that coverage has been fearmongering. Just as we saw when COVID-19 first came into the public eye, there has already been a ton of misinformation and exaggeration that has led many of us to be afraid.\n\nAnd just as we saw with COVID-19, fear makes people easier to control. We’re going to dive into the truth about monkeypox: what it is, how it transmits, and how to stay safe. As we walk through this information, we want you to remember this equation:\n\nWe’ve seen how many lives were impacted by the lies, fear, and government control during the last “pandemic.” We don’t want to see that happen again, so let’s take a good, hard look to discover the truth about monkeypox.\n\nMonkeypox is a zoonotic disease, meaning it can be transmitted to humans from animals. The virus was first discovered in tropical African monkeys in 1958, hence the name. In 1970 monkeypox was detected in humans for the first time, with over 400 human infections detected over the next 16 years.\n\nMonkeypox is a member of the same family of viruses as smallpox, although it is much less severe, and experts say chances of infection are low. The virus is still most common in remote parts of central and west African countries, near tropical rainforests. In those regions, there have been more than 1,200 cases of monkeypox since the start of 2022.\n\nInitial symptoms include fever, headaches, swelling, back pain, aching muscles. Once the fever breaks a rash can develop, often beginning on the face, then spreading to other parts of the body, most commonly the palms of the hands and soles of the feet.\n\nThe rash, which can be extremely itchy or painful, changes and goes through different stages before finally forming a scab, which later falls off. The lesions can cause scarring. The infection usually clears up on its own and lasts between 14 and 21 days.\n\nThere are two distinct clades (or strains) of the monkeypox virus: The Congo Basin clade and the West African clade. What we’re seeing right now is the West African clade, which is the milder of the two.\n\nIt’s also important to note that this is not the first time there’s been a monkeypox outbreak in the United States. Between May and July of 2003, there were over 70 confirmed cases in 6 different states. All of those cases came from direct contact with prairie dogs, which had been infected by infected rodents imported from Ghana in April of that same year. (Note: Monkeypox can affect a wide range of animals. It’s still unclear how many species of animals are able to contract the virus.)\n\nThere were no cases of human-to-human transmission during that outbreak, which was primarily concentrated in Wisconsin, and zero deaths. And that’s because human-to-human transmission is relatively uncommon and difficult. Which brings us to the next question…\n\nAs a zoonotic disease, monkeypox can spread both from animal to human and from human to human. In the 2003 U.S. outbreak, three species of African rodents were shipped to Illinois, where they were housed with prairie dogs, who became infected and then, in turn, infected humans.\n\nTransmission among animals and humans is the same: there must be direct contact with bodily fluids. This could include bites, sexual intercourse, or contact with infected scabs. Essentially, there has to be direct exposure to bodily fluids in order to become infected.\n\nThe virus can enter the body through broken skin, the respiratory tract or through the eyes, nose or mouth. While not technically classified as a sexually transmitted infection, it is well-documented that unprotected sex results in an increased risk of infection. Pregnant women can also transmit the disease to their unborn children through the placenta.\n\nAt the time of publishing, the CDC is reporting 7,102 confirmed cases of Monkeypox in the United States. However, the CDC acknowledges that many of these cases have only been confirmed for orthopoxvirus, a genus of virus that includes (but is not limited to) monkeypox.\n\nThe monkeypox virus did not spread well between humans in the past but seems to have found an easier transmission pathway in the homosexual community – specifically gay men.\n\nAn epidemiological modeling study posted as a preprint last week by researchers at the London School of Hygiene & Tropical Medicine suggests that the virus may have made its way into highly interconnected sexual networks within the gay community, where it can spread in ways that it cannot in the general population.\n\nThe vast majority of cases in the current outbreak have been in gay men. Researchers at the UK Health Security Agency, for example, found that, of the 152 monkeypox patients surveyed,, 151 were gay men. The 1 remaining patient refused to answer the question. Other countries have seen similar patterns, indicating that this outbreak poses the greatest threat to men who have sex with other men.\n\nEven so, the risk of serious injury or death is minimal.\n\nIt is extremely unlikely that you or anyone you know will die from monkeypox. Previous outbreaks of the West African clade had fatality rates of about 1%, but in developed, non-endemic countries that rate has been significantly lower.\n\nIn the United States, there has never been an instance of monkeypox resulting in patient death. In fact, the first non-endemic countries to experience a reported death from monkeypox include Spain (2), Brazil (1), and India (1).\n\nAs we saw with COVID-19, the case and death rates will likely change depending on how governments and health agencies count and report them, but it’s clear that – in the vast majority of cases – monkeypox will resolve on its own.\n\nWhat is the Government Doing?\n\nThe World Health Organization (WHO) recently declared monkeypox a Public Health Emergency of International Concern (PHEIC). The WHO had convened an expert panel to advise whether or not monkeypox should be labeled as a global emergency. The panel was split 9-6 against declaring a PHEIC.\n\nWHO Director Tedros Adhanom Ghebreyesus went against the opinion of his own advisory panel, moving unilaterally to declare the PHEIC without explanation. Though the committee does not formally vote, a survey of the members revealed that nine thought a PHEIC should not be declared and six supported a declaration.\n\nTedros said in a news conference called to announce the decision: “Nine and six is very, very close. Since the role of the committee is to advise, I then had to act as a tie-breaker.” The PHEIC declaration will now activate an agreement between 196 countries to detect, assess, report, and respond to monkeypox in a coordinated global effort.\n\nThe Biden administration earlier this week declared a public health emergency (PHE) for monkeypox. “We’re prepared to take our response to the next level in addressing this virus, and we urge every American to take monkeypox seriously and to take responsibility to help us tackle this virus,” HHS Secretary Xavier Becerra said in a press briefing Thursday afternoon.\n\nThe declaration of a domestic public health emergency gives the administration more flexibility and powers with which to try to halt spread of the virus. The powers could, among other things, allow the administration to tap into additional federal funds for the response.\n\nThere has also been a general push to facilitate access to smallpox vaccines, which many say can reduce the risk of contracting monkeypox. The supporting data is small and not comprehensive. Whether or not the smallpox vaccine truly offers protection against monkeypox is a question that will require further research and larger, controlled studies.\n\nJust as we saw with COVID-19, governments and health agencies are already positioning themselves to gain more money and control in the name of public health and safety. By keeping us afraid and uninformed, they are able to coerce the masses into relinquishing their freedoms.\n\nNow, it’s time to learn from the past. This is an illness. We know its origins, we know how it’s transmitted, and we know its symptoms. America has seen monkeypox before, with every infected patient making a full recovery.\n\nWe also know who seems to be most at risk during this outbreak. Men who have sex with other men comprise the overwhelming majority of all cases so far. Avoiding this behavior all but eliminates your risk of contracting the disease.\n\nIn addition, we can take extra caution to avoid unnecessary close contact that would expose us to bodily fluids. We can also self-monitor for symptoms like aches, fevers, or rashes. The recommendation for someone with monkeypox is the same as the recommendation for someone with the flu: Stay home and rest until you feel better.\n\nIt’s that simple. Mask mandates or the forced closure of schools, churches, and businesses will do nothing to stop the spread of this disease. The smallpox vaccine (which we’ll be writing about next week) may offer some protection, but given the extremely low risk to the general population, preemptive vaccination is likely not necessary.\n\nRemember, lies + fear + control = death. But here’s a new formula for you:\n\nWhen we walk in the truth, we have light that leads to life. Knowledge of the truth can allow us to live a life without fear. Without fear, we have no reason to surrender our freedom. They cannot take our freedoms unless we give them to them.\n\nAnd the only reason people surrender their freedom is because they’ve listened to and believed their lies. When we are riding that low vibe of fear we will do anything they tell us to do. But Jesus has told us that He is the way, the truth, and the life. And the truth will set us free.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Truth About Monkeypox: What It Is and What You Need to Know", "description": "We're going to dive into the truth about monkeypox: what it is, how it transmits, and how to stay safe.", "url": "https://thetruthaboutcancer.com/monkeypox/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2022-08-05T00:01:28-04:00", "article:modified_time": "2022-08-06T17:04:26-04:00", "updated_time": "2022-08-06T17:04:26-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20220805141726/TTAC_Truth-About-Monkeypox-What-YOU-Need-to-Know_Article_588x330_web.jpg", "image:width": "588", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Greebo", "Wes", "Eric D Bell", "em", "Jim Drish", "Elizabeth"], "publish_date": "2022-08-05T00:01:28-04:00"}