{"result_id": "308025", "URL": "https://thetruthaboutcancer.com/cancel-culter-anti-vax-part-1/", "timestamp": "2023-04-25 17:35:46 CEST+0200", "meta": {"description": "The CCDH has accused 13 people of leading the anti-vax movement online, calling for social media outlets to censor the information.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/cancel-culter-anti-vax-part-1/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Cancel Culture, Digital \"Hate\" Groups & the \"Anti\" Anti-Vaxx Industry | Part 1", "cleaned_text": "The war on freedom has reached a fevered pitch. Cancel culture and media censorship are at an all-time high as the rich and powerful continue their crusade to destroy free thought once and for all. At the center of this war is the Center for Countering Digital Hate (CCDH), a group of left-wing mercenaries with the sole purpose of silencing anyone who jeopardizes the financial and political interests of their sponsors.\n\n\n\nEarlier this month, we reported that the CCDH had published a “digital hitlist” of the “Top 10 Anti-Vaxxers” which included “The Bollingers” along with 10 others. Apparently, the hatred spewed from the CCDH has affected their ability to perform basic mathematics, such as counting to eleven, because their “top 10” list actually contains 11 names. We’ll just chalk that one up to “vaccine-induced rage.” Since that time, we have been “purged” from Instagram.\n\nThe CCDH is a UK-based group who claims to “disrupt the architecture of online hate and misinformation.” According to their website, they hope to deplatform, demonetize, and demonize what they refer to as “conspiracy theories, misinformation, and hate.”\n\nWithin the last week, the CCDH followed up their “Top 10” (or eleven if you can count) list with the results of a survey in which they identify 13 people who – they claim – are responsible for nearly two-thirds of “anti-vaccine content.” They’ve cleverly named this group “the disinformation dozen” and we’re not surprised that there are actually 13 of us … apparently they still cannot count. Or perhaps they were referring to a “baker’s dozen.” 🙂\n\nDespite the globally coordinated release of over 100 mainstream media articles in the span of two days to amplify CCDH’s agenda to target, defame, and deplatform 13 named prominent health freedom advocates, thousands of comments have arisen organically, including over 1,000 comments on the Daily Mail’s front cover article titled, “The ‘disinformation dozen’: Two-thirds of anti-vaxx content circulating on Facebook and Twitter can be traced back to just 12 people including Robert F Kennedy Jr, report claims,” most of which called out the egregiously diversionary and ad hominen tactics being applied through their “report.”\n\nAs you can see in the photo below, the groups include us (Ty and Charlene), Robert F. Kennedy, Jr., Joseph Mercola, Sherri Tenpenny, Rizza Islam, Rashid Buttar, Erin Elizabeth, Sayer Ji, Kelly Brogan, Christiane Northrup, Ben Tapper, and Kevin Jenkins. We’ve been accused of “spreading disinformation” and “repeatedly” violating Facebook and Twitter’s terms of service. They are currently demanding that the social media platforms demonetize and deplatform us in order to stop what they claim is harmful misinformation about vaccines, COVID-19, and other health-related issues.\n\nBut the haters don’t realize that they are only galvanizing our efforts and waking people up in droves! Soon after the “disinformation dozen” article — which received international media amplification across at least 100 different news outlets — was published on March 24th, a tidal wave of social media responses inundated their posts on Instagram, Facebook, and Twitter, calling them out for their clearly hypocritical behavior in viciously attacking and defaming 13 prominent health freedom advocates and whistleblowers.\n\nAll 13 of those named in the report have publicly expressed concern over both the US government’s draconian responses to the COVID-19 crisis and the emergency use authorization of experimental mRNA vaccines now being given to the public without informed consent. There are now over 1,500 comments on Facebook alone, expressing anger, disappointment, and a need for accountability from CCDH for their defamatory comments and diversionary tactics.\n\nThese attempts to squash free speech and open dialogue are unconstitutional and insulting. They assume that the tens of millions of followers that we have acquired are so daft and uneducated that they are incapable of analyzing information or thinking for themselves. The CCDH wants to ensure that their opinions and agenda are the only ones available in hopes that the American people – and the global population as a whole – will blindly fall in line.\n\nBut the Center for Countering Digital Hate is itself a hate group, working as mercenaries for a much greater international agenda. According to a revealing exposé published by Dr. Mercola (hitlist member), the CCDH is part of a campaign by British and American intelligence to eliminate “anti-vaccine propaganda” from public discussion using sophisticated cyberwarfare tools.\n\n\n\nAccording to Iain Davis with the Off-Guardian:\n\n\n\n“The Anti-Vax Industry is a propaganda leaflet with two main objectives. The first is to create a false dichotomy in the public imagination and the second is to build a public-private censorship grid in anticipation of forthcoming government legislation. This is proposed to censor legitimate scientific opinion and evidence-based debate on a wide range of issues the government and its corporate partners would rather silence. Including any questioning of vaccines.\n\nThey insist that anyone who has any doubts about any vaccine rejects all vaccines outright. This isn’t true but the CCDH are censors and propagandists, not rationalists.\n\nComically, they claim they are a non-governmental organization (NGO). While technically plausible, their network of links to government, globalist think tanks and private corporations is extensive.\n\nThe CCDH espouses the social reform and political philosophy of progressivism. This advocates alleged progress through the advancement of science, technology and economic development. In the UK this is commonly associated with the political movement found on the right wing of the Labour Party and is the dominant ideology of the Parliamentary Labour Party (PLP).\n\nWhile still maintaining a putative commitment to representative democracy, it has much in common with the concept of Technocracy and, with the addition of a commitment to maintaining the global dominance of the transatlantic alliance, it is the basis of Blairism. It’s acolytes, such as the CCDH, consider themselves enlightened progressives. However, this sense of elitism produces an intolerance of all opposing views.”\n\nWhich brings us to the first thing you should know about the CCDH…\n\nThe Center for Countering Digital Hate is Promoting Digital Hate\n\nDespite the appealing name (who doesn’t want to end digital hate?), the CCDH has done exactly what it claims to stand against. By publishing a digital “hit list” and making blanket statements that demonize people like us, they’ve actually become the hateful extremists that they claim to oppose.\n\nAnd that isn’t just incendiary rhetoric.\n\nCCDH CEO Imran Ahmed has recently been appointed to the Steering Committee of the UK government’s Commission on Countering Extremism Task Force (CCETF). The UK government’s Commission on Countering Extremism (CCE) 2019 Document called Challenging Hateful Extremism defined, what they call, hateful extremism as follows:\n• None Behaviours that can incite and amplify hate, or engage in persistent hatred, or equivocate about and make the moral case for violence;\n• None And that draw on hateful, hostile or supremacist beliefs directed at an out-group who are perceived as a threat to the wellbeing, survival or success of an in-group;\n• None And that cause, or are likely to cause, harm to individuals, communities or wider society.\n\nLet’s look at the CCDH report and recommendations based on those parameters.\n• None The CCDH has presented these 13 people as “anti-vaccine propagandists” spreading harmful misinformation. They blame us for vaccine hesitancy (a misleading term for free thinking) and vehemently advocate for our complete destruction as organizations. This has amplified hate, and a quick perusal of the online feedback to the report shows that some people feel there is now a moral justification for violence against us.\n• None The CCDH and their allies have positioned themselves as an authoritative voice of reason that is above reproach. Even questioning the safety and efficacy of vaccines or the measures that governments worldwide have taken since the virus first appeared are considered a major threat to public health and the greater good. They paint organizations like TTAC as greedy liars hell-bent on making a profit while the world burns.\n• None They fundamentally believe that any information that doesn’t align with the narrative that vaccines are safe and effective – or that questions the authoritarian response to the virus – will cause injury and death. They blame us almost exclusively for putting the global community in harm’s way.\n\nIt’s clear that the CCDH is itself a group of hateful extremists. They present themselves as unimpeachable authorities while inciting fear and hatred towards specific individuals. If any online rhetoric is likely to incite violence, this is surely it.\n\nThis is not only an attack on free speech and open discord, but also a direct affront to the tens of millions of people who choose to follow our work. The CCDH is actively running an massive (and expensive) propaganda campaign in order to silence the leading voices who question their agenda.\n\nOn March 25th, a Congressional hearing convened wherein the CEOs of Facebook, Twitter, and Google were interrogated about their role in the ongoing censorship controversial on their platforms. Democratic senator Mike Doyle appeared to bully the CEOs in the clip below, pressuring them in Inquistion-style to both answer YES to the question, “do vaccines work?” and to commit deplatform the 13 “anti-vaxxers” in the CCDH report immediately.\n\nLet’s be honest. Like so many other organizations that are front groups, CCDH is a criminal entity that uses the time-honored strategy of attacking other science based groups that threaten corporate interests by calling them “hate groups”, “anti-vaxxers” or”purveyors of misinformation”. Then when they are called out on the lack of factual basis for these accusations they simply call the unmasker a “conspiracy theorist.”\n\nCCDH vaccine propaganda is focused upon polarizing opinion. This fake division is created through CCDH disinformation. Like many propagandists before them, they deal in inaccurate, empty generalizations. They hope to convince their consumers that anyone who ever questions a vaccine must be a nut job. The same dross was recently promulgated by the UK Conservative Prime Minister.\n\nBy misleading people that there is no scientific basis for some vaccine skepticism, nor any legitimate concerns about vaccine safety and efficacy, the CCDH are creating fake social divisions in the hope of building real ones. In order to achieve this aim, the CCDH assert that anyone who asks any questions about vaccines is driven by hate and is therefore an extremist who threatens public health, ultimately posing a threat to national security.\n\nThey are creating the ludicrous, fake bogeyman of the public health terrorist. The alleged anti-vaxxer as subhuman; a vile, hateful extremist. They are “other.”\n\nThis false dichotomy is exactly what fascist regimes have implemented for years. It is a documented logical fallacy in which only two choices are presented when more exist (or a spectrum of possible choices exists between two extremes). False dilemmas are usually characterized by “either this or that” language, but can also be characterized by omissions of choices.\n\nThe CCDH would have you believe that you are either for vaccines and absolute totalitarian control, or you are a wild conspiracy theorist who willingly puts the the world at greater risk of harm. Their rhetoric completely eliminates the possibility of open and civil discussion about the scientific risks and benefits of vaccines, chemotherapy, mask mandates, and lockdowns.\n\nThis is not only dangerous, but extremely detrimental to a democratic society. When two sides of an argument are so severely polarized, productive conversations are no longer possible. Rather than supporting freedom of speech and open dialogue, the CCDH is willfully fostering an environment in which people must choose a side, with the requirement that each of us actively hate and discredit the other.\n\nWhen it comes to vaccines, I have no problem identifying as “Anti-Vax.” I believe that the development and testing of vaccines is extremely flawed, and that the risks of most vaccines far outweigh the benefits. But I have always advocated for medical freedom when it comes to care. To insist that others subscribe to your beliefs and agenda is nothing short of tyranny.\n\nThe CCDH are part of the network of so called fact checkers and censors who are using their incredible and seemingly disproportionate influence, suddenly garnered from nowhere, to police opinion on the social media platforms. Unfortunately, their tactic is to completely ignore the available data, demanding that their beliefs be accepted as gospel without question.\n\nLike the government, the CCDH are careful not to mention any of the scientific or historical evidence which questions vaccine efficacy and safety. Instead, they label all who do cite this evidence as radical extremists.\n\nThe opening statement in the CCDH’s vaccine propaganda claims:\n\n“Vaccines are one of the most consequential, safe, efficient and effective medical discoveries in history. Few other inventions have saved so many lives.”\n\nWhere is their evidence? Just because they state something doesn’t make it true. The truth is that the vast majority of the reduction in mortality rates occurred as a result of broader public health improvements, prior to the widespread use of vaccines.\n\nWhile the CCDH blithely claims all vaccines are “safe,” they are the only medical discovery where the manufacturers have blanket indemnification against any loss from injury claims. It is not an act of “hate” to ask why this needs to be the case if they are so safe.\n\nThe CCDH states that anyone who asks such questions has fringe and extremist views. They claim consideration of vaccine safety and efficacy should not be permitted and sharing any information or evidence which questions vaccines should be banned. For example, they deny people’s right to know any of the information we are about to discuss. They claim it is all hate driven disinformation which presents a threat to national security.\n\nWhen trialing a vaccine, inoculated animal test subjects can be deliberately exposed to the targeted virus in a challenge trial. The results from challenge trials have blighted all previous attempts to develop a SARS-CoV vaccine.\n\nWhile the test subjects developed the hoped for antibodies and proteins, when they were challenged with the virus their immune systems were found to be hypersensitive. This induced life threatening illness and caused a range of serious health conditions.\n\nThe interferon gamma (IFN-y) induced protein IP10, encoded in humans by the CXCL10 gene, is thought to be a possible cause of the cytokine storm which leads to Acute Respiratory Distress Syndrome (ARDS). Persistent high levels of IP10 send the immune system into overdrive. Much of the immunopathological damage sustained by a small minority of SARS infected patients is thought to arise as a consequence of interferon gamma (IFN-y) related cytokine storms. Italian researchers noted:\n\n“Accumulating studies indicated that the cytokine storm caused by SARS is mainly related to IL-1β, IL-6, IL12A, IFN-γ, IP10 and MCP1, and the cytokine storm caused by MERS is mainly related to IFNγ, TNFα, IL15 and IL17A.”\n\nIt is therefore somewhat concerning that during the challenge trials for the ChAdOx1 nCoV-19 (AZD1222 SARS-CoV-2) vaccine, currently being developed in by AstraZeneca and Oxford University, the following was noted:\n\n“Cytokines in serum were analysed after challenge to monitor immune responses. We observed an upregulation [increased cellular response] in IFN-γ at 1 DPI in ChAdOx1 nCoV-19 vaccinated animals, but not in control animals.”\n\nWhile an upregulation in IFN-y potentially has both beneficial and harmful inflammatory effects, we don’t know what the long term IP10 (CXCL10) levels for inoculated test subjects were because it wasn’t investigated in the vaccine trials. However, an upregulation in IFN-y suggests the possibility of the overexpression of the potentially lethal cytokine storm inducing CXCL10.\n\nThe ChAdOx1 nCoV-19 study only checked IFN-y upregulation for one day post inoculation (1 DPI). Then again, this really isn’t of any concern for the multinational corporations, like AstraZeneca, who make vaccines. As usual, they have been given immunity from prosecution. They have no liability for vaccine injury, and therefore have everything to gain and absolutely nothing to lose.\n\nHaving found these results in all of the 6 macaque monkeys they inoculated, the AstraZeneca-Oxford team felt this was nothing to worry about and went ahead with large scale human trials. The results of these trials raised further reason for concern.\n\nContrary to the claims made by the mainstream media (MSM), this was not a randomized double blind placebo controlled trial (RCT). Instead of an inert placebo, the human test subjects were either given the AstraZeneca-Oxford vaccine or the MenACWY vaccine.\n\nThe possible side effects of the MenACWY vaccine include headaches, nausea, fever, elevated heart rate, loss of consciousness, paralysis and seizures. Using the MenACWY vaccine as your control, to measure relative safety, will probably provide a favorable safety profile providing the recipient of your new vaccine doesn’t immediately drop dead the moment you inoculate them.\n\nThe people who were selected for the AstraZeneca-Oxford Phase 1 and initial Phase 2 trial were all in good health and aged between 18 – 55 years. The median age of the participants was 35 yrs. The average age for those requiring COVID 19 hospital treatment is at least 60 years.\n\nCOVID 19 risks increase appreciably with age. In the UK, more than 89% of those who have died “with” COVID 19 were over 65 years old.\n\nThe UK government have announced their intention to initially vaccinate those in the at risk group and front line key workers. These are primarily older people with serious comorbidity.\n\nWith the exception of younger key workers, the initial phases of the trials didn’t test the vaccine with the demographic who will be the first to receive it. While the trials have now been expanded to include some older people and children, early results indicate the need for considerable caution.\n\nOf the vaccinated group 70% reported fatigue, 68% headaches, 60% had muscle pain and more than 50% ran a fever. In addition, 9% reported temperatures of at least 38°C and an alarming 1% reported a high fever of more than 39°C.\n\nWhile researchers stated that these adverse reaction were “well tolerated,” by the relatively young and healthy test subjects, the same cannot simply be assumed for older at risk groups.\n\nThese adverse reactions present a far greater health risk to the most vulnerable in society. The demographic which the vaccine is supposed to protect.\n\nThese early trial outcomes have been met with universal, uncritical praise by the UK MSM because the AstraZeneca-Oxford vaccine did stimulate an immune response. However, evidence is now emerging that up to 60% of the population may already have general immunity. If this is the case, the relative benefit to vulnerable people, in light of the adverse reactions, would appear questionable.\n\nAccording to the CCDH, none of these concerns have any basis in either fact or science. Anyone raising these concerns is now labeled as a radical extremist and a threat to global health.\n\nBut it’s not just the 13 of us who are under attack. If you follow TTAC, GreenMedInfo, Dr. Mercola, Robert F. Kennedy, Jr. and the Children’s Health Defense Fund, or the other leading voices in the natural health space, CCDH believes that you are too STUPID to think for yourself.\n\nAt first glance, the CCDH report seems to attack only the 13 people mentioned above. But their cries for us to be silenced tell a different narrative. If removing us from online social platforms is truly the solution to ending “misinformation” and “vaccine hesitancy,” it follows that our 60 million+ followers are unintelligent simpletons who will simply shift their thinking to agree with whatever narrative they’re served.\n\nThis is a mistake that fascist regimes have repeatedly made throughout history. The assumption that silencing free speech will also silence free thought is incorrect – and insulting. The communist regime in China has been trying (unsuccessfully) for years to silence free thought by controlling media outlets, the internet, and even the ability to travel freely. In Hong Kong, this oppression has become violent, with democratic leaders rounded up in the middle of the night and detained while citizens yearning for freedom face extreme censorship, curfews, and military rule.\n\nImagine if TTAC published an article claiming that pigs could fly. Would our readers blindly assume that it was true? OF COURSE NOT! That allegation is ludacris and has no foundation in science or reason. But the information that we share is based on tangible data, presented in a way that allows our readers to make informed decisions for themselves.\n\nWhen we say that masks are ineffective against COVID-19 and can lead to health problems, we back it up.\n\nResearch published in the Annals of Internal Medicine at the first of April indicated that “both surgical and cotton masks seem to be ineffective in preventing the dissemination of SARS–CoV-2 from the coughs of patients with COVID-19.”\n\nA study from May of last year found that 81% of healthcare workers developed headaches after wearing masks.\n\nEven the label on boxes of surgical masks warn that “THIS PRODUCT WILL NOT PROVIDE ANY PROTECTION AGAINST COVID-19 (CORONAVIRUS) OR OTHER VIRUSES OR CONTAMINANTS.”\n\nWhen we publish articles expressing concern for the unconstitutional (and, in some cases, anti-Semitic) mandates that New York City Mayor Bill DeBlasio attempted to force regarding the MMR vaccine, we support our argument with facts.\n\nDid you know that From 1959-1962 – just before the vaccine was introduced – measles was fatal in only 0.01% of cases? And while the number of unvaccinated children has quadrupled since 2001, from 2000-2016 measles deaths decreased by 84%.\n\nOr that malnutrition, especially vitamin A deficiency, is a primary cause of about 90,000 measles deaths annually in underdeveloped nations? In the U.S. and other developed countries, up to 92% of hospitalized measles patients are low in vitamin A.\n\nHow about the fact that measles, stroke, Guillain-Barré syndrome, and death are all listed as possible side effects on the package insert for Merck’s ProQuad vaccine?\n\nSince the turn of the millennium, Americans are 84 times more likely to die from contact with a powered lawnmower than from measles. Yet state and local governments continue to pass legislation forcing parents to vaccinate their children… legislation that generates almost $2 BILLION in annual revenue for companies like Merck on the MMR vaccine alone.\n\nBut these aren’t discussions that the CCDH is willing to have. Rather than address our concerns (or the research that supports them), these self-proclaimed authorities choose to label us as lying extremists – despite published research and data to the contrary.\n\nThe CCDH doesn’t believe that you are capable of independent thought or critical thinking. They truly believe that each and every one of you are mindless nitwits who have been tricked into believing us because you were unfortunate enough to stumble across our work. They believe that if they can simply change the proverbial channel, you will immediately change your way of thinking to align with their own.\n\nAnd there’s one more major issue.\n\nBy restricting access to this information, the CCDH and their allies are contributing to the death and detriment of hundreds of thousands around the globe. When we speak out against untested vaccines, unconstitutional lockdowns, or the bullied approach to cancer treatment prominent in most hospitals, we’re doing it to help save lives.\n\nThe Vaccine Adverse Event Reporting System, or VAERS, has documented over 2,500 deaths in recipients of the U.S. COVID-19 vaccines. They’ve reported 559,000 deaths from the virus itself. This amounts to a .002% mortality rate from the vaccine and a .17% population mortality rate from the virus. But there are some major questions regarding those numbers.\n\nVAERS is a passive monitoring system, meaning doctors are not required to report adverse events. Several studies have suggested that as few as 5% of all adverse reactions are reported. If that’s true, the mortality rate for the vaccine may be closer to .04%, or 1 in 2,500.\n\nConversely, reporting for COVID-19 deaths has been wildly unreliable. While the reported death rate in the U.S. is .17%, the global tally is closer to .04%. The most likely explanation for the high mortality rate in the U.S. is simple: false reporting. According to recent data from the CDC, only 6% of deaths attributed to COVID-19 can actually be attributed to the virus. The other 94% were accompanied by other comorbidities, such as late-stage cancer, immune disease, and injuries.\n\nIf a person dies and tests positive for the virus, they’re added to the body count. However, that’s scientifically irresponsible at best and criminally negligent at the worst. There have been reports of people around the country dying from car accidents, drowning, or premature birth who have been counted among the coronavirus victims.\n\nAs infection, hospitalization, and deaths continue to go down (likely because most of the population has already been exposed), the push to vaccinate every man, woman, and child is aggressively underway. Our concerns about the safety of the vaccines, along with the threat of our government forcing us to receive it, are not unwarranted.\n\nOne of the most common attacks we’ve heard on those who support reopening our economy and salvaging our liberties is that we care more about the economy than human life. But the truth is that the two are invariably intertwined.\n\nThe more damage we do to our society and economy, the higher the death toll will rise. In fact, there will almost certainly be more loss of life from the reaction to coronavirus than the disease itself. Reuters summarized a few of them beautifully:\n\nTrapped at home with their abusers, some domestic violence victims are already experiencing more frequent and extreme violence, said Katie Ray-Jones, the chief executive officer of the National Domestic Violence Hotline.\n\nDomestic violence programs across the country have cited increases in calls for help, news accounts reported – from Cincinnati to Nashville, Portland, Salt Lake City and statewide in Virginia and Arizona. The YWCA of Northern New Jersey, in another example, told Reuters its domestic violence calls have risen up to 24%.\n\n“There are special populations that are going to have impacts that go way beyond COVID-19,” said Ray-Jones, citing domestic violence victims as one.\n\nStudents, parents, and teachers all face challenges adjusting to remote learning, as schools nationwide have been closed and online learning has begun.\n\nSome experts are concerned that students at home, especially those living in unstable environments or poverty, will miss more assignments. High school students who miss at least three days a month are seven times more likely to drop out before graduating and, as a result, live nine years less than their peers, according to a Robert Wood Johnson Foundation report.\n\nAmong the most vulnerable: the more than 6 million special education students across the United States. Without rigorous schooling and therapy, these students face a lifetime of challenges.\n\nSpecial needs students “benefit the most from highly structured and customized special education,” said Sharon Vaughn, executive director of the The Meadows Center for Preventing Educational Risk at the University of Texas. “This means that they are the group that are most likely to be significantly impacted by not attending school both in the short and long term.”\n\nIn New Jersey, Matawan’s Megan Gutierrez has been overwhelmed with teaching and therapy duties for her two nonverbal autistic sons, eight and 10. She’s worried the boys, who normally work with a team of therapists and teachers, will regress. “For me, keeping those communications skills is huge, because if they don’t, that can lead to behavioral issues where they get frustrated because they can’t communicate,” Gutierrez said.\n\nIn Europe and the United States, suicide rates rise about 1% for every one percentage point increase in unemployment, according to research published by lead author Aaron Reeves from Oxford University. During the last recession, when the unemployment in the United States peaked at 10%, the suicide rate jumped, resulting in 4,750 more deaths. If the unemployment rate increases to 20%, the toll could well rise.\n\n“Sadly, I think there is a good chance we could see twice as many suicides over the next 24 months than we saw during the early part of the last recession,” Reeves told Reuters. That would be about 20,000 additional dead by suicide in the United States and Europe.\n\nLess than three weeks after extreme suppression measures began in the United States, unemployment claims rose by nearly 10 million. Treasury Secretary Steven Mnuchin warned the rate could reach 20% and Federal Reserve economists predicted as high as 32%. Europe faces similarly dire forecasts.\n\nSome researchers caution that suicide rates might not spike so high. The conventional wisdom is that more people will kill themselves amid skyrocketing unemployment, but communities could rally around a national effort to defeat COVID-19 and the rates may not rise, said Anne Case, who researches health economics at Princeton University. “Suicide is hard to predict even in the absence of a crisis of Biblical proportions,” Case said.\n\nThis week, the Air Force Academy in Colorado Springs, Colorado, relaxed its strict social isolation policies after the apparent suicides of two cadet seniors in late March, The Gazette, a Colorado Springs newspaper, reported. While juniors, sophomores and freshmen had been sent home, the college seniors were kept isolated in dorms, and some had complained of a prison-like setting. Now, the seniors will be able to leave campus for drive-thru food and congregate in small groups per state guidelines.\n\nLocal health departments run programs that treat chronic diseases such as diabetes. They also help prevent childhood lead poisoning and stem the spread of the flu, tuberculosis and rabies. A severe loss of property and sales tax revenue following a wave of business failures will likely cripple these health departments, said Adriane Casalotti, chief of government affairs with the National Association of County and City Health Officials, a nonprofit focused on public health.\n\nAfter the 2008 recession, local health departments in the U.S. lost 23,000 positions as more than half experienced budget cuts. While it’s become popular to warn against placing economic concerns over health, Casalotti said that, on the front lines of public health, the two are inexorably linked. “What are you going to do when you have no tax base to pull from?” she asked.\n\nCarol Moehrle, director of a public health department that serves five counties in northern Idaho, said her office lost about 40 of its 90 employees amid the last recession. The department had to cut a family planning program that provided birth control to women below the poverty line and a program that tested for and treated sexually transmitted diseases. She worries a depression will cause more harm.\n\n“I honestly don’t think we could be much leaner and still be viable, which is a scary thing to think about,” Moehrle said.\n\nRises in unemployment during large recessions can set in motion a domino effect of reduced income, additional stress and unhealthy lifestyles. Those setbacks in income and health often mean people die earlier, said Till von Wachter, a University of California Los Angeles professor who researches the impact of job loss. Von Wachter said his research of past surges in unemployment suggests displaced workers could lose, on average, a year and a half of lifespan. If the jobless rate rises to 20%, this could translate into 48 million years of lost human life.\n\nVon Wachter cites measures he believes could mitigate the effects of unemployment. The Coronavirus Aid, Relief, and Economic Security Act approved by the White House last week includes emergency loans to businesses and a short-time compensation program that could encourage employers to keep employees on the payroll.\n\nYoung adults entering the job market during the coronavirus suppression may pay an especially high price over the long term. First-time job hunters seeking work during periods of high unemployment live shorter and unhealthier lives, research shows. An extended freeze of the economy could shorten the lifespan of 6.4 million Americans entering the job market by an average of about two years, said Hannes Schwandt, a health economics researcher at Northwestern University, who conducted the study with von Wachter. This would be 12.8 million years of life lost.\n\nThousands of college graduates will enter a job market at a time global business is frozen. Jason Gustave, a senior at William Paterson University in New Jersey who will be the first in his family to graduate from college, had a job in physical therapy lined up. Now his licensure exam is postponed and the earliest he could start work is September.\n\n“It all depends on where the economy goes,” he said. “Is there a position still available?”\n\nEven the U.N., which has vigorously supported the draconian suspension of industry, society, and freedom, says that “hundreds of thousands of children could die this year due to the global economic downturn sparked by the coronavirus pandemic and tens of millions more could fall into extreme poverty as a result of the crisis”\n\nOur opposition to the lockdowns is not “misinformation.” It stems from genuine, reasonable concern for the loss of life and long-term damage to public welfare resulting from the lockdowns. In July of last year, the Associated Press reported that virus-linked hunger resulting from the economic shutdown was responsible for 10,000 child deaths each month.\n\nBut these are things the CCDH isn’t willing to discuss.\n\nThese are liars and bullies who choose to ignore opinions – and facts – that don’t fit their narrative. They want to stifle our fundamental rights to free speech and thought and believe that YOU are too stupid to think for yourself.\n\nEveryone, including the CCDH, has the right to express their views and partake in robust and open debate. However, the CCDH’s supremacist beliefs render them incapable of doing so, as they cannot tolerate anything which contradicts or challenges their ideology and objectives. The question we should be asking is:\n\nWhy would an organization spend so much time and money to silence us? How did the group become so prominent and so well-funded in just over 2 years? What is the real motivation for so aggressively and tirelessly working to silence anyone who raises legitimate questions about the safety and efficacy of vaccines?\n\nBecause the CCDH and it’s partners are a corrupt group of mercenaries funded by the global elite for the sole purpose of pushing a new globalist agenda while ushering in an historic era of censorship and despotism.\n\nIn Part 2, we’ll uncover the CCDH’s links to governments, think tanks, and other special interest groups. Our society is barreling towards a technocratic dystopia, with groups like the CCDH leading the vanguard. We’ll look at how we got here, what to expect next, and why this war is far from over.\n• Please join us in responding to the CCDH’s piece on their Instagram, Facebook, and Twitter in order to hold them accountable and call them out on their HATE.\n• Join our partner organization, United Medical Freedom PAC, which advocates for your God-given rights in the face of an increasingly tyrannical agenda intent on stripping you of all your freedoms, and consider making a one time donation.\n• Please join us on our Telegram channel and join a CENSORSHIP FREE discussion about all the things that may get you kicked off the other social media outlets – like vaccine truth, Cov1D, natural cancer remedies, and “unallowed” political views.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cancel Culture, Digital \"Hate\" Groups & the \"Anti\" Anti-Vaxx Industry | Part 1", "description": "The CCDH has accused 13 people of leading the anti-vax movement online, calling for social media outlets to censor the information.", "url": "https://thetruthaboutcancer.com/cancel-culter-anti-vax-part-1/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:tag": "join1", "article:section": "Featured Articles", "article:published_time": "2021-03-27T19:40:38-04:00", "article:modified_time": "2021-03-29T18:06:34-04:00", "updated_time": "2021-03-29T18:06:34-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210328154239/Header-image-cancel-culture.jpeg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">It’s been 24 hours and platforms are yet to respond to <a href=\"https://twitter.com/USRepMikeDoyle?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">@USRepMikeDoyle</a>‘s demand for action.</p><p>Every day they fail to act, the Disinformation Dozen are allowed to carry on spreading disinformation that costs lives.</p><p>It’s time for <a href=\"https://twitter.com/Facebook?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">@Facebook</a>, <a href=\"https://twitter.com/instagram?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">@Instagram</a>, <a href=\"https://twitter.com/Twitter?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">@Twitter</a> and <a href=\"https://twitter.com/YouTube?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">@YouTube</a> to act. <a href=\"https://t.co/bDBCQfXmTT\">https://t.co/bDBCQfXmTT</a></p><p>— Center for Countering Digital Hate (@CCDHate) <a href=\"https://twitter.com/CCDHate/status/1375516897165275137?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">March 26, 2021</a></p></blockquote>"], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://twitter.com/CCDHate/status/1367172135295324164", "https://twitter.com/CCDHate/status/1367172135295324164", "https://www.dailymail.co.uk/news/article-9402443/The-disinformation-dozen-Two-thirds-anti-vaccine-content-social-media-spread-12-people.html#comments", "https://www.dailymail.co.uk/news/article-9402443/The-disinformation-dozen-Two-thirds-anti-vaccine-content-social-media-spread-12-people.html#comments", "https://www.instagram.com/p/CMzyS4ily9n/?igshid=ctfn3oj4by6s", "https://www.facebook.com/ccdhate/photos/a.2473529916199101/2987103701508384/", "https://twitter.com/CCDHate/status/1374769469818556421", "https://thetruthaboutvaccines.com/stop-damage-mrna-vaccines/", "https://www.facebook.com/ccdhate/photos/a.2473529916199101/2987103701508384/", "https://www.greenmedinfo.com/blog/spy-agencies-threaten-take-out-mercola", "https://twitter.com/USRepMikeDoyle?ref_src=twsrc%5Etfw", "https://twitter.com/Facebook?ref_src=twsrc%5Etfw", "https://twitter.com/instagram?ref_src=twsrc%5Etfw", "https://twitter.com/Twitter?ref_src=twsrc%5Etfw", "https://twitter.com/YouTube?ref_src=twsrc%5Etfw", "https://t.co/bDBCQfXmTT", "https://twitter.com/CCDHate/status/1375516897165275137?ref_src=twsrc%5Etfw", "https://thetruthaboutcancer.com/cancel-culture-anti-vax-part-2/", "https://www.instagram.com/p/CMzyS4ily9n/?igshid=ctfn3oj4by6s", "https://www.facebook.com/ccdhate/photos/a.2473529916199101/2987103701508384/", "https://twitter.com/CCDHate/status/1374769469818556421", "https://medicalfreedompac.com/", "https://medicalfreedompac.com/donate/", "https://t.me/TheTruthAboutCancer_Vaccines", "http://thetruthaboutcancer.com/join-free/?promo_name=join-free&promo_id=join1&promo_creative=ttac-blog&promo_position=blog-cta&a_aid=5c93e0cd33850", "http://thetruthaboutcancer.com/join-free/?promo_name=join-free&promo_id=join1&promo_creative=ttac-blog&promo_position=blog-cta&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["PAUL", "Jenni", "L Johnson", "Ernest Harris", "Skye", "Li", "Debra Barone", "DEBBIE", "Kathleen A Austin", "Alee", "Marilyn Vandekieft", "Barbara Seling", "Cheryl", "john"], "publish_date": "2021-03-27T19:40:38-04:00"}