{"result_id": "308009", "URL": "https://thetruthaboutcancer.com/chemotherapy-reduces-covid-jab-protection/", "timestamp": "2023-04-25 17:35:18 CEST+0200", "meta": {"description": "New studies show that the COVID shots are less effective in patients who have undergone chemotherapy treatments for cancer.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/chemotherapy-reduces-covid-jab-protection/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Chemotherapy Reduces COVID Jab Protection, Study Says", "cleaned_text": "Researchers from the Medical University of Vienna and Vienna General Hospital, Austria, have demonstrated that the type of cancer treatment patients receive influences their COVID-19 shot response. Specifically, they found those undergoing chemotherapy had lower antibody levels than patients undergoing targeted therapy.\n\nThe team studied antibody production following coronavirus vaccination in over 600 participants in two patient groups and in a control group made up of healthy hospital staff. “Patients with solid cancers were included, as were patients with blood cancers,” added Matthias Preusser who led the study published in JAMA Oncology.\n\nIn both healthy individuals and cancer patients, antibody levels were higher after full immunization with the licensed coronavirus shots than after only one dose but, even after full vaccination, antibody levels were higher in healthy individuals than in cancer patients. No differences were found between the various jabs, with most people having received messenger RNA (mRNA) shots in the study.\n\n“Overall, our data show that most cancer patients develop antibodies against the SARS-CoV-2 Spike (S) protein after vaccination and therefore vaccination is generally recommended, but that vaccine protection is reduced by some cancer treatments,” concluded Preusser.\n\nA new study done by the University of Arizona Health Sciences has discovered the clash between chemotherapy patients and COVID-19. Results showed that chemo patients have a lower immune response to two doses of the injection, while some had no response at all.\n\nBut natural immunity to the coronavirus has continued to be substantially better than “vaccine”-induced immunity.\n\nImmunological studies have documented a steady decline of antibody levels among vaccinated individuals. Long-term follow-up of the gene-therapy trial participants has revealed a growing risk of breakthrough infection. And health-care records from countries such as Israel, the United Kingdom and elsewhere all show that COVID-19 shots are losing their strength, at least when it comes to keeping a lid on transmissible disease.\n\n“Things wane,” says Nicole Doria-Rose, an immunologist at the US National Institute of Allergy and Infectious Diseases in Bethesda, Maryland. But not all things wane equally.\n\n‘Neutralizing’ antibodies that can intercept viruses before they infiltrate cells might not have much staying power. Levels of these molecules typically shoot up after vaccination, then quickly taper off months later. “That’s how vaccines work,” Doria-Rose says.\n\nEven the Centers for Disease Control confirms COVID “vaccine” effectiveness against infection has decreased over time, and is less effective in combating the Delta variant.\n\n“The data we will publish today and next week demonstrate the vaccine effectiveness against SARS CoV-2 infection is waning,” CDC Director Dr. Rochelle Walensky said during a press briefing. “And even though our vaccines are currently working well to prevent hospitalizations, we are seeing concerning evidence of waning vaccine effectiveness over time, and against the Delta variant.”\n\nThe CDC released three new studies focusing on the jabs’ effectiveness in light of the Delta variant.\n\nOne study assessed Pfizer and Moderna’s effectiveness over time against infections among nursing home residents, and found it dropped from 75% pre-Delta to 53% when Delta became dominant. The study didn’t differentiate between asymptomatic, symptomatic, and severe infections.\n\nAnother study used data from 21 hospitals to estimate the effectiveness of Pfizer and Moderna mRNA shots against hospitalization over time. Among 1,129 patients who received two doses of a mRNA injection, effectiveness was 86% 2 to 12 weeks after vaccination and 84% at 13 to 24 weeks.\n\nThe third study, using New York state data, found all three shots, effectiveness against infection dropped from 92% in early May to 80% at the end of July, but the effectiveness against hospitalization remained relatively stable.\n\nData from the three reports in the CDC’s Morbidity and Mortality Weekly Report helped convince the Biden administration to recommend booster shots to people eight months after receiving their second dose, despite no completed late-stage clinical trials assessing the safety, efficacy and immunogenicity of a third dose.\n\nAnd that’s nothing compared to the risks that accompany the jab. At the time of writing, the survival rate of those who tested positive for COVID-19 was over 98%. But the rates of complications are far higher.\n\nAnalysis of medical data suggests that boys aged 12 to 15, with no underlying medical conditions, are four to six times more likely to be diagnosed with vaccine-related myocarditis than ending up in hospital with Covid over a four-month period.\n\nMost children who experienced the rare side-effect had symptoms within days of the second shot of the Pfizer/BioNTech experiment, though a similar side-effect is seen with the Moderna jab. About 86% of the boys affected required some hospital care, the authors said.\n\nThe study relied heavily on data from the Vaccine Adverse Event Reporting System, or VAERS. As of October 1st, there were 16,310 reported deaths associated with the COVID vaccines (65% of all vaccine-related deaths reported since 1990). There were 75,605 hospitalizations associated with the COVID jab (49% of all vaccine-related hospitalizations since 1990). There were 701,559 adverse events associated with the COVID shot (49% of all vaccine-related adverse events since 1990).\n\nThe Lazarus Report estimates that only 1% of vaccine-related adverse events are reported. This means that the actual number of hospitalizations and deaths related to the vaccines may be closer to 7.5 million and 1.6 million, respectively.\n\nSince the first Emergency Use Authorization (EUA) was awarded by the corrupt FDA for COVID jabs, those with immunodeficiency have been targeted heavily. According to the FDA, the “booster shots” (a third dose of the same ineffective jab they’ve been peddling) are approved under the EUA for “certain immunocompromised individuals, specifically, solid organ transplant recipients or those who are diagnosed with conditions that are considered to have an equivalent level of immunocompromise.”\n\nHere’s how the National Institutes of Health (NIH) defines “immunocompromised”:\n\n“People who are immunocompromised have a reduced ability to fight infections and other diseases. This may be caused by certain diseases or conditions, such as AIDS, cancer, diabetes, malnutrition, and certain genetic disorders. It may also be caused by certain medicines or treatments, such as anticancer drugs, radiation therapy, and stem cell or organ transplant.”\n\nSo the COVID “vaccines,” which are less effective than natural immunity, diminish over time, and carry substantial health risks, are being targeted to the very people for whom – according to the “experts” – the “vaccine” is least effective.\n\nWelcome to the new America, folks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Chemotherapy Reduces COVID Jab Protection, Study Says", "description": "New studies show that the COVID shots are less effective in patients who have undergone chemotherapy treatments for cancer.", "url": "https://thetruthaboutcancer.com/chemotherapy-reduces-covid-jab-protection/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2021-10-14T23:06:51-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20211014225021/TTAC-Chemotherapy_Covid-Web-600x330.jpg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutvaccines.com/covid-jab-more-dangerous-than-virus/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Sandy Forrest", "Brian"], "publish_date": "2021-10-14T23:06:51-04:00"}