{"result_id": "308015", "URL": "https://thetruthaboutcancer.com/fight-back-censorship-video/", "timestamp": "2023-04-25 17:35:27 CEST+0200", "meta": {"description": "Censorship is at an all-time high, and it’s more important now than ever to have platforms where we can speak the truth.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/fight-back-censorship-video/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Now is the Time to Fight Back Against Censorship [VIDEO]", "cleaned_text": "Now, think about it, the health freedom movement has never been larger. The health freedom movement is exploding. We have people now aware of the importance of medical choice, of medical freedom, and aware of the dangers of medical experiments that are being forced upon people. Right now, all around the world, do you realize that about half the globe is with us now? And in years past, it might have been 5%. Now, it’s 50%. We’ve grown the health freedom movement by a factor of 10. I mean, we as humanity, and of course, we can sort of credit the vaccine companies for being so evil and wicked that they forced people to realize what was going on, but thank God, thank God that we have the Truth About Cancer and all the speakers that you are watching and listening to there because this message of health freedom and of truth and of medical choice, this message of human rights and personal Liberty has never been more powerful and more important.\n\nDo you realize that right now, we have with us half the police all across America? Half the police are with us, half the firefighters. We have half the nurses, half the doctors, half the medical workers. We have half of the laborers, half of … I mean, you think of it, you name it. Truck drivers, the port crane operators, the school teachers, parents, they are with us. About half the world is with us now, and that means that this movement is unstoppable. That means we’ve reached that critical mass, that tipping point. From here forward, humanity will never go back to sleep and delegate the rights over their bodies and their blood and their choice to corrupt corporations and clueless bureaucrats and dishonest scientists and paid-off medical journals. We will never go back to that. The awakening is here, and frankly, that awakening, it’s due to people like you, all of you there, who support this movement and all the speakers and the coordinators and Ty and Charlene and everybody that has taken part in this.\n\nYou’ve seen what has happened with the censorship of YouTube, the censorship of big tech and even the science journals and the hospitals preventing people from even using ivermectin, preventing doctors from prescribing hydroxychloroquine. We’re living under a kind of medical embargo in this nation right now. The FDA is confiscating inbound shipments of ivermectin from other countries in order to maximize casualties in America, to kill American people, and they think they can control this conversation by having censorship of big tech, and they are wrong.\n\nThey cannot control us. They cannot silence us. They cannot separate us. They cannot isolate us. Look at you. There you are. You’re joined together right now. We are coming together as a species. Humanity is coming together to defeat the big pharma evils that threaten the very survival of the human race today. We are coming together like never before, and there are certain tasks that must be completed, certain aspects of architecture, like the piece that I’m working on, which is the Brighteon infrastructure and superfood manufacturing infrastructure, but so many other people, like Del Bigtree, having those nurses and whistleblowers there in-person to spread their message.\n\nDel’s doing an amazing job, and Project Veritas even, having the whistleblowers who worked inside Pfizer, and each of you plays a role in this, and we each have different roles, and sometimes our roles require us to really focus and handle the issues onsite, in-person, which is what I’m doing right now in Texas, and that’s why I can’t be there, but you know I’m there in spirit, and we are together in our hearts and minds working for humanity. We know exactly what we’re doing. We are working to uplift and enhance knowledge across the human race so that no one need suffer the tyranny of toxic vaccines, spike protein injections, biological weapons, death by ventilator suffocation.\n\nWe want to live in a world where those things are absent and where the people who committed those things are indicted and prosecuted for their crimes against humanity. And in order to do that, we have to be able to speak. We have to be able to join together like you’re doing right now. We have to be able to have vectors through which we can tell the truth.", "opengraph": {"locale": "en_US", "type": "article", "title": "Now is the Time to Fight Back Against Censorship [VIDEO]", "description": "Censorship is at an all-time high, and it's more important now than ever to have platforms where we can speak the truth.", "url": "https://thetruthaboutcancer.com/fight-back-censorship-video/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Videos", "article:published_time": "2022-06-22T00:01:05-04:00", "article:modified_time": "2022-06-22T22:49:30-04:00", "updated_time": "2022-06-22T22:49:30-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20220622224918/LE-2021_Mike-Adams_CLIP_Censorship-Now-Time-to-Fight-Back_1200x628.jpg", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Christy Guerra", "Regan A Mason", "arnopi"], "publish_date": "2022-06-22T00:01:05-04:00"}