{"result_id": "308045", "URL": "https://thetruthaboutcancer.com/health-freedom-activists-file-antitrust-lawsuit/", "timestamp": "2023-04-25 17:36:12 CEST+0200", "meta": {"description": "Ty and Charlene Bollinger are joining an antitrust lawsuit against the world's largest media conglomerates to silence their competitors.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/health-freedom-activists-file-antitrust-lawsuit/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "BREAKING! Alternative Healthcare Activists File Antitrust Lawsuit Against Legacy Media for Efforts to Silence Rivals on Internet Platforms", "cleaned_text": "Ty and Charlene Bollinger, founders of The Truth About Cancer, are joining Robert F. Kennedy Jr’s Children’s Health Defense, respected medical professionals, healthcare freedom activists, along with independent media outlets, to address the collusion between five of the world’s largest media conglomerates to silence smaller publishing competitors in violation of free speech and antitrust laws.\n\nClick Here to View the Official Complaint Filing\n\nAMARILLO, TX—Filed today, a first of its kind antitrust action against the British Broadcasting Company (BBC), the Washington Post, Reuters, and Associated Press for many millions of dollars seeks to address the censorship of healthcare freedom advocates, activists, journalists, and medical professionals who dared to question the narrative relating to the COVID-19 pandemic, the government response, and vaccine mandates.\n\nAccording to the lawsuit, a partnership called the “Trusted News Initiative”, or TNI, was created to exclude rival publishers from the dominant internet platforms who engage in reporting that challenges or competes with members of the TNI. This coordinated effort is a classic form of a “group boycott” for the purpose of removing smaller publishers from leading internet platforms, damaging their ability to compete or even survive.\n\nTNI members include Legacy Media companies including the Washington Post, BBC, Associated Press, Los Angeles Times, and Reuters, along with behemoth Big Tech companies including Meta (which owns and controls Facebook and Instagram), Google (which owns and controls YouTube), Microsoft (which owns and controls LinkedIn), and Twitter. Together, these companies control at least 85% of the online social media news market, 90% of the overall social media market, 90% of the social networking market, 75% of the video hosting market, and 95% of the search-engine market.\n\nThe lawsuit reveals that in March of 2020, Big Tech and the Legacy Media entered into an “industry partnership” called the “Trusted News Initiative”, or TNI. The partnership was launched by BBC Director-General Tony Hall, with the agreement that members of the TNI “work together to . . . ensure that disinformation myths are stopped in their tracks.”\n\nMembers of the TNI include legacy media outlets; the British Broadcasting Company, the Washington Post, Reuters, Associated Press, and Los Angeles Times, along with social media and tech giants Twitter, Facebook, Microsoft, YouTube, LinkedIn and Google. The members of the TNI have an 85% market share of the online social media news market, 90% of the overall social media market, 90% share of the social networking market, 75% of the video hosting market, and over 90% of the search-engine market.\n\nThese media conglomerates and allies in Big Tech worked hand-in-hand through the “Trusted News Initiative” to silence Ty and Charlene Bollinger’s efforts to educate Americans on the dangers of not only the COVID-19 vaccines, but as well as also other harsh pharmaceutical treatments for life-threatening illnesses.\n\nThis illegal boycotting and censorship have deprived Americans of essential information about COVID-19, masks, lockdowns, vaccines, and alternative early treatments that could have saved countless lives.\n\nThe Bollingers were simultaneously labeled among the “disinformation dozen” by the Biden administration and maligned by the mainstream media due to questioning the COVID-19 vaccines, which ultimately led to them being removed from most major internet platforms. \n\n\n\nThey have spent decades educating Americans about alternative medical treatments, including a NYT bestselling book called “The Truth About Cancer”, which has sold over 250,000 copies, along with millions of people viewing their content on major social media platforms before being banned.\n\nBy their own admission, members of the Trusted News Initiative agreed to work together, and have in fact worked together, to exclude from the world’s dominant Internet platforms rival news publishers who engage in reporting that challenges and competes with TNI members’ reporting on certain issues relating to COVID-19 and U.S. politics.\n\nFor example, TNI members deemed the following to be “misinformation” that could not be published on the world’s dominant Internet platforms:\n• Claims that COVID originated in a laboratory in Wuhan, China\n• Claims that the COVID vaccines do not prevent infection\n• Claims that vaccinated persons can transmit COVID to others\n• Claims that compromising emails and videos were found on a laptop belonging to Hunter Biden.\n\nAll these claims were and are either true or, at a minimum, well within the ambit of legitimate reporting.\n\nThe TNI did not only prevent Internet users from making these claims; it shut down online news publishers who simply reported that such claims were being made by potentially credible sources, such as scientists and physicians.\n\nAlong with veteran healthcare freedom activists Ty and Charlene Bollinger, Dr. Joseph Mercola, Ben Swann, independent news publisher and founder of The Gateway Pundit Jim Hoft, and independent journalists Todd Wood, Erin Elizabeth Finn, and Dr. Ben Tapper join Robert F. Kennedy Jr. as plaintiffs.\n\nImportant legal precedent is clear on the issues addressed in the antitrust lawsuit, namely Associated Press v. United States, 326 U.S. 1, 20 (1945).\n\n“Freedom to publish means freedom for all, and not for some. Freedom to publish is guaranteed by the Constitution, but freedom to combine to keep others from publishing is not. Freedom of the press from governmental interference under the First Amendment does not sanction repression of that freedom by private interests.”\n\nFor more information regarding the antitrust lawsuit against Washington Post, British Broadcasting Company, Reuters, and Associated Press, please contact Kristin Davis at Kristin@ThinkRightPR.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "BREAKING! Alternative Healthcare Activists File Antitrust Lawsuit Against Legacy Media for Efforts to Silence Rivals on Internet Platforms", "description": "Ty and Charlene Bollinger are joining an antitrust lawsuit against the world's largest media conglomerates to silence their competitors.", "url": "https://thetruthaboutcancer.com/health-freedom-activists-file-antitrust-lawsuit/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2023-01-10T19:10:34-04:00", "article:modified_time": "2023-01-13T09:23:46-04:00", "updated_time": "2023-01-13T09:23:46-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230110184017/High-Res-Ty-and-Char.png", "image:width": "514", "image:height": "512"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.prnewswire.com/news-releases/alternative-healthcare-activists-file-antitrust-lawsuit-against-legacy-media-for-efforts-to-silence-rivals-from-internet-platforms-301719310.html", "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230110191915/TNI-Complaint-1.10.22-Amarillo.pdf", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Darlene Shafer"], "publish_date": "2023-01-10T19:10:34-04:00"}