{"result_id": "308019", "URL": "https://thetruthaboutcancer.com/breaking-fda-approves-pfizer-biontech-covid-19-vaccine-behind-closed-doors/", "timestamp": "2023-04-25 17:35:35 CEST+0200", "meta": {"description": "On Monday, August 23, 2021, the FDA \"approved\" Pfizer's COVID-19 jab for 16 years and older - officially declaring it \"safe and effective\"...", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/breaking-fda-approves-pfizer-biontech-covid-19-vaccine-behind-closed-doors/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "BREAKING: FDA \"Approves\" Pfizer/BioNTech COVID-19 Vaccine", "cleaned_text": "On Monday, August 23, 2021, the FDA “approved” Pfizer’s COVID-19 jab for 16 years and older – officially declaring it “safe and effective” – without even allowing public discussion or holding a formal advisory committee meeting to discuss data.\n\nDespite the fact that the vaccinated people can still contract the virus, and despite the fact that the original safety trials aren’t scheduled to be completed until 2023, according to The Washington Post, this vaccine approval was the fastest in FDA history, coming less than four months after Pfizer/BioNTech filed for licensing in May.\n\nIn the words of Jon Rappoport:\n\nAny smidgen of credibility that the FDA previously had is gone.\n\nThe FDA has zero long-term data in hand, while emerging short-term data shows the COVID-19 jab is deadly, permanently harming immune systems, and by the FDA’s own flawed counting system actually increasing COVID-19 cases.\n\nBut honestly, is anyone surprised?\n\nAre we surprised when the mafia kills people and puts their bodies in 50-gallon drums full of acid?\n\nAre we surprised when a lion eats a gazelle? Or when a shark attacks a swimmer?\n\nAnd it’s in the FDA’s nature to approve just about any pharmaceutical intervention that is thrown their direction, even if adverse reactions include death. Each year, more than 2.2 million Americans suffer serious adverse reactions from FDA-approved drugs, and the FDA openly admits that there are “over 106,000 deaths annually” due to adverse drug reactions from Big Pharma’s drugs that the FDA has “approved.”\n\nFor example, Pfizer’s drug Bextra was granted FDA approval in 2001. In 2005, the drug was recalled for adverse heart effects including death, heart attack, and stroke, as well as increased risk for serious skin reactions, such as epidermal necrolysis, erythema multiforme, and Stevens-Johnson syndrome. Bextra also had the potential to cause gastrointestinal bleeding.\n\nIn 2009 Bextra was at the center of the “largest health care fraud settlement and the largest criminal fine of any kind ever.” Pfizer paid a $2.3 billion civil and criminal fine. Pharmacia and Upjohn, a Pfizer subsidiary, violated the United States Food, Drug and Cosmetic Act for misbranding Bextra “with the intent to defraud or mislead.”\n\nYou’ve heard about Vioxx, right? According to Drugwatch, at the time of its recall in 2004, “Vioxx had been taken by some 4 million Americans. Out of those patients who took Vioxx, the arthritis drug may have caused approximately 140,000 heart attacks resulting in an estimated 60,000 deaths.”\n\nWe could go on, but the point should be clear: The FDA routinely approves drugs that are later found to be unsafe, ineffective, and even deadly.\n\n“Why would the FDA approve these toxic, deadly drugs?”\n\nHere’s why: It’s called regulatory capture, which is a phenomenon that occurs when an allegedly “objective” regulatory agency (like FDA) ends up “promoting” the industries they are supposed to be “regulating.”\n\nThe reality is that the FDA has been captured for a long time. In a 2016 study published in the British Medical Journal, the majority of the FDA’s hematology-oncology reviewers who left the agency ended up working or consulting for Big Pharma. In a 2018 investigation by Science magazine, 11 of 16 FDA reviewers who worked on over two dozen drug approvals and subsequently left the agency were working or consulting for the companies they recently regulated.\n\nFor 40 years, every single FDA commissioner has gone on to sit on the board of a Big Pharma company (except one). Scott Gotlieb, who served as commissioner from 2017-2019, now sits on Pfizer’s board.\n\nJanet Woodcock was named Acting Commissioner of Food and Drugs on January 20, 2021. If the name sounds familiar, yes this is the same woman who became director of the FDA’s Center for Drug Evaluation and Research in 1994, the year before the agency approved OxyContin. Woodcock presided over one of the worst regulatory agency failures in U.S. history as the opioid epidemic (fueled by the FDA’s approval of dangerous drugs like OxyContin) ravaged our nation.\n\n“The FDA’s approval of this vaccine is a milestone as we continue to battle the COVID-19 pandemic,” said Woodcock, in a press release issued Monday. Woodcock was once considered a possible nominee for the permanent job of FDA Commissioner, despite resistance from numerous senators who sent a letter to the White House in March calling for new leadership at the FDA, citing its “long track record approving dangerous opioids without considering public health.” In addition to the senators, a coalition of nonprofit advocacy groups asserted that Woodcock’s “inadequate” oversight of the FDA during the opioid crisis should disqualify her.\n\nIn a letter to officials at the Department of Health and Human Services, the coalition wrote:\n\nThe letter accused Woodcock of “dereliction of duty” for allowing opioid manufacturers to spend years disseminating false claims that narcotic painkillers were less addictive and more effective than they really were, contributing to the rise of mass opioid prescribing and spread of an epidemic that has claimed more than 500,000 lives.\n\nMore recently, the White House was dissatisfied over how the FDA under Dr. Woodcock handled the controversial approval of an Alzheimer’s drug over objections of some staff members and members of an advisory committee.\n\nIn the case of Pfizer’s latest FDA “approval,” there are more questions than answers. And those problems begin at the very top of the first page of the vaccine insert:\n\n“COMIRNATY is a vaccine indicated for active immunization to prevent coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) in individuals 16 years of age and older.”\n\nAccording to the CDC, “COVID-19 vaccines protect people against severe illness” but “breakthrough infections are expected. COVID-19 vaccines… are not 100% effective.”\n\nWhy is the FDA granting approval for a drug designed to stop COVID-19 when we know for an absolute fact that it does not?\n\nThe insert also confirms that the safety of Comirnaty is based on only two studies. The first has a sample size of only 60 participants. And get this … the second study had over 44,000 participants, but participants in the placebo group were offered the jab in December 2020!\n\nThis means that the vast majority of those who received a saline placebo injection were TOLD THEY HAD RECEIVED A PLACEBO AND OFFERED THE REAL SHOT! Placebos don’t work if you know you received a placebo, and control groups cease to be control groups when they’re given the same drugs as the vaccine groups. In other words, there was no true placebo group.\n\nThis is science 101. And the information provided above is literally in the package insert for Pfizer’s latest poison vaccine. Pfizer publicly admits that the study supporting the approval of the drug was RUINED.\n\nConspicuously, there has been no mention of the 13,608 deaths reported after administration of the COVID-19 shot. There have been more adverse events reported since these shots were released than in the 30 years prior. THIRTY YEARS!\n\nThe Pfizer jab, named “Comirnaty,” is the first injection for COVID-19 to be granted full approval by the FDA. Officials hope that full approval will make it easier for employers, the military, and universities to mandate vaccination and that it will somehow persuade people (who have seen the shocking number of adverse events and deaths and who are hesitant about the vaccine) that it is “safe and effective.”\n\nSpeaking of the military, just minutes after the FDA’s announcement, Pentagon spokesperson John Kirby announced that the military is now requiring soldiers to get the jab under threat of court martial.\n\nIn an article published August 20th in the British Medical Journal, the authors mention Kim Witczak, a drug safety advocate who serves as a consumer representative on the FDA’s Psychopharmacologic Drugs Advisory Committee, who is one of the more than 30 signatories of a citizen petition which called on the FDA to refrain from fully approving any COVID-19 vaccine to gather more data. She warned that without a [public FDA] meeting “we have no idea what the data looks like. It is already concerning that full approval is being based on 6 months’ worth of data despite the clinical trials designed for two years. There is no control group after Pfizer offered the product to placebo participants before the trials were completed.”\n\nApparently, the FDA ignored Ms. Witczak’s warnings, even though she is a member of one of their advisory committees. Amidst a tsunami of reports of COVID-19 vaccine injuries and deaths from around the world, the FDA is proving it is an agency that will certify maiming and killing without hesitation.\n\nLast year the FDA said it was “committed to use an advisory committee composed of independent experts to ensure deliberations about authorisation or licensure are transparent for the public.” But in a letter to the British Medical Journal, the FDA said it did not believe a meeting was necessary ahead of the expected full FDA approval.\n\nAs vaccine pushers celebrate the approval, we have a question: “How can a vaccine be fully approved when we don’t even know the optimal number of doses?”\n\nWe have another question: “Doesn’t it seem suspicious that Big Pharma provides 75% of the FDA’s drug review budget?”\n\nThe mantra of the MSM is that we should take the COVID-19 jab because “experts say they’re safe and effective” … but why do they never tell us to be vaccinated because “the data shows they’re safe and effective”?\n\nIt’s not a coincidence that Pfizer’s stock value has increased by over 35% in the past year alone. BioNTech is up almost 400% in that same period. According to Yahoo! Finance, discussing Pfizer’s soaring revenues, “Higher sales of brands like Eliquis … and significant contribution from new drug Vyndaqel/Vyndamax … drove this segment’s sales growth.”\n\n“What’s Eliquis?” It’s a Pfizer drug used to prevents blood clots. “What’s Vyndaquel/Vyndamax?” It’s a Pfizer drug used to treat cardiomyopathy. Surprise, surprise… blood clots and cardiomyopathy are two of the side effects of Pfizer’s COVID jab! See how this works, folks? Follow the money!\n\n\n\nAs we already mentioned, with FDA approval, it will now be easier for schools, businesses, and the government to force vaccination. With COVID-19 boosters also set for approval, you can expect those numbers to increase.\n\nThese people are getting rich while Americans are injured and killed by an unsafe and untested vaccine that doesn’t do the ONE THING it was approved to do. The FDA has a horrendous track record of approving dangerous and ineffective drugs – especially when they do it in a hurry. The double-blind, placebo-controlled study cited for approval is neither “blind” nor “placebo-controlled.”\n\nSo much for the “gold standard.” This vaccine is a farce.\n\nNow that it’s been approved by the FDA, you can expect the vaccine rhetoric and oppressive mandates to increase at an alarming rate. Even though the jab is still experimental. FDA approval does NOT mean that Pfizer’s shot is no longer experimental. Every COVID jab, including Pfizer’s, is less than a year in use and still experimental by definition. The fact is, Pfizer’s clinical trials don’t end until May 2023.\n\nHere’s an excellent article titled “10 reasons why the FDA approval for Pfizer jab isn’t about health, but about forcing people to take the shot.” Don’t let yourself be a human guinea pig. We should all be prepared to stand up for our freedoms… before it’s too late.\n\nWatch the video below of a brave Los Angeles Fire Captain (Christian Granucci) declaring that we are in tyranny and that he and his crew will not comply! This is powerful and moving!\n\nOh yeah, we almost forgot to mention that a recent investigation revealed that Bill Gates has major shares in both Pfizer & BioNTech, but we’re sure that’s just a “coincidence” in this FDA decision…\n\nOh yeah, we almost forgot this too. On August 17th, the CDC issued an alert of an expected outbreak of the polio-like disease (Acute Flaccid Myelitis) in the next four months. This is a serious neurological condition, which causes the muscles and reflexes in the body to become weak. Hmmm … interesting that would mimic the predicted downstream effects of the COVID-19 jab right around that time, isn’t it? Likely just another “coincidence” though … totally unrelated… nothing to see here…. move along sheep!", "opengraph": {"locale": "en_US", "type": "article", "title": "BREAKING: FDA \"Approves\" Pfizer/BioNTech COVID-19 Vaccine", "description": "On Monday, August 23, 2021, the FDA \"approved\" Pfizer's COVID-19 jab for 16 years and older - officially declaring it \"safe and effective\"...", "url": "https://thetruthaboutcancer.com/breaking-fda-approves-pfizer-biontech-covid-19-vaccine-behind-closed-doors/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2021-08-24T01:10:31-04:00", "article:modified_time": "2021-08-25T15:19:02-04:00", "updated_time": "2021-08-25T15:19:02-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210824011020/TTAC-Breaking_News-FDA_Approval-Website-600x330.jpg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Following FDA approval of Pfizer COVID-19 vaccine, Pentagon spokesperson John Kirby says Defense Department will issue updated guidance requiring all service members to be vaccinated. <a href=\"https://t.co/GubAuizEFg\">https://t.co/GubAuizEFg</a> <a href=\"https://t.co/odBpnshp43\">pic.twitter.com/odBpnshp43</a></p><p>— ABC News (@ABC) <a href=\"https://twitter.com/ABC/status/1429827535777542146?ref_src=twsrc%5Etfw\" class=\"broken_link\" rel=\"nofollow\">August 23, 2021</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/EaYn6QM2Ny8\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/EaYn6QM2Ny8"}], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://www.bmj.com/content/374/bmj.n2086", "https://www.washingtonpost.com/health/2021/08/23/pfizer-vaccine-full-approval/", "https://childrenshealthdefense.org/defender/emily-jo-14-year-old-son-aiden-myocarditis-pfizer-vaccine/", "https://blog.nomorefakenews.com/2021/08/23/fda-gives-full-approval-to-covid-vaccines-no-public-hearing-no-transparency/", "https://www.fda.gov/drugs/drug-interactions-labeling/preventable-adverse-drug-reactions-focus-drug-interactions#ADRs:%20Prevalence%20and%20Incidence", "https://www.fda.gov/drugs/drug-interactions-labeling/preventable-adverse-drug-reactions-focus-drug-interactions#ADRs:%20Prevalence%20and%20Incidence", "https://www.drugwatch.com/vioxx/", "https://www.bmj.com/content/354/bmj.i5055", "https://www.sciencemag.org/news/2018/07/fda-s-revolving-door-companies-often-hire-agency-staffers-who-managed-their-successful", "https://www.usatoday.com/story/opinion/2021/02/03/janet-woodcocks-failure-fda-opioid-epidemic-column/4352787001/", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://www.wsj.com/articles/white-house-expands-list-of-potential-fda-commissioners-11618410457?mod=article_inline", "https://www.supportprop.org/wp-content/uploads/2021/01/Letter-opposing-Woodcock-nomination-1.27.21-FINAL.pdf", "https://www.wsj.com/articles/third-member-of-fda-advisory-panel-resigns-over-approval-of-alzheimer-drug-11623370557?mod=article_inline", "https://www.infowars.com/posts/pentagon-pulls-trigger-will-order-all-troops-to-get-covid-vaccine-by-sept-15-under-threat-of-court-martial/", "https://t.co/GubAuizEFg", "https://t.co/odBpnshp43", "https://twitter.com/ABC/status/1429827535777542146?ref_src=twsrc%5Etfw", "https://www.bmj.com/content/374/bmj.n2086", "https://www.healthaffairs.org/do/10.1377/hblog20200814.996612/full/", "https://childrenshealthdefense.org/defender/fda-full-approval-pfizer-vaccine-lack-scientific-debate/", "https://www.fda.gov/media/144245/download", "https://childrenshealthdefense.org/defender/vaccine-injuries-regulatory-agencies-hiding-covid-safety-data/", "https://www.medrxiv.org/content/10.1101/2021.07.28.21261159v1", "https://www.forbes.com/sites/johnlamattina/2018/06/28/the-biopharmaceutical-industry-provides-75-of-the-fdas-drug-review-budget-is-this-a-problem/", "https://finance.yahoo.com/news/pfizer-pfe-q4-earnings-miss-150803604.html", "https://clinicaltrials.gov/ct2/show/NCT04368728?term=NCT04368728&draw=2&rank=1", "https://www.lifesitenews.com/blogs/10-reasons-why-the-fda-approval-for-pfizer-jab-isnt-about-health-but-about-forcing-people-to-take-the-shot/", "https://dailyexpose.co.uk/2021/08/20/investigation-bill-gates-has-major-shares-in-both-pfizer-biontech-and-an-foi-has-revealed-he-is-the-primary-funder-of-the-mhra/", "https://tntribune.com/us-warns-of-polio-like-illness-outbreak-in-four-months/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["an", "Jules Bourgeois", "Jerry", "Dawn", "GARY MATTHEW CLEMENS", "Ana", "Laurie Martindale", "Jacob Miles", "Sue Seward", "Tina", "Paul Posillo", "truth.seeker", "Nancy Huffman", "Danna Stevens", "John Parson", "Mary", "Woody", "Dr. Bronson", "Tammy", "S Menze", "Rasilyah", "Ken frazier", "Vera Pschenyczny", "ellibeth", "Judy A Zwyghuizen", "Tiffany Wise", "Nicky Karahalios", "Prima Donna", "a n"], "publish_date": "2021-08-24T01:10:31-04:00"}