{"result_id": "308039", "URL": "https://thetruthaboutcancer.com/covid-vaccine-cancer-risk/", "timestamp": "2023-04-25 17:36:06 CEST+0200", "meta": {"description": "Dr. Ryan Cole has released shocking new information about how Covid-19 vaccines are causing a massive uptick in cancer cases.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/covid-vaccine-cancer-risk/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Idaho doctor reports \"20 times increase\" in cancer among those \"vaccinated\" for covid", "cleaned_text": "This article was originally published on NaturalNews.com.\n\nDr. Ryan Cole, a board-certified pathologist and diagnostics lab owner and operator based out of Idaho, has released shocking new information about how Wuhan coronavirus (Covid-19) “vaccines” are causing a massive “uptick” in autoimmune diseases and cancer.\n\nIn a video produced by the Idaho state government’s “Capitol Clarity” project, Cole revealed how he is now seeing a 2,000 percent chronic illness increase in folks who took the vaxx.\n\n“Since January 1, in the laboratory, I’m seeing a 20-times increase of endometrial cancers over what I see on an annual basis,” Cole stated in the video.\n\n“I’m not exaggerating at all because I look at my numbers year over year, and I’m like ‘Gosh, I’ve never seen this many endometrial cancers before.’”\n\nCole revealed these and other statistics at a March 18 event, telling Idahoans that the so-called “vaccines” for the Fauci Flu are invoking a “reverse HIV” type of autoimmune response in people’s bodies.\n\nA normal, well-functioning immune system has two types of cells that keep the body healthy: “helper” T-cells, also known as CD4, and “killer” T-cells, also known as CD8 cells. In the “fully vaccinated,” there is a massive suppression of “helper” T-cells, Cole warns, which leaves the patient susceptible to an array of illnesses.\n\n“Post-vaccine, what we are seeing is a drop in your killer T-cells, in your CD8 cells,” Cole stated. “And what do CD8 cells do? They keep all other viruses in check.”\n\nIs the government injecting people with HIV and calling it “covid vaccination?”\n\nCole’s claims resonate with the results of a study published in The Lancet late last year which found that Chinese Virus shots greatly increase a person’s risk of developing an HIV infection.\n\nCould it be that the jabs are actually inserting HIV into people’s bodies under the guise of “vaccinating” them against Chinese Germs? Is everyone being lied to about what these vials truly contain?\n\nIt would appear so, based on the latest evidence and revelations. While HIV is known to suppress “helper” T-cells, covid jabs are apparently suppressing “killer” T-cells, which Cole says has a similarly negative effect on immunity.\n\nThis vaccine-induced “killer T-cell” suppression, Cole goes on to warn, is generating a major uptick in cases of endometrial cancer, melanomas, herpes, shingles, mono, and even human papillomavirus (HPV) when “looking at the cervical biopsies of women.”\n\nOther ingredients in the jabs, including polyethylene glycol, are also causing problems for people’s immune systems. Rather than protect them against a China Virus infection as claimed, these injection additives present a serious toxicity risk that could lead to even more health problems on top of those caused by the jabs’ HIV-like effects.\n\n“Most concerning of all, there is a pattern of these types of immune cells in the body keeping cancer in check,” Cole warns about what these shots are doing, including in young people who were fully healthy before getting jabbed.\n\n“I’m seeing invasive melanomas in younger patients; normally we catch those early, and they are thin melanomas, [but] I’m seeing thick melanomas skyrocketing in the last month or two.”\n\nCole has spoken at several events over the past several months, warning people about the serious risks involved with getting jabbed. Some of his work has been scrubbed from YouTube for being too truthful, so keep an eye out for fresh content about Dr. Ryan Cole at Brighteon.com.\n\n“Can you imagine what cancer rates will look like five years from now?” asked one commenter at LifeSiteNews. “This won’t get reported. They won’t even do a study.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Idaho doctor reports \"20 times increase\" in cancer among those \"vaccinated\" for covid", "description": "Dr. Ryan Cole has released shocking new information about how Covid-19 vaccines are causing a massive uptick in cancer cases.", "url": "https://thetruthaboutcancer.com/covid-vaccine-cancer-risk/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Hide on Index", "article:published_time": "2021-09-16T00:19:35-04:00", "article:modified_time": "2021-09-25T20:58:18-04:00", "updated_time": "2021-09-25T20:58:18-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210925205810/TTAC-Idaho_Doctor-Web-600x330.jpeg", "image:width": "600", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.naturalnews.com/2021-09-14-idaho-doctor-20times-increase-cancer-vaccinated-covid.html", "https://www.lifesitenews.com/news/idaho-doctor-reports-a-20-times-increase-of-cancer-in-vaccinated-patients/", "https://www.naturalnews.com/2020-12-23-covid19-vaccines-could-cause-hiv-infection.html", "http://www.brighteon.com/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Robert", "Anja Hehmann", "Maryann", "Lynda Sunley", "RICHARD STANTON GIESER", "Chris", "BEVERLY SHANK", "Lora Hyatt", "Lind", "Rosemarie"], "publish_date": "2021-09-16T00:19:35-04:00"}