{"result_id": "308011", "URL": "https://thetruthaboutcancer.com/sanofi-epilepsy-drug-caused-autism/", "timestamp": "2023-04-25 17:35:21 CEST+0200", "meta": {"description": "Sanofi is in hot water after a they were ordered to pay more than $416,440 in damages to a family whose child got autism caused by its epilepsy drug Valproate.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/sanofi-epilepsy-drug-caused-autism/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Sanofi to Pay Family After Epilepsy Drug Caused Autism", "cleaned_text": "French pharmaceutical giant Sanofi is in hot water again after a French court ordered the multinational company to pay more than 400,000 euros ($416,440) in damages to a family whose child suffered from a form of autism caused by its epilepsy drug Valproate, saying the drugmaker failed to inform them about known side effects.\n\nThe ruling states that Sanofi must have known the risk that the drug, if taken by pregnant women, could cause malformations and “neuro-behavioral disorders” in children, which should have been mentioned in its attached leaflet.\n\nThe court in Nanterre subsequently ordered Sanofi to compensate the parents of the girl for the various physical and psychological damages suffered and resulting costs such as special care and schooling needs.\n\nThe verdict is the first in the country to state a link between Valproate (sold under the name Depakine in France) and autism in an individual case, said Marine Martin, who heads victim association APESAC.\n\n“I hope that Sanofi will change its position and start compensating the victims now that more and more court decisions are being rendered“, Martin, herself the mother of a child suffering from Depakine side effects, told Reuters.\n\nFrench health authorities have estimated the drug was responsible for deformities in between 2,150 and 4,100 children and neuro-developmental defects in up to 30,400. In 2020, Sanofi was even under formal investigation for manslaughter.\n\nAnd this isn’t the first case to be brought against Sanofi for the dangerous epilepsy drug.\n\nIn January, a French court ruled that families of victims of Depakine could join a class action lawsuit against the drugmaker. APESAC (In English: assistance to parents of children born with the anti-convulsant syndrome), which represents 7,500 families, launched the class action in September 2021 against Sanofi.\n\nHere’s what the court ruled in that case:\n\nFirst, that Sanofi was at fault for not fulfilling its duty of care and its duty of information in regard to children exposed before May 1998 to the drug Depakine and its derivatives, between 1984 and January 2006 for congenital malformations, and between 2001 and January 2006 for neurodevelopmental disorders.\n\nWhile recognizing that there was a scientific consensus that these drugs are among the best in the world for treating epilepsy in patients, the court stated that, according to the scientific literature, the possibility of causing malformations in children exposed in utero with respect to anomalies in the closure of the neural tube (the primitive nervous system of the embryo) could be qualified as a probable causal link as of 1984.\n\nRegarding major malformations, this causal link could be qualified as probable between 1990-1992. Concerning a possible causal link between behavioral disorders, particularly autism spectrum disorders, and prenatal exposure to Valproate, a probable causal link between 2008-2009 was upheld by the court.\n\nBased on this, the court considered that the laboratory should have (as early as 1984!) requested the modification of the package insert for the drug Depakine and its derivatives from the national drug safety agency in order to provide clear and precise information to health professionals in accordance with the latest scientific data.\n\nSecond, that Sanofi produced and marketed a defective product for children exposed to Depakine and its derivatives between May 1998 and January 2006 for congenital malformations and between 2001 and January 2006 for neurodevelopmental disorders. The court considered that the presentation of the drug in the patient information leaflet did not contain the necessary information regarding the possible adverse effects of the drug, notably that there was a particularly serious possibility of causing malformations in children exposed in utero and that there was a risk of developmental and cognitive disorders.\n\nThe Court also concluded that, from 1998 to 2006, the product did not present the safety guidelines that could legitimately be expected and that the contested drug was defective.\n\nSanofi is no stranger to legal troubles.\n\nSince the year 2000, courts have ordered Sanofi to pay over $640 MILLION for offenses ranging from making false claims about their products to selling drugs that were unsafe. They also sell at least 20 CDC-recommended vaccines, including Vaxelis, the first hexavalent (6-shots-in-1) vaccine to be approved in the U.S.\n\nYou may remember 2019, when Sanofi’s vaccine for Dengue Fever was banned after several people died. Sanofi was accused of using the Filipino population as guinea pigs for an experimental vaccine, receiving an indictment from the Philippine Department of Justice, who said that at least 10 deaths had been associated with their shot.\n\n[Editor’s Note: There have been over 28,000 deaths reported to the CDC’s Vaccine Adverse Event Reporting System following COVID shots, and yet nothing has been done.]\n\nBut let’s forget about vaccines for a moment.\n\nHave you ever heard of Zantac? Just a few years ago, America’s most popular heartburn medication was recalled after the FDA announced that it had detected a cancer-causing contaminant called N-nitrosodimethylamine, or NDMA, in the drug.\n\nZantac was the first drug to total $1 billion in sales. In 2018, the drug generated nearly $130 million dollars for Sanofi. But a class-action lawsuit claimed that the French drug makers knew the risks all along, hiding them from regulators and consumers in order to maintain profits.\n\nThe suit claimed that each 150mg tablet of Zantac contains 26,000 times the FDA-approved daily limit of NDMA. Steve Berman, the lead attorney for the case, believes that consumers have been intentionally put in harm’s way.\n\n“Millions of people in the U.S. suffer from heartburn, and for years, Zantac has been sold to the masses as a safe and easy-to-find remedy for that common ailment. We’re certain that if those millions of consumers knew that the Zantac they take contains known carcinogens, they would be rightfully outraged.”\n\n“Sanofi knew that Zantac contains a carcinogen, yet it chose to conceal these risks to the public to line its own pockets,” the suit claims. “Had defendants disclosed that Zantac results in unsafe levels of NDMA in the human body, no person, let alone a reasonable person, would have purchased and consumed Zantac.”\n\nIt may surprise you to learn that Sanofi’s stock price is up more than 2.5% this week, even as the overall market is crashing. Or it may not. The truth is that pharmaceutical behemoths like Sanofi are never going to stop hurting people – as long as they can turn a profit.\n\nIn fact, Sanofi is also facing a lawsuit from the Arkansas Attorney General, who accuses the drugmaker (along with Eli Lilly and Novo Nordisk) of colluding to drive up the price of insulin.\n\nIn the lawsuit, Arkansas’ attorney general Leslie Rutledge said the drugmakers conspired with top pharmacy benefit managers (who are often bribed to help increase pharma revenues while making healthcare costs unattainable for the average American) to drive up the costs of insulin to increase revenues, making the treatments unaffordable for diabetics in her state. The lawsuit claims violations of the Arkansas Deceptive Trade Practices Act, unjust enrichment, and civil conspiracy. Rutledge is seeking damages, civil penalties, and more.\n\nWe should care about the way companies like Sanofi conduct themselves. Did you know that Sanofi makes more of the pediatric vaccines administered worldwide than any other pharma company? What these companies do matters. Their track record of honesty and accountability matters. Safety and efficacy issues matter.\n\nSanofi is worth over $130 BILLION (over $10 billion LESS than it was a month ago). Their annual revenue as of March 2022 was $34,764,000,000. That was a nearly 20% decline from 2021, when their annual revenue was $36,348,000,000. $400,000 is nothing to them. It’s literally 0.001% of what they generate in a year.\n\nIf we want these companies to stop getting away with harming patients, we need to stop the corruption of regulatory bodies, stop the bribery of doctors and politicians, and end the legal immunity granted to them by the Public Readiness and Emergency Preparedness Act.\n\nUntil that changes, companies like Sanofi simply cannot be trusted.", "opengraph": {"locale": "en_US", "type": "article", "title": "Sanofi to Pay Family After Epilepsy Drug Caused Autism", "description": "Sanofi is in hot water after a they were ordered to pay more than $416,440 in damages to a family whose child got autism caused by its epilepsy drug Valproate.", "url": "https://thetruthaboutcancer.com/sanofi-epilepsy-drug-caused-autism/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Uncategorized", "article:published_time": "2022-05-20T19:59:49-04:00", "article:modified_time": "2022-05-23T10:10:17-04:00", "updated_time": "2022-05-23T10:10:17-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20220521201019/TTAC_Sanofi-to-Pay-After-Drug-Caused-Autism_588x330-web.jpg", "image:width": "588", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutvaccines.com/vaxelis-merck-combo-vaccine/", "https://thetruthaboutvaccines.com/dengue-vaccine/", "https://thetruthaboutcancer.com/does-zantac-cause-cancer/", "https://www.macrotrends.net/stocks/charts/SNY/sanofi/revenue#:~:text=Sanofi%20revenue%20for%20the%20twelve,a%201.28%25%20increase%20from%202019.", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Cindy", "Enid thomas"], "publish_date": "2022-05-20T19:59:49-04:00"}