{"result_id": "308027", "URL": "https://thetruthaboutcancer.com/madej-covid-19-transhumanism/", "timestamp": "2023-04-25 17:35:49 CEST+0200", "meta": {"description": "Dr Carrie Madej on why we should be concerned about the push for the COVID shot and more vaccines coming down the pike.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/madej-covid-19-transhumanism/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "The COVID-19 Injections - A Gateway to Transhumanism? [VIDEO]", "cleaned_text": "Dr. Carrie Madej and her boyfriend were in a private plane crash this Monday, June 27. They are both recovering in the hospital and doing well. Please keep them both in your prayers as they continue to recover and heal.\n\nCarrie has been a good friend to us and is a hero in the world sounding the alarm about the COVID shots and the transhumanism agenda the globalists are rolling out without our express knowledge through the COVID shot. If it weren’t for Dr Carrie and others like her, we would be in the dark about the science and ingredients and their very dangerous effects on the human body. Thank you, Carrie, for your service to humanity.\n\nPlease enjoy this video presentation of Dr Carrie Madej speaking at our most recent TTAC Live Event 2021 in Nashville, Tn where she talks about “The COVID-19 Injections – A Gateway to Transhumanism?”\n\nOur afternoon keynote speaker was originally from Dearborn, Michigan. She received her medical degree from Kansas City University of Medical Biosciences. She then completed her traditional internship at The Medical Center in Columbus, Georgia, and internal medicine residency at Mercer University in Macon, Georgia. She served as a private clinician and medical director of multiple clinics in Georgia till 2015, also served as an attending physician for the Pennsylvania College of Osteopathic Medicine.\n\nShe has served as a public speaker and has been featured in the documentary The Marketing of Madness about the overuse of prescriptions psychotropic medicines, and she has now dedicated her life in educating others about vaccine, nanotechnology, and human rights. She’s become a good friend. I’ve spoken with her on a few different occasions. She’s a dear, dear soul, and I personally am looking forward to hearing our good friend, Dr. Carrie Madej.\n\nGive it up for Carrie Madej.\n\nThank you so much. It’s so exciting for me to be here today. I’m going to talk about obviously some ugly things that are happening in our world, but remember that we need to be wise as serpents and gentle as doves. And people get scared of the word apocalypse, right? But we shouldn’t because literally the word apocalypse means lifting of the veil. We are seeing now what has been unseen. These ugly things that are going on right now are for a purpose. It is for us to finally remember who we are and what we are. It really is about returning back to who we are, which is we have a royal birthright, a divinity right with God, Yeshua, our savior.\n\nSo, transhumanism. If you don’t know this word, you need to know it. Everybody in the world should know this because it is my belief that these injections they falsely call vaccines are the gateway to transhumanism and that’s why we’re going through this chaos. You shall know the truth and the truth shall make you free, right? So let’s get started.\n\nThe most important question you should ever ask yourself is what does it mean to be human? Because right now, the future of humankind is at stake. They want to turn us into something called human 2.0, and I personally am against it. So you need to know what is going on. So Ray Kurzweil, he’s one of the big wigs of Google, he’s a transhumanist. He says, we are all, not just a couple of people, we are all going to be a hybrid. This is the most pivotal point in human history. We are alive for this time. And I know I was born here to be for this moment, weren’t you?\n\nSo, transhumanism. What is that? That is literally the melding of artificial intelligence with the human body. Sounds pretty sci-fi, but it’s doable and possible if we allow it to happen. It’s also about manipulating the human genetics, that God-given code. So just so you know how precious your genome is, it is in one person, if you unraveled it, it would extend out to 10 billion miles, one human being. That is a wonderful living language. You can read it like a book. It can actually be read as a binary code.\n\nAnd so people now in this transhumanist field, they believe that the human body is broken and fragile. We’re going to fix that. We’re going to take evolving humanity into our own hands. These people right now think that and they are executing their plan. So this says scientists propose putting nanobots in our bodies to create a global super brain. Isn’t it selling something from the worst sci-fi movie ever? We’re living it right now, guys. So you can’t get distracted by what the television is telling you. It’s tell a vision. It’s programming you. Turn it off, never turn it back on again and you will become smarter already.\n\nSo again, Ray Kurzweil, we all know this man. He says, we’re just a few breakthroughs from achieving eternal life. Again, what these people are doing, listen, they are atheists. They do not believe in God our Father in heaven. They will tell you that. Even Ray Kurzweil says, somebody asked him, “Is there a God?” He said, “No, but soon there will be one.” Craig Venter, another transhumanist, they asked him, “What is God?” He said, “Well, God creates. Now, I can create, we can create. Now we’re gods.” You need to know those are the pushers of this agenda. They are the pushers of these injections falsely called vaccines.\n\nSo you have to know what they plan. They have a plan for human bodies as you can see here, avatar A, B, C, D. So this is an evolution of going up to 2045. They actually kind of pushed this agenda to 2030, eight years from now, guys. So they want to actually… They think a human being is only memories and dreams. That’s it. Because again, they don’t believe in God. So they think if they upload all of our memories and dreams into the cloud, then they can download them into a new body or robots or a digital avatar like a video game. You have to know what they’re thinking. I know it sounds ludicrous, but you need to know.\n\nSo who else is behind this? World Economic Forum, Davos. And if you really want to know what they’re planning, look at the World Economic Forum’s websites. So this is what they’ll tell all of us that 2030 is their goal, guys. So in 2030, it says the average human will own nothing, have no privacy and life has never been better, right? They also say on the bottom paragraph here, they’re giving you the description of now, this is their best sell. They’re marketing this to you, okay? They say that in the future, everywhere you go will be registered, there’s no privacy, and every thought and every dream is recorded and monitored. And you hope that none of those dreams, none of those thoughts go against the narrative or you’re in trouble. You will be in trouble for what you dream of. These are these megalomaniacs behind this plan. They plan this for the future of humankind.\n\nSo these are very outrageous ideas. So how in the world could they accomplish this really almost eight years now? So you have to know about DARPA. Very important organization to know, the Defense Advanced Research Projects Agency. They’re the black ops, the sci-fi kind of portion of the Pentagon. They have public and private funding. And so one of the things you need to know is this substance called hydrogel. Hydrogel is like the mother kind of formula. It’s a sci-fi substance that can do many things. Actually it’s very analogous to the human tissue. So we usually don’t reject it in the body. It can assemble, disassemble, reassemble innumerable times. It can make more of itself in your body. It can meld with the human tissue and be a hybrid with your body, your brain, and your nervous tissue. They’ve used it in military projects already.\n\nSo just so you know, an example of that would be, there is a small group of Black Hawk helicopter. It was a project. And when they sat in the aircraft, they’d have to wear a magnetic helmet. And at that moment, all their eye movements and everything they thought, the aircraft would know immediately to do in respond. The aircraft and the person, the pilot was one. And if they had an upgrade, they didn’t have to study. They just sat in the cockpit and then it was downloaded into their brain. They’ve been doing this for decades. So Neil deGrasse Tyson, he’s an astrophysicist, is talking to Ray Kurzweil, the guy we’ve been talking about. So listen to what he says.\n\nIn 20 years, plus or minus, and so the mid 2030s, we will have nanobots that we can feed into our brain that directly connect to the cloud rather than through anything we carry in our pocket. And in that way, wirelessly, we can basically download entire books, entire languages, and we will then know the…\n\nI’m sorry. All right. Sorry, that cut off a little early, but you’re talking about nanobots. So hydrogel, that magical substance can form nanobots. It can be a drug delivery system. It can be biosensor. It can be a biosensor in your body. So how in the world could they get nanobots in our body? How could they upload everything? How could they know our thoughts? How could they know our dreams? How could they monitor everything? How could this happen? Because they’re doing it right now through these injections falsely called vaccines and they’ve been lying to us from the beginning.\n\nSo it is not a vaccine. Never call it a vaccine ever again any of these shots they’re giving to anybody, all right? It’s a brand new technology on the human race. It’s nothing like an old vaccine. Old vaccine takes the actual virus and it’s dead or alive with some toxins, puts it in your body, and your body’s supposed to know how to fight it just a little bit amount, right? No, there is no virus at all that they have documented. There’s over 70 freedom of information acts. Do you know we don’t have the virus on file anywhere in the world? Nobody has it in their lab. This is a little crazy, right? So they couldn’t make the normal way. They had to make a Frankenstein code so that your body produces this. They took proteins, they took this genetic code and mashed it together and had an artificial intelligence program fill in the missing gaps. So it’s artificial intelligence, a synthetic thing that’s not from nature and different kinds of parts of genetic material pushed into one and they are programming your body to make it like a factory.\n\nWhat’s in the code? We know a little bit. We know that there’s a human protein similar to the body so your body potentially could start attacking itself. It’s so similar. Like autoimmune disorders. HIV-1, did anyone know that? Is that informed consent here? 18 sub-units of HIV-1 are in that code that your body will be producing. What will that do? Chromosome 8 is pretty important. It’s in charge of intelligence and fertility. It’s a potential damaging that. Most important, they’re putting a fake amino acid in your body, not from this world. That beautiful symphony orchestra of how your body is created with that genome that twist and turns, it’s beautiful from God, they’re destroying it with a fake protein. It’s like origami. It won’t twist and fold together again.\n\nThis guy you need to know, Dr. Craig Venter. Never forget that name. This man is behind this transhumanist movement. He’s the brains behind it. And I want you to know that if we have a synthetic gene, which this vaccine has… I’m sorry, injection has synthetic genes in it, if it gets taken up into our human genome, that’s bad because in 2013 in this country, the Supreme Court justice has ruled that any human being can be patented and owned if there’s a synthetic gene inside of them. What? Did you know that? Was that on your CNN, your Fox News? No. Literally overnight, you can be patented and owned. This guy is partly responsible for this.\n\nSo they didn’t want you to know there was a synthetic gene inside this injection because it’s possible for it to take up into your body. And if it’s taken up, they decided to get credit for their work. They’re so proud of this. Again, they think they’re little creators. They’re gods, right? So they’re putting their names branding you like a cow. 46 scientists are doing this. They’re getting a secret email inside the genome. I guess that’s who you belong to if someone finds you. Also three messages. Can’t figure out those messages yet. Working on that. And also a brand new alphabet. Why alphabet?\n\nRemember they want to be gods or copying God, but it’s a blasphemy, an inversion of God, okay? They want you to live forever. They want you to always be connected through a hive mind. And also we’re connected with God, right? So frequencies. Like you’re tuning on a radio, they want to switch the channel. They want to switch the station because words are powerful. Remember in the beginning there was the word. Yeah. It’s powerful, guys. See what they’re doing? We know what they’re doing, right? So they’re not going to get away with it.\n\nAnd so this is going back to, yes, the Supreme Court has ruled that a human being can be patented and owned if this synthetic gene gets taken up into your body. And they’re telling us it can’t happen. Absolutely it can happen. They’re lying to you. Absolutely. Right here, this is the modified messenger RNA that they’re using inside of these injections, and this is just one of many research articles showing that our body has the potential to use reverse transcriptase enzyme. Long word. It can take it up into the genome of our genome and then it becomes permanent. It’s a Russian roulette. It’s a chance. It’s like playing Craps. We shouldn’t be doing that with our sovereignty, with our human holy temple, right?\n\nSo Moderna and Pfizer. So everybody tells me, “Okay, I know some of those injections are bad. Okay. Well, what about this one? What about this one?” No, they’re all bad, guys. They’re all putting a fake code inside of your body. Something not from nature that you are producing like a factory. And you know how they’re doing that? They have to suppress your immune checkpoints. They have to suppress your immune system so your body accepts it. For how long will that happen? That means more cancers, more autoimmune disorders, all kinds of things. Do you think they cared? No. They just want their drug inside of your body.\n\nThey also are putting artificial intelligence inside your body. Unbelievable. But it’s just to get the drug delivery system in. So the hydrogel is part of this artificial intelligence system. And they’re like, “Oh, well, we’re not going to use it for bios and we’re not going to do it to spy on you. Don’t worry. We’re just going to put it inside your body just for the drug delivery. But once it’s in your body, don’t worry. We won’t use it for anything else.” Do you believe that? They are liars. They lied from the beginning. We know by Dr. David Martin that… We know where the coronavirus, the SARS-CoV-2 virus, came from, right? It’s patented 2002. There’s a patent. That means it was made in a lab. Someone’s making money off of it. We know where it came from. It’s not from some bat soup shop, whatever, in China. It’s a lie.\n\nSo all of them are the same. Some of them say they’re doing different things. Sometimes they’re using a vector. Vector means they’re using a cold virus that is infecting you purposely and then it’ll inject this genetic material inside of you. Some are just using the hydrogel, right? They’re telling us they’re doing different ways. And I knew this, but I wanted to see it with my own eyes. I don’t trust them, right? And I’ll show you some photos. So Moderna also says that it’s trying to put an operating system inside of you. An operating system just like Windows. We know Windows is terrible. Viruses all the time, right? They messed up on that. How are they going to make this one good? Impossible. And were you given informed consent? Have they told us about this? No. They’re liars. Again, this is the theme. They’re lying. Satan is the greatest of deceivers, right?\n\nSo with this hydrogel, different things come under hydrogel, nanobots, graphing, magnetic particles, et cetera. But that’s the mother of all of that substance. And just to FYI, hydrogel is the opposite of water life. We’re over 90% water. Water gives life. It freezes when it’s not supposed to freeze. When it freezes, it expands instead of condenses, something very strange. It boils when it’s not supposed to boil. It makes different crystal structures depending on intention, where it comes from. It’s beautiful. It has intelligence in life. Water’s life. Hydrogel is water gel. It sucks the life out. It literally will dry out the water. That is not healthy for any human body. And they want to put nanobots inside of you just like this.\n\nAnd how could they do that? Well, one little syringe needle, one little syringe needle, 1 million can fit in there. And this is one of the symbols of hydrogel. You want to see how it moves inside? This could be assembling, disassembling, reassembling in your body to do innumerable tasks, do innumerable things. I want to show you another nanobot. This is called a TRAP bot, okay? I actually have seen images of this in the vial, somebody whose vials we’re injecting into people.\n\nOrganization-based microrobots or TRAP bots which can capture and transport live cells to a desired location. Much like a spider weaving a web, these microbots can spit out thread-like gel to trap living cells and incorporate them in their hollow microcylinder. This microcylinder is about 200 micrometers in diameter. It also contains the ingredients for these cell trapping gel, which creates a long thread-like structure while [inaudible 00:19:17] allows for magnetic-\n\nOkay. So this is just giving you an example of how it can move through the body and what is directing the movement? A magnet or magnet force, a magnetic force. And it’s very minuscule, but I don’t know if you noticed what they’re saying. There’s a long string-like, hair-like substances gel, hydrogel, coming from it that builds, it can actually build and grow as it’s squirming through the body. Hydrogel is also important to know because it can create its own electricity, okay? Think about to build a computer, you need some power. You need electricity. So we are powerful beings, A, and now the hydrogel can produce its own electricity. But remember computers when you have a laptop on your lap and it’s been working for a while, it gets really hot. They have to cool down. So the problem is when something is generating a lot of computing power, how do we cool it down? Oh, don’t worry. Hydrogel can cool itself down. They’ve already thought about this.\n\nAnd just so you know, hydrogel in a injection with Moderna, Pfizer, et cetera, they’re calling it nanolipid particle. So nanolipid particle is a creative way of saying the same word as hydrogel just so you know. Again, DARPA has their clarity project with hydrogel, and what they’re saying is that they’re so good at it when they inject it into the human body in some of their military experiments, they were able to mold it and make it a hybrid tissue with the brain and the nervous system of the military victim. And so when they did that, they could see through and feel and know what that soldier is thinking like an avatar. Use them as computer simulation game. And they think this is great. So this guy you need to know, he’ll explain about the technology.\n\n[crosstalk 00:21:23] the sensory cortex of the second animal and that animal acquires the knowledge. From the human drone technology standpoint, you can attach the human brain to another human brain, you can direct motor activity, or you can send communication and information. Dr. Venter’s work is in my view, the equivalent of the development of nuclear weapons when you realize that he created life in a cell. He programmed yeast cells to produce anything he wanted. These can be inserted into you through the hypospray needles. You put in a specific gene slicing, you program what you like, you put it in the cell and it can reproduce and make as much as you like. It sends a signal and it tells which portion of the DNA should unwrap, unfold, and produce a product.\n\nRelated to this is an idea called DREADDs. These are designer receptors that can be remotely controlled. You can create a cell, you can put it somewhere in the body and you can remotely activate it. So you have the capacity to create any product as long as you know the DNA sequence, you can insert it into a living system and you can remotely control it. That may affect the way you think, the way you act. So once you know that the technology is there to edit, splice, and program the cell and the technology currently exists to administer to somebody and have it go park anywhere you program it to go park proliferate and do its function, you can have things activated in other people’s brains.\n\nThese people have figured out how to hide imagery in the DNA of bacteria. You can have the information reproduced in a string form as a form of a protein. The new way to hide information is going to be in DNA. This is the first experiment showing what imagery you can hide in bacteria. This is the latest. It’s a GIF file. Well, this is what the Chinese are doing with DNA. Merging DNA systems with quantum computing will be really quite an amazing and both lethal threat. The next thing I wanted to mention to you is memory. Can we erase memory? Can we modify memory? Can we change memory? Of course the short answer is yes.\n\nSo I want you to know the brief thing of this this guy works with is bioweapons with this kind of nanotechnology. And he’s saying what they can is do this kind of substance like the hydrogel, okay? And they can use it for multiple purposes. They’re so good at it with these nanobots. They can rewrite your memory. They can erase your memory, put a new memory inside of you. If you have this substance inside of you that they could do all these things, do you trust them when they say it’s just a drug delivery system. Don’t worry. I don’t trust them. I don’t trust them at all. They can make new memories. They can send an impulse into the body and make you feel something, make a toxin produced, make a neuropeptide produced. There’s no good thing. There’s no God-given reason why anybody would do that to another human.\n\nAnd just so you know, you might’ve seen this, patent 2020/060606. Do you think they picked 666 by accident? People have marketing departments, I know, and they know that we have a visceral reaction to 666. We have a contact tracing act, 6666, right? Moderna has ingredients with a number 0.666 or 6.666. This is not accident guys. Symbolism is everywhere. Pay attention. They use symbolism and they will tell you who they serve. And here they’re showing the person as a little tiny speck, that’s you or me, and then there’s a device, which is your cell phone or my cell phone, and then you are wirelessly connected to your cell phone. How does that happen? They have to have a substance inside of you to make you wirelessly connected to everything. It’s called the internet of bodies, the internet of things. And so how do they do that? You have to ask yourself. They want to do it by 2030. They have to make you a walking Wi-Fi electronic device. They can do it with the hydrogel or the nanolipid particle.\n\nAnd just so you know, Gates loves this kind of thing because they can hijack your brain when you’re sleeping or just reading the magazine because they can do computing power in the background like a computer and they’re going to make money off of you and you didn’t know it, right? If you accept this technology inside of you. They also want to use it with social credit system of China. I’m kind of speeding through some of these things just because I want to get to the pictures of what I saw inside the microscope.\n\nBut let’s say you don’t believe what I say. That’s fine. Just know that Bill Gates does. His company in West Africa, along with MasterCard, along with Trust Stamp and artificial intelligence program have combined forces. Since July, 2020, they’ve been experimenting on the people there. Giving them the same shots we have here. Same technology. They are giving them a barcode or a numeric number. Each one is unique. Everything’s downloaded, their medical records, their vaccination records, and their ability to do commodity is also downloaded, downloaded into their body. Doesn’t that sound like something from the book of Revelation? And if they don’t accept it, they’re locked out. It’s a war on cash.\n\nSo since they have this technology inside the people, what Bill Gates said, he’s like, “Well, since we already have the hydrogel nanolipid particle inside of you, we’re also going to start using it for surveillance and predictive policing.” Just like I warned you about. They’re doing it to the people right now like the Tom cruise Minority Report. They say once it’s perfected there, all developed countries will get it. That’s you and me too guys. What do they call it? Wellness pass or a vaccine passport. This is why we fight, this is why we say no, this is why we do not comply.\n\nAnd so I talked a lot about this, right? And how did I even get to know about this? Well, if some of you heard my story, you’ll know that at some point of my career, I was recruited. They thought I would be a good person on their side. I was recruited to business owners meetings in Metro Atlanta, as well as scientific meetings where I got to meet Dr. Craig Venter, okay? And so in these meetings, they talked about this whole transhumanist movement and how it was great. We would be the controllers in the room. Don’t worry. We would be exempt. Everybody else would be controlled. I was horrified. I was horrified to see everybody standing ovation and clapping for this. Like who are they? And I asked, “How could you be for this?” They said, “Oh, well, it does sound a little bad, but you know what? Carrie, soon it’s going to be us or them. And so we have to. You’re going to want to be on our side. You don’t want to be on the other side. It’s going to be bad.”\n\nI said, “I would never do that. And you’re a fool. You’re a fool to think that this technology wouldn’t be turned back on you because we are human beings, right?” And they have a super computer that wants to guide all of this. A computer doesn’t care who you are. It has an algorithm. You have a dollar sign in your head. Sound like the Marines, all for one, one for all. Computers sees it as foolish, frivolous, right? So I had all this knowledge. That’s how I got to know how to research for it, but I was still not happy. I’m a person. I have to know, right? So I decided I’m going to look at inside of these vials, even though it’s not legal, I don’t care because if something goes against my God-given rights and my human rights, it is my duty to break that law.\n\nThis is our world, our planet, our children, our bodies. Don’t give it away. It’s ours, right? So this is one of the pictures of Moderna. I put two drops on a glass slide. I had a compound microscope. That’s it guys. You could get it easily. 300 bucks. And I had a white light going up on the middle and a glass top on the very top. And that’s it. I waited two hours and it was translucent at first then all of a sudden colors appeared. Vibrant purples, blues, reds, greens. I’m like, “I’ve never seen this chemical reaction.” There was no chemical reaction, right? So I ended up finding out all these colors, actually, when they appear under a white light, that’s a sign of a super conducting material inside these injections. All the manufacturers have that. What that means, it’s proof they’re putting an injectable computing system inside every single one of these vials. An injectable computing system. Did they say anything to any of us? No.\n\nThere’s little cubes on this one. Were just showing some of these photos. Here’s another one. It’s hard to see on this photo, but at the very edge, there’s a cube-like structure. We’re not quite sure exactly what that is right now. So also I saw a lot of metallic flex fragments. I didn’t see anything about metal fragments on the ingredient list again. And these metallic fragments to me look a little more exotic. It’s not like your typical aluminum, et cetera, right? This one is strange. It’s so opaque. It leaves its own shadow. Some of these pictures are between 100 times magnification, which is nothing, to 400 up to 600 times magnification. This is not nanotechnology. This is not looking at nanotechnology. This is at a much grander scale. This is crazy.\n\nSo this picture kind of has been going around I think. I’m going to give you a close-up of him. This was on the first slide I did and there’s the cover slip, right? So everything gravitated to the very edges of the cover slip. That’s where I saw a lot of action. There was a lot of aggregation. There is self-assembling. This is two hours. It’s not like 12 hours. Two hours time. I also saw this thing. I was shocked. It actually was able to lift itself up off of the glass slide. You can’t see it? Okay. It was able to lift itself up off of the glass slide. It had tentacles like you see here. It was able to move. It is my opinion and it is my interpretation that it was self-aware. I’ve never encountered anything like that. I’ve done slides, I’ve done all kinds of preparation of slides of biologic materials, et cetera. Never have I witnessed anything like that.\n\nAnd so I did cry. I cried. And then I thought, well, okay, perhaps that was a fluke. Surely maybe some contamination, right? So two months later, I get another Moderna vial and I look at it under the microscope and here’s… What is that? Still trying to figure it out guys, but we shouldn’t have unidentified objects inside of these injections. Another of these string-like material, I’m like looking I’m like, “This almost looks like some kind of a living organism.” And then I see another one. And then I cried hard. You may not know what that means. I do. These are parasites better made to meld with your nervous tissue. Imagine a child that is forming their neural network. I want you to feel what I feel. I want you to get that righteous anger. We need it now. No more.\n\nJust on a side, if you know the book of Revelation, does it kind of look like a scorpion? Guess what else it can do. The tentacles, it’s called Hydra vulgaris. The tentacles have the ability to give a paralyzing, a venomous or a toxic reaction. Wow, it sounds like something else that I read, right? Why would they want that? Well, Hydra vulgaris is actually a organism, and I don’t know what that is, it’s an organism that is immortal in the lab. It can continually renew itself. If you chop it up into tiny pieces, put in a petri dish, it will actually self-assemble itself back over and over and over again innumerable times. It’ll make itself anew. If you chop off a tentacle, three more will grow. And the transhumanists love this organism. They think it’s fantastic. Again, that was 100 magnification, I’m sorry, the last one. So this is the edge of the cover slip. There’s a lot of debris kind of grapheme-like material. And then we start to see a lot of ring structures in here.\n\nNow, this one is with the Johnson & Johnson vial. Let me get to the… So, again, ring-like structures. What they are is they appear to be delivery systems. So they’ll start like this and they get bigger, bigger, bigger. They fend themselves out. A gelatinous material extrudes from it like a hydrogel, okay? And then this was like a bundle of cells growing. What are those cells? We don’t know. We need to analyze them. What kind of cells are being injected into people? A crystalline structure, little crystals. Like literally, this is like a kitchen sink, dirty kind of a experiment going on. These are iridescence silicone-like wafers. If they pile on top of each other, they can make their own circuitry boards. Hydrogel it’s a gelatinous material here. Again, more hydrogel with more of these spheres, these rings. So I saw them at all the manufacturers, all of them. So no one is different than another. I don’t care if they come up with a new one, guys. Don’t ask me if it’s safe to take it. They’re all bad.\n\nSo I was very fortunate to work with Project Veritas recently. So bravo, right? They’re amazing patriots. Another round of applause. So they will be releasing their findings soon. I worked with them. And so we were looking under the microscope at Pfizer vial and they have documentation to share too from a brave whistleblower. So anyway, this is a Pfizer vial. You see a lot of these dark particles. These are like graphene oxide particle material. So what we were witnessing over time under the microscope was something called Teslaphoresis. Have you heard of that? So what that means is that you can put all these little tiny beads, let’s say, that have the potential to make their own wiring in the body. And what you do is you could just have an external magnetic force or another kind of electric force, let’s say, or frequency, and they will start to form and coalesce into a string-like spider web all by themselves.\n\nSo you just have to put the junk in somewhere, turn on a frequency and voila, it starts to make its own neural network, a string-like consistency. We were seeing it here inside of this vial starting to coalesce, starting to form structures. It’s a little bit difficult to see, but up there, if I can do a pointer. Can’t see my pointer. Anyhow, there’s a [inaudible 00:37:55] kind of figure in the middle. So if you knew what a human nerve cell looked like, a dendrite, it would look just like this, but this isn’t from a human guys. This is from whatever they’re injecting inside of you. Literally, this is my opinion, they’re trying to put another kind of nervous system inside of you, but an AI kind, or they’re hijacking this parasite to put inside of you. These are my hypotheses. I encourage you to do your own research. And for the people who don’t believe me, under the microscope, you can get a $300 microscope and you can put the drops on there and you can look and see the pictures too, right?\n\nSo this is another organism. We see this over and over. This would be like a Polypodium or a Hydra vulgaris organism. Again, we see this over, over, over. It’s not a mistake. It’s in different states, multiple vials, multiple batches, multiple times. There’s no mistake. Another one. This is very similar to some ectoderm of a parasite. We could go on and on, parasite after parasite looking… And let me back up. They appear to be parasites, right? If it looks like a duck, quacks like a duck, walks like a duck, it probably is, right? Again, more ring-like structures.\n\nHow is this in the betterment of humanity? Is this why ivermectin and hydroxychloroquine are so banned from everybody? Right? Now we know. I want you to see this guy. This guy is another organism that we saw. This was in a Johnson & Johnson vial. Watch closely the translucent thing that moves around the edge of the ring. Do you see that? At first I thought it was another… Let me back up and do that again so you can see. Okay. Oops, I’m going to try to do this properly. Okay. All right. Play. Ah, sorry guys. Anyway, it’s a translucent… I thought it was like a larvae, like another life form, but the way it moved was more robotic to me. This could be a nanobot. We don’t know. I’m showing you pictures. And I think you don’t have to have a science degree. You don’t have to have a medical degree to know that should not be in any human body injected into to our children, our babies, and us.\n\nI want to show you this. We had a healthy blood of a young man, put a drop under the slide. It moved normally, right? Every time we added a drop of the injection from the Pfizer vial, this organism formed, which looked just like the coronavirus. You know what? It wasn’t in the vial by itself. It wasn’t in the blood. Only when the blood and the injection, or I’m sorry, the contents of the vial hit together, that formed. I want to hypothesize that this structure they’re calling the coronavirus is inside these vials. It’s a hypothesis that’s saying, we need to look into it.\n\nI want you to see how much… This is one drop of Moderna. One drop. One drop. Look at the movement. It’s not normal. They tell you they’re putting living organisms inside of you. This is just more graphing kind of a substance. Hydra vulgaris, look it up. UC Davis loves this against the transhumanist movement because of all of this. And it’s kind of funny they like to say hail Hydra. Have you heard of that before? Symbolism is everywhere. Watch for it then you’ll know who they serve. Just more about the hail Hydra and its life forms, but I like to always see symbolism, right? So the grown version of this Hydra is called a medusa and the Hydra also means many headed serpent. Wow, I read that before on the book of Revelation. This is just showing how they can chop it up and put it into a vial and then it can grow itself again once it’s in its host.\n\nI’m sorry. I can’t hear you. I’ll go back. Sorry about that. Okay, got it. Is that good? Okay, got it. Okay, this slide was just to show you that maybe one may not be Hydro vulgaris. Maybe it’s Nematostella or Acropora. Okay, my point is it comes from the same family. They all can do the same things, okay? We can go into splicing hairs later, but this is just to show you that they all can do this. And so my warning to you is this is a picture. It says a thousand words, right? And I want to shock you. I want to make you have emotion and passion because that’s what we need right now.\n\nAnd people ask me, “Well, how did this happen and how do we get out of it?” Why we got here it’s one reason. We disconnected ourselves from God, our Father in heaven. God did not leave us. We love God. We need to make that right. These are praying and worshiping and putting God first in everything and remembering who you are and what you are. You are royal birthright. You have a divinity inside of you, a light that God gave every single one of us if you choose to connect with it because we have free will, right?\n\nIf you haven’t read on Jesus Christ, you should because he gave us the instructions on what to do right now. With God we are unstoppable. We are powerful beings. We don’t have to be afraid of any of this technology because with God, we have this force that in a blink of an eye, we change it all. And you just don’t know who you are yet. And I’m here with you because I’m here to remind you who you are. And for my last breath on this earth, I will fight with you and for you and for the world and for our children. There’s nothing greater in this world. Thank you. [inaudible 00:45:01].\n\nDr. Carrie Madej. Wow, that was amazing. That was amazing. I was watching that for quite a while from the back and blown away with a lot of that stuff. A lot of the stuff I was not even aware of though. Thank you Dr. Madej.\n\nDr. Carrie Madej is originally from Dearborn, Michigan and received her medical degree from Kansas City University of Medical Biosciences in 2001. She then completed her traditional internship at the The Medical Center in Columbus, Georgia and internal medicine residency at Mercer University in Macon Georgia. Dr. Madej served as a private clinician and medical director of clinics in Georgia until 2015. Dr. Madej also served as an attending physician for the Pennsylvania College of Osteopathic Medicine – Georgia Campus, where she mentored students in clinical applications of internal medicine for 8 years. She has served as a public speaker and was featured in the documentary, “The Marketing of Madness” about the overuse of prescription psychotropic medicines. Dr. Madej now dedicates her time educating others on vaccines, nanotechnology, and human rights via multiple platforms and speaking engagements.", "opengraph": {"locale": "en_US", "type": "article", "title": "The COVID-19 Injections - A Gateway to Transhumanism? [VIDEO]", "description": "Dr Carrie Madej on why we should be concerned about the push for the COVID shot and more vaccines coming down the pike.", "url": "https://thetruthaboutcancer.com/madej-covid-19-transhumanism/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Top Picks", "article:published_time": "2022-06-29T09:13:48-04:00", "article:modified_time": "2022-07-01T13:12:12-04:00", "updated_time": "2022-07-01T13:12:12-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20220628213708/LE2021_Dr-Carrie-Madej__COVID-19-Injections-and-Transhumanism_588x330.jpg", "image:width": "588", "image:height": "330"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Steven", "Miles Odonnol"], "publish_date": "2022-06-29T09:13:48-04:00"}