{"result_id": "308044", "URL": "https://thetruthaboutcancer.com/twitter-files-part-13/", "timestamp": "2023-04-25 17:36:11 CEST+0200", "meta": {"description": "The “Twitter Files” tell an incredible story from inside one of the world’s largest and most influential social media platforms.", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/twitter-files-part-13/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "Twitter Files | Part XIII - How Scott Gottlieb Silenced Factual COVID Info", "cleaned_text": "In Part 1 of the Twitter Files, we learned that Twitter was working with politicians, federal agencies, and Biden’s campaign team to censor information on Twitter – specifically as related to Hunter Biden’s laptop and the ensuing New York Post story.\n\nIn Part 2, we learned that teams of Twitter employees build blacklists, prevent disfavored tweets from trending, and actively limit the visibility of entire accounts or even trending topics—all in secret, without informing users. In other words, “blacklisting” and “shadowbanning” were real, despite congressional testimony by people like Jack Dorsey claiming otherwise.\n\nIn Part 3, we revealed how Twitter employees and directors escalated their censorship campaign in January 2020… and how they effectively threw out the rulebook in favor of their own partisan ideals.\n\nIn Part 4, we learned how Twitter executives built the case for a permanent ban – something unprecedented for a world leader up to that point. More importantly, we learned how that “decision” was written in stone before it ever happened.\n\nIn Part 5, we uncovered the uncouth truth about what really happened at Twitter when they chose to permanently ban a sitting US president from one of the most-viewed social platforms in the world.\n\nIn Part 6, we learned just how closely Twitter worked with government agencies – particularly the FBI – to shut down posts and accounts… all behind closed doors. Twitter’s contact with the FBI was constant and pervasive, as if it were a subsidiary.\n\nIn Part 7, we discovered how the FBI & intelligence community discredited factual information about Hunter Biden’s foreign business dealings before the New York Post broke the story about Biden’s laptop… and how the FBI gave Twitter nearly $3.5 million for their cooperation.\n\nIn Part 8, we found out how Twitter quietly aided the pentagon’s covert online PsyOp campaign. Despite promises to shut down covert state-run propaganda networks, Twitter docs show that the social media giant directly assisted the U.S. military’s influence operations.\n\nIn Part 9, we learned about “Other Government Agencies” (which is the federal codeword for the CIA), and how that agency was intimately involved in the effort to silence dissenting opinions on Twitter and other tech/media platforms.\n\nIn Part 10, we began to unwrap the pervasive censorship associated with SARS-CoV-2, including masks, lockdowns, and vaccine safety. Both political parties worked to silence reputable doctors and scientists, which led to injury and death for millions.\n\nIn Part 11, we reviewed how and why media – including Twitter – ultimately surrendered to the intelligence community. Moreover, most of this government-mandated censorship was based on rumors and misinformation, with federal agencies unable to support their allegations with hard data.\n\nIn Part 12, we learned how the FBI was able to moderate by proxy using an unrestricted “information highway” that turned Twitter into an involuntary subcontractor for the government’s censorship arm.\n\nIn Part 13, we’ll show how Scott Gottlieb – a current Pfizer board member and former FDA commissioner – pressured Twitter to remove factual information about COVID-19 in order to protect his financial interests.\n\nThis story comes from Alex Berenson. You can read the entire Twitter thread here.\n\nOn August 27, 2021, Dr. Scott Gottlieb – a Pfizer director with over 550,000 Twitter followers – saw a tweet he didn’t like, a tweet that might hurt sales of Pfizer’s mRNA vaccines.\n\nThe tweet explained correctly that natural immunity after Covid infection was superior to vaccine protection. It called on the White House to “follow the science” and exempt people with natural immunity from upcoming vaccine mandates.\n\nIt came not from an “anti-vaxxer” like Robert F. Kennedy Jr., but from Dr. Brett Giroir, a physician who had briefly followed Gottlieb as the head of the Food & Drug Administration. Further, the tweet actually encouraged people who did not have natural immunity to “Get vaccinated!”\n\nBy suggesting some people might not need Covid vaccinations, the tweet could raise questions about the shots. Besides being former FDA commissioner, a CNBC contributor, and a prominent voice on Covid public policy, Gottlieb was a senior board member at Pfizer, which depended on mRNA jabs for almost half its $81 billion in sales in 2021. Pfizer paid Gottlieb $365,000 for his work that year.\n\nGottlieb stepped in, emailing Todd O’Boyle, a top lobbyist in Twitter’s Washington office who was also Twitter’s point of contact with the White House.\n\nThe post was “corrosive,” Gottlieb wrote. He worried it would “end up going viral and driving news coverage.”\n\nI found the email in a search of records I ran at Twitter last week – part of Elon Musk’s “Twitter Files” effort to raise the veil on censorship decisions Twitter made before Musk bought the company in October.\n\nI went into detail about my involvement at the Twitter Files in a Substack article yesterday. I plan more reporting on the files in the weeks to come.\n\nThrough Jira, an internal system Twitter used for managing complaints, O’Boyle forwarded Gottlieb’s email to the Twitter “Strategic Response” team. That group was responsible for handling concerns from the company’s most important employees and users.\n\n“Please see this report from the former FDA commissioner,” O’Boyle wrote – failing to mention that Gottlieb was a Pfizer board member with a financial interest in pushing mRNA shots.\n\nA Strategic Response analyst quickly found the tweet did not violate any of the company’s misinformation rules.\n\nYet Twitter wound up flagging Giroir’s tweet anyway, putting a misleading tag on it and preventing almost anyone from seeing it. It remains tagged even though several large studies have confirmed the truth of Giroir’s words.\n\nA week later, on Sept. 3, 2021, Gottlieb tried to strike again, complaining to O’Boyle about a tweet from Justin Hart. Hart is a lockdown and Covid vaccine skeptic with more than 100,000 Twitter followers.\n\n“Sticks and stones may break my bones but a viral pathogen with a child mortality rate of <>0% has cost our children nearly three years of schooling,” Hart had written.\n\nWhy Gottlieb objected to Hart’s words is not clear, but the Pfizer shot would soon be approved for children 5 to 11, representing another massive market for Pfizer, if parents could be convinced Covid was a real threat to their kids.\n\nO’Boyle referred to “former FDA Commissioner Gottlieb” when he forwarded the report, again ignoring Gottlieb’s current work for Pfizer.\n\nThis time, though, Gottlieb’s complaint was so far afield that Twitter refused to act.\n\nAt the same time, Gottlieb was also pressing Twitter to act against me, as I disclosed on Substack on Oct. 13, 2022, drawing on documents that Twitter’s pre-Musk regime provided to me as part of my lawsuit against it. (Gottlieb’s action was part of a larger conspiracy that included the Biden White House and Andrew Slavitt, working publicly and privately to pressure Twitter until it had no choice but to ban me. I will have more to say about my own case and will be suing the White House, Slavitt, Gottlieb, and Pfizer shortly.)\n\nThe morning after I wrote that article, Gottlieb appeared on CNBC, the financial news channel where he is a contributor, and offered what at best was a seriously misleading explanation of his actions and his motives.\n\nGottlieb did not deny pressing Twitter on me – he could not, given the documents I had released the night before.\n\nBut in an interview with Joe Kernan of CNBC, Gottlieb said he had asked Twitter to act only because he was concerned if tweets raised the threat of violence against vaccine advocates.\n\n“The inability of these platforms to police direct threats, physical threats about people, that’s my concern about what’s going on in that ecosystem,” Gottlieb said.\n\n“I’m unconcerned about debate being made,” Gottlieb told Kernan. “I’m concerned about physical threats being made for people’s safety.”\n\nIn a tweet that morning, Gottlieb doubled down, writing:\n\nRespectful debate and dialogue is one thing, and should be encouraged and protected. But there’s no place for targeted harassment, and misleading dialogue which can instigate a small but persuadable group of people to make targeted and dangerous threats.\n\nBut Brett Giroir’s tweet about natural immunity was the definition of “respectful debate and dialogue.” And in his own email to Todd O’Boyle, Gottlieb did not raise any security concerns about it. He simply complained that it might wind up “driving news coverage.\n\nGottlieb is not just a Pfizer board member.\n\nHe is one of seven members of the board’s executive committee and the head of its regulatory and compliance committee, which oversees “compliance with laws, regulations, and internal procedures applicable to pharmaceutical sales and marketing activities.”\n\nPfizer has a long history of violating drug industry laws and ethics rules. In 2009, it agreed to pay $2.3 billion, the largest health care fraud settlement in American history, for fraudulently marketing several drugs. In 1996, it conducted a clinical trial of an antibiotic in Nigeria in which 11 children died and which became the inspiration for John le Carre’s novel The Constant Gardner.\n\nSo how will Pfizer react to the black-and-white proof from Twitter’s records that one of its most powerful board members secretly tried to suppress debate on the mRNA jabs that have has been by far its best-selling product since 2020?\n\nAnd will CNBC continue to let Gottlieb use it to mislead the public?", "opengraph": {"locale": "en_US", "type": "article", "title": "Twitter Files | Part XIII - How Scott Gottlieb Silenced Factual COVID Info", "description": "The \"Twitter Files\" tell an incredible story from inside one of the world's largest and most influential social media platforms.", "url": "https://thetruthaboutcancer.com/twitter-files-part-13/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:section": "Featured Articles", "article:published_time": "2023-01-10T16:31:39-04:00", "article:modified_time": "2023-01-13T10:52:12-04:00", "updated_time": "2023-01-13T10:52:12-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20230112163205/TTAC_Twitter-Files-PART-13-How-Scott-Gottlieb-Silenced-Factual-COVID-Info_Article_Email-WEB-FB.jpg", "image:width": "1000", "image:height": "523"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://thetruthaboutcancer.com/twitter-files-part-1/", "https://thetruthaboutcancer.com/twitter-files-part-2/", "https://thetruthaboutcancer.com/twitter-files-part-3/", "https://thetruthaboutcancer.com/twitter-files-part-4/", "https://thetruthaboutcancer.com/twitter-files-part-5/", "https://thetruthaboutcancer.com/twitter-files-part-6/", "https://thetruthaboutcancer.com/twitter-files-part-7/", "https://thetruthaboutcancer.com/twitter-files-part-8/", "https://thetruthaboutcancer.com/twitter-files-part-9/", "https://thetruthaboutcancer.com/twitter-files-part-10/", "https://thetruthaboutcancer.com/twitter-files-part-11/", "https://thetruthaboutcancer.com/twitter-files-part-12/", "https://twitter.com/AlexBerenson/status/1612526697038897167", "https://alexberenson.substack.com/p/my-first-dive-into-the-twitter-files", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(22)00287-7/fulltext", "https://ajph.aphapublications.org/doi/full/10.2105/AJPH.2022.307112", "https://twitter.com/drgiroir/status/1431433820054638595", "https://twitter.com/justin_hart/status/1433972514783330304", "https://alexberenson.substack.com/p/pfizer-board-member-scott-gottlieb", "https://twitter.com/squawkcnbc/status/1580913476847177728?lang=en", "https://twitter.com/ScottGottliebMD/status/1580961415988277248", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Scott Marino"], "publish_date": "2023-01-10T16:31:39-04:00"}