{"result_id": "308041", "URL": "https://thetruthaboutcancer.com/vaccine-pandemic-80-nuns-vaccinated-kentucky-convent-tested-positive-coronavirus-two-days-later/", "timestamp": "2023-04-25 17:36:09 CEST+0200", "meta": {"description": "Thirty-five nuns from the Benedictine Sisters of St. Walburg in Kentucky were vaccinated earlier this month for the Wuhan coronavirus...", "lang": "en", "keywords": "", "favicon": "https://thetruthaboutcancer.com/wp-content/themes/genesis-child/images/favicon.png", "canonical": "https://thetruthaboutcancer.com/vaccine-pandemic-80-nuns-vaccinated-kentucky-convent-tested-positive-coronavirus-two-days-later/", "encoding": "UTF-8"}, "image": null, "domain": "thetruthaboutcancer.com", "title": "The vaccine *IS* the pandemic", "cleaned_text": "(Natural News) Thirty-five nuns from the Benedictine Sisters of St. Walburg in Kentucky were vaccinated earlier this month for the Wuhan coronavirus (Covid-19), and just two days later two of them died and 26 others tested positive.\n\nAccording to Sister Aileen Bankemper, the convent’s prioress, the monastery was completely locked down during this entire time, and there was no movement of people in or out of the premises.\n\n“We [the Benedictine community] were shocked to have so many [Covid-19] cases since we were being extremely careful, not going out, and not having visitors since the beginning of the pandemic,” Bankemper is quoted as saying.\n\nSisters at the facility were so careful, she added, that they “redoubled” their efforts “after the [Christmas] holiday surge,” only to still see a surge in new cases and a few deaths.\n\n“Twenty-eight sisters tested positive for COVID-19,” Bankemper wrote in a Facebook post about what happened after the women were vaccinated with messenger RNA (mRNA) vaccines from Big Pharma.\n\n“The majority of them were able to get the monoclonal antibodies [antibody infusions] through St. Elizabeth’s Senior Services. Their symptoms are being managed pretty well.”\n\nSisters Charles Wolking and Rita Biltz, on the other hand, did not fare as well. They both died on Feb. 3, two days after getting jabbed. Neither showed any symptoms prior to their deaths, nor did they test positive for the novel virus before being injected.\n\n“Both of them were elderly and had some health issues and were not able to compete with Covid,” said sub-prioress Nancy Kordenbrok to a local media outlet.\n\nThird nun dies after getting stabbed with coronavirus vaccine\n\nA third sister, Margaret Mary Gough, was admitted to the ICU at St. Elizabeth Fort Thomas Hospital with respiratory problems upon testing positive for the Chinese virus immediately following her first dose of the vaccine.\n\nEarly on, it was believed that this sister would recover. However, she took a turn for the worse and died on Feb. 10 “from complications of the Covid virus,” according to the hospital.\n\nThis translates to a nearly 10 percent death rate among those vaccinated at Benedictine Sisters of St. Walburg. Should more sisters develop complications or die – God forbid – in the days and weeks to come, that rate will climb even higher.\n\nTo help quell fears about the jab killing people, Dr. Steven Feagins, the public health director for the region, announced that side effects such as death are “actually way more common than you might think.”\n\nHe added that in cases where patients suffer serious side effects after the first injection, the simply solution is to delay the second one for a while longer.\n\n“Whenever you get it, you get it, so we consider the 21 days [between jabs] minimum,” he is quoted as saying.\n\nThose sisters that still remain at Benedictine Sisters of St. Walburg are set to receive their second dose of the vaccine in May. That they need to get a second dose at all says they are on the Pfizer-BioNTech vaccine track rather than the Moderna track.\n\nThe latest reports suggest that around 66.5 million doses of Wuhan coronavirus (Covid-19) vaccines have so far been administered in the United States. These vaccines come with zero liability for their manufacturers and have not been fully safety tested, hence why they only have emergency use authorization (EUA) from the Food and Drug Administration (FDA).\n\n“The only real vaccine against ‘Covid-19’ is the truth, and turning off the TV,” wrote one commenter at LifeSiteNews about the situation.\n\nMore of the latest news about people dying from Wuhan coronavirus (Covid-19) vaccines can be found at Pandemic.news.", "opengraph": {"locale": "en_US", "type": "article", "title": "The vaccine *IS* the pandemic", "description": "Thirty-five nuns from the Benedictine Sisters of St. Walburg in Kentucky were vaccinated earlier this month for the Wuhan coronavirus...", "url": "https://thetruthaboutcancer.com/vaccine-pandemic-80-nuns-vaccinated-kentucky-convent-tested-positive-coronavirus-two-days-later/", "site_name": "The Truth About Cancer", "article:publisher": "https://www.facebook.com/thetruthaboutcancer/", "article:tag": "monumentalmyths1", "article:section": "Global Health News", "article:published_time": "2021-03-03T23:45:27-04:00", "article:modified_time": "2021-03-03T23:49:00-04:00", "updated_time": "2021-03-03T23:49:00-04:00", "image": "https://cdn.thetruthaboutcancer.com/wp-content/uploads/20210303234848/Nuns-Covid-Convent-1.png", "image:width": "855", "image:height": "468"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/join-free/", "https://www.naturalnews.com/2021-03-02-vaccine-pandemic-nuns-vaccinated-convent-tested-positive.html", "https://www.lifesitenews.com/news/several-nuns-die-after-taking-first-shot-of-covid-vaccine", "https://www.naturalnews.com/2021-01-08-portuguese-nurse-dies-after-receiving-coronavirus-vaccine.html", "http://pandemic.news", "https://www.lifesitenews.com/news/several-nuns-die-after-taking-first-shot-of-covid-vaccine", "https://www.naturalnews.com/2021-01-08-portuguese-nurse-dies-after-receiving-coronavirus-vaccine.html", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://shop.thetruthaboutcancer.com/pages/monumental-myths-medical-mafia/?promo_name=mmmm&promo_id=ttac-blog&promo_creative=monumentalmyths1&a_aid=5c93e0cd33850", "http://www.thetruthaboutcancer.com", "https://t.me/TheTruthAboutCancer_Vaccines", "https://gab.com/TyCharleneBollinger", "https://gettr.com/user/cancertruth", "https://truthsocial.com/@TheTruthAboutCancer", "https://app.clouthub.com/#/users/u/TheTruthAboutCancer", "https://www.bitchute.com/channel/vX3lcHH4Dvp0/", "https://rumble.com/c/TheTruthAboutCancerOfficial", "https://www.brighteon.com/channels/thetruthaboutcancer"], "authors": ["Carrie Chapman", "Betty Anne Graham", "Dennis", "Mike", "Harmonie Heart", "Tonya", "LJ", "Artelia", "Douglas Roy", "Ambeseat", "Micheline", "Mary", "Wim Wouters", "Sharon Smyth"], "publish_date": "2021-03-03T23:45:27-04:00"}