{"result_id": "309011", "URL": "https://www.thetruthseeker.co.uk/?p=262922", "timestamp": "2023-04-25 17:36:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=262922", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "Latest Twitter Files Reveal Company Suppressed Vaccine Sceptics, Even Eminent Doctors | The Truthseeker", "cleaned_text": "Newly released documents detail how Twitter executives sought to censor accounts sharing “true but inconvenient” data about the COVID-19 vaccines, even when the accounts belonged to eminent medical scientists. For the full story, read David Zweig’s report in the Free Press (based on a Twitter thread he posted on Monday). But the DailyMail.com has summarised the highlights.\n\nIn the latest instalment of the Twitter Files, journalist David Zweig laid bare how both the Trump and Biden administrations pressured Twitter executives to censor information that was “true but inconvenient”.\n\nUsing their pull, Zweig writes, the government was able to discredit doctors and experts, and suppress ordinary users’ freedom of speech on Twitter – even if they were citing the Center for Disease Control’s own data.\n\nThe Biden administration also piled pressure on the social media platform to suspend former New York Times reporter Alex Berenson over his tweets questioning Covid vaccines.\n\nThe documents provide more context as to how the government infiltrated the social media giant to suppress certain stories, as Twitter CEO Elon Musk vows there will be more revelations next week.\n\nAccording to the documents released on Monday, the Trump administration met with executives at Twitter, Google, Facebook and Microsoft looking for “help from the tech companies to combat misinformation” about “runs on grocery stores… that could stoke panic buying and behaviours” in the early days of the pandemic.\n\nThen, when the Biden administration took over, they became focused on tackling ‘misinformation’ about vaccines and targeted high-profile vaccine sceptics like Berenson.\n\nIn the summer of 2021, Zweig writes, Biden said social media companies were “killing people” for allowing vaccine misinformation – and just a few hours later, Berenson’s account was suspended.\n\nHe was kicked off the platform the following month, and ultimately sued (and settled with) Twitter.\n\nAs part of the legal process, Twitter was compelled to release internal communications, which showed how the White House pressured the company to take action on Berenson.\n\nBut the Biden administration was apparently “very angry” that Twitter had not done more to deplatform other accounts, and pressured executives to do more.\n\n“Twitter executives did not fully capitulate to the Biden team’s wishes,” Zweig tweeted on Monday.\n\n“An extensive review of internal communications of the company revealed employees often debating moderation cases in great detail and with more care than was shown by the government toward free speech.\n\n“But Twitter did suppress views – many from doctors and scientific experts – that conflicted with the official positions of the White House.\n\n“As a result, legitimate findings and questions that would have expanded the public debate went missing,” Zweig wrote.\n\nAmong the many experts that were deemed to have spread ‘misinformation’ was Dr. Martin Kulldorff, an epidemiologist at Harvard Medical School.\n\nOn March 15th, 2021 he responded to a question about whether those who have already had the virus and young children should get the vaccine.\n\n“No. Thinking that everyone must be vaccinated is as scientifically flawed as thinking that nobody should,’ he wrote at the time. ‘COVID vaccines are important for older high-risk people and their caretakers.\n\n“Those with prior natural infection do not need it. Nor children.”\n\nThat tweet was flagged by a content moderator at the site saying it shared “false information regarding the efficacy of the COVID-19 vaccines” because it differed from Centers for Disease Control guidelines at the time.\n\nIt was soon labeled as “misleading”, and all replies and likes were shut off.\n\nAnd a tweet by Kelly Kga, a public health fact checker, was also labeled as “misleading”, with its likes and replies disabled – even though it displayed the CDC’s own data.\n\n“Internal records showed that a a bot had flagged the tweet, and that it received many ‘tattles’ (what the system amusingly called reports from users,” Zweig wrote.\n\n“That triggered a manual review by a human who – despite the tweet showing actual CDC data – nevertheless labeled it ‘misleading’.”\n\nBut the tweet that Kelly Kga was replying to “contained actual misinformation”, Zweig said, claiming that Covid was the leading cause of death from disease in children.\n\n“Yet that tweet remains on the platform, and without a ‘misleading’ label,” Zweig tweeted.\n\nMeanwhile, Andrew Bostom, a Rhode Island physician, was permanently suspended from the site after he tweeted a peer-reviewed study about the efficacy of mRNA vaccines.\n\n“A review of Twitter log files revealed that an internal audit, conducted after Bostom’s attorney contacted Twitter, found that only one of Bostom’s five violations were valid,” according to Zweig.\n\n“The one Bostom tweet found to still be in violation cited data that was legitimate but inconvenient to the public health establishment’s narrative about the risks of flu versus CIVUD in children,” he wrote.\n\nUltimately, Zweig said, Bostom’s account was finally restored on Sunday.\n\nThere are plenty more examples. You can read the rest of the Mail story here and Zweig’s full account here.\n\nStop Press: The World Economic Forum has decided not to post on Twitter during next month’s Davos, directing people who want to follow the conference moment-by-moment to Chinese social media apps TikTok, WeChat, and Weibo instead. Jordan Schachtel has more.\n\nStop Press 2: Jeffrey Tucker of the Brownstone Institute has written about how “the closing down of opinion and debate” at social media platforms like Twitter “resulted in unspeakable human carnage”. More here.\n\nStop Press 3: The Naked Emperor has written a piece on his Substack about why the Twitter Files have received so little coverage in the mainstream media.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://www.thefp.com/p/how-twitter-rigged-the-covid-debate", "https://twitter.com/davidzweig/status/1607378386338340867", "https://www.dailymail.co.uk/news/article-11574573/Twitter-suppressed-covid-information-doctors-experts.html", "https://www.dailymail.co.uk/news/article-11574573/Twitter-suppressed-covid-information-doctors-experts.html", "https://www.thefp.com/p/how-twitter-rigged-the-covid-debate", "https://dossier.substack.com/p/world-economic-forum-cancels-twitter?utm_source=post-email-title&publication_id=69009&post_id=93093818&isFreemail=true&utm_medium=email", "https://brownstone.org/articles/how-occupied-twitter-ruined-lives/", "https://nakedemperor.substack.com/p/twitter-files-the-important-question?publication_id=602373&isFreemail=true", "https://dailysceptic.org/2022/12/27/latest-twitter-files-reveal-company-suppressed-vaccine-sceptics-even-eminent-doctors/"], "authors": [], "publish_date": null}