{"result_id": "309019", "URL": "https://www.thetruthseeker.co.uk/?p=246078", "timestamp": "2023-04-25 17:36:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=246078", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "An Impolite Message To Those Who Got The Covid “Vaccine” | The Truthseeker", "cleaned_text": "An Impolite Message To Those Who Got The Covid “Vaccine”\n\nWake up, you idiots! If you willingly got the genetic-modification treatment known as the COVID-19 “vaccine” (Pfizer, Moderna, Johnson & Johnson, AstraZeneca, etc.), you were tricked into injecting a harmful, dangerous, unapproved, and often lethal product into your body. A wholly unnecessary product that does not protect you, does not provide immunity or prevent transmission of the virus—but does wreck your immune system, damages your organs, causes blood clots and internal inflammation, and renders you more susceptible to many diseases, including cancer.\n\nBecause you took the “vaccine”, your body is manufacturing millions or billions of spike proteins. The spike protein is toxic, pathogenic (disease-causing), and coagulatory (it causes blood clots). These synthetic spike proteins made by your cells are supposedly identical to the spike protein in the SARS-CoV-2 virus, as determined by computer modeling of genetic fragments supplied to the U.S. from Chinese laboratories controlled by the Chinese Communist Party.\n\nThat’s what your body is producing by the millions or billions, confusing the hell out of your immune system, weakening its ability to make essential helper T cells and CD8 cells which ward off other viruses and diseases.\n\nThe lipid hydrogel that coats the fragile mRNA strands in the Pfizer and Moderna shots contains nanoparticles that cross the blood-brain barrier, causing paralysis, uncontrollable convulsions, neurodegenerative diseases, permanent vision loss, spinal damage, and more. Hundreds of thousands of people have suffered these “side effects”—or dropped dead—within hours or days after getting the jab.\n\nThe vaccine manufacturers knew full well about all of the potential adverse reactions. Therefore, the so-called “vaccine” is a bioweapon. Its only conceivable purpose is depopulation. The “vaccine” has nothing to do with improving your health. It’s an instrument of social control, part of the Great Reset aiming for an authoritarian technofascist society where “you will own nothing, and you’ll be happy,” as per the World Economic Forum.\n\nYou should know:\n\n* The lockdowns you observe as a key ritual in your new State Religion—the Covidian Cult—are absurd and have no scientific basis.\n\n* Your face-diapers (“masks”) are useless. There is no scientific basis to warrant their use, but they do increase bacterial diseases in the mask-wearer and are especially dangerous for children, blocking the flow of oxygen and potentially injuring their brains.\n\n* The fraudulent PCR test is a scam. It’s incapable of diagnosing any illness or infection, as pointed out by Dr. Kary Mullis, Nobel Prize-winning inventor of the PCR technique. The CDC, FDA, and WHO have all officially admitted that the PCR test is worthless and can’t differentiate between COVID-19 and the seasonal flu or common cold! The diagnostic tests being introduced in December to replace the phony PCR test are all “Emergency Use Authorization” gimmicks, as meaningless as the PCR test.\n\n* The PCR test yields false-positives up to 97% of the time. Yet this junk data was (and is) used as the basis to declare a pandemic and enforce lockdowns, masks, social distancing, and mandated vaccines.\n\nThe Powers That Be tested your willingness to comply. To be misled. To do irrational, self-destructive things. And you obeyed, you fell for it. You fell for the scamdemic, predicated on a respiratory virus that is less dangerous than the seasonal flu according to the governments’ own statistics.\n\nThe people whom you label “anti-vaxxers” or “conspiracy theorists” are no such thing. They’re ordinary people, just like you. But unlike you, they used common sense. They were not cowed by the Mainstream Media’s 24/7 fear-mongering campaign of lies and disinformation. They did their homework and quickly discovered that the so-called Covid “vaccines” are a great hazard thousands of times more dangerous than any alleged “novel coronavirus”.\n\nGuess who’s exempt from all requirements and mandates to get the COVID-19 “vaccine”? The following people are totally exempt: all US Senators and House Representatives plus all Congressional staff; 6,000 White House employees; all employees of Pfizer (2,500), Moderna (1,500), and Johnson & Johnson (120,000); 15,000 CDC workers; and 14,000 FDA employees.\n\nNow do you see the elephant in the room? The Pharma-controlled politicians, the vaccine companies, the corrupt CDC and FDA health agencies owned by Big Pharma, the government officials who are forcing the death-shots on the rest of us…They are all EXEMPT from getting the jab. They know what’s in the poisonous serum and what harm it can do. But you must take it or lose your job. You must get jabbed with the genetic cocktail if you want to go shopping or eat at a restaurant.\n\nDo you see how insane and criminal this is? Do you still think it’s a “crazy conspiracy theory”? You’re close. It’s an insane conspiracy indeed, hatched by eugenicists, depopulation advocates, super-wealthy oligarchs, and One World Government proponents over twenty years ago.\n\nOh, I almost forgot… Two million illegal aliens are also exempted from the vaccines by the unelected President Biden, so that they can flood the country, get bussed or jet-planed to Republican states, and spread sickness and death while they receive endless government hand-outs and vote Democrat. And the Republicans are letting it happen.\n\nIf you got the clot-shot because of fear of losing your job, then my apologies to you, you are in a very tough situation.\n\nIf you willingly got the jab and you’re proud of it—like Jennifer Aniston, Arnold Schwarzenegger, Dolly Parton, Hugh Jackman, Kathy Hochul (NY Governor), Don Lemon (CNN), Mike Pence, Martha Stewart, Amber Heard, Bruce Springsteen, Alexandria Ocasio-Cortez, Jane Fonda, Bernie Sanders, Greta Thunberg, Willie Nelson, and many more—then you’re an ignorant fool. You’re an obedient disciple of the new State Religion, Branch Covidian. You fell for an Official Narrative which has holes in it bigger than moon-craters. The Official Narrative has been completely demolished, but you were brainwashed and you’re still living dangerously in an alternate reality that’s been superimposed on the real, actual unfolding horror-show of escalating tyranny.\n\nYou need to be deprogrammed.\n\nYou need to never take another genetic Covid “vaccine” or booster ever again.\n\nYou need to tell your friends and family and everyone you know to stay away from these kill-shots.\n\nWake up and smell the coffee! It’s not too late to remove yourself from the Covidian Cult. If you got the kill-shot, there are many things you can do to strengthen your immune system and reduce the odds of vaccine-induced disease or death down the road.\n\nThe Unvaxxed are not your enemies. They present absolutely no danger to you, despite the controlled media’s blatant lies claiming there’s a “Pandemic of the unvaccinated”. Just the opposite is true: Tens of thousands of healthy, unvaxxed people who’ve been in close proximity to the vaxxed are suffering terrible problems, apparently caused by the vaxxed individuals’ shedding of spike protein through breath, saliva, perspiration, and urine. These very real problems include agonizing menstrual pain, bleeding while pregnant, miscarriages, massive blood clots, severe muscular pain, random bruising all over the body, nonstop migraines, pericarditis, autoimmune diseases, shingles, and even Bell’s palsy (facial paralysis).\n\nTo put it bluntly, the vaccinated are “lepers” whom the unvaxxed would do well to avoid prolonged contact with. Many hair salons, beauty parlors, and holistic doctors are now refusing to see anyone who has been vaccinated for COVID-19.\n\nThe Unvaxxed are not your enemies. Once you realize what’s been done to you, and why, please come join with the Unvaxxed to defeat a common enemy, to expose and punish the monsters who perpetrated this colossal fraud, and to reverse the totalitarian measures that, if allowed to continue, will destroy the USA, physically, morally, and politically.\n\nHow Operation COVID-19 & Covid Super Vaccination Agenda Complement Each Other to Kill and Sicken a Maximum Number of Human Beings Without Detection https://stateofthenation.co/?p=95290\n\nDr. Shankara Chetty, an Indian-origin doctor based in South Africa, explains how the Covid “vaccines” were designed to wreak widespread damage on humans in such a way that fatalities will be attributed to other causes: “This plan is to make sure that we can control and kill off a large proportion of our population without anyone suspecting that we were poisoned….”\n\nThe Killer in the Bloodstream: the ‘Spike Protein’. Mike Whitney\n\nThe Covid-19 Pandemic Does Not Exist – Part I. Prof. Michel Chossudovsky https://www.globalresearch.ca/the-covid-19-pandemic-does-not-exist/5760903\n\nMayo Clinic-trained doctor says covid “vaccines” are locking in suppressed immunity, making people more prone to HIV, HPV, shingles, herpes https://www.naturalnews.com/2021-11-19-covid-vaccines-suppressed-immunity-hiv-hpv-herpes.html\n\n“The purpose of this report is to document how all over the world millions of people have died, and hundreds of millions of serious adverse events have occurred, after injections with the experimental mRNA gene therapy. We also reveal the real risk of an unprecedented genocide.”\n\n“COVID-19 and the PCR Test — No Pandemic, Only Junk Data!” https://www.globalresearch.ca/covid-19-pcr-test-no-pandemic-only-junk-data/5746038junk\n\nAN OPEN LETTER: America Must Rise Up — A Declaration for ReFounding America Now. Peter R. Breggin MD, Peter A. McCullough MD, MPH, Ginger R. Breggin, Elizabeth Lee Vliet MD, Vladimir “Zev” Zelenko MD\n\nThis originally appeared on State of the Nation and was reprinted with the author’s permission.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://stateofthenation.co/?p=95746", "https://stateofthenation.co/?p=95290", "https://www.paulcraigroberts.org/2021/11/20/the-covid-vaccine-has-caused-a-pandemic", "https://www.unz.com/mwhitney/the-killer-in-the-bloodstream-the-spike-protein", "https://www.globalresearch.ca/the-covid-19-pandemic-does-not-exist/5760903", "https://www.naturalnews.com/2021-11-19-covid-vaccines-suppressed-immunity-hiv-hpv-herpes.html", "https://www.stopworldcontrol.com/downloads/en/vaccines/vaccine-death-report.pdf", "https://www.globalresearch.ca/covid-19-pcr-test-no-pandemic-only-junk-data/5746038junk", "https://stateofthenation.co/?p=95648", "https://summit.news/2021/11/18/keep-complying-idiots", "https://stateofthenation.co/", "https://www.lewrockwell.com/2021/11/no_author/an-impolite-message-to-those-who-got-the-covid-vaccine/"], "authors": [], "publish_date": null}