{"result_id": "309022", "URL": "https://www.thetruthseeker.co.uk/?p=257196", "timestamp": "2023-04-25 17:36:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=257196", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "Vaccine Deaths Outnumber Covid Deaths in U.S. Households, Two New Polls Confirm | The Truthseeker", "cleaned_text": "Polls of the U.S. public continue to show that up to twice as many Americans have lost a household member to a Covid vaccine injury as have lost one to Covid.\n\nThe pooled results of five surveys of the American public, now totalling over 2,500 people, show that while 4.4% of respondents reported that a member of their household had died from COVID-19, 8.9% said a member had died as a result of Covid vaccination.\n\nThe results also showed that 8.6% said they had been injured by their vaccination, 4.9% that they had sought medical help and 3.2% that they had been hospitalised, while 3.6% said that as a result of vaccination they were no longer able to work a full day or at all. These are percentages of all respondents. If we look only at the 74.0% vaccinated with at least one dose then the figures, as a proportion of vaccinated persons, are 11.7% injured, 6.7% needing medical help, 4.4% hospitalised and 4.8% unable to work. While these figures are self-reported and there is no control group, since the unvaccinated were not asked about adverse events, they are still alarmingly high.\n\nThe results also showed that, among those who reported a Covid death in their household, more than twice as many reported that it occurred after the person was vaccinated than before (2.8% vs 1.2%). The proportion who said they had contracted Covid before their vaccination (13.1%) was very similar to the proportion who said they contracted it afterwards (11.7%). These figures are not indicative of a vaccine highly effective against either infection or death.\n\nThe people polled were randomly selected, representative samples of the U.S. public, of whom 74.0% were vaccinated, so the samples were not inherently biased towards or against the reporting of vaccine problems, though as in all opinion polls (especially online ones) there may be an issue of self-selection bias.\n\nI reported on the first three of these polls last month. Two more have now been added, each from a different polling company, and the results of all five are strikingly similar (see summary table below), indicating that the findings are a true representation, if not of the American public, at least of the section of the American public inclined to complete polls like this.\n\nSome commentators have express scepticism about the results, implying they are skewed in some way. It’s true that they are funded by Steve Kirsch, a technology entrepreneur who is raising awareness of safety and efficacy issues around the Covid vaccines. However, the polls are by ordinary polling companies surveying an ordinary representative sample of the U.S. population, so there is nothing to criticise on that score. The results are not under the control of the funder and the questions are neutral. The fact that they are all similar, regardless of which polling company is used, shows that the results are not anomalous. Anyone can commission a similar survey if they wish – though Steve Kirsch discovered that Google and some other polling companies refused to run surveys asking people about their experience of the vaccines.\n\nSteve has enlisted the help of a survey expert, who he says is nationally known and well-respected, though he hasn’t yet revealed his identity. The expert has done two surveys on vaccine safety, one for Steve and one for another client, and he says the safety signal is “real, significant and gravely concerning”.\n\nPhase 1: Signal Detection. Using convenience samples, we validated that there is a significant signal that the general population is reporting a variety of issues and adverse events related to the Covid vaccine programme. While not representative of the entire population and certainly imperfect in design, the multiple iterations of the same questionnaire across two different independent survey panels validate the strong signal detection. Internal consistency matters even when dealing with subjective issues like surveys, and these data are absolutely consistent.\n\nPhase 2: Validation. This first study using a more high quality sample source, and the planned duplication across at least one other independent platform, validates that the signal is real, significant and gravely concerning. The surprising level of coherence in these data, now across three unrelated sample sources, is indisputable. We’ll do one more study with a fourth source, but I am confident we’ll see the same high level of validation. The signal has been detected and it is clear; something is very, very wrong.\n\nSteve Kirsch’s five polls have all been carried out in the last five weeks. You can find them here: June 30th, July 2nd, July 4th, July 20th, July 28th.\n\nDespite the striking consistency between the surveys, it ought to be noted that the findings don’t fit neatly with what we know from other sources. For example, the surveys show 6-7% seeking medical care following vaccination, whereas government surveys have typically found just under 1%. Similarly, there are around 120 million households in the U.S, so if 4.4% of them had a Covid death (as per the surveys) then that would give 5.3 million Covid deaths – yet official figures show there have been around 1 million Covid deaths in the U.S. Why are the surveys coming up with figures that are five to seven times higher than other sources? This does need to be answered.\n\nA further question is raised by a sixth poll commissioned by Steve Kirsch (on July 11th), this one much shorter, asking only two questions, one about household members having Covid and one about them having a vaccine injury. It found 22 of the 500 respondents (4.4%) reported a vaccine death in the household versus 40 (8%) who reported a Covid death. These proportions are still high, but they are not consistent with the other five polls, the two figures being reversed. Is this survey anomalous or would it be replicated in similar short polls? If so, it may indicate a source of bias in the length of the poll.\n\nNonetheless, such issues should not distract from the key point, that representative surveys of the American public are consistently finding alarmingly high reported rates of serious vaccine injury and death. This is not a safety signal that should be ignored.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/our-latest-polls-show-twice-as-many", "https://dailysceptic.org/2022/07/07/twice-as-many-vaccine-deaths-as-covid-deaths-in-u-s-households-poll-finds/", "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2022/08/image-13.png", "https://stevekirsch.substack.com/", "https://stevekirsch.substack.com/p/google-does-not-want-anyone-to-find", "https://stevekirsch.substack.com/p/new-zogby-poll-10-of-americans-regret", "https://www.skirsch.com/covid/PollfishJun30.pdf", "https://www.skirsch.com/covid/PollfishJun30.pdf", "https://www.skirsch.com/covid/PollfishJul4.pdf", "https://www.questionpro.com/t/7BoNDsZtrha", "https://www.tapresearch.com/insights_platform/results/9d44d44520680c665d966f491df62f85/vsrf-1", "https://dailysceptic.org/2022/07/06/whats-behind-the-surge-of-nearly-8000-excess-deaths-since-april/", "https://www.skirsch.com/covid/PollfishJul11.pdf", "https://dailysceptic.org/donate/", "https://dailysceptic.org/2022/08/06/vaccine-deaths-outnumber-covid-deaths-in-u-s-households-two-new-polls-confirm/"], "authors": [], "publish_date": null}