{"result_id": "309007", "URL": "https://www.thetruthseeker.co.uk/?p=242617", "timestamp": "2023-04-25 17:36:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=242617", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "World Renowned Vaccine Expert Dr. Geert Vanden Bossche reveals the truth of Covid-19 | The Truthseeker", "cleaned_text": "This is a presentation quite old but still very, very important for people to try to understand what is really going on.\n\nApart from the money motive, and the motive to tag people for AI grids, to “control” them, none of which motives are sufficient, even in combination, to explain the urgent pressures by the “authorities” to have everyone vaccinated, which makes us have to suspect that the real reason for the pressures and the urgency has to be on the medical side of the equation. This means that the vaccines are meant to make people who are vaccinated with them, either much less protected from some hugely lethal virus to come, or to protect them more from it. The first question, therefore, has to be whether or not the vaccines were actually made to be “virus specific” to the Covid virus or not, and even if so, we then have to ask if there other much more-lethal viruses in their labs and arsenals of virus bioweapons in which the vaccines would make people more or less vulnerable to them? If likely so, then we have to try to predict the next page of the script.\n\nBossche says that these are “virus specific” antibodies from the vaccines, meaning they are made for a specific virus, and the message also is that they were not designed for “variants”. The question arises what in fact they were really designed for, because the evidence is that the vaccines have never really worked to prevent people from getting Covid, or to stop its spread. All of the evidence indicates they were never really needed to stop the Covid plague which petered out with so few deaths anyway.\n\nThe “authorities” say that the vaccines have “reduced” its spread and that it “reduces” its symptoms, and they are relying on any evidence of that they can, spurious or otherwise, to keep forcing the vaccines on more and more people. Yet, there is no evidence that the vaccines were designed for the variants, and it is the same authorities who are saying that original Covid virus of the last two flu seasons have morphed into a variety of variants. If so and if Bossche is right, then vaccinated people ought to be dying like flies this flu season, perhaps with the Mu variant or some other they will introduce.\n\nBut the evidence appears that the vaccines which worked so poorly with the Covid virus, and are still being administered, could not have been so very “specific” to that virus and also could not have been made for any unforeseen variant to make it specific to that variant. Therefore, it could be a “foreseen” one, at least in Bossche’s mind. Yet, it is completely rational to suspect that if the “authorities” of our nations are parities to the act of deliberately releasing the Covid virus in the first place, that the vaccines likely were part of their planning in this scripted real-life theater they are directing. If the vaccines were actually designed before the Covid virus and are not that specific to it, then because the patent evidence is that the Covid virus was concocted and patented some 19 years ago and because it has in fact been subject to numerous “gain-of-function” experiments and enhancements since, then there likely the vaccines also patented long ago were also prepared for us over the past decade or so, as were numerous virus variants. Hence, my question from the other day remain. What is the real purpose of these vaccines? Perhaps they are “virus specific” to a “variation” to be released. In this light, from a man who was a real Gates insider, and in order to rise so highly in that organization he would have had to subscribe to the IPP demonology of radically reducing the world population and getting rid of all of the “unwanted” and “non-essential” useless eaters. If he had a turn of conscience from this screed he would want everyone to get jabbed to save them from the hugely lethal virus to come. Rather, he is saying don’t get jabbed because you will be more vulnerable to any lethal variant to come. So which is it?\n\nHe is concerned about some much worse variant to come making those vaccinated more defenceless because of the vaccine antibodies weakening our natural immune systems. But so what? It could only be the flu. Why the panic? Why break ranks with your handlers to raise such alarm about not just the vaccines and “virus specific” but more particularly to some “variant” to come? If anything reliable can be gleaned from this video, it is that Bossche is in fact more concerned not about any variant, but likely another one isolated and ready to go.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}