{"result_id": "309013", "URL": "https://www.thetruthseeker.co.uk/?p=241096", "timestamp": "2023-04-25 17:36:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=241096", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "More patients are dying from the vaccine than from Covid | The Truthseeker", "cleaned_text": "More patients are dying from the vaccine than from Covid\n\nAbrien Aguirre is a board certified occupational therapist who recently went public with his knowledge of working in 3 COVID units in Hawaii, two of them “isolation units.” He states that he works in the largest skilled nursing facility in Oahu, working with the geriatric population.\n\nHe was interviewed by a group known as “Hawaii Free Speech News.”\n\nHis testimony was recorded at a recent outdoor protest held at the Hawaii State Capitol in Honolulu.\n\nHe starts out his testimony by saying that the media is misrepresenting what is happening with hospitalized COVID patients. He states:\n\nThe people moved to the COVID unit, didn’t have COVID. They tested positive with the PCR test, but most of them were asymptomatic and only suffering from their pre-existing conditions.\n\nHe explains how people with terminal illnesses were put on the COVID death lists, which he says is “complete fraud.”\n\nThey rolled out the Moderna mRNA experimental injections at his facility, and he says:\n\nI’ve seen 32 elderly people pass away immediately after taking the Moderna vaccine. None of that is being talked about on the News. It doesn’t fit their narrative.\n\nI’ve seen more people pass away from the vaccine, than I have in COVID units.\n\nHe explains that he worked as a “Director of Rehab” in one skilled nursing facility for 5 months, and he saw where the billing department would have his therapist change medical diagnosis codes from things like pulmonary disorder to COVID because of higher reimbursements. And this even happened with cases that were not only asymptomatic, but sometimes they did not even have a positive PCR test result for COVID.\n\nIt’s just fraud on every level.\n\nMr. Aguirre states that he has reached out to politicians to expose this fraud, including the Governor of Hawaii, and their response is silence. Not one of them has responded.\n\nHis last advice in the interview:\n\nMy advice to people: if your elderly are sick, your grandmother, your great grandmother, your mom, don’t send them to a skilled nursing facility. They’re not going to receive adequate care.\n\nTreatment is going to be withheld from them. They’re going to be forced to wear a mask all day, and social distance.\n\nThey’re going to become depressed and want to commit suicide. Because that is what I am seeing in our facilities.\n\nThis testimony by Abrien Aguirre is one of the most damning interviews I have ever seen. Everyone should send a copy of this video to their “elected” officials, because the U.S. medical system has now become thoroughly corrupt.\n\nMr. Aguirre has nothing to gain, and much to lose by going public, putting his career and possibly even his life on the line to go public with this damning information.\n\nSince politicians are complicit with these murders and crimes, it is unlikely that they will do anything about it.\n\nBut by exposing their crimes, especially those who claim they are “just doing their jobs,” we can ensure that they will most certainly be held accountable for these murders and crimes against humanity.\n\nThere is no place in Hell too hot for where most of these people are going to end up.\n\nThis is from our Rumble Channel, and it is also on our Bitchute Channel.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://rumble.com/vl0flw-certified-occupational-therapist-whistleblower-more-patients-are-dying-from.html", "https://www.bitchute.com/video/im8tqf0JtSPB/", "https://vaccineimpact.com/2021/board-certified-occupational-therapist-whistleblower-more-patients-are-dying-from-the-vaccine-than-from-covid/"], "authors": [], "publish_date": null}