{"result_id": "309016", "URL": "https://www.thetruthseeker.co.uk/?p=263996", "timestamp": "2023-04-25 17:36:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=263996", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "BBC must publicly retract covid vaccine “safety and efficacy” claims made based on ONS data | The Truthseeker", "cleaned_text": "BBC must publicly retract covid vaccine “safety and efficacy” claims made based on ONS data\n\nThe UK Statistics Regulator has confirmed, in writing, that data published by the Office for National Statistics (“ONS”) cannot be used in support of the “safe and effective” narrative.\n\n“Many researchers and news organisations have made claims of vaccine efficacy and safety based on the ONS reports. We therefore now call on all those who have made such claims [especially the BBC] to publicly retract them,” said Professors Norman Fenton and Martin Neil.\n\nIn November four researchers – Professor Norman Fenton, Professor Martin Neil, Dr. Clare Craig and Scott McLachlan – wrote a formal letter of complaint to the Statistics Regulator about the ONS data on vaccine mortality. Their letter stated:\n\n“All of the anomalies in the dataset introduce bias in favour of analyses supporting vaccine ‘safety and efficacy’. The fact that these data are being used as continued justification for the efficacy and safety of the covid vaccines is therefore now a matter of national concern and scandal. We believe that an investigation into how and why the ONS dataset is so flawed and corrupted is required.”\n\nRead more: Researchers tell ONS “Your Data on Vaccine Mortality is Flawed” & demand Public Withdrawal of Dataset\n\nYesterday, the four researchers received a response which admits that the ONS data should not be used to support assertions that covid injections are “safe and effective.” The response states:\n\nOur overview, is that the Deaths by Vaccination Status publication does not provide information vaccine effectiveness or vaccine safety, and should not be used this way.\n\nONS Deaths by Vaccination statistics, Correspondence from Director General for Regulation, 20 January 2023\n\nProfessors Norman Fenton and Martin Neil published their comments on the Regulator’s response on Substack:\n\nWhile there are aspects of the response that we are unhappy with, the crucial point is that they have completely accepted our main recommendation [that ONS’ Deaths by Vaccination report cannot be used to support vaccine “safety and efficacy.”]\n\nMany researchers and news organisations have made claims of vaccine efficacy and safety based on the ONS reports. We therefore now call on all those who have made such claims to publicly retract them.\n\nIt is also important to note that the Regulator agreed with our conclusions that the ONS population sample was biased – with those excluded much more likely to be unvaccinated.\n\nWe therefore call on all of those – including especially the BBC – who have used the ludicrously low estimates from the ONS to publicly withdraw all material based on these estimates, as they have been deliberately used to represent the unvaccinated as a tiny fringe minority.\n\nThe not-so-good news is that, as expected the Regulator has gone to extreme lengths to defend the integrity of the ONS. In particular, they are putting forward the ‘healthy vaccinee effect’ which we have previously dealt with and which we will be further dismantling in the next few weeks.\n\nOur analysis of the most recent ONS report on deaths by vaccination status is HERE. That report was published in July 2022 with the most recent data up to May 2022. Despite promises to do so, the ONS had not provided any updates to it since.\n\nUK Statistics Regulator agrees with our recommendation to ignore any claims of vaccine safety based on ONS deaths by vaccination status data, Where Are the Numbers, 20 January 2023\n\nWE URGENTLY NEED YOUR HELP…\n\nWe’re not funded by the Government\n\n to publish lies & propaganda on their\n\n behalf like the mainstream media.\n\nInstead, we rely solely on our support. So\n\n please support us in our efforts to bring you\n\n honest, reliable, investigative journalism\n\n today. It’s secure, quick and easy…", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/11/24/researchers-tell-ons-your-vaccine-death-data-is-flawed/", "https://d7694293-ffb8-4ed0-a014-3581d49070e4.usrfiles.com/ugd/d76942_d5fe1cb1d51b4643b9ce09252f732516.pdf", "http://wherearethenumbers.substack.com/p/mhra-and-bbc-fail-to-meet-their-own-deadline-for-responding-to-complaints-about-unvaccinated", "http://dx.doi.org/10.13140/RG.2.2.28055.09124", "http://dx.doi.org/10.13140/RG.2.2.30898.07362", "https://wherearethenumbers.substack.com/p/uk-statistics-regulator-agrees-with", "https://expose-news.com/2023/01/21/expose-january-2023-fundraising-campaign/", "https://expose-news.com/2022/12/15/urgent-december-fundraising-campaign/", "https://expose-news.com/2023/01/21/expose-january-2023-fundraising-campaign/", "https://expose-news.com/we-need-your-support/", "https://expose-news.com/2023/01/21/bbc-must-retract-safety-and-efficacy-claims/"], "authors": [], "publish_date": null}