{"result_id": "309031", "URL": "https://www.thetruthseeker.co.uk/?p=246023", "timestamp": "2023-04-25 17:36:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=246023", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "Vaccine Scandal in Slovenia – Bottles have Code #’s for Placebo, Vax, or KILL SHOT | The Truthseeker", "cleaned_text": "Word is coming out of Slovenia that, if verified, will cause an unimaginable world reaction.\n\nOn Saturday 20 November, the Chief Nurse of the University Medical Center, Ljubljana Clinical Center (pictured above), who deals with the administration of vaccine vials and manages everything, quit her job, went in front of TV cameras and took out vaccine bottles.\n\nShe showed the gathered journalists the codes on the bottles, each with the final number 1, 2, or 3 in the code, and then explained the meaning of these numbers:\n\nNumber 3 is an RNA stick containing the ONC gene, related to adenovirus, which contributes, among other things, to the development of cancer.\n\nFor these who get jabbed from vial whose code ends in the number 3, she says people who received them will have soft tissue cancer within 2 years.\n\nShe said that she had personally witnessed the vaccinations of all politicians and tycoons and that they all received the preparation number 1\n\nThe media has been told to absolutely bury this story and fierce efforts at containing this information are underway right now.\n\nMore details if they become available.\n\nRetired Slovenian Nurse Says 30% Of Population Getting Vaccine Placebo (August 2021)", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://halturnerradioshow.com/index.php/en/news-page/world/vaccine-scandal-in-slovenia-bottles-have-code-s-for-placebo-vax-or-kill-shot"], "authors": [], "publish_date": null}