{"result_id": "309025", "URL": "https://www.thetruthseeker.co.uk/?p=229979", "timestamp": "2023-04-25 17:36:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=229979", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "The Probe into the Israeli Vaccine Policy and its Outcome is beyond Damning. | The Truthseeker", "cleaned_text": "In Israel yesterday, an independent legal body that calls itself the Civilian Probe (CP)* published its finding regarding the catastrophic impact of the Pfizer vaccine on the nation.\n\nIn their report, which they submitted to the Attorney General and the Health Minister, the committee listed a chain of critical legal and ethical failures that point at a possible attempt to mislead not just Israelis but also the entire world. Since the beginning of January I have been reporting on an undeniable correlation between vaccinations, cases and deaths (here , here, here and here ). The CP confirms my suspicions but their study also presents alarming medical findings regarding the scale of lethal side effects.\n\nIn the document the CP points at a government attempt to conceal its dealing with Pfizer. The document states that “the Pfizer-Israel agreement is suffocated with redacted segments, consequently, it is not possible to analyze it legally and/or fully grasp Its implications as far as public health is concerned… This concealment casts a heavy shadow over anyone who took part in the (Israeli/Pfizer) negotiations…”\n\nThe CP then continues arguing that “in order to generate demand (amongst the people) for the vaccine, the government and the Ministry of Health have launched an unprecedented aggressive campaign, aiming to make Israelis rush to ‘get vaccinated.’ During that campaign all the basic rules of medical caution and ethics were disregarded, and with them also key guidelines formed after WWII regarding participation in medical trials (the Nuremberg Code). Instead of transparent and clear explanations, the public was misled by repeated official statements that the (Pfizer vaccine) has been ‘approved by the FDA’ after passing ‘rigorous tests.’”\n\nThe CP is accusing the state of Israel of intentionally reckless conduct… “Monitoring systems that enable the detection of side effects are a basic and critical condition for granting a permission for mass use of any new medicine, certainly when a mass operation of treatment that is defined as experimental is given to millions, and especially when this treatment is given to an entire country…”.\n\nBut Israel failed to set such a monitoring system.\n\n“On the one hand, the state did not inform the citizens that Pfizer’s vaccine is in experimental stages that have not yet been completed, and that at this stage they are actually taking part in the experiment. On the other hand, the state did not maintain transparent and open control and monitoring systems for the public. As a result, there is a serious concern that this critical and negligent omission stems from: (a) the fear that such disclosure could interfere with the fulfilment of the objectives that may be implied by the Israel-Pfizer agreement or (b) the fear of diminishing demand for the exceptional number of vaccines that were purchased by Israel in advance, and / or (c) the fear of revealing unflattering results of the ‘experiment’ being carried out in Israel.”\n\nThe CP is brave to admit that the lack of a monitoring system isn’t just a potential crime against the Israeli people, it may also be a crime against the rest of the world (i.e., humanity):\n\n“In the absence of a transparent monitoring system that reports on side effects, not only have the Israeli government and the Ministry of Health failed citizens by providing them with misleading information, the Israeli government have failed both Pfizer and the rest of the world awaiting the results of the (so called) ‘real world experiment’ (that is taking place in Israel).”\n\nTo remove any doubt, the CP alerts the Israeli Attorney General to the possible criminal act implied by Israel’s vaccine policy.\n\n“This is an alleged deception, suspiciously criminal, which should be thoroughly examined before the Attorney General allows the Israeli government to continue the alleged campaign of deception of Israel’s citizens and the (rest of the) world.”\n\nThe CP extended their study well beyond the legal realm, as it also attempts to fill the wide hole created by the State’s lack of a monitoring system.\n\n“What do we learn from the facts on the ground?” the CP report asks. “An examination of mortality data published by the government shows that there is a correlation between number of vaccinations and the number of deaths . The excess mortality is noticeable among people up to 70 and also among adults over the age of 70, and remains even after offsetting the deaths attributed to Corona. In the population over the age of 70 – in January 2021 an excess mortality of 19.5% was observed compared to October 2020 – the month when the corona data were highest, and 22.4% compared to January 2020. In the younger population – an excess mortality of 7% was observed in January 2021 compared to the month October 2020 – the month in which the corona death numbers were the highest, and 7% compared to January 2020. It should be noted that this trend continues in the following month as well.”\n\nAs mentioned above I have been writing about the devastating correlation between vaccines and deaths since early January. In Britain and the USA, we detect identical correlation between mass vaccination and death. However, far more problematic is the realm of side effects, something which governments, the WHO, the corrupted pharmaceutical industry, and of course social media giants attempt to suppress in the most Orwellian manner. The Israeli CP seems to have produced the first robust report on Pfizer’s vaccine side effects. They published a table of their findings, which they summarize here:\n\n“As one can detect looking at the table – there are close to 200 deaths, and this – only by examining about 800 reports of cases of serious side effects. As mentioned, the CP is still working on analyzing side effects and we have hundreds of additional reports that are subject to analysis. Our study so far indicates that about 25% of deaths are from people under the age of 60. About 15% of them are under 50 years old. 7 of the deceased are at young ages – below age 30. Also, the study identified 27 cases of heart problems in people under the age of 60, of which 24 cases are among young people aged 17-30. Regarding the issues to do with female medical complications (including labor-complication, delayed menstruation or irregular menstruation, etc.) – it should be noted that the committee has about 200 additional reports that have not yet been included in the final list of our findings.”\n\nFor many years, I doubted whether there was a force in the middle east that could face, let alone defeat, Israel. I am pretty convinced now that with Netanyahu at the helm and Pfizer taking care of the nation’s wellbeing, Israel doesn’t really need enemies. However, every world citizen who is concerned about the future of humanity should be alarmed by the CP’s findings and particularly by the desperate and relentless attempts to suppress free academic, scientific and ethical discussion about Covid, the so-called ‘vaccines’ or anything else.\n\n*To read the CP report click here\n\nThanks for supporting Gilad’s battle for truth and justice.\n\nMy battle for truth involves a serious commitment and some substantial expenses. I have put my career on the line, I could do with your support..\n\nScroll to the foot of the source page to assist Gilad.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://gilad.online/writings/2021/1/9/guinea-pigs-united", "https://gilad.online/writings/2021/1/30/a-brief-examination-of-some-facts-related-to-mass-vaccination", "https://gilad.online/writings/2021/2/7/israels-third-lockdown-a-spectacle-of-failure", "https://gilad.online/writings/2021/3/2/the-vaxi-nation-people-like-no-one-else", "https://gilad.online/s/-22-3-21.pdf", "https://gilad.online/writings/2021/3/23/the-probe-into-the-israeli-vaccine-policy-and-its-outcome-is-beyond-damning", "https://gilad.online/writings/2021/3/23/the-probe-into-the-israeli-vaccine-policy-and-its-outcome-is-beyond-damning"], "authors": [], "publish_date": null}