{"result_id": "309018", "URL": "https://www.thetruthseeker.co.uk/?p=258108", "timestamp": "2023-04-25 17:36:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=258108", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "The Vaccine Deaths Are Now Simply Too Massive to Keep Hiding and Explaining Them Away | The Truthseeker", "cleaned_text": "The Vaccine Deaths Are Now Simply Too Massive to Keep Hiding and Explaining Them Away\n\nThe following list is taken from Dr Steve Kirsch’s article The ‘safe and effective’ narrative is falling apart which contains a list of over a hundred indicators that the momentum is moving in our favour. Steve writes: ‘I’d be surprised if the narrative doesn’t fall apart soon. It’s now unravelling quickly in the UK.’ View the full extensive article here.\n• Teens never die in their sleep. How can this happen two days after getting the vaccine instead of before getting the vaccine?\n• Latest UK numbers show unvaccinated have lower mortality for pretty much all age groups.\n• Turbo-cancer is being reported now. It’s impossible to explain. Never been seen before.\n• Wayne Root reported that 33 guests at his wedding who are now sick or dead were all vaccinated. The punchline: virtually all his guests were unvaccinated. So that’s unexplainable. He wrote: “It’s important to note, I’m a conservative talk show host who has warned LOUDLY of the dangers of the vaccine since day one. So, my friends are overwhelmingly conservative and unvaccinated too. Yet the few friends I know who did choose to vaccinate are almost all dead or ill.” And he said, “Among my friends and family who are unvaccinated, not one of them has died or been sick since my wedding eight months ago.” The article has a list of 8 headlines from TMZ of serious injury/death and then he points out: “These were all headlines in one day this week!” So Wayne isn’t just having bad luck. Bad luck is in the newspaper.\n• Joel Smalley documents child deaths reported to VAERS. None of these deaths would be considered normal. I’ve written about this extensively in last year: How did these 14 kids die? showing the CDC never explained the unusual causes of death. Now take a look at Slide 9 of my FDA presentation that I made on 10-26-21. Joel and I had the exact same reaction to this VAERS report: we both cried when we read it.\n• 4X increase in long term disability for airline pilots. The pilots union at a major US airline internally reports a 300 percent rise in long-term disability claims this year among its members, who are nearly all vaccinated. That’s statistically very unlikely. It couldn’t be COVID. What is novel that would have affected most of the pilots? Hmmmm…\n• A huge number of people in comedy are dying, 22 since September 2021. These deaths are easy to track since they are in plain sight.\n• This is a huge Black Swan event: 5 doctors in Ontario (plus one in Saskatchewan) died within 2 weeks of getting the 4th dose of the vaccine. Here are the stories: First three, fourth, fifth in Ontario, sixth in Saskatchewan. Number of unexpected deaths in 2020: zero (that I know of). These are happening everywhere of course, but are being buried. It would have been buried in Ontario as well, but someone put together the pattern. Notice this isn’t on any mainstream media. “[The] cause of death wasn’t shared in the memo, but how many times have 3 doctors died in 1 week, days after the hospital started administering the 4th shot to staff.” In the Greater Toronto area, there are now 7 deaths of doctors in a two week period. There are normally 0 unexpected deaths like this in a year. All the doctors were vaccinated with a fourth dose of the vaccine. See also: Four doctors in Ontario died right after the fourth dose.\n• See “Open your eyes. This is happening everywhere.” The subhead says: Pushback over the deaths in Scotland and Italy; Wayne Allan Root has lost 33 friends—all “vaccinated”—to death or illness in the last 18 months; & TV presenter Kate McCann keels over, live!\n• Non-Covid excess deaths: why are they rising? Experts call for probe as mortality rates in England and Wales climb despite drop in coronavirus deaths\n• Excess deaths are on the rise – but not because of Covid\n\nOffice for National Statistics data leads health experts to call for urgent investigation into what is causing the excess mortality\n• England: Excess Deaths on the Rise But NOT because of COVID – Experts Call for Investigation\n• It’s happening in Ireland too! How can heart disease explode in kids only after they roll out the vaccines for kids? Experts are baffled as to what might be causing a sudden increase in heart disease for kids that is happening only in places that have rolled out the COVID vaccines for kids. It’s not happening to kids anymore in Uruguay for some reason (perhaps the judge stopping the vaccine program might have something to do with it).\n\nUnknown causes is now the leading cause of death in Alberta, Canada. It wasn’t that way before the vaccines rolled out. The experts dismiss that as “oh, that’s because people who have had COVID are more susceptible of dying.” But why would they be more susceptible of dying of UNKNOWN causes? And why is it only the vaccinated who are dying of the the unknown causes? And if this is due to the COVID infection, how come it isn’t happening in any country with a low COVID vaccination rate? And how do the experts explain the strange blood clots only found in vaccinated people? The press still forgets to ask these critical questions. But at least mainstream media is covering the mystery cause of deaths. It’s a start. But they are allowing “hand-waving” explanations when the “experts” are just making this stuff up with no data to back it up. Any “expert” who actually talks to patients knows the side effects of the vaccine are far greater than those from COVID. So how is our “expert” not even considering the vaccine as a possibility? We see the headlines almost on a daily basis now of celebrities dying “unexpectedly” of “unknown” causes so this “new” category being #1 shouldn’t be a surprise anymore. And I guarantee you that it is happening to boatloads of “lesser known” people as well: those people don’t generate the headlines. But have you ever in your life read about so many “unexpected” causes of death? I got two sent to me just today: Busi Lurayi (age 36 died suddenly) and rapper Tumi Tladi (age 30, died in his sleep). Two in a day, both international celebrities from South Africa?!?! What are the chances of that happening randomly?\n• Embalmers are seeing blood clots in over 50% of patients that they’ve never seen in their careers. It isn’t caused by COVID because it only started after the vaccine rollout and the clots are only found in vaccinated patients. So how do the experts explain that?\n• There was a 163% rise in life insurance claims at Lincoln National, but that article didn’t take into account that there was a merger (which is why premiums also went up). They are the fifth largest insurance company in the US. The correct number to focus on is the loss ratio which went up industry wide. The loss ratio is what to focus on. Q4 21 industry wide saw a 40% increase over 2019 loss ratio and leveled off to about 20-25% in Q1. I am hearing that there is still a mix shift in Q2 from old to young still and that excess mortality has come down some. That isn’t COVID. COVID doesn’t kill anywhere close to that number of people. We are looking at the biggest killer in history and nobody can figure out what it is! Watch this video. You will never see a story on this on mainstream media; they ignore it. Note, part of the claims increase is due to premium increases (adding new clients).\n• Watch the video here of OneAmerica CEO Scott Davison. The fact checkers claim all these excess deaths are due to COVID and deferred medical treatments. But the 18-64 year olds rarely die from COVID, so it can’t be COVID. And if it deferred medical care, this should slowly ramp up gradually over time and start falling as people went back into the office. It should spike like that. So the explanations don’t fit. And they don’t explain the hundreds of anomalies described here and in my misinformation spreader article. If all the deaths are from those two causes, why do my surveys done by professional polling companies consistently show as many people dying from COVID as from the vaccine?\n• Life insurance companies in countries all over the world are reporting record numbers of excess deaths. These are not “statistical fluctuations.” The deaths are all caused by a huge intervention that is affecting the health of millions of people. And it’s all new. Nothing like this ever happened before 2021. Nothing of this magnitude has EVER happened in their history (which goes back over 100 years).\n• Nobody will answer any of the questions I posted in my article on how to stop misinformation. The longer this goes on, the more suspect people will become.\n• GoFundMe deaths from stroke and other unusual causes in YOUNG people are through the roof. One reader wrote: “I heard on my local radio about a go fund me for a lady that was stuck in Tasmania because she had a massive stroke on holidays so I decided to look it up, the amount of GoFundMe pages for young people and children who have had stokes was mind boggling, also a heap of pages for adverse reactions to the vax.”\n• Fully vaxxed young adults are 92% more likely to die than unvaxxed young adults (Daily Expose)", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/the-safe-and-effective-narrative", "https://stevekirsch.substack.com/p/the-safe-and-effective-narrative", "https://www.brighteon.com/2a0b4edc-0c43-4221-a6da-ea1abe523e57", "https://expose-news.com/2022/08/04/distracted-boris-uk-gov-evidence-covid-vaccines-kill/", "https://etana.substack.com/p/turbo-cancer", "https://www.thegatewaypundit.com/2022/07/wayne-root-33-dead-sick-friends-since-wedding-8-months-ago-33-vaxxed-vaccine-death-disease-cluster/", "https://metatron.substack.com/p/covid-vaccine-deaths-of-children?utm_source=substack&utm_medium=email", "https://stevekirsch.substack.com/p/why-cant-anyone-explain-how-these", "https://www.skirsch.com/covid/VRBPAC-10-26-21.pdf", "https://alexberenson.substack.com/p/long-term-disability-claims-are-soaring/comments", "https://markcrispinmiller.substack.com/p/since-last-september-22-comedians", "https://www.thegatewaypundit.com/2022/07/three-doctors-hospital-die-suddenly-week-hospital-mandates-fourth-covid-shot/", "https://www.thegatewaypundit.com/2022/07/canadian-chief-emergency-medicine-olympic-sailor-marathon-runner-dies-suddenly-run/", "https://www.thegatewaypundit.com/2022/07/27-year-old-triathlete-doctor-canada-dies-four-days-collapses-swimming-fifth-doctor-die-within-2-weeks/", "https://www.thegatewaypundit.com/2022/07/44-year-old-canadian-doctor-dies-unexpectedly-sixth-canadian-doctor-die-within-two-weeks/", "https://www.bitchute.com/video/xSYYzLDUmpDA/", "https://markcrispinmiller.substack.com/p/open-your-eyes-this-is-happening", "https://www.theweek.co.uk/news/uk-news/957270/non-covid-excess-deaths-why-are-they-on-the-rise", "https://www.theweek.co.uk/news/uk-news/957270/non-covid-excess-deaths-why-are-they-on-the-rise", "https://www.telegraph.co.uk/news/2022/07/05/excess-deaths-rise-not-covid/", "https://www.telegraph.co.uk/news/2022/07/05/excess-deaths-rise-not-covid/", "https://www.survivethenews.com/england-excess-deaths-on-the-rise-but-not-because-of-covid-experts-call-for-investigation/", "https://newspunch.com/judge-suspends-covid-vaccination-for-children-under-13/", "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2022/09/The-Light-Vax-Deaths-Ireland.png", "https://calgary.ctvnews.ca/deaths-with-unknown-causes-now-alberta-s-top-killer-province-1.5975536", "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2022/09/alberta-s-top-10-causes-of-death-in-2021-unknown-1-5975554-1657059393383.jpg", "https://stevekirsch.substack.com/p/exclusive-embalmer-reveals-93-of", "https://crossroadsreport.substack.com/p/breaking-fifth-largest-life-insurance", "https://www.theepochtimes.com/life-insurance-ceo-reveals-deaths-are-up-40-among-working-people-just-unheard-of-facts-matter_4567602.html?&utm_medium=FactsMatter&utm_source=YouTube&utm_campaign=HIgherDeaths&utm_content=06-29-2022", "https://twitter.com/Mr_Mackei/status/1478008259474862081?s=20", "https://stevekirsch.substack.com/p/is-there-any-doctor-who-is-willing?s=w", "https://www.brighteon.com/dbde15ae-268d-43f0-acfd-252e310c5aba", "https://thewhiterose.uk/the-vaccine-deaths-are-now-simply-too-massive-to-keep-hiding-explaining-them-away/"], "authors": [], "publish_date": null}