{"result_id": "309005", "URL": "https://www.thetruthseeker.co.uk/?p=242727", "timestamp": "2023-04-25 17:36:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=242727", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "Fauci tells pro-LGBT press group that ‘many, many more’ vaccine mandates will come | The Truthseeker", "cleaned_text": "Fauci tells pro-LGBT press group that ‘many, many more’ vaccine mandates will come\n\nCOVID czar Dr. Anthony Fauci told journalists Sunday that “many, many more mandates” for COVID-19 shots can be expected in the drive to push uptake of the jabs.\n\nFauci, the chief medical adviser to President Joe Biden and director of the National Institute of Allergy and Infectious Disease (NIAID), made the remarks as part of an interview with Jen Christensen, a CNN reporter and vice president of print & broadcast at the Association of LGBTQ Journalists.\n\nDuring Sunday’s interview with the LGBT press group, Fauci suggested that “the vaccines really do work, even against the delta variant,” and strongly encouraged taking the jabs to mitigate the spread of the novel coronavirus. “That’s the key to ending this [crisis],” he claimed.\n\n“But we have a really unfortunate situation,” Fauci continued, explaining that “we have a pretty hardcore group of people that we’re trying to persuade” to take the shot, “or mandate them if they’re not persuaded to get vaccinated.” This group consists of around 75 million Americans, Fauci said.\n\nHowever, mounting evidence demonstrates the failure of COVID shots to protect against infection with the virus, with the inventor of the mRNA technology — used in many of the COVID shots — stating that “natural immunity is about 20 times more protective than the vaccine is.”\n\nDr. Robert Malone, who has researched vaccines for 30 years, noted that not only is natural immunity a strong barrier against COVID reinfection and illness, as corroborated by numerous studies, but warned that the spike protein found in the mRNA shots, “if biologically active, is very dangerous.”\n\nHowever, Fauci insisted that the spread of COVID-19 “would cut down dramatically … if we got the overwhelming majority of that recalcitrant group vaccinated.”\n\nWhile many Americans have clearly stated their opposition to the abortion-tainted shots on moral, scientific, and constitutional grounds, Fauci characterized COVID jab skepticism and refusal as “almost inexplicable.” He smeared the 75 million vaccine-eligible Americans who have not taken the shot as having a “political bent,” given that they “feel that they don’t want to be told to mask up and they don’t want to be told to get vaccinated which is just completely inexplicable given the fact that we’re in the middle of the most deadly pandemic that we’ve ever faced in the last 102 years.”\n\nSuch people, Fauci said, are a source of “divisiveness in society” and “part of the problem.” “There’s nothing productive about the divisiveness we’re seeing now … hopefully we can change that.”\n\nTo bring about his desire for ubiquitous inoculation against COVID, Fauci suggested employing “trusted public messengers who put aside political ideologies,” and whose expertise might “convince people to get vaccinated.”\n\n“The other way to do it,” Fauci advised, “is to have many, many more mandates.”\n\nHe admitted that this suggestion “rankles a lot of people,” but predicted that instead of centralized mandates, like Biden’s September 9 order, “you’re going to see situations locally … mandates where colleges, universities, places of business, large corporations, they’re going to say if you want to work for us you’ve got to be vaccinated.”\n\nFauci favored localized mandates, saying they will “turn this around because I don’t think people are going to want to not go to work or not go to college or not go to university. They’re going to do it.”\n\n“We have enough people who are not vaccinated that we can’t really nail down and just crush this outbreak yet until we get those people vaccinated,” Fauci said. “You’d like to have them do it on a totally voluntary basis, but if that doesn’t work you’ve got to go to the alternatives.”\n\nIn a podcast interview with theSkimm, set to be released Thursday, Fauci has publicly supported banning unvaccinated individuals from air travel within the U.S.\n\n“I would support that if you want to get on a plane and travel with other people, you should be vaccinated,” Fauci said in a teaser for the podcast.\n\nThe senior adviser’s endorsement prompted criticism from airline industry experts, who said that implementing a vaccine passport scheme would pose a “logistical nightmare,” according to a Fox News report.\n\nThe U.S. Travel Association, a not-for-profit travel industry advocacy group, commented on Fauci’s proposal in a press statement Monday, explaining that air travel is demonstrably safe without the need for vaccination against COVID.\n\n“U.S. Travel has long maintained that there should be no mandatory vaccination requirement for domestic travel,” the group stated. “Such a policy would have an unfair, negative impact on families with young children who are not yet eligible to get the vaccine.”\n\nThough the group rejected the idea of mandating the jabs, it recommended vaccination as “the fastest path back to normalcy for all.”\n\nA number of airline executives have also raised concerns with requiring proof of a COVID shot for all passengers, citing practicality issues\n\nAmerican Airlines CEO Doug Parker said last month that requiring vaccination “wouldn’t be physically possible to do without enormous delays in the airline system,” a system already plagued by division among carriers on whether COVID passports can be implemented.\n\nLike Parker, Southwest Airlines CEO Gary Kelly also indicated that vaccine passports would not be required by his airline, though he encouraged the voluntary uptake of the jab.\n\nAs things stand, approximately 179 million Americans — 53.9 percent of the population — have received a full regimen of COVID shots, with 1.8 million having received booster doses in the last 30 days, according to the Centers for Disease Control and Prevention (CDC).\n\nJust over 54 percent of Americans who are considered “fully vaccinated” have taken the Pfizer/BioNTech mRNA jab, the same shot associated with over 50 percent of all adverse event reports to the Vaccine Adverse Event Reporting System (VAERS) following a COVID shot between December 14, 2020, and September 3, 2021. VAERS records also show Pfizer to have a disproportionately high death count following inoculation, accounting for 69 percent of all death reports on VAERS involving a COVID-19 jab.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=FGOZMokRnic", "https://www.nlgja.org/2021/", "https://www.lifesitenews.com/opinion/the-covid-jabs-ineffectiveness-is-leading-to-mutations-greater-infectivity-and-endless-booster-shots/", "https://www.lifesitenews.com/news/natural-immunity-20-times-more-protective-than-vaccines-says-mrna-pioneer/", "https://www.lifesitenews.com/news/natural-immunity-offers-better-covid-protection-than-vaccine-israeli-study-finds/", "https://www.lifesitenews.com/news/739679/", "https://www.lifesitenews.com/opinion/revolting-against-the-dystopian-covid-vaccine-manifesto-with-data-science-in-order-to-save-humanity/", "https://www.lifesitenews.com/news/new-york-health-workers-ask-federal-court-for-relief-from-compulsory-covid-vaccines/", "https://www.lifesitenews.com/news/breaking-biden-announces-vaccine-requirements-for-private-businesses-impacting-tens-of-millions-of-workers/?utm_source=featured&utm_campaign=usa", "https://www.instagram.com/p/CTvajgzDqnx/", "https://www.foxbusiness.com/healthcare/fauci-mandated-shot-for-flyers-would-be-logistical-nightmare", "https://www.ustravel.org/press/us-travel-reacts-fauci-comments-domestic-travel-vaccine-mandates", "https://www.lifesitenews.com/news/vaccine-mandates-airlines-us/", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-total-admin-rate-total", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH", "https://www.lifesitenews.com/news/fauci-tells-pro-lgbt-press-group-that-many-many-more-vaccine-mandates-will-come/"], "authors": [], "publish_date": null}