{"result_id": "309015", "URL": "https://www.thetruthseeker.co.uk/?p=210826", "timestamp": "2023-04-25 17:36:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=210826", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "The Test is Giving You the Vaccine – Don’t Get the Test! | The Truthseeker", "cleaned_text": "This just adds to the mounting evidence that Covid is a bioweapon. Most people who get tested voluntarily are ‘system supporters’ and sheeple in work & probably leaning more towards key workers, so are these the people they want to damage or kill off first? I doubt it. Chips, likely, future bioweapons to be activated at some future date? Maybe they are vaccinating for future bioweapons yet to be released.\n\nWhen Boris says he doesn’t want to lock down a second time, you can bet he is lying.\n\nAs a generalisation, stress causes or exacerbates illness. As covered in a previous comment, ‘exosomes’ are produced by the human body for any pathogen and these exosomes look just like coronaviruses. Not only that, but they are also very small and there is a very strong case that there is no virus at all. Some researchers investigating SARS actually admitted in their published papers that they never isolated the SARS virus… which is a staggering admission. Oh, didn’t find the virus, lets do this again, um, still no virus, let’s try one more time, still no virus. This suggests that all the other researchers made mistakes, saw exosomes, or just plain lied.\n\nEvidence is mounting all the time that our Sun and its stream of particles has major effects on human health. As the moment, the Earths magnetic field is -20% and falling. This means that more solar particles reach the surface. These particles can also trigger earthquakes. Now, this does not rule out the bioweapon conspiracy, but what is does mean, is that humans are much more vulnerable to illness. This could be why we see mass local animal die-offs. It could also explain why 30/40,000 people died in the first 3 months of 2018, unexplained deaths above the expected rate.\n\nWe shouldn’t assume that solar effects are uniform or that the weakened magnetic field is uniform. Very possible that there are areas where there is very little protection. Go up a high mountain or fly on Concorde and solar effects are much stronger. Pilots have a much higher rate of cancers. So, ‘Scotty, the shields need more power’ might be the case with -20% protection.\n\nTiming, geopolitical plays, crashing capitalism and stupid adventures like Brexit, all points to Covid being a bioweapon. It would be handy if we could get out hands on some of these testing kits.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}