{"result_id": "309008", "URL": "https://www.thetruthseeker.co.uk/?p=243983", "timestamp": "2023-04-25 17:36:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=243983", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "SHOCKING Allegation: Disgraced Politician Was Blackmailed by Big Pharma Interests to Impose “Vaccine” Mandate | The Truthseeker", "cleaned_text": "SHOCKING Allegation: Disgraced Politician Was Blackmailed by Big Pharma Interests to Impose “Vaccine” Mandate\n\nIt has long been known that certain entities are getting rich off COVID. For example, major Democrat donors Amazon and Walmart made billions more during the pandemic after the Democrats locked down their small-business competition while allowing them to remain open. Now we hear an allegation from the other side of the world, Australia, that not only have Pfizer and AstraZeneca been paying lobbyists millions to pressure politicians to impose “vaccine” mandates, but that a recently ousted state premier was told that she wouldn’t be charged in a corruption probe if she forced “vaccines” on citizens.\n\nAnd that politician, New South Wales premier Gladys Berejiklian, did in fact tell Sydney residents shortly before she resigned “that if they don’t take the Covid jab, they face total social isolation indefinitely after the stay-at-home order ends in December,” reports the Gateway Pundit.\n\nThe allegations were made by businessman Clive Palmer, a former member of Australia’s parliament and now leader of the United Australia Party. Palmer rendered his comments at a press conference a few weeks ago, but they’re now attracting renewed attention after Berejiklian was forced to resign in disgrace as a result of a corruption probe unrelated to the genetic-therapy agent (GTA, a.k.a. “vaccine”) allegations.\n\nPalmer dropped the bomb when a jabbering journalist tried to push the NSW [New South Wales] government’s lies about 1600 “cases” and that people really were dying from COVID-19 and the only way out for locked-down small businesses in NSW was for most of the population to get a double jab. “They can’t open their businesses because the premier’s telling them the only way out is a double jab and that’s what they’re being told,” said the journo.\n\n“I’d say the premier is lying to them,” Palmer shot back. “And I’d say that she’s under an ICAC inquiry, but a particular lobbyist in Sydney controls the Liberal Party in Sydney and told her the only way she gets out of that inquiry is if she pushes the double jab, and his clients are Astra Zeneca and his clients are Pfizer.”\n\nAt that point the upstart journo butts in again, repeating the nonsense that the only way out for the business owners is the double jab.\n\n… Palmer came back, again trying to answer the question. “That’s what I’d tell them (the business owners) and that what the premier’s saying is not true and … that they shouldn’t be locked down, businesses should be open and the government’s using this as an excuse to destroy them and they know that” .\n\nAustralia has become a poster boy nation for Branch COVIDian tyranny, with certain parts of the country actually being placed under martial law to enforce coronavirus dictates (videos below).\n\nDo note that Australia has experienced only 1,421 SARS-CoV-2 deaths during the entire “pandemic,” occurring against the backdrop of more than 150,000 deaths yearly (from all causes). Consider also that Australia has approximately 2,000 flu-related deaths every year. Yet the country doesn’t institute martial-law-enforced influenza lockdowns or force people to take flu vaccines.\n\nAs for Palmer’s charges, remember that they are only allegations, from one man; they cannot currently be verified. What’s for certain, however, is that pseudo-elite, GTA-obsessed authorities are not generally acting in good faith.\n\nWere it otherwise, they wouldn’t be ignoring science and reason.\n\nThey would not:\n• insist on “vaccinating” even non-vulnerable people such as children, who are more likely to die from the GTAs than from the China virus;\n• enforce mask mandates despite science showing that masks do far more harm than good;\n• base their policies on “positive cases.” This is a largely irrelevant factor because many infected people don’t actually get sick, and because the positivity number varies based on how many people are tested and is inflated by false positives;\n• claim that taking GTAs is an imperative, a civic responsibility, but then not require Congress and its staff or illegal aliens to take them;\n• flout their own COVID Ritual regulations, as Governor Gavin Newsom (D-Calif.), House Speaker Nancy Pelosi (D-Calif.), and other virus-value-signaling politicians have; and\n• impose lockdowns, which, aside from causing economic devastation, studies have shown cost more lives than they save.\n\nSo it’s clear that most pseudo-elites pushing COVID Ritual have ulterior motives, be they power or money or both. What these people, who often believe the world’s population should be culled, anyway, certainly don’t care about is your health.", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/50zdyhE_ggU\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/50zdyhE_ggU"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/8Qf5l2nmWOY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/8Qf5l2nmWOY"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/GrRCZmcLcDM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/GrRCZmcLcDM"}], "links": ["https://www.thegatewaypundit.com/2021/10/former-australian-member-parliament-says-pfizer-astrazeneca-paid-lobbyists-direct-australias-leaders-push-vaccine-mandates-video/", "https://cairnsnews.org/2021/09/15/palmer-exposes-corrupt-big-pharma-politics-and-blackmail-in-nsw/", "https://www.rebelnews.com/australias_covid_19_martial_law_lockdown", "https://www.worldometers.info/coronavirus/country/australia/", "https://search.yahoo.com/search?fr=mcafee&type=E211US0G0&p=how+many+people+die+in+australia+every+year", "https://search.yahoo.com/search?fr=mcafee&type=E211US0G0&p=how+many+flu+deaths+in+australia+every+year", "https://thenewamerican.com/study-lockdowns-save-no-lives-are-politicians-destroying-the-economy-for-nothing/", "https://thenewamerican.com/study-of-almost-10-million-finds-no-asymptomatic-covid-spread-media-silent/", "https://thenewamerican.com/study-lockdowns-save-no-lives-are-politicians-destroying-the-economy-for-nothing/", "https://thenewamerican.com/shocking-allegation-disgraced-politician-was-blackmailed-by-big-pharma-interests-to-impose-vaccine-mandate/"], "authors": [], "publish_date": null}