{"result_id": "309026", "URL": "http://www.thetruthseeker.co.uk/?p=225995", "timestamp": "2023-04-25 17:36:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=225995", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "COVID: If they haven’t isolated the virus, how can they make a vaccine? | The Truthseeker", "cleaned_text": "COVID: If they haven’t isolated the virus, how can they make a vaccine?\n\n“But…but, you see, we take a piece of RNA, and we inject it into the person, and the RNA forces the cells to manufacture a protein that’s very similar to a protein in SARS-CoV-2…and then the immune system swings into gear and produces antibodies to THAT protein, and THEN the person has achieved immunity from the virus…”\n\nAs I’ve been demonstrating for months now, there is no proof that SARS-CoV-2 exists [1] [2]. Therefore, “the piece of RNA” that’s injected can’t be assumed to be related to “the virus.”\n\nTherefore, the protein which the cells produce in the body is merely CLAIMED to be similar to a protein in the unproven “SARS-CoV-2.”\n\nThere is no KNOWLEDGE here.\n\nThat piece of RNA which is injected into the body—why should we assume it has anything to do with a virus called SARS-CoV-2, when no one has an isolated specimen of this “SARS-CoV-2?”\n\nTherefore, everything that happens, inside the body, after the injection, is up for grabs. What is the immune system reacting to?\n\nWhy bother, in the first place, to make a vaccine against a virus when you don’t have the virus?\n\nThere are several ways to attack this absurdity, and they all come down to the same bottom line: no provable virus, forget the vaccine.\n\nI keep coming up with analogies to explain the insanity of the COVID virologists—\n\n“Three trains collided last night outside Chicago. Investigators who turned up at the scene this morning failed to find a shred of wreckage. But they insist the collision occurred, resulting in a vast explosion. The public is warned to stay away from the cordoned-off zone.”\n\nThat fanciful illustrations is LESS extreme than: “We’ve just released a vaccine for a virus that we never discovered.”\n\nAs I’ve explained in other articles and interviews, “discovering” the genetic sequence, the structure of the purported SARS-CoV-2, involves all sorts of conjecture [3] [4]. Researchers aren’t looking through some sort of cosmic microscope at rows of genes lined up like cars in a supermarket parking lot.\n\nResearchers assume—on the basis of zero evidence—that certain older reference genetic sequences in libraries are contained in “the new virus.” They use a computer program to scavenge those sequences and build out the ASSUMED structure of “the new virus” and automatically smooth out any wrinkles or gaps.\n\nThis would be on the order of fabricating a hologram of a gun that the police will claim is the actual gun used in the commission of a crime.\n\n“Yes, Your Honor, this image you see floating in mid-air IS the weapon Mr. Jones used when he held up the bank last month. It is not a ‘representation,’ as the defense counsel would have you believe. We’re talking about cutting-edge science. We have experts who will testify under oath…”\n\nJudge: “In other words, sir, you’re telling this court that, if the bank teller had some sort of ‘anti-hologram’ program on his computer, he could have prevented the crime with a few clicks of his mouse. Very interesting. Let me ask you, which drugs are you on?”\n\nProsecutor: “None, Your Honor. Actually, such anti-hologram programs exist. In the area of COVID virology, they’re called vaccines, and they protect people against SARS-CoV-2…”\n\nAbove the entrances to virology institutes, they should inscribe: ALICE IN WONDERLAND.\n\nThe author of three explosive collections, , , and , Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails or his free OutsideTheRealityMachine emails .", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": [], "movies": [], "links": ["https://blog.nomorefakenews.com/2021/01/26/sars-cov-2-has-not-been-proven-to-exist-shocking/", "https://blog.nomorefakenews.com/2020/12/01/the-sars-cov-2-virus-was-never-proved-to-exist/", "https://twitter.com/jonrappoport/status/1339769925402038273", "https://www.youtube.com/watch?v=R6-8VRGvNtQ", "http://marketplace.mybigcommerce.com/the-matrix-revealed/", "http://marketplace.mybigcommerce.com/exit-from-the-matrix/", "http://marketplace.mybigcommerce.com/power-outside-the-matrix/", "http://j.mp/1HvKCU1", "http://j.mp/1SfPuzL", "https://blog.nomorefakenews.com/2021/01/27/how-can-they-make-covid-vaccine-if-no-isolated-virus/"], "authors": [], "publish_date": null}