{"result_id": "309009", "URL": "https://www.thetruthseeker.co.uk/?p=259943", "timestamp": "2023-04-25 17:36:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.thetruthseeker.co.uk/wordpress/wp-content/uploads/2020/11/cropped-ttslogo-2-32x32.png", "canonical": "https://www.thetruthseeker.co.uk/?p=259943", "encoding": "UTF-8"}, "image": null, "domain": "www.thetruthseeker.co.uk", "title": "Pop star dropped from GQ awards after vaccine tweets | The Truthseeker", "cleaned_text": "Pop singer M.I.A. has been dropped from GQ magazine’s upcoming ‘Men of the Year Awards’ after defending controversial radio host Alex Jones, and suggesting that celebrities “pushing vaccines” should pay damages. M.I.A. responded by saying the magazine’s staff “don’t have balls.”\n\nThe British singer shared a message from GQ on Twitter on Friday, confirming her appearance at the awards night and an upcoming photoshoot were canceled. The decision to drop the singer was made due to the “controversial nature” of her “current twitter activity,” the message explained.\n\nThe ‘Paper Planes’ singer was dismissive. “You print words for living,” she responded. “How do you judge man of the year when you don’t have balls?”\n\nThe controversy seemingly erupted on Thursday, when M.I.A. tweeted: “If Alex Jones pays for lying shouldn’t every celebrity pushing vaccines pay too?”\n\nInfoWars host Alex Jones was ordered by a Connecticut jury on Wednesday to pay nearly $1 billion to the families of the 2012 Sandy Hook Elementary School shooting victims. Jones claimed in 2012 and 2013 that the shooting was a “hoax,” and that some of the parents faked their own children’s deaths.\n\nM.I.A. has long been skeptical of Covid-19 vaccines, declaring in 2020 that she would “choose death” over the coronavirus jab. Her latest comments came after Pfizer executive Janine Small told European lawmakers that the company didn’t test whether its vaccine prevented transmission of Covid-19 before bringing it to market.\n\nIn an interview with The Guardian on Friday, M.I.A. defended her stance on vaccines. “I know three people who have died from taking the vaccine and I know three people who have died from Covid,” she told the British newspaper. “If anyone is going to deny that experience and gaslight me, saying: ‘No, that’s not your experience,’ then what is the point of anything?”", "opengraph": {}, "tags": ["Race", "Predictions: from the past or for the future", "Coronavirus", "Health", "Commentary", "Israel, 'Anti-Semitism', Zionism and US-UK allies", "Health and the New World Order", "Essential Reading", "Hidden and Revisionist History"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">You print words for living . How do you judge man of the year when you don’t have balls ? <a href=\"https://t.co/2dMlu0MAVJ\">pic.twitter.com/2dMlu0MAVJ</a></p>\n<p>— M.I.A. (@MIAuniverse) <a href=\"https://twitter.com/MIAuniverse/status/1580969241540325380?ref_src=twsrc%5Etfw\">October 14, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://t.co/2dMlu0MAVJ", "https://twitter.com/MIAuniverse/status/1580969241540325380?ref_src=twsrc%5Etfw", "https://www.stereogum.com/2078112/mia-anti-vaccine/news/", "https://twitter.com/Rob_Roos/status/1579759795225198593", "https://www.theguardian.com/music/2022/oct/14/mia-on-vaccines-vindication-and-her-visions-of-jesus-people-fear-me-for-some-reason", "https://www.rt.com/pop-culture/564720-mia-alex-jones-vaccine-tweets/"], "authors": [], "publish_date": null}