{"result_id": "310028", "URL": "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/", "timestamp": "2023-04-25 17:38:08 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "Why We/US Need(s) Peaceable Secession (2VR = 2ND VERMONT REPUBLIC)", "cleaned_text": "Publisher’s note: Thanks to ever-astute Vermonter Jim Hogue for sending over this article, which frames 20% + Vermonters’ interest in our 2nd Vermont Republic.\n\nThe leftists who control Washington, D.C., with brain-dead Biden as their figurehead, want to impose a totalitarian dictatorship on America. The tyranny of Covid vaccines, mask mandates, and lockdowns, and preparations for war in the Ukraine are the latest signs of this, but the leftist plans have long been in the making.\n\nOrdinary Americans don’t want this, and their resistance has generated to so-called split between Red and Blue States. Actually, the leftists control a few big cities through corrupt machine politics and pandering to minority and immigrants mobs, and the rest of the country resists them. The leftists are determined to crush this resistance. As Bill Sardi explains: “Democrats ‘own’ the cities (New York, Chicago, Los Angeles, Seattle, Portland, Philadelphia, Boston, etc.); Republicans ‘own’ the space (rural land). That is maybe why fires razed through rural areas in California as the Red zones were burnt to the ground. This may have been a covert attempt to force Republicans to move into cities.”\n\nThe federal government’s agenda to impose its draconian measures on the Red States goes far beyond this. Mike Adams supplies the details: “With illegitimate occupier-in-chief Joe Biden waging outright war and economic terrorism against red states (see examples below), the leaders of those red states must now nullify federal government overreach in order to prevent their own citizens from being mass murdered by D.C. swamp policies that are intentionally designed to achieve depopulation.\n\nSome of the ways the Biden regime is waging war on red states include:\n• Economic terrorism: Unleashing OSHA to destroy all businesses that won’t enforce vaccine mandates by levying fines of $70,000 per day or even higher.\n• Engineered medicine shortages: Biden recently announced restrictions on shipping monoclonal antibodies to red states in order to maximize covid fatalities in those states.\n• Vaccine mandates: Through vaccine mandates, Biden is committing medical genocide against every American, working to achieve a mass die-off that will leave states in a worsening economic crisis (and humanitarian crisis) as the deaths unfold.\n• Border invasion: The Biden regime and its corrupt DOJ are actively fighting against sensible border security, openly allowing a land invasion of states like Texas and Arizona in order to flood the nation with replacement Democrat voters.\n• Money printing madness: Every dollar printed by the Fed and distributed by the Treasury is actually an instrument of debt that steals purchasing power from the hard-working Americans who produce things. Those producers tend to live in red states, while blue states are the welfare states where more people get handouts that were essentially stolen from the producers in the red states.\n• Election rigging: Biden and other Democrats like Newsom are now institutionalizing never-ending election rigging in order to make sure the will of the people is never honored in any election. Although their own disastrous policies are wildly unpopular they can continue to maintain power by cheating in elections, just like they cheated in 2020.\n• Outlawing of medicine that works: Notice how the D.C. swamp has attacked ivermectin and made sure no hospital prescribes it to patients? This is also part of the medical genocide agenda, and it’s a war on humanity.\n• Punitive taxation: Under the Biden regime (which is actually run by Obama), the IRS will be handed a mandate to raise taxes on productive American workers, punishing them for having jobs, all while handing out more welfare and entitlements to the illegals who are allowed to invade America by the hundreds of thousands each month.”\n\nEven if we succeed in rolling back the current totalitarians, this won’t be enough. There is a structural problem in the American government that won’t go away, even if the current mob in Washington is replaced with “good guys.” The government is too big. The American population is around 330,000,000. States like California and Texas are bigger than many countries. How can a nation that vast be governed by a few people? The situation is even worse if we think about the division between the Reds and the Blues that I mentioned before. As Stephen Marche puts it, “Each side accuses the other of hating America, which is only another way of saying both hate what the other means by America…. On both sides, the sense of being under occupation dominates…. Every political faction operates under a siege mentality…. Everyone wants to build a wall of one kind or another. The geographical divide between the competing American Utopias means that, in every election, whoever loses comes to feel like they’ve been dominated by a foreign power.”\n\nClearly, we have a disunion, not a union, today, and we would do better to recognize this and act accordingly. The problem is nothing new. When the Constitution was up for ratification, the Anti-Federalists pointed to the danger. In the fifth volume of Conceived in Liberty, Murray Rothbard quotes one of the most eloquent of them, Patrick Henry: “Shall we imitate the example of those nations who have gone from a simple to a splendid government? Are those nations more worthy of our imitation? What can make an adequate satisfaction to them for the loss they have suffered in attaining such a government—for the loss of their liberty? If we admit this consolidated government, it will be because we like a great, splendid one. Some way or other we must be a great and mighty empire; we must have an army, and a navy … When the American spirit was in its youth, the language of America was different: liberty, sir, was then the primary object. … But now, sir, the American spirit, assisted by the ropes and chains of consolidation, is about to convert this country into a powerful and mighty empire. … Such a government is incompatible with the genius of republicanism. There will be no checks, no real balances, in this government. What can avail your specious, imaginary balances, your rope-dancing, chain-rattling, ridiculous ideal checks and contrivances? But, sir, we are not feared by foreigners; we do not make nations tremble. Would this constitute happiness or secure liberty.”\n\nThe Federalists thought they knew better, and they gave us such nonsense as Madison’s claim that an extended government was a “cure” for faction, not one of its main causes. The tragic result of their efforts was the terrible War Between the States. Let’s not make that mistake again. Let’s try peaceful secession while there is still time.", "opengraph": {"url": "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/", "type": "article", "title": "Why We/US Need(s) Peaceable Secession (2VR = 2ND VERMONT REPUBLIC)", "description": "Publisher’s note: Thanks to ever-astute Vermonter Jim Hogue for sending over this article, which frames 20% + Vermonters’ interest in our 2nd Vermont Republic. The leftists who control …", "article:published_time": "2022-02-16T15:56:56+00:00", "article:modified_time": "2022-02-16T15:56:56+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/07/2VR-240th-690x690.jpg", "image:width": "690", "image:height": "690", "locale": "en_US"}, "tags": ["2VR", "2nd Vermont Republic"], "tweets": [], "movies": [], "links": ["https://www.lewrockwell.com/2022/02/lew-rockwell/why-we-need-secession/", "https://www.lewrockwell.com/2020/12/bill-sardi/when-red-states-turn-blue-and-covid-19-becomes-the-economy-not-just-a-perpetual-pandemic/", "https://www.naturalnews.com/2021-09-30-red-states-nullify-federal-government-declare-health-freedom-zones.html", "https://www.lewrockwell.com/2022/02/david-gordon/what-the-next-american-civil-war-may-look-like/", "https://mises.org/library/conceived-liberty-volume-5-new-republic-1784-1791/html/c/732", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/#print", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=email", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=twitter", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=facebook", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=reddit", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=linkedin", "https://vermontindependent.net/why-we-us-needs-peaceable-secession-2vr-2nd-vermont-republic/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2022-02-16T15:56:56+00:00"}