{"result_id": "310039", "URL": "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/", "timestamp": "2023-04-25 17:38:34 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "A Quick History Of US “Pandemics” And “Vaccines” (PLUS – “18 REASONS WHY”)", "cleaned_text": "Publisher’s note: With US history as our guide, exercising caution with regard to mandatory vaccinations makes medical, scientific, logical, and historical sense. Thanks to NYU professor of propaganda studies Dr. Mark Crispin Miller and independent researcher Meryl Nass for this important reporting on previous US “pandemics” and US mass injection campaigns. Plus, “18 Reasons Why” caution is prudent re: the COVID “vaccine,” courtesy of Robert F. Kennedy Jr. and Children’s Health Defense.\n\nAnd click here for 60 Minutes coverage on the so-called H1N1 Swine Flu scare of 1976. Chilling,\n\nThis program, in hindsight, was mounted to gain support for the Presidential election of Gerald Ford, who was running against Jimmy Carter. The program was conceived after a soldier died at Fort Dix (after an exhausting march) and then he and several other soldiers were found to harbor swine influenza virus.\n\nThe specter of the 1918 swine flu pandemic was invoked, and the public health machinery went into overdrive to create a national vaccine program. Several Pharma companies were enlisted.\n\nAs several months wore on, there were no more swine flu cases. The risk of another 1918 flu had vanished. But the vaccination program had taken on a life of its own.\n\nThe vaccine companies demanded relief from liability. After all, it is hard to get everything right the first time. They refused to continue the vaccine program, complaining that their insurers refused to take on the liability burden. This became the first time the federal government agreed to serve as Pharma’s insurer. This event became the model for the 1986 National Childhood Vaccine Injury Act.\n\nYou know the rest of the story. One quarter of the US got vaccinated, before it was acknowledged that the vaccine caused paralysis: Guillain-Barre syndrome, at a rate 6 times normal, was occurring in vaccinees There were about 400 cases and 40 deaths. Vaccinations ended. The virus was gone long before the vaccinations had even started, and has never returned. The federal government paid damages. Pharma and their insurers had been a lot more savvy than the US public health enterprise.\n\nThis was a program rooted in fear of bioterrorism engendered by the 2001 anthrax letters and the hype provided by the media. Everyone knew the nasty little phrase, “It’s not a question of if, but when” and preparedness was on everyone’s tongue. There was no intelligence supporting an imminent threat of smallpox. But the vaccine program was a central part of the campaign of fear that was used to justify the invasion and takeover of Iraq. The idea fed to Americans was that we had to stop Saddam before he sprayed us with smallpox, even though he had nothing to do with either the anthrax letters, or the 9/11 attacks.\n\nSmallpox vaccine had been stockpiled by the Clinton administration, and more had been purchased by the Bush administration. Smallpox vaccinations had been halted in the US decades earlier, and the disease smallpox had been wiped out in 1977. Smallpox vaccine was known to be highly reactogenic, and the old medical literature claimed it killed one in a million babies who received it.\n\nSmallpox vaccine was also known to cause myocarditis, with EKG changes occurring in 3% of Finnish soldiers who had received the vaccine, in a 1978 publication. In the US, 1 in 13,000 smallpox vaccine-naive airmen developed a clinical case of myopericarditis after receiving their first does.\n\nWhen the vaccine was given to healthcare workers and first responders in 2003, episodes of heart failure, heart attacks, myocarditis and death quickly mounted. Doctors and nurses noticed that they could not sue for damages if injured, and at first there was no federal compensation either. They began refusing to be vaccinated. Congress quickly allotted money for a compensation program, but the maximum award was only $250,000 for a permanent disability or death.\n\nWell-paid professionals were not impressed. After about 50,000 inoculations, and a series of 6 negative “Letter Reports” by the Institute of Medicine, the program quickly petered out, at least for civilians. The military continued vaccinating soldiers. Yet no smallpox cases have occurred since 1977.\n\nIn the early spring of 2009, another swine flu was discovered in Mexico, and quickly spread to the U.S. People were said to be dying from the illness in droves. Not only the United States, but the entire ‘developed’ world clamored for vaccines. Again, the initial hype was that this was a tremendously dangerous flu bug, probably 1918 all over again.\n\nNot only were multiple new vaccines to be created, but this was also an opportunity to trial new vaccine adjuvants, which by supercharging the immune response, could cut down the amount of antigen needed by an estimated 80%, thus providing much faster production of the large volumes of vaccine needed.\n\nThe 2009 “swine flu” pandemic was a dud in terms of virulence–it turned out to be considerably less deadly than a normal flu season virus. It did, however, serve to expose the fact that pre-existing pandemic flu vaccine deals had already been negotiated and signed by the World Health Organization, Big Pharma, and individual countries.\n\nHere is how the deals worked: once a pandemic was declared by the WHO Director-General, the contracts were activated, and countries were committed to buying large stocks of pandemic vaccine, sight unseen. Other agreements and memoranda of understanding guaranteed that the flu vaccines (the original concern was a deadly bird flu or swine flu pandemic) would be grandfathered in, dodging the unpredictable testing and licensure process in which many more vaccine candidates fail than finally cross the finish line.\n\nAlso exposed by the 2009 pandemic was the fact that the WHO had, only a month earlier, changed its official description-definition of a pandemic’s “Phase 6”.\n\nThe phrase “enormous numbers of deaths and illness” had been removed from the W.H.O. webpage listing the phases of a pandemic, and the revised web page simply read as follows: “An influenza pandemic may occur when a new influenza virus appears against which the human population has no immunity.” Surprisingly, a novel virus that only caused a cold would have met the definition.\n\nA declaration of pandemic Phase 6 was the requirement that would trigger the pre-existing vaccine contracts, committing many nations to spend billions of dollars on vaccines yet to be designed.\n\nWhy had WHO changed the definition? What was the process that led WHO’s then-Director General Margaret Chan, to invoke it? We still don’t know.\n\nThe 2009 pandemic was an opportunity that opened the door to powerful vaccine adjuvants. The US bought large quantities of adjuvants from GlaxoSmithKline and Novartis (which has since sold its vaccine businesses) as well as large quantities of rapidly tested vaccines. But in response to widespread fears about these novel adjuvants, and their potential to cause autoimmune illnesses, they were not added to the new swine flu vaccines in the US.\n\nIn Europe things were different. The adjuvants were used. The GSK vaccine with adjuvant, Pandemrix, led to over 1300 cases of severe narcolepsy, primarily in adolescents. Whether this was caused by the vaccine antigens or the adjuvant has not been resolved. Glaxo unsurprisingly has denied its vaccine caused the problem.\n\nHowever, studies of the frequency of new narcolepsy cases in many European countries revealed that adolescents who had received the Pandemrix vaccine were 10-16 times more likely to develop narcolepsy as those who had not.\n\nThe 2009 pandemic revealed something else. The vaccine contracts that had been mediated by the WHO between the vaccine manufacturers and individual nations contained a clause absolving the manufacturers of all liability for injuries. In order to access vaccines, countries had to agree that their citizens could not sue the manufacturers for damages if deaths or injuries occurred. Litigation of some of the narcolepsy cases continues, as the UK government has flip-flopped over its responsibility to compensate those injured by the Pandemrix vaccine.\n\nThose are the prior examples of “warp speed” vaccine development for perceived pandemics in the US. In no case were the vaccine manufacturers willing to take on liability for their products. In each case, governments took on the liability, but grudgingly. Any benefits awarded were considerably less than would be expected from successful litigation with pharmaceutical companies.\n\nWhy won’t the manufacturers stand by their products? Because there is no possible way to determine the products’ safety or effectiveness in the months allotted. The two swine flu programs went from conception to vaccinating citizens in approximately six months, similar to what was achieved with the Covid-19 vaccines. The smallpox program was a little different, as vaccine had been stockpiled, but not clinically tested, over several years.\n\nHow long is the usual process of vaccine development? According to the American College of Physicians,\n\nCDC says, Vaccine licensing is a lengthy process that can take 10 years or longer.\n\nThe Vaccine Life Cycle: Safety at Every Phase\n\nThe bottom line is that given current technology, it is impossible to make a safe and effective vaccine in months. Everyone wishes it wasn’t so, and Presidents may think they have the funds and clout to compel the system to produce a great vaccine, or six, at warp speed. They may think they can make it happen, but they can’t.\n\nWhen you hand billions of dollars to inveterate government bureaucrats with MDs after their names, tragedies are certain to follow. They always have.\n\nRepurposed drugs could have won against this pandemic, and most likely the next, since we know a lot more about how to combat viruses using drugs in 2021 than ever before. Can someone tell the President he can be an even bigger hero using drugs instead of vaccines, since they are more readily available, cheaper and safer? I’m concerned about next time.", "opengraph": {"url": "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/", "type": "article", "title": "A Quick History Of US “Pandemics” And “Vaccines” (PLUS – “18 REASONS WHY”)", "description": "Publisher’s note: With US history as our guide, exercising caution with regard to mandatory vaccinations makes medical, scientific, logical, and historical sense. Thanks to NYU professor of p…", "article:published_time": "2021-04-18T13:02:11+00:00", "article:modified_time": "2021-04-18T15:09:24+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/04/Screen-Shot-2021-04-18-at-8.57.35-AM-690x661.png", "image:width": "690", "image:height": "661", "locale": "en_US"}, "tags": ["Us history", "swine flu", "US", "H1N1", "smallpox"], "tweets": [], "movies": [], "links": ["http://anthraxvaccine.blogspot.com/2020/12/what-happens-if-something-goes-wrong.html", "https://childrenshealthdefense.org/defender/reasons-not-getting-covid-vaccine/?utm_source=salsa&eType=EmailBlastContent&eId=bb194bee-fdb8-46d7-bc43-43fdcd7b412a", "https://www.youtube.com/watch?v=4bOHYZhL0WQ", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "x-webdoc://C37084D0-A61C-4202-B604-EAF5CD4DA047#m_1123438531528767076_", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/#print", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=email", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=twitter", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=facebook", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=reddit", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=linkedin", "https://vermontindependent.net/a-quick-history-of-us-pandemics-and-vaccines-pre-warp-speed/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2021-04-18T13:02:11+00:00"}