{"result_id": "310031", "URL": "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/", "timestamp": "2023-04-25 17:38:12 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "Vermonters Support Challenging The COVID Narrative (UNITE 4 TRUTH)", "cleaned_text": "Publisher’s Note: Global network of lawyers, doctors, scientists and citizens create Unite4Truth. Press release below, shared by concerned Vermonters. Please consider signing and passing on this petition.\n\nHealth Professional Petition Citing Serious Concerns with Covid-19 Testing and Vaccine Safety Censored by Change.org\n\nOn 3/4/2021, a non-partisan petition from a group of concerned health care professionals seeking to inform the public of serious problems with Covid-19 testing and vaccination safety issues was removed from the Change.org website less than 24 hours after submission.\n\nThe petition, compiled and written by a group of health professionals and sourced from top scientific experts from around the world presented the evidence from government websites and mainstream news agencies including CDC/FDA/WHO New York Times, International Consortium of Science, British Medical Journal, among others.\n\nUnite 4 Truth is hosting this petition on its website, unite4truth.com .\n\nA representative from the site stated that the goal of this petition was to allow health professionals who have concerns with the current Covid-19 protocols, testing, and vaccines to have a way to express their concerns in one voice and provide public education around what they view are vital individual and public health safety issues. The rep stated many health professionalsdo not feel comfortable to individually come out and make a statement out of fear of professional and public retribution…\n\n“It’s an ugly climate…but we were still stunned it was removed. All of this is widely & publicly available data on government & media organization websites, much of it published for months..\n\nThere are many health professionals who have deep concerns about current Covid-19 testing methods and protocols. . It has been very widely documented that severe testing issues are corrupting the data. This information is so widely publicized that health professionals are beginning to fear license and liability risks for administering tests documented to produce such inaccurate data. The Unite 4 Truth representative, however, stated the goal of the petition is not liability protection. Health professionals want an end to Covid-19 policies they believe are harmful to public health and caused massive lay-offs and unemployment for many in the health care industry.\n\nThe International Consortium of Science, Life Science Division completed a peer review of the Emergency Approved PCR testing used for Sars CoV2, the virus attributed by government health agencies to cause Covid-19 symptom summarizing their findings and deeming the test ‘useless’ for diagnosis of the virus:\n\n‘In light of our re-examination of the test protocol to identify SARS-CoV-2 described in the Corman-Drosten paper we have identified concerning errors and inherent fallacies which render the SARS-CoV-2 PCR test useless’.T\n\nThe researchers reviewed the Corman Drosten paper, the document that provided the majority of scientific rationale and evidence for which the PCR testing is based. It was approved one day after submission without proper peer review according to the research review committee. They published their findings on 11/27/2021\n\nThe committee submitted a request for retraction on 11/28/2021 and are awaiting the results of that inquiry:\n\nThe petition cites concerns about FDA recommendations to run tests at settings that will produce false positive Covid-19 test results by default. Cycle Threshold settings, the number of times test sample material is magnified, if set too high will pick up dead and non-infectious material as documented by the New York Times last August 29, 2021:\n\n“In three sets of testing data that include cycle thresholds, compiled by officials in Massachusetts, New York and Nevada, up to 90 percent of people testing positive carried barely any virus”\n\nThe petitioners noted this is why majority of people who have a positive PCR test have no symptoms and state there is no ‘super spreaders’, just highly flawed testing producing mostly false positive results by recommendations of the test settings. They also noted that the studies that are offered as proof of ‘asymptomatic spread’ are using the discredited PCR tests to diagnosis and measure end point outcome’.\n\nThe petitioners also expressed serious issues with concerns over the safety of Moderna & Pfizer vaccines after becoming aware that the vaccines contain an ingredient called Polyethylene Glycol, (PEG ). A PGE allergy is a contraindication vaccination with Moderna & Pfizer Covid-19 vaccines\n\nAn estimated 72% of the population have antibodies to PEG, 7% with levels so high they are may be at risk of an anaphylactic and life threatening reaction with PEG exposure, as reported in Science Magazine in December of last year:\n\n“As much as 72% of people have at least some antibodies against PEGs, according to a 2016 study led by Samuel Lai, a pharmaco-engineer at the University of North Carolina, Chapel Hill, presumably as a result of exposure to cosmetics and pharmaceuticals. About 7% have a level that may be high enough to predispose them to anaphylactic reactions, he found”\n\nThe petitioners went on to explain that there is no safe way to screen the public with so many people predisposed to a allergic reaction, and allergen testing on this wide of a scale is simply impractical.\n\nThey also stated that they do not believe there is an accurate assessment of the frequency of occurrence of allergic reactions that may be occurring with the Covid-19 vaccines pointing to the FDA’s failure to set up necessary reporting system required to monitory for these event.\n\nThe CDC now recommends intubation kits at vaccine clinic sites due to concerns over anaphylactic reactions in Covid-19 vaccine recipients.\n\nThe Cabin Talk representative also expressed concern over the censorship of credible and scientifically documented problems with Covid-19 policies and stated that the discussion should be on the substance of the evidence. And, emphasized the public should review all the studies and data directly.\n\n\n\n“The media really harmed true public awareness by making this a political debate rather than a scientific one. Many people won’t even look at our concerns because of partisan framing. Stop funneling Covid 19 reporting through politicians mouths, and address the substance of the issues.”..\n\n\n\nThe representative went on to ask:\n\n“Are we really following the science here? These professionals took the time to create an evidence based document based on the media’s and governments own sources….already many members of the public are fully aware of this data and lawsuits are starting to be filed all over the United States and internationally, on the same evidence presented in this petition….are they going to call the whole world conspiracy theorists and antivaxers…how are public health officials & organizations going to explain this to the public when it comes to full light”?\n\nThey also pointed to the lawsuits being submitted under the direction of Reiner Fuellmich who is working with lawyers in many countries to bring criminal charges around the Covid-19 policies as evidence this is reaching a public boiling point.\n\nAttoreny Fuellmich is a top internationally recognized lawyer for his work in the Deutsche Bank and Volkwagon lawsuits.\n\nThe petition is available for full public review with all sources sited in this article at unite4truth website, here:\n\nSignatures may be submitted to be added to the petition by writing this email with your name, address, health profession (if applicable) and address. Public or anonymous display on the website will up to the individual.\n\nAdditionally, a download and petition sheet is available at the bottom of petition link. Volunteers are collecting signatures across the country. If you are interested in helping with signature collection, include that in your email.", "opengraph": {"url": "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/", "type": "article", "title": "Vermonters Support Challenging The COVID Narrative (UNITE 4 TRUTH)", "description": "Publisher’s Note: Global network of lawyers, doctors, scientists and citizens create Unite4Truth. Press release below, shared by concerned Vermonters. Please consider signing and passing on t…", "article:published_time": "2021-03-06T12:51:00+00:00", "article:modified_time": "2021-03-06T12:53:09+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-06-at-7.50.05-AM.png", "image:width": "2430", "image:height": "1226", "locale": "en_US"}, "tags": ["United 4 Truth", "PCR", "Vermont", "testing", "VT"], "tweets": [], "movies": [], "links": ["http://www.unite4truth.com", "https://cormandrostenreview.com/retraction-request-letter-to-eurosurveillance-editorial-board/", "https://pubs.acs.org/doi/abs/10.1021/acs.analchem.6b03437", "https://evolvetoecology.org/2021/02/27/dr-reiner-fuellmich-begins-legal-litigation-on-the-covid-19-fraud-the-greatest-crime-against-humanity/", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/#print", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=email", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=twitter", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=facebook", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=reddit", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=linkedin", "https://vermontindependent.net/vermonters-support-challenging-the-covid-narrative-unite-4-truth/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2021-03-06T12:51:00+00:00"}