{"result_id": "310032", "URL": "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/", "timestamp": "2023-04-25 17:38:13 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "Is Vermont Becoming A Biomedical Security State? (“PANDEMIC OF THE VACCINATED,” INFORMATION DISORDER SYNDROME, @ THE NEW ABNORMAL)", "cleaned_text": "Publisher’s Note: Aaron Kheriaty MD is the director of the Bioethics and American Democracy Program at the Ethics and Public Policy Center and a senior fellow at the Zephyr Institute. We’ll be interviewing him on our Plan V-TV podcast come December. What follows is an excerpt from his new book The New Abnormal: The Rise of the Biomedical Security State.\n\nOf particular interest in Kheriaty’s excerpt below is the crucial distinction between SCIENCE and SCIENTISM. Vermont public health, media and political leaders seem possessed by SCIENTISM, rather than practicing SCIENCE, and the results are proving catastrophic for Vermont’s citizenry. If this seems an exaggeration, travel beyond the boundaries of Burlington, Stowe, Montpelier and the Mad River Valley and talk with our friends and neighbors..\n\nSCIENTISM leads to the promotion of Official Narratives based on Ideology rather than actual scientific data, as evidenced by Vermont “health care” providers’ continued bizarre promotion of COVID-19 protocols – Masks, PCR “Tests,” “Vaccines,” Lockdowns – that have been conclusively proven NOT to have any efficacy in preventing viral transmission or infections (The image below dropped onto the UVM Medical Center’s Facebook page a few days before Thanksgiving).\n\nEven more troubling? As reported in The Washington Post on November 23, 2022, we now are witnessing a “Pandemic of the Vaccinated,” as the majority of US COVID deaths are now occurring among the injected. Why this isn’t being daily discussed in US and Vermont news media circles is, well, bewildering.\n\nStranger still? The troubling increase in “vaxxed” deaths is now being blamed on – wait for it! – “the unvaxxed.” Yes, thanks to a new clinical term called “Information Disorder Syndrome,” the unvaxxed’s raising of pesky questions seems to increasing “vaxxed” mortality rates.\n\nMeanwhile, WOKEtopia meets COVIDtopia in the full color full page “advertisement” for “holiday vaccination in “culturally affirming spaces,” brilliantly critiqued by NYU professor of propaganda Dr. Mark Crispin Miller at his Substack this week.\n\nHere is the latest deep dive into Vermont death data surrounding the alleged “novel SARS COV 2” virus, “vaccines” etc. based on an examination of Vermont death certificates from the past 3 years.\n\nYou can’t make this up. Orwell is rolling in his grave.\n\nSee screen shots below of 2 recent IDS “studies.”\n\nAnd if you are a well-meaning Vermonter (or any feeling Human) baffled by this Critique, or tempted to ask us to “check our White/Male/XX Privilege at the Door,” we implore you to read Harriet Washington’s meticulously researched book Medical Apartheid: The Dark History Of Medical Experimentation on Black Americans From Colonial Times To The Present.\n\nHere’s a helpful link, and a movie version of the book, if you can’t/don’t/won’t read.\n\nStop the Shots, Masks, and DNR Covidtopia. Ever Again.\n\nWe’re also including this eye-opening “Thales DIGITAL ID WALLET” video, making explicit the links between “public health surveillance” and “financial surveillance” – both forms of totalitarianism that must be challenged and defeated by Humans/Vermonters interested in informed consent, health choice, medical freedom, and individual autonomy.\n\nThe Italian philosopher Augusto Del Noce, who came of age in the 1930s and observed with horror the emergence of Mussolini’s Fascist regime in his native country, warned that “the widespread notion that the age of totalitarianisms ended with Hitlerism and Stalinism is completely mistaken.” He explained:\n\nBy technological society, Del Noce did not mean a society characterized by scientific or technological progress, but a society characterized by a view of rationality as purely instrumental. Human reason, on this view, is unable to grasp ideas that go beyond brute empirical facts: we are incapable of discovering transcendent truths. Reason is merely a pragmatic tool, a useful instrument for accomplishing our purposes, but nothing more. Totalitarian ideologies deny that all human beings participate in a shared rationality. We therefore cannot really talk to one another: it is impossible to deliberate or debate civilly in a shared pursuit of truth. Reasoned persuasion has no place. Totalitarian regimes always monopolize what counts as “rational” and therefore what one is permitted to say publicly.\n\nFor example, if people in a Communist society contradict Communist doctrine, the party does not explain why they are wrong. The authorities simply dismiss dissenting opinions as instances of “bourgeois rationality” or “false consciousness.” For a Communist, if you have not embraced Marx’s theory of dialectical materialism, then you do not understand the direction of history. What you are talking about is, by definition, pure nonsense and not worth considering. You are obviously on the “wrong side of history.” Authorities assume that dissenting opinions must be motivated by class interests (or racial characteristics, or gender, or whatever), which dissidents are trying to defend.\n\nYou don’t think such-and-such because you reasoned logically to that conclusion; you think such-and-such because you are a white, heterosexual, middle-class American female, and so forth. In this way, totalitarians do not persuade or refute their interlocutors with reasoned arguments. They merely impute bad faith to their opponents and refuse to engage in meaningful debate. They forcibly cut their adversaries off from the sphere of enlightened conversation. One does not bother arguing against such dissidents; one simply steamrolls them after placing them outside the realm of acceptable opinion.\n\nThe totalitarianisms of the 20th century were grounded in pseudoscientific ideologies, e.g., the Marxist pseudoscience of economics and history, or the Nazi pseudoscience of race and eugenics. In our own day, the pseudo-scientific ideology that drives societies in a totalitarian direction is scientism, which must be clearly distinguished from science. The ideology of scientism and the practice of science should not be confused: the former is often conflated with the latter, which creates no end of muddled thinking.\n\nScience is a method, or more accurately, a collection of various methods, aimed at systematically investigating observable phenomena in the natural world. Rigorous science is characterized by hypothesis, experiment, testing, interpretation, and ongoing deliberation and debate. Put a group of real scientists in a room together and they will argue endlessly about the salience, significance, and interpretation of data, about the limitations and strengths of various research methodologies, and about the big picture questions. Science is an enormously complex human enterprise, with each scientific discipline having own refined methods of inquiry and its own competing theories. Science is not an irrefutable body of knowledge. It is always fallible, always open to revision; yet when conducted rigorously and carefully, scientific research is capable of genuine discoveries and important advances.\n\nScientism is the philosophical claim—which cannot be proven scientifically—that science is the only valid form of knowledge. Anyone who begins a sentence with the phrase, “Science says . . . ” is likely in the grip of scientism. Genuine scientists don’t talk like this. They begin sentences with phrases like, “The findings of this study suggest,” or “This meta-analysis concluded. . . .” Scientism, by contrast, is a religious and often a political ideology. “It has been evident for quite a while that science has become our time’s religion,” the Italian philosopher Giorgio Agamben observed, “the thing which people believe that they believe in.” When science becomes a religion—a closed and exclusionary belief system—we are dealing with scientism.\n\nThe characteristic feature of science is warranted uncertainty, which leads to intellectual humility.\n\nThe characteristic feature of scientism is unwarranted certainty, which leads to intellectual hubris.\n\nDel Noce realized that scientism is intrinsically totalitarian, a profound insight of enormous importance for our time. “Many people do not realize that scientism and the technological society are totalitarian in nature,” he wrote fifty years ago. To understand why, consider that scientism and totalitarianism both claim a monopoly on knowledge. The advocate of scientism and the true believer in a totalitarian system both assert that many common-sense notions are simply irrational, unverifiable, unscientific, and therefore outside the scope of what can be said publicly. Antigone’s claim, “I have a duty, inscribed indelibly on the human heart, to bury my dead brother” is not a scientific statement; therefore, according to the ideology of scientism, it is pure nonsense. All moral or metaphysical claims are specifically excluded because they cannot be verified by the methods of science or established by the reigning pseudo-scientific totalitarian ideology.\n\nOf course, the forced exclusion of moral, metaphysical, or religious claims is not a conclusion of science, but an unprovable philosophical premise of scientism. The assertion that science is the only valid form of knowledge is itself a metaphysical (not a scientific) claim, smuggled in quietly through the backdoor. Scientism needs to hide this self-refuting fact from itself, so it is necessarily mendacious: dishonesty is baked into the system, and various forms of irrationalism follow. The 20th century totalitarian ideologies all claimed to be “scientific,” but were in fact unfalsifiable by their own circular logic. Because scientism cannot establish itself through rational argument, it relies instead on three tools to advance: brute force, defamation of critics, and the promise of future happiness. These are the same tools deployed by all totalitarian systems.\n\nTo hide its own internal contradiction from view, the self-refuting premise of scientism is rarely stated explicitly. Scientism is instead implicitly assumed, its conclusions repeatedly asserted, until this ideology simply becomes the air we breathe. Careful policing of public discourse admits only evidence supposedly supported by “science,” and this atmosphere is rigorously enforced. As we will see in the next chapter, during the pandemic, qualitative (e.g., familial, spiritual) goods were repeatedly sacrificed to quantitative (e.g., biological, medical) goods, even when the former were real and the latter only theoretical. This is the fruit of scientism, which turns our scale of values and priorities upside-down.\n\nIt would be hard to find a more effective ideological tool to impose a totalitarian system than by appealing to “science” or “experts” and thereby claiming a monopoly on knowledge and rationality. Those in power can readily choose which scientific experts they endorse and which they silence. This allows politicians to defer inescapably political judgments to “experts,” thus abdicating their own responsibility. One’s ideological opponents are hamstrung, their opinions excluded as “unscientific,” and their public voice silenced—all without the trouble of maintaining a regime of brute force and physical violence. Defamation and exclusion from public discourse works just as effectively. Those in power maintain a monopoly on what counts as Rationality (or Science); they do not bother talking to or debating the [fill-in-the-blank stigmatized group] “bourgeois,” “Jew,” “unvaccinated,” “unmasked,” “anti-science,” “Covid-denier,” etc.\n\nRepressive social conformity is thus achieved without resorting to concentration camps, gulags, Gestapo, KGB, or openly despotic tyrants. Instead, dissenters are confined to a moral ghetto through censorship and slander. Recalcitrant individuals are placed outside the purview of polite society and excluded from enlightened conversation. The political theorist Eric Voegelin observed the essence of totalitarianism is simply that certain questions are forbidden. The prohibition against asking questions is a deliberately and skillfully elaborated obstruction of reason in a totalitarian system. If one asks certain questions—“Do we really need to continue locking down?” or “Are school closures doing more harm than good?” or “Are we sure these vaccines are safe and effective?” or “Why has the promised utopia not yet arrived?”—one will be accused of being a pandemic denier, wanting to kill grandma, being anti-science, or of placing oneself on the “wrong side of history.”\n\nWe can now appreciate why Del Noce claimed that a technocratic society grounded in scientism is totalitarian, though not obviously authoritarian in the sense of openly violent forms of repression. In a strongly worded passage of an essay titled, “The Roots of the Crisis,” he predicted fifty years ago:\n\nIn a technocratic society, one ends up in a moral concentration camp if one is not on board with the pseudo-science du jour, the ideological trend of the moment. Whatever questions, concerns, or objections one might raise—whether philosophical, religious, ethical, or simply a different interpretation of scientific evidence—need not be considered. The dissident’s questions or opinions do not count; they are ruled-out by appeal to “The Science”—trademarked by the regime and printed with a capital T and capital S.\n\nIn another striking passage, written even earlier in 1968, Del Noce warned:\n\nGiven the developments of the last few decades, which manifested with greater clarity during the Covid pandemic, we see clearly that the new oligarchies and persecutory systems will present themselves under the banner of biomedical security measures essential for maintaining population health. The oligarchs will preface their agenda with phrases like, “Out of an abundance of caution . . .” and “We are all in this together. . . ”. The new social-distancing societal paradigm facilitates the oligarch’s dominance by separating citizens from one another.\n\nScientism is a totalitarianism of disintegration before it is a totalitarianism of domination. Recall that lockdowns and social distancing, with their inevitable social isolation, necessarily preceded vaccine mandates and passports, when the repressive regime really tipped its hand. Each of these measures relied on exceptionally sloppy data presented publicly as the only authoritative interpretation of science. In most instances, the pretense of scientific rigor was not even required.\n\nIn a scientistic-technocratic regime, the naked individual—reduced to “bare biological life,” cut off from other people and from anything transcendent—becomes completely dependent on society. The human person, reduced to a free-floating, untethered, and uprooted social atom, is more readily manipulated. Del Noce made the startling claim that scientism is even more opposed to tradition than Communism, because in Marxist ideology we still find messianic and biblical archetypes dimly represented in the promise of a future utopia. By contrast, “scientistic anti-traditionalism can express itself only by dissolving the ‘fatherlands’ where it was born.” This process leaves the entire field of human life wide open to domination by global corporations and their suborned political agents:\n\nStates as instruments of world-spanning corporations, which operate like fiefdoms, is an apt definition of corporatism—the melding of state and corporate power—which coincides perfectly with Mussolini’s original definition of fascism. In this global non-society, individuals are radically uprooted and instrumentalized. The ultimate result, in the last analysis, is pure nihilism: “After the negation of every possible authority of values, all that is left is pure total negativism, and the will for something so indeterminate that it is close to ‘nothing’,” in Del Noce’s bleak description. This is clearly a society suited neither to a meaningful human life nor to social harmony.", "opengraph": {"url": "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/", "type": "article", "title": "Is Vermont Becoming A Biomedical Security State? (“PANDEMIC OF THE VACCINATED,” INFORMATION DISORDER SYNDROME, @ THE NEW ABNORMAL)", "description": "Publisher’s Note: Aaron Kheriaty MD is the director of the Bioethics and American Democracy Program at the Ethics and Public Policy Center and a senior fellow at the Zephyr Institute. We&#821…", "article:published_time": "2022-12-04T16:07:40+00:00", "article:modified_time": "2022-12-09T13:17:18+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2022/12/VI.webp", "image:width": "394", "image:height": "600", "locale": "en_US"}, "tags": ["Information Disorder Syndrome", "\"culturally affirming spaces\"", "Digital ID Wallet", "THALES", "The New Abnormal", "Vermont", "Biomedical Security State", "Aaron Kheriaty"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1220", "height": "687", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"1220\" height=\"687\" src=\"https://www.youtube.com/embed/PxvNzzgoJX8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/PxvNzzgoJX8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://americanmind.org/author/aaron-kheriaty/", "https://www.regnery.com/9781684513857/the-new-abnormal/", "https://www.washingtonpost.com/politics/2022/11/23/vaccinated-people-now-make-up-majority-covid-deaths/?utm_source=substack&utm_medium=email", "https://vermontdailychronicle.com/vaccinated-people-represent-most-covid-19-deaths-now/", "https://off-guardian.org/2022/11/24/new-study-blames-vaxxed-deaths-on-the-unvaxxed-because-they-cause-anxiety-seriously/", "https://markcrispinmiller.substack.com/p/with-the-highest-vaccination-rate?utm_source=post-email-title&publication_id=383085&post_id=88827394&isFreemail=true&utm_medium=email", "https://ashmedai.substack.com/p/vermonts-post-pandemic-mortality", "https://vermontindependent.net/covidsurveillance2021/", "https://www.amazon.com/Crisis-Modernity-Augusto-Del-Noce/dp/0773544437", "https://www.amazon.com/Secularization-Mcgill-queens-Studies-History-Ideas/dp/0773550917", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/#print", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=email", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=twitter", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=facebook", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=reddit", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=linkedin", "https://vermontindependent.net/is-vermont-becoming-a-biomedical-security-state-the-new-abnormal/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2022-12-04T16:07:40+00:00"}