{"result_id": "310049", "URL": "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/", "timestamp": "2023-04-25 17:38:51 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "US COVID’aganda, And Vox Vaccines (“FORCED INJECTIONS” = VIRAL TYRANNY?)", "cleaned_text": "Whenever the subject of vaccines comes up, we always ask three questions to see if folks are up to speed with the history and current reality surrounding US vaccines. Answers below.\n\n1) How many vaccine inoculations/jabs does the CDC recommend in 2020 for US kids by age 18?\n\n2) 2) How much money has the secret US “vaccine court” paid out in damages to US citizens claiming to be injured of vaccines?\n\n3) In what year did the US Congress pass a law protecting the vaccine industry/Big Pharma from legal liability and lawsuits?\n\nIf you cannot easily answer these three questions, we suggest doing some more research on vaccines before coming to any conclusions about vaccines’ efficacy.\n\nHere in the Green Mountains, we’ve been supportive of the Vermont Coalition for Vaccine Choice for many years. Let’s be clear – the “PRO V. ANTI vaxxer” dualistic discourse rampant in US “news” outlets is a false framing around vaccines, a very powerful technology that (like any other) is capable of being used for public health good or public health disaster. Let’s approach any conversation about vaccines with the same level of complexity as we would any other sophisticated industrial technology.\n\nHistory is helpful here – and we are proponents of “medical freedom” and “informed consent.”\n\nBelow, is an short but eye-opening film (transcript provided) connection the dots between the Gates Foundation, the US COVID leadership, and Big Pharma. We also recommend Del Bigtree’s weekly High Wire program and Robert F. Kennedy’s Chlldren’s Health Defense, two well-researched organizations asking all the right questions and mounting legal challenges to Big Pharma and their government minions.\n\nClick here for the film MEDICAL TYRANNY 2020.\n\nTRANSCRIPT for the film below.\n\nAnthony Fauci does not like conspiracy theories. And if the President does not fire several members of his COVID-19 response team, the books written in the future will likely be about the Bill Gates-Big Pharma takeover of America.\n• Dr Fauci is on the Leadership Council for the Bill and Melinda Gates Foundation.\n• Deborah Birx is a board member for the Global Fund to fight AIDS, Tuberculosis and Malaria, which was founded by the Bill and Melinda Gates Foundation.\n• Robert Redfield, current director of the CDC was a founder of the Institute of Human Virology, who has received $31.8 million from the Bill and Melinda Gates Foundation.\n• Seema Verma has worked with Sue Desmond-Hellman, Chief Executive Officer of the Bill and Melinda Gates Foundation.\n• Alex Azar was President of Eli Lilly’s US division. Under his leadership, prices for the company’s top-selling insulin drug tripled, which led to a class-action lawsuit.\n• Stephen Hahn is commissioner for the FDA who partnered with Bill and Melinda Gates in 2017.\n• Stephen Mnuchin was a member of Skull and Bones at Yale University and he partnered with George Soros to create SFM Capital Management.\n• Bret Giroir was the Director of DARPA.\n\nMany have been concerned that President Trump has been surrounded by Deep State operatives for the past three years. Well, now he seems to be completely surrounded by Big Pharma and Bill Gates loyalists, all pushing vaccines as the solution and admitting that they might make things worse.\n\nLos Angeles has announced that they’re going to pay people to snitch on their neighbors.\n\nLA Mayor Eric Garcetti: “You know the old expression about snitches. Well, in this case, snitches get rewards we want to thank you for turning folks in and making sure we are all safe.”\n\nAnd the public is now being prepared for mandatory certificates of immunity in order to freely leave their homes.\n\nCNN Reporter: “Can you imagine a time where Americans carry certificates of immunity?\n\nDr Anthony Fauci: “You know, that’s possible. I mean, it’s one of those things that we talk about when we want to make sure that we know who the vulnerable people are and not – this is something that’s being discussed. I think it might actually be have some merit under certain circumstances.”\n\nRespected Views on Harmful to Health Vaccines – by Stephen Lendman\n\nThe 2016 documentary film “Vaxxed: From Cover-Up to Catastrophe” discusses the link between the MMR (measles, mumps, rubella) vaccine and autism.\n\nMedia denunciation of the film, followed by withdrawing it from wide distribution, is an example of science denial and medical McCarthyism.\n\nThe film exposes CDC corruption and fraud in deference to private industry profit-making — why it should be called the sickness, not the healthcare, industry.\n\nAccording to senior MIT research scientist Stephanie Seneff, autism at its current observed rate is projected to affect around half of vaccinated boys by 2025.\n\nUS major media journalists are instructed by the CDC on how to report on vaccines — what to say, what to suppress, ignoring scientific evidence.\n\nHealth and nutrition expert Gary Null and former senior biotechnology and genomic industries research analyst Richard Gale warned that vaccines are “unsafe at any dose,” saying the following:\n\nSafety and efficacy claims by Big Pharma and the CDC have “no warranted basis in medical science.”\n\n“This official policy is founded upon flawed premises and a primitive understanding about the complexities of the human body and its multifaceted immunological system.”\n\n“(S)ettled science…that rel(ies) on private financial interests is sheer propaganda.”\n\n“Valid science…constantly seeks new discoveries to acquire further knowledge and greater understanding.”\n\n“Modern vaccine science…morphed into a new fascism, a rigid doctrine that has sacrificed the foundations of scientific integrity on the altar of institutional greed, privilege and profit.”\n\n“(A) body of research point(s) to vaccination’s adverse effects upon our immune systems.”\n\nThere’s an alarming correlation between numbers of childhood vaccinations and illnesses among children, as well as autoimmune diseases in adults.\n\nThe CDC falsely claims vaccines are “unavoidably safe.” Growing scientific evidence shows otherwise, including numerous “severe vaccine injur(ies).”\n\n“(T)he most compelling and thorough medical research indicates that there is no such thing as a safe vaccine…”\n\nToxins in vaccines that are harmful to human health include mercury, aluminum, formaldehyde, phenoxyethanol (antifreeze), MSG, and squalene adjuvants that weaken and can destroy the human immune system, making it vulnerable to many annoying to life-threatening illnesses.\n\nNull and Gale: “The majority of vaccine ingredients have been shown repeatedly to have toxic consequences contributing to serious neurological and autoimmune conditions” — either occurring immediately or appearing later in life.\n\nThe public and private vaccine industry is rife with conflicts of interest. “(A)ccepted vaccine research (is) junk science.”\n\nFederal and industry claims that toxins in vaccines are too minimal in amounts to harm human health are falsified.\n\nAny amount of mercury or aluminum ingested, no matter how little, is harmful to human health.\n\nThe amount of toxins in multiple vaccines given infants exceeds what the scientific community acknowledges is a safe level.\n\nNull and Gale explained that public and private health officials “have very little clear idea about what we are actually injecting into our children nor its long term consequences on our natural immune systems.”\n\nNotable epigenetic researcher Dr. Mae-Wan Ho explained that “vaccines…can be dangerous, especially live, attenuated viral vaccines or the new recombinant nucleic acid vaccines.”\n\n“They have the potential to generate virulent viruses by recombination and the recombinant nucleic acids could cause autoimmune disease.”\n\nNull and Gale: “Any one of the many vaccines on the market today can cause enormous genetic and epigenetic disruption in any human being.”\n\nCDC and private industry promoted one-size-fits-all vaccination policy has no scientific validity.\n\nSince the mid-1960s, CDC and WHO vaccine divisions acknowledged genetic contamination in all vaccines, posing a serious human health risk.\n\nNull and Gale: “Current vaccine technology makes it impossible to filter out all genetic contamination and DNA debris from vaccine preparations.”\n\n“There are approximately 100 million allowable segments of DNA contamination permitted in any single vaccine dose.”\n\n“Americans today are less healthy than previous generations. More and more people have compromised immune systems and are rapidly becoming immunodeficient.”\n\n“The American Autoimmune Related Diseases Associations estimates that 50 million people have any one of 100 and perhaps over 140 different life-threatening autoimmune diseases.”\n\n“(T)he official doctrine of vaccine safety is completely based upon (unscientific) blind belief and faith.”\n\nNull, Gale, and other scientific experts stress that all vaccines are unsafe at any dose.\n\nIts “mission is to end the epidemic of children’s chronic health conditions (including from toxic vaccines) by working aggressively to eliminate harmful exposures, hold those responsible accountable, and establish safeguards so this never happens again.”\n\n“The greatest crisis that America faces today is the chronic disease epidemic in America’s children,” said RFK Jr.\n\nHe slammed Microsoft founder Bill Gates’ obsession with wanting control over “a global vaccination ID enterprise (to) give him (and others with the same agenda) dictatorial control of global health policy.”\n\nGates Foundation funded tests of experimental HPV vaccines “on 23,000 young girls in remote Indian provinces (caused about) 1,200…severe side effects, including autoimmune and fertility disorders.”\n\n“Seven (girls) died. Indian government investigations charged that Gates-funded researchers committed pervasive ethical violations: pressuring vulnerable village girls into the trial, bullying parents, forging consent forms, and refusing medical care to” the injured.\n\nIn 2010, Gates Foundation funded “phase 3 trial of GSK’s experimental malaria vaccine kill(ed) 151 African infants and caus(ed) serious adverse effects including paralysis, seizure, and febrile convulsions to 1,048 of the 5,949 children” vaccinated.\n\nEarlier Gates Foundation funded vaccination of hundreds of sub-Saharan children against meningitis resulted in paralysis for about 10% of the subjects.\n\nAccording to South African political economist Patrick Bond, Black Africans “are guinea pigs for the drug makers.”\n\nHe called Bill Gates “ruthless and immoral.” In 2010, his foundation invested billions of dollars in making the next 10 years “the decade of vaccines.”\n\nLater he said vaccines “could reduce population.”\n\nA 2017 study of diphtheria-tetanus-pertussis (DTP) and oral polio vaccine (OPV) in an urban Guinea-Bissau community showed doses killed more children than diseases they’re supposed to prevent.\n\nRFK Jr. and likeminded public health advocates accuse Gates and other vaccine profiteers of serving their own self-interest over human health and disease prevention.\n\nAlong with his ties to the CDC, WHO, and other health agencies, Gates funds/invests in Big Pharma companies involved in developing and marketing vaccines — including development of COVID-19 vaccines.\n\nHe aims for mass, ideally mandatory, COVID-19 vaccinations in the US and elsewhere.\n\nAccording to RFK Jr., the WHO in 2017 “reluctantly admitted that the global explosion in polio is predominantly (from a) vaccine strain,” adding:\n\n“The WHO is a sock puppet for the pharmaceutical industry” — the same true for the CDC.\n\nGates “serve(s) his personal philosophy that good health only comes in a syringe.”\n\nBig Pharma sees a potential bonanza of profits from mass COVID-19 vaccinations when available in the months ahead.\n\nMost people in the US and elsewhere are unaware of harmful toxins in all vaccines.\n\nThe American Association of Medical Colleges (AAMC) warned against rushed COVID-19 development of vaccines — instead of explaining the hazards to human health from all vaccines.\n\nDozens of COVID-19 vaccines are currently in development. Human trials began to rush some to market, the risk to human health ignored.\n\nGovernment promotion of vaccines is driven by politics, not science or public welfare. Big Pharma urges their widespread use because they’re hugely profitable.\n\nI leave the last word to noted vaccine expert Viera Scheibner. Her extensive research showed “(v)accines are killing babies,” adding:\n\n“It is a well documented fact that the incidence and mortality from infectious diseases fell by 90% well before any vaccine was even introduced.”\n\nIn her book titled “Vaccination 100 years of Orthodox Research,” she explained that vaccinations are biological weapons.\n\nThey can damage internal organs and leave children or adults vulnerable to severe autoimmune diseases – including diabetes, arthritis, hepatitis, multiple sclerosis, osteoporosis, polio and numerous others.\n\nThey’re dangerous and unreliable. Thousands of severe adverse reactions occur annually – including permanent disabilities, at times deaths.\n\nNone of this gets publicly reported. Instead, the myth of safe vaccines and importance of getting them persists.\n\nScheibner minced no words, saying the following:\n\n“There is no evidence whatsoever of the ability of vaccines to prevent any diseases.”\n\n“To the contrary, there is a great wealth of evidence that they cause serious side effects,” harming human health.", "opengraph": {"url": "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/", "type": "article", "title": "US COVID’aganda, And Vox Vaccines (“FORCED INJECTIONS” = VIRAL TYRANNY?)", "description": "Publisher’s note: First, a quick quiz. Whenever the subject of vaccines comes up, we always ask three questions to see if folks are up to speed with the history and current reality surroundin…", "article:published_time": "2020-04-13T13:32:36+00:00", "article:modified_time": "2020-04-13T15:34:56+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2020/04/VI-Gates.jpg", "image:width": "392", "image:height": "261", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/freedomofhealthvermont/", "https://thehighwire.com", "https://childrenshealthdefense.org", "https://forbiddenknowledgetv.net/medical-tyranny-2020/", "https://youtu.be/SpQyYTs5LTg", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/#print", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=email", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=twitter", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=facebook", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=reddit", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=linkedin", "https://vermontindependent.net/us-covidaganda-and-vox-vaccines-forced-injections-viral-tyranny/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2020-04-13T13:32:36+00:00"}