{"result_id": "310045", "URL": "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/", "timestamp": "2023-04-25 17:38:44 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "CV19: Pandemic Pandemonium, #FakeNews Vaccines, and State Quarantines In The US Empire (3 BIG QUESTIONS)", "cleaned_text": "Publisher’s Note: First, consider minimizing your daily “news” consumption for a few weeks, as the MSM is doing little other than stoking public fears about COVID.\n\nSecond, some world health stats comparing the 2019 flu numbers with current Covid.-19 numbers.Vital to put COVID in context. Here’s a well-researched comparison between seasonal influenza (the flu) and COVID-19. Dietrich Klinghardt Institute COVID slides here. US journalist Ben Swann raises important questions about how the COVID-19 data is being (mis)used. London’s Daily Telegraph (3/25/2020) on COVID, “dueling data,” and potentially deeper rates of UK infection (which means lower death rates overall).\n\nThird, consider seeking out independent “long form” news sources – i.re. books and podcasts that contextualize information, rather than flogging sound bites for clicks and eyeballs.\n\nCase in point: THE HIGH WIRE’s Del Bigtree provides a historical perspective on “social distancing” (Smallpox and the Leicester Method) versus “herd immunity” as options for treating pandemics, as well as an insightful “chalk talk” re: epidemiological data coming out of Wuhan, China, which shows that CV19 is now flatlining.\n\n1) Will the US establish an acceptable CV19 death rate that balances our current short term epidemiological situation with medium and long-term US economic and social realities?\n\n2) Assuming US can, can we determine a reasonable strategic plan for moving forward, beyond shutting everything down indefinitely, and imposing “lockdowns” (“shelter in place”) and potential “martial law” in cities and states across the US Empire?\n\n3) And does this CV19 “global pandemic” serve some larger geopolitical agenda? See helpful screen shot for details – talent from Del’s talk and video.\n\nHere’s RFK’s Children’s Defense Fund article exploring the answer to question #3. And Caitlin Johnstone’s brilliant critique of US celebs like Sean Penn calling for the USM to “be put in charge of this crisis” – Penn is “psyops in human skin” – is at once hilarious and terrifying. Meanwhile, ROLLING STONE gives us the Department of Justice advocating for “expanded powers” in ways that should give US pause, and the world’s 2nd richest man, Bill Gates, is busy advocating “digital capsules” and CV vaccines. See William Engdahl’s expose on Mr. Gates, below.\n\nArguably, no one has been more active in promoting and funding research on vaccines aimed at dealing with coronavirus than Bill Gates and the Bill and Melinda Gates Foundation. From sponsoring a simulation of a coronavirus global pandemic, just weeks before the Wuhan outbreak was announced, to funding numerous corporate efforts to come up with a novel vaccine for the apparently novel virus, the Gates presence is there. What does it actually entail?\n\nWe must admit that at the very least Bill Gates is prophetic. He has claimed for years that a global killer pandemic will come and that we are not prepared for it. On March 18, 2015 Gates gave a TED talk on epidemics in Vancouver. That day he wrote on his blog, “I just gave a brief talk on a subject that I’ve been learning a lot about lately—epidemics. The Ebola outbreak in West Africa is a tragedy—as I write this, more than 10,000 people have died.” Gates then added, “As awful as this epidemic has been, the next one could be much worse. The world is simply not prepared to deal with a disease—an especially virulent flu, for example—that infects large numbers of people very quickly. Of all the things that could kill 10 million people or more, by far the most likely is an epidemic.”\n\nThat same year, 2015, Bill Gates wrote an article for the New England Journal of Medicine titled, “The Next Epidemic: Lessons from Ebola.” There he spoke of a special class of drugs that “involves giving patients a set of particular RNA-based constructs that enables them to produce specific proteins(including antibodies).Although this is a very new area, it is promising because it is possible that a safe therapy could be designed and put into large-scale manufacture fairly rapidly. More basic research as well as the progress of companies like Moderna and CureVac could eventually make this approach a key tool for stopping epidemics.” Moderna and CureVac both today receive funds from the Gates Foundation and are leading the race to develop an approved COVID-19 vaccine based on mRNA.\n\nA global flu-like pandemic in fact is something that Gates and his well-endowed foundation have spent years preparing for. In 2017 during the Davos World Economic Forum, Gates initiated something called CEPI, the Coalition for Epidemic Preparedness Innovations, together with the governments of Norway, India, Japan, and Germany, along with the Wellcome Trust of the UK. Its stated purpose is to “accelerate the development of vaccines we’ll need to contain outbreaks” of future epidemics. He noted at the time that “One promising area of vaccine development research is using advances in genomics to map the DNA and RNA of pathogens and make vaccines.” We will return to that.\n\nBy 2019 Bill Gates and the foundation were going full-tilt boogie with their pandemic scenarios. He made a Netflix video which made an eerie imaginary scenario. The video, part of the “Explained” series, imagined a wet market in China where live and dead animals are stacked and a highly deadly virus erupts that spreads globally. Gates appears as an expert in the video to warn, “If you think of anything that could come along that would kill millions of people, a pandemic is our greatest risk.” He said if nothing was done to better prepare for pandemics, the time would come when the world would look back and wish it had invested more into potential vaccines. That was weeks before the world heard about bats and a live wet market in Wuhan China.\n\nIn October, 2019 the Gates Foundation teamed up with the World Economic Forum and the Johns Hopkins Center for Health Security to enact what they called a “fictional” scenario simulation involving some of the world’s leading figures in public health. It was titled Event 201.\n\nAs their website describes it, Event 201 simulated an “outbreak of a novel zoonotic coronavirus transmitted from bats to pigs to people that eventually becomes efficiently transmissible from person to person, leading to a severe pandemic. The pathogen and the disease it causes are modeled largely on SARS, but it is more transmissible in the community setting by people with mild symptoms.”Coronavirus Outbreak, a Global Public Health Emergency?\n\nIn the Event 201 scenario the disease originates at a pig farm in Brazil, spreading through low-income regions and ultimately explodes into an epidemic. The disease is carried by air travel to Portugal, the USA and China and beyond to the point no country can control it. The scenario posits no possible vaccine being available in the first year. “Since the whole human population is susceptible, during the initial months of the pandemic, the cumulative number of cases increases exponentially, doubling every week.”\n\nThe scenario then ends after 18 months when the fictional coronavirus has caused 65 million deaths. “The pandemic is beginning to slow due to the decreasing number of susceptible people. The pandemic will continue at some rate until there is an effective vaccine or until 80-90 % of the global population has been exposed.”\n\nAs interesting as the prescient Gates-Johns Hopkins Event 201 fictional scenario of October, 2019 may be, the list of panelists who were invited to participate in the imaginary global response is equally interesting.\n\nAmong the selected “players” as they were called, was George Fu Gao. Notably, Prof. Gao is director of the Chinese Center for Disease Control and Prevention since 2017. His specialization includes research on “influenza virus interspecies transmission (host jump)… He is also interested in virus ecology, especially the relationship between influenza virus and migratory birds or live poultry markets and the bat-derived virus ecology and molecular biology.” Bat-derived virus ecology…\n\nProf. Gao was joined among others at the panel by the former Deputy Director of the CIA during the Obama term, Avril Haines. She also served as Obama’s Assistant to the President and Principal Deputy National Security Advisor. Another of the players at the Gates event was Rear Admiral Stephen C. Redd, Director of the Office of Public Health Preparedness and Response at the Centers for Disease Control and Prevention (CDC). The same CDC is at the center of a huge scandal for not having adequate functioning tests available for testing cases of COVID-19 in the USA. Their preparedness was anything but laudable.\n\nRounding out the group was Adrian Thomas, the Vice President of scandal-ridden Johnson & Johnson, the giant medical and pharmaceutical company. Thomas is responsible for pandemic preparedness at J&J including developing vaccines for Ebola, Dengue Fever, HIV. And there was Martin Knuchel, Head of Crisis, Emergency & Business Continuity Management, for Lufthansa Group Airlines. Lufthansa has been one of the major airlines dramatically cutting flights during the COVID-19 pandemic crisis.\n\nAll this shows that Bill Gates has had a remarkable preoccupation with the possibility of a global pandemic outbreak he said could be even larger than the alleged deaths from the mysterious 1918 Spanish Flu, and has been warning for at least the past five years or more. What the Bill & Melinda Gates Foundation also has been involved in is funding development of new vaccines using bleeding-edge CRISPR gene-editing and other technologies.\n\nGates Foundation money is backing vaccine development on every front. Inovio Pharmaceuticals of Pennsylvania received $9 million from the Gates-backed CEPI, Coalition for Epidemic Preparedness Innovations, to develop a vaccine, INO-4800, which is about to test on humans in April, a suspiciously rapid time frame. In addition Gates Foundation just gave the company an added $5 million to develop a proprietary smart device for intradermal delivery of the new vaccine.\n\nIn addition Gates Foundation monies via CEPI are financing development of a radical new vaccine method known as messengerRNA or mRNA.\n\nThey are co-funding the Cambridge, Massachusetts biotech company, Moderna Inc., to develop a vaccine against the Wuhan novel coronavirus, now called SARS-CoV-2. Moderna’s other partner is the US National Institute of Allergy and Infectious Diseases (NIAID), a part of the National Institutes of Health (NIH). Head of NIAID is Dr Anthony Fauci, the person at the center of the Trump Administration virus emergency response. Notable about the Fauci-Gates Moderna coronavirus vaccine, mRNA-1273, is that it has been rolled out in a matter of weeks, not years, and on February 24 went directly to Fauci’s NIH for tests on human guinea pigs, not on mice as normal. Moderna’s chief medical adviser, Tal Zaks, argued, “I don’t think proving this in an animal model is on the critical path to getting this to a clinical trial.”\n\nAnother notable admission by Moderna on its website is the legal disclaimer, “Special Note Regarding Forward-Looking Statements: …These risks, uncertainties, and other factors include, among others: … the fact that there has never been a commercial product utilizing mRNA technology approved for use.” In other words, completely unproven for human health and safety.\n\nAnother biotech company working with unproven mRNA technology to develop a vaccine for the COVID-19 is a German company, CureVac. Since 2015 CureVac has received money from the Gates Foundation to develop its own mRNA technology. In January the Gates-backed CEPI granted more than $8 million to develop a mRNA vaccine for the novel coronavirus.\n\nAdd to this the fact that the Gates Foundation and related entities such as CEPI constitute the largest funders of the public-private entity known as WHO, and that its current director, Tedros Adhanom, the first WHO director in history who is not a medical doctor, worked for years on HIV with the Gates Foundation when Tedros was a government minister in Ethiopia, and we see that there is practically no area of the current coronavirus pandemic where the footprints of the omnipresent Gates are not to be found. If that is to the good of mankind or grounds to be worried, time will tell.\n\nF. William Engdahl is strategic risk consultant and lecturer, he holds a degree in politics from Princeton University and is a best-selling author on oil and geopolitics, exclusively for the online magazine “New Eastern Outlook” where this article was originally published. He is a Research Associate of the Centre for Research on Globalization.\n\nAnd here is independent journalist Stephen Lendman out of Illinois on “Shelter In Place” versus “Martial Law”…\n\nIt’s hard keeping up with changes worldwide relating to COVID-19 outbreaks.\n\nWhile not at epidemic or pandemic levels as falsely reported, there’s risk that things could reach these levels in the weeks and months ahead.\n\nAt times like now, the order of the day is clear. It’s far better to be safe than sorry.\n\nThrough Saturday, there were about 308,000 reported COVID-19 cases worldwide, around 13,000 deaths, far short of epidemic or pandemic levels — Italy, China, South Korea, and Iran hardest hit.\n\nIn the US, three states are on lockdown, California, New York and Illinois, affecting 73 million people.\n\nAlong with coming New Jersey and Connecticut shelter in place orders, around 85 million people are affected — about 26% of the nation’s population.\n\nGiven the trend of what’s happening, further shelter in place/social distancing orders are likely coming in other US states and abroad.\n\nStates are empowered to order them, not the federal government nationwide.\n\nNothing in the Constitution permits the latter. Its commerce clause lets Congress “regulate commerce with foreign nations, and among the several states.”\n\nWithin their borders is the prerogative of their authorities to handle, free from federal interference. When state lines are crossed, it’s another issue entirely.\n\nUS borders with Canada and Mexico are closed, excluding commerce and essential travel that continues.\n\nNew Jersey, Connecticut are preparing similar shelter in place orders.\n\nOn Friday, Illinois Governor Pritzker issued a “stay-at-home” order for the entire state, effective 5:00 PM Saturday — even though only 585 confirmed COVID-19 cases were reported, only a handful of deaths.\n\nThe Illinois order is similar to other US states. Public gatherings are prohibited.\n\nSchools, state parks, playgrounds, and other public facilities are closed. People may still shop for essentials, take walks, and care for relatives in need provided they social distance at least 6 feet from others in public.\n\nIndividuals involved in providing essential services are exempted, notably medical providers, food store and pharmacy employees, police, firefighters, and paramedics.\n\nLockdowns are in place for as long as considered necessary.\n\nBanks remain open. Authorities are largely relying on self-discipline because there aren’t enough police to monitor streets and communities.\n\nCalifornia, New York, Washington and Florida have the largest number of reported COVID-19 cases so far in the US.\n\nLockdowns, movement restrictions, and/or social distancing were ordered in numerous countries worldwide — so far not in hard hit Iran that’s relying on self-discipline for personal safety.\n\nAccording to Lausanne, Switzerland’s Federal Institute of Technology epidemiologist Marcel Salathe, nations effectively controlling COVID-19 outbreaks achieved success by mass “testing and tracing, isolation and quarantining,” adding:\n\nWhat’s necessary is “a determination to find every single infection and follow up on every potential exposure and break every possible chain of transmission.”\n\nIt’s unknown to what extent infections may spread nationally and internationally and when current outbreaks can be curbed.\n\nUniversity of Edinburgh epidemiologist Mark Woolhouse believes “(w)e will be living with this virus indefinitely.”\n\nThe same is true for seasonal flu/influenza, other infectious diseases, heart disease, cancer, and countless other health issues.\n\nKey is the availability of remedial treatment that’s available for everyone in need.\n\nThere are many infectious diseases around, cures available for most, key to controlling them.\n\nThe world’s richest country USA is the only developed one without some form of universal healthcare — notably at a time when it’s vitally needed, no excuse existing for not enacting it into law straightaway as the nation’s top priority.\n\nThough vital, economic conditions are secondary to public health. Financial and other markets reflect the economic health of the times.\n\nSince February peak valuations, financial markets worldwide declined sharply.\n\nThe US Dow Jones Average is down 35.2% — 24% in March to date, its biggest one-month decline since September 1931.\n\nThe S & P 500 is down 32.1% — 22% in March to date, its worst monthly performance since May 1940.\n\nThe Nasdaq didn’t exist until 1971. It peaked in February at 9,817.18. On March 20, it stood at 7,150.58 — 27% below its peak valuation.\n\nWhat’s going on today is dissimilar to how financial markets performed during the 1918-20 Spanish Flu, a bona fide pandemic that infected about one-fourth of the world’s population, killing tens of millions.\n\nThe outbreak began during the final year of WW I. Despite dropping about 10%, the Dow was up slightly more than 10% in 1918.\n\nFrom its late 1919 peak, it dropped about 44% to its 2020 low, then rose around 18% before losing most of the gain by yearend.\n\nFrom an early 1921 low to a 1922 high, the Dow soared about 60% before declining in 1923.\n\nWhen Spanish Flu outbreaks occurred in 1918, WW I was raging in Europe until ending on the 11th hour of the 11th day of the 11th month of the year — conflict taking a devastating human toll of much greater concern at the time than financial markets.\n\nIn the US, supply chains operated normally, very much not the case now.\n\nA century ago, around half the US population was urban. Today it’s over 80%, heightening a greater risk of spreading infections without containment policies in place.\n\nThe Trump regime and Congress failed to act swiftly with wide-ranging public health and economic policies to help all Americans.\n\nAccording to US public health experts, universal/single-payer healthcare is the most effective and efficient way to deal with an infectious disease outbreak like COVID-19.\n\nThe US pay or die system is the worst way, and it shows by continued dickering, dithering, and prioritizing help for monied interests over public health and welfare.\n\n“It gives free money to corporations, ignores the health crisis, and does nothing to keep people working or help the unemployed.”\n\n“The labor movement will oppose this Main St. bailout of Wall St. with everything we have.”\n\nUnder the plan, America’s poor would get little to nothing, low-income households about half of what’s authorized for higher-income ones.\n\nA Dem party statement said it’s “not at all pro-worker and instead puts corporations way ahead of workers.” Some Republican senators oppose the scheme.\n\nIt’s a wealth transferring scheme at a time when it’s vital to put thousands of dollars in the pockets of ordinary Americans — the unemployed and newly laid off workers most of all.\n\nWarning of a severe recession, economist Nouriel Roubini called for fiscal pump-priming on the order of at least 3% of GDP.\n\nThat’s about $640 billion when multiples this amount is needed for ordinary Americans — not Wall Street that manufactured the dot.com and 2008-09 financial crisis.\n\nNor corporate favorites like Boeing, major airlines, and other businesses that used their cash flow for stock buybacks to elevate valuations to bubble levels and now ask for taxpayer bailout help.\n\nLike earlier financial and other crisis conditions in the US and elsewhere, this one will end.\n\nOrdinary people will be hardest hit, privileged ones benefitting like always before.\n\nCrises are opportunities for ruling authorities to institute policies not easily introduced during normal times.\n\nPost-9/11 and at other extraordinary times, the public is willfully deceived to believe that by sacrificing personal freedoms, greater security is possible — not realizing that both will be lost.\n\nThe price of liberty is eternal vigilance. The cost of its loss is tyranny — the US and West far advanced toward it’s becoming full-blown.\n\nProtecting public health to prevent COVID-19 from spreading by stay-at-home orders, state and community lockdowns, and social distancing reflect common sense policymaking.\n\nOverstepping occurs if martial law is declared and constitutional rights are suspended — what tyrannical police state rule is all about.\n\nPost-9/11, US hardline rule became reality by presidential executive orders, national and homeland security presidential directives, and enactment of police state laws — along with actions against designated domestic and foreign adversaries, dissent, civil liberties, human rights, and other democratic freedoms.\n\nState-sponsored indefinite detentions, assassinations, extraordinary renditions, military commission trials, torture, mass surveillance, and other extrajudicial actions were instituted and remain in place on the phony pretext of protecting national security at a time when America’s only enemies are invented.\n\nFor nearly two decades, the US has been waging war OF terrorism, not on it, at home and abroad — a bipartisan coup d’etat on world peace, equity, justice and the rule of law.\n\nPolice state measures were prepared in advance and on the shelf for rolling out in the aftermath of the 9/11 mother of all state-sponsored false flags.\n\nThe mother of all establishment media promoted Big Lies left most people unaware that what happened on that fateful day was all about advancing Washington’s imperium, along with cracking down on homeland freedoms.\n\nWill spreading COVID-19 outbreaks in the US be used as a pretext for further hardening of hardline police state rule, including suspension of vital habeas rights?\n\nAccording to Politico on Saturday, the Trump regime’s Justice Department “quietly asked Congress for the ability to ask chief judges to detain people indefinitely without trial during emergencies,” adding:\n\nDocuments seen by Politico “detail the (DOJ’s) requests to lawmakers on a host of topics, including the statute of limitations, asylum and the way court hearings are conducted.”\n\nThe Trump regime already closed the nation’s borders (except for commerce), imposed restrictions on international and domestic air travel, barred foreign nationals from entering the US who’ve been in China, Iran, and European countries recently, and suspended visa services at US embassies and consulates worldwide.\n\nAbout a fourth of the US population is locked down following orders by individual state governors, others highly likely to follow, perhaps the entire nation in the days and weeks ahead as COVID-19 outbreaks will likely continue to increase before abating.\n\nSome measures are justified to enhance public safety, others not.\n\nClearly no justification exists to order indefinite detentions arbitrarily under any circumstances.\n\nIf permitted or not, will martial law and suspension of the constitution follow?\n\nAccording to Politico, one of the documents it saw calls for Congress to empower the attorney general to circumvent judicial proceedings “whenever (a) district court is fully or partially closed by virtue of any natural disaster, civil disobedience, or other emergency situation.”\n\nThe authority would apply to “any statutes or rules of procedure otherwise affecting pre-arrest, post-arrest, pre-trial, trial, and post-trial procedures in criminal and juvenile proceedings and all civil process and proceedings.”\n\nNational Association of Criminal Defense Lawyers executive director Norman Reimer said if indefinite detentions without trial become the law of the land, habeas rights no longer will exist as long as the practice continues.\n\nAnyone for any reason, real or invented, “could be arrested and never brought before a judge until they decide that the emergency or the civil disobedience is over.”\n\n“I find it absolutely terrifying. Especially in a time of emergency, we should be very careful about granting new powers to the government.”\n\n“This is something that should never happen” anywhere!\n\nThe DOJ document also asked Congress to suspend “statute of limitations or criminal investigations and civil proceedings during national emergencies,” said Politico, adding:\n\nThe DOJ wants Federal Rules of Criminal Procedure “change(d) to expand the use of videoconference hearings, and to let some of those hearings happen without defendants’ consent, according to the draft legislative text.”\n\nAccording to Reimer, forced video hearing (without consent of the accused) would violate their civil liberties — “a terrible road to go down.”\n\n“We have a right to public trials. People have a right to be present in court” represented by counsel.\n\nTahirih Justice Center head Layli Miller-Munro said the DOJ request, if implemented, would block refugees and asylum seekers from entering the US — a way to keep unwanted people of the wrong race, creed, color, or nationality out of the country.\n\nMake no mistake. The DOJ document was likely prepared before or straightaway after the onset of COVID-19 outbreaks.\n\nThe 300-plus page USA Patriot Act was written before 9/11, readied to be considered by Congress, passed, and signed into law six weeks after the state-sponsored false flag.\n\nThe Trump regime will likely take full advantage of spreading COVID-19 outbreaks for hardened police state rule — instead of prioritizing public health and economic justice actions for ordinary Americans.\n\nThe greatest risk to remaining personal freedoms for ordinary Americans will be if martial law and suspension of the Constitution become the law of the land by executive order.\n\nPerhaps it’s coming if Congress and/or the courts don’t intervene to block it.\n\nWhile extraordinary times call for extraordinary actions, it’s vital to institute them lawfully to protect public health and welfare as top priority.", "opengraph": {"url": "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/", "type": "article", "title": "CV19: Pandemic Pandemonium, #FakeNews Vaccines, and State Quarantines In The US Empire (3 BIG QUESTIONS)", "description": "Publisher’s Note: First, consider minimizing your daily “news” consumption for a few weeks, as the MSM is doing little other than stoking public fears about COVID. Second, some wo…", "article:published_time": "2020-03-21T12:57:59+00:00", "article:modified_time": "2020-03-25T18:57:34+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2020/03/CNN-3.jpg", "image:width": "1938", "image:height": "2406", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1220", "height": "687", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"1220\" height=\"687\" src=\"https://www.youtube.com/embed/ohO8eAwi_po?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/ohO8eAwi_po?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "1220", "height": "687", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"1220\" height=\"687\" src=\"https://www.youtube.com/embed/Xaycvo79v6w?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/Xaycvo79v6w?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://www.livescience.com/amp/new-coronavirus-compare-with-flu.html", "https://klinghardtinstitute.com/wp-content/uploads/2020/03/Dr-Klinghardt-Corona-2020-slides-9-march-2020.pdf", "https://www.ft.com/content/5ff6469a-6dd8-11ea-89df-41bea055720b", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1082657/", "https://childrenshealthdefense.org/news/does-the-coronavirus-pandemic-serve-a-global-agenda/", "https://caitlinjohnstone.com/2020/03/22/hollywood-celebrities-are-psyops-wrapped-in-human-skin/", "https://www.rollingstone.com/politics/politics-news/doj-suspend-constitutional-rights-coronavirus-970935/", "https://biohackinfo.com/news-bill-gates-id2020-vaccine-implant-covid-19-digital-certificates/", "https://www.gatesnotes.com/Health/We-Are-Not-Ready-for-the-Next-Epidemic?ref=hvper.com", "https://www.nejm.org/doi/suppl/10.1056/NEJMp1502918/suppl_file/nejmp1502918_appendix.pdf", "https://www.gatesnotes.com/Health/Preparing-for-the-Next-Epidemic", "https://www.dailymail.co.uk/news/article-7951293/Bill-Gates-Predicted-Coronavirus-Like-Outbreak-2019-Netflix-Documentary.html", "https://www.centerforhealthsecurity.org/event201/players/gao.html", "https://www.globalresearch.ca/coronavirus-outbreak-global-public-health-emergency/5702060", "https://www.centerforhealthsecurity.org/event201/players/gao.html", "https://www.morningstar.com/news/marketwatch/20200312540/inovio-stock-rallies-after-company-gets-gates-foundation-grant-to-test-device-for-coronavirus-vaccine", "https://www.statnews.com/2020/03/11/researchers-rush-to-start-moderna-coronavirus-vaccine-trial-without-usual-animal-testing/", "https://investors.modernatx.com/news-releases/news-release-details/moderna-announces-funding-award-cepi-accelerate-development", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2015/03/CureVac-Collaboration", "https://www.reuters.com/article/us-health-coronavirus-germany-vaccine-idUSKBN21036D", "https://journal-neo.org/", "https://journal-neo.org/2020/03/18/coronavirus-and-the-gates-foundation/", "http://dot.com/", "https://www.politico.com/news/2020/03/21/doj-coronavirus-emergency-powers-140023", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/#print", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=email", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=twitter", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=facebook", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=reddit", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=linkedin", "https://vermontindependent.net/cv19-pandemic-pandemonium-and-quarantines-in-the-us-empire-2-big-questions/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2020-03-21T12:57:59+00:00"}