{"result_id": "310037", "URL": "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/", "timestamp": "2023-04-25 17:38:30 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "Vermonters For Vaccine Choice (MANDA’INJECTIONS)", "cleaned_text": "Publisher’s Note: Below is a fascinating 2020 exchange between The High Wire’s Del Bigtree and CBC Marketplace reporter Katie Pedersen re: the “debate,” such as it is, between so-called “pro and anti vaxxers.” We’ve watched with interest as the the public conversation around vaccines, parental consent, individual child exemptions, and public policy has become dramatically polarized. Whenever the subject of vaccines comes up, we always ask three questions to see if folks are up to speed with the history and current reality surrounding US vaccines. Answers below. 1) How many inoculations/jabs does the CDC recommend by age 18? 2) 2) How much money has the secret US “vaccine court” paid out in damages to citizens claiming to be victims of vaccines? 3) In what year did the US Congress pass a law protecting the vaccine industry/Big Pharma from legal liability and lawsuits? If you cannot easily answer these three questions, we suggest doing some more research on vaccines before coming to any conclusions about vaccines’ efficacy. And visit Vermonters for Vaccine Choice for independent information as it pertains to our Vermont children and families.\n• 2) More than $4 billion to date (not including lawyers’ fees.)\n• 1986, with the passage of the National Childhood Vaccine Injury Act\n\nOn New Year’s Eve, while spending time with my wife and family, I received an email from the Canadian Broadcasting Company. It was clear that they were planning some sort of hit piece about me and others in the Medical Freedom Movement on their show “Marketplace.” There are those that would say I should avoid inquiries like this. But I think there is no better way to ring in 2020 than a healthy dose of the truth. Here is my response, and their original email is below.\n\nThank you for your interest in my work. Though it is clear by your email that you are planning on conducting a program with a strong bias against me, your broadcast will still be seen by many intelligent people who will be made curious by your allegations and will in turn do their own research into me and my non-profit ICAN and our internet talk show, The HighWire. Because of this more people will be introduced to my logical and reasonable message about the inherent dangers in mandating vaccines, a product that is made by a pharmaceutical industry that has paid out billions in damages for having lied about safety, and is the only product this same industry makes that never established safety using the scientific method of a double blind placebo study and is protected from liability for death and injury. This will lead to a growth in our movement which stands for medical freedom and scientific transparency. So, I sincerely want to thank you ahead of time for helping to spread our important message.\n\nYou make several references in your email to “Experts” who refute the claims that I am making. I have a good understanding of the importance of medical and scientific experts. I won an Emmy award for my work celebrating doctors and medical experts as a producer on the CBS medical talk show, The Doctors. I have scrubbed in to the OR around a hundred times to film surgeries and life saving procedures. I have watched experts perform miracles before my eyes. I have also witnessed experts performing surgeries that were totally unnecessary and others that were done so poorly it was hard to imagine how they were allowed to practice. Shockingly, some of the least talented were held in highest esteem. This is why I believe journalism has to do more than just trust an expert and their opinion.\n\nI don’t have an issue with the fact that you will have experts whose opinion is that, as you wrote in your email “the rhetoric you use in your messaging manipulates consumers’ fears and plays on their cognitive biases”. I have an issue that I have not been invited to face your so-called experts and defend my integrity while also discussing their rhetoric which plays on consumer fears and cognitive biases. For example, when they take once trivial childhood illness like chicken pox or measles, which were subjects for sitcoms and laugh tracks in shows like The Brady Bunch before there was a vaccine, and they call these illnesses deadly even though less than a fraction of one percent died from these diseases before there was a vaccine, and they describe a handful of people who have a rash and fever for a few days as an Outbreak, it becomes clear why people around the world are trusting the medical establishment and mainstream media less and less. All debate of virtually every issue on this planet tends to have at least two sides. If you mean it when you say, “We are committed to fair and responsible journalism in all our reports”, why don’t you put the potential bias of editing and cherry picking aside and host a true debate between me and our experts in the Medical Freedom Movement, and your establishment experts? We’ll bring our peer reviewed science and they can bring theirs.\n\nIf you are not offering a live debate platform on this very important issue then you should be honest that you are really just planning on propagating a biased opinion. You have explained that you are going to have your experts refute the claims made on our website. I assume you mean the information in our white papers found here: https://www.icandecide.org/white-papers/\n\nSince all of the information in our white papers is supported by peer reviewed science that is provided in hyperlinks at the bottom of every page will you be asking your experts how they claim to refute this published science? Are you going to ask your experts to provide the peer reviewed studies and scientific data they say backs up their claims against our peer reviewed science? Are you going to thoroughly read and challenge their science? Are you going to let our side respond to the science that your experts provide to discuss potential problems with the study design or conclusions they make? It appears not. So we are left to assume that your broadcast will rely solely on the unsubstantiated opinions of your experts. And this is why you and I probably have a very different view of this issue and of journalistic integrity. In my experience I have learned to treat expert opinions as exactly that… opinions. Because of this I investigate everything that experts say and I read every study and paper that they reference. In a world where more and more science is coming into question and medical journals are admitting that a large body of published science cannot be repeated, I think it is imperative that journalism maintain a perspective of healthy skepticism.\n\nIn America journalism is referred to as the Fourth Estate. Our founding fathers cautioned that journalists should never just take the word of politicians or people in authority because history has shown us that human beings are fallible. No matter how high up the chain of command, humans make very big mistakes and sometimes outright lie. And for any journalist that finds refuge in consensus opinion, I must simply remind them that; Experts from the pharmaceutical industry, the CDC, FDA and virtually every doctor in the US said that Oxycontin was safe and non-habit forming, Experts claimed that VIOXX was safe until it paid out over 3 billion dollars in damages because the product caused heart attacks in upwards of 100,000 people, Experts told us that Johnson & Johnson baby powder should be sprinkled on baby’s bodies to keep them dry until the company was forced to pay billions because the product contains asbestos, and Experts at Monsanto, the FDA, EPA and virtually every agricultural department in the world said that Glyphosate was safe until people lined up by the thousands in court rooms with Non Hodgkin’s Lymphoma. You see, I have very little respect for journalists that take the opinions of experts as the sole requirement of their investigation into any matter. In fact, I hold journalists like that responsible for the millions who have died throughout the years from dangerous products because those innocent people could have been saved if a fearless journalist had investigated beyond the consensus of expert opinions and manufacturer’s assertions into the eye witness accounts by injured families and the actual science behind these products that were often sponsors for or advertised in the publications and programs we call news.\n\nIt is clear that you did not reach out to have a scientific discussion about vaccines. I doubt you will ask your experts how my non-profit, ICAN, has won and settled lawsuits against US government agencies NIH, HHS and FDA, when you or your experts believe in the potentially libelous claim that our information is somehow factually incorrect. Rather, it appears you are more interested in asking questions about what I and others like me in the Medical Freedom Movement get paid. Can I assume you are going to ask your medical experts in your broadcast what they get paid and who pays them? Are you going to discuss the hundreds of millions of dollars spent by pharma every year to lobby politicians, fund organizations like the World Health Organization and advertise and promote their products around the world? Probably not, because what is really important to you, in the face of worldwide corporate domination is the financing of a handful of grass roots organizations that are attempting to alert people that their basic human rights are being threatened by an admittedly corrupt industry. But since I have nothing to hide, I will answer this inane line of questioning. I do on occasion receive a speaking fee of 3,000 dollars. I usually get paid this fee when I am speaking at large events where I am often the keynote speaker in front of audiences as large as a thousand people or more. It appears that people really enjoy seeing me speak live which is why organizers who desire large audiences at their events are comfortable paying what I believe is a very reasonable fee. These fees from large events help to fund the greater part of my work which involves travelling state to state to speak and educate for free at events like the rally in New Jersey on 12/16/19 where I stood outside of the capitol for over ten hours in the freezing rain and snow with approximately a thousand mothers, fathers, children, and grandparents protesting the passing of S2173, which threatened to take away their right to make an important medical decision for their own children. On that day we were victorious. As another example, I was not paid to speak at the V.I.E. event in Washington DC, but rather spent over fifteen thousand dollars flying in my team and equipment to broadcast the event live on the internet so people around the world could experience the truth and passion of an amazing line up of experts who believe in our right to medical freedom.\n\nIn closing I would like to say that I recognize that you believe in what you are doing. I can assume you are a good person with a good heart. You believe you are protecting and saving children’s lives by producing broadcasts that attack people who hold my position that we have a God given right to body integrity which is supported by our constitutions and the Nuremberg Code which grants all free citizens, of democratic nations, the option to opt out of any medical procedure that they do not consent to. I assume your belief in the medical experts who you are reluctant to challenge has led you to vaccinating your own children if you have been so blessed to have them. Like you, I believe in the work that I am doing and the research I have conducted. I am so confident in my research that I have decided to not vaccinate either of my two children. Beyond all of the science that I have read I can say simply that every published study that has compared vaccinated children to completely unvaccinated children has revealed that the unvaccinated have much lower rates of chronic illness. Lifelong chronic illness is a far greater concern for me and my wife than short term childhood infections. It is clear that you have profound faith in institutions and expert opinions. It should be clear by now that I do not practice your religious faith in institutions and expert opinions and because of this I have spent over 3 years with a team of researchers, scientists and lawyers reading through every study ever referenced by the CDC and FDA regarding the safety of vaccines and we have come to the inconvenient truth that vaccines are not as safe as we have been promised. I will continue to use courtrooms, media, and every opportunity available to reveal the truth that we have found to the world. The nature of your email makes me think you believe I have some power to change people’s minds. But the truth is I don’t have any power, nor do I want any, it is the power of information and the peer reviewed science that we are providing to people that will inevitably become the truth that is recognized around the world. The Medical Freedom movement is rising like all of the great consciousness shifting movements that have come before us because the truth always prevails.\n\nGod Bless you and best of luck with your show.\n\nSincerely,\n\nDel Bigtree\n\nPS: While discussing scientific integrity and medical expert opinion I would really love to know what you and your medical experts have to say about this video from the CDC where the ACIP committee at the CDC approve a new Hepatitis B vaccine, Hepislav-B, with the knowledge that there were 14 heart attacks in the trial group and because of that this vaccine had been turned down 2 times by the FDA. Is this how settled science is conducted? It is clear by the questioning that they have knowingly turned innocent American citizens (and probably Canadians too) into a heart attack test group.\n\nHere is the link:\n\nHere is an article about the Heart Attack Issue with Hepislav B (there are many). Are you comfortable knowing that doctors know nothing about the heart attack issue but are now giving this to people with the belief that it is safe? Should it be illegal for me and my family to opt out of this vaccine when I have done my research and know that the FDA cardiologist writing this article believes the vaccine could have the potential to cause heart attacks? This is why the Nuremberg Code exists. And this is why I believe I am doing a service by reporting issues like this when the rest of mainstream media turns a blind eye.\n\n\n\nIs the new Dynavax hepatitis vaccine safe? I couldn’t tell — and I was advising the FDA\n\nBELOW IS THE ORIGINAL EMAIL FROM KATIE PEDERSON OF CBC MARKETPLACE:\n\nI am a journalist with CBC News: Marketplace, a national consumer affairs program with Canada’s public broadcaster.\n\nOur team is working on a story about vaccine hesitancy and recently attended the V.I.E. Event in Washington, DC as part of our research.\n\nWhile at the VIP event on the evening of November 14, we documented a conversation that took place between one of our journalists and yourself, when you indicated that you are paid to speak at events related to vaccines.\n\nThat evening, our journalist Asha Tomlinson interviewed you about claims made by the anti-vaccination community. Since that conversation, we have learned that you have many speaking engagements and charge at least $3,000 in fees to the Informed Consent Action Network for a speaking engagements.\n\nWe plan to report what we’ve learned at the event, and since, in an upcoming broadcast on Marketplace. We also plan to report on some of the vaccine-related content you have published on your facebook page, and consult with experts who tell us the rhetoric you use in your messaging manipulates consumers’ fears and plays on their cognitive biases.\n\nOver the course of our research, we have spoken with many leaders in the anti-vaccination movement and consulted with scientists, medical doctors, researchers and vaccinologists about the issue of vaccine hesitancy in Canada and around the world. The broadcast is not about yourself specifically, but rather, a broader documentary about vaccine hesitancy.\n\nNow in our 47th season, Marketplace is broadcast across Canada and is one of the longest-running current affairs programs in the country. We are committed to fair and responsible journalism in all our reports.\n\nWe would like to provide you the opportunity to respond to our findings. Our report will be one of our first episodes after the holidays, so we sincerely hope you can provide us with a statement by Tuesday, January 7.\n\nIf you have any questions, you can reach me on the phone at 416-205-2799 or via email at katie.pedersen@cbc.ca. Thank you in advance for your response", "opengraph": {"url": "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/", "type": "article", "title": "Vermonters For Vaccine Choice (MANDA’INJECTIONS)", "description": "Publisher’s Note: Below is a fascinating 2020 exchange between The High Wire’s Del Bigtree and CBC Marketplace reporter Katie Pedersen re: the “debate,” such as it is, betwe…", "article:published_time": "2020-01-08T14:23:02+00:00", "article:modified_time": "2020-01-08T14:23:10+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2020/01/CBC_MARKETPLACE_THUMBNAIL.jpg", "image:width": "1920", "image:height": "1080", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe loading=\"lazy\" width=\"1200\" height=\"675\" src=\"https://www.youtube.com/embed/FyHcaiActqY?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\" allowfullscreen=\"true\"/>", "src": "https://www.youtube.com/embed/FyHcaiActqY?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"}], "links": ["https://thehighwire.com/del-bigtree-reveals-all-to-pro-vax-reporter", "http://www.vaxchoicevt.com/about-us/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://en.wikipedia.org/wiki/National_Childhood_Vaccine_Injury_Act", "https://www.icandecide.org/white-papers/", "https://www.statnews.com/2017/08/04/dynavax-hepatitis-vaccine/", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/#print", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=email", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=twitter", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=facebook", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=reddit", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=linkedin", "https://vermontindependent.net/vermonters-for-vaccine-choice-mandainjections/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2020-01-08T14:23:02+00:00"}