{"result_id": "310015", "URL": "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/", "timestamp": "2023-04-25 17:37:38 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "The “Global Health Mafia Protection Racket” (OPEN THE GATES)", "cleaned_text": "Publisher’s Note: As Vermont slowly begins to “open” after lockdown, Independent analyst Stephen Lendman ‘s provides analysis of the WHO’sters emerging alliance with the imperial DC Beltway Trumpsters, accompanied by long-standing collusion from the US “news” media, including FOX to the New York Times. One thing that EVERY US corporate commercial news network seems to agree on is that Bill Gates’ dangerous vision and audacious global goals should NOT be questioned. Case in point: Bill Gates on the front page of a May 2020 Wall Street Journal feature story entitled “Bill Gates Has Regrets” saying “I feel terrible” because he didn’t do enough to “warn global leaders” of the COVID-19 pandemic, we are DEEP into the PsyOps weeds. It would be funny it it weren’t so deadly serious. “Amazing Polly,” meanwhile, calls Gates, Fauci, and the DC/WHOster crowd a “Global Health Mafia Protection Racket” and helpfully connects the historical and organizational dots to make her case. Worth a watch – below.\n\nIn cahoots with Big Pharma profiteers, Trump is the nation’s mass vaxxing huckster-in-chief.\n\nHe, his regime, the industry, and establishment media press agents are ramping up a campaign to convince Americans to be vaxxed with poorly tested, unsafe, rushed to market, hazardous to human health COVID-19 vaccines when available.\n\nOn FOX News, Trump said the following:\n\n“We’re mobilizing our military and other forces…on the basis that we do have a vaccine.”\n\n“Our military is now being mobilized so at the end of the year we’re going to be able to give it to a lot of people very, very rapidly.”\n\nDoes he intend signing an executive order mandating it?\n\nIf so, it’ll be the equivalent of waging biological warfare wherever mass vaxxing occurs.\n\nInstead of protecting against COVID-19 infections, it could cause a far greater epidemic outbreak than already — with withspread deadly consequences.\n\nWill Americans agree to be guinea pigs for what could be largest-ever public health experiment with potentially disastrous consequences for countless millions of people?\n\nVaccines are known to be hazardous to human health even when great care is taken to develop them according to established protocol.\n\nIt takes years. Yet Trump wants one or more COVID-19 vaccines ready for mass vaxxing by yearend or early 2021 — assuring that whatever is promoted and used will be extremely hazardous and crucial to avoid.\n\nThe Mayo Clinic explained challenges in vaccine development under more normal circumstances, saying:\n\nStressing the need for thorough testing, Mayo failed to explain that a rushed to market COVID-19 vaccine will get scant testing, making what’s developed a major health hazard.\n\nThe elderly with weakened immune systems are most vulnerable to COVID-19 infection.\n\nMayo: “People older than age 50 are at higher risk of severe COVID-19. But older people usually don’t respond to vaccines as well as younger people.”\n\nCountless numbers of elderly getting vaxxed may hasten their deaths, besides getting no protection from the coronavirus, just a sooner, perhaps more painful, end of life.\n\nMayo: “After infection with coronaviruses, re-infection with the same virus…is possible after a period of months or years.”\n\nGetting vaxxed may increase the possibility.\n\nAccording to Mayo, some approaches to current vaccine development “are still quite new,” making them potentially more hazardous to human health, especially for people with weakened immune systems.\n\n“(D)evelopment of vaccines can take years,” Mayo explained, especially when using “ new technologies that haven’t been tested for safety or adapted to allow for mass production.”\n\nWhy so long? New vaccines are first tested on animals. The process takes up to six months.\n\nHuman clinical trials follow in three phases. The process can continue for two or three years.\n\nIf approved for human inoculations, months more are needed for mass production.\n\nThe notion of Pentagon forces involved in mass vaxxing should terrify everyone.\n\nWill they forcibly enter residences of vax resisters and inject them against their will?\n\nWill near-genocide of the nation’s elderly and others with weakened immune systems follow?\n\nRest assured, Trump, regime hardliners, their congressional counterparts, Supreme Court justices, Big Pharma executives, other corporate America officials, and Pentagon commanders won’t permit anyone to vax them with substances they know are harmful to human health.\n\nThe New York Times is part of the deceptive mass vaxxing campaign.\n\nInstead of warning about vaccine hazards, especially under-tested, extremely dangerous COVID-19 vaccines being developed, the Times slammed scientists and concerned individuals sounding the alarm, saying:\n\nThey’re “spreading baseless lies and debunked nonsense about the coronavirus to millions of Americans overnight,” the Times roared — a bald-faced whopper by the self-styled newspaper of record establishment mouthpiece that long ago abandoned journalism for state-approved propaganda.\n\nThe Times defied reality adding that a COVID-19 vaccine will be “a lifesaving, economy-rescuing miracle” when available.\n\nIt’ll be a disease producer and/or premature death sentence for countless numbers of people getting vaxxed.\n\nIn promoting hazardous to human health vaccines, the Times is operating as a Big Pharma press agent.\n\nIts management likely won’t go anywhere near what the broadsheet promotes.\n\nNor will their counterparts throughout the pro-vax establishment media community.", "opengraph": {"url": "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/", "type": "article", "title": "The “Global Health Mafia Protection Racket” (OPEN THE GATES)", "description": "Publisher’s Note: As Vermont slowly begins to “open” after lockdown, Independent analyst Stephen Lendman ‘s provides analysis of the WHO’sters emerging alliance with t…", "article:published_time": "2020-05-15T19:53:39+00:00", "article:modified_time": "2020-05-15T19:53:47+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2020/05/VI-CV-Gates.png", "image:width": "2526", "image:height": "1364", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1220", "height": "687", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"1220\" height=\"687\" src=\"https://www.youtube.com/embed/1Z5VYqJqrtI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/1Z5VYqJqrtI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/#print", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=email", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=twitter", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=facebook", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=reddit", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=linkedin", "https://vermontindependent.net/the-global-health-mafia-protection-racket-open-the-gates/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2020-05-15T19:53:39+00:00"}