{"result_id": "310002", "URL": "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/", "timestamp": "2023-04-25 17:37:11 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "“What I Know and Don’t Know about SARS-CoV-2 Virus” (GUEST ESSAY: EDWARD CURTIN)", "cleaned_text": "Publisher’s Note: Here at Vermont Independent, we rarely cross-post an article from another blog in its entirety, but Edward Curtin’s new assessment of our COVID-19 civilizational moment is perhaps one of the better overall summaries of our Human Situation to date. We’ve reprinted Edward Curtin’s whole essay below, in the event that it gets scrubbed / removed elsewhere.\n\nEpistemologically speaking, we independent researchers have learned MUCH over the past 16 months – about US and Global political power, about media storytelling, about true science/the scientific method versus Scientism, about US public health and its corruption, and of course, about human nature (broadly defined). Curtin puts together what HE knows and does NOT know about our COVIDtastrophe quite elegantly here. Please consider visiting his site, signing up, for his e-newsletter and supporting his invaluable work. Thanks to fellow Vermonters for sending over this inspired and important essay. Courage, Team Human!\n\nAfter fifteen months of assiduous reading, study, observation, and research, I have come to some conclusions about what is called COVID-19. I would like to emphasize that I have done this work obsessively since it seemed so important. I have consulted information and arguments across all media, corporate and alternative, academic, medical, books, etc. I have consulted with researchers around the world. I have read the websites of the CDC, the World Health Organization, and government and non-government health organizations. In other words, I have left no stone unturned, despite the overt or covert political leanings of the sources. I have done this as a sociologist and writer, not as a medical doctor, although many of my sources have been medical doctors and medical studies.\n\nMy succinct conclusions follow without links to sources since I am not trying to persuade anyone of anything but just stating for the public record what I have concluded. Life is short. I am going to say it now.\n• \n• I know that vast numbers of people have been hypnotized by fear, threats, and bribes to accept the corporate mainstream media’s version of COVID-19. I have concluded that many millions are moving in a trance state and do not know this. They have been induced into this state by a well-organized, very sophisticated propaganda campaign that has drawn on the human fear of death and disease. Those behind this have no doubt studied the high incidence of hypochondriasis in the general population and the fear of an invisible “virus” in societies where belief in God and the spiritual invisible has been replaced by faith in science. Knowing their audience well, they have concocted a campaign of fear and confusion to induce obedience.\n• I do not know but suspect that those who have been so hypnotized tend to be mainly members of the middle to the upper classes, those who have invested so much belief in the system. This includes the highly schooled.\n• I know that to lockdown hundreds of millions of healthy people, to insist they wear useless masks, to tell them to avoid human contacts, to destroy the economic lives of regular people have created vast suffering that was meant to teach people a lesson about who was in control and that they better revise their understanding of human relations to adjust to the new digital unreality that the producers of this masquerade are trying to put in place of flesh and blood, face to face human reality.\n• I know that the PCR test invented by Kary Mullis cannot test for the alleged virus or any virus and therefore all the numbers of cases and deaths are based on nothing. They are conjured out of thin air in a massive act of magic. I know that the belief that it can so test began with the unscientific PCR Corona protocol created by Christian Drosten in Germany in January 2020 that became the standard method for testing for SARS-CoV-2 worldwide. I am sure this was preplanned and part of a high-level conspiracy. This protocol set the cycle threshold (amplification) at 45 which could only result in false positive results. These were then called cases: An act of fraud on a massive scale.\n• I do not know if the alleged virus has ever been isolated in the sense of being purified or detached from everything else aside from being cultured in a lab. Therefore I do not know if the virus exists.\n• I know that the experimental mRNA “vaccines” that are being pushed on everyone are not traditional vaccines but dangerous experiments whose long-term consequences are unknown. And I know that Moderna says its messenger RNA (mRNA) non-vaccine “vaccine” functions “like an operating system on a computer” and that Dr. Robert Malone, inventor of mRNA vaccine technology, says that the lipid nanoparticles from the injections travel throughout the body and settle in large quantities in multiple organs where the spike protein, being biologically active, can cause massive damage and that the FDA has known this. Additionally, I know that tens of thousands of people have suffered adverse effects from these injections and many thousands have died from them and that these figures are greatly underestimated due to the reporting systems. I know that with this number of casualties in the past these experimental shots would have been stopped long ago or never started. That they have not, therefore, convinces me that a radically evil agenda is under way whose goal is harm not health because those in charge know what I know and much more.\n• I do not know where this alleged virus originated, if it exists.\n• I know that from the start of this crisis, there was a concerted effort across the world to deny access to proven effective treatments such as hydroxychloroquine, steroids, ivermectin in a planned effort to vaccinate as many people as possible. This alone reveals an agenda centered not on health but on getting as many people as possible to submit to being vaccinated and controlled. Social control is the name of this deadly game.\n• I know that those pushing these vaccines – The World Economic Forum, the World Health Organization, the Gates Foundation, the Rockefeller Foundation, etc. – have a long history of wanting to drastically reduce the world’s population and that their promotion of eugenics under various names is very well known. I am convinced that the totally untested mRNA-type “gene therapy” is the key to their plan for population reduction.\n• I do not know if they will succeed.\n• I know they must be resisted.\n• I do not know why so many good people cannot see through this evil. I can only attribute it to having been seduced by a massive hypnotic propaganda campaign that has appealed to their deepest fears and will result in those fears being realized because they thought they were free. It is a great tragedy.\n• I know that all the statistics about cases and deaths “from” COVID-19 have been manipulated to create a fake pandemic. One of the most obvious proofs of this is the alleged disappearance of the flu and deaths from influenza. Only someone in a trance could fail to understand the absurd logic in the argument that this was the result of mask wearing when at the same time the air-born COVID-19 spread like wildfire until that stopped precipitously in January 2021 when a tiny number of people had been vaccinated.\n• I know there has been barely any excess mortality throughout all this.\n• I do not know where it will all end but hope against hope the growing opposition to this fraud will grow and defeat it despite the organized censorship that is underway against dissenting opinions. I know that when organized censorship on this scale takes place those behind it are afraid of the revelation of the truth. A simple understanding of history confirms this.\n• I know that the temporary reprieve the authorities have granted to their subjects will be followed by further restrictions on fundamental freedoms, the corona virus lockdowns will likely return, “vaccine” boosters will be promoted, and the World Economic Forum’s push for a Great Reset with a Fourth Industrial Revolution will lead to the marriage of artificial intelligence, cyborgs, digital technology, and biology with the USA and other countries continuing to slip into a new form of fascist control unless people across the world stand up and resist in great numbers. I am heartened by signs that this resistance is growing.\n• Finally, I know if the authoritarian forces win the immediate battle, someone will write a book with a title like that of Milton Mayer’s classic, They Thought They Were Free. It will be censored. Perhaps it will first be shared via samizdat. But in the end, after much suffering and death, the truth about this evil agenda will prevail and there will be much weeping and gnashing of teeth.\n• We are in a spiritual war for the soul of the world.", "opengraph": {"url": "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/", "type": "article", "title": "“What I Know and Don’t Know about SARS-CoV-2 Virus” (GUEST ESSAY: EDWARD CURTIN)", "description": "Publisher’s Note: Here at Vermont Independent, we rarely cross-post an article from another blog in its entirety, but Edward Curtin’s new assessment of our COVID-19 civilizational momen…", "article:published_time": "2021-06-20T16:35:32+00:00", "article:modified_time": "2021-06-20T16:35:32+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/06/Screen-Shot-2021-06-20-at-12.26.49-PM-690x302.png", "image:width": "690", "image:height": "302", "locale": "en_US"}, "tags": ["Team Human", "COVID", "SARS CoV 2"], "tweets": [], "movies": [], "links": ["http://edwardcurtin.com/what-i-know-and-dont-know-about-sars-cov-2-virus/", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/#print", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=email", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=twitter", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=facebook", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=reddit", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=linkedin", "https://vermontindependent.net/what-i-know-and-dont-know-about-sars-cov-2-virus-guest-essay-edward-curtin/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2021-06-20T16:35:32+00:00"}