{"result_id": "310013", "URL": "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/", "timestamp": "2023-04-25 17:37:35 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "German Lawyer Reiner Fuellmich On Challenging The 3 Ps Of The “Davos Clique” (POWER, PROFIT, POPULATION CONTROL)", "cleaned_text": "Publisher’s Note: Thanks to a number of Vermont colleagues for sending over new interviews – May 2022 is latest – with German lawyer Reiner Fuellmich. See embedded interview here. We have the legal evidence to prosecute the COVIDtopians. Unchain the lawyers, the courts, and restore #TeamHuman.\n\n“This is about the Sovereignty of the Individual,” states journalist Claire Dooley.\n\nThanks for reading, sharing, and supporting Vermont Independent’s work through our Patreon page.\n\nThe German lawyer Reiner Fuellmich (1958) has had a long career in which he has conducted controversial lawsuits against Volkswagen, for example. A respectable number of books and research reports are to his name. Fuellmich has focused on investigating the facts surrounding the corona crisis from April 2020. Together with a team of specialists, he has had a large number of investigations that have brought him to the point where he can determine that he and his team have evidence of the true facts.\n\nFuellmich was recently interviewed by Jerm Warfare. The most interesting parts of this interview are on a video that takes 20 minutes of your time.\n\nFuellmich calls the events of the past year the worst crime ever committed against humanity. It is not about a virus, nor is it about health. The point is to take everything away from us, making us totally dependent on what he calls the “Davos clique.” They want to reduce the world’s population and have complete control over the remaining humanity.\n\nAll measures, all methods, that are used do not rest on a solid scientific basis. Fuellmich speaks in this regard about the Corman-Drosten paper, which forms the basis for WHO policy. Scientifically speaking, the PCR test protocol is also a mess. The test is designed in such a way that it generates as many positive outcomes as possible. The sole goal is to make vaccination readiness as high as possible. That vaccine is not a vaccine, but an instrument to induce genetic changes.\n\nThe cleaning process that will inevitably come could take years. On the positive side, however, we are approaching the tipping point at which the Davos cabal will have to answer to humanity. A major reason for this is that they pile up one mistake after another, causing even the most loyal of people to question. For example, the large amount of side effects resulting from the injections. Part of humanity has woken up and they want to anticipate the consequences. The plan was originally planned to be implemented in 2050, but under pressure from global awareness, it has been brought forward to 2030 and then to 2020. Hasty speed leads to mistakes.\n\nFuellmich is relaxed and full of smiles in this interview because he has the peace of mind of someone who knows how the story works and has the powerful evidence for it. He thinks a global tribunal is needed because the scale of the events is so vast and complicated that it is beyond the competence of national judges. Fuellmich and his team are working towards what they call Nurnberg-2.\n\nWho are “they”, who is the Davos cabal? It’s about three thousand people, no more, who want to completely control the rest of humanity. It is not about money for them. The three thousand have so much power that they derive the power from which they exert influence. They bribe people in the medical sector, in business, politics, large institutions, etc. to do what they want. If money doesn’t work, blackmail or even threats. The Davos clique also uses methods to apply massive behavioral influence. They steal taxpayers’ money from citizens around the world. Not to get richer from it, but to make and keep the world’s population dependent on them. To keep us calm there is The cleaning process that will inevitably come could take years. On the positive side, however, we are approaching the tipping point at which the Davos cabal will have to answer to humanity. A major reason for this is that they pile up one mistake after another, causing even the most loyal of people to question. For example, the large amount of side effects resulting from the injections.\n\nFor the full hour long video called Reiner Fuellmich on suing the WHO for “crimes against humanity” go to:", "opengraph": {"url": "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/", "type": "article", "title": "German Lawyer Reiner Fuellmich On Challenging The 3 Ps Of The “Davos Clique” (POWER, PROFIT, POPULATION CONTROL)", "description": "Publisher’s Note: Thanks to a number of Vermont colleagues for sending over new interviews – May 2022 is latest – with German lawyer Reiner Fuellmich. See embedded interview here.…", "article:published_time": "2022-05-14T11:33:09+00:00", "article:modified_time": "2022-05-15T18:50:37+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/04/Screen-Shot-2021-04-21-at-7.29.55-AM-690x501.png", "image:width": "690", "image:height": "501", "locale": "en_US"}, "tags": ["COZviD", "Power", "Reiner Fuellmich", "Population Control", "Coronavirus", "COVID'topia", "Davos Clique", "Profit"], "tweets": [], "movies": [], "links": ["https://live.childrenshealthdefense.org/shows/chdtv-exclusive-interviews/lBFT1rJz9v", "https://prepareforchange.net/2021/04/17/reiner-fuellmich-we-have-the-evidence/", "https://www.patreon.com/vermontindependent?fan_landing=true", "https://jermwarfare.com/blog/reiner-fuellmich-who", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/#print", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=email", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=twitter", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=facebook", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=reddit", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=linkedin", "https://vermontindependent.net/german-lawyer-reiner-fuellmich-on-challenging-the-3-ps-of-the-davos-clique-power-profit-population-control/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2022-05-14T11:33:09+00:00"}