{"result_id": "310006", "URL": "https://vermontindependent.net/challenging-vermont-governor-phil-scott-vaccines-for-travel-proclamation-health-freedom/", "timestamp": "2023-04-25 17:37:22 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/challenging-vermont-governor-phil-scott-vaccines-for-travel-proclamation-health-freedom/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "Challenging Vermont Governor Phil Scott’s “vaccines for travel” proclamation (HEALTH FREEDOM, INFORMED CONSENT, AND THE NUREMBERG CODE)", "cleaned_text": "Publisher’s Note: Vital for all Vermonters to speak up now. Thanks to Health Choice Vermont for keeping us apprised. And here’s Fred at UnHerd TV featuring an intelligent debate about “vaccine passports.”\n\nVermont Gov. Phil Scott has announced that vaccinated persons shall be free to travel in/out of VT, without government quarantine restrictions. He and his cabinet have been recently elaborating on how un-vaccinated persons should be treated differently – and how vaccinated persons do not need to be tested, or quarantined.\n\nGovernor Scott’s extended emergency, and his orders, are being followed without question. Without further thought, school boards and nurses are now implementing procedures that openly discriminate against families who are not vaccinated with the research-use-only injections. See above.\n\nThis is despite the fact that World Health Organization (WHO) spokeswoman Margaret Harris has said the world health agency does not back the use of these passports — proof that one has been vaccinated against COVID-19 — because it is not yet known if those who have been vaccinated against the virus can still transmit it. (Reuters, April 6)\n\nNo vaccine for COVID19 is FDA approved, yet people in VT are being pushed hard to join the experiment. Even our children are being told in their school newsletters to take the shot “when it’s your turn.” Tragically, we are now witnessing full-on medical coercion.\n\nThe following is a preliminary statement of response.\n\nAn honest assessment of your proposals, and the evidence buttressing it, deserves careful, open scrutiny. Thus far, this appears to be sorely lacking. We the people have the right to have a say in our own destiny. There are plenty of data and science which do not support your current policies. For example – please consider the following brief information as supplementary evidence (“the data and the science”), as points for you to consider:\n\nOne area where we should find common ground is:\n• That the voluntary consent of the individual in medicine (emergency or no), is paramount.\n• That preservation of our rights to hold conscientious, religious and personal beliefs (which may be opposed to immunization) is truly important in a free society.\n• That persons should never be coerced into undertaking a medical procedure.\n\nMr. Governor, once you consider the attachments in this briefing document, we hope you and your team of honest individuals will come to realize that your plan to allow only those fully vaccinated to travel without quarantine is egregious and wrong. Is this a free society?\n\nPlease consider that:\n• Any general requirement of proof of “vaccines for travel” imposes unequal burdens on un-vaccinated travelers. Even if not an absolute requirement, imposing extra costs like quarantines for refusing the vaccine is obviously a way of coercing people into undertaking the procedure, which could permanently alter immune function.\n• A “vaccines for travel” policy automatically creates a two-tier society, divided into the vaccinated, who could travel freely, & the un-vaccinated – whose freedoms are infringed upon because they did not medicate. Think about what that means for social and legal equality and the future and stability of an avowedly democratic society. What will be required next?\n• To say that only those who are vaccinated may travel and congregate implies that those who are not vaccinated are somehow infectious which is not true. It also implies that the vaccinated are somehow protected from infection, which is also not true. Social distancing and masking is simply to put pressure on people – to discriminate so that they comply. Even if your advisors consider this to be “legal,” the approach is egregiously wrong.\n• Your coercive policy is unethical, not based in sound science, and violates the medical ethical doctrine of informed consent – in which a patient has the right to accept or decline – without being coerced. There is long history on this matter, beginning with the Nuremberg Trials.\n• As recently revealed, your policies are premised on the erroneous assumption that “public health” requires total vaccination of a population. Public health is only as good as the health of each individual. Immunity is not even well understood with the virus, and not established yet for the vaccine. Under normal circumstances, so called “herd immunity thresholds” can normally be reached through a mix of pre-existing, naturally acquired, & vaccine-based immunity. There is absolutely no need for universal vaccination – especially if many have already recovered.\n• Medicating all people, with experimental products, is reckless. From December 14, 2020 through March 1, 2021 the US Government received 1,381 reports of death among people who received a COVID-19 vaccine. While these deaths may be considered completely coincidental and unrelated by those in charge of safety, no person should be coerced into undertaking even a perceived medical risk. Informed consent is clear.\n• Vaccine passports are not just about Covid-19: they are about introducing global health surveillance and coercive medical interventions, beginning with this vaccine – and ending with… “freedom”? Most people would disagree with your new definition of the word.\n• Doctor/healer advice which must be based upon trust, becomes a doctor order and a command without trust or respect for each human’s sovereign rights when you order that all persons take the shot. There are many pathways to health, and Vermont used to #1 in terms of health – with a wide range of choices – many natural ones. Yet natural health choices and alternatives (such as dietary supplementation, homeopathy, and religious practices) are being simultaneously threatened by regulations when there is nothing more personal or private than how one cares for their body. Your office would do well not to encourage such practices. True health does not arrive via a needle.\n• Privacy violations continue to pile up, with public announcements and tracking of one’s immune status, testing status, health, medical and religious beliefs. Your office would do well in protecting privacy.\n• If you have scientific grounds for placing your faith in these vaccines, you should be perfectly able to convince people – especially those most at risk – to take them through rational persuasion rather than by coercion and incentives.\n• Coerced vaccinations will only raise more heightened consumer concerns.\n• A world in which the government (no longer of the people, by the people, for the people) closely monitors citizens’ healthcare choices and effectively bans healthy citizens from full social participation because they weigh the risks of a vaccine differently or decline a proposed course of treatment is cruel, intolerant, unconstitutional and should be illegal.\n• Emergency orders and all health measures must respect the voluntary consent of the human being. Powers should be of limited duration, for exceptional circumstances and use the least intrusive, least restrictive means.\n• Warnings and risks – especially with experimental genetic technology – must be taken into account.\n• Reported vaccine injuries must be taken seriously, and where there is medical risk, there must be voluntary consent without coercion.\n\nThe medical coercion being proposed by your office, is a clear and compelling reason why the Vermont Legislature must immediately pass H.283.\n\nThat anyone would so unabashedly promote vaccines that have been fast-tracked and released under emergency use only (not FDA approved) is cause for great concern.\n\nThank you for your attention and we urge you to reconsider. It is not too late to stand up as an American, and to speak out for freedom.", "opengraph": {"url": "https://vermontindependent.net/challenging-vermont-governor-phil-scott-vaccines-for-travel-proclamation-health-freedom/", "type": "article", "title": "Challenging Vermont Governor Phil Scott’s “vaccines for travel” proclamation (HEALTH FREEDOM, INFORMED CONSENT, AND THE NUREMBERG CODE)", "description": "    Publisher’s Note: Vital for all Vermonters to speak up now. Thanks to Health Choice Vermont for keeping us apprised. And here’s Fred at UnHerd TV featuring an intelligent …", "article:published_time": "2021-04-09T13:33:58+00:00", "article:modified_time": "2021-04-17T13:56:38+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/04/VI-Nuremberg.jpg", "image:width": "638", "image:height": "479", "locale": "en_US"}, "tags": ["corona virus", "COVID", "Vermont", "VT", "Governor Scott"], "tweets": [], "movies": [], "links": ["https://www.healthchoicevt.com/preliminary-statement-of-response-to-gov-phil-scott-vaccines-for-travel-proclamation/", "https://youtu.be/NVYHn1LICgk", "https://i0.wp.com/www.healthchoicevt.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-09-at-12.16.28-AM.png?ssl=1", "https://governor.vermont.gov/press-release/governor-phil-scott-announces-new-covid-19-travel-and-gathering-guidance", "https://www.reuters.com/article/us-health-coronavirus-who-vaccines/who-does-not-back-vaccination-passports-for-now-spokeswoman-idUSKBN2BT158", "https://www.healthchoicevt.com/wp-content/uploads/2021/02/Fact-Sheet-COVID19-Public-Health-Counter-Measures-Immune-from-Liability.pdf", "https://www.healthchoicevt.com/wp-content/uploads/2021/02/FACT-SHEET-Vaccine-Safety-Top-Concern-Consumers-Before-Covid19-_Feb2021_.pdf", "https://www.healthchoicevt.com/wp-content/uploads/2021/03/Vaccine-Safety-Concerns-%E2%80%93-Talking-Points-Overview-2021.pdf", "https://www.healthchoicevt.com/wp-content/uploads/2021/03/Covid19-vaccine-Stats-on-refusal_Feb-2021.pdf", "https://www.healthchoicevt.com/wp-content/uploads/2021/02/Concerns-About-Isolation-Quarantine-of-Healthy-Individuals-1.pdf", "https://ahrp.org/the-significance-of-the-nuremberg-code/", "http://Source: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://legislature.vermont.gov/bill/status/2022/H.283"], "authors": ["2ndvtrepublic"], "publish_date": "2021-04-09T13:33:58+00:00"}