{"result_id": "310030", "URL": "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/", "timestamp": "2023-04-25 17:38:10 CEST+0200", "meta": {"description": "Resistance and Resilience", "lang": "en", "keywords": "", "favicon": "https://vermontindependent.net/wp-content/uploads/2018/04/favicon.ico", "canonical": "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "vermontindependent.net", "title": "An Open Letter To Our Vermont Representatives (H. 283 – CHALLENGING VIRAL TYRANNY – CONTACT YOUR REPS!)", "cleaned_text": "Publisher’s Note: We sent this open letter to all of our Vermont elected representatives this evening. Follow Larry’s lead here and share with your Vermont lawmakers. End Viral Tyranny now here in the Green Mountains!\n\nDr. Rob Williams in the town of Waitsfield, Vermont’s Mad River Valley, here.\n\n\n\nLet me get right to the point – Governor Scott has exhausted his constitutional, legal or medical authority to impose COVID protocols on our Vermont citizenry. I respectfully call on you to consider 1) immediately challenging Governor Scott’s Executive overreach via legislative action, and 2) enthusiastically supporting Vermont’s Health and Medical Freedom Act, for reasons I outline below.\n\n\n\nHere is a link to the bill: https://legislature.vermont.gov/Documents/2022/Docs/BILLS/H-0283/H-0283%20As%20Introduced.pdf\n\n\n\nTo be clear – individual Vermonters can prevent exposure to any diseases of concern by voluntarily staying at home, wearing a mask if they choose, physically distancing if they choose, not patronizing places of business if they choose, limiting their time in public settings if they choose, and taking a “vaccine” or any other medical intervention or prophylactic procedure if they chose.\n\n\n\nHowever – top down medical mandates such as those WHO-recommended policy protocols adopted last March 2020 by Vermont’s Governor , Dr. Mark Levine, and public health leaders – masks, distancing, lockdowns, etc – fail to account for each Vermonter’s own individual health and wellness realities. The efficacy of these WHO recommended measures, as well, have been called into question for many many months now by tens of thousands of medical professionals from around the world in documents such as the Great Barrington Declaration, available here: https://gbdeclaration.org\n\n\n\nGovernor Scott’s latest egregious action – using newly-announced “vaccine” mandates to restrict Vermonters’ freedom of association, movement, affiliation and usurp our decisions about our personal well being and potential professional employment – smacks of Viral Tyranny and must be countered by legislative action by our elected representatives. Immediately. \n\n\n\nWe Vermonters, I hope we can all agree, have a sovereign right to determine our own unique health and wellness “destiny” with regard to daily decisions we make about our individual health – our minds, our bodies, our spirits, and our well-being.\n\n\n\nTo wit: we now have a year of scientific data on our evolving COVID situation.\n\nFive data points – all referenced with links at www.vermontindependent.net. \n\n\n\n1) The WHO reports that 99.96% of all humans who have contracted this virus are recovering or have recovered with no long term negative effects. \n\n\n\n2) Veteran New York Times journalist Alex Berenson notes that this represents 999 of 1,000 humans, statistically speaking.\n\n\n\n3) As of this week, we have lost 191 Vermonters to the virus or “complications from the virus” this past year: meaning our most vulnerable populations – the advanced elderly, those with (on average) 3.8 co-morbidities (see CDC’s web site), etc – that bring about death WITH COVID, not death FROM COVID. \n\n\n\n4) To put this 191 death rate number in perspective, Vermont loses, on average, 1,000 Vermonters annually due to tobacco-related illnesses. Every year. 1,000. Give or take.\n\n\n\n5) The untold consequences to our state – in terms of un(der)employment, economic collapse, depression, anxiety, unpaid bills, housing displacement, alcoholism, suicide, family rifts, delayed medical procedures, etc etc – are incalculable.\n\n\n\nGiven these data points, it seems imperative that, moving forward, we preserve the right of individual Vermonters to make individual and informed choices about their health and wellness, AND challenge the constitutional, legal and medical overreach by the Governor’s office.\n\n\n\nTo cut to the heart of this matter. All Vermonters enjoy a vital human right – to determine what is best for each of our individual bodies and minds – right at the core of INFORMED CONSENT and HEALTH FREEDOM, agreed-upon human rights instituted as part of the post World War II Nuremberg Trials, to ensure future protection of individual citizens from top-down medical mandates such as those imposed by doctors with the blessing of the Nazi government in WWII Germany. \n\n\n\nI respectfully urge you to look more closely at INFORMED CONSENT and HEALTH FREEDOM at this pivotal moment for Vermont, the US and the world.\n\n\n\nAnd once again, I respectfully urge you to 1) challenge Governor Scott’s overreach, and 2) support Vermont’s Health and Medical Freedom Act.\n\n\n\nHappy to talk further via publisher AT vermontindependent.net.\n\n\n\nThanks, in advance, for your considered response,", "opengraph": {"url": "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/", "type": "article", "title": "An Open Letter To Our Vermont Representatives (H. 283 – CHALLENGING VIRAL TYRANNY – CONTACT YOUR REPS!)", "description": "Publisher’s Note: We sent this open letter to all of our Vermont elected representatives this evening. Follow Larry’s lead here and share with your Vermont lawmakers. End Viral Tyranny …", "article:published_time": "2021-02-25T00:42:11+00:00", "article:modified_time": "2021-03-03T00:07:10+00:00", "site_name": "Vermont Independent", "image": "https://vermontindependent.net/wp-content/uploads/2021/02/IMG_4467.jpg", "image:width": "1512", "image:height": "2016", "locale": "en_US"}, "tags": ["Governor", "Viral Tyranny", "COVID", "OPEN LETTER", "Vermont", "Citizens", "VT", "2VR"], "tweets": [], "movies": [], "links": ["https://legislature.vermont.gov/Documents/2022/Docs/BILLS/H-0283/H-0283%20As%20Introduced.pdf", "https://gbdeclaration.org/", "https://www.vermontindependent.net/", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://www.vermontindependent.net/", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/#print", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=email", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=twitter", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=facebook", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=reddit", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=linkedin", "https://vermontindependent.net/an-open-letter-to-our-vermont-representatives-h-283-challenging-viral-tyranny/?share=tumblr"], "authors": ["2ndvtrepublic"], "publish_date": "2021-02-25T00:42:11+00:00"}