{"result_id": "311033", "URL": "https://www.wakingtimes.com/650000-injuries-reported-after-covid-vaccines-as-biden-fda-spar-over-boosters/", "timestamp": "2023-04-25 17:39:16 CEST+0200", "meta": {"description": "Megan Redshaw - VAERS data released Friday by the CDC showed a total of 650,077 reports of adverse events from all age groups following COVID vaccines, including 13,911 deaths and 85,971 serious injuries between Dec. 14, 2020 and Aug. 27, 2021.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/650000-injuries-reported-after-covid-vaccines-as-biden-fda-spar-over-boosters/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "650,000+ Injuries Reported After COVID Vaccines, as Biden, FDA Spar Over Boosters", "cleaned_text": "650,000+ Injuries Reported After COVID Vaccines, as Biden, FDA Spar Over Boosters\n\nData released Friday by the Centers for Disease Control and Prevention (CDC) showed that between Dec. 14, 2020 and Aug. 27, 2021, a total of 650,077 total adverse events were reported to VAERS, including 13,911 deaths — an increase of 284 over the number of deaths reported the previous week.\n\nThere were 85,971 reports of serious injuries, including deaths, during the same time period — up 1,505 compared with the previous week.\n\nExcluding “foreign reports” filed in VAERS, 514,270 adverse events, including 6,296 deaths and 39,947 serious injuries, were reported in the U.S. between Dec. 14, 2020 and Aug. 27, 2021.\n\nOf the 6,296 U.S. deaths reported as of Aug. 27, 13% occurred within 24 hours of vaccination, 18% occurred within 48 hours of vaccination and 32% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nIn the U.S., 366.5 million COVID vaccine doses had been administered as of Aug. 27. This includes: 208 million doses of Pfizer, 145 million doses of Moderna and 14 million doses of Johnson & Johnson (J&J).\n\nThe data come directly from reports submitted to the Vaccine Adverse Event Reporting System (VAERS), the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nThis week’s U.S. data for 12- to 17-year-olds show:\n• 18,523 total adverse events, including 1,091 rated as serious and 18 reported deaths. Two of the 18 deaths were suicides.\n\nThe most recent reported deaths include a 15-year-old boy (VAERS I.D. 1498080) who previously had COVID, was diagnosed with cardiomyopathy in May 2021 and died four days after receiving his second dose of Pfizer’s vaccine on June 18, when he collapsed on the soccer field and went into ventricular tachycardia; and a 13-year-old girl (VAERS I.D. 1505250) who died after suffering a heart condition after receiving her first dose of Pfizer.\n• Other deaths include two 13-year-old boys (VAERS I.D. 1406840 and 1431289) who died two days after receiving a Pfizer vaccine, a 13-year-old boy who died after receiving Moderna (VAERS I.D. 1463061), three 15-year-olds (VAERS I.D. 1187918, 1382906 and 1242573), five 16-year-olds (VAERS I.D. 1420630, 1466009, 1225942, 1475434, and 1386841) and three 17-year-olds (VAERS I.D. 1199455, 1388042 and 1420762).\n• 2,715 reports of anaphylaxis among 12- to 17-year-olds with 99% of cases attributed to Pfizer’s vaccine.\n• 457 reports of myocarditis and pericarditis (heart inflammation) with 450 cases attributed to Pfizer’s vaccine.\n• 97 reports of blood clotting disorders, with all cases attributed to Pfizer.\n\nThis week’s total U.S. VAERS data, from Dec. 14, 2020 to Aug. 27, 2021, for all age groups combined, show:\n• 20% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 43% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 73.1.\n• As of Aug. 27, 3,389 pregnant women reported adverse events related to COVID vaccines, including 1008 reports of miscarriage or premature birth.\n• Of the 2,689 cases of Bell’s Palsy reported, 50% were attributed to Pfizer vaccinations, 43% to Moderna and 7% to J&J.\n• 545 reports of Guillain-Barré Syndrome, with 39% of cases attributed to Pfizer, 34% to Moderna and 26% to J&J.\n• 139,180 reports of anaphylaxis with 42% of cases attributed to Pfizer’s vaccine, 51% to Moderna and 7% to J&J.\n• 8,751 reports of blood clotting disorders. Of those, 3,721 reports were attributed to Pfizer, 3,188 reports to Moderna and 1,794 reports to J&J.\n• 2,242 cases of myocarditis and pericarditis with 1,411 cases attributed to Pfizer, 741 cases to Moderna and 83 cases to J&J’s COVID vaccine.\n\nAs The Defender reported Sept. 1, two of the FDA’s top vaccine officials announced they will leave the agency this fall, raising questions about the Biden administration and the way it sidelined the agency.\n\nAccording to an email sent Aug. 31 by Dr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research, to staff members, Dr. Marion Gruber, director of the FDA’s vaccines office, will quit at the end of October, and her deputy, Dr. Philip Krause, will leave in November.\n\nGruber and Krause were upset about the Biden administration’s recent announcement that adults should get a COVID booster eight months after they received a second shot, people familiar with the decision told The New York Times.\n\nNeither believed there was enough data to justify offering booster shots yet, the sources said, and both viewed the announcement, amplified by Biden, as pressure on the FDA to quickly authorize them.\n\nU.S. health regulators also said there isn’t enough data to recommend boosters for the general population, yet the White House has moved forward with its plan to offer a third dose of Pfizer or Moderna by the week of Sept. 20 — even though that plan requires authorization from the FDA and CDC first.\n\nFDA advisory committee to hold meeting on COVID vaccine boosters, days before White House scheduled the roll-out to begin\n\nThe FDA announced its Vaccines and Related Biological Products Advisory Committee will hold a virtual advisory meeting Sept. 17, to discuss Pfizer-BioNTech’s COVID application for boosters — just days before the shots are to become available to the general population.\n\nThe committee’s director, Dr. Peter Marks, said “a transparent, thorough and objective review of the data by the FDA is critical so that the medical community and the public continue to have confidence in the safety and effectiveness of COVID-19 vaccines.”\n\nThe FDA plans to livestream the meeting on the agency’s YouTube channel. The meeting also will be webcast from the FDA website.\n\nMoments before the FDA released the announcement, Moderna said it had submitted an application to offer booster doses of its COVID vaccine, CNN reported.\n\nAccording to CDC data, 955,000 Americans have already received additional vaccine doses, though it’s unclear how many of those were technically authorized.\n\nAn advisory panel to the CDC last week unanimously endorsed the FDA’s full approval of the Pfizer and BioNTech COVID vaccine for people 16 years and older, and the CDC immediately adopted the committee’s recommendation.\n\nThe endorsement by the CDC’s Advisory Committee on Immunization Practices came after the FDA on Aug. 23 granted full approval to Pfizer’s “mRNA vaccine, which is being marketed as Comirnaty.\n\nThe CDC statement made no mention of the Comirnaty brand, but referred to Pfizer-BioNTech’s “licensed” vaccine — even though the FDA approval was limited specifically to the drugmaker’s Comirnaty vaccine.\n\nUK panel does not recommend COVID vaccines for healthy children 12 to 15 years old\n\nBritain’s vaccine advisers said they would not recommend vaccination of healthy 12- to 15-year-olds against COVID, preferring a precautionary approach due to the potential for vaccinated teens to develop heart inflammation, Reuters reported.\n\nThe Joint Committee on Vaccination and Immunisation also said children were at such a low risk from the virus that vaccines would offer only a marginal benefit.\n\nThe British government said it would consult medical advisers to look at other factors before making a final decision. The UK’s four chief medical officers have been asked to consider the wider impact on schools and society.\n\nThe Joint Committee on Vaccination and Immunisation did advise widening the existing vaccine program to include an extra 200,000 teenagers with specific underlying conditions, including chronic heart, lung and liver conditions that put those teens at much higher risk of COVID than healthy children.\n\nMore than 100 Ontario youth sent to hospital for vaccine-related heart problems\n\nA report released last week by Public Health Ontario showed the incidence of heart inflammation following mRNA vaccination was significantly more prevalent in young people.\n\nAs of Aug. 7, there were 106 incidents of myocarditis and pericarditis in people under the age of 25 in Ontario — slightly more than half of the total of all such incidents. Thirty-one cases occurred in the 12- to 17-year age group and 75 cases in 18- to 24-year-olds. Eighty percent of all cases were in males.\n\nAccording to the report, the rate of heart inflammation was higher following the second dose of an mRNA vaccine, particularly for those receiving the Moderna vaccine as the second dose of the series, regardless of the product used for the first dose.\n\nPublic Health Ontario added the reporting rate for heart inflammation in those 18 to 24 was seven times higher with Moderna than with Pfizer. Pfizer is currently the only vaccine authorized for use in 12- to 17-year-olds in Ontario.\n\nLargest observational study shows natural immunity is better than vaccine-induced immunity\n\nAccording to a new study comparing natural immunity gained through previous SARS-CoV-2 infection to vaccine-induced immunity afforded by the Pfizer mRNA vaccine, people with natural immunity had longer lasting and stronger protection from SARS-CoV-2 infection, symptomatic disease and hospitalization from the Delta variant.\n\nThe study, published Aug. 25 on medRxiv, is the largest observational study to date and used data from Israel –– one of the most highly vaccinated countries in the world.\n\nResearchers examined medical records of 673,676 Israelis 16 years and older — charting their infections, symptoms and hospitalizations between June 1 and Aug. 14, when the Delta variant predominated in Israel.\n\nThe study found in two analyses that people who had never been infected with SARS-CoV-2 but were vaccinated in January and February were six to 13 times more likely to experience breakthrough infection with the Delta variant compared to unvaccinated people who were previously infected with SARS-CoV-2.\n\nResearchers also found a significantly increased risk of asymptomatic disease in those who had been vaccinated.\n\nWoman experiences rapid onset of rare brain disease after second Pfizer shot, dies within three months\n\nCheryl Cohen (VAERS ID 1535217), a healthy 64-year-old woman from Florida, died three months after her second dose of Pfizer’s COVID vaccine from sudden-onset Creutzfeldt-Jakob Disease (CJD), a rare, degenerative and fatal brain disorder she developed soon after she was vaccinated.\n\nIn an exclusive interview with The Defender, Gianni Cohen said her mother experienced her first episode indicating something was neurologically wrong with her 11 days after her second Pfizer dose. Her initial symptoms included severe headaches, mass confusion and brain fog.\n\nAfter being hospitalized for 10 days, Cohen returned home where her symptoms progressed and her condition rapidly deteriorated. On June 19, Cohen was hospitalized again for a severe headache, after which she was diagnosed with CJD. She died July 22.\n\nCohen’s medical team said the onset of CJD could be tied to the COVID vaccine. Dr. Andrea Folds, one of the internal medicine physicians from Aventura Hospital who oversaw Cohen’s case, wrote a case report. The report, submitted Sept. 2 to American College of Physicians Journal, is awaiting approval for publication.\n\nWHO says it’s monitoring a new COVID variant called “MU”\n\nThe World Health Organization (WHO) is monitoring a new COVID variant called “mu,” which the agency says has mutations that have the potential to evade immunity provided by a previous COVID infection or vaccination, CNBC reported.\n\nMu — known by scientists as B.1.621 — was added to the WHO’s list of variants “of interest” on Aug. 30, the international health organization said in its weekly COVID epidemiological report published late Tuesday.\n\nThe variant contains genetic mutations that indicate natural immunity, current vaccines or monoclonal antibody treatments may not work as well against it as they do against the original ancestral virus, the WHO said.\n\nThe mu strain needs further study to confirm whether it will prove to be more contagious, more deadly, or more resistant to current vaccines and treatments.\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nOn March 8, The Defender contacted the CDC with a written list of questions about reported deaths and injuries related to COVID vaccines. We have made repeated attempts, by phone and email, to obtain a response to our questions.\n\nDespite multiple phone and email communications with many people at the CDC, and despite being told that our request was in the system and that someone would respond, we have not yet received answers to any of the questions we submitted. It has been 183 days since we sent our first email to the CDC requesting information.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "650,000+ Injuries Reported After COVID Vaccines, as Biden, FDA Spar Over Boosters", "description": "Megan Redshaw - VAERS data released Friday by the CDC showed a total of 650,077 reports of adverse events from all age groups following COVID vaccines, including 13,911 deaths and 85,971 serious injuries between Dec. 14, 2020 and Aug. 27, 2021.", "url": "https://www.wakingtimes.com/650000-injuries-reported-after-covid-vaccines-as-biden-fda-spar-over-boosters/", "site_name": "Waking Times", "article:published_time": "2021-09-07T20:37:40+00:00", "article:modified_time": "2021-09-07T20:37:55+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/04/covid-vaccine-Vanden-Bossche-feature-800x417-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/04/covid-vaccine-Vanden-Bossche-feature-800x417-1.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/vaers-cdc-injuries-reported-covid-vaccines-fda-boosters/", "https://www.wakingtimes.com/650000-injuries-reported-after-covid-vaccines-as-biden-fda-spar-over-boosters/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://childrenshealthdefense.org/defender/fda-warning-jj-vaccine-serious-rare-autoimmune-disorder/", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1498080", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1505250", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1406840", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1431289", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1463061", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1382906", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1242573", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420630", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1466009", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1475434", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1386841", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1199455", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1388042", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420762", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://childrenshealthdefense.org/defender/2-top-fda-regulators-resign-white-house-approve-boosters/", "https://www.fda.gov/about-fda/fda-organization/center-biologics-evaluation-and-research-cber", "https://childrenshealthdefense.org/defender/covid-booster-shots-8-months-after-second-dose/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.nytimes.com/2021/08/31/us/politics/fda-vaccine-regulators-booster-shots.html", "https://childrenshealthdefense.org/defender/scientists-booster-shots-weak-evidence-vaccine-resistant-variants/", "https://childrenshealthdefense.org/defender/cdc-experts-disagree-pfizer-covid-boosters/", "https://www.fda.gov/news-events/press-announcements/fda-brief-fda-hold-advisory-committee-meeting-discuss-pfizer-biontechs-application-covid-19-booster", "https://childrenshealthdefense.org/defender/peter-doshi-fda-data-approval-covid-vaccine/", "https://www.youtube.com/user/usfoodanddrugadmin", "https://www.fda.gov/news-events/press-announcements/fda-brief-fda-hold-advisory-committee-meeting-discuss-pfizer-biontechs-application-covid-19-booster", "https://www.cnn.com/2021/09/01/health/booster-vaccines-fda-advisers/index.html", "https://www.cnbc.com/2021/08/31/cdc-nearly-1-million-covid-booster-shots-have-already-been-administered-in-us.html", "https://www.cnbc.com/2021/08/30/covid-vaccine-cdc-panel-endorses-full-approval-of-pfizer-shot.html", "https://childrenshealthdefense.org/defender/fda-full-approval-pfizer-vaccine-lack-scientific-debate/", "https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/", "https://www.fda.gov/media/150386/download", "https://childrenshealthdefense.org/defender/heart-inflammation-covid-vaccines-jama-cdc/", "https://www.reuters.com/world/uk/uk-advisers-decide-against-covid-vaccines-healthy-12-15-year-olds-2021-09-03/", "https://www.bbc.com/news/health-58438669", "https://www.publichealthontario.ca/-/media/documents/ncov/epi/covid-19-myocarditis-pericarditis-vaccines-epi.pdf?sc_lang=en", "https://www.publichealthontario.ca/-/media/documents/ncov/epi/covid-19-myocarditis-pericarditis-vaccines-epi.pdf?sc_lang=en", "https://torontosun.com/news/provincial/over-100-ontario-youth-have-been-sent-to-hospital-for-vaccine-related-heart-problems", "https://childrenshealthdefense.org/defender/fully-vaccinated-pfizer-more-likely-get-delta-than-natural-immunity/", "https://childrenshealthdefense.org/defender/brian-hooker-covid-delta-variant-vaccine-less-effective/", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1.full-text", "https://childrenshealthdefense.org/defender/covid-fully-vaccinated-cdc-breakthrough-cases/", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1535217", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Creutzfeldt-Jakob-Disease-Fact-Sheet", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.acpjournals.org/", "https://www.cnbc.com/2021/09/01/who-says-it-is-monitoring-a-new-covid-variant-called-mu.html", "https://www.who.int/en/activities/tracking-SARS-CoV-2-variants/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/64-days-why-wont-cdc-answer-questions/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-09-07T20:37:40+00:00"}