{"result_id": "311034", "URL": "https://www.wakingtimes.com/latest-cdc-data-show-reports-of-adverse-events-after-covid-vaccines-surpass-200000-including-943-among-12-to-17-year-olds/", "timestamp": "2023-04-25 17:39:17 CEST+0200", "meta": {"description": "Megan Redshaw - Very important data direct from the CDC.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/latest-cdc-data-show-reports-of-adverse-events-after-covid-vaccines-surpass-200000-including-943-among-12-to-17-year-olds/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Latest CDC Data Show Reports of Adverse Events After COVID Vaccines Surpass 200,000, Including 943 Among 12- to 17-Year-Olds", "cleaned_text": "The number of reported adverse events following COVID vaccines surpassed 200,000 according to data released today by the Centers for Disease Control and Prevention (CDC). The data comes directly from reports submitted to the Vaccine Adverse Event Reporting System (VAERS).\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Today’s data show that between Dec. 14, 2020 and May 14, a total of 227,805 total adverse events were reported to VAERS, including 4,201 deaths — an increase of 144 over the previous week — and 18,528 serious injuries, up 1,338 since last week.\n\nThis week’s data showed 943 total adverse events, including 23 rated as serious, among 12- to -17-year-olds.\n\nIn the U.S., 268.4 million COVID vaccine doses had been administered as of May 14. This includes 115 million doses of Moderna’s vaccine, 144 million doses of Pfizer and 9 million doses of the Johnson & Johnson (J&J) COVID vaccine.\n\nOf the 4,201 deaths reported as of May 14, 23% occurred within 48 hours of vaccination, 16% occurred within 24 hours and 38% occurred in people who became ill within 48 hours of being vaccinated.\n• 20% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 44% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 74.7 and the youngest deaths reported include two 15-year-olds (VAERS I.D. 1187918 and 1242573 ) and a 16-year-old (VAERS I.D. 1225942). There were other reported deaths in children under 16 that could not be confirmed or contained obvious errors.\n• As of May 14, 1,140 pregnant women reported adverse events related to COVID vaccines, including 351 reports of miscarriage or premature birth.\n• Of the 2,275 cases of Bell’s Palsy reported, 51% were reported after Pfizer-BioNTech vaccinations, 42% following vaccination with the Moderna vaccine and 192 cases, or 10%, of Bell’s Palsy cases were reported in conjunction with J&J.\n• There were 195 reports of Guillain-Barré Syndrome with 40% of cases attributed to Pfizer, 38% to Moderna and 26% to J&J.\n• There were 65,854 reports of anaphylaxis with 38% of cases attributed to Pfizer’s vaccine, 51% to Moderna and 11% to J&J.\n• There were 3,758 reports of clotting disorders and other related conditions. Of those, 1,468 reports were attributed to Pfizer, 1,093 reports to Moderna and 1,093 reports to J&J.\n\nCOVID vaccines may not work for millions with underlying conditions As The Defender reported May 19, some experts are questioning the CDC’s recommendation that immunocompromised people get vaccinated after new research showed 15% to 80% of people with underlying health disorders and those on immunosuppressive medications mount few, if any, antibodies to COVID vaccines.\n\nYet, current CDC guidelines indicate those with compromised immune systems should be vaccinated for COVID even though “no data are available to establish COVID vaccine safety and efficacy in these groups” as people with compromised immune systems or those who take immunosuppressants for a medical condition were largely excluded from vaccine clinical trials.\n\nDr. Meryl Nass, an internal medicine physician, said it’s the responsibility of the CDC to determine the risks and benefits of every vaccine for different groups of people. For COVID vaccines, Nass said, the CDC has failed to publish that information, or tell the public which groups might be at a higher risk of suffering an adverse reaction that far outweighs any potential benefit.\n\nAs The Defender reported May 19, a ninth, fully vaccinated member of the New York Yankees organization tested positive for COVID. Most of the reported cases were asymptomatic. All nine were vaccinated with the J&J shot, making these cases what the CDC calls “breakthrough” infections.\n\nSome in the medical community claim this is proof COVID vaccines work –– because none of the nine became seriously ill or were hospitalized. A CNN article today quoted an infectious disease physician who said the mild cases were evidence the vaccines worked. But Dr. Meryl Nass, told The Defender that the data on COVID infections show young, healthy athletes wouldn’t be expected to become seriously ill from COVID, regardless of vaccination status.\n\nNass said the breakthrough cases raise questions about COVID test accuracy and the vaccine’s ability to prevent the virus and its transmission.\n\nEmployers may be held liable for “any adverse reaction” if they mandate COVID vaccines\n\nOn May 20, The Defender reported that new guidance from the Occupational Safety and Health Administration (OSHA) will hold employers liable for adverse reactions if they require employees be vaccinated for COVID as a condition of employment, which could negatively impact the employer’s safety rating.\n\nIn the Frequently Asked Questions section of OSHA’s website having to do with COVID safety compliance, a question was asked whether an adverse reaction to a COVID vaccine had to be recorded if an employer mandated vaccination as a condition for employment.\n\n“If you require your employees to be vaccinated as a condition of employment (i.e., for work-related reasons), then any adverse reaction to the COVID-19 vaccine is work-related. The adverse reaction is recordable if it is a new case under 29 CFR 1904.6 and meets one or more of the general recording criteria in 29 CFR 1904.7.”\n\nConversely, OSHA said it will exercise enforcement discretion and will not require adverse reactions be recorded when an employer only “recommends” that employees receive the vaccine, while noting that for this discretion to apply, the vaccine must be truly voluntary.\n\nIn determining whether a vaccine is “voluntary,” the website states, “an employee’s choice to accept or reject the vaccine cannot affect [his or her] performance rating or professional advancement,” and that an “employee who chooses not to receive the vaccine cannot suffer any repercussions from this choice.”\n\nIf employees are not free to choose whether or not to receive the vaccine without fearing negative recourse, then the vaccine is required and employers should refer to the section on COVID vaccines as a condition to employment.\n\nJ&J knew about issues at plant manufacturing its vaccine seven months before shut down\n\nOn May 20, The Defender reported that the House Select Committee on Coronavirus launched a probe into Emergent BioSolutions — the plant manufacturing J&J’s vaccine — last month after the company acknowledged “serious deficiencies” in the company’s manufacturing that caused a mix-up of AstraZeneca and J&J doses.\n\nDuring a congressional hearing Wednesday, it was revealed that J&J had documented serious contamination risks at the Emergent Baltimore plant in June 2020 — seven months before a contamination incident ruined 15 million doses of COVID vaccine and derailed the company’s vaccine production plans.\n\nA memorandum released prior to the hearing raised questions about J&J’s lack of oversight of the Baltimore facility, large bonuses paid to top executives despite failures, and described other evidence recently obtained by the House panel in their ongoing investigation into Emergent.\n\nAccording to Business Insider, CEO of Emergent, Robert Kramer, admitted to the House of Representatives during the hearing that more than 100 million doses of J&J’s vaccine are on hold due to possible contamination.\n\nIt was the first time Kramer admitted the high figure of potentially spoiled vaccines after The New York Times reported in April the facility may have jeopardized 62 million vaccine doses in addition to ruining 15 million doses through cross-contamination with AstraZeneca vaccine ingredients.\n\n“No one is more disappointed than we are that we had to suspend our 24/7 manufacturing of new vaccine,” Kramer said. “I apologize for the failure of our controls.”\n\nOn May 17, The Defender reported that 76-year-old Eric Clapton suffered a severe adverse reaction after getting the AstraZeneca COVID vaccine that left him fearing he would never play again.\n\n“Needless to say the reactions were disastrous, my hands and feet were either frozen, numb or burning, and pretty much useless for two weeks. I feared I would never play again,” Clapton said. “But the propaganda said the vaccine was safe for everyone.”\n\nDays after Clapton’s criticism of vaccine “propaganda,” the Wall Street Journal reported that U.S. vaccine makers are sponsoring ad campaigns targeting the roughly one-third of Americans who are reluctant to get a COVID vaccine.\n\nPfizer, Moderna, Regeneron and other pharmaceutical companies are sponsoring ads on TV, radio and social media praising COVID vaccines and medications in an effort to increase vaccinations. Unlike ads for drugs where brand names are featured, general “get the vaccine” ads don’t have to follow legal guidelines, which include listing the drug’s potential side effects.\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nOn March 8, The Defender contacted the CDC with a written list of questions about reported deaths and injuries related to COVID vaccines. After repeated attempts, by phone and email, to obtain a response to our questions, a health communications specialist from the CDC’s Vaccine Task Force contacted us on March 29 — three weeks after our initial inquiry.\n\nThe individual received our request for information from VAERS, but said she had never received our list of questions, even though employees we talked to several times said CDC press officers were working through the questions and confirmed the representative had received them. We provided the list of questions again along with a new deadline, but never received a response.\n\nThe Defender also followed up with the CDC’s media department, which told us the COVID response unit would be informed that the health communications specialist never responded. No explanation was given as to why our inquiries were ignored. We were told to call back, which we did numerous times.\n\nOn May 19, a CDC employee said our questions had been reviewed and our inquiry was pending in their system, but would not provide us with a copy of the response. It has been 74 days since we sent our first email inquiring into VAERS data and reports.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "Latest CDC Data Show Reports of Adverse Events After COVID Vaccines Surpass 200,000, Including 943 Among 12- to 17-Year-Olds", "description": "Megan Redshaw - Very important data direct from the CDC.", "url": "https://www.wakingtimes.com/latest-cdc-data-show-reports-of-adverse-events-after-covid-vaccines-surpass-200000-including-943-among-12-to-17-year-olds/", "site_name": "Waking Times", "article:published_time": "2021-05-27T13:00:59+00:00", "article:modified_time": "2021-05-28T16:06:40+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/05/Covid-Vaccine-10.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://ourworldindata.org/grapher/cumulative-covid-vaccinations?tab=chart&stackMode=absolute&country=~USA&region=World", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/pfizer-moderna-vaccines-blood-clots/", "https://childrenshealthdefense.org/defender/teen-hospitalized-brain-blood-clots-after-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/link-johnson-johnson-vaccine-blood-clots-cdc-28-cases-3-deaths/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1242573", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS[]=Bell%27s+palsy+%2810004223%29&SYMPTOMS[]=Facial+discomfort+%2810083537%29&SYMPTOMS[]=Facial+dysmorphism+%2810016045%29&SYMPTOMS[]=Facial+nerve+disorder+%2810061457%29&SYMPTOMS[]=Facial+neuralgia+%2810061594%29&SYMPTOMS[]=Facial+palsy+%2810016060%29&SYMPTOMS[]=Facial+paralysis+%2810016062%29&SYMPTOMS[]=Facial+paresis+%2810051267%29&SYMPTOMS[]=Facial+spasm+%2810063006%29&VAX=COVID19", "https://childrenshealthdefense.org/defender/fda-misled-public-pfizer-vaccine-efficacy/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN", "https://childrenshealthdefense.org/defender/covid-vaccines-underlying-conditions-cdc-continues-recommend/", "https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html", "https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html#underlying-conditions", "https://www.nbcnews.com/health/health-news/covid-vaccines-may-not-protect-people-immune-disorders-nih-trial-n1266886", "https://ahrp.org/meryl-nass-m-d/", "https://www.regulations.gov/commenton/FDA-2021-P-0460-0001", "https://childrenshealthdefense.org/defender/ninth-fully-vaccinated-yankee-tests-positive-covid/", "https://childrenshealthdefense.org/defender/cdc-panel-resume-use-of-jj-covid-vaccine-no-restrictions/", "https://childrenshealthdefense.org/defender/states-report-covid-cases-fully-vaccinated/", "https://edition.cnn.com/2021/05/20/health/yankees-covid-19-breakthrough-infections/index.html", "https://childrenshealthdefense.org/defender/pcr-testing-incorrect-use/", "https://childrenshealthdefense.org/defender/employers-liable-adverse-reaction-mandate-covid-vaccines/", "https://www.osha.gov/", "https://www.osha.gov/coronavirus/faqs#vaccine", "https://childrenshealthdefense.org/defender/resources-federal-law-prohibits-mandates-emergency-use-covid-vaccines-tests-masks/", "https://www.osha.gov/coronavirus/faqs#vaccine", "https://www.osha.gov/coronavirus/faqs", "https://www.osha.gov/coronavirus/faqs", "https://childrenshealthdefense.org/defender/vaccine-producer-hearing-botched-doses-executive-bonuses-stock-sales/", "https://childrenshealthdefense.org/defender/fda-slams-johnson-johnson-quality-control-issues/", "https://childrenshealthdefense.org/defender/eu-possible-link-blood-clots-astrazeneca-vaccine/", "https://childrenshealthdefense.org/defender/johnson-johnson-astrazeneca-covid-vaccine-ingredient-mix-up/", "https://coronavirus.house.gov/sites/democrats.coronavirus.house.gov/files/Staff%20Memo%20re%20Emergent%20-%20FINAL.pdf", "https://childrenshealthdefense.org/defender/covid-vaccines-record-profits-ceos-get-ultra-rich/", "https://www.businessinsider.com/jj-doses-from-baltimore-plant-need-checked-for-contamination-2021-5", "https://www.businessinsider.com/millions-johnson-and-johnson-vaccine-doses-need-contamination-check-nyt-2021-4", "https://www.businessinsider.com/millions-johnson-and-johnson-vaccine-doses-need-contamination-check-nyt-2021-4", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://childrenshealthdefense.org/defender/eric-clapton-after-astrazeneca-vaccine-propaganda-overstated-safety/", "https://www.wsj.com/articles/covid-19-drugmakers-take-on-your-favorite-tv-shows-to-tackle-vaccine-hesitancy-11621166403", "https://www.kff.org/coronavirus-covid-19/poll-finding/kff-covid-19-vaccine-monitor-april-2021/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/64-days-why-wont-cdc-answer-questions/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://www.wendymyersdetox.com/29KK7GX/BP658/"], "authors": ["WakingTimes"], "publish_date": "2021-05-27T13:00:59+00:00"}