{"result_id": "311018", "URL": "http://www.wakingtimes.com/parallels-between-gmo-covid-vaccine-and-gmo-crops-lessons-not-learned/", "timestamp": "2023-04-25 17:39:07 CEST+0200", "meta": {"description": "Jon Rappoport - The COVID vaccine is a gene treatment. RNA is injected into the body, for the purpose of forcing cells to manufacture a protein.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/parallels-between-gmo-covid-vaccine-and-gmo-crops-lessons-not-learned/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Parallels Between GMO COVID Vaccine and GMO Crops - Lessons Not Learned", "cleaned_text": "Parallels Between GMO COVID Vaccine and GMO Crops – Lessons Not Learned\n\n“Although gene therapy has never cured a disease across the board, it’s extraordinarily safe and effective, because we say it is.”\n\nThe COVID vaccine is a gene treatment. RNA is injected into the body, for the purpose of forcing cells to manufacture a protein. The promise? Protection against a purported virus.\n\nThe first generation of Monsanto crops followed the same pattern. Genes were injected into plants. Like a vaccine, its purpose was protection; in this case, against Monsanto’s own herbicide poison, Roundup.\n\nThe overall health of the crops and the human body were reduced. The nutritive value of the crops diminished; super-weeds on the GMO farms flourished. The huge number of adverse effects from the vaccine testify to expanding human damage.\n\nThe Monsanto genes in the plants drifted. They were found in non-GMO plants, in soil bacteria, and human gut bacteria.\n\nThe RNA in the vaccine and/or its products appear to have shed and drifted from person to person, given the large numbers of reports from unvaccinated women who, after coming into contact with vaccinated persons, experienced interrupted patterns of menstruation, bleeding, and miscarriages.\n\nAs I wrote the other day, Pfizer’s own warnings about its COVID vaccine include pregnant women coming into the proximity of vaccinated persons (“inhalation, skin contact” mentioned).\n\nBoth GMO crops and the GMO vaccine are imposed, top-down, on the population, from corporate giants who are reaping massive profits. Continuing propaganda campaigns are designed to convince famers and the general population to accept and celebrate the dangerous GMO crops and the GMO vaccine.\n\nGovernments protect and run interference for the companies who produce the GMO crops and the vaccine.\n\nBill Gates is an ardent supporter, publicist, and funder of GMO crops and GMO vaccines. He keeps asserting, like a psychotic baron living in a castle on top of a mountain, that the crops and the vaccine will save the world.\n\nMany critics of the GMO vaccine are unaware of (or have forgotten about) the dangers of GMO crops. And many critics of GMO crops fail to realize (or are afraid to criticize) the dangers of the COVID GMO vaccine.\n\nHuge numbers of people in the general public blithely accept the (fake) science surrounding GMO crops and the GMO vaccine. “The experts must know what they’re talking about.”\n\nThe patents on both GMO crops and the GMO vaccine are jealously guarded by the corporations who control them. In both cases, ignorant people are calling for these patents to be made into open-source information—unaware that both technologies are highly dangerous and destructive.\n\nThe general field of genetics research—of which these crops and vaccines are products—is filled with liars, who claim their experimental work is safe and foolproof, when in fact the literature is rife with examples of ripple effects. The introduction of genes into organisms creates many unpredictable changes in genomes. “We have everything under control”—the battle cry of vaccine and crop researchers.\n\nAgriculture and the human body are both viewed, from the ivory tower, as deficient and diseased, in need of genetic alteration.\n\nOverall, genetic tinkering is a disaster already happening.\n\nEthical scientists who want to put moratoria on this research are being sidelined and ignored.\n\nManic technocrats see genetic modification as the massive gateway into a Brave New World, where humans are divided into gen-rich and gen-poor classes, from birth. From before birth.\n\nHere are two mind-bending quotes from admired experts:\n\n“The GenRich—who account for ten percent of the American population—all carry synthetic genes. All aspects of the economy, the media, the entertainment industry, and the knowledge industry are controlled by members of the GenRich class…” “Naturals work as low-paid service providers or as laborers. [Eventually] the GenRich class and the Natural class will become entirely separate species with no ability to crossbreed, and with as much romantic interest in each other as a current human would have for a chimpanzee.” “Many think that it is inherently unfair for some people to have access to technologies that can provide advantages while others, less well-off, are forced to depend on chance alone, [but] American society adheres to the principle that personal liberty and personal fortune are the primary determinants of what individuals are allowed and able to do.” “Indeed, in a society that values individual freedom above all else, it is hard to find any legitimate basis for restricting the use of repro-genetics. I will argue [that] the use of reprogenetic technologies is inevitable. [W]hether we like it or not, the global marketplace will reign supreme.”\n\nAs shocking as Lee Silver’s assessment is, it’s mild when put up against the pronouncement of Gregory Stock, former director of the program in Medicine, Technology, and Society at the UCLA School of Medicine:\n\n“Even if half the world’s species were lost [during genetic experiments], enormous diversity would still remain. When those in the distant future look back on this period of history, they will likely see it not as the era when the natural environment was impoverished, but as the age when a plethora of new forms—some biological, some technological, some a combination of the two—burst onto the scene. We best serve ourselves, as well as future generations, by focusing on the short-term consequences of our actions rather than our vague notions about the needs of the distant future.”\n\nBut don’t worry, be happy. Anthony Fauci, who has a direct pipeline to God, tells us the COVID vaccine is extraordinarily safe and effective. That’s all we need to know. I’ll take the Pfizer, the Moderna, and two AstraZeneca to go. Gift wrap? No, they’re for me. Just put the vials and syringes in a brown bag. I’ll shoot up while I watch the news on CNN. Their experts are reassuring…\n\nJon Rappoport is the author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29thDistrict of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free emails at NoMoreFakeNews.com or OutsideTheRealityMachine.\n\nThis article (Vaccine: Twenty Countries Suspend Injections; Does That Make You “Hesitant?”) was originally created and published by Jon Rappaport’s Blog and is re-posted here with permission.", "opengraph": {"locale": "en_US", "type": "article", "title": "Parallels Between GMO COVID Vaccine and GMO Crops - Lessons Not Learned", "description": "Jon Rappoport - The COVID vaccine is a gene treatment. RNA is injected into the body, for the purpose of forcing cells to manufacture a protein.", "url": "https://www.wakingtimes.com/parallels-between-gmo-covid-vaccine-and-gmo-crops-lessons-not-learned/", "site_name": "Waking Times", "article:published_time": "2021-05-05T15:54:11+00:00", "article:modified_time": "2021-05-05T15:54:23+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/05/GMO-Tomato.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/05/GMO-Tomato.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "http://blog.nomorefakenews.com/2021/05/05/gmo-covid-vaccine-and-gmo-crops-parallels-lessons-not-learned/", "https://www.wakingtimes.com/parallels-between-gmo-covid-vaccine-and-gmo-crops-lessons-not-learned/", "http://marketplace.mybigcommerce.com/the-matrix-revealed-vol-1-cd-by-jon-rappoport-mega-info/", "http://marketplace.mybigcommerce.com/exit-from-the-matrix/", "http://marketplace.mybigcommerce.com/power-outside-the-matrix/", "http://nomorefakenews.com/", "http://outsidetherealitymachine.wordpress.com/", "http://marketplace.mybigcommerce.com/exit-from-the-matrix/", "http://jonrappoport.wordpress.com/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-05-05T15:54:11+00:00"}