{"result_id": "311040", "URL": "https://www.wakingtimes.com/mrna-vaccine-inventor-erased-from-history-books/", "timestamp": "2023-04-25 17:39:21 CEST+0200", "meta": {"description": "Dr. Mercola - To censor a scientific discussion with the actual inventor of the technology used to manufacture these COVID-19 shots is beyond shocking.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/mrna-vaccine-inventor-erased-from-history-books/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "mRNA Vaccine Inventor Erased From History Books", "cleaned_text": "June 11, 2021, the inventor of the mRNA vaccine technology,1 Dr. Robert Malone, spoke out on the DarkHorse podcast about the potential dangers of COVID-19 gene therapy injections, hosted by Bret Weinstein, Ph.D. The podcast was quickly erased from YouTube and Weinstein was issued a warning.\n\nTo censor a scientific discussion with the actual inventor of the technology used to manufacture these COVID-19 shots is beyond shocking. But the censorship of Malone goes even further than that. As reported in the video above, Malone’s scientific accomplishments are also being scrubbed.\n\nAs recently as June 14, 2021, Malone’s contributions were extensively included in the historical section on RNA vaccines’ Wikipedia page. He was listed as having co-developed a “high-efficiency in-vitro and in-vivo RNA transfection system using cationic liposomes” in 1989.\n\nIn 1990, he demonstrated that “in-vitro transcribed mRNA could deliver genetic information into the cell to produce proteins within living cell tissue.” Malone was also part of the team that conducted the first mRNA vaccine experiments. In short, his scientific knowledge of mRNA vaccines is unquestionable.\n\nTwo days later, June 16, 2021, just five days after Malone’s appearance on the DarkHorse podcast, his name was removed from the Wikipedia entry. Now, all of a sudden, the discovery of mRNA drug delivery is accredited to nameless researchers at the Salk Institute and the University of California, and his 1990 research confirming that injected mRNA can produce proteins in cell tissue is accredited to nameless scientists at the University of Wisconsin.\n\nHungarian biochemist Katalin Kariko is now suddenly praised by mainstream media as the inventor of mRNA vaccines.2 It’s a convenient choice, considering Kariko is the senior vice president of BioNTech, the creator of Pfizer’s COVID injection. Kariko’s unofficial biography also includes being a communist-era police informant.\n\nAs noted in the featured video, this goes beyond censoring. It’s revisionism — a “1984”-style rewriting of history to fit the official narrative of the day. The danger of this trend is incalculable.\n\nWhat Did Malone Say About mRNA Vaccines?\n\nThe take-home messages Malone delivered on Weinstein’s podcast were that government is not being transparent about the risks, that no one should be forced to take these experimental injections, that the risks outweigh the benefits in children, teens and young adults, and that those who have recovered from natural SARS-CoV-2 infection should not get the injection. In a June 24, 2021, interview with Tucker Carlson on Fox News (above), Malone said:3\n\nA significant part of why we don’t have adequate data is because the U.S. Food and Drug Administration purposely decided not to require stringent post-vaccination data collection and evaluation. This too was revealed in Malone’s DarkHorse interview.\n\nWhy did the FDA opt for lax data capture on a brand-new, never before used technology slated for mass distribution? Clearly, without post-injection data capture, there’s no way to evaluate the safety of these products. You cannot identify danger signals if you don’t have a process for capturing effects data and evaluating all of it.\n\nMalone also points out that risk-benefit analyses have not been done, and that’s another objection he has. What data we do have, however, indicate these COVID-19 injections could be the most dangerous medical product we’ve ever seen.\n\nFor example, the reported rate of death from COVID-19 shots now exceeds the reported death rate of more than 70 vaccines combined over the past 30 years, and it’s about 500 times deadlier than the seasonal flu vaccine,4 which historically has been the most hazardous. The COVID shots are also seven times more dangerous than the pandemic H1N1 vaccine, which had a 25-per-million severe side effect rate.5\n\nCoincidentally, a peer-reviewed risk-benefit analysis6 was in fact published in the medical journal Vaccines the same day Malone spoke to Carlson. It revealed that the number needed to vaccinate (NNTV) to prevent one COVID-19 death using the Pfizer injection is between 9,000 and 50,000, and that for every three COVID-19 deaths prevented, two are killed by the injection. According to the authors, “This lack of clear benefit should cause governments to rethink their vaccination policy.”\n\nIn his DarkHorse interview, Malone noted that he had warned the FDA that the spike protein — which the COVID-19 shots instruct your cells to make — could pose a health risk.\n\nThe FDA dismissed his concerns, saying they did not believe the spike protein was biologically active. Besides, the vaccine makers specifically designed the injections so that the spike protein would stick and not float about freely. As it turns out, they were wrong on both accounts.\n\nIt’s since been established that the SARS-CoV-2 spike protein does not stay near the injection site,7 and that it is biologically active. It is responsible for the most severe effects seen in COVID-19, such as bleeding disorders, blood clots throughout the body, heart problems and neurological damage.\n\nThese are the same problems we now see in a staggering number of people having received one or two shots of COVID-19 gene therapy. The SARS-CoV-2 spike protein also has reproductive toxicity, and Pfizer’s biodistribution data show it accumulates in women’s ovaries.8,9,10\n\nDespite that, Pfizer opted not to perform standard reproductive toxicology studies. For more in-depth information about how the spike protein can wreck your health, see my interview with Stephanie Seneff, Ph.D., and Judy Mikovits, Ph.D.\n\nIn his interviews with Weinstein and Carlson, Malone stressed that there are bioethical principles and bioethics laws in place to prevent undue risks in medical experimentation, and that those laws are currently being violated. He went into far more detail on this in a May 30, 2021, essay:11\n\nExperimentation without proper informed consent also violates the Nuremberg Code,13 which spells out a set of research ethics principles for human experimentation. This set of principles were developed to ensure the medical horrors discovered during the Nuremberg trials at the end of World War II would never take place again.\n\nIn the U.S., we also have the Belmont report,14 cited in Malone’s essay, which spells out the ethical principles and guidelines for the protection of human subjects of research, covered under the U.S. Code of Federal Regulations 45 CFR 46 (subpart A). The Belmont report describes informed consent as follows:\n\nAmericans, indeed the people of the entire planet, are being prevented from freely accessing and sharing information about these gene therapies. Worse, we are misled by fact checkers and Big Tech platforms that ban or put misinformation labels on anyone and anything discussing them in a critical or questioning way. The same censorship also prevents comprehension of risk.\n\nLastly, government and any number of vaccine stakeholders are encouraging companies and schools to make these experimental injections mandatory, which violates the rule of voluntariness. Government and private businesses are also creating massive incentives to participate in this experiment, including million-dollar lotteries and full college scholarships. None of this is ethical or even legal. As noted by Malone in his essay:15\n\nClearly, Malone is preeminently qualified to speak on the topic of COVID gene therapy: Not only is he a highly ethical physician committed to integrity, but he actually invented the very technology and performed the first mRNA vaccine studies. The fact that he is now censored by Big Tech and outright being erased from scientific history is a crime in and of itself, and something that should worry just about everyone.\n\nThis egregious example of censorship vividly demonstrates just how degenerated the media has become. The only possible explanation is that anyone or any piece of information that interferes with as many people getting the COVID jab is removed. Nothing that counters this narrative is tolerated despite every bit of information is making it clear that these COVID jabs are the biggest crime against mankind in the history of humanity.\n\nIf Malone can be erased, what chance do the rest of us have to not encounter the same fate? The parallels between everyday reality and the fictional but uncannily prophetic book “1984” are mounting by the day. Where it will take us is obvious. We’ll end up in a world where faithful adherence to the lies of the day is the only choice. To prevent such a fate, we have to get engaged and expose the lies by sharing facts, data and truth in every which way we can.", "opengraph": {"locale": "en_US", "type": "article", "title": "mRNA Vaccine Inventor Erased From History Books", "description": "Dr. Mercola - To censor a scientific discussion with the actual inventor of the technology used to manufacture these COVID-19 shots is beyond shocking.", "url": "https://www.wakingtimes.com/mrna-vaccine-inventor-erased-from-history-books/", "site_name": "Waking Times", "article:published_time": "2021-07-07T13:32:55+00:00", "article:modified_time": "2021-07-07T13:51:44+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/07/Dr-malone.jpeg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1180", "height": "664", "embed_code": "<iframe loading=\"lazy\" title=\"Who is Robert Malone?\" width=\"1180\" height=\"664\" src=\"https://www.youtube.com/embed/LwE2ZeuUyXo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/LwE2ZeuUyXo?feature=oembed"}], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/07/Dr-malone.jpeg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://articles.mercola.com/sites/articles/archive/2021/07/06/mrna-vaccine-inventor-erased-from-history-books.aspx", "https://www.wakingtimes.com/mrna-vaccine-inventor-erased-from-history-books/", "https://articles.mercola.com/sites/articles/archive/2021/06/21/mrna-inventor-interviewed-about-injection-dangers.aspx", "https://articles.mercola.com/sites/articles/archive/2021/02/09/coronavirus-mrna-vaccine.aspx", "https://articles.mercola.com/sites/articles/archive/2021/02/20/brave-new-world.aspx", "https://www.foxnews.com", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://articles.mercola.com/sites/articles/archive/2021/05/25/spike-protein-coronavirus.aspx", "https://articles.mercola.com/sites/articles/archive/2021/03/16/mrna-vaccine-gene-therapy.aspx", "https://articles.mercola.com/sites/articles/archive/2021/06/13/covid-19-vaccines-causing-damage.aspx", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-07-07T13:32:55+00:00"}