{"result_id": "311021", "URL": "https://www.wakingtimes.com/research-group-warns-adverse-event-reports-indicate-covid-vaccine-unsafe-for-use-in-humans/", "timestamp": "2023-04-25 17:39:09 CEST+0200", "meta": {"description": "Matt Agorist - Instead of investigating these legitimate concerns, governments have taken to issuing bribes and mandates in order to increase vaccine uptake.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/research-group-warns-adverse-event-reports-indicate-covid-vaccine-unsafe-for-use-in-humans/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Research Group Warns Adverse Event Reports Indicate COVID Vaccine ‘Unsafe for Use in Humans’", "cleaned_text": "Research Group Warns Adverse Event Reports Indicate COVID Vaccine ‘Unsafe for Use in Humans’\n\nAs TFTP has reported over the last several months, a record number of adverse reactions have been reported to the Centers for Disease Control’s Vaccine Adverse Event Reporting System (VAERS). The most recent numbers show thousands of adverse events reported from the new age group of 12-17 year old children who are now receiving the vaccine — with 623 reports of myocarditis or pericarditis among people ages 30 and younger who received COVID-19 vaccine.\n\nAccording to the CDC, from December 14, 2020, through June 7, 2021, VAERS received 5,208 reports of death (0.0017%) among people who received a COVID-19 vaccine.\n\nAs the Free Thought Project has stated from the beginning, as not to set off the “fact checkers” it is important to point out that just because data is submitted to the CDC through VAERS, this does not in anyway mean that these reactions are directly related to the COVID-19 vaccine.\n\nHowever, we’ve seen folks attempt to dismiss the number of reports, claiming they know there is nothing related or that they are being made by fake accounts or by folks attempting to manipulate the data to make the vaccine companies look bad. It is indeed true, according to the CDC that “anyone can file a report in the system.” However, filing a false VAERS report intentionally is a violation of federal law punishable by fine and imprisonment.\n\nThat being said, a medical research group in England has found a similar trend in the United Kingdom’s reporting system for adverse events, called Yellow Card. Like the VAERS system, the UK government encourages people to “report suspected side effects to medicines, vaccines or medical device and diagnostic adverse incidents used in coronavirus treatment to the Medicines and Healthcare products Regulatory Agency to ensure safe and effective use.”\n\nThe group of scientists and doctors at the Evidence-based Medicine Consultancy (EBMC) in Bath, UK has examined the data reported to Yellow Card and has found a startling trend.\n\nThe director of the EMBC, the renowned Dr. Tess Lawrie wrote to the UK Medicines and Healthcare Products Regulatory Agency (MHRA) with concerns over the data gleaned from Yellow Card.\n\nIn her letter to the MHRA, Lawrie points out that between January 4, 2021 and May 26, 2021 a total of 1,253 deaths and 888,196 adverse events were reported, which like the CDC data aren’t directly proven as correlated with the vaccine process but were reported as such. Nonetheless, Lawrie and the EMBC have concerns for the safety of those receiving the vaccine.\n\nLike the CDC data, the sheer number of reports of adverse reactions — which have surpassed the last 20 years of all adverse reactions reported for all vaccines, combined — are raising serious concerns among doctors and scientists.\n\nIn an interview with TrialSiteNews.com, Lawrie said “the total number of cases is concerning and that each person that’s reported should be followed up on to ensure there are no further problems. The scope of morbidity,” Lawrie declared, “is striking, evidencing a lot of incidents and what amounts to a large number of ill.”\n\nWhile there is not a direct correlation, EMBC’s letter to the MHRA states that “the MHRA now has more than enough evidence on the Yellow Card system to declare the COVID-19 vaccines unsafe for use in humans.”\n\nThe letter concludes with an ominous warning, stating that “Preparation should be made to scale up humanitarian efforts to assist those harmed by the COVID-19 vaccines and to anticipate and ameliorate medium to longer term effects. As the mechanism for harms from the vaccines appears to be similar to COVID-19 itself, this includes engaging with numerous international doctors and scientists with expertise in successfully treating COVID-19.\n\n“There are at least 3 urgent questions that need to be answered by the MHRA:\n\nHow many people have died within 28 days of vaccination?\n\nHow many people have been hospitalised within 28 days of vaccination?\n\nHow many people have been disabled by the vaccination?”\n\nIn the meantime, instead of investigating these legitimate concerns, governments have taken to issuing bribes and mandates in order to increase vaccine uptake.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\n**This article (Research Group Warns Adverse Event Reports Indicate COVID Vaccine ‘Unsafe for Use in Humans’) was originally published at The Free Thought Project and is re-posted here with permission.**", "opengraph": {"locale": "en_US", "type": "article", "title": "Research Group Warns Adverse Event Reports Indicate COVID Vaccine ‘Unsafe for Use in Humans’", "description": "Matt Agorist - Instead of investigating these legitimate concerns, governments have taken to issuing bribes and mandates in order to increase vaccine uptake.", "url": "https://www.wakingtimes.com/research-group-warns-adverse-event-reports-indicate-covid-vaccine-unsafe-for-use-in-humans/", "site_name": "Waking Times", "article:published_time": "2021-06-17T21:15:39+00:00", "article:modified_time": "2021-06-17T21:17:36+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/03/vaers-data-covid-vaccine-injury-feature-800x417-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vaers.hhs.gov/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://vaers.hhs.gov/reportevent.html", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions", "https://www.linkedin.com/in/tess-lawrie-71b53652?originalSubdomain=uk", "https://b3d2650e-e929-4448-a527-4eeb59304c7f.filesusr.com/ugd/593c4f_b2acdef3774b4e9ca06e9fae526fd5cd.pdf", "https://thefreethoughtproject.com/government-billions-vaccine-push-vaers/", "https://trialsitenews.com/look-into-uk-yellow-card-system-reveals-large-numbers-of-adverse-events-deaths-associated-with-covid-19-vaccine/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "http://twitter.com/MattAgorist", "http://steemit.com/@tftproject", "http://www.minds.com/mattagorist", "http://www.facebook.com/WakingTimes", "http://twitter.com/WakingTimes"], "authors": ["WakingTimes"], "publish_date": "2021-06-17T21:15:39+00:00"}