{"result_id": "311045", "URL": "https://www.wakingtimes.com/more-than-726000-covid-vaccine-injuries-reported-to-vaers-as-cdc-fda-overrule-advisory-committees-recommendations-on-third-pfizer-shot/", "timestamp": "2023-04-25 17:39:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/more-than-726000-covid-vaccine-injuries-reported-to-vaers-as-cdc-fda-overrule-advisory-committees-recommendations-on-third-pfizer-shot/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "More Than 726,000 COVID Vaccine Injuries Reported to VAERS as CDC, FDA Overrule Advisory Committees’ Recommendations on Third Pfizer Shot", "cleaned_text": "More Than 726,000 COVID Vaccine Injuries Reported to VAERS as CDC, FDA Overrule Advisory Committees’ Recommendations on Third Pfizer Shot\n\nData released Sept. 17 by the Centers for Disease Control and Prevention (CDC) showed that between Dec. 14, 2020 and Sept. 17, 2021, a total of 726,965 adverse events following COVID vaccines were reported to the Vaccine Adverse Event Reporting System (VAERS). The data included a total of 15,386 reports of deaths — an increase of 461 over the previous week.\n\nThere were 99,410 reports of serious injuries, including deaths, during the same time period — up 7,887 compared with the previous week.\n\nExcluding “foreign reports” filed in VAERS, 569,294 adverse events, including 6,981 deaths and 44,481 serious injuries, were reported in the U.S. between Dec. 14, 2020 and Sept. 17, 2021.\n\nOf the 6,981 U.S. deaths reported as of Sept. 17, 12% occurred within 24 hours of vaccination, 17% occurred within 48 hours of vaccination and 30% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nIn the U.S., 383.6 million COVID vaccine doses had been administered as of Sept. 17. This includes: 220 million doses of Pfizer, 149 million doses of Moderna and 15 million doses of Johnson & Johnson (J&J).\n\nThe data come directly from reports submitted to VAERS, the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nThis week’s U.S. data for 12- to 17-year-olds show:\n• 20,238 total adverse events, including 1,213 rated as serious and 21 reported deaths. Two of the 21 deaths were suicides.\n\nThe most recent deaths involve a 17-year old male (VAERS I.D. 1689212) with cancer who was vaccinated April 17, tested positive for COVID on July 20, was hospitalized and passed away Aug. 29; and a 16-year old female (VAERS I.D. 1694568) who died from a pulmonary embolism nine days after receiving her first Pfizer dose.\n\nOther recent reported deaths include two patients [VAERS I.D. 1655100] who died after their second dose of Pfizer, including a 13-year old female, a 15-year-old boy (VAERS I.D. 1498080) who previously had COVID, was diagnosed with cardiomyopathy in May 2021 and died four days after receiving his second dose of Pfizer’s vaccine when he collapsed on the soccer field and went into ventricular tachycardia; and a 13-year-old girl (VAERS I.D. 1505250) who died after suffering a heart condition after receiving her first dose of Pfizer.\n• 3,058 reports of anaphylaxis among 12- to 17-year-olds with 99% of cases\n\n attributed to Pfizer’s vaccine.\n• 502 reports of myocarditis and pericarditis (heart inflammation) with 494 cases attributed to Pfizer’s vaccine.\n• 108 reports of blood clotting disorders, with all cases attributed to Pfizer.\n\nThis week’s U.S. VAERS data, from Dec. 14, 2020 to Sept. 17, 2021, for all age groups combined, show:\n• 20% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 42% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 72.9.\n• As of Sept. 17, 3,726 pregnant women reported adverse events related to COVID vaccines, including 1099 reports of miscarriage or premature birth.\n• Of the 2,835 cases of Bell’s Palsy reported, 50% were attributed to Pfizer vaccinations, 42% to Moderna and 8% to J&J.\n• 606 reports of Guillain-Barré syndrome, with 39% of cases attributed to Pfizer, 33% to Moderna and 27% to J&J.\n• 152,309 reports of anaphylaxis with 42% of cases attributed to Pfizer’s vaccine, 50% to Moderna and 7% to J&J.\n• 9,441 reports of blood clotting disorders. Of those, 4,047 reports were attributed to Pfizer, 3,442 reports to Moderna and 1,903 reports to J&J.\n• 2,537 cases of myocarditis and pericarditis with 1,608 cases attributed to Pfizer, 825 cases to Moderna and 95 cases to J&J’s COVID vaccine.\n\nCDC overrules agency’s own vaccine safety committee, sides with FDA on boosters\n\nIn an “unusual move,” Dr. Rochelle Walensky, CDC director, on Thursday overruled her agency’s vaccine advisory committee recommendation to limit Pfizer’s COVID booster shot for people 65 and older, long-term care facility residents and certain people with underlying conditions.\n\nInstead, Walensky aligned with the U.S. Food and Drug Administration’s (FDA) authorization of a third dose of Pfizer’s vaccine for a broader population, including healthcare workers, grocery store workers, teachers and others whose jobs put them at “high risk” of infections, plus residents of prisons and homeless shelters.\n\nPresident Biden today acted on the news, announcing his administration will begin to deliver booster shots this week, Politico reported.\n\nThe CDC’s vaccine advisory panel in a meeting Thursday voted unanimously to approve booster doses of Pfizer’s COVID vaccine for people 65 and older, long-term care facility residents and certain people with underlying conditions. The booster dose would be given at least six months after being fully vaccinated.\n\nHowever, the advisers voted against recommending a booster dose for people whose jobs or situations put them at high risk of vaccine breakthrough infection.\n\nThe FDA on Wednesday amended the Emergency Use Authorization (EUA) for the Pfizer-BioNTech COVID vaccine to allow for a single booster shot to be administered to people 65 and older.\n\nIn addition to older Americans, the FDA authorized boosters for people 18 through 64 years of age at high risk of severe illness from COVID, and also those “whose frequent institutional or occupational exposure” to the virus puts them at high risk of serious complications from the disease caused by the virus, the agency said.\n\nOn Sept. 17, the FDA’s Vaccines and Related Biological Products Advisory Committee (VRBPAC) unanimously recommended EUA for a booster dose of Pfizer’s vaccine for people 65 and older and those with compromised immune systems — but the committee voted 16 to 2 against recommending boosters for the general population, citing a lack of long-term data. The committee said the risks did not outweigh the benefits for those people.\n\nDr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research, said the agency considered the committee’s input, but conducted it’s own review of the data in reaching a decision.\n\nExperts tell FDA vaccines ‘harm more people than they save’\n\nDuring the public comment session at VRBPAC’s Sept. 17 meeting, numerous experts said data supporting Pfizer’s request for booster doses was inadequate.\n\nSeveral people highlighted concerning patterns with data from VAERS — requesting more attention be given to potential signals and reported adverse events.\n\nDr. Jessica Rose, a viral immunologist and virologist said there are clear risk signals emerging from VAERS data — with a 1000% increase in the total number of adverse events for 2021 so far.\n\nRose pointed out that as of Aug. 27, there were 1,500 adverse reactions occurring per million fully injected people, and 1 in 660 individuals reporting immunological adverse events associated with the COVID products. She said underreporting was not considered in the data.\n\nDr. Joseph Fraiman, an emergency medicine physician in New Orleans, said during his presentation to the FDA’s safety panel that no clinical evidence exists to disprove claims the COVID vaccines are harming more people than they save.\n\nSteve Kirsch, founder of the COVID-19 Early Treatment Fund, using data from four different analyses, said even if the vaccines had 100% protection, it still means we kill two people to save one life.\n\nPhysician ‘horribly injured’ after Pfizer vaccine pleads with U.S. agencies for help\n\nIn an exclusive interview with The Defender, Danice Hertz, a 64-year-old physician who is “horribly ill” and “incapacitated” after getting Pfizer’s COVID vaccine, claims U.S. health agencies are ignoring thousands of adverse events.\n\nHertz told The Defender there are thousands of people like her — injured by COVID vaccines — who are suffering and need help, yet they’re ignored by mainstream media and U.S. health agencies.\n\nMeanwhile, COVID vaccine mandates are being rolled out for millions of Americans, with barely any discussion of the risks, she said.\n\nHertz said those injured by the vaccines are struggling to get validation and medical care because these reactions are being hidden from the medical community.\n\nShe said the FDA, CDC, and National Institutes of Health have known about vaccine injuries since the clinical trials, yet are not giving informed consent — fully disclosing the possible risks associated with vaccines and allowing the individual to decide.\n\n“This is truly shocking,” Hertz said. “Having practiced medicine for 33 years, I always had faith in our regulatory agencies. Now, having been seriously injured by this vaccine and struggling to be taken seriously and get medical assistance, I no longer have faith.”\n\nAs of Sept. 2, more than 30,000 reports of menstrual irregularities and vaginal bleeding had been made to the Medicines and Healthcare Products Regulatory Agency’s (MHRA) Yellow Card Scheme — the UK system for collecting and monitoring adverse reactions following COVID vaccines.\n\nAccording to an editorial published Sept. 16 in The BMJ, reports of adverse reactions include heavier-than-usual periods, delayed periods and unexpected vaginal bleeding. Yet, none of the COVID vaccine manufacturers list any issues pertinent to menstrual health as a side effect, and no research was done to assess the effects of the vaccines on the menstrual cycle during clinical trials.\n\nAccording to VAERS, between Dec. 14, 2020 and Sept. 17, 2021, there have been 9,589 total reports, including U.S. and some foreign, of menstrual disorders after vaccination with a COVID vaccine.\n\nHistorically, VAERS has been shown to report only 1% of actual vaccine adverse events, which means the number of actual adverse events evolving menstrual disorders could be much higher.\n\nPfizer says COVID vaccine for 5- 1o 11-year-olds ‘safe’ and shows ‘robust’ antibody response\n\nPfizer said Monday a phase 2/3 trial showed its COVID vaccine was safe and generated a “robust” antibody response in children ages 5 to 11, but experts warned Pfizer’s data is misleading, and some questioned the need for kids to be vaccinated in the first place.\n\nThese are the first results released for this age group for a COVID vaccine, and the data has not yet been peer-reviewed or published.\n\nPfizer said it plans to request EUA from the FDA soon. FDA officials said once data is submitted, the agency could authorize a vaccine for younger children in a matter of weeks.\n\nDr. Elizabeth Mumper, pediatrician, president and CEO of The RIMLAND Center and member of Children’s Health Defense’s (CHD) Scientific Advisory Committee, in an email to The Defender said, Pfizer did not share specific data on efficacy or side effects and relied on measurements of antibody responses — extrapolating from adult data to imply protection. Mumper said CHD remains skeptical of “science by press release.”\n\nNew study questions need for vaccinating children against COVID\n\nAs The Defender reported this week, a new study published in Science Direct questioned the need for vaccinating children against COVID. The study found the bulk of official COVID-attributed deaths per capita occurred mostly in the elderly with high comorbidities, while COVID-attributed deaths were negligible in children.\n\nBy comparison, the study’s authors found the bulk of normalized post-vaccination deaths occurred mostly in the elderly with high comorbidities, while the normalized post-vaccination deaths were small, but not negligible, in children.\n\nResearchers pointed out clinical trials for COVID vaccines were very short (a few months), had samples not representative of the total population, and for adolescents/children, had poor predictive power because of their small size.\n\nFurther, clinical trials for COVID vaccines did not address changes in biomarkers that could serve as early warning indicators of elevated predisposition to serious diseases, the researchers said.\n\n“Most importantly, the clinical trials did not address long-term effects that, if serious, would be borne by children/adolescents for potentially decades.”\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nOn March 8, The Defender contacted the CDC with a written list of questions about reported deaths and injuries related to COVID vaccines. We have made repeated attempts, by phone and email, to obtain a response to our questions.\n\nDespite multiple phone and email communications with many people at the CDC, and despite being told that our request was in the system and that someone would respond, we have not yet received answers to any of the questions we submitted. It has been 198 days since we sent our first email to the CDC requesting information.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "More Than 726,000 COVID Vaccine Injuries Reported to VAERS as CDC, FDA Overrule Advisory Committees’ Recommendations on Third Pfizer Shot", "url": "https://www.wakingtimes.com/more-than-726000-covid-vaccine-injuries-reported-to-vaers-as-cdc-fda-overrule-advisory-committees-recommendations-on-third-pfizer-shot/", "site_name": "Waking Times", "article:published_time": "2021-09-24T23:22:55+00:00", "article:modified_time": "2021-09-24T23:26:06+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/09/Covid-vaccine-VAERS-092421-feature.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">CDC director disregarded advice of agency’s vaccine advisory committee, clearing way for healthcare workers, teachers, and residents of long-term care facilities, homeless shelters and prisons to get a third Pfizer COVID shot.<a href=\"https://t.co/sYxt7S8y2t\">https://t.co/sYxt7S8y2t</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1441463794606108684?ref_src=twsrc%5Etfw\">September 24, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Dr. Hertz said people like her who have been seriously injured by COVID vaccines are being ignored + because health officials won’t research their injuries + potential treatments, they have nowhere to turn.<a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a>: <a href=\"https://t.co/zL66EdwTnD\">https://t.co/zL66EdwTnD</a><a href=\"https://t.co/ahmaX2UiPF\">https://t.co/ahmaX2UiPF</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1441155868318310402?ref_src=twsrc%5Etfw\">September 23, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/09/Covid-vaccine-VAERS-092421-feature.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-deaths-fda-third-pfizer-shot/", "https://www.wakingtimes.com/more-than-726000-covid-vaccine-injuries-reported-to-vaers-as-cdc-fda-overrule-advisory-committees-recommendations-on-third-pfizer-shot/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://childrenshealthdefense.org/defender/fda-warning-jj-vaccine-serious-rare-autoimmune-disorder/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1689212", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1694568", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1655100", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1498080", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1505250", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://www.nytimes.com/2021/09/24/world/covid-boosters-vaccine-cdc-director.html", "https://childrenshealthdefense.org/defender/dr-danice-hertz-injured-pfizer-covid-vaccine/", "https://t.co/sYxt7S8y2t", "https://twitter.com/RobertKennedyJr/status/1441463794606108684?ref_src=twsrc%5Etfw", "https://www.politico.com/news/2021/09/24/biden-expanded-booster-rollout-514110", "https://www.cnn.com/2021/09/23/health/pfizer-acip-booster-recommendation/index.html", "https://childrenshealthdefense.org/defender/covid-fully-vaccinated-cdc-breakthrough-cases/", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://childrenshealthdefense.org/defender/fda-authorizes-pfizer-booster-65-older-high-risk/", "https://childrenshealthdefense.org/defender/fda-panel-rejects-pfizer-booster-16-older/", "https://childrenshealthdefense.org/defender/fda-panel-rejects-pfizer-booster-16-older/", "https://www.fda.gov/about-fda/fda-organization/center-biologics-evaluation-and-research-cber", "https://www.fda.gov/advisory-committees/advisory-committee-calendar/vaccines-and-related-biological-products-advisory-committee-september-17-2021-meeting-announcement", "https://childrenshealthdefense.org/defender/fda-vaccines-harm-people-nih-boosters-will-be-approved/", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-deaths-vaccine-injuries/", "https://health.usnews.com/doctors/joseph-fraiman-982758", "https://www.fda.gov/advisory-committees/advisory-committee-calendar/vaccines-and-related-biological-products-advisory-committee-september-17-2021-meeting-announcement", "https://www.treatearly.org/team/steve-kirsch", "https://childrenshealthdefense.org/defender/dr-danice-hertz-injured-pfizer-covid-vaccine/", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/zL66EdwTnD", "https://t.co/ahmaX2UiPF", "https://twitter.com/RobertKennedyJr/status/1441155868318310402?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/dominique-de-silva-covid-vaccine-injury-neurological/", "https://childrenshealthdefense.org/defender/biden-vaccine-mandates-politicians-fight-back/", "https://childrenshealthdefense.org/defender/30000-women-uk-report-menstrual-problems-covid-shots/", "https://yellowcard.mhra.gov.uk/the-yellow-card-scheme/", "https://www.bmj.com/content/374/bmj.n2211", "https://www.businessinsider.com/covid-vaccine-periods-menstrual-cycle-2021-9", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.medicalnewstoday.com/articles/do-covid-19-vaccines-affect-menstrual-cycles-expert-calls-for-investigation#COVID-19-vaccine-background", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Amenorrhoea+%2810001928%29&SYMPTOMS[]=Dysmenorrhoea+%2810013935%29&SYMPTOMS[]=Menopausal+disorder+%2810058825%29&SYMPTOMS[]=Menopausal+symptoms+%2810027304%29&SYMPTOMS[]=Menopause+%2810027308%29&SYMPTOMS[]=Menopause+delayed+%2810027310%29&SYMPTOMS[]=Menstrual+discomfort+%2810056344%29&SYMPTOMS[]=Menstrual+disorder+%2810027327%29&SYMPTOMS[]=Menstruation+delayed+%2810027336%29&SYMPTOMS[]=Menstruation+irregular+%2810027339%29&VAX=COVID19", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-5-to-11-year-olds-fda-emergency-use-authorization/", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-positive-topline-results", "https://www.cnn.com/2021/09/20/health/pfizer-child-vaccine-data/index.html", "https://childrenshealthdefense.org/defender/sarah-green-16-year-old-neurological-symptoms-pfizer-vaccine/", "https://www.ifm.org/about/profile/elizabeth-mumper/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-5-to-11-year-olds-fda-emergency-use-authorization/", "https://www.sciencedirect.com/science/article/pii/S221475002100161X", "https://www.sciencedirect.com/science/article/pii/S221475002100161X", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/64-days-why-wont-cdc-answer-questions/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-09-24T23:22:55+00:00"}