{"result_id": "311009", "URL": "https://www.wakingtimes.com/5-historical-vaccine-scandals-suppressed-establishment/", "timestamp": "2023-04-25 17:39:00 CEST+0200", "meta": {"description": "Brendan D. Murphy - The history of vaccines is a tragic story of scandal, corruption and lies.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/5-historical-vaccine-scandals-suppressed-establishment/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "5 Historical Vaccine Scandals Suppressed by the Establishment", "cleaned_text": "“89% of doctors rely on drug company salesmen for their information.” – The Australian Doctor 1989.\n\n1. Frauds of the Founding Father – Basic Truths about Jenner\n\nHere’s number 1 of our 5 historical vaccine scandals. Edward Jenner (1749 – 1823) has been lauded as a medical pioneer and saver of the lives of millions for supposedly developing the earliest crude forms of vaccination, but is he really all that? Was he even an original thinker? See for yourself.\n\nJenner set up practice as a “surgeon” in Berkeley in the 1700s but he, in fact, did not earn the title of “doctor”\u009d at all. Jenner’s history is actually quite amusing. Dr Walter Hadwen, JP, MD, LRCP, MRCS, LSA., explained during an address in 1896:\n\nNow this man Jenner had never passed a medical examination in his life. He belonged to the good old times when George III was King— (laughter)—when medical examinations were not compulsory. Jenner looked upon the whole thing as a superfluity, and he hung up “Surgeon, apothecary,” over his doorwithout any of the qualifications that warranted the assumption. It was not until twenty years after he was in practice that he thought it advisable to get a few letters after his name. Consequently he then communicated with a Scotch University and obtained the degree of Doctor of Medicine for the sum of £15 and nothing more. (Laughter.) It is true that a little while before, he had obtained a Fellowship of the Royal Society, but his latest biographer and apologist, Dr. Norman Moore, had to confess that it was obtained by little less than a fraud. It was obtained by writing a most extraordinary paper about a fabulous cuckoo, for the most part composed of arrant absurdities and imaginative freaks such as no ornithologist of the present day would pay the slightest heed to. A few years after this, rather dissatisfied with the only medical qualification he had obtained, Jenner communicated with the University of Oxford and asked them to grant him their honorary degree of M.D., and after a good many fruitless attempts he got it. Then he sent to the Royal College of Physicians in London to get their diploma, and even presented his Oxford degree as an argument in his favour. But they considered he had had quite enough on the cheap already, and told him distinctly that until he passed the usual examinations they were not going to give him any more.” – Dr Walter Hadwen, 18961 (emphasis added)\n\nSo, after about 20 years of practicing his special brand of “medicine,” Jenner the professional bullshit artist thought he might benefit from some extra letters after his name. Thus it was that in 1790 Jenner simply bought a medical degree from St.Andrews University for £15. Welcome to the man who helped create what is now a multi-billion dollar fascist medical empire (disguised as medical “progress”)—a person who was not only a complete fraud and confidence man, but evidently a pathological liar.\n\n1791: Edward Jenner vaccinates his 18 month old son with swine-pox and eight years later in 1798 with cow-pox. His son will die of TB at the age of 21, and Jenner thereafter chooses not to vaccinate his second son. (Yes, he became a “refuser” of sorts, at least where his own family’s health was concerned!)\n\n1796: Edward Jenner in Gloucestershire, England, is falsely credited with the concept of vaccination, which he actually appropriated from the dairy maids. Hadwen in his 1896 address: “He was not, however, the discoverer. The whole thing was a superstition of the Gloucestershire dairymaids years before Jenner was born—(laughter)—and the very experiment, so-called, that he performed had been performed by an old farmer named Benjamin Jesty twenty years previously.”\n\nYes, vaccination began with an utterly unscientific superstition unbacked by any evidence at all and propagated by the local English dairymaids to one self-confident crank named Edward Jenner, a medical fraud who bought his credentials for fifteen pounds.\n\n1801: First widespread experimentation with vaccines reputedly begins. Jenner has successfully self-promoted and marketed his pseudo-medicine in spite of the overwhelming evidence against his foundational premise.\n\n1802: Jenner petitions English parliament (House of Commons) for funding using blatant falsehoods, stating that vaccination can be done with perfect safety (where have we heard that before?). Government awards Jenner 10,000 pounds (Higgins says 30,000 in his book, perhaps pertaining to Jenner’s 1807 triumphant petition which landed him further funds) for continued “experimentation.” His arm-to-arm method of vaccination ultimately proves so dangerous that it is abandoned and even prohibited. His claim of lifelong immunity was quickly exposed to be one of the more brazen pieces of self-promoting mendacity medical “science” has produced. As vaccinated subjects continued to develop the diseases they were supposedly “immunized” against, this claim was modified to roughly 7 years protection with subsequent re-vaccination deemed “necessary.” (By 1914 this “immunity” period was shortened yet again to an estimated 6-12 months(!), sharply exposing the lunacy of the vaccine paradigm to anyone paying attention. This is over 200 years ago and nothing much has changed.)\n\nJenner’s original claims for vaccination were stated in his Petition to Parliament March 17, 1802, asking for a reward for his alleged “discovery” in these words:\n\nThree strikes and you’re out, Ed! Charles M. Higgins in his excellent book The Horrors of Vaccination Exposed referred to Jenner’s statement as a “tissue of falsehoods,” and so it was. That however did not prevent Jenner from collecting the whopping sum of 30,000 pounds from the British government as a reward for his imaginative fabrications. This translates to over 3 million pounds in 1901 money (a century later)!\n\nIn the following years, through to the 1900s, many cases of smallpox in those who had received the smallpox vaccine/s continued to be recorded. In the early 1820s, while the British government was still funding Jenner’s “experiments,” he continued to do his best to hide the evidence showing his vaccines were causing more carnage than immunity. Pro-vaccinism became largely a face-saving exercise which has only swelled in scale (and funding) ever since.\n\nA study of Edward Jenner is a study in modern medicine’s roots in charlatanry. (Don’t get me started on the Rockefellers.)\n\n2. Smallpox Statistics We Were Meant to Forget\n\nMany people are starting to catch on to the dangers inherent in vaccination, but too few realise at present that there is no shortage of instances where far more harm is done than presumed “good.” We venture right back to the beginning of the 20th century in England and find that there are similar numbers of vaccine-induced deaths to smallpox deaths, except in the case of children under 5 yrs of age, where the vaccine proved much riskier than smallpox itself. See below.4\n\n1831: there is a smallpox outbreak wherein 995 vaccinated (yes, vaccinated) people developed the disease in Wurtemberg, Germany.\n\n1831: 2,000 people in Marseilles, France, who have received smallpox vaccination develop smallpox.\n\n1857-59: Vaccination in England is now enforced by fines, much to the disgust of rational medical men around the country who vigorously oppose it. Thus begins the smallpox epidemic of England that lasts until 1859, killing over 14,000 people.\n\n1854-63: Smallpox has claimed over 33,000 by this point, following compulsory vaccine program.\n\n1870-72: England’s third major epidemic claims 44,840 lives, the worst of the three which occurred following compulsory vaccination.\n\n1907: Compulsory vaccination is repealed as the grotesque failure is too obvious to disguise or “spin” with methods available at the time.\n\n1910 – 1933: in England and Wales combined, only 109 kids under 5 yrs died of smallpox; 270 died from vaccination. It’s estimated there were around 40 million people in the UK in 1910. Improved living conditions had all but wiped smallpox out despite the vaccine-induced epidemics.\n\nRepeat after me: “Safe and effective, safe and effective…”\n\na.k.a. Why Won’t Leicester Go Away?\n\n1914: Dr. C. Killick Millard, Medical Officer of Health (Leicester, England) publishes The Vaccination Question and admits that the city of Leicester, with a population of around 300,000 at the time, had for 30 years abandoned infantile vaccination and yet “miraculously” experienced an “enormous decline” in smallpox mortality.\n\nWe should consider his words carefully, because Millard was a man who at the outset was pro-vaccine (by the 1900s the endless repetition of vaccine propaganda and dogma had definitely made an impression upon the collective mind), and yet, his empirical experience with the city of Leicester caused him to change his views:\n\nThe two crucial and outstanding facts which I wish to lay stress upon, are:\n• The unexpected and remarkable experience of the town of Leicester, which for thirty years has abandoned in­fantile vaccination, yet has shown an enormous decline in smallpox mortality.\n• The fact that, although infantile vaccination is falling more and more into disuse throughout the whole country, yet smallpox, contrary to all pro-vaccinist expectation and prophecy, continues to decline and has almost disappeared. …The striking facts that in Leicester, without infantile vaccination, the decline has been greater than in most places, and that throughout the country smallpox has continued to decrease in spite of the falling off in vaccination, should surely be sufficient grounds for legitimate doubt. …If it can be shown that “sanitation”, thoroughly carried out, is alone sufficient for the effective control of smallpox in this country (as in Leicester), why inflict upon the commu­nity universal vaccination with all its inseparable drawbacks? Moreover, what justification can there be any longer for compulsion? It cannot be denied that vaccination causes, in the aggregate, very considerable injury to health, most of it only temporary, but some permanent…We must never forget that vaccination is an evil…There is not the slightest evidence that vaccination, apart from its [presumed] effect in preventing smallpox, is of the least value or anything but detrimental to the human race…During the last decade the deaths from vaccinia have several times outnumbered those from smallpox, whilst if we have regard to the amount of ill health caused by the two diseases (and putting aside for the moment the question of the alleged effect of vaccination in lessening smallpox) it looks as if vaccinia [vaccine-induced disease] were becoming, so far as the community is concerned, the more serious disease of the two.5 (emphasis added)\n\n\n\n\n\n Above: Killick’s letter to the editor of the British Medical Journal, published February 20, 1915.\n\n4. Vaccine Campaigns Were Always Known to Cause Outbreaks\n\nIn Compulsory Vaccination in England (1884), William Tebb observed: “Vaccination was made compulsory by an Act of Parliament in the year 1853 ; again in 1867; and still more stringent in 1871. Since 1853, we have had three epidemics of small-pox, each being more severe than the one preceding.”\n\nOne quite well suppressed historical trend regarding vaccines is that serious outbreaks have a habit of occurring in the most heavily vaccinated areas and dodging less vaccinated areas.1 Only the most facile logic presupposes that those areas enduring outbreaks must have not followed vaccine procedure correctly, or had the misfortune of “bad batches,” etc., etc. The logical conclusion to draw from the evidence is that the vaccine campaigns were actually creating epidemics where none were likely to ever occur. Eminent medical men recognised this in the 1800s but did we listen?\n\nWhile advocates argue correlation doesn’t equal causation (true enough), no independent investigator is satisfied with ignoring the mountains of evidence indicating causality, and which date back to the very beginnings of vaccination. Big Pharma prostitutes of course can warn of the post hoc ergo propter hoc fallacy, but some of us extend our efforts end energies beyond mere fancy rhetoric – we also note that the correlation has a bi-directional effect, i.e., disease incidence and mortality regularly increases in the wake of vaccination, and also regularly drops with a corresponding decrease in vaccination rates. It goes both ways.Meaningless coincidence?\n\nAbove: Anatomy of 3 epidemics and the smallpox statistics from England for the period 1857-1873, spanning the outbreaks.6\n\nNotice the disproportionately high increases in smallpox mortality rates above as compared to population growth. Meanwhile, we remember that Leicester abandoned infantile vaccination and eliminated smallpox simply by thoroughly enhancing sanitation methods. “It’s the environment, stupid!” Our programmed fear of smallpox, flu, and other “dreaded” diseases is out of all proportion with reality and shows that we have forgotten how potent basic natural and common sense measures can be in staying healthy. Also worth noting: exposure doesn’t equal illness – the internal terrain must conduce to the development of symptoms.\n\nBelow is a graph also from Tebb’s book showing that the mandating of smallpox vaccination did not prevent the mortality rate from more than doubling within thirty years, while the population increased by only about one third.\n\nIn summarising the origins of vaccine fraud, coverups, and the resultant vaccine religion, Jennifer Craig PhD states:\n\n5. Statistical Wizardry: When In Doubt White it Out!\n\nOne of the lynch pins of the vaccine machine has always been systematic (and often high-level) deception in order to maintain the illusion of efficacy. Put bluntly, when things don’t pan out as the vaccinists want, they simply tinker with the data and play semantic games to create figures that seem to support a given vaccine program/goal. Sometimes, the tactic is more straightforward: gather the data and bin it so it never sees the light of day, as William Thompson has recently elucidated for us regarding the MMR scandal whereby the CDC knew of the MMR-autism link and deliberately buried the evidence (for some 14 years!). Meanwhile, Dr Andrew Wakefield was defamed, ostracized, chased out of England, and left to pick up the pieces of his life without a shred of evidence supporting the vindictive narrative created against him. However, we’re focusing in on pre-WWII material here for a historical perspective that will be easy to digest.\n\nMaurice Beddow Bayly, member of the Royal College of Surgeons, LRCP, wrote in 1934:\n\nIn short, when the numbers don’t support pro-vax dogma, medical authorities simply change them to suit their purposes. Considering the embarrassingly large sums of money that governments have invested in vaccine campaigns (and the attendant propaganda/psychological warfare), it is somewhat understandable that in their cowardly bureaucratic state of mind, rather than admit to such monstrous mistakes which have generated such incomprehensible human suffering, said bureaucrats and medical stooges simply try to hide the evidence and save face. (There is of course the malignant influence of Big Pharma and its greed lurking in the background too, along with the publicly known depopulation program.) We will elaborate on this statistical fraud theme with more recent examples in our follow up.\n\nAfter Jenner’s death, when vaccinated people continually contracted smallpox, thus repeatedly proving the fraud of the smallpox vaccine, the medical records were to show they had “pustular eczema” instead.9 Instead of admitting the dangerous and ineffectual nature of the earliest vaccines, however, authorities plowed ahead creating more and more vaccines, all on the same superstitious premises that gave birth to the mythology now rammed down our throats.\n\nThe fact is that the medical authorities have been lying and covering their tracks all along, just as Edward Jenner, the godfather of the vaccine lie, was right from the start. So vaccines are safe and effective are they? Is that why after Japan started compulsory smallpox vaccination in 1872 smallpox rates increased thereafter? After twenty years, their records indicated 165,774 cases with 29,979 deaths – ALL of them vaccinated. Meanwhile, in Australia, where there was no such compulsion, there were only three deaths in fifteen years.11\n\nClearly we are protecting ourselves from these diseases somehow, and it starts with the basics: sanitation, hygiene, and nutrition. I could go on and on with the stat’s but hopefully you get the idea. Those of you inclined to object to my “fixation” on smallpox while I lay out some basic historical context for vaccination must wait for the follow up article for a more “inclusive” exposé based on more recent material. If you love vaccines you probably won’t like it. See below for concluding sentiments.\n\nA Note on Planned Forced Vaccination through the Biosecurity Act of 2015 (and equivalent legislation)\n\nThe technocracy thrown up around us and calling itself “civilization” is a dark and brutal beast emanating from the collective unconscious, and unless we collectively awaken and take a stand for truth and the right to self-determination, then this situation will only become more dire (as is planned), particularly with the TTP and its equivalents now brought in, setting the stage for full-blown corporate control of all facets of human life. With measures such as the Biosecurity Act 2015 (Australia see here), the government will be creating the legal framework to forcibly vaccinate people against their will (including those subjects in the high risk category for severe abreaction) under the pretense of protecting public health. Consider Dr Hadwen’s 1896 statement (from his aforementioned speech) on the issue of compulsory vaccination:\n\nNearly forty years later, researcher Anne Riley Hale shared this sentiment on the subject of mandatory vaccination:\n\nFear and ignorance are used daily by the Establishment to scare people so silly that the thought of investigating the evidence for and against vaccination never even occurs to them. Our collective ignorance is the best weapon the Establishment has to coerce and cajole us into a forced vaccination agenda. If you want to have some idea of what that will look like if it succeeds, just take a look at America where the vaccine schedule is the most intense on the planet, the infant death rate is absolutely atrocious (far worse than various countries using far less vaccines), and autism is now at 1 in 45 and still rising – just as the vaccine schedule is planned to continue to do so.\n\nThus far, as we have let our egos get in the way of learning the truth, it is the children primarily who have paid, but if the forced vaccine agenda succeeds, we all will.\n\nKnowledge is power, and vaccine slogans are not knowledge. Propaganda is not wisdom. Groupthink is not a sound basis for epistemology. Truth is not nearly so well funded as cancerous lies, and the peer review system is broken (just ask any of the scientists we have interviewed!). Remember to ask “who benefits?”\n\nWe can change this if we want. What are we choosing to create from here? Have we had enough of the vaccine scandals?\n• See History and Pathology of Vaccination, by Dr. Edgar M. Crookshank, London, 1889, p 173, Vol. I.\n• Walene James, Immunization: The Reality Behind the Myth\n\nBrendan D. Murphy – Co-founder of Global Freedom Movement and host of GFM Radio, Brendan D. Murphy is a leading Australian author, researcher, activist, and musician. His acclaimed non-fiction epic The Grand Illusion: A Synthesis of Science & Spirituality – Book 1 is out now! Come and get your mind blown at www.brendandmurphy.net\n\n \n\n “What a wonderful job of collating and integrating you have done! Every person in the field of ‘paranormal’ psychology or related topics should have this book as a major reference.” – Dr. Buryl Payne\n\n“A masterpiece…The Grand Illusion is mind-blowing.” – Sol Luckman, author of Potentiate Your DNA.\n\n“You’ve written the best synthesis of modern science and esoteric science that I’ve seen in 40 years of study in that area. Brilliant!” – Michael K. Wade\n\nThis article (5 Historical Vaccine Scandals Suppressed by the Establishment) was originally published and is copyrighted by Global Freedom Movement and is published here with permission.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Historical Vaccine Scandals Suppressed by the Establishment", "description": "Knowledge is power, and vaccine slogans are not knowledge. Propaganda is not wisdom. Groupthink is not a sound basis for epistemology.", "url": "https://www.wakingtimes.com/5-historical-vaccine-scandals-suppressed-establishment/", "site_name": "Waking Times", "article:published_time": "2021-06-11T16:21:22+00:00", "article:modified_time": "2021-06-11T16:51:56+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/03/vaccine-mmr-696x366-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.wakingtimes.com/ads/vaccineexempt.html", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vaccine-schedule-then-and-now-2016.jpg", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vacc-glen-dettman-2.jpg", "https://www.wakingtimes.com/ads/miraclecure.html", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vaccine-Millard-BMJ-quote-1915.png", "https://www.wakingtimes.com/ads/vaccinetruth.html", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vacc-smallpox-1857-1873-TEBB.png", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vacc-smallpox-1880-TEBB.png", "http://globalfreedommovement.org/event/encore-vaccine-induced-autism-with-dr-andrew-wakefield/", "https://www.wakingtimes.com/ads/infinite-brain.html", "https://www.wakingtimes.com/wp-content/uploads/2016/07/tilden-smallpox-banner.gif", "http://globalfreedommovement.org/event/encore-global-vaccine-agenda-disclosed-nicole-paul/", "https://www.wakingtimes.com/ads/vaccinetruth.html", "https://www.wakingtimes.com/wp-content/uploads/2016/07/vacc-Creighton-GFM-meme.jpg", "https://www.wakingtimes.com/ads/miraclecure.html", "https://www.wakingtimes.com/contributors/brendan-d-murphy/", "https://www.wakingtimes.com/contributors/brendan-d-murphy/", "http://globalfreedommovement.org/", "http://globalfreedommovement.org/radio", "http://www.amazon.com/gp/product/1452507112/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1452507112&linkCode=as2&tag=wakitime09-20&linkId=ZWSR46ZGBMH56QEL", "http://www.brendandmurphy.net/", "http://www.amazon.com/gp/product/0982598319/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982598319&linkCode=as2&tag=wakitime09-20&linkId=ADDF6D5XTZYCQAYG", "http://www.globalfreedommovement.org/", "https://www.wakingtimes.com/2016/07/28/5-historical-vaccine-scandals-suppressed-establishment/", "http://globalfreedommovement.org/politicians-vs-doctors-vaccines-quacks-hippies-internet/", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes"], "authors": ["WakingTimes"], "publish_date": "2021-06-11T16:21:22+00:00"}