{"result_id": "311029", "URL": "https://www.wakingtimes.com/vaccine-passports-and-medical-martial-law/", "timestamp": "2023-04-25 17:39:14 CEST+0200", "meta": {"description": "Jesse Smith - Almost one year ago, former President Trump declared a national emergency and the White House announced a 15-day plan to slow the spread of the coronavirus.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/vaccine-passports-and-medical-martial-law/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Vaccine Passports And Medical Martial Law", "cleaned_text": "The Setup – Almost one year ago, former President Trump declared a national emergency and the White House announced a 15-day plan to slow the spread of the coronavirus. Governments around the world either preceded the U.S. or soon followed with similar pronouncements. The upsurge in totalitarianism since these edicts were installed is mind-boggling.\n\nStaying home, social distancing, and hand washing were the first steps in the slippery slope towards medical martial law. Then came the lockdowns and mandatory face mask policies. These were soon followed by pressure to take a COVID-19 test, contact tracing, and quarantines. Next were vaccines that were rushed to production, given only “emergency use authorization” by the FDA and still deemed experimental, having completely skipped long-term safety studies. Now, the threat of vaccine passports/certificates represents the next step towards complete tyranny and subjugation of the people.\n\nAll of these draconian measures have served as social engineering tools to get people used to having “experts” and government officials tell them what to do. In fact, you could argue that all of humanity (outside those in authority) has been slowly tortured over the past year. With staggering numbers of suicides and rising rates of substance abuse, many decided to just check out. The remaining masses have been subjected to classical conditioning like Pavlov’s dogs. During this “plandemic”, most people have been retrained to depend on authorities to tell them when they can go to work, visit loved ones, travel, go to church, hug someone or even shake their hand.\n\nThere is a sickness going around that’s much worse than any coronavirus. It’s called “Stockholm Syndrome” and it infects those who are too ignorant, trusting, and fearful to question those in authority and hold them accountable. Infected people lap up every word people like Dr. Anthony Fauci say, no matter how many times he’s contradicted himself or even been caught lying. They fully agree with taking a vaccine rolled out at warp speed with completely new technology that’s never before been tested on human beings. They yell at people in stores who refuse to wear face masks. They call anyone with facts contradicting the mainstream narrative a conspiracy theorist. They cheer when people who disagree with them get censored, deplatformed, and even lose their jobs. They don’t balk when authorities extend or issue new state of emergency rules restricting their freedom. They don’t even get angry when hypocritical officials are caught violating their own rules. But they are quick to attack anyone challenging their beloved rulers and attempting to restore liberty such as when Texas Governor Greg Abbott reopened the state and lifted mask mandates (well, sort of).\n\nWe all know someone infected with this syndrome. It might be a family member, close friend, co-worker or neighbor. They have been conditioned to love their despotic overlords. In turn they’ve learned to love their slavery and cheer when authorities clamp down and then “allow” them to do what was once normal and considered basic rights. It’s because of people like this that greater restrictions and oppression await us all.\n\nOne Passport to Rule Us All\n\nVaccine or “immunity” passports represent the final nail in the coffin of freedom. If the following headlines don’t get you angry, then you must be among those with Stockholm Syndrome who are unassumingly helping the elites erect a digital prison planet that will be extremely difficult to escape.\n• “The World Much Smaller for Those Without Vaccines”\n• “Welcome to the New Normal, Let’s See Your Immunity Passport”\n• “Inside The Race To Create A Covid Passport And Change Travel As We Know It”\n\nThe passports are already being used in Israel to “allow” vaccinated citizens to resume visiting places such as gyms, hotels, and sporting venues. The Israeli “Green Pass” has created a de facto medical apartheid state with those who refuse vaccination (for whatever reason) being treated like second class citizens. In February, vaccinated Israelis got the opportunity to enjoy an outdoor concert, while the country’s unvaccinated social pariahs were barred from attending.\n\nIsraeli Health Minister Yuli Edelstein warned that if citizens violate the Green Pass scheme, he would not hesitate to close the economy again, stating:\n\nTo top it off, Israel has also issued “Freedom Bracelets” to be worn by those entering the country from abroad. The bracelets will take the place of a mandatory two-week quarantine in a special facility. So, when traveling into Israel, your choices are to wear a monitoring device like a convicted felon or face a two-week quarantine in a military administered hotel. The bracelets were developed by SuperCom, a company specializing in offender tracking devices. While discussing the Israeli government contract for the quarantine bracelets, SuperCom CEO and president Ordan Trabelsi, stated:\n\nDoes this sound like freedom to you?\n\nIlana Rachel Daniel, a health advisor and information officer for the Rappeh political party in Jerusalem, has shined the light on Israel’s attempts to deny informed consent and negate bodily autonomy. In the following interview she tackles a “journalist” head on, pointing out that the COVID-1984 vaccines have not received full FDA approval among several other salient points.\n\nIn an audio recording, Daniel sounded the alarm about the drastic measures the government was installing, saying:\n\nCheck Point Software Technologies Ltd., an Israeli cybersecurity company, has implemented the vaccine apartheid system for its employees. If you are fully vaccinated, you get to enjoy company perks such as hair salon treatments, access to the on-site gym and play in game rooms that your unvaccinated peers can’t access. Without proof of vaccination or a negative COVID-19 test, you can’t even eat with your co-workers, but must remain isolated at your desk. By April, those who can’t demonstrate vaccination proof will not even be allowed to enter the building!\n\nRegarding the policies, company spokesman Gil Messing said:\n\nTo top it all off, Yuli Edelstein further warned,\n\nAfter recognizing that these statements presented a legal nightmare, health officials acknowledged that those with negative tests from the previous 48 hours would also be allowed entry. However, officials want to make getting tested more difficult by restricting locations and increasing prices so that more people opt for vaccines instead.\n\nTo add insult to injury, Israel’s parliament joined action taken previously by the Spanish government in approving a law to create a registry of people who choose not to be vaccinated against the coronavirus. The personal information of vaccine refusers will be shared with local and national authorities for at least the next three months.\n\nThough the Green Pass initiative is only supposed to last for six months, Prime Minister Binyamin Netanyahu is in talks with Pfizer and Moderna to deliver extra vaccines to allow for a second dose for all later this year. This would mean that the current passports would have to be renewed all over again for those receiving the second vaccination.\n\nThrough international coalitions like GAVI and COVAX, governments and Big Pharma have morphed into a singular medical gestapo cajoling all to take their vaccines through propaganda, extreme coercion tactics, and hiding factual information. Governments have completely sold out their populations to the larger agenda I spelled out clearly in Beware the Vaccine Pt. 5. Pfizer has even demanded that countries purchasing its vaccine surrender military bases, embassy buildings, and other sovereign assets as collateral against expected vaccine injury lawsuits.\n\nThe UK and many European countries are also seriously considering implementing the passport scheme. The European Commission recently announced draft legislation to create a “Digital Green Pass.” India has joined the list, adding a QR code certificate version. It shouldn’t surprise anyone that China has also launched their own version called the International Travel Health Certificate available from its WeChat mobile app.\n\nFor Americans, please don’t rest on your laurels thinking that this is something only happening abroad. The U.S. is also firmly on board with the vaccine passport scheme. Currently, the state of New York is testing its own vaccine passport called the “Excelsior Pass.” The official announcement states:\n\nAirlines are also major peddlers of the passport hustle. The president of Airlines for America (A4A) is pressuring Congress on behalf of airlines such as American, Delta, JetBlue, Southwest, United, and Alaska Airlines to strongly consider going against WHO’s current recommendation of not making vaccine passports mandatory for air travel.\n\nThe Los Angeles school district has partnered with Microsoft to launch the ‘Daily Pass’ app. The app’s software will be used to schedule and track district-managed coronavirus tests and vaccinations. Students and faculty must gain app clearance before being allowed into schools once they open.\n\nRecently, Arthur Kaplan, an NYU medical ethics professor, went on CNN to espouse the idea of these Naziesque “yellow badge” vaccine passports, stating:\n\nIt’s All Part of the Global Agenda\n\nThe “debate” over whether to implement vaccine passports is happening all over the world. No matter what these passport apps are called, they will likely all be underpinned by a common software or framework that will enable them to “talk to each other” despite the country of origin. The leading developers of this technology include AOK Pass, Common Pass, the Vaccination Credential Initiative, Good Health Pass Collaborative, and the IATA Travel Pass.\n\nWhat all of these companies, organizations, and initiatives have in common are their ties to the World Economic Forum, the digital transformation of society, and global governance. If you haven’t seen the documentary Decoding Davos: The Global Endgame, I suggest you do so soon. It provides a clear understanding of how this global think tank is manipulating the world into a “Great Reset” that promises strict control of all human life under new digital technology such as vaccine passports.\n\nWith President Biden marching in lockstep with these global plans, recently threatening to “reinstate restrictions” if sufficient progress in fighting the virus isn’t made, I wonder how long Americans will continue to be lulled to sleep thinking that freedom and normalcy is just around the corner?\n\nThe authoritarian overlords installing this new medical martial law regime will demand total compliance before all is said and done. If you decide for whatever reason to refuse the coronavirus vaccine, prepare to be treated like an outcast and possibly deemed a criminal as this “Minority Report” dystopia marches on. Now is the time to do whatever you can to free yourself from dependence on the systems currently in place and those the global cabal are planning to make the new normal in the near future.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Passports And Medical Martial Law", "description": "Jesse Smith - Almost one year ago, former President Trump declared a national emergency and the White House announced a 15-day plan to slow the spread of the coronavirus.", "url": "https://www.wakingtimes.com/vaccine-passports-and-medical-martial-law/", "site_name": "Waking Times", "article:published_time": "2021-03-18T23:33:37+00:00", "article:modified_time": "2021-03-18T23:33:53+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/03/Featured-Image_MedicalMartialLaw_effects_jpg.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">NEW: Issuing an executive order to lift the mask mandate and open Texas to 100 percent. <a href=\"https://t.co/P4UywmWeuN\">pic.twitter.com/P4UywmWeuN</a></p><p>— Gov. Greg Abbott (@GovAbbott) <a href=\"https://twitter.com/GovAbbott/status/1366843339836977165?ref_src=twsrc%5Etfw\">March 2, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Spurs coach blasts Texas governor for lifting mask mandate: \"ridiculous\" and \"ignorant\" <a href=\"https://t.co/8jqhkCtTj1\">https://t.co/8jqhkCtTj1</a> <a href=\"https://t.co/H9eI3R1538\">pic.twitter.com/H9eI3R1538</a></p><p>— The Hill (@thehill) <a href=\"https://twitter.com/thehill/status/1367561994136674314?ref_src=twsrc%5Etfw\">March 4, 2021</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1180", "height": "664", "embed_code": "<iframe loading=\"lazy\" title=\"Rappeh Party Calls Israel a 'Medical Apartheid'\" width=\"1180\" height=\"664\" src=\"https://www.youtube.com/embed/2b9uOWNEzDM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/2b9uOWNEzDM?feature=oembed"}], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/03/Featured-Image_MedicalMartialLaw_effects_jpg.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "http://truthunmuted.org/vaccine-passports-and-medical-martial-law/", "https://www.wakingtimes.com/vaccine-passports-and-medical-martial-law/", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "http://www.therichest.com/shocking/the-15-craziest-forms-of-psychological-torture/", "http://www.newsweek.com/dr-fauci-americans-should-never-shake-hands-again-coronavirus-influenza-1496772", "http://truthunmuted.org/mask-up-the-con-game-to-destroy-your-freedom/", "http://www.britannica.com/science/Stockholm-syndrome", "https://t.co/P4UywmWeuN", "https://twitter.com/GovAbbott/status/1366843339836977165?ref_src=twsrc%5Etfw", "https://t.co/8jqhkCtTj1", "https://t.co/H9eI3R1538", "https://twitter.com/thehill/status/1367561994136674314?ref_src=twsrc%5Etfw", "http://web.archive.org/web/20210311173039/http://edition.cnn.com/2021/03/05/health/cdc-vaccinated-covid-19-guidelines-wait/index.html", "http://truthunmuted.org/vaccine-certificates-digital-ids-and-biometrics/", "http://archive.is/FaJJ2", "http://archive.is/pd6oC", "http://archive.is/3g410", "http://www.forbes.com/sites/oliverwilliams1/2021/02/21/inside-the-race-to-create-a-covid-passport-and-change-travel-as-we-know-it/?sh=4b2ff73d5cde", "http://www.thenationalnews.com/mena/covid-passport-vaccinated-israelis-get-green-pass-to-normal-life-1.1172544#5", "http://www.elitereaders.com/tel-aviv-first-outdoor-concert-green-pass-holders/", "http://youtu.be/qgd_mVbZBcU", "http://www.biometricupdate.com/202102/supercom-secures-7m-to-address-biometric-offender-monitoring-cybersecurity-demand", "http://www.jpost.com/israel-news/a-bracelet-of-freedom-says-ceo-in-charge-of-covid-electronic-monitoring-660230", "http://youtu.be/2b9uOWNEzDM", "http://youtu.be/Qpj-tSjufcI", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "http://www.bloomberg.com/news/articles/2021-03-04/covid-vaccine-news-how-life-will-change-for-people-who-don-t-get-shots", "http://www.timesofisrael.com/government-plans-to-punish-businesses-that-serve-unvaccinated-customers-report/", "http://www.politico.eu/article/spain-coronavirus-vaccine-refusal-registry-with-eu-countries/", "http://www.cbsnews.com/news/covid-vaccine-israel-law-personal-information-privacy/", "http://www.israelnationalnews.com/News/News.aspx/297683", "http://truthunmuted.org/beware-the-vaccine-pt-5-the-covid-vax-scheme/", "http://articles.mercola.com/sites/articles/archive/2021/03/08/pfizer-covid-vaccine.aspx", "http://www.travelandleisure.com/travel-news/uk-pushing-for-standardized-vaccine-passport", "http://time.com/5944165/vaccine-passports-europe/", "http://www.hindustantimes.com/cities/others/got-covid-19-vaccine-you-ll-get-qr-code-certificate-on-phone-101610479579084.html", "http://asia.nikkei.com/Spotlight/Coronavirus/China-rolls-out-vaccine-passport-aiming-to-revive-foreign-travel", "http://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and", "http://sociable.co/government-and-policy/major-airlines-make-digital-health-passports-workable-easy-passengers-a4a-president-testifies/", "http://www.washingtonpost.com/travel/2021/01/22/passport-vaccine-covid-flights-international/", "http://www.latimes.com/california/story/2021-02-22/lausd-launches-daily-pass-app-track-covid-schools", "http://youtu.be/tPYMgwN-oII", "http://www.aokpass.com/", "http://thecommonsproject.org/commonpass", "http://vaccinationcredential.org/", "http://www.goodhealthpass.org/", "http://www.iata.org/en/programs/passenger/travel-pass/", "http://truthunmuted.org/decoding-davos-the-global-endgame/", "http://www.facebook.com/WakingTimes", "http://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WTStaff"], "publish_date": "2021-03-18T23:33:37+00:00"}