{"result_id": "311044", "URL": "https://www.wakingtimes.com/federal-lawsuit-seeks-immediate-halt-of-covid-vaccines-cites-whistleblower-testimony-claiming-cdc-is-under-counting-vaccine-deaths/", "timestamp": "2023-04-25 17:39:23 CEST+0200", "meta": {"description": "Megan Redshaw - America’s Frontline Doctors filed a motion to stop the use of Emergency Use Authorization (EUA) COVID vaccines for anyone under 18, anyone with natural immunity or anyone who hasn’t received informed consent.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/federal-lawsuit-seeks-immediate-halt-of-covid-vaccines-cites-whistleblower-testimony-claiming-cdc-is-under-counting-vaccine-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Federal Lawsuit Seeks Immediate Halt of COVID Vaccines, Cites Whistleblower Testimony Claiming CDC Is Under-Counting Vaccine Deaths", "cleaned_text": "Federal Lawsuit Seeks Immediate Halt of COVID Vaccines, Cites Whistleblower Testimony Claiming CDC Is Under-Counting Vaccine Deaths\n\nAmerica’s Frontline Doctors (AFLDS) filed a motion July 19, seeking immediate injunctive relief in Alabama Federal District Court to stop the use of Emergency Use Authorization (EUA) COVID vaccines — Pfizer/BioNTech, Moderna and Johnson & Johnson (J&J) — for three groups of Americans.\n\nAccording to a press release, AFLDS is asking to immediately stop administration of experimental COVID vaccines in anyone 18 and younger, all those who have recovered from COVID and acquired natural immunity, and every other American who has not received informed consent as defined by federal law.\n\nThe 67-page motion requests the judge issue a preliminary injunction pursuant to § 360bbb–3(b)(1)(C) for the following reasons:\n• There is no emergency, which is a prerequisite to issuing EUA and EUA renewals for COVID vaccines.\n• There is “no serious or life-threatening disease or condition.”\n• Vaccines do not diagnose, treat or prevent SARS-CoV-2 or COVID.\n• Known and potential risks of the vaccine outweigh their known and potential benefits.\n• There are adequate, approved and available alternatives to vaccines.\n• Healthcare professionals and vaccine candidates are not adequately informed.\n\nThe authors of the motion attached a declaration by a whistleblower who came forward alleging deaths occurring within 72 hours of receiving a COVID vaccine are significantly under-reported in the Centers for Disease Control and Prevention’s (CDC) Vaccine Adverse Events Reporting System (VAERS) maintained by the U.S. Food and Drug Administration (FDA).\n\nAs of July 9, reported deaths in the VAERS totaled 10,991. Of those, 4,593 occurred within 72-hours of vaccination.\n\nThe whistleblower — a computer programmer who developed more than 100 distinct healthcare fraud algorithms, and who has expertise in healthcare data analytics that allows her to access Medicare and Medicaid data obtained by the Centers for Medicare and Medicaid Systems (CMS) — filed a sworn statement under penalty of perjury alleging the actual number of COVID vaccine-related deaths is closer to 45,000.\n\nThe whistleblower alleged that VAERS, while extremely useful, is under-reported by a conservative factor of at least five.\n\nIn her statement, she said:\n\n“On July 9, 2021, there were 9,048 deaths reported in VAERS. I verified these numbers by collating all of the data from VAERS myself, not relying on a third party to report them. In tandem, I queried data from CMS medical claims with regard to vaccines and patient deaths, and have assessed that the deaths occurring within 3 days of vaccination are higher than those reported in VAERS by a factor of at least 5. This would indicate the true number of vaccine-related deaths was at least 45,000. Put in perspective, the swine flu vaccine was taken off the market which only resulted in 53 deaths.”\n\nAFLDS said the findings were shocking, and informed consent is impossible when safety data is not accurate.\n\n“It is unlawful and unconstitutional to administer experimental agents to individuals who cannot make an informed decision as to the true benefits and risks to the vaccine on an independent basis. They must be of an age or a capacity to make informed decisions and have been provided with all of the risk/benefit information necessary to make an informed decision.”\n\nOne of the named plaintiffs, Deborah Sobczak, the mother of a 15- and 17-year-old, said in the press release:\n\n“My child will not be the subject of an experiment. What kind of monsters are we allowing to control us? Perfectly healthy children have developed heart inflammation, brain bleeding and even died! I have had enough. I am not sacrificing my child so a pharmaceutical company can experiment on her. This madness has to stop.”\n\nThere is no emergency warranting EUA of COVID vaccines, plaintiffs allege\n\nAccording to the complaint, the U.S. Department of Health and Human Services (HHS) secretary, named as one of the defendants in the lawsuit, declared on Feb. 4, 2020, pursuant to § 360bbb–3(b)(1)(C), that SARS-CoV-2 created a “public health emergency.”\n\nThis initial emergency declaration has been renewed repeatedly and remains in force today — a necessary legal prerequisite for the issuance of vaccine EUAs, the complaint states. EUA allowed the mass use of the vaccines by the American public before the completion of the standard regimen of clinical trials and FDA approval.\n\nPlaintiffs allege the emergency declaration and its multiple renewals are illegal because there is no underlying emergency. Using HHS COVID death data, SARS CoV-2 has an overall survivability rate of 99.8% globally, which increases to 99.97% for persons under the age of 70. This is consistent with the seasonal flu, the complaint states.\n\nPlaintiffs allege HHS’ data is deliberately inflated. On March 24, 2020, HHS changed the rules applicable to coroners and others responsible for producing death certificates and making “cause of death” determinations exclusively for COVID.\n\nThe rule change states: “COVID-19 should be reported on the death certificate for all decedents where the disease caused or is assumed to have caused or contributed to death.”\n\nAccording to the complaint, HHS statistics showed 95% of deaths classified as “COVID-19 deaths” involved an average of four additional comorbidities. Plaintiffs claim the CDC knew the rules for coding and selection of the underlying cause of death would result in COVID being the underlying cause more often than not.\n\nPlaintiffs said the actual number of COVID cases is also far lower than the reported number due to emergency use of polymerase chain reaction (PCR) tests, which are used as a diagnostic tool for COVID. The PCR tests are themselves experimental products, authorized by the FDA under separate EUAs. The package inserts state PCR tests should not be used to diagnose COVID.\n\nThe complaint alleges the way in which the PCR tests are being administered knowingly guarantees an unacceptably high number of false positive results.\n\nAFLDS medico-legal researchers analyzed the accumulated COVID vaccine risk data and found migration of the pathogenic SARS-CoV-2 spike protein in the body. Yet vaccines were authorized without any studies demonstrating where the spike proteins traveled in the body following vaccination, how long they remain active and what effect they have, the complaint states.\n\nAFLDS researchers analyzed VAERS and discovered an increased risk of death from COVID vaccines. The database indicated vaccine deaths in the first quarter of 2021 represented a 12,000% to 25,000% increase in vaccine deaths, year-on-year.\n\nFrom 2009 to 2019, there were 1529 reported deaths associated with all vaccines reported to VAERS, according to the motion. In the first quarter of 2021, there were more than 4,000 reported deaths with 99% of all reported vaccine deaths in 2021 attributed to the COVID vaccine. Only 1% were attributed to other vaccines in the system.\n\nPlaintiffs also disclosed evidence of reproductive harm, vascular disease, autoimmune disease, neurological damage and they highlighted an increased risk of harm for children with COVID vaccines to support their position.\n\nWhy the secrecy around V-Safe data?\n\nThe complaint called attention to the secrecy of the CDC’s V-Safe system — a parallel system used to track reported adverse events via a smartphone app controlled exclusively by the CDC.\n\nPlaintiffs raised concerns that information in V-Safe exceeds that in VAERS. They claim VAERS is inaccurate because it potentially includes fewer than 1% of all vaccine adverse events, and the federal government is failing to provide data from other monitoring sources such as V-Safe, CMS and the military.\n\nPlaintiffs stated informed consent cannot be given without understanding the risks. They said they can’t help but wonder why HHS would fail to disclose to the public critical information related to risk from it’s reporting systems, “particularly in light of the fact that they have had the time and resources to study and extend the authorizations on the vaccines, build an enormous vaccine marketing machine and roll out vaccine clinics all over the nation.”\n\nThe lawsuit was filed by several law firms, including RENZ Law. The complaint and whistleblower declaration can be read here.\n\nMegan Redshaw is a freelance reporter for The Defender. She has a background in political science, a law degree and extensive training in natural health.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "Federal Lawsuit Seeks Immediate Halt of COVID Vaccines, Cites Whistleblower Testimony Claiming CDC Is Under-Counting Vaccine Deaths", "description": "Megan Redshaw - America’s Frontline Doctors filed a motion to stop the use of Emergency Use Authorization (EUA) COVID vaccines for anyone under 18, anyone with natural immunity or anyone who hasn’t received informed consent.", "url": "https://www.wakingtimes.com/federal-lawsuit-seeks-immediate-halt-of-covid-vaccines-cites-whistleblower-testimony-claiming-cdc-is-under-counting-vaccine-deaths/", "site_name": "Waking Times", "article:published_time": "2021-07-21T14:20:18+00:00", "article:modified_time": "2021-07-21T15:21:17+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/07/Covid-Vaccine-many.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/07/Covid-Vaccine-many.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/americas-frontline-doctors-federal-lawsuit-halt-covid-vaccines-cdc-vaccine-deaths/", "https://www.wakingtimes.com/federal-lawsuit-seeks-immediate-halt-of-covid-vaccines-cites-whistleblower-testimony-claiming-cdc-is-under-counting-vaccine-deaths/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://childrenshealthdefense.org/defender/autopsy-tim-zook-mrna-pfizer-vaccine-myocarditis/", "https://childrenshealthdefense.org/defender/moderna-covid-vaccine-clinical-trials-pregnant-women/", "https://childrenshealthdefense.org/defender/fda-warning-jj-vaccine-serious-rare-autoimmune-disorder/", "https://americasfrontlinedoctors.org/press_releases/aflds-files-lawsuit-seeking-immediate-injunctive-relief-revoking-the-emergency-use-of-covid-19-vaccines-based-on-disturbing-new-mortality-data/", "https://www.fda.gov/drugs/types-applications/investigational-new-drug-ind-application#Introduction", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/millions-unvaccinated-risk-losing-civil-liberties-covid-vaccine-policy/", "https://childrenshealthdefense.org/defender/covid-vaccines-administrators-must-inform-risks/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://www.law.cornell.edu/uscode/text/21/360bbb-3", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/Jane%20Doe%20Declaration.pdf", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/child-health-topics/take-action/tell-schools-universities-no-vaccine-mandates-for-children-young-adults/?utm_source=banner", "https://childrenshealthdefense.org/defender/vaers-deaths-injuries-reported-cdc-covid-vaccines-moderna-pregnant-women/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/Jane%20Doe%20Declaration.pdf", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://renz-law.com/45k-whistleblower-suit", "https://www.law.cornell.edu/uscode/text/21/360bbb-3", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://childrenshealthdefense.org/defender/pcr-testing-incorrect-use/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://childrenshealthdefense.org/defender/covid-vaccine-spike-protein-travels-from-injection-site-organ-damage/", "https://childrenshealthdefense.org/defender/pfizer-skipped-critical-testing-quality-standards-covid-vaccine/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://childrenshealthdefense.org/defender/doctors-ethics-halt-pfizer-covid-vaccines-adolescents/", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafe.html", "https://img1.wsimg.com/blobby/go/3c6a0774-cfad-46fa-aa97-af5aa5e74f00/M%20for%20PI%20file%20stamped.pdf", "https://renz-law.com/", "https://renz-law.com/45k-whistleblower-suit", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-07-21T14:20:18+00:00"}