{"result_id": "311026", "URL": "https://www.wakingtimes.com/pro-vax-messaging-including-societal-guilt-was-being-tested-6-months-before-vaccine-approval/", "timestamp": "2023-04-25 17:39:12 CEST+0200", "meta": {"description": "Matt Agorist - Propaganda is the systematic effort to manipulate other people’s beliefs, attitudes, or actions.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/pro-vax-messaging-including-societal-guilt-was-being-tested-6-months-before-vaccine-approval/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Pro-Vax ‘Messaging’, Including ‘Societal Guilt’ Was Being Tested 6 Months BEFORE Vaccine Approval", "cleaned_text": "Pro-Vax ‘Messaging’, Including ‘Societal Guilt’ Was Being Tested 6 Months BEFORE Vaccine Approval\n\nAccording to Encyclopedia Britannica, Propaganda is the more or less systematic effort to manipulate other people’s beliefs, attitudes, or actions by means of symbols (words, gestures, banners, monuments, music, clothing, insignia, hairstyles, designs on coins and postage stamps, and so forth). Deliberateness and a relatively heavy emphasis on manipulation distinguish propaganda from casual conversation or the free and easy exchange of ideas.\n\nThose who have been paying attention to the last 19 months, have seen the brazen propaganda pushed by media and government alike. The serf class is propagandized to comply with one set of rules while the elite openly flaunt their ability to abide by an entirely different set.\n\nThe means by which society is being influenced are not something that the establishment has been making up as they go along either. In fact, according to a study published on the US National Library of Medicine website, ClinicalTrials.gov, the “experts” were planning their propaganda months before they needed it.\n\nDespite a consensus in the field back in June and July of 2020, claiming that rushing a COVID-19 vaccine is dangerous and that one wouldn’t be available for years, some folks, particularly those at Yale University, were already planning their propaganda messaging once it was approved.\n\nDespite the previously fastest vaccine approval in history taking four years, the “messaging” experts at Yale were getting their messages ready for when the COVID-19 vaccine would roll out in just six months. When we read their study, everything the media and government has been saying for the last 10 months begins to make sense.\n\nIn their study, titled COVID-19 Vaccine Messaging, Part 1, researchers tested “different messages about vaccinating against COVID-19 once the vaccine becomes available.”\n\nParticipants were recruited online and fed varying messages to test which ones worked the best to convince them to get the vaccine. Spoiler alert: if a vaccine works like it is supposed to, it doesn’t need propaganda to convince people to take it. Yet somehow, the experts at Yale predicted that this messaging would be needed — and they were right as the establishment has fully adopted it.\n\nIn the study, the control group was given messaging about random bird feeding benefits and costs. The baseline participants were given messaging about the effectiveness and safety of vaccines, and this is where the plot begins to thicken.\n\nIn total, ten different propaganda messages were tested, some of them more unscrupulous than the others. The first message sounds extremely familiar to those who began paying attention last year — take the vaccine and get your freedom and your job back.\n\n1/15 of the sample will be assigned to this intervention, which is a message about how COVID-19 is limiting peoples’s [sic] economic freedom and by working together to get enough people vaccinated society can preserve its economic freedom. 1/15 of the sample will be assigned to this group, which is a message about how COVID-19 is wreaking havoc on the economy and the only way to strengthen the economy is to work together to get enough people vaccinated.\n\nOthers included messages about how getting vaccinated is in the interest of society and community and how we all should do our part to stop the spread. This messaging is simple enough and not particularly egregious. However, that’s where it ends. The rest of the messages appeal to emotion by attempting to make people feel guilty and shame them.\n\nThe message is about the danger that COVID-19 presents to the health of one’s family and community. The best way to protect them is by getting vaccinated and society must work together to get enough people vaccinated. Then it asks the participant to imagine the guilt they will feel if they don’t get vaccinated and spread the disease. Then it asks the participant to imagine the embarrassment they will feel if they don’t get vaccinated and spread the disease. Then it asks the participant to imagine the anger they will feel if they don’t get vaccinated and spread the disease.\n\nThe second to last messaging arm involves one of the most familiar phrases we’ve heard since the beginning of this debacle, which is “trust the science.”\n\nThe final message refers to those who refuse the vaccine as cowards.\n\nNow that we know these messages were being planned and tested nearly six months before the vaccine was even approved, everything that we are being told now makes sense. Unfortunately, the messaging was not as effective as they would have hoped which is why the government is now rolling out mandates.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\nLike Waking Times on Facebook. Follow Waking Times on Telegram.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pro-Vax ‘Messaging’, Including ‘Societal Guilt’ Was Being Tested 6 Months BEFORE Vaccine Approval", "description": "Matt Agorist - Propaganda is the systematic effort to manipulate other people’s beliefs, attitudes, or actions.", "url": "https://www.wakingtimes.com/pro-vax-messaging-including-societal-guilt-was-being-tested-6-months-before-vaccine-approval/", "site_name": "Waking Times", "article:published_time": "2021-10-11T10:00:51+00:00", "article:modified_time": "2021-10-11T10:17:24+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/10/messaging-1050x525-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": ["Propaganda"], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/10/messaging-1050x525-1.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://thefreethoughtproject.com/vaccine-messaging-tested-months-before-vaccine/", "https://www.wakingtimes.com/pro-vax-messaging-including-societal-guilt-was-being-tested-6-months-before-vaccine-approval/", "https://www.britannica.com/topic/propaganda", "https://thefreethoughtproject.com/political-elite-flout-mask-rules-as-servant-class-forced-to-cover-faces/", "https://clinicaltrials.gov/ct2/show/NCT04460703?term=vaccine+messaging&draw=2&rank=2", "https://thefreethoughtproject.com/red-cross-silence-vaccine-safety/", "https://thefreethoughtproject.com/biden-vax-mandate-fines-companies-700k/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://twitter.com/MattAgorist", "https://steemit.com/@tftproject", "https://www.minds.com/mattagorist", "https://www.facebook.com/WakingTimes", "https://t.me/wakingtimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-10-11T10:00:51+00:00"}