{"result_id": "311031", "URL": "https://www.wakingtimes.com/using-herd-immunity-excuse-for-gene-therapy-vaccine-on-kids/", "timestamp": "2023-04-25 17:39:15 CEST+0200", "meta": {"description": "Dr. Mercola - Despite the fact that COVID-19 has had little impact, physically, to children, health officials are setting the stage for widespread vaccination of this population.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/using-herd-immunity-excuse-for-gene-therapy-vaccine-on-kids/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Using Herd Immunity Excuse For Gene Therapy Vaccine On Kids", "cleaned_text": "Using Herd Immunity Excuse For Gene Therapy Vaccine On Kids\n\nIn children and young adults from age birth to 19, the survival rate of COVID-19 is 99.997%.1,2 In most cases, symptoms are mild or nonexistent. Among children who were hospitalized, 0.19% of children died from COVID-19, with researchers concluding in a 2021 study, “Hospitalization and in-hospital death are rare in children diagnosed with COVID-19.”3\n\nDespite the fact that COVID-19 has had little impact, physically, to children, health officials are setting the stage for widespread vaccination of this population. The University of Oxford, which is collaborating on a COVID-19 vaccine with AstraZeneca, is already enrolling children between the ages of 6 years and 17 years and 8 months in their U.K. vaccine trial.4\n\nA COVID vaccine for infants and children is every bit as unnecessary, dangerous and foolish as the hepatitis B vaccine is for infants that I have been railing against for the past two decades.\n\nModerna is also enrolling 3,000 children between the ages of 12 and 17 to test their COVID-19 vaccine, using the same dose given to adults,5 while Pfizer also expanded its clinical trials to include children as young as 12.6 Johnson & Johnson even announced on February 28, 2021, that it plans to test its COVID-19 vaccine on infants, including newborn babies, pregnant women and people with compromised immune systems.\n\nThe COVID-19 vaccine really isn’t a vaccine in the medical definition of a vaccine. It’s more accurately an experimental gene therapy, of which the effectiveness and safety are far from proven. During the first six weeks the vaccine was available, more than 500 post-vaccination deaths and nearly 11,000 other adverse events were reported to the U.S. Vaccine Adverse Event Reporting System (VAERS).8\n\nAccording to Children’s Health Defense (CHD), professor Dolores J. Cahill, Ph.D., a molecular biologist and immunologist, “expects to see successive waves of adverse reactions to the experimental messenger RNA (mRNA) injections ranging from anaphylaxis and other allergic responses to autoimmunity, sepsis and organ failure.”9\n\nConsidering that children are at extremely low risk from COVID-19, vaccination offers them far more risk than benefit, and parents may be understandably reluctant to volunteer their children to receive this experimental and unlicensed gene therapy. Public health officials have made it clear, however, that vaccination of children is expected. CHD reported:10\n\nDr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID), also stated that 85% to 90% of the U.S. population, including children, will need to receive a COVID-19 vaccine before life can return to normal, and he suggested that first graders may be authorized to be vaccinated by September 2021.11\n\nSince children themselves have little reason to get a COVID-19 vaccine, health officials are spinning the notion that children must be vaccinated for the sake of herd immunity. Now, they want you to think that not only should you look at the people around you as vectors of disease, but also the children, who could be asymptomatic carriers, silently bringing a deadly disease to grandma’s house.\n\nWhat’s being largely ignored, however, are the studies showing that children are not driving the COVID-19 pandemic and, in fact, appear less likely to transmit COVID-19 than adults.12\n\nHerd immunity, which occurs when enough people acquire immunity to an infectious disease such that it can no longer spread widely in the community, is calculated using reproductive number, or R-naught (R0), which is the estimated number of new infections that may occur from one infected person.14\n\nR0 of below 1 (with R1 meaning that one person who’s infected is expected to infect one other person) indicates that cases are declining while R0 above 1 suggests cases are on the rise. It’s far from an exact science, however, as a person’s susceptibility to infection varies depending on many factors, including their health, age and contacts within a community.\n\nThe initial R0 calculations for COVID-19’s HIT were based on assumptions that everyone has the same susceptibility and would be mixing randomly with others in the community. But a study published in Nature Reviews Immunology suggested that the herd immunity threshold for COVID-19 may need to be adjusted because children are less susceptible to the disease:15\n\nAnother point being largely ignored in the mainstream media is that it’s unknown if the COVID-19 vaccines prevent transmission, putting a major hole in the push for vaccine-driven herd immunity.\n\nUnlike conventional vaccines, which use an antigen of the disease you’re trying to prevent, the COVID-19 injections contain synthetic RNA fragments encapsulated in a nanolipid carrier compound,16 the sole purpose of which is to lessen clinical symptoms associated with the S-1 spike protein, not the actual virus.\n\nThey do not actually impart immunity or inhibit transmissibility of the disease. In other words, they are not designed to keep you from getting sick with SARS-CoV-2; they only are supposed to lessen your infection symptoms if or when you do get infected.17,18\n\nAt a virtual press conference held by the World Health Organization (WHO) on December 28, 2020, WHO officials warned there is no guarantee that COVID-19 vaccines will prevent people from being infected with the SARS-CoV-2 virus and transmitting it to other people.19\n\nIn a New Year’s Day interview with Newsweek, Fauci reinforced the WHO’s admission that health officials do not know if COVID-19 vaccines prevent infection or if people can spread the virus to others after getting vaccinated.20\n\nAlthough the U.S. Food and Drug Administration (FDA) granted Emergency Use Authorization (EUA) in December 2020 for Pfizer/BioNTech21 and Moderna22 to release their experimental mRNA vaccines for use in the U.S., the companies only provided evidence from clinical trials to demonstrate that their vaccines prevented mild to severe COVID-19 disease symptoms in vaccinated participants compared to unvaccinated trial participants.\n\nThe companies did not investigate whether the vaccines prevent people from becoming asymptomatically infected with the SARS-CoV-2 virus and/or transmitting it to other people.23,24\n\nMeanwhile, if you or your child recovered from COVID-19 or had an asymptomatic case, you likely already have some level of protective immunity25 — another factor being largely ignored in the push to vaccinate children. In fact, trials suggested there’s no benefit to getting vaccinated among those who have been previously infected with COVID-19.26\n\nWhile Fauci is not named on the patent of Moderna’s vaccine, the NIH has a 50% stake in it,27 and the recognition that would come with a successful vaccine launch would certainly include Fauci. NIH scientists may also collect royalties from vaccines they’re involved with.28\n\nThe video above, with David E. Martin, Ph.D., a national intelligence analyst, also goes into detail about Fauci’s involvement with medical patents. Martin has pointed out that even though Moderna “very clearly did not have the legal right, and they did not have the contractual rights, they didn’t have the licensing rights” required to enter into a federal contract, they were still somehow pushed to the front of the line by the NIH and Fauci.\n\nIn the Fauci/COVID-19 Dossier prepared by Martin, he describes multiple criminal violations he believes are associated with “COVID-19 terrorism,” including gain of function research that was carried out by NIAID in violation of an NIH moratorium. Part of the dossier also spells out some of Fauci’s patents in detail along with the NIAID’s “economic bonanza”:29\n\nIt’s worth noting that Moderna has no legal rights to a key patent for its vaccine delivery system, and company executives are among those who have dumped their stock. Both Moderna and the NIH are essentially engaged in patent infringement, as a core part of the technology — the lipid nanoparticle (LNP) technology that is part of the vaccine delivery system — belongs to a small Canadian biotech company called Arbutus.30\n\nModerna sought to invalidate the patent owned by Arbutus Biopharma, but lost the challenge at the end of July 2020.31 After losing the challenge, Moderna said their LNP technology is actually far more advanced than Arbutus’ and claimed “the LNP used to make mRNA-1273, its Covid-19 vaccine candidate, is not covered by the Arbutus patent.”32 “In short,” the Dossier notes:33\n\nConflicts of interest are also rampant at NIH, where, since 2012, health researchers receiving federal funding have reported more than 8,000 significant financial conflicts of interest totaling at least $188 million.34 In 2006,35 evidence was also uncovered showing that 916 NIH researchers had secretly received royalty payments for drugs and other inventions while working for the government.\n\nFauci was among those who had “received tens of thousands of dollars in royalties for an experimental AIDS treatment they invented [interleukin-2]. At the same time, their office has spent millions in tax dollars to test the treatment on patients across the globe.”\n\nWhile it appears inevitable that the experimental COVID-19 gene therapy injections will soon be pushed on children, considering the many unanswered questions and conflicts in place, some may prefer to put off getting vaccinated against COVID-19 for as long as possible while waiting for the real truth to emerge.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "Using Herd Immunity Excuse For Gene Therapy Vaccine On Kids", "description": "Dr. Mercola - Despite the fact that COVID-19 has had little impact, physically, to children, health officials are setting the stage for widespread vaccination of this population.", "url": "https://www.wakingtimes.com/using-herd-immunity-excuse-for-gene-therapy-vaccine-on-kids/", "site_name": "Waking Times", "article:published_time": "2021-03-19T21:55:24+00:00", "article:modified_time": "2021-03-19T21:55:39+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/03/vaccine-kids-fb.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/03/vaccine-kids-fb.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "http://articles.mercola.com/sites/articles/archive/2021/03/18/herd-immunity-excuse-for-gene-therapy-vaccine-kids.aspx", "https://www.wakingtimes.com/using-herd-immunity-excuse-for-gene-therapy-vaccine-on-kids/", "http://articles.mercola.com/sites/articles/archive/2010/11/03/hepatitis-b-vaccines-at-birth.aspx", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "http://articles.mercola.com/sites/articles/archive/2021/02/14/covid-19-vaccine-gene-therapy.aspx", "http://articles.mercola.com/sites/articles/archive/2021/01/26/covid-vaccine-side-effects.aspx", "http://articles.mercola.com/sites/articles/archive/2020/11/11/coronavirus-antibody-dependent-enhancement.aspx", "http://articles.mercola.com/sites/articles/archive/2021/02/23/covid-vaccine-children.aspx", "http://articles.mercola.com/sites/articles/archive/2021/03/09/covid-19-vaccine-disinformation.aspx", "http://articles.mercola.com/sites/articles/archive/2021/02/16/health-officials-make-crucial-error-in-vaccine-recommendation.aspx", "http://articles.mercola.com/sites/articles/archive/2020/09/21/coronavirus-vaccine-patent.aspx", "http://articles.mercola.com/sites/articles/archive/2020/08/19/covid-19-reckless-gain-of-function-experiments.aspx", "http://articles.mercola.com/sites/articles/archive/2021/03/08/pfizer-covid-vaccine.aspx", "http://www.facebook.com/WakingTimes", "http://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WTStaff"], "publish_date": "2021-03-19T21:55:24+00:00"}