{"result_id": "311038", "URL": "https://www.wakingtimes.com/as-reports-of-deaths-after-covid-vaccines-near-16000-cdc-urges-pregnant-women-to-get-the-vaccine/", "timestamp": "2023-04-25 17:39:19 CEST+0200", "meta": {"description": "Megan Redsham - VAERS data released Friday by the CDC included a total of 752,803 reports of adverse events from all age groups following COVID vaccines, including 15,937 deaths and 105,758 serious injuries between Dec. 14, 2020 and Sept. 24, 2021.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/as-reports-of-deaths-after-covid-vaccines-near-16000-cdc-urges-pregnant-women-to-get-the-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "As Reports of Deaths After COVID Vaccines Near 16,000, CDC Urges Pregnant Women to Get the Vaccine", "cleaned_text": "As Reports of Deaths After COVID Vaccines Near 16,000, CDC Urges Pregnant Women to Get the Vaccine\n\nData released Friday by the Centers for Disease Control and Prevention (CDC) showed that between Dec. 14, 2020 and Sept. 24, 2021, a total of 752,803 adverse events following COVID vaccines were reported to the Vaccine Adverse Event Reporting System (VAERS). The data included a total of 15,937 reports of deaths — an increase of 551 over the previous week.\n\nThere were 105,758 reports of serious injuries, including deaths, during the same time period — up 6,348 compared with the previous week.\n\nExcluding “foreign reports” filed in VAERS, 581,851 adverse events, including 7,215 deaths and 45,952 serious injuries, were reported in the U.S. between Dec. 14, 2020 and Sept. 24, 2021.\n\nOf the 7,215 U.S. deaths reported as of Sept. 24, 11% occurred within 24 hours of vaccination, 16% occurred within 48 hours of vaccination and 29% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nIn the U.S., 388.2 million COVID vaccine doses had been administered as of Sept. 24. This includes: 223 million doses of Pfizer, 151 million doses of Moderna and 15 million doses of Johnson & Johnson (J&J).\n\nThe data come directly from reports submitted to VAERS, the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\n Historically, VAERS has been shown to report only 1% of actual vaccine adverse events.\n\nThis week’s U.S. data for 12- to 17-year-olds show:\n• 20,907 total adverse events, including 1,256 rated as serious and 21 reported deaths. Two of the 21 deaths were suicides.The most recent deaths involve a 17-year-old male (VAERS I.D. 1689212) with cancer who was vaccinated April 17, tested positive for COVID on July 20, was hospitalized and passed away Aug. 29; and a 16-year-old female (VAERS I.D. 1694568) who died from a pulmonary embolism nine days after receiving her first Pfizer dose.\n\nOther recent reported deaths include two patients [VAERS I.D. 1655100] who died after their second dose of Pfizer, including a 13-year-old female, a 15-year-old boy (VAERS I.D. 1498080) who previously had COVID, was diagnosed with cardiomyopathy in May 2021 and died four days after receiving his second dose of Pfizer’s vaccine when he collapsed on the soccer field and went into ventricular tachycardia; and a 13-year-old girl (VAERS I.D. 1505250) who died after suffering a heart condition after receiving her first dose of Pfizer.\n• 3,151 reports of anaphylaxis among 12- to 17-year-olds with 99% of cases\n\n attributed to Pfizer’s vaccine.\n• 516 reports of myocarditis and pericarditis (heart inflammation) with 508 cases attributed to Pfizer’s vaccine.\n• 112 reports of blood clotting disorders, with all cases attributed to Pfizer.\n\nThis week’s U.S. VAERS data, from Dec. 14, 2020 to Sept. 24, 2021, for all age groups combined, show:\n• 19% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 41% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 72.8.\n• Of the 2,882 cases of Bell’s Palsy reported, 50% were attributed to Pfizer vaccinations, 42% to Moderna and 8% to J&J.\n• 626 reports of Guillain-Barré syndrome, with 40% of cases attributed to Pfizer, 32% to Moderna and 27% to J&J.\n• 155,501 reports of anaphylaxis with 43% of cases attributed to Pfizer’s vaccine, 50% to Moderna and 7% to J&J.\n• 9,699 reports of blood clotting disorders. Of those, 4,195 reports were attributed to Pfizer, 3,524 reports to Moderna and 1,930 reports to J&J.\n• 2,628 cases of myocarditis and pericarditis with 1,662 cases attributed to Pfizer, 858 cases to Moderna and 98 cases to J&J’s COVID vaccine.\n\nCDC issues ‘urgent’ alert for pregnant women to get COVID vaccines, despite thousands of reported adverse events\n\nThe CDC on Wednesday issued its strongest guidance to date urging pregnant women and those who recently gave birth to be vaccinated against COVID. A total of 161 pregnant women have died of COVID, the CDC said, including 22 deaths in August.\n\n“CDC strongly recommends COVID-19 vaccination either before or during pregnancy because the benefits of vaccination outweigh known or potential risks,” the agency said in a health alert. To date, only 31% of pregnant people have been vaccinated, the CDC said.\n\nThe CDC said COVID during pregnancy can cause preterm birth or sick babies that require intensive care. “Other adverse pregnancy outcomes, such as stillbirth, have been reported,” the CDC said.\n\nHowever, as of Sept 24, CDC VAERS data show 3,823 pregnant women have reported adverse events related to COVID vaccines, including 1,144 reports of miscarriage or premature birth — a far greater number than the statistics the CDC used to justify its “urgent” recommendation that pregnant woman get vaccinated.\n\nWoman injured by COVID vaccine pleads with health agencies for help, as Pfizer pressures local news agency to kill story\n\nIn an exclusive interview with The Defender, 40-year-old Kristi Dobbs said she’s spent nine months pleading with U.S. health agencies to research the neurological injuries she developed after receiving Pfizer’s COVID vaccine, only to be ignored after she provided the National Institutes of Health (NIH) blood samples for research.\n\nDobbs received her first and only dose of Pfizer’s COVID vaccine on Jan. 18, and has been unable to work and care for her family since. Dobbs has seen 16 different medical providers and tried 22 different medications to address more than 20 different symptoms — none of which she had prior to getting vaccinated.\n\nDobbs symptoms include full-body paresthesia, internal tremors/vibrations, fatigue, brain fog, muscle pain and weakness, pelvic pain, irregular menstrual cycles, skin rashes, tinnitus, temperature regulation issues, swollen lymph nodes, loss of appetite, weight loss, dizziness/balance issues, blood pressure regulation issues, neck pain, headaches, heart palpitations, convulsions at night and insomnia.\n\nAlthough NIH officials acknowledged in communications to Dobbs they were aware of neurological injuries being reported in people after receiving COVID vaccines, they have not published the data they’ve collected to the scientific community as promised, so that people like Dobbs can find effective treatments.\n\nDobbs said she and others who developed neurological injuries after a COVID vaccine shared their experiences with a reporter in hope of raising awareness. But the story never ran because, according to the reporter, a “higher up” at Pfizer pressured the news agency to drop it.\n\nPfizer submits data for 5- to 11-year-olds to FDA\n\nPfizer and BioNTech on Tuesday submitted initial trial data for their COVID vaccine in children ages 5 to 11, and said they would make a formal request to U.S. regulators for emergency use in the coming weeks — though they had previously targeted submitting the application as early as the end of September.\n\nIf Pfizer does not finish its application until mid-October, the FDA may not make its decision until sometime between Halloween and Thanksgiving, according to a source familiar with the matter.\n\nThe Pfizer-BioNTech vaccine was rapidly authorized for the 12-15 age group roughly a month after the companies filed for authorization. If the same timeline is followed for this application younger children could start receiving their shots as soon as late October, Reuters reported.\n\nProfessional tennis player Jeremy Chardy — formerly ranked 25th in the world — said his 2021 season is over thanks to a “series of problems” he experienced after getting a COVID vaccine between the Olympics and U.S. open.\n\nChardy, 34, said since receiving his vaccine he suddenly couldn’t train or play, and needs more time to care for himself to ensure he doesn’t have health problems returning to the court too soon.\n\nChardy told AFP he was suffering from movement-limiting pain — which caused violent pains all over his body as soon as he made any physical effort. Chardy said he regrets taking the vaccine, but he couldn’t have known.\n\nA few high-profile NBA players who are part of the remaining 10% of players who have not received a COVID vaccine are making headlines as they defend their position not to get vaccinated.\n\nOn Monday, at Orlando Magic Media Day, Jonathan Isaac, who has already had COVID, answered questions about his decision not to get the vaccine — a decision that potentially could lead to missing games based on the NBA’s protocols in various cities.\n\nIsaac said he is not anti-vax, anti-science or anti-medicine, but he is uncomfortable with taking the vaccine at this time, and it is his belief that every person should have the right to make their own choice about whether or not to get the vaccine — without bullying, being pressured or forced to do so.\n\nBradley Beal, a guard for the Washington Wizards, and Andrew Wiggins, a forward for the Golden State Warriors, said they also had not received COVID vaccines.\n\nBeals, who has already had COVID, cited personal reasons for his refusal but questioned reporters on breakthrough cases, natural immunity and the vaccine’s inability to prevent COVID. Wiggins said his decision not to get vaccinated is a private matter.\n\nA Broadway performance of Disney’s “Aladdin” was canceled Wednesday due to COVID breakthrough cases within the company, producers said — just one night after the show had resumed for the first time since the pandemic shut-down.\n\nAll of New York’s 41 Broadway theaters require eligible audiences, crews, performers and other staff to be vaccinated against COVID, according to the Broadway League’s policy.\n\nHarvard Business School is pivoting back to remote learning as the first semester of 2021 begins, due to a “steady rise” in breakthrough COVID cases. Harvard University said on its website 95% of students and 96% of employees are vaccinated.\n\nSeveral states are reporting a rise in breakthrough cases, including Massachusetts — which reported 4,378 new COVID cases in fully vaccinated individuals between Sept. 18 and Sept. 25 — Oregon, which said 23% of new cases ending Sept. 18 occurred in the fully vaccinated and Indiana, which reported more than 33,851 breakthrough cases since vaccines were authorized for emergency use in Dec. 14, 2020.\n\nData from the Centers for Disease Control and Prevention (CDC) show as of Sept. 20, 19,136 patients were hospitalized or died despite being fully vaccinated — a number the agency acknowledges is an undercount of all SARS-CoV-2 infections among fully vaccinated persons.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.\n\nMegan Redshaw is a freelance reporter for The Defender. She has a background in political science, a law degree and extensive training in natural health.\n\nLike Waking Times on Facebook. Follow Waking Times on Telegram.", "opengraph": {"locale": "en_US", "type": "article", "title": "As Reports of Deaths After COVID Vaccines Near 16,000, CDC Urges Pregnant Women to Get the Vaccine", "description": "Megan Redsham - VAERS data released Friday by the CDC included a total of 752,803 reports of adverse events from all age groups following COVID vaccines, including 15,937 deaths and 105,758 serious injuries between Dec. 14, 2020 and Sept. 24, 2021.", "url": "https://www.wakingtimes.com/as-reports-of-deaths-after-covid-vaccines-near-16000-cdc-urges-pregnant-women-to-get-the-vaccine/", "site_name": "Waking Times", "article:published_time": "2021-10-04T23:29:52+00:00", "article:modified_time": "2021-10-04T23:54:28+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/10/Covid-vaccine-VAERS-100121-feature.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a> Exclusive Interview: Kristi Dobbs recounted how she’s spent 9 months pleading w/health agencies to research neurological injuries she developed after Pfizer’s vaccine + how she is trying to get word out about vaccine’s potential risks.<a href=\"https://t.co/WFyuobbEFF\">https://t.co/WFyuobbEFF</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1443943749311152132?ref_src=twsrc%5Etfw\">October 1, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Pro tennis player Jeremy Chardy says his 2021 season is over thanks to a “series of problems” he experienced after getting Pfizer’s vaccine. Orlando Magic’s <a href=\"https://twitter.com/JJudahIsaac?ref_src=twsrc%5Etfw\">@JJudahIsaac</a> stands firm on why (including he had COVID) he’s not getting vaccine.<a href=\"https://t.co/ZuuLyWIzZP\">https://t.co/ZuuLyWIzZP</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1442960053003247616?ref_src=twsrc%5Etfw\">September 28, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/10/Covid-vaccine-VAERS-100121-feature.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/vaers-cdc-deaths-injuries-covid-vaccines/", "https://www.wakingtimes.com/as-reports-of-deaths-after-covid-vaccines-near-16000-cdc-urges-pregnant-women-to-get-the-vaccine/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/cheryl-cohen-dies-rare-brain-disease-second-dose-pfizer-covid-shot/", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://childrenshealthdefense.org/defender/fda-warning-jj-vaccine-serious-rare-autoimmune-disorder/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.sciencedirect.com/science/article/pii/S2214750020304248", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1689212", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1694568", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1655100", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1498080", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1505250", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://www.nbcnews.com/health/health-news/cdc-issues-urgent-alert-pregnant-women-need-covid-19-vaccine-rcna2422", "https://emergency.cdc.gov/han/2021/han00453.asp", "https://emergency.cdc.gov/han/2021/han00453.asp", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://childrenshealthdefense.org/defender/kristi-dobbs-injured-pfizer-covid-vaccine-local-news-agency-kills-story/", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/WFyuobbEFF", "https://twitter.com/RobertKennedyJr/status/1443943749311152132?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/dr-danice-hertz-injured-pfizer-covid-vaccine/", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-seeks-fda-clearance-covid-19-vaccine-younger-children-2021-09-28/", "https://www.wsj.com/articles/pfizers-covid-19-vaccine-for-kids-may-not-be-fda-authorized-before-november-11632856430", "https://www.wsj.com/articles/pfizers-covid-19-vaccine-for-kids-may-not-be-fda-authorized-before-november-11632856430", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-seeks-fda-clearance-covid-19-vaccine-younger-children-2021-09-28/", "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizer-seeks-fda-clearance-covid-19-vaccine-younger-children-2021-09-28/", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://childrenshealthdefense.org/defender/tennis-pro-jeremy-chardy-pfizer-covid-vaccine-injury/", "https://www.tennismajors.com/atp/chardy-puts-his-season-on-hold-due-to-covid-vaccine-complications-501156.html", "https://childrenshealthdefense.org/defender/tennis-pro-jeremy-chardy-pfizer-covid-vaccine-injury/", "https://twitter.com/JJudahIsaac?ref_src=twsrc%5Etfw", "https://t.co/ZuuLyWIzZP", "https://twitter.com/RobertKennedyJr/status/1442960053003247616?ref_src=twsrc%5Etfw", "https://www.orlandopinstripedpost.com/2021/9/27/22697537/orlando-magic-jonathan-isaac-covid-vaccination", "https://childrenshealthdefense.org/news/once-burned-twice-shy-why-anti-vaxxers-are-really-ex-vaxxers/", "https://childrenshealthdefense.org/defender/broadway-cancels-aladdin-harvard-classes-online-breakthrough-covid-cases/", "https://childrenshealthdefense.org/defender/cdc-covid-natural-immunity/", "https://www.nbcnews.com/news/us-news/covid-closes-aladdin-one-day-after-broadway-reopening-n1280391?fbclid=IwAR2sUiCWTVd-y38u2Z0g6s1779vvmEeSKjrxsW-FzT-Crd8-YJDnw3Q2OVc", "https://childrenshealthdefense.org/defender/broadway-cancels-aladdin-harvard-classes-online-breakthrough-covid-cases/", "https://www.broadway.org/info/covid-19-updates/?_ga=2.161798325.827724767.1632975055-1788133102.1632975055", "https://www.harvard.edu/coronavirus/", "https://www.wcvb.com/article/massachusetts-breakthrough-covid-19-cases-sept-28-2021/37778482", "https://www.cdc.gov/vaccines/covid-19/health-departments/breakthrough-cases.html", "https://childrenshealthdefense.org/defender/covid-fully-vaccinated-cdc-breakthrough-cases/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.facebook.com/WakingTimes", "https://t.me/wakingtimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-10-04T23:29:52+00:00"}