{"result_id": "311036", "URL": "https://www.wakingtimes.com/govt-to-engage-sms-carriers-to-dispel-vaccine-misinformation-by-vetting-your-text-messages/", "timestamp": "2023-04-25 17:39:18 CEST+0200", "meta": {"description": "Matt Agorist - The State is quickly moving on to the next Orwellian steps to make sure you get your jab.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/govt-to-engage-sms-carriers-to-dispel-vaccine-misinformation-by-vetting-your-text-messages/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Gov’t to “Engage” SMS Carriers to ‘Dispel Vaccine Misinformation’ by Vetting Your Text Messages", "cleaned_text": "Gov’t to “Engage” SMS Carriers to ‘Dispel Vaccine Misinformation’ by Vetting Your Text Messages\n\nAs TFTP reported last week, President Joe Biden took to the podium to declare that Americans need to get the “free” vaccine. He didn’t just urge Americans to go out an get it and instead said “we” will be going door to door to “encourage” you to get it.\n\n“Now we need to go community by community, neighborhood by neighborhood and often times door-to-door- literally knocking on doors, to get help to the remaining people protected from the virus,” Biden said.\n\nWhite House Press Secretary Jen Psaki also pushed the “door-to-door” effort in a press briefing before Biden.\n\nNaturally, the idea of government going door-to-door to “encourage” Americans to get a vaccine they have already chosen not to take, doesn’t sit well with many.\n\nHowever, much of the pushback against Biden’s plan came in the form of misinformation with many on the right claiming that the door-to-door effort would be conducted by “government agents” who may try to “force the vaccine” on the unwilling. This is patently and verifiably false — for now. And, it has given the technocrats the fodder they need to push for even more control.\n\nBefore going on to the Orwellian next steps of the state to make sure you get your jab, it is important to point out that the Biden administration’s plan involves civilian volunteers going out in their communities and encouraging people to be vaccinated. While this is certainly in poor taste, these folks are not much different than the volunteers going door-to-door to campaign for their political candidate — except that political candidate volunteers don’t ask for your vaccination status.\n\nInstead of politics, they are encouraging an experimental vaccine approved only under the FDA’s Emergency Use Authorization plan. Also, in preparation for the coming door-to door campaign, Lake County, Illinois published ‘Helpful Hints’ for volunteers taking part in their “Community Health Ambassador Outreach Door Knocking Project to Increase COVID Vaccine Acceptance.” These ‘helpful hints’ have also raised concerns among citizens as their handouts include lists with contact information and check sheets that record vaccination status.\n\nAgain, these folks are not government agents or employees and are working as volunteers only.\n\n“The big misinterpretation that Fox News or whomever else is saying is that they are essentially envisioning a bunch of federal workers knocking on your door, telling you you’ve got to do something that you don’t want to do,” Anthony Fauci said in an interview on Sunday. “That’s absolutely not the case, it’s trusted messengers who are part of the community doing that — not government officials. So that’s where I think the disconnect is.”\n\nBut Fauci did not address the information they will be collecting as the above ‘helpful hints” show. Will this information stay with these “trusted messengers” and not find its way to some government database? We think not.\n\nSo, while some of the concerns by the “vaccine hesitancy” crowd are certainly far-fetched, many of them are not. Nevertheless, this administration is now moving to even greater lengths to nip this skepticism in the bud.\n\nAccording to an article in Politico this week, the gloves are off and government is no longer going to sit idly by while the masses talk among each other and encourage people to think for themselves. They are coming after your text messages. As Politico reports:\n\nFor those who may have just skimmed the above paragraph, read it one more time. First off, fact checking on social media has become a joke and has only served increase misinformation thanks to the political bias and utter lack of credibility by some of the folks “checking facts.”\n\n\n\n Secondly, and more important than turning the dial on the incompetent fact checkers to “11” is the fact that Politico just admitted the government will be monitoring your text messages via cellphone carriers.\n\nIn the last year and a half, we have gone from “15 days to flatten the curve” to a complete technocratic police state that has merged with social media to silence anyone critical of government policy, pro-informed consent, and hesitant of taking a vaccine that was rushed to market and approved in an unprecedented amount of time.\n\nWhat’s more, as this article from Politico illustrates, our Constitutional rights are completely eroding as well. Government cannot spy on your text messages or social media messages without a warrant, yet they are brazenly unafraid to say they will do just that to make sure these “dangerous vaccine skeptics” don’t ruin their plans.\n\nIf government has to gaslight you, manipulate you, spend billions on advertising, offer bribes and monetary rewards, silence skeptics, slander experts, fearmonger 24/7, and violate your Constitutional rights in order to get you to take a vaccine, perhaps you are right to be a tad bit on the defensive.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gov’t to “Engage” SMS Carriers to ‘Dispel Vaccine Misinformation’ by Vetting Your Text Messages", "description": "Matt Agorist - The State is quickly moving on to the next Orwellian steps to make sure you get your jab.", "url": "https://www.wakingtimes.com/govt-to-engage-sms-carriers-to-dispel-vaccine-misinformation-by-vetting-your-text-messages/", "site_name": "Waking Times", "article:published_time": "2021-07-13T18:28:10+00:00", "article:modified_time": "2021-07-14T12:46:50+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/07/vaccine-hesitant12-1050x525-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">BIDEN: “We need to go community-by-community, neighborhood-by-neighborhood, and oft times door-to-door, literally knocking on doors” to get people vaccinated. <a href=\"https://t.co/oJ2lG9bqaw\">pic.twitter.com/oJ2lG9bqaw</a></p><p>— Daily Caller (@DailyCaller) <a href=\"https://twitter.com/DailyCaller/status/1412490321770975237?ref_src=twsrc%5Etfw\">July 6, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Jen Psaki: We will be going door-to-door to Americans who have not been vaccinated <a href=\"https://t.co/S70VjPojfj\">pic.twitter.com/S70VjPojfj</a></p><p>— Caleb Hull (@CalebJHull) <a href=\"https://twitter.com/CalebJHull/status/1412460388994670592?ref_src=twsrc%5Etfw\">July 6, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">I shared an independent study published in the JAMA about the risks posed to children who wear masks and Facebook fact checked it. A non scientific shit clickbait fucking site overrules fucking published peer reviewed science. Welcome to post covid America. <a href=\"https://t.co/CejpgxGv4g\">pic.twitter.com/CejpgxGv4g</a></p><p>— Matt Agorist (@MattAgorist) <a href=\"https://twitter.com/MattAgorist/status/1412813584665657346?ref_src=twsrc%5Etfw\">July 7, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">On today’s episode of fact checkers have lost their god damned minds: “Data showing the Delta variant is less deadly doesn’t mean the virus is less deadly.”<a href=\"https://t.co/d9aQS9f25U\">https://t.co/d9aQS9f25U</a></p><p>— Matt Agorist (@MattAgorist) <a href=\"https://twitter.com/MattAgorist/status/1413121384885198852?ref_src=twsrc%5Etfw\">July 8, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/07/vaccine-hesitant12-1050x525-1.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://thefreethoughtproject.com/biden-admin-encourage-sms-carriers-monitor-sms-messages/", "https://www.wakingtimes.com/govt-to-engage-sms-carriers-to-dispel-vaccine-misinformation-by-vetting-your-text-messages/", "https://thefreethoughtproject.com/biden-door-to-door-covid-vaccines-military/", "https://t.co/oJ2lG9bqaw", "https://twitter.com/DailyCaller/status/1412490321770975237?ref_src=twsrc%5Etfw", "https://t.co/S70VjPojfj", "https://twitter.com/CalebJHull/status/1412460388994670592?ref_src=twsrc%5Etfw", "https://www.lakecountyil.gov/DocumentCenter/View/39074/CHA-Doorknocking-Info-and-Script", "https://www.politico.com/news/2021/07/12/biden-covid-vaccination-campaign-499278", "https://thefreethoughtproject.com/facebook-censorship-spreads-disinformation/", "https://t.co/CejpgxGv4g", "https://twitter.com/MattAgorist/status/1412813584665657346?ref_src=twsrc%5Etfw", "https://t.co/d9aQS9f25U", "https://twitter.com/MattAgorist/status/1413121384885198852?ref_src=twsrc%5Etfw", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://twitter.com/MattAgorist", "https://steemit.com/@tftproject", "https://www.minds.com/mattagorist", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-07-13T18:28:10+00:00"}