{"result_id": "311032", "URL": "https://www.wakingtimes.com/latest-cdc-vaers-data-show-reported-injuries-surpass-400000-following-covid-vaccines/", "timestamp": "2023-04-25 17:39:16 CEST+0200", "meta": {"description": "Megan Redshaw - VAERS data released today by the CDC showed a total of 441,931 reports of adverse events from all age groups following COVID vaccines, including 6,985 deaths and 34,065 serious injuries.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/latest-cdc-vaers-data-show-reported-injuries-surpass-400000-following-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Latest CDC VAERS Data Show Reported Injuries Surpass 400,000 Following COVID Vaccines", "cleaned_text": "This week’s number of total adverse events for all age groups following COVID vaccines surpassed 400,000, according to data released today by the Centers for Disease Control and Prevention (CDC). The data comes directly from reports submitted to the Vaccine Adverse Event Reporting System (VAERS).\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date.\n\nData released today show that between Dec. 14, 2020 and June 25, 2021, a total of 411,931 total adverse events were reported to VAERS, including 6,985 deaths — an increase of 872 deaths over the previous week. There were 34,065 serious injury reports, up 2,825 compared with last week.\n\nIn the U.S, 321.2 million COVID vaccine doses had been administered as of June 25. This includes: 132 million doses of Moderna’s vaccine, 177 million doses of Pfizer and 12 million doses of the Johnson & Johnson (J&J) COVID vaccine.\n\nOf the 6,985 deaths reported as of June 25, 22% occurred within 48 hours of vaccination, 15% occurred within 24 hours and 38% occurred in people who became ill within 48 hours of being vaccinated.\n\nThis week’s data for 12- to 17-year-olds show:\n• 12,674 total adverse events, including 720 rated as serious and 13 reported deaths among 12- to 17-year-olds. Two of the nine deaths were suicides.The most recent reported deaths include a 16-year-old girl (VAERS I.D. 1420630) who died four weeks after her second dose of Pfizer, a 17-year-old girl (VAERS I.D. 1420762) who experienced cardiac arrest six days after receiving a Pfizer vaccine, a 16-year-old boy (VAERS I.D. 1426828) who died four days after receiving a Pfizer vaccine and a 13-year-old boy (VAERS I.D. 1406840) who died two days after receiving a Pfizer vaccine.Other deaths include three 15-year-olds (VAERS I.D. 1187918, 1382906 and 1242573) and two 16-year-olds (VAERS I.D. 1225942 and 1386841) and one 17-year-old (VAERS I.D. 1199455).\n• 1,792 reports of anaphylaxis among 12- to 17-year-olds with 99% of cases\n\n attributed to Pfizer’s vaccine, 1.2% to Moderna and 0.2% (or four cases) to J&J.\n• 300 reports of myocarditis and pericarditis (heart inflammation) with 296 attributed to Pfizer’s COVID vaccine.\n• 52 reports of blood clotting disorders, 51 attributed to Pfizer and 1 attributed to Moderna.\n\nThis week’s total VAERS data, from Dec. 14, 2020 to June 25, 2021, for all age groups show:\n• 21% of deaths were related to cardiac disorders.\n• 51% of those who died were male, 45% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 74.3.\n• As of June 18, 2,337 pregnant women reported adverse events related to COVID vaccines, including 791 reports of miscarriage or premature birth.\n• Of the 3,985 cases of Bell’s Palsy reported, 55% were attributed to Pfizer vaccinations, 42% to Moderna vaccine and 7% to J&J.\n• 365 reports of Guillain-Barré Syndrome, with 45% of cases attributed to Pfizer, 42% to Moderna and 19% to J&J.\n• 114,113 reports of anaphylaxis with 44% of cases attributed to Pfizer’s vaccine, 48% to Moderna and 8% to J&J.\n• 7,263 reports of blood clotting disorders. Of those, 3,151 reports were attributed to Pfizer, 2,566 reports to Moderna and 1,501 reports to J&J.\n• 1,576 cases of myocarditis and pericarditis with 1,001 cases attributed to Pfizer, 523 cases to Moderna and 48 cases to J&J’s COVID vaccine.\n\nPfizer to request emergency approval of COVID vaccine for kids ages 5-11 by fall\n\nFox News reported July 1, younger children could become eligible for a COVID vaccine this fall, according to a top executive at Pfizer who said the company has plans to request emergency approval of its vaccine in kids aged 5 to 11 by September or October. Pfizer’s vaccine is currently authorized for use in individuals aged 12 and older.\n\nDr. Alejandra Gurtman, vice president of vaccine clinical research and development at Pfizer, appeared along with representatives from other major drugmakers to discuss data and timelines behind pediatric clinical trials during a Johns Hopkins University and University of Washington virtual symposium.\n\nDespite growing reports of heart inflammation in teens linked to the vaccine, Gurtman said Pfizer “felt very comfortable to move down in age,” speaking to the trials involving participants aged 6 months to 11 years.\n\nMan dies after second dose of Moderna following rare blood clotting disorder linked to the vaccine\n\nAs The Defender reported June 29, doctors in Pennsylvania reported a case of a U.S. patient who developed blood clots after receiving the Moderna COVID vaccine. In a case report, published in the Annals of Internal Medicine, healthcare professionals said a 65-year-old man arrived at the hospital with a serious form of blood clotting known as thrombosis with thrombocytopenia (TTS) just 10 days after receiving his second dose of the Moderna vaccine.\n\nTwo days later, the unnamed patient died, with doctors concluding his symptoms were consistent with vaccine-induced clotting, also known as VITT. The man’s treatment providers did not recognize VITT earlier, so he did not receive the specialized treatment given to people who suffer from that condition, but instead was treated with heparin.\n\nDoctors at Allegheny Health said their research “complicates” theories that prior clotting cases were solely caused by adenovirus-based vaccines, as some experts have previously speculated. Doctors also stated they believed this to be the first reported case of blood clots following an mRNA vaccine, despite thousands of reported cases to VAERS.\n\nU.S. Sen. Ron Johnson holds new conference with families injured by COVID vaccines\n\nAs The Defender reported June 29, Sen. Ron Johnson (R-WI) held a news conference Monday to discuss adverse reactions related to the COVID vaccines — giving individuals who have been “repeatedly ignored” by the medical community a platform to share their stories.\n\nThe group that spoke was put together by Ken Ruettgers, a former Green Bay Packers offensive lineman, whose wife suffered an adverse reaction after receiving a COVID vaccine. Ruettgers, who now lives in Oregon, started a website to bring awareness of COVID vaccine reactions to the medical community.\n\n“We are all pro-vaccine,” Johnson said at the onset of the news conference. In fact, Johnson has had every flu shot since the Swine flu, is current on all of his vaccines and was a huge supporter of Operation Warp Speed, though he has not had a COVID vaccine because he already had COVID.\n\nFive people from across the U.S., including a 12-year-old girl who was part of the Pfizer clinical trial, joined the conference at the federal courthouse in Milwaukee. They described their reactions to the COVID vaccines, including neurological, cardiac and gastrointestinal issues, debilitating health problems and hospitalizations.\n\nJohnson said his goal was to provide a platform for these individuals who were injured by COVID vaccines so the health community and mainstream media would acknowledge them and get to the root cause.\n\nJohnson argued that while most people don’t suffer significant side effects following vaccination, he is concerned about “that small minority that are suffering severe symptoms.”\n\nThe Defender reported June 28, the U.S. Food and Drug Administration (FDA) on June 25 added a warning to patient and provider fact sheets for Pfizer and Moderna COVID vaccines indicating an increased risk of myocarditis and pericarditis, particularly following the second dose and with onset of symptoms within a few days after vaccination.\n\nThe FDA’s update followed a review of information and discussion by the CDC’s Advisory Committee on Immunization Practices meeting on June 23 where the committee acknowledged 1,200 cases of heart inflammation in 16- to 24-year-olds.\n\nHealth officials said the benefits of receiving a COVID vaccine still outweigh any risks. Physicians and other public commenters accused the CDC during the meeting of exaggerating the risk to young people of COVID, and minimizing the risk of the vaccines.\n\nTwo new studies show link between COVID vaccines and heart inflammation\n\nAs The Defender reported June 30, in a study published June 29 in JAMA Cardiology, 23 male military patients with a median age range of 25 years were evaluated between January and April 2021 for acute-onset chest pain following vaccination with an mRNA COVID vaccine.\n\nAll military members were previously healthy with a high level of fitness. They were physically fit by military standards and lacked any known history of cardiac disease, significant cardiac risk factors or exposure to cardiotoxic agents. Seven military members received Pfizer’s COVID vaccine and 16 received the Moderna vaccine.\n\nAccording to the study, physicians expected to find eight or fewer cases of myocarditis among the 436,000 male military members who received two mRNA doses. But 20 military members developed inflammation after their second dose, including 14 after the Moderna shot and six after the Pfizer shot. Three developed myocarditis after their first vaccine.\n\nResearchers stated that while the true incidence of myocarditis is unknown at this time, the presentation pattern and clinical course suggest an association with an inflammatory response to vaccination.\n\nA separate study published in JAMA Cardiology on June 29 investigated seven cases of acute myocarditis between Feb. 1 and April 30. Four cases occurred within five days of receiving a second dose of an mRNA COVID vaccine.”\n\n“It is possible that these four cases of acute myocarditis represent a rare, potential adverse event linked to mRNA COVID-19 vaccination,” researchers wrote. “The findings from the present report raise the possibility of an association between mRNA COVID-19 vaccination and acute myocarditis.”\n\nAs The Defender reported June 29, more than 4,100 people have been hospitalized or died with COVID in the U.S. despite having been fully vaccinated, according to new data from the CDC.\n\nAs of June 21, nearly half (49%) of cases occurred in females and 76% were aged 65 years and older. There were a total of 3,907 hospitalizations and 750 deaths among those who had breakthrough infections, although not all of the hospitalizations may have been due primarily to COVID.\n\nAccording to the CDC’s website, the number of COVID vaccine breakthrough infections are likely an undercount of all SARS-CoV-2 infections among fully vaccinated persons due to passive and voluntary reporting.\n\nOn May 1, the CDC transitioned from monitoring all reported vaccine breakthrough cases to only reporting cases resulting in hospitalization or death, a move the agency was criticized for by health experts.\n\nOn July 1, Fox6 Milwaukee reported that 21 people in Wisconsin have died of COVID since March 1 despite being fully vaccinated. The median age was 82 and all 21 people had underlying health conditions. The Wisconsin Department of Health Services said no gene sequencing was conducted so it is not clear whether anyone was infected with the Delta variant.\n\nAs Tulsa World reported July 1, data released for the first time Wednesday by the Oklahoma State Department of Health showed 737 infections in people who were fully vaccinated or had previously recovered from a COVID infection. Of 737 infections, 69 resulted in hospitalization and 11 people died, according to a state epidemiology report.\n\nOn July 1, 8NewsNow reported a Southern Nevada Health District released data showing a total of 70 breakthrough hospitalizations, including 11 breakthrough deaths, in Clark County alone.\n\nPeople injured by COVID vaccines turn to GoFundMe for help\n\nThe Defender reported July 2, a prominent vaccine injury law firm — Maglio Christopher & Toale — says it can’t help people injured by COVID vaccines because COVID vaccines are not covered under the National Vaccine Injury Compensation Program (NVICP), forcing many to raise funds for their injuries online.\n\nRenée Gentry, director of the Vaccine Injury Litigation Clinic at the George Washington University Law School, said COVID vaccine claimants have two rights: “You have the right to file,” she said. “And you have the right to lose.”\n\nAccording to research compiled by a group in Mesa County, Colorado, as of June 25 there were 180 GoFundMe accounts seeking help for people who had suffered injuries after receiving a COVID vaccine and were left with large medical bills and other expenses.\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nOn March 8, The Defender contacted the CDC with a written list of questions about reported deaths and injuries related to COVID vaccines. After repeated attempts, by phone and email, to obtain a response to our questions, a health communications specialist from the CDC’s Vaccine Task Force contacted us on March 29 — three weeks after our initial inquiry.\n\nThe individual received our request for information from VAERS, but said she had never received our list of questions, even though employees we talked to several times said CDC press officers were working through the questions and confirmed the representative had received them. We provided the list of questions again along with a new deadline, but never received a response.\n\nOn May 19, a CDC employee said our questions had been reviewed and our inquiry was pending in their system, but would not provide us with a copy of the response. We were told we would be contacted by phone or email with the response.\n\nOn June 24, we contacted the CDC and were told nobody knew the specialist from the agency’s Vaccine Task Force who contacted us in March, and that our request was still pending in the system. It has been 116 days since we sent our first email inquiring into VAERS data and reports and we have yet to receive a response.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "Latest CDC VAERS Data Show Reported Injuries Surpass 400,000 Following COVID Vaccines", "description": "Megan Redshaw - VAERS data released today by the CDC showed a total of 441,931 reports of adverse events from all age groups following COVID vaccines, including 6,985 deaths and 34,065 serious injuries.", "url": "https://www.wakingtimes.com/latest-cdc-vaers-data-show-reported-injuries-surpass-400000-following-covid-vaccines/", "site_name": "Waking Times", "article:published_time": "2021-07-05T15:00:08+00:00", "article:modified_time": "2021-07-05T15:38:50+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/07/Covid-Vaccine-many.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">.<a href=\"https://twitter.com/SenRonJohnson?ref_src=twsrc%5Etfw\">@SenRonJohnson</a> + former Green Bay Packers Ken Ruettgers held press conference with families who want to “be seen, heard + believed by medical community” after suffering adverse reactions to COVID vaccines.</p><p>SUBSCRIBE <a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a>: <a href=\"https://t.co/zL66Edfiw5\">https://t.co/zL66Edfiw5</a><a href=\"https://t.co/RIOEvNJ4uj\">https://t.co/RIOEvNJ4uj</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1409908796617547777?ref_src=twsrc%5Etfw\">June 29, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/07/Covid-Vaccine-many.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/cdc-vaers-injuries-400000-following-covid-vaccines/", "https://www.wakingtimes.com/latest-cdc-vaers-data-show-reported-injuries-surpass-400000-following-covid-vaccines/", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://ourworldindata.org/grapher/cumulative-covid-vaccinations?tab=chart&stackMode=absolute&country=~USA&region=World", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/pfizer-moderna-vaccines-blood-clots/", "https://childrenshealthdefense.org/defender/teen-hospitalized-brain-blood-clots-after-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/link-johnson-johnson-vaccine-blood-clots-cdc-28-cases-3-deaths/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420630", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420762", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1426828", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&WhichAge=range&LOWAGE=12&HIGHAGE=17", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1382906", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1242573", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1386841", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1199455", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXTYPES=COVID-19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=Pfizer/Biontech&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://childrenshealthdefense.org/defender/sign-petition-chd-fda-take-covid-vaccines-off-market/?utm_source=banner", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS[]=Bell%27s+palsy+%2810004223%29&SYMPTOMS[]=Facial+discomfort+%2810083537%29&SYMPTOMS[]=Facial+dysmorphism+%2810016045%29&SYMPTOMS[]=Facial+nerve+disorder+%2810061457%29&SYMPTOMS[]=Facial+neuralgia+%2810061594%29&SYMPTOMS[]=Facial+palsy+%2810016060%29&SYMPTOMS[]=Facial+paralysis+%2810016062%29&SYMPTOMS[]=Facial+paresis+%2810051267%29&SYMPTOMS[]=Facial+spasm+%2810063006%29&VAX=COVID19", "https://childrenshealthdefense.org/defender/fda-misled-public-pfizer-vaccine-efficacy/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.foxnews.com/health/pfizer-covid-19-vaccine-emergency-approval-kids-5-11-fall", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://coronavirus.jhu.edu/live/events/covid-19-and-kids-impacts-uncertainties-and-the-role-of-vaccines?fbclid=IwAR38h9wS1B6c2la2MyiQOSfDi8tWVSjkzzMMZkywXahuUgpcQU25xhtsjVw", "https://childrenshealthdefense.org/defender/link-heart-inflammation-pfizer-moderna-covid-vaccines-cdc-advisory/", "https://childrenshealthdefense.org/defender/man-dies-moderna-vaccine-rare-blood-clotting-disorder/", "https://childrenshealthdefense.org/defender/pfizer-moderna-vaccines-blood-clots/", "https://www.acpjournals.org/doi/10.7326/L21-0244", "https://www.hematology.org/covid-19/vaccine-induced-immune-thrombotic-thrombocytopenia", "https://childrenshealthdefense.org/defender/sen-johnson-ken-ruettgers-press-conference-families-injured-covid-vaccines/", "https://rumble.com/vj5xbf-senator-ron-johnson-milwaukee-news-conference.html", "https://childrenshealthdefense.org/defender_category/covid/", "https://twitter.com/SenRonJohnson?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/zL66Edfiw5", "https://t.co/RIOEvNJ4uj", "https://twitter.com/RobertKennedyJr/status/1409908796617547777?ref_src=twsrc%5Etfw", "https://www.c19vaxreactions.com/", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://www.wisn.com/article/covid-19-sen-ron-johnson-hosts-those-who-say-theyve-had-adverse-effects-of-vaccine/36867827#", "https://childrenshealthdefense.org/defender/scientists-challenge-health-officials-on-vaccinating-covid/", "https://childrenshealthdefense.org/defender/link-heart-inflammation-pfizer-moderna-covid-vaccines-cdc-advisory/", "https://childrenshealthdefense.org/defender/fda-heart-inflammation-warning-pfizer-moderna-covid-vaccines/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-june-25-2021", "https://childrenshealthdefense.org/defender/link-heart-inflammation-pfizer-moderna-covid-vaccines-cdc-advisory/", "https://childrenshealthdefense.org/defender/heart-inflammation-linked-covid-pfizer-moderna-vaccines-u-s-military/", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601%5C", "https://childrenshealthdefense.org/defender/isaiah-harris-teen-heart-attack-pfizer-covid-vaccine/", "https://childrenshealthdefense.org/defender/5th-exec-joins-moderna-billionaire-club-stock-price-soars-despite-injury-reports/", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781602", "https://childrenshealthdefense.org/defender/cdc-4115-fully-vaccinated-hospitalized-or-died-breakthrough-covid-infections/", "https://www.cdc.gov/vaccines/covid-19/health-departments/breakthrough-cases.html", "https://www.fox6now.com/news/21-wisconsinites-died-of-covid-despite-being-fully-vaccinated", "https://tulsaworld.com/news/state-and-regional/covid-19-latest-oklahoma-case-count-reveals-737-breakthrough-infections-as-state-virus-totals-rise/article_82f01d30-d8f1-11eb-9b5a-bba9b4f7b185.html", "https://oklahoma.gov/content/dam/ok/en/covid19/documents/weekly-epi-report/2021.06.30%20Weekly%20Epi%20Report.pdf", "https://www.8newsnow.com/news/health/coronavirus-health/local-experts-stress-importance-of-contact-tracing-as-covid-breakthrough-cases-rise/", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-no-compensation-program/", "https://www.mctlaw.com/", "https://www.reuters.com/legal/government/black-hole-covid-vaccine-injury-claims-2021-06-29/", "https://humanevents.com/2021/06/28/people-injured-by-vaccine-turn-to-gofundme-for-support/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/64-days-why-wont-cdc-answer-questions/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-07-05T15:00:08+00:00"}