{"result_id": "311006", "URL": "https://www.wakingtimes.com/eu-approves-covid-passport-heres-how-it-works-and-why-the-u-s-doesnt-have-one/", "timestamp": "2023-04-25 17:38:58 CEST+0200", "meta": {"description": "Megan Redshaw - The European Commission on June 14 signed legislation to create the EU Digital COVID Certificate.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/eu-approves-covid-passport-heres-how-it-works-and-why-the-u-s-doesnt-have-one/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "EU Approves COVID Passport: Here’s How It Works — and Why the U.S. Doesn’t Have One", "cleaned_text": "EU Approves COVID Passport: Here’s How It Works — and Why the U.S. Doesn’t Have One\n\nThe European Commission on June 14 formally signed legislation to create the EU Digital COVID Certificate. The regulation will take effect July 1 and expire in 12 months.\n\nMember States are required to start issuing the first certificates within six weeks of the July 1 start date, if they haven’t done so by then.\n\nDuring the official signing ceremony, three main EU institutions — Parliament, the Council and the Commission — signed the regulation to show their support, asserting the certificate is “a symbol of what Europe stands for.”\n\nBulgaria, Czechia, Denmark, Germany, Greece, Croatia and Poland started issuing the first passports on June 1. Austria, Estonia, Latvia, Lithuania, Luxembourg and Spain began issuing passports days later.\n\nThe remainder of the EU and Schengen Area countries, except for Hungary and Finland which are still in the test phase, are expected to connect to the new technology framework.\n\nUnder the vaccine passport scheme, each EU Member State will issue its own certificate, but all will adopt the same entry requirements for visitors.\n\nIndividuals will obtain their passports through test centers or health authorities, or directly via an eHealth portal.\n\nThe digital version of the certificate can be stored on a mobile device. Citizens can also request a paper version. Both will have a QR code that contains essential information, as well as a digital signature to make sure the certificate is authentic.\n\nThe Digital COVID Certificate will show that a person has been vaccinated against COVID-19, received a negative test result or recovered from the virus.\n\nThe certificate information differs based on the vaccination status of users. For those who have received their shot, the vaccine manufacture, date of vaccination and the number of doses will be documented.\n\nFor those who have not yet been vaccinated, Member States require PCR or antigen test results be provided when traveling between countries. The passport will record the “type of test, date and exact time of test, name of the test centre and the results.”\n\nThe stated intent of the Digital COVID Certificate is to allow people to move between EU countries without having to quarantine or undergo extra coronavirus tests. However, according to the regulation, member states can impose extra travel restrictions in cases where “additional measures are a must in order to safeguard the public health.”\n\nWhat about travelers from outside the U.S.?\n\nEarlier this month, an EU spokesperson said the app could be extended to citizens from non-EU countries, including U.S. Americans who obtain the certificate would be exempt from travel restrictions and quarantine requirements.\n\n“Right now if you’re an American, not living in the EU, you could get the certificate if you ask the national authorities of a member state to give you that certificate based on some proof that you’ve been vaccinated, or had a recent COVID test,” said the EU spokesperson.\n\nThe decision on whether to allow non-EU citizens to use the app rests with each individual member state.\n\nWhy U.S. won’t have national vaccine passport anytime soon\n\nA fierce debate has kicked off across the U.S. over whether a digital health certificate or “vaccine passports” should be required to prove vaccine status, The New York Times reported.\n\nSo far, the Biden administration has resisted the idea of a “vaccine passport” for the U.S. On May 28, U.S. Director of Homeland Security (DHS) Alejandro Mayorkas said the U.S. was taking a “very close look” at vaccine passports for international travel. Later that day, the DHS clarified there will be no “federal mandate” for vaccine passports in the U.S.\n\nAccording to the Los Angeles Times, the U.S. does not have a national database for immunization records that could act as the source of vaccination data for use in digital passes. That’s because a national system to create a unique identification number to link the health records of every American has been banned since 1998, spearheaded by then-Rep. Ron Paul (R-Texas), who said such a system would be an unwarranted privacy intrusion.\n\nAn attempt to overturn the ban passed the U.S. House in 2019, but was rejected by the Senate.\n\nIn the absence of a federal policy, Americans could need several digital passes, similar to having many credit cards in a wallet, The Los Angeles Times reported. It could also mean employers, businesses and venue operators will each have to decide which option works for them — or might not bother using any at all.\n\nA growing number of businesses — from cruise lines to sports venues — have already said they will require proof of vaccinations for entry or services.\n\nHundreds of digital health pass initiatives are attempting to launch apps that provide a verified electronic record of immunizations and negative COVID test results to streamline the process for businesses and other institutions.\n\nThe issue has sparked debate in the U.S., and led a number of states to introduce legislation to curtail or ban vaccine passports due to privacy, equity, liberty and accountability concerns.\n\nSo far, vaccine passports have been implemented in two states — New York and Hawaii.\n\nNew York implemented the “Excelsior Pass” — an electronic proof of vaccination developed by IBM — that some businesses in the state are requiring for entry.\n\nAccording to The New York Times, the state plans to expand the program — estimated to cost taxpayers $17 million — possibly using the system in the future to verify a resident’s age, driver’s license status and other health records.\n\nIn Hawaii, fully vaccinated individuals who upload proof of vaccination to the state’s “Safe Travels” system are allowed to travel inter-county without pre-travel testing or quarantine restrictions. Gov. David Ige said he is targeting July 4 for allowing vaccinated out-of-state travelers who come into Hawaii to bypass restrictions through a similar system.\n\nBeginning June 15, Hawaii will expand its passport program to trans-Pacific travelers who have been vaccinated in Hawaii.\n\nLate last week, California Gov. Gavin Newsom announced his state will roll out a new vaccine verification system for private businesses.\n\nDuring an event in San Francisco on June 14, Newsom said the system will consist of electronic vaccine cards that individuals can keep on their phones as opposed to carrying around a paper card.\n\nOnce the state fully reopens without capacity limits, which happened Tuesday, businesses can require individuals to show their vaccine cards to prove they do not need to wear a mask, SFGATE reported. Newsom will announce California’s version of this electronic system later this week.\n\nIn all of the new or proposed digital passes or apps in the U.S., people who have been vaccinated or received a negative test result must first consent to have their information uploaded into the pass or app, the Los Angeles Times reported.\n\nOutside the EU and U.S., Australia earlier this month rolled out a digital proof of vaccination certificate, and Japan plans to issue one as soon as this summer.\n\nMegan Redshaw is a freelance reporter for The Defender. She has a background in political science, a law degree and extensive training in natural health.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "EU Approves COVID Passport: Here’s How It Works — and Why the U.S. Doesn’t Have One", "description": "Megan Redshaw - The European Commission on June 14 signed legislation to create the EU Digital COVID Certificate.", "url": "https://www.wakingtimes.com/eu-approves-covid-passport-heres-how-it-works-and-why-the-u-s-doesnt-have-one/", "site_name": "Waking Times", "article:published_time": "2021-06-16T17:22:02+00:00", "article:modified_time": "2021-06-16T17:22:21+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/06/EU-digital-Covid-vaccine-certificate-travel-feature.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/06/EU-digital-Covid-vaccine-certificate-travel-feature.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/eu-digital-covid-certificate-states-vaccine-passport/", "https://www.wakingtimes.com/eu-approves-covid-passport-heres-how-it-works-and-why-the-u-s-doesnt-have-one/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-06-16T17:22:02+00:00"}