{"result_id": "311019", "URL": "https://www.wakingtimes.com/the-orwellian-vaccine-passport-agenda-relies-on-the-lie-of-the-social-contract/", "timestamp": "2023-04-25 17:39:08 CEST+0200", "meta": {"description": "Brandon Smith - Who gets to decide what medical procedures are acceptable to enforce? Who gets to be the all powerful and benevolent overseer of every human being’s health path?", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/the-orwellian-vaccine-passport-agenda-relies-on-the-lie-of-the-social-contract/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "The Orwellian Vaccine Passport Agenda and the Lie of the \"Social Contract\"", "cleaned_text": "The Orwellian Vaccine Passport Agenda and the Lie of the “Social Contract”\n\nThere is a fundamental question that needs to be asked when examining the vaccine passport issue, and what I find is that almost no one in the mainstream is tackling it directly. The question is this:\n\nFurthermore, who gets to decide what medical procedures are acceptable to enforce? Who gets to be the all powerful and benevolent overseer of every human being’s health path? I ask this because I don’t think many people realize the future repercussions of allowing governments or corporations (the same thing these days) to dictate covid vaccinations. It doesn’t stop there; in fact, we have no idea where this stops once the Pandora’s box is opened.\n\nFor example, the primary argument of the covid cult and the establishment in favor of vaccine passports is the “social contract” fantasy. They claim that because we “live in a society”, everything we do affects everyone else in some way, and because we are all interconnected in our “collective” we are thus beholden to the collective. In other words, the collective has the “right” to micro-manage the life of the individual because if the individual is allowed to make his/her own decisions they might potentially cause harm to the whole group.\n\nIn case you are not familiar with this philosophy it is an extension of socialism and cultural Marxism, and it stands at the very core of vaccine passport propaganda. I have actually had public debates with pro-socialist people in the past who have tried to defend the merits of socialism and every single time the argument comes down to one singular disconnect – I say that if a group of people want to go off and start their own little socialist community they have every right to…as long as it is VOLUNTARY. Then if it fails and collapses it doesn’t matter because it doesn’t affect me or anyone else who did not want to participate.\n\nThe problem is that these Socialists/communists/Marxists/collectivists simply do not grasp the notion of voluntarism. They believe that people need to be forced into doing the right thing or helping others, and they are the people that get to decide what the right thing is and who gets the help. They are the people that get to decide what freedoms are acceptable and what freedoms are inconvenient to their agenda. When they say “We live in a society…”, what they really mean is “You live in OUR society, and WE will determine what is best for you.”\n\nWhen I argue that a socialist community should be voluntary, they inevitably argue that people will not commit to such a system voluntarily so they must be forced to do what is best for the “greater good”.\n\nIn terms of vaccine passports, the collectivist social contract is a key element. They claim that being unvaxxed is not a personal freedom because the unvaxxed are a risk to the lives of everyone else. The social contract is therefore violated because by making a personal life choice you are endangering the rights of others.\n\nIt’s interesting though how the covid cult is made up of people that do not apply the same logic to other health issues like abortion. I mean, there is zero substantiated evidence to support the claim that unvaccinated people are any more of a threat to the lives of others than vaccinated people are, and we will get into that in just a moment. But, when we talk about an abortion, we are talking about a personal medical decision that leads to the direct and observable death of another innocent human being with his/her own rights. Abortions end the lives of over 800,000 unborn people per year in the US, far more than covid supposedly does.\n\n“My body my choice” apparently only applies to killing babies, but not to people who do not want to become guinea pigs for a mRNA cocktail with no long term testing to prove its safety.\n\nImagine though if we reversed the scenario and applied the broad social contract argument to something like children and population? A collectivist/leftist member of the global warming cult could also argue that abortion should be legally mandated, because having a child or “too many children” increases carbon emissions and this puts society “at risk” even further (again, with no proof to support the claim). By allowing the social contract narrative to go unchecked, we open the door to horrific new oppressive measures and a complete erasure of our autonomy.\n\nI think it’s safe to say that the “social contract” ideology is highly selective and hypocritical. The covid cult does not care about saving lives, they only care about their ideological narrative and the power to make people submit to it. But let’s dig even further into the reasoning behind the social contract claim. Who is actually dying because of unvaccinated individuals, which according to state vax statistics make up around 50% of the US population?\n\nThe average Infection Fatality Rate (IFR) of covid is a mere 0.26% according to dozens of studies and the government’s own numbers. Meaning, unvaxxed people are not even a remote threat to 99.7% of the population. Around 40% of all covid deaths are made up of people in nursing homes with preexisting conditions, which means that we do not know if they actually died of covid or due to the health problems they were already suffering from. The pool of people who might be affected by the unvaxxed grows smaller and smaller…\n\nAnd what about the ridiculous contradiction that arises when we talk about the mandate narrative verses the passport narrative? If masks and vaccines actually work, then how is an unvaxxed or unmasked person a threat to a vaxxed person? If the vaccines and masks don’t work, then why use them at all, and why demand forced vaccinations through passport measures?\n\nMainstream propaganda asserts that the unvaxxed will somehow become petri dishes for new mutations that will harm vaccinated people. There is no evidence to support this claim. In fact, there is more evidence that suggests it is vaccinated people that will trigger mutations and variants. The media says that this is not cause for any concern, but if it’s not then neither should we be concerned about mutations that gestate in the unvaxxed population, if there are any.\n\nThe fact of the matter is that more and more scientific evidence is proving that the experimental vaccines are NOT effective and that the unvaxxed are actually safer from covid regardless of the variant or mutation.\n\nThe true infection numbers within the US are impossible to know because up to 59% of people that catch covid and spread it are asymptomatic according to the CDC. They never know that they have it so they are unlikely to test for it. That said, it is clear that many millions of Americans have dealt with the virus and now have a natural immunity to it (I happen to be one of them). Establishment elitists like Anthony Fauci refuse to acknowledge natural immunity as a factor, and they say that ONLY people who are vaccinated are qualified to receive a passport. Why?\n\nMultiple studies are being released from countries with high vaccination rates like Israel that completely contradict Fauci’s narrative on natural immunity. Israel has a vax rate of around 63% according to government stats, but scientific evidence they have released shows that vaccinated people are 13-27 times more likely to contract covid and 8 times more likely to be hospitalized when compared with people who have natural immunity. It almost appears as if the mRNA vaccines make people MORE susceptible to the virus rather than less susceptible.\n\nRecent data released from the state of Massachusetts supports this concern. In the month of July, MA reported at least 5100 covid infections, all people who were fully vaccinated. Over 80 of them died, which is a much higher death rate than among the unvaccinated. In my county of 20,000 people, which has a low vaccination rate and no mask mandates, there were only 17 total covid deaths in the first year year of the pandemic.\n\nThis begs the question: Why take the mRNA cocktail at all? What is there to gain? Well, there is nothing to gain in terms of health safety. Even if you happen to be part of the 0.26% of people at risk from covid, you are better off in the long run taking your chances with natural immunity than getting the jab.\n\nThe answer to the question is not about health, but about denial of access. Government’s and their corporate partners are trying to make it so you MUST take the vaccine in order to participate in normal social activities, or even to keep a job. Not only that, but the process goes on forever because every year there will be new variants and new booster shots. The only reason to take the vaccine is to keep at least a handful of your freedoms and to avoid poverty and starvation.\n\nHere is where we must go back to the original query presented at the beginning of this article:\n\nThe covid cult will say that private business rights trump individual rights so companies should be allowed to discriminate against employees based on their vaccination status. But then again, what we are facing in most cases are NOT private businesses but conglomerates that are funded by government bailouts and that are colluding directing with governments to enforce the passport agenda. So I would have to say no, these businesses do not have a legal right to feed on public tax dollars and then claim they are private entities that have the freedom to invade the medical privacy of employees and customers.\n\nAnd since when do collectivists actually care about private business rights, anyway? More hypocrisy…\n\nIf we are talking about small and medium business with no government stimulus then the issue gets more tricky. In many states and other countries the businesses are only enforcing passports because if they don’t they will be punished by the government. In this case the private business rights argument goes out the window. The covid cult respects business independence only when it suits them.\n\nFrankly, it is small businesses that are being hurt the most by the covid mandates and the extra costs involved just in enforcing the passports in their own establishments is going to bury them. Any small business owner that voluntarily supports the passport rules must have a financial death wish.\n\nIn terms of government, the covid cult will claim that there are Supreme Court precedents for legal enforcement of vaccinations. Honestly, I don’t care, and neither do millions of other Americans. A bunch of high priests in black robes do not get to dictate my independent health decisions; I make those decisions and there’s nothing that they can do about it. This is where we have to come to terms with the morals and principles involved – The lives of others are in no way affected by my decision to refuse to comply with vaccine passports. And just because a group of people have irrational fears about the threat of covid does not mean people with more discernment about the facts should be required to make them “feel better” or feel safer.\n\nThe bottom line is this: Our freedoms are more important than your paranoid fears, and we will not comply. We do not subscribe to your false social contract, and you are in no position to dictate the terms of our “society”. Don’t like it? You are more than welcome to leave the country and start a vaccinated Utopia somewhere else. We’ll see how that works out for you in the long run.\n\nBrandon Smith writes for Alt-Markets.us. If you would like to support the work that Alt-Market does while also receiving content on advanced tactics for defeating the globalist agenda, subscribe to our exclusive newsletter The Wild Bunch Dispatch. Learn more about it HERE.\n\nLike Waking Times on Facebook. Follow Waking Times on Telegram.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Orwellian Vaccine Passport Agenda and the Lie of the \"Social Contract\"", "description": "Brandon Smith - Who gets to decide what medical procedures are acceptable to enforce? Who gets to be the all powerful and benevolent overseer of every human being’s health path? ", "url": "https://www.wakingtimes.com/the-orwellian-vaccine-passport-agenda-relies-on-the-lie-of-the-social-contract/", "site_name": "Waking Times", "article:published_time": "2021-09-04T01:46:05+00:00", "article:modified_time": "2021-09-04T01:46:42+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/09/shame-fingers-pointing_0.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/09/shame-fingers-pointing_0.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://alt-market.us/the-orwellian-vaccine-passport-agenda-relies-on-the-lie-of-the-social-contract/", "https://www.wakingtimes.com/the-orwellian-vaccine-passport-agenda-relies-on-the-lie-of-the-social-contract/", "https://www.mayoclinic.org/coronavirus-covid-19/vaccine-tracker", "https://www.medrxiv.org/content/10.1101/2020.05.13.20101253v2", "https://www.acpjournals.org/doi/10.7326/M20-5352?utm_source=24-scientists-determine-death-rate-covid-19-general-population&utm_medium=email&utm_content=published+in+the+Annals+of+Internal+Medicine&utm_campaign=ag&", "https://www.nbcnews.com/know-your-value/feature/39-covid-19-deaths-have-occurred-nursing-homes-many-could-ncna1250374", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.npr.org/2021/02/09/965703047/vaccines-could-drive-the-evolution-of-more-covid-19-mutants", "https://www.webmd.com/lung/news/20210110/59-percent-of-covid-cases-stem-from-asymptomatic-spread", "https://www.science.org/content/article/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-vaccination-remains-vital", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://www.nbcboston.com/news/local/more-than-5100-breakthrough-covid-cases-reported-in-mass-at-least-80-have-died/2435719/", "https://alt-market.us/styles-2/", "https://www.facebook.com/WakingTimes", "https://t.me/wakingtimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-09-04T01:46:05+00:00"}