{"result_id": "311042", "URL": "https://www.wakingtimes.com/we-wont-be-human-guinea-pigs-117-doctors-nurses-sue-over-forced-experimental-vaccine/", "timestamp": "2023-04-25 17:39:22 CEST+0200", "meta": {"description": "Matt Agorist - The company’s CEO gave all the employees of the network, some 26,000 people, a deadline of June 7 to be vaccinated or be fired.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/we-wont-be-human-guinea-pigs-117-doctors-nurses-sue-over-forced-experimental-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "‘We Won’t Be Human Guinea Pigs’: 117 Doctors, Nurses Sue Over Forced ‘Experimental’ Vaccine", "cleaned_text": "Houston, TX — Over a hundred doctors and nurses who work in the Houston Methodist hospital network have filed a lawsuit against the company, arguing that they don’t want to be forced to take an “experimental” vaccine. This lawsuit could pave the way for other health care workers to make similar claims.\n\nAccording to the lawsuit, the company’s CEO, Marc Boom gave all the employees of the network, some 26,000 people, a deadline of June 7 to be vaccinated or be fired.\n\nA total of 117 plaintiffs are insisting that the hospital is “illegally requiring its employees to be injected with an experimental vaccine.” The hospital is forcing the staff to be “human ‘guinea pigs’ as a condition for continued employment,” the lawsuit says.\n\n“This is my body, this is my choice, and I don’t think employers, or anyone should mandate what goes into my body,” Kim Mikeska, a registered nurse, told the Houston Chronicle.\n\nHouston Methodist nurse Jennifer Bridges, the lead plaintiff in the case, told the Washington Post this month that she had received “every vaccine known to man” in the past, but believed the coronavirus vaccines needed further study.\n\nThe lawsuit referred to the vaccines as “experimental COVID-19 mRNA gene modification injection.”\n\n“It is a severe and blatant violation of the Nuremberg Code and the public policy of the state of Texas,” attorney Jared Woodfill, who filed the lawsuit in Montgomery County, told local news, and he’s right.\n\nBecause the current Moderna, Pfizer, and J&J vaccines have been only authorized by the FDA under Emergency Use Authorization (EUA), the safety and effectiveness data are still being collected. This means the current mass vaccination program is an experiment in an on-going study in which researchers may still find small effect-size side effects.\n\nIt is a fact that vaccines that receive EUA are considered experimental until the FDA formally approves it as it is entirely possible that a rare side effect will be found after mass vaccination allows a longer term of observation on a larger number of people.\n\nTherefore, it can be argued that forcing employees to take the vaccine is a medical ethics violation. According to the 1947 Nuremberg Code:\n\nThe voluntary consent of the human subject is absolutely essential. This means that the person involved should have legal capacity to give consent;\n\n should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, overreaching,\n\n or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved\n\n as to enable him to make an understanding and enlightened decision. This latter element requires that before the acceptance of an affirmative decision\n\n by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is\n\n to be conducted; all inconveniences and hazards reasonably to be expected; and the effects upon his health or person which may possibly come from his\n\n participation in the experiment.\n\nThe fact that these vaccines are currently under EUA makes all attempts to mandate them, a direct violation of the Nuremberg Code as the number one premise behind it is that “the voluntary consent of the human subject is absolutely essential.”\n\nThere is nothing voluntary about vaccine passports, forced vaccinations, or any other form of government or employee coercion methods to increase COVID-19 vaccination rates.\n\nOn an ethical stance alone, the very premise of these ideas are based on violations of the Nuremberg Code. Nevertheless, government officials, media, and academia alike, continue to shame, coerce, and threaten those who choose to abstain from the vaccine.\n\nMarc Boom, the company’s CEO disagrees, however, and says “it is legal for health care institutions to mandate vaccines, as we have done with the flu vaccine since 2009″\n\nHe then went on to completely dismiss the facts in the case, claiming that the COVID-19 vaccines are “not experimental.”\n\nGiven the recent changes to the federal Occupational Safety and Health Administration (OSHA) guidelines over forced vaccinations in the workplace, Boom may want to reconsider his stance.\n\nAs TFTP reported earlier this month, OSHA recently changed the “vaccine related” requirement for on-the-job injuries. In three parts it details the liability.\n\nAre adverse reactions to the COVID-19 vaccine recordable on the OSHA recordkeeping log? In general, an adverse reaction to the COVID-19 vaccine is recordable if the reaction is: (1) work-related, (2) a new case, and (3) meets one or more of the general recording criteria in 29 CFR 1904.7 (e.g., days away from work, restricted work or transfer to another job, medical treatment beyond first aid). If I require my employees to take the COVID-19 vaccine as a condition of their employment, are adverse reactions to the vaccine recordable? If you require your employees to be vaccinated as a condition of employment (i.e., for work-related reasons), then any adverse reaction to the COVID-19 vaccine is work-related. The adverse reaction is recordable if it is a new case under 29 CFR 1904.6 and meets one or more of the general recording criteria in 29 CFR 1904.7.\n\nIn a third bullet point, OSHA explicitly notes that employers who do not require their employees to take the vaccine, will not be held liable through the recording criteria in 29 CFR 1904.7. The guideline notes that in order for an employer to be free from liability, the vaccine must be “truly voluntary,” meaning no negative reports for unvaccinated employees.\n\nI do not require my employees to get the COVID-19 vaccine. However, I do recommend that they receive the vaccine and may provide it to them or make arrangements for them to receive it offsite. If an employee has an adverse reaction to the vaccine, am I required to record it? No. Although adverse reactions to recommended COVID-19 vaccines may be recordable under 29 CFR 1904.4(a) if the reaction is: (1) work-related, (2) a new case, and (3) meets one or more of the general recording criteria in 29 CFR 1904.7, OSHA is exercising its enforcement discretion to only require the recording of adverse effects to required vaccines at this time. Therefore, you do not need to record adverse effects from COVID-19 vaccines that you recommend, but do not require. Note that for this discretion to apply, the vaccine must be truly voluntary. For example, an employee’s choice to accept or reject the vaccine cannot affect their performance rating or professional advancement. An employee who chooses not to receive the vaccine cannot suffer any repercussions from this choice. If employees are not free to choose whether or not to receive the vaccine without fearing adverse action, then the vaccine is not merely “recommended” and employers should consult the above FAQ regarding COVID-19 vaccines that are a condition of employment. Note also that the exercise of this discretion is intended only to provide clarity to the public regarding OSHA’s expectations as to the recording of adverse effects during the health emergency; it does not change any of employers’ other responsibilities under OSHA’s recordkeeping regulations or any of OSHA’s interpretations of those regulations. Finally, note that this answer applies to a variety of scenarios where employers recommend, but do not require vaccines, including where the employer makes the COVID-19 vaccine available to employees at work, where the employer makes arrangements for employees to receive the vaccine at an offsite location (e.g., pharmacy, hospital, local health department, etc.), and where the employer offer the vaccine as part of a voluntary health and wellness program at my workplace. In other words, the method by which employees might receive a recommended vaccine does not matter for the sake of this question.\n\nThis clarification by OSHA is especially relevant thanks to the The National Vaccine Injury Compensation Program (NVICP) which removes any and all liability from vaccine manufacturers even if their product kills someone.\n\nYou can actually prove that you or your child were harmed from a vaccine yet the vaccine maker is completely shielded from liability. Even if you are awarded monetary compensation through the NVICP, the taxpayers are put on the line, not the vaccine makers.\n\nIf companies have to start footing the bill for lawsuits related to COVID-19 vaccine adverse reactions, the implications for vaccine manufacturers could be massive especially given the sheer magnitude of adverse events being reported to the CDC from the COVID-19 vaccine.\n\nThe most recent data released by the Centers for Disease Control and Prevention (CDC) on the number of injuries and deaths reported to the Vaccine Adverse Event Reporting System (VAERS) following COVID vaccines reveals there have been over 200,000 adverse events reported. Of those adverse reactions, according to the CDC, 4,863 of them are deaths.", "opengraph": {"locale": "en_US", "type": "article", "title": "‘We Won’t Be Human Guinea Pigs’: 117 Doctors, Nurses Sue Over Forced ‘Experimental’ Vaccine", "description": "Matt Agorist - The company’s CEO gave all the employees of the network, some 26,000 people, a deadline of June 7 to be vaccinated or be fired.", "url": "https://www.wakingtimes.com/we-wont-be-human-guinea-pigs-117-doctors-nurses-sue-over-forced-experimental-vaccine/", "site_name": "Waking Times", "article:published_time": "2021-05-31T16:13:54+00:00", "article:modified_time": "2021-05-31T18:16:42+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/05/Covid-Vaccine-10.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/we-wont-be-human-guinea-pigs-117-doctors-nurses-sue-over-forced-experimental-vaccine/", "https://thefreethoughtproject.com/doctors-nurses-file-lawsuit-forced-vaccination/", "https://www.houstonchronicle.com/news/houston-texas/houston/article/Group-protests-vaccine-mandate-for-Houston-16196680.php", "https://media.tghn.org/medialibrary/2011/04/BMJ_No_7070_Volume_313_The_Nuremberg_Code.pdf", "https://thefreethoughtproject.com/conspiracy-theory-vaccine-passport/", "https://www.osha.gov/coronavirus/faqs#vaccine", "https://www.osha.gov/laws-regs/regulations/standardnumber/1904/1904.7", "https://www.hrsa.gov/vaccinecompensation/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://www.wendymyersdetox.com/29KK7GX/BP658/"], "authors": ["WakingTimes"], "publish_date": "2021-05-31T16:13:54+00:00"}