{"result_id": "311046", "URL": "https://www.wakingtimes.com/theyre-criminal-establishment-now-dangerously-dehumanizing-the-vaccine-hesitant/", "timestamp": "2023-04-25 17:39:24 CEST+0200", "meta": {"description": "Matt Agorist - It is entirely possible that the United States as we know it may be over — and all it took was a virus with a 99% survival rate.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/theyre-criminal-establishment-now-dangerously-dehumanizing-the-vaccine-hesitant/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "‘They’re Criminal!’—Establishment Now Dangerously Dehumanizing the Vaccine Hesitant", "cleaned_text": "Last week, President Joe Biden took to his pulpit to read from the teleprompter and announced mandatory vaccinations for government workers. Without citing any evidence, Biden claimed that “We have a pandemic because of the unvaccinated.” He must have missed the part where the pandemic started before there was a vaccine.\n\nAfter this claim, Biden further lambasted those who haven’t gotten the COVID-19 jab, telling them, “If in fact you’re unvaccinated, you present a problem to yourself, to your family and to those with whom you work.”\n\nBefore going on any further, to dispel any claims that the Free Thought Project is “anti-vax” it is important to point out that we feel people should have a right to informed consent. There are many who can benefit from the COVID-19 vaccine and they should consult their doctors and make the best choice for themselves, individually. The same goes for those who may suffer potential harms from receiving the vaccine. No one here is anti-vaccine, we are, however, pro-safety, and pro-informed consent as anything else is tyranny.\n\nWith that being said, the scolding of Americans for asserting their medical freedom has reached fever pitch and it has shifted from ridicule to outright dehumanization.\n\nRecently, CNN took to calling for “the unvaccinated” to be banned from buying food, going out in public, or even having jobs.\n\n“I’m sure a lot of people are not going to agree with this, but [if you] don’t get the vaccine, you can’t go to the supermarket. Don’t have the vaccine, can’t go to the ball game. Don’t have a vaccine, can’t go to work. You don’t have a vaccine, can’t come here. No shirt, no shoes, no service,” said Don Lemon. “I think that’s where we should be right now because we continue to waste our breath on people who are just not going to change. You know, circular logic, they keep going back and saying, ‘Well, it’s my freedom.’ ‘It’s whatever.’ ‘I’m free.’”\n\nAfter CNN’s attack on the vaccine hesitant, MSNBC followed suit, having NYC Mayor Bill de Blasio on to take it to the next level.\n\nLet me tell you, Joe, the anti-vaxxers are criminal at this point. What they are doing to this country is undermining our future. They really are. They’re taking away the future of this country, because if we go backwards, if we go back to restrictions and shutdowns, this country’s going to be in a horrible, dangerous place in terms of our lives, our livelihoods, our economy. And if we don’t get it right on vaccination, we’re going to lose a huge number of Americans. There are people out there peddling this message, this anti-vax message for their own profit and then attacking people who try and do it the right way like the small businesses you’re talking about. We got to confront them. That’s why I think these mandates are so crucial.\n\nThis type of demonization in the media not only flies in the face of everything a free society is about but it is also extremely dangerous. Demonizing or dehumanizing the enemy is a propaganda tactic used by regimes throughout history to make it easier to accept the persecution and even mass murder of those who disagree with a certain principle.\n\nThe technique of dehumanizing a perceived enemy — even if they are entirely peaceful and pose no threat — promotes an idea about the enemy being a threatening, evil aggressor with only destructive objectives. In the above media clip, all of these traits are on display.\n\nDemonization of the “vaccine hesitant” or those concerned about the safety of the vaccine makes it easier for “the other side” to hate them, thereby eliminating the possibility of a diplomatic or trust based solution and inevitably leads to the worsening of the situation.\n\nThose in the media, who continue to push this tactic of demonization are doing far more harm than they think as the ultimate goal of governments dehumanizing their enemy is to make killing them more acceptable.\n\nThese tactics made it easy for most Americans to sit back and watch — and even revel in — the wholesale slaughter of innocent men, women, and children in the Middle East over the last two decades. Now, it’s being used inside our own country.\n\nDemonization, politicization, and lack of transparency are the moves which have gotten us to this point. Employing more of the same will only worsen the situation. No successful freedom-promoting policy has ever been implemented by dividing society and pitting them against each other. In fact, it is quite the opposite.\n\nHad politicians not been caught in lie after lie and deception after deception, rest assured, we would not be in this situation. Unfortunately, however, because the establishment is unable to use honesty, transparency, reason, and logic, this situation will only devolve.\n\nIt is entirely possible that the United States as we know it may be over — and all it took was a virus with a 99% survival rate.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "‘They’re Criminal!’—Establishment Now Dangerously Dehumanizing the Vaccine Hesitant", "description": "Matt Agorist - It is entirely possible that the United States as we know it may be over — and all it took was a virus with a 99% survival rate.", "url": "https://www.wakingtimes.com/theyre-criminal-establishment-now-dangerously-dehumanizing-the-vaccine-hesitant/", "site_name": "Waking Times", "article:published_time": "2021-08-02T18:41:10+00:00", "article:modified_time": "2021-08-02T18:42:52+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/08/Vaccine-Tyranny.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">They’re saying it out loud <a href=\"https://t.co/JAn7QCxYky\">pic.twitter.com/JAn7QCxYky</a></p><p>— Echo Chamber (@echo_chamberz) <a href=\"https://twitter.com/echo_chamberz/status/1421320073067646978?ref_src=twsrc%5Etfw\">July 31, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/08/Vaccine-Tyranny.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://thefreethoughtproject.com/dehumanization-campaign-establishment-media/", "https://www.wakingtimes.com/theyre-criminal-establishment-now-dangerously-dehumanizing-the-vaccine-hesitant/", "https://thefreethoughtproject.com/biden-mandates-vaccines-federal-workers/", "https://t.co/JAn7QCxYky", "https://twitter.com/echo_chamberz/status/1421320073067646978?ref_src=twsrc%5Etfw", "https://www1.nyc.gov/office-of-the-mayor/news/521-21/transcript-mayor-de-blasio-appears-live-msnbc-s-morning-joe", "https://books.google.com/books?id=nXEFyfwXSvEC&pg=PA91%7Cdate%3D7&hl=en#v=onepage&q&f=false", "https://thefreethoughtproject.com/dronw-whistelblower-daniel-hale-prison-presidents/", "https://thefreethoughtproject.com/hypocrite-politicians-keep-getting-caught-breaking-covid-19-rules-heres-a-list-of-them/", "https://thefreethoughtproject.com/non-mask-wearing-politician-hypocrites/", "https://twitter.com/MattAgorist", "https://steemit.com/@tftproject", "https://www.minds.com/mattagorist", "https://www.facebook.com/WakingTimes", "https://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-08-02T18:41:10+00:00"}