{"result_id": "311004", "URL": "https://www.wakingtimes.com/physicians-the-vaccine-tyranny/", "timestamp": "2023-04-25 17:38:57 CEST+0200", "meta": {"description": "Blaise Edwards, M.D. - I beg physicians to get back to basics, investigate the real literature and take a stand. Society needs us to do this.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/physicians-the-vaccine-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Physicians & The Vaccine Tyranny", "cleaned_text": "I find myself in the position that I must use an alias for fear of reprisal. Those days may be quickly coming to an end, as hospitals are denying requests for vaccine exemptions with impunity. I will likely soon be out the door, with nothing to lose. Even if I survive this round, if the “pandemic” continues, it won’t be long before I am shelved like a can of spam.\n\nDoctors need to be called out. From early in the pandemic, it was like a mass hypnosis or forgetfulness of everything we had learned in medical school. Immune system knowledge was shelved and replaced by government dictates. The thought of early outpatient treatment with “off label” drugs that could modulate the immune system was forbidden. We essentially told patients that they had to go home and wait until they were sick enough to be hospitalized, then treatment would begin. Imagine telling all diabetics that there is no metformin, Glucophage, or insulin. Would we really wait until patients are in diabetic ketoacidosis, and then treat them only at the hospital? It is medical malfeasance of a grand scale.\n\nWe physicians gave up our training and our reasonable medical thought process. The reasons are multiple. First, it was the easy way out. Second, many of us are employed and fear reprisal. Third, despite what the public thinks, we physicians are not bold leaders, we tend to be sheep, and are afraid of having an entire institution ostracize us or our colleagues to think us crazy.\n\nAs we got to the point of vaccine rollout, doctors were not using the scientific method, questioning and challenging prevailing hypotheses. They kept their heads down, closed clinics, converted to telemedicine, and pushed only the jab.\n\nI had conversations with doctors who are supposed experts in virology and immunology denying the lasting immunity of natural infection.\n\nReally, are these the leaders we want?\n\nOther conversations about the safety of vaccines:\n\nLately, it has been all about getting 100% of the population jabbed. For what reason? I am not sure, and some of the more detailed and investigated theories scare me. I shudder to think. But last year’s heroes are being labeled selfish and villainous for not getting the vaccine. Hospital systems have abandoned their community’s health and ignored early successful outpatient treatment in favor of huge government subsidies for inpatient and ICU treatment. The success of these treatments was not great, but that is another article. Now we have the same hospital systems turning their backs on their own employees. Basically, health providers have a choice, get shot, or get fired. How does that help? Both vaxxed and unvaxxed can spread the virus, so it doesn’t help anyone. It only helps the hospital to get more government money by meeting quotas.\n\nI, for one, will remember that when we faced a real crisis, the hospitals and many physicians chose money and profit over their own community’s best interest. Perhaps it is time for groups of physicians to get back to running their own healthcare clinics and hospitals. We used to have a code of ethics. We used to put patients first. Not anymore.\n\nAs for physicians, those who are blindly following the government edicts are culpable in a moral atrocity. Bullying and deriding patients who chose to refrain from this still experimental therapy is an abomination. (You will say it isn’t experimental anymore, to which I would say that just because the government broke its own rules regarding approval, doesn’t make it legal or right). Patients have sincere beliefs for making their choice. Respect their thoughts. Do you yell as much at smokers, drinkers, fornicators, drug abusers, etc? No, I think not. I think you chose to fit in because it gives you a sense of righteousness.\n\nAnd going so far as to encourage vaccination in children and pregnant women is crazy. There is blood on the hands of any physician who does this. With children, there is no benefit to the vaccine, only harm. They would serve themselves and society better with natural immunity. The vaccine hasn’t been studied on women and their babies. It is pregnancy category X (unknown) but being pushed wholesale on these poor women without proper studies. Shame on you, doctors who are doing this. I certainly have lots to answer for when I meet my maker, but this is on another level.\n\nI beg physicians to get back to basics, remember all the epidemiology and immunology that bored us to tears in school. Investigate the real literature and take a stand. Society needs us to do this. Even if you have been vaccinated, help those who are fighting for their lives. Stand up against this forced vaccine tyranny. Support those who have legitimate reasons for declining the jab. If you don’t stand up now, who will stand up for you when you are faced with your choice of yet another booster or your job.\n\nLike Waking Times on Facebook. Follow Waking Times on Telegram.", "opengraph": {"locale": "en_US", "type": "article", "title": "Physicians & The Vaccine Tyranny", "description": "Blaise Edwards, M.D. - I beg physicians to get back to basics, investigate the real literature and take a stand. Society needs us to do this. ", "url": "https://www.wakingtimes.com/physicians-the-vaccine-tyranny/", "site_name": "Waking Times", "article:published_time": "2021-10-25T10:16:21+00:00", "article:modified_time": "2021-10-25T10:16:37+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/10/Covid-Doctor.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/10/Covid-Doctor.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://www.americanthinker.com/articles/2021/10/physicians_and_the_vaccine_tyranny_.html", "https://www.wakingtimes.com/physicians-the-vaccine-tyranny/", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.facebook.com/WakingTimes", "https://t.me/wakingtimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-10-25T10:16:21+00:00"}