{"result_id": "311014", "URL": "https://www.wakingtimes.com/being-fully-vaccinated-is-an-endless-destination/", "timestamp": "2023-04-25 17:39:05 CEST+0200", "meta": {"description": "Makia Freeman - Being fully vaccinated is painted by the MSM (Mainstream Media) as a civic duty, a moral responsibility and ‘the right thing to do.’ What does it actually mean?", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/being-fully-vaccinated-is-an-endless-destination/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Being Fully Vaccinated is an Endless Road to a Questionable Destination", "cleaned_text": "Being Fully Vaccinated is an Endless Road to a Questionable Destination\n\nBeing fully vaccinated is painted by the MSM (Mainstream Media) as a civic duty, a moral responsibility and ‘the right thing to do.’ Putting aside the outrageous propaganda involved in that claim for a minute, let’s focus for now on what that even means. What is fully vaccinated? 1 shot? 2 shots? 3 shots (2 shots plus a booster)? 4 shots? The answer not only depends where you are but when you are. Many Israelis protested when their government required a 4th COVID vax shot for them to keep their vaccine passport (called a Green Pass) valid. Perhaps it finally dawned on them that being fully vaccinated was going to be something whose definition their government, not they, decided. But it’s not just about location, it’s also about what point in time you’re occupying. Fully vaccinated means different things at different points in the scamdemic. That’s the whole point: the term fully vaccinated is designed to mean whatever the New World Order (NWO) controllers want it to mean at any given time.\n\nWashington Post Spells out the NWO COVID Agenda: You Will Never Be Fully Vaccinated\n\nIn an article published on October 22nd 2021, the Jeff Bezos-owned MSM Washington Post tries to explain away the very basis for why it was telling people to get vaxxed in the first place. It’s one of countless contradictions in the official COVID narrative (see others here) which, if it were a high-school student, would have scored an F for internal coherency and logic. One of the dominant and prevailing mantras of the COVID plandemic has been “vaccination is the only way out of this” and “the vaccine is the path back to normalcy.” Truth be told, gene-modifying vaccines are the path to the New Normal, part of the WEF’s Great Reset (a rebranding of the NWO) through introducing nanotechnology into people’s bodies. The idea that COVID vaccines are the only way out relies on so many assumptions, such as that the virus exists, that Big Pharma vaccine manufacturers had a real specimen of it when they made the vaccine, that COVID is a new disease caused by SARS-CoV-2 and many more. Remember, even Big Pharma companies have admitted that the vaccine was never designed to stop COVID transmission or stop serious COVID infection.\n\nThe Washington Post admits the definition of “fully vaccinated” is a moving target:\n\n“All of this boils down to, essentially, an ongoing attempt to define “fully vaccinated.” Who is “fully vaccinated” against covid-19, and for how long? The honest answer is that the target is moving before our eyes. Until 2021, “fully vaccinated” was not a standard phrase, any more than “fully married” or “fully graduated from college.” Typically a person is considered “vaccinated” or “unvaccinated.” … Early this year, as coronavirus vaccines began to become available to the public, the term was useful … Ten months later, abundant new evidence has actually made it less clear whether our vaccine regimens should consist of one, two or three doses. Currently, the Centers for Disease Control and Prevention says people are fully vaccinated “2 weeks after their second dose” of Pfizer or Moderna, or “2 weeks after a single-dose vaccine” such as Johnson & Johnson. This definition is already obsolete; as of last month, the agency also recommends third doses of the Pfizer shot for high-risk groups after six months. Soon the recommendation is expected to extend to everyone over 40.”\n\nBeing a MSM rag, of course, it continues by trying to justify the unjustifiable, blaming those around the vaccinated person. Blaming the unvaccinated has become a significant COVID trend in the last few months:\n\nWhat I’d like to focus on, however, is not the MSM’s constant blame of the unvaccinated, but rather its admission that you can never be fully vaccinated, which paves the way for an endless series of shots required to keep up your “immunity passport” or government-granted privileges. This enriches Big Pharma, provides more control to government (by giving them a way to shut out disobedient citizens from society if they fail to repeatedly comply) and provides the NWO controllers more access to people’s bloodstreams, and thus more opportunity to inject and nanotech and alien-like lifeforms into people’s bodies.\n\nThe CDC’s Definition Trickery: Changing the Meaning of Vaccination and Vaccine\n\nRochelle Walensky, director of the CDC (Centers for Disease Control and Prevention), was recently reported to have said that her agency “may need to update” its definition of fully vaccinated against COVID. However, it’s important to note that the CDC has already been engaging in definition trickery and manipulation throughout the scamdemic. One example is that it insists on defining those who have taken the COVID vaccine as “unvaccinated” if it is only 14 days since they took it. This way, if those people get injured or die from complications or adverse effects, they are counted in official statistics as unvaccinated injuries or unvaccinated deaths.\n\nAnother example is the CDC’s role in changing the definition of the word ‘vaccine’ itself. Sharyl Attkisson reports on this discovery which was publicized by Congressman Thomas Massie:\n\nThe discovery was publicized by Rep. Thomas Massie (R-Kentucky) who tweeted the definitions.\n\nCheck out @CDCgov’s evolving definition of “vaccination.” They’ve been busy at the Ministry of Truth:\n\nAnother commentator noted the following in an article entitled The CDC Just Made an Orwellian Change to the Definition of ‘Vaccine’ and ‘Vaccination’:\n\nAll this word-obfuscation and chicanery comes on top of the fact that the so-called COVID ‘vaccine’ is not a vaccine anyway, by standard and long-held legal and medical definitions, because it does not contain an attenuated or weakened virus.\n\nThe WHO Also Changed the Defintions of Herd Immunity and Pandemic\n\nThere is also further background to all this on the international level: the Gates-funded WHO (World Health Organization) has changed its definitions of ‘herd immunity’ and ‘pandemic.’ As this article explains, the WHO changed the definition of herd immunity to mention vaccination and to avoid any mention of naturally acquired immunity gained from prior infection. The WHO definition used to be:\n\nNow it is:\n\nSimilarly, the WHO changed the definition of pandemic. Their original definition of a pandemic from May 1st 2009 specified simultaneous epidemics worldwide:\n\nWhat Does All This Definition Manipulation Mean?\n\nThe manipulation of the definition of words is firstly an attempt to confuse people and obstruct critical thinking and analysis. Many people are told to just blindly “trust the science” when they can’t figure out the truth among all these contradictions. It is secondly an attempt to fit whatever the scenario is (e.g. COVID or Operation Coronavirus) into the current definitions of certain terms (pandemic), whatever the pre-planned solution or toxic remedy is (e.g. gene-modifying nanotech devices) into the current definitions of certain terms (vaccine), and whatever the goal is (endless vaccination) into the current definitions of certain terms (fully vaccinated).\n\nIn short, it’s straight out of Orwell’s 1984. Words, pharses and terms mean whatever the ruling party wants them to mean at that time, period. We were always at war with Eastasia! Stop trying to make sense of all this, you dirty little prole. Just put your head down, shut up, mask up and vax up – but make sure you keep shopping. And, let your wise and beneficent leaders do all your thinking for you.\n\nUltimately, the manipulation is designed to justify what the end goal already is: to inject as many people as possible as many times as possible to create a society where injection and ‘vaccination’ is standard, commonplace and the right of the government to inflict upon its citizens. To put it another way, to create a world where all inherent rights are eviscerated and only privileges exist, and that to earn those privileges, citizens must forgo bodily autonomy and medical sovereignty to allow the government to inject them whenever the government wants. This changes the power dynamic from a scenario where sovereign beings delegate others to represent them in a limited manner, to a scenario where citizens must beg for scraps (privileges) from an out-of-control centralized authority in a two-tiered society that some world leaders (like New Zealand Prime Minister Jacinda Ardern) openly admit they are trying to construct.\n\nA big part in turning the tide against the advancement of the NWO COVID op will be when a critical mass of people realize the horror of what being fully vaccinated really signifies – when enough people get that being fully vaccinated is an endless destination.\n\nMakia Freeman is the editor of alternative media / independent news site The Freedom Articles, author of the book Cancer: The Lies, the Truth and the Solutions and senior researcher at ToolsForFreedom.com. Makia is on Steemit and Odysee/LBRY.\n\nLike Waking Times on Facebook. Follow Waking Times on Telegram.", "opengraph": {"locale": "en_US", "type": "article", "title": "Being Fully Vaccinated is an Endless Road to a Questionable Destination", "description": "Makia Freeman - Being fully vaccinated is painted by the MSM (Mainstream Media) as a civic duty, a moral responsibility and ‘the right thing to do.’ What does it actually mean?", "url": "https://www.wakingtimes.com/being-fully-vaccinated-is-an-endless-destination/", "site_name": "Waking Times", "article:published_time": "2021-10-29T23:07:47+00:00", "article:modified_time": "2021-10-30T00:19:35+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/10/fully-vaccinated-1.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Check out <a href=\"https://twitter.com/CDCgov?ref_src=twsrc%5Etfw\">@CDCgov</a>’s evolving definition of “vaccination.” They’ve been busy at the Ministry of Truth: <a href=\"https://t.co/4k2xf8rvsL\">pic.twitter.com/4k2xf8rvsL</a></p><p>— Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1435606845926871041?ref_src=twsrc%5Etfw\">September 8, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/10/fully-vaccinated-1.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://thefreedomarticles.com/being-fully-vaccinated-is-endless-destination-definition-trickery/", "https://www.wakingtimes.com/being-fully-vaccinated-is-an-endless-destination/", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://twitter.com/CDCgov?ref_src=twsrc%5Etfw", "https://t.co/4k2xf8rvsL", "https://twitter.com/RepThomasMassie/status/1435606845926871041?ref_src=twsrc%5Etfw", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://www.independent.co.uk/news/world/americas/immunocompromised-fourth-covid-vaccine-cdc-b1945989.html", "https://www.usnews.com/news/health-news/articles/2021-10-03/israel-tightens-covid-green-pass-rules-sparking-protest", "https://www.washingtonpost.com/outlook/fully-vaccinated-coronavirus/2021/10/21/d0f9a2d4-321b-11ec-93e2-dba2c2c11851_story.html", "https://thefreedomarticles.com/official-narrative-fake-covid-vaccine-gives-you-fake-covid-immunity/", "https://thefreedomarticles.com/internet-of-bodies-pushed-by-wef-klaus-schwab/", "https://thefreedomarticles.com/10-things-to-know-experimental-covid-vaccines/", "https://thefreedomarticles.com/covid-trends-10-current-operation-coronavirus-october-2021/", "https://thefreedomarticles.com/covid-vax-creatures-live-self-aware-critters-found-microscope/", "https://www.axios.com/cdc-fully-covid-vaccinated-definition-update-5c2312d9-64f4-4bb7-a289-04c00889a573.html", "https://sharylattkisson.com/2021/09/read-cdc-changes-definition-of-vaccines-to-fit-covid-19-vaccine-limitations/", "https://twitter.com/RepThomasMassie/status/1435606845926871041?ref_src=twsrc%5Etfw", "https://pjmedia.com/news-and-politics/matt-margolis/2021/09/08/the-cdc-just-made-an-orwellian-change-to-the-definition-of-vaccine-and-vaccination-n1476799", "https://thefreedomarticles.com/not-a-vaccine-mrna-covid-vaccine-chemical-pathogen-device/", "https://peterlegyel.wordpress.com/2021/01/15/who-changes-definition-of-herd-immunity/", "https://www.telegraph.co.uk/world-news/2021/10/24/jacinda-ardern-admits-covid-plan-creating-two-tier-system-new/", "https://www.facebook.com/WakingTimes", "https://t.me/wakingtimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-10-29T23:07:47+00:00"}