{"result_id": "311035", "URL": "https://www.wakingtimes.com/physician-speaks-out-against-vaccine-mandates-for-all-especially-children-and-those-with-natural-immunity/", "timestamp": "2023-04-25 17:39:17 CEST+0200", "meta": {"description": "Megan Redshaw - “I never thought I’d say this, but please ignore the CDC guidance,” said Dr. Marty Makary, a professor at Johns Hopkins University School of Medicine and editor-in chief of MedPage Today.,", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/physician-speaks-out-against-vaccine-mandates-for-all-especially-children-and-those-with-natural-immunity/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Physician Speaks Out Against ‘Vaccine Mandates for All’ — Especially Children and Those With Natural Immunity", "cleaned_text": "Physician Speaks Out Against ‘Vaccine Mandates for All’ — Especially Children and Those With Natural Immunity\n\nDr. Marty Makary, a professor at Johns Hopkins University School of Medicine and editor-in chief of MedPage Today, is pushing back against the growing drumbeat for mass vaccinations and COVID vaccine mandates.\n\nIn an interview with U.S. New & World Reports, Makary said mandating vaccines for “every living, walking American” is not well-supported by science. Makary also expressed concerns about the two-dose vaccine regimen for adolescents.\n\nMakary’s interview this week took place as more public and private employers join the vaccine mandate chorus — the federal government is requiring the jab for federal employees, hundreds of colleges are requiring proof of vaccination for students, the U.S. Department of Defense is gearing up to require COVID vaccines for military members, New York is mandating the vaccine for indoor businesses and some of America’s largest employers are requiring employees get vaccinated or risk losing their jobs.\n\nMakary told U.S. News & World Report that as a physician, he believes “you win more bees with honey than with fire — referring to patients who don’t follow what “we ask them to do.”\n\nMakary believes people “who choose not to get vaccinated are making a poor health decision at their own individual risk.” But he doesn’t believe the unvaccinated pose a public health threat to those who are already immune to the virus.\n\nMakary said that vaccinating everyone — including eventually every newborn — in order to control the pandemic is based on the false assumption that the risk of dying from COVID is equally distributed among the population — but it’s not, he said.\n\n“We have always known that it’s very hard for the virus to hurt someone who is young and healthy,” Makary said. “And that’s still the case.”\n\nMakary suggested taking a similar approach to what is used with the flu shot, which is often mandated for healthcare workers. Makary said while vaccine requirements for healthcare workers make sense, we would never extend those requirements outside of healthcare.\n\n“We’d simply state to the public: Those who avoid the flu shot do so at their own risk,” Makary said.\n\nNo scientific support for requiring the vaccine for those with natural immunity\n\nMakary said there is no scientific support for requiring the vaccine in people who have natural immunity — that is, immunity from prior COVID infection. There is zero clinical outcome data to support arguing dogmatically that natural immune individuals “must get vaccinated.”\n\nA recent Israeli study affirmed the superiority of natural immunity. Health Ministry data on the wave of COVID outbreaks which began in May 2021, found a 6.72 times greater level of protection among those with natural immunity compared to those with vaccinated immunity.\n\nIn June, a Cleveland Clinic study found vaccinating people with natural immunity did not add to their level of protection.\n\nThe clinic studied 52,238 employees. Of those, 49,659 never had the virus and 2,579 had COVID and recovered. Of the 2,579 who previously were infected, 1,359 remained unvaccinated, compared with 22,777 who were vaccinated.\n\nNot one of the 1,359 previously infected subjects who remained unvaccinated had a SARS-CoV-2 infection over the duration of the study.\n\nAs The Defender reported, a December 2020 study by Singapore researchers found neutralizing antibodies (one prong of the immune response) remained present in high concentrations for 17 years or more in individuals who recovered from the original SARS-CoV.\n\nMore recently, the World Health Organization and National Institutes of Health (NIH) each published evidence of durable immune responses to natural infection with SARS-CoV-2.\n\nIn March 2020, the NIH’s Dr. Anthony Fauci shared his view (in an email [p. 22] to Ezekiel Emanuel) that “their [sic] would be substantial immunity post infection.”\n\nYet despite these recent findings, health authorities are largely ignoring the scientific evidence of natural immunity’s stellar track record. In fact, as the American Institute of Economic Research reported, it appears in order to promote the COVID vaccine agenda, key organizations are not only “downplaying” natural immunity but may be seeking to “erase” it altogether.\n\nMakary said instead of talking about the vaccinated and the unvaccinated, we should be talking about the immune and non-immune.\n\n“Immunity can be proven with a simple antibody test,” Makary said, and “vaccine passports and proof-of-vaccine documents should recognize it.”\n\nMakary said there’s very strong population immunity in most parts of the U.S. and these areas are resistant to the delta variant. Roughly a third to half of Americans who are unvaccinated have natural immunity, based on an analysis of California residents.\n\nAccording to a study conducted by the state of California in March, 38% of Californians and 45% of Los Angeles residents had natural immunity.\n\n“We’re potentially talking about a large portion of the U.S. population who may be immune to COVID and not know it,” Makary said. “They should be tested to find out, and we should concentrate our vaccination efforts on people who are not immune.”\n\nNo strong case for vaccinating kids, Makary says\n\nWhen it comes to vaccinating healthy kids, Makary says there is not a strong case for vaccinating young people up to age 25. “When it comes to vaccinating healthy kids — and you could argue young people up to 25 — there is a case for vaccination but it’s not strong. The COVID-19 death risk is clustered among kids with a comorbid condition, like obesity. “Of the more than 330 COVID-19 deaths in kids under age 25, there’s good preliminary data suggesting that most or nearly all appear to be in kids with a pre-existing condition. For kids with concurrent medical conditions, the case for vaccination is compelling. But for healthy kids?” Makary said he’s concerned the Centers for Disease Control and Prevention (CDC) hasn’t considered whether one- or two-dose shots would be sufficient or safer for young people. “The agency’s Advisory Committee on Immunization Practices has vigorously recommended the two-dose vaccine regimen for all children ages 12 and up, regardless of whether kids already have immunity. I take issue with that,” Makary said. Makary said the data CDC based its recommendation on — the Vaccine Adverse Events Reporting System (VAERS) — is incomplete at best because it isn’t fact-checked by authorities and may not be fully capturing the extent of vaccine complications from the second dose in young people. As The Defender reported, Simone Scott, 19, and Jacob Clynick, 13, died shortly after receiving their second COVID vaccine doses after developing heart inflammation. Simone Scott underwent a heart transplant one month after developing what her doctors believe was myocarditis following her second dose of Moderna. She received the second vaccine May 1 and died June 11. Makary said he wished the CDC would tell the public more about their deaths, and the 19 others youths under the age of 25 who, according to CDC data, have died after receiving a COVID vaccine. “Since the clinical trials were not powered sufficiently to detect rare events like these, I want to know more about those deaths before making blanket recommendations,” Makary said. “Researching these events is important when issuing broad guidance about vaccinating healthy kids, including students, who already have an infinitesimally small risk of dying from COVID-19.” Makary perplexed by vitriol directed at those reluctant to get vaccinated Makary believes that for some, the U.S. Food and Drug Administration is the biggest driver of hesitancy in those not willing to get vaccinated as the agency has failed to fully approve COVID vaccines due to stability testing. Makary didn’t refrain from attacking the CDC either. According to Makary, the CDC’s relentless focus on vaccine-induced immunity and its “demonizing” of individuals who choose not to get a COVID vaccine make the agency “the most slow, reactionary, political CDC in American history.” In June, Makary blasted the CDC and White House for continuing to push COVID vaccines when it’s not necessary. “I never thought I’d say this, but please ignore the CDC guidance,” he said. “The goal of our pandemic response should be to reduce death, illness and disability, but instead what you’re seeing is a movement that has morphed from being pro-vaccine to vaccine fanaticism at all costs.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Physician Speaks Out Against ‘Vaccine Mandates for All’ — Especially Children and Those With Natural Immunity", "description": "Megan Redshaw - “I never thought I’d say this, but please ignore the CDC guidance,” said Dr. Marty Makary, a professor at Johns Hopkins University School of Medicine and editor-in chief of MedPage Today.,", "url": "https://www.wakingtimes.com/physician-speaks-out-against-vaccine-mandates-for-all-especially-children-and-those-with-natural-immunity/", "site_name": "Waking Times", "article:published_time": "2021-08-06T20:24:15+00:00", "article:modified_time": "2021-08-06T20:25:34+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/08/dr-marty-Makary-covid-vaccines-feature.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Here’s the latest on <a href=\"https://twitter.com/hashtag/FauciEmails?src=hash&amp;ref_src=twsrc%5Etfw\">#FauciEmails</a>.</p><p>SUBSCRIBE to <a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a>: <a href=\"https://t.co/zL66Edfiw5\">https://t.co/zL66Edfiw5</a><a href=\"https://t.co/6H6jOz0fDJ\">https://t.co/6H6jOz0fDJ</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1402331217182310404?ref_src=twsrc%5Etfw\">June 8, 2021</a></p></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Simone Scott underwent a heart transplant one month after developing what her doctors believe was myocarditis following her second dose of Moderna. She received the second vaccine May 1 and died June 11.</p><p>SUBSCRIBE to <a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a>: <a href=\"https://t.co/zL66Edfiw5\">https://t.co/zL66Edfiw5</a><a href=\"https://t.co/Ne1lq7CLsi\">https://t.co/Ne1lq7CLsi</a></p><p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1404863318507073542?ref_src=twsrc%5Etfw\">June 15, 2021</a></p></blockquote>"], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/08/dr-marty-Makary-covid-vaccines-feature.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/dr-marty-makary-cdc-vaccine-mandates-children-natural-immunity/", "https://www.wakingtimes.com/physician-speaks-out-against-vaccine-mandates-for-all-especially-children-and-those-with-natural-immunity/", "https://www.hopkinsmedicine.org/profiles/details/martin-makary", "https://www.medpagetoday.com/", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://childrenshealthdefense.org/defender/biden-federal-workers-must-get-vaccine-regular-testing/", "https://childrenshealthdefense.org/defender/indiana-university-students-appeal-federal-judges-ruling-vaccine-mandate/", "https://www.militarytimes.com/news/pentagon-congress/2021/08/05/dod-could-announce-mandatory-covid-19-vaccine-policy-as-early-as-friday-reports/", "https://www.wsj.com/articles/nyc-to-require-vaccination-for-many-indoor-activities-such-as-restaurants-and-gyms-11628002951#:~:text=New%20York%20City%20will%20require,will%20be%20implemented%20Aug.%2016.", "https://www.nytimes.com/2021/08/03/business/vaccine-mandate-employees-microsoft.html", "https://www.cdc.gov/alcohol/fact-sheets/alcohol-use.htm", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/child-health-topics/take-action/tell-schools-universities-no-vaccine-mandates-for-children-young-adults/?utm_source=banner", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://childrenshealthdefense.org/defender/millions-unvaccinated-risk-losing-civil-liberties-covid-vaccine-policy/", "https://www.israelnationalnews.com/News/News.aspx/309762", "https://childrenshealthdefense.org/defender/cleveland-clinic-previous-covid-infection-vaccine-no-benefit/", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://childrenshealthdefense.org/defender/cdc-aggressive-push-vaccinate-natural-immunity/", "https://pubmed.ncbi.nlm.nih.gov/32380903/", "https://apps.who.int/iris/bitstream/handle/10665/341241/WHO-2019-nCoV-Sci-Brief-Natural-immunity-2021.1-eng.pdf?sequence=3&isAllowed=y", "https://www.nih.gov/news-events/nih-research-matters/lasting-immunity-found-after-recovery-covid-19#:~:text=The%20immune%20systems%20of%20more,lasting%20immune%20memories%20after%20vaccination.", "https://childrenshealthdefense.org/defender/fauci-kristian-andersen-emails-manipulation-deception/", "https://www.documentcloud.org/documents/20793561-leopold-nih-foia-anthony-fauci-emails", "https://twitter.com/hashtag/FauciEmails?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/zL66Edfiw5", "https://t.co/6H6jOz0fDJ", "https://twitter.com/RobertKennedyJr/status/1402331217182310404?ref_src=twsrc%5Etfw", "https://www.medpagetoday.com/infectiousdisease/covid19/92836", "https://www.aier.org/article/why-is-there-such-reluctance-to-discuss-natural-immunity/", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://childrenshealthdefense.org/defender/mary-holland-wayne-rohde-vaccine-passports-vs-basic-civil-liberties/", "https://childrenshealthdefense.org/defender/brian-hooker-covid-delta-variant-vaccine-less-effective/", "https://www.sfchronicle.com/health/article/More-than-a-third-of-Californians-recently-tested-16015721.php", "https://www.wsj.com/articles/herd-immunity-is-near-despite-faucis-denial-11616624554", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://childrenshealthdefense.org/defender/covid-vaccines-hypothetical-benefits-adults-risks-children/", "https://www.medpagetoday.com/opinion/marty-makary/93029", "https://www.wsj.com/articles/cdc-covid-19-coronavirus-vaccine-side-effects-hospitalization-kids-11626706868", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://childrenshealthdefense.org/defender/19-year-old-dies-heart-problem-moderna-vaccine/", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/zL66Edfiw5", "https://t.co/Ne1lq7CLsi", "https://twitter.com/RobertKennedyJr/status/1404863318507073542?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/vaers-cdc-vaccinated-spread-covid-serious-vaccines-injuries-surge/", "https://www.usnews.com/news/national-news/why-covid-19-vaccines-should-not-be-required-for-all-americans", "https://childrenshealthdefense.org/defender/rfk-jr-president-biden-vaers/", "https://childrenshealthdefense.org/defender/cdc-aggressive-push-vaccinate-natural-immunity/", "https://childrenshealthdefense.org/defender/cdc-aggressive-push-vaccinate-natural-immunity/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-08-06T20:24:15+00:00"}