{"result_id": "311003", "URL": "https://www.wakingtimes.com/schools-shouldnt-mandate-most-dangerous-vaccines-in-human-history/", "timestamp": "2023-04-25 17:38:57 CEST+0200", "meta": {"description": "Children’s Health Defense Team - Now is the time to push back against criminality and coercion in whatever ways we can.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/schools-shouldnt-mandate-most-dangerous-vaccines-in-human-history/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "Schools Shouldn’t Mandate ‘Most Dangerous Vaccines in Human History’", "cleaned_text": "In late October and early November, the self-serving members of two committees advising the U.S. Food and Drug Administration (FDA) and the Centers for Disease Control and Prevention (CDC) without a second thought endorsed experimental COVID vaccines for children as young as 5 years old.\n\nIgnoring the 99.995% COVID survival rate for those age 17 and under, the 31 pharma-servile “experts” also appeared unconcerned by reams of damning data about COVID-vaccine-related disabilities and fatalities already occurring in the 12–17 age group — unnecessary tragedies being acknowledged that very instant in a panel discussion convened by U.S. Sen. Ron Johnson (R-Wis.).\n\nPredictably, adverse event data and urgent frontline healthcare provider testimony began pouring in almost immediately after the FDA-CDC go-ahead, with 5- to 11-year-olds experiencing the same kinds of “terrifying” vaccine reactions as adolescents — including blood clots, strokes and other brain and heart problems previously almost unheard-of in young people.\n\nIn the lead-up to the FDA’s Emergency Use Authorization of experimental COVID jabs for younger children, state politicians and municipal school districts also started to grease the skids to mandate COVID injections for in-person school attendance.\n\nTo date, the number of states and school systems announcing or adopting coercive plans, either for K-12 students or students ages 12 or 16 and up, is still small. However, the symbolic weight of the “early adopters” is significant.\n\nThese include states like California and Louisiana (and soon New York); major cities like Washington, D.C. (and probably New York City); and large school districts such as those in Oakland, California, and Los Angeles.\n\nIn addition, the New York City and Washington, D.C. school districts, and some or all districts in California, Hawaii and Maryland, require students involved in sports and other extracurricular activities to get jabbed.\n\nIn what sounds like good news, the National Academy for State Health Policy (NASHP) confirmed 17 states — Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Montana, New Hampshire, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Texas and Utah — have enacted laws or issued executive orders that ban COVID-19 vaccine mandates for students.\n\nHowever, most of the bans are limited to certain circumstances, with some applying only to higher education and some only to vaccines authorized under emergency use — meaning the ban would not apply to COVID vaccines that in the future gain full FDA approval for children.\n\nFor decades, vaccines have been wreaking havoc on children’s health. For instance, consider the following:\n• The 400 adverse events listed in the package inserts of licensed childhood vaccines\n• The epidemic of chronic health problems in American children — including 1 in 16 boys with autism in California, the state with the highest autism rate in the nation\n• The precipitous decline in sudden infant deaths that coincided with the disruption of “routine” vaccination during the 2020 lockdowns.\n• The superior health of far less heavily vaccinated Japanese children.\n\nSo, when observers familiar with COVID injection data pronounce them “the most dangerous vaccines in human history,” that is saying something.\n\nDr. Joseph Mercola warned the COVID jabs are setting up children for “potentially lifelong health problems,” including serious heart problems resulting from myocarditis. As he wrote in early January:\n\n“[T]he recent push to inject children with a genetic experiment may be one of the worst public health offenses perpetrated on a population of people who are unable to speak for themselves, do not have a legal voice and depend on adults to protect them.”\n\nNot content with those assaults on health freedom, Gov. Gavin Newsom announced in early October — apparently reading the minds, weeks in advance, of the FDA and CDC committee members who subsequently rubber-stamped the COVID shots for 5- to 11-year-olds — that his state would impose a K-12 mandate in both public and private schools, making California the first state to mandate COVID-19 vaccines for in-person school attendance.\n\nThe mandate hinges on the vaccines “receiving full licensure from the FDA for children,” which the state expects in July 2022.\n\nSeeking to normalize his COVID mandate, Newsom compared it to the existing school requirements for measles, mumps and rubella (MMR) vaccination.\n\nHowever, in light of the strong, statistically significant relationship between MMR vaccines and autism — and given California’s status as the state with the highest autism prevalence — Newsom’s comparison is scarcely reassuring.\n\nIn mid-December, Louisiana Gov. John Bel Edwards added COVID vaccines to the list of required school shots, overturning a bipartisan vote against such a mandate by the state’s House Health and Welfare Committee.\n\nThe push for the mandate originated with the Louisiana Department of Health. The House Health Committee then voted 13-2 to reject the department’s recommendation, stating that COVID vaccination “should be the parents’ decision,” a common-sense view shared by legislators and parents around the nation.\n\nHowever, the governor vetoed the committee vote — and the wishes of citizens who packed the committee meeting to protest mandates — dismissively characterizing their objections as “overheated rhetoric.”\n\nLouisiana’s governor and health officials also ignored remarks delivered at the health committee hearing by experienced Louisiana nurse Collette Martin, R.N. Martin provided testimony about serious adverse reactions in children and their widespread underreporting. She told the committee:\n\n“We are not just seeing severe acute reactions with this vaccine, but we have zero idea what any long-term reactions are. Cancers, autoimmune [disorders], infertility. We just don’t know.”\n\nLouisiana’s mandate, which goes into effect in fall 2022, currently applies only to students ages 16 and up, “but could expand as the vaccines get the highest level of approval” from the FDA.\n\nIn early January, White House Press Secretary Jen Psaki asserted that decisions on school vaccine mandates “are up to local school districts.”\n\nHowever, the U.S. Department of Education has been working with school districts, Psaki said, “to provide resources, connect school officials with testing providers, and set up vaccine clinics….”\n\nLast September, Maryland’s health secretary disingenuously made similar comments, telling the press that the state prefers “not to be intentionally overbearing” or “interventionist” and instead encourages school systems “to take the lead in their individual jurisdictions.”\n\nIn California, school board members in several large school districts showed, as early as September, they were willing to “take the lead” in imposing mandates for in-person instruction.\n\nThe plans of school boards in Los Angeles (the nation’s second-largest school district), Oakland and San Diego have been undermined, however, by the large number of unvaccinated students and other apparently unforeseen pitfalls.\n\nThe Los Angeles school district, for example, pushed back its initial Jan. 10 deadline to the fall of 2022, because tens of thousands of uninjected students would have “overwhelmed the district’s independent study program.”\n\nL.A. students ages 12 and up are supposed to upload proof of vaccination into a “Daily Pass” system. The L.A. district already requires students to undergo weekly testing (regardless of vaccination status) and subjects them to other measures such as “daily health checks,” masking and contact tracing and isolation of cases.\n\nThree out of ten students failed to show up on the first day of school following winter break, “having tested positive for the coronavirus.”\n\nOakland’s school district will not enforce its mandate until Jan. 31, a month later than originally planned. When the school board voted (5-1-1) in favor of mandating COVID shots for in-person instruction for students 12 and up, it apparently did not bargain on nearly two-fifths of students in that age group (38%) remaining unvaccinated.\n\nCasting the lone “no” vote, Oakland school board member Mike Hutchinson stated, “I don’t think we should be rolling out at midnight on a not very publicized meeting, talking about mandatory vaccinations when there’s nothing wrong with taking our due time to deliberate to make sure that we get it right.”\n\nIn December, however, Hutchinson indicated he would be comfortable deferring to the state-level mandate.\n\nIn late December in San Diego, a judge struck down the school district’s COVID vaccine mandate for students 16 and older, arguing the state legislature has not given individual school districts the authority to mandate vaccines for school attendance.\n\nAn Oakland pediatrician who egged on her city’s school board to vote in favor of COVID mandates argued last fall, “This is not the time for timidity.”\n\nHowever, as evidence accumulates about the injections’ outsized risks for children, it seems increasingly clear that a number of so-called public servants do not have a problem with timidity, having shown themselves perfectly willing to harm — and kill — children.\n\nFor former Pfizer executive Dr. Mike Yeadon, who has argued for months that the COVID injections “are toxic by design” and “were always going to harm people,” it seems obvious “criminal acts are being committed.”\n\nNow is the time to push back against criminality and coercion — including COVID vaccine mandates and “vaccine passports” — in whatever ways we can. Our children’s lives, and our own lives, depend on it.\n\nLike Waking Times on Facebook. Follow Waking Times on Twitter.", "opengraph": {"locale": "en_US", "type": "article", "title": "Schools Shouldn’t Mandate ‘Most Dangerous Vaccines in Human History’", "description": "Children’s Health Defense Team - As schools weigh COVID vaccine mandates for children as young as 5 years old, former Pfizer exec warns injections “are toxic by design” and it seems obvious “criminal acts are being committed.”", "url": "https://www.wakingtimes.com/schools-shouldnt-mandate-most-dangerous-vaccines-in-human-history/", "site_name": "Waking Times", "article:published_time": "2022-01-19T01:00:11+00:00", "article:modified_time": "2022-01-19T01:13:42+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/08/Moderna-Covid-19-vaccine.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/08/Moderna-Covid-19-vaccine.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/schools-should-not-mandate-covid-vaccines/", "https://www.wakingtimes.com/schools-shouldnt-mandate-most-dangerous-vaccines-in-human-history/", "https://childrenshealthdefense.org/defender/fda-pfizer-covid-kids-pharma/", "https://childrenshealthdefense.org/defender/cdc-acip-pfizer-pediatric-covid-vaccine-big-pharma/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.researchsquare.com/article/rs-689684/v1", "https://childrenshealthdefense.org/defender/rfk-jr-the-defender-podcast-cherie-romney-17-year-old-pfizer-vaccine-blood-clots/", "https://childrenshealthdefense.org/defender/cdc-not-investigating-myocarditis-death-jacob-clynick-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/nov-2-sen-ron-johnson-cdh-covid-vaccine-injuries-federal-mandates/", "https://childrenshealthdefense.org/defender/vaers-cdc-child-dies-pfizer-covid-vaccine/", "https://childrenshealthdefense.org/defender/kids-dying-vaccines-colette-martin-nurse-louisiana/", "https://www.fda.gov/drugs/types-applications/investigational-new-drug-ind-application#Introduction", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.foxnews.com/politics/gov-newsom-announces-california-first-state-require-covid-vaccinations-k-12-students", "https://www.theadvertiser.com/story/news/2021/12/14/louisiana-governor-adds-covid-vaccine-required-school-shots/8898262002/", "https://nypost.com/2021/12/17/gov-hochul-wants-school-vaccine-mandate-before-fall-2022-semester/", "https://www.nationalreview.com/news/washington-d-c-becomes-first-major-city-to-impose-vaccine-mandate-on-students/", "https://www.silive.com/education/2022/01/nyc-considering-vaccine-mandate-for-students-for-2022-2023-school-year-report-says.html", "https://oaklandside.org/2021/09/23/oakland-unified-school-board-approves-student-vaccine-mandate/", "https://www.nbcnews.com/news/us-news/los-angeles-public-schools-set-approve-vaccine-mandate-students-12-n1278815", "https://bangordailynews.com/2022/01/09/news/nation/most-states-are-wary-of-mandating-covid-shots-for-kids/", "https://www.nashp.org/states-enact-policies-to-support-students-transition-back-to-school/", "https://districtadministration.com/illegal-8-states-schools-force-covid-vaccinations-vaccine/", "https://childrenshealthdefense.org/ebook-sign-up/ebook-sign-up-the-sickest-generation/", "https://childrenshealthdefense.org/news/read-the-fine-print-part-two-nearly-400-adverse-reactions-listed-in-vaccine-package-inserts/", "https://childrenshealthdefense.org/news/chronically-ill-children-who-is-sounding-the-alarm/", "https://childrenshealthdefense.org/defender/autism-cdc-media-vaccine-related-harm/", "https://childrenshealthdefense.org/defender/covid-lockdown-vaccine-rates-dropped-so-did-sids-deaths/", "https://childrenshealthdefense.org/news/vaccines/japan-leads-the-way-no-vaccine-mandates-and-no-mmr-vaccine-healthier-children/", "https://stevekirsch.substack.com/p/according-to-dr-paul-offit-we-should", "https://childrenshealthdefense.org/defender/children-risk-lifelong-health-problems-covid-vaccine/", "https://childrenshealthdefense.org/defender/cdc-heart-inflammation-children-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/pfizer-third-dose-covid-vaccine-toddlers/", "https://www.nvic.org/nvic-vaccine-news/august-2015/sb277-fallout-what-happens-next.aspx", "https://childrenshealthdefense.org/news/health-committee-votes-yes-to-sb276-pans-labyrinth/", "https://www.verywellhealth.com/california-child-school-vaccine-mandate-5204487", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://childrenshealthdefense.org/news/cdc-data-reanalysis-shows-strong-statistically-significant-relationship-between-mmr-vaccine-autism/", "https://www.theadvertiser.com/story/news/2021/12/14/louisiana-governor-adds-covid-vaccine-required-school-shots/8898262002/", "https://childrenshealthdefense.org/defender/meryl-nass-parents-decide-covid-vaccines-kids/", "https://childrenshealthdefense.org/defender/kids-dying-vaccines-colette-martin-nurse-louisiana/", "https://www.foxnews.com/politics/white-house-says-school-vaccine-mandate-decision-is-up-to-local-districts", "https://bangordailynews.com/2022/01/09/news/nation/most-states-are-wary-of-mandating-covid-shots-for-kids/", "https://www.newsweek.com/massive-los-angeles-school-district-pushes-back-deadline-student-vaccination-mandate-1659951", "https://childrenshealthdefense.org/defender/la-schools-track-kids-microsofts-daily-pass-covid-app/", "https://www.nbcnews.com/news/us-news/los-angeles-public-schools-set-approve-vaccine-mandate-students-12-n1278815", "https://achieve.lausd.net/site/default.aspx?DomainID=4&FlexDataID=110710&ModuleInstanceID=4466&PageID=1&PageType=3&RenderLoc=0&ViewID=6446EE88-D30C-497E-9316-3F8874B3E108", "https://www.mercurynews.com/2022/01/12/students-stream-back-onto-lausd-campuses-officials-stand-by-covid-safeguards/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://oaklandside.org/2021/09/23/oakland-unified-school-board-approves-student-vaccine-mandate/", "https://www.kron4.com/news/bay-area/oakland-school-district-extends-covid-19-vaccine-requirement/", "https://www.sandiegouniontribune.com/news/education/story/2021-12-20/sd-me-san-diego-unified-mandate-ruling", "https://oaklandside.org/2021/09/23/oakland-unified-school-board-approves-student-vaccine-mandate/", "https://dailyexpose.uk/2022/01/10/mike-yeadon-covid-injections-are-toxic/", "https://childrenshealthdefense.org/defender/digital-vaccine-passports-surveillance-capitalism-covid-gates/", "http://www.facebook.com/WakingTimes", "http://twitter.com/WakingTimes", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WTStaff"], "publish_date": "2022-01-19T01:00:11+00:00"}