{"result_id": "311041", "URL": "https://www.wakingtimes.com/13000-deaths-nearly-600000-adverse-events-reported-after-covid-vaccines-as-debate-heats-up-over-boosters/", "timestamp": "2023-04-25 17:39:21 CEST+0200", "meta": {"description": "VAERS data released Friday by the CDC showed a total of 595,622 reports of adverse events from all age groups following COVID vaccines, including 13,068 deaths and 81,050 serious injuries between Dec. 14, 2020 and Aug. 13, 2021.", "lang": "en", "keywords": "", "favicon": "https://www.wakingtimes.com/wp-content/uploads/2020/04/cropped-waking-times-round-logo-32x32.png", "canonical": "https://www.wakingtimes.com/13000-deaths-nearly-600000-adverse-events-reported-after-covid-vaccines-as-debate-heats-up-over-boosters/", "encoding": "UTF-8"}, "image": null, "domain": "www.wakingtimes.com", "title": "13,000 Deaths, Nearly 600,000 Adverse Events Reported After COVID Vaccines, as Debate Heats Up Over Boosters", "cleaned_text": "13,000 Deaths, Nearly 600,000 Adverse Events Reported After COVID Vaccines, as Debate Heats Up Over Boosters\n\nData released today by the Centers for Disease Control and Prevention (CDC) showed that between Dec. 14, 2020 and Aug. 13, 2021, a total of 595,622 total adverse events were reported to VAERS, including 13,068 deaths — an increase of 702 over the previous week.\n\nThere were 81,050 reports of serious injuries, including deaths, during the same time period — up 10,945 compared with the previous week.\n\nExcluding “foreign reports” filed in VAERS, 464,769 adverse events, including 6,018 deaths and 37,806 serious injuries, were reported in the U.S. Of the 6,018 U.S. deaths reported as of Aug. 13, 13% occurred within 24 hours of vaccination, 19% occurred within 48 hours of vaccination and 33% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nIn the U.S., 354.5 million COVID vaccine doses had been administered as of Aug. 13. This includes: 141 million doses of Moderna’s vaccine, 199 million doses of Pfizer and 14 million doses of the Johnson & Johnson (J&J) COVID vaccine.\n\nThe data come directly from reports submitted to the Vaccine Adverse Event Reporting System (VAERS), the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nThis week’s U.S. data for 12- to 17-year-olds show:\n• 17,025 total adverse events, including 1,018 rated as serious and 18 reported deaths. Two of the eighteen deaths were suicides.\n\nThe most recent reported deaths include a 15-year-old boy (VAERS I.D. 1498080) who previously had COVID, was diagnosed with cardiomyopathy in May 2021 and died four days after receiving his second dose of Pfizer’s vaccine on June 18, when he collapsed on the soccer field and went into ventricular tachycardia; and a 13-year-old girl (VAERS I.D. 1505250) who died after suffering a heart condition after receiving her first dose of Pfizer.\n• Other deaths include two 13-year-old boys (VAERS I.D. 1406840 and 1431289) who died two days after receiving a Pfizer vaccine, a 13-year-old boy who died after receiving Moderna (VAERS I.D. 1463061), three 15-year-olds (VAERS I.D. 1187918, 1382906 and 1242573), five 16-year-olds (VAERS I.D. 1420630, 1466009, 1225942, 1475434, and 1386841) and three 17-year-olds (VAERS I.D. 1199455, 1388042 and 1420762).\n• 2,525 reports of anaphylaxis among 12- to 17-year-olds with 99% of cases\n\n attributed to Pfizer’s vaccine.\n• 432 reports of myocarditis and pericarditis (heart inflammation) with 426 cases attributed to Pfizer’s vaccine.\n• 86 reports of blood clotting disorders, with all cases attributed to Pfizer.\n\nThis week’s total U.S. VAERS data, from Dec. 14, 2020 to Aug. 13, 2021, for all age groups combined, show:\n• 21% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 43% were female and the remaining death reports did not include gender of the deceased.\n• The average age of death was 73.1.\n• As of Aug 13., 2,947 pregnant women reported adverse events related to COVID vaccines, including 960 reports of miscarriage or premature birth.\n• Of the 2,607 cases of Bell’s Palsy reported, 50% were attributed to Pfizer vaccinations, 43% to Moderna and 7% to J&J.\n• 522 reports of Guillain-Barré Syndrome, with 40% of cases attributed to Pfizer, 34% to Moderna and 25% to J&J.\n• 126,905 reports of anaphylaxis with 44% of cases attributed to Pfizer’s vaccine, 47% to Moderna and 8% to J&J.\n• 8,396 reports of blood clotting disorders. Of those, 3,586 reports were attributed to Pfizer, 3,510 reports to Moderna and 1,695 reports to J&J.\n• 3,033 cases of myocarditis and pericarditis with 1,335 cases attributed to Pfizer, 703 cases to Moderna and 78 cases to J&J’s COVID vaccine.\n\nBooster shots coming for most Americans 8 months after second dose\n\nThe Biden administration decided most Americans should get a COVID vaccine booster dose eight months after they received their second shot, despite consensus among U.S. health experts last month there wasn’t enough data to recommend boosters for the general population.\n\n“Based on our latest assessment, the current protection against severe disease, hospitalization and death could diminish in the months ahead,” the officials, led by Dr. Rochelle Walensky, director of the CDC, and Dr. Janet Woodcock, acting commissioner for the U.S. Food and Drug Administration, said Wednesday.\n\nThe plan is still subject to approval from the FDA and the CDC’s vaccine advisory committee, but officials say they are prepared to begin the rollout of booster shots starting the week of Sept. 20.\n\nHowever, the CDC has pushed back by one week a meeting by a group of outside advisers who were set to review COVID booster shots as debate heats up over the need for a third dose, according to Bloomberg.\n\nThe CDC’s Advisory Committee for Immunization Practices, was scheduled to meet and possibly make a recommendation about the need for boosters on Aug. 24, but is now set to convene over two days starting Aug. 30.\n\nThe first boosters are likely to go to nursing home residents, healthcare workers and emergency workers, followed by older people who were near the front of the line when vaccinations began late last year and then the general population.\n\nFederal health officials are waiting for more data before offering guidance for J&J vaccine recipients. However, officials expect a booster will also be needed.\n\nThree studies released Wednesday by the CDC confirm COVID vaccine effectiveness against infection has decreased over time, and is less effective in combating the Delta variant.\n\nOne study assessed Pfizer and Moderna’s effectiveness over time against infections among nursing home residents, and found it dropped from 75% pre-Delta to 53% when Delta became dominant. The study didn’t differentiate between asymptomatic, symptomatic and severe infections.\n\nAnother study used data from 21 hospitals to estimate the effectiveness of Pfizer and Moderna mRNA vaccines against hospitalization over time. Among 1,129 patients who received two doses of a mRNA vaccine, vaccine effectiveness was 86% 2 to12 weeks after vaccination and 84% at 13 to 24 weeks.\n\nThe third study, using New York state data, found all three vaccines’ effectiveness against infection dropped from 92% in early May to 80% at the end of July, but the effectiveness against hospitalization remained relatively stable.\n\nData from the three reports in the CDC’s Morbidity and Mortality Weekly Report, helped convince the Biden administration to recommend booster shots to people eight months after receiving their second dose, despite no completed late-stage clinical trials assessing the safety, efficacy and immunogenicity of a third dose.\n\nOxford study shows vaccinated just as contagious as unvaxxed\n\n​​As The Defender reported Thursday, a British public health study released Aug. 16, indicates vaccinated people with “breakthrough” infections could pose a significant infection risk to those who have not been vaccinated.\n\nA study by University of Oxford scientists found people who contract the Delta variant after being fully vaccinated carry a similar amount of the virus as those who catch the disease and have not been vaccinated.\n\nThe study also found protection was greatest in those vaccinated who already had natural immunity through previous infection.\n\nBased on more than 3 million nose and throat swabs, Oxford University researchers found that 90 days after a second shot of the Pfizer or Astrazeneca vaccine, efficacy in preventing infections had slipped to 75% and 61% respectively.\n\nThose results were down from 85% and 68%, respectively, seen two weeks after a second dose, with the decline in efficacy more pronounced among those 35 years and older.\n\nThe study also showed that after two doses of the Pfizer vaccine, effectiveness was at least as great as protection afforded by natural infection — with greater initial effectiveness against new PCR-positives but faster declines in protection against high viral burden and symptomatic infection.\n\nResearchers said there was no evidence effectiveness varied by dosing interval, but protection was higher among those vaccinated who already had natural immunity.\n\nThe survey, which has yet to be peer-reviewed before publication in a scientific journal, underscores concerns by scientists that the Delta variant can infect fully vaccinated people at a greater rate than previous variants, and that the vaccinated could more easily transmit it.\n\nChildren’s Health Defense (CHD) along with 18 students on Monday filed a lawsuit in federal court against Rutgers University, its board of governors, Rutgers President Jonathan Holloway and others over the university’s decision to mandate COVID vaccines for students attending school in the fall.\n\nThe lawsuit states that in a free society, “all people have the right to decide their own medical treatment — especially to decide what to inject into their bodies. And every person has the right to make that decision voluntarily, free from coercion by anyone, and to be fully informed of the benefits and especially the risks of that decision.”\n\nThe lawsuit alleges Rutgers’ policy is a violation of the right to informed consent and the right to refuse unwanted medical treatments.\n\nThe complaint also alleges the policy is a breach of contract because in January 2021, the university assured students COVID vaccines would not be required in order to attend school. Just two months later, Rutgers flip-flopped and issued new requirements for taking the shot prior to attending classes.\n\nAccording to the plaintiffs, Rutgers is working with all three manufacturers — Pfizer, Moderna and J&J — to study and develop their vaccines in on-going clinical trials, and will benefit financially if more people are required to take the shots which, until fully licensed by the FDA, are defined by the FDA as experimental.\n\nThe Rutgers requirement also constitutes a denial of equal protection, as administration, faculty and staff are not required to take the vaccine. It also conflicts with federal and state law, as neither has enacted legislation requiring COVID vaccines for citizens.\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nOn March 8, The Defender contacted the CDC with a written list of questions about reported deaths and injuries related to COVID vaccines. We have made repeated attempts, by phone and email, to obtain a response to our questions.\n\nDespite multiple phone and email communications with many people at the CDC, and despite being told that our request was in the system and that someone would respond, we have not yet received answers to any of the questions we submitted. It has been 165 days since we sent our first email to the CDC requesting information.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "13,000 Deaths, Nearly 600,000 Adverse Events Reported After COVID Vaccines, as Debate Heats Up Over Boosters", "description": "VAERS data released Friday by the CDC showed a total of 595,622 reports of adverse events from all age groups following COVID vaccines, including 13,068 deaths and 81,050 serious injuries between Dec. 14, 2020 and Aug. 13, 2021.", "url": "https://www.wakingtimes.com/13000-deaths-nearly-600000-adverse-events-reported-after-covid-vaccines-as-debate-heats-up-over-boosters/", "site_name": "Waking Times", "article:published_time": "2021-08-24T12:33:19+00:00", "article:modified_time": "2021-08-24T12:56:43+00:00", "image": "https://www.wakingtimes.com/wp-content/uploads/2021/08/Covid-Vaccine-and-cell.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/wp-content/uploads/2021/08/Covid-Vaccine-and-cell.jpg", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/", "https://childrenshealthdefense.org/defender/vaers-cdc-deaths-adverse-events-covid-vaccines-booster-shots-september/", "https://www.wakingtimes.com/13000-deaths-nearly-600000-adverse-events-reported-after-covid-vaccines-as-debate-heats-up-over-boosters/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://childrenshealthdefense.org/defender/emily-jo-14-year-old-son-aiden-myocarditis-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/fda-warning-jj-vaccine-serious-rare-autoimmune-disorder/", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1498080", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1505250", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1406840", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1431289", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1463061", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1382906", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1242573", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420630", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1466009", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1475434", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1386841", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1199455", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1388042", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1420762", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://childrenshealthdefense.org/defender/covid-booster-shots-8-months-after-second-dose/", "https://childrenshealthdefense.org/defender/cdc-experts-disagree-pfizer-covid-boosters/", "https://www.forbes.com/sites/jonathanponciano/2021/08/18/biden-administration-plans-to-begin-providing-covid-19-vaccine-booster-shots-sept-20/", "https://childrenshealthdefense.org/defender/covid-booster-shots-8-months-after-second-dose/", "https://www.bloomberg.com/news/articles/2021-08-19/booster-review-postponed-by-cdc-as-debate-swirls-over-third-shot", "https://www.cdc.gov/vaccines/acip/meetings/index.html", "https://shiftnetwork.infusionsoft.com/go/pas23/a17920", "https://www.axios.com/coronavirus-vaccine-data-cdc-biden-d6f295f2-5205-4c44-bdf3-f7eab66b4873.html", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/brian-hooker-covid-delta-variant-vaccine-less-effective/", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7034e3.htm?s_cid=mm7034e3_w", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7034e2.htm?s_cid=mm7034e2_w", "https://childrenshealthdefense.org/defender/cdc-397-reports-heart-inflammation-teens-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/the-peoples-testaments-polly-tommey-sally-kirkland-moderna-vaccine-constant-pain/", "https://childrenshealthdefense.org/news/components-of-mrna-technology-could-lead-to-significant-adverse-events-in-one-or-more-of-our-clinical-trials-says-moderna/", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7034e1.htm?s_cid=mm7034e1_w#T1_down", "https://www.cdc.gov/mmwr/index.html", "https://childrenshealthdefense.org/defender/covid-booster-shots-8-months-after-second-dose/", "https://childrenshealthdefense.org/defender/cdc-vaccine-protection-less-effective-against-delta-variant/", "https://www.ndm.ox.ac.uk/files/coronavirus/covid-19-infection-survey/finalfinalcombinedve20210816.pdf", "https://childrenshealthdefense.org/defender/foo-fighters-vaccinated-only-concert-canceled-covid-breakthrough-cases/", "https://www.ndm.ox.ac.uk/files/coronavirus/covid-19-infection-survey/finalfinalcombinedve20210816.pdf", "https://childrenshealthdefense.org/defender/dr-marty-makary-cdc-vaccine-mandates-children-natural-immunity/", "https://www.reuters.com/business/healthcare-pharmaceuticals/british-study-shows-covid-19-vaccine-efficacy-wanes-under-delta-2021-08-18/", "https://childrenshealthdefense.org/defender/cdc-vaccine-protection-less-effective-against-delta-variant/", "https://shiftnetwork.infusionsoft.com/go/vnhp/a17920", "https://childrenshealthdefense.org/defender/chd-sues-rutgers-university-covid-vaccine-mandate/", "https://childrenshealthdefense.org/wp-content/uploads/Rutgers-Complaint.pdf", "https://childrenshealthdefense.org/defender/rfk-jr-rutgers-covid-vaccine-mandates-violate-federal-law/", "https://childrenshealthdefense.org/defender/covid-vaccines-administrators-must-inform-risks/", "https://academichealth.rutgers.edu/messages/2021-05-03-covid-19-vaccination-requirement-information", "https://www.fda.gov/drugs/types-applications/investigational-new-drug-ind-application#Introduction", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/64-days-why-wont-cdc-answer-questions/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://www.wendymyersdetox.com/29KK7GX/BP658/", "https://twitter.com/share?ref_src=twsrc%5Etfw", "https://www.pinterest.com/pin/create/button/"], "authors": ["WakingTimes"], "publish_date": "2021-08-24T12:33:19+00:00"}