{"result_id": "312005", "URL": "https://www.thinkinghumanity.com/2020/08/putin-to-begin-covid-19-mass-immunasation-programme-with-sputnik-v-vaccine-skipping-stage-3-trials.html", "timestamp": "2023-04-25 17:39:29 CEST+0200", "meta": {"description": "Russian President, Vladimir Putin, has announced that Russia has a vaccine for CoVid-19 and will begin a mass immunisation program in the country starting from October. The news has stunned other world leaders and the scientific community, with the World Health Organisation warning that it is in no way clear that the Russian vaccine is safe for use. President Putin also revealed that one of his daughters had already received the vaccine and, despite a brief fever, has been very well.", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2020/08/putin-to-begin-covid-19-mass-immunasation-programme-with-sputnik-v-vaccine-skipping-stage-3-trials.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Putin To Begin CoVid-19 Mass Immunisation Programme With 'Sputnik V' Vaccine Skipping Stage 3 Trials", "cleaned_text": "Russian President, Vladimir Putin, has announced that Russia has a vaccine for CoVid-19 and will begin a mass immunisation program in the country starting from October. The news has stunned other world leaders and the scientific community, with the World Health Organisation warning that it is in no way clear that the Russian vaccine is safe for use.\n\nPresident Putin also revealed that one of his daughters had already received the vaccine and, despite a brief fever, has been very well. The vaccine has been branded 'Sputnik V' after the Soviet artificial satellite that was the first in world history to send living beings to space and have them return safely to Earth.\n\n \n\n\n\nSince the outbreak took hold in early 2020, hundreds of scientific teams across the world have been engaged in attempting to create a vaccine, and many epidemiologists believe that the wide adoption of such a vaccine is the only way normal life will ever return.\n\nUp to this point, it was believed that the Oxford vaccine and a vaccine being developed by Moderna in the United States were leading the way. In both cases, early results have shown positive results and they are now in stage three trails, which includes tens of thousands of volunteers. China has also authorised a vaccine but only for use in its military, and there is no indication they have plans as of yet for mass use either in the military or civilian population.\n\nThe Russian state is however skipping stage 3 trials and going to immediate distribution. The country has itself been hit hard by CoVid-19, with almost 900,000 confirmed cases and over 15,000 deaths, though the mortality rate is substantially lower than many other countries such as the United States and the United Kingdom. Globally over 700,000 have died from Covid-19 since the start of the outbreak.\n\nPutin said in his statement:\n\n \"As far as I know, a vaccine against the coronavirus infection has been registered this morning (in Russia) for the first time in the world. I thank everyone who worked on the vaccine – it's a very important moment for the whole world.\"\n\nHealth Minister, Mikhail Murashko, added that the vaccine will not be mandatory and that it will first be distributed to those in critical roles. He said:\n\n\"We will begin the stage-by-stage civilian use of the vaccine. First and foremost, we would like to offer vaccination to those who come into contact with infected persons at work. These are medical workers. And also those who are responsible for children's health – teachers.\"\n\nExecutive Director of the Association of Clinical Trials Organizations, Svetlana Zavidova, expressed fears that the vaccine was not yet proven safe or workable and has written to the Russian Health Minister. She told Business Today:\n\n\"Why are all corporations following the rules, but Russian ones aren't? The rules for conducting clinical trials are written in blood. They can't be violated. This is a Pandora's Box and we don't know what will happen to people injected with an unproven vaccine.\"\n\nThe world will certainly look on with great interest as to the outcomes of the vaccination program, particularly as they await conformation on the results of their own vaccine trials.", "opengraph": {"url": "https://www.thinkinghumanity.com/2020/08/putin-to-begin-covid-19-mass-immunasation-programme-with-sputnik-v-vaccine-skipping-stage-3-trials.html", "title": "Putin To Begin CoVid-19 Mass Immunisation Programme With 'Sputnik V' Vaccine Skipping Stage 3 Trials", "description": "Russian President, Vladimir Putin, has announced that Russia has a vaccine for CoVid-19 and will begin a mass immunisation program in the country starting from October. The news has stunned other world leaders and the scientific community, with the World Health Organisation warning that it is in no way clear that the Russian vaccine is safe for use. President Putin also revealed that one of his daughters had already received the vaccine and, despite a brief fever, has been very well.", "image": "https://4.bp.blogspot.com/-T0STIAksLL4/XzPgtOKNBHI/AAAAAAAABTI/zlXtXmQJZAgZ1fempIGhzXTZdazR-HhEwCNcBGAsYHQ/s1600/Putin%2BTo%2BBegin%2BCoVid-19%2BMass%2BImmunisation%2BProgramme%2BWith%2B%2527Sputnik%2BV%2527%2BVaccine%2BSkipping%2B3%2BStage%2BTrial.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["CoVid-19", "News", "Cures", "Science"], "tweets": [], "movies": [], "links": ["https://www.thinkinghumanity.com/2020/07/oxford-coronavirus-vaccine-shown-to-trigger-immune-response-in-world-first-breakthrough-that-could-change-course-of-pandemic.html", "https://www.rt.com/russia/497671-putin-covid-19-vaccine-first/", "https://www.indiatvnews.com/news/good-news/russia-mass-vaccination-sputnik-v-coronavirus-vaccine-start-january-1-2021-vladimir-putin-641361", "https://www.businesstoday.in/current/economy-politics/coronavirus-vaccine-news-update-why-putins-russian-covid-19-vaccine-claim-feels-dangerous/story/412651.html"], "authors": ["N Stilianopoulos"], "publish_date": null}