{"result_id": "312020", "URL": "https://www.thinkinghumanity.com/2022/02/novak-djokovic-says-he-will-not-get-covid-19-vaccine-and-may-be-banned-from-french-open-and-wimbledon.html", "timestamp": "2023-04-25 17:39:50 CEST+0200", "meta": {"description": "Serbian tennis superstar Novak Djokovic has stated that he is willing to miss future tennis tournaments such as the French Open and Wimbledon as oppos", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2022/02/novak-djokovic-says-he-will-not-get-covid-19-vaccine-and-may-be-banned-from-french-open-and-wimbledon.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Novak Djokovic Says He Will Not Get Covid-19 Vaccine And May Be Banned From The French Open And Wimbledon", "cleaned_text": "Serbian tennis superstar Novak Djokovic has stated that he is willing to miss future tennis tournaments such as the French Open and Wimbledon as opposed to getting a Covid-19 vaccine.\n\nDjokovic missed out on the Australian Open earlier this year after entering the country, leading to him being detained in an immigration centre and then expelled from the country.\n\nDjokovic has however denied he is part of the so-called 'anti-vax' movement but instead simply believes that each individual has the right to choose whether or not they receive a vaccine.\n\nIn an exclusive interview with the BBC, he said:\n\n\"I was never against vaccination… but I've always supported the freedom to choose what you put in your body.\"\n\n\"I was never against vaccination. I understand that globally, everyone is trying to put a big effort into handling this virus and seeing, hopefully, an end soon to this virus.\"\n\nDjokovic went on to say that he was not expelled from Australia because he had not had a vaccine but due to a visa declaration error. He continued:\n\n\"Absolutely, the visa declaration error was not deliberately made. It was accepted and confirmed by the Federal Court and the minister himself in the Ministry for Immigration in Australia. So actually, what people probably don't know is that I was not deported from Australia on the basis that I was not vaccinated, or I broke any rules or that I made an error in my visa declaration. All of that was actually approved and validated by the Federal Court of Australia and the Minister for Immigration.\"\n\nHe went on to say that his visa was cancelled on the discretion of the Australian minister for immigration:\n\n\"The reason why I was deported from Australia was because the Minister for Immigration used his discretion to cancel my visa based on his perception that I might create some anti-vax sentiment in the country or in the city, which I completely disagree with.\"\n\nIt will now be seen whether the 21 grand slam winner will be able to compete in future competitions or whether his career will be severely impacted.", "opengraph": {"url": "https://www.thinkinghumanity.com/2022/02/novak-djokovic-says-he-will-not-get-covid-19-vaccine-and-may-be-banned-from-french-open-and-wimbledon.html", "title": "Novak Djokovic Says He Will Not Get Covid-19 Vaccine And May Be Banned From The French Open And Wimbledon", "description": "Serbian tennis superstar Novak Djokovic has stated that he is willing to miss future tennis tournaments such as the French Open and Wimbledon as oppos", "image": "https://blogger.googleusercontent.com/img/a/AVvXsEjrjgWCCDAQoLIwbG5dGuz_KHiyOyEwUxRz04ehAtE9uR0j2bYqdgtsH_hHhrVyH1RVj5weMPRB3O3FXgdNo9k0Edk4YLCKF88A50QlQKrxagP5M6VZshdttOJjNFyrtHM2f2CYWYnbiZEBGRkiDZQZbHowYXCTLcMsJm3lRCDRf8BVmEGRPakaExVHBg", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["News"], "tweets": [], "movies": [], "links": ["https://www.bbc.co.uk/news/world-60354068", "https://www.bbc.co.uk/news/world-60354068", "https://www.bbc.co.uk/news/world-60354068"], "authors": ["N Stilianopoulos"], "publish_date": null}