{"result_id": "312007", "URL": "http://www.thinkinghumanity.com/2017/07/25-common-behaviors-of-someone-who-has-experienced-childhood-emotional-abuse.html", "timestamp": "2023-04-25 17:39:31 CEST+0200", "meta": {"description": "While we grow up, the behavior that we receive from our families is extremely related to our coping skills as adults.", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2017/07/25-common-behaviors-of-someone-who-has-experienced-childhood-emotional-abuse.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "25 Common Behaviors Of Someone Who Has Experienced Childhood Emotional Abuse", "cleaned_text": "While we grow up, the behavior that we receive from our families is extremely related to our coping skills as adults. Victims of emotional abuse usually behave in a certain way that separates them from the rest. If you or somebody you know was a victim of abuse, then you might want to read more about these. Understanding where another person is coming from, or getting to know yourself better, can make all the difference.\n\n1. Asking Questions Even When The Answer Is Obvious\n\nIf you have ever been a victim of abuse, you may doubt yourself every single time, even when you know you are right. Due to this, you might find yourself asking a million questions when the answers are obvious.\n\nChildren of abuse might feel as though they weren't ever able to do anything right. As a result, they always apologize, even in their adult life, and even when they didn't do anything wrong.\n\nWhen you have lived in a chaotic world of emotional abuse, you can never truly trust in anything. Instead, you might always be afraid of something bad happening or someone betraying you.\n\n4. You Seem Tough But Are Very Sensitive\n\nDuring a difficult childhood, you learn how to be tough, because you have to be. Nevertheless, you also experience a number of strong emotions at a young age, which cause you to be especially sensitive in your adult life.\n\n5. It's Really Hard To Make A Decision\n\nIt's more difficult to make decisions if during your childhood you were told that you weren't good enough.\n\nTo combat a parent or caregiver that was constantly searching for your mistakes, you might become a perfectionist. You are timely, clean, and well-organized. Lots of victims of abuse tend to over-do because they want to people please.\n\n7. You Are Sensitive To Loud Noises\n\nIf you have grown up in fear, you might be used to being yelled at, so that loud noises remind you of abuse.\n\nSo many victims of abuse are afraid of socializing with people, and might sometimes try to distance themselves as much as they can.\n\nYou might perceive people as negative or offensive because of your past abuse.\n\nThat means fearing that others will leave you, or abandon you.\n\n11. You Have Issues With Eye Contact\n\nWhen talking, you might become anxious to the extent that you can't even make eye contact with the other person.\n\n12. You Run Away From Conflict\n\nYou hate facing conflict, because it gives you immense anxiety. So, it feels easier for you to just leave the situation completely.\n\n13. You Always Beat Yourself Up\n\nAfter being abused, you might be used to some kind of repercussion for everything you've done wrong. In turn, you might be constantly bashing yourself.\n\n14. You Find It Hard To Get Close To Other People\n\nIf you have been abused, you might not especially like people or be scared of them. Because of this, getting close to others isn't something simple for you.\n\nYou might not feel like you have a loud voice after you have been forced to feel so small and insignificant your whole life.\n\n16. You Can't Take A Compliment\n\nWhen someone says how wonderful you are, you might doubt their words, because you can't see any good in yourself.\n\n17. You Have Very Low Self-Esteem\n\nNo matter what you do, you always doubt that you are capable of doing it. You don't believe in yourself as much as you should.\n\nAccording to science and psychology, victims of emotional abuse often face addiction issues. These can include alcohol, stealing, hard drugs, gambling, eating excessively, etc.\n\nEverything worries you and makes you anxious. Even the smallest sign of trouble, you will feel overwhelmed.\n\nYour entire life you sat back and watched a person treat you terribly, with anger and fury. In turn, you may now have outbursts of anger.\n\nSome abused children tend to abuse themselves later in life as they feel like they deserve it.\n\nLiving with a toxic person who abuses you can cause you to have many different emotions at the same time.\n\nYou might notice that you sometimes forget entire conversations or events because you simply spaced out.\n\nCommitting to people is more difficult when you have been abused. You may find it hard to trust others enough to settle with them.\n\nAfter all, when there is something good in your life, you know how to appreciate it. You are just stronger every day and grateful that the worst days are over.", "opengraph": {"url": "https://www.thinkinghumanity.com/2017/07/25-common-behaviors-of-someone-who-has-experienced-childhood-emotional-abuse.html", "title": "25 Common Behaviors Of Someone Who Has Experienced Childhood Emotional Abuse", "description": "While we grow up, the behavior that we receive from our families is extremely related to our coping skills as adults.", "image": "https://1.bp.blogspot.com/-Tnq5tTq93P4/WV1GoZBwjxI/AAAAAAAANDI/bE8lf4EdIeMza1EMQuE3uHYcn4aV71Q6QCLcBGAs/s1600/25%2BCommon%2BBehaviors%2BOf%2BSomeone%2BWho%2BHas%2BExperienced%2BChildhood%2BEmotional%2BAbuse.jpg", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Relationships", "Consciousness", "Self Improvement"], "tweets": [], "movies": [], "links": [], "authors": ["Katerina P."], "publish_date": null}