{"result_id": "312001", "URL": "https://www.thinkinghumanity.com/2021/10/new-breast-cancer-vaccine-set-to-begin-clinical-trials-on-humans.html", "timestamp": "2023-04-25 17:39:25 CEST+0200", "meta": {"description": "An announcement by the Cleveland Clinic trial stated that the clinic is going to launch a human trial testing a vaccine that aims to prevent triple-ne", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2021/10/new-breast-cancer-vaccine-set-to-begin-clinical-trials-on-humans.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "New Breast Cancer Vaccine Set To Begin Clinical Trials In Humans", "cleaned_text": "An announcement by the Cleveland Clinic trial stated that the clinic is going to launch a human trial testing a vaccine that aims to prevent triple-negative breast cancer. This type of cancer is currently managed only through a prevented mastectomy and is not treatable with either hormone or targeted drug therapy.\n\nSo far, triple-negative breast cancer vaccines have only been tested in animals. The US Food and Drug Administration has approved the trial to move on with clinical tests on humans. The research aims to give the vaccine to healthy people who are at high risk of developing the cancer, such as those carrying BRCA1 gene mutations.\n\nCleveland Clinic's Taussig Cancer Institute and principal investigator of the study, Dr. G. Thomas Budd, said in a press release:\n\n\"Long term, we are hoping that this can be a true preventive vaccine that would be administered to healthy women to prevent them from developing triple-negative breast cancer, the form of breast cancer for which we have the least effective treatments.\"\n\nIt is estimated that triple-negative breast cancer affects 12 to 15 percent of all breast cancer patients, a quarter of which will die from the disease within five years of being diagnosed.\n\nThe vaccine works by targeting the α-lactalbumin protein, prompting the immune system to attack emerging tumors that express the protein.\n\n18 to 24 tumor-free patients who have received treatment for early-stage triple-negative breast cancer will receive three shots of the vaccine at two weeks apart each. The scientists will start off by giving low doses to a few patients and then observe their response before increasing the dose.\n\n\"Once we've figured out how much of the vaccine we can give, we'll look at its effects on the immune system. That will help us know whether the vaccine is doing what we want it to do, and then we'll expand each dose level.\"\n\nThe researchers aim to complete the study in September 2022.\n\n\"This vaccine strategy has the potential to be applied to other tumor types. Our translational research program focuses on developing vaccines that prevent diseases we confront with age, like breast, ovarian and endometrial cancers. If successful, these vaccines have the potential to transform the way we control adult-onset cancers and enhance life expectancy in a manner similar to the impact that the childhood vaccination program has had.\"", "opengraph": {"url": "https://www.thinkinghumanity.com/2021/10/new-breast-cancer-vaccine-set-to-begin-clinical-trials-on-humans.html", "title": "New Breast Cancer Vaccine Set To Begin Clinical Trials In Humans", "description": "An announcement by the Cleveland Clinic trial stated that the clinic is going to launch a human trial testing a vaccine that aims to prevent triple-ne", "image": "https://blogger.googleusercontent.com/img/a/AVvXsEiBId9G7Vquv3iG9uejEQadMNzwmZGOircJa2gTXd7hoHu2SC9nF9H4618-bPy8jvn0Di98Efjj-_5N4iQUYQzfgQHZHHPGwZQpSLg3_RE0oJ5ARauJ0khxgaxoVhZrjAfzV3Y9vYfKwJGPU7empRMrAeT03j5LEaX60VVuo7YfppKsPa890Srlk85zCg", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Health", "News", "Science"], "tweets": [], "movies": [], "links": ["https://newsroom.clevelandclinic.org/2021/10/26/cleveland-clinic-launches-first-of-its-kind-preventive-breast-cancer-vaccine-study/", "https://health.clevelandclinic.org/breast-cancer-vaccine-trial/", "https://health.clevelandclinic.org/breast-cancer-vaccine-trial/", "https://www.sciencealert.com/a-trial-is-being-launched-to-test-a-first-of-its-kind-breast-cancer-vaccine"], "authors": ["N Stilianopoulos"], "publish_date": null}