{"result_id": "312010", "URL": "https://www.thinkinghumanity.com/2021/03/pill-form-of-covid-19-vaccine-to-enter-first-clinical-trials.html", "timestamp": "2023-04-25 17:39:38 CEST+0200", "meta": {"description": "A vaccine against Covid-19 which is administered in pill form could be available in the next year according to researchers and top scientists. The co", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2021/03/pill-form-of-covid-19-vaccine-to-enter-first-clinical-trials.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Pill Form Of CoViD-19 Vaccine To Enter The First Clinical Trials", "cleaned_text": "A vaccine against Covid-19 which is administered in pill form could be available in the next year according to researchers and top scientists.\n\nThe company leading the research, Oravax, said that it will begin trails in June to see if the oral vaccine would work in defending people against Covid-19 infection.\n\nIf the trials are successful, and the drug is certified as safe, it could mean that the vaccine could be administered to millions of people globally. Because the vaccine is taken in capsule form, it means that doctors and nurses may not be required to administer the vaccine, making it far easier, and faster to administer compared to the injected vaccines currently in use across the globe. Almost half a billion people worldwide have now had at least one dose of an injected Covid-19 vaccine.\n\nThe company also believes that the new type of vaccine could be better at protecting against new strains of Covid-19. Some scientists fear that the vaccines currently in use may not work against these new strains. Oravax said in their statement:\n\n\"Oravax's COVID-19 vaccine candidate benefits from being a virus like particle (VLP) triple antigen vaccine that targets three structural proteins, which should make it a better candidate for protection across emerging mutations of the coronavirus. The oral delivery of the vaccine should allow for widescale inoculation and easier distribution of the vaccine without requiring an injection.\"\n\nProf. Paul Hunter, Professor of Medicine at the University of East Anglia, said in an email to reporters:\n\n\"We would need properly conducted studies to prove [oral vaccines'] worth. But they may also be of value in people who are severely needle phobic and may be easier and more rapid to administer. The thing about systemic vaccines (shots in arms) in that they are generally very good at preventing severe disease.\"\n\n\"The results of the animal studies are encouraging. But don't assume that animal results always translate into human results. We need human studies to be sure.\"\n\nA previous vaccine trial in pill form was set-up by pharmaceutical company Vaxart who said that trial results in animals were highly successful but when the pill was tested in humans, it produced poor results. It will be seen in time if Oravax can outdo the previous attempts at an oral vaccine.", "opengraph": {"url": "https://www.thinkinghumanity.com/2021/03/pill-form-of-covid-19-vaccine-to-enter-first-clinical-trials.html", "title": "Pill Form Of CoViD-19 Vaccine To Enter The First Clinical Trials", "description": "A vaccine against Covid-19 which is administered in pill form could be available in the next year according to researchers and top scientists. The co", "image": "https://1.bp.blogspot.com/-3epyiu-eu14/YGS3-w60lDI/AAAAAAAADqM/fQ36wAJRzQw915otGttK3tyn_-xkbnB9ACNcBGAsYHQ/s0/Pill%2BForm%2BOf%2BCoViD-19%2BVaccine%2BTo%2BEnter%2BThe%2BFirst%2BClinical%2BTrials.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Health", "CoVid-19", "News"], "tweets": [], "movies": [], "links": ["https://www.oramed.com/oramed-forms-a-joint-venture-oravax-medical-inc-for-the-development-of-novel-oral-covid-19-vaccines/", "https://www.sciencealert.com/a-potential-pill-form-coronavirus-vaccine-could-soon-undergo-clinical-trials", "https://www.sciencealert.com/a-potential-pill-form-coronavirus-vaccine-could-soon-undergo-clinical-trials", "https://www.sciencealert.com/a-potential-pill-form-coronavirus-vaccine-could-soon-undergo-clinical-trials"], "authors": ["N Stilianopoulos"], "publish_date": null}