{"result_id": "312018", "URL": "https://www.thinkinghumanity.com/2020/11/first-covid-19-vaccine-is-proven-to-work-with-experts-saying-life-could-be-back-to-normal-by-spring.html", "timestamp": "2023-04-25 17:39:48 CEST+0200", "meta": {"description": "In what is monumental news, a vaccine for CoVid-19 has been proven to work, the first since the pandemic began almost one year ago. Not only was it sh", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2020/11/first-covid-19-vaccine-is-proven-to-work-with-experts-saying-life-could-be-back-to-normal-by-spring.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "First CoVid-19 Vaccine Is Proven To Work With Experts Saying Life Could Return Back To Normal By Spring", "cleaned_text": "In what is monumental news, a vaccine for CoVid-19 has been proven to work, the first since the pandemic began almost one year ago. Not only was it shown to work, but it was shown to work at a 90% efficacy rate, meaning that it creates immunity in 90% of those that receive the vaccine. This level is higher than the average yearly flu vaccine and around the same level as the MMR vaccine. Experts are now heralding the breakthrough as the first step in the fightback against the pandemic and the first step towards a return to normality.\n\nSir John Bell of Oxford University, a member of the UK Government's vaccine taskforce, was asked by the BBC if life could return to normal by spring, to which he replied:\n\n\"Yes, yes, yes, yes. I am probably the first guy to say that but I will say that with some confidence.\"\n\nThe vaccine was created by Pfizer and BioNTech and was tested on over 43,000 people in the United States, Turkey, Germany, Argentina and South Africa. It showed no adverse symptoms in any individual who received the vaccine. During the trial, around 40,000 individuals were injected with the vaccine and around 40,000 were injected with a placebo. The team then examined how many people within each group had been infected with Co-Vid19 in that time.\n\nPfizer and BioNTech describe the breakthrough as 'a great day for humanity' and 'a great day for science'.\n\nThe vaccine must be delivered in two separate injections spread three weeks apart, and many countries have already signed up to purchase huge first batches of the vaccine, including the United Kingdom. Pfizer believes it can produce 50 million doses by the end of this year and 1.2 billion doses by the end of 2021. The UK will receive 10 million doses by the end of the year and 30 million later.\n\nIt is thought that the most vulnerable and health-care workers will be the first to be vaccinated, with the vaccine then being rolled out to healthier members of the population.\n\nThis vaccine is just one of a few that are expected to reveal their results within the next few weeks, meaning that there could be multiple vaccines on the market and a far larger production base to make sure there are enough doses for everyone.\n\nProfessor Peter Horby, from the University of Oxford, said the importance of this discovery should not be underestimated, he said:\n\n\"This news made me smile from ear to ear. It is a relief... there is a long long way to go before vaccines will start to make a real difference, but this feels to me like a watershed moment.\"\n\nWhile this may not be the end of the pandemic, it certainly feels like it could be the beginning of the end.", "opengraph": {"url": "https://www.thinkinghumanity.com/2020/11/first-covid-19-vaccine-is-proven-to-work-with-experts-saying-life-could-be-back-to-normal-by-spring.html", "title": "First CoVid-19 Vaccine Is Proven To Work With Experts Saying Life Could Return Back To Normal By Spring", "description": "In what is monumental news, a vaccine for CoVid-19 has been proven to work, the first since the pandemic began almost one year ago. Not only was it sh", "image": "https://1.bp.blogspot.com/-BbrYswq6FmQ/X6m12JbCnLI/AAAAAAAACM0/kbcl5H9PGnAVWngXWRRFQZesiXeb8R8VACNcBGAsYHQ/s0/First%2BCoVid-19%2BVaccine%2BIs%2BProven%2BTo%2BWork%2BWith%2BExperts%2BSaying%2BLife%2BCould%2BBe%2BBack%2BTo%2BNormal%2BBy%2BSpring.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["CoVid-19", "News"], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/health-54873105", "https://www.thinkinghumanity.com/2020/07/oxford-coronavirus-vaccine-shown-to-trigger-immune-response-in-world-first-breakthrough-that-could-change-course-of-pandemic.html", "https://www.mirror.co.uk/news/politics/breaking-covid-vaccine-10million-doses-22981341"], "authors": ["N Stilianopoulos"], "publish_date": null}