{"result_id": "312013", "URL": "https://www.thinkinghumanity.com/2020/12/pfizers-covid-19-vaccine-receives-rating-from-fda.html", "timestamp": "2023-04-25 17:39:41 CEST+0200", "meta": {"description": "The Federal Drug Administration (FDA) has given an A+ rating to the new Pfizer CoVid-19 vaccine. The FDA oversees the safety of all drugs distributed", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2020/12/pfizers-covid-19-vaccine-receives-rating-from-fda.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Pfizer's CoVid-19 Vaccine Receives A+ Rating From The FDA", "cleaned_text": "The Federal Drug Administration (FDA) has given an A+ rating to the new Pfizer CoVid-19 vaccine. The FDA oversees the safety of all drugs distributed within medical settings in the United States. An emergency committee will now recommend whether the vaccine should be given further approval so that the vaccine rollout can begin in the US.\n\nAkiko Iwasaki, an immunologist at Yale University, speaking to the New York Times said:\n\n\"This is what an A+ report card looks like for a vaccine.\"\n\nThe FDA has said that during the testing of the vaccine, a fairly common response included mild pain at the injection site, headache, mild nausea and fatigue. However, there were absolutely no serious reactions and these symptoms cleared after a few days. The vaccine has already been tested on tens-of-thousands of test subjects.\n\nA 53-page analysis of the vaccine by the FDA will now be sent to a scientific advisory group who are expected to make their decision promptly. It is thought highly likely that the vaccine will then be approved. The FDA paper says that there are:\n\n\"No specific safety concerns identified that would preclude issuance of an EUA [Emergency Use Authorization].\"\n\nIt also says that the vaccine is effective:\n\n\"Across all age groups, genders, racial and ethnic groups, and participants with medical comorbidities associated with high risk of severe COVID-19.\"\n\nThe Pfizer vaccine is believed to be almost 95% effective, meaning that it makes 95% of people who receive the vaccine immune to CoVid-19. Another vaccine made by Moderna is thought to be similarly effective. The Oxford vaccine, which will be used on most people in the UK, is believed to be only around 70% effective, but it has the advantage of being much easier to transport and much easier to administer. In all of the trials of these vaccines, no severe reactions or medical emergencies related to the vaccines were recorded.\n\nThe Pfizer vaccine uses mRNA technology, unlike traditional vaccines that use dead or inactive parts of the original virus. The mRNA technology mimics the spike of the CoVid-19 virus so that the body can identify the real thing when it comes into contact with it.\n\nIn the UK, as many as 70,000 people have died as a result of CoVid-19 and in the United States over 280,000 people have died of the disease. That is over 4 times the number of Americans killed in the 8 years of the Vietnam war, and over half as many that died in the Second World War.", "opengraph": {"url": "https://www.thinkinghumanity.com/2020/12/pfizers-covid-19-vaccine-receives-rating-from-fda.html", "title": "Pfizer's CoVid-19 Vaccine Receives A+ Rating From The FDA", "description": "The Federal Drug Administration (FDA) has given an A+ rating to the new Pfizer CoVid-19 vaccine. The FDA oversees the safety of all drugs distributed ", "image": "https://1.bp.blogspot.com/-JRm1_BOvjTQ/X9EqJLwqBaI/AAAAAAAACes/c2uqLkvc834twnJ6Ip5uVCbbH2jsBAGyACNcBGAsYHQ/s0/Pfizer%2527s%2BCoVid-19%2BVaccine%2BReceives%2BA%252B%2BRating%2BFrom%2BThe%2BFDA.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Health", "CoVid-19", "News", "Science"], "tweets": [], "movies": [], "links": ["https://www.thinkinghumanity.com/2020/11/first-covid-19-vaccine-is-proven-to-work-with-experts-saying-life-could-be-back-to-normal-by-spring.html", "https://www.nytimes.com/2020/12/08/health/covid-vaccine-pfizer.html", "https://www.nytimes.com/2020/12/08/health/covid-vaccine-pfizer.html", "https://www.thinkinghumanity.com/2020/07/oxford-coronavirus-vaccine-shown-to-trigger-immune-response-in-world-first-breakthrough-that-could-change-course-of-pandemic.html"], "authors": ["N Stilianopoulos"], "publish_date": null}