{"result_id": "312014", "URL": "https://www.thinkinghumanity.com/2021/01/companies-are-now-developing-vaccine-passport-apps-that-trackpersons-covid-19-history-before-travel.html", "timestamp": "2023-04-25 17:39:42 CEST+0200", "meta": {"description": "Several companies are in the midst of designing apps in which an individual's Covid-19 testing and vaccination history may be stored. The newly design", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2021/01/companies-are-now-developing-vaccine-passport-apps-that-trackpersons-covid-19-history-before-travel.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Companies Are Now Developing Vaccine Passport Apps That Track A Person's CoViD-19 History Before They Travel", "cleaned_text": "Several companies are in the midst of designing apps in which an individual's Covid-19 testing and vaccination history may be stored. The newly designed apps are being created in anticipation that many countries, workplaces and venues may demand to see a person's Covid-19 history before granting them access.\n\nThe CommonPass app is one such app being designed for this purpose and is the creation of Swiss based non-profit The Commons Project and the World Economic Forum. Several prominent airlines, such as United Airlines, Virgin Atlantic and Cathy Pacific, have also been involved in the project, airlines and airports would, of course, play an important part in any passport regime.\n\n\"You can be tested every time you cross a border. You cannot be vaccinated every time you cross a border.\"\n\nWhile Brian Behlendorf, of the Linux Foundation, which is working with CommonPass, added:\n\n\"If we're successful, you should be able to say: I've got a vaccine certificate on my phone that I got when I was vaccinated in one country, with a whole set of its own kind of health management practices... that I use to get on a plane to an entirely different country and then I presented in that new country a vaccination credential so I could go to that concert that was happening indoors for which attendance was limited to those who have demonstrated that they've had the vaccine. It should be interoperable in the same way that email is interoperable, the same way that the web is interoperable. Right now, we're in a situation where there's some moving parts that get us closer to that, but I think there's a sincere commitment from everybody in the industry.\"\n\nWhile such vaccine passports are likely to help stop the spread of Covid-19 and encourage safe travel, some privacy campaigners are worried that such passes could violate the rights of individuals by allowing their movements to be tracked by governments and their medical history to be shared with other organisations. This is particularly worrying for individuals who may be moving between countries, who have poor human-rights records or, who do not normally share data with one another.\n\nThe whole issue surrounding vaccine passports will also rely upon whether the vaccine just prevents people from becoming ill or whether it prevents against spreading the virus as well. Scientists do not yet have conclusive data on this. If it is the case that the vaccines only prevent a person from becoming ill but they can still spread the virus to others, then the whole issue of vaccine passports becomes redundant, and testing will need to be carried out at borders instead.\n\nJulie Parsonnet, a disease specialist at Stanford University, alluded to this in a recent interview, saying:\n\n\"We still don't know if vaccinated people can transmit infection or not. Until that is clarified, we won't know whether 'passports' will be effective.\"", "opengraph": {"url": "https://www.thinkinghumanity.com/2021/01/companies-are-now-developing-vaccine-passport-apps-that-trackpersons-covid-19-history-before-travel.html", "title": "Companies Are Now Developing Vaccine Passport Apps That Track A Person's CoViD-19 History Before They Travel", "description": "Several companies are in the midst of designing apps in which an individual's Covid-19 testing and vaccination history may be stored. The newly design", "image": "https://1.bp.blogspot.com/-v_8BPo_y1Ek/X_XzLgc5f7I/AAAAAAAACyY/FrI7xDvADbQ-0M4R-JtGteiYfX9UptfmQCNcBGAsYHQ/s0/Companies%2BAre%2BNow%2BCreating%2BVaccine%2BPassport%2BApps%2BThat%2BTrack%2BA%2BPerson%2527s%2BCoViD-19%2BHistory%2BBefore%2BThey%2BTravel.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["CoVid-19", "News"], "tweets": [], "movies": [], "links": ["https://edition.cnn.com/2020/12/27/tech/coronavirus-vaccine-passport-apps/index.html"], "authors": ["N Stilianopoulos"], "publish_date": null}