{"result_id": "312019", "URL": "https://www.thinkinghumanity.com/2019/06/holland-becomes-the-first-country-without-stray-dogs.html", "timestamp": "2023-04-25 17:39:49 CEST+0200", "meta": {"description": "Can you imagine how much happier the world would be without stray dogs?", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2019/06/holland-becomes-the-first-country-without-stray-dogs.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Holland Becomes The First Country Without Stray Dogs", "cleaned_text": "Can you imagine how much happier the world would be without stray dogs? Holland took the lead and saved them by finding them all a home. They are entirely changing dogs’ destinies and allowing them to have a life full of happiness and love. The government took specific action to accomplish this by implementing the PSVIR method (pick, sterilize, vaccinate, identify, and return). Thanks to that, in 2016, it became the first country to free these living creatures from the loneliness and terror of the streets. We want this idea to be copied around the rest of the planet.\n\nSince the 19th century, Holland has had a huge dog population. Almost every family in the country had a dog as a pet because people viewed it as a symbol of social status. But the large number of dogs that lived there sparked an outbreak of rabies which soon became one of the leading causes of death. Out of fear, many owners began abandoning their pets, and since this action was considered legal, streets became filled with stray dogs of all kinds.\n\nHolland wanted to change those unfortunate circumstances. They started to do this by organizing days in which sterilization and castration were mandatory. All were free of charge; the government covered all the expenses. With that, they were able to sterilize 70 percent of female dogs. Every dog also had medical examinations to verify which vaccines and medical services it needed.\n\nTo take more control and end the issue once and for all, the government passed a law that protected animals and approved another law related to animal health and welfare. The new legislation encouraged owners to provide pets with adequate treatment and to eliminate abuse. Unless owners followed them, they could be punished with up to three years in prison and a fine higher than $16,000.\n\nPeople who choose to have a dog at home usually decide to adopt or buy breeding dogs because they consider them to be more healthy and beautiful. That's why the Dutch government resolved to raise taxes on the purchase of dogs in stores. Consequently, that added expense forced dog owners to start considering other ways to get pets and increased the chance of stray dog adoption.\n\nThe state also started to run another campaign to raise awareness. This time people had the chance to take care of homeless puppies. People fell in love with them and more than a million stray dogs managed to find a family and a safe place to live. The operation had a massive impact on citizens and led 90 percent of the population to adopt a dog as a pet.\n\nThis government program worked against all adversity. Following their achievements, they delegated the job to “Animal Cops” in 2011, a group of policemen in charge of the protection and safety of dogs. Today, puppies living in the Netherlands are not only living comfortably in homes, but they are also accepted in most of the country’s stores, restaurants, and other establishments.", "opengraph": {"url": "https://www.thinkinghumanity.com/2019/06/holland-becomes-the-first-country-without-stray-dogs.html", "title": "Holland Becomes The First Country Without Stray Dogs", "description": "Can you imagine how much happier the world would be without stray dogs?", "image": "https://1.bp.blogspot.com/-72YNO0RUld4/XQvIe9sbH1I/AAAAAAAA83A/ZP1Mq8W4tp8QVjQ8-BacXF5MxPuiH36_gCLcBGAs/s1600/Holland%2BBecomes%2BThe%2BFirst%2BCountry%2BWithout%2BStray%2BDogs.jpg", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Photography", "Inspiring Stories", "Environment", "Activism", "Consciousness"], "tweets": [], "movies": [], "links": ["https://brightside.me/wonder-animals/holland-becomes-the-first-country-without-street-dogs-and-heres-how-they-achieved-it-753010/", "http://dogresearch.files.wordpress.com/2012/11/dr_dutch-straydogs.pdf", "https://pixabay.com/es/photos/perros-cachorros-mascota-animales-984015/", "https://pixabay.com/es/photos/perro-cachorro-mascota-animales-918620/", "https://pixabay.com/es/photos/perros-negro-blanco-mascotas-439958/", "https://pixabay.com/es/photos/d%C3%A1lmatas-perros-mascotas-buena-3210166/", "https://pixabay.com/es/photos/perro-amistad-naturaleza-confianza-1861839/", "http://www.nytimes.com/2018/01/29/world/europe/netherlands-animal-police.html", "https://pixabay.com/es/photos/perro-animales-feliz-juguet%C3%B3n-3590437/", "https://pixabay.com/es/photos/perro-cachorro-mascota-animales-918620/"], "authors": ["Katerina P."], "publish_date": null}