{"result_id": "312003", "URL": "https://www.thinkinghumanity.com/2020/12/scientists-say-it-is-vital-to-remember-that-vaccine-immunity-takes-time-to-build-after-nurse-contracts-covid-19-one-week-after-being-vaccinated.html", "timestamp": "2023-04-25 17:39:27 CEST+0200", "meta": {"description": "A nurse in California has been confirmed to have Covid-19 just one week after she was vaccinated against the disease. While the story has caught atten", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2020/12/scientists-say-it-is-vital-to-remember-that-vaccine-immunity-takes-time-to-build-after-nurse-contracts-covid-19-one-week-after-being-vaccinated.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "Scientists Say It Is Vital To Remember That Vaccine Immunity Takes Time To Build After Nurse Contracts CoVid-19 One Week After Being Vaccinated", "cleaned_text": "A nurse in California has been confirmed to have Covid-19 just one week after she was vaccinated against the disease. While the story has caught attention online, scientists are reminding people that immunity from the vaccine can take as long as three weeks to build-up after receiving the jab. It is absolutely essential to remember therefore, that social-distancing measures are maintained into the near-future in order to stop the spread of the disease.\n\nThe nurse was vaccinated with the Pfizer vaccine which is given in two doses. The nurse had only received her first dose of the vaccine.\n\nTrials have shown that after the first jab, the efficacy of the vaccine is around 50%, meaning that 5 out of 10 people who are vaccinated and then directly exposed to Covid-19 will not become ill. After the second booster jab, the efficacy rises to 95% meaning 19 out of 20 vaccinated people directly exposed to Covid-19 will not become ill. This level of efficacy is regarded as being extremely high, and much higher than the annual flu vaccine which has an efficacy of around 50 to 60%.\n\nThis, of course, means that while the vaccine will protect the vast majority of people some individuals may still be susceptible to Covid-19 infection, and cases such as that of the nurse are to be expected. It is also possible, as Covid-19 can take up to 14 days to make an individual ill after they have been vaccinated, that the nurse caught the disease before she was vaccinated.\n\nPfizer released a statement following news of the infection, saying:\n\n\"Pfizer will review all available information on this case and all reports of any confirmed diagnosis following vaccination. Based on our Phase 3 safety and efficacy study, the vaccine provides some protection against COVID-19 within about 10 days of the first dose and substantially boosted after the second dose, supporting the need for a 2-dose vaccination series. Individuals may have contracted disease prior to or right after vaccination.\"\n\n\"We know from the vaccine clinical trials that it's going to take about 10 to 14 days for you to start to develop protection from the vaccine. That first dose we think gives you somewhere around 50%, and you need that second dose to get up to 95%.\"\n\nThe news comes as the UK has decided to reshape its vaccine plans. Instead of giving the current limited supply of vaccines out on a two-dose regime 3 weeks apart from one another, they will instead give the second dose 12 weeks after the first in order to vaccinate a far greater number of people with their first dose. It is hoped that this new regime will stop the immediate spread of the disease. The UK recorded a record number of cases on the 30th of December with over 50,000 confirmed infected in one-day. Almost 1,000 people died on the same day. Almost the entire UK is now in a near-full lockdown.", "opengraph": {"url": "https://www.thinkinghumanity.com/2020/12/scientists-say-it-is-vital-to-remember-that-vaccine-immunity-takes-time-to-build-after-nurse-contracts-covid-19-one-week-after-being-vaccinated.html", "title": "Scientists Say It Is Vital To Remember That Vaccine Immunity Takes Time To Build After Nurse Contracts CoVid-19 One Week After Being Vaccinated", "description": "A nurse in California has been confirmed to have Covid-19 just one week after she was vaccinated against the disease. While the story has caught atten", "image": "https://1.bp.blogspot.com/-Q9glUmJ2z50/X-47kh1BbeI/AAAAAAAACtw/fmA5Ci-PPd4uH4ND2qW4I3xrCjsw4rBfwCNcBGAsYHQ/s0/Scientists%2BSay%2BIt%2BIs%2BVital%2BTo%2BRemember%2BThat%2BVaccine%2BImmunity%2BTakes%2BTime%2BTo%2BBuild%2BAfter%2BNurse%2BContracts%2BCoVid-19%2BOne%2BWeek%2BAfter%2BBeing%2BVaccinated.webp", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Health", "CoVid-19", "News"], "tweets": [], "movies": [], "links": ["https://www.reuters.com/article/us-health-coronavirus-usa-vaccine-idUSKBN2940QL", "https://www.10news.com/news/local-news/er-nurse-tests-positive-for-covid-19-eight-days-after-receiving-vaccine"], "authors": ["N Stilianopoulos"], "publish_date": null}