{"result_id": "312009", "URL": "https://www.thinkinghumanity.com/2019/01/5-reasons-why-hugging-is-the-best-form-of-communication.html", "timestamp": "2023-04-25 17:39:36 CEST+0200", "meta": {"description": "Hugging is among the most amazing things we could ever give another person. Hugging is a form of therapy in itself.", "lang": "en", "keywords": "", "favicon": "https://www.thinkinghumanity.com/favicon.ico", "canonical": "https://www.thinkinghumanity.com/2019/01/5-reasons-why-hugging-is-the-best-form-of-communication.html", "encoding": "utf-8"}, "image": null, "domain": "www.thinkinghumanity.com", "title": "5 Reasons Why Hugging Is The Best Form Of Communication", "cleaned_text": "Hugging is among the most amazing things we could ever give another person. Hugging is a form of therapy in itself.\n\nWhen we receive hugs, we also receive a sense of comfort, care, understanding, love, and many other feelings. Wouldn't you agree that hugging each other every single day would be a good idea?\n\nThere's more to hugging than the surface appearance of it all. There's actual science that happens within our bodies when we are receiving a hug or giving one to somebody else.\n\nThe physiological changes that we experience deep within as we're being hugged could be described as one among the ultimate forms of being human and alive.\n\nHugging has the fantastic ability to lower our heart rate.\n\nA study conducted by the University of North Carolina - Chapel Hill, indicated that the volunteers who had little to no contact at all with their significant others had developed a much faster heart rate of ten beats per minute, compared to the standard five beats per minute of those that were hugged by their significant other all the time.\n\nA lower heart rate correlates with less chance of cardiac illnesses.\n\nJust by hugging someone, you have already started balancing their nervous system.\n\nTiny egg-shaped pressure sensors also called Pacnician corpuscles discovered within the skin are linked to the brain through our Vagus nerve.\n\nEssentially what that means is that they sense the feeling of being touched.\n\nHugging somebody can ease most of their stress immediately and effectively. Too frequently we underestimate the power of hugging. What happens is that when we're hugged, the level of cortisol which is circulating throughout our body is lowered tremendously.\n\nThis means that our minds can calm down and think without stress. The next time you are with your partner, give them the biggest hug you can summon!\n\nWhen you hug somebody, you start to increase the production of serotonin in your brain that's the essential chemical that you need for a positive attitude. That also increases your self-esteem.\n\nSomething to keep in mind when thinking about those who are lonely is that they're experiencing deficient levels of serotonin.\n\nWhen you hug somebody, the brain starts to release more serotonin and endorphin into your blood vessels, creating pleasure and expelling sorrow.\n\nHugging can cause your muscles to relax in the best ways you can imagine. When receiving a hug, our muscles start to release tension all over the body. Seriously, why not hug each other more often?", "opengraph": {"url": "https://www.thinkinghumanity.com/2019/01/5-reasons-why-hugging-is-the-best-form-of-communication.html", "title": "5 Reasons Why Hugging Is The Best Form Of Communication", "description": "Hugging is among the most amazing things we could ever give another person. Hugging is a form of therapy in itself.", "image": "https://4.bp.blogspot.com/-eKjm8sGlg3A/W_G2Q8LB2_I/AAAAAAAAqss/pAjsLosixRgyQud0jVskPqjlTselWzDMgCLcBGAs/s1600/5%2BReasons%2BWhy%2BHugging%2BIs%2BThe%2BBest%2BForm%2BOf%2BCommunication.png", "article:author": "https://www.facebook.com/ThinkingHumanity", "type": "article", "site_name": "Thinking Humanity"}, "tags": ["Inspiring Stories", "Relationships"], "tweets": [], "movies": [], "links": ["https://www.higherperspectives.com/hugging-communication-2618570100.html"], "authors": ["Katerina P."], "publish_date": null}