{"result_id": "313034", "URL": "https://thoughtcatalog.com/alex-alexander/2015/02/you-want-me-to-vaccinate-my-child-just-so-yours-can-be-safe-i-dont-think-so/", "timestamp": "2023-04-25 17:40:16 CEST+0200", "meta": {"description": "The fact that his vaccination status is putting other children at risk is not my problem.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/alex-alexander/2015/02/you-want-me-to-vaccinate-my-child-just-so-yours-can-be-safe-i-dont-think-so/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "You Want Me To Vaccinate My Child Just So Yours Can Be Safe? I Don’t Think So.", "cleaned_text": "My son is not fully vaccinated.\n\nBecause he is not fully vaccinated he runs the risk of catching the measles and passing it onto someone more susceptible to him such as infants and children with medical conditions that prevent them from being vaccinated.\n\nThe fact that his vaccination status is putting other children at risk is not my problem.\n\nI know, I must be a complete bitch right? I must not care about small children and innocent lives. I must not care that some children could get sick and have serious complications because of the choices I’ve made for my child.\n\nExcept that I do care. I care deeply about my child and that’s why I’ve chosen not to fully vaccinate him.\n\nI’m not naive to the consequences of my actions and I know the risks I’m taking. I’m not without a medical background, I’ve read the studies and done the research, and while I don’t actually believe the MMR vaccine causes autism, I still don’t believe it’s safe. I don’t need someone to point out the research or tell me the facts. I’ve made my decision and I’m sticking with it because I do believe that the risks of vaccinating him are worse than the risks of not vaccinating him.\n\nI’ve been following the news as measles has made its reappearance into the US. While I truly am worried for those more susceptible to complications from illnesses, I don’t appreciate being told that it’s my responsibility to keep your child safe.\n\nI also don’t appreciate being told that I’m supposed to set aside what I believe is in the best interest of my child in an effort to help you do what you feel is the most important for yours.\n\nIn short: I don’t appreciate being told your kids are more important than mine.\n\n“Ban anti-vaxxers from school!” you yell. “Fire them from their jobs!” you chant. “Do what you have to do to vaccinate those heathens because my child’s health is at risk!”\n\nAgain, while I sympathize with your situation, I am not okay with you protesting my parenting decisions. If your child is so unsafe around my child, then maybe you should keep them away from mine. Why is your child’s health more important than mine? Why should mine be banned and holed up somewhere away from society just so that yours isn’t at risk? Why am I expected to do something that I feel endangers my child just to allow them the same freedoms that you so desperately feel your child is entitled to?\n\nSay, for example, I was taking a walk with your son and my son – two rambunctious toddlers who need to be managed with the same care and attentiveness – and I needed to cross a busy street with them. Would you expect me to carry your child across the street and once he was safely with me on the other side, simply motion for mine to cross alone and hope that he runs fast?\n\nOf course not, because that’s ridiculous.\n\nI would stop, assess the situation, and then attempt to come up with a plan that was in the best interest of both children because as much as you don’t want to believe it, I actually do care about your child and I really don’t want anything bad to happen to them.\n\nThe vaccination situation is like the “peanut-free” accommodation, only more serious.\n\nI want nothing more than to keep your allergic child safe and free from harm and thankfully, most peanut-allergy kids have been able to co-exist and adapt in society with kids without allergies. We now have peanut-free classrooms, peanut-free flights, and in more extreme cases, we ban peanuts altogether. While it can be an inconveince, I have absolutely no issue with banning peanuts from school because I want to help keep others safe. But if you were to then tell me that kids can freely bring in another type of food to school, a food that my child happened to be allergic to, I’d have an issue with that.\n\nWhy? Because as a parent it’s my job to advocate for my child. If what I feel is right for him unfortunately crosses paths with what you feel is right for your child, so sorry. But as his mother, I put my child’s health before your child’s and in no way does that mean I’m a horrible person.\n\nWhy can’t we find a way to make this work for both of us?\n\nIf we have accommodations for allergies than why can’t we have accommodations for vaccinations? While it may require a little more effort it’s not unreasonable to think that we can’t all co-exist together. Us anti-vaxxers aren’t an unreasonable group; we just don’t appreciate being told that your children are more important than ours. We don’t appreciate you forcing your medical beliefs upon us and calling us irresponsible parents if we disagree with you. Instead of fighting against each other, why can’t we fight for each other?\n\nBecause I’ll say it again: I do care about your children and in turn, I hope that you care about mine. If the vaccination population extended the same courtesy to the anti-vaxxers that they demand for themselves, we might truly be able to actually put the health of all of our children first.\n\nFind more must-read sex and dating tips!\n\n Follow Her Catalog on Facebook today.", "opengraph": {"type": "article", "title": "You Want Me To Vaccinate My Child Just So Yours Can Be Safe? I Don’t Think So.", "url": "https://thoughtcatalog.com/alex-alexander/2015/02/you-want-me-to-vaccinate-my-child-just-so-yours-can-be-safe-i-dont-think-so/", "description": "The fact that his vaccination status is putting other children at risk is not my problem.", "article:published_time": "2015-02-20T17:51:45+00:00", "article:modified_time": "2015-02-20T17:51:45+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/02/3877757097_eda2822a8c_o.jpg?w=1200&h=768&crop=1", "image:width": "1200", "image:height": "768", "locale": "en_US"}, "tags": ["Health & Wellness", "Writing & Expression", "Anti-Vaccination", "Controversial", "Children", "Vaccination"], "tweets": [], "movies": [], "links": ["http://www.yourtango.com/ive-got-a-big-problem-with-the-food-you-serve-your-kids#.VK6ocEuNARY", "https://www.facebook.com/hercatalog", "http://www.yourtango.com/2015250349/dear-moms-stop-complaining-you-chose-to-have-kids-remember", "http://thoughtcatalog.com/leslie-bennetts/2015/02/i-married-the-person-i-knew-wasnt-my-type/", "http://www.yourtango.com/2015257060/course-its-your-responsibility-vaccinate-your-kids", "http://tcat.tc/1F2hOOn", "http://www.yourtango.com/no-its-not-my-job-to-vaccinate-my-kid-just-to-keep-yours-safe", "http://yourtango.com"], "authors": [], "publish_date": "2015-02-20T17:51:45+00:00"}