{"result_id": "313037", "URL": "https://thoughtcatalog.com/daniel-hayes/2015/06/behold-rand-paul-unlikely-hero-of-the-republic/", "timestamp": "2023-04-25 17:40:19 CEST+0200", "meta": {"description": "For all those complaining that Paul's just grandstanding because he's running for President? So what? For today the man is…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/daniel-hayes/2015/06/behold-rand-paul-unlikely-hero-of-the-republic/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Behold, Rand Paul, Unlikely Hero Of The Republic", "cleaned_text": "How absolutely odd that today I would find myself thinking “good one, old chap” about, of all people, Rand Paul. This is the junior Senator from Kentucky I’m talking about here. A man whose resume includes “works on eyes” and “gives validity to the vaccine/autism connection.” Sure, he’s a known Libertarian Republican and he’s the son of Texas icon, Ron Paul, but today he’s moved beyond all this into “give me my Mr. Smith Goes To Washington moment” hero territory.\n\nI’m talking about the Patriot Act, a law written in the heady days immediately after 9/11 when there was a threat behind every tree and we absolutely had to stop everything by controlling everything. As Edward Snowden would show us years later, what we’d actually given away was the right for the government to collect every bit of our technological lives that exists and save it away in a drawer for later searching once a rubber stamp secret court had been given a feeble reason to open that drawer.\n\nOkay, But What Happened\n\nToday Rand Paul derailed an attempt by Congress to replace powers in the old Patriot Act with the supposedly better sounding bill called the USA Freedom Act. Both of these names are so painfully jingoistic that even combining and expanding them into the “Patriot’s USA Freedom Act Of Native Born U.S. Citizens Who Love God” doesn’t make them one iota more “murica.” In derailing the USA Freedom Act, he caused parts of the Patriot Act which required renewal this year to lapse. This is to say that the NSA’s bulk metadata collection program has been shut down as of 7:44pm last night. It has stopped.\n\nThis only seems right if for no other reason than it was never actually legally authorized by Congress or any President at all and the government’s just been doing it anyway. Even funnier in an “our government is totally dysfunctional” kind of way is that the constitutionality of the program wasn’t even addressed by a court where it was recently challenged because in order for that to happen you first have to have a law passed by Congress and the President. Here’s what the Second Circuit Judge Gerard Lynch said.\n\n“Because we conclude that the challenged program was not authorized by the statute on which the government bases its claim of legal authority, we need not and do not reach these weighty constitutional issues.”\n\nTranslation: This is completely illegal. Which means that two Presidents have been using an authority they didn’t have in order to collect information they had no right to control for over a decade. But don’t worry, they only did it because they care about you and our American way of life. Spare the rod, spoil the child after all.\n\nPolitico reports that all the right people are now angry with Mr. Paul (mostly Republicans) and claiming that he’s endangered national security by causing the above Patriot Act provision to lapse but the USA Freedom Act proposed isn’t really any better for the American people’s privacy. Here’s the difference between the Patriot Act’s authorities on the matter and the USA Freedom Act’s:\n\n“Under the bill, the United States would no longer be allowed to keep a massive database of call data. Instead, the data would remain with service providers and the government can seek court orders for specific records. …”\n\nSounds good, right? It’s not really different. This is basically just reordering how the government would get the data. It doesn’t keep the government from continuing to make enormous blanket requests at lightspeed, having the FISA court sign off on them, and then give the NSA possession of the exact same data they were previously getting from service providers anyway.\n\nThis just amounts to the NSA searching Verizon’s records on their system rather than searching records on their own system. Think of it this way. You’d have an NSA office with NSA systems and then a bunch of terminals for logging into Verizon’s databases right on site. I fail to see how this changes things. Logistically, it sounds like the NSA will just end up plugged straight into Verizon and AT&T’s databases rather than copying it as they’ve been doing.\n\nIt’s basically just asking to borrow someone’s computer when you know they have to say yes.\n\nWhat Happens Now?\n\nWell, the Senate will likely pick the USA Freedom Act up again mid-week and if they make amendments to it then it will have to go back to the House for approval. Something will get passed here but for today Senator Paul has forced a broader discussion about limiting the power of the U.S. government to invade the lives of it’s citizens even when we don’t notice that invasion and that is unequivocally a good thing.\n\nFor all those complaining that Paul’s just grandstanding because he’s running for President? So what? For today the man is a champion of the concerns of Americans and nothing else matters.\n\nLike this piece? Get more awesome stuff and great writing by liking TC Zine here", "opengraph": {"type": "article", "title": "Behold, Rand Paul, Unlikely Hero Of The Republic", "url": "https://thoughtcatalog.com/daniel-hayes/2015/06/behold-rand-paul-unlikely-hero-of-the-republic/", "description": "For all those complaining that Paul’s just grandstanding because he’s running for President? So what? For today the man is a champion of the concerns of Americans and nothing else matte…", "article:published_time": "2015-06-01T18:45:35+00:00", "article:modified_time": "2015-06-01T20:37:05+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/06/screen-shot-2015-06-01-at-2-35-37-pm.png?w=1276&h=704&crop=1", "image:width": "1276", "image:height": "704", "locale": "en_US", "article:author": "https://www.facebook.com/danielhayestc"}, "tags": ["News", "Current Events", "Privacy", "The Digital Age", "Writing & Expression", "Culture", "The Internet", "Congress"], "tweets": [], "movies": [], "links": ["http://en.wikipedia.org/wiki/Patriot_Act", "http://www.imdb.com/title/tt4044364/", "http://www.cnn.com/2015/05/30/politics/what-happens-if-the-patriot-act-provisions-expire/index.html", "http://www.theatlantic.com/politics/archive/2015/05/does-the-patriot-act-allow-bulk-surveillance/392651/", "http://www.theatlantic.com/politics/archive/2015/05/does-the-patriot-act-allow-bulk-surveillance/392651/", "http://www.politico.com/story/2015/05/gop-senators-tear-into-paul-118475.html?hp=t2_r", "http://www.npr.org/sections/thetwo-way/2015/05/31/411044789/live-blog-facing-midnight-deadline-the-senate-debates-parts-of-the-patriot-act", "http://www.gallup.com/poll/5263/civil-liberties.aspx", "https://www.facebook.com/thoughtcatalogzine"], "authors": [], "publish_date": "2015-06-01T18:45:35+00:00"}