{"result_id": "313022", "URL": "https://thoughtcatalog.com/katja-bart/2019/06/an-open-letter-to-jessica-biel-please-stop/", "timestamp": "2023-04-25 17:40:06 CEST+0200", "meta": {"description": "Intentions don't mean anything. Consequences do.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/katja-bart/2019/06/an-open-letter-to-jessica-biel-please-stop/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "An Open Letter To Jessica Biel: Please Stop", "cleaned_text": "You know, the one where you state you are not against vaccines, and that you just want to give parents the opportunity to make educated decisions alongside their doctors. Props to you for standing up for your friends and their child – I’m sure you came with the best of intentions.\n\nSo far in 2019, the USA has seen 1022 confirmed cases of measles across multiple states. For reference, the total number of cases recorded in 2010 was 63. We are not even halfway through the year and we are seeing a deadly disease grow at rates most companies would kill for.\n\nYou know why? Because celebrities like you keep lending their voices to anti-vaxxers and then, when they inevitably get called out, they call foul. We misunderstood – by posing for a photo with this guy you were merely acknowledging physical proximity, you weren’t saying you shared his views.\n\nYou live in the public eye, Jessica. You know this game – if it came out that Revlon was cutting down rainforests to make room for their factories, you would think twice before advertising their mascaras. If it came out that Gaiam used child labor in their workshops, you wouldn’t be posing in their leggings all over social media. Intentions don’t mean anything. Consequences do.\n\nAs for those educated choices, ask any doctor whether they would treat their own child and most of them would probably shudder at the thought. Not only is that a massive violation of medical ethics, it’s terrifying because the consequences, if you are wrong, are not ones you can live with. If someone with 10+ years of medical education and training would hesitate before treating their own child, what the fuck makes you think parents who spent 30 minutes googling “mercury in vaccines” are more qualified to contribute equally to the discussion?\n\nLook, I get it – medicine is scary. No one wants to take their kid to the hospital and be told that they can’t help, they can’t intervene, and they have to let the professionals work. But nobody’s taking informed consent away from parents. Nobody is denying access to some miracle cure because they didn’t ask for it. Nobody is excluding the parents from the decision-making process. The goal of doctors is to help a patient be better, to live a full life. That is and always has been the bottom line.\n\nWhich brings us, as it always does, to the things at the heart of the anti-vaccine movement: privilege and ableism. Vaccine hesitancy isn’t a big deal to the affluent, who can afford a private hospital and emergency procedures, just in case they are wrong. The rich and powerful will always have a way to make sure their kids are protected, even if skipping a vaccine means a few weeks with a rash-like illness.\n\nBut it will kill those who are poor. The immuno-compromised. The parents whose medical insurance just doesn’t cut it. The adults whose unique medical conditions mean they are unprotected. The elderly who couldn’t save enough for retirement, let alone protracted hospital stays. The anti-vaccine movement benefits no-one but the rich and powerful.\n\nAnd what is it rooted in? What started it all? Fear of autism. Treating people who are neurodivergent as something that needs to be eradicated. Anti-vaxxers would rather have a dead baby than an autistic one, and to achieve that goal, they are willing to let the world burn around them.\n\nThese are the people you’re getting in bed with, Jessica.\n\nAre you sure you want to go there?", "opengraph": {"type": "article", "title": "An Open Letter To Jessica Biel: Please Stop", "url": "https://thoughtcatalog.com/katja-bart/2019/06/an-open-letter-to-jessica-biel-please-stop/", "description": "Intentions don’t mean anything. Consequences do.", "article:published_time": "2019-06-20T05:04:13+00:00", "article:modified_time": "2019-06-21T17:57:19+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2019/06/41052387_210426096324664_2831580492962356406_n.jpg?w=1080&h=768&crop=1", "image:width": "1080", "image:height": "768", "image:alt": "An Open Letter To Jessica Biel: Please Stop", "locale": "en_US"}, "tags": ["Medicine", "Anti-Vaxxers", "Celebrities", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/p/BypmonrBzwS/", "https://www.cdc.gov/measles/cases-outbreaks.html", "https://www.politico.com/magazine/story/2019/05/08/robert-kennedy-jr-measles-vaccines-226798"], "authors": [], "publish_date": "2019-06-20T05:04:13+00:00"}