{"result_id": "313008", "URL": "https://thoughtcatalog.com/emily-madriga/2020/03/coronavirus-pickup-lines/", "timestamp": "2023-04-25 17:39:56 CEST+0200", "meta": {"description": "If the Coronavirus doesn’t take you out, can I?", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/emily-madriga/2020/03/coronavirus-pickup-lines/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "28 Coronavirus Pickup Lines You Can Use On Tinder", "cleaned_text": "Coronavirus is taking over the world but people are still on dating apps. If we’re all this thing together, it means we can keep talking and bringing joy to others as we self-quarantine. Please use these pickup lines to wow the woman or man of your choosing and continue to have a whirlwind pen pal romance while you are practicing social distancing.\n\nThe Coronavirus might have shut everything down, but I’m still open for business.\n\nYou’re the only snacc I wanna stock up on!\n\nSo, Skype or Google Hangouts for the first date?\n\nKnock knock\n\n Who’s there?\n\n Orange\n\n Orange who?\n\n Orange you going to ask me to self-isolate with you?\n\nDo you want to be my date to the end of the world?\n\nI heard we’re supposed to order in to support local businesses. Your place or mine?\n\nI’ve got plenty of food and TP — want to bunker down with me?\n\nHow are you feeling? I make a great nurse 😈\n\nWant to watch ‘Contagion’ together? I heard it’s a good way to exercise our fears.\n\nI bet you’d look beautiful even with a face mask on.\n\nYou look like you’d make a sexy nurse.\n\n*cough cough* I think I’ve got the black lung pop.\n\nIf you need someone to self-isolate with I make a mean Quarantini.\n\nThe whole world might be getting sick but I’ll never get sick of looking at you.\n\nMy admiration of you could never be quarantined.\n\nI’m here and you don’t have to leave your house. What’s your third wish?\n\nIf the Coronavirus doesn’t take you out, can I?\n\nThe only thing not quarantined is my heart when I look at you.\n\nWow, you’re so beautiful I wish we could be in quarantine together!\n\nAre you Joe Goldberg? Because I’d like to go in the box now.\n\nDo the coronavirus give you a temperature? Because you’re hot!\n\nI’m not sure if I’m blinded by your beauty or if that’s another side effect of Covid-19.\n\nI think you’re the cure I’ve been searching for.\n\nYou look like the type of medicine I need.\n\nThe only thing I’m infected by is attraction to you.\n\nDo you know CPR? Because you take my breath away!", "opengraph": {"type": "article", "title": "28 Coronavirus Pickup Lines You Can Use On Tinder", "url": "https://thoughtcatalog.com/emily-madriga/2020/03/coronavirus-pickup-lines/", "description": "If the Coronavirus doesn’t take you out, can I?", "article:published_time": "2020-03-16T18:41:29+00:00", "article:modified_time": "2020-10-12T16:56:43+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2020/03/25023079181_8550b734c4_h.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US", "article:author": "https://www.facebook.com/theemilymadriga"}, "tags": ["Coronavirus pickup lines", "Corona pickup lines", "Tinder", "Coronavirus", "Covid-19 pickup lines", "COVID-19"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2020-03-16T18:41:29+00:00"}