{"result_id": "313006", "URL": "https://thoughtcatalog.com/january-nelson/2018/06/blue-waffle/", "timestamp": "2023-04-25 17:39:54 CEST+0200", "meta": {"description": "It started with itching. I felt my hand migrating into my jeans whenever I was driving or drawing out documents…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/january-nelson/2018/06/blue-waffle/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "I’m Ready To Tell The Story Of My Disturbing Diagnosis With ‘Blue Waffle’", "cleaned_text": "Blue Waffle is a vaginal abnormality that occurs after being exposed to a sexually transmitted disease. It turns the area a blue-green color and resembles a waffle since it is disfigured in shape.\n\nIt’s not a nasty nickname. It’s said with love.\n\nThey might tsk-tsk when they see the number of matches currently sexting me across Tinder, but when we are three mimosas deep at brunch, they practically beg to hear about my quickie-in-the-bar-bathroom, cum-on-the-chest hookup stories.\n\nThey loved the one about the hipster bartender who bent me over the billiards table while I bit down on the pool cue to keep from screaming. And the forty-year-old French professor who ate me out in between the stacks in the library while moaning in his syrup thick accent.\n\nSo, yeah, I might be a whore, but I’m a careful whore. A whore on birth control. A whore who visits the gynecologist twice a year and stocks up on condoms in case my one-night-stand of the week isn’t the kind to stuff them in his wallet.\n\nI prefer beer bellies to baby bellies. Becoming a mother isn’t in my overall plan and I’m not interested in adding herpes pills to my medicine cabinet. I’ve had urinary tract infections two or three times, but they cleared up after a few days with antibiotics. No big deal.\n\nWith how careful I am, I have no idea how I ended up with vaginitarius — or what the internet so eloquently calls blue waffle.\n\nIt started with itching. I felt my hand migrating into my jeans whenever I was driving or drawing out documents at work, but I stopped myself each time to avoid looking like a slob.\n\nMy first instinct was to get a wax. The hair hadn’t grown too much down there since it had been ripped out the last time, but if I was itching like a motherfucker, I must have needed it removed. I booked an appointment and got a brazilian along with anal bleaching that afternoon.\n\nThe itching only got worse, though. Alone in bed that night, I gave into temptation and itched so hard that skin got stuck under my fingernails. I even left a little blood behind.\n\nNeeding some sort of relief, I stripped off my silken pajamas and soaked myself inside of a hot bath. It felt good. So good I stayed in there for over an hour with a copy of The Handmaid’s Tale.\n\nI had almost reached the final page when I decided I better get to bed. When I stood up to towel myself off, I noticed how crinkled my skin looked down there. The flesh had bunched together into thick lines like an old lady’s forehead.\n\nI shrugged it off, assuming I had been in the bath too long since my fingertips had also turned to prunes, but the next morning, it was still wrinkled. Even more unsettling, the flesh had taken on a light greenish tint.\n\nWith several hours until my gyno opened, I scoured WebMD, searching for an explanation. I found none. Vaginitis didn’t describe what I was going through. Neither did herpes or chlamydia or AIDs. I had no idea what was happening to me.\n\nWhen nine o’clock ticked onto the clock, I made two phone calls. One for an emergency appointment and one to cancel my date that night. No way I was having sex while looking like I emerged from a swamp with seaweed dangling between my legs.\n\nUnfortunately, the situation didn’t lessen my libido. I was still horny and without a hookup scheduled, I decided to masturbate.\n\nIt hurt like hell. I had to tug my dildo out seconds after inserting it. I couldn’t even touch my clitoris with my fingertips. Every movement stung like I had poured lemon juice into a wound.\n\nWhen I tried getting dressed, I realized I couldn’t even wear my skinny jeans. The fabric hurt when it rubbed up against my vagina. I had to wear oversized running shorts that an ex had left over years earlier.\n\nUnfortunately, my gyno appointment wasn’t until late afternoon so I filled the empty space with a nap. I had to tape mittens onto my hands like I had the fucking chickenpox to keep myself from scratching in my sleep.\n\nWhen my alarm woke me, I forced myself to lift the band of my shorts and look inside. The light green tint had turned into an alarming blue. Not light blue like the way hand soap or shaving cream looks in certain lighting. Bright blue. Obnoxious blue. It started at the lips of my vagina and extended deep into my pussy. I peeled the folds open to check and almost vomited at the sight.\n\nWhen I finally made it to my gyno, she solved the problem right away. She diagnosed me with blue waffle. She couldn’t tell me how I had gotten it since it stays dormant in certain men who appear symptom-free to the blind eye, but she said it was easily transmitted and there wasn’t a known cure or even a treatment plan to reduce the symptoms.\n\nThat meant my vagina was going to stay like that for the rest of my goddamn life. That meant I wasn’t going to be having sex anytime soon, not even with myself. That meant another woman in this world was screwed out of getting her orgasm.\n\nWhat is the blue waffle disease?\n\nThe blue waffle disease is sometimes referred to as “blue waffle” or “waffle std” or “waffle disease” is a fake disease/infection of lesions and bruising on the outside of the vagina, which is why it looks blue.\n\nWhy is it called “blue waffle”?\n\nApparently, a ‘waffle’ is a slang term for a vagina and a ‘blue waffle’ is a slang term for a severe vaginal infection.\n\nNo, the blue waffle disease is an internet hoax.\n\nBack in 2010, a photo of a “scabbed, blue-tinted labia” started circulating around the internet with the claim attached that it was an infection/disease known as “blue waffle.”\n\nAlthough, just because blue waffle isn’t real doesn’t mean that other STDs that might be similar to the waffle disease don’t exist. There are diseases and infections that you should be aware of. Here are some of the most common questions being asked about STDs, where they can be located on men and women, and the symptoms:\n\nWhat is an STD\n\nAn STD is a sexually transmitted disease that can be passed from one person to another through sexual activity. An STD can also be referred to as an STI, or a sexually transmitted infection.\n\nWhat are the most common STDs you can get if you’re sexually active?\n\nIf you’re not having safe sex, then there are a number of sexually transmitted diseases or infections you can get. Chlamydia and Gonorrhea are two of the most common STDs among men and women. Here are some of the diseases you can get:\n\nChlamydia is the most commonly reported STD. It can appear in both men and women, and fortunately, can be cured with the right treatments. The symptoms in women are a burning sensation while peeing, abnormal vaginal discharge (or smelly discharge), pain during sex, and bleeding between periods. The symptoms in men are pus from the penis and swollen/tender testicles.\n\nGonorrhea is an infection in the genitals, rectum, and throat that anyone who is sexually active can get. Both men and women are at risk of getting infected with this disease if they have unprotected vaginal, anal, or oral sex. The symptoms are similar to those of Chlamydia.\n\nThere are two main types of herpes: genital herpes and oral herpes. Genital herpes is an STD caused by 2 types of a virus: the Harpes Simplex Virus (HSV 1 and HSV 2). Herpes is most common in the United States. Oral herpes is caused by HSV 1 and can result in cold sores around the mouth.\n\nHPV is the most common sexually transmitted infection (STI) that can be spread through vaginal or anal sex. High-risk types could lead to cancer, and low-risk types can cause warts on the vulva, vagina, cervix, rectum, anus, penis, or scrotum. To lower your chances of getting this disease, get vaccinated. If you’re sexually active, use condoms.\n\nGenital warts are a kind of HPV on the external genitalia. Thankfully, they are more annoying than painful and are in fact treatable.\n\nA vaginal yeast infection happens when the healthy yeast that normally lives in a woman’s vulva/vagina grows out of control. The symptoms are itching, burning, redness in the vagina, thick, white, clumpy vaginal discharge that usually doesn’t smell, and possibly a creamy coating around the vagina area. The longer you have this infection, the worse the symptoms get: sex can become uncomfortable, and in some cases, you can get fissures (a bacterial growth) or sores on your vagina or vulva. If you get sores in your vulva, it might sting when you pee. This infection is not an STD.\n\nI’m a woman. Can I get a disease in my vulva?\n\nYes, you can. The most common is Vulvovaginitis, an infection of the vulva and vagina. This can affect the vaginal area for both women and girls. The most common causes are yeast, a virus, and STIs, like some of the diseases mentioned above (Gonorrhea, Chlamydia, and Herpes).\n\nWhat can put me at risk for a disease or infection?\n\nYou could be at risk for any of the diseases mentioned above if you have anal, vaginal, or oral sex without a condom and having multiple and/or anonymous sex partners.\n\nAgain, the blue waffle STD is a myth! There is no such thing as “blue waffle disease” and the story written about blue waffle is fiction.\n\nIf you feel as if you might have an STD or you just want to know more about them in general, talk to a healthcare provider or OBGYN (obstetrics-gynecology) about your sexual health. For more references or information, visit Planned Parenthood or the Women’s Health Foundation.", "opengraph": {"type": "article", "title": "I’m Ready To Tell The Story Of My Disturbing Diagnosis With ‘Blue Waffle’", "url": "https://thoughtcatalog.com/january-nelson/2018/06/blue-waffle/", "description": "It started with itching. I felt my hand migrating into my jeans whenever I was driving or drawing out documents at work.", "article:published_time": "2018-06-04T20:10:30+00:00", "article:modified_time": "2021-04-29T16:05:51+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2018/06/blue-waffle-e1527870730500.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "image:alt": "blue waffle", "locale": "en_US"}, "tags": ["short story", "STD", "Blue Waffle", "Gross", "STDs"], "tweets": [], "movies": [], "links": ["https://thoughtcatalog.com/lorenzo-jensen-iii/2015/01/45-people-on-the-2-words-you-should-never-search-together-on-google-images/", "https://www.plannedparenthood.org/learn/teens/ask-experts/whats-blue-waffle", "https://thoughtcatalog.com/andrea-fecik/2013/09/will-you-celebrate-with-us-are-you-coming-alone/", "https://www.plannedparenthood.org/", "https://whfuganda.org/"], "authors": [], "publish_date": "2018-06-04T20:10:30+00:00"}