{"result_id": "313027", "URL": "https://thoughtcatalog.com/stephani-bakus/2020/12/will-we-ever-be-normal-again/", "timestamp": "2023-04-25 17:40:10 CEST+0200", "meta": {"description": "The coronavirus pandemic has everyone now questioning what it means to be normal, or to return to normal.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/stephani-bakus/2020/12/will-we-ever-be-normal-again/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Will We Ever Be Normal Again?", "cleaned_text": "I was scrolling through my old photos the other day, sipping some wine and watching a Netflix show I have finished twice already since March. I was wearing sweatpants, hair tied, chilling with no makeup on (thanks, Drake), and realized in that moment that I hadn’t taken a moment since the onset of this invisible hell to really think of what “normal” ever really meant, or what it could mean going forward.\n\nIf you, reader, were anything like me, your old normal was probably a lot like every other 20-something living in a major metropolitan city: trying to piece together the mosaics of a very complicated career-launch process with a glass of Barefoot Merlot in hand. In days since passed, we’d meet friends after class or work on a Friday, get a drink, and then haphazardly meander to venue after venue, gabbing with coworkers or friends until the sun came up. We’d swipe on a red lip, grab our bags, and head out the door at the beginning of the night with a pair of sensible flats in tow, just in case our feet started hurting. We’d hug and kiss friends hello and goodbye; we’d occasionally share a drink with a buddy, saying, “Oh, this is so good!” and then think nothing of it. A cold could come out of a night out, not a disease that could quite literally spread to everyone you’ve ever known or held close to your heart. Young people looked forward to leaving work, making plans, and keeping them. We’d think nothing of going into a club packed with sweaty, lively people who were trying to make the most memories they could before their lives took them to the next inevitable surprise. We’d blindly accept dates, go on them, and walk or Uber home with optimism in our hearts for the next time we’d see the person, because, after all, it was never an “if”, it was a “when” we’d see them again. But now? Not so much.\n\nNow, hanging up a Zoom call on a Friday night is something we look forward to with half-optimism, half-pangs of worry in our hearts. Will this be the last time I’ll see this person again? we ask ourselves as we hang up the phone in our empty apartments, looking around for remnants of our old lives we can maybe piece together to make ourselves feel okay. Could they have the virus and not even know it? Will I ever see this person smile in real life again? Will I ever smile in real life again? Now, leaving a date with someone that you went on a socially-distant walk with is something that makes one nervous. What if this person doesn’t make it? What if they catch this virus? What if the masks didn’t work? Now everything is an “if”; no “when” is guaranteed.\n\nThe coronavirus pandemic has everyone now questioning what it means to be normal, or to return to normal. The idea that a vaccine could be near is now not just a dream but a very real possibility. Pfizer and Moderna appear to have very real prospects of a vaccine that could liberate us from this hell we’ve endured for nearly a year. However, what will that liberation be like?\n\nFor many, especially those like me who live in a large, urban city, we’ve seen the destruction this pandemic has had on businesses. Some of my favorite haunts are now long gone, with signs in windows that read, “Thank you, we’ve had a great run! Hopefully, we’ll dance again.” Walking down the old, lively strips of downtown Chicago is simply not the same walk it once was when people were blissfully and wonderfully naive, when life was simple and the biggest worry we had was if our latest date was going to call us. How do we get back to that? How do we return to a normal that is now something that has been ingrained in us is dangerous? In nine months, we have willingly accepted this new normal as our future: we have accepted it, implemented it, and rolled over for it to take over what little we have left for it to take. It’s disturbing how easily we are conditioned to accept things as they are and think, “Alright, this is it.” For many, things haven’t changed. But for the responsible, they have.\n\nI haven’t seen a friend without first both getting COVID tested since the outbreak of this pandemic. I’ve gone on socially distanced dates, sure, or dates where we both got tested and quarantined, but how normal is that? I don’t think any of us truly realize how much we miss (and crave) the old normalcy until we fully sit back, get present, and look through old photographs of how truly lovely and colorful life used to be, even with its setbacks and letdowns. Will we ever have normal moments again? Will we ever bask under the cascading light-show of nightclub displays without having to get our temperatures checked? Will we ever truly look at humans as humans again, not just as carriers of something that could kill us? I hope so. I’m optimistic. But I think normal moments will be different. Caps on birthday party attendance limits may be the new thing, and everyday mourning for the people we have lost to this virus may just be the beginning of a very long road.\n\nI hope one day we can dance again, we can laugh again, and we can schedule a happy hour without first having to ask, “What was your temperature last night? Has your roommate gone out?” I hope one day we can return to the blissful life that we once euphorically took for granted but now would give anything to relive. I hope that we all can look at what we once considered “normal” as a bewitching collection of moments fitted in between the normal 9-to-5 that are now memories we print out and put in a frame. I hope as we navigate what the word “normal” means in a post-COVID world, we remember that “normal” will never truly exist—it never did. No, reader, normal never existed—life did. And from that, we must rebuild.", "opengraph": {"type": "article", "title": "Will We Ever Be Normal Again?", "url": "https://thoughtcatalog.com/stephani-bakus/2020/12/will-we-ever-be-normal-again/", "description": "The coronavirus pandemic has everyone now questioning what it means to be normal, or to return to normal.", "article:published_time": "2020-12-10T21:45:19+00:00", "article:modified_time": "2021-05-23T20:35:54+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2020/12/fran-boloni-jskjkv4oc5q-unsplash.jpeg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "image:alt": "man in black jacket and blue denim jeans standing on gray concrete floor near eiffel tower", "locale": "en_US"}, "tags": ["Normal Life", "Covid", "Encouragement"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2020-12-10T21:45:19+00:00"}