{"result_id": "313020", "URL": "https://thoughtcatalog.com/david-dunning/2014/02/not-asking-questions-about-childhood-vaccinations-makes-you-an-irresponsible-parent/", "timestamp": "2023-04-25 17:40:05 CEST+0200", "meta": {"description": "The word “retarded” is defined as being less advanced in mental, physical, or social development than is usual for one's…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/david-dunning/2014/02/not-asking-questions-about-childhood-vaccinations-makes-you-an-irresponsible-parent/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Not Asking Questions About Childhood Vaccinations Makes You An Irresponsible Parent", "cleaned_text": "A lot of you do not like me after my latest article Congratulations, You’ve Vaccinated Your Child And Now They’re Retarded. To be honest, I understand why. I expected as much.\n\nThe word “retarded” is defined as being less advanced in mental, physical, or social development than is usual for one’s age. I used the term in an appropriate and applicable manner. If you took offense to this, it is because of the value that you have given the word yourself. That is not a callous rebuttal to an invalid concern; it was a factual and objective use of language. For such a progressive bunch, you sure are sensitive.\n\nWe as a society and culture are in a constant state of evolution. It does not take much looking around to realize the amazing amount of change and progress that we have made in the past few decades. It really is awe inspiring and a beautiful thing. What we fail to recognize is that while in the midst of the evolution, we cling to static ideas. The earth is flat. GMO foods are no different than organically grown foods. Fossil fuels are efficient. Smoking does not cause cancer. These are all very incorrect assumptions that we have collectively agreed with in the not too distant past.\n\nNow, of course, if I were traveling to a region of the world where a particular disease was prevalent, I would consider the benefits of vaccination against that disease. I am not arguing that vaccines don’t have a place in this world. Whether or not they need to contain known poisons is an entirely other issue. The question I am bringing forward is simply do we need to be inundating our children with such a staggering number of inoculations in the presence of an equally staggering rise in neurodevelopmental disabilities?\n\nThe world that we live in is indeed more polluted. There are more cars. There is more garbage. There are more industrial emissions. There is more hazardous material being used in industry. There are more radio frequency waves in the air. We are exposed to record levels of toxins in every sense of the word. True, by themselves these elements may not be a concern. However, it is necessary to step back and look at the entire picture as a whole. For example, if one dog pisses in my front yard I get one yellow spot of grass; water it, and no big deal. If 300 dogs piss in my front yard the entire thing dies.\n\nIt is fact, that many families and children have been affected adversely by the childhood vaccination schedule and some of the ingredients used. Luckily, our hands are not tied. It is time to evolve. Lets look at different carrying agents, less aggressive schedules, and real environmental risk assessment. You’re right, there are people much better equipped to answer and deal with these issues than I am. The problem is, is that they are not the ones who are currently in charge.\n\nLet’s bring the thinkers forward. Lets put human interest at the forefront of the matter rather than profit margin. Lets act like we give a damn and have the backbone to carry us forward into the future, rather than clinging to whatever ideas makes us feel the safest and least threatened.\n\nFear expresses itself in many forms. I experience fear just as you do, and it is a critical emotion. It pushes us forward. What we have here is the fear of maybe not having it all figured out. Maybe we’ve gone a little too far. Maybe we haven’t gone far enough. This fear has manifested itself in anger and frustration during this discussion. I get it.\n\nLets channel this frustration towards a positive solution. Lets start talking about these issues out in the open. We will inherit this world from the generations that have molded it up until this point. We will pass this world onto our children. I believe in us. I believe in our innate desire to make it better.\n\nIn my article I did not feel the need to convolute the ideas and issues with a list of websites and articles as reference. We should be able to first think for ourselves, and then use others perspective as reference points and guidance. However, it is a valid and legitimate request to know some of the sources that I used during my research.\n\nThis website from the U.S. Department of Health and Human Services outlines the National Vaccine Injury Act and the Vaccine Tax that I spoke of.\n\nThis website from the Center For Disease Control (CDC) is a comprehensive list of ingredients in all vaccines. I encourage you to research the individual ingredients.\n\nThis website from the CDC outlines the current childhood vaccination schedule.\n\nThe following websites, from the National Center for Biotechnology Information, and Science Daily outline research done to connect childhood vaccines and neuro developmental disabilities:\n\nThis website from the National Vaccine Information Center highlights the legislation that was passed in order to protect Vaccine Manufacturers from litigation:\n\nThere are thousands of more articles published in favor of both sides of the coin. I would ask that you begin by asking two simple questions. Why would vaccine manufacturers spend hundreds of millions of dollars lobbying politicians to pardon them from litigation and liability? Why has over $2 Billion dollars been awarded to families who have suffered greatly from damages and deaths caused by vaccines?\n\nI appreciate the feedback from my previous article. If nothing else it showed a great deal of emotion and conviction behind the issue. Believe it or not, I think the majority of you would enjoy having a drink with me, and I would love to continue to hear your feedback on the issue. Have a phenomenal day.\n\nLike this post? Check out David’s new Thought Catalog Book here.", "opengraph": {"type": "article", "title": "Not Asking Questions About Childhood Vaccinations Makes You An Irresponsible Parent", "url": "https://thoughtcatalog.com/david-dunning/2014/02/not-asking-questions-about-childhood-vaccinations-makes-you-an-irresponsible-parent/", "description": "The word “retarded” is defined as being less advanced in mental, physical, or social development than is usual for one’s age. I used the term in an appropriate and applicable manner.", "article:published_time": "2014-02-19T21:05:06+00:00", "article:modified_time": "2014-02-19T21:06:52+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2014/02/screen-shot-2014-02-19-at-4-06-22-pm.png?w=1359&h=435&crop=1", "image:width": "1359", "image:height": "435", "locale": "en_US"}, "tags": ["World", "Reply", "Health & Wellness", "Vaccinations", "Writing & Expression", "Essay", "Culture & Art"], "tweets": [], "movies": [], "links": ["http://thoughtcatalog.com/david-dunning/2014/02/congratulations-youve-vaccinated-your-child-and-now-theyre-retarded/", "www.hrsa.gov/vaccinecompensation/index.html", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "http://www.cdc.gov/vaccines/parents/downloads/parent-ver-sch-0-6yrs.pdf", "http://www.ncbi.nlm.nih.gov/pubmed/21058170", "http://www.ncbi.nlm.nih.gov/pubmed/21623535", "http://www.ncbi.nlm.nih.gov/pubmed/14745455", "http://sciencedaily.com/releases/2007/08/070813185007.htm", "http://www.nvic.org/nvic-vaccine-news/march-2011/no-pharma-liability--no-vaccine-mandates-.aspx", "http://read.ag/1jBTb2R", "http://read.ag/1jBTb2R"], "authors": [], "publish_date": "2014-02-19T21:05:06+00:00"}