{"result_id": "313038", "URL": "https://thoughtcatalog.com/ellie-hunja/2021/03/confronting-our-privilege-how-to-get-comfortable-with-feeling-uncomfortable/", "timestamp": "2023-04-25 17:40:20 CEST+0200", "meta": {"description": "There are entire systems counting on our blindness in our areas of privilege, whether in the categories of race, sex,…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/ellie-hunja/2021/03/confronting-our-privilege-how-to-get-comfortable-with-feeling-uncomfortable/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Confronting Our Privilege: How To Get Comfortable With Feeling Uncomfortable", "cleaned_text": "Last Sunday, my husband and I were on a Zoom call with friends, and the conversation drifted to how excited we were to be getting our vaccines. My husband had just gotten his, along with a few others on the call, and the rest of us were feeling hopeful about getting it soon.\n\nAfter listening patiently to our excited chatter, Hunja – if I can describe how I felt in the moment – rained on our parade. He spoke about his heartache at the horrific disparities in how the vaccines are being distributed globally. While every American will have the chance to be vaccinated by this summer, Kenya’s vaccine roll-out plan, by contrast, will take two years just to vaccinate 30% of the population. High-income countries like ours are currently hoarding enough doses to vaccinate our populations 2.5 times over, while our beloved family members in Kenya and elsewhere sit and wait, even as COVID numbers begin to climb again. To add insult to injury, we’re patting ourselves on the back for the COVAX redistribution plan, which barely puts a dent in those numbers; there won’t be enough vaccine doses to cover the world’s population until at least 2023.\n\nWay to burst our happy little bubble, right?\n\nBe honest with yourself for a moment: have headlines, conversation topics, or maybe a flood of social media posts about injustice ever made you feel like I felt – like someone’s raining on your parade? “Dang, I guess I can’t post this happy selfie now.” Or, “I mean, I get it… but why do we have to keep talking about it?”\n\nIf you can relate, you’re not alone. When Hunja was breaking down those stats, I don’t think I’ve ever been so close to literally biting my tongue in order to keep my gut reaction to myself. Everything inside of me wanted to blurt out, in a half-joking tone to lighten the mood, “Um, that’s important and everything, but can your own wife get her vaccine first before we talk about this?”\n\nMy privilege – in this case, my citizenship in this wealthy country – was being confronted head-on, and it hit a nerve. A bubble was being burst, but not to maliciously ruin my day. Instead, my perception of reality was being expanded, and the layers of comfort and protection that my privilege provides were being peeled back and exposed.\n\nIn the moment, that made me want to run and hide.\n\nThankfully, in a (rare) moment of restraint, I kept my initial reaction to myself. Instead, we lamented the situation together, and later on I sat and asked myself, Why did that moment feel so awkward?\n\nWell, I’ll state it very simply: Growth feels awkward. (Remember puberty, anyone?)\n\nSeriously, though. When we’re presented with a chance to grow – to remove a set of blinders and replace a singular way of thinking with a more nuanced perspective – it can be a cringey, nails-on-a-chalkboard kind of feeling. The way I see things feels like it’s being assaulted; suddenly, my heart’s beating faster and my cheeks are hot.\n\nStudies show that when we’re presented with information that challenges our current understanding, our brains react by “signaling threats to deeply held beliefs in the same way they might signal threats to physical safety.” This fight-or-flight reaction makes complete sense in the context of beliefs that are so deeply held, it feels as if a part of us is being attacked.\n\nBut what do deeply-held beliefs have to do with privilege? Well, think of it this way: privilege, by its nature, shields us from the adverse experiences of others, and thus blinds us to other ways of seeing the world. With those blinders on, our experiences become our deeply-held truth. For example, as an able-bodied person, accessibility issues rarely – if ever – pop into my mind while I’m out and about. Similarly, as someone with an American passport, I spend almost zero time considering the fact that many people can’t simply pop in and out of whatever countries they wish to visit. In these two examples, wherever I want to be is open and accessible to me. That is my truth. So that’s how it is for everyone, right?\n\nThere are entire systems counting on our blindness in our areas of privilege, whether in the categories of race, sex, income level, ability status, sexuality, gender expression, country of citizenship, or any number of other areas. We often don’t even know what we don’t know because we lack direct experience and exposure, and we haven’t chosen to seek it out. This ensures that the systems governing our lives will continue to benefit those of us in the privileged category, at the expense of others.\n\nSo back to my fight-or-flight moment.\n\nSomeone has introduced a perspective that threatens to take off my blinders, and my insides react like I’m in a war zone. But why?\n\nThat fight-or-flight urge can be rooted in many things, but a few that come to mind are:\n\nShame: If I’m potentially wrong about something big, I must be a bad person.\n\nEmbarrassment: If I’ve been wrong all this time and openly admit it, what will people think of me?\n\nFear of instability and need for security: There’s so much we don’t know. If something that I thought I knew for sure isn’t actually true, my world feels less dependable – and I feel less dependable.\n\nNo one likes those emotions. We all want to feel sure of ourselves, confident, on steady footing. But what if we reminded ourselves that those emotions aren’t final? That they’re simply a bridge to a new state of being where we’re walking in fuller awareness of the injustices around us and truer solidarity with those who’ve been marginalized? This quote by Jamie Gerdsen says it well: “The transition between what was comfortable and what will be comfortable is scary.” I love that. We won’t feel that sense of shame and instability forever. Yes, our ground has been shaken, but what awaits us on the other side of that discomfort will have been worth it.\n\nMy role as a neurotypical parent of an autistic child immediately comes to mind. Parents generally have a deep desire to feel competent in how we’re raising our children. But in my process of learning from autistic adults, I may hear things that challenge what I thought I knew. Because my love for my child is so deep, this can feel like an attack on my parenting, and therefore on me. But for the sake of my child, I can’t run and hide. If I want to truly love him well, I need to push through the discomfort to learn and grow.\n\nGrowth is possible when we lean into the discomfort and see where it leads.\n\nBut that requires real work – work that runs counter to our instincts, which compel us to preserve our privilege.\n\nIn a 1963 interview shortly after the 16th Street Baptist Church bombing, James Baldwin said, “It is ironical [that] the people who were slaves here, the most beaten and despised people here, should be the only hope this country has. It doesn’t have any other. None of the descendants of Europe seem to… have taken it on themselves to do what Negroes are now trying to do.… It probably has something to do with the nature of life itself. It forces you, in any extremity, any extreme, to discover what you really live by, whereas most Americans have been for so long so safe and so sleepy that they don’t any longer have any real sense of what they live by.”\n\nThis concept was swirling in my head as I watched Judas and the Black Messiah, an incredible film that beautifully captures the passionate, unapologetic activism of Fred Hampton, Chairman of the Illinois Black Panther Party. My spirit was deeply moved by the solemn clarity of Hampton’s statement, “I believe I’m going to die doing the things I was born to do.” I cried with his pregnant partner as she contemplated what that meant for the life in her belly. And then I looked somberly at my own life, my own safety, my own lack of real, material sacrifice in the ongoing struggle for liberation.\n\nIt is deeply uncomfortable to realize how much my own devotion to the cause falls short. It is painful to watch white supremacy, a system from which I benefit, snatch the lives of fathers, mothers, daughters, and sons.\n\nWhat do I do with that? Do I run away, or do I press deeper?\n\nAfter taking in the film, I chose to embrace the discomfort, to sit with that reality. I asked myself, what is my response? How should I live – how must I live – in light of that?\n\nI hear EbonyJanice Moore in my head posing the powerful question, “What are you doing for freedom today?” as I often do as a means of accountability. I come to terms with the fact that, whatever my efforts, they will never be “enough.” I resolve that, instead of using this realization to justify complacency, I will allow it to keep me unsatisfied with the bare minimum. I can never do “enough,” but I can do more.\n\nThe recent hate crime in Atlanta has only underscored the need to face our discomfort head-on. White people, I’m speaking specifically to us right now. It’s uncomfortable to hear the “justifications” for murder and notice that a part of you may want to believe them, to minimize the racial implications. It’s uncomfortable to see the “yes, all white people” posts on social media when your whole being wants to scream “but I promise, I care!!!”, knowing that caring isn’t enough to stop people from being killed, and yet feeling ill-equipped to take action. And it’s uncomfortable to step out and act, knowing you may get it wrong, have to apologize, or rethink some things.\n\nEmbrace the discomfort. Remind yourself that an idea being under threat is not the same as ourselves being threatened.\n\nIn fact, the opposite is true. When we fight or flee discomfort, we forfeit the chance to grow into our best, truest selves. “I’m a person who seeks out diverse perspectives. I listen humbly as I learn from those who don’t share my privilege. I’m committed to growing and deepening my knowledge.” That feels great to say, right? But if fight-or-flight wins, that version of “me” loses.\n\nThere are endless variations of the quote, “discomfort is necessary for growth.” And when it comes to certain areas, we totally embrace that. No one who understands fitness feels their muscles burn while working out and says, “Nah, you know what, forget this. I’m good.” They persist, knowing it’s a sign that they’re doing the necessary work to see a positive change.", "opengraph": {"type": "article", "title": "Confronting Our Privilege: How To Get Comfortable With Feeling Uncomfortable", "url": "https://thoughtcatalog.com/ellie-hunja/2021/03/confronting-our-privilege-how-to-get-comfortable-with-feeling-uncomfortable/", "description": "There are entire systems counting on our blindness in our areas of privilege, whether in the categories of race, sex, income level, ability status, sexuality, gender expression, country of citizens…", "article:published_time": "2021-03-30T19:05:46+00:00", "article:modified_time": "2021-04-14T22:05:59+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2021/03/clay-banks-l3aiwxpqmj8-unsplash.jpeg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "image:alt": "woman in black and blue shirt holding happy birthday signage", "locale": "en_US", "article:author": "https://www.facebook.com/EllieHunjaWriter"}, "tags": ["privilege", "Racism", "anti-racism"], "tweets": [], "movies": [], "links": ["https://theconversation.com/the-ins-and-outs-of-kenyas-covid-19-vaccine-rollout-plan-156310#", "https://www.kff.org/policy-watch/global-covid-19-vaccine-access-snapshot-of-inequality/", "https://www.kff.org/policy-watch/global-covid-19-vaccine-access-snapshot-of-inequality/", "https://www.nature.com/articles/srep39589", "http://ebonyjanice.com/"], "authors": [], "publish_date": "2021-03-30T19:05:46+00:00"}