{"result_id": "313003", "URL": "https://thoughtcatalog.com/mel-sanicas/2016/11/vaccines-are-undervalued-and-underappreciated-and-who-is-to-blame/", "timestamp": "2023-04-25 17:39:52 CEST+0200", "meta": {"description": "If you Google “vaccines” and “safe” – the overwhelming breadth of (mis)information available makes it feel almost impossible to bridge…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/mel-sanicas/2016/11/vaccines-are-undervalued-and-underappreciated-and-who-is-to-blame/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Vaccines Are Undervalued And Underappreciated And Who Is To Blame?", "cleaned_text": "Vaccines are one of the most successful scientific breakthroughs and most cost-effective health investments in history. In fact, with the exception of safe drinking water, vaccine is widely considered to be the greatest medical invention of modern civilization. So how did we get to this point where parents refuse to allow their children to receive vaccines? Vaccines are victims of their own success. Vaccines have been so effective in fighting childhood diseases that most parents today have never seen or heard of a case of measles, rubella, meningitis, polio or pertussis. These diseases have become so rare that most people are not aware of them. Majority of humans process visual information better and are visual beings – out of sight, out of mind. We rarely see people infected with measles so we think measles no longer exists.\n\nMany people these days are more afraid of vaccines than of the diseases they prevent. This fear of vaccines has been perpetuated by celebrities, fraudulent and now stripped-of-medical-license researchers, blogs and media hype. People avoid vaccines for several reasons. Some have concerns over the use of aluminum, formaldehyde or mercury admixed in vaccines. These chemicals are toxic at certain levels, but only trace amounts are used in vaccines. In fact, our own metabolic systems produce more formaldehyde than is used in vaccines and there is no robust and reliable scientific evidence that the very low levels of mercury or aluminum in some vaccines can cause harm. In the UK, decreasing rates of the use of the measles-mumps-rubella (MMR) vaccination have paralleled the reappearance of the diseases and this was due to the fraudulent research paper in the medical journal The Lancet that claimed that autism spectrum disorders were linked to the MMR vaccine. The paper has since been completely discredited, the researcher lost his medical license, and the paper was retracted. The British Medical Journal published a series of articles on the exposure of the fraud, which appears to have taken place for financial gain. Yet this vaccine – autism story still lives on in anti-vaccine blogs and continues to be shared every now and then in social media. And we don’t anticipate this story to end any time soon despite having been disproved and discredited several times over and over again in the last 2 decades. US President-elect Donald Trump met with prominent anti-vaccine proponents during fundraising events this summer.\n\nI came from a country in Southeast Asia considered low-middle income (by World Bank’s definition) where people value vaccines. In my previous role, I had the privilege of spending some time in Africa – I have worked with local doctors and spoke to mothers who understand the importance of vaccines because the compelling need forces them to focus on the benefit. In economically developed countries, parents worry more about theoretical side effects and risks blown out of proportion.\n\nIf you Google “vaccines” and “safe” – the overwhelming breadth of (mis)information available makes it feel almost impossible to bridge the dialogue gap, because the genuine scientific understanding of facts and reliable information is very different from the pseudo-science on the internet. What makes an expert? In the 2008 best-selling book, Outliers: The Story of Success, Malcolm Gladwell discusses the “10,000-Hour Rule” – that is, the key to achieving mastery in any skill largely depends on practicing the correct way, for a total of ~10,000 hours. If you’re browsing the internet trying to learn about vaccines and immunology for two to three hours each day, you’d need 3,300 to 5,000 days, around nine to fourteen years, to get close. If someone spends that amount of time reading credible and peer-reviewed information about vaccines, infectious diseases, and immunology, that someone will appreciate the evidence in support of vaccines – and I am almost sure that he or she will become a convert and a solid supporter of them. Gladwell’s critics argue that you can accelerate learning and master something in much less time than you think – but vaccinology and immunology needs a lot of reading and doing and cannot be mastered by browsing the internet. The immune system takes years to understand. I have been working on vaccines for over 8 years now (a couple more years and I can claim to be a world class expert per Gladwell’s 10,000 hour rule, yay!), but I do not claim to know everything about the immune system. It is a complex system of organs, immunoglobulins, cells, proteins with different functions and researchers spend years to understand just one tiny portion. How can someone just reading Google hits for a few hours believe they know everything about something?\n\nVaccines are safe, despite implications to the contrary in many blogs and anti-vaccine publications. They are thoroughly tested for safety and must undergo strict evaluation by national authorities before they are made routinely available. Each vaccine is continually monitored, even after it has been introduced. Independent experts and the WHO have shown that vaccines are far safer than medicines. Most adverse events after vaccination are minor and temporary, such as pain and swelling of the injection site or mild fever. More serious adverse events occur rarely.\n\nAlso, the media needs to be responsible in their reporting. The negative aspects of vaccination get much more publicity than the positive aspects. Sadly, our brains are more likely to accept statements as being true if they are frequently repeated, even if we are aware of facts that contradict those statements. The “so-called” fair and balanced reporting of both sides of the argument is not fair and balanced – it is not fair to report on emotional interviews of mothers of kids who claim to have been harmed by vaccines together with ‘boring’ scientific data talking about vaccine safety. Why can’t media show mothers whose kids were harmed by diseases because they refused to have them vaccinated? Media likes to sensationalize only one side and this is doing more harm than good and devalues vaccines. Vaccines deserve better press. This is not a matter of opinion, but of scientific evidence and public health and safety. Telling people that they are wrong only strengthens their pre-existing positions. The truth is now just an opinion. Unfortunately, thanks to social media, people can live in their own bubble of opinion of “truth” for as long as they like.", "opengraph": {"type": "article", "title": "Vaccines Are Undervalued And Underappreciated And Who Is To Blame?", "url": "https://thoughtcatalog.com/mel-sanicas/2016/11/vaccines-are-undervalued-and-underappreciated-and-who-is-to-blame/", "description": "If you Google “vaccines” and “safe” – the overwhelming breadth of (mis)information available makes it feel almost impossible to bridge the dialogue gap, because the genuine scientific understanding…", "article:published_time": "2016-11-23T19:31:33+00:00", "article:modified_time": "2016-11-28T15:22:22+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2016/11/5967597824_941cb311dd_o.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US"}, "tags": ["Current Events", "Vaccines", "News", "Health & Wellness"], "tweets": [], "movies": [], "links": ["https://thoughtcatalog.com/wp-content/uploads/2016/11/5967597824_941cb311dd_o.jpg", "http://www.bmj.com/content/suppl/2007/01/18/334.suppl_1.DC2/milestones.pdf", "http://www.fda.gov/BiologicsBloodVaccines/SafetyAvailability/VaccineSafety/ucm187810.htm", "http://www.fda.gov/BiologicsBloodVaccines/SafetyAvailability/VaccineSafety/ucm187810.htm", "http://www.upworthy.com/16-years-ago-a-doctor-published-a-study-it-was-completely-made-up-and-it-made-us-all-sicker?c=ufb1&g=4", "https://www.ncbi.nlm.nih.gov/pubmed/21224310", "http://www.sciencemag.org/news/2016/11/trump-met-prominent-anti-vaccine-activists-during-campaign", "http://gladwell.com/outliers/"], "authors": [], "publish_date": "2016-11-23T19:31:33+00:00"}