{"result_id": "313045", "URL": "https://thoughtcatalog.com/jeremy-london/2019/08/sentinelese/", "timestamp": "2023-04-25 17:40:25 CEST+0200", "meta": {"description": "For at least the past thousand years, attempts to make contact with the tribesmen on this tiny island have resulted…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/jeremy-london/2019/08/sentinelese/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "The Sentinelese Tribe: The Last Stone Age Humans On Earth?", "cleaned_text": "Variously described as “the most dangerous tribe in the world,” “the only truly isolated hunter-gatherers in the world today,” “the last pre-Neolithic tribe in the world,” and “one of the world’s last uncontacted peoples,” the mysterious and hostile tribe known as the Sentinelese have been occupying North Sentinel Island in the Bay of Bengal for anywhere from 30,000 to 60,000 years. For at least the past thousand years, attempts to make contact with them have resulted in a hail of arrows and spears flung at the intruders, frequently resulting in death. They made headlines late in 2018 when they killed a young American missionary who wanted to spread the Gospel to them.\n\nWho Are The Sentinelese?\n\nNorth Sentinel Island is one of the Andaman Islands in the Bay of Bengal. Although located closer to Thailand than mainland India, is officially part of India. It is an ocean paradise with clear blue water, coral reefs, a thick mangrove jungle, and a pristine white beach that features only about fifty yards of shoreline.\n\nThe tribes of the Andaman Islands include the Great Andamanese, the Onge, the Jarawa, and the Sentinelese. Based on DNA tests taken from the Jarawa, it is thought that all these tribes migrated from Africa around 60,000 years ago and have lived uninterrupted by civilization for nearly all of that time—however, the only tribe that remains actively hostile to the outside world is the Sentinelese.\n\nIn an 1899 speech, Richard Carnac Temple, who was acting as an administrator of the Andaman Islands at a time when the British ruled India, described the Sentinelese as\n\nThe Sentinelese are not known to engage in any kind of agriculture. They feed themselves by hunting wild boar, turtles, fish, crab, honey, and various indigenous roots. For weapons they use bows and arrows, often augmented with arrowheads made of iron or bone.\n\nThey live in family groups of three or four under small, leaf-covered huts. They frolic around the island almost entirely naked.\n\nIt is not known what they call themselves. In fact, not a word of their language is understood by outsiders. But many anthropologists believe that their fierce and violent defensiveness of their domain is evolutionarily wise, seeing as how contact with the outside world would threaten to almost immediately render them extinct due to a lack of immunity toward modern human ailments—even trifles such as the common cold.\n\nAlthough fierce, they are small in stature\n\nOriginal Arab and Chinese explorers from a thousand years ago who chanced upon Sentinel Island described the inhabitants as three feet tall and having bird beaks. Later observations have determined that the average adult Sentinelese tribesman is around 5’3” tall.\n\nThey are also small in number\n\nAlthough estimates range wildly from around 15 to 500, the more reliable estimates say there are only about 50 to 200 Sentinelese in existence. Observers say they almost all appear to be under forty years in age with a somewhat even distribution of males, females, and children.\n\nFamed Italian merchant Marco Polo, in his eastward trips sometime late in the 1200s, described the Sentinelese thusly: “They are a most violent and cruel generation who seem to eat everybody they catch.”\n\n1563: Master Caesar Frederick, an Italian sailor, predicts doom for anyone who visits North Sentinel Island\n\nAccording to Frederick: “If any ship, by ill fortune, stop at these islands, no one comes back alive.”\n\n\n\n1867: Members of Indian merchant vessel make contact with islanders, get attacked with arrows\n\nDuring the late summer monsoon of 1867, the Indian merchant ship Nineveh found itself marooned on a coral reef off North Sentinel Island. They alighted on the island safely, but on the third day they were suddenly attacked by naked islanders who were painted red and flinging arrows at them. According to reports, they were able to repel the attackers with sticks and stones.\n\nBritish naval officer Maurice Vidal Portman, in an attempt to bring “civilization” to the islanders, kidnapped two Sentinelese adults and four children, transporting them to Port Blair. The adults died almost immediately—most likely from exposure to common human germs and/or viruses against which they’d developed almost no immunity due to their sixty millennia of isolation from the outside world. Although sickened by their exposure to the outside world, the children did not die. Embarrassed and ashamed, Portman returned the children to the island along with a few token gifts.\n\n1896: Escaped British convict gets murdered with arrows, has throat slit\n\nIn 1896, a British convict serving time on a penal colony on Great Andaman Island escaped on a homemade raft and had the misfortune of winding up on North Sentinel beach, where he was later found with slit throat and several arrow piercings.\n\nIn 1967, an anthropological team officially designated by the Indian government attempted to make contact with the islanders. During their exploration of the island, they found 18 lean-two huts and several burning fires, along with the carved-up remains of pigs, fishing nets, wooden buckets, and spears. While observing the tribesmen from their boats, they observed them arrogantly waving their penises at the anthropologists and assuming “defecation” postures, which one doesn’t need to be an anthropologist to take as an insult—this is when the Sentinelese weren’t lobbing arrows and spears at them.\n\nIn 1974, National Geographic sent a film crew to the island as part of their documentary Man in Search of Man. Although the locals fired arrows at the crew, its members safely landed on shore and left gifts such as a doll, a live pig, and coconuts. This was met with another volley of arrows, one of which struck a crew member in the thigh. National Geographic magazine published the first known picture of the Sentinelese as a result of this mission, describing them as a tribe for whom “arrows speak louder than words.”\n\n1981: The cargo ship Primrose gets stranded right off North Sentinel Island…and pelted with arrows\n\nWhile carrying cargo between Australia and Bangladesh, a cargo ship named the Primrose ran aground off North Sentinel Island. After a few days, the small screw sent a distress signal begging for firearms and reporting that a group of about 50 islanders are preparing canoes and attempting to invade the ship. Fortunately for the members of the Primrose,, choppy seas prevented the canoes from reaching the ship and made it impossible for the tribesmen to hit their targets with arrows. But after the crew were evacuated, a member of the team seeking to salvage the Primrose describes his encounter with them:\n\n1991 expeditions: Unarmed, the Sentinelese accept gifts of coconuts from Indian anthropologists\n\nDuring a January, 1991 visit from Indian anthropologists, the Sentinelese approached their visitors unarmed for the first time in recorded history. The eagerly accepted five coconut-filled burlap bags from the visitors. This would be the only time in history that the Sentinelese would not attack their intruders.\n\nDespite the devastation wrought by the 2004 Indian Ocean tsunami—and despite the fact that North Sentinel Island was smack-dab in the middle of the path of destruction—it appears that the Sentinelese emerged unscathed. Although no one is certain how they managed this miraculous feat, it is thought that their instincts were as finely tuned as animals, and they anticipated the tsunami before it arrived, scurrying up into trees for protection. When expedition crews hovered over the island looking for survivors, the survivors attacked them with arrows.\n\nIn January of 2006, a pair of Indian fisherman who’d been illegally harvesting crabs off North Sentinel Island threw down an anchor and fell asleep, their slumber presumably aided by imbibing copious amounts of alcohol. Apparently their anchor wasn’t effective, and the boat drifted toward the shore overnight, where Sentinelese tribesmen hacked them to death with axes. One report claims that the victims’ “bodies were later put on bamboo stakes facing out to sea like scarecrows.”\n\nAccording to a group called Survival International, the true victims during this incident were the Sentinelese:\n\nIn November of 2018, a US-based Christian missionary named John Allen Chau, 26, determined that it was his mission to save the souls of the Sentinelese from eternal damnation by bringing them the Gospel of Jesus Christ.\n\nChau flouted the law which forbade anyone from going within three miles of North Sentinel Island and bribed local fishermen to take him near the shore.\n\nOn November 15, the fishermen took him about 2,000 feet from the shore but warned him not to go any further. Chau ignored their warnings and, with a waterproof Bible in hand, he canoed himself to the shore but was met with a hostile response. Upon a subsequent attempt to make contact, a boy tribesman shot an arrow that pierced Chau’s Bible.\n\nUndeterred, Chau wrote in a letter to his family and friends:\n\nOn November 17, Chau instructed the fishermen to leave without him as he yet again attempted to make contact with the Sentinelese. The fishermen would later observe the Sentinelese dragging Chau’s dead body along the shoreline. The fishermen were arrested as accessories to murder—interestingly, though, no one even thought of charging the Sentinelese with murder. Despite the fact that they occupy Indian land, perhaps the Indian government fails to recognize them as fully human.", "opengraph": {"type": "article", "title": "The Sentinelese Tribe: The Last Stone Age Humans On Earth?", "url": "https://thoughtcatalog.com/jeremy-london/2019/08/sentinelese/", "description": "For at least the past thousand years, attempts to make contact with the tribesmen on this tiny island have resulted in a hail of arrows and spears flung at the intruders, frequently resulting in de…", "article:published_time": "2019-08-04T14:50:44+00:00", "article:modified_time": "2020-12-10T07:11:46+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2019/06/thesentinelesetribe.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US"}, "tags": ["History"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe loading=\"lazy\" title=\"SENTINELESE: World's Most Isolated Tribe\" width=\"768\" height=\"432\" src=\"https://www.youtube.com/embed/j7BNwmVvk6g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/j7BNwmVvk6g?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe loading=\"lazy\" title=\"The History of North Sentinel Island - And Why it's Illegal to Visit\" width=\"768\" height=\"432\" src=\"https://www.youtube.com/embed/BmZ8Miogq54?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/BmZ8Miogq54?feature=oembed"}], "links": [], "authors": [], "publish_date": "2019-08-04T14:50:44+00:00"}