{"result_id": "313026", "URL": "https://thoughtcatalog.com/rebecca-paredes/2015/12/6-things-about-vaccinations-you-absolutely-need-to-know/", "timestamp": "2023-04-25 17:40:09 CEST+0200", "meta": {"description": "It’s like chicken pox, right? You get it once and then you never get it again. However, this mentality is…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/rebecca-paredes/2015/12/6-things-about-vaccinations-you-absolutely-need-to-know/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "6 Things About Vaccinations You Absolutely Need To Know", "cleaned_text": "In early November, Uber offered drive-by flu vaccinations in partnership with John Brownstein, Ph.D and co-founder of Epidemico. For one day, you could request a flu shot within your Uber app, and a registered nurse would arrive at your location with a syringe loaded with the flu vaccine.\n\nNationwide, workplaces, pharmacies, and hospitals offered similar conveniences because getting vaccinated is a quick process, a social responsibility, and a huge part of preventative care.\n\nI received a flu shot this year, mostly because of the promise of a free cookie. Of course, it was difficult to ignore the totally ridiculous controversy surrounding the vaccine I was about to receive. According to a study published by Public Health Reports, approximately 57% of surveyed parents delayed or refused vaccines for their children because they had concerns about autism — a number that, to put things plainly, is evidence of the total misinformation surrounding vaccinations today.\n\nSo let’s just go ahead and set the record straight.\n\n1. Vaccines. Do not. Cause. Autism.\n\nThe Centers for Disease Control and Prevention (CDC) released this list of common concerns about vaccine safety, and there are literally three headings on that page that all say the same thing: Science has shown no link between receiving vaccines and developing autism. There is no link. Vaccines don’t cause autism. Donald Trump’s anti-vaccine comments during the first GOP debate were as wrong as Jenny McCarthy’s anti-vaccine crusade.\n\n2. Unvaccinated children (and adults) put other people at risk.\n\nThanks to medical science, diseases like measles and polio are totally preventable with proper vaccination. However, unvaccinated individuals — both kids and adults — can potentially spread the disease to others, especially people with compromised immune systems like seniors and young children. According to the CDC, it just takes one or two cases of disease to cause an outbreak in a community. Don’t be patient zero.\n\n3. Vaccines are the strongest form of immunization.\n\nSome people believe that it is better to receive “natural immunity” by actually getting the disease. It’s like chicken pox, right? You get it once and then you never get it again. However, this mentality is both wrong and fatal for diseases like rubella, hepatitis B, or literally any of the other diseases that we vaccinate against. Vaccines will help your immune system fight the disease without giving you any of the terrible side effects, like liver cancer from hep B or literal death from measles.\n\n4. The side effects of vaccines are incredibly rare.\n\nVaccines can cause mild soreness at the area of injection, minor fatigue, and maybe a headache, among other minor side effects. On very rare occasions, individuals may develop Guillain-Barré syndrome (GBS) “in the days or weeks after getting a vaccination,” according to the CDC. However, cases like GBS are so uncommon (and the minor soreness after getting a vaccine is so negligible) that the benefits of vaccinations far outweigh the supposed “risks.” So, yes, you’ll have to deal with the quick stab of a needle for a millisecond, but at least you and those around you won’t don’t die of influenza.\n\n5. Getting more than one vaccine won’t overload a child’s immune system.\n\nWe’ll chalk this concern up to parental worries and a hefty dose of misinformation. Children receive rounds of immunizations and booster shots within a specific timeframe, and science has shown that “giving several vaccines at the same time has no adverse effect on a child’s immune system,” according to the World Health Organization (WHO). This is a case of medical science doing its job. Not the big pharma companies trying to poison children.\n\n6. Vaccines aren’t a ploy for pharmaceutical companies to get paid.\n\nNo. This controversy is both false and hugely misguided. Doctors and pediatricians often lose money on administering vaccines because the cost of immunization exceeds the reimbursement from some insurers and health plans. And yet, they do it anyway. Why?\n\nThe answer is simple: Because vaccines work and they’re necessary. Period.", "opengraph": {"type": "article", "title": "6 Things About Vaccinations You Absolutely Need To Know", "url": "https://thoughtcatalog.com/rebecca-paredes/2015/12/6-things-about-vaccinations-you-absolutely-need-to-know/", "description": "It’s like chicken pox, right? You get it once and then you never get it again. However, this mentality is both wrong and fatal for diseases like rubella, hepatitis B, or literally any of the other …", "article:published_time": "2015-12-07T20:27:06+00:00", "article:modified_time": "2015-12-07T20:27:06+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/12/shutterstock_319466393.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US"}, "tags": ["Flu Shot", "Opinion", "Donald Trump", "Vaccinations", "Autism", "Jenny McCarthy", "Shots", "Doctors", "Vaccines", "Health and Wellness"], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3113438/table/T1/", "http://www.cdc.gov/vaccinesafety/concerns/autism.html", "http://www.instantcheckmate.com/crimewire/2016-presidential-candidates-scandals/", "http://www.salon.com/2015/11/29/what_the_hells_wrong_with_us_autism_vaccines_and_why_some_people_believe_jenny_mccarthy_over_every_doctor/", "http://www.cdc.gov/vaccines/vac-gen/whatifstop.htm", "http://www.who.int/features/qa/84/en/", "http://www.cdc.gov/vaccines/vac-gen/whatifstop.htm", "http://www.who.int/features/qa/84/en/", "http://pediatrics.aappublications.org/content/124/Supplement_5/S492.abstract"], "authors": [], "publish_date": "2015-12-07T20:27:06+00:00"}