{"result_id": "313010", "URL": "https://thoughtcatalog.com/dan-whalen/2018/05/10-indisputable-signs-youre-maturing-in-life/", "timestamp": "2023-04-25 17:39:57 CEST+0200", "meta": {"description": "You don’t seek what you want, you create it.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/dan-whalen/2018/05/10-indisputable-signs-youre-maturing-in-life/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "10 Indisputable Signs You’re Maturing In Life", "cleaned_text": "“You had the power all along my dear, you just had to learn it for yourself.” — Glinda, The Wizard of Oz\n\nThe journey through maturity is often a rocky one. Like a kid avoiding a vaccine, we often resist lessons in character development. Whether fear is at the source or we simply relish in our combative nature, our behaviors tend to perpetuate into these unshakable identities — which most of the time, aren’t even who we want to be.\n\nMy path was tempestuous, riddled in ignorance and blind spots that not only projected a deafening cry for help but sealed the door for anyone else to enter.\n\nIt wasn’t until my quiet desperation yielded long enough for me to understand the impact I was having on others, did I finally release everything I had ever known to be “me”.\n\nThe first step in causing a breakthrough is awareness, and this list compiles several of the key distinctions I now leverage to stay true to what’s important to me.\n\nHere are 10 signs you’re well on your way to closing the gap on your character deficiencies.\n\nGiven our tendency to relish the negative in our conversations, it’s rarely a good idea to talk about others. Occasionally, sure, we’re revering someone’s efforts or progress. But generally speaking, it’s safe to say we’re talking about others to prop ourselves up on a soapbox.\n\nEvents are fine points of discussion but when your conversations make the shift to primarily idea-based, your level of satisfaction in life is sure to go up.\n\n2. You love yourself as much as you love anyone else.\n\nSelf-love was never my strong suit until this year. I took issue with every possible thing about myself that even marginally ventured outside the norm. It’s an exhausting game that always ends the same way — you don’t win.\n\nReal self-love is an appreciation for not only all that’s great about you, but also your legitimate imperfections. This isn’t meant to be rooted in spite, though — especially in an “I Can Do Bad All By Myself” way. This love is acknowledging what needs improvement and loving yourself enough to put in the work to refine it.\n\nHappy with what you’ve got, while you pursue what you want.\n\n3. You take responsibility for all that is yours — regardless of whose fault it may be.\n\nIf you have any activity on social media, I’m sure you’ve seen Will Smith’s fresh take on fault versus responsibility. If not, here it is. In essence, he’s pointing out that I have a duty to as a human being to take responsibility for everything I can. Every situation in which I’m involved, I play a role in causing the outcome.\n\nThe outcomes aren’t always pretty. And I’ll do whatever it takes to avoid looking bad. So the natural inclination becomes, point the finger. This is a band-aid for something that needs surgery. While it may bring a temporary sense of relief, relief isn’t joy. Relief isn’t peace. The situation needs to be dealt with in an empowering manner, or I’ll be at risk of throwing yet another bag onto the conveyor belt — to be hauled around indefinitely.\n\nOver time, those bags feel heavier. Fatigue sets in and the energy I used to channel for happiness and euphoria is suddenly allocated elsewhere. Responsibility is owning where I am imperfect, where I set an expectation, where I chose my opinion over another person or collective purpose. When I accept cause in the matter, I can then cause a new outcome.\n\n4. You understand not everything requires your opinion.\n\nOne of my go-to legs to stand on in life was appearing smart. I met my need for significance and certainty this way, correcting people and adding unnecessary input when they simply wanted to share what was on their mind.\n\nUnaware of my inauthentic behavior, everyone knew I was serving myself. I became the shit I was full of. I said what I wanted to say, not what they needed — or didn’t need — to hear.\n\nI finally gave it all up and began to replace my hollow rhetoric with space and time — one of the greatest gifts you can give another person. I cherish my alone time for the peace and quiet it breeds. The great news is when I give people that very same thing, and they cherish me.\n\n5. You keep a mind open to everything and attached to nothing.\n\nI feel powerless when I choose my views or justifications over what would actually produce results. My desire to be right would be overwhelming at times, and I would often let it drive wedges into the relationships I value most. This proclivity robbed me of happiness, leaving me to wallow in my own validations.\n\nWhat’s important to understand here is I am not my beliefs. My current beliefs may have got me to this very moment, but it doesn’t make me any less of a person if I give one — or all — of them up. I can create new ones, better ones, that will continue to guide me in the direction I want to go. Always being able to let go equals never being stuck.\n\n6. You give before you receive.\n\nI’m far more likely to receive appreciation when I first give it. I’m far more likely to receive service when I first give it. I’m far more likely to receive trust when I first give it. I’m far more likely to receive love when I first give it.\n\nOur reasons to withhold first giving what we want to receive are primarily self-serving. We’re not making much of an impact on anyone by leaving the wall up, as this is nothing more than a survival mechanism. To live a life we love, we must contribute to others—most importantly, free from constraint.\n\n7. You’re straight with your communication, regardless of how unsexy it may be perceived.\n\nNo one appreciates fluff, as they realize that’s all it is. Beating around the bush, embellishment, and lying are all forms of fabrication—which doesn’t get us very far with people.\n\nIt’s not my decision to decide for other people. They will think how they want to think. Feel how they want to feel. Attach meaning to whatever they choose. I can only be my best, which includes being open and honest. When I’m focused on other people’s approval, I lose my authenticity. When I focus on what I’m committed to, the truth backs me up. Speak from the heart, even if you’re voice shakes.\n\n8. You’ve stopped giving off the image of perfection, knowing no one can relate to it.\n\nChange in people is caused by one of two things — inspiration or desperation. People will become desperate on their own volition. But inspiration can be deposited.\n\nInspiration comes from demonstrating what’s possible. When I fake being perfect, fake having all the answers, fake not questioning myself, fake not battling depression, I lose that relatedness. When I acknowledge who I am, however, I close the gap. All of sudden, hope stands in the place of resentment and bitterness. And lives are changed as profit.\n\n9. You quiet the voice in your head that insists something is always wrong.\n\nMy internal dialogue sucks. It’s riddled with doubt, fear, insecurity, all that noise. When I distinguish it for what it is, however,— merely trash talk from a jaded fan in the nosebleed section— it loses its muster. Leaving space for a new dialogue to ensue. The one that I determine.\n\n10. You don’t seek what you want, you create it.\n\nI don’t know where this writing thing will take me, but damn, did it feel good to produce a burning passion out of thin air. I waited and waited and waited for years. Nothing lit me up.\n\nResignation and cynicism took shelter within a severely damaged ego. It wasn’t until I interrupted that poorly drawn-up approach with action, did life begin to change for me.", "opengraph": {"type": "article", "title": "10 Indisputable Signs You’re Maturing In Life", "url": "https://thoughtcatalog.com/dan-whalen/2018/05/10-indisputable-signs-youre-maturing-in-life/", "description": "You don’t seek what you want, you create it.", "article:published_time": "2018-05-14T04:26:12+00:00", "article:modified_time": "2018-05-21T02:07:53+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2017/12/photo-1515212799670-2481411f0d641.jpg?w=1080&h=720&crop=1", "image:width": "1080", "image:height": "720", "locale": "en_US"}, "tags": ["Maturity", "Growing Up", "Self-Improvement", "Life Advice", "20 Somethings", "Growth", "Life", "Self-Worth"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=USsqkd-E9ag"], "authors": [], "publish_date": "2018-05-14T04:26:12+00:00"}