{"result_id": "313035", "URL": "https://thoughtcatalog.com/jeremy-london/2020/03/covid-19-coronavirus-theories-the-master-list/", "timestamp": "2023-04-25 17:40:17 CEST+0200", "meta": {"description": "All the fake cures and fraudulent plots about novel coronavirus in one never-ending list.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/jeremy-london/2020/03/covid-19-coronavirus-theories-the-master-list/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "“COVID-19/Coronavirus” Conspiracies: The Master List", "cleaned_text": "In what is nothing more than an EXTREMELY CREEPY similarity, mass-market novelist Dean Koontz’s 1981 book The Eyes of Darkness mentions the outbreak of a virus called “Wuhan-400” that was developed in a lab outside of Wuhan, China—Ground Zero for the current real-life outbreak! Thankfully, that’s about the only similarity between fiction and real-life—whereas COVID-19 currently has a fatality rate estimated at 3-4%, Wuhan-400 killed everyone it infected.\n\nIn January, a theory emerged that a logo from a Wuhan virology lab was eerily similar to that of an agency that made the virus that starts the zombie apocalypse in the video game Resident Evil. It was also noted that the main city in the game is named “Raccoon,” which is an anagram of “corona.” But Snopes proved that the logo was from a different institute in China 500 miles away from Wuhan.\n\n* Coronavirus is no worse than the common cold.\n\nFor starters, the common cold doesn’t have anywhere near the 3-4% mortality rate of the virus that causes COVID-19. The symptoms—fever and a cough—are also more like flu symptoms than a common cold. Where this misinformation may have originated is from the fact that the common cold can be cause by a coronavirus—just not the one that’s caused the current global pandemic.\n\n* Dogs created coronavirus to force their owners to stay home and cuddle them.\n\nIngenious if true. They get extra walks and can avoid dreaded trips to the vet:\n\n* The US government has a vaccine for coronavirus but refuses to release it.\n\nA January 22 post from Facebook claimed that the CDC had already filed a patent for a coronavirus vaccine, implying that the entire outbreak was planned by the feds and Big Pharma to make a profit. This theory was debunked when it was revealed that the patent referred to SARS rather than COVID-19. It’s also kind of dumb to think they’re trying to make a profit…without releasing the vaccine?\n\nAccording to a report on ET Prime, last July Canadian authorities accused a group of Chinese scientists of being spies who committed a “policy breach” that in some way involved the fact that “the coronavirus is an offensive biological warfare weapon with DNA-genetic engineering.” But both Health Canada and the Public Health Agency of Canada say the theory has no evidence to support it.\n\n* OK, but coronavirus was created in a lab, anyway.\n\nAccording to a recent poll, 29% of Americans believe it was created in a lab. Scientists, however, say that the evidence proves the virus has natural origins.\n\n* Cocaine will sterilize your nostrils and protect you from coronavirus.\n\nThis oddball rumor spread throughout France and prevented zero infections — and if it led to people sharing dollar bills to snort cocaine, it probably caused a few infections.\n\n* The virus contains sequences that are eerily identical to those found in HIV.\n\nAlthough this is true, people took this fact and ran with it as “proof” that novel coronavirus was genetically engineered to infect and kill huge swaths of the population. But researchers have concluded that this finding was “at most a coincidence.”\n\n* If you can hold your breath for 10 seconds, you are not infected.\n\nA completely baseless rumor, since symptoms often don’t appear for a couple weeks.\n\n* The virus originally spread from bats to humans, probably as a result of eating bat soup.\n\nWhen news of coronavirus first went big, a video of an Asian woman eating bat soup was presented as “evidence” of the how the new epidemic magically spread from animals to humans. Problem is, the woman in the video wasn’t even in China at the time — she was in the island country of Palau — and researchers are currently unsure whether the virus even originated from other animals, much less bats.\n\n* Spreading goose fat on your chest will cure you.\n\nThis is one of the more wackadoodle theories out there. It was espoused in late February by Mart Helme, Estonian Minister of the Interior. The only thing that spreading goose fat on your chest will do is force your girlfriend to break up with you because you’re too weird.\n\n* Drinking cow urine and smearing cow poop all over your body will cure you.\n\nThis almost sounds like one of those situations where the cure is worse than the disease. It was pushed by Indian activist Swami Chakrapani and politician Suman Haripriya, who apparently have yet to try the treatment on themselves.\n\n* God created coronavirus to punish humanity for its degenerate behavior.\n\nUnless God is willing to come out of self-quarantine to personally confirm or deny this allegation, what keeps ideas such as this one alive is the fact that you can’t prove or disprove it.\n\n* China is deliberately spreading disinformation about the virus…wait, not, it’s America that’s lying.\n\nAt the the moment, this is likely the biggest news story since World War II, and it’s only just beginning. One thing you should know is that it’s hard to know anything for sure. If you’re the type to trust what governments say, then by all means believe it. For all we know, but the Chinese government and the US government are lying about what’s going on. And regarding what everyone else is saying, it’s a safe bet that 99% of them have no idea what they’re talking about. Right now, the best thing you can do is keep safe and avoid other people.\n\n* Coronavirus was created by “gringos” to decimate Latin America and China.\n\nThis cockamamie idea was put forth by a member of Venezuela’s Constituent Assembly named Elvis Méndez, and yes, he used the racial slur “gringos.” And again, his name is Elvis.\n\nThis theory was put forth on Turkish television and alleges that Jewish people created COVID-19, bird flu, and hemorrhagic fever to “design the world, seize, countries, [and] neuter the world’s population.” No evidence was offered to support this assertion.\n\n* Coronavirus is a population-control scheme hatched in part by Bill Gates.\n\nThis cuckoo idea was put forth by YouTuber Jordan Sather, who claims the virus was a collaborative effort by England’s Pirbright Institute and Microsoft’s Bill Gates to reduce the world’s population and thus make life easier on billionaires such as Bill Gates.\n\nThis rumors spread in mid-February when a student from Cameroon recovered from the virus. It also spread as a result of the fact that Africa had relatively fewer infections than Europe and the United States. But sub-Saharan Africa also has less access to international air travel than Europe and the US. These rumors were put to rest on March 17 when actor Idris Elba declared he had COVID-19.\n\nIn February, social-media conspiracists claimed that the outbreaks in Wuhan, China and aboard the Diamond Princess cruise ship were caused by electromagnetic fields from 5G technology. Others noticed a correlation between the lack of 5G tech in Africa and the relatively low number of infections there, at least during the beginning of the outbreak. This wacky theory was debunked by several major media outlets.", "opengraph": {"type": "article", "title": "“COVID-19/Coronavirus” Conspiracies: The Master List", "url": "https://thoughtcatalog.com/jeremy-london/2020/03/covid-19-coronavirus-theories-the-master-list/", "description": "All the fake cures and fraudulent plots about novel coronavirus in one never-ending list.", "article:published_time": "2020-03-24T14:29:10+00:00", "article:modified_time": "2020-11-13T03:11:47+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2020/03/corona-4938929_1280.jpg?w=1280&h=442&crop=1", "image:width": "1280", "image:height": "442", "locale": "en_US"}, "tags": ["Coronavirus", "COVID-19", "Conspiracies"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">is anyone else starting to think COVID-19 is a conspiracy created by dogs? Let’s look at the facts<br/>-everyone has to stay home<br/>-walking the dog is allowed<br/>-vet checkups are being postponed</p>\n<p>i’m just saying it’s a bit suspect</p>\n<p>— Steph 🌸 (@smalltalktattoo) <a href=\"https://twitter.com/smalltalktattoo/status/1242144912314740736?ref_src=twsrc%5Etfw\">March 23, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.cdc.gov/", "https://coronavirus.jhu.edu/map.html", "https://www.cnn.com/2020/03/13/us/dean-koontz-novel-coronavirus-debunk-trnd/index.html", "https://www.snopes.com/fact-check/resident-evil-umbrella-coronavirus/", "https://twitter.com/smalltalktattoo/status/1242144912314740736?ref_src=twsrc%5Etfw", "https://www.politifact.com/facebook-fact-checks/statements/2020/jan/23/facebook-posts/there-outbreak-china-wuhan-coronavirus-there-not-v/", "https://prime.economictimes.indiatimes.com/news/74068009/economy-and-policy/coronavirus-is-a-bio-weapon-experiment-gone-wrong-suspect-global-experts", "https://en.wikipedia.org/wiki/Health_Canada", "https://en.wikipedia.org/wiki/Public_Health_Agency_of_Canada", "https://www.journalism.org/2020/03/18/americans-immersed-in-covid-19-news-most-think-media-are-doing-fairly-well-covering-it/", "https://go.redirectingat.com/?id=66960X1514734&xs=1&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs41591-020-0820-9&referrer=theverge.com&sref=https%3A%2F%2Fwww.theverge.com%2F2020%2F3%2F20%2F21187983%2Fdebunk-coronavirus-conspiracy-theories-how-to-covid-19-news-science%3FsubId3%3Dxid%3Afr1585002417473edb&xcust=xid:fr1585002417473edb", "https://www.pedestrian.tv/news/french-government-cocaine-coke-coronavirus-hoax/", "https://www.the-scientist.com/news-opinion/theory-that-coronavirus-escaped-from-a-lab-lacks-evidence-67229", "https://www.youtube.com/watch?v=VAQqE5jmV1I", "https://www.delfi.ee/news/paevauudised/eesti/video-mart-helme-kulmetushaigus-on-nuud-siis-umber-ristitud-koroonaviiruseks-mingit-hadaolukorda-eestis-pole?id=89066557date=2%20March%202020", "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-in-india-can-cow-dung-and-urine-help-cure-the-novel-coronavirus/articleshow/73952691.cms", "https://www.timesofisrael.com/conspiracy-theory-that-jews-created-virus-spreads-on-social-media-adl-says/", "https://www.reuters.com/article/uk-factcheck-coronavirus-vaccine-design/false-claim-the-coronavirus-isdesigned-and-any-vaccine-that-is-developed-could-infect-you-with-the-disease-idUSKBN20W2FB", "https://www.cnn.com/2020/03/16/entertainment/idris-elba-coronavirus-trnd/index.html", "https://www.usatoday.com/story/tech/columnist/2020/03/21/did-5-g-cause-coronavirus-covid-19-pandemic/2873731001/"], "authors": [], "publish_date": "2020-03-24T14:29:10+00:00"}