{"result_id": "313047", "URL": "https://thoughtcatalog.com/nicole-mullen/2015/04/i-am-now-selling-100-natural-holistic-homeopathic-coins-to-help-you-decide-whether-or-not-to-vaccinate-your-child/", "timestamp": "2023-04-25 17:40:27 CEST+0200", "meta": {"description": "Obviously we can’t trust doctors, and it’s becoming more and more difficult to trust Jenny McCarthy, so the only thing…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/nicole-mullen/2015/04/i-am-now-selling-100-natural-holistic-homeopathic-coins-to-help-you-decide-whether-or-not-to-vaccinate-your-child/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "I Am Now Selling 100% Natural, Holistic, Homeopathic Coins To Help You Decide Whether Or Not To Vaccinate Your Child", "cleaned_text": "Still unsure whether or not you should vaccinate? Well get ready for some good news, fellow supermoms. I’ve finally developed an answer that not only solves the issue of whether or not to vaccinate, it also makes me a little bit of money.\n\nYes, it appears the jury is still out on whether or not vaccination is good or bad for children. But as we all learned during the trial of George Zimmerman, juries are racist and bad, and by extension, so is evidence. If we really want to know the truth about something, we have to use our instincts, our intuition, and the helpful advice from fellow intuitive heart-doctor moms like myself.\n\nThat’s why I’m selling 100% natural, holistically balanced and spiritually aligned coins that will help you decide whether or not to vaccinate your children. Simply toss them in the air, and let the coins spiritual energy align with the Earth and the stars to decide whether to vaccinate (heads) or not (tails).\n\nSo how does it work? Simple, you just take the coin in your dominant hand. Close your fingers around it and place it to your chest. Then think about your child. Think about how much you love them and care for them. Think about how much you would do to protect them and keep them safe. Now toss the coin in the air, if it’s heads, vaccine ‘em up. If it’s tails, no needles for baby.\n\nNow, what makes these coins different from regular coins? Well for starters, they’re all selected from my pocket after rigorously testing for structural imperfections and coin integrity. What I’m looking for is anything that will mess up a coin toss, little dinks and scratches – anything that will alter the physical reality of the coin; the way it perceives itself.\n\nThen every coin is microwaved, which helps remove any negative energy that might be stored in the coins. Normally I am completely opposed to using the microwave for any purpose, because of its cancer-causing properties that I heard about from my friend Diane who washes her hair with vinegar, but I figure if the microwave is strong enough to cause cancer, it’s certainly strong enough to remove negative chi from my pocket change. You can literally see the negative spirits zapping off the coins and starting little fires.\n\nI know what your next question is. Are the coins safe? Barring metal allergies, all of my coins are 100% natural and therefore completely safe. Taken directly from the bank when I cash my unemployment checks, the coins have never been spent, and therefore remain untainted by capital greed and the evils of competitive markets.\n\nEach coin has been delicately aligned with all of my chakras. I wear a fishing vest to my yoga class every Tuesday, and I fill all the pockets with as many coins as I can. I go through all my Vinyasas with the coins close to my heart, and I think positive thoughts as they ask me to leave for making too much noise.\n\nNow these coins can be yours. And they should be.\n\nLeaving the health of your child up to a regular coin toss would be extremely dangerous and borderline criminal, but if you use one of my crystal-powered and intuitively gifted coins, you can trust the Universe to make the right decision for you.\n\nObviously we can’t trust doctors, and it’s becoming more and more difficult to trust Jenny McCarthy, so the only thing left for mothers to do is to trust ourselves. We have to find truth internally, and the best way to do that is to follow our hearts and buy my special vaccination coins that will help you make the right decision.\n\nSo don’t leave the health of your child in the hands of evil doctors or sometimes incorrect celebrities. Take your child’s future into your own hands, toss it into the air, and let the universe guide you.\n\nEach coin is 500 dollars plus S&H, or whatever you can Paypal me is fine. I also will trade for Percocet.", "opengraph": {"type": "article", "title": "I Am Now Selling 100% Natural, Holistic, Homeopathic Coins To Help You Decide Whether Or Not To Vaccinate Your Child", "url": "https://thoughtcatalog.com/nicole-mullen/2015/04/i-am-now-selling-100-natural-holistic-homeopathic-coins-to-help-you-decide-whether-or-not-to-vaccinate-your-child/", "description": "Obviously we can’t trust doctors, and it’s becoming more and more difficult to trust Jenny McCarthy, so the only thing left for mothers to do is to trust ourselves.", "article:published_time": "2015-04-20T17:16:30+00:00", "article:modified_time": "2015-04-20T19:16:48+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/04/shutterstock_133540619.jpg?w=1000&h=768&crop=1", "image:width": "1000", "image:height": "768", "locale": "en_US"}, "tags": ["Vaccinations", "Writing & Expression", "Humor", "Jenny McCarthy", "Parenting", "Anti-Vaccinator"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2015-04-20T17:16:30+00:00"}