{"result_id": "313043", "URL": "https://thoughtcatalog.com/angela-marie-mauhay/2016/10/im-lying-to-myself-when-i-say-ive-moved-on-from-you/", "timestamp": "2023-04-25 17:40:24 CEST+0200", "meta": {"description": "For the past months that seem to be an eternity, I thought I got over everything and I was so…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/angela-marie-mauhay/2016/10/im-lying-to-myself-when-i-say-ive-moved-on-from-you/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "I’m Lying To Myself When I Say I’ve Moved On From You", "cleaned_text": "I thought I already kissed you goodbye. For the past months that seem to be an eternity, I thought I got over everything and I was so sure that I was OK. I was so damn confident that I already moved forward and it was so easy doing that until I found out that I was unconsciously lying to myself.\n\nHow come time has a way to bring back the memories that we used to be.\n\nToday I received a notification from google to recover the photos for the past years. I got thrilled to go back and see how myself changed for the past few years.\n\nI keep scrolling and scrolling with a big smile on my face until I saw screenshots conversations, the pictures of our dates, the things that we took when we are asking each other “what are you doing?” and it still breaks my heart.\n\nThe genuine smile that I had turned bitter-sweet.\n\nThere comes a time when your shoes got broken and you went to the store to buy one but you can’t decide on your own so you ended up taking a picture of every shoe that you like and asked me to decide what will you buy. It makes my album that day like an online shopping app.\n\nThere comes a point in our relationship that we had a fight and you somehow you were trying to make me feel better so you park the car near my house and you saw these cute little shih tzu. You know how I adore them so you excitedly got off the car and hurriedly went to the owner to play with his dogs. Later did you know that the dogs are biting you and you were already bleeding —you ended up taking yourself to the hospital and taking anti vaccine for 2 months I think – I’m sorry for this.\n\nWe also had this conversation when it is all about teasing your big nose. I still found it funny.\n\nFor 365 days, I tasted a little piece of heaven and it’s been 120 days since I’m back on earth. Earth is good, realistic and favorable for me but somehow it is incomplete.", "opengraph": {"type": "article", "title": "I’m Lying To Myself When I Say I’ve Moved On From You", "url": "https://thoughtcatalog.com/angela-marie-mauhay/2016/10/im-lying-to-myself-when-i-say-ive-moved-on-from-you/", "description": "For the past months that seem to be an eternity, I thought I got over everything and I was so sure that I was OK", "article:published_time": "2016-10-25T14:48:31+00:00", "article:modified_time": "2016-10-27T20:36:23+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2016/10/613c2071.jpeg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US"}, "tags": ["Exes", "Letting Go", "Love", "Breakups", "Love & Relationships", "Memories", "Moving On", "Love & Dating"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2016-10-25T14:48:31+00:00"}