{"result_id": "313040", "URL": "https://thoughtcatalog.com/lexy-stang/2015/02/a-letter-to-all-the-anti-vaccinators-out-there/", "timestamp": "2023-04-25 17:40:22 CEST+0200", "meta": {"description": "An unvaccinated child puts children with compromised immune systems at risk.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/lexy-stang/2015/02/a-letter-to-all-the-anti-vaccinators-out-there/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "What We (Don’t) Talk About When We Talk About Vaccinations", "cleaned_text": "I’ve been trying to gather my thoughts on the recent outbreak of measles and the rise of the anti-vaccination craze. The world is a scary place, and the Internet is a big mess of opinions presented as truth, distorted facts, and constant bickering.\n\nThroughout all of the articles I’ve read on this subject, people throw fact after fact of statistics and data and numbers. For whatever reason, the proof that vaccines are good for your child is not enough for some people. But what people need to know is this: not vaccinating your child is reckless and irresponsible. I can’t tell you what to do with your child, but you can’t have control over another child’s health.\n\nAn unvaccinated child puts children with compromised immune systems at risk. An unvaccinated child puts babies too young to be vaccinated or children with allergies who can’t be vaccinated at risk. An unvaccinated child puts perfectly healthy people at risk for diseases we have already essentially stopped.\n\nSo why don’t people vaccinate? They’re afraid of the chemicals in vaccines. We all know chemicals have no other way of entering your child’s body other than breakfast cereals, candies, sodas, fruit snacks, Kraft Mac N Cheese, sports drinks, Sunny D, Kool-Aid, and other foods that have things like food dyes, artificial sweeteners and preservatives. I’m not sure if any of those unnatural ingredients have been known to prevent any deadly diseases, but I’m pretty sure vaccinations do that sort of thing.\n\nSome people think vaccinations are a conspiracy. But with polio cases down 99%, measles down 74%, and deaths from neonatal tetanus down a whole lot, too, it’s hard to believe.\n\nI think the real reason that people are desperately afraid of admitting is the fear that vaccinations cause special needs like autism.\n\nAccording to some recent data, 25-35% of the people polled believe that vaccinations cause autism. That’s a pretty big number, considering the original study has been officially retracted and the author has been proven false and no longer has a medical license. To the people who insist on believing what they read on the internet: stop listening to the latest opinion based, not researched blog post and start reading up on this opinion based, researched post.\n\nEveryone wants to be the parent who loves his or her child unconditionally. No one wants their child to face the obstacles that come with special needs.\n\nBut when you say you don’t want to vaccinate your child, you’re saying you’d rather have a dead child than a child with special needs.\n\nFirst of all, special needs aren’t the death sentence you might think they are. As my family has learned with my little brother, who has a cocktail of diagnoses including autism, having special needs is not the worst thing that could happen in your family. No, my brother will not attend college or live on his own. And no, my brother will not have a wife or kids to vaccinate in the future. But if the worst thing you can imagine for your child is they won’t grow up, then you’re the weird one.\n\nMy family goes to Disneyland because it’s Niko’s favorite place on Earth. My older brother, Michael, chose a career in teaching because of Niko. I spent the past four (best) summers at my camp because of how accepted Niko always was in the program.\n\nWe’re involved in programs and groups we never would have been if we didn’t have Niko. We all speak fluent Niko, which is mostly the entire script from Toy Story plus some theater songs and some lines from Winnie the Pooh and Barney. We get a lot of laughs with Niko. We have a lot of tears over Niko. But he always brings us home. He keeps us together.\n\nYes, we have had some problems. We’ve had difficult years when everything seemed impossible, but as the song at the end of Niko’s favorite Disney ride says, we have plenty of sunshine heading our way. (Seriously, Niko made us ride that one 17 times in one vacation.) It’s a different life, but it’s not a bad life.\n\nStop equating special needs with a less valuable life.\n\nWhen you choose to not vaccinate your child out of a ridiculous and false fear, you’re unintentionally offending everyone out there who is living with special needs. I could never dream of a life without our very own Peter Pan.\n\nWe need to get over the fear that your child may not turn out to be exactly what you expected. Your child may not be anything you expected. But you will love your child, strangeness, strengths, weaknesses, and all.\n\nWould I rather have a special needs brother who made my life (a lot) harder, who has challenged me and frustrated me and brought me so much joy and happiness? Or would I rather have a brother who had a bad reaction to the chicken pox and died as a baby? I think even as a three year old, I could’ve told you the right answer.\n\nSo listen to your doctor, vaccinate your kid and join the sick-free club.*", "opengraph": {"type": "article", "title": "What We (Don’t) Talk About When We Talk About Vaccinations", "url": "https://thoughtcatalog.com/lexy-stang/2015/02/a-letter-to-all-the-anti-vaccinators-out-there/", "description": "An unvaccinated child puts children with compromised immune systems at risk.", "article:published_time": "2015-02-11T13:15:05+00:00", "article:modified_time": "2015-02-11T16:37:13+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/02/shutterstock_178155887.jpg?w=1000&h=667&crop=1", "image:width": "1000", "image:height": "667", "locale": "en_US"}, "tags": ["science", "Special Needs", "Writing & Expression", "Anti-Vaccination", "Anti-Vaccinator", "Autism", "Vaccination", "Culture & Art"], "tweets": [], "movies": [], "links": ["http://www.autismsciencefoundation.org/sites/default/files/CHOP3.pdf", "http://www.cdc.gov/vaccines/vac-gen/additives.htm", "http://www.epa.gov/pesticides/food/", "http://www.hlntv.com/article/2014/10/30/ingredients-banned-other-countries-america-allows-chemicals-food", "http://www.thehealthsite.com/diseases-conditions/why-artificial-food-colours-are-bad-for-your-health-po0115/", "http://www.who.int/features/factfiles/immunization/facts/en/index7.html", "http://www.who.int/features/factfiles/immunization/facts/en/index6.html", "http://www.who.int/features/factfiles/immunization/facts/en/index8.html", "http://www.nbcnews.com/id/35638229/ns/health-childrens_health/t/parents-thinks-shots-cause-autism/#.VNFppFXF96E", "http://www.disabilityscoop.com/2014/04/09/autism-vaccine-widespread/19267/", "http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(97)11096-0/abstract", "http://www.cnn.com/2011/HEALTH/01/05/autism.vaccines/", "http://www.nytimes.com/2010/05/25/health/policy/25autism.html", "http://tcat.tc/183zIFz", "http://thoughtcatalog.com/abby-heugel/2015/01/21-struggles-only-skinny-girls-will-understand/", "http://tcat.tc/1vgHC3e"], "authors": [], "publish_date": "2015-02-11T13:15:05+00:00"}