{"result_id": "313021", "URL": "https://thoughtcatalog.com/jon-beaty/2017/03/how-to-turn-around-4-negative-behaviors-that-not-only-cripple-your-relationship-but-also-your-health/", "timestamp": "2023-04-25 17:40:06 CEST+0200", "meta": {"description": "If you are unhappy about something in your relationship, by all means express it.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/jon-beaty/2017/03/how-to-turn-around-4-negative-behaviors-that-not-only-cripple-your-relationship-but-also-your-health/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "These 4 Negative Behaviors Might Be Making You Sick — Here’s How To Change That", "cleaned_text": "Many health experts won’t tell you that married couples can actually prevent the common cold and seasonal flu by reducing the negative behaviors in their marriage. During the winter months when runny noses, coughs, and fevers are all too common, we’re reminded to wash our hands, avoid contact with sick people, and get a flu shot. Another preventative measure you can take is to increase your positive behaviors toward your spouse.\n\nResearchers at the University of Birmingham in the United Kingdom, who studied married couples’ antibody response to an influenza vaccine, found that people in satisfying marriages had stronger immunity to flu viruses. Researcher Greta Hysi at the University of Tirana in Albania reviewed 40 studies on the effects of marriage on health. She found that higher levels of negativity which contribute to marital dissatisfaction also directly impact a couple’s physical health.\n\nHysi’s research also included a review of Dr. Gottman’s Love Lab studies, which found higher white blood cell counts in couples that were happily married. This finding is similar to that of Drs. Janice Kiecolt-Glaser and and Ronald Glaser at Ohio State University, who found natural killer cells are more effective in fighting off disease in happily married couples.\n\nFinally, researchers Lois Verbrugge and James House of the University of Michigan found an unhappy marriage can increase your chances of getting sick by 35% and even shorten your life by an average of four to eight years! According to Dr. Gottman, “working briefly on your marriage every day will do more for your health and longevity than working out at a health club.”\n\nThe Four Horsemen of the Apocalypse\n\nWhen negative behaviors are allowed to run loose in a marriage, they put both the emotional and physical health of the couple at risk. Dr. Gottman calls the four most dangerous behaviors in a relationship the “Four Horsemen of the Apocalypse.” The term is adopted from the Book of Revelation in the New Testament of the Bible where a prophecy reveals the horsemen as signs leading to the end of the world.\n\nIt happens daily. Dave and Lisa are caught in cycle of criticism, which is aimed at a person’s character instead of their behavior. It is most often packaged in “you always” or “you never” statements.\n\nLisa bought Dave a new watch for his birthday. She thought he’d like it. He didn’t.\n\n“I don’t need a watch,” he said. “I use my phone to check the time.”\n\n “You need to check your phone more often. You’re always late to everything. I thought the watch would help.”\n\n“I don’t like watches. I haven’t worn a watch in years. Where have you been? I always have to spell things out for you.”\n\nDave and Lisa would welcome an occasional critique or complaint from each other instead of constant criticism. This pattern of finding fault causes the victim to feel hurt, rejected, or attacked. They’ve made a habit of calling out each other’s mistakes. In some relationships only one partner engages in criticism. Whether it’s one or both, this negative focus on each other’s flaws and failures paves the way for much darker horsemen.\n\nJordyn is mean. When she speaks to Rafael, it’s often with disrespect and ridicule.\n\n“You want me to make you dinner? You are so lazy. You expect me to feed you and clean up after you. You come home and turn on the TV and don’t even acknowledge me. You can pick up after yourself.”\n\nContempt can also be expressed by body language such as eye-rolling.\n\nContempt is cultivated by long-standing negative thoughts about one’s partner. Frequent criticism serves as evidence that contempt may soon rear its ugly head. The contemptuous spouse feels superior to their partner and openly expresses it in words and actions that leave their spouse feeling despised and worthless.\n\nAustin and Chris blame each other for most of their problems.\n\nAustin: “We got a late notice on our phone bill. You forgot to pay it again.”\n\nChris: “I didn’t get the statement. You didn’t put it with the bills.”\n\nAustin: “You know we get a monthly phone bill. If you didn’t see it, you need to look for it. I put it on the desk!”\n\nChris: “Paying bills isn’t the only thing I have to do around here, you know. Is it to much to ask for a little help?”\n\nWhen a marriage is coming apart, nearly every conversation is laced with defensive comments. The accuser doesn’t want to take responsibility for problems. The defender feels unjustly accused and uses defensiveness to get their accuser to back off. Defensiveness tells the accuser you don’t take them seriously and puts the blame back on them. This cycle of blaming each other eats away at any trust that remains in the relationship.\n\n \n\n 4. Stonewalling\n\nAnna feels the chill. She asks Marco why he’s become distant. She asks him to tell her what’s on his heart.\n\nMarco laughs. He walks out of the room. He eats by himself. He waits until Anna’s asleep before coming to bed.\n\nStonewalling occurs when one or both partners withdraw from the conversation. When issues arise, stonewallers turn away from each other rather than toward. They leave the room or act busy doing something else.\n\nTurning the Four Horsemen away\n\nThere is help and hope for marriages that have been invaded by the Four Horsemen of the Apocalypse. Marriages that have been infected by the negative behaviors of criticism, contempt, defensiveness, or stonewalling can be restored to health.\n\nEven the most successful relationships have conflict. Dr. Gottman’s research has shown that it’s not the appearance of conflict, but rather how it’s managed that predicts the success or failure of a relationship\n\nThe antidote for criticism\n\n The antidote for criticism is to complain without blame. Talk about your feelings using I statements and then express a positive need. What do you feel and what do you need?\n\nIf you are unhappy about something in your relationship, by all means express it.\n• What not to say: “You said you’d clean up, but there are still crumbs on the table. You never do what you say you will.”\n• What to say instead: “There are still crumbs on the table. I need help cleaning up.”\n\nThe antidote for defensiveness\n\n The antidote is to accept responsibility, even if only for part of the conflict.\n• What not to say: “It’s not my fault that we’re always late, it’s your fault.”\n• What to say instead: “Well, you’re right. Part of this is my problem – I need to do a better job managing my time.”\n\nThe antidote for contempt\n\n The antidote is building a culture of appreciation and respect. Focus on building your friendship by focusing on the first three principles in The Seven Principles for Making Marriage Work.\n• What not to say: “You’re an idiot.”\n• What to say instead: “I’m proud of the way you handled that teacher conference.”\n\nThe antidote for stonewalling\n\n Stonewalling occurs when the listener withdraws from the interaction. If you keep going, you’ll find yourself exploding at your partner or imploding (stonewalling), neither of which will get you anywhere.\n\nThe only reasonable strategy, therefore, is to let your partner know that you’re feeling flooded and need to take a break. That break should last at least twenty minutes, since it will be that long before your body physiologically calms down.\n\nBy being aware of the Four Horsemen and their antidotes, you will not only create a healthy relationship, but also a healthier you.", "opengraph": {"type": "article", "title": "These 4 Negative Behaviors Might Be Making You Sick — Here’s How To Change That", "url": "https://thoughtcatalog.com/jon-beaty/2017/03/how-to-turn-around-4-negative-behaviors-that-not-only-cripple-your-relationship-but-also-your-health/", "description": "If you are unhappy about something in your relationship, by all means express it.", "article:published_time": "2017-03-02T21:00:50+00:00", "article:modified_time": "2017-03-03T21:40:06+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2017/03/31747668095_0351e6ef97_o.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US", "article:author": "https://www.facebook.com/jonbeaty777"}, "tags": ["Couples", "Dating", "Heart Catalog", "Love", "Marriage", "Relationships", "Communication", "Health", "Heart", "Arguing", "Health and Wellness"], "tweets": [], "movies": [], "links": ["https://thoughtcatalog.com/lindsey-addawoo/2015/01/20-new-and-improved-cliches-for-you-to-embrace-in-2015/", "https://www.gottman.com/subscribe-for-free/", "https://thoughtcatalog.com/owen-roberts/2010/08/cyrus-movie-duplass-delillo-depression-divorce/", "https://thoughtcatalog.com/ayodeji-awosika/2015/07/10-attitude-diseases-that-destroy-your-chances-of-living-a-good-life/"], "authors": [], "publish_date": "2017-03-02T21:00:50+00:00"}