{"result_id": "313016", "URL": "https://thoughtcatalog.com/brian-n-gates/2015/03/27-stories-about-going-to-the-doctor-that-will-leave-you-breathless-and-totally-embarrassed/", "timestamp": "2023-04-25 17:40:02 CEST+0200", "meta": {"description": "I haven't ejaculated from a prostate exam...yet.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/brian-n-gates/2015/03/27-stories-about-going-to-the-doctor-that-will-leave-you-breathless-and-totally-embarrassed/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "27 Stories About Going To The Doctor That Will Leave You Breathless And Totally Embarrassed", "cleaned_text": "2. When I was 18 I had a lump on one of my testicles. I went in to my normal family doctor to check it out and he said we needed to get an ultrasound on it to make sure it wasn’t cancer. Scary shit for an 18-year-old boy (or anyone, really).\n\nSo, I went to the imaging center, did the paperwork and went into the room and sat on the table. After a couple minutes of waiting in comes the nurse. She was blonde, probably about 25 and was smoking hot.\n\nShe told me to take my pants off, lay down on the table and spread my legs a bit. I instantly started feeling that familiar tingle down low and knew I was in for some trouble. She rubbed the jelly on the ultrasound camera and then put a little on her fingers and rubbed it onto my balls. Feels good man. She gently flipped my penis up and covered it with a towel so that just my scrotum was exposed, and that did it… I had a full fledged hardon within 6 seconds.\n\nMy face filled up with blood I was so embarrassed, and of course she knew. I tried to take my mind off of it by asking her questions about the machine and how it worked (did you know that they can place the cursor on the screen onto the image of a vein or artery and the machine will only pick up sound for that specific part?). After about 15 minutes of her slowly rubbing that plastic tool all over my nuts, she finished up and said “Well, your testicles are healthy! Just some blockage in the vas deferens.” And then she told me that masturbation should help clear it up.", "opengraph": {"type": "article", "title": "27 Stories About Going To The Doctor That Will Leave You Breathless And Totally Embarrassed", "url": "https://thoughtcatalog.com/brian-n-gates/2015/03/27-stories-about-going-to-the-doctor-that-will-leave-you-breathless-and-totally-embarrassed/", "description": "I haven’t ejaculated from a prostate exam…yet.", "article:published_time": "2015-03-25T12:36:23+00:00", "article:modified_time": "2019-09-27T20:23:28+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/03/5936305758_74814ffa25_b.jpg?w=1024&h=768&crop=1", "image:width": "1024", "image:height": "768", "locale": "en_US"}, "tags": ["Reddit", "At The Doctor's Office", "Hospital", "Humor", "Embarrassing Moments", "Doctor", "The Internet", "AskReddit"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2015-03-25T12:36:23+00:00"}