{"result_id": "313023", "URL": "https://thoughtcatalog.com/jeremy-london/2018/08/botched-executions/", "timestamp": "2023-04-25 17:40:07 CEST+0200", "meta": {"description": "Heads catching on fire, witnesses sprayed with lethal chemicals, and the smell of sizzling human flesh.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/jeremy-london/2018/08/botched-executions/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "13 Worst Botched Executions Of All Time", "cleaned_text": "A list of the worst botched executions of history.\n\nRegardless of how one feels about the death penalty, only armchair sadists would agree that it’s justified for the government to torture murderers with the same lack of compassion that the murderers used to kill their victims—after all, we’re taught very early in life that “two wrongs don’t make a right.”\n\nDuring the 120-year span from 1890 to 2010, nearly 9,000 people were legally executed in America. Of these, an estimated 276 were “botched” in some way—in other words, the execution didn’t proceed exactly as planned and may have required additional attempts. In many cases, it also involved unplanned suffering on the convict’s part to the point where witnesses were traumatized.\n\nIronically, lethal injection was introduced late in the game as the most “humane” method of capital punishment, yet it has the highest rate of botched attempts out of all—just over 7% of lethal injections ran into some form of difficulty. This compares to 5.4% for the gas chamber, 3% for hanging, and just under 2% for the electric chair. By comparison, death by firing squad—once considered the most brutal and ineffective method of all—resulted in zero botched executions in the 34 times it was performed from 1890 to 2010.\n\nThese 13 cases involve some of the most gruesome examples of public execution gone wrong in world history.\n\nWhen he was placed into the electric chair in May of 1990, convicted murderer and rapist Jesse Joseph Tafero required three jolts of power before it killed him. An “inadvertent human error” involving the use of a synthetic sponge rather than a natural sponge was blamed for the error, but in the first two attempts to kill Tafero, witnesses said they saw flames erupting from Tafero’s head. Inmates at the prison claimed they could smell his burning flesh for days after he was killed. Perhaps the most tragic part of this story is that after his death, one of Tafero’s accomplices claimed responsibility for the murders for which Tafero received the death penalty.\n\n2. It Took 11 Blows From An Ax To Kill Her\n\nAn English aristocrat who lived in the 1400s, Lady Margaret de la Pole suffered the misfortune of getting entangled in the bloody dispute over King Henry VIII’s attempts to divorce the queen and marry Anne Boleyn. Although she was guilty of nothing, she was arrested for treason placed in the Tower of London for over two years before finally facing a public execution—at the hands of an axe-wielding man with extremely bad aim. In front of about 150 onlookers, the executioner hacked at her a total of 11 times before finally decapitating her. Lady Margaret undoubtedly experienced tremendous agony before finally being killed.\n\n3. The First Ten Bullets Didn’t Kill Her\n\nTo the Western eye, Thai names are hopelessly complicated, and “Ginggaew Lorsoungnern” is certainly no exception. A domestic maid for an elite Bangkok family, she kidnapped the family’s six-year-old son and delivered him to a gang that held him for ransom. The family refused to pay the ransom, and the gang stabbed the boy repeatedly. However, this is not what killed him, as coroners later determined he died from suffocation after being buried alive. For her part in the boy’s murder, Lorsoungnern was sentenced to death by firing squad. After being tied to a cross and riddled with ten bullets, examiners saw no vital signs in the woman. Her body was moved into a morgue, but once placed upon the morgue table, she began to sit up. It took another 15 bullets to finally kill her.\n\n4. The Room Filled With Smoke And The Smell Of Burning Flesh\n\nAfter an extended crime spree of 30 armed robberies, nine kidnappings, and finally the murder of a pawn shop owner, John Evans was arrested in Alabama and sentenced to death. He told officials that if released, he would kill again. In April 1983, Alabama officials strapped him into an electric chair and delivered a fatal jolt…or what they thought was a fatal jolt. According to one reporter, “Smoke and sparks…came out from under the hood in the vicinity of Evans’s left temple” after this first jolt. But examiners found that his heart was still beating. It took two more jolts and a total of 14 minutes before Evans was finally dead. Witnesses said they smelled smoke and burning flesh, and after the third jolt, Evans’s dead body was left “charred and smoldering.”\n\n5. He Died Banging His Head Against A Steel Pole\n\nIt’s hard to feel sorry for Jimmy Lee Gray—after being paroled for killing his girlfriend, he kidnapped a three-year-old girl, raped her, tried drowning her in a creek, and finally killed her by stomping on her neck and snapping it. Sentenced to die in a Mississippi gas chamber, it took nearly eight minutes to kill Gray—during which witnesses had to be cleared from the room after he began moaning and smashing his head against a steel pole inside the gas chamber. Some have speculated that due to the nature of his crimes, his execution was deliberately botched. After Gray was dead, it was revealed that his executioner had been drunk.\n\nSentenced to die by lethal injection for the fatal shooting of a Texas restaurant owner, Raymond Landry was led into a room and injected with fatal chemicals on December 13, 1988. However, the IV needle that had been placed in Landry’s arm exploded, spraying the lethal fluids toward witnesses. Witnesses heard him groan at least once during the ordeal. A second injection was attempted and finally proved successful. But from start to finish, it took an estimated 40 minutes to kill Landry.\n\n7. “I Saw His Body Turn From Red To Purple”\n\nSentenced to the gas chamber in Arizona in 1992, Donald Lee Harding endured an agonizing 10 minutes while violently struggling against his restraining straps before he finally succumbed. One reporter who saw the execution said that Harding spasmed and jerked for nearly seven minutes. Another witness claimed that two other witnesses were “walking vegetables” for days after viewing his ex execution. According to TV reporter Cameron Harper, “Obviously, this man was suffering. This was a violent death … an ugly event. We put animals to death more humanely.”[24] Another witness, newspaper reporter Carla McClain, said, “Harding’s death was extremely violent. He was in great pain. I heard him gasp and moan. I saw his body turn from red to purple.”\n\n8. Blood Was Forming In The Shape Of A Cross\n\nDue to his tremendous size—about 350 pounds—Florida officials constructed a special electric chair to dispatch killer Allen Lee Davis. According to witnesses, the spectacle was brutal: “Before he was pronounced dead … the blood from his mouth had poured onto the collar of his white shirt, and the blood on his chest had spread to about the size of a dinner plate, even oozing through the buckle holes on the leather chest strap holding him to the chair.” A Florida state senator who viewed the execution photos said that the blood eventually formed the shape of a cross, which she took as a sign that God had approved of the execution.\n\nBack in the late 1800s, Tom “Black Jack Ketchum” was a classic Old West outlaw, part of a posse that robbed and killed its way across New Mexico and Texas. He was finally arrested and sentenced to death by hanging in Clayton, NM. But because executioners forgot to remove the 200-pound sandbag that was used to test the gallows before hanging Ketchum, the rope was especially tight. Instead of merely hanging to death, Ketchum was decapitated.\n\nThis story is amazingly similar to that of Tom Ketchum’s in that it happened in the Southwest in the late 1800s and involved a botched hanging that decapitated the victim. It was different in that it happened in Arizona rather than New Mexico and involved a female murderer, Eva Dugan, who insisted on her innocence up until the end. When her head snapped off, it rolled right in front of spectators’ feet, shocking the crowd. Immediately after the execution, Arizona replaced the gallows with the gas chamber as their preferred mode of execution.\n\n11. A Billow Of Smoke And The Odor Of Burning Hair\n\nIn 1890, William Kemmler, convicted of murdering his wife with a hatchet, went down in history as the first criminal to die in the electric chair. After one strong jolt, officials assumed Kemmler was dead, only to realize that he was still bleeding from his hands and mouth, indicating that his heart was still pumping. He was indeed alive and started groaning loudly. He received a second jolt, which according to one scribe caused “sickening sizzling sound [to come] from the chair, as if meat was being cooked upon it, followed by a billow of smoke that filled the room with the odor of burning hair.” Although witnesses were traumatized, Kemmler was finally dead.\n\n12. A Crown Of Foot-High Flames Over His Head\n\nIn 1997, convicted murderer Pedro Medina was placed in a Florida electric chair, but his execution did not go smoothly. According to one observer, “A crown of foot-high flames shot from the headpiece during the execution, filling the execution chamber with a stench of thick smoke and gagging the two dozen official witnesses.” The power was temporarily switched off, but Medina kept writhing and burning until he finally died.\n\n13. The Odor And Sizzling Sound Of Burning Flesh\n\nFrank Coppola was a Virginia cop who was sentenced to death for the 1978 murder of his girlfriend, during which he repeatedly slammed her head in the floor. After she was dead, Coppola and accomplices absconded with over $3,000 and some jewelry from the crime scene. In 1982 he finally was strapped into an electric chair. After an initial jolt that lasted an agonizing 55 seconds, he still wasn’t dead, whereupon he received another 55-second jolt, which witness say produced the smell and sound of burning flesh. The second jolt was also so intense that it caused both of Coppola’s legs to burst into flames.", "opengraph": {"type": "article", "title": "13 Worst Botched Executions Of All Time", "url": "https://thoughtcatalog.com/jeremy-london/2018/08/botched-executions/", "description": "Heads catching on fire, witnesses sprayed with lethal chemicals, and the smell of sizzling human flesh.", "article:published_time": "2018-08-23T17:00:43+00:00", "article:modified_time": "2021-02-08T05:05:43+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2018/08/sq_lethal_injection_room.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "image:alt": "Botched Executions", "locale": "en_US"}, "tags": ["True Crime"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2018-08-23T17:00:43+00:00"}