{"result_id": "313014", "URL": "https://thoughtcatalog.com/emily-madriga/2020/03/real-horror-stories-from-people-in-covid-19-outbreak-areas/", "timestamp": "2023-04-25 17:40:00 CEST+0200", "meta": {"description": "\"All in all, life is going on mostly as it was before but there's very few people around.\"", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/emily-madriga/2020/03/real-horror-stories-from-people-in-covid-19-outbreak-areas/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Real Horror Stories From People In Covid-19 Outbreak Areas", "cleaned_text": "Trigger warning: Don’t read this if you’re going to freak yourself out about Covid-19.\n\nWhat hospitals are like\n\n“I am a doctor who works at one of the largest hospitals in Rome. The situation seems much worse than reported in the news. We are scared, but we continue to go to work for a sense of responsibility by turning. We do not have suitable safeguards for our protection, such as ffp3 masks.” — bulletime\n\n“I am a nurse at Level 1 trauma center hospital in Detroit. I swear COVID has been around for weeks. There are several members of my surgical team that have been hit hard with respiratory and fevers. We may have misidentified this as the flu. There has been a lack of communication, policy, and testing. My hospital doesn’t have a plan. My wife is an accountant and they have a plan to work from home. Again, my hospital does not. This means we are continuing to operate as usual until we physically cannot.” — BigODetroit\n\n“Since yesterday night, every town is locked down. I cannot move 5 km without a proper reason (work, or a relative very sick and so on) otherwise a could get arrested. The government, immediately backed up by lots of celebrities, is basically saying “please, stay home”. Our emergency departments in the hospitals are collapsing. Literally, chemos or surgeries that are “not urgent” are being delayed (how’s a chemo not urgent?). Bars and restaurants can only open from 6 am to 6 pm. It’s been over a month that places where big number of people could meet have been closed (discos, sport centers, clubs, schools and universities). It’s crazy.” — Davide1011\n\n“My uncle contracted it. It’s much more serious then people believe. It made my otherwise healthy 48 year old uncle flat out unable to breathe. He’s been dependent on a ventilator for 4 days now. He’s not going to die and will recover… but it would be different if he didnt have access to a ventilator.\n\nWhat scares me is what will happen when it spreads. I work in a hospital. The resources to put everyone on a ventilator just do not exist.” — Myhandsunclean\n\n“I haven’t got it, but my dad works at a hospital in Washington where they have started treating people. He told me that they are probably going to discharge someone tomorrow but there are another few suspected cases. They are preparing for a massive influx of cases also, they are optimistic that this will be under control soon. He doesn’t work at Evergreen Health Clinic where the two deaths have been, so he has only seen the ‘mild’ cases so far.” — PolarBear_293\n\n“The most frightening thing is going to be the economy. Not only stock prices, but all the small businesses that survived and that support small communities: my parents own a big electrotechnical company, but their biggest clients are the government, airports and big corporations, that now don’t allow anyone inside. It’s looking pretty bad and the worst is yet to come according to academic studies” — TheShadowPizza\n\n“We have one case at the moment and its a girl who flew in to Chicago from Italy. Then she proceeded to take a train to STL. Once home she got sick and it was suspected she was infected. So she was tested and it came back “pre” positive. The health department told her and her parents to self quarantine. Well the dad thought it was ridiculous (very affluent and arrogant) so he decided to go ahead and take his other daughter to a “father daughter dance” at her private school. People lost their shit and started threatening him so he had an attorney make a statement and said “I didn’t know”… the Health Dept said “the fuck you didn’t”. The parents of the school are already threatening to sue him if their kids get sick. It’s the first time I have heard threats like that made.” — TheOrionNebula\n\n“I’m not concerned about the virus itself. No elderly relatives to worry about, all of my friends and family are young enough to be unharmed.\n\nWhat concerns me is the potential civil unrest. The fear and panic, combined with the need for a lot of people to self-isolate, the overstretching of public services e.t.c. Could be a lot worse than the disease itself. My country seems to be handling things very well, considering. It could still turn into a pandemic as much here as anywhere else though.” — Bribase\n\n“I live in Japan and the country is in full freak-out mode right now. Schools have been closed as well as some museums and even arcades. A lot of people aren’t leaving their houses either, which is actually kind of awesome because the trains aren’t sardine-packed right now. Even still, I don’t have it half as bad as my friend who lives in Hong Kong. He and his wife are going stir-crazy from the quarantine and the associated panic. Personally, I’m not the least bit worried and, while I don’t want to downplay the virus, I can’t shake the feeling that people all around the world are grossly overreacting to it.” — schnit123\n\n“If you want some sobering facts. check out the Spanish flu on Wikipedia. We may now have antibiotics but we can also circle the globe in a day. Bad shit happens. Just because it doesn’t exist in your world of experience doesn’t mean it isn’t real. If they told you a tornado was coming would you ignore it because you haven’t experienced one? Take care of yourself and wash your hands. Many people with flu die of pneumonia and secondary bacterial infections. Many people during the Spanish flu died for these reasons. I just finished reading that 28,000 people fly into the US from China a day and have been doing so since the virus broke in January.” — Carollee1\n\n“I live in the heart of the Lombardy region. All my family has it and my grand uncle died. People just stay home and that’s it. There is not much to do and shops are closed.\n\nYou can hear ambulances all day and night.\n\nMy uncle is in the hospital with a high fever. His wife got it as well but she is home as her symptoms are milder. My cousin is taking care of her and miraculously she is fine.\n\nHowever her grandpa died and she couldn’t even go to visit him. Her grandma is sick as well and she can’t see her either and she can’t see her dad. Hospitals are closed.\n\nThe available hospital beds in intensive care have run out and doctors are making tough choices for who to try to save which is terrifying considering most of my family is old and they might not get a bed.\n\nDoctors are overworked and tired and since I know many people that work in the hospital, they are sharing with me these gruesome pics of people recovered in the intensive care unit. They are intubated and it just is a sad view.\n\nHospitals are so full of people on life support because of Coronavirus people are amassed on the corridors because they lack rooms:\n\nMy friend who gets people with the ambulance is working non stop to get people who are in critical conditions.\n\nPeople keep saying it’s just a flu. Yes sure, but a flu without having had a vaccine can be quite dangerous. The youngest person I know that has it, he is in his forties and has had 40 degrees Celsius temperature for two weeks straight and counting.\n\nDon’t catch it, it’s really not fun even if your immune system is strong, trust me on this, I have seen the repercussion on my family first hand.\n\nNo church is open or public event is held.\n\nSince Italy is primarily populated by old people, we are used to see the streets being empty and everything being quite. Right now is just quieter.\n\nThey couldn’t even held the funeral for her grandpa.\n\nMy grandma woke up sick and I truly hope she has something else.\n\nSo many people in my city have it and yet they keep going around the city and spreading it. Incredible.\n\nSome people go to the supermarket and get out of it with tons of food so that they don’t need to go shopping again. Others, like my grandma, go everyday because “how else is she going to get fresh bread?” Luckily we have convinced her that she cannot go anymore and she said from tomorrow she won’t leave the house. Just this Sunday she HAD to go to church to confess. The town priest has been taken to the hospital today because he catched Coronavirus and he is in critical conditions.\n\nI wonder how this death count will go up now that the hospitals are overfilled.\n\nRumor has it that my cousin’s grandma got it because she was in the hospital being treated because she broke her back but I can’t be sure about this so this is just our personal speculation based on no real evidence so don’t take my word for it.\n\nThank you all for the well wishes. Hopefully my most immediate family won’t catch it.” — MsMerdaccino\n\n“Italy is most likely a few days, possibly a week ahead of other nations in its infection rates. So it is still most likely worse there than other places.\n\nI fully expect other countries to soon be in the same sort of boat, though. Switzerland went from 1 to 100 in a week, and in about 4 days is now up to 375. This is representative of the growth factor that we saw in italy. Obviously, the population is smaller, but so far it seems to be a few days behind Italy in terms of infection rates.\n\nFundamentally though, the problem is that many places simply aren’t engaging in lots of testing. We know this disease is highly contagious. We know that it has an incubation period of around 5 days.\n\nIf we look at Spain, for example, it went from 100 infect to 1000 infected in a week. This is the same rate (roughly) as in Italy, between the 23rd and 29th of February. In other words, Spain is about 10 days behind Italy. I would expect Spain, by the 20th of March, to be sitting roughly where Italy is today, i.e. somewhere between 9k-10k infected.\n\nThings are probably worse in Italy than elsewhere, but it’s a question of “days until shit hits the fan elsewhere” more than “this problem will not be as bad in other countries”.” — Cybugger\n\n“I basically live in the epicenter of the outbreak of Coronavirus here in Italy. Things are difficult for me because I am far from my parents (like 1 hour drive), they are in their 70s and I am stuck because I don’t wanna go home since I am scared I could possibly infect them…but at the same time I wanna help them with groceries and stuff.\n\nI am currently working from home and going out only once a week to do grocery shopping.\n\nTo move between different towns we need a document attesting that we are either going home, work or it’s an emergency.\n\nThe hardest part is hearing the daily update of the number of deaths and sick people.. everyday we are told that hospitals cannot accept people anymore, all the hospitals here in the Lombardy region are saturated, nurses and doctors are falling sick too…if you need to go to an emergency room (even if it is not for the coronavirus) they cannot help you and this feeling is devastating.\n\nMoreover there are no masks around, it’s impossible to find them and hospitals are finishing them too.\n\nWaking up every day to this is hard but I’m still hopeful that this thing will end soon.” — CharlesOnReddit\n\n“I’m in Daegu, South Korea. We are adding almost 500 cases a day. Shopping is closed. Streets are empty.\n\nOutside of Wuhan, Daegu has the most cases.\n\nNot enough masks, Lysol wipes are sold out, hand sanitizer is gone.\n\nI’m not concerned for myself but rather for my two young kids.\n\n“I have a daughter living in Saronno, but she works in Milano. She is house bound, on lock down. Her courses are being done via Skype. Her employer has asked her not to come to work. She is not allowed to leave her house unless it is an emergency (which I hope never happens). She says there has been quite a bit of panic buying at the Supermarkets. All the restaurants are pretty much empty, however they are allowed to be open between 6am and 6pm (people who are seated should have at least a 1m distance between them at restaurants). Tourist areas (eg Duomo in Milano) are devoid of almost anybody. All school and University’s remain close, all sporting or any kind of events have been suspended, ski resorts are closed, the same for cinemas, theaters, discos, all church services have been suspended. Whilst the measures may seem extreme, Italy has been the hardest hit worldwide besides for China, so it’s necessary to curb travel and cultural activities to stop the spread of the virus.” — QueenDiva9\n\n“We never lockdown in Seoul, Korea. I think because every covid-19 related workers doing their job greatly. We live daily life as usual.(mostly)\n\nThe evident difference is that the companies, some industries are under serious, stressful circumstances in financial. Due to everything has postponed or canceled / or manufacturing delay (lots of supplies were supposed to import from China).\n\nSome major corporations were ordered their employees to work from their home for a few weeks as precaution. During that period, there were no traffic in the city. It was weird.” — AlexYORR\n\n“It’s fucking outrageous, I’m crying right now while I’m typing these words. I’m 19, I study IT in University and both my mother and my father (divorced) have lost their job for at least the next month. It’s already really hard normally, right now the situation is terrible. This morning I’ve spent hours looking for good web sites where to sell our paintings and everything that allow us to continue living. Even before this whole thing started I was looking for a job to get some money while studying so to help my family, but right now I can’t even go to an interview because movements are allowed only for working (if you already have a job) and health issues. I live in the region where this whole thing started in Italy, yesterday night our government has extended our rules to all regions of Italy, so this means that the number of people living my situation has only increased. I never imagined I would ever lived this nightmare” — Asto24\n\nWhat it’s like to have Covid-19\n\n“I’m a very healthy person, (normally), for me it’s like a really bad flu mixed with a little shortness of breath and sore throat. I’ve quarantined myself, mostly to protect people in my city who can’t fight it off.” — _ExecutorTassadar_\n\n“Im 28 and so I’m obviously not in the higher risk category but I can explain my symptoms I guess. I’ve been sick for fifteen days and only have stayed in my house for the last five due to not having lots available here in southern spain. It started as a cold with mucus and that was the main reason why I hadn’t taken it seriously but after a few days it got more severe. My symptoms by day four where a soar throat, wheezing, coughing, chills, no appetite, swollen lymph nodes, sour muscles (this was new to me) and in the last few days it’s turned into a painful dry cough.\n\nBoth my parents have the same symptoms.” — mermaidhairdontcare\n\n“My daughter lives in a nation (like a co-ed frat) at Lund University in Sweden. A close friend of hers that lives in her corridor is Sweden’s patient 0. He returned from Italy about a week ago. Since he entered the country via Copenhagen the health dept didn’t catch him until the next morning. He felt fine and had only encountered 2 people in the hall before going to his room. He tested positive and the other 2 are quarantined for 14 days.\n\nThey took him to the hospital. Two days later he spiked a 105° fever and he has a bad cough and chest tightness. He’s been achy, had chills, headaches, vomiting and diarrhea. He goes through day long stretches where he feels like he’s gotten better and then it comes back. He’s 21, was in great health and shape. They are doing breathing treatments on him. Statistically he should be fine. He’s said it’s like he’s going to die, then he’s fine and the circle begins again.” — tgibook\n\n“Step daughter bought it home from school, made us all sick.\n\n3 days of fever chills, felt like blowing and coughing razor blades. Stayed hydrated. Probably a week and a half into it now with only a cough and blocked snotty nose.. the phlegm is a yummy thick sticky green.\n\nCan definitely see how the elderly or infirm could be pushed over the edge with it tbh.” — SLR1337\n\n“There was a guy who caught it on the one of the cruises his wife didn’t catch it but he did. He said that he got a fever couple days in a row, got really dehydrated, drank a ton of Gatorade and water. it was mild for him and he was already looking like he was in his 60s. He wasn’t really complaining of chest breathing problems. He said the weird thing about the whole virus Was he didn’t get the achy, headache, coughing, stuffy nose like the regular flu.” — mimibox\n\n“I’m not personally worried as the death rate is pretty low. However I’m concerned if it gets into one of the CA homeless camps, it’s going to spread like wildfire and kill a lot of people. I don’t think they have great access to treatment.” — Winterclaw42\n\n“Every meme, news story, tweet, etc reminds me of H1N1 and for me that’s personal.\n\nI haven’t got enough left in me at the moment to cry but I will. My wonderful husband died of H1N1 related pneumonia on 27th December 2009. So I’ll grieve every loss in this current virus because I lost my own victim of one that people said wasn’t that bad until the deaths started.” — Parvanu\n\n“For a couch potato like me it’s awesome. I can watch my uni lessons online and in my free time play a fuck ton of videogames or work out a little bit. Also I think we’re allowed to leave and get some fresh air. So except for the deadly virus thing everything is ok.” — sore_8\n\n“Basically, for the first time in history, I can save my life and potentially someone else’s too by being a piece of shit laying on the couch all day watching netflix and playing videogames.” — viktorVHS\n\n“If you’re a good citizen and you don’t have a job it’s hard to tell. For example I only poke my nose out of the house to go to the grocery store, and I can tell you there is no big problem there. Sometimes there are empty shelves, but it’s not something surreal. Though if you look at the streets, there are so few people, some wearing masks, with no social interaction. It’s weird. And the fact you don’t have to go to school or university, and you can’t even move out normally, makes this whole thing feel weird as fuck. It’s like time has stopped.” –– RedDordit\n\nI am working as normal, but I advised my clients not to come by unless it’s truly urgent. I’m asking my secretary to take a paid leave until the end of the month because I don’t really need her around since many colleagues are not working much right now.\n\nAll bars are closed. restaurants too I guess but I wouldn’t know because I have a newborn and my life has been just work-home for the past two months anyways.\n\nWe avoid shaking hand and coming too close to other people. Wash our hands religiously and change clothes as soon as I get home. I avoid taking the elevator as much as possible.\n\nAll in all, life is going on mostly as it was before but there’s very few people around.” — StSpider\n\nSee your way to the screams, over at @nowscreamingpv. All your favorite horror films, all in one place. Start screaming!", "opengraph": {"type": "article", "title": "Real Horror Stories From People In Covid-19 Outbreak Areas", "url": "https://thoughtcatalog.com/emily-madriga/2020/03/real-horror-stories-from-people-in-covid-19-outbreak-areas/", "description": "“All in all, life is going on mostly as it was before but there’s very few people around.”", "article:published_time": "2020-03-12T20:02:20+00:00", "article:modified_time": "2021-10-26T17:10:39+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2020/03/39490720092_016ee4408b_k.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US", "article:author": "https://www.facebook.com/theemilymadriga"}, "tags": ["Coronavirus", "COVID-19", "True Crime"], "tweets": [], "movies": [], "links": ["https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3jsci/", "https://thoughtcatalog.com/tag/coronavirus/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkakdgj/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3erl5/", "https://www.reddit.com/user/Myhandsunclean", "https://www.reddit.com/user/PolarBear_293", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3igmv/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkapt04/", "https://www.reddit.com/r/AskReddit/comments/fbl4az/are_you_worried_with_coronaviruscovid19_if_so_how/fj5aq35/", "https://www.reddit.com/r/AskReddit/comments/fbl4az/are_you_worried_with_coronaviruscovid19_if_so_how/fj57wj2/", "https://www.reddit.com/r/AskReddit/comments/fbkf98/covid2019_gives_flulike_symptoms_mortality_is/fj4vup4/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3lmbr/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3kuzc/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3kuzc/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3ndl3/", "https://www.reddit.com/r/AskReddit/comments/fbl4az/are_you_worried_with_coronaviruscovid19_if_so_how/fj56rpc/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3fro0/", "https://www.reddit.com/user/AlexYORR", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3mz9l/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkajwhg/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkano1u/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkaib83/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fkafz35/", "https://www.reddit.com/r/AskReddit/comments/fh9s5o/have_any_redditors_been_diagnosed_with/fk9zcsa/", "https://www.reddit.com/r/AskReddit/comments/fbl4az/are_you_worried_with_coronaviruscovid19_if_so_how/fj5bpm1/", "https://www.reddit.com/r/AskReddit/comments/fbl4az/are_you_worried_with_coronaviruscovid19_if_so_how/fj5ucwx/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3gfwt/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3wkgx/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3g4bg/", "https://www.reddit.com/r/AskReddit/comments/fgachy/to_those_that_live_in_italy_how_is_the_situation/fk3iv8j/", "https://www.tiktok.com/@creepy.catalog/video/7022064801526451461?is_copy_url=1&is_from_webapp=v1", "https://www.instagram.com/nowscreamingpv/"], "authors": [], "publish_date": "2020-03-12T20:02:20+00:00"}