{"result_id": "313007", "URL": "https://thoughtcatalog.com/katee-fletcher/2020/09/fdr-quotes/", "timestamp": "2023-04-25 17:39:54 CEST+0200", "meta": {"description": "The best list of FDR quotes. Franklin D. Roosevelt delivered some powerful quotes throughout his lifetime. He acted as a…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/katee-fletcher/2020/09/fdr-quotes/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "100+ Strong Inspirational Franklin D. Roosevelt Quotes", "cleaned_text": "Franklin D. Roosevelt delivered some powerful quotes throughout his lifetime. He acted as a former American President and influential leader. Franklin D. Roosevelt, was born on January 30th, 1882, in Hyde Park, New York. From a young age, he proved to be very bright; moving from graduating Groton Preparatory School to receiving a Bachelor’s Degree from Harvard University to finally studying law at Columbia University, where he passed the bar examination in 1907. Moving forward from years of rigorous schoolwork, he briefly worked for a prestigious law firm in NYC before entering his lifelong career in politics. In 1910 he was elected to the NY State Senate as a Democrat, then becoming the Assistant Secretary of the Navy from 1913-1920.FDR Presidential Library & Museum\n\nAlongside his bustling work life, he began a loving marriage in 1905 with his distant cousin Anna Eleanor Roosevelt, niece of President Theodore Roosevelt. Together they had 6 children, 5 of which made it past infancy: Anna, James, Elliott, Franklin Jr., and John. Sadly, during the summer of 1921, he contracted Poliomyelitis, causing him to forever lose control of his legs despite valiant efforts to fight it. He used his setback as an inspiration to create a foundation in Georgia that aided other polio victims. He later inspired and directed the March of Dimes program, which eventually funded a successful vaccine for the disease.\n\nHis career continued to brim with new opportunities, leading him to become the governor of New York in 1928 and become the 32nd President of the United States in 1932. During his inauguration, many hard times fell upon The United States of America with the economic crisis of the Great Depression and the spark of World War II. Roosevelt is known for his New Deal legislation push during this time and for being the one to initiate the creation of the United Nations through his proposition of a “grand alliance” against the Axis powers. He took great measures to aid the countries suffering from the destruction of the Nazi regime by urging a repeal of the Neutrality Act. When the Japanese attack on Pearl Harbor took place, Roosevelt’s speech, “The Day of Infamy,” shook the nation, for he was eloquent when he gave a speech and inspiring.\n\nThe stress of the war against Nazi Germany and the recession in America took a great toll on President Roosevelt’s health. He grew to have intense heart problems that eventually led to his stroke in 1945 that killed him during the start of his 4th presidential term. He goes down in American history for being the only president ever to serve more than two terms, and his impact on America is still widely spoken of. Read the article below to find FDR quotes on politics, life, happiness, and more.\n\nFranklin Delano Roosevelt quotes on politics, war, and the American people\n\n“In these days of difficulty, we Americans everywhere must and shall choose the path of social justice…the path of faith, the path of hope, and the path of love toward our fellow man.” – Franklin D. Roosevelt\n\n“If we can boondoggle ourselves out of this depression, that word is going to be enshrined in the hearts of the American people for years to come.” – Franklin D. Roosevelt\n\n“There is a mysterious cycle in human events. To some generations, much is given. Of other generations, much is expected. This generation of Americans has a rendezvous with destiny.” – Franklin D. Roosevelt\n\n“I pledge you, I pledge myself, to a new deal for the American people.” – Franklin D. Roosevelt\n\n“Nobody will ever deprive the American people of the right to vote except the American people themselves, and the only way they could do this is by not voting.” – Franklin D. Roosevelt\n\n“No group and no government can properly prescribe precisely what should constitute the body of knowledge with which true education is concerned.” – Franklin D. Roosevelt\n\n“The United States Constitution has proved itself the most marvelously elastic compilation of rules of government ever written.” – Franklin D. Roosevelt\n\n“The only sure bulwark of continuing liberty is a government strong enough to protect the interests of the people, and a people strong enough and well enough informed to maintain its sovereign control over the government.” – Franklin D. Roosevelt\n\n“Let us never forget that government is ourselves and not an alien power over us. The ultimate rulers of our democracy are not a President and senators and congressmen and government officials, but the voters of this country.” – Franklin D. Roosevelt\n\n“Democracy cannot succeed unless those who express their choice are prepared to choose wisely. The real safeguard of democracy, therefore, is education.” – Franklin D. Roosevelt\n\n“A conservative is a man with two perfectly good legs who, however, has never learned how to walk forward.” – Franklin D. Roosevelt – Franklin D. Roosevelt\n\n“I do not look upon these United States as a finished product. We are still in the making.” – Franklin D. Roosevelt\n\n“Our national determination to keep free of foreign wars and foreign entanglements cannot prevent us from feeling deep concern when ideals and principles that we have cherished are challenged.” – Franklin D. Roosevelt\n\n“More than an end to war, we want an end to the beginning of all wars – yes, an end to this brutal, inhuman and thoroughly impractical method of settling the differences between governments.” – Franklin D. Roosevelt\n\n“Those newspapers of the nation which most loudly cried dictatorship against me would have been the first to justify the beginnings of dictatorship by somebody else.” – Franklin D. Roosevelt\n\n“The nation that destroys its soil destroys itself. Forests are the lungs of our land, purifying the air and giving fresh strength to our people.” – Franklin D. Roosevelt\n\n“In our personal ambitions, we are individualists. But in our seeking for economic and political progress as a nation, we all go up, or else all go down as one people.” – Franklin D. Roosevelt\n\n“I never forget that I live in a house owned by all the American people and that I have been given their trust.” – Franklin D. Roosevelt\n\n“We have faith that future generations will know here, in the middle of the twentieth century, there came a time when men of goodwill found a way to unite, and produce, and fight to destroy the forces of ignorance, and intolerance, and slavery, and war.” – Franklin D. Roosevelt\n\n“Men and nature must work hand in hand. The throwing out of balance of the resources of nature throws out of balance, also the lives of men.” – Franklin D. Roosevelt\n\n“Among American citizens, there should be no forgotten men and no forgotten races.” – Franklin D. Roosevelt\n\n“The test of our progress is not whether we add more to the abundance of those who have much; it is whether we provide enough for those who have too little.” – Franklin D. Roosevelt\n\n“There is one front and one battle where everyone in the United States-every man, woman, and child is in action and will be privileged to remain in action throughout this war. That front is right here at home, in our daily lives, and in our daily tasks.” – Franklin D. Roosevelt\n\n“We must scrupulously guard the civil rights and civil liberties of all our citizens, whatever their background. We must remember that any oppression, any injustice, any hatred, is a wedge designed to attack our civilization.” – Franklin D. Roosevelt\n\n“We must be the great arsenal of democracy.” – Franklin D. Roosevelt\n\n“I have seen war. I have seen war on land and sea. I have seen blood running from the wounded…I have seen the dead in the mud. I have seen cities destroyed…I have seen children starving. I have seen the agony of mothers and wives. I hate war.” – Franklin D. Roosevelt\n\n“Taxes are paid in the sweat of every man who labors.” – Franklin D. Roosevelt\n\n“The structure of world peace cannot be the work of one man, or one party, or one nation…it must be a peace which rests on the cooperative effort of the whole world.” – Franklin D. Roosevelt\n\n“Freedom of speech…Freedom of worship…Freedom from want…Freedom from fear.” – Franklin D. Roosevelt\n\n“Unless the peace that follows recognizes that the whole world is one neighborhood and does justice to the whole human race, the germs of another world war will remain as a constant threat to mankind.” – Franklin D. Roosevelt\n\n“This great Nation will endure as it has endured, will revive and will prosper.” – Franklin D. Roosevelt\n\n“Today we are faced with the preeminent fact that if civilization is to survive, we must cultivate the science of human relationships—the ability of all peoples, of all kinds, to live together and work together in the same world, at peace.” – Franklin D. Roosevelt\n\n“Here is my principle: Taxes shall be levied according to ability to pay. That is the only American principle.” – Franklin D. Roosevelt\n\n“It is time to provide a smashing answer for those cynical men who say that a democracy cannot be honest, cannot be efficient… We have in the darkest moments of our national trials retained our faith in our own ability to master our own destiny.” – Franklin D. Roosevelt\n\n“Remember, remember always, that all of us, and you and I especially, are descended from immigrants and revolutionists.” – Franklin D. Roosevelt\n\n“But while they prate of economic laws, men and women are starving. We must lay hold of the fact that economic laws are not made by nature. They are made by human beings.” – Franklin D. Roosevelt\n\n“In vain, these economic royalists seek to hide behind the flag and the Constitution. In their blindness, they forget what the flag and the Constitution stand for. Now, as always, they stand for democracy, not tyranny; for freedom, not subjection; and against a dictatorship by mob rule and the over-privileged alike.” – Franklin D. Roosevelt\n\n“More than just an end to war, we want an end to the beginnings of all wars.” – Franklin D. Roosevelt\n\n“I’ve never been unemployed. I’ve never been very fully employed either.” – Franklin D. Roosevelt\n\n“I am neither bitter nor cynical, but I do wish there was less immaturity in political thinking.” – Franklin D. Roosevelt\n\n“Of course, we believe these things. We believe in social security. We believe in work for the unemployed. We believe in saving homes. Cross our hearts and hope to die! We believe in all these things. But we do not like the way that the present administration is doing them. Just turn them over to us. We will do all of them; we will do more of them, we will do them better and, most important of all, the doing of them will not cost anybody anything!” – Franklin D. Roosevelt\n\n“They fight not for the lust of conquest. They fight to end conquest. They fight to liberate.” – Franklin D. Roosevelt\n\n“We are trying to construct a more inclusive society. We are going to make a country in which no one is left out.” – Franklin D. Roosevelt\n\n“The point in history at which we stand is full of promise and danger. The world will either move forward toward unity and widely shared prosperity – or it will move apart.” – Franklin D. Roosevelt\n\n“Peace, like war, can succeed only where there is a will to enforce it, and where there is available power to enforce it.” – Franklin D. Roosevelt\n\n“The overwhelming majority of Americans are possessed of two great qualities a sense of humor and a sense of proportion.” – Franklin D. Roosevelt\n\n“What America needs now is a drink.” – Franklin D. Roosevelt\n\n“We must apply ourselves to our task with the same resolution, the same sense of urgency, the same spirit of patriotism and sacrifice as we would show were we at war.” – Franklin D. Roosevelt\n\n“’Peace on earth, goodwill toward men’ – democracy must cling to that message. For it is my deep conviction that democracy cannot live without that true religion which gives a nation a sense of justice and moral purpose.” – Franklin D. Roosevelt\n\n“So, first of all, let me assert my firm belief that the only thing we have to fear is fear itself—nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance.” – Franklin D. Roosevelt\n\n“Freedom means the supremacy of human rights everywhere. Our support goes to those who struggle to gain those rights and keep them. Our strength is our unity of purpose. To that high concept, there can be no end save victory.” – Franklin D. Roosevelt\n\n“Human kindness has never weakened the stamina or softened the fiber of a free people. A nation does not have to be cruel to be tough.” – Franklin D. Roosevelt\n\n“Art is not a treasure in the past or an importation from another land, but part of the present life of all living and creating peoples.” – Franklin D. Roosevelt\n\n“True individual freedom cannot exist without economic security and independence. People who are hungry and out of a job are the stuff of which dictatorships are made.” – Franklin D. Roosevelt\n\n“Freedom of speech is of no use to a man who has nothing to say, and freedom of worship is of no use to a man who has lost his God.” – Franklin D. Roosevelt\n\n“Happiness is not in the mere possession of money; it lies in the joy of achievement, in the thrill of creative effort.” – Franklin D. Roosevelt\n\n“Remember, you are just an extra in everyone else’s play.” – Franklin D. Roosevelt\n\n“If civilization is to survive, we must cultivate the science of human relationships – the ability of all peoples, of all kinds, to live together, in the same world at peace.” – Franklin D. Roosevelt\n\n“Men are not prisoners of fate, but only prisoners of their own minds.” – Franklin D. Roosevelt\n\n“Labor Day symbolizes our determination to achieve economic freedom for the average man, which will give his political freedom reality.” – Franklin D. Roosevelt\n\n“There are as many opinions as there are experts.” – Franklin D. Roosevelt\n\n“The truth is found when men are free to pursue it.” – Franklin D. Roosevelt\n\n“Take a method and try it. If it fails, admit it frankly, and try another. But by all means, try something.” – Franklin D. Roosevelt\n\n“If you treat people right, they will treat you right—ninety percent of the time.” – Franklin D. Roosevelt\n\n“We can afford all that we need, but we cannot afford all that we want.” – Franklin D. Roosevelt\n\n“I think we consider too much the good luck of the early bird and not enough the bad luck of the early worm.” – Franklin D. Roosevelt\n\n“We have learned the simple truth, as Emerson said that the only way to have a friend is to be one. We can gain no lasting peace if we approach it with suspicion or mistrust or with fear.” – Franklin D. Roosevelt\n\n“Self-interest is the enemy of all true affection.” – Franklin D. Roosevelt\n\n“The value of love will always be stronger than the value of hate. Any nation or group of nations which employs hatred eventually is torn to pieces by hatred…” – Franklin D. Roosevelt\n\n“The virtues are lost in self-interest as rivers are lost in the sea.” – Franklin D. Roosevelt\n\n“We, and all others who believe in freedom as deeply as we do, would rather die on our feet than live on our knees.” – Franklin D. Roosevelt\n\n“We look forward to a world founded upon four essential human freedoms. The first is freedom of speech and expression. The second is freedom of every person to worship God in his own way. The third is freedom from want. The fourth is freedom from fear.” – Franklin D. Roosevelt\n\n“The ablest man I ever met is the man you think you are.” – Franklin D. Roosevelt\n\n“It is common sense to take a method and try it. If it fails, admit it frankly and try another. But above all, try something.” – Franklin D. Roosevelt\n\n“When you get to the end of your rope, tie a knot, and hang on.” – Franklin D. Roosevelt\n\n“It isn’t sufficient just to want—you’ve got to ask yourself what you are going to do to get the things you want.” – Franklin D. Roosevelt\n\n“Small wonder that confidence languishes, for it thrives only on honesty, on honor, on the sacredness of obligations, on faithful protection, and on unselfish performance; without them, it cannot live.” – Franklin D. Roosevelt\n\n“We cannot always build the future for our youth, but we can build our youth for the future.” – Franklin D. Roosevelt\n\n“Be sincere; be brief; be seated.” – Franklin D. Roosevelt\n\n“People acting together as a group can accomplish things which no individual acting alone could ever hope to bring about.” – Franklin D. Roosevelt\n\n“It is a terrible thing to look over your shoulder when you are trying to lead – and find no one there.” – Franklin D. Roosevelt\n\n“A good leader can’t get too far ahead of his followers.” – Franklin D. Roosevelt\n\n“One thing is sure. We have to do something. We have to do the best we know how at the moment… If it doesn’t turn outright, we can modify it as we go along.” – Franklin D. Roosevelt\n\n“Competition has been shown to be useful up to a certain point and no further, but cooperation, which is the thing we must strive for today, begins where competition leaves off.” – Franklin D. Roosevelt\n\n“The barrier to success is not something which exists in the real world; it is composed purely and simply of doubts about ability.” – Franklin D. Roosevelt\n\n“Go for the moon. If you don’t get it, you’ll still be heading for a star. Happiness lies not in the mere possession of money; it lies in the joy of achievement, in the thrill of the creative effort.” – Franklin D. Roosevelt\n\n“Do something. If it works, do more of it. If it doesn’t, do something else.” – Franklin D. Roosevelt\n\n“If I went to work in a factory, the first thing I’d do is join a union.” – Franklin D. Roosevelt\n\n“The only limit to our realization of tomorrow will be our doubts of today. Let us move forward with strong and active faith.” – Franklin D. Roosevelt\n\n“There are many ways of going forward, but only one way of standing still.” – Franklin D. Roosevelt\n\nOther FDR quotes from interviews and his inaugural address\n\n“Repetition does not transform a lie into a truth.” – Franklin D. Roosevelt quotes\n\n“No man can tame a tiger into a kitten by stroking it.” – Franklin D. Roosevelt quotes\n\n“Real estate cannot be lost or stolen, nor can it be carried away. Purchased with common sense, paid for in full, and managed with reasonable care, it is about the safest investment in the world.” – Franklin D. Roosevelt quotes\n\n“I ask you to judge me by the enemies I have made.” – Franklin D. Roosevelt quotes\n\n“Favor comes because, for a brief moment in the great space of human change and progress, some general human purpose finds in him a satisfactory embodiment.” – Franklin D. Roosevelt quotes\n\n“I’m not the smartest fellow in the world, but I can sure pick smart colleagues.” – Franklin D. Roosevelt quotes\n\n“Eternal truths will be neither true nor eternal unless they have fresh meaning for every new social situation.” – Franklin D. Roosevelt quotes\n\n“Taxes, after all, are dues that we pay for the privileges of membership in an organized society.” – Franklin D. Roosevelt quotes\n\n“It is an unfortunate human failing that a full pocketbook often groans more loudly than an empty stomach.” – Franklin D. Roosevelt quotes\n\n“Physical strength can never permanently withstand the impact of spiritual force.” – Franklin D. Roosevelt quotes\n\n“The school is the last expenditure upon which America should be willing to economize.” – Franklin D. Roosevelt quotes\n\n“To reach a port, we must sail – sail, not tie at anchor – sail, not drift.” – Franklin D. Roosevelt quotes\n\n“A radical is a man with both feet firmly planted in the air.” – Franklin D. Roosevelt quotes\n\n“Don’t put anybody in and don’t help anybody that is working for Huey Long or his crowd: that is a hundred percent.” – Franklin D. Roosevelt quotes\n\n“No country, however rich, can afford the waste of its human resources. Demoralization caused by vast unemployment is our greatest extravagance. Morally, it is the greatest menace to our social order.” – Franklin D. Roosevelt quotes\n\n“When you see a rattlesnake poised to strike, you do not wait until he has struck to crush him.” – Franklin D. Roosevelt quotes\n\n“Confidence… thrives on honesty, on honor, on the sacredness of obligations, on faithful protection, and on unselfish performance. Without them, it cannot live.” – Franklin D. Roosevelt quotes", "opengraph": {"type": "article", "title": "100+ Strong Inspirational Franklin D. Roosevelt Quotes", "url": "https://thoughtcatalog.com/katee-fletcher/2020/09/fdr-quotes/", "description": "The best list of FDR quotes. Franklin D. Roosevelt delivered some powerful quotes throughout his lifetime. He acted as a former American President and leader.", "article:published_time": "2020-09-21T20:42:01+00:00", "article:modified_time": "2021-01-20T21:19:13+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2020/09/sonder-quest-1p_Qz9SLOrQ-unsplash.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "image:alt": "Concrete Statues Near Wall Photo", "locale": "en_US"}, "tags": ["President", "Quotes", "Politics", "Franklin D. Roosevelt", "FDR"], "tweets": [], "movies": [], "links": ["https://www.whitehouse.gov/about-the-white-house/presidents/franklin-d-roosevelt/", "https://thoughtcatalog.com/january-nelson/2020/09/eleanor-roosevelt-quotes/", "https://www.marchofdimes.org/", "https://americanhistory.si.edu/american-enterprise-exhibition/corporate-era/great-depression", "https://www.digitalhistory.uh.edu/era.cfm?eraid=15&smtid=1", "https://www.un.org/en/sections/history/history-united-nations/index.html", "https://www.fdrlibrary.org/pearl-harbor-exhibit", "https://www.fdrlibrary.org/fdr-biography", "https://thoughtcatalog.com/january-nelson/2020/10/mae-west-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/vince-lombardi-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/muhammed-ali-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/mother-teresa-quotes-2/", "https://thoughtcatalog.com/january-nelson/2020/10/rocky-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/marilyn-monroe-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/lao-tzu-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/sun-tzu-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/rumi-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/buddha-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/dalai-lama-quotes/", "https://thoughtcatalog.com/january-nelson/2020/10/voltaire-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/11/aristotle-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/charles-spurgeon-quotes/", "https://thoughtcatalog.com/january-nelson/2020/10/alan-watts-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/walt-disney-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/dr-seuss-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/maya-angelou-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/mark-twain-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/edgar-allen-poe/", "https://thoughtcatalog.com/katee-fletcher/2020/09/ralph-waldo-emerson-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/john-muir-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/george-carlin-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/will-rogers-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/steven-wright-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/bruce-lee-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/napoleon-hill-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/william-shakespeare-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/helen-keller-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/11/isaac-newton-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/steve-jobs-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/albert-einstein-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/benjamin-franklin-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/friedrich-nietzsche-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/abraham-lincoln-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/john-f-kennedy-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/thomas-jefferson-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/eleanor-roosevelt-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/fdr-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/ronald-reagan-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/09/winston-churchill-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/george-washington-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/joseph-stalin-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/barack-obama-quotes/", "https://thoughtcatalog.com/january-nelson/2020/09/alexandria-ocasio-cortez-quotes/", "https://thoughtcatalog.com/january-nelson/2020/10/drake-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/tupac-quotes/", "https://thoughtcatalog.com/katee-fletcher/2020/10/bob-marley-quotes/", "https://thoughtcatalog.com/january-nelson/2020/10/eminem-quotes/"], "authors": [], "publish_date": "2020-09-21T20:42:01+00:00"}