{"result_id": "313028", "URL": "https://thoughtcatalog.com/james-b-barnes/2014/03/did-jenny-mccarthys-anti-vaccine-activism-kill-children-twitter-thinks-so/", "timestamp": "2023-04-25 17:40:11 CEST+0200", "meta": {"description": "There are fads and there are fads but let's not forget that prior to vaccines a \"natural life\" often meant…", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/james-b-barnes/2014/03/did-jenny-mccarthys-anti-vaccine-activism-kill-children-twitter-thinks-so/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Did Jenny McCarthy’s Anti-Vaccine Activism Kill Children? Twitter Thinks So.", "cleaned_text": "While a lot of jokes have been made about the views of some individuals, including Jenny McCarthy, who believe that standard child vaccines cause a plethora of developmental issues including Autism, the data on the repercussions of actually not vaccinating your child is in. Here’s what the Center for Disease Control (CDC) showed regarding Whooping Cough, a disease that used to be close to eradication:\n• 7,000 cases of Whooping Cough in Wisconsin alone between 2011 and 2013.\n• Over 10,000 cases of Whooping Cough in California between 2011 and 2013.\n• At least 10 babies in California died from Whooping Cough in 2010.\n• 7,000 cases of Whooping Cough in Washington state in 2012.\n\nOutbreaks like this are highly preventable and seem to harken back to the terrible advice of anti-vaccine activists. From 2013:\n\nAn outbreak of measles in North Texas has so far sickened 22 people, and public health officials are now drawing a connection between the flare-up and a local church whose leader reportedly advocated against childhood vaccinations and linked them to the development of autism. As far as health officials can discern, the outbreak started when a local, unvaccinated man returned from Indonesia, where measles remains prevalent. Having contracted the illness, he then spread it to several members of the Eagle Mountain International Church, located in Tarrant County, TX. From there, a handful of locals, ranging in age from 4 months old to 44, also contracted measles.\n\nWhat’s more, here’s some additional data on how many people Whooping Cough used to kill each year, before vaccines were implemented broadly.\n\nBefore the whooping cough vaccine, about 8,000 people in the U.S. died each year from the disease. Today, because of the DTaP vaccine, this number has dropped to fewer than 40. In 2012, whooping cough made more than 48,000 people sick. 15 babies younger than 3 months died. Many of these babies were too young to be fully protected against whooping cough.\n\nBut back to Jenny McCarthy, on March 13th she tweeted this:\n\nThe response to #JennyAsks has been overwhelming:\n\nWhile Jenny’s certainly been the most outspoken of the anti-vaccine spokespersons she’s certainly not been the only one. Soccer moms and those seeking to live a more healthy and natural life have been chief among the offenders and while it’s certainly important that we continue working towards finding a way to prevent autism in children perhaps going back to the days of Spanish Flu number outbreaks isn’t the best way to go especially when it’s all so preventable.\n\nThere are fads and there are fads but let’s not forget that prior to vaccines a “natural life” often meant mass plague and death. Don’t think Measles are dangerous? Ask the Native Americans.\n\nOh, and Measles are now back in New York City. There’s an outbreak occurring as in right now. In 2000, the United States of America had completely eradicated Measles but, thanks to people not vaccinating their children, it’s back. Same deal out in California. Preventable diseases have been on the rise in the US for years now. Here’s an awesome map from the Council on Foreign Relations:\n\nIt’s the kind of retro we can do without. If someone tells you that vaccines cause Autism and are full of toxins then don’t listen. It’s not true and a lot of these people seem to be crazy conspiracy theorists. Vaccinate your children.", "opengraph": {"type": "article", "title": "Did Jenny McCarthy’s Anti-Vaccine Activism Kill Children? Twitter Thinks So.", "url": "https://thoughtcatalog.com/james-b-barnes/2014/03/did-jenny-mccarthys-anti-vaccine-activism-kill-children-twitter-thinks-so/", "description": "There are fads and there are fads but let’s not forget that prior to vaccines a “natural life” often meant mass plague and death. Don’t think Measles are dangerous? Ask the …", "article:published_time": "2014-03-17T18:26:26+00:00", "article:modified_time": "2014-03-17T18:27:31+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2014/03/9245542179_a4bc72a8dd_z.jpg?w=640&h=424&crop=1", "image:width": "640", "image:height": "424", "locale": "en_US", "article:author": "https://www.facebook.com/richard.barnes.31392410"}, "tags": ["Measles", "News", "TV", "Jenny McCarthy", "Center for Disease Control", "Pseudo-Science", "Parenting", "Vaccine"], "tweets": [], "movies": [], "links": ["http://www.theverge.com/2013/8/28/4667554/measles-outbreak-in-texas-linked-to-anti-vaccination-megachurch", "http://www.cdc.gov/vaccines/vpd-vac/pertussis/fs-parents.html", "https://twitter.com/hashtag/jennyasks", "http://www.thedailybeast.com/articles/2014/03/13/thanks-anti-vaxxers-you-just-brought-back-measles-in-nyc.html", "http://www.thedailybeast.com/articles/2014/03/13/thanks-anti-vaxxers-you-just-brought-back-measles-in-nyc.html", "http://www.latimes.com/local/la-me-measles-20140222,0,1197753.story#axzz2vna0KT4x", "http://www.cfr.org/interactives/GH_Vaccine_Map/#map", "http://www.flickr.com/photos/ilri/9245542179/"], "authors": [], "publish_date": "2014-03-17T18:26:26+00:00"}