{"result_id": "313019", "URL": "https://thoughtcatalog.com/emily-madriga/2021/06/47-science-facts-that-are-scarier-than-any-horror-movie/", "timestamp": "2023-04-25 17:40:04 CEST+0200", "meta": {"description": "There were once sea scorpions the size of a great white shark.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/emily-madriga/2021/06/47-science-facts-that-are-scarier-than-any-horror-movie/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "47 Science Facts That Are Creepier Than A Horror Movie", "cleaned_text": "“In 1958, a 7600 lbs nuclear bomb was lost off the Georgia coast near Savannah. It’s never been found.” — Unlucky-Pomegranate3\n\n“Scientific literature’s conclusion on alzheimer’s disease and other neurodegenerative diseases in general is that the diseases start decades before the first obvious symptoms and that we need to treat them at this stage. When you exhibit obvious symptoms, it’s too late, your brain is already mush.\n\nIf you get diagnosed with alzheimer’s at 65, you had the disease since your early 40’s at least. And you experienced very mild symptoms but didn’t notice it. And your brain fought like hell to compensate the deficit. When you get diagnosed, your brain is already very severely damaged and will never recover from the deficit.” — Matrozi\n\n“If your dog swins in a lake after receiving a spot on flea treatment – it absolutely decimates the invertibrate population.\n\nA large dog swimming in 8 Olympic swimming pools worth of water soon after treatment will leech enough neurotoxin to kill 50% of the lake’s invertebrate population within 48 hours.\n\nThere’s some awareness of this, but it’s not being taken seriously enough!\n\nEdit: I need to add – when I say “after” I mean relatively soon after, within say a day, to have an effect quite this devistating. The leeching does reduce over the month, but it’s still there and the effect of multiple dogs still allows for a terrible buildup of chemicals.” — konwiddak\n\n“There is a gravitational anomaly in space called the great attractor which is pulling everything within the Virgo and Hydra-Centaurus superclusters towards it. It lies 150-250 million light years from the milky way, which itself is being pulled towards it too. The scary part is that relative to us, this anomaly lies within the same plane as our own galaxy making it very difficult to observe. Essentially, we have almost no concrete idea of what it is.” — Nervous_Relation9213\n\n17% of the UK has FAS\n\n“In the UK, about 17% of people have fetal alcohol syndrome (McGuire Et Al, 1992). As much as 17% of us are developmentally disabled simply because, prior to the late 90s, a large proportion of British mothers drank during pregnancy (41%). Thankfully the prevalence rate has been falling fast since the late 90s when all this research was published, but it’s terrifying to see how much of an effect FASD is having on society.” — Bohemiannapstudy\n\nIf you get rabies, you die\n\n“Once symptomatic, rabies has a 100%* fatality rate. The only options are the rabies vaccine and immunoglobulin therapy, which, again, must be administered before any symptoms.” — zipybug14\n\nGRBs are a rare phenomenon emitted from the poles of rapidly spinning supernovae and hypernovae. In the event of a direct hit from suitably close (which is actually really, really far), all life on earth would be wiped out. The facing side would be annihilated instantly, while the trailing side would quickly die due to the conditions on earth no longer being suitable to support life.\n\n And there is absolutely nothing we can do about it.” — zipybug14\n\nThe West Coast is in danger\n\n“The Cascadia Subduction Zone (CSZ) runs off the coast of northern California to southern canada and ruptures about every 250-350 years. We know this from the geologic record. The last rupture was in January 1700 and there are written records from Japan of a tsunami that resulted from the earthquake on the other side of the Pacific. This zone is still active and is likely to rupture in the next 100 years resulting in a mag 9+ earthquake that impacts the west coast from northern cali to southern Canada.” — socks4fun\n\nI wish I didn’t know this information\n\n“Hearing is supposedly one of the last senses to fade upon death based on EEG (brainwave recordings)” — Feeling_Bathroom9523\n\nI guess we can just always hear stuff\n\n“They teach us in nursing school to always assume a patient can hear. Whether it be in the ICU, surgery, etc. There have been patient complaints about comments made when the surgeon thinks they can’t hear anymore. And ICU patients in a coma have reported that sometimes they could hear.” — TheKirkendall\n\n“Prions. Misfolded proteins that cause a cascade of protein misfoldings that lead to amyloid plaque buildups, resulting in uncontrollable neurodegeneration that is fatal in 100% of cases within two years. There is no cure. We don’t understand what causes it. We don’t understand the mechanism of the misfolding cascade. We don’t even fully understand the structure of the misfolded proteins. It could in theory happen to anyone, at any time, and there’s no way to tell until you start showing symptoms, at which point you might have 18 months to live, if you’re lucky, the last 6 of which will be intensely unpleasant.” — FoucaultsPudendum\n\nOld timey childbirth be like\n\n“Some forms of anesthesia don’t numb you to pain — they make you forget that you felt it.” — foul_dwimmerlaik\n\n“There were once sea scorpions the size of a great white shark.” — Spooplegeist\n\n“Everyone knows about scurvy, but the reason it’s so terrifying is usually less know. You see scar tissue is not permanent, the process to build and maintain scar tissue is constantly ongoing. When you become vitamin C deficient your scar tissue starts being reabsorbed by your body. Opening up any and all old wounds. If you have ever had surgery those internal incisions will open back up. Fortunately it doesn’t take a lot of vitamin C and it’s abundant in our food sources, but it’s still a little creepy that you could just start falling apart without it.” — LeGama\n\n“I’m a former funeral director and one of the first things you learn in your actual funeral sciences classes is that people over a certain body fat percentage will start a literal grease fire in your crematory oven if you don’t bake them at the proper temp and duration. Cold start, low and slow is key.” — all0fherheart\n\n“We keep our dangerous bacteria species in a college campus’ fridge. Protected by one single lock. With one power cord.” — k4Anarky\n\nLove when a scientist tells me about an impending crisis\n\n“We are degrading, polluting, and losing our topsoil at such a rate that we may not be able to produce enough food to feed everyone within 50-60 years, let alone what impacts climate change may bring to bear on our food supply.\n\nAnd the US government’s crop insurance programs and incentives all reinforce the bad practices, while discouraging regenerative practices. These bad policies are extremely hard to change because of lobbying from the major agribusiness companies, who make money off of these short-sighted policies.\n\nOur food supply is further threatened by our agricultural over-dependence on aquifer water, which is not being replenished, making it an unsustainable source of water. If the aquifers are over-drawn, depleted, or polluted, we hit a hard wall of water scarcity, and we will have no back-ups to address the problem with. The drawdown of the aquifers also causes land subsidence, which causes costly infrastructure and building damage.\n\nThe general public does not realize the impending crisis that will be caused by the confluence of these factors.” — Berkamin\n\n“There’s a solar event known as a CME, or a Coronal Mass Ejection, it occurs very frequently on a cosmic timescale, every few decades to centuries there’s a decent size one.\n\nWhy are they scary?\n\nA CME is a massive burst of radiation, easily able to fully envelope the earth in its path, and it’s the equivalent of a non-stop EMP barrage. The last time a big one hit earth, was when we had telegraph lines for communications and they spontaniously caught fire.\n\nIn today’s world, with everything running on electricity, when the next big one hits we’ll have at most a few days warning, and it’d be a literal apocalypse movie scenario, with planes going down due to their whole electrical system frying, nobodies vehicle starting, untold billions in fire damage would wreak havoc everywhere, and the machines we depend on to help would be similarly fried.\n\nSoooome stuff would be unaffected, being parked in deep, concrete roofed parking garages and the like, but our entire infrastructure would be useless for years, it’d literally send us into a mini dark age while people tried to get things working again, recovery would take decades to centuries.” — Wimbleston\n\n“Antibiotics has been abused and misused for so long, that various bacteria strains have started to get resistance to them. What used to be a treatable infection, might soon become deadly because we are unable to treat it with the antibiotics we have today.\n\nThere is research to try and find other ways to treat antibiotic resistant bacteria, but until then, please use prescribed antibiotics until they are finished (not until you feel better), if unsued do not flush them down the toilet or put them in the bin (give it to a pharmacy so they can discard them correctly), and use antibiotics only when necessary (some countries give them willy-nilly while others are more conservative).” — twitchingJay\n\n“If you look up and see an asteroid in the sky, about to hit Earth, you have about 1 second to react.” — Atfay-Elleybay\n\n“Anthrax can sporulate in dirt and stay viable for hundreds of years until the soil is disturbed and the spores inhaled.” — TheThoughtwell\n\n“Angler fish have a lump of glowing photoluminescent flesh on the tip of their antenna that drooped right in front of their mouth.\n\nA tiny, completely out of place blob of light just sitting there in the vast, vast expanse of nothingness and darkness so deep in the ocean. One that never fails to attract the curious. And the worst part is, the angler doesn’t need the light to see; it’s perfectly suited for the dark, while the curious little fish rely on the faintest trickle of light to get by.\n\nBy the time the little fish notices the light…the angler has already seen them.” — boomsc\n\n“I studied at one of the largest cancer hospitals in the world where the motto is to make cancer history, but the only obtainable goal is to make it chronic. We study and research as much as possible but every cancer requires different research, and unfortunately the powers that be often prohibit funding and proficient research.” — shhhhnahcuh\n\nWhat we don’t know can hurt us\n\n“Most of the faults that are capable of causing large earthquakes have never been mapped.” — WermTerd\n\n“Coronavirus/Covid-19 was not surprising nor unexpected by people working in Public Health. And it’s not the worst case scenario by any means. Ironically, the success of Public Health has been so dramatic over the past 150 years, that politicians and the general public forget how important it is.” — moxie-maniac\n\nExcept helium is a vital component of various high tech devices such as MRI’s.\n\nHelium is also lite enough that the earths gravity can not contain it.\n\nAnd we are running out. Not today, not tomorrow, but we are frivolously wasting it when we should be jealously hoarding it, and eventually we won’t have any left, and a lot of our wonderful technology will suddenly stop working.” — u_Gravida_Vendatur\n\nIf humidity gets too high, relatively low heat can kill humans. The equivalent of 95°F/35°C at 100% relative humidity can kill even healthy humans. This is called a Wet Bulb Event.\n\nBy 2050, scientists predict multiple Wet Bulb Events in the North China Plain.\n\nWe barely know anything\n\n“~94% of the universe is completely out of our reach forever.” — Middle-Coast7804\n\nNot with a whimper, but with Smallpox\n\n“Smallpox is really easy to bring back and it’ll kill 1/5 of the planet when it happens. Takes some genocidal anger, knowledge tens of thousands have, and about $100K. Here’s all the ways it could happen:\n\n1. US or Russian stocks leaked or used as bioweapon (we keep some intentionally, it’s very secure. This is unlikely IMHO).\n\n2. Accidentally bumped into at an old lab, leaked during cleaning or something. Forgotten stocks still occasionally found. Leak spreading very unlikely IMHO.\n\n3. Intentional release via re-creation. Someone resynthesizes it from scratch via public sequence according to this paper with about $100K in materials. Methods + difficulty identical to what is published here. It’s totally possible, almost simple to do:\n\n4. Smallpox powder dropped in envelopes mailed around the world by a disgruntled underpaid PhD student (see Aurora Colorado shooter). Outbreak is out of hand before it’s noticed, billions die.” — tcellcrypto\n\n“Basically methane trapped within ice, primarily under permafrost and on the ocean bottom. It’s kinda like the supervolcano of climate change, not likely but very bad if it happens.\n\nMethane is way worse than CO2 and more important it is faster acting, which could cause a runaway effect.” — toastar-phone\n\n“The retina (the part of your eye which receives light and allows you to see) can unstick itself from the back of the eye without much provocation. It’s pretty terrifying to think about.” — Agressive_piano\n\n“Botox is made from botulinum toxin. This toxin is produced by the bacterium Clostridium botulinum, and is considered to be one of the most poisonous, lethal substances known to mankind.\n\nThe toxin is a neurotoxin that blocks nerve signals to muscles. Consequently, it prevents muscles injected with botox from contracting (tensing), so they become weak or paralyzed, thus improving the appearance of wrinkles and fine lines.\n\nFortunately though, Botox is only injected in small, targeted doses, and is considered extremely safe as long as it’s made and provided by a licensed professional.” — Unable-Taste\n\n“An electric current of only 20mA is enough to stop your heart and kill you. Under the right conditions, even a nine volt battery can be lethal.” — Firree\n\n“The most powerful nuclear bomb ever created, the Tsar Bomba, had an explosive yield 3000 times more powerful than the original nuclear bombs, and it’s power was calculated to be more than ten times the combined power of EVERY SINGLE MUNITION used in WW2. That includes every bullet fired, every grenade thrown, every artillery shell fired, every bomb dropped, and of course, the two nuclear bombs dropped. It was detonated 4 kilometers from the ground over the remote Severny Island yet still completely destroyed towns within a couple hundred kilometers of the blast and broke windows as far away as Copenhagen, Denmark. The shockwave from the blast circled the globe nine times. The plane that dropped it was given a 50/50 chance of survival. Yet, the bomb was originally designed to be twice as powerful.” — MetaRipdley\n\n“The government protocol for disposing of nuclear waste is to pack it with kitty litter in barrels and bury it. If the wrong brand of litter is used it can cause massive environmental problems. This mistake has been made before.” — ndisa44\n\n“Our food is becoming less nutritious. Plants take in CO2 gas and convert that into carbohydrates through photosynthesis. The increase in atmospheric CO2 concentration we have caused means that plants are producing more carbohydrates (sugars and structural carbs like cellulose.) However, the mineral, micronutrient, and protein content of plants is not increasing. Plants today contain more carbs than plants 100 years ago (generally.) This may be a contributing factor to the obesity epidemic since more total calories need to be consumed in order to reach total nutrient requirements.” — Psychological_Cup755\n\nWe’re destroying the planet for no reason, basically\n\n“Priceless virgin forests are destroyed for toilet paper which can easily be made from sustainable sources like bamboo and hemp. Half of the only habitat for Sumatran tigers, elephants, orangutans because there is not adequate legislature and oversight.” — Cocos4sale\n\nFlying carp are here to stay\n\nEven if you’re not on Facebook, you’re on Facebook\n\n“Facebook builds shadow profiles of people, so even if you don’t have a Facebook, you do!\n\nFacebook collects your data from many, many sites you visit. If you see a like/share button on Facebook, they’re collecting the data and adding it to the shadow profile. They basically stalk you, from seeing how long you’re on a web page, to what you click. This is usually used for advertisement purposes, but was also used for nefarious purposes as seen with Cambridge Analytica.” — MrsSkeleton\n\n“You’re more likely to get radiation by walking outside than you are in a lab where you work with radioactive material.” — taylorsherick\n\n“The world’s climate is driven by the Meridional Overturning Circulation, what you might’ve heard of as the “Global Conveyor Belt”. Essentially, this is the formation of cold and salty deep water masses near the poles (North Atlantic, Antarctica) that sinks to the bottom of the oceans, that then upwells in regions like the Indian Ocean and the subtropical Pacific.\n\nNo deep water formation, no upwelling. No deep water formation, no movement of heat on a large scale (theoretically) in the oceans. The heat capacity of the oceans is orders of magnitude greater than that of the atmosphere– if that heat isn’t moving around, the world’s climate rapidly changes.\n\nThanks to the melting of the Greenland Ice Sheet, there’s going to be a lot fresher water in the North Atlantic.\n\nNo salty water, no deep water formation. No deep water formation, no conveyor belt. No conveyor belt, no Gulf Stream, or anything else driven by geostrophic motion.\n\n“Around 100 nuclear weapons went missing when the U.S.S.R fell.” — Catlenfell\n\n“It’s not completely unknown but still scary af. Approximately 1 in 2 people will get cancer. Look at your friends, feel free to include yourself, half of you will get cancer.” — Emanreztunebniem\n\n“Basically, the universe is expanding outward faster than the speed of light, so eventually it will reach the point where everything has expanded outside of our observable universe, leaving us completely alone.” — mwithey199\n\n“How many people are aware that by 6/26/2021 (yes, next month), the military is supposed to release a report providing details (as much as is known) about Unidentified Aerial Phenomenon (UAP; formerly UFOs), having already acknowledged that several recent leaked videos are authentic and also supported by other military tech. By all accounts, these phenomena are seen and encountered regularly by military pilots and no one knows what they are, other than that they do not seem to be ours or China/Russia’s, and demonstrate technology far more advanced than anything available at present on Earth, and which seem to defy known laws of physics.” — Simsearch\n\n“The cold death of the Universe is absolutely unavoidable. Stars will stop shining, and life will cease. Entropy ensures us is an irreversible process.” — bladeofs0rr0w", "opengraph": {"type": "article", "title": "47 Science Facts That Are Creepier Than A Horror Movie", "url": "https://thoughtcatalog.com/emily-madriga/2021/06/47-science-facts-that-are-scarier-than-any-horror-movie/", "description": "There were once sea scorpions the size of a great white shark.", "article:published_time": "2021-06-21T21:37:22+00:00", "article:modified_time": "2021-08-11T18:04:30+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2021/06/todd-cravens-IY1sRDxNWN4-unsplash.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US", "article:author": "https://www.facebook.com/theemilymadriga"}, "tags": ["Scary facts", "Creepy facts", "Facts", "science"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe loading=\"lazy\" title=\"Death From Space &#x2014; Gamma-Ray Bursts Explained\" width=\"768\" height=\"432\" src=\"https://www.youtube.com/embed/RLykC1VN7NY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/RLykC1VN7NY?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe loading=\"lazy\" title=\"TRUE Limits Of Humanity &#x2013; The Final Border We Will Never Cross\" width=\"768\" height=\"432\" src=\"https://www.youtube.com/embed/uzkD5SeuwzM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/uzkD5SeuwzM?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe loading=\"lazy\" title=\"&quot;Silent Invaders&quot; Asian Carp 2013\" width=\"768\" height=\"432\" src=\"https://www.youtube.com/embed/rPeg1tbBt0A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/rPeg1tbBt0A?feature=oembed"}], "links": ["https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7uivt/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz74k3r/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz71omy/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7pw8t/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7n9q2/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz812s7/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz812s7/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz795y2/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7lavh/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz99v79/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6xej3/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6r6ta/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6pjud/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7nqvh/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7uysw/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6zl7m/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7pbfx/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz91bj4/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7hsg3/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6hkrg/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz5yego/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7e9cm/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz9e6dh/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7ti3g/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6wyuc/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz63lim/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7abu3/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz8n4n6/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7bk9f/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.newsweek.com/smallpox-eradicated-40-years-ago-us-russia-stocks-virus-1476932", "https://www.nature.com/news/nih-finds-forgotten-smallpox-store-1.15526", "https://www.sciencemag.org/news/2017/07/how-canadian-researchers-reconstituted-extinct-poxvirus-100000-using-mail-order-dna", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6pe33/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz718ez/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz718ez/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz77g3a/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz5vryk/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz5ze2p/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz8262j/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7hlh3/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz814fj/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz8fonw/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz9630o/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz8ujns/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz701vs/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz74htm/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6sxsl/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz6riu9/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz7l061/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary/gz8e5zv/?utm_source=reddit&utm_medium=web2x&context=3"], "authors": [], "publish_date": "2021-06-21T21:37:22+00:00"}