{"result_id": "313012", "URL": "https://thoughtcatalog.com/seamus-coffey/2015/07/this-is-the-tragic-reason-why-youve-never-heard-of-limbo-hollow-kentucky/", "timestamp": "2023-04-25 17:39:58 CEST+0200", "meta": {"description": "Our town is a small community mostly isolated from the rest of Kentucky by the Appalachian Mountains.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/seamus-coffey/2015/07/this-is-the-tragic-reason-why-youve-never-heard-of-limbo-hollow-kentucky/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "This Is The Tragic Reason Why You’ve Never Heard Of Limbo Hollow, Kentucky", "cleaned_text": "Six years ago, an Icelandic geneticist named Dr. Sigurjón Eggertsson published a paper in the Journal of Theoretical Biology stating that he had identified a Human Endogenous Retrovirus that could be triggered in the human genome after exposure to Influenzavirus B. He went on to state that symptoms included increased adrenal response and the erosion of the septum pellucidum.\n\nOf the subjects tested, he reported that cognitive function had been significantly impaired while irritability and aggression increased exponentially. The study itself was buried in several articles attempting to discredit it before it disappeared from the web last year. I am only aware of this because I had used the study as a reference in a paper I wrote for an online class that semester.\n\nEarlier this year, a major pharmaceutical company filed a patent for a new flu vaccine that used irradiated Influenzavirus B cells suspended in a proprietary solution for use as a countermeasure to the H1N1 virus so many of us heard about in the years past. Dr. Eggertsson was listed as a contributing author on the patent itself. Shortly after this information was released, the pharmaceutical company sent representatives to the city council here in town.\n\nOur town is a small community mostly isolated from the rest of Kentucky by the Appalachian Mountains. In fact, driving to anywhere else in Kentucky requires driving down into Virginia and looping around. This was the reason why our town had been selected for a test run of the new vaccine. After greasing the palms of a few council members, the company was allowed to set up a clinic on the town square. We aren’t the richest of towns, so when the company started offering cash incentives for receiving the injections, people started pouring out in droves.\n\nThis is one area where my inherent laziness and internet addiction served me well, because I decided it was too much work to go out to the square. After a few weeks, the company packed up and left. I wasn’t very worried about their sudden departure until I peered out my window to see people fighting in the street. What were once men now shouted at each other and fought one another like feral beasts. Everywhere I looked, people were fighting and shouting. The fighters would tear into each other and bring back chunks of flesh with their teeth. It was incredibly terrible to watch. From my second floor apartment, I watched my friends and neighbors devolve into frightening creatures. All I could do was watch.\n\nWhen the power went out, I decided it was a good idea to get out of town. With my laptop in my bag and armed with little more than my wits and an old scooter, I decided to head down the mountain. I traveled about a mile down Limbo Hollow Road when I saw the bridge connecting us to CR-1180 was destroyed. I stared open-mouthed at the missing bridge. I slowly pulled my cellphone out to look for directions. When I looked at Google Maps, my heart dropped. I knew I had looked at it hundreds of times before and I remember our little town’s label nestled in the mountains. However, when I looked at it then, I saw Limbo Hollow Road — the road I was on — and dense forest for miles in every direction. There was no bridge and no town. The town itself was replaced with a pixelated image of a large pond.\n\nIn a panic, I looked up “Limbo Hollow town” on Google, which returned no results. Everything, our town history, my former high school, even photos I had uploaded myself were gone. I had no email, no Facebook account, and I could find no record that I even existed. In fact, I could find no record that the town existed.\n\nI am writing this to warn you. Do not come to Limbo Hollow, Kentucky. The things you’d find are barely human anymore. Also, you need to avoid a “New And Improved” flu shot you may see this coming year. As for me, I am going to try to make it down the mountain on foot. I can see light and what looks like some sort of camp at the base of the mountain.\n\nMaybe they can help us.", "opengraph": {"type": "article", "title": "This Is The Tragic Reason Why You’ve Never Heard Of Limbo Hollow, Kentucky", "url": "https://thoughtcatalog.com/seamus-coffey/2015/07/this-is-the-tragic-reason-why-youve-never-heard-of-limbo-hollow-kentucky/", "description": "Our town is a small community mostly isolated from the rest of Kentucky by the Appalachian Mountains.", "article:published_time": "2015-07-14T18:49:24+00:00", "article:modified_time": "2015-07-14T18:50:42+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2015/07/3277031513_7d6489216a_o.jpg?w=1200&h=768&crop=1", "image:width": "1200", "image:height": "768", "locale": "en_US", "article:author": "https://www.facebook.com/XylonExWrites"}, "tags": ["Scary", "Flu Shot", "Pharmaceutical", "Kentucky", "short story", "Fiction", "Medical Atrocity", "Horror Fiction", "New Drug", "Limbo Hollow", "Horror", "Medical Conspiracy", "Vaccine", "Conspiracy", "Creepy"], "tweets": [], "movies": [], "links": ["https://www.google.com/maps/place/Cr-1180,+Jefferson+National+Forest,+Eolia,+KY+40826/@37.0798918,-82.7534362,16.03z/data=!4m2!3m1!1s0x88452d4b00c7a817:0x9c85ef1249da229"], "authors": [], "publish_date": "2015-07-14T18:49:24+00:00"}