{"result_id": "313042", "URL": "https://thoughtcatalog.com/ashley-sweeney/2017/01/heres-why-we-should-all-fight-for-science-even-if-it-means-fighting-trump/", "timestamp": "2023-04-25 17:40:23 CEST+0200", "meta": {"description": "Since I was a kid, I was always interested in science.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/ashley-sweeney/2017/01/heres-why-we-should-all-fight-for-science-even-if-it-means-fighting-trump/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "Here’s Why We Should All Fight For Science (Even If It Means Fighting Trump)", "cleaned_text": "Since I was a kid, I was always interested in science. I would make experimental concoctions using the food in the fridge (mustard went with EVERYTHING) and I asked for laboratory kits for Christmas at the tender age of five. I mean I was a normal kid and asked for Barbies too, but the lab kit was number one on my Christmas List. As I grew older, I started to fall hard for biology and then later in college, more specifically immunology and microbiology. I worked for biotech companies and academia after undergrad, which is where I learned the value and importance of scientific research. This brings me to present day, where I am a PhD student in Biomedical Sciences.\n\nIn the sciences, most PhD students have their education and time in the program fully funded by government and private grants through their university, private fellowships, and their principle investigator. Grant money is a lifesaver for principle investigators, grad students, post –docs, and most importantly- the general public. OK you are thinking, “Well how is your grant money a life saver for me?”.\n\nYou know that antibiotic you had to take the last time you had an infection?\n\nThe anti-cancer drugs that your family member is taking to fight cancer?\n\nThe child you just gave birth to?\n\nNot discovered in a lab of course, but the vaccinations the child will receive that will save their lives and lives of others around them — those vaccinations were slaved over for years to find the perfect antigen to provide antibody protection for you. (Yes that was a shameless plug that vaccinations ARE GOOD NOT BAD. I am a woman of science. I can’t help myself!)\n\nThis leads me to my major point. Why should you care about science? It is only the EPA and USDA, not the NIH or NSF, right? In the words of our new president, WRONG. The EPA and USDA conduct research to protect the US citizens from toxins that can be harmful to our health. They are major departments of scientific research that are being ordered to keep quiet about their data. Data that is publicly funded.\n\nDo you see anything wrong with this picture?\n\nIf our tax dollars are being used to pay for this research to be conducted, why are we not allowed to know their findings? Why are there scientific blackouts? And more concerning is that fact that this has been done after 4 days in office. What is going to happen to NIH funding of grants that use human cells? Will those be next? If so, I can kiss my graduate stipend goodbye.\n\nAnd you can kiss your health goodbye because with the loss of ACA and a potential loss of biomedical science funding, new life-saving drugs won’t be discovered.\n\nThis is why you need to care about this. I care because it is my career, but you should care because it is your life. They can delete the website, they can make gag orders, but they can never delete the science. It is time to fight back. Fight for science and fight for facts.", "opengraph": {"type": "article", "title": "Here’s Why We Should All Fight For Science (Even If It Means Fighting Trump)", "url": "https://thoughtcatalog.com/ashley-sweeney/2017/01/heres-why-we-should-all-fight-for-science-even-if-it-means-fighting-trump/", "description": "Since I was a kid, I was always interested in science. I would make experimental concoctions using the food in the fridge (mustard went with EVERYTHING) and I asked for laboratory kits for Christma…", "article:published_time": "2017-01-30T15:53:21+00:00", "article:modified_time": "2017-01-30T15:53:21+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2017/01/29503873973_fc9c2e1ffb_k.jpg", "image:width": "1024", "image:height": "642", "image:alt": "Look Catalog", "locale": "en_US"}, "tags": ["Trump Administration", "science", "Politics", "STEM", "Vaccines"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2017-01-30T15:53:21+00:00"}