{"result_id": "313009", "URL": "https://thoughtcatalog.com/alicia-byers/2021/04/what-the-pandemic-taught-me/", "timestamp": "2023-04-25 17:39:56 CEST+0200", "meta": {"description": "The light was there, and when it appeared, it brought a lot of life changes to the people around me.", "lang": "en", "keywords": "", "favicon": "https://thoughtcatalog.com/wp-content/uploads/2020/09/cropped-favicon-512x512-1-1.png?w=32", "canonical": "https://thoughtcatalog.com/alicia-byers/2021/04/what-the-pandemic-taught-me/", "encoding": "UTF-8"}, "image": null, "domain": "thoughtcatalog.com", "title": "What The Pandemic Taught Me", "cleaned_text": "Before the pandemic, I was weak. It’s true. I was quiet and weak. I let people walk all over me and the worst part is, I was okay with it. Before the pandemic, I was 27 and was perfectly okay with spending the rest of my life with toxic people due to some unforeseen circumstances.\n\nI was afraid. I was in a serious happy relationship and I wanted a future, but I assumed my whole life that I couldn’t have one, therefore the thought of not budging didn’t bug me that much.\n\nEven after the pandemic, I was still afraid for a while. Of running out of toilet paper. Dying. Loved ones dying. Being out of a job. It started evening out though. There was a small light at the end of the tunnel. They were working on a vaccine. I could go to Walmart again. (Being out in public doing small silly errands was my happy place because I got to see people and observe them being in their own personal futures)\n\nThe light was there, and when it appeared, it brought a lot of life changes to the people around me. My fiance got fed up with his professional life and got a new job, new relationships were blooming despite the germy red tape surrounding our world, everyone seemed to be laughing louder and harder.\n\nEveryone except me. I had made no chances. I was still sat on the couch stuck. After all, I thought it was my duty.\n\nOne day it all changed. Everything happened so suddenly that I didn’t know what was going on.\n\nAfter the height of the pandemic, I am strong. I am 29. I am loud. I am more willing to advocate for myself. I am not perfect. I spent my whole life advocating for someone else that couldn’t so you would think I would be, but I am not. I still have my days. My quiet days, my meek little depressed mouse days, but then I remember that life is too short to be that way anymore. Everything could go away within a moment’s notice, so I can not afford to be stuck.", "opengraph": {"type": "article", "title": "What The Pandemic Taught Me", "url": "https://thoughtcatalog.com/alicia-byers/2021/04/what-the-pandemic-taught-me/", "description": "The light was there, and when it appeared, it brought a lot of life changes to the people around me.", "article:published_time": "2021-04-22T17:41:42+00:00", "article:modified_time": "2021-04-23T01:35:48+00:00", "site_name": "Thought Catalog", "image": "https://thoughtcatalog.com/wp-content/uploads/2021/04/pexels-cottonbro-7013617.jpg?w=1536&h=768&crop=1", "image:width": "1536", "image:height": "768", "locale": "en_US"}, "tags": ["20/20", "Coronavirus", "COVID-19", "2021", "Life Lessons", "Healing", "Pandemic"], "tweets": [], "movies": [], "links": ["https://thoughtcatalog.com/shirin-asefi/2021/02/read-this-when-youre-tired-of-trying-to-be-positive-during-the-pandemic/"], "authors": [], "publish_date": "2021-04-22T17:41:42+00:00"}