{"result_id": "315041", "URL": "https://community.thriveglobal.com/its-national-influenza-vaccination-week/", "timestamp": "2023-04-25 17:41:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/its-national-influenza-vaccination-week/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "It’s National Influenza Vaccination Week", "cleaned_text": "As the December 1-7 commemoration of National Influenza Vaccination Week comes to a close, nurse practitioners are urging patients to get their annual flu vaccination.\n\nCOVID-19 and flu symptoms can appear to be quite similar, with a few notable exceptions, such as the loss of taste and smell associated with COVID-19. The symptoms for both viruses can range from mild to severe and, in the case of COVID-19, can be transmitted without obvious symptoms. Common symptoms of both include:\n• Fever or feeling feverish and having chills.\n\nBecause of the similarities between COVID-19 and influenza, coupled with the renewed focus on preventing viral illnesses, more people are getting their flu vaccinations than in previous years. Recently reported data from health IT firm IQVIA show 23.5 million Americans received their vaccination between August 7 and October 2, compared to just 12.6 million for that same time period last year.\n\nYet, despite the increased number of people getting the flu vaccine, there are still millions of Americans who won’t receive one this year. If you’re still unsure about the flu vaccine, consider the following:\n• Getting a flu vaccination can keep you from getting sick with the flu.\n• Flu vaccination prevents millions of illnesses and flu-related health care provider visits each year. During the pandemic, it’s even more important to protect your health and ensure the limited resources of hospitals and urgent care centers are available to those impacted by COVID-19.\n• Flu vaccination can reduce the risk of flu-associated hospitalization for children, working age adults and older adults.\n• While it is still possible to contract the flu when you are vaccinated, the severity of illness will likely be reduced.\n• Getting vaccinated may also protect people around you, such as those who are more vulnerable to serious flu illness, including young children, older people and people with certain chronic health conditions.\n\nLast year, the Centers for Disease Control and Prevention (CDC) estimated that nearly 35.5 million Americans contracted the flu, resulting in upwards of 500,000 hospitalizations and 34,000 deaths. Influenza is a serious virus that can have deadly consequences, and the simple act of receiving flu vaccination is the best way to prevent you and your family from catching it.", "opengraph": {"locale": "en_US", "type": "article", "title": "It’s National Influenza Vaccination Week - Thrive Global", "description": "As the December 1-7 commemoration of National Influenza Vaccination Week comes to a close, nurse practitioners are urging patients to get their annual flu vaccination. COVID-19 and flu symptoms can appear to be quite similar, with a few notable exceptions, such as the loss of taste and smell associated with COVID-19. The symptoms for both … Continued", "url": "https://community.thriveglobal.com/its-national-influenza-vaccination-week/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-12-09T19:47:32+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/11/Thrive-Global-Meta-Image.png", "image:width": "1200", "image:height": "627", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fiercehealthcare.com/payer/flu-shot-rates-increasing-year-as-experts-worry-double-whammy-covid-19-season", "/cdn-cgi/l/email-protection#78100c0c080b4257570f0f0f561b1c1b561f170e571e140d57191a170d0c571a0d0a1c1d16574a484940554a48494156100c15145b4206420c1d000c453b3c3b5d4a481d0b0c1115190c1d0b5d4a480c10190c5d4a480c101d5d4a481a0d0a1c1d16541e0a17155d4a4811161e140d1d1602195d4a48502c191a141d5d4a48495156"], "authors": ["Sophia L. Thomas"], "publish_date": "2020-12-09T19:47:32+00:00"}