{"result_id": "315043", "URL": "https://community.thriveglobal.com/5-healthy-work-habits-to-take-back-to-the-office/", "timestamp": "2023-04-25 17:41:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/5-healthy-work-habits-to-take-back-to-the-office/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "5 Healthy Work Habits to Take Back to the Office", "cleaned_text": "When stay-at-home orders were put in place last spring, millions of workers shifted from predictable office life to remote work. Since then, Americans have settled into new, more flexible work-from-home routines. After patiently waiting for vaccine efforts to spread across the country, the reality of escaping Zoom fatigue and returning to in-person work is finally here.\n\nWith more than half of the U.S. population fully vaccinated, many work places are transitioning back to the office. Although, only about 1 in 10 employers expect all workers to return fully to the office, maintaining healthy habits to minimize aches and pains is essential as full-time, in-office employees lose some of the flexibility throughout the day, they’ve become accustom to (for example, a mid-morning walk with the pup or getting up to tackle the laundry pile while on a conference call).\n\nAs a chiropractor who works closely with employers to prevent on-site workplace injuries and promote healthy working conditions, I am passionate about sharing actionable tips and tricks people can utilize in their everyday work life to prevent long-term complications such as carpal tunnel, tendonitis, muscle sprain, degenerative disk disease and other systemic health concerns. When returning to the office, consider maintaining these five healthy work habits:\n\nProper positioning allows the spine and body frame to absorb gravity while allowing the least amount of stress on our muscles, ligaments and tendons. To ensure your chair promotes proper alignment, imagine a vertical line running through your ear, shoulder and hip. Then sit back into your chair and take advantage of the backrest.\n\nFor proper alignment of your arms and legs, ensure they are both parallel to the floor. Sitting with a 90-degree angle at the elbow, hip and knee allow for the least amount of physical strain in a sitting position. If your chair is so high your feet do not touch the floor, consider resting your feet on an object to create that 90-degree angle, or ensure your desk chair can move up and down to get the proper alignment.\n\nMake Sure Your Eyes Rest Looking Straight Ahead\n\nNeck and shoulder pain are also common while working as we tend to slightly look down at a laptop or monitor that sits lower than our eyes creating tension from the neck to upper back. To avoid these aches and pains, realign your eyes with the center of the screen. If you are slightly looking down to see your work, use a stand to raise your screen to the proper height.\n\nTake Micro-Breaks Throughout Your Workday\n\nTo avoid strain on the body from sitting too long, stand up and stretch for 10-15 seconds, ideally every 30 minutes. This helps to increase blood flow, reduce numbness and take the pressure off hip, knee and elbow joints. Bonus tip: If you feel comfortable walking next to a co-worker, take a walking meeting to get the blood flowing and switch from a sitting to a standing position.\n\nWhen possible, use a stand-up desk. Standing work has been linked to decreased lower back and upper back and neck pain. Alternating between sitting and standing can also help with mental acuity and focus. However, if you do incorporate standing into your work routine, keep in mind the rules about screen height – make sure you are looking straight ahead.\n\nSo, when returning to the office for the first time in over a year, remember the healthy work habits you created when working remotely, and implement new ones when possible. Maintaining healthy work habits can improve your wellness long-term and increase productivity throughout the day.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Healthy Work Habits to Take Back to the Office - Thrive Global", "description": "When stay-at-home orders were put in place last spring, millions of workers shifted from predictable office life to remote work. Since then, Americans have settled into new, more flexible work-from-home routines. After patiently waiting for vaccine efforts to spread across the country, the reality of escaping Zoom fatigue and returning to in-person work is finally … Continued", "url": "https://community.thriveglobal.com/5-healthy-work-habits-to-take-back-to-the-office/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-06-21T12:04:35+00:00", "article:modified_time": "2021-06-22T11:57:50+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/06/4-1.jpg", "image:width": "1600", "image:height": "900", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.npr.org/sections/coronavirus-live-updates/2021/05/25/1000171685/half-of-all-u-s-adults-will-be-fully-vaccinated-against-covid-19-as-of-tuesday", "https://www.nbcnews.com/business/business-news/just-1-10-companies-expect-all-employees-return-office-n1255589", "https://www.worksiteright.com/", "https://www.ncbi.nlm.nih.gov/pubmed/25168375", "https://www.ncbi.nlm.nih.gov/pubmed/23057991"], "authors": ["Chad Henriksen"], "publish_date": "2021-06-21T12:04:35+00:00"}