{"result_id": "315045", "URL": "https://community.thriveglobal.com/life-during-and-after-covid-19/", "timestamp": "2023-04-25 17:41:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/life-during-and-after-covid-19/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Life During and After COVID 19", "cleaned_text": "We are now over a year with COVID and the vaccine has brought us promise and a vast reduction of COVID cases and deaths. COVID has also brought a level of anxiety and stress this year because anxiety is a by-product of uncertainty. In addition to the pandemic, four other crises and uncertainties, namely the economy, politics, race and climate change, are happening simultaneously. \n\nI have been conducting corporate webinars around the country almost daily in the areas of coping in uncertain times, stress management, resilience, overcoming burnout, and workplace performance. In all these industry sectors I have found the common denominator is the human need to feel safe, connected, and hopeful. Having said that, here are five ways to protect and enhance our health and wellness during this time and beyond. #1 Routines and boundaries. Our brains are wired to be “planners” and the gap is between what we can and can’t control. Being organized, having schedules and routines, cleaning out clutter will help you to feel in control and can bring in a sense of calm and safety. \n\n#2 Communicate: The secret sauce here is to listen from the other person’s point of view, setting aside your own biases/filters. When you do that you hear it very differently even if you do not agree. This empathic listening allows you to connect with the other person and to engage in possibility thinking. Recording the stories of your elders using your smart phone and having them transcribed, create a family legacy. Communication is the key to keeping us connected during Covid. \n\n#3 Self-care Exercise, nutrition and sleep, are essential to keeping our brains and bodies alert and vital. In addition I would add prayer, meditation, breathwork, laughter and visualization. Movement from exercise releases serotonin in the brain and those positive endorphins and happy chemicals bring us a natural high. Good nutrition also contributes to our health. Eating fresh foods, eliminating processed foods and reducing caffeine, alcohol, and sugar can make a make a big difference in how you feel. Sleep is another big factor in health, which is often underrated, Check out your sleep environment for mattress comfort, temperature, light, noise and breathing comfort. Speaking of breathing, deep breaths helps the parasympathetic nervous system and calms us down in a crisis. \n\n#4 -Limit the News – Get the facts and leave the rest. There are endless spins on what we hear in the news and the repetition alone can cause anxiety. #5 – Know that we are in a “new normal” and that involves loss of what we had before. Although the pandemic has heightened, we now have a vaccine and we are at the “beginning of the end.” This too shall pass. We now see the light at the end of the tunnel and that brings us hope.", "opengraph": {"locale": "en_US", "type": "article", "title": "Life During and After COVID 19 - Thrive Global", "description": "Protecting Our Health and Wellness in Times of Uncertainty", "url": "https://community.thriveglobal.com/life-during-and-after-covid-19/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-05-16T15:37:22+00:00", "article:modified_time": "2021-05-16T15:37:28+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/11/Thrive-Global-Meta-Image.png", "image:width": "1200", "image:height": "627", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["patriciaraskin"], "publish_date": "2021-05-16T15:37:22+00:00"}