{"result_id": "315009", "URL": "https://community.thriveglobal.com/a-divided-world-is-an-unhealthy-world/", "timestamp": "2023-04-25 17:40:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/a-divided-world-is-an-unhealthy-world/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "A Divided World Is An Unhealthy World", "cleaned_text": "A recent Kaiser Family Foundation analysis found that Americans who have not been vaccinated are now three times likelier to lean Republican than to lean Democrat. The persistence of vaccine hesitancy has kept vaccine uptake from being as widespread as it might be, helping prolong the pandemic. Its intersection with political partisanship suggests the role sectarianism plays in this. Vaccine hesitancy is, in many ways, a phenomenon of mutual incomprehension. The hesitant, for a range of reasons, are not able to see why so many would find the vaccines safe enough to take. And the vaccinated, particularly those in the public health establishment, cannot see why anyone would refuse an effective vaccine in the midst of a deadly pandemic. This divide mirrors other divides in the US; most notably, as the new analysis reflects, the red versus blue divide that has long characterized our politics.\n\nThe story of vaccine hesitancy, then, is, in large part, a story of sectarianism. I would argue that a key reason why the issue of vaccine hesitancy remains so intractable is because we have failed to fully reckon with the degree to which hesitancy is shaped by the larger story of division in this country. Certainly, we have acknowledged division, bemoaned it, but in terms of actually addressing it, we have done little. When it comes to vaccine hesitancy, much of our effort has been directed towards simply making the case for greater education about vaccines and for more expansive mandates. In doing so, we sidestep the central issue, one which is core not just to vaccine hesitancy but to how we collectively engage with the forces that shape health.\n\nGiven this challenge, it seems helpful to take a step back and look at the role of sectarianism in our thinking and behavior around issues that matter for health, and at how we can address sectarianism towards shaping a better engagement with these issues.\n\nIt is worth beginning by touching on a key driver of sectarianism—our tendency to live in political “bubbles” where we rarely, if ever, encounter someone with different views. Living in political bubbles can make it easier to mistake mere opinion for something that is incontestably, axiomatically true—because it is what everyone around us believes. It can also make it easier for us to demonize those who live outside our bubble, given that we rarely encounter them.\n\nNotably, the challenge of living in bubbles is not evenly distributed across the political spectrum. Below is a representation of the extent to which Democrats and Republicans live in political bubbles. It shows that 38 percent of Democrats live in a bubble, while 19 percent of Republicans live in one. To look up the political composition of your own neighborhood, see the original, interactive New York Times article from which the image is taken.\n\nIt is striking to see the extent to which those on the left are likelier to live in a bubble than those on the right. When we see anti-vaccine attitudes on the right, as well as views which embrace walls and anti-immigrant sentiment, it is easy to think that it is the right that is doing the most to drive sectarianism. Yet analysis has found that the most intolerant county in the US is, in fact, Suffolk County, Massachusetts—among the most progressive regions in the country. These data were a particularly rude awakening for me, as Suffolk County is where I work. It is difficult to face the fact that we may be living in bubbles which limit our perspective on key issues, causing us to be narrow-minded without realizing it. Yet it is certainly the case that we do tend to live in these bubbles, and, in public health, this can complicate our vision of the populations we serve. When we live in a bubble, we are liable to misunderstand the thoughts, feelings, and core motivations of the people whose health we would improve. This creates problems when we find ourselves in a position of having to ask these populations to change their behavior in some way in the name of health. Recent years have provided many examples of our assumptions about the population at large being off-the-mark. This was the case in both the 2016 and 2020 presidential elections, when it turned out that there were far more Trump supporters than many on the left thought. Perhaps even more relevant is the fact that, in 2020, Trump increased his share of votes among Muslim, Black, Hispanic, and LGBT voters, while losing votes among white men. The reasons for this are by no means clear. What is clear is that it confounds easy assumptions about race, class, self-interest, cultural affiliation, and political preference to such an extent that the only way to make sense of it could be to go outside of our bubbles and engage deeply with the people we find there.\n\nThis is often easier said than done. Many of us would likely agree that such engagement is desirable, but actually pursuing it can be difficult, entailing pushback both from those with whom we would engage and from fellow inhabitants of our bubble. I experienced this last year, encountering disagreement after writing a piece in which I suggested we need to think more about why President Trump’s mishandling of COVID-19 was not enough to bring about the landslide defeat many on the left expected him to face. The implication of the piece was that our bubbles had blinded us to certain key realities about the country and the populations we serve. Seeing these realities more clearly will require the hard work of greater engagement.\n\nWhy does this work matter? It matters because without it our efforts will continue to be less effective than they could be, and we will continue to be at a loss as to why. The challenge of vaccine hesitancy is an example of what can happen when stalemate settles in around the gap between public health’s advice and how far populations are willing to go in following it. We now have a choice: we can accept the status quo as the best we can do in a hopelessly divided world, or we can embrace the hard work of doing better, even when this means engaging outside our ideological bubbles. We in public health must ask: do we want to be open or closed, insular or a big tent that is inclusive of everybody? I would argue that the big tent is necessary if we are to fulfill our central purpose of supporting the health of populations. For us to be pro-health, we need a clear understanding of why some people seem to be so resolutely anti-health in their views (or understand better their understanding of health). We should not engage with people we disagree with from a place of condescension, and we should not listen to them merely to wait for them to stop speaking so we can communicate our predetermined message. Rather, we should engage at a human level, with the good-faith assumption that there may even be something we can learn from those whose views strike us as self-evidently wrong. It is only by engaging in this spirit that we can hope to overcome sectarianism and advance a healthier world.\n\nCircling back to vaccines, then, the closer we look at the issue, the clearer it becomes that it is not so much about vaccines themselves as it is about the sectarian divides that underlie so much of our discourse about health. Because we have not yet done the work of healing these divides, their influence remains strong. Had we addressed them long before COVID-19, it is likely that we would not see such hesitance to get the vaccine, a hesitance informed by a reflective distrust of anything that seems to originate outside a given population’s bubble. This suggests that core to preventing the next pandemic is addressing the sectarian divides that have done so much to stop us from being as healthy as we can be. While this represents a challenge, it is also an opportunity. The pandemic was a reminder that our health is connected, that the bubbles in which we find ourselves are, to a large extent, illusory. They place limits on our vision, but they do little to keep out the broader context in which we all live, and which shapes our collective health. Stepping out of these bubbles puts us face-to-face with this context, which is where our attention should be, always, if we wish to build a healthier world.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Divided World Is An Unhealthy World - Thrive Global", "description": "How sectarianism is making us sick", "url": "https://community.thriveglobal.com/a-divided-world-is-an-unhealthy-world/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-12-06T14:08:54+00:00", "article:modified_time": "2021-12-06T15:34:49+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/12/GettyImages-912015968.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.kff.org/coronavirus-covid-19/poll-finding/importance-of-partisanship-predicting-vaccination-status/?utm_campaign=KFF-2021-polling-surveys&utm_medium=email&_hsmi=2&_hsenc=p2ANqtz-_jUWLt9KzWhOEQOu2uGXfHw8JHuUYV7ASp9NVtmM7DF9lJAh87u27NsR7X33DNSkiFaypvevdfTtpgzuIxl-5GX391hg&utm_content=2&utm_source=hs_email", "https://www.nytimes.com/interactive/2021/04/30/opinion/politics/bubble-politics.html", "https://www.nytimes.com/interactive/2021/04/30/opinion/politics/bubble-politics.html", "https://www.nytimes.com/interactive/2021/04/30/opinion/politics/bubble-politics.html", "https://www.nytimes.com/interactive/2021/04/30/opinion/politics/bubble-politics.html", "https://fee.org/articles/the-most-intolerant-county-in-america-and-the-most-tolerant-city/", "https://www.washingtonpost.com/opinions/2020/11/30/trump-lgbtq-voters-support-silver-lining/", "https://www.nytimes.com/2021/02/02/us/politics/white-men-trump.html", "https://www.milbank.org/quarterly/opinions/learning-from-november-3-a-wake-up-call-for-public-health/"], "authors": ["Dr. Sandro Galea"], "publish_date": "2021-12-06T14:08:54+00:00"}