{"result_id": "315004", "URL": "https://community.thriveglobal.com/even-after-lockdowns-eased-pandemic-depression-persisted-across-social-classes-new-study/", "timestamp": "2023-04-25 17:40:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/even-after-lockdowns-eased-pandemic-depression-persisted-across-social-classes-new-study/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Even After Lockdowns Eased, Pandemic Depression Persisted Across Social Classes, According to a New Study", "cleaned_text": "One year into the COVID-19 pandemic, we found that more than 1 in 5 U.S. adults reported probable depression in both spring 2020 and spring 2021. We also found that financial assets helped reduce the persistence of symptoms – but only to a point. Our recently published research highlights COVID-19’s continuing mental health effects on the U.S. population.\n\nWe launched a national study in March 2020 measuring mental health and assets. COVID-19 was a national emergency, as deaths were on the rise. Schools, workplaces and government offices closed as Americans were urged to stay home. At that time, we found that 27.8% of U.S. adults in our study reported symptoms of depression, such as losing interest in activities or feeling down or hopeless. This number was over three times as high as the national pre-pandemic depression estimate of 8.5%.\n\nMost striking to us was that a year into the pandemic, depression rates remained high, despite hopeful signs of reducing infections and deaths. In April 2021, people were lining up for COVID-19 vaccine shots, doctors were finding better COVID-19 treatments and efforts to reopen society were under way. But by that point, the share of adults in our survey reporting symptoms of depression had gone up to 32.8%.\n\nWorse yet, that higher 2021 number included 20.3% who had reported symptoms of depression both in April 2020 and in April 2021. This finding suggests that poor mental health driven by the pandemic was both prevalent and persistent.\n\nWe also wanted to know which assets – financial, physical and social – might be influencing people’s mental health during the pandemic. In our first survey, we found that people who came into the pandemic with relatively few assets – especially financial ones – were more likely to be affected by COVID-19-related stresses.\n\nIn our April 2021 follow-up survey, we were interested in the relationship between mental health and asset status. We looked at financial assets such as personal savings, physical assets such as home ownership and social assets of education and marital status. We compared people who were similar in terms of marriage, education and home ownership. We found that people in households earning less than US$20,000 a year were 3.5 times as likely to report persistent depression symptoms as those making $75,000.\n\nWe also found that people who had $5,000 or more in savings or a bank account reported less persistent depression. Having more assets, however, did not reduce the depression-inducing stress of losing a job, suffering relationship problems or experiencing financial difficulties during the pandemic.\n\nNearly 1 million U.S. lives have been lost to COVID-19, and there have been almost 5 million hospitalizations. But measuring the effect of the pandemic on the nation’s mental health is just beginning. And we believe the pandemic’s sustained impact on the nation’s mental health is unprecedented.\n\nOur next move is to further examine areas of overlap between those who started the pandemic with fewer assets and those who suffered job losses, relationship problems or financial difficulties during the pandemic.\n\nPeople who have fewer assets are the ones most at risk of depression, especially depression that lasts over time with social upheaval. Assets can be a cushion, but even they did not protect people from the harmful effects of stressors brought on by the pandemic. Our research shows that although the pandemic seems to be easing, Americans are still suffering. And they may continue to feel ill effects on their mental health for a long time to come.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.", "opengraph": {"locale": "en_US", "type": "article", "title": "Even After Lockdowns Eased, Pandemic Depression Persisted Across Social Classes, According to a New Study - Thrive Global", "description": "The high and persistent prevalence of depression suggests that mental illness increased for all social classes during the COVID-19 pandemic.", "url": "https://community.thriveglobal.com/even-after-lockdowns-eased-pandemic-depression-persisted-across-social-classes-new-study/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2022-03-25T17:02:00+00:00", "article:modified_time": "2022-03-25T17:12:27+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-25-at-1.11.32-PM.png", "image:width": "1500", "image:height": "778", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1126/sciadv.abm9737", "https://www.federalregister.gov/documents/2020/03/18/2020-05794/declaring-a-national-emergency-concerning-the-novel-coronavirus-disease-covid-19-outbreak", "http://jamanetwork.com/article.aspx?doi=10.1001/jamanetworkopen.2020.19686", "https://www.gettyimages.com/detail/photo/unemployed-businesswoman-having-stressed-after-royalty-free-image", "https://www.usda.gov/media/blog/2021/04/09/celebrating-1-million-covid-vaccines-administered-usda", "https://doi.org/10.1093/ofid/ofab050", "http://dx.doi.org/10.1136/jech-2020-215213", "https://covid.cdc.gov/covid-data-tracker/#new-hospital-admissions", "http://dx.doi.org/10.1136/jech-2020-215213", "https://doi.org/10.1016/S0140-6736(22)00100-3", "https://theconversation.com/profiles/catherine-ettman-1322823", "https://theconversation.com/institutions/boston-university-898", "https://theconversation.com/profiles/sandro-galea-152092", "https://theconversation.com/institutions/boston-university-898", "https://theconversation.com", "https://theconversation.com/even-after-lockdowns-eased-pandemic-depression-persisted-across-social-classes-new-study-178518"], "authors": ["Dr. Sandro Galea, Catherine Ettman"], "publish_date": "2022-03-25T17:02:00+00:00"}