{"result_id": "315001", "URL": "https://community.thriveglobal.com/covid-19-from-crisis-to-opportunity-taking-back-our-lives-part-3-conventional-drugs-and-vaccines-not-all-we-imagined-2/", "timestamp": "2023-04-25 17:40:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/covid-19-from-crisis-to-opportunity-taking-back-our-lives-part-3-conventional-drugs-and-vaccines-not-all-we-imagined-2/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "COVID-19: FROM CRISIS TO OPPORTUNITY — TAKING BACK OUR LIVES PART 3: CONVENTIONAL DRUGS AND VACCINES — ARE THEY ENOUGH?", "cleaned_text": "Dr. Chiu is a Stanford-trained physician, venture capitalist, and former pharmaceutical executive. He is an advisor to Stanford’s Clinical Excellence Research Center and leads Malin Burnham’s San Diego based Obesity/Diabetes Working Group. He currently serves as the founder and CEO of VAVICI, a start-up seeking to pilot a root-cause-based physician platform for these conditions. What follows is an application of some of these principles to challenge and improve our approach to COVID-19 policy and treatment.\n\nDonations to advance root-cause-based therapies can be made to the VAVICI FOUNDATION a 501c3 public charity. For more information, please contact Ron Bissinger at [email protected]\n\nCOVID-19: FROM CRISIS TO OPPORTUNITY — TAKING BACK OUR LIVES\n\nPART 3: CONVENTIONAL DRUGS AND VACCINES — ARE THEY ENOUGH?\n\n“Insanity is doing the same thing over and over and expecting different results.” Einstein\n\nWhile this might seem obvious, when it comes to our health, we often turn a blind eye.\n\nIf a vaccine or drug doesn’t work our knee-jerk reaction isn’t to find a different solution, but rather to do more of the same (i.e., more vaccinations or more drugs). We are convinced that with more time, a higher dose, another vaccine or drug will eventually save us. If the drug or vaccine addresses root cause it will, but if it only treats symptoms sooner or later, we will have to face the storm.\n\nOne way to understand this better is to picture your health like the hull of a ship. If over time your hull is weakened from neglect, almost anything will cause you to spring a leak and sink. Ice that barely caused a dent just a decade ago is now a major threat.\n\nIf our solution is to develop ever-more elaborate ways to identify and destroy debris (such as icebergs, by using radar and lasers), and to employ ever more innovative ways to bail water. This will not work well because these do not address the root cause, a weakened hull (i.e., they treat only symptoms of the weakened hull), then any new unexpected debris or a widening leak can sink our ship. It’s only a matter of time before these half measures aren’t enough.\n\nIf our ship is saved by destroying icebergs (vaccines) and bailing water (drugs) \n\nis the right lesson learned that we can always rely on our ingenuity\n\nto find better ways to treat symptoms \n\n\n\nOr, \n\n\n\nIs the right lesson learned that\n\nNOW would be a good time to fix the hull (i.e., treat root cause)?!\n\nOur singular focus on new drugs and vaccines puts us in danger of missing the larger picture.\n\nRoot cause: getting to the bottom of the COVID-19 pandemic.\n\nDo vaccines and drugs treat the root cause of our COVID-19 pandemic?\n\nA root cause is something that — when addressed — eliminates the fundamental source of the problem. This may not fix the damage done, any more than patching a leak removes the water. However, it is the most important step to any permanent solution.\n\nFor a disease, root cause is often the absence of something that should be present (i.e., a nutrient, sleep, etc.) and/or is the presence of something abnormal that should not be present (i.e., a toxin, stress, etc.). For example, scurvy comes from a deficiency of Vitamin C. Rickets is caused by a deficiency of Vitamin D or calcium. In contrast, many diseases are caused by the presence of toxins like cigarette smoke for lung cancer or stress for high blood pressure.\n\nTherefore, a statement like, “the root cause of COVID-19 is the presence of a nasty new virus and the presence of a particularly vulnerable human population” (i.e., absence of strong immune system) makes sense because these are examples of root cause. In contrast, a statement like, “the root cause of our pandemic is the absence of a vaccine or drug” doesn’t ring true because it isn’t true. These aren’t the root causes of the problem. They are man-made inventions that are important and valuable in control of pandemics, but they aren’t root cause solutions.\n\nAn inconvenient truth? Less healthy people = more pandemics\n\nSo, what is the root cause of this pandemic?\n\nCould it be our growing globalization and skyrocketing population? Both are abnormal factors, but hardly more meaningful now than they were just a decade or two ago.\n\nCould it be from unusual Chinese practices? Yes, if these are new — but what if they have been present for decades if not centuries (which appears to be the case)?\n\nCould it be from random chance? Mutations have been occurring since the dawn of time, yet the number of coronavirus pandemics (SARS, MERS, and now COVID-19) has only been on the rise for the past few decades.\n\nCould it be that we are actually less healthy than we were even a few decades ago ? This sadly is very plausible.\n\nOver 40% of the US population is obese, 50% have diabetes or pre-diabetes, and as much as 70% of us are overweight. The incidence and prevalence of most chronic diseases have climbed dramatically. For the first time in a century life expectancy has dropped. All of this would suggest we are far LESS healthy.\n\nBut how could this have happened?\n\nWe may think we eat and live better, but our food has grown ever-more processed, our soil ever-more depleted. It’s now possible to eat all the right foods and still have nutritional deficiencies. As a result, over 50% of the population is deficient in basic nutrients like zinc, potassium, Vitamin D, and magnesium [1][2]. Even eating organic-labeled foods is not enough[3].\n\nFurthermore, our choice of foods has taken a turn for the worse, with far more sugar and artificial ingredients than ever before. We are exposed to a growing number of environmental toxins including pesticides, plastic byproducts, heavy metals, genetically modified foods, vaccines (i.e., adjuvants like aluminum), air pollution, and even our airwaves (electromagnetic pollution). Finally, we live increasingly stressful lives, where we exercise and sleep a lot less and work in cramped office places with very little fresh air.\n\nSo how could it be a surprise that we are FAR LESS healthy?\n\nData on comorbidities with COVID-19 clearly shows that many if not all of these chronic diseases and changes to our life style are risk factors for getting COVID-19 and for getting more serious COVID-19 disease. So why isn’t it immediately obvious that eliminating such root cause comorbidities and other poor lifestyle choices might protect us as well or better than vaccines and drugs will? Or for that matter that there might be other simpler and safer treatments that work just as well? In other words, is it possible that if we spent the same time and resources doing clinical studies on simpler and safer solutions (most of which are unpatentable or now off patent) that we just spent on patent-protected vaccines and drugs that some of these might work as well or better? Or at the very least might be an important complement to such therapies?\n\nAbsence of this data does not mean absence of efficacy. Nor does it mean that such solutions don’t exist. Our failure in the middle of the worst pandemic in recent history to overlook solutions like this is not something new. Nor is it just an inconvenience, thousands of lives are lost waiting for vaccines or drugs. If in the end our current vaccines and drugs are NOT enough, it could also cost us our ability to reach herd immunity.\n\nThe reasons this failure happens are clear and will be explained later.\n\nWhat are some of the pitfalls?\n\nFirst, vaccines improve immune response to specific antigens that are common to wild type (original Wu Han) COVID-19 viruses. They DO NOT, as a whole, make our immune system stronger. In fact, some vaccines (NOT to date any COVID-19 vaccines) have even decreased our ability to fight related infections (e.g. Antibody Dependent Enhancement)[4].\n\nSecond, to the extent that this strategy is akin to targeting a specific kind of debris (i.e., large icebergs), we can be vulnerable to variants (smaller icebergs) and to completely different viruses (other debris). So far, our US vaccines protect against current COVID-19 variants. However, there are already signs that their effectiveness is lower with newer strains[5]. Should a variant escape our current vaccines, we do not know how long it will take to develop another vaccine or how having received the current vaccine affects the effectiveness of a newer vaccine or booster.\n\nThird, unlike natural immunity, which can last a lifetime, immunity from the COVID-19 vaccine is expected to fall off with time. It’s not known how long this protection will last or how this might vary from person to person. This is a little like protecting ourselves with a shield made of ice — ice that’s melting away.\n\nFourth, no vaccine is 100% effective so even properly-vaccinated individuals can get sick. Becoming immune is not like turning on an impenetrable force field. It’s more like taking a self-defense class to defend against an average attacker. Some of us won’t be protected at all, others will have varying levels of protection, but most will be able to handle the average attacker.\n\nTherefore, stepping into an arena where there is more than one average attacker or there are elite attackers (i.e., large crowds or new COVID-19 variants) is just asking for trouble. Yet, most of us getting vaccinated are only too eager to get out there, and so unwittingly test the limits of what even a vaccinated immune system can handle. Controlled clinical studies were done in settings where masks and social distancing were commonplace, these studies did NOT control for human nature (or stupidity) and so your protection could be considerably less if you push the envelope.\n\nFifth, COVID-19 vaccines were approved based on preventing symptomatic and serious disease, NOT for preventing you from getting infected or — in the event you get infected — preventing you from being contagious. This is the primary reason why officials have been slow to remove mask restrictions[6]. Having a growing number of infectious, asymptomatic people could easily undermine efforts to control the COVID-19 pandemic. While data shows there is both a reduction in asymptomatic infections and the ability of vaccinated asymptomatic infections to be contagious, this is not as well-documented, and it is certainly not reduced to zero.\n\nSixth, COVID-19 vaccines were approved quickly and so have limited long-term safety data. In fact, at this time none is fully FDA approved. This creates a situation where liability for safety issues, which vaccine manufacturers are already exempt from, may not be fully covered by the government[7]. While most of us expect that there will not be any significant long-term safety issues, the history of vaccines is not without its share of surprises and disappointments.\n\nSeventh, our heavy reliance on vaccines to the exclusion of other alternatives leaves us with no back-up options in the event a dangerous new variant emerges. Worse, without other complementary alternatives, it may be hard to achieve the required herd immunity to end this pandemic. Alternative approaches lower the herd immunity requirement by reducing the percentage of the population that is vulnerable to serious infection.\n\nWithout alternative approaches, the herd immunity required to end this pandemic is believed to be 60-70% of the population[8]. This calculation doesn’t just mean 60-70% of the US population, but rather the world as a whole. The strength of our herd immunity chain is only as strong as the weakest link — and there are many weak links.\n\nAchieving this metric also doesn’t just being mean immune from symptomatic disease, but also being immune from asymptomatic infections and from transmitting the disease to someone else. These are things we already know the vaccine doesn’t promise.\n\nFinally, it doesn’t mean immune at some point in our life, but for all of us to be immune at the same time. With both the asymptomatic infection rate (with the vaccine) and the duration and timing of vaccine immunity being unclear, even a 100% vaccination rate may not be enough to reach herd immunity. This is why having complementary measures is so critically important.\n\nThe choice of getting a vaccine is a deeply personal one, requiring us to weigh the risks against the benefits. While it is true that there remain theoretical risks, limited long-term safety data, some clear but rare near-term risks, and no current full US FDA approval for any of the vaccines, most reviews of the existing data suggest that the vaccines are safe and effective.\n\nWithout complementary approaches, the risk of and unvaccinated person getting infected is very high, especially with newer variants[9]. When infected, the potential health repercussions are far worse than the known side effects and risks of the vaccine. Furthermore, being infected and recovering from COVID-19 is not the same as recovering from your average cold virus. The spike protein enables this virus to reach far more organs and tissues than a typical respiratory virus, raising the possibility of enduring effects and even chronic infections. A growing number of infected individuals have been found to have “long haul” health issues and signs of real damage and distress, including those who were asymptomatically infected[10][11].\n\nViruses that ultimately reach tissues that the immune system doesn’t access well (e.g., nerves and some organs) often never go away, and while they may be asymptomatic, their continued presence is most certainly NOT a good thing. Such chronic viral infections may explain previously unexplained diseases like multiple sclerosis[12]. Herpes viruses (which includes Epstein-Barr Virus and Chicken Pox) are an example of viruses that typically persist in our bodies forever. Whether COVID-19 might eventually cause similar chronic infections has not yet been documented.\n\nFinally, the success of the vaccine program requires that as many of us be vaccinated as quickly as possible. The longer the delay, the more likely a dangerous variant can emerge, the same way antibiotic resistance develops in under-treated patients.\n\nThe need to work together for the common good\n\nWhen we take a pro-vaccine or anti-vaccine position, we often lose sight of our common goal of wanting to protect as many people as well as we can. It’s a little like losing the forest amongst the trees, as both sides feel they must prove they are right even at the cost of valuable insights, cooperation — and, ultimately the very lives that we are all trying to save.\n\nPro-vaccine advocates can feel so pressured to use vaccines to achieve herd immunity, that they may downplay and censor real issues (and their potential solutions). Worse, they may ignore, suppress and even censor other legitimate complementary treatments that are critical to our achieving herd immunity, considering them to be dangerous distractions.\n\nLikewise anti-vaccine advocates feel so pressured to protect us from potential dangers of vaccines that they may downplay the seriousness of the pandemic, dramatize potential problems, and refuse to recognize and suggest potential solutions — solutions that they may be in the best position to see, because of their willingness to recognize problems.\n\nFor example, so caught up are both sides on the MMR vaccine, that the role of heavy metal toxicity, for which real solutions exist (i.e., screening and removal of excess heavy metals like aluminum), have not been seriously considered and evaluated. Pro-vaccine advocates tend to downplay this issue, while anti-vaccine proponents are loathe to suggest any solution other than not taking the vaccine.\n\nFor COVID-19 vaccines, there might be similar issues that, if addressed, could reduce toxicity and improve efficacy. There might also be important complementary treatments. Without the proper perspective and cooperation that comes from a willingness to understand both sides, we lose the ability to effectively identify problems and their solutions. Worse, without open and honest discussion, people grow increasingly confused and suspicious of the facts, even when they come from traditionally well-respected government channels.\n\nIf such infighting and censorship existed whenever a new technology was developed and implemented, we would never have built safe cars, sent a person to the moon, or developed anything worthwhile in medicine. It is only when there is open dialogue and such energies for and against are working together for the common good that we find real problems and solutions that allow us to advance. Mistakes do happen, but they happen more frequently when both sides have taken hardline positions and become so attached to them that the lose the humility and flexibility to identify and embrace comprehensive solutions.\n\nCONVENTIONAL DRUGS: What are the limitations\n\nA narrow focus – we develop patentable and chronic solutions only\n\nConventional drugs and vaccines did not exist a century ago. One of the features that we take for granted, and which made these products possible, is patents. As a result, nearly every conventional drug or vaccine is currently, or once was, patent-protected. Patents protect profits and encourage research and development of products that can be patented. While patents have helped spur appropriate development in many other industries, they have created some serious unintended consequences in healthcare.\n\nIn healthcare, patents wouldn’t be a problem if all of the needed treatments were patentable and if their development didn’t come at the expense of non-patent-protected ones. But neither of those things is the case. Many of the solutions we need are not patentable. Patents are not a free-market solution, or part of Adam Smith’s “invisible hand”, where the totality of individual self-interest supports a greater social good. Nothing about patents is natural; they are a man-made invention that interferes with free markets.\n\nWe might think that because a new chemical entity is patentable, that it is somehow better and more likely to work. However, less than five percent of these make it beyond animal testing, and less than one percent to human testing[13]. In contrast, virtually every interesting food-based natural compound passes these criteria because they are already known to be safe and already have some favorable human data. To make something patentable, it is sometimes necessary to re-invent nature in ways that aren’t even aimed at making them better.\n\nBut surely, we are capturing most of the treatments and products that work?\n\nTo put things in perspective, if for every successful patent-protected drug, there was just one solution that is not patentable, we would be missing half of the treatments we should have looked at. If the number of non-patentable solutions for every patentable one rises to nine, we would be missing 90 percent of the products we should be looking at.\n\nEven many drug developers admit that existing natural templates are the starting point for many drugs[14]. So how could it be possible that there isn’t at least one natural unpatentable product for every patent-protected one? Patents in healthcare focus on a single new entity; real solutions and natural products have no such limitation. In nature, natural products can be composed of hundreds of compounds, and so non-patentable solutions can include countless different combinations.\n\nGiven the hundreds of thousands of natural compounds[15], millions more combinations of these compounds, and countless other non-drug solutions that exist and that are not subject to patents, there could be far more than one non-patent-protected solution for every patent-protected one, and perhaps far more than nine. So, the idea that we might be addressing this pandemic with less than ten percent of our potential solution set isn’t hyperbole, it’s quite plausible. Worse, while we had hoped that companies would be incentivized to use patents to create miraculous cures, they have instead been incentivized to create chronic therapies that don’t cure anything at all. They treat symptoms.\n\nTreating symptoms doesn’t cure a disease. Instead, it converts a curable disease into a chronic disease for which symptomatic relief is only possible if you continue to use the treatment for the rest of your life. This creates a very profitable recurring revenue stream — one that curative therapies don’t have. This creates a natural incentive to favor the use of patents to develop chronic therapies over curative therapies. In addition, patents are generally not issued for natural products and since cures are often natural products, this too favored the use of patents for chronic therapies.\n\nEven so, the advantage favoring chronic therapies was held in check, by the threat posed by any new cure. Cures make chronic therapies obsolete. That check was removed when the FDA and the NIH were established in the early 1900’s. Curative modalities are often NOT well-supported by the FDA and NIH. Chronic therapies, by contrast, are. Without a way to fund and legitimize curative therapies, they no longer posed a threat.\n\nThe Flexner report of 1910[16] put the final nail in the coffin by codifying medical school education towards the newer emerging biomedical technologies (i.e., drugs and vaccines). Within a few decades, practices and therapies that were commonplace for decades and longer, became vilified as alternative and unfounded. In an ironic twist of fate, the newer treatments we use today came to be known as traditional medicine.\n\nWhile these policies did do some very good things to protect patients, they also led to a dramatic shift in the focus of healthcare care from curative care to chronic care. The baby was thrown out with the bath water.\n\nA quick perusal of the top 100 best-selling pharmaceutical drugs will find less than a handful do anything other than treat disease symptoms; they are chronic therapies. So, not only have we limited ourselves to those products that are patentable, we have further limited ourselves primarily to those that only treat symptoms.\n\nThe wrong focus: treating symptoms not root cause\n\nIt is hard to imagine curing anything, if the idea is to do so by treating symptoms. It is equally hard to imagine healthcare costs going down, without curing any diseases.\n\nIf drugs don’t cure disease, the expression “miracle drug cure” becomes an oxymoron.\n\nA cure is NOT a drug you take for the rest of your life that hopefully eliminates more symptoms than it creates. And which, by suppressing symptoms, may even allow the underlying disease to get worse. That is the definition of a chronic therapy — one that treats disease symptoms, not the root cause. That is like bailing water from a sinking ship, when we should be repairing the hull. Yet, so well-indoctrinated have we become, that this new pharmaceutical definition for a “cure” has become MORE commonplace than a real cure. A real cure is usually something that fixes the problem so you don’t have to take it anymore. When it must be something you have to keep using, it should be something that is natural (like eating right, sleeping more, or exercising) and good for you (i.e., NO negative side effects).\n\nIn summary, we have become a culture where products and therapies that taste good, make you feel good, have no side effects, and which really work to treat root cause (like many natural wellness solutions) are vilified and go nowhere. Meanwhile, newer medicines and therapies that taste bad, make you feel bad, have all sorts of side effects, and which sometimes don’t work very well (i.e., most drugs), are raking in the profits.\n\nSo, why are we expecting drug companies to find a cure for COVID-19?\n\nWhile it’s possible they might, it’s more likely they won’t; finding true cures is not the main focus of this industry. Finding patent-protected, chronic therapies that create large, recurring revenue streams is. Unless a vaccine or drug requires multiple treatments/boosters or a new version every year (i.e., treats COVID-19 more like a chronic disease), such treatments don’t create that kind of recurring revenue stream. Therefore, development of cures only makes financial sense when there is a very high recurring incidence of the disease and it is severe enough to justify the potential side-effects a new drug might create. While COVID-19 may be serious enough to fit this bill for a new drug, it is clear is that liability exemptions for vaccine manufacturers (by virtue of lowering potential costs) makes vaccines even more profitable[17].\n\nWhen an off-patent drug proves effective at treating conditions it was not originally developed and approved for, there is no incentive for a company to do the required studies, even though this repurposed drug could help millions of patients. Instead, there is every incentive for companies to discredit such products in favor of waiting years to develop a more profitable patent-protected version. This same incentive exists at most research institutions, where royalties are only received when research produces patents that can be licensed.\n\nHow our focus on drug therapies prevents us from seeing curative solutions\n\nThat idea that a cure must be a drug makes little sense. With the exception of some antibiotics and cancer agents, most cures aren’t drugs. Instead, cures are more often natural products or processes we are deficient in, or the elimination of unnatural products or processes we should never have introduced. So, while we are spending all our resources on drugs, we are literally passing up whole avenues of curative approaches that might save us. Even so, I’m sure you will hear the common refrain, “If it really worked then some pharmaceutical company or the NIH would have invested the time and resources to prove it.” Or “The data would have been much more convincing and consistent, like it is for pharmaceutical products.”\n\nNo competent pharmaceutical company would invest the time and resources to develop a product that anyone else can immediately copy (i.e., is unpatentable) and which doesn’t have a large recurring revenue stream (i.e., is a curative therapy). Nor would they publish any contradictory research data if they don’t have to.\n\nThose independent parties that do study unpatentable products and curative therapies, or who challenge patent-protected products, often do small studies with whatever minimal budgets they have. Because these studies are being conducted by several disparate parties as opposed to one single company, methodologies are often not consistent, and some underfunded groups may do poor studies. Since most are published, contradictions and inconsistencies are common. This is why patent-protected products have more convincing and consistent clinical results, even when non-patent-protected products have the same or better efficacy. This discrepancy makes it far too easy to discredit therapies that could be incredibly valuable to us.\n\nWhen a product works and replaces a much more profitable product (even if that product is only in development), the incentive is very real for large companies to quietly sponsor conflicting studies or otherwise sow doubt. Even major government institutions are not immune, as they can be influenced by these same interests. This is why we often see industry-sponsored studies that are at odds with independent ones, and why well-meaning government institutions can make bad recommendations. How else do you think smoking could have been deemed safe for so long[18]?\n\nThe belief that the NIH is any more egalitarian is misleading. This institute was originally established in large part to support the growing biomedical establishment, not root cause modalities and curative therapies more common to alternative and complementary treatments. The NIH, with its $42 billion annual research budget[19], devotes less than one-half of one percent (0.375%) of its funding to anything other than conventional approaches (i.e., pharmaceuticals)[20]. Private foundations aren’t much better. When I participated in the 2013 White House Conference on Lowering Health Care Costs and Improving Outcomes[21], the litany of complaints about the lack of support for validating non-patent-protected therapies was endless. Research funding is readily available for biotech, but not for better-validated, cost-saving — but unpatentable — interventions.\n\nFDA – A pathway to market for conventional drugs, devices, and vaccines\n\nThe FDA was established to give us confidence in and to protect us from the drugs and devices developed by the growing biomedical industry. It was not established to promote all the “healthy” safe products that were already in the marketplace or to help identify and approve new ones. The FDA regulatory and clinical process is funded in part by pharmaceutical companies[22]. It should, therefore, not come as any surprise that the accepted methodology for clearance through the FDA is more conducive to patent-protected drugs than for “healthy” care interventions. In many cases, there isn’t a clear regulatory pathway for natural or non-patent-protected therapies[23] at all. How would you patent or get FDA approval for a diet, a supplement, behavioral therapies, or an exercise? Who would spend the money to obtain such an approval?\n\nWith no money for studies and without a viable regulatory pathway, is it any wonder that there isn’t “sufficient” data to support these modalities? I am reminded of George Berkeley’s famous quote:\n\nIf a tree falls in the middle of a forest and \n\nno one is around to hear it;\n\ndoes it make a sound?\n\nIf a product works and\n\nno one can do the studies to prove it;\n\ndoes it work?\n\nThis latter refrain applies to virtually every natural compound and product, such as vitamins, minerals, and supplements, as well as to a whole host of modalities and services ranging from diets, exercises, behavioral therapies, and much more. It also applies to off-patent, off-label (i.e., repurposed) solutions.\n\nAbsence of proof does not mean proof of absence.\n\nThis is why we should never dismiss out of hand these kinds of solutions just on the basis that they do not have the quantity or quality of data support that a patent-protected drug or vaccine typically does. Any deviation from using FDA approved products (drugs) or “normal” practice exposes doctors to potential litigation, making it very difficult for the people who most need these options to consider them. This is how good people can be biased against and actively deter innovations capable of improving the lives of millions. It has been a recurring theme since the dawn of mankind: I can imagine the first caveman struggling to explain how fire is a good thing as smoke fills the cave, or how hard it was for the early Greeks scholars to convince people the earth is round. Copernicus and Galileo fared worse by telling the church that the earth isn’t the center of the universe. Even handwashing, which Dr. Semmelweis proposed in the mid-1800’s, and which we all now take for granted, was an uphill battle. The notion that we might be opposing the very ideas we most need isn’t just plausible it’s probable.\n\nHow else can things be so wrong in our healthcare system?\n\nIn virtually every sector of the economy, technological innovations have dramatically lowered costs and improved the lives of millions, but not so in healthcare. In healthcare, costs are out of control and diseases that were once uncommon like obesity and Type II Diabetes are now so commonplace even our children are affected[24].\n\nThis doesn’t mean that there are no valuable patent-protected drugs or vaccines. There are. It also doesn’t mean that such products haven’t helped millions. They have.\n\nWhat it does mean is that unless we fight our bias for patent-protected technologies and recurring revenue streams, we will be limited only to those conventional products that fit a very narrow set of financial and regulatory constraints — constraints that are clearly not in society’s best interest.\n\nIt means that we are now fighting this and any future pandemic without a full deck of cards. And sooner or later this won’t be enough.\n\nIt means that we MUST find ways to be more open to looking at and testing “nontraditional” solutions, particularly those that are safe and easy to try.\n\nIt means that instead of complaining and deriding non-patent-protected and off-patent therapies for their lack of data, we should be finding ways to thoughtfully gather that data.\n\nFinally, it means recognizing that healthcare is broken and that doing the same thing over and over again and somehow expecting cures and lower healthcare costs is insane.\n\n[20] https://www.nccih.nih.gov/about/budget/nccih-funding-appropriations-history The NCCIH budget most closely approximates alternative and complementary approaches which are not patent-protected.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19: FROM CRISIS TO OPPORTUNITY — TAKING BACK OUR LIVES                         PART 3: CONVENTIONAL DRUGS AND VACCINES — ARE THEY ENOUGH? - Thrive Global", "description": "An inconvenient truth - We are in danger of missing the larger picture and the real opportunity.", "url": "https://community.thriveglobal.com/covid-19-from-crisis-to-opportunity-taking-back-our-lives-part-3-conventional-drugs-and-vaccines-not-all-we-imagined-2/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-07-14T21:04:19+00:00", "article:modified_time": "2021-08-08T12:27:59+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/11/Thrive-Global-Meta-Image.png", "image:width": "1200", "image:height": "627", "image:type": "image/png"}, "tags": ["pandemic", "repurposed drugs", "comorbidities", "symptomatic treatments", "herd immunity", "Coronavirus", "new vaccines", "minerals", "chronic diseases", "Treatments", "curative treatments", "Diabetes", "Drugs", "pharmaceutical", "covid variants", "Supplements", "Alternative medicine", "covid", "alternative treatments", "non patent", "root cause", "chronic solutions", "Adam Smith", "pro-vaccine", "COVID-19", "fda", "Wellness", "George Berkeley", "asymptomatic", "censorship", "patentable solutions", "Chinese practices", "Obesity", "patents", "#vavici", "natural treatments", "deficiency", "Symptoms", "NIH", "Cure", "devices", "vaccines", "clinical studies", "Wuhan", "Flexner report", "biomedical", "Sammelweis", "vitamins", "an inconvenient truth", "booster"], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection#cda5aca38dbbacbba4aea4e3aea2a0", "http://www.vavici.com", "/cdn-cgi/l/email-protection", "#_ftn1", "#_ftn2", "#_ftn3", "#_ftn4", "#_ftn5", "#_ftn6", "#_ftn7", "#_ftn8", "#_ftn9", "#_ftn10", "#_ftn11", "#_ftn12", "#_ftn13", "#_ftn14", "#_ftn15", "#_ftn16", "#_ftn17", "#_ftn18", "#_ftn19", "#_ftn20", "#_ftn21", "#_ftn22", "#_ftn23", "#_ftn24", "#_ftnref1", "#_ftnref2", "#_ftnref3", "#_ftnref4", "#_ftnref5", "#_ftnref6", "#_ftnref7", "#_ftnref8", "#_ftnref9", "#_ftnref10", "#_ftnref11", "#_ftnref12", "#_ftnref13", "#_ftnref14", "#_ftnref15", "#_ftnref16", "#_ftnref17", "#_ftnref18", "#_ftnref19", "#_ftnref20", "#_ftnref21", "#_ftnref22", "#_ftnref23", "#_ftnref24"], "authors": ["Han S Chiu MD"], "publish_date": "2021-07-14T21:04:19+00:00"}