{"result_id": "315015", "URL": "https://community.thriveglobal.com/after-vaccination-wear-the-damn-mask/", "timestamp": "2023-04-25 17:40:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/after-vaccination-wear-the-damn-mask/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "After Vaccination: Wear the Damn Mask!", "cleaned_text": "Unless there are good reasons to the contrary, perhaps the most important thing you can do this year is to wear a mask until you take the COVID-19 vaccine as soon as it is available to you. The second most important is to take the second shot. The third is to wear the damn mask and to follow the recommendations of people who actually know what they are talking about. Statistics tell us that even after vaccination there are still risks to you and your community! People will not receive the maximal protection offered by a vaccine, until two to four weeks after the final shot. Ignoring statistics can be dangerous as I learned the hard way.\n\nIn 1974, just weeks before my wedding, while a medical trainee at McGill, I was conducting an experiment in a hyperbaric chamber. These chambers, which resemble small submarines are used to simulate the environment at different depths below sea level. It was the early days of exploration for oil in the North Sea and it wasn’t known what would happen when people exercised at great depths. There was an exercise bicycle in the chamber, and the subjects were exercising at their highest capability, while I was making measurements. The pressure (depth) in the chamber was being controlled by a physician who had been a US Navy diver. He was an expert in pressurizing (diving) and depressurizing (returning to the surface) the chamber. Depressurizing involved returning to the surface slowly, making stops at different depths along the way.\n\nThe Chamber at the Royal Vic. Photo from: Duff et. al. The Hyperbaric Chamber at the Royal Victoria Hospital, Montreal. Can Med Assoc J. 1964;91(20):1051-1055\n\nAfter one of the experiments, simulating exercise at 200 feet below the surface of the ocean, we were “brought back” to the surface. As I had done many times before, when we reached the surface, the hatch was opened. I walked toward my office. SUDDENLY MY LEFT FOOT FELT NUMB, THEN WEAK AND THE NUMBNESS CREPT UP MY LEG AND THEN MY LEFT ARM. I was having trouble walking. I thought I was having a stroke. The research subject, a trainee from Colorado, quickly saw what was happening to me and walked me back to chamber. I was half paralyzed. I was having the bends. I knew exactly what had happened. Tiny bubbles had formed in my nervous system. Everybody panicked. The head of the pulmonary department (a world-famous researcher was summoned) and my friend from Colorado attended to me. I was back in the hyperbaric chamber; they were with me for 6 hot sweaty hours, while the chamber was repressurized; my feeling and strength slowly returned. The chamber was then slowly depressurized with several steps before sea level was reached.\n\nI was hospitalized for one night on a floor where I had been a medical resident. A few days later I presented myself at Grand Rounds. I knew what happened in my nervous system, and I realized why it had happened. I did not pay attention to STATISTICS! On the descent to depth and return to sea level we had been using US Navy 95% tables. These tables indicate the steps and rapidity of pressure changes for a safe journey. These were 95% tables. That meant that they would be safe in 95 out of 100 journeys. I often wondered how these table were established. In any case I was a victim of statistics. 95% sounds like great odds. My paralysis was proof that they were not great odds. I had learned my lesson.\n\nMillions of us are going to be vaccinated for COVID-19 in the next few months. The vaccines being distributed in the US right now are 95% effective. Great odds? Imagine 100,000 vaccinated people are at a superspeader football bowl game, none wearing masks. Imagine the announcer blaring out “5,000 of you will get a COVID-19 infection today” and then, “50 of you will die of this”, and then, “10,000 people in your community will get COVID”. Still great odds? Odds and statistics have to be looked at in context.\n\nAs a doctor, I frequently have to give patients statistics about various treatment options. The statistics have to be considered in context. What are the potential pluses and minuses, considering that the worst-case scenario may happen? For example, there is a surgical treatment for sleep apnea that is effective in 50% of cases. Are those good or bad odds. Perhaps they are good if you’re in Las Vegas. But a 50% chance of success versus a 50% chance of no benefit, but the risk of potential harm are terrible odds in my eyes.\n\nThere is still a great deal we don’t know about COVID. There is no question that everybody should have the vaccine when it is available to them, and there aren’t compelling reasons not to be vaccinated. We don’t yet know whether a vaccinated person can still get an asymptomatic infection and still transmit the virus to others. We don’t yet know how long immunity lasts from the vaccines. Until COVID is eradicated from the community KEEP WEARING THE DAMN MASK, KEEP SOCIAL DISTANCING, WASH YOUR HANDS FREQUENTLY. Take it from someone who at the age of 27, just weeks before his wedding, had a stroke (which thankfully reversed) and who learned statistics the hard way.", "opengraph": {"locale": "en_US", "type": "article", "title": "After Vaccination: Wear the Damn Mask! - Thrive Global", "description": "The hard lesson I learned about statistics almost 50 years ago.", "url": "https://community.thriveglobal.com/after-vaccination-wear-the-damn-mask/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-01-01T14:58:23+00:00", "article:modified_time": "2021-01-01T14:58:25+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/01/Screen-Shot-2021-01-01-at-9.57.47-AM.png", "image:width": "1366", "image:height": "758", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Meir Kryger, MD"], "publish_date": "2021-01-01T14:58:23+00:00"}