{"result_id": "315028", "URL": "https://community.thriveglobal.com/are-mandatory-vaccines-legal-in-the-workplace/", "timestamp": "2023-04-25 17:41:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/are-mandatory-vaccines-legal-in-the-workplace/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Are Mandatory Vaccines Legal in the Workplace?", "cleaned_text": "As we ride out yet another COVID-19 wave, returning to the workplace is now in jeopardy. In fact, some businesses are delaying this until next year. Others, however, are still planning on bringing back employees in at least some capacity this fall.\n\nAs a result of the spread of the delta variant, physical safety concerns are making some employees reconsider their return to work plans. According to a survey conducted by The Harris Poll, which was on behalf of Glassdoor, nearly 9 in 10 employees, 89%, still worry about returning to the office. In addition to their physical safety, employees are concerned about how they’ll interact with their employers, present themselves, and how they commute to and from work.\n\nHow can you address these concerns? Well, you may want to allow your team to work remotely. Or, at the very least, build and manage a hybrid team.\n\nEven with a hybrid team, there will still be concerns about the recent surge in COVID-19 cases. And, one answer might be the controversial topic of requiring your team to get vaccinated. But, is this legal, and how can you have this discussion with your team?\n\nIs There a Legal Precedent for Requiring Vaccines?\n\n“There is Jacobson v. Massachusetts, [a Supreme Court case from 1905]. The case itself was about a vaccination mandate,” Lindsay Wily, a law professor at American University, told NPR.\n\n“In the early 1900s, smallpox outbreaks were fairly frequent, and many people had been vaccinated earlier as children, but needed to be vaccinated as their immunity waned,” adds Professor Wily. “The state of Massachusetts passed a law that gave authority to local boards of health to decide at any given moment in response to an outbreak that smallpox vaccination should be mandatory for all residents of their local area if — in the opinion of the medical experts who were serving on the board — it was necessary to protect the public’s health.”\n\nThat decision was made by the city of Cambridge. After that, outreach efforts were undertaken to reach out to everyone in the community. When they approached Henning Jacobson, however, he objected. Vaccines, he said, are ineffective. According to Jacobson, they do not prevent transmission. Moreover, he argued that these practices are harmful.\n\n“The court described those arguments as not seeking a medical exemption, but rather reciting the alternative views that differ from medical consensus and that those arguments did not warrant an exemption from the requirement to be vaccinated,” says Wiley.\n\nBut, what about private employers?\n\nFlu shots and other shots are often required by employers in the health care industry. This is a precaution to protect patients, as well as to offer some protection for employees. “So, for example, many require hepatitis vaccinations in addition to flu shots and all of the kind of childhood vaccines that we tend to get as a condition of attending school,” explains Wiley.\n\n“The other kind of common requirement applied to adults who are over the age of 18 has been university requirements — college attendance requirements,” Wily adds. “College students in many states are required by law, not just by the [decision] of the college, to get a meningitis vaccine because of a higher incidence of meningitis outbreaks in the kind of congregate setting on campuses.” So as far as vaccination requirements for COVID go, we’ve seen this group lead the charge.\n\nIf you’re an employer, you can require your employees to be vaccinated. However, this is considered a “condition of employment,” which is equivalent to job qualification. And, while employees can refuse to get vaccinated, they don’t have much legal protection.\n\n“Employers generally have wide scope” to create rules for their workplace, said Dorit Reiss, a law professor who specializes in vaccine policies at the University of California Hastings College of the Law. “It’s their business.”\n\nBut, wait a minute? Isn’t asking your team about their vaccination status a HIPPA violation? Despite what folks like Majorie Tayor Green and Dak Prescott have proclaimed, nope.\n\nAt the same time, there are valid exceptions that you certainly should be aware of.\n\n“An employee with a religious objection or a disability may need to be excused from the mandate or otherwise accommodated,” clarifies John Lomax, an attorney with Snell & Wilmer in Phoenix. “Additionally, if an objecting employee is a union-represented employee, the employer may need to bargain and reach an agreement with the union before mandating vaccines.”\n\nIf you do have employees who can be exempt from receiving the COVID-19 vaccine, try to make reasonable accommodations. The most obvious would be allowing them to work remotely or take a leave of absence. You could also have them sign waivers or work under specific conditions, like wearing masks or practicing social distancing.\n\nHaving a Conversation With Your Team About the COVID-19 Vaccine\n\nBecause this is such a controversial and polarizing issue, you must sit down with your team and discuss the COVID-19 vaccination. Afterward, the employee can then make a more informed decision.\n\nHere are some pointers to keep in mind if you want to talk with employees about a supportive COVID-19 vaccination.\n\nYou can talk to your team either one-on-one or as a group. You can then let them know why you want them to get vaccinated. Mainly to prevent illness, which is for the greater good of the team.\n\nYou will no doubt come across numerous questions and concerns regarding the vaccine. Keep the following in mind to put your team at ease;\n• Consider flexible scheduling options that are not punitive (such as paid sick leave) for employees who experience side effects after vaccination.\n• Remind everyone, even if they’re young and healthy, that the vaccine is effective. While the research is ongoing, COVID-19 vaccines are estimated to be about 95 percent effective in preventing serious illness.\n• Not everyone enjoys getting jabbed. Assure them that the COVID-19 shot isn’t any worse than getting a flu shot.\n• Encourage them to seek out reputable information regarding the vaccine, aka not getting their info from social media. Steer them in the direction of the CDC, Johns Hopkins University, or the Immunization Action Coalition (IAC)\n• Host a vaccination clinic at your workplace to make this more convenient for your team. Contact your local health department for assistance.\n\nFinally, if you have team members who aren’t vaccinated, but plan to, find out what’s holding them back. Do they need further information? Or are they just afraid to ask for time off? Finding this out can help you assist them in getting vaccinated.\n\nWhat if you have employees who still refuse to get vaccinated? Again, you could ask them why. You don’t need to press too much. But, it could be something as simple as them not wanting to take time off for work.\n\nIf they have valid reasons, try to accommodate them. If possible, for the time being, allow them to continue working from home. But, if that’s not possible, and they’re in jeopardy of the health and well-being of the rest of the team, you may have to let them go.\n\nAre Mandatory Vaccines Legal in the Workplace? was originally published on Calendar by John Rampton.", "opengraph": {"locale": "en_US", "type": "article", "title": "Are Mandatory Vaccines Legal in the Workplace? - Thrive Global", "description": "Even with a hybrid team, there will still be concerns about the recent surge in COVID-19 cases.", "url": "https://community.thriveglobal.com/are-mandatory-vaccines-legal-in-the-workplace/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-08-18T22:23:00+00:00", "article:modified_time": "2021-08-18T22:23:13+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/08/Screen-Shot-2021-08-18-at-4.26.26-PM.png", "image:width": "840", "image:height": "527", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.calendar.com/blog/steps-to-reopen-your-office-what-to-expect-from-employees/", "https://www.cnbc.com/2021/07/08/how-many-workers-will-be-returning-to-offices-and-how-often.html", "https://www.glassdoor.com/blog/return-to-office-perks-and-concerns-survey/", "https://www.calendar.com/blog/8-ways-to-manage-your-hybrid-team/", "https://www.npr.org/2021/08/12/1027132680/can-the-government-make-me-get-the-covid-vaccine", "https://apnews.com/article/coronavirus-pandemic-health-business-33ecd7a3bbc2d4b0f260db2abc147464", "https://www.shrm.org/resourcesandtools/legal-and-compliance/employment-law/pages/if-workers-refuse-a-covid-19-vaccination.aspx", "https://www.calendar.com/blog/maintaining-productivity-using-mental-physical-health-tips-during-covid-19/", "https://www.calendar.com/blog/blog-how-to-make-flexible-work-schedules-work/", "https://www.cdc.gov/vaccines/vac-gen/evalwebs.htm", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/is-the-covid19-vaccine-safe", "https://www.immunize.org/", "https://www.calendar.com/blog/10-realistic-and-unconventional-wfh-tips-for-2021/", "https://www.calendar.com/blog/are-mandatory-vaccines-legal-in-the-workplace/", "https://www.calendar.com/", "https://www.calendar.com/blog/author/john-rampton/"], "authors": ["John Rampton"], "publish_date": "2021-08-18T22:23:00+00:00"}