{"result_id": "315007", "URL": "https://community.thriveglobal.com/tcnj-students-write-about-covid-19-vaccination-accessibility-on-campus-and-beyond/", "timestamp": "2023-04-25 17:40:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/tcnj-students-write-about-covid-19-vaccination-accessibility-on-campus-and-beyond/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "COVID-19 Vaccination Accessibility & The College of New Jersey", "cleaned_text": "The novel coronavirus devastated the world when it first spread like wildfire, and the United States felt the brunt of the impact with little infrastructure to prevent disaster from occurring. Then, slowly but surely, the nation built itself back up, and a vaccine eventually arrived on the market. The state of New Jersey suffered in their own ways, yet what went wrong when compared to other parts of the country, and could it have been prevented? What does that lack of efficiency mean for college students, specifically ones at The College of New Jersey in Ewing, right near the capital city of Trenton, all who were eligible at all different phases of the rollout due to their own experiences?\n\nThrough a scientific, national, educational and demographic lens, the pandemic can be explained from the “failures” of the past to the promise of the future. By examining what has already taken place, new solutions will determine if accessibility can be the goal rather than just a dream.\n\nChapter 1: New Jersey COVID-19 Vaccine Eligibility: Parameters & Cutting the Line by Haley Nakonechny\n\nThirteen months ago, the entire world witnessed life as we know it unfold before our eyes and a new, unknown reality took place. Mask mandates and social distancing became the new normal, and a once-simple task like grocery shopping became a daunting trek. Fear took over many lives as the virus ravaged across the country. For many, the hope for a cure simply seemed to be only just a distant, unachievable wish.\n\nNow, 13 months later, what seemed impossible a year ago is now a reality: a vaccine is accessible and readily available throughout the United State. As of April 22, 2021, 6,310,065 people in New Jersey have had at least one dose of the COVID-19 vaccine, with 2,631,691 of those being fully vaccinated.\n\nWith the vaccines only becoming available for mass distribution in late December, this is an incredible feat, considering that the United States surpassed 60,000 deaths related to COVID in April.\n\nHowever, while about two-thirds of the New Jersey population have been vaccinated, there continues to be controversy surrounding the efficacy of the vaccine, especially with the current debate surrounding the Johnson & Johnson vaccine.\n\nDespite that, research still proves that the vaccines are effective. For instance, Pfizer, the first to release its vaccine to the public, has a 95% success rate of preventing positive exposure to COVID-19. In a study done prior to being allowed for public use, out of the 36,523 participants, only 0.5 to 0.6% of them had adverse effects from the vaccine, while many only face the mild side effects we hear about today.\n\nWithin weeks of these promising results, the vaccine was approved for use, and New Jersey rolled out their first round of vaccines under the New Jersey Interim COVID-19 Vaccination Plan to Phase 1A: healthcare workers and to individuals living in long-term care facilities.\n\nThe New Jersey Department of Health worked alongside healthcare partners and immunization stakeholders to determine eligibility across the state, starting first with who they believed was the most at risk for falling ill or succumbing to the virus.\n\nCassidy Kimmel, a senior Nursing student at The College of New Jersey, works at Hackensack Meridian Raritan Bay Medical Center as a Patient Care Technician. Due to her position at the hospital, Kimmel was among the first in the state to be vaccinated, receiving her first dose in December.\n\nFor Kimmel, being among the first to receive the vaccine was a necessity, as she saw first-hand how the virus can take over a hospital.\n\n“I was extremely grateful to receive my first dose of the Moderna vaccine so early on,” said Kimmel. “As a nurse, we were at the frontlines of the pandemic and exposed to COVID-19 at a much higher rate than the general population. It made sense we were among the first to receive doses since we take care of patients and could potentially risk spreading it from patient to patient throughout the hospital.”\n\nFollowing healthcare workers and long-term care residents came Phase 1B in January, allowing those aged 16 and over with serious medical conditions and anyone aged 65 and older to receive the vaccine.\n\n“Over the last several months, our administration has built the infrastructure and laid the groundwork to support New Jersey’s COVID-19 vaccination demand,” said Governor Phil Murphy in a press release announcing the expansion of eligibility at the time. “Based on recommendations from the Centers for Disease Control and Prevention, we are ready to begin ramping up our vaccination efforts exponentially and are confident in our ability to provide every willing New Jersey resident with a vaccine when it is available and they are eligible.”\n\nNow, as of April 19, any New Jersey resident aged 16 and over can receive a COVID vaccine, regardless of their profession or any serious health concerns. And with two thirds of the state’s population already vaccinated, it is looking more promising than ever that this disease will soon become less of a problem for people throughout the state.\n\nAcross the state though, vaccination plans have varied greatly. At this current point in time, most states are on the same page and have opened up eligibility for individuals ages 16 and over. However, in March, North Carolina faced massive backlash for allowing individuals who have smoked 100 or more cigarettes in their life to be eligible for the vaccine.\n\nAdditionally, while New Jersey has had a vaccination program in place, prior to eligibility opening up, it was not uncommon to see a person ‘cutting the line’ and receiving their vaccination before they were supposed to.\n\nIn February, Atlantic Health, the company responsible for managing the COVID vaccine appointment system, came under fire due to flaws in the system allowing individuals to register for their vaccine when they were not in that current phase.\n\nFor CVS pharmacy intern Gia Parés, this was especially disheartening to hear about.\n\n“I do think it was concerning that so many people were able to cut the line,” said Parés. “First the government categorizes people into groups who should get vaccinated first rather than later, making many people paranoid, and then healthy, young individuals go and cut the line. I don’t think it’s right that that happened, and I think it could have been avoided had there been proper protocols established to ensure everyone got vaccinated in the proper, timely manner.”\n\nSince the initial reports of cutters in the vaccination system, the system to schedule appointments was altered to help prevent this from continuing. Especially with eligibility opening up to include almost every New Jersey resident, this problem is essentially non-existent now.\n\nWhile vaccines have provided a sense of security to many, the next biggest question for researchers to answer is how long they last. Will this one-time shot be enough, or will it be recommended to get one yearly like the flu shot?\n\n“I am concerned with the efficacy of the vaccine because there is no data telling us how long we will be protected for,” said Parés. “Already, there are reports saying that a third booster is going to be needed and needed sooner rather than later. It is not uncommon to have booster vaccines but with this vaccine, we don’t know yet if it needs to be administered.”\n\nTime is the key to answering this next question. For now though, it looks like society is on its way to a sense of normalcy once again as New Jerseyans continue to become vaccinated.\n\nThe United States of America reacted to COVID-19 not just in an explosion of federal mandates and emptied-out grocery stores, but with guidelines specific to each state in the country, their governors having respective “fair play” to the intricacies of their pandemic response systems. New Jersey and The College of New Jersey, when compared to the rest of the nation, faced the problems of their population density, eligibility parameters, and slowed vaccine rollout procedures. At first, TCNJ limited transmission of the virus by switching to distanced, remote learning that separated students from each other. Letting a number of students back on campus in the springtime, though, has caused those rates to increase.\n\nThe college expects to be fully in-person as of the Fall 2021 Semester.\n\nThe New York Times reported that out of approximately 998,811 cases of the coronavirus, there were about 25,588 total deaths in New Jersey as of May 2. At one point, NJ had the highest rate of new cases in the entire country.\n\nIn what appears to be a positive turn, the paper reported that 37% of the population was fully vaccinated, with over half the state having one dose of the vaccine (52%). Governor Murphy maintained that on March 19, about 1 in 6 of adults in New Jersey were safe from the harsher clutches of the disease. While hospitalizations fluctuate and cases rise exponentially given the state’s reopening process, it seems that there is a somewhat of a light at the end of the metaphorical tunnel.\n\nYet for TCNJ, which claimed a total of over 139 on-campus cases out of the 1,139 returning students since February 1, the rates provide context to show whether the school adopted similar patterns in upticks and preventative measures. Did the state, and therefore the College, abide by the same safety procedures as other parts of the country? The answers lie in the numbers as well as the standard established for administering the vaccines.\n\nBack in December, people were enraged when phases of who qualify for the vaccine first were announced, because the groupings placed smokers in higher-risk categories (1B) than people with Type 1 Diabetes (1C), those who were overweight (1B) rather than college professors (1C), etc. above who they deemed worthy of the initial access.\n\nDonna Leusner, the Director of Communications at the New Jersey Department of Health, said that the phased approach was a “fair and equitable” take on putting high-risk individuals, especially those with comorbidities and/or the elderly leveraged against the general population. As of April 19, anyone 16 and older can sign up for their own vaccine.\n\nNew Jersey reinforced the notion that smokers were susceptible to the virus, even if other states (with the exception of Mississippi) did not follow suit.\n\n“The Department followed CDC guidance. Nicotine is one of the most powerful addictions. Smoking puts individuals at higher risk for more severe disease. If an individual who smokes gets COVID, they get sicker much quicker. Our goal is to save as many lives as possible and to promote vaccination among the highest risk groups. Smoking is the leading cause of death in the US as well as in NJ, except for COVID-19,” Leusner said. “We encourage anyone who smokes to quit.”\n\nIt takes the collaboration of several state organizations to create a system for determining eligibility. Leusner said that Murphy’s decision-makers were composed of entities like the Professional Advisory Committee, Homeland Security, and other important agencies who worked together to prioritize who they felt medically needed the vaccine before a certain group. By following CDC guidelines as well as their own health findings, New Jersey determined their own schedule.\n\nNew Jersey’s biggest missteps were not just because the state has a large population or because they urged smokers to receive their vaccines before many others. The article “The Unraveling of NJ” is about how America’s elderly population in group living situations, considered to be the first big sites for mass spreading of the virus, suffered at the hands of administration.\n\nIn a study of resident average deaths per 1,000 residents, New Jersey had the highest rate with 124.2 back when it was originally conducted in November 2020. The Department of Health’s data on COVID-19 cases in long-term care facilities lists a total of 235 homes affected by the virus.\n\nBack in December, the state missed federal guidelines for vaccination in these communities, causing a one-week delay in getting the vaccine to the elderly that likely resulted in further deaths and positive cases. Partnering with pharmaceutical giants like CVS and Walgreens, the efforts by the state were to secure vaccines for high-risk people in susceptible environments. The fight to curb coronavirus already faced scarcity in the administration of shots from the brands available, and the discrepancies had a cost.\n\nNew Jersey did not, or possibly could not, move fast enough.\n\nWest Virginia, the only state to rely on local partnerships rather than federal coordination, effectively used the National Guard to distribute vaccines to local pharmacies. They avoided the “red tape” others had to bypass by instead using mom-and-pop businesses.\n\nIf New Jersey tried to separate themselves from the rest of the pack, it could have been the solution that saved lives. States like Massachusetts and Florida focused on vaccinating their older populations first, and the data has yet to show if that was an effective course of action. Later findings might give NJ an idea for a second wave of vaccine rollouts, because they know exactly who is vulnerable and what to avoid.\n\nMore than 2,000 prison inmates were released to slow transmission in NJ correctional facilities starting in November, but the state still had the highest prison death rate in all of the United States. According to the Marshall Project, a journalism organization that covers the American criminal justice system, 1 in 4 prisoners have tested positive, 2.4 times the overall state’s rate with 4,684 cases.\n\nNew Jersey’s qualifications for phases broke the status quo, and their treatment of civilians in enclosed spaces like prison or care facilities set a dangerous standard. While the current situation makes for a better future, history’s bleak reminder is that it should have, and could have, gone a lot smoother, faster, and more evenly distributed.\n\nAs cases of COVID-19 spiked around the world and rapidly spread within communities, high social expectations for students entering or continuing their college years seemed far out of reach.\n\nOn Friday, March 20 of 2020, students at The College of New Jersey received an email from President Kathryn Foster with the subject “Lion Strong,” an ode to their mascot and the resilience of the students.\n\nAfter receiving emails all week with COVID-19 updates and the switch to online instruction, the context of this email was highly anticipated yet deeply dreaded by TCNJ students – canceling the rest of in-person activities and moving students out of campus housing.\n\nIn the early days of the pandemic, imagining a society with a COVID-19 vaccine was an ideal rather than a reality. Now, with multiple options for vaccinations and expanding eligibility to receive them, the hopes of college students to make up what the pandemic has taken away are restoring.\n\nThe term “social distancing” did not withhold the universal understanding it does today when outlined in Foster’s email on March 10th, ten days prior to when the rest of the semester was moved online.\n\nThe CDC put out a statement outlining that small groups of fully vaccinated people can safely gather without wearing masks or social distancing. Throughout the pandemic, these CDC guidelines meant little to the college students that continued to gather and disregarded advice from professionals.\n\nDespite encouraging social distancing protocols and consequences of large events, parties and festivities that make up the “college experience” continued on campuses while perpetually informed of the high risk for doing so.\n\nThe first year of college is associated with shaping the next four years as well as adjusting both socially and educationally to the college lifestyle. With COVID-19 sending these newly settled freshmen packing, the students additionally assimilated to ‘Zoom University’– a term that college students throughout the nation can relate to.\n\nThe class of 2023 and 2024 now have more experience in online college than in-person.\n\nWhile TCNJ planned to bring students back on campus for the Fall 2021 semester, these hopes were crushed when plans were revised for only a small population on campus and reducing in-person, on-campus activity, per President Foster’s email sent a few weeks before students were scheduled to return.\n\nMichael Paolella, the Vice President of Operations for the class of 2023, had originally planned to return for this semester to regain the college lifestyle that his entire class had missed out on.\n\n“I was looking forward to housing in the fall, just to not home for a whole other year and miss out more than I already had,” Paolella said about returning to campus for the fall, which the rising COVID-19 numbers changed the plans to go back fully online. “When we got that email from President Foster in the fall, I was pretty disappointed but I understood why it had to be done…my professors were very understanding of the situation we were all in, which made up for not being on campus but couldn’t compare to being in-person.”\n\nAs a sophomore who had freshman year cut short from the pandemic, Paolella is currently on campus for the spring 2021 semester. “I had my doubts that we would actually be able to return this semester, given what happened in the fall, but I am grateful to be back on campus and how TCNJ pulled it off.”\n\nThe class of 2020, meanwhile, were in an entirely opposite situation, looking to make their last few months of being in college count.\n\n“Learning from home is crazy hard, and after so much time on my laptop in my room, I was just looking forward to going to sleep without thinking about my capstone,” said Diamond Hackley, a 2020 graduate of TCNJ.\n\nIn addition to losing their last few months on campus as college students, Hackley’s graduating class had a virtual commencement because of the risk of in-person ceremonies with COVID-19. “I definitely started to check out of the excitement to graduate and was more so leaning into making it through the semester,” she explained.\n\nAs a Community Advisor (CA) in Wolfe Hall, Hackley finished out her responsibilities as a line of support for residents by virtually supporting her freshman while relating to their struggle of moving online.\n\n“Once we went remote and couldn’t really see or engage with our ‘rezzies’ in the same way, we definitely had to switch up our approaches to being able to offer support and guidance without sharing space with our residents or being able to check in with them in the same ways,” said Hackley, in regards to her undertakings as a CA once COVID-19 moved the rest of the semester online. “Lots of residents needed their time to themselves given everything that was going on, we had to learn to navigate that while still trying to be present.”\n\nAn Academic Ceremony for the class of 2020 will now take place on April 24th-25th, over a year after being on campus and almost a year since virtual commencement in May.\n\n“It was definitely a huge shift in the dynamic but my biggest hope was for my residents to know that I cared without making them feel as though they needed to constantly check in,” continued Hackley, utilizing experience with her residents throughout the school year to be supportive while not being on campus. “Hopefully with the vaccines becoming more accessible, students will have more of an opportunity to spend time on campus and regain some of that in-person college experience.”\n\nThe idea of regaining college experience is becoming more of a reality, as vaccine eligibility opens up and more students are given the opportunity to receive their dose.\n\nRutgers University became the first college in New Jersey to require all students returning to campus in the fall to be vaccinated. Being a large, widely-known university, the vaccine requirement for Rutgers students suggests that other universities may follow suit.\n\nConsidering the skepticism existing around the vaccine, especially with the current recall of the single dose from Johnson & Johnson, the possibility of students not returning over the vaccine requirement comes forth.\n\nStudents currently living on campus at The College of New Jersey are required to get tested twice a week. This was increased from the initial once-a-week requirement after a surge of positive cases on campus, with the requirement applying for students who have been vaccinated as well.\n\nSign on the TCNJ campus directing students to the COVID testing site, where students are required to get tested twice a week.\n\nThe current conditions for students residing on campus are outlined in Roscoe’s Pledge, which all students were required to sign and are expected to oblige to prevent the spread of COVID-19.\n\nWhile the pandemic came with circumstances like never before, the on-campus experience for the Spring 2021 semester at The College of New Jersey gives hope that a safe, in-person experience is within reach.\n\nChapter 4: COVID-19 Vaccines & Demographics Translated to The College of New Jersey by Lana Leonard\n\nCOVID-19 vaccination distribution data uncovers trends of disproportionate vaccinations to White people than that of Black, Latino, Hispanic and Asian demographics. Disproportionate inoculations vary through races, gender, and class systems and will translate through national and state findings to Mercer County’s state school, The College of New Jersey (TCNJ). It is important to note that this data is specific to April of 2021 and is ever changing as COVID-19 is still an ongoing battle – as Americans, New Jerseyans, and TCNJ students continue to receive COVID-19 vaccinations.\n\nOver a quarter of United States citizens are fully vaccinated. That percentage, nearing a third of the population, translates into approximately 132 million people vaccinated as of April 19, reported by Our World in Data. Of those people vaccinated, 65 percent are White versus 11 percent of those vaccinated are Hispanic/Latino, 6 percent Black, 1 percent Asian. Although over a quarter of the country is vaccinated, there is reason to question if vaccines are going to the communities most affected by the COVID-19 pandemic.\n\n“In the first 2.5 months of the program, vaccination coverage was lower in high vulnerability counties nationwide, demonstrating that additional efforts are needed to achieve equity in vaccination coverage for those who have been most affected by COVID-19,” said the CDC on their website.\n\nEquity towards access to COVID vaccines is important to TCNJ, confirms Janice Vermeychuk, The College of New Jersey’s Director of Student Health. “We are trying to bring a mobile COVID vaccine provider to TCNJ to minimize barriers and increase vaccination rates,” said Vermeychuk.\n\n“Bringing a mobile vaccination facility to campus was a tremendous undertaking because of the infrastructure and quick planning needed to support that event,” said Vermeychuk. As of April 21, 2021 Mercer County has partially vaccinated 54 percent of its adult population. Like TCNJ, Mercer County has partnered with Penn Medicine Princeton Health and their mobile vaccination system to assist with accessibility to the vaccination. This process creates a solution in access as mobile vaccination sites will be used to reach the elderly and those without vehicles.\n\nSince the start of the 2020 fall semester, the state school has had multiple off-campus outbreaks inciting the importance to inoculate the campus, surrounding communities and at-risk communities.\n\n“DEPENDING ON INTEREST AND MOBILE VACCINATION AVAILABILITY, WE WOULD LIKE TO OPEN FUTURE VACCINATION EVENTS PROVIDED BY HEALTHCARE PARTNERS TO EMPLOYEE’S FAMILIES AND THE COMMUNITY,” SAID THE DIRECTOR OF STUDENT HEALTH.\n\nThe first COVID-19 vaccination event was held April 16. Penn Medicine Princeton Health provided 264 Moderna vaccines to campus for interested college employees. The second event will be held Monday, April 26th for students and friends and family of students in the Brower Student Center, Room 225.\n\nAlthough solutions to vaccinations on-campus are underway, the college has not stated a COVID-19 vaccination mandate for the 2021 fall semester, while other state universities like Rutgers have. The college’s response to COVID-19 has been proactive to tackle inevitable positive cases on and off campus with testing, hybrid classes, and limited housing, all while following CDC guidelines. The college has also held an attitude of letting people do as they feel is appropriate during the pandemic, while instituting state guidelines and signing in solidarity the Roscoe Pledge.\n\nAt the beginning of the 2020 fall semester, TCNJ’s newspaper, The Signal confirmed numerous off-campus parties hosted by Greek societies as cases rose throughout Ewing. “On Sept. 5, students were running up and down the street to a house party. Meanwhile, 53 off-campus cases were spreading through Ewing,” The Signal reported on Feb. 3.\n\nAmong the 7,404 students at TCNJ, 66% of students are White, 11.7% are Asian, 13.2% are Hispanic/Latino and 5.9% are Black, as reported by College Factual. This demographical data may better represent New Jersey but is ultimately less diverse than neighboring parts Trenton. The average median income of families at TCNJ who’ve had children in 1991 stands at $133,000, as reported by The New York Times. Out of all 53 colleges in New Jersey, this is the second highest income, with the first being Princeton. Therefore, this contrasts Trenton’s median income with a median household income of $35,000.\n\nThe data above expresses a microcosm of even vaster wealth and higher education inequities that keep Black, Brown, and low-income neighborhoods at-risk to COVID-19. Off-campus parties at TCNJ are an example of the privileges of White and wealthier populations with access to higher education.\n\nOff-campus parties can be reported, but the specifics must be there in order to hold potential students accountable. “Our locus of control is somewhat limited when you are talking about an off-campus person,” said Sean Stallings, Vice President of Student Affairs. “Many of the reports that we get might be vague in detail, thereby limiting our ability to hold people accountable.”\n\n“The rules for everybody is that we need to engage in safe behavior,” said Stallings. However, when students break rules, there are consequences. Stallings firmly ensured that consequences are equal to all students who engage in unsafe behavior during the pandemic, including those off-campus, on-campus, athletes, or Greek life.\n\nWhile TCNJ off-campus parties and positive cases were being investigated, the capital city was hit particularly hard in Nov. 2020, as reported by Whhy.org. Since then, it has been reported by NJ.com that Mercer County has donated 1,600 COVID-19 vaccine doses and a mobile unit to deliver vaccinations to the people of Trenton. Mobile vaccines arise as the state of NJ increases in positive COVID-19 cases.\n\nOn-campus students are met with similar consequences to off-campus students. The only difference, Stallings clarifies, is that on-campus students are easier to identify. When students are positive for COVID-19, they are kept in isolation rooms in order to continue classes, recover, and to be separated from other TCNJ campus community members. If students who test positive break isolation rules, housing would be notified and students could be removed from housing. As for athletes, teams can be shut down and athletes can be kept from competing.\n\nHowever, although consequences are the same, off-campus students can more easily fly under the radar in breaking COVID safety rules and regulations, especially in “brotherhoods” like fraternities. Fraternities hold a historic, exclusionary culture draped in racism, misogyny and partying while protecting each other regardless of consequence, as discussed in multitudes of texts such as “Race and Racism in Fraternity and Sorority Life: A Historical Overview” by Kathleen E. Gillon. Fraternity culture tends to protect “brotherhood” over surrounding communities at large and therefore, lacks awareness in accountability for the sake of “brotherhood.” A solution in combating this culture is first by acknowledging fraternity culture in the first place. TCNJ administrators can also identify fraternity houses and off-campus housing, so if rules are broken, TCNJ students can be identifiable.\n\nPresident Foster is quoted in The Signal saying it’s important for students to discuss COVID-19 in a way where students better understand how they are putting themselves and others at risk. A suggestion of holding the self and others accountable. At this point, mobile vaccinations may be the solution to the unfairness in repercussion for off-campus rule breakers versus on-campus rule breakers. Once herd immunity takes place, off-campus parties may be less of a risk; these discussions no less ideal.\n\nIn response to the imminent threat of COVID-19, the campus has been and continues to provide testing sites, PPE, and expects students to follow social distancing, mask wearing, and mandatory training in returning to campus to maintain New Jersey restrictions. The administration at TCNJ has expected COVID-19 to come to campus, and now the campus has provided vaccinations to their community and neighbors.\n\nBoth Ewing Police and TCNJ fraternity members were contacted in the process of writing this article, but neither responded for comment.\n\n“THERE ARE MANY PERKS TO BEING VACCINATED: PERHAPS SCREENING OF HEALTHY FULLY VACCINATED STUDENTS AND EMPLOYEES WITH COVID TESTING CAN BE REDUCED OR ELIMINATED, MORE SOCIALIZATION,” SAID VERMEYCHUK.\n\nHowever, Vermeychuk says that the challenge doesn’t come with the first dose, but the second. “Moderna doses must be separated by 4 weeks (Pfizer by 3 weeks). We also cannot select which vaccine we want. We are told what they have and how many doses – you can take or leave it,” said Vermeychuk.\n\nThe campus has decided to take the chance in order to vaccinate not only TCNJ, but anyone that needs and wants to be vaccinated from the novel coronavirus. The overall understanding that there is inequity in vaccinations is what has successfully brought the first vaccination event to campus and extended community members to TCNJ. As of May 2, there have been 3 confirmed off-campus cases compared to that of 7 on-campus cases reported within the last 14 days.\n\nIt is hard to say whether life can ever return to how it once was after the worldwide spread of COVID-19. With expanding eligibility to receive the vaccine in New Jersey, in an ideal scenario, this will mean the disruption for communities and families from the virus will soon be reversed.\n\nThe distribution of the vaccine will be the first step to rebuild from damage already done and recover from the continuous impact of the pandemic. Whether people choose to receive their dose and accessibility to the vaccine improves, the education experience and beyond will adapt to the new normal that the pandemic has imposed.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccination Accessibility & The College of New Jersey - Thrive Global", "description": "Four virtual journalism students from The College of New Jersey (TCNJ) write a four chapter article on how COVID-19 has affected the state, their county and their college campus - never having met and only communicating through technology.", "url": "https://community.thriveglobal.com/tcnj-students-write-about-covid-19-vaccination-accessibility-on-campus-and-beyond/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-05-03T13:43:13+00:00", "article:modified_time": "2021-05-05T21:02:04+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/05/hakan-nural-niBllet7sTw-unsplash.jpg?w=744"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.washingtonpost.com/politics/2021/04/12/health-202-here-how-us-compares-other-countries-coronavirus-pandemic/", "https://www.nj.gov/health/cd/topics/covid2019_dashboard.shtml", "https://www.statnews.com/2020/04/30/coronavirus-death-projections-compare-causes-of-death/", "https://www.google.com/url?q=https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-publication-results-landmark&sa=D&source=editors&ust=1619448574304000&usg=AOvVaw1HnduxpQZtJ8elb2lTFN4u", "https://www.google.com/url?q=https://www.state.nj.us/health/cd/documents/topics/NCOV/VaccinePhasesFactSheet.pdf&sa=D&source=editors&ust=1619448586343000&usg=AOvVaw0M456u9cwv-BJyAtJTO_lZ", "https://twitter.com/VirtuaHealth", "https://www.inquirer.com/health/coronavirus/nj-new-jersey-covid-vaccine-am-i-eligible-coronavirus-shot-1b-20210114.html", "https://nj.gov/governor/news/news/562021/approved/20210113a.shtml", "https://www.newsobserver.com/news/coronavirus/article249688503.html", "https://www.nj.com/coronavirus/2021/02/nj-vaccine-site-changes-sign-up-system-to-stop-people-from-cutting-in-line.html", "https://www.nytimes.com/interactive/2021/us/new-jersey-covid-cases.html", "https://www.northjersey.com/story/news/coronavirus/2021/03/19/nj-highest-per-capita-rate-new-covid-cases-vaccine/4705027001/", "https://www.nj.com/coronavirus/2021/03/nj-reports-3738-covid-cases-27-deaths-1-in-6-adults-now-fully-vaccinated.html", "https://spring2021.tcnj.edu/dashboard/", "https://www.cnn.com/2021/01/15/us/smokers-eligible-covid-19-vaccine-trnd/index.html", "https://www.nj.com/politics/2021/03/the-unraveling-of-nj.html", "https://data.cms.gov/Special-Programs-Initiatives-COVID-19-Nursing-Home/Resident-Average-Deaths-per-1-000-Residents/ps29-t4uv", "https://www.state.nj.us/health/healthfacilities/documents/LTC_Facilities_Outbreaks_List.pdf", "https://www.nj.com/coronavirus/2020/12/murphy-explains-why-nj-missed-deadline-to-begin-nursing-home-covid-19-vaccines.html", "https://www.nationalgeographic.com/culture/article/what-world-can-learn-from-west-virginia-successful-vaccine-roll-out", "https://www.boston.com/news/coronavirus/2021/04/01/massachusetts-vaccine-timeline-charlie-baker-april-19", "https://www.flgov.com/2021/01/20/florida-leads-the-nation-in-vaccines-for-ages-65-with-seniors-first-approach/#:~:text=Since%20the%20beginning%20of%20the,more%20than%20one%20million%20people.", "https://www.northjersey.com/story/news/2020/12/18/covid-ravaged-nj-prisons-what-know-vaccine-plan/3895096001/", "https://www.themarshallproject.org/2020/05/01/a-state-by-state-look-at-coronavirus-in-prisons", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated-guidance.html", "https://ourworldindata.org/covid-vaccinations", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7012e1.htm", "https://spring2021.tcnj.edu/health-and-wellness/roscoes-pledge/", "https://tcnjsignal.net/2021/02/03/an-interview-with-president-foster-off-campus-partying-student-expectations/", "https://www.collegefactual.com/colleges/the-college-of-new-jersey/student-life/diversity/#chart-ethnic-diversity", "https://www.collegefactual.com/colleges/the-college-of-new-jersey/student-life/diversity/#chart-ethnic-diversity", "https://www.nytimes.com/interactive/projects/college-mobility/the-college-of-new-jersey", "https://whyy.org/articles/trenton-to-implement-stricter-covid-19-restrictions-monday/", "https://www.nj.com/coronavirus/2021/04/these-nj-residents-couldnt-get-to-clinics-so-city-is-bringing-covid-vaccines-to-them.html", "https://onlinelibrary.wiley.com/doi/full/10.1002/ss.20289", "https://tcnjsignal.net/2021/02/03/an-interview-with-president-foster-off-campus-partying-student-expectations/", "https://covid19.nj.gov/faqs/nj-information/slowing-the-spread/who-is-eligible-for-a-covid-19-vaccine-in-new-jersey#:~:text=All%20individuals%20aged%2016%20and,of%20immigration%20or%20insurance%20status."], "authors": ["Lana Leonard"], "publish_date": "2021-05-03T13:43:13+00:00"}