{"result_id": "315034", "URL": "https://community.thriveglobal.com/declining-trust-in-science-is-hurting-doctors-it-could-hurt-the-coronavirus-vaccine-too/", "timestamp": "2023-04-25 17:41:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/declining-trust-in-science-is-hurting-doctors-it-could-hurt-the-coronavirus-vaccine-too/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Declining trust in science is hurting doctors. It could hurt the coronavirus vaccine, too.", "cleaned_text": "Every relationship is about trust, especially when you’re a physician. My patients come to me because they trust that I’m a point of access to good care, an interpreter of complex medical science, and a myth buster. Setting the record straight is a big part of the physician’s job, whether it’s telling patients they can, in fact, take steps to prevent diabetes or quashing falsehoods like, “Young people can’t develop arthritis.”\n\nThe coronavirus is no different. We know that wearing a mask, washing your hands, and social distancing work. But just one inaccurate tweet can cast doubt on the facts. Politics have seldom interfered with the care I deliver to my patients or the expectations that patients bring to my office — until now. I’ve never before had to field questions — even arguments — about the bearing of face masks on my political affiliation.\n\nNot long ago, one patient claimed that I recommended he wear a mask only to spite his political party. I was concerned because the patient’s health history suggested he was at high risk of dying from COVID-19. These conversations are borne out of deeply entrenched ideas about the state of our nation, which have begun to directly combat science and medicine. What we’re seeing today is a threat more severe than any pandemic: the erosion of trust in medical science and a lethal displacement of health-centered values. Of the medical community’s many priorities in the push against disinformation and partisanship, the national response to a successful vaccine candidate is paramount. If we cannot find a way back to consensus on the scientific process, not only will a coronavirus vaccine be effectively useless, but the legitimacy of our governing institutions will be irreparably damaged.\n\nOne of my most important responsibilities as a doctor is to educate my patients. I also swore an oath to do no harm, which means the way I teach my patients about their health must be transparent and factual. Any physician will tell you the same thing. What we have seen in our government this year is categorically unacceptable: elected officials with no medical background have discounted medical expertise and gutted national trust in the scientific community. This directly interferes with my job, but it also sets us up for a dangerous situation once a vaccine is available.\n\nThe function of the CDC and HHS has been so diluted that large swaths of Americans have given up on them completely. Our faith in the CDC, for example, has dropped 16 percentage points since the spring. We’re also wary of the FDA and whether it will properly vet promising vaccines.\n\nWe’ve descended to the point where using face masks — arguably the simplest and most effective intervention available — has become a political statement, and many Americans have been misled to believe that a vaccine is a silver bullet. That conclusion is a product of the politicization of science and feeds a long-standing Americanism of taking the proverbial pill for whatever isn’t working quite right. At this point in the game — more than 200 days in and 200,000 lives down — we cannot afford the silver bullet strategy.\n\nLet’s say, theoretically, that the FDA approves a vaccine. What does that mean? Essentially, that vaccine candidate will have cleared four rounds of clinical testing in at least a couple hundred people to assess drug combinations, side effects, and efficacy. Typically, a vaccine takes upwards of 15 years to develop. End-stage trials for coronavirus began in July, only months after the pandemic was declared.\n\nIn one way, the speed of the development is a testament to the power of the scientific community and what’s possible when we unite for a common cause. In another way, a vaccine developed at about 45 times the normal speed begs many questions about safety and efficacy. Public health leaders like Dr. Anthony Fauci have guaranteed that a vaccine candidate will need to be safe and at least 50 percent effective in order to be widely distributed, but 75 percent or higher is ideal. Still, many hurdles remain on the distribution side. Given the often inaccurate portrayal of this pandemic by leading government officials, how can we expect Americans to respond meaningfully to a vaccine? Even if Americans are willing to take the vaccine, will we be able to supply it on a timeline that protects all of us?\n\nWe have poor leadership to blame for vaccine hesitancy in this country. Doctors like me work grueling hours and build entire careers on the principle of health education undergirded by trust. Our national leaders have not only contaminated those efforts but distorted scientific truths to serve political interests. It stops here. Never again can we afford to misplace our trust in people who aren’t qualified to lead us through a fight for our lives.\n\nWith proper leadership at the helm, we can envision a vaccine distribution system that has not only vetted an approved vaccine but prioritizes the most vulnerable Americans — our frontline workers and our elderly — in its distribution. It might be difficult to imagine now, but an effective administration has the power to immunize the majority of the country on a short timescale at no cost to the public. While we hold tight to that standard of governing, we must also fight hard to regain trust in our scientific institutions and encourage our neighbors to seek out vaccination. In tandem with qualified public health leaders, we must empower each other — especially mothers and people of color — with accurate and transparent science to ensure that once a vaccine is available, we don’t hesitate to protect ourselves and our nation.\n\nEven as government leaders and health institutions bleed out trust, there’s still one person you can rely on for the facts, now and long after the pandemic: your physician. Their recommendations might differ from what you read on your Twitter feed, but at least you know their advice is in your best interest.\n\nDr. Geeta Nayyar, M.D., M.B.A., is a nationally recognized leader in healthcare information technology, a physician executive, a public speaker, and an author. Dr. Nayyar specializes in rheumatology and attended the University of Miami Medical School, where she maintains faculty affiliation.\n\nAvery Ofoje is a 2020 graduate of Boston University and a prospective medical student. She is a native of Aiken, SC.", "opengraph": {"locale": "en_US", "type": "article", "title": "Declining trust in science is hurting doctors. It could hurt the coronavirus vaccine, too. - Thrive Global", "description": "Why we must fight to regain trust in our scientific institutions", "url": "https://community.thriveglobal.com/declining-trust-in-science-is-hurting-doctors-it-could-hurt-the-coronavirus-vaccine-too/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-10-15T15:56:05+00:00", "article:modified_time": "2020-10-15T16:01:56+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2020/10/iStock-1270585063.jpg", "image:width": "724", "image:height": "483", "image:type": "image/jpeg"}, "tags": ["Trust", "Coronavirus", "healthcare", "Community", "COVID-19"], "tweets": [], "movies": [], "links": ["https://www.statnews.com/2020/09/10/trust-cdc-fauci-evaporating/", "https://www.nccn.org/patients/resources/clinical_trials/phases.aspx", "https://www.cnbc.com/2020/08/07/coronavirus-vaccine-dr-fauci-says-chances-of-it-being-highly-effective-is-not-great.html"], "authors": ["Doctor G, Avery Ofoje"], "publish_date": "2020-10-15T15:56:05+00:00"}