{"result_id": "315029", "URL": "https://community.thriveglobal.com/who-is-asking-for-consideration/", "timestamp": "2023-04-25 17:41:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/who-is-asking-for-consideration/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "WHO Is Asking for Consideration", "cleaned_text": "The World Health Organization (WHO) is asking countries that have enough vaccinations for a booster (third) shot to wait with it so that poor countries where people haven’t received the first shot may get it. No one is taking its request seriously, but the WHO is still asking for consideration.\n\nIf we want to change the way things work, we have to change how we work. The pandemic treats us equally; it infects everyone indiscriminately. Therefore, if we want to overcome it, we must also treat each other equally, since if you leave one spot unattended, that spot will become the source of new infections.\n\nI don’t understand this request. All over the world, the approach is that each country fends for itself, so who does the WHO expect to comply with such a request? It is sad that not everyone has received the vaccine yet, but this is not a matter for one country to decide, but a matter for international organizations like the WHO itself to initiate and carry out. If a country’s own Ministry of Health cannot tend to that country’s people, international organizations should step in and help. This is why so many such organizations exist, which are funded by wealthy countries precisely in order to help less fortunate ones.\n\nIn addition, I think that the problem isn’t in the number of shots, but in the organization and distribution. There are plenty of shots to go around. The problem is that in the world we have built, each one fends for himself or herself; no one feels accountable, and there is no mutual responsibility, certainly not among countries. Everything is determined by money and corruption.\n\nIf we want to change the way things work, we have to change how we work. The pandemic treats us equally; it infects everyone indiscriminately. Therefore, if we want to overcome it, we must also treat each other equally, since if you leave one spot unattended, that spot will become the source of new infections.\n\nOnce we organize ourselves truly as one family, perhaps through a new organization, unrelated to the old and decadent ones, we should consult with everyone, get the full data from everywhere, and decide what, and how much goes where. If we think of humanity as one family, we will decide what is best for the entire family and will draw the right conclusions. But in order to do that, we must first see each other as a family, and then we will be able to make the right decisions taking everyone into consideration.", "opengraph": {"locale": "en_US", "type": "article", "title": "WHO Is Asking for Consideration - Thrive Global", "description": "If we think of humanity as one family, we will decide what is best for the entire family and will draw the right conclusions.", "url": "https://community.thriveglobal.com/who-is-asking-for-consideration/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-08-10T01:54:55+00:00", "article:modified_time": "2021-08-10T01:55:27+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/08/who-boss.jpg", "image:width": "1300", "image:height": "866", "image:type": "image/jpeg"}, "tags": ["vaccine", "COVID-19", "equality", "Health", "WHO"], "tweets": [], "movies": [], "links": [], "authors": ["michael-laitman"], "publish_date": "2021-08-10T01:54:55+00:00"}