{"result_id": "315011", "URL": "https://community.thriveglobal.com/7-questions-to-build-covid-19-resilience/", "timestamp": "2023-04-25 17:40:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/7-questions-to-build-covid-19-resilience/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "7 Questions to Build COVID-19 Resilience", "cleaned_text": "The Covid-19 pandemic so far has been such a polarizing time:\n• Ones are exhausted from working around the clock; Others do not know what to do with their free time\n• Ones are advocating – loudly speaking up for change; Others are in denial, trying to continue their normal life\n• Ones are spending quality time at home with family; Others are suffering with isolation and loneliness\n• Ones are taking this as an opportunity to grow; Others focus on what is missing\n• Ones are relaxing – taking a break off work; Others are concerned about their financial stability\n\nThe reality is that we have all these extremes living in each of us at different times. It is overwhelming.\n\n\n\n#flattenthecurve is meant to help protect the health care system, so it does not get overwhelmed. It is in fact also a call to action to our society. \n\n\n\nThere are no “ones”, and “others”. There is no “them”. It is about us and how we can unite. How we can flatten the distance between our beliefs to recognize and take responsibility that our individual actions have consequences… so we don’t get overwhelmed, as a society. So that a doctor at the hospital down the street is not put in a situation where they have to triage – to decide which person they will have to prioritize giving care to first as they cannot take everyone in. \n\n\n\nSome of the models that project how this situation could evolve estimate the COVID-19 pandemic may continue for potentially up to 18 months, with different degrees of measures – until a treatment or vaccine is available at large enough quantities (Imperial College COVID-19 Response Team). While we all are still trying to make sense of all the news, the information overflow, and what to do – To help manage the uncertainty, I urge you to think about how you want to spend your day. \n\n\n\nIn cases of crisis the non-essential tends to be stripped away. It is a time to connect to our core values, and align our actions. Look around:\n• How can you help your family, neighbor, coworker, community?\n• What help do you need? Who can you ask for it?\n• How can you share your vulnerability?\n• What are you grateful for?\n• Who are the people you care about – do you tell them that?\n• What motivates you? Or brings you joy?\n• Mental health is part of health – are you taking care of yourself?\n\nWe are told to practice social isolation, but connection is what we need more than ever. Because every single life is equal.", "opengraph": {"locale": "en_US", "type": "article", "title": "7 Questions to Build COVID-19 Resilience - Thrive Global", "description": "A growth mindset amidst uncertain times and a pandemic", "url": "https://community.thriveglobal.com/7-questions-to-build-covid-19-resilience/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-03-20T12:14:41+00:00", "article:modified_time": "2020-03-20T17:42:04+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/11/Thrive-Global-Meta-Image.png", "image:width": "1200", "image:height": "627", "image:type": "image/png"}, "tags": ["covid-19 Habits", "COVID19 anxiety", "covid19 mental health", "COVID-19"], "tweets": [], "movies": [], "links": ["https://www.imperial.ac.uk/media/imperial-college/medicine/sph/ide/gida-fellowships/Imperial-College-COVID19-NPI-modelling-16-03-2020.pdf"], "authors": ["Diliana Funtarova"], "publish_date": "2020-03-20T12:14:41+00:00"}