{"result_id": "315006", "URL": "https://community.thriveglobal.com/lab-to-jab/", "timestamp": "2023-04-25 17:40:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/lab-to-jab/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Lab to Jab", "cleaned_text": "How the pandemic has opened up investment opportunities in the pharma and biotech sector\n\nThe biopharmaceutical industry presents a tremendous opportunity for investors who understand the importance of this sector and want to benefit from the projected growth in this sector. The pharma and biotech sector is a high-growth, ferociously competitive industry with diverse R&D pipelines. For example, there was a 179% increase in the number of drugs in the pharmaceutical R&D pipeline between 2001 and 2019. Of this overall pharmaceutical industry pipeline of drugs, 81% belonged to biotech.\n\nThe biopharmaceutical industry is comprised of companies that research, manufacture, and commercialize medicines designed to treat, prevent, and/or cure various medical conditions. The industry can be segmented by market capitalization (market cap) into large-cap publicly traded pharmaceutical companies and smaller (< $1 billion market cap) biotech companies that typically tend to be financed by venture capital and private equity funds. So, what is the difference between pharmaceutical and biotechnology (biotech) companies?\n\nBiotechnology refers to technology that incorporates biological organisms. For example, companies that make genetically modified foods fall into this category, as do drug manufacturers that develop biologic drugs. Biologics are large, complex molecules that are manufactured within a living organism. Nowadays many large pharmaceutical companies also develop biologic drugs. They are sometimes classified as “biotechs” when in reality they don’t make most of their revenue from biologic drugs. There is a tendency for investors to call any small drug manufacturer a “biotech” regardless of whether the drugs it develops uses living organisms or not. Sometimes when these small companies become large, they’re still referred to as biotechs.\n\nAnother way to categorize companies in the biopharmaceutical space is by therapeutic area i.e. pharmaceuticals vs. biologics. Pharmaceutical drugs are usually made up of plant-based and synthetic chemicals fused in various dosage forms like tablets, capsules, liquids, gels, ointments, creams, injectables, and patches. Given the small size of such dosage forms, manufacturing hundreds of thousands of pharmaceutical tablets and pills is relatively straightforward on an industrial scale. But the simplicity of manufacturing these small-molecule drugs also means that they can be easy targets for competition; especially if they have the potential to become blockbuster drugs.\n\nBiologics, on the other hand, are complex, protein-based molecules made from living cells. With a more complex structure comes a more extensive manufacturing and approvals process. Products like the COVID 19 vaccines, medications for blood disorders such as hemophilia, and gene therapies are all considered biologics. Biologic treatments tend to be much more expensive than chemically-derived drugs and, in some cases, may require restricted distribution by specialty pharmacies. Biosimilars are products considered close but not identical copies of branded biologics. The higher costs and complexity associated with biologic manufacturing keep the barriers to entry very high. Additionally, to have its drug considered a biosimilar, a competitor must demonstrate through research that there is no clinically significant difference between the branded and biosimilar drugs even though their chemical structures will not be identical.\n\nSo, whether you’re looking for long-term growth or simply a recession-proof strategy for your portfolio, investing in the pharmaceutical industry could be one of the best places to park your cash in both good times and in bad provided you pick your stocks very carefully.\n\nHere are several other industry tailwinds poised to propel growth in the pharmaceutical industry in the long term:\n• Increased government funding for healthcare research. The amount of funding that has been poured into research for the COVID19 vaccine is unprecedented.\n• Longer lifespans for patients with chronic diseases, meaning ongoing treatment for longer periods\n• International growth opportunities, particularly in emerging markets like India, China, and Latin America.\n• Innovative (and expensive) approaches, such as gene therapy, to diagnose, prevent, and treat diseases.\n\nDisruptive Trends in the Pharmaceutical and Healthcare industry.\n\nInnovation and technological advancement are changing the face of healthcare as we know it. What was once an industry with a modus operandi of “treating the sick” is now an industry that is increasingly focused on preventing illness through early and accurate diagnoses and the provision of holistic patient care?\n\nPersonalized medicine\n\nAlso called precision medicine, involves tailoring medical decisions, practices, interventions, and/or products to an individual patient based on their genetic makeup. Doctors know that patients who take the same medication for seizures, heart disease, or cancer might respond very differently. One person might have severe, even life-threatening side effects, whereas another might experience few, if any, side effects or an anticancer drug may shrink a tumor in one person but not in another. Over the years, entire specializations facilitated by the human genome project have matured within the pharmaceutical industry called pharmacogenetics and pharmacogenomics which deal with the genetic basis underlying variable drug responses in individual patients\n\nGene Editing\n\nAnother revolution in healthcare is referred to as gene editing. Gene editing involves the insertion, deletion, or replacement of DNA within a gene. Scientists pioneering gene editing don’t simply want to treat a disease after diagnosis. Rather, they hope gene editing can target the underlying genetic cause of the disease, even before diagnosis. CRISPR, short for “clustered regularly interspaced short palindromic repeats,” is a gene-editing tool that has the potential to cure diseases such as blindness, sickle-cell disease, and even cancer. The COVID-19 pandemic has brought to the forefront CRISPR as a mechanism to develop therapies for the discovery of vaccines. Biotechs are also using gene-editing approaches called CAR-T to modify the body’s immune cells to fight cancer.\n\nArtificial Intelligence (AI)\n\nAdvances in technology are also set to dramatically change the healthcare landscape. Harnessing the power of artificial intelligence could help scientists and physicians better analyze and understand prevention and treatment techniques, leading to better patient outcomes. Artificial Intelligence (AI) could even one day expedite the clinical trial process by determining which patient subgroups could be more likely to respond to therapy. This could lead to billions of dollars in saved R&D costs, and more importantly, earlier access to potentially life-saving treatments.\n\nAging Demographics\n\nAs was already mentioned above, global populations getting older is the single most important demographic trend propelling the demand for healthcare services in the United States and Canada. Populations of other countries are aging, too, including many nations in Europe and Asia. While aging demographics will drive demand and boost revenues for pharmaceutical companies, it will also likely spur renewed efforts to put downward pressure on rising healthcare costs. Pricing pressure benefits companies that offer products and services that help contain or reduce overall healthcare costs, but changes in drug pricing policies could negatively impact profit margins for companies with high-priced healthcare products and services such as pharmaceutical manufacturers.\n\nAdvanced Medical Device Technology\n\nTremendous progress continues to be made in developing medical devices using advanced technology. Some of these devices are used by healthcare professionals to treat patients, while other devices are worn by patients (like Continuous Glucose Monitors or CGM’s) or operate inside patients (like artificial heart pumps and artificial heart valves). One example of advanced medical device technology used by healthcare professionals to treat patients is a robotic surgical system. This system enables surgeons to control surgical instruments mounted on a robotic arm with precision.\n\nLiquid Biopsy\n\nSome diseases could be treated more effectively if they could be detected much earlier. Liquid biopsy is an especially promising approach for the early detection of diseases, particularly for certain types of cancer. Liquid biopsies work by obtaining blood samples to find biomarkers. These are substances in the blood or tissue that point to the presence of cancer. Although the use of liquid biopsy isn’t widespread yet, significant progress could be made over the next few years in improving the approach to detect more types of cancer and other diseases in very early stages.\n\nNow that we have looked at the biopharmaceutical and healthcare industry including some of the drivers of revenue growth and some of the key disruptive trends impacting this sector should you invest in this sector and if so, how can you ensure you do not lose your proverbial shirt.\n\nInvesting in the biopharmaceutical sector is not for the faint of heart and many investors have lost tremendous amounts of money either because they deployed the wrong or no strategy when investing in this space. The key here is understanding the basics of investing first before you wade into the stock market, then defining your Circle of Competence to see if biopharmaceutical and healthcare investing is, indeed, right for you and finally to decide on your overarching investment philosophy. Circle of Competence means asking identifying the boundaries of your knowledge and if pharma and biotech are new to you then spend some time learning about this industry before investing your first dollar. In addition to knowledge and experience, you will also need to follow an investment philosophy.\n\nAn investment philosophy is simply a set of beliefs and principles that guide an investor’s decision-making process. You can also refer to it as the roadmap that will guide you every step of the way during your journey as an investor. There are many different types of investment philosophies including but not limited to Value Investing, Fundamentals Investing, Growth Investing, Socially responsible investing, Technical investing, and Momentum Investing. While all these investment philosophies have their merits and ardent proponents, the safest option is Value Investing which was first explained by Professor Benjamin Graham after the Great Depression of 1929 and adopted and popularized by his student and disciple, Warren Buffett.\n\nFrom a metaphorical perspective, value investors are more like farmers. They plant seeds and wait for the crops to grow. If the corn is a little late in starting this season because of cold weather, they don’t simply tear up the entire field and plant something else. Instead, they sit back and wait patiently for the corn to pop out of the ground, confident that it will eventually sprout.\n\nWhile many people are content with investing in anything that offers average returns (e.g. index funds/ ETF’s), others tend to focus on investing in stocks to stay a step ahead and beat the market also referred to as seeking “alpha”. If you are a stock investor, you will need to think critically so that they can beat the market. You will need to be adaptive and intuitive instead of simply trying to follow a formulaic and mechanized process of investing. An investor who tries to simply emulate role models like Warren Buffett and Joel Greenblatt and mimic their rules (coat-tail investing), will eventually notice that it is impossible to perfectly replicate and gain the same results each time.\n\nThe COVID-19 Pandemic has cast a bright spotlight on what was once a prosaic industry. Within one year, the biopharmaceutical industry produced vaccines based on innovative mRNA technologies within an unprecedented timeframe from the laboratory to the patient’s arm in less than a year. mRNA technology and gene editing hold promise for serving as a platform for several other therapeutic areas like cancer and multiple sclerosis and the next decade will result in several new therapies for unmet medical needs based on this platform. The Pandemic has disrupted the drug development field and while the “warp speed” with which the COVID-19 vaccines were developed cannot be easily replicated, it seems prudent to conclude that investors will be pouring in money into the biopharmaceutical sector over the next decade and will demand leaner and more efficient development pathways. This in turn should result in higher revenues and earnings and valuations for pharma and biotech stocks for the perspicacious value investor.\n\nJagani, A. 2020 – The Profit Pill – How to make money in the pharmaceutical industry. Toronto: Alpha Gainvest Publications.\n\nAbout the Author\n\nAmin Jagani is a seasoned veteran of the pharmaceutical industry whose depth and breadth of expertise encompasses more than two decades of pharmaceutical drug development experience.\n\nAs an entrepreneur, Amin has successfully founded and exited two ventures in the medical and biopharmaceutical space. As an experienced value investor, Amin has coached and mentored novice investors on investing successfully in healthcare and biopharmaceutical stocks. He has worked as an editor on several publications and has also served as an Advisor, Board Member, and Director on several non-profit boards. \n\nAmin received his B.Sc. (Hons) degree in Cell & Molecular Biology and his professional degree in pharmacy (B.Pharm) from the University of Toronto. He also received his graduate-level Master of Business Administration degree (M.B.A.) in Corporate Finance and Entrepreneurship from Queen’s University in Canada. Amin holds several professional designations including Canadian licensure in pharmacy practice, certifications in Sterile and Non-sterile pharmaceutical compounding, and certificates in Value Investing, counseling, and coaching.", "opengraph": {"locale": "en_US", "type": "article", "title": "Lab to Jab - Thrive Global", "description": "COVID19 Vaccine Development and implications for pharma & biotech investing", "url": "https://community.thriveglobal.com/lab-to-jab/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-02-28T23:40:24+00:00", "article:modified_time": "2021-03-01T14:00:46+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/02/Amin-Fall-2020b.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["AMIN JAGANI"], "publish_date": "2021-02-28T23:40:24+00:00"}