{"result_id": "315039", "URL": "https://community.thriveglobal.com/covid-19-and-vaccine-hesitancy/", "timestamp": "2023-04-25 17:41:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/covid-19-and-vaccine-hesitancy/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "COVID-19 and Vaccine Hesitancy", "cleaned_text": "For the last seven years I have struggled with my position on vaccinations for children. My professional life has been dedicated to the betterment of society through the humanitarian and social service sectors. I’ve been surrounded by public health professionals whose belief in the virtue of vaccinations and immunization is unwavering. If I were to publicly voice my questioning of vaccinations, I take professional risk.\n\nConversely, I live in the epicenter of the Medical Freedom movement, led by those who question or do not believe in vaccination. So powerful are the sentiments of this movement in my area that by speaking my opinion, I’m a minority among peers. I don’t come to the decision to share my process lightly for this has been a long and difficult journey for me too.\n\nSince the birth of my first child in 2013, I found myself pouring over NIH studies on vaccine safety, visiting the Vaccine Adverse Event Reporting System (VAERS) database and downloading the full list of vaccine injury claims to review and consider their validity, reading Dr. Sears vaccine book, and an endless stream of articles on the topic from all sides.\n\nIn all my considerations, I found that there was research and valid arguments to be made by both sides.\n• Big pharma’s influence on the CDC and public health policy is incredibly worrying, particularly in light of it’s track record in pedaling poor or even harmful products to society in the name of profit like opioids. The revolving door between corporate interest and government agencies meant to regulate them is real, pervasive, and deeply troubling.\n• Inexplicable rates of autism and auto-immune disorder really are rising in our youth population, although I take issue with pinning that onto vaccines when we live in such a toxic, overstimulated environment to begin with.\n• The 1986 National Childhood Vaccine Injury Act, upheld by the Supreme Court, which provides protections for pharmaceutical companies developing vaccines against potential liability. This is disturbing at best.\n• The rise in the sheer volume of vaccines recommended by the CDC without any scientifically sound, double-blind study of the safety of the full regimen on children is irresponsible in my view (Science Direct). I know plenty of Medical Freedom advocates who would gladly sign up to have their children involved in a proper safety study, so I don’t find the CDC’s claim that such a study would be unethical to be valid (CDC Statement).\n• Toxic additives to improve vaccine effectiveness and shelf-life, a fact that has two very divergent opinions (CDC case) (Kennedy case)\n• All major medical institutions and organizations promote vaccinations as safe and effective (AMA Statement : AAFP statement) as do healthcare professionals. While there is a minority group of doctors with more relaxed philosophies or, in rare instances, anti-vaccinebeliefs, the majority of trained doctors, nurses, epidemiologists, and public health professionals believe them to be safe and effective and can point to a wealth of research to back their belief up (Here’s one published collection of research and study of safety systems in place).\n• Measles, Smallpox, and Polio eradication success stories. While disputed by anti-vaccine advocates with their own narrative, I have spent far too much time on the public health end of these stories to take the alternative narratives to heart. I believe in the community of humanitarians who I work with, the helpers who are on the ground, over the theories of those who are building their position on observation or alternative interpretations of data.\n• Public health is important and needs to weigh heavily in our decisions about our family’s personal health. If there is no reason to expect adverse reactions to vaccines, we should vaccinate in order to keep herd immunity for the sake of those most vulnerable.\n\nAfter all my years of research and painfully frustrating discussions with believers on both sides of the spectrum, I’ve gleaned just one thing: this debate is a dead end. The net result was that I became paralyzed and did nothing. My kids currently have no vaccinations, save one shot of Dtap for my first child before we quit the system. If it were up to my family and friends, they would remain unvaccinated forever.\n\nBut, COVID-19 has changed all of this for me; I have gained crystal clarity on several essential beliefs around vaccinations and public health that have shaped my position today.\n\nFirst, I trust doctors and health workers on the front lines, as well as medical researchers, to have my back. All around me, I’m seeing medical professionals risking their lives for me and for you. I’ve heard hours of presentations by health workers about research being done in this immediate emergency to stem the tide of death. My faith is restored in the humility of that research and the selfless service of that sector as a whole.\n\nIf more doctors stand up and say, “vaccinations aren’t safe,” then I will keenly listen to their voices. But, if it remains that a vast majority stand in harmony regarding the efficacy and importance of childhood immunizations, I’ll get in line with my kids if I can come to agreement with my spouse. Granted, I’ll space them out and proceed with care, knowing what I do about the lack of testing for the full CDC recommended course. But, I am no longer in a state of paralysis or indecision.\n\nSecond, I value the health of the greater community more than ever before. My family has no history of adverse reactions to vaccinations, nor does my husband’s family to our knowledge. My children have no allergies, auto-immune disorders, learning disabilities, or other health concerns. We are healthy and happy and I now see this as my opportunity to help keep others in our community safe. I believe that vaccinations should be a choice and I feel strongly that they are dangerous for a certain percentage of the population, but I have no reason to believe that we are among them.\n\nThird, I have faith that my family’s health is determined more by our individual karma, than by vaccinations. My experience of life has shown me that bad and good things happen, no matter what we try to do to control them. Better to do what we believe is right and accept what comes calmly, making the best of each moment. Based on the advice of the medical and scientific community, I believe it is best to vaccinate against communicable diseases unless I have reason to believe that me or my children will experience adverse reactions. I believe that karma determines the outcome and that there are no accidents.\n\nFourth (and most esoteric), when forced to take a position, I choose science. According to yoga philosophy, we find ourselves in the age of Dwapara, where reason and science are our primary guides toward progress as a society. In higher ages, this will be replaced by intuition and inner sciences, but that time is not now.\n\nWhile I may lead my life as much by intuition as I can, I choose to break in the direction of the scientific community in areas that are beyond my professional or personal expertise. I believe that humility is an essential spiritual quality and when it comes to areas outside my expertise, I take extra care to remain humble.\n\nHaving read innumerable articles on this issue, it is clear to me that the scientific community finds vaccines have inherent risk, but that the benefit of fighting disease for the public good outweighs the personal risk. Paramhansa Yogananda, my guru, describes communicable disease as lower consciousness wreaking havoc on our planet. It is our duty to fight disease and our best defense in this current yuga is a combination of medicine, healthy lifestyle, and positive attitude. I choose to use all the tools in our current toolbox.\n\nFifth and final point, I choose to believe in people’s best intentions. To walk too far down the road of a big pharma conspiracy to vaccinate all babies, at the potential cost of death and maming of our youth, is simply not the whole story. I choose to believe in the community health workers, family medical practitioners, and registered nurses who spend their lives helping families. I believe that many have done their homework. I believe the epidemiologists and virologists who spend their lives doing this research. I don’t buy into the idea that the entire system is so rigged that they’ve all been duped. I choose humanity and it’s best intentions.\n\nThis final point may be most essential for me. When we allow ourselves to believe a narrative of our world where evil forces are managing to trick us all and conspire to destroy us, we view the world from the lens of extreme duality.\n\nMany of our social systems are unsustainable and based on extreme materialism, yes. And there are some who would kill to protect their assets, true. In fact, ask me about human trafficking as the new slavery or the rise of capitalism to replace imperialism, and I’ll use my political science background and humanitarian training to regale you with information and opinion. But moving from there to covert, sinister forces of conspiracy on a global scale that are out to get you and me is a slippery slope.\n\nIn maintaining a belief in our common humanity and remaining humbly open to the knowledge of others outside my scope of expertise, I feel my heart open to seeing more light. Whether it’s the belief that COVID-19 is really a conspiracy to bring 5G to the world, vaccines are simply big Pharma’s conspiracy to make billions, or the illuminati are stealing our children; I choose to release conspiracy and remain in a rational, neutral, and positive mindset about humanity, it’s motives, and its common goodness.\n\nIn this age of pandemic, I choose science, humanity, and the common good when it comes to vaccines.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 and Vaccine Hesitancy - Thrive Global", "description": "How the global pandemic shaped my understanding of public health and the role of my family.", "url": "https://community.thriveglobal.com/covid-19-and-vaccine-hesitancy/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-04-10T18:19:47+00:00", "article:modified_time": "2020-04-10T18:19:49+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2020/04/00100lrPORTRAIT_00100_BURST20200409171220521_COVER.jpg", "image:width": "1024", "image:height": "768", "image:type": "image/jpeg"}, "tags": ["vaccines", "covid19", "humanity"], "tweets": [], "movies": [], "links": ["https://www.npr.org/sections/health-shots/2017/01/17/510226214/from-twitter-to-treatment-guidelines-industry-influence-permeates-medicine", "https://www.cdc.gov/ncbddd/autism/data.html", "https://www.policymed.com/2011/03/supreme-court-rules-in-favor-of-protecting-vaccine-makers-from-state-lawsuits.html", "https://www.sciencedirect.com/science/article/pii/S0264410X1501525X", "https://www.cdc.gov/vaccinesafety/research/iomreports/index.html", "https://www.cdc.gov/vaccines/vac-gen/additives.htm", "https://childrenshealthdefense.org/news/toxic-vaccine-ingredients-the-devils-in-the-details/", "https://www.ama-assn.org/press-center/ama-statements/ama-statement-reports-new-commission-vaccine-safety", "https://www.aafp.org/afp/2017/0615/p786.html", "https://www.ncbi.nlm.nih.gov/books/NBK220056/", "https://www.smithsonianmag.com/science-nature/vaccine-week-success-stories-18881034/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3171704/"], "authors": ["Gita Matlock"], "publish_date": "2020-04-10T18:19:47+00:00"}