{"result_id": "315012", "URL": "https://community.thriveglobal.com/2480250/", "timestamp": "2023-04-25 17:40:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/2480250/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "We Need An Operation Warp Speed For Agriculture — Our Planet Depends On It", "cleaned_text": "Case counts are still on the rise, and it’s clear that we aren’t out of the woods quite yet. But as cities cautiously reopen, economies revive and people de-mask, we owe it in part to Operation Warp Speed.\n\nThis week, in another big win for the mission to inoculate the world, the U.S. Food and Drug Administration granted the Pfizer-BioNTech shot its full approval.\n\nDespite challenges, the $18-billion public-private program achieved the impossible –– developing, manufacturing and distributing an effective, safe vaccine on a tight timeline.\n\nBut Operation Warp Speed wasn’t the first initiative of its kind, nor will it be the last. From the moon landing to the polio vaccine to the human genome project, fast-tracking innovation has made some of humankind’s greatest milestones possible.\n\nWhich makes me wonder: What unique factors made Operation Warp Speed work? And could a similar mentality accelerate my sector of agriculture? From where I stand, there are three critical ingredients to fast-tracking innovation and expanding our concept of what’s possible.\n\nUrgency is key in spurring action on incredible achievements. Take the space race. The prospect of the Soviet Union beating us to the moon motivated an investment of $28 billion that paid off handsomely. The milestone captured imaginations, and the samples collected were a boon for science –– truly, a giant leap for humankind.\n\nBut saving lives is a compelling motivator too. Last May, the prospect of Covid causing 2.2 million deaths in the USA alone jolted authorities into action.\n\nAgriculture may not seem as consequential. I’d argue, however, that it is. The global population is on track to grow by two billion more people by 2050. In order to feed all those people, we’d need to grow double the amount of crops we currently produce.\n\nBut the challenge isn’t simply growing more food. It’s doing so in a way that’s environmentally sustainable. Agriculture today represents one of the biggest contributors to climate change. We’re trapped in a negative feedback loop where unsustainable agriculture practices like monoculture, clear-cutting forests and using harmful synthetic pesticides can have adverse effects on the crop yields they’re meant to increase.\n\nIn no uncertain terms, slowing global warming and saving the planet depends on agricultural innovation. Once you’ve identified the problem, it’s important to captivate with a solution.\n\nHaving an ambitious, crystal-clear goal is an important part of achieving the (seemingly) unachievable. In fact, I witnessed a small part of this power as a science undergraduate, working in a lab supporting the human genome project.\n\nThe genome project was an international collaboration aimed to map a string of human DNA in 15 years. But biotechnologist Craig Venter believed there was a quicker way. And sure enough, on June 26, 2000 he announced he’d done it –– beating the original goal by three years.\n\nIt was the audacity and clarity of these goals that captivated interest and made them a reality.\n\nSo what would a comparably audacious goal look like for agricultural innovation? The possibilities are numerous: improving yield, reducing chemical pesticides, empowering family farmers. But for me, there’s an even bolder target: mainstreaming regenerative agriculture.\n\nIn contrast to industrial farming techniques that strip soil of its nutrients, regenerative agriculture is intended to take carbon out of the air and reinvest it into the soil, thereby replenishing the land.\n\nThe upsides to going regenerative are many: farmers don’t have to sacrifice yield for sustainability, carbon-rich soil produces healthier crops and … it could be our secret weapon against climate change.\n\nTo stabilize the Earth’s temperature, we need to cut greenhouse gases 50% by 2030 and remove carbon dioxide from the atmosphere. By maximizing farmers’ fields’ natural ability to absorb and sequester carbon, we could not only restore our planet’s depleted soils, but we could reduce CO2 emissions beyond net zero.\n\n\n\nSo let’s up the ante: It’s my goal –– and, in keeping with Operation Warp Speed, it’s an ambitious one –– to see us transition the world’s five billion managed hectares of farmland to climate-smart regenerative agriculture, sequestering at least 680 billion metric tons of carbon over the next 50 years.\n\nImpossible, you say? Well, that’s what the next point aims to address.\n\nThere’s a quote that’s been attributed to Henry Ford that goes something like, “whether you think you can or think you can’t, you’re right.” If we think something is impossible, it is. If we conceive of something as possible or inevitable, we find ways to make it happen.\n\nThis mental flip is easy to overlook but fundamentally important. Just let yourself pretend those outlandish goals are doable, even for a moment. That kind of counterfactual thinking can spur your brain into action and over the “impossibility hump.”\n\nSurely, the architects of Operation Warp Speed faced this same test. Tasked with compressing a 73-month development process into just 13 months, they didn’t have the luxury of wallowing in the “it can’t be done” phase. Instead, they conceived of the vaccine as a fait accompli, and worked backwards, plotting out a timeline for clinical trials, etc.\n\nThat same mentality will drive agricultural innovation. Right now, regenerative agriculture is a nascent, albeit growing, movement. But what if it were ubiquitous? What if farmers weren’t merely slowing climate change but reversing its effects? What if every growing season revitalized not only our health, but the health and balance of the planet? What if we could grow more healthy food, improve farm profitability and productivity, and advance a solution for climate change, all at once? Well, we might just be able to with regenerative agriculture.\n\n\n\nSo, let’s get down to business. How can we give farmers the tools to sequester carbon, on a global scale? Answering that question leads to my next point.\n\n“Money talks” may be cliche, but it’s apt. Vaccine development usually takes so long because companies want proof before sinking funding into the next phase of development. With Warp Speed, we’ve seen that money is no object in a global emergency.\n\nBy October, the U.S. government had already spent $10 billion on the project, including development agreements with private pharmaceutical companies Johnson & Johnson, AstraZeneca and Moderna.\n\nTraditionally, this kind of largesse is where agricultural innovation has stalled. But with new investments and commitments to cut emissions from the Biden administration, that’s poised to change –– if we want it bad enough. Here’s where a private-public partnership akin to what we’ve seen with Operation Warp Speed can make all the difference.\n\nResearch has shown that lack of financial incentives and uncertainty around the benefits are barriers to adoption of regenerative agriculture in the U.S. Then there’s the challenge of tracking: existing methods of measuring the accumulation of carbon in soil are expensive and inaccurate, a problem my own company is working to address.\n\nYet these hurdles are hardly insurmountable. Since last May, for instance, participating Dutch farmers have received real, financial rewards for the carbon they sequester in their soils. With increased government incentives and investment into quantifying regenerative activities worldwide, we could transform every farm into a model for sustainable growth.\n\nWe’re on the precipice of feeling the full impacts of climate change. If we don’t act soon, we’ll be living through another public health crisis. We have an opportunity now to reimagine agriculture that replenishes the Earth while feeding our communities. Now we just have to start believing it’s possible.", "opengraph": {"locale": "en_US", "type": "article", "title": "We Need An Operation Warp Speed For Agriculture — Our Planet Depends On It - Thrive Global", "description": "We have an opportunity for an agricultural system that replenishes the Earth while also feeding our communities. Now we just have to start believing it's possible.", "url": "https://community.thriveglobal.com/2480250/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-08-26T15:08:04+00:00", "article:modified_time": "2021-08-26T20:15:49+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/08/benjamin-davies-JrZ1yE1PjQ0-unsplash.jpg", "image:width": "4843", "image:height": "3229", "image:type": "image/jpeg"}, "tags": ["innovation", "Regenerative Agriculture", "Climate change", "Operation Warp Speed"], "tweets": [], "movies": [], "links": ["https://www.npr.org/sections/coronavirus-live-updates/2021/08/24/1030267314/pfizer-vaccine-covid-fda-approval-kids-faq-mandate", "https://www.cbsnews.com/news/apollo-11-moon-landing-how-much-did-it-cost/", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00029-X/fulltext", "https://www.nationalgeographic.com/foodfeatures/feeding-9-billion/", "https://www.forbes.com/sites/jeffmcmahon/2019/12/02/5-reasons-agricultures-greenhouse-gas-emissions-are-usually-underestimated/?sh=3380cd956ac8", "https://www.onegreenplanet.org/animalsandnature/monoculture-crops-environment/", "https://www.nationalgeographic.org/article/environmental-impacts-agricultural-modifications/", "https://www.nature.com/scitable/topicpage/dna-sequencing-technologies-key-to-the-human-828/", "https://www.scientificamerican.com/article/reflections-on-the-20th-anniversary-of-the-first-publication-of-the-human-genome/", "https://advances.sciencemag.org/content/advances/6/45/eaba1715.full.pdf", "https://earth.stanford.edu/news/roadmap-reducing-greenhouse-gas-emissions-50-percent-2030#gs.09z3kj", "http://www.fao.org/sustainability/news/detail/en/c/1274219/", "https://media.defense.gov/2020/Aug/13/2002476369/-1/-1/0/200813-D-ZZ999-100.JPG", "https://www.vox.com/coronavirus-covid19/2020/10/7/21504134/trump-covid-19-vaccine-operation-warp-speed-debate", "https://time.com/5921360/operation-warp-speed-vaccine-spending/", "https://forainitiative.org/barriers-for-farmers-ranchers/", "https://www.greenbiz.com/article/carbon-sequestration-farms-actually-working-fight-climate-change", "https://www.forbes.com/sites/emanuelabarbiroglio/2021/05/04/to-reach-climate-neutrality-europeans-are-going-to-farm-carbon/?sh=8c75de3ec699"], "authors": ["Karn Manhas"], "publish_date": "2021-08-26T15:08:04+00:00"}