{"result_id": "315022", "URL": "https://community.thriveglobal.com/covid-19-home-exercise-one-month-journey-during-and-after-a-breakthrough-case/", "timestamp": "2023-04-25 17:40:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/covid-19-home-exercise-one-month-journey-during-and-after-a-breakthrough-case/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "COVID-19 Home Exercise One Month Journey During and After a Breakthrough Case", "cleaned_text": "On August 7th, I got a positive test for breakthrough COVID-19 on the heels of my teenage son testing positive on August 3rd. The CDC reduced testing for Delta in May, but it felt safe to assume it was the Delta variant first caught by my son during his solo flight to a baseball camp.\n\nI ended up driving him home, and after 13 hours in a car together, I felt confident that I’d get a breakthrough COVID-19 case even though fully vaccinated. I also felt confident that the vaccine would do its job to help prevent me from getting severely ill.\n\nBelieving strongly in the power of exercise and movement as medicine, I thought I would share my experience with exercising at home during and after my non-critically ill breakthrough COVID-19 case.\n\nResearch shows that people who exercised regularly and then tested positive for SARS-CoV-2 were less likely to experience severe COVID-19 outcomes, so it feels even more important now than ever.\n\nBefore I get in too deep, I want to emphasize the term “non-critically ill.” Obviously the approach would be very different if I had any of the health conditions that put adults or children in the category of being most likely to get severely ill from COVID-19.\n\nAlso, since my breakthrough COVID-19 symptoms were mild to moderate and above the neck (runny nose, sneezing, sinus congestion, dizziness, loss of taste and smell) — above the neck is considered typically safe for exercise — I felt I could safely engage in light safe exercise with COVID-19 at home during my quarantine.\n\nI’m an active, middle-aged woman with a very full life. It’s not the first time I’ve turned to Excy for medical fitness and it likely won’t be the last. I have consistently met the minimum recommendations for physical activity by the U.S. Department of Health and Human Services since we developed the Excy prototype six years ago. However, this is the first time I set out to engage in medical fitness without a lot of studies and data to support my decisions. After all, recovery from COVID-19 is still new ground for the medical, physical therapy, and fitness communities.\n\nWe’re in New Territory, But There’s Precedent for Light Exercise and Safe Medical Fitness\n\nThroughout the COVID-19 pandemic, we have strongly advocated for moderate exercise over vigorous exercise. Research in exercise immunology does suggest moderate exercise may improve immune function, and potentially reduce the risk and severity of respiratory viral infections. However, the same research suggests that repeated strenuous exercise suppresses immune function and that prolonged intense exercise causes immunosuppression.\n\nWith hospitals increasingly focusing on light exercise, even in the ICU where researchers have demonstrated that physiotherapists can safely start in-bed cycling sessions with critical conditions, I decided I’d go the light exercise route while recovering from COVID-19. I didn’t want to do too much to increase inflammation or suppress my immune system, but I wanted to do enough to avoid being sedentary. Light exercise is often too quickly dismissed as medicine, but we do know that ICU patients who start in-bed cycling two weeks into their ICU stay could walk farther at hospital discharge.\n\nThe Cleveland Clinic has some great recommendations for reintroducing physical activity after getting COVID-19 for student athletes and active adults. As they suggested, and given the novel nature of COVID-19, I kept things light, and I immediately focused on squeezing in physical activity for an active recovery — even before I had an official positive test.\n\nBelow is a journal of my efforts to exercise at home with COVID-19 during and after the quarantine period over a one month time span. It is not medical advice. It is not a blueprint. Everyone’s timeline for returning back to exercise or sports after having COVID-19 will be vastly different depending on how mild, moderate or severe the case was. Always consult with your doctor before starting a new exercise program, especially after surgery, a new diagnosis, or an injury.\n\nFor my own recovery, I used our most popular and versatile Excy XCS 260 model. I wanted the widest range of choices from a single machine, as well as the ability to ramp up or down the effort I would need to expend. I also used Tonal for strength training.\n\nI used my heart rate to keep me in check, aiming at around 100 BPM and using my Apple Watch to monitor exertion. To arrive at the goal of 100 BPM, I used my estimated maximum heart rate (MHR) of 172 — subtract your age from 220. Next, I calculated exercising at a range of 55 to 65 percent of my MHR (94.6-110.8). I like round numbers so I aimed for 100 BPM as my guide, which is just over 60 percent of my MHR. While exercise intensity is subjective, many consider moderate exercise to be 64-76 percent of your MHR and vigorous exercise to be 77-93 percent of your MHR.\n\nThere are a few gaps in my Apple Watch data, as sometimes I forget to charge it, but here’s a one month snap shot. The pink circle represents my movement goal, which is 600 calories per day. Green is exercise, which is set to 30 minutes per day. Blue is the standing goal, which is 12 hours per day. I did not change these goals upon getting diagnosed with COVID-19.\n\nWhen we got home after the long drive on August 4th I had no symptoms and had to wait a few days to get tested. But I treated myself as if I had COVID the day my son tested positive.\n\nLong drives hurt my right knee, ankle, and hip because of a previous injury, so when we got home I pedaled Excy for 20 minutes in the stationary recumbent chair bike position.\n\nIn this position, my goal was to activate the hamstrings, quads and glutes by pedaling barefoot forwards and backwards, but also to mobilize the ankle that freezes up when inactive. I also tend to get very tight in my shoulders and neck after driving, so I also did a stand-up arm ergometer workout for 20 minutes by hand cycling backwards. My posture isn’t always great while driving since my shoulders roll forwards. Hand cycling in reverse allowed me to open up my shoulders and activate the muscles around the shoulder blades, especially when squeezing the muscles together with each rotation. While I was tempted to pedal at my normal higher intensity, I focused on range of motion and muscle activation. I also misplaced my Apple Watch, so I couldn’t measure my heart rate yet.\n\nI wasn’t looking for a vigorous cardiovascular workout, just movement to release tension in my body and get my blood moving after driving 900 miles. I also used a Theragun, which is a small percussive massage therapy device, to release tension in my back, shoulders, and legs.\n\nOne of the hardest things about being in quarantine was my dogs’ sad eyes from not being able to go on their daily walk. To put smiles on their faces, I had them follow me around the yard and we played fetch.\n\nDay 1 of Quarantine Exercises: Lying Down Cycling, Mowed the Yard and Theragunned\n\nI woke up with minor cold symptoms, and my son was feeling much better after having some initial flu-like symptoms. I was hoping I was just tired after a long drive and that it was just a cold. We played A LOT of ping pong, which gave us a fun physical activity to do together that didn’t require exertion. I also mowed the yard and played with the dogs in the yard. Then, more ping pong (my son’s XBox was broken, which ended up being awesome because he was bored and wanted to hang out with me).\n\nLater in the evening, I pedaled Excy lying down for 20 minutes. I chose this position because it’s easy to prop your head up with pillows to help with sinus congestion. It’s also my favorite position to focus on diaphragmatic breathing with my back flat on the floor while pedaling in a supine position.\n\nHonestly, I had a fear of getting the breathing struggles that have been so prominent in the news. Being able to pedal slowly lying down gave me a feeling of having more control over my breath and allowed me to use less effort and energy in general to breathe while exercising. My son mentioned his legs felt weak, so he also pedaled Excy lying down at a very light pace to get his blood pumping.\n\n2nd Day of Exercising During Quarantine: Arm Cycling Day with Mild Cold Symptoms\n\nMild cold symptoms continued with some additional nasal congestion. Pre COVID-19 era, I would have thought nothing of it, but that’s when I knew I had the breakthrough case. It was also testing day — I waited an extra day to get tested because I didn’t want to do the full “brain” swab twice.\n\nMy son and I continued to play ping pong throughout the day, and we also watched a lot of movies while I squeezed in work. My body and mind were not okay with being sedentary, and I felt restless. I did another 20 minute hand cycling workout during one of the movies and focused on pedaling lightly while sitting down this time (still couldn’t find my Apple Watch, so I was exercising based on listening to my body).\n\nI typically turn to hand cycling when looking for a vigorous workout, by this time it was about maintaining my endurance with light resistance to not tax my cardiovascular system. As we know, COVID tends to hit the lungs hard, so I didn’t want to chance it.\n\nDay Three of Quarantine Home Exercise: Positive Test, Pedaled Lying Down, Played with Dogs\n\nGot the positive test results back as expected. Mild cold symptoms were the same as the day before. On this day, I had the same weakness in my legs that my son experienced. They basically felt like spaghetti noodles throughout the day, but it felt more neurological than muscular.\n\nWith a history of having a DVT blood clot, I had definite fear of getting a blood clot after testing positive. To keep the blood circulating, I decided pedaling lying down with my feet above my heart for 30 minutes was a good solution. The exercise got rid of the noodle feeling, which was a great bonus! I also propped my head up on pillows while pedaling to help relieve sinus pressure. The daily routine of playing with the dogs in the yard and ping pong continued. We spent a lot of time resting and watching movies. I found my Apple Watch so I could now focus on keeping my heart rate at a measured rate of 100 BPM.\n\n4th Day of Quarantine Exercise: Light Pedaling Lying Down and Lifted Weights\n\nMinor cold symptoms continued with a moderate increase in nasal congestion. The weakness in my legs bothered me more than the cold, so I pedaled lying down lightly for about 20 minutes while focusing on diaphragmatic breathing and keeping my head elevated with pillows. I didn’t have a fever, body aches, or swollen lymph nodes, and outside of my legs feeling a little wobbly, all other symptoms remained above the neck. I decided to lift weights, which I had done consistently once a week for 42 weeks using Tonal. This is where things got a little strange.\n\nI typically have to work hard to get my heart rate to 160 BPM. However, during this Tonal workout, it didn’t take much effort at all to get my heart rate to 160 BPM. I felt like my heart was working more vigorously than normal with much less effort, so I slowed the pace for a 20 minute workout and kept my heart rate below 110 BPM. When my heart rate went higher, I took rest periods to get it back down.\n\nWhile I loved the idea of opening up my lungs and releasing endorphins with a higher heart rate, I didn’t want to strain my cardiovascular system as I was worried that too much intensity could exacerbate or worsen the COVID-19 symptoms. I was also taking a decongestant, which can constrict blood vessels. Merely having a cold or the flu can strain the cardiovascular system, so I proceeded with caution with having COVID-19.\n\nDay Five of Exercising During COVID Quarantine: Ping Pong and Playing with the Dogs\n\nI woke up on day five with a lot more nasal sinus pressure, which felt like a sinus infection. I didn’t have a temperature or fatigue, and all symptoms still remained above the neck. We played a lot of ping pong and made sure the dogs got outside for some play time.\n\nBy day five, I was longing to get the dogs out on their normal walk, and we all craved to be out of quarantine. I no longer had the weakness in my legs. I heard from others that their weakness was worse and lasted much longer, so I think the exercise helped me recover a little faster.\n\nI woke up with even more sinus pressure and a small headache, which felt like a full-fledged sinus infection that I tend to get once a year. All symptoms still remained above the neck, so I decided to do an upper body ergometer workout while standing. I continued to keep my heart rate below 100 BPM, which felt great and temporarily relieved some of my sinus pressure.\n\nThe dogs were looking at me with eyes that screamed, “Why in the heck aren’t we going on a walk?” I felt their frustration. I don’t know the official quarantine rules of taking dogs on a walk. But, I was symptomatic and did not want to put anyone at risk. So, I spent a lot of time playing with the dogs in the yard for their sanity.\n\nMy son lost his taste and smell on the second day of his symptoms. Still able to taste and smell on day six, I figured I was in the clear. I was also hoping it was a symptom that the vaccine would prevent. I made halibut for dinner and thought it was just bland, but ended up having no sense of taste or smell when I woke up the next day.\n\nDay 7 of Quarantine Exercise: Chair Bike Exercise, Ping Pong, Playing with the Dogs, Vertigo Exercises for Dizziness\n\nHad more sinus pressure and the beginning feelings of vertigo. I had vertigo twice last year, both times after a long drive. It’s hard to say if the feeling of vertigo was from COVID/sinus pressure or the drive. This was my sickest day during the quarantine.\n\nThree times a day, I focused on doing the Epley Maneuver and Foster maneuver for vertigo. We continued to play ping pong and get the dogs outside. I pedaled Excy as a lower recumbent bike from a chair while watching TV for 20 minutes. I picked the Excy recumbent bike position today because lying down magnified the feelings of vertigo, whereas the recumbent position allowed me to sit comfortably without feeling dizzy. Remember, all these exercises are being done with a single machine and I was grateful for the versatility. Ping pong was a little more difficult today, but we still played. I just lost more games than usual, as concentrating on the ball was harder.\n\n8th Day of Quarantine Exercise: Vertigo Exercises for Dizziness and Lifted Weights\n\nNo more ping pong because my son’s quarantine ended today, and he was gone like the wind (or like a newly licensed teenage driver). My symptoms (runny nose, sneezing, sinus congestion, dizziness) started improving and were moderate, with all symptoms still above the neck. I continued with the vertigo exercises a few times a day with symptoms remaining the same.\n\nI also lifted weights again with the Tonal system to keep my now 43-week streak going. My heart rate experience was similar to day four where it was easier than normal to get my heart rate up. So, I was mindful about keeping it light in terms of pace to keep my heart rate around 100 BPM.\n\nToday was also interesting because it was the kickoff of Excy’s participation in the WTIAA program for Cohort6. I had to give a one-minute company pitch to fellow participants via a Zoom call while having increased feelings of vertigo, which was not fun. I had a hard time looking at the computer screen but got through it.\n\nWoke up with all symptoms nearly gone except I still couldn’t taste or smell and had very minor sinus pressure. I hand-cycled while sitting down and got my heart rate up to 130 BPM. Without symptoms, I gave myself permission to go harder, and it felt awesome to sweat!\n\nI chose this position because it allowed me to pedal my hands for a higher intensity workout, but without standing up just in case the vertigo symptoms came back. I did the vertigo exercises again, just in case. I was so thankful the vertigo didn’t last longer. I longed to taste something … anything! But especially my morning coffee.\n\nDay 10 Out of quarantine. Husband came home. Took the dogs on a walk!\n\nFinally! My “get out of jail” quarantine day! The only exercise I did today and then for the next few days was to take the dogs on a walk. One of our dogs (Rex) can only walk a couple of blocks (he’s 12 and has bad hips), so playing in the yard kept up his normal daily exercise. Our other dog (Russell) has had a 2 to 2.5 mile walk nearly every day during the pandemic except during this quarantine. Russell definitely put on a little weight during the quarantine, so we took the first walk slowly.\n\nOn the first two walks, we did two miles and I kept my heart rate between 100 BPM and 110 BPM. We then moved to our 2.5 mile route and aimed for my typical rate of 110-120 BPM. I didn’t feel like my fitness slipped at all and didn’t notice any abnormalities. I also really appreciated the fresh air and getting back into our routine.\n\nWeek 3: Returning to Normal Exercise After COVID-19? Not Quite Yet\n\nThankfully, I got my taste back during week three and became symptom-free, except for the start of a dry cough and I also had a new discomforting pain in my diaphragm. I went in for a check-up to make sure all was well. They did an EKG just to be sure and a chest X-ray. The EKG was “perfect” and the X-ray showed a small scar on my right lung, which the doctor said could be from COVID or could be from a previous illness (I did have bronchitis about 10 years ago that required an antibiotic). She did not see an active infection. The pain in my diaphragm was diagnosed as acid reflux that she said was likely due to stress. She also said the acid reflux could cause my cough. She gave me the green light to continue to exercise with an acid reflux prescription for two weeks.\n\nThe cough still made me a little uneasy, so I didn’t feel quite ready to jump into my normal high intensity interval training (HIIT) exercise routine, which is 70 to 120 minutes of moderate to vigorous exercise 5 to 6 times per week. Instead, I started the week by pedaling Excy while lying down again, but this time for an hour with an average heart rate of 91 BPM.\n\nThroughout the rest of the week, I mostly just listened to my body and exercised with Excy every other day for 20 minutes (rotating between arms and legs). I found myself feeling comfortable at about 120 BPM, which was enough to make me sweat, but not breathe hard. I used Tonal twice doing HIIT weight-lifting sessions, which was easier this week than when I had symptoms. I was still mindful to keep my heart rate at a light to moderate pace because of the cough. The dogs got to go on their walk every day, sometimes even twice where my heart rate was typically 110-115 BPM.\n\nBy the end of week three, I decided I was willing to push myself and went on a group 2-mile hike that has 1760 feet of elevation gain. Out of curiosity, I asked my fellow hikers what their heart rate was during the hike and found that it was about the same as mine (in the 160 BPM range for a pretty intense hike). I had done the same hike before and took a couple more breaks during this climb. I was nervous about getting my heart rate up too high, for too long. Rest periods helped me feel in control.\n\nWhen we got to the top, we also did an hour-long yoga session, which was a first for me. From an endurance perspective, I was able to keep up. With being new to yoga, I absolutely didn’t do the moves as beautifully as everyone else, but had a blast. I got lost in the moment and forgot to track my heart rate. I loved being reminded to breathe and to be mindful of what’s happening with your body during exercise.\n\nOn the two-mile return down the mountain, my legs felt a little weaker than they normally would, but felt great overall. I was not sore the next day, and in fact, woke up and took my son on another small hike.\n\nHeading into week 4, I still had a small dry cough, but otherwise felt like I was back to myself. I took a two-day exercise break heading into the week to let the cough settle and then came back to finish the week with my most vigorous exercise since getting COVID. While lifting weights with Tonal my average heart rate was 135 BPM. I also pedaled Excy in the recumbent bike position with an average heart rate of 136 BPM.I then wrapped up the week with Excy in the upper body ergometer position while sitting down with an average heart rate of 122 BPM, which I expect to be higher next week. My upper body fitness isn’t quite back to normal, but I expect it will be within the week.\n\nThe “versus” in the section subtitle is a bit tongue-in-cheek. This is an argument you’ll see a lot in fitness channels: does your body recover more easily if you rest fully? Or does a little exercise help you feel better, faster?\n\nThe truth is, as it nearly always is, “it depends.” In this case, I applied traditional wisdom (OK to exercise when symptoms are mild and above the neck) to a very unique situation. I paid very close attention to how I felt during and after exercise, and monitored my body with tested science (BPM). I felt comfortable I was taking the right path for me and not doing damage or putting myself at risk.\n\nMy exercise recovery experiment with COVID-19 during the 10-day quarantine wasn’t about losing or maintaining my weight. For me, it was about a hope to improve my recovery from the virus, an aspiration to keep long-haul COVID at bay, and for some sanity while being cooped up. Also, to return to my state of fitness quickly, which I rely on for my physical, emotional, and mental well-being. I was so thankful to not get severely ill from COVID-19, and my heart aches for all those who have suffered and died.\n\nThere’s no doubt that COVID-19 is here to stay. We have so much to learn about this dreaded virus, including how best to help people recover after having COVID-19. I believe in my heart that research will show that exercise will be a critical component of treatment before, during, and after a COVID-19 diagnosis. I also believe that light exercise with COVID-19 and then after allowed me to maintain my endurance better than if I spent those 10 days being sedentary.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Home Exercise One Month Journey During and After a Breakthrough Case - Thrive Global", "description": "Co-founder of Excy captures her one month journey of exercising at home after a breakthrough COVID-19 case. Read more on why she favored light exercise and movement and used heart rate as her guide.", "url": "https://community.thriveglobal.com/covid-19-home-exercise-one-month-journey-during-and-after-a-breakthrough-case/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-09-07T17:08:28+00:00", "article:modified_time": "2021-09-07T20:29:11+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/09/Exercise-Lying-Down-with-Excy-for-Medical-Fitness.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": ["FITNESS", "Home Exercise with COVID-19", "Exercise is medicine", "Covid-19 Quarantine", "physical well-being", "physical therapy", "Physical Fitness", "Movement is Medicine", "physical wellness"], "tweets": [], "movies": [], "links": ["https://www.pbs.org/newshour/show/covid-19-surge-why-we-need-more-data-on-breakthrough-infections", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/effectiveness/why-measure-effectiveness/breakthrough-cases.html", "https://www.webmd.com/lung/news/20210419/more-exercise-lowers-risk-of-severe-covid-19-study", "https://www.cdc.gov/coronavirus/2019-ncov/need-extra-precautions/people-with-medical-conditions.html", "https://www.medpagetoday.com/infectiousdisease/covid19/92975", "https://www.heart.org/en/news/2021/01/13/is-it-ok-to-exercise-when-youre-sick", "https://www.geekwire.com/2018/excy/", "https://health.gov/sites/default/files/2019-09/Physical_Activity_Guidelines_2nd_edition.pdf", "https://health.gov/sites/default/files/2019-09/Physical_Activity_Guidelines_2nd_edition.pdf", "https://excy.com/2020/04/22/exercising-at-home-during-the-coronavirus-aim-for-moderate-intensity/", "https://www.cebm.net/covid-19/does-physical-exercise-prevent-or-treat-acute-respiratory-infection-ari/", "https://www.sciencedaily.com/releases/2016/12/161228144402.htm", "https://health.clevelandclinic.org/returning-to-sports-or-exercise-after-recovering-from-covid-19/", "https://excy.com/excy-xcs-260-portable-recumbent-exercise-bike-cross-trainer-and-more/", "http://www.tonal.com", "https://www.cdc.gov/physicalactivity/basics/measuring/heartrate.htm", "https://excy.com/recumbent-chair-cycling-with-excy/", "https://excy.com/table-top-upper-body-ergometer-excy-exercises/", "https://www.therabody.com/", "https://excy.com/lying-down-exercise-cycling-excy/", "https://youtu.be/kgTL5G1ibIo", "https://youtu.be/9SLm76jQg3g", "https://youtu.be/0w7jYTUSYy0", "https://excy.com/bedside-cycle-chair-cycle-excy-ergometer/", "https://www.washingtontechnology.org/30-tech-startups-selected-for-sixth-wtia-founder-cohort/", "https://excy.com/bed-exercise-floor-exercise-hand-ergometer/", "https://www.cnn.com/2021/08/20/health/coronavirus-steps-to-coexist-gupta-wellness/index.html"], "authors": ["Michele Mehl"], "publish_date": "2021-09-07T17:08:28+00:00"}