{"result_id": "315031", "URL": "https://community.thriveglobal.com/mental-health-after-covid-19/", "timestamp": "2023-04-25 17:41:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/mental-health-after-covid-19/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Mental Health after COVID-19", "cleaned_text": "The pandemic crisis that has been brought by COVID-19 has truly ravaged the world like nothing before. With an approximate twelve crore jobs lost in India alone, people (especially those belonging to the lower middle classes) are finding it very difficult to keep up to their daily drudgeries.\n\nToday, the biggest speculation lies around the plausibilities of the discovery of a COVID vaccine and what jobs and work life in the post COVID world could look like. In an earlier article, I had stated D.M. Morens’ opinion on businesses attaining a new fiscal policy after the pandemic. “Lasting shifts in social attitudes, policy, work, and consumption will likely also emerge from the COVID-19 pandemic” is what the BCG Henderson Institute had earlier told.\n\nFor the patients who’d earlier been affected by COVID-19 and have survived the deadly pandemic, MedToday writer Kristen Monaco notes that ‘Short- and long-term depression, anxiety, PTSD may be an issue post-ICU’. Also, in their interview with Sapna Kudchadkar, MD, PhD of Johns Hopkins Medicine in Baltimore, they observed that, “Adult patients may experience difficulties resuming the activities of daily life or struggle to return to work. Physically, patients may suffer from muscle weakness and chronic pain. Cognitively, these individuals may have trouble with concentration and memory, and cognitive issues may be particularly pronounced in people with a history of dementia. People suffering from PICS may experience anxiety, sleep difficulties, depression, or post-traumatic stress disorder (PTSD).”\n\nRegarding the speculations that have been going on around depression and traumas people have been stuck in after losing jobs, Founder of Bullyid App, Agita Pasaribu states, ‘millions of people around the world have lost their jobs, sources of income, or been furloughed as a result of the COVID-19 pandemic. While everyone grieves differently, there are healthy and unhealthy ways to mourn the loss of your job. It can be easy to turn to habits such as drinking too much or bingeing on junk food for comfort. But these will only provide fleeting relief and in the long-term will make you feel even worse. Acknowledging your feelings and challenging your negative thoughts, on the other hand, at Bullyid, we help you deal with the loss and moveon. It’s easy to feel overwhelmed by uncertainty about when and how the economy will recover or if you’ll be able to find work. It’s important to know that you’re not alone; many of us are facing the same insecurity at this time.’\n\nOverall, going back to normal life is still debatable as of now. Mental health is definitely something various organisations and researchers are presently focusing on. Conclusively, psychotherapist Nina K. Billingsley (in a Thrive Global article) pens down that, “You’re scared. We’re scared, too. But we’re not to blame here. We’re trying to survive this pandemic just like you are, and the only way we’ll get through this is if we all work together.Stay at home. Find a way to channel your fear and anxiety in directions that don’t hurt yourself or others. Follow physical distancing rules. If you’re an essential worker, take steps to protect yourself as much as you can.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Mental Health after COVID-19 - Thrive Global", "description": "The pandemic crisis that has been brought by COVID-19 has truly ravaged the world like nothing before. With an approximate twelve crore jobs lost in India alone, people (especially those belonging to the lower middle classes) are finding it very difficult to keep up to their daily drudgeries.  Today, the biggest speculation lies around the plausibilities of … Continued", "url": "https://community.thriveglobal.com/mental-health-after-covid-19/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-10-06T13:14:54+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/11/Thrive-Global-Meta-Image.png", "image:width": "1200", "image:height": "627", "image:type": "image/png"}, "tags": ["mental health and covid19", "covid"], "tweets": [], "movies": [], "links": [], "authors": ["Souhardya De"], "publish_date": "2020-10-06T13:14:54+00:00"}