{"result_id": "315026", "URL": "https://community.thriveglobal.com/living-with-covid/", "timestamp": "2023-04-25 17:41:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/living-with-covid/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Living with Covid", "cleaned_text": "To me, the news of experts realizing that Covid-19 isn’t going anywhere is good news. From the very beginning, I said that even if there is a vaccine or a drug that cures Covid, the virus will mutate or another bug will come along and render our efforts futile. As I have said probably hundreds of times since the beginning of the outbreak, trying to outsmart nature with technology will not work. We are products of nature, so trying to outsmart our producer is, to put it mildly, unwise.\n\nThe vaccines are helpful in keeping the pandemic at bay, but as long as we avoid making the necessary changes in our relations, the virus will keep returning in various forms and intensities until we realize that we need a more fundamental change than just a new vaccine. Covid is not a strain of flu. The way to remove it is not physical, but emotional. Only when we comprehend this, we will be able to heal ourselves, after we heal our malignant relationships. Then, we won’t have to go on living with Covid.\n\nPersonally, I am happy that this is the way nature is directing us. I am not at all happy that people are suffering, but they are not suffering because of nature, but because humanity is obstinate and insists on going where nature isn’t going. When you bump your head against the wall of reality, you’re bound to get a major headache. In the case of humanity, this headache manifests in millions of needless fatalities and countless people suffering from long lasting symptoms because of our mulishness.\n\nLike it or not, Covid is telling us to slow down. The technological rat-race we’ve been on has nearly devastated humanity, and we need to calm down and bring it under control. People need to stop fighting and start talking about what really matters: our relationships.\n\nSince we cannot communicate with each other positively in the physical realm, nature has shifted us to the virtual one. If we learn to communicate positively in that realm, we will see Covid easing its grip and letting us communicate with each other physically, too.\n\nNature is using Covid to teach us that our real immune system is not in our bodies but in our hearts, in how we relate to one another and how we feel about each other. Since we are all connected, one person’s ill-will percolates to everyone else, and our negative emotions spread like viruses and sicken us. Positive emotions percolate and spread, as well, but those are desperately scarce, hence the pitiful state of humanity.\n\nThe vaccines are helpful in keeping the pandemic at bay, but as long as we avoid making the necessary changes in our relations, the virus will keep returning in various forms and intensities until we realize that we need a more fundamental change than just a new vaccine. Covid is not a strain of flu. The way to remove it is not physical, but emotional. Only when we comprehend this, we will be able to heal ourselves, after we heal our malignant relationships. Then, we won’t have to go on living with Covid.", "opengraph": {"locale": "en_US", "type": "article", "title": "Living with Covid - Thrive Global", "description": "Since we cannot communicate with each other positively in the physical realm, nature has shifted us to the virtual one. If we learn to communicate positively in that realm, we will see Covid easing its grip and letting us communicate with each other physically, too.", "url": "https://community.thriveglobal.com/living-with-covid/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-07-12T18:02:32+00:00", "article:modified_time": "2021-07-12T18:02:35+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/07/delta.jpg", "image:width": "1300", "image:height": "866", "image:type": "image/jpeg"}, "tags": ["pandemic", "Relationships", "COVID-19", "lesson", "Emotional Intelligence"], "tweets": [], "movies": [], "links": [], "authors": ["michael-laitman"], "publish_date": "2021-07-12T18:02:32+00:00"}