{"result_id": "315038", "URL": "https://community.thriveglobal.com/why-covid-vaccines-give-me-no-relief/", "timestamp": "2023-04-25 17:41:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/why-covid-vaccines-give-me-no-relief/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Why Covid Vaccines Give Me No Relief", "cleaned_text": "Since the beginning of the year, people have been trying to hang on to their previous lives in anticipation for a vaccine that would cure humanity from the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), which causes the coronavirus disease 2019 (Covid-19). Now it seems to have arrived, in multiple forms and from multiple companies. According to an essay published by the World Economic Forum, “A vaccine usually takes more than 10 years to develop.” In the case of Covid-19, it took several companies a measly ten months to develop it. How did several companies develop a vaccine 12 times faster than the average time? At the very least, it leaves one puzzling.\n\nHowever, this is not the biggest issue here. What is most disconcerting to me is our delusional thinking that by getting rid of the Covid virus we will get rid of our troubles and return to our previous lifestyle, which inflicted on us the virus in the first place.\n\nI have no doubt, and neither do countless scientists that I quoted in previous posts, that the coronavirus is only the first in a series of many more miseries that will land on humanity at a growing frequency. Getting rid of Covid will only expedite the arrival of the next, and more painful blow. We have to understand that our exploitation of nature and people is over. If we understand it and adapt ourselves to this reality, we will go through the mending phase relatively easily. If we are obstinate, nature has many more tricks up its sleeve to show us who’s really the boss, and none of them is pleasant.\n\nWe treat nature as though it’s lifeless, something we can discount and spurn, as though we can do with it whatever we want. Covid has come to teach us otherwise. Through it, nature speaks to us. It teaches us its language, its conduct, and gradually reveals to us its secrets.\n\nNature has no ambition to kill us. If it did, there are far quicker ways to do it than Covid-19. We call nature Mother Nature because this is exactly what it is. Like a loving mother, it wants to teach us with the least pain and effort what it is that it must teach us. It wants to show us how it works, how it thinks, what it wants and why it wants it. It acts before us like a mother acts before her baby: She laughs and sings, talks to her baby, makes faces, and points to other objects and people. Why does she do all this? After all, her baby doesn’t understand her, so what’s the point? The point is that the baby wants to learn, and by looking at the mother “performing,” it learns all that it needs to learn in order to grow.\n\nNature is treating us just like that mother. Like that baby, we don’t understand it; and like that baby, we don’t need to. All we need is to want, just like that baby, and the understanding will come to us, just as it comes to every baby ever born.\n\nNature wants to make us omniscient, wise and loving. It wants to show us how everything is connected, why it is connected, and our place and role in that connection. We don’t need to know it before we assume our role; we simply need to listen. Just as a baby first wants to learn, then learns, and finally performs, so humanity must want to learn, then learn, and only then perform.\n\nIf we adopt this attitude, we won’t need any viruses, natural disasters, or any other scares. These are nature’s last resort, when it gives up on grabbing our attention otherwise. If we are obstinate and don’t want to learn, to pay attention to nature and understand its language, then nature has no choice but to call our attention in the only way that works—by hurting us. It could hurt us much worse if it wanted to, but it doesn’t. We should be wiser than to say that Covid is just a bad flu, since nature can administer a much more serious “remedy.”\n\nWhat we refuse to understand is that we don’t need to develop a vaccine; we already have it—it’s our positive relation to each other. It may not work if few adopt it, but if all of society transforms its attitude to one another, if we become a society governed by solidarity and care rather than alienation and cruelty, we will become a healthy and prosperous society, where everyone is free and safe.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Covid Vaccines Give Me No Relief - Thrive Global", "description": "If we become a society governed by solidarity and care rather than alienation and cruelty, we will become a healthy and prosperous society, where everyone is free and safe.", "url": "https://community.thriveglobal.com/why-covid-vaccines-give-me-no-relief/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-12-06T16:40:12+00:00", "article:modified_time": "2020-12-06T16:40:14+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2020/12/covid-vaccine.jpg", "image:width": "1300", "image:height": "989", "image:type": "image/jpeg"}, "tags": ["Covid-19 Vaccine", "Coronavirus", "Nature", "vaccine", "Healthy Relationships"], "tweets": [], "movies": [], "links": [], "authors": ["michael-laitman"], "publish_date": "2020-12-06T16:40:12+00:00"}