{"result_id": "315046", "URL": "https://community.thriveglobal.com/the-relentless-school-nurse-vaccinate-to-liberate/", "timestamp": "2023-04-25 17:41:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/the-relentless-school-nurse-vaccinate-to-liberate/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "The Relentless School Nurse: Vaccinate to Liberate", "cleaned_text": "Professor Heidi Larson, Ph.D. is the inspired Director of the Vaccine Confidence Project™, an innovative initiative that monitors public confidence and public concerns about immunization programs. One of my favorite podcasts, In the Bubble with Andy Slavitt, had Dr. Larson on a recent episode. She recommended that an effective public health messaging campaign would be “Vaccinate to Liberate.” Her recommendation is based on data collected by her organization that tracks trends in vaccine hesitancy, a primary one being that people do not want to be told what to do. The idea of liberation, “the act of setting someone free from imprisonment, slavery, or oppression; release,” is a foundational American value that reflects our complicated past and present reckoning on racism. I am sitting with the idea of “Vaccinate to Liberate” as an idea whose time has come. What about you?\n\nHere is a brief description of “Vaccine Confidence” retrieved from the website:\n\n“…understanding vaccine confidence means understanding the more difficult belief-based, emotional, ideological, and contextual factors whose influences often live outside an immunization or even health program but affect both confidence in and acceptance of vaccines.”\n\nWho better than school nurses to boost vaccine confidence in our school communities by demonstrating our own belief in the importance of vaccines? What will it mean for our nation when we reach 70% vaccine compliance? That is the magic number for safe herd immunity, 70%! We could have a much different opening of school in September 2021 if we are successful in encouraging our communities to participate in the COVID vaccination program. This is not including our students, yet, but hopefully, that is coming soon!\n\n#VaccinateToLiberate can be our public rallying cry to encourage our family members, friends, neighbors, and colleagues to take this important step in ending the pandemic. Of course, until the virus is contained, we must continue the public health mitigation strategies that fewer and fewer people seem to be following. While we are all exhausted from doing our best to hold the virus at bay at school, the virus continues to surge across the country because of what happens outside of the school day.\n\nWhat we do know is that public health messaging regarding COVID19 was truncated, messy, and confusing. We cannot repeat these mistakes when it comes to a national vaccination campaign. We must have a united, clear, powerful message that will invoke confidence and participation in encouraging people to get the vaccines. My sense is that nurses, especially school nurses, can have a direct impact on increasing vaccine confidence by sharing ours. This is one reason that I am looking forward to the day(s) when I can happily roll up my sleeve to receive the COVID vaccine. #VaccinateToLiberate is the message that speaks to me. Where do you stand?\n\nHere is a helpful article to promote vaccination confidence by Dr. Larson:", "opengraph": {"locale": "en_US", "type": "article", "title": "The Relentless School Nurse: Vaccinate to Liberate - Thrive Global", "description": "Professor Heidi Larson, Ph.D. is the inspired Director of the Vaccine Confidence Project™, an innovative initiative that monitors public confidence and public concerns about immunization programs. One of my favorite podcasts,  In the Bubble with Andy Slavitt, had Dr. Larson on a recent episode. She recommended that an effective public health messaging campaign would be … Continued", "url": "https://community.thriveglobal.com/the-relentless-school-nurse-vaccinate-to-liberate/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-12-22T13:10:07+00:00", "article:modified_time": "2020-12-22T13:10:09+00:00", "image": "https://relentlessschoolnurse.com/wp-content/uploads/2020/12/Screen-Shot-2020-12-15-at-7.20.52-AM.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.vaccineconfidence.org/", "https://www.lemonadamedia.com/podcast/vaccine-confidence-with-heidi-larson/", "https://www.merriam-webster.com/dictionary/liberate", "https://www.vaccineconfidence.org/vcp-mission", "https://www.healthawareness.co.uk/vaccines/five-ways-to-build-confidence-in-vaccines/"], "authors": ["Robin Cogan"], "publish_date": "2020-12-22T13:10:07+00:00"}