{"result_id": "315021", "URL": "https://community.thriveglobal.com/after-dodging-covid-for-three-years/", "timestamp": "2023-04-25 17:40:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/after-dodging-covid-for-three-years/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "After Dodging COVID for Three Years...", "cleaned_text": "Saturday, December 3. Out of the blue, at exactly 8 pm, while I was getting ready to stream a concert I started to cough uncontrollably, my nose running and felt flush and unwell. The coughing continued all night.I had a terrible night of sleep.\n\nSunday. I tested myself the next morning to see if I had COVID with a rapid (antigen) test. It was negative. I continued to cough and to feel tired. I slept for several hours during the day. I assumed it was a sinus infection. I have been getting sinus infections after flying and my wife and I had returned from an overseas trip 5 days before.\n\nBeing a doctor, I considered other conditions. Influenza? No, I didn’t have any other symptoms (fever, headache, muscle aches and pains), and yes, I had been vaccinated for it. RSV? That was possible but I was the wrong age and didn’t have the shortness of breath. The common cold? Yes, that was a possibility. COVID? No way! I had been uber vaccinated including the bivalent vaccine. And, I had been so so careful. I had practically been living in an N-95 mask the past 3 years.\n\nMonday. I tested myself first thing in the morning using an antigen test. After I finished preparing and doing the test, I instructed my smart speaker, “Alexa, timer 15 minutes.” I briefly looked at the test as I prepared to walk away. Within 20 seconds, the dreaded second red line appeared. I had COVID!\n\nEverything changed in an instance. Priority one. I had to isolate from my wife who had no symptoms and had tested negative. I was now going to wear a mask in my own house. I was to quarantine in my home office. Priority two. Thinking about whether I needed treatment. I texted my doctor. He said yes and ordered Paxlovid. By mid-afternoon I had taken my first dose of 3 pills. Priority three. I thought about whether I could have infected anyone. I had had no contact except my wife since I developed any symptoms.\n\nFigure 2 I tested positive (my wife did not) and I started Paxlovid that afternoon.\n\nWithin a couple of hours, the metallic taste of Paxlovid kicked in. My mind was in overdrive that day. I tried to figure out where and from whom I could have gotten infected. We returned from Europe six days before. We wore N-95 masks everywhere even in museums, and restaurants where we were the only ones masked. Of course, during eating we were unmasked. Could it have been the woman coughing and hacking in the duck restaurant 9 days before? Could it have been in the airport or on the plane while we were eating or drinking? Could it have been I was infected after I returned in a medical building in the few seconds I was unmasked during the examination? Could it have been while I was teaching (mostly wearing a mask) my Mystery of Sleep class at Yale? Several students told me later that subsequently got COVID. I will never know.\n\nI continued to cough all day, was hoarse and felt really fatigued, and spent most of the day in bed, sleeping. Thank goodness, my wife did not have my symptoms. She prepared meals for me on paper plates and I ate in my office.\n\nI was worried about the coughing. Coughing was usually caused irritation of the vocal cords or the breathing passages in the lungs. Was my blood oxygen a problem? I am a scientific advisor to a company called BodiMetrics that markets a health ring that also has an oximeter that could record continuously during sleep. I had the ring and monitored my sleep. I coughed all night.\n\nFigure 3 The first couple of nights after the COVID diagnosis my blood oxygen levels dropped while I slept.\n\nTuesday. I checked the oxygen levels from the night. I had 14.4 episodes/per hour of the levels dropping and the lowest level was 77.2 percent. Yikes. I was sick. My wife still tested negative by rapid test. She now had a “funny felling in my throat”. She went to have a PCR test (and flu and RSV tests). The PCR was POSITIVE. I had probably given her COVID. My symptoms continued unabated and that night had a terrible sleep. My wife had few symptoms, but she started Paxlovid, because of her age and asthma history.\n\nWednesday. I checked the oxygen levels from the night. I had 22.5 episodes/per hour of the levels dropping and the lowest level was 69.6 percent. Yikes. I was even sicker. Later that day, I suddenly felt better; my coughing decreased, my voice was less hoarse, my nose was running less. I continued to take the Paxlovid, as instructed by my doctor.\n\nThursday and beyond. I started to feel better each day, but still had fatigue and napped daily. On the seventh night since I started testing, my oxygen levels during sleep approached normal. As I write this, I am OK but am still testing positive and am wondering whether I will be one of those who develop a post-Paxlovid relapse. I continue to isolate.\n\nLessons. No matter how careful you are, COVID is out there. Do the best you can. A negative rapid test may not be good enough to exclude COVID infection. There is a lot of influemza out there. Once you are diagnosed the focus shifts from protecting yourself to protecting others and doing whatever you can to mitigate the effect of infection on you. There are many unknowns and best guesses: how long you might be infectious after you are sickened; how long you might be infectious after Paxlovid, especially if there is relapse.\n\nWe have lived through a monumental pandemic which is not quite over. Maybe it will never be entirely over. Over 6 .6 million people of died worldwide. Over 1.1 million in the USA. The equivalent of an airliner crash still die daily. Many who have survived suffer the ravages of long COVID. Yet, there is a lot to be thankful for: the vaccines, the medicines, the research. They have reduced severity of disease, hospitalizations and deaths. Each person who has had COVID has their own unique story. This is mine.", "opengraph": {"locale": "en_US", "type": "article", "title": "After Dodging COVID for Three Years... - Thrive Global", "description": "Each person who has had COVID has their own unique story. This is mine.", "url": "https://community.thriveglobal.com/after-dodging-covid-for-three-years/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2022-12-15T18:07:46+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/12/unnamed-4.png", "image:width": "512", "image:height": "381", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://bodimetrics.com/"], "authors": ["Meir Kryger, MD"], "publish_date": "2022-12-15T18:07:46+00:00"}