{"result_id": "315037", "URL": "https://community.thriveglobal.com/doctor-jonathan-salk-coronavirus-vaccination-polio-research-current-events/", "timestamp": "2023-04-25 17:41:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/doctor-jonathan-salk-coronavirus-vaccination-polio-research-current-events/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "What Jonas Salk Would Have Said About COVID-19", "cleaned_text": "There’s a lot of speculation about a COVID-19 vaccine, from false memes that need debunking, to physicians writing about renewed appreciation and longing for medical victories like the development of the first effective polio vaccine. Hailed as medical miracle, the vaccine was announced 65 years ago yesterday [April 12, 1955].\n\nDr. Jonas Salk, who led the team that developed it, was my father. Today, people often ask me, what he would have thought or done about our current pandemic. My full answer may not be the one they expect.\n\nYes, he certainly would have supported and participated in developing a COVID-19 vaccine. He would have understood the urgency of seeking a vaccine and the grave responsibility to make it safe and effective. And he would have decried the tragic, sometimes preventable loss of life we are witnessing around the world.\n\nBut here’s the surprising part: Even though he’s the historical figure identified with the triumph of medical science, he would have emphasized that there is more to eradicating disease than science alone. It also involves human-to-human social, political and economic relationships.\n\nIf he were here now, he would implore us to remember what made it possible to defeat polio: a national effort to develop and test the vaccine and a world-wide effort to make vaccination available to everyone without profit. Millions donated money and volunteered their children for the largest field trial in public health history. International organizations and governments worked to ensure the entire world could get vaccinated.\n\nMy father would insist on also making COVID-19 screening, treatment and vaccination available to all of us, regardless of where we live or our social or economic standing. He would argue that doing so is not only morally right, but profoundly in our national and global interest. When it comes to infectious disease, health — unlike wealth — can’t be hoarded by the few. As long as a virus is circulating in an unimmunized population, it’s a threat to all, and it’s in all our interests to contain, prevent and eradicate it.\n\nBut he wouldn’t have stopped there. He would have noted what implications the pandemic holds for our long-term future, and he would have connected it to the transformation we need at this juncture in human history if we are to survive.\n\nFrom the 1970s until his death in 1995, he thought deeply about this transformation and how we as a species might adapt successfully to population pressures and the approach of planetary limits. He examined the evidence and concluded we must evolve socially. In nature, evolutionary pressures and natural selection bear on competing individuals, but in the case of humans, we became evolutionarily successful through cooperation. My father believed that our future survival would depend on the values of collective human and planetary well-being becoming the drivers of our social, economic and political lives.\n\nIn his book A New Reality he showed that population growth is slowing and starting to plateau, a unique inflection point in human history that could also prompt a turn in our value system away from competition and independence and towards cooperation and interdependence. In an earlier book, The Survival of the Wisest, he argued that wisdom is the quality that will allow us to adapt and survive in conditions we have never encountered before.\n\nHe would have recognized the COVID-19 pandemic not only as something to be feared and fought, but also as a moment to embrace wisdom. He would have seen this crisis as an opportunity to shift from individualism to interdependence. He would have told us that fighting the pandemic demands replacing the “us first,” win/lose mindset with a “we together,” win/win mindset, and he would have advised that, paradoxically, self-interest in this case is best served by generosity. He would have applauded cooperation and knowledge sharing among scientists and the altruism of medical workers and volunteers. He would have seconded New York’s plea for mutual aid: “Help us now and we’ll help you later.” And he would argue we need to implement that mutuality at every level, from individual relationships to global society.\n\nHe might point out the folly of placing material and economic value ahead of human life, as many of us are doing amid the pandemic. With an eyebrow arched, he might warn of the consequences of ignoring the workings of nature and continuing to pursue boundless growth, competition and selfishness. He would let us know that if we persist in that way, we will be sowing the seeds of more suffering and, ultimately, our extinction.\n\nBut my father was a scientist and an evidence-based thinker. Based on what he knew of evolution, he believed evolutionary pressures would nudge us in the right direction. He would have seen the pandemic as just such a nudge and would have appreciated the irony that a deadly virus, the same thing that prompted the advancement of medical science 65 years ago, might lead us now to advance social evolution toward a healthier, more cooperative, interdependent world where we can not only survive but thrive — if we only listen.\n\nFollow us here and subscribe here for all the latest news on how you can keep Thriving.\n\nStay up to date or catch-up on all our podcasts with Arianna Huffington here.", "opengraph": {"locale": "en_US", "type": "article", "title": "What Jonas Salk Would Have Said About COVID-19 - Thrive Global", "description": "“He would have recognized the COVID-19 pandemic not only as something to be feared and fought, but also as a moment to embrace wisdom.”", "url": "https://community.thriveglobal.com/doctor-jonathan-salk-coronavirus-vaccination-polio-research-current-events/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2020-04-14T20:41:36+00:00", "article:modified_time": "2020-04-14T21:26:24+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2020/04/shutterstock_1679600323.jpg", "image:width": "1000", "image:height": "667", "image:type": "image/jpeg"}, "tags": ["pandemic", "COVID-19", "Health", "vaccines", "syndicated", "coronavirus crisis"], "tweets": [], "movies": [], "links": ["https://www.motherjones.com/coronavirus-updates/2020/03/bovine-coronavirus-vaccine-meme-debunk-facebook/", "https://www.nytimes.com/2020/03/16/well/family/coronavirus-vaccine.html", "https://sph.umich.edu/polio/", "https://thehill.com/person/jonas-salk", "https://www.amazon.com/New-Reality-Evolution-Sustainable-Future/dp/1947951041", "https://www.amazon.com/Survival-Wisest-Jonas-Salk/dp/006013738X", "https://www.thedailybeast.com/andrew-cuomo-pleads-for-help-from-doctors-nurses-across-us-amid-coronavirus-pandemic", "https://thehill.com/opinion/healthcare/492438-what-jonas-salk-would-have-said-about-covid-19", "https://www.facebook.com/thriveglbl/", "https://community.thriveglobal.com/newsletter/?utm_source=Recirc&utm_medium=Thrive", "https://community.thriveglobal.com/categories/thrive-podcasts/?utm_source=Recirc&utm_medium=Thrive"], "authors": ["Jonathan Salk"], "publish_date": "2020-04-14T20:41:36+00:00"}