{"result_id": "315033", "URL": "https://community.thriveglobal.com/how-employers-can-reduce-re-entry-anxiety-in-the-workplace/", "timestamp": "2023-04-25 17:41:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/how-employers-can-reduce-re-entry-anxiety-in-the-workplace/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "How Employers Can Reduce Re-Entry Anxiety In the Workplace", "cleaned_text": "The COVID vaccine is out in full force and the doors to many workplaces throughout our country are swinging open, many for the first time since March of 2020. While some people are looking forward to re-engaging with colleagues and returning to “normal,” that is not the case for everyone.\n\nAs you greet your employees at the office for the first time in over a year, you may discover that many individuals are experiencing reentry anxiety. So what does that mean for you as an employer? How will this new reality affect your business, and how do you plan to assist your team to feel safe and secure?\n\nYour re-opening plan will likely focus on making the physical environment safe and may address mask requirements, sanitization protocols, sick leave, visitor policies, personal protective equipment, and distanced work stations.\n\nHowever, in addition to a physical safety plan, it is critical to acknowledge and address the emotional and psychological impact the pandemic has had, and continues to have on many of your employees.\n\nThe Emotional Well-being of Your Employees Is Crucial\n\nThe trauma of the last twenty months doesn’t magically disappear just because the country has reopened. It is likely that some of your returning employees had a very difficult time.\n\nPerhaps some of them or their family members became very ill with COVID. Maybe they are still suffering with some physical or neurological effects of the virus.\n\nOr quite possibly, they struggled with stress and fatigue as they juggled work, household responsibilities, and home-schooling. And it is almost a given that they, like most of us, experienced isolation and separation from friends and loved ones.\n\nSo, at this point, they may harbor fears about contagion and feel a sense of reluctance and trepidation about stepping into an environment in which they feel no sense of control.\n\nSteps Employers Can Take to Ease Reentry Anxiety\n\nManagers and human resource personnel need to work together to create a safe, supportive physical and emotional climate. There needs to be awareness and sensitivity to employee concerns. And it is best if these efforts are communicated even before staff starts returning to the job.\n• Communicate Care and Concern. Hold some small group meetings or communicate via email to let employees know that their well-being is your top priority and that you place safety above profits. Express your concern for the well-being of employees, customers, and the community, and convey that health and safety is central to any business decisions.\n• Be Transparent. It is critical that your communication be timely and transparent. People appreciate truth and honesty. CEOs and other trusted leaders must be visible and accessible. Employees tend to view the company in a more positive fashion when they are kept in the loop and receive regular updates. They may even look forward to returning to the job if they know what is going on and that there is a reentry plan in motion.\n• Ask For Input. Consider sending out an anonymous survey asking staff about their reentry concerns. This will demonstrate that you care and are listening. Managers and HR need to be open to dialogue and prepared for difficult and emotional conversations.\n• Implement Public Health Measures Quickly. Employees are listening to the news and they tend to trust public health experts on reentry guidelines and CDC recommendations. This may include cleaning and sanitizing, providing personal protective equipment, offering staggered work schedules, and setting a sick leave policy. Employees need to be reassured that any measures are being enforced and that the evolving situation is being monitored.\n• Train Managers and Supervisors on How to Support Employees. Leaders need to learn the signs of emotional distress, the importance of frequent check-ins and to understand helpful ways to talk to staff who are going through a hard time. They should be prepared to lead support forums, or just engage compassionately in one-to-one conversations.\n• Provide Flexibility Whenever Possible. This can include working remotely (a hybrid model), or having the freedom to take breaks throughout the day to step outside. Assure staff that there will be no negative consequences as a result. This sense of control and autonomy can relieve some stress and anxiety.\n• Share Helpful Resources. Circulate tips via email and share resources on counseling, therapy, books, articles and helpful apps on strategies such as meditation and mindfulness. Invite a mental health professional to speak in a staff meeting.\n• Respect Boundaries. Be mindful to not create any additional stress by sending after hours e-mails, delegating excessive workloads, or expecting overtime hours. Try to ease up on productivity standards during this time of transition.\n\nThis is a Challenging Time For Employers\n\nUnfortunately the emotional impact of COVID won’t just disappear overnight. In fact it may be ramping up due to the expectation to return to pre-COVID routines.\n\nAs employers, you are tasked with the challenge of striking the balance between the needs of your business and the emotional well-being of your employees. Please keep in mind that in order for your business to run effectively, you need your employees not only to show up, but to feel safe and have peace of mind so they can function well in their jobs. Mental health should always be a priority and now, more than ever, employers need to relate with patience, kindness and understanding.", "opengraph": {"locale": "en_US", "type": "article", "title": "How Employers Can Reduce Re-Entry Anxiety In the Workplace - Thrive Global", "description": "The COVID vaccine is out in full force and the doors to many workplaces throughout our country are swinging open, many for the first time since March of 2020. While some people are looking forward to re-engaging with colleagues and returning to “normal,” that is not the case for everyone. As you greet your employees … Continued", "url": "https://community.thriveglobal.com/how-employers-can-reduce-re-entry-anxiety-in-the-workplace/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-10-07T11:55:34+00:00", "article:modified_time": "2021-10-07T11:56:47+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/10/How-Employers-Can-Reduce-Re-Entry-Anxiety-in-the-Workplace-Babita-Spinelli-for-Thrive-Global.png", "image:width": "1552", "image:height": "1144", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Babita Spinelli"], "publish_date": "2021-10-07T11:55:34+00:00"}