{"result_id": "315040", "URL": "https://community.thriveglobal.com/arianna-huffington-lifestyle-changes-key-fight-covid-health/", "timestamp": "2023-04-25 17:41:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/arianna-huffington-lifestyle-changes-key-fight-covid-health/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "Why Are We Still Failing to Use a Powerful Tool Against COVID?", "cleaned_text": "On January 20th, 2020, the first known case of COVID-19 was confirmed in the U.S. That means we’re now entering our third year of the pandemic. And throughout this time our public health agencies have been constantly updating, and sometimes even reversing, recommendations. As Zeynep Tufekci writes in The New York Times, messaging continues to be “confusing and zigzagging.” But while there has been much messaging about vaccines, masks, social distancing and other now-familiar aspects of life in the time of COVID, there has been very little messaging on the huge impact that lifestyle factors like sleep, nutrition and movement can have on how vulnerable we are to the virus.\n\nThere’s obviously much that’s out of our control about the pandemic and its impact on our lives. But there are steps beyond getting vaccinated and boosted and wearing masks — critical though these are — that increase our chances of either not contracting COVID or, if we do, of getting through it with a much lower risk of hospitalization and severe illness.\n\nLet’s look at sleep. Not only does getting enough sleep boost our immune system on a continuous basis, sleep also plays a big role in how much protection we get from vaccines. For example, a study by researchers at the University of California, San Francisco looked at the impact sleep has on the response to hepatitis B vaccines. The results were astounding. Those who slept less than an average of six hours were 11.5 times more likely to be unprotected by the vaccine than those who slept an average of seven hours or more. Another study found that those who had slept only four hours in the four nights before receiving the flu vaccine had less than half of the critical antibodies of those who weren’t sleep deprived.\n\nWhile we sleep, the core elements of our immune system wake up and get to work, strengthening what’s called immune memory. As Eric Suni at the Sleep Foundation put it, “The interaction of immune system components during sleep reinforces the immune system’s ability to remember how to recognize and react to dangerous antigens.”\n\nAnd we know that movement and exercise are good for our overall health, but they’re also an important tool against COVID. A recent study in the British Journal of Sports Medicine showed that exercise has a dramatic effect on our body’s ability to fight COVID. After controlling for factors like age, weight and a range of health conditions like high blood pressure and cardiovascular disease, the researchers found that compared to COVID patients who exercised 11 to 149 minutes each week, “consistently inactive” patients were 120% more likely to be hospitalized, 110% more likely to be put in the ICU and 132% more likely to die. The benefits were even greater for those getting 150 or more minutes of movement each week, but even those doing just over 10 minutes a week saw some advantages.\n\nWeight is also a significant risk factor. A report by the World Obesity Foundation found that in countries where the majority of adults are overweight, death rates from COVID were 10 times higher than in countries where less than half of adults are overweight. A study by researchers from the University of North Carolina found that individuals with obesity were 46% more likely to get COVID, 113% more likely to be hospitalized and carried a 48% higher risk of death. Yes, weight loss is difficult, and that’s why Thrive’s behavior change system is all about Microsteps. As study lead author Barry Popkin put it, “any weight loss is a positive at nearly any weight level.”\n\nThen there’s diabetes, which studies show is a considerable COVID risk factor. Right now, over 34 million Americans — roughly 10% of the population — have diabetes. An estimated 90 to 95% of those have Type 2 diabetes. To understand diabetes’ impact on our ability to fight COVID, consider that researchers from the University of Exeter Medical School in the U.K. found that a 40-year-old with Type 2 diabetes carries a mortality risk equivalent to someone 20 years older without diabetes.\n\nAnd yet we know there are steps that can be taken to manage the adverse consequences of Type 2 diabetes. A very outspoken example is the new mayor of New York City, Eric Adams. As he recounts in his 2020 book, Healthy At Last: A Plant-Based Approach to Preventing and Reversing Diabetes and Other Chronic Illnesses, one day in 2016 he woke up unable to see the alarm clock next to his bed. The doctor gave him a prescription for insulin and told him to get used to being on medication. Instead, Adams decided to do some research. “I went to Google and Googled ‘reversing diabetes,’” he says. He found that diet could have a huge impact on his health so he went from living on fast food to a vegan diet. In three months, he had lost 35 pounds, his diabetes was under control and his vision had come back. “I like to say desperation brings us to inspiration,” Adams says.\n\nRight now, as we enter the third desperate year of the pandemic, we need all the inspiration we can get. And that means using all the tools at our disposal to strengthen our defenses. Even before the pandemic, an estimated 90% of our health care spending was going toward the treatment of mental health conditions and stress-related chronic diseases that can be managed and even prevented, like heart disease and diabetes. In the U.S. chronic diseases account for 7 out of 10 deaths. And now we know the science on how lifestyle factors like sleep, movement and nutrition can boost our immunity and generally improve our ability to weather the pandemic.\n\nYes, we still absolutely need people to get vaccinated and boosted. We still need to make rapid testing more accessible. We still need to wear effective masks. But we also need to go upstream and focus on the modifiable factors that we know put us at higher risk not just of COVID, but a whole host of chronic illnesses. As Zeynep Tufekci put it in The New York Times, “it’s so disappointing to enter 2022 with 2020 vibes.” Preparing for the next pandemic, or the next variant, shouldn’t just be about ramping up our supply of ventilators and expediting the process for approving new vaccines and treatments. A vital part of shoring up our public health system is shoring up our personal health system — the small choices we make every day that make a big difference.\n\nSubscribe here for Arianna’s On My Mind Newsletter, where you’ll find inspiration and actionable advice on how to build healthy habits, resilience and connections in our unprecedented times.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Are We Still Failing to Use a Powerful Tool Against COVID? - Thrive Global", "description": "Small lifestyle changes can have a big impact.", "url": "https://community.thriveglobal.com/arianna-huffington-lifestyle-changes-key-fight-covid-health/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2022-01-12T22:39:30+00:00", "article:modified_time": "2022-02-06T04:44:53+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/01/Frame-1-1.png", "image:width": "1024", "image:height": "576", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/museum/timeline/covid19.html#Early-2020", "https://www.nytimes.com/2022/01/05/opinion/omicron-covid-testing-cdc.html", "https://www.ucsf.edu/news/2012/08/98671/sleep-affects-potency-vaccines", "https://pubmed.ncbi.nlm.nih.gov/21632713/", "https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(21)00126-0/fulltext", "https://www.sleepfoundation.org/physical-health/how-sleep-affects-immunity", "https://bjsm.bmj.com/content/55/19/1099", "https://www.webmd.com/lung/news/20210419/more-exercise-lowers-risk-of-severe-covid-19-study", "https://www.health.harvard.edu/blog/does-exercise-help-protect-against-severe-covid-19-202106092475", "https://www.cnn.com/2021/03/04/health/obesity-covid-death-rate-intl/index.html", "https://onlinelibrary.wiley.com/doi/full/10.1111/obr.13128", "https://www.cnn.com/2022/01/03/health/covid-weight-loss-wellness/index.html", "https://www.healio.com/news/endocrinology/20210209/type-2-diabetes-disproportionately-affects-covid19-mortality-risk-in-middleaged-adults", "https://www.amazon.com/Healthy-Last-Plant-Based-Preventing-Reversing/dp/1401960561/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1641498370&sr=8-1", "https://www.eatingwell.com/article/7885018/how-the-brooklyn-borough-president-turned-his-diabetes-around-by-becoming-vegan/", "https://nypost.com/2021/06/01/mayoral-candidate-eric-adams-wants-nyc-to-go-vegan/", "https://www.eatingwell.com/article/7885018/how-the-brooklyn-borough-president-turned-his-diabetes-around-by-becoming-vegan/", "https://www.cdc.gov/chronicdisease/about/costs/index.htm", "https://www.nytimes.com/2022/01/05/opinion/omicron-covid-testing-cdc.html", "https://community.thriveglobal.com/newsletter/?utm_source=Recirc&utm_medium=Thrive"], "authors": ["Arianna Huffington"], "publish_date": "2022-01-12T22:39:30+00:00"}