{"result_id": "315047", "URL": "https://community.thriveglobal.com/researcher-uses-studies-social-media-to-improve-and-extend-lives/", "timestamp": "2023-04-25 17:41:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/researcher-uses-studies-social-media-to-improve-and-extend-lives/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "This researcher is using and studying social media to improve and extend lives", "cleaned_text": "Around the time Dr. Bertha Hidalgo launched her career in genetic epidemiology, Instagram was becoming the cool new social media hangout.\n\nHidalgo thought it’d be a great place for a Hispanic female health care professional to provide practical advice. In addition to her regular posts, she launched a series called “Science Says Sunday” for deeper dives, such as explaining why antibiotics are useless against viral infections.\n\nIn 2019, Hidalgo wanted to take a more scientific look at her use of social media. She sought funding to study how to improve women’s heart health via Facebook, Instagram and Twitter.\n\nTo get ready for the project, Hidalgo went from rarely tweeting to doing it regularly, mainly to get the hang of it and build an audience. Early on, she retweeted news about a strange new virus in China. She continued following the story when few people were interested.\n\nWe all know what happened next with the virus. As for Hidalgo, she blossomed into a trusted authority for COVID-19 facts and a douser of fictions. And, along the way, funding for her social media project came from my organization, the American Heart Association.\n\nStarting the new project didn’t mean stopping her COVID-19 efforts. If anything, Hidalgo’s work on each boosted the other. The happy result was more people getting more information to improve and extend their lives.\n\nShe has proof, too — messages from people crediting her for their decision to get the COVID-19 vaccine and even the flu vaccine. Others wrote that she led them to a heart-healthy diet, to log 10,000 steps per day or to go for routine checkups. There’s even a mid-60s Hispanic woman in Los Angeles who, in just the past year, started doing all those things.\n\nHer name is also Bertha Hidalgo.\n\nYes, she is Dr. Hidalgo’s mother.\n\nAs we continue our American Heart Month focus on women’s heart health, we turn the focus to Dr. Hidalgo and the many lessons we all can learn from her professional and personal experiences over the last two years.\n\nOn Jan. 22, 2020, Hidalgo’s first tweet about the novel coronavirus was akin to a homework assignment. It was another chance to work on translating technical jargon from infectious disease reports into a 280-character message that makes sense to Twitter users.\n\nMonths later, with the country gripped by the pandemic, Hidalgo struggled to comprehend the rapid, drastic ways everything had spun out of control.\n\nScience could explain how it happened with the virus itself. She found the public response more baffling.\n\nHidalgo was especially jarred by the way information was being communicated to the public, particularly online. She thought many well-trained experts were difficult to comprehend, leaving room for many self-proclaimed experts to connect with the masses. And many of those pseudo-scientists played loose with the facts.\n\n“Once we were hit with a tidal wave of misinformation, it became even more important to share what I thought people needed to know, especially what they needed to know to protect themselves,” she said.\n\nSo what started as a routine assignment now felt like a high-stakes final exam.\n\nHidalgo grew up in a Los Angeles suburb that’s close in both miles and makeup to the better-known suburb of Compton.\n\nThe oldest child of a mechanic and a homemaker, she became the first person in her family to graduate high school. She went on to earn a bachelor’s degree at Stanford University, a master’s at the University of Southern California and a Ph.D. from the University of Alabama-Birmingham. She’s been a researcher and associate professor at UAB ever since.\n\nShe’s always called her parents regularly. Once the pandemic began, she called them daily, checking in and offering advice to stay healthy.\n\nWhile her parents had always been proud of her, they didn’t really understand her work. The pandemic helped. Hidalgo laughed as she noted the glee in her parents’ voice when they reported, “What you told us to do, they just said the same thing on the news!”\n\nStill, she wasn’t always sure she was getting through to them. Worse, they asked about many of the same outlandish falsehoods she was swatting away on Twitter.\n\n“I had to explain that sometimes the stories they hear are myths,” she said.\n\nThen came the day when Hidalgo had an interview interrupted by a call from her dad. A younger brother he was very close to had died of COVID-19. So had a cousin with whom he was so close that Dr. Hidalgo considered him another uncle.\n\nNow she had their full attention. Both her parents went on to become vaccinated and boosted, part of what became her mother’s dedication to better health.\n\nIt’s such a cruel irony: An epidemiologist devoted to stamping out misinformation has parents on the verge of falling for those claims and uncles dying possibly because they believed them.\n\nShe shared that frustration with her husband. His response: “If I didn’t have you next to me to ask questions and debunk some of this, I might be susceptible to believing a lot of it, too.”\n\nThat chilling reality of people using social media as a tool against science could’ve prompted Hidalgo to abandon her plan to study advancing heart health via Facebook, Instagram and Twitter.\n\nInstead, it felt more urgent.\n\nOnce Hidalgo received the AHA grant, she eased from posting about COVID-19 to posting about women’s heart health.\n\nShe started by describing the importance of having a healthy heart in general. Then she wrote about the importance of a healthy heart for anyone who catches COVID-19.\n\n“In a very basic way, we walked people through the science of what the heart is and what inflammation is, and what happens when you’re infected with this virus, why they experience certain symptoms and how it can lead to heart damage,” she said.\n\nIt was among her first heart-oriented posts that resonated with her followers.\n\nOther well-received posts are her most personal ones. These include pictures of her getting vaccinated, her kids getting vaccinated and of a reunion with her parents last summer, a visit delayed until she, her husband and their kids were all vaccinated.\n\n“It really spoke to people in terms of how seriously I was taking this pandemic,” she said. “It also showed that I was doing all the things I advocate for and recommend, and that’s important, too.”\n\nAs Hidalgo’s team seeks the best way for posts to cut through the clutter, they evaluate everything from which subjects generate the most interaction to finding the best time of day and day of the week for certain posts.\n\nThey’re also doing A/B testing of prevention-based messages vs. fear-based messages. Within that, they’ll track how each of those styles performs based on who sends it – that is, whether it’s from Hidalgo or one of her colleagues.\n\nEngagement itself comes in different forms. There are views and clicks and there’s “actual engagement, where people view, click and do the things we asked them to do,” she said.\n\nAwareness and education are obvious goals. The potential game-changer involves reaching Black, Hispanic, Indigenous and Asian women. She’s particularly focused on those disproportionately affected by heart disease and stroke, and also historically underrepresented in research.\n\nTo bridge that gap, Hidalgo is using this study to recruit those women to other studies. The early returns, she said, are quite good.\n\nAlso quite good: the feedback from her team.\n\n“Everyone agrees, this is the most fun we’ve had in science in a very long time,” she said.\n\n“I think social media plays a really important role in us moving not only scientific innovation, but also moving the public health needle,” Hidalgo said. “In many ways, this is a community service, and an extension of all my work.”", "opengraph": {"locale": "en_US", "type": "article", "title": "This researcher is using and studying social media to improve and extend lives - Thrive Global", "description": "Dr. Bertha Hidalgo’s project focuses on women, particularly those from historically excluded populations. She’s already made a difference for her mom.", "url": "https://community.thriveglobal.com/researcher-uses-studies-social-media-to-improve-and-extend-lives/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2022-02-22T15:03:00+00:00", "article:modified_time": "2022-03-15T22:19:03+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/02/Bertha-and-parents-e1645480596114.jpg", "image:width": "1439", "image:height": "1252", "image:type": "image/jpeg"}, "tags": ["Bertha Hidalgo", "American Heart Association", "Go Red for Women", "Social Media", "american heart month"], "tweets": [], "movies": [], "links": ["https://community.thriveglobal.com/stories/attention-women-this-researcher-wants-to-save-you-and-help-you-save-others/", "https://www.instagram.com/p/CSFyMcRlCbq/", "https://www.facebook.com/photo/?fbid=3887097154669729&set=pb.100057967094106.-2207520000.."], "authors": ["Nancy Brown"], "publish_date": "2022-02-22T15:03:00+00:00"}