{"result_id": "315030", "URL": "https://community.thriveglobal.com/to-vax-or-not-to-vax-that-is-not-the-question/", "timestamp": "2023-04-25 17:41:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/to-vax-or-not-to-vax-that-is-not-the-question/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "To Vax or Not to Vax, That is NOT the Question", "cleaned_text": "You’ve probably heard about long-term effects from Covid: stroke, heart attack, kidney disease, liver disease, early onset Alzheimer disease and dementia…\n\nWhat you may be surprised to learn: These were already leading causes of death before Covid.\n\nEven more intriguing is the fact that the CDC has also identified some of them as directly causing increased risk of severe Covid-related illness. These include chronic kidney disease and heart disease, in addition to diagnosed diabetes, obesity, fear/anxiety, hypertension, and COPD (chronic obstructive pulmonary disease).\n\nMy interpretation of this data is that we could have prevented the devastation we’re seeing with Covid long before it was even a thing with just a few simple lifestyle changes.\n\nOf course, hindsight is 20/20.\n\nNow, we know how smoking damages health. Smokers make up around 70% of COPD patients, and over half of first-time stroke patients were known to be either current or past smokers in this study. Yet nobody is mandating a ban on cigarettes.\n\nWe also know that over the past year, alcohol use has skyrocketed. Women increased their heavy drinking days by 41% during the pandemic compared to before.\n\nInterestingly, a notable escalation in women’s alcohol use was also documented prior to the pandemic, showing an 85 percent rise in alcohol-related deaths during the years 1999-2017.\n\nAnd while people are using alcohol as a coping mechanism for the stress and trauma they’ve endured over the past 18 months or so, it’s not only damaging their livers. It also, as previously mentioned, directly increases risk of severe Covid outcomes. It’s distracting people from effective stress-reducing actions that help prevent many of these illnesses AND severe Covid outcomes (as well as mental health issues and productivity-related losses). Yet, like smoking, there is no mandate on banning alcohol.\n\nIn fact, there are zero mandates that I’m aware of which support people to proactively take responsibility for their health through the lifestyle changes that are PROVEN to decrease mortality rates from these specific illnesses.\n\nSo why can there be mandated shots from pharmaceutical companies (who, by the way, are currently raking in BILLIONS of dollars in revenue from the Covid vaccine)?\n\nI believe in science. I believe in medical research. I also believe in the innate power each of us has to improve our health… or, alternately, put it at risk. I’m neither choosing nor promoting the divisive “vax or no vax” debate.\n\nI choose to be an active participant in my health and wellbeing.\n\n\n\nI don’t believe my rights to that should be limited because it’s not an ideal that’s accepted or practiced by everyone.\n\nI know that people with these preexisting conditions obviously can’t create drastic changes overnight; they need access to treatments that can help them right now. But I also think that, for some people, the vaccine is the equivalent of putting on a bandaid when what’s really needed is a full-on exploratory and reconstructive surgery.\n\nDo I wish that every single person understood the drastic effects their most basic behaviors have on their health and took action to remediate that? As someone who’s been professionally involved in health and wellness for over 16 years, absolutely!!! \n\n\n\nHowever, should it be my decision that everyone needs to forfeit the vaccine and give up their unhealthy coping mechanisms and disease-causing habits, just like me? \n\nI don’t think so.\n\nThis is the first question we all need to be asking ourselves:\n\n“Should everyone else be required to do things the way I think they should be done?”\n\nHere are some more questions to ponder:\n\n*Why be so concerned with making sure that a billion-dollar-profit-generating shot reaches everyone… but not focus on education about the additional actions and precautions people can take?\n\n*Why not pour that effort and funding into community resources in areas that need it most, instead of trying to force a blanket mandate on people who don’t want it or are lower risk than others?\n\n*Why is the majority of the conversation limited to the ONLY option being a shot (which disempowers people and instills fear, thereby making them higher risk for Covid AND all of these illnesses mentioned above)?\n\n*Why wait until the vaccine was developed, instead of doing outreach and health education from the start?\n\nIt’s easy to look back and dwell on what could have been done differently. However, I don’t believe that finger-pointing by ANYONE is going to get us out of this. That only keeps us stuck in the “us vs them” mindset, and that’s exactly what I’m speaking out against.\n\nInstead of wasting precious time and energy by fighting each other … we could better utilize our resources in other ways. What if we simply changed the question to, “How can we be empowered to make the right choice for ourselves, while also cultivating a culture of caring for the safety of all?”\n\nWhat happens if/when the next supervirus comes along and we don’t have a vaccine? \n\nThe answer: We are back to square one.\n\nAs the Chinese proverb goes, “The best time to plant a tree was 20 years ago – the second best time is now.”\n\nMaybe if we paused long enough to ask more questions instead of being so focused on cramming our own answers down other people’s throats, some positive change and forward movement could be achieved.", "opengraph": {"locale": "en_US", "type": "article", "title": "To Vax or Not to Vax, That is NOT the Question - Thrive Global", "description": "Here’s what we need to be asking instead", "url": "https://community.thriveglobal.com/to-vax-or-not-to-vax-that-is-not-the-question/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2021-09-30T14:28:25+00:00", "article:modified_time": "2021-09-30T17:17:28+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2021/09/To-Vax-or-Not-to-Vax-Thrive-Global-graphic.png", "image:width": "1024", "image:height": "576", "image:type": "image/png"}, "tags": ["stress and mental health", "stress management", "HEALTHY LIFESTYLE", "covid19 mental health", "COVID19 anxiety"], "tweets": [], "movies": [], "links": ["http://Even more intriguing is the fact that the CDC has also identified some of them as directly causing increased risk of severe Covid-related illness. These include chronic kidney disease and heart disease, in addition to diagnosed diabetes, obesity, fear/anxiety, hypertension, and COPD (chronic obstructive pulmonary disease). (www.covid.cdc.gov/covid-data-tracker/#underlying-med-conditions", "https://www.cdc.gov/pcd/issues/2021/21_0123.htm", "https://www.nih.gov/news-events/news-releases/lung-development-may-explain-why-some-non-smokers-get-copd-some-heavy-smokers-do-not", "https://www.ahajournals.org/doi/full/10.1161/JAHA.118.011696", "https://www.rand.org/news/press/2020/09/29.html", "https://onlinelibrary.wiley.com/doi/abs/10.1111/acer.14239", "https://investors.pfizer.com/investor-news/press-release-details/2021/PFIZER-REPORTS-SECOND-QUARTER-2021-RESULTS/default.aspx"], "authors": ["Leah Borski"], "publish_date": "2021-09-30T14:28:25+00:00"}