{"result_id": "315023", "URL": "https://community.thriveglobal.com/arianna-huffington-pfizer-vaccine-development-albert-bourla/", "timestamp": "2023-04-25 17:40:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://community.thriveglobal.com/arianna-huffington-pfizer-vaccine-development-albert-bourla/", "encoding": "utf-8"}, "image": null, "domain": "community.thriveglobal.com", "title": "The Amazing Story Behind the Moonshot of the Pfizer Vaccine", "cleaned_text": "My reading this week consisted of a riveting thriller, a profoundly moving memoir, a fantastic leadership book about business transformation and an inspiring big idea book about what’s possible for the future of humanity. No, I didn’t take the week off for a marathon book-reading staycation — it was all the same book: Moonshot: Inside Pfizer’s Nine-Month Race to Make the Impossible Possible, by Albert Bourla, the CEO of Pfizer. The book is a spellbinding insider account of the against-all-odds race to create a COVID-19 vaccine in under a year — and a serious page turner, even though I already knew the happy ending.\n\nMoonshot is also a deeply personal story about Bourla, and how his unique life experiences led to his being the right man at the right time — something the entire world can be thankful for. And finally, Moonshot is full of lessons about the power of combining purpose with joy: “I am sharing the story of our moonshot,” Bourla writes, “the challenges we faced, the lessons we learned, and the core values that allowed us to make it happen — in hopes that it might inspire and inform your own moonshot, whatever that may be.”\n\nBourla describes the vaccine as the result of “the rare combination of brilliant, cutting-edge science powered by the private sector alongside collaborative engagements with governments.” But what’s clear throughout the book is that Bourla’s leadership of the teams that produced the vaccine was the result of Bourla himself being a rare combination: a man passionately committed to science, and a man who is always able to see the human element — both in the patients receiving Pfizer’s life-changing drugs and in the Pfizer employees tasked with developing them. It’s a professional and personal story, and Moonshot brings the two strands together for a story of a life-saving vaccine made possible against impossible odds.\n\nGiven the sheer number of problems that had to be solved and all the obstacles in the way, it’s hard to believe when we finally make it to December 8th, 2020. That’s the day when 90-year-old Margaret Keenan receives a standing ovation as she gets the first dose of the Pfzier/BioNTech COVID-19 vaccine at England’s Coventry University Hospital — only 269 days after the development of the vaccine began. It might be a miracle, but it wasn’t luck — as Bourla puts it in the title of his preface, “Luck Never Comes to the Unprepared.”\n\nMany things in Bourla’s life prepared him to lead his team to that moment. First there is his relentless optimism, a perspective on life shaped by the experience of his parents. “I am an optimist,” Bourla writes, “perhaps because my mother’s brave and narrow escape from death, minutes after being lined up against a wall in front of a Nazi firing squad during the Holocaust, made me believe that nothing is impossible.” And family continues to play a huge role in his life. He lovingly details the devotion of his wife, Myriam, to making sure their daughter Selise, who has cerebral palsy, is able to lead a thriving life. “Setting bold goals runs in the family,” Bourla writes. And he recounts how, in between important video calls with world leaders and scientists, he would bounce his thoughts off his son, Mois, who was home from college. This allowed Bourla to hear his thoughts out loud, and Mois would add his own “colorful commentary.” And then, at the end of the day, Bourla and his wife would binge-watch “Game of Thrones,” the French series “The Bureau,” or, to the amusement of his children, “Gilmore Girls.”\n\nBourla also made sure Pfizer itself was prepared to take on the moonshot. After joining Pfizer in 1993 and serving in a variety of roles all over the world, Bourla was named CEO in October 2018. “Only in America could a Greek immigrant with a thick accent become CEO of one of the world’s biggest corporations,” he writes. (And as a Greek immigrant with an even thicker accent, I particularly appreciate this!) And Bourla wasted no time transforming the company. Two weeks later, he gathers with 1,000 Pfizer leaders and emerges with this statement of purpose: “We exist because society needs — requires — us to deliver ‘Breakthroughs that change patients’ lives.’” To remind themselves of this, executives hang portraits of patients who have personally inspired them. And to make good on that laser focus on patients’ needs, Bourla makes a series of difficult decisions, including restructuring the company to sell off certain divisions, like the consumer healthcare business, so he could double down on R&D, science and innovation. “As usual in life,” he writes, “the most critical decisions were the most challenging to make.” The move had critics. But, as Bourla replied, “We should not aim to be the biggest. We should aim to be the best.” Little did he know that by focusing on being the best, the company would, in fact, emerge as one of the biggest pharmaceutical companies as well.\n\nThat’s where things stood when the pandemic hit. And that’s where the book takes off. First, he had to make the risky call to go with mRNA technology, which he says was the “most counterintuitive” option. Then there was the matter of time. As Bourla notes, ordinarily, vaccines take years to be developed. And there’s still no vaccine for H.I.V. even after decades of research. But the world didn’t have years. After his team came up with an unprecedentedly aggressive plan, Bourla told them, “it is not good enough. We must have it by this October. And we must have hundreds of millions of doses by next year, not tens of millions.”\n\nAnd so the project dubbed “Lightspeed” — and what Bourla calls the most challenging and rewarding nine months of his life — began, with the Pfizer CEO acting as project manager, identifying and knocking down silos and obstacles as they came up. He encouraged everybody to voice their opinions and feedback, positive or negative, but he would be there to make the decision and keep the process going, because the clock was ticking. To keep them focused, Bourla repurposed the business maxim of “time is money” to “time is life.” It was that sense of urgency, and the team’s awareness of the real, human, life-or-death stakes involved, that Bourla calls the most important factor in their success.\n\nAll the while, Bourla is also careful to emphasize Pfizer’s core cultural value of joy. “We give ourselves to our work, and it also gives to us. We find joy when we take pride, recognize one another, and have fun.” Bourla knows that — counterintuitively, again — joy and high performance actually go together. When the company is suddenly forced to go remote, one of Bourla’s first thoughts is of Luis Perdoma, the barista in their café, whom Bourla calls “the epitome of joy.” The intense pressure took its toll, and by late 2020, Bourla writes that his joy scores — managers are rated by their team on how they’re embodying Pfizer’s core values of courage, excellence, equity and joy — had plummeted. He had lost his temper a few times, and failed to adequately recognize people’s hard work. He reflected on this, and apologized. “Stressful situations test human character, but I should have known better,” he writes. “Humans can learn from their mistakes, and I became determined to not let this happen again.”\n\nAs unlikely as Pfizer’s vaccine success seemed to the general public simply reading the news about it, it’s even more unlikely when you read the inside account. There are so many twists and turns, and decisions that only seem obvious in retrospect. As the clinical trial results approach, the pace of the narrative suspense builds, even when you have the Pfizer vaccine in your body while you’re reading it! One of my favorite stories is when a team member loses WiFi in his house at a pivotal moment and sets off in the middle of the night searching for a signal. He winds up at a closed gas station with a weak signal. A police officer pulls up and asks what he’s doing. When the analyst replies that he is working on the vaccine, the officer stays there to make sure he can work safely and uninterrupted.\n\nAnd then, judgment day arrives. The leadership team is assembled to find out the results of the clinical trials. General Counsel Doug Lankler is so nervous he feels like he might vomit. “We waited and waited,” Bourla writes. “After a few long minutes, I joked that this torture was retribution for all of the pressure I’d put on this team over the long weeks and months of testing.” Some on the team guessed the efficacy rate would be 70%. Bourla thought anything over 60% would be a good result. Then the verdict comes: “95.6 percent.”\n\nLater that night, Bourla, sitting in silence in his favorite chair, begins to cry tears of joy, as he thinks of the journey of his parents and his family’s ancestors, who were forced to flee from Spain in the 15th century along with the rest of the Spanish Sephardic Jewish community. He reflects on the long journey of his family, from Spain to Greece, with his parents narrowly surviving the German occupation and the Holocaust. “I wished they were with me that evening to share in the triumph that the world would learn of the next morning and my role in it, which would not have been possible without their bravery,” he writes.\n\nOf course, the story was far from over. Still looming was the not-small matter of production and distribution of a vaccine — one as “fragile as a snowflake” — that had to be stored and shipped at -94 degrees. It’s as if the sequel to an action movie began just as the credits were rolling from the first one. “Discovering the vaccine in record time felt like a miracle,” Bourla writes. “The second miracle would be our ability to quickly manufacture and distribute it at such scale.” And so begins what Bourla describes as “a series of smaller, strategic moonshots.” It required “swarms of engineers,” a lot of cash and the leadership of a man who became known as “the Ice Man, James Jean.” And on day 269, the first shot went in the first arm.\n\nBut that’s not the end of the story, or the book. What good are breakthroughs if millions of people can’t have access to them? “Equity,” Bourla writes, “doesn’t mean that we give everyone the same. Equity means that we give more to those who need more.” Bourla goes on to recount the efforts, led by Angela Hwang, Pfizer’s BioPharmaceutical Group President, to work with governments around the world to make the new vaccine more widely available.\n\nThe book is certainly an ode to science. But what’s even more powerful is its insistence that science be coupled with humanity, so that scientific innovation can maximize human benefit. “Science Will Win” became the mantra at Pfizer over those nine crucial months. “I look forward,” Bourla writes, “to the day when schoolchildren are as familiar with the names and faces of our leading scientists as they are with celebrities and sports stars.”\n\nIn the last chapter of the book, Bourla lays out his “Pro-Patient, Pro-Innovation Agenda.” This includes improving access, accelerating digital transformation, using the experience of the vaccine to speed up development times of future drugs and applying the new science of mRNA and other innovations for prevention and early detection of other diseases, like cardiovascular disease and cancer, which, combined, kill 27 million people a year. But, as Bourla writes, it’s also important to empower patients to become “citizen-scientists” and take more control over their health. For example, Bourla writes about how new digital technologies, by giving continuous real-time physiological feedback, can become the equivalent of a “check engine light.”\n\nHappily for us all, Bourla closes the book by writing that everyone at Pfizer now is energized to pursue moonshots of their own, in whatever particular area of health they are working on. “We dream of a future when a host of diseases will someday soon become preventable or treatable,” Bourla writes. “All of us share an impatience, especially now that we know what’s possible.” So the vaccine is not just a moonshot itself, but an inspiration to expand our idea of what’s possible in all of medicine and health care, to not accept the status quo and to bring a sense of urgency to finding more solutions for more diseases. This book is a stirring reminder of what can be achieved when we heed Aristotle’s admonition that Bourla cites in the third chapter: “Our problem is not that we aim too high and miss, but we aim too low and hit.”\n\nYou can order a copy of Moonshot: Inside Pfizer’s Nine-Month Race to Make the Impossible Possible here.\n\nSubscribe here for Arianna’s On My Mind Newsletter, where you’ll find inspiration and actionable advice on how to build healthy habits, resilience and connections in our unprecedented times.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Amazing Story Behind the Moonshot of the Pfizer Vaccine - Thrive Global", "description": "Albert Bourla’s riveting inside account shows the power of science combined with visionary leadership.", "url": "https://community.thriveglobal.com/arianna-huffington-pfizer-vaccine-development-albert-bourla/", "site_name": "Thrive Global", "article:publisher": "https://www.facebook.com/thriveglbl", "article:published_time": "2022-03-05T19:00:00+00:00", "article:modified_time": "2022-03-29T19:53:16+00:00", "image": "https://community.thriveglobal.com/wp-content/uploads/2022/03/AH-Bourla.jpg", "image:width": "1024", "image:height": "768", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Moonshot-Pfizers-Nine-Month-Impossible-Possible/dp/0063210797/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr=", "https://smile.amazon.com/Moonshot-Pfizers-Nine-Month-Impossible-Possible/dp/0063210797/", "https://community.thriveglobal.com/newsletter/?utm_source=Recirc&utm_medium=Thrive"], "authors": ["Arianna Huffington"], "publish_date": "2022-03-05T19:00:00+00:00"}