{"result_id": "316034", "URL": "http://farmwars.thrivemovement.com/crop-circles-messages-fields.blog", "timestamp": "2023-04-25 17:42:24 CEST+0200", "meta": {"description": "Dive deeper into the crop circle phenomenon and the implications for new energy technology and the future of our own conscious evolution.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/crop-circles-messages-fields.blog", "encoding": "utf-8"}, "image": null, "domain": "farmwars.thrivemovement.com", "title": "Crop Circles — Messages in the Fields", "cleaned_text": "Thousands of extraordinary geometric patterns have appeared in crop fields in more than 50 countries throughout the world. The crops are not cut or broken, but are laid flat, sometimes six inches above the ground, and swirled into a precise and exquisite pattern. These astonishing formations are referred to as crop circles.\n\nThere has been a lot of controversy about the origin of these designs. While some crop circles are created by pranksters to undermine the possibility of a non-human source, most crop formations are actually done in a way that defies current earthly science or technology. Laboratory studies have indicated that the nodes of some of the stalks get blasted out on one side, which can only be replicated by highly localized microwave heating. There are often anomalous electromagnetic effects and magnetic particles found as well…something hoaxers with planks would have trouble accomplishing.\n\nEvery controversial leading-edge issue has its debunkers, and crop circles are no exception. Kimberly and I read volumes of UFO analysis, watched documentaries from varying perspectives, interviewed witnesses from the Disclosure Project and other insiders and experts in the field in the course of making our film THRIVE. We both came away convinced that many of these astonishing crop patterns are indeed created by beings not originating here on Earth, and that they are not only awe-inspiring in their beauty, but also seem to include messages with profound cosmological implications.\n\nOne clip in THRIVE includes a visual collage of some of the patterns to help give a sense of the magnitude and sophistication of these circles, and to inspire others to consider the implications. As described in THRIVE, we believe the suppression of the UFO phenomena—including the official denial of non-human made crop circles—goes hand in hand with the suppression of revolutionary new energy technologies that threaten to undercut the trillion-dollar profits still to be made from the current fossil fuel and nuclear based economy.\n\nHow are off-world beings getting here? Clearly they’re not dependent on fossil fuels, which means there is a way to obsolete that technology and the economy built on it.\n\nWhen you combine the evidence of these crop designs with all the high level testimony from the Disclosure Project, increasing evidence of a “Secret Space Program” with very advanced covert technology, and a century of testimony on the suppression of “over-unity” energy, a powerful case for the existence and visitation of extra terrestrial life forms unfolds. (Over-unity means it generates more energy than it takes to run the device.)\n\nHere is the visual effects sequence from THRIVE:\n\nOften there are reports of balls of lights seen and supposedly even filmed over fields where circles then appear.\n\nOne research scientist, Nancy Talbott, from BLT Research Team, Inc. has been directly involved with the scientific discovery and documentation of various abnormalities in crop circle plants and soils.\n\nWe invited Nancy to share her experience in this blog:\n\n“I’ve seen two crop circles form right in front of my face—both in Holland, the first in 2001 and then again in 2006—the first involving three incredibly brilliant light-tubes, the second with no unusual light display at all. “But perhaps most important is my long experience with Robbert van den Broeke, the only person yet known who is apparently in direct contact with the circle-making ‘energies’ and who, therefore, often knows not only when new circles in his area are forming, but specifically where. Robbert has been able to do this since he was 15 years old (he’s now 34). He and I have worked together since 1997, when I began spending weeks in Holland each summer with him, witnessing an amazing range of truly bizarre events in his company (in addition to the crop circles) and then writing up what I’d witnessed to inform the public about his case and its critical significance to the circle phenomenon overall. “Foster told me he was particularly intrigued by a 2014 formation that appeared the night of June 25–26th, just after midnight near the village of Standdaarbuiten. Robbert, as usual, ‘felt’ it was coming and this time also drew a sketch of what it would look like before he and the fieldworker Roy drove off to the fields to find it. The ‘lay’ details in this formation are truly astounding. My English-language report & photos are posted on a colleague’s website.\n\nWhen Robbert felt the familiar energy that gathers before a crop circle appears, Ms. Talbott asked if he could draw what it was going to look like. This is what he drew…\n\nThen, when the next pattern appeared, this is what it looked like!\n\nAs Nancy Talbott noted, Robbert has been having contact with off-planet or inter-dimensional beings since childhood, and it has been documented for decades by his own parents.\n\nWilliam Gazecki has shared a ten-minute excerpt from his new, work-in-progress documentary film on the experiences of Robbert van den Broeke and his family, with science specialist Nancy Talbott. In this never-before-seen excerpt (rough-cut) from , see Robbert van den Broeke’s family share their phenomenal experiences. This is the only time they have ever appeared together on-camera, in support of verifying what has been a family affair for decades.\n\nLiterally millions of people have reported sightings and contact with a range of unidentified flying objects and beings who appear to be from others planets. It’s likely to be an extremely under-reported phenomena because of the social stigma and potential risk of dangerous antagonism and suppression. Nonetheless, even if you were to speculate that just a small percentage of the reported cases are unexplainable by humanity’s current scientific understanding of time and space, wouldn’t that be enough to intrigue you to consider what is really going on? And to learn from those who have been studying the phenomena for decades?\n\nHow do you think they are getting here? What does that imply about the limitations of our current understanding of space and time?\n\nWhat might be the purpose behind all of these thousands of crop designs?\n\nHere are some sites and films for further investigation. Check them out and then share your thoughts with us and others!\n• Arguments Against the Hoax Theory of Crop Circles", "opengraph": {"type": "cause", "site_name": "Crop Circles — Messages in the Fields | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/281/original/image0.png", "title": "Crop Circles — Messages in the Fields", "url": "http://www.thrivemovement.com/crop-circles-messages-fields.blog", "description": "Dive deeper into the crop circle phenomenon and the implications for new energy technology and the future of our own conscious evolution."}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/E-odAVYR6Sc?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/E-odAVYR6Sc?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe width=\"480\" height=\"360\" src=\"//www.youtube.com/embed/pk8CDYw04VY?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/pk8CDYw04VY?rel=0"}], "links": ["http://davidpratt.info/cropcirc1.htm", "http://www.disclosureproject.org/", "http://www.thrivemovement.com/the_movie", "http://www.thrivemovement.com/the_movie", "http://www.disclosureproject.org/", "http://www.secretspaceprogram.org/", "http://www.bltresearch.com", "http://www.bltresearch.com/eyewitness/eyewitness1.php", "http://www.bltresearch.com/eyewitness/eyewitness4.php", "http://www.bltresearch.com/robbert.php", "http://cropcirclesresearchfoundation.org/seeing-through-your-heart-chakra-a-new-and-beautiful-holland-crop-circle/", "http://www.robbertvandenbroeke.nl/graancirkelarchief", "https://youtu.be/JOBVMgbV_Bc", "http://www.cropcircleconnector.com/2014/2014.html", "https://www.amazon.com/dp/149529160X/?tag=thrive07-20", "http://johnemackinstitute.org/", "http://www.greatdreams.com/crop/hoax/hoax.htm", "http://www.pattygreer.com/crop-circles", "http://www.cropcirclesthemovie.com/", "https://vimeo.com/5873097", "http://www.disclose.tv/action/viewvideo/92827/Crop_Circles___Crossover_From_Another_Dimension/", "https://youtu.be/7hP1u913Oi8", "http://www.cropcirclemovie.com", "http://www.temporarytemples.co.uk/imagelibrary/", "http://www.lucypringle.co.uk/photos/"], "authors": [], "publish_date": null}