{"result_id": "316026", "URL": "http://extension.thrivemovement.com/farmer-wins-case-stop-mandatory-drug-testing-west-texas", "timestamp": "2023-04-25 17:42:10 CEST+0200", "meta": {"description": "THRIVE: What on Earth Will It Take? Now available to watch for FREE in 20+ languages! An unconventional documentary that lifts the veil on what’s REALLY going on in our world.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://extension.thrivemovement.com/farmer-wins-case-stop-mandatory-drug-testing-west-texas", "encoding": "utf-8"}, "image": null, "domain": "extension.thrivemovement.com", "title": "Farmer Wins Case to Stop Mandatory Drug-Testing in West Texas | Thrive", "cleaned_text": "Larry Tannahill, a third generation cotton farmer in West Texas, unexpectedly became an activist when he refused to sign a consent form for his son to receive mandatory drug tests at his high school. His actions came with repercussions from the school district: his son Brady was treated as if he had failed the drug test and was therefore given in-school suspension, drug counseling, and removal from extra-curricular activities.\n\nTannahill then joined forces with the ACLU and filed suit against the district. He pushed all the way through the Federal District Court bringing national media attention to the issue. He ultimately won the case forcing Lockney Independent School District to drop its mandatory drug-testing policy. Tannahill's strength and perseverance is documented in the movie \"Larry v. Lockney\" and represents a huge success for individuals who want to have a choice in taking drug tests, receiving vaccines, and similar forced treatments.", "opengraph": {"title": "Farmer Wins Case to Stop Mandatory Drug-Testing in West Texas | Thrive", "type": "cause", "url": "http://extension.thrivemovement.com/farmer-wins-case-stop-mandatory-drug-testing-west-texas", "image": "http://www.thrivemovement.com/images/poster_thumbnail.jpg", "site_name": "Farmer Wins Case to Stop Mandatory Drug-Testing in West Texas | Thrive"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}