{"result_id": "316020", "URL": "http://www.thrivemovement.com/fly-behind-closed-doors-revolution-bilderberg", "timestamp": "2023-04-25 17:42:00 CEST+0200", "meta": {"description": "FLY Behind Closed Doors — Revolution at the #Bilderberg", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/fly-behind-closed-doors-revolution-bilderberg", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "FLY BEHIND CLOSED DOORS — Revolution at the Bilderberg", "cleaned_text": "Strangest dream! I dreamt I was a fly on the wall in the main auditorium hall of the annual Bilderberg meeting.\n\nI heard someone yelling and turned to the stage where an ancient-looking, paunchy, white man with red-rimmed eyes and a snarl was scolding the participants.\n\n“I don’t know how many times I have to repeat it. We can’t control this many people. We have to get rid of most of the useless eaters and it’s not happening fast enough. You each have power and responsibility in this, so what the hell have you been doing this last year?”\n\nA CEO from a chemical company stood to defend himself, saying, “We control over 80% of what they eat already, and we have laced it with GMOs, hormones, aspartame, and pesticides. Our MSG combines elegantly with all the High Fructose Corn Syrup they consume to create cancers and heart disease and diabetes at an unprecedented rate.”\n\nThe President of a pharmaceutical conglomerate chimed in, “We’ve got over half of the adults in our country on at least one prescription drug and now we have almost as many of the kids as well. The anti-depressants are hooking them when they get convinced that strong feelings aren’t OK, and the pushers are selling pain killers and mood pills almost as fast as the pharmacies. When someone loses it entirely and goes on a killing rampage, that’s helping convince folks they should turn in their guns to the government. We’re succeeding in making vaccines mandatory, and are on the verge of being able to just inject everyone with the toxins and heavy metals that we have been dropping from the sky and infusing in their water — the ones that dumb them down, weaken their resistance and shorten their lives.”\n\nA notorious minister of education rose to speak. “Now that state-sponsored education is mandatory, we are doing everything we can to teach the history we want them to believe. They memorize but don’t ask or challenge much. Their heroes are the military, political and banking elite. They believe in the goodness of the nation state as their rulers and even the students of journalism all want to go into PR. They mostly want to work for the multi-nationals because that’s where the money is and even the elite private school students want to go to Wall St. or head up a big corporation or foundation…, again because we’ve made sure that’s where the money is.”\n\nA four star general snapped to attention and boomed, “Hey, we’re still knockin’ em off in the desert, over a million in Iraq alone and we’re back in there. Profits are still rising after we got Hamas and ISIS to follow in Al Qaeda’s boot steps. We’re doing everything we can to get into Iran and Syria, while convincing the world that China and Russia are the bad guys. We just need more money and it’ll all work out the way we planned.”\n\nA prominent former Western head of state adjusted his tie and lapel pin to represent the politicians. “Hey, we got you the Patriot Act, the NDAA, the Military Commissions Act, and the Natural Resources Defense Act. That’s total power over every system, resource, citizen and enforcement agency. Now with fast-tracking passed by the Senate, we are ready to go with the TPP, TTIP and Agenda 21, we are handing almost complete global authority over to you bankers and CEOs. The BRICS alliance is a nuisance, but at least we are keeping most reports of them and their power out of the mainstream news.”\n\nThe original boss at the podium glared at them all. “OK, so you are telling me you’ve got the masses sick, poor, in debt, afraid, medicated and duped. How come we still can’t get rid of most of them and control the rest? For all your bragging, we seem to be losing. We’re getting exposed, even arrested and forbidden to travel in some cases. We are becoming the laughing stock with all our banks and governments hundreds of trillions in the red. Our gold has mostly disappeared and they aren’t buying the notion of just letting us print money any more. We’ve got to get rid of cash and commodity-backed transactions immediately! Our own soldiers are on the verge of revolt in unprecedented ways. They’re starting to think they’re the ‘White Hats’ and we’re some kind of delusional psychopaths! This is unacceptable!”\n\nWith this outburst, he slouched and started to cough and had to sit down. But then I saw that men and women all over the ballroom were swooning and reeling. The MC ended the program abruptly and people helped each other out of the room to return to their suites.\n\nAs a fly on the wall, all of this definitely had my attention, so I flew down and snacked on some leftovers at one of the tables and then camped out behind a light fixture for the night.\n\nWhen the doors opened for the next day’s presentations over breakfast, I was stunned to see people dragging in looking tired, ill and disoriented. The first speaker, some Queen from Europe, could barely stand and her voice was weak. “Something is wrong, ladies and gentlemen. I don’t feel very well. And apparently many of you don’t as well.”\n\nAt that moment, one of the armed guards walked up onto the stage and bent the microphone toward himself. “Yes, indeed, people, there is something very wrong. And the problem is people who act like YOU.” A hush came over the auditorium and the Queen grabbed the mic, yelling, “Guards, get rid of this man.”\n\nThe guards around the room remained motionless. “Don’t bother, ma’am, they’re all with me. Everyone in uniform, in fact, is here to give you a message.” As the participants looked around the room, guards were standing in front of every exit. “We have heard you refer to the ‘X Factor’ — some mythical force you don’t seem to be able to defeat, no matter how much money, deception and force you throw at it. It’s actually not that esoteric. It’s the life force — which includes the truth, morality, empathy and love. It’s good people everywhere. You can think of us as emissaries of the X Team.”\n\nOne of the waitresses put down her tray and walked up the steps to the stage. She stepped to the mic and said, “On behalf of the kitchen and wait staff, I want to let you know that the food and beverages you consumed the last several days were all the trash that you have all been inflicting on innocent people worldwide. You were drinking fracking water, enhanced with coal slurry and fluoride accented with various of your unethically approved pharmaceuticals. We were generous with the aspartame, MSG, syrups and coloring we added to your anti-biotic, pesticide and hormone-infused main courses along with their sides of GMO starches. Is it any wonder you are feeling the effects? Your exposure has been minimal, relatively speaking, and you will be relieved to know that today you are being served the organic vegetables and fruits that will begin to restore your health.”\n\nTwo of the limo drivers in dark suits and caps approached the podium. One was setting up a laptop and projector. The curtains parted at the back of the stage and in a moment one of them had started a presentation. “While your oil, gas and coal companies are fouling our atmosphere and raining asthma on our kids, while you send our children to risk their lives as your soldiers to destroy other cultures and steal their resources — all under the guise of ‘National Security,’ here is what you keep secret from the people!” He proceeded to show footage from laboratories around the world pulling electricity from the air, generating it with magnets, boiling water almost instantaneously with copper coils in beautiful geometric configurations.\n\nA maid joined the crew at the mic, saying, “My husband, my daughter and many of my friends have died of cancer while you have bullied, threatened or killed many inventors who had developed real cures.” The screen showed numerous doctors and researchers with a flood of before and after X-rays showing the disappearance of various tumors and diseased cells.\n\nA waiter stepped to the front and looked over the participants. “Our children will go to the schools of their choice — or assemble their own education. They will not be squashed into your molds. They will be able to celebrate their curiosity, creativity and natural collaboration. They will learn real history, authentic science, useful skills and real philosophy rather than be propagandized into becoming mere robotic consumers or cogs in the banking-government-military-industrial corporatocracy. They will be nurtured in recognizing, honoring and restoring the wholeness of natural systems — from energy to agriculture, from media to economics and justice.”\n\nOne of the janitors from the hotel chimed in, “We have been instructed not to look you in the eyes — not to say or ask anything unless spoken to by you. Well, there’s not enough you could pay us or threaten us to keep us quiet any longer. While you were stealing our hard earned wages around the world through inflation, bailouts, fraud, fiat counterfeit, fake trade agreements, taxation, rigged markets and outright theft, we watched you building your walled cities, co-opting the military and intelligence agencies to protect you. We have had enough. See the sprinklers in the ceilings? Behind them are sophisticated spy cameras like the ones you use on everyone, but this time they have been aimed at you. We and our allies in other hotels have been patiently recording the proceedings of these meetings for years and the highlights are beginning to stream around the global Internet as I speak to you. The truth will always have its day…and today is that day. We do not come to hurt you, as you have done to so many. But justice calls for reconciliation and restitution.”\n\nThe concierge of the hotel was the last one to approach the podium. “We have many special guests here today. They have been watching this morning’s proceedings on monitors in the lobby. They were invited here as a surprise for your final day’s celebration and now they will join us.” The guards opened doors around the ballroom and people of all ages started flowing in. It became apparent that they were spouses, siblings, children and grandchildren of the members of the Bilderberg group.\n\n“Today, finally, titles and money don’t matter. Starting now, the primary currency is changing from power, force and deception to trust, virtue and character. Your New World Order will not be the totalitarian pyramid of global coercion you have envisioned, but one based on merit and caring, on authenticity and freedom for every single being on the planet — as long as they do no harm. There are healthy solutions rising in every sector. The X Factor is everywhere. There is no leader. There is no regime or capital. Just the shared principles of integrity, non-aggression and self-ownership.\n\n“Please gather your belongings and vacate the premises,” he continued. “This meeting is over, and a new way of life is beginning for humanity and this planet, our home. You will be regaining your strength over the next several weeks. Hopefully you will appreciate it, for you are going to need it to make amends with the rest of your life. ‘Bilderberg’ is supposed to mean ‘a community of builders.’ Let’s get started on that. You will be held personally accountable for what you have done and also for what you do from this day forward. Perhaps you can share with your children on your way home what you are going to be doing to set all of this right. We will be in touch. The whole world is watching.”\n\nI could hardly believe what I had just witnessed. Oh, man, I’m thinking… did this all really happen? The details all seemed so real…\n\nBut hey, what do I know? I’m just a fly on the wall in some old guy’s dream.", "opengraph": {"type": "cause", "site_name": "FLY BEHIND CLOSED DOORS — Revolution at the Bilderberg | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/452/original/Bilderberg_Group.jpg", "title": "FLY BEHIND CLOSED DOORS — Revolution at the Bilderberg", "url": "http://www.thrivemovement.com/fly-behind-closed-doors-revolution-bilderberg", "description": "What would it be like to be a fly on the wall at the Bilderberg Group? And what would happen if members of this secret conference were given a taste of their own medicine?"}, "tags": [], "tweets": [], "movies": [], "links": ["http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/454/original/fly-on-the-wall.png", "http://www.bilderbergmeetings.org/participants.html"], "authors": [], "publish_date": null}