{"result_id": "316029", "URL": "http://www.thrivemovement.com/empowering-your-health-beyond-monsanto-rockefeller-and-american-medical-association.blog", "timestamp": "2023-04-25 17:42:14 CEST+0200", "meta": {"description": "Are you aware Pfizer, the same pharmaceutical company that owns Monsanto, is one of the super-lobbying, agenda-driven corporations that fund the American Medical Association? We shine a light on the connection between your health care, the AMA and the pharmaceutical and agribusiness corporations who finance it.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/empowering-your-health-beyond-monsanto-rockefeller-and-american-medical-association.blog", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Empowering Your Health: Beyond Monsanto, Rockefeller and the American Medical Association", "cleaned_text": "When your doctor tells you your prescription is approved by the American Medical Association (AMA), it’s intended to give you confidence. But what it really means is that the drug or procedure is endorsed and funded by the same corporations that endorse and fund Genetically Modified Organisms (GMOs) and other products that are harmful to your health. In fact, the AMA is in part financed by Pfizer, which owns Monsanto , the company that manufactured controversial and proven-to-be-dangerous products such as the insecticide DDT Agent Orange , and recombinant bovine somatotropin (a.k.a. bovine growth hormone) and is now the largest manufacturer of genetically modified seeds and the herbicide glyphosate, which GMO’s require. This is only one of the insidious connections between the AMA and corporations that cause, and prosper from, your ill health.\n\nFounded in 1847, the American Medical Association is the largest association of physicians and medical students in the United States. Its stated mission includes “…lobbying for legislation favorable to physicians and patients, and to raise money for medical education.”\n\nThe AMA spends big money on lobbying. One of the AMA’s top lobbying firms, the McManus Group, also lobbies for PhRMA, Eli Lilly & Co, Merck and Pfizer. According to OpenSecrets.org, the American Medical Association comes in second in overall money spent on lobbying in the last 10 years with over $264 million. The health industry as a whole trumps all other industries including energy and finance in lobbying expenditure.\n\nThe AMA looks to legitimize its agenda through its Journal of the American Medical Association, JAMA, which is the most widely circulated medical journal in the world. JAMA receives major funding through its advertisers, many of which are pharmaceuticals. In addition, the American Medical Association has been accepting money from the Rockefeller and Carnegie Foundations from as early as 1910. In World Without Cancer, G. Edward Griffin makes the argument that the Rockefeller and Carnegie Foundations began to support the AMA in an effort to control the medical schooling establishment and to gain power over this “large and vital sphere of American life.”\n\nThe editor of JAMA is very influential, and has historically played a significant role in suppressing alternative health treatments. Morris Fishbein, editor of JAMA from 1924–1950, was directly engaged in suppressing Royal Rife’s cancer cure. In 1849, homeopathy was nearly as popular as allopathic medical practices. The AMA was able to use its position to squash what it referred to as “quackery” — stating that the public did not know what was good for it and that the medical establishment must have total control. At that point it called for control over all medical regulations and licenses. These regulations eventually lead to closing down of schools and almost complete suppression of the practice. Even today in America homeopathic practices are mostly “underground.”\n\nThis is essentially the same story as that which played out with chiropractors. 12,000 chiropractors were arrested in the first half of the twentieth century simply for helping patients with only their hands. A pivotal point in this war, an antitrust case, Wilk v. the AMA, occurred when court testimony revealed the AMA’s final solution for the “chiropractic menace” to be the “complete elimination of the chiropractic profession.” They called chiropractors “rabid dogs”, “killers”, an “unscientific cult”, and “a danger to public safety”. When taken to task in court, the AMA could not provide one witness to prove these accusations; it was purely propaganda. But the role of the AMA in determining what qualifies as sanctioned medical practice was established nonetheless. It is noteworthy, especially for those who discredit conspiracy theories, that the AMA was convicted of conspiracy for its attack on chiropractic.\n\nIt was around the turn of the century that the AMA, the Rockefeller Foundation, and the Carnegie Foundation forged their partnership. They put their money into drug-based research and made that the main focus of “healthcare”—a move that turned “healthcare” into “sickness management.” The Rockefellers and other prominent banking elite have been able to control and profit enormously from the drug industry.\n\nNow, all medical doctors in the USA are trained in medical schools that are run and/or accredited/sanctioned by the AMA. Of 129 medical schools in America, only 22 require even what amounts to basic rudimentary courses in nutrition. Medical students are not trained to see the connections between many degenerative diseases and malnutrition. Instead they are taught only how to treat with surgical or pharmaceutical methods but do not cure or alleviate the root problem or ailment. In this way, they are assured of life-long customers. Surveys conclude that nearly half of all Americans regularly take prescription drugs. In 2013, the World Health Organization ranked the U.S. #37 in healthcare despite spending $8,608 on each person annually.\n\nWhat Can We Do?\n\nWe are whole and integrated beings and therefore require whole-system, integrated health care solutions.\n• Get educated and take responsibility for your own health.\n• Ask your own health care providers to disclose the source of their information regarding their prescription choices and knowledge updates, if they know who funds the research they are relying on, and ask if they have any interactions with drug companies whose products they prescribe.\n• Create small community-based health clinics, including home visits for individual patients as well as health education and promotion for whole communities.\n• Encourage more whole-system education throughout all schools.\n• Make Complimentary and Alternative Medicine (CAM) part of mainstream curriculum — not as something to be learned in addition to medical training, but rather as a valid body of knowledge to be integrated at all levels.\n• Create a campaign to make integrative medicine a mandatory part of curriculum in U.S. medical schools through the American Commission for Graduate Medical Education (ACGME) and the Liaison Committee for Medical Education (LCME).\n• Support naturopathic medical colleges in the U.S. with enrollment and funding.\n• Lobby to make alternative therapies accessible to everyone. Currently most alternative therapies in the U.S. are not covered by health insurance and alternative treatments are rarely accessed by low-income individuals. Fabulous work on this is being done by Dean Ornish. Follow and support his work.\n• Educate yourself and bring awareness of new energy technologies and health devices based on Rife and other current inventors work out into the open. If you have financial resources, help support their development and dissemination.\n\nAs people are waking up, Monsanto has been removed and banned by Austria, Bulgaria, Germany, Greece, Hungary, Ireland, Japan, Luxembourg, Madeira, New Zealand, Peru, South Australia, Russia, France, and Switzerland. Monsanto is currently the target of effective resistance in the US as well. This same organizing can happen with pharmaceuticals, as we gain an understanding of the connection between them and the agribusiness companies and the medical establishment.\n\nNext time someone says “It’s approved by the AMA”, ask them if they understand what that really means, and share this information.\n\nSee Thrive’s 3-Stage Solutions Strategy for the Health Sector.\n• Our Corrupt Politics: It’s Not All Money — The New York Review of Books\n• True history: The AMA (American Medical Association) was built on racketeering and the pocketing of ‘non-profit’ profits — Natural News\n• The Medical War against Chiropractors: The Untold Story from Persecution to Vindication — Dr. JC Smith\n• The FDA, the AMA, and the Pharmaceutical Companies Are the Problem with Health Care in America — Gary Wade, Physicist\n• Monsanto Has Been Removed And Banned By: Austria, Bulgaria, Germany, Greece, Hungary, Ireland, Japan, Luxembourg, Madeira, New Zealand, Peru, South Australia, Russia, France, and Switzerland! — Political Vel Craft\n• Americans Fed up with Drug Industry Influence and FDA Corruption — American Chinese Medicine Association\n• None A Return to Healing: Radical Health Care Reform and the Future of Medicine by Len Saputo, MD with Byron Belitsos\n• None World Without Cancer: The Story of Vitamin B by G. Edward Griffin\n• None The Unhealthy Truth: One Mother’s Shocking Investigation into the Dangers of America’s Food Supply—and What Every Family Can Do to Protect Itself by Robyn O’Brien with Rachel Kranz\n• None The Hundred-Year Lie: How to Protect Yourself from the Chemicals That Are Destroying Your Health by Randall Fitzgerald\n• 33 Conspiracy Theories That Turned Out To Be True, What Every Person Should Know… — Infowars.com\n• The AMA Conspiracy Against Chiropractic — Your Medical Detective", "opengraph": {"type": "cause", "site_name": "Empowering Your Health: Beyond Monsanto, Rockefeller and the American Medical Association | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/197/original/21743113_m.jpg", "title": "Empowering Your Health: Beyond Monsanto, Rockefeller and the American Medical Association", "url": "http://www.thrivemovement.com/empowering-your-health-beyond-monsanto-rockefeller-and-american-medical-association.blog", "description": "Are you aware Pfizer, the same pharmaceutical company that owns Monsanto, is one of the super-lobbying, agenda-driven corporations that fund the American Medical Association? We shine a light on the connection between your health care, the AMA and the pha"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Polychlorinated_biphenyl", "http://earthjustice.org/features/ourwork/timeline-monsanto-s-chemical-romance", "https://en.wikipedia.org/wiki/DDT", "https://en.wikipedia.org/wiki/Agent_Orange", "https://en.wikipedia.org/wiki/Recombinant_DNA", "https://en.wikipedia.org/wiki/Bovine_somatotropin", "http://politicalcorrection.org/factcheck/200906110008", "http://www.nybooks.com/articles/archives/2012/mar/22/our-corrupt-politics-its-not-all-money/", "http://www.sntp.net/fda/piper_griffin.htm", "http://www.sntp.net/fda/piper_griffin.htm", "http://www.thrivemovement.com/american-medical-association-largely-funded-rockefellers", "http://www.thrivemovement.com/fact_checks", "http://www.thrivemovement.com/the_12_sectors-health#critical_issues/1049", "https://www.lewrockwell.com/1970/01/lew-rockwell/medical-control-medical-corruption/", "http://www.medicalwaragainstchiropractors.com/", "http://www.yourmedicaldetective.com/public/237.cfm", "http://www.thrivemovement.com/drug-rx-money-making-killing", "http://www.rifeenergymedicine.com/FDA.html", "http://www.anh-usa.org/main-menu/anh-campaigns/", "http://www.pmri.org/dean_ornish.html", "http://politicalvelcraft.org/2013/03/23/monsanto-has-been-removed-and-banned-by-austria-bulgaria-germany-greece-hungary-ireland-japan-luxembourg-madeira-new-zealand-peru-south-australia-russia-france-and-switzerland/", "http://www.thrivemovement.com/the_12_sectors-health#solutions", "http://politicalcorrection.org/factcheck/200906110008", "http://www.nybooks.com/articles/archives/2012/mar/22/our-corrupt-politics-its-not-all-money/", "http://www.thrivemovement.com/american-medical-association-largely-funded-rockefellers", "http://www.naturalnews.com/037152_ama_racketeering_history.html", "https://www.lewrockwell.com/1970/01/lew-rockwell/medical-control-medical-corruption/", "http://www.medicalwaragainstchiropractors.com", "http://www.rifeenergymedicine.com/FDA.html", "http://compmed.com/inspiration/harvard-med-students-demand-change/", "http://www.thrivemovement.com/the_12_sectors-health#solutions", "http://earthjustice.org/features/ourwork/timeline-monsanto-s-chemical-romance", "http://politicalvelcraft.org/2013/03/23/monsanto-has-been-removed-and-banned-by-austria-bulgaria-germany-greece-hungary-ireland-japan-luxembourg-madeira-new-zealand-peru-south-australia-russia-france-and-switzerland/", "http://www.americanchinesemedicineassociation.org/Americans%20Fed%20up%20with%20Drug%20Industry%20Influence%20and%20FDA%20Corruption.htm", "/amazon-affiliate-disclosure", "https://www.amazon.com/dp/1579831028/?tag=thrive07-20", "https://www.amazon.com/dp/0912986190/?tag=thrive07-20", "https://www.amazon.com/dp/0972966528/?tag=thrive07-20", "https://www.amazon.com/dp/0767930746/?tag=thrive07-20", "https://www.amazon.com/dp/0452288398/?tag=thrive07-20", "http://www.infowars.com/33-conspiracy-theories-that-turned-out-to-be-true-what-every-person-should-know/", "http://www.yourmedicaldetective.com/public/237.cfm", "http://www.anh-usa.org/main-menu/anh-campaigns/", "http://www.pmri.org/dean_ornish.html"], "authors": [], "publish_date": null}