{"result_id": "316023", "URL": "http://www.thrivemovement.com/murdered-holistic-doctors-update", "timestamp": "2023-04-25 17:42:05 CEST+0200", "meta": {"description": "Are these deaths linked and could there be a larger agenda at hand?  #GcMAF", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/murdered-holistic-doctors-update", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Murdered Holistic Doctors Update", "cleaned_text": "Six weeks ago I shared critical information with you about 13 holistic doctors that had recently been reported missing or dead.\n\nSince my notification, the number has risen to 33. There’s a covert war being waged against breakthrough healers and exposing it is the first step in stopping it.\n\nErin Elizabeth, Dr. Joseph Mercola along with Thomas & Candace Bradstreet (brother and sister-in-law of murdered doctor Jeffrey Bradstreet) joined us in the ThriveTogether Think Tank recently to dive deeper into what these murdered holistic doctors knew, the links between them, and what we can do about it.\n\nTake a look at these highlights from the event:\n\nRead a transcript of the audio (to translate the transcript, choose your language at the top of this page)\n\nFoster: So Erin, why don’t you go ahead and bring us up to speed? If you could give us an overview and just highlight a few of the representative cases to give us a sense, the personal stories, of what’s going on and some of the themes that are involved that are emerging in common to these individual tragedies.\n\nErin Elizabeth: Well, it really did start with Dr. Jeff Bradstreet, a medical doctor who was found dead on June 19th of last year. That’s nine months ago. I think we might have a picture of him here. This photo is important even though it’s a little blurry because that’s him on the right, but tat was his colleague, who lived here locally, like a bike ride away from where I am right now. Here’s another photo of him. But that first photo that they had is with Paige Adams and she was the only one (I kind of included her in the series), she’s the only on who is not a doctor of some sort, whether M.D. or D.O.B.C., but she’s a Board Certified Nurse Practitioner, young, and also found dead, again, here in our local community here in Florida maybe ten days ago or so.\n\nThen, within 48 hours on Father’s Day, Bruce Hedendal, here in Florida, was found dead in his car. As you can see here, he was probably the oldest out of all the doctors, but he was in amazing shape. He had been at an event that day and I’ve spoken to loved-ones of his that are very close to him. I don’t know if it was an actual competition where they were doing the disc throwing or if it was a practice, but he was in great health. Not only was he a chiropractor, but had a PhD from Harvard in Nutrition and also I have patients writing all the time that say they go in with this-stage or that-stage cancer and he was able to put them into remission.\n\nFoster: That is not the look of somebody who doesn’t want to live.\n\nErin: We also had Dr. Nick Gonzalez, who was well-loved and another doctor, Abdul Karim, both found dead on the same day, both on the East Coast. Dr. Gonzalez was a best-selling author. Dr. Mercola had interviewed him numerous times. He was also helping patients, like the two others, with cancer. We did not attend the funeral in New York City, but the church was packed. They say even Suzanne Somers said this in a video that she did with people that had had stage 4 pancreatic cancer and were going to die and now, 20 years later, they’re like, “Here I am, thanks to Dr. Gonzalez.” In his very last interview, which is now on YouTube (Joe and I didn’t do it, but someone else did), he did say that he had heard that they wanted him dead.\n\nAnd these are more pictures of doctors found dead, many under mysterious circumstances. We have the one in the corner, who allegedly fell off a balcony at his house. He was a vegan cardiologist, outspoken in holistic practices as well. With a total, it would be 33 others; some in mysterious car accidents who even the authorities say don’t add up. These are all holistic doctors. I think every one of those doctors there were holistic doctors. I think every one of them would have been within the last year.\n\nFoster: The best I can tell, many of them were working with the autistic vaccine connection, some with cannabis oil, some with the GcMAF enzyme that seems to really boost the immune system against cancer. So, it seems to me if you had to boil it down, they were doing an effective job at both helping patients and getting the word out on alternatives that might be very effective and well might undermine the sickness business in one way or another, which most people know is a multi-trillion dollar business.\n\nErin: Yes, because of the platforms many of them had — big platforms. Not only were they writing about it, talking about it, Dr. Bradstreet and others did TV shows on vaccinations.\n\nFoster: Thank you for that update and thank you for bringing this story to light. What I’d like to do is take just a few minutes to share a little bit of an overview of my research. I’ve been researching assassinations, unfortunately, for over a decade, so it gives me the opportunity to look at the themes that are in common to a bunch of them. Let me just say how some of my research relates to what it is that you’re sharing.\n\nFirst of all, George Bernard Shaw is known for saying, amongst many other things, assassination is the extreme form of censorship. In going from this micro-scenario to the macro and looking at other sectors, there were in the early 2000s, in the first three or four years after the millennium, there were over 30 microbiologists who were found dead under suspicious circumstances. These were many people who were working on different bio-warfare things, on anthrax and so forth, and fundamentally, they were people who were in-the-know on what the shadow government, what the agencies, what the secret societies were doing, ironically enough, developing ways of killing other people who might get in the way of their agendas.\n\nThere have been a lot of rumors about suspicious things that have happened surrounding the Clintons for the last 20 to 30 years, from Mine, Arkansas CIA drug-smuggling to the whole Whitewater scandal, and then on into Bill’s administration and a lot of Hillary’s activities with Benghazi and so forth. I had originally heard 33 and I went back to check and now it’s between 60 and 70 suspicious deaths surrounding them, the only one of which most people know is Vince Foster, whose pictured on the left there.\n\nLet me just mention some other areas so that you can see the theme here. There have been, as many of you know, over the last year or two, many suspicious deaths of bankers. There have been over 70 of them. Many of them worked in the risk management level of these big banks and they had a lot of inside information on the rigging of the gold market, the forex market, the Libor interest rate market, and so forth. Again, when the top people don’t want investigations to be able to follow the money and the power chain all the way up to them, their strategy is often to take out the middleman.\n\nErin did an article recently on journalists who have been killed. There have been over 2,000 cited in that article. Many people have probably heard of the car-jacking, or car-hacking really, of Michael Hastings, who was instrumental in bringing down General Stanley McChrystal. He had been harassed by FBI agents just like Jeff Bradstreet was, literally, the day before. They say he supposedly crashed his car, but anybody who is in-the-know on these things knows that they can take over and hack those cars and there was evidence of explosives in the car.\n\nAndrew Breitbart, who was coming out with a story on Obama just before the election, was killed. Gary Webb, the famous journalist from the San Jose Mercury, was exposing the CIA drug smuggling and then was found shot twice in the head. This one, it would make you laugh if it weren’t so tragic. Who has the wherewithal to shoot themselves the second time in the head.\n\nThen, in the area of energy inventors, which cuts close to home for us. I’ve been involved in this field for 15 years and as we reported in THRIVE, the movie, Eugene Mallove was suspiciously beaten to death the day before he was going on Coast To Coast with David Wilcock to talk about new breakthroughs in cold fusion. Stanley Meyer disappeared after he went public with his automobile engine that ran on water. Several acquaintances of ours, Adam Trombly and his partner, Farnsworth, and John Bedini and Paul Pantone. Pantone died recently, but he was literally kidnapped, institutionalized, and basically drugged almost to death because he was also coming out with a water engine.\n\nIt goes on into voter fraud, election rigging. There have been at least seven clear assassination attempts having to do with the ChoicePoint, Diebold, and True Vote companies.\n\nThere are a rash of assassinations around the whistleblowers on the international pedophilia rings at the high levels of the judiciary, of the police, and of top level government people.\n\nUnfortunately, I could go on and on with this, but my point is to make the pattern clear that there are very powerful would-be controllers who don’t want the truth coming out.\n\nJoseph Mercola: I think it’s also important to recognize first of all that these events are occurring so to be aware that it’s a possibility and the result is to take reasonable precautions — lock your house, make sure you have a security system, and just be alert. If you focus on this and become paranoid or obsessive about it, it’s really going to distract from your own question, so I think just to be sensible.\n\nFoster: I think that we can learn from this, as you both are saying, to take it seriously and one of the challenges that Goa and Kimberly and I have in working with a lot of the breakthrough innovators in our ThriveConnect network is getting them to take the security seriously enough to have protection, have a security system, have body guards in critical situations that are apt to be risky. I totally agree that it can be paralyzing to live in fear, but the best way I find not to live in fear is be true to your mission and then at the same time, address whatever concerns you have in a practical manner.\n\nI think it can also be a reminder to us to stick together. Get to know one another and collaborate. Share resources, share security advice, and then collaborate to optimize the chances of success and, particularly, share strategies. There are a whole spectrum of strategies for getting these things safely out and it runs from tradition venture capital on one end all the way to open source, just be compensated by someone (if possible) to just dump the knowledge on the Internet because then you’re no longer the sole keeper of the knowledge and then, there’s no purpose in taking you out. It actually brings attention to your breakthrough.\n\nKimberly: Absolutely, not living in fear is where it’s at and I find that the more informed I am, the better choices I can make. For me, in terms of fear, it was to realize that I believe we’re in times where not speaking out is equally dangerous. I think we become a little more targeted potentially by being spokespeople, but the reason that we’re spokespeople is because everyone is at serious risk. Part of it is that courage is a heart-based experience, both the base of the language cor, which is latin for “heart”, and I think that it just feels so good to be grounded in my heart and to find there the courage to move forward in alignment with my purpose and my passions.\n\nThomas Bradstreet: We can’t live in fear. We can’t create this paranoia. We have to empower ourselves at our level or our sphere of influence. We need to get out there and talk more and share this. I had Andrew Wakefield, who’s a doctor that’s involved in autism, tell me that if you share everything and keep it right out in front of you, you have nothing to worry about. No longer are you valuable because you’re information is out there. It really makes sense. Then, you work yourself back and wonder, “why is this information being withheld from me?”, and “you really don’t want me to get well”, and then you start to change the way you think about things and now you can move forward and you can start to really become an educated decision-maker in your own health, in your own security, and your family.\n\nCandace Bradstreet: When you learn the truth about what is really going on with our health, it just makes you angry, but it also inspires you to be the change and to be a positive change for people.\n\nFoster: That is so beautifully said. It’s certainly true for us and so many people in our network that tragedies like this have only strengthened our resolve to expose these corrupt culprits and to get the truth out and get these healing cures out as well.\n\nOn any of these areas, what we’ve found, the first thing is always to get informed and as you get more informed, share with others, even if it’s socially uncomfortable. Pick your timing, but share it with people you think are ready and capable to understand and integrate the information and then use the media, try to use whatever access we have to the media. Send people to movies and to TV shows — documentaries like Joe’s “The Game Changer”, like the documentary “Grounded”, “Bought” and “The Marketing of Madness”, “The Truth About Cancer” — movies like that that are exposing a lot of the scams and the truth about pharmaceuticals and disease.\n\nI also want to highly recommend financial support. If any of you out there are wondering how you can help and you have financial resources, offer them through Erin’s site or through what’s called the IHCPO, which is a Native American, indigenous health care practitioners organization that can take in funds to help get private investigators to find out the truth, to help with the families that have been affected by assassinations like this.\n\nKimberly: I think there’s a way to use all this bad news (I know there is because it’s what I do and have been doing all these years) to use it to help inform my strategic solution thinking. It’s like, “Alright, if the whole patent process is corrupt, what can we do to create something that isn’t patent-dependent to get it out there?” That’s just one of many examples, but I think that open source is going to be a huge player on this because I think engaging people is a way that we really take advantage of the group mind and get safe at the same time. Fortunately, there are alternative systems coming up all over the place now, everything from moving money to communicating more effectively. Certainly understanding surveillance helps inform the kind of encryption technologies that are needed and how we an actually be communicating safely with one another.\n\nThomas Bradstreet: My brother really believed that we could cure major diseases like cancer and all the rest, diabetes and all those, and a lot of it has to do with managing of production of nagalase in your body. I think that is a huge thing that, when it comes to the battle of cancer, that’s kind of the secret.\n\nErin: Dr. Bradstreet was working with GcMAF and finding out that nagalase inhibits GcMAF, which is naturally occurring in all of our bodies, and what Dr. Bradstreet found was that using that with these autism patients that had high levels of nagalase (you can do a blood test to test it and some feel that’s from the vaccines), he was able to us the GcMAF to bring those nagalase levels down.\n\nFoster: We know several people who are investigating this now to find out whether or not there has actually been nagalase covertly put into vaccines to lower our immune systems and, so far, the results that I’m hearing about are kind of chilling, but it’s premature to reveal those yet.\n\nThe number one priority in martial arts is getting an accurate assessment of your reality, so that informed a lot of my research for THRIVE and other things. We need to face what’s really going on and when you look to see what’s been going on and what’s being created, it’s like a gauntlet for us to try to move through on a daily basis with GMOs, with vaccines, with aspertame, MSG, chemtrails, pesticides. The agendas that have come out where the CDC has been busted over 30 times intentionally putting sterilants into vaccines in Third World populations (particularly with dark skin), theres no denying that there’s an agenda there to depopulate.\n\nThe people like the Bradstreets and the Gonzalez’s, and Hedendals and so forth all over the world — and Mercolas and Elizabeths and so forth — are actually bringing out the awareness that will help have a thriving population. The answer to me is unleashing the creativity of the Mercolas and Bradstreets and Dr. Sams of the world in health, and then, the free energy inventors, then, the media people, the Austrian economists, who have actually proven the value and helpfulness of the true free market. In every sector where Kimberly and I have been exploring where we see these dire issues and patterns of assassination, we also see real cures for restoring the wholeness of natural systems everywhere we look, so it’s really a matter of getting educated enough and then collaborating well enough amongst those who are awake to it to allow a condition of freedom and creativity where all of this stuff can come out and we’re not buying into and supporting these authoritarian regimes anymore that don’t have the individual’s best interest in mind.", "opengraph": {"type": "cause", "site_name": "Murdered Holistic Doctors Update | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/601/original/Screen_Shot_2016-02-26_at_5.28.03_PM.png", "title": "Murdered Holistic Doctors Update", "url": "http://www.thrivemovement.com/murdered-holistic-doctors-update", "description": "What did these murdered holistic doctors know? What were the links between them, and what we can do about it?"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}