{"result_id": "316040", "URL": "https://ww7.thrivemovement.com/focusing-your-action-1", "timestamp": "2023-04-25 17:42:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "https://ww7.thrivemovement.com/focusing-your-action-1", "encoding": "utf-8"}, "image": null, "domain": "ww7.thrivemovement.com", "title": "Focusing Your Action | Article", "cleaned_text": "A key distinction that emerged for us in the THRIVE project is the identification of 3 main categories of activism.\n\nPeople are often drawn toward a particular type of engagement that suits their own personality, skills and current life situation. Engaging our natural styles helps us to be most effective, impassioned and sustainable in our response to the crises of our times. It’s vital to know you don’t have to do it all. There are hundreds of millions of committed individuals working hard for a better world.\n\nExplore your purpose, consider your current style, and be part of the solution in a way that feels most personally meaningful and effective.\n\n1) Some people prefer direct intervention with an immediate need.\n\n2) Some are drawn to systemic change.\n\n3) And still others prefer to address the consciousness shift that’s needed to create a world that works for everyone.\n\nWe suggest combining this personal assessment with your choice of which Sector or Topic you feel most skilled at and/or drawn to, and beginning to focus your actions at that intersection.\n\nIf your interest and expertise is in the area of Environment and your natural level of engagement is systemic change, you could work in your region or at the national level with an organization that is working to ban pesticides or GMO contamination.\n\nIf your interest is or expertise is Health, and shifting consciousness, you could be writing articles or creating YouTube videos that expose the dangers of mandatory vaccines and promote holistic awareness of our mind/body connection.", "opengraph": {"type": "cause", "site_name": "Focusing Your Action | Article", "title": "Focusing Your Action | Article", "url": "http://www.thrivemovement.com/focusing-your-action-1"}, "tags": [], "tweets": [], "movies": [], "links": ["../../../solutions-wcid-article?tags=wcid-exploring-your-purpose,wcid-support"], "authors": [], "publish_date": null}