{"result_id": "316043", "URL": "https://www.thrivemovement.com/finding-our-way-invitation.blog", "timestamp": "2023-04-25 17:42:47 CEST+0200", "meta": {"description": "The motivation to vaccinate is born out of the most powerful impulse I know — to protect and care for our children. So the question is will vaccination protect your child from a deadly illness? Clearly many children seem to do fine after they are vaccinated and many illnesses no longer pose the threat they once did. However, it’s also true that vaccines are known to illicit a variety of negative responses, from fever related seizures [1], to regressive forms of autism [2] and even instant death (as in this case from India in 2010). [3]", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "https://www.thrivemovement.com/finding-our-way-invitation.blog", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Vaccinating Our Children | Thrive", "cleaned_text": "ow do I decide what to believe about vaccinations and make a decision about vaccinating my child that could have horrible consequences if I make the wrong choice?\n\nThe motivation to vaccinate is born out of the most powerful impulse I know — to protect and care for our children. So the question is will vaccination protect your child from a deadly illness? Clearly many children seem to do fine after they are vaccinated and many illnesses no longer pose the threat they once did. However, it’s also true that vaccines are known to elicit a variety of negative responses, from fever related seizures [1], to regressive forms of autism [2] and even instant death (as in this case from India in 2010). [3]\n\nI believe the most important part of this process is to let the natural fear about making the wrong choice motivate our actions to get informed and take the procedure seriously. Integrating our critical thinking with our feelings allows for the best possible application of both. Here are some of the questions I would ask:\n\nWhat are all the ingredients in the vaccine? What company manufactures it? Who funds the testing of it? What complaints have people made? What is the status of the disease and how deadly is it?\n\nI’d organize a group of concerned parents and divide up the research and report back to each other with our findings — including indentifying doctors who take the concern seriously and who entertain the controversy as a part of their commitment to staying informed. I’d have us research how to get a doctor to isolate the vaccines from one another, so we could choose one without the whole series. I’d see which manufacturers would disclose all the ingredients, and especially verify the lack of mercury and squalene. I’d get those of us who want to avoid the vaccinations to organize a critical mass action to prevent the schools from requiring it and if parents want to choose their children’s schools and activities based on who has been vaccinated then they can.\n\nI don’t know the right answer, I am not even sure there is one. I believe there is the best answer for you, all things considered, and that only you can know what that is. I do feel that the process of getting informed, sharing what you learn with others and ultimately relying on your own inner guidance will pave the way for the mothers and fathers of the next generation to have a range of options that currently don’t exist and for you and your children to know that you are truly doing the best you possibly can. And that’s the best there is.\n\n[1] Scott Hensely. \"Fever-Related Seizures Prompt Look at Flu Vaccine for Kids.\" NPR, 2011: http://www.npr.org/blogs/health/2011/01/21/133109029/fever-related-seizures-prompt-look-at-flu-vaccine-for-kids", "opengraph": {"type": "cause", "site_name": "Vaccinating Our Children | Thrive", "image": "http://www.thrivemovement.com/images/poster_thumbnail.jpg", "title": "Vaccinating Our Children | Thrive", "url": "http://www.thrivemovement.com/finding-our-way-invitation.blog"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.npr.org/blogs/health/2011/01/21/133109029/fever-related-seizures-prompt-look-at-flu-vaccine-for-kids", "http://www.medicinenet.com/script/main/art.asp?articlekey=51546", "http://www.themedguru.com/20100822/newsfeature/4-babies-die-after-vaccination-lucknow-86139779.html"], "authors": [], "publish_date": null}