{"result_id": "316031", "URL": "http://zums.thrivemovement.com/two-lenses-through-which-view-role-science", "timestamp": "2023-04-25 17:42:18 CEST+0200", "meta": {"description": "THRIVE: What on Earth Will It Take? Now available to watch for FREE in 20+ languages! An unconventional documentary that lifts the veil on what’s REALLY going on in our world.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://zums.thrivemovement.com/two-lenses-through-which-view-role-science", "encoding": "utf-8"}, "image": null, "domain": "zums.thrivemovement.com", "title": "Two Lenses Through Which to View the Role of Science | Thrive", "cleaned_text": "When I was a child, I was drawn to cowboy shows on TV. I identified most with the scout – the guy who would ride off to find a way over the mountains - safe passage ahead - and then come back to report to the wagon train.\n\nTHRIVE and this website are a major part of my report back on what I found. I was privileged with a lot of time in my life to climb the mountain, to see the view from a more inclusive perspective, and to find some possible ways through the dangers we face.\n\nIn THRIVE, I describe the visionary experience that started my pre-occupation with the quest for a fundamental energy pattern.\n\nWhen I had that experience, I was 14 years old and riding on a school bus. My physics teacher happened to be on the same bus, and to his credit, when I walked up to his seat in a state of awe and told him what I had just experienced, he said, “What an amazing notion...keep going with that and let me know what you come up with.” Little did I know I would spend the rest of my life in that quest. His name was Richard Mellersh and he was the most influential teacher I ever had in school. The main thing I remember from him was that he insisted that we not believe anything until we checked it our for ourselves, and even then to realize that any scientific theory was just a “model” of reality that would eventually be replaced by one more accurate.\n\nIn the realm of Science, which became a life-long passion for me, I want to suggest two lenses to see if they give a more coherent understanding of our attempts to realize the core principles by which nature operates and then, hopefully, explore some more useful approaches as to how we can apply those understandings to create a condition on Earth where all can thrive.\n\nThe lenses I want to offer, which you will recognize from the film, THRIVE, are:\n\n1) the Torus, the fundamental energy pattern of the Universe\n\n2) the Global Domination Agenda, the plan of the would-be ruling elite to control the lives of everyone on Earth. (see GDA Topic)\n\nSo first the Torus. (For an in-depth explanation see the Fundamental Patterning topic)\n\nThe torus is a doughnut-shaped whirlpool vortex that is “the only manner by which self-sustained motion can exist in a given medium.” (Arthur Young, the Reflexive Universe, p. xxi) That means that it is the only form in all of nature where the flow of energy through it is continuously sustained, which allows it to keep its shape at any scale.\n\nThat is a huge statement, given that lack of sustainability is at the core of just about all of our human problems and we are a species on the verge of self-destruction as a result. The torus is the form that sustains creation from the micro to the macro – from subatomic particles through galactic clusters and beyond.\n\nIt is the shape of the electro-magnetic field of an atom, a seed, a human, a planet, a solar system, a galaxy and, it’s now being reported, the Universe itself. (http://en.wikipedia.org/wiki/Shape_of_the_Universe)\n\nSo what if we looked at all scales of Science with that in mind...\n\n...and then used what we found as a blueprint for creating systems that work and thrive?\n\nSo starting small, let’s look at physics through the torus lens.\n\nphys·ics - the science that deals with matter, energy, motion, and force. (Dictionary.com)\n\nWhat I have found to be a useful model, is that “Matter is a function of motion in a field of energy.” The primary pattern of motion is the torus vortex and what part of it we are looking at determines what so-called “force” is identified - like the proverbial elephant being touched in different places by the blind men, where the tail, the ear and the leg all feel different, but if you could stand back you would see they are all parts of an elephant.\n\nIf we stand back from the distinctions we call electricity, magnetism, gravity and the strong and weak nuclear forces, I suggest we simply see different parts of the torus. I believe what we call electricity is the rotation around the center, magnetism (at a right angle to the flow of electricity) is the push into one end of the torus and the pull out the other, and gravity is the sum total of those pulls. Nassim Haramein has created a paradigm-altering scientific paper showing that the weak and strong forces, which were postulated to explain what keeps positively charged protons in the nucleus from flying off, are not needed if we realize there is a black hole at the center of each atom.\n\nHaramein was ridiculed by traditional physicists when he suggested as early as 1991 that every galaxy was centered by a black hole. Now measurements have been done on the 40 closest galaxies and all are apparently centered by black holes. Haramein calls them black (W)holes and says every torus system from atoms to galactic clusters rotates around one – just of different sizes. Nassim had not had the mathematical background to do the calculations testing this hypothesis, so I introduced him to black hole and particle physicist, Dr. Elizabeth Rauscher. She worked with him for several years and they authored a series of papers that lay out a very compelling case for the torus as the shape of the fundamental patterning at all scales.\n\nSee http://theresonanceproject.org/research/scientific for Nassim's papers, The Schwarzchild Proton and Scale Unification, among others.\n\nAt the next scale up from Physics, we see the toroidal vortices combine into ATOMS,\n\n...which make up life as we know it. And each plant, seed, tree, animal and human are also toroidal, both physically (a torus is defined as “ a continuous surface with a hole in it.” Cut open a stem, an orange...imagine the skin of an animal with its digestive system running through it.) as well as energetically – the electro/magnetic field around each organism, like that around a magnet.\n\nAt the human level, in addition to the biology, the tori get less obvious, less “material.” But no less real. The wheels of the energy centers that yogis call “chakras,” the fields surrounding the heart and brain as identified by the Heartmath Institute, and the more subtle toroidal energy “bodies” which surround us, which mystics refer to with terms like emotional, mental, astral, etheric and causal.\n\nWhen we keep expanding our perception and conception to the scales of solar systems, galaxies, galactic clusters and universes, the pattern is still toroidal.\n\nAnd then when our scale becomes boundless, and we consider the workings of all of creation in a limitless universe, it is called Cosmology.\n\n1. the branch of philosophy dealing with the origin and general structure of the universe, with its parts, elements, and laws, and especially with such of its characteristics as space, time, causality, and freedom.\n\n2. the branch of astronomy that deals with the general structure and evolution of the universe.\n\nThe most advanced and accurate “model” I’ve come across for the process of evolution of consciousness is provided by philosopher, mathematician, and inventor of the Bell Helicopter, Arthur M. Young.\n\nHis research revealed a repetitive octave of unfoldment at every level of known existence.\n\nHis “Theory of Process” recognized 7 fundamental postulates that guide the process:\n\nYoung developed a 2-dimensional grid and arc to depict the pattern of evolution.\n\nHere is a short video that touches on these charts.\n\nFor more, see the poster and videos at: www.arthuryoung.com\n\nVerification for the fundamental nature of the torus emerged as I studied other researchers as well. The most influential were Walter Russell,\n\nand Nassim Haramein. An interesting common denominator of this group is that they are all what I term “Visionary” scientist inventors – by which I mean that they were all rigorous logicians and theoreticians, but they were all profoundly influenced by visionary experiences and they all tested out what they had been shown or what they theorized by doing physical inventions.\n\nThey also all were working at the intersection of the torus and structural geometry – most often with the Vector Equilibrium.\n\nRussell created a device for Westinghouse that transmuted some elements – one of the goals of ancient alchemists.\n\nYoung created the Bell helicopter with two counter-rotating props, like the flow of a torus. Fuller was one of the most prolific inventors of the 20th century, innovating cars, houses, universal joints and of course his renowned domes. Haramein’s work with toroidal energy devices is still emerging.\n\nPhysicist John Wheeler was one of those who pointed out that, when you do the calculations, the very space around us is not empty, as in a “vacuum”, but FULL – a “plenum” of virtually infinite energy at every point!\n\nOne of the most important themes I have come across is that successful “New Energy” (also know as “radiant”, “zero point”, or “Free” Energy) inventors that I have checked out all seem to be mimicking in some central way, the dynamic of the torus flow. Inventors who used to try to access the universal flow with closed systems, spheres or boxes, would find their devices tended to freeze or fry. They couldn’t stabilize the energy flow unless the device could flow energy smoothly through...and that is what the torus shape allows. In this new paradigm of energy access, the key is timing and harmonic resonance with the fundamental patterns of sustainable nature instead of crashing things together and trying to control the explosions as we have with internal combustion and nuclear fission. This is an example of “Biomimicry” – learning from the brilliant engineering innovations throughout nature to build sustainable human systems.\n\nIf the so-called “forces” are the different aspects of the toroidal dynamic, it seems that where consciousness fits in is especially at the still center, the singularity, the zero point of every toroidal system. The centers are not only connected, they are ONE! Even traditional physicists are starting to warm to the idea that all is connected, especially since their own Big Bang Theory has everything in existence emerging from a single infinitesimally small point. In the same way that the hollow tube extends from the center point of a seed throughout the system of stems, branches, leaves, filaments, flowers, fruits and next seeds (7 stages), each being seems to be connected through the center of our being as well as that of every atom in our bodies, to a cosmic consciousness that has purpose, knows how to heal, is growing in its capacity to love and becoming ever more aware of itself.\n\nIn the history of physics, even up to the present day, it has been vehemently discouraged to even mention the “C” word (consciousness) in academic discussion. That is finally beginning to change. Pioneers like Duane Elgin, Elisabet Sahtouris, Ashok Gangadean and others are pointing out that, as consciousness precedes matter, the entire universe is alive and consciousness pervades everything we identify – just at different frequencies and capabilities. When Physicist John Wheeler finally retired in his late 80s he devoted the rest of his life to studying the effects of consciousness in creating what we experience as reality. http://discovermagazine.com/2002/jun/featuniverse\n\nWhat a relief that must have been. My hope is that the rest of us won’t have to wait so long...\n\nThe torus fits the criteria for being a “quantum.” As a vortex in a medium, it is distinct, yet unified with all others. It only exists as a wholeness, because, as a vortex, it does not sustain unless the torus is complete. It is becoming clear that the search for the fundamental patterning which holds true at all scales is successful whereas there is no basic building block, because every “thing” is made up of others within it, and there are no ultimately solid and indivisible “things.”\n\nIt’s often joked in the Physics world that the new paradigm emerges “one funeral at a time.” It’s understandable that if your education, your writings, your experiments, your tenure, and your income are all based on a particular set of beliefs, that it might be challenging to let them change. I have been in the room with PhDs literally throwing fits as well as objects as their worldview seems threatened. I have observed that, in an uncertain, infinite, fractal, holographic universe like what we seem to inhabit, the emerging realizations are easier to integrate for those who have had some sort of meditative, near-death or other type of mind-transcending experiences.\n\nI had the opportunity to spend an afternoon with the Dalai Lama and someone asked him what he was particularly enjoying these days. His answer was, “Talking with Western physicists.” When asked why, he replied, with a grin, “Because they are finally starting to get it.” We are living in a dynamic time when mystics and scientists are meeting on common ground.\n\nHere are some examples of the emerging paradigm that traditional scientists are grappling with in the field of physics.\n\nAfter taking a quick look at Science through the lens of the Agenda for Global Domination we will check out how seeing through some of these old myths can provide dramatic shifts in creating a thriving society enjoying a healthy planet.\n\nScience relies on research, and research relies on funding. Those who determine the funding get to determine what gets researched. So it is important to consider what paradigm and vested interests are driving the dominant scientific model. And since energy technology is dictated by the prevailing scientific paradigm, it is useful to unpack the dynamic among scientific research, energy technology and money.\n\nThe same banker, J.P. Morgan, who prohibited Nikola Tesla from making abundant energy available wirelessly, also suppressed key scientific truths about how energy works. Morgan owned most of the copper mines and was making a fortune off the wires which conducted power from one place to another. Wireless technology would have negative financial consequences for him, so in the early 20th century he used his financial influence to delete from textbooks the knowledge that can lead to creating such devices.\n\nClaiming “national security” issues, the US Patent office has confiscated over 5000 technologies during application for patents as alternative energy devices. Then the government turns around and bankrupts our treasury invading another middle eastern country to take over their oil – creating devastation and dangerous blowback in the process. If “free energy” were just a hoax, why would the government take such harsh measures to confiscate any trace of it?\n\nIt is important to realize that billions of dollars of taxpayer money goes each year into so called USAPs (Unidentified Special Access Projects) which are covert developments – usually by a conglomeration of private corporations that develop energy technologies, weapons, fighter and space exploration aircraft, surveillance equipment etc.\n\nMy research leads me to believe that the bulk of the benefit of these expenditures goes to the very elite who are trying to create a one-world authoritarian state, interimly to colonize other countries, ultimately to control all of us.\n\nThe majority of scientific research conducted at Universities is corporate or government funded. From our Follow the Money Graphic, we are reminded that the government essentially works for the corporations, who work for the banking elite.\n\nSo Science, by this logic, would end up serving the Global Domination Agenda. If it seems strange to you that science might be manipulated or constrained by the powers of government, banking and corporations, let’s take a closer look.\n\nPresident Obama, for example, was voted in for “Change We Can Believe In.”\n\nWhom did he hire to fix the Economic collapse?\n\nWhat “scientists” were hired to steward our agriculture?\n\nAnd in charge of Food Safety?\n\nWho did he decide would be appropriate to be in charge of Information for the whole country?\n\nAnd who was named Obama’s Science Czar?\n\nWhat other science organizations has “the State” created to watch out for our well being? Let’s look at some of them:\n\nIntergovernmental Panel on Climate Change (IPCC), which is the (Rockefeller and Rothschild created) UN propaganda arm for using the scare of global warming to usher in a global government demanding taxes from everyone, payable to the World Bank and enforced by a one world army.\n\nCenter for Disease Control (CDC), which has been caught numerous times covertly testing chemicals on unknowing populations and even sterilizing young women without their knowledge or consent.\n\nEnvironmental Protection Agency (EPA), which Senator Barbara Boxer exposed for paying poor families to be able to test toxic pesticides on their children.\n\nFood And Drug Administration (FDA), which has repeatedly withheld information on damaging side effects of drugs in order to benefit their corporate cronies.\n\nUnited States Department of Agriculture (USDA) – which receives a 5% royalty on sale of GMO foods,\n\nWorld Health Organization (WHO), American Medical Association (AMA) (suppressing cures and pushing drugs and dangerous vaccines on the American population) National Education Association (NEA) (controlling educational curricula to create obedient consumers for the mega corporations) – all created or primarily funded by the Rockefeller cartel.\n\nIs it coincidence then that our society is so heavily in debt, sick, drugged, poisoned, polluted, dumbed down, dependent on oil and careening toward a one-world government?\n\nI have been a decades-long subscriber to Discover magazine as well as Scientific American, and they each have some great graphics and some interesting articles, but it is useful to recognize that their advertisers include BASF Chemical Co., Conservation Intl., the US Navy, Conoco Phillips, Citgo, Pfizer, Dow, and Lockheed Martin, so it is not surprising that they make fun of UFOs and New Energy technologies, promote toxic vaccines, fracking, GMO foods, pesticides, and cloning.\n\nLet’s look to see how to use the lenses of the torus and the Global Domination Agenda (GDA) to optimize our solutions strategies.\n\nIn my view the GDA is focused on destroying individual wholeness and centralizing power over others. Surviving and thriving as individuals and as a species depends, I believe, on learning rapidly how to do just the opposite.\n\nThrough recognizing the wholeness of the toroidal energy form and the infinite abundance of the energy plenum we inhabit, we can have clean, inexpensive energy for everyone through “New Energy” technology. No war, no pollution, no combustion.\n\nIt’s going to take a critical mass of people willing to invest the time and money to provide resources, security, legal defense and publicity to successful inventors. (See New Energy topic.)\n\nThrough recognizing the wholeness of naturally grown food – free of oil-based pesticides, herbicides, and fertilizers, grown in the balance of whole environments of polyculture planting and organic soil, and free of the Genetic Modification of injecting foreign DNA, we can realize greater yields, greater health, and greater prosperity on a healthy, sustainable planet. (See Environment Sector)\n\nThrough recognizing the wholeness of each individual and each voluntary transaction as the true basis for a healthy economy, we can eliminate the vast majority of the fraud, counterfeit, subsidies, bailouts and fake financial instruments that are destroying billions of lives as I write. Catherine Austin Fitts has estimated that people would have 3-10 times the assets and income they have now – just through restoring integrity and true freedom to the “science” of economics. (see Liberty topic and Economics Sector)\n\nThrough recognizing the wholeness of each person, their emotions and their rights – through skilled communication - we can move toward the life we all dream of – where we feel heard, valued and loved as well as free and able to give the same in return.\n\nEvidence continues to mount that we are all holons in a boundless holarchy, free nodes in a fully-interconnected, holographic and fractal universe of infinite energy.\n\nAs we align with the fundamental patterning at all levels – from physical, emotional and mental to spiritual, interpersonal and environmental, we are learning from moment to moment experiments in the practical and transcendent science of love. What a gift to be alive in such a challenging and rewarding adventure!\n\nRecognizing the wholeness of our being, which combines the logic of our rational minds with the inclusive capacity of our intuitive knowing, we can connect with that which is beyond our cognitive comprehension – with the belonging, the healing, and to the experience of unity with cosmic consciousness.\n\nIn keeping with the three-stage structure of Solutions Strategies for other sectors and topics, here is a very simple overview in the context of Science.\n\nStage 1 - Reform Government\n\nGet corporate influence out of politics and the politicization of scientific research. Eliminate any funding or lobbying from corporations toward the FDA, EPA, NSF, NEA, CDC, etc.\n\nStage 2 - Limit Government\n\nGet “the State” out of Science, except to protect the rights of any scientists and inventors whose rights are violated\n\nStage 3\n\nScience is free to operate without state intervention through systems of voluntary cooperation", "opengraph": {"title": "Two Lenses Through Which to View the Role of Science | Thrive", "type": "cause", "url": "http://zums.thrivemovement.com/two-lenses-through-which-view-role-science", "image": "http://www.thrivemovement.com/images/poster_thumbnail.jpg", "site_name": "Two Lenses Through Which to View the Role of Science | Thrive"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/r0kBHcHxXZw?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/r0kBHcHxXZw?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/O_FRgZjv6tA?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/O_FRgZjv6tA?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/IWIN8eGuTB8?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/IWIN8eGuTB8?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "315", "embed_code": "<iframe width=\"420\" height=\"315\" src=\"https://www.youtube.com/embed/fwoFFdL4AkE?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/fwoFFdL4AkE?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "315", "embed_code": "<iframe width=\"420\" height=\"315\" src=\"https://www.youtube.com/embed/XVgVXJD1248?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/XVgVXJD1248?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/kQmgTJuUOoc?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/kQmgTJuUOoc?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/vs15mQHNYPQ?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/vs15mQHNYPQ?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mXKHWeGD9O0?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/mXKHWeGD9O0?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/0h410EjJ4XU?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/0h410EjJ4XU?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/FLPoRocUTsI?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/FLPoRocUTsI?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/4vZRKVJQKUk?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/4vZRKVJQKUk?rel=0"}], "links": ["http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/714/original/science-richard-mellersh.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/718/original/science-whirlpool-galaxy.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/719/original/science-bagel.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/720/original/science-dolphin.jpg", "../../../the_problem-gda", "../../../the_code-fundamental_pattern", "https://en.wikipedia.org/wiki/Shape_of_the_Universe", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/715/original/science-akiane-art.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/716/original/science-crab-nebula.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/717/original/science-galacticjets.jpg", "http://dictionary.reference.com/browse/force", "http://theresonanceproject.org/research/scientific", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/729/original/science-acorn.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/730/original/science-tree.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/731/original/science-apple.jpg", "http://www.heartmath.org/", "http://www.spiritual-experiences.com/articles-spirituality/subtle-body-seven-bodies.php", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/732/original/science-aura.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/733/original/science-chakras.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/734/original/science-heartmath.jpg", "http://dictionary.reference.com/browse/evolution", "http://www.arthuryoung.com/", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/743/original/science-russell-torus.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/745/original/science-russell-octaves.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/746/original/science-walter-russell.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/747/original/science-fuller-8wheel-ve.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/748/original/science-fuller-cosmichierchy.jpg", "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/749/original/science-fuller-blackmtn.jpg", "http://biomimicry.net/", "http://www.ted.com/talks/janine_benyus_shares_nature_s_designs.html", "http://discovermagazine.com/2002/jun/featuniverse", "http://www.cheniere.org/books/efv/index.htm", "http://cryptogon.com/?p=5739", "http://www.thetruthseeker.co.uk/?p=17370", "http://www.prisonplanet.com/obama-puts-monsanto-lobbyist-in-charge-of-food-safety.html", "http://www.911truth.org/article.php?story=20100121134159191", "http://www.prisonplanet.com/john-holdren-obamas-science-czar-forced-abortions-and-mass-sterilization-needed-to-save-the-planet.html", "../../../the_code-new_energy_technology", "../../../the_12_sectors-environment", "../../../solutions-liberty", "../../../the_12_sectors-economics"], "authors": [], "publish_date": null}