{"result_id": "316027", "URL": "https://www.thrivemovement.com/whats-really-happening-syria-new-world-order-assault-middle-east", "timestamp": "2023-04-25 17:42:11 CEST+0200", "meta": {"description": "What’s Really Happening in #Syria:", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "https://www.thrivemovement.com/whats-really-happening-syria-new-world-order-assault-middle-east", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "What’s Really Happening in Syria: Parting the Veils of the New World Order Assault on the Middle East", "cleaned_text": "Mainstream news sources are reporting that the Syrian government has used chemical weapons on its own citizens, killing hundreds. But what if that’s not the true story? What if this is another “false flag” operation — like Iraq — where the American government is using the excuse of chemical weapons to justify another war in the Middle East for its own benefit? I’m afraid that is the case…you can find out more about what I think is really going on in Syria in this audio blog:\n\nDownload the audio file (right click and choose Download or Save As…)\n\n Read a transcript of the audio (to translate the transcript, choose your language at the top of this page)\n\nSo folks, Foster here and I just wanted share some of my thoughts and feelings about what is going on, specifically in relation to Syria right now, and I hardly know where to start. I feel such sadness that I know so many people feel around the world that “here we go again” and having been through this numerous times, many people are awake enough to know that a plan to attack Syria is going to cost hundreds of thousands, if not millions, of lives and, in this case, could be even worse (and I’ll get into that in a minute). But, what I’d like to ask you to do while I’m sharing some of my perspective is just put on the lens of the Global Domination Agenda to see if things make more sense once you look through the possibility that elite covert powers are working in a very committed, dedicated way toward the ultimate consolidation of wealth and power.\n\nRight now, Britain and France are calling for a U.N. security counsel resolution to invade Syria and Obama has asked his legal team for justification to go into Syria with or without a U.N. resolution. I’ve seen polls where only 9% of the U.S people are behind this. So, if people still have a question about whether or not we’re entering into a totalitarian, imperialist state, I’m afraid this is just going to be more verification as it was with Afghanistan, Iraq, etc. When Colin Powell went to the U.N. and did his address trying to justify the invasion of Iraq based on weapons of mass destruction, he ultimately said that he was lied to by the Bush Administration and he didn’t know. In this case, I think it’s even more egregious because John Kerry and the French and German puppets who are in the public eye right now cheerleading for this seem to be just blatantly lying. I think that they know what they’re doing. This is just a continuation of what Leo Strauss , the kind of ideological grandfather of the neo-Con movement, called the “noble lie” and he justified this kind of covert conspiracy, and just lying to the people, as being worthwhile in order to keep the power of the State stable and growing.\n\nOne really good reference point for me was that Wesley Clark was interviewed by Amy Goodman back in 2007 and he actually told the story of how he was at the Pentagon when we were about to go into Iraq again and he said to the Secretary of Defense, “Is this really going to happen?” and, I believe it was Rumsfeld who said, “Oh yeah, it’s going to be much worse than that” and he went on to show Wesley Clark, this retired General, a document outlining this strategy of invading, conquering seven countries in the Middle East in five years and that included Iraq, Lebanon, Libya, Somalia, Yemen, and then, finally ending with Iran. And Syria was on that list, as well. If anybody listening still thinks that this is about spreading democracy, then recall that the U.S. has been propping up dictators for decades and continues to in place like Bahrain, Saudi Arabia, and now, again, in Egypt. If you think it’s about just regime change or protecting human rights, then it’s really worth a closer look here.\n\nIn Syria, Obama has, a year ago almost to the day, drawn his red line in the sand saying, “if they use chemical weapons, then we’re going to have to go in”. The head of Syria, Bashar al-Assad, he has actually, and his administration, have been one of the few entities that has been reasonably successful in actually resisting the advance of the Cabal, especially given that they don’t have nuclear weapons. (You’ll notice we’re not going into North Korea, not going into China, where they actually have nuclear weapons. And you can see why Iran and everybody else wants them. Because it’s the only thing that’s standing between these countries and being invaded.) Assad really has been winning in his struggle over there and it would be suicidal and stupid for his administration to suddenly use chemical weapons. They didn’t need to. There’s no record that they ever have. And, at the same time, there’s actually videos you can see on YouTube of the so-called rebels forces threatening to use chemical weapons and then other videos and photographs of them practicing with their newly-arrived U.S. gas masks for potential chemical incidents.\n\nSo, the U.N. inspectors arrived in Syria to check on the possibility of some sort of toxic gas incident and then the incident happens two days later so that also would be pretty stupid for the Assad Administration to pull something like that right after the U.N. inspectors had arrived. The U.N. inspectors were fired upon shortly after this incident, I think to keep them from being able to inspect what really went on and the Obama Administration is already saying, “It’s too late to really determine the evidence. We’re just going to have to go on circumstantial evidence”, which is, of course, the same thing they did in Iraq.\n\nHere’s an area that I really want to go into that’s got me especially concerned about this, even beyond the last dominoes that have fallen in this same way. China gets much of their oil from Iran and Russia has drawn its line in the sand with the U.S. saying, “If you invade Iran, we will protect them” because they also depend on their oil resources. Iran has a mutual protection deal with Syria, so they’ve agreed that if either one of them is attacked, they would help each other. And Syria has just recently said, “If they’re attacked, they will attack Israel because they know who’s really behind all of this. Unfortunately, there are many hawks in the government and in the shadow government in this country and around the world who actually want a World War III for further consolidation of power, for the war profits of the military industrial complex, and so forth. There is a huge risk that this could easily escalate if we were to send some cruise missiles into Syria, that then they attack Israel, and Iran goes to protect Syria, China and Russia get involved and all of a sudden, we are on the verge of nuclear war. This is even a bigger deal than what we’ve looked at before.\n\nWhat in the world is really going on and what can we do about it? Let’s look for just a moment first at what might be really going on and I want to suggest that, obviously, beyond any sham of democracy and human rights, that this is about resources. It’s secondly about eliminating resistance in the Middle East to the domination of Israel, which, remember, is only on the surface of it, a Jewish entity. It’s really a creation of the Rothschild Zionists as a center for consolidating world power in the Middle East. Again, this plan has been in place since before 9/11 to basically destroy all the cultures over there, take over the resources, and keep them from stopping the advance of the New World Order.\n\nI also want to mention the fundamental financial interests behind all of this because the dollar only has any value now because the U.S military is behind it and because people are still having to use it, particularly to buy oil. The fact of the matter is the U.S. government is the most indebted entity in the history of the world. All of the major U.S banks are hundreds of trillions of dollars in derivatives debt. From the point of view of the international bankers, one of the things that they’re trying to do with these kinds of moves is make sure that oil keeps getting sold for what they call now “petro dollars”, for the U.S dollar, because that’s really the only thing still propping it up besides the $85 billion dollars a month being printed by the Federal Reserve, which is only decreasing the value of the dollar. I think this is really fundamentally about trying to prolong the propping up of the dollar, which is behind the whole New World Order takeover.\n\nSo, what can we hope to do about this? I think that actually our best hope is number one, alerting other people as fast as possible all over the world through the Internet to this and other false flags. Secondly, to use every kind of media that you can to politicians and corporations and banks on notice that if they consciously participate in these things, you will withdraw and publicize their participation in it. Also, I encourage everyone to continue to get yourselves versed in the fundamentals of the Liberty conversation and spread that thinking because all of these horrors in one country after another are only possible because of the mass belief in the authority of the State. Without the notion of the State and involuntary taxation, you would never be able to get the money and the buy-in to go do these wars. Finally, I want to suggest that perhaps our best hope in this particular case is the whole emerging global asset-backed banking system that was mentioned by Karen Hudes, the whistleblower from the World Bank, because it seems like, according to her and other sources that we’re in touch with, that the global banking system is metaphorically and physically, technologically being re-booted as we speak to accommodate a new asset-backed, particularly gold and silver-backed, currency basis worldwide. That has the potential of transcending this whole dollar-based, fiat money system, which is what gives the New World Order would-be controllers their power and that seems to be coming in very fast and could expose the excuses for these types of false flag invasions of other countries.\n\nI want to warn people that we’re also hearing that there are major preparations going on for disasters on the East Coast of the United States in what they call “FEMA Region 3”, which includes Washington, D.C., Delaware, Maryland, Pennsylvania, Virginia, and West Virginia. I’ll post some articles and videos about this because the evidence is actually overwhelming. There are about 15 different actions going on including purchases of millions of dollars of these MRAPs (these military vehicles), heater meals, emergency water, training courses for U.N peace keepers, vaccines being consolidated. All of this has to be in place by October 1, so it could be that the powers that want to be are finalizing plans for some sort of perfect storm false flag that would involve not only war in the Middle East and a collapse of the dollar, but also, potentially, either the MERS virus or the new flu virus that is starting to be trumped up as vey dangerous and is beginning to be exposed as a potential weaponized vaccine, like the last one. All of this could come to fruition, unfortunately, in September and October, so I just want to warn people about that and do everything you can to prepare and alert your communities and your networks and then do everything you can to be ready for it and then do everything you can to keep it from happening.\n\nI think I’d like to leave it at this for now. I wish I had better news about this, but I think that the best news is that people are so aware of these dynamics and not wanting to put up with it again. We’ll circulate lots of other information on this. I encourage you to do the same. Remember, we are in this together. All over the world, most people are now awake to these things and not wanting it to happen. As we wake up and link up and actually stand up and speak up about these things, hopefully we can keep them from happening immediately and definitely in the long run.\n\nThanks for listening and I’ll be with you in everything you try to do to keep this from happening.", "opengraph": {"type": "cause", "site_name": "What’s Really Happening in Syria: Parting the Veils of the New World Order Assault on the Middle East | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/088/original/image1.jpg", "title": "What’s Really Happening in Syria: Parting the Veils of the New World Order Assault on the Middle East", "url": "http://www.thrivemovement.com/whats-really-happening-syria-new-world-order-assault-middle-east", "description": "Mainstream news sources are reporting that the Syrian government has used chemical weapons on its own citizens, killing hundreds. But what if that’s not the true story? Find out more about what’s really going on here."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.infowars.com/hacked-emails-reveal-washington-approved-plan-to-stage-chemical-weapons-attack-in-syria/", "http://www.infowars.com/syria-well-strike-Israel-if-US-attacks", "https://www.youtube.com/watch?v=HP7L8bw5QF4&feature=youtu.be", "http://www.silverdoctors.com/world-bank-whistle-blower-precious-metals-to-serve-as-an-underpinning-for-paper-currencies/"], "authors": [], "publish_date": null}