{"result_id": "316035", "URL": "http://www.thrivemovement.com/who-owns-your-body.blog", "timestamp": "2023-04-25 17:42:26 CEST+0200", "meta": {"description": "Do you own your body? OR do the government and the corporations control it? If you want your child to be vaccinated, you can get them vaccinated. The problem is that if you don’t…", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/who-owns-your-body.blog", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Who Owns Your Body?", "cleaned_text": "The notion of being for or against vaccines misses the point of what mandated vaccination is really about. If you want your child to be vaccinated, you can get them vaccinated. The problem is that if you don’t want to, that’s no longer an option.\n\nGiving the government control over what your child is injected with, or if your child is injected, is something people across the political spectrum are uniting to stop. Unlikely allies are finding each other on the path to getting informed and claiming their rights. This is a global issue that reaches far beyond California and we believe that this is one of the biggest and most pressing issues of our times.\n\nNo documentary has ever demonstrated what is at stake, or what we can do, like VAXXED. The movie is currently available in theatres. You can check out their schedule, host a screening or sign up to stay informed at the link below.\n\nJoin us for this compelling conversation with Foster, Kimberly and the filmmakers of VAXXED, Andrew Wakefield and Del Bigtree.\n\nRead a transcript of the audio (to translate the transcript, choose your language at the top of this page)\n\nFoster Gamble: Okay, well, welcome everyone. Kimberly and I have been very excited about this conversation. As you know, we’ve been not doing public broadcast for a period of time now where we’ve been dedicated to other projects in that the Liberty area and in working with our ThriveConnect inventors, but when we saw of the movie “Vaxxed” a couple of weeks ago for the first time, we were so profoundly impacted that we talked it over afterwards and decided we wanted to offer anything that we could from ourselves and from our global network to help get this message out to the world as quickly and as effectively as possible.\n\nSo, we have Dr. Andrew Wakefield with us today and his partner in making the film “Vaxxed”, Del Bigtree. Let me give you a brief introduction of them as a welcome on board here and to let you know who they are if you’re not already familiar with it. Dr. Andrew Wakefield it is a British gastroenterologist and medical researcher who had been doing very diligent, highly respected work and then, in 1998, he had the courage and the data to suggest a link between the Measles, Mumps, and Rubella vaccine when delivered altogether and in heavy and early doses and the connection of all of that to autism. So, he publish a paper because he thought it was really important to do and his recommendation was simply that more work needed to be done to be certain of the safety of these vaccines and the schedules by which they were delivered. Well, all hell broke loose and the full fury of the what some might call the medical mafia was unleashed on him, slandering him in the media and taking away his license to practice and, perhaps even more importantly, more recently, he’s the co-writer and director of the new movie, “Vaxxed”. So, welcome Andy.\n\nAndrew Wakefield: Great to be here.\n\nFoster: And then, Del is a highly respected medical reporter and a producer for many years on the renowned daytime medical talk show, “The Doctors” Now, he’s been the producer of “Vaxxed” and Del has had the courage to recognize a huge threat to people’s health in getting to know Andy and his work, especially the health of young children, and then has being willing to risk his career and his reputation to take a stand for the truth of what he discovered. So, Del, congratulations and welcome.\n\nDel Bigtree: Thank you very much for having me. It’s an honor to be talking to you.\n\nFoster: Well, it great to be with you and we’re looking forward to be sharing this with our network and beyond. I wrote a blog a few months ago, collating 10 years of my research into this really critical topic and one of the quotes that I use was from Dr. Suzanne Humphries, who iss the author of “Dissolving Illusions: Disease, Vaccines, and the Forgotten History”. And she says in there just quite simply and directly, she says, “you cannot dabble in the topic of vaccination” and that really struck me. Kimberly and I have children and grandchildren, most of whom are in California where now these vaccines are being mandated and the heavy duty schedule and actually, Kimberly is the person that I know, personally, who was onto this earlier than anyone else in my life, fortunately, for her kids. Kimberly, I want to welcome you in and hear a little bit from you about your perspective on this and how you got onto it so early.\n\nKimberly: Well, thank you. I am so honored and I’m so grateful for the work that you’re doing. I feel like the movie “Vaxxed” brings the conversation up that I have been waiting for since the 1970s.\n\nI had my first child in 1978 and I remember I looked at his perfect little healthy body and when I went to take him into the pediatrician who suggested that he get the MMR I just said, “Gosh, he just seems so perfect right now. Could I just see how you decided on combining MMR and are those deadly? And what if I waited?” I just wanted to see some data on why? And how come now? And how come combined? And I was met with this totally shaming response just for asking the question. It was “You don’t want your baby to die do you? And not only that, it’s irresponsible. If you don’t do it, then you put in jeopardy all the other kids.” I said, “Wait a minute…if they’re vaccinated, why would my not being vaccinated put them at risk? I’m not I’m not getting this.” So I said, “I’m just not comfortable with this. I want to see something.”\n\nSo, I just started doing a little bit of research and I came upon a book from 1957 called “The Poison Needle” and it was like whoa!, that one had some far out stuff, but it at least confirmed that there was more to it than just this-is-absolute-strong-science-so-go-for-it. I found this doctor who was willing to separate them.\n\nI like the idea. Vaccines make sense to me. As an overall concept in health, it makes sense to me. It was just the timing, and the dose, and the contents and the lack of informed consent. I felt like every parent on the planet cares. That’s one of the biggest decisions you can ever make for your children, what they’re going to put in their bodies, so I knew I wasn’t different from other parents in caring.\n\nSo, I was able to track down this doctor who is willing to order them separately for me. I think we had to order them from Europe. I don’t even remember the details. I only remember thinking that if it didn’t work at least it wouldn’t work in a smaller dose and would be recoverable.\n\nAnyway, it turned into the pro and anti vaccine conversation that I felt missed the point. That was such an oversimplification. It wasn’t pro or against. It was content, schedule, interaction, and whether or not it was voluntary, and whether or not it could be informed consent and I feel like your work and this movie brings that level of thoughtfulness to the conversation and allows parents to be more informed, which is what it’s all about. Make your own decisions, but make it with the information.\n\nI was so energized after seeing the movie I just felt like thank you, thank you, thank you. This is exactly what’s been missing and I am profoundly grateful for my grandchildren and all the children on the planet and, honestly, for the human species, which I think is at stake if we handover our right to control what goes into our bodies. So, welcome and thank you.\n\nFoster: So for the folks that are watching this, this is what we hope to cover today and any surprises that come up are great. We’re going to ask these two about the background story of this and especially the science involved because film has nailed the scientific data and the personal stories like nothing that we’ve seen and then we want to hear from you about the personal, human side of what this has been like for you discovering this information, right in the thick of the process, and getting it out there. And then we want to talk especially about what can we do strategically and tactically? What can individuals and groups and networks do to assist you and others in turning this around?\n\nBut I want to turn it over you now and we’d like you to start, Andy, if you would beginning with what was the main turning point for you? If you think back to one point…your career is going along great and you’re doing all these wonderful things and something occurs that shifts your awareness and and then this adventure begins. If you would, please recount that for us and then tell us little bit about the key scientific points that you discovered and that you’re in the process of getting out in this film. Then we’ll ask Del to do the same thing.\n\nAndrew: I started out as a gastroenterologist and I trained as a surgeon for many years and then I got involved in research for a period in Canada, where I was working on small intestinal transplantation. That was a complete waste of time in many ways. Surgeons like to join things together and cut bits out, but my interests were Crohn’s disease and ulcerative colitis - inflammatory bowel diseases that are now epidemic and have appeared in children. That must be an environmental factor. We made some discoveries during my time in Toronto General Hospital that made me shift more towards the research arena, so I came back to England. I got involved in setting up a research team, ultimately, with about 19 people, producing some very interesting insights into inflammatory bowel disease.\n\nWe asked the question, “Was there some link between measles virus and inflammatory bowel disease?” because we’d observed with some colleagues in Sweden that mothers who suffered with measles during pregnancy, which is very rare because most mothers have been infected as children. They gave birth to children who went on to develop severe Crohn’s disease. It was extraordinary - one in six million chance. I then wrote to the Department of Health and this was a turning point, one getting to your first question. I wrote to the Department of Health and said “Crohns disease has appeared in children only since the single vaccine has become available. We don’t know what this means, but we have found this link with measles virus. “ We published three or four papers on it.\n\nThe response I got was very telling. They were not interested in the safety aspects. It was an irritation to them. The Department of Health could not have been more unhelpful and more obstructive. We were rather like Boy Scouts writing this, “Look, we thought you’d be interested. Here’s more information”, and it just got trashed. We were discarded. They didn’t want to know. It took two years to set up a meeting that I’d requested. That was the first point was the indifference of the regulators to the issue of safety.\n\nThe second came when, in 1995, parents started calling me and saying my child was perfectly normal. They were developing normally. They had all their milestones met and then they had an MMR vaccine and they disappeared. They had a seizure. They had a fever. They slept for days on end and when they woke up, they were never the same again.\n\nIt was a compelling story, but I knew nothing about autism, which was their eventual diagnosis, but these children had suffered severe gastrointestinal problems, which was highly relevant to my discipline so I heard the story a sufficient number of times that a pattern emerged. Something was going on. And the parents would say these things started at the same time, the deterioration in mental function and the gastrointestinal features. And when the bowel system’s are better, then the behavior is better. There’s a parallel between these. We think what is going on in the intestine is affecting the brain.\n\nDoctors that they’d been to see would say, “No, this is simply autism. Get over it. Put your child in a home. Get on with your life.” That was tragic because one of the fundamental rules of clinical medicine is that symptoms in patients have an organic origin until proven otherwise. In other words, there is an underlying disease until you have ruled that out. That is your duty. So, we investigated these children. I did so with a team, including Professor John Walker Smith and his colleagues, and John, at that time, was the world’s leading pediatric gastroenterologist, one of the founding fathers of the discipline, and he and his team investigated these children and, lo and behold, the parents were right. The children had an inflammatory bowel disease that, when treated, led not only to improvement in the intestinal symptoms, but also the behavior. That was fascinating. So, there they were. They were right about the bowel symptoms and the inflammatory bowel disease. The medical professions was almost, to a man and a woman, completely wrong. They had been, in many cases, negligent of these children who had been suffering for many years.\n\nSo, the next question, “Is this linked to the vaccine?” had to be taken extremely seriously. Well, we did that. Or, at least, I did that and that was the beginning of the end of my career. There were two things there in the terms of the turning point. One of them is my colleagues in the Department of Pediatric Gastroenterology said to me, “Andy, as pediatricians, we cannot be seen to question the safety of MMR.” That made absolutely no sense to me either as a physician or a scientist or indeed a humanitarian. If we had said, “We cannot be seen to question the safety of Vioxx or thalidomide or cyanide.” It made no sense just because it was a vaccine and therefore, part of this religion that I came to discover.\n\nThe second was that the dean of the medical school said to me, “If you pursue this work, it will not be good for your career.” He was correct. He was absolutely correct. It may be just my difficult personality, but I decided to work twice as hard on it because this was not in the interest of patients. All of these decisions were political decisions, decisions about personal status, perception, how your colleagues might think about you. It had nothing to do with the primary objective of medicine, which is to put the patient first and foremost. There is no ambiguity whatsoever about who your responsibility is to. So, that’s what I did.\n\nWe pursued this when I left the Royal Free (Hospital), which is rarely mentioned. We published about 15 papers, dissecting out the minutiae of the bowel disease, separating it from Crohn’s, separating it from food allergies, showing it had unique patterns and signatures, and I eventually was forced out of my medical school. I was forced out of my profession. They couldn’t stop the work so they set News International’s Brian Deer, the journalist, on me and the rest kind of then just spiraled out of control and I left for America to continue the work. That was followed by allegations of fraud in order to ultimately destroy my opportunity to do any work because once you label a scientist a fraud, it takes five minutes to do that and a lifetime or more, if ever, to restore that. Scientists are extremely vulnerable in that respect. All of that, then fast forward 20 years from the original parent story, now we have the CDC whistleblower coming forward and saying, “Actually, the parents were right all along and we’ve known it for 14 years and we’ve hidden it.” What a tragedy that all that waste of time, all those wasted children, and all that pain and suffering that could have been mitigated all because of a lie - a terrible, terrible lie. That’s really, in a nutshell, my story.\n\nFoster: Wow. Thank you for that. The phrase comes to mind from philosophy that the core allegiance is the fidelity to truth and I know that that can be really risky as George Orwell says that telling the truth in an age of deception is a revolutionary act. I really appreciate what you’ve done and what you’re going through.\n\nSo Del, what was the turning point for you?\n\nDel: Well, there’s a lot in my life, I think, that led me to this moment, this time, and this film, but specifically to how I got involved with the film, I had been a producer, as you said, on “The Doctors” for six years. I was sort of known as being the producer, there’s seven teams on the show, so I did a lot of more controversial stories like when it was ruled that Monsanto’s product, glyphosate, which is the herbicide sprayed on 80 to 90% of our crop,s now and the WHO said that that was probably carcinogenic to humans, I did that story on the show, but I didn’t just talk about it. I managed to get a debate between the toxicologist, Donna Farmer, from Monsanto to debate Jeffrey Smith on television. I was really happy I was able pull that off, but those were the types of things I did and, luckily, the show allowed me to do those stories.\n\nI’ve always celebrated the best that medicine has to offer: the great doctors, the great scientists, new technologies, and even new medicines. It was a great opportunity, but I did always questions this corporate power involved and when corporations, in the world we live in today, you watch more and more control of the government and really wonder are things being done for our best interests, so those stories always intrigued me. Because I’d done so many stories like that, I had some real insiders in medicine and things who would feed me new stories or new ideas and I got a call from one of the doctors I’d worked with who said, “Del, there’s going to be a whistleblower from the Centers for Disease Control. He’s going to come forward and say that they have committed fraud on some of the vaccine studies and they know that vaccines are causing autism.”\n\nIn that moment, I thought if that really happens, if that’s true, that’s going to be the biggest medical story of my lifetime. I wasn’t able to do that on “The Doctors” television show because we had direct pharmaceutical sponsors. We were doing interstitials with pharmaceutical sponsors. The CDC was a very good friend of the show. We had them on show all the time. They gave us access inside the CDC. So the show had no desire to go near this topic, which I sort of expected. But I said to them, as a producer pitching to the executives, “Look, I just want you to know you heard it first from me” because it was two weeks before it was even announced and then, of course, Andy Wakefield and Brian Hooker put forward the information and we heard the words of Dr. William Thompson two weeks later.\n\nI had assumed CNN, MSN, NBC, Fox, all these news stations would pick it up and then, maybe, when it blew up to the big story that I knew it would be, I would get an opportunity to take a doctor’s perspective on it. When the news came out and nobody, not a single mainstream newspaper, not a single news agency touched the story. You got to think about when you’re in media, we’ve come to a place where we call it infotainment now. It sort of has to grab viewers and we know that it’s sensational and I think we’re all aware of that. So, when you think of a story where you have a top government scientists coming forward from the most important health agency in the world saying, “Vaccines may be causing autism” or “We doctored a study that saw a direct link between vaccines and autism”, you had to know that was going to sell newspapers. That would be the biggest story. People would be glued to their TVs no matter how you told that story - whether you said the guy is crazy, we got into it and went and investigated it and this lunatic is saying something crazy or we looked into the science and this is really terrifying - either way, there should have been a story and when there was no story at all, a complete media blackout, I listen to Andy’s story, and your told you cannot talk about something, especially as a journalist, that just lit the fire in me.\n\nI said there is something really big here. This is even bigger than a scientist coming forward and saying ,“Vaccines may cause autism”. None of the media’s allowed to talk about it. Who’s controlling the media? What is going on? That was when I knew I had to get to the bottom of the story and then, of course, I researched and through some amazing contacts and fairly serendipitous events, I met Andy Wakefield and the rest is history. I think Andy saw in me, I think, the passion that I had and wanted to know about the subject and then it was just an amazing year working with Andy, who I think is one of the great scientific minds of our time. We, together, made a documentary that even transcends any of our abilities. It’s a very powerful piece and I’m very proud of it.\n\nFoster: One of the most profound pieces of information for me in your film was when Stephanie Seneff, from MIT, says that if the emergence of autism continues to grow just the way it is now, much less faster, that by 2032 (and that’s only16 years from now), 50% of children and 80% of the boys will be on the autism spectrum. And then she goes on, you all do, to make the case very clearly, that over and beyond just the sheer human suffering of all that, to imagine the time and the money cost to the human species. So, could you talk a little bit more about some of the key pieces of data that you’re revealing in this film that most people simply aren’t familiar with?\n\nAndrew: Certainly. Firstly, the data on the rising numbers of cases comes from the CDC itself. That’s to the extent that you can trust the CDC’s data and I’ll mention that. This is no doubt mirrored in the experience statewide. You can look at individual states like Utah or New Jersey, then the rate of autism is absolutely huge and the risk for a child born today - because one has to remember that those data are based upon 8 year-olds 8 years ago - so the risk for a child born today is 1 in 25. When I was in medical school, we weren’t even taught about it, it was so rare. If it does continue in the way it is, then that prediction will come to pass. People say, that if only a certain number of people are susceptible, then surely it will plateau out at some stage, but it’s showing no signs of doing that.\n\nBut, moreover, they are accelerating the program, increasing the number of vaccines, increasing the toxicity, that children are suffering all the time to the extent now mother’s are being given three doses of thimerosal containing flu vaccines while pregnant. Thompson himself, the whistleblower, says this is the last group of people you would ever want to inject with mercury. It is not that the toxic load has stabilized. It continues to increase and it impacts children, infants and the fetus, at increasingly sensitive times.\n\nThe problem perhaps isn’t underestimating. The numbers aren’t underestimated and the reason I say that is the same guilty parties, the same people who took part in the fraud that we documented in our documentary who have now been indicted in another fraud in Utah, which is one of the centers where the CDC collect their autism data, for miscounting the autism numbers, another whistleblower case against the same fraudsters who took part in this study. We really are in a mire of ignorance, but what is absolutely clear at this street level is that this disorder is everywhere and lesser degrees of this disorder are even more pervasive. This is not just autism. It’s something far, far more sinister and far wider.\n\nDel: I can say as a journalist in investigating this and working with Andy, living with Polly Tommey (one of the mothers that has a vaccine-injured child that appears in our film), I knew this was an issue and we hear the numbers. We hear the 1 in 68, 1 in 45, 1 in 25, but it’s really hard to put perspective on that and nothing prepared me for this tour we’ve been on in a different city almost every night representing the film. Hundreds and hundreds of parents every night standing up in the audience and then coming forward afterwards and sharing their version of this same story, this vaccine injury, the loss of their child, and many of them deaths. Many deaths that don’t even relate to autism. Or paralysis. Or just issues that aren’t even in this autism issue.\n\nYou start thinking, jeez, if we’re at 1 in 25 children with autism, but there’s all of these other ailments that are possibly coming from vaccines that these parents are reporting to, what is the statistic of vaccine injury itself? If you think about it now, we’re at a place in America where 50% of all children in classrooms have a chronic issue, have a chronic disease of one sort or another. We are accepting a new level of health that we should not be. This is the new normal to have. I remember asthma. There was one kid in my school that had the little inhaler. Now, there’s 10 or 20 in a classroom that have inhalers. Deadly peanut allergies where no one can bring peanut butter to school. Eczema is just running rampant. Children with skin diseases, autoimmune diseases, childhood leukemia (and very specific types) everywhere. It goes on and on and on “The Doctors” television show we would even say this, that the medical perspective is that this is going to be the first generation of children that do not live to be as old as their parents.\n\nThen you ask yourself, with the great hospital system we have and all of these great vaccines, if they work, why would that be the case? Why are we so unhealthy? Why are our children so unhealthy? Just about 10 days ago, CBS reported we have more infants die on the first day of life in the United States of America than every other industrialized nation combined. You have to ask yourself, why would that be? We have the best doctors. We have the best pediatricians., hospital care, incubators, you name it. How can you explain that? Then you look at the fact that we’re one of the only nations that will inject a vaccine into a baby on day one. We are mandated a HEP-B vaccine, a sexually-transmitted disease the child will never come in contact with until they’re either sexually active or sharing needles, unfortunately. So then you think it’s filled with aluminum, neurotoxins and things like that into a baby. The insanity of that. “Hello. Welcome to the world. You’re gasping for your first breath and while you’re at it, we’re going to inject you with your first sexually-transmitted disease. Welcome to the United States of America.” From that space right there, I question the intelligence of every pediatrician doing it and every doctor. It makes absolutely no sense.\n\nFoster: One of the things you guys have done so well in the film is you not only laid out the data very solidly and scientifically, but you tell the human story. Kimberly and I are deeply familiar with this story, but I was just moved to tears repeatedly during the film hearing that, first of all, just the stories from the parents, what they went through. And then, secondly, seeing some actual video of these kids going through these seizures and so forth and I’ll never forget when it’s like this case and this case, and then you pan back to an entire screen full of these images and it hits me, oh my god, this is a fraction of the millions of families that this is affecting, so I appreciate your courage to go ahead and lay it out that powerfully.\n\nDel, I wanted to ask you to talk a little bit about the William Thompson story because this took it to a whole new level and I know that one of the quotes from him, one of the things he’s recorded in saying, is “we did unethical vile things”. Could you talk a little bit about what those things were and how it came out?\n\nDel: The truth is that Andy was directly involved with this story from the beginning. Brian Hooker contacted him right away when Dr. William Thompson had reached out to Brian Hooker, but I’ll touch on the parts that I can because as a medical journalist, the things that really grabbed me and I want people to know is what we hear a lot is this whistleblower’s come forward and a lot of people try and say he’s a liar. I don’t know how you’d do that until you’ve had him in a court of law, which in this case is the Congress of the United States. We’re still trying to get this man subpoenaed. He’s been waiting for two years. The statements he’s made are absolutely incredible. He’s provided 10,000 documents to back these statements up, including internal emails. You will see in our film interactions between he and the other scientists he’s complaining to: “We cannot do this. We’ve got to tell the truth.” It’s an amazing amount of testimony and fact-based data that you will find in our film.\n\nBut for me, what you really have to think about is people say, “well, what about all the other studies done?” I hear that a lot. But there’s something about this study that’s extremely important. In fact, I was just two days ago in Jason Chaffetz’s office. We had an incredible meeting with the head of the committee that has to call Dr. William Thompson and subpoena him and I said, “Look, if this had been one of many studies, thousands of studies, and somewhere in the middle, there was some manipulation of data and things were thrown out when the study was done, well we would just throw that study out. Maybe you’d certainly try and get rid of those scientists that are doing it. Maybe it wouldn’t have been that big of a deal. I don’t know. But this isn’t just any study. This is the study that was used to stop all investigations of the connection between vaccines and autism. This study, which we now know is a fraud, based on what William Thompson has not only said, but the data he’s provided – he shows us the data, shows us how it was thrown away, shows us a larger group of 3,000 kids that was supposed to be the heart of the study and how they threw out half of those kids to change the numbers.\n\nThis is all scientific fraud at the most egregious level, but the point being that when I worked on “The Doctors” television show, this is the study we pointed to when we said, “Vaccines are safe and effective. It’s been proven.” This study. Not all the other ones. This specific study because 10 years ago in 2004, when this study came out, the United States government said, that’s it. Because of this study, we are not going to fund any more research on the connection between vaccines and autism and that has left us now 12 years behind the curve in doing the studies that, now when you hear what William Thompson is saying, that they knew there was a connection, we are 12 years behind on important research. Millions of children are being put in harms way and that it’s a government agency that’s done it is the greatest scientific fraud of our lifetime. I’ll have Andy speak a little bit more about directly working with Thompson because he knew what was happening while it was happening.\n\nAndrew: Yes. Interacting with William Thompson, beginning with a number of whistleblowers over the years, they come forward for a variety of reasons. Thompson, his conscience had troubled him from the very beginning. As Del said, he had been fundamental to the design of the study, to the conduct of the study, and to the analysis of the information so, had this been a money-laundering ring, he would have been the accountant, the last person you would want plea bargaining with the Feds. This was William Thompson.\n\nFrom the outset, he said, “we have got a problem” and he said it initially to his colleagues who were co-authors of the paper. He then, when he didn’t get satisfaction at that point, he took it to his immediate manager and then took it to the head of the National Immunization Program, Walter Orenstein, and he took it to the director of the CDC, Dr. Julie Gerberding, all of whom seemed to have dismissed him out-of-hand. In other words, they were aware of the fraud, they were aware of the data linking MMR to autism and they chose to bury it, to ignore it.\n\nThe authors then went about actually destroying the documents that they felt incriminated the MMR and, by extension, themselves. They selected those documents out and then in late 2002, they destroyed those documents. William Thompson, realizing that this was a felony, they were now setting about destroying material evidence that was government property, that this was, in fact, a felony. These documents were under FOIA requests. They were being requested by the Department of Justice and they should have been preserved for all time. Thompson, realizing that, kept the documents. This was a crucial thing because without those documents, without him being able to provide those to us, then it would have been a case of incompetence rather than fraud. We could never have proven the fraud.\n\nBut with those documents in hand, we were absolutely confident with the interviews with Thompson, with the recorded phone calls, with all of those documents, we came forward and said this is fraud. The documentary states that quite clearly with the proviso that, of course, if it’s not, then they can sue us. Well, that’s not going to happen. They know that what we have here is true. So, we were completely confident in going forward that what we had here was the truth and for the first time ever in the history of the world an insider coming forward and saying this, and, of course, what we realized was that so many of these other studies that they’ve done exonerating the vaccines, which the vast majority have been under the control of the CDC, the ones to which Del refers, studies with thousands of children, that we have to treat those studies with a great deal of skepticism now. They’re fraud until proven otherwise. The difference about those studies, of course, is that we did not have a whistleblower on those. For this one, we do and we hope that now exposing this and getting safety research a chance outside the CDC will give access to all of those studies so that people can scrutinize the data and come to the correct conclusion.\n\nFoster: Last I heard, this whistleblower, William Thompson, was still working at the CDC. Is that correct? I wonder how things are on a daily basis for him.\n\nDel: He’s still is it employed by the CDC. He’s protected by whistleblower status so that they can’t fire him. We have left him there for too long. There’s concern that for two years now, he’s been sitting amongst the people he’s accused - and with himself. He said, ”We all were a part of it”. He doesn’t exonerate himself - of this great scientific fraud. That’s what’s so alarming. That’s why we worked so hard to get this film out as fast as we could. This is a film we could have spent two or three more years on it. Luckily, it has the quality it does due to some real help from some great Hollywood people that were involved, too. But, we were in a rush. We’ve got to get Dr. William Thompson subpoenaed before the Congress before somehow there’s too much pressure put on him for his health declines. There are so many issues. This is a guy that’s won awards almost every year in his career. No one’s saying that he’s incapable. No one’s saying he has an ax to grind. So why aren’t we hearing this before the Congress?\n\nFoster: We’ve been following and sharing with our network the story of over 30, now I’ve heard it’s over 40, suspicious death amongst holistic doctors, particularly doctors who either have alternative treatments for cancer or, in the case of Jeff Bradstreet, are working on solid data on the autism/vaccine connection. I hope that he’s getting the security that he needs and I really am so grateful to him for having brought this much information out. I think it’s one of the things that’s kept him alive; it’s because the information is already out.\n\nAndrew: I would say that one of the reasons, which we state in the film is why we outed him, is that very reason. When you watch “The Insider”, the movie, the tobacco exposé, then you realize if you’re a whistleblower, then when you’re a secret from the world, then you are in great danger…\n\nAndrew: …make sure that your enemies know who you are, so get out there. William Thompson was initially resentful about this, but I think he’s come to realize that this was actually the safest position for him to be in. Now, he’s a public figure and it’s going to be very, very difficult to deal with him in the way that they might otherwise have done.\n\nKimberly: I just wanted to say that I really appreciated what a strong case you made. It was really done like a legal case. And also naming names. I know that one of the things that this whole issue brings up for me is the issue of personal accountability on the part of the perpetrators, but also on the part of all of us. As we get informed, what do we do about that? Personally, I think with this issue, everything is at stake. Nuclear is the other issue that everything is at stake and I see this in the same way for all kinds of reasons we can get into, but I just wanted to acknowledge the value and importance of you naming the names because it comes down to personal decisions. Like what’s the difference between someone seeing that data and saying we’ve got to do something and say this or lets hide this and get rid of it? Those are personal choices and we need to be held accountable for our personal choices.\n\nI personally feel that every parent who vaccinated their child did so with the best of intentions. So, clearly, the case for education is important because we need to be educated about those decisions and not just take it for granted that if the uninformed or misguided doctor says something that we need to just go with that and not think for ourselves. We, with THRIVE, some people resisted naming the names, but the point was that these were people. These were people making decisions that impact all of our lives and they need to be held accountable just like we do and so I think you’ve done a real service and I honestly believe that this film and your work are what is going to make a difference in stopping this dangerous use of vaccines on the human population.\n\nWe know from our research that this has been going on. As we did with THRIVE, we sort of did this in every sector and came up with “Whoa!” You start pulling on these threads and it’s not a pretty picture and it’s one that we need to get out there because, like you, Del, it’s like you talking about having a debate between people who disagree. That’s how we learn the best. Get people who disagree. Let’s hear the experts talk about it and then make our own decision about it and that’s why I knew back in the 70s, that my questions were met with shaming, just like you’re talking about, this disinterest regarding safety. That’s not the normal response. If things were on the up and up, you don’t respond to an intelligent inquiry or naming a concern about safety with disregard, so I encourage everybody to see this movie and to share this movie, and to bring the information forward and the whole these people accountable, because I think personal accountability and not being able to hide behind the roles, either in corporations or government agencies, is how these things will change.\n\nDel: Absolutely right. I want to point out that in vaccine research, if you bring up the topic, obviously, you are shamed. When you think about it, we all hear the statement, “The science is settled.” It’s settled on vaccines. Vaccines are safe. If you’ve ever taken a science class, 101, day one in that science class, what we know about science is it is never settled. By definition, science cannot be settled. You must always be an open question taking place. That’s how science moves forward. That’s how we get the Galileo’s and the Einstein’s. They get outside the box and dare to question the orthodox belief system.\n\nSo, when you hear this statement “the science is settled” coming from people he thought were scientists, like Sanjay Gupta on CNN, or these people we respect, you have to then really become concerned. I want Americans to get back to asking questions. We must never let go of that. I say just interject the slightest bit of skepticism in this topic, please. Is it just possible that the most powerful lobby in this country, the pharmaceutical industry, is not telling us all of the truth and as they buy politicians and inject their own government officials, is it possible there’s some corruption taking place? Is it possible that the same scientists that go through the same university process, funded by the pharmaceutical industries - all of these medical departments are being funded by this industry that are telling them that vaccines are safe - and then they only have two choices for jobs: they either work for the vaccine pharmaceutical industry makers or they work for the CDC in testing this. And when they’re done at the CDC, they go over to the pharmaceutical industry and vice versa. Is it possible that in this revolving door with the amount of money going on and the government interests and the corporate interests, is there a possible chance that there’s corruption taking place? Is it that hard to fathom? And then add to the fact that you’re not being allowed to talk about it, Clearly we have an issue.\n\nSo, you’re right. We do help the scientists. We do name their names because these people must be arrested. They must go to jail. This is one of the greatest human tragedies. It’s a holocaust. Over a million children have lost their lives, their minds, to autism since this study came out and said that vaccines are safe. I’m not saying all cases of autism are being caused by vaccines. I think that there are toxins in our food and many different reasons. But, when you look at the size of what’s taking place and people like Coleen Boyle, who was a part of the study, has sat before the Congress time and time again knowing full well that she was involved in this fraud and said, under oath, in front of the Congress that vaccines do not cause autism, we have to do the same thing that they’ve attempted to do by creating this fraud around Andy Wakefield. They’ve scared every doctor from ever even looking at the safety of vaccines. We need to scare every scientist and let them know that you will never get away with this in the United States of America and we do this by naming their names and letting them stand trial for the greatest medical fraud the world has ever seen.\n\nFoster: And not only stand trial, but Kimberly and I have been enjoying sort of imagining what would follow a successful trial, not only potentially incarceration, but restitution, where the restitution of funds would go not to the government. A Big Pharma case was just settled for $70 million against Genentech and one other company recently and $63.2 million of the fines went to the government themselves. Most of the rest to the lawyers. But, we’ve been imagining that these people would not only have to be working while they’re in prison and the money goes to the victims, but also that they should need to, on a daily basis, actually need to talk with some of the parents and actually spend time changing the diapers of incapacitated young people and actually have to experience what they have caused through their selfishness, through their lack of compassion for the results of their actions.\n\nAnd if there are people listening to this who are thinking this is probably just still some sort of conspiracy theory or something like that, here’s a few questions that I’ve found myself asking… Why, if there’s no corruption going on here, why do they actually change the numbers in the study in this one and many others? Why did they destroy the records? Why did they not test proactively for safety and in comparison to the non-vaccinated? Why did they lie about Vioxx and then threaten doctors who disagreed? Why is no one willing to debate Andy publicly? And why are those named in the film, why were they unwilling to come forward with you and do an interview to represent their side of the story if they feel that it was fine?\n\nBefore leaving that point, I want to say one other thing. If you feel this is just a bunch of conspiracy wackos who think like this, Gandhi wrote an entire book warning about the dangers of vaccines, particularly mandatory ones, and I found a quote from Thomas Jefferson from 1778 saying, “If people let the government decide what foods they eat and what medicines they take, their bodies will soon be in as sorry a state as the souls who live under tyranny.”\n\nDel: It’s been prophesied by the great minds of our time. It’s been thought about. We know the dangers of this and it’s an incredibly dangerous moment. This next election is so important.\n\nYou have to see the film. Literally, almost every review of our film is a lie just on what it’s about. You’re not even being told what it’s about. If you read a review and it doesn’t mention the name Dr. William Thompson, the review is a lie. Our entire film is about a very specific scientist at the CDC and if you don’t talk about that fact, then you’re not reading a review. You’re reading propaganda. That’s what’s really taking place here and I hope that my career as an Emmy-winning producer on a medical talk show for six years at least allows you to say, “You know what, this guy left his career. He left everything to go work with this guy, Andy Wakefield, and make this documentary. Why would he do that?” Clearly, this isn’t a lucrative operation.\n\nThe truth is so important and this election right now, I believe, is going to decide our fate. This is more than just childhood vaccines. I live in California where they’ve just taken away all of our ability to exempt our children from a bloated vaccine schedule of roughly 72 vaccines, up from when we were kids to just getting 10, maybe 12. That’s a whole other story, why we’ve expanded that, but that’s going to be spreading nationwide. And right behind mandatory vaccines for children is mandatory vaccines for adults. They’re testing it with the VA insurance, saying they’re not going to be insured as veterans until they get up on all of their vaccines and that will be the pilot program for a national adult vaccination program. I assure you this is in the works. There’s 270 vaccines that are in the pipeline that you’ve never heard of and you have an industry that’s about to put a sitting president into place. And congressmen. And senators; all talking about the importance of mandating vaccines, taking away our choice.\n\nIn California, the government, now, realistically owns my baby. I do not. I’m not allowed to raise that baby. They can inject that child with whatever they want, however they want, whenever they want and there’s nothing I can say about it. In Oklahoma, they just tried to pass a law simply saying a parent should be allowed to see what’s in the vaccine, list the ingredients, and that got vetoed. Why are we not allowed to see what’s in the vaccines?\n\nWhether or not this is about microchips injected right now, if you give up that control over your skin, your body, it can be penetrated by the government. There is nothing that stops them from injecting whatever they want into you and your child. You’re on the verge of becoming human ATM machines for the pharmaceutical industry. Hundreds of vaccines we are living just fine without, mandated by a government you are about to put into place, please, look into everyone you’re about to elect and say how much pharmaceutical money are they taking because I believe this is the end of freedom and democracy as we know it on this one subject.\n\nKimberly: I really appreciate that and I appreciate your clarity and your passion and your articulation of it. And I know that given that the candidates, certainly Bernie and Clinton, are both for mandatory vaccines (and they have stated that they are), suggest that notion right there of whether or not it’s voluntary participation is a huge one.\n\nI want to say that my hope has to do with something that I think every single person can do because to me organized people are the only thing more powerful than government or the money or the pharmaceuticals - the only thing. In the same way that it’s like this pattern recognition that you describe. That’s was absolutely what happened for us in our education and researching in what ended up becoming THRIVE. It was the pattern recognition. I used to say, ”We should send this to some statistical analysis and see what are the chances that this could be happening randomly” until finally I was just like again and again and again and then, I got it.\n\nBut, the one thing that every single person can do, whether you vote, whoever you are, is to listen differently when someone tells you something that shakes your worldview because one of the things that, you know, I cried listening to Polly in the movie say that a friend of hers had mentioned that there might be problems with vaccines the morning that she was going in to get it. And her initial response was “that’s nuts”. That has happened to everybody. In the course of our awakening, there’s that first thing that somebody says that sounds outrageous, like that the CDC could be manipulating this data or these people who we’ve entrusted our entire lives to we’ve been born and raised with a certain belief about that they’re here for us, and the earth shakes as our worldviews change.\n\nAnd they don’t change overnight. They require that we are able to hold conflicting ideas in our minds and in our hearts at the same time. It may be maybe I’m going into this appointment and doing what I’m told, but maybe I need to look into this. I don’t know yet. I am in a state of not knowing as I investigate this and choose for myself. The thing we can do is to greet each other differently because it’s not just with vaccines. It’s with money. It’s with media. It’s with education. The government. You name it. When you pull on the thread, it’s a heart-wrenching and earth-shaking experience and I think that this notion of a hassle free zone, that we need to learn how to break out of this place, where if we stay right here, we think that it will be comfortable, but as every parent with an autistic child who just did what they thought they were supposed to be doing can say, this is not a trouble-free zone. This is the zone that either sacrifices our human experience as we’ve known it and cherished it or not.\n\nSo, however we relate to the presidential candidates, which is one of the hottest topics, I am still a big believer in people, individuals, and it’s because I think we can change this. The next time somebody says something that seems outlandish, wait a minute. Don’t shut them up. Ask them how did they come to that? What makes you think that?\n\nI think one of the most challenging things about my experience in making THRIVE, I never expected the head of the Illuminati or the CDC to feel good about what I was doing. I didn’t, however, worry about what an old friend would worry about thinking about me or my kids’ friends’ parents, what they were saying behind my back that ended up landing on my children. That’s where the pain of all of this lives and that’s what makes having courage harder to come by. I think more people would make courageous choices if our friends and family didn’t make it so difficult for us. I really encourage individuals to just wait a minute and consider something different because everything is at stake in that and that is something that spans every religious, political, and other affiliation and just becomes part of what we need to do now in becoming responsible citizens and human beings.\n\nAndrew: I’ll just say, very briefly, you’re absolutely right. I used to say to my medical students when I was teaching, I’d say, “Half of what I am telling you is right and half is wrong. The problem is I don’t know which half is which. So, it’s up to you to tell me.” You can’t be frightened. Doctors have to learn to say “I don’t know” and “I’m sorry” and they don’t do that anymore and that’s a problem.\n\nOn the film, you’re quite right: organizing people, and this film acts as a rallying point for people. It’s, in the 20 years I’ve been in it, like nothing else I’ve ever seen. People who were crossing the road to avoid each other within the movement are now coming together in a big, big way. (And a shout out to Polly and Brian Burrows, who were on the production team, but are not here today. They’ve done a wonderful job.) It is a very powerful catalyst for change and it is a measure of how frightened the other side is of this film that they’ve done everything they can to stop it getting out there, which has backfired in a huge way. But, they are terrified, believe me. Right now, they are terrified of this film because of the truth that it brings and the rallying point that it creates for a previously disjointed and disparate community, which is huge, which is absolutely huge.\n\nOne of the things that Del mentioned, which has really struck me on this tour as we finish going around with this film and doing exit interviews and talking to parents and filming their stories, is the number of deaths. I never imagined in my lifetime that there were so many deaths. The reason we didn’t see this is because, of course, if your child dies, you don’t come back to the doctor. There’s no one to bring back to the doctor. If you’re part of an autism community, then you have a community. You search for ways together to treat your children and to interact with each other about the diet or this or that or the other, but if your child dies, then you melt away and grieve and isolation. So it was never obvious. And then we said, and Polly in particular said, “Come and tell me your stories”. And for the first time in 5, 10,20 years, parents came forward and said this is what happened to my child and the doctor dismissed it as coincidence, or the doctor admitted it was the vaccine, but said they would never tell anyone that in public, or just the sheer number of deaths. A compelling reason to do what we do and really, just personally for me in all my experience, a terrible tragedy.\n\nFoster: On that note, I want to continue a little bit with what Kimberly was saying given a larger context from the THRIVE perspective and I want to make it very clear that I’m representing my view and not Del’s view or Andy’s view on this. But, for people who are waking up to the larger picture, when you focus down the way this film does on a particular pattern of corruption in particular, in this case health, the results are so stunning. How can this possibly be? But, I’ve spent the last 25 years looking at all of 12 major sectors of human endeavor and I was shocked to find not only is this true in every sector with the level of corruption and the violence and the suffering and so forth, but when you follow the money, as Kimberly taught me to do from her journalism background, it continues to lead to back to the same people and the same institutions. We’ve seen this looking at food, looking at education, looking at finance, especially, because that’s the one that allows them the power to do it in all the others. But also, in media. Also, in energy. Whistleblowers try to come out and they get slandered. Often times, they get killed.\n\nThe key point here is if you keep going back those streams into the headwaters you find, actually, that it’s a relatively small number of people…that this is a very old agenda, which sounds like a bad James Bond film. I can’t not say that it has to do with a simple agenda to control the world and they do it through the media. They do it through propaganda and education. They do it through toxins in your food and water and your air. And they do it through controlling your bodies through a corrupt health system. And, that it’s not just about money. That’s how you manipulate the people who are actually imposing the agenda, But, the ones designing and funding the agenda are much higher on the ladder. They don’t need money. They’re the ones actually printing money.\n\nSo, what’s their agenda? We lay it out in THRIVE that there is an agenda for control in the hands of real psychopaths and sociopaths who have risen to the tops of these various silos of power because of their willingness to sell out their integrity and they end up then just working for the agenda, what we call the Global Domination Agenda, not out of a sense of what’s good for the patient. What’s good for the students. What’s good for the person needing the food. They’re operating from this agenda of how can we take over peoples bodies, take over their property, take over their lives and then depopulate to a certain extent so they’re easier to control.\n\nI’m kind of stunned once again (though I would have anticipated in what you’re saying, Andy) about not only is it the suffering and the sickness and the debilitation, but that there’s this surfacing information about the number test. Well, I claim that is not unintentional. That’s part of the same program with the wars, and the radiation, and the chemtrails, and the GMO’s. Look at the effect that it’s having and look who are the ones funding these and that will help us not only wake up to it in every sector, but to be willing to stand for the truth, join together effectively, and turn this around.\n\nI put you guys in the category of Manning, Asange, Snowden, Drake, Rife, and the other people who have really changed life for human beings by being willing to come forward and have your fidelity to reality and be willing to risk whatever it takes to actually stand for the truth.\n\nI know Kimberly wanted to ask you about what that’s been like for you and then we’ll go onto what can we all do about this.\n\nDel: I just sort of want to jump on a couple things you said and I think that…I was just watching THRIVE again to remind myself of the work you’ve done, because it had been some time, and I just thought we get this question a lot. Is there an agenda? Is there eugenics going on? What is the reason these vaccines would be so problematic? We sort of shy away from getting into that because, I say, what difference does it really make? You’re being poisoned. That’s what it’s about and the reasoning, you know. But I have to say, watching THRIVE again, I thought I better turn this off or I’m going to start this interview so angry.\n\nBut, you look at the future. The future of the pharmaceutical industry is vaccines and one of the things that Andy and I have been talking about is this HPV Gardasil vaccine. This is really sort of brand new. This is one of the first new vaccines on the market and you look at the problem of it – the shutdown of women’s ovaries. We’re destroying women’s ovaries with this paralysis in women and you do have to wonder, if your agenda is to sort of bring population down, what a convenient side effect that one of the things these women are suffering is, really, the loss of their ovaries. It certainly is in my mind.\n\nI want to ask you a question though very quick because, in THRIVE, you’ve covered sort of every sector. I say publicly that this film is another one of the stories we’ve seen of the banking industry taking our houses and destroying the middle-class, energy, corporations that don’t pay taxes, pollute, get away with it… this whole thing, and you’ve covered it all. I’m just curious, is there another topic, because I feel like, you know, I was a progressive liberal most of my life. They will talk about banking. You’ve got the 1%. We’re all willing to have that discussion. We’ll talk about the environmental effects of the oil and gas industry and what seems to be sort of the of squashing of new energy systems. We’ll talk about Monsanto and GMO foods and herbicides. But we cannot talk about vaccines. In your experience of discussing this, is there another topic that they’ve so completely managed to make us terrified talk about?\n\nKimberly: I would say the hottest other topic has been the notion of true liberty to control our lives. That these issues, all of them, have to do with are we voluntarily able to make a choice about what we participate in, whether it’s education, whether it’s this kind of healthcare, whether it’s this kind of vaccine? On any issue, what is our agency to determine our lives? We have what we call the zero-aggression or Non-Aggression Principle that guides all of the solutions that we see that transcend the political system and all the rest and come down to principles and the core principle, the one thing that every single person on the planet agrees to, is that they don’t want to be violated against their will. Right? Some want to be violated, but not against their will. Some think that they should be able to violate others. But, the one bottom line and If you think about what that means, that there’s actually something that everybody agrees to, that’s huge.\n\nThat’s the only thing that I know of that all people agree to and yet, when you actually carry that out and say if we could abide by that, everything would change. Right? So let’s talk about that. Let's look at this because if we keep on doing this thing where we’ve got one group in power that keeps dominating the rests and then that and then this, it’s like this thing is so far down the wrong path that we actually need to unearth a completely different conversation the way we do with vaccines. This is not something to dabble in.\n\nSo, I think that you’re onto, I mean, to me, I’ll do anything for this movie and this message to get out because I think it is the critical issue that gives somebody a way to take this concept of liberty and put it down into a day-to-day action that affects the human population right now. It’s whether or not we own our bodies. Do you have the right not to be violated against your will? And the fact that you can’t even know what’s in something that’s now mandated to go into you, I mean, if you’re for it, have it. That’s not the point. The point isn’t if you’re for or against it. Are you able to make these choices for yourself?\n\nAnd that’s the conversation that we’re really exploring most deeply and it’s the one that runs into the oversimplification of issues. This whole thing about pro or anti-vaccine. I remember when Clear Channel introduced this little three minute news synopsis in the classroom when my kids were in school and I said this is really dangerous. These issues can’t be discussed in three minutes and I don’t want my kids thinking they’re informed because they got some propaganda blasted at them in three minutes. We need critical thinking.\n\nOne thing relates to another and critical thinking is the heart of it and my hope comes from people like you in the film that you made because it gives concrete actions that people can take any points out that there’re things that each one of us can do, whatever your inclination, whatever your passion, whether you think vaccines are great, you want it, you want your kids to have it, you can still agree that it should be anybody’s choice because sooner or later there will be an issue you don’t want mandated, Whether this is it or not, that’s guaranteed. These things only propel further, like with the chipping or whatever it is. My answer is it’s whatever shakes your worldview and that you don’t have the experience of critical thinking or the network of support.\n\nOne thing I just want to make sure to include is acknowledgment of your families and the people who have stood by you as you’ve made these choices because those people are critical. I honestly don’t know…I couldn’t have done what I’ve done without Foster. I don’t think he could have done what he’s done without me. Just to be able to have that sanity and moral check that this is the right thing to do even though it means a lot of pain and hardship and risk.\n\nFoster: I totally agree with Kimberly is saying and I would just add one point before we go on to what we can do about it, which is in addition to this liberty principle which we’ve found underlies all of the constructive solutions, it needs to be accompanied by personal liability. It’s not that everybody can do whatever they want. They can do whatever they want as long as it doesn’t harm anyone else’s person or property. For instance, if you’re free to choose the education of your choice, then you can walk away from a propagandized school and you don’t have your money stolen to propagandize other children. In finance, if you have a true free market, you don’t have to do anything that doesn’t feel like a win-win situation to you and, if you do, if you commit counterfeit or fraud or something like that, you’re personally liable. You’re not protected by government or cronyism or for corporate limited liability or something like that. Obviously, it comes back to this vaccine issue, that if somebody wants to inject this kind of stuff into their own body, that’s fine, but everyone should have truely, deeply informed consent. It simply comes back to the key word, is it voluntary or not?\n\nWith the time we have left, I’d like to move in to ‘what we can do about it?’ I was thrilled to see how proactive you are being about that. It wasn’t just during the credits, call your congressman, or something like that. You actually laid out the beginnings of a useful agenda and I saw, Del, in one of the interviews that you did when you were talking with the UC regents and then the interview that you did with ABC, it looks like that a bunch of these things are starting to happen already.\n\nAndy, I would really appreciate if you would start and lay out what you think would be the most effective steps, strategically, and then we’ll move into, tactically, what can each one of us doing our own lives to help.\n\nAndrew: I’ll be very brief, given the time we have left, but here are the action points on the film:\n\nWilliam Thompson must be called before Congress with his colleagues who committed the fraud, right up to the hierarchy of the CDC at the time, to tell the truth under oath. That’s absolutely essential. That does not get beyond of the series of hearings though without the need for legislative action. So what needs to happen then is laws need to be enacted and laws need to be demolished. The 1986 Vaccine Injury Compensation Act, that needs to be demolished because it is iniquitous and extremely dangerous, giving indemnity to the pharmaceutical industry for the products that they make. The bill that needs to be enacted is, at the very least, a modification of the Weldon-Maloney bill to get vaccine safety science completely out of the CDC, completely out of the Health and Human Services, into an independent agency. Beyond that, vaccines must all be voluntary and their administration must be based on fully informed consent and that consent goes a lot, a lot further than what is given now.\n\nIn terms of the movie, there are two things that caused the success of this movie beyond it’s withdrawal from Tribeca and thenDe Niro’s endorsement of the film. It’s the grassroots organizations, getting a grassroots mobilized to get to the theater, to get their friends and relatives to the theater. We now find a ratio of about 2/3, with about 2/3 of the audience to whom this is a new story and that is exactly the target audience.\n\nSo, the grassroots organizations being mobilized and the movie makers being there. One, two, three of us, all of us, being there to represent the movie and show not only do we care, but we want to go on answering questions on this. This is on a national stage at the moment. Del goes across the border to Calgary to take it into Canada in the next few days and then, it must move beyond that. I’m writing up a template for India at the moment where there are 10.4 million children with autism with no infrastructure whatsoever and to take not only the film there, mobilize the grassroots organizations, get the team there, but to offer solutions for how they might deal with the autism problem going forward. So, not only to present the problem, but solutions to how to deal with that problem in a way that is manageable and tangible for people living in the circumstances that they live in and to use that template for going elsewhere in the world in a series of ambassadors to Vaxxed to coordinate these efforts with local distributors so that it actually is meaningful beyond just the film. It has to be meaningful to these people beyond the film so that those are where we really, really need help.\n\nFoster: I think you had also suggested, I remember from the film, that one easy step-not from the vaccine industries point of view, but a very concrete step - is just to make the Measles, Mumps, and Rubella separate vaccinations so that people aren’t getting this triple threat and in such large doses. And then I think you also mentioned classifying vaccines as pharmaceutical drugs so that they would be tested accordingly rather than this kind of slippery slide in that the vaccine companies have now.\n\nDel: That’s the most shocking discovery for me. I did not realize that vaccines are not been tested the same way drugs are. They aren’t going through long-term safety tests with placebo-based studies. We are asking for one very simple study to be done and that’s the vaccine versus unvaccinated population study. This is the easiest study you can do. Anytime someone tells me the studies prove vaccines don’t cause autism, I say I want to see ones study. It’s the study almost every drug we take goes through and that is what happens to the group that doesn’t take the drug? That’s just your basic scientific study. Half the group takes it, half doesn’t. We know that every chiropractor in this country didn’t vaccinate their child. Every one of them, I think, would put their children forward for a study to say, is the rate of autism among the unvaccinated 1 in 45. Is the rate of asthma up to 20, 30, 40%? Are there deadly food allergies? What is your rate of multiple sclerosis? What is your rate of ADD/ADHD? All of these questions, we could get that study done inside of a month and you have to ask yourself why isn’t this CDC doing the most obvious, easy study known to man?\n\nI would say there’s a lot to do here, but, for now, what were really asking people is go to our website, vaxxedthemovie.com. Be aware of where it’s screening because every time we fill a theater, we open up in another city. Right now, what is giving us the power is the people, the people understanding this is an issue, and being in theaters gets what is spreading this message right now. It’s so important that we continue to spread that message because that’s why I got an hour and a half meeting with Jason Chaffetz in Washington DC. They are afraid of this film. They are afraid of the visibility and, as you know, once we’re done with the theatrical run, that sort of sets your foundation, then when we drop online and make it available to every body, it’s that many more people that knew to look for it. Right now, the protest is this film. And, bring your friends. See it. It’s very clear. It’s not what you’re been told.\n\nI really want to speak to what Kimberly said that I think we get too caught up in who’s the problem? Who’s doing it? This is what the news has used against us. This is how they’re manipulating us. They’re making us argue each other over who’s the problem instead of having conversation at our dinner tables, at the Thanksgiving tables, at our family gatherings, ‘What are the issues?’ I think, if you take away who’s doing it, you start realizing, wait a minute, we are all actually in alignment on 90% of the problems in this country. We want liberty. We want control of our bodies and our lives. If we stop getting caught up in Fox telling me it’s this guy and MSNBC telling me it’s that guy and screaming about who’s causing the problem, we realize we are the ones in power. We are the people of United States. We are the citizens that build this country, that make this country. We are the ones in control, but we have to talk. We have to open our minds. We have to be able to listen to the other side and what you’re going to be surprised to find is that you actually agree more than you disagree. It’s this idea that we’re so opposed to each other that we shouldn’t even bridge the conversation, that’s where the media has won. That’s where our government has won. That’s where the corporations and the power systems are winning. They are teaching us to not talk to each other. Stop it! Talk! Communicate. That is the power of the people\n\nFoster: Thank you. In terms of what people can do to assist you with this, let me ask a few specific questions. First of all, if people want to send their friends to see the movie, where do they send them now? What’s the status of that?\n\nDel: we are in 55 or, I think, 60 cities. We are opening up in six more we found out about yesterday. We are trying to get every market in the country, but the best way to follow that, because we are on the road, I can’t even tell you the list is so long, but if you go to our website, you can see every theater we are opening in, where were going to be, and that’s the best way to track where the film is coming and see where we’re going to be doing Q and A’s. Although I’d caution people We really want to fill the theaters. Go opening night. Go to the second night. And then come back to see the Q and A, because it’s the film. We worked for a year on every Word of this film. You don’t need to hear us talk about it to get the power of it. So that’s it. Go to the website. Check it out. And join our mailing list because we are using that to focus tactical approaches towards congress people that we know are wavering or that we are having influence on. I want you writing your politician and jumping in, but we can focus that if we can get to you and say, look it, “right now contact this congressman right now”, and we can only do that if you join our newsletter.\n\nKimberly: It’s vaxxedthemovie.com and we will put a link to that below this blog and we’ll also keep on posting about it and your work and your schedule through thrivemovement.com so anyone who signed up for us can stay connected to you also.\n\nFoster: And we’ll put links to some of the other interviews that I had talked about. They’re very powerful. Particularly, Del did an interview with ABC a night or two before the opening of the Tribeca Film Festival when he thought the film was still going to be in the festival, so it’s particularly poignant. He’s thanking them for their courage and so forth and then they totally chicken out on the whole thing, much to Robert De Niro’s embarrassment and chagrin. But then, someone was recording his side of the interview so it’s a fantastic talk that he gives of which ABC ended up using five seconds, but you can actually see behind the curtains to the rest of the picture, So we’ll link to that and the UC Regents testimony and to our THRIVE blog on this topic, which gives a lot of the history back through Merck and I .G. Farbin and the Nazis and the Rockefellers to lay out a little more of the understanding of yes, people do this kind of thing and it can happen here. It already is happening here.\n\nMy last question before we wrap up is one of the things that’s helped THRIVE spread around the world is we brought it out in 10 languages, dubbed, and then 17 other countries asked permission to translate it themselves and we gave them permission as long as they let us review the final product with an expert in that language to make sure that it still said what we wanted to say. Do you have any plans for translation because, obviously, vaccines are an issue all over the world?\n\nAndrew: Yes, we do and, in fact, it’s being translated into Italian as we speak and into Spanish as we speak, so we’re looking for help with translation elsewhere. We have a translator for Hindi in India, but if there are other people who are fluent and capable of doing this, that would be enormously helpful. Clearly, given the precise nature of the film and the importance of the language used, it has to be done to a very high degree of accuracy, but that notwithstanding, help on that would be gratefully received.\n\nFoster: After your theatrical screenings and film festivals and so forth, will the DVD be available then?\n\nDel: Yes, that’s in development right now. We are just doing the finishing touches on the DVD. We are very soon going to be releasing it streaming online first and then the DVD will be behind it and then of course your usual suspects, the sort of on-demand approaches towards it. Absolutely, we plan on getting this into every household in this country and then around the world and that’s going to be coming very soon. We want people in the theaters, but we also want to get it to the people, so we are working around the clock to make that happen at the right moment and the right time.\n\nFoster: Fantastic and, as Kimberly said earlier, we will do everything in our power to help you do exactly that.\n\nKimberly: I just have to say, Andrew, I am so grateful that in the face of the personal attacks and the pain of dealing with that, that your response has been this: to mobilize such an intelligent, effective, engaging way for people to recognize not only the validity of what you’ve been doing all along, but the absolute critical nature of this issue. When you see people sometimes, they don’t have what it takes to get through the level of onslaught that you’ve experienced and they end up depressed and quiet and that you’ve been able to respond in this way, the best imaginable response, and I’m so grateful to it and I have thought many times about the people who are called out in this and I’m really, really grateful that it will be that people will recognize that they will be held accountable for the decisions that they’re making, including the slandering of people who are devoting their lives and expertise to unpacking these important issues. So, thank you for whatever it is in you allowed you to stay with it and come back in such a constructive way. And also, Del, to you for your passion and competence.\n\nAs producer and director of THRIVE, I also just want to say I know what goes into producing and directing movies and I think you did a fantastic job. I’ll be in touch outside of this to see ways in which we might help with promotion and everything else that we can do to help spread this most important film that you’ve made.\n\nFoster: I echo all of that and I’d just like to close by giving you each, starting with Del, an opportunity to just offer a succinct, core message to our network and all of the people beyond that this recording will go to.\n\nDel: I would just say that the time is now. This nation needs every one of us. It’s we, the people, of the United States of America. We are looking at the corporate takeover of our country, of our government, and we have got to stand together now. We have got to see the similarities in all of these issues, that not one of them stands free of corporate influence. This is just another story like the others, but it is a very powerful story because we have an insider. We really have an inside voice showing how the government is colluding with corporate interests and this time they’re poisoning our children. They’re destroying the lives of families across this country and across the world. So, please see the movie. See it for yourself. Take the information and then stand with us. Tell your story. Tell the truth. We need to use social media because our media is leaving us in the dark. And, I would just say, know that you are a powerful, incredible being designed by evolution or God (owever you want to look at it), but we are perfectly created beings with incredible minds and incredible understanding. We just need to stand together and realize our power and nothing can stop us.\n\nFoster: Well said. Thank you.\n\nAndrew: I have two comments in addition to that. I think Kimberly captured it in her opening statement about the voice inside her when she went to the doctor and said, “Do not do this. There is something wrong.” Mothers need to trust that instinct. It is the most powerful force on earth. It is the reason that we are here now - not medicine, not public-health, but the maternal instinct. The innate knowledge of when your child is ill and when they’re well and that, please, trust that voice.\n\nThe other is for the medical profession because they don’t get off scot-free at all. I’ve heard so many stories about the appalling ethical violations committed by my colleagues during the course of the screening of this film. Doctors need to understand that we don’t understand, that we don’t know, that it’s okay to say ‘I don’t know’ and it’s certainly important to say ‘I’m sorry’ and not only ‘I’m sorry’, but ‘I won’t do that again’. We need to go back to trusting in parents. The art of medicine, and that’s where it begins, the art of medicine is taking a history and examining the patient, listening to the story. What happened to this child? That is the beginning.\n\nThose are my two messages. Beyond that we are enormously grateful for you having us on the show and for your offers of help going forward and, as Del said, “now is the time”. We may never get another time like this in our history, so we seize it or we do not at our peril.\n\nFoster: So well said. Thank you so much. My message to our network would be, ‘see this film’. It’s not an easy film to watch, but it’s a wonderful and profound and life-changing film to watch. And then have the courage to tell your friends about it. And as all of this is happening, eventually this will be on DVD and you can hold the home screenings and invite your friends in, watch it, and then, discuss it together. And then, organize in your communities, in your parent associations, at your schools. And talk to your politicians, but don’t expect that they’re going to handle it on their own. Keep going no matter what. Just include them in the conversation. And then, this will be available on iTunes and Hulu and on the Internet, streaming, and so forth. Just keep spreading the word because this kind of transformation is critical and starts with the truth and these guys have been willing to seek it, to find it, and to tell it so beautifully.\n\nThank you all. I really appreciate it. Good luck with your tour.\n\nKimberly: Yes. Thank you so much. We’ll be in touch for sure.", "opengraph": {"type": "cause", "site_name": "Who Owns Your Body? | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/613/original/Screen_Shot_2016-07-01_at_9.40.47_PM.png", "title": "Who Owns Your Body?", "url": "http://www.thrivemovement.com/who-owns-your-body.blog", "description": "Do you own your body? OR do the government and the corporations control it? If you want your child to be vaccinated, you can get them vaccinated. The problem is that if you don’t…"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}