{"result_id": "316042", "URL": "http://www.thrivemovement.com/covert-de-population", "timestamp": "2023-04-25 17:42:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/covert-de-population", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Covert De-population | Article", "cleaned_text": "The notion of intentional depopulation is difficult to consider. I wrestled with whether to include it in the film and on this site. I am taking the risk of discussing it because I believe that we will not be sufficiently astute in our assessment of what is going on until we allow for the possibility of this perverse reality. Food and water additives, aerial spraying, contaminated vaccines, man-made weather catastrophes through HAARP, and endless wars look different through the lens of depopulation, and the dangers – and our responses to them – can become more informed and leveraged when we dare to face the documented evidence that exists beneath the lies we are told. See the Resource Tree at the bottom of this page for books and links to facilitate your own inquiry.\n\nEugenics and de-population programs were initiated by powerful families including the Rockefellers, Carnegies and Harrimans at the beginning of the 20th century. Their work inspired later dictators like Adolph Hitler to cull undesirable portions of the populace.[5]\n\nWe have been schooled to focus on Hitler as a unique madman who somehow got control of a whole nation by himself, but as is usually the case, it is well documented that Hitler was himself a puppet figure for the international banking cabal that wanted to overthrow Stalin.[6]\n\nThe genocidal agenda of the Nazis was forced underground after the defeat of the Germans and their convictions at the Nuremburg trials, but a similar agenda is re-surfacing all around the world in less obvious forms of aggressive elimination of large numbers of people.[7] In fact, many Nazi rocket scientist and mind control experimenters were brought to America under a covert CIA program called Operation Paperclip.[8]\n\nThe anonymously created Georgia Guidestones in Elbert County, Georgia, USA, have enshrined the idea that 500 million people is the number that the Earth can sustain.[9]\n\nWhat methods might the elite be using to involuntarily get rid of people? My research leads me to believe that the vast amount of illness, sterility and death due to the following human created afflictions is no accident:\n• in our atmosphere (See Environment Critical Issue section on HAARP)\n• man-made weather catastrophes, earthquakes and volcanos and tsunamis (See Environment Critical Issue section on HAARP)\n• in our bodies and in our waterways\n• like the Swine Flu, Lyme Disease (Lab 257. Carroll, Michael C.) and AIDS (DNA: Pirates of the Sacred Spiral, Horowitz, Dr. Leonard)\n• like the anti-tetanus one laced with B-hCG, which when given in a vaccine, undermines women’s ability to sustain a pregnancy. The whistle has been blown on this type of covert sterilization in Mexico, the Phillipines, Puerto Rico and various countries in Africa. The dissemination of this vaccine was initiated by the Rockefeller founded Population Council and promoted through UNICEF, with funding from organizations like the Gates Foundation (http://www.youtube.com/watch?v=4VG4WibFBPs) and Procter & Gamble (http://www.godlikeproductions.com/forum1/message760430/pg1).\n\nThe tragic irony, to me, is that evidence is strong that populations tend to stabilize when they have access to prosperity and education, not when they are undermined or attacked.\n\n“Diet, injections, and injunctions will combine, from a very early age, to produce the sort of character and the sort of beliefs that the authorities consider desirable, and any serious criticism of the powers that be will become psychologically impossible. Even if all are miserable, all will believe themselves happy, because the government will tell them that they are so.” – p62 “Gradually, by selective breeding, the congenital differences between rulers and ruled will increase until they become almost different species. A revolt of the plebs would become as unthinkable as an organized insurrection of sheep against the practice of eating mutton. (The Aztecs kept a domesticated alien tribe for the purposes of cannibalism. Their regime was totalitarian)” – p63 \"At present the population of the world is increasing ... War so far has had no great effect on this increase ... I do not pretend that birth control is the only way in which population can be kept from increasing. There are others ... If a Black Death could be spread throughout the world once in every generation, survivors could procreate freely without making the world too full ... the state of affairs might be somewhat unpleasant, but what of it? Really high-minded people are indifferent to suffering, especially that of other peoples. Here are three ways of securing a society that shall be stable as regards population. The first is that of birth control, the second that of infanticide or really destructive wars, and the third that of general misery except for a powerful minority…” p18\n\n - Bertrand Russell – The Impact of Science on Society, 1953\n\n \"...we are in the process of developing a whole series of techniques which will enable the controlling oligarchy who have always existed and presumably will always exist to get people to love their servitude.\" \"...there is evidently a whole class of drugs effecting the CNS [central nervous system] which can produce enormous changes in sedation in euphoria in energizing the whole mental process without doing any perceptible harm to the human body, and this presents to me the most extraordinary revolution. In the hands of a dictator these substances in one kind or the other could be used with, first of all, complete harmlessness, and the result would be, you can imagine a euphoric that would make people thoroughly happy even in the most abominable circumstances.draft of their ‘Global Biodiversity Assessment‘ states there must be a reduction of five billion people.\"\n\n - Julian Huxley, Berkeley, 1962 \"...we have about 50% of the world's wealth but only 6.3 of its population... In this situation, we cannot fail to be the object of envy and resentment. Our real task in the coming period is to devise a pattern of relationships which will permit us to maintain this position of disparity without positive detriment to our national security. To do so we will have to dispense with all sentimentality and daydreaming; and our attention will have to be concentrated everywhere on our immediate national objectives. We need not deceive ourselves that we can afford today the luxury of altruism and world benefaction...? We should stop putting ourselves in the position of being our brothers' keeper and refrain from offering moral and ideological advice. We should cease to talk about vague ... unreal objectives such as human rights, the raising of the living standards, and democratization. The day is not far off when we are going to have to deal in straight power concepts. The less we are hampered by idealistic slogans, the better.\"\n\n - George Kennan, Top Secret Memo PPS23 to the Secretary of State, 1948 In \"The First Global Revolution,\" published by The Council of the Club of Rome, an international elitist organization, the authors note that: \"In searching for a new enemy to unite us, we came up with the idea that pollution, the threat of global warming, water shortages, famine, and the like would fit the bill. All these dangers are caused by human intervention ...The real enemy, then, is humanity itself.\" 16\n\n - The First Global Revolution, Club of Rome, 1991 “Inaction today could mean that more drastic steps, less compatible with individual choice and freedom, will seem necessary tomorrow to slow population growth.”\n\nWorld Bank 1984 World Development Report “...whereas death control is extremely easy under modern circumstances, birth control is extremely difficult. The reason is very simple: death control – the control, for example, of infectious diseases – can be accomplished by a handful of experts and quite a small labour force of unskilled persons and requires a very small capital expenditure.”\n\n - Aldous Huxley, 1959 “U.S. policy toward the third world should be one of depopulation”\n\n - Henry Kissinger, 1978 For an in-depth history of Eugenics and the agenda for de-population, see the film, Endgame, by Alex Jones.", "opengraph": {"type": "cause", "site_name": "Covert De-population | Article", "title": "Covert De-population | Article", "url": "http://www.thrivemovement.com/covert-de-population"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "315", "embed_code": "<iframe width=\"420\" height=\"315\" src=\"https://www.youtube.com/embed/FByyHoFd3U8?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/FByyHoFd3U8?rel=0"}], "links": ["http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/626/original/gda-georgia-guidestones.jpg", "https://www.amazon.com/Fluoride-Deception-Christopher-Bryson/dp/1583227008", "https://www.youtube.com/watch?v=Q3y8uwtxrHo", "https://www.amazon.com/What-World-Are-They-Spraying/dp/B00483VQTE", "http://www.carnicom.com", "../../../the_12_sectors-environment", "../../../the_12_sectors-environment", "https://www.amazon.com/Seeds-Destruction-Hidden-Genetic-Manipulation/dp/0973714727", "https://www.amazon.com/Best-Democracy-Money-Can-Globalization/dp/0452283914", "https://www.amazon.com/Lab-257-Disturbing-Governments-Laboratory/dp/0060011416", "https://www.amazon.com/Dna-Pirates-Leonard-G-Horowitz/dp/0923550453", "https://www.youtube.com/watch?v=4VG4WibFBPs", "http://www.godlikeproductions.com/forum1/message760430/pg1", "http://www.endgamethemovie.com/"], "authors": [], "publish_date": null}