{"result_id": "316015", "URL": "http://goo.thrivemovement.com/lost-and-recovered-history-non-aggression-principle.blog", "timestamp": "2023-04-25 17:41:51 CEST+0200", "meta": {"description": "This is the most important conversation on the planet and it’s not going away.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/lost-and-recovered-history-non-aggression-principle.blog", "encoding": "utf-8"}, "image": null, "domain": "goo.thrivemovement.com", "title": "The Lost (and recovered) History of the Non-Aggression Principle", "cleaned_text": "Strange as it may seem, more challenging for me even than talking with people about Free Energy, conspiracies, banking schemes and ETs, has been exploring in-depth the one thing everyone we have spoken with agrees upon!\n\nThe Non-Aggression Principle — which says that no one has the right to initiate force against another except in true self-defense. It sounds obvious, right? Kind of like the Golden Rule…but it is actually beyond that. Maybe someone doesn’t want to be treated the way you want to be. The special power of the N.A.P. is that it is a rule, not just an aphorism. I believe it is enlightenment boiled down to the primary guideline for human relating. It doesn’t make anyone do anything, but it claims the right for everyone to protect themselves and others from rape, assault, murder, theft, fraud and counterfeit — even if the violation is by a so-called “government” or its tax collecting “authority.”\n\nNo one wants to be violated against their will, and my research has shown me more and more that this is the compass by which humanity could build a truly sustainable and thriving condition for all beings on Earth.\n\nSome folks ask me if this was my idea. Far from it. I was awakened to this thinking by my son, Trevor Gamble, author of The Secrets of Nonviolent Prosperity: The Principles of Liberty (paid link). And there are the luminaries of modern times from Ludwig von Mises and Murray Rothbard to Stefan Molyneux and Larken Rose. But the liberty perspective is not just someone’s clever idea. It is a logical consistency, a universally applicable moral truth that forms the basis for common law, and has been unveiled by courageous and dedicated philosophers of virtually every era and from all over the world.\n\nIt’s the application of the Torus awareness at the human scale. The torus form depicted in THRIVE represents the blueprint for sustainability at every known scale of the Universe. As the torus is the form of the hydrological cycle of rain and evaporation,\n\nand the pattern of all working devices I have seen for harmoniously accessing plenum energy,\n\nso is it also the essential unit of energy wholeness for a human being.\n\nHonoring and stewarding this pattern of wholeness is the key to solutions to virtually all of the hundreds of issues being confronted by the Thrive Solutions Hub Network. The key to human justice is always guarding the wholeness of each individual human being — not sacrificing individual rights “for the good of the group.” This ruse — which underlies socialism, communism, fascism and even democracy — has led not only to vast human suffering and death, but also to the brink of extinction of life as we know it on our planet.\n\nI have written articles describing how this could work, and am in the midst of spelling out the details in a book I am writing. Meanwhile I want to share a glimpse into the thinking behind the Non-Aggression Principle.\n\nWhen I was preparing my talk for the recent Architects of the New Paradigm conference, I decided to check on the history of the “N.A.P.” and went to Wikipedia. I was delighted to find the list that follows, which saved me countless hours of research, but two days later the list had been taken down by some nefarious “editor,” who apparently didn’t want this awareness of the thread of freedom thinking through the centuries to be commonly available. Fortunately, I had copied it into another medium. So here I present it for your inspection, but also for your secure storage!\n\nI want people to have this list on hard drives worldwide so it doesn’t disappear. Consider it and spread it around. Ask yourself why such thinking has been continually suppressed in one civilization after another.\n\nOne of the reasons for THRIVE’s unprecedented popularity as an independent documentary is that the solutions strategies are based on Principles instead of Politics. When economies and ecologies worldwide are collapsing and, in the US, the presidential candidates are the two most disapproved in history, the approval rating of Congress is at 18% and the number who trust mainstream media is at 6%, more and more people are waking up to the notion that it is the concept of a few ruling others that should be logically and ethically called into question.\n\nBut how could it work without a Nanny State or a Daddy State imposing its will on each of us? There would be organizations and hierarchies, because they work, but, unlike the “state,” THEY WOULD BE VOLUNTARY. Independent dispute resolution organizations, security organizations and insurance companies would have to compete for reputations of trustworthiness, efficiency and non-violation. Violators would be prosecuted and need to make restitution to the victims, not a government.\n\nThe details are too vast to go into here, and that’s why I am writing the book after 10 years of research have convinced me of the viability and necessity of this path — if we are going to make it. Here is another article I wrote that helps flesh it out for those who are sick of corruption, deception and tyranny.\n\nHow do we get from here to there? Here’s a possible path as depicted in THRIVE.\n\nStay tuned. This is the most important conversation on the planet, in my experience, and it’s not going away. In true freedom lies our creativity, our fulfillment and our future. And it can work.", "opengraph": {"type": "cause", "site_name": "The Lost (and recovered) History of the Non-Aggression Principle | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/610/original/torus-man-128.jpeg", "title": "The Lost (and recovered) History of the Non-Aggression Principle", "url": "http://www.thrivemovement.com/lost-and-recovered-history-non-aggression-principle.blog", "description": "This is the most important conversation on the planet and it’s not going away."}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/hbqERVJnoVQ?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/hbqERVJnoVQ?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/vqnZRdBBV7c?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/vqnZRdBBV7c?rel=0"}], "links": ["http://amzn.to/2fjeNBC", "https://mises.org", "https://mises.org/profile/murray-n-rothbard", "https://freedomainradio.com", "http://www.larkenrose.com", "http://www.thrivemovement.com/solutions-liberty", "http://www.thrivemovement.com/solutions-toward-thriving-world.blog", "http://www.thrivemovement.com/solutions-liberty#solutions"], "authors": [], "publish_date": null}