{"result_id": "316033", "URL": "http://www.thrivemovement.com/views/ajax.sector-follow_the_money?tags=health,ftm", "timestamp": "2023-04-25 17:42:23 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "http://www.thrivemovement.com/views/ajax.sector-follow_the_money?tags=health,ftm", "encoding": null}, "image": null, "domain": "www.thrivemovement.com", "title": "", "cleaned_text": "The current health care system took root around the turn of the century when the AMA, Rockefeller Foundation, and Carnegie Foundation forged a partnership. They put their money into drug-based research and made that the main focus of “healthcare”. Since then, the Rockefellers and other prominent banking elite have been able to control and profit enormously from the drug industry. The AMA – which is the largest association of physicians in the U.S. – enforces the drug-treatment paradigm by heavily lobbying Congress and publishing one of the most influential journals, JAMA, which is largely funded by pharmaceutical advertisers. It is also engaged in suppressing alternative health treatments, such as the Royal Rife cancer cure\n\nHere’s a timeline detailing the suppression of alternative cancer cures and the Rockefeller Foundation’s role in shaping the healthcare industry:\n\nBased out of New York, this became one of the most “richly endowed” research centers. By 1928, John D. Rockefeller had given it $65 million in endowment funds.[1] This later became Rockefeller University.\n\nThis highly influential report, sponsored by the Rockefeller’s and Carnegie Foundation, evaluated medical schools and restructured American medical education. It set up a new standard so that schools could only be accredited if they showed an emphasis in drug based research and treatment. Homeopathy and other alternative approaches to medicine were no longer recognized. Abraham Flexner, author of the report, was on the staff of the Carnegie Foundation for the Advancement of Teaching. In 1910, 161 medical schools existed. By 1919, there were only 81 left.[2]\n\nThis laid the foundation for how health and science research and development were to be conducted. Many of today’s health institutions were modeled on this commission’s practices, policies, and research processes such as the UN’s World Health Organization, the U.S. Government’s National Science Foundation, and the National Institute of Health.\n\n“The Foundation identifies public health education as one of its principal areas of interest, and builds and endows the first school of public health at Johns Hopkins University.”\n\n1921 – Rockefeller Foundation Contributes $357 million [3] to Medical Schools Around the World\n\nThis spreads the drug-based approach to the most prominent schools around the world.\n\nIn the 1920s, Dr. Rife – a brilliant bacteriologist and former student of John Hopkins University – began researching and developing an alternative cancer cure.\n\nJAMA, the Journal of the American Medical Association, is one of the most influential medical journals in the world. As head of JAMA, Morris Fishbein, became one of most powerful, prominent men in medicine during the time. He transformed the industry into a money-making machine and used negative campaigns to squash competitors. He was one of the key figures to suppress Dr. Royal Rife’s cancer cure.\n\nHarry Hoxsey offers a natural herbal formula to cure cancer that thousands claim to have worked. This is the first of 17 clinics to eventually open.\n\nThe article scares doctors and researchers from being associated with Hoxsey.\n\n1927 – John D. Rockefeller Jr. Gave the First of his Annual $60,000 Contribution to Memorial (Sloan-Kettering) Cancer Center\n\nDr. Rife developed a machine that could neutralize disease-causing micro-organisms, including cancer cells, with the use of frequencies.\n\nIn 1932, Dr. Arthur Kendall, director of Medical Research at Northwestern University, spoke before the Association of American Physicians at Johns Hopkins University about the preliminary successes with Rife's methods and treatments of cancer. Dr. Thomas Rivers, virologist and bacteriologist, director of the Rockefeller Institute (a primary source of funding for medical research) and Dr. Hans Zinsser, called Kendall a liar to his face in front of the assembled crowd.[4]\n\nIn 1934 at the Scripps Institute in La Jolla, Southern California, Rife conducted clinical trials on 16 terminally ill cancer patients, and successfully cured all of them. A team of medical specialists – including Dr. Milbank Johnson, Chairman of the Special Medical Research Committee of USC; George Fischer of the NY Children’s Hospital; and Dr. Wayland Morrison, the chief medical officer of the Santa Fe Railway – confirmed the findings.\n\nPhilip Hoyland admitted to accepting a $10,000 bribe from Hahn Realty Group (AMA Agents) to sue the Beam Ray Corporation.\n\n1939 – New Memorial Sloan-Kettering Cancer Center Opens – John D. Rockefeller donated the land and provided $3 million of funding\n\n1940s – Rife’s Work Is Destroyed & Continues to be Suppressed\n\n1949 – Hoxsey Sues JAMA and Editors for Libel and Slander – Hoxsey Wins\n\n1960 – Hoxsey Method Banned in U.S. by the FDA\n\n1960 – Laurance Rockefeller Serves as Chairman of Memorial Sloan-Kettering Cancer Center in New York from 1960-1982\n\nThis center is one of the most influential cancer centers in the world. During WWII it performed some of the first experiments applying chemical warfare weapons to the “treatment of cancer”, which evolved into chemotherapy.\n\nIt continues to operate and claims an 80% success rate.\n\nThis is despite positive results from Sloan-Kettering’s own famous researcher, Kanematsu Suguira. In November of 1977 Dr. Ralph Moss, Assistant Director of public affairs at Sloan-Kettering, held a press-conference about the success and potential of laetrile, despite the centers desire to cover it up. Ralph Moss was fired the next day for “failing to carry out the most basic job responsibilities.”\n\nThe Foundation joins with the United Nations Development Programme, UNICEF, WHO and the World Bank to form the Children’s Vaccine Initiative (CVI).\n\n2010 – More Than Half a Million Americans Die of Cancer\n\nHe Who Pays the Piper – Creation of the Modern Medical (Drug) Establishment by G. Edward Griffin\n\n[3] According to the Rockefeller Foundation, this was $357 million in “current dollars”: http://www.rockefellerfoundation.org/who-we-are/our-history/1920-1929/", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["../../the_12_sectors-health#critical_issues/1049", "#ftn1", "#ftn2", "#ftn3", "#ftn4", "http://www.jesus-is-savior.com/Health_Concerns/Pharmageddon/drugs_and_big_money.htm", "http://www.preventcancer.com/losing/acs/wealthiest_links.htm", "http://www.naturalnews.com/026314_cancer_research_studies.html", "#ftn1", "#ftnref2", "http://www.jesus-is-savior.com/Health_Concerns/Pharmageddon/drugs_and_big_money.htm", "http://www.sourcewatch.org/index.php?title=American_Medical_Association", "#ftnref3", "http://www.rockefellerfoundation.org/who-we-are/our-history/1920-1929/", "#ftnref4", "http://educate-yourself.org/cn/rifetimelinemay1998.shtml"], "authors": [], "publish_date": null}