{"result_id": "316019", "URL": "http://www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers", "timestamp": "2023-04-25 17:41:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Thrive Filmmakers Respond to Letter of Dissociation", "cleaned_text": "As some of you may know, ten of the people interviewed in our movie, THRIVE, have recently signed a public letter of dissociation from the film. They include Deepak Chopra, Duane Elgin, Amy Goodman, Paul Hawken, Edgar Mitchell, John Perkins, John Robbins, Elisabet Sahtouris, Vandana Shiva, and Adam Trombly. [1]\n\nThose signing the statement express feeling misled about the film’s content and find the message of THRIVE to be misguided. We sincerely apologize for whatever unwitting part we played in generating this sense of having been mislead and can say with utmost sincerity that this was never our intent.\n\nEach of the pioneers in THRIVE were invited because their expertise in a particular area had been helpful in our gaining an understanding of the bigger picture that includes, but vastly transcends, their sector of expertise – or anyone’s political affiliation. We clearly state this in the movie:\n\n“The people in THRIVE do not necessarily agree with the themes, statements, claims or conclusions presented in the film or website, nor does their inclusion imply our full agreement with all of their views. The people interviewed have each contributed in some deep way to our understanding and we are grateful to them all.”\n\nTo facilitate a more fruitful conversation, we have invited all Pioneers to engage in a direct public discussion with us about anything that THRIVE actually stands for.\n\nWe updated this article so we could feature the full dialogue between Pioneers more prominently at the top of the page. Here is the exchange that has taken place so far. Your comments are welcome below.\n\nHere is a living index of our ongoing discussion:\n• Foster Gambles' Rebuttal to John Robbins' Email Soliciting Co-Signers for Letter of Dissociation\n• Foster and Kimberly Gambles' Response to John Robbins' Yes Article\n\nHere is a casual interview where we talk about the experience:\n\n\n\n [1] Adam Trombly has told Foster Gamble, the creator of THRIVE, that he had not signed the letter of dissociation, and has written that he has “serious differences with the final edit of the movie.” We have written to him several times to clarify his position and will post whatever he has to say when we hear back. We are including his name here now since the other Pioneers have repeatedly cited his name and included his name in in the original letter of dissociation.", "opengraph": {"type": "cause", "site_name": "Public Dialogue Between the Thrive Movie Filmmakers and Pioneers | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/956/original/foster-kimberly.jpeg", "title": "Thrive Filmmakers Respond to Letter of Dissociation", "url": "http://www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers", "description": "Foster and Kimberly Gamble respond to the ten people who have signed a public letter of dissociation from the movie. This shows the ongoing discussion between the THRIVE interviewees and filmmakers. All are welcome to join the discussion."}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/W-NKoXuGm_M\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/W-NKoXuGm_M"}], "links": ["http://www.thrivemovement.com/thrive-movie-pioneer-letter-of-dissociation", "http://www.thrivemovement.com/thrive-movie-pioneer-letter-of-dissociation", "http://www.thrivemovement.com/foster-gamble-rebuttal-to-john-robbins-email-soliciting-thrive-dissociators", "http://www.thrivemovement.com/john-robbins-critique-of-thrive-movie-humanity-and-sanity", "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie", "http://www.thrivemovement.com/aqeela-sherrills-response-to-john-robbins-critique-of-thrive-movie", "http://www.thrivemovement.com/john-robbins-response-to-aqeela-sherrills", "http://www.thrivemovement.com/elisabet-sahtouris-critique-of-thrive-movie", "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-elisabet-sahtouris-critique-of-thrive-movie", "http://www.thrivemovement.com/duane-elgin-critique-of-thrive-movie", "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-duane-elgin-critique-of-thrive-movie", "http://www.thrivemovement.com/thrive-response-to-deepak-chopra-john-perkins-and-paul-hawken", "http://www.yesmagazine.org/people-power/disaster-by-design-whats-wrong-with-the-thrive-movement", "http://www.yesmagazine.org/people-power/letter-to-the-editor-thrive-filmmaker-foster-gamble-responds-to-john-robbins", "http://www.whatifitreallyworks.com/category/videos/"], "authors": [], "publish_date": null}