{"result_id": "316047", "URL": "http://www.t.thrivemovement.com/announcing-thrive-ii-this-is-what-it-takes.blog", "timestamp": "2023-04-25 17:42:55 CEST+0200", "meta": {"description": "We’ve reunited the team, enlisted new talent, and are ready to deliver on the promise of our first film. THRIVE II will document inspiring stories and principles showing what it actually takes to bring truly unprecedented innovations safely and successfully to humanity.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/announcing-thrive-ii-this-is-what-it-takes.blog", "encoding": "utf-8"}, "image": null, "domain": "www.t.thrivemovement.com", "title": "Announcing… THRIVE II: This is What it Takes!", "cleaned_text": "Thank you for your patience during our blogging hiatus.\n\nKimberly and I have been spending the bulk of our time vetting various breakthrough technologies and developing strategies for getting inventors the effective funding, security, legal and business support they so desperately need.\n\nWe have been so encouraged by the viable, working solutions in every single Sector — Energy, Health, Environment, Science, Education and more — and the strategies for dissemination — that we are ready to deliver on the promise of THRIVE: What on Earth Will it Take? and are hereby officially announcing to our network that…\n\nWE ARE LAUNCHING PRODUCTION OF OUR SEQUEL —\n\n THRIVE II: This is What it Takes!\n\nWhat we have been seeing behind-the-scenes has been total confirmation of the key principles for whole system solutions, and we are prepared to empower people all over the planet with insights, principles, strategies and tactics by which we can obsolete the thinking, structures and behavior of those who would impede the liberation of our struggling civilization.\n\nWe are in the process of completing our script and funding. Most of the original team is re-assembling along with exciting new talent.\n\nwill document the inspiring stories of what it actually takes — in terms of the science, consciousness, perseverance, interpersonal relationships, business skills, financing, security, and philosophical understanding — to bring truly unprecedented innovations to people everywhere. And the visual FX for will go to the next level and do for the Unified Field what did for the fundamental pattern of the torus.\n\nMartin Luther King said “The arc of the moral universe is long, but it bends toward justice.” We are depicting what we see as the next step in this arc, with the principles by which our technologies, our social organizing, and our personal awareness can deliver unprecedented justice and freedom for all. The non-aggression principle and the Liberty Perspective will constitute a main through-line for .\n\nIf we were already living in a free society that protected individual sovereignty and creativity, the solutions to energy, environmental, health, food and other problems would already be available.\n\n, which is now available thanks to our partnership there\n\nThroughout this process, we will not be out in the public much other than for workshops we are giving twice a year in Costa Rica at the Rythmia Life Advancement Center, where we will be giving updates on our progress. In these gatherings we will be sharing behind the scenes glimpses into the world of possibility and breakthrough that we have been granted through the success of, which now has over 81 million documented views and is out in 27 languages. The owners of Rythmia helped us navigate the minefield of control to get a medical license for one of the breakthrough health technologies we vetted, called HemaLucent\n\nOur next workshop is the week of June 3rd and we’d love to see you there.\n\nWe are also thrilled to announce that the theme song , written by Ariel Thiermann and Austin Willacy, and produced by the composer of our original score, Gary Malkin, was recently awarded First Place in the Justice category by PosiMusic at their awards gala. This organization acknowledges musicians contributing to making a positive difference in the world.\n\nI will continue to post informational and inspirational articles and videos daily on Facebook and Twitter. For those who want regular analysis of trending events as seen through a sound fact and freedom-based perspective, I highly recommend people like Stefan Molyneux, James Corbett, Jon Rappoport and Tom Woods. As time allows, I will also periodically be writing blogs to address key topics. In the comments below, please let me know what issues you would most like to hear and interact about.\n\nStay connected. Your support makes a world of difference. From our remarkable cadre of international innovators, the most inspiring human theme we keep witnessing is simply, “Don’t Give Up!”", "opengraph": {"type": "cause", "site_name": "Announcing… THRIVE II: This is What it Takes! | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/654/original/Global_connection_sunrise.png", "title": "Announcing… THRIVE II: This is What it Takes!", "url": "http://www.thrivemovement.com/announcing-thrive-ii-this-is-what-it-takes.blog"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rythmia.com/foster-kimberly", "http://bit.ly/ThriveSong", "https://freedomainradio.com", "https://www.corbettreport.com", "https://tomwoods.com/podcasts/", "https://tomwoods.com/podcasts/"], "authors": [], "publish_date": null}