{"result_id": "316030", "URL": "https://www.thrivemovement.com/john-robbins-critique-of-thrive-movie-humanity-and-sanity", "timestamp": "2023-04-25 17:42:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "https://www.thrivemovement.com/john-robbins-critique-of-thrive-movie-humanity-and-sanity", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "John Robbins’ Critique of Thrive Movie | Article", "cleaned_text": "Thrive is the name of a richly produced and controversial film that asks, and attempts to answer, some of the deepest questions about the nature of the human condition and what is thwarting our chances to prosper. Elaborately funded, with appealing imagery and beautiful music, it features interviews with many leading progressive voices. And yet ten of these leaders have taken the highly unusual step of signing a statement formally disassociating ourselves from the film.\n\nWhy have Amy Goodman, Deepak Chopra, Paul Hawken, Edgar Mitchell, Vandana Shiva, John Perkins, Elisabet Sahtouris, Duane Elgin and Adam Trombly, as well as yours truly, gone to the trouble of signing our names to this public statement?\n\n“We are a group of people who were interviewed for and appear in the movie Thrive, and who hereby publicly disassociate ourselves from the film.\n\nThrive is a very different film from what we were led to expect when we agreed to be interviewed. We are dismayed that we were not given a chance to know its content until the time of its public release. We are equally dismayed that our participation is being used to give credibility to ideas and agendas that we see as dangerously misguided.\n\nWe stand by what each of us said when we were interviewed. But we have grave disagreements with some of the film’s content and feel the need to make this public statement to avoid the appearance that our presence in the film constitutes any kind of endorsement.”\n\nI have joined the other signers of this statement, even though there are aspects of the film that I find beautiful and inspiring, and even though the makers of the film, Foster and Kimberly Gamble, are old friends.\n\nIn Thrive, the Gambles have attempted to address some of the crucial challenges of our times. I appreciate their idealism, their commitment, and their passion. And I agree with them about some things they state in the movie and on their website --- such as that the political system is depraved, the Federal Reserve has been used to consolidate economic power, fiat currency tends to produce a corrupt financial system that depends on ever increasing debt, the tax system is unfair, and enormously powerful economic interests often collude with one another to deceive and defraud the public. I stand with them as they promote the labeling of genetically engineered foods and in their desire to see our nation cease spending enormous sums on war. I appreciate that they support local and organic agriculture, their passion for credit unions and local banking, and their opposition to governmental invasion of privacy. They recommend many action steps that I support.\n\nBut I do not agree with some of the core conclusions they draw. Nor do the other signers of the statement of disassociation from Thrive. Duane Elgin, one of the signers, says: \"Thrive is idealistic, naive, narrow, shallow, and focuses attention away from more productive areas of engagement.\"\n\nAt the very heart of the Thrive message is what it calls the Global Domination Agenda. This is the idea, as presented on the Thrive website in the words of former Congressman Larry McDonald:\n\n“The drive of the Rockefellers and their allies is to create a one-world government... all under their control… Do I mean conspiracy? Yes I do. I am convinced there is such a plot, international in scope, generations old in planning, and incredibly evil in intent.”\n\n“A small group of families are actually controlling virtually every sector of human endeavor… Their agenda… (is) to take over the lives of all people across the entire planet… to collapse the economies throughout the European Union… to devalue the dollar to almost zero... and to create a one-world government, with them in charge.”\n\nThe Thrive movie and website also state that a small group of 300 or so people are developing and experimenting with plans to dramatically reduce the world’s human population, possibly to about 500 million people, to make us “easier to manage.”\n\nCould this be true?\n\nThere is no doubt that staggering wealth and power is today concentrated in the hands of a tiny minority of humanity. The combined net worth of the world's richest thousand or so people -- the planet's billionaires -- is almost twice that of the poorest 2.5 billion. I believe this disparity to be nothing less than an indictment of our civilization.\n\nIt is also certain that networks exist among the most powerful that enable a remarkably few people to shape the world's economy, to determine what is known and what is not, which views are accepted and which are not, and what priorities and policies will prevail. More than most of us realize, they decide whether we will live in war or peace and how our treasure will be spent. And they have proven to be eminently successful at enriching themselves, often at the expense of the common good. Exposing the global power elite is tremendously important work. And this, Thrive purports to do.\n\nBut the Thrive movie and website are filled with dark and unsubstantiated assertions about secret and profoundly malevolent conspiracies that distract us from the real work at hand. The conspiracy theories at the heart of Thrive are based on an ultimate division between \"us\" and \"them.\" \"We\" are many and well-meaning but victimized. \"They,\" on the other hand, are a tiny, greedy and inconceivably powerful few who are masterfully organized, who are purposefully causing massive disasters in order to cull the population, and who are deliberately destroying the world economy in order to achieve total world domination.\n\nThis way of thinking has an allure, for it distracts and absolves us from the troubling truth that the real source of the problem is in all of us, and in the economic systems we have collectively produced. If the ills of the world are the deliberate intentions of malevolent beings, then we don’t have to take responsibility for our problems because they are being done to us. Thinking this way may provide the momentary comfort of feeling exonerated, but it is ultimately disempowering, because it undermines our desire to be accountable for the way our own thoughts and actions help to create the environmental degradation and vast social inequity of the world in which we live. As Aleksandr Solzhenitsyn wrote, \"The line separating good and evil passes not through states, nor between classes, nor between political parties either, but right through every human heart.\"\n\nThe Thrive film does not mention, or in some cases only hints at, many of the more extreme ideas that are prominent on the Thrive website, and which inform the Thrive worldview. The movie has lavish production values, and presents interviews with many leaders in the consciousness movement, all of which lend a beguiling aura of credibility. Foster Gamble himself comes across as soft, warm, and inquiring. Those who have only seen the film may not recognize the agenda and belief system that actually underlie Thrive.\n\nFor example, Foster Gamble has said that the Japanese earthquake that caused the tsunami that wreaked havoc on the nuclear plants in Fukushima was deliberately created. He has said that those seeking absolute world domination wanted to punish the Japanese for not acceding to their wishes. He has said that \"they\" have an electromagnetic array project in Alaska called HAARP that enables “them” to create earthquakes and tsunamis at will, anywhere on earth. The Thrive website also implies that the 2010 earthquake in Haiti was intentionally created by HAARP. These are extraordinary claims to make without some very credible substantiation. Yet Foster makes them with an utter lack of evidence. Although he has been a friend of mine for years, I must regrettably say that in my judgment, these are the assertions of someone who has lost grounding in reality.\n\nThrive also advances the idea that vaccinations have been purposefully created by the global elite to decimate the population. There is no doubt that vaccinations have troubling side effects. Some of them may be far more toxic than we know. But there’s a difference between a thoughtful dialogue about the dangers of a medical technology and the belief that vaccines are actually an expression of profoundly sinister intent.\n\nIt was a vaccine that enabled the elimination of smallpox, a scourge which was responsible for approximately 500 million human deaths in the 20th century. Thrive promotes the idea that the U.N. and world treaties are the work of evil-doers intent on total world domination. These institutions are far from perfect, but it was only through the concerted efforts of the global health community and the World Health Organization that smallpox, perhaps the killer of more humans than any other disease in world history, was eradicated. There is greed and deceit in the pharmaceutical industry that I find deplorable, but that does not condemn all vaccines.\n\nThere are many things that are terribly wrong in our world. All living creatures are poisoned and compromised by surging levels of human-made toxins that spew into our environment, relatively unchecked. We are experiencing unprecedented levels of heart disease, cancer, obesity and childhood diabetes. Our financial institutions and to a large extent our political system have been hijacked by greedy and at times even sociopathic individuals who seem to feel no sense of responsibility to the well being of the whole. The world’s military industrial complex is spending more money than ever on guns, bombs, and the machinery of unfathomable destructive power, while governments learn little about how to make peace and hundreds of millions of people go hungry.\n\nBut holding these tragedies as the intentional acts of a tiny group of families seeking not just extreme wealth but also total world domination via a global police state distracts us from the arduous work of confronting the true challenges before us.\n\nFor example, as an environmentalist I heed the monumental evidence that global warming may be one of the most serious threats faced by humanity and many of the other species on this planet. Those who have merely seen the movie would not know that Foster Gamble and the Thrive website strongly recommend a film (The Great Global Warming Swindle) which states that man-made global warming is a \"lie\" and \"the biggest scam of modern times.\"\n\nThe Thrive website opens its climate change discussion with this question:\n\n“How does the premise of man-made global warming relate to the banking elite’s effort to transcend national sovereignty, establish global governance and create a global tax to fund their dominance?”\n\nThe insinuation is that the idea of human-caused global warming is being fabricated as an excuse to create a global police state and a tax basis for tyranny. If this is true, just about every scientific expert in the world has been taken in by the hoax. A 2010 study published in the Proceedings of the National Academy of Sciences found that 97 percent of scientific experts agree that it is…\n\n“very likely that anthropogenic (human-caused) greenhouse gases have been responsible for the unequivocal warming of most of the Earth’s global temperature in the second half of the 20th century.”\n\nIt has been personally painful for me to witness friends of mine become caught up in seeing just about everything on earth as part of a vast demonic conspiracy. When I wrote Foster Gamble to voice my disappointment with many of the ideas in the film and website, he wrote back, encouraging me among other things to study the works of David Icke, Eustace Mullins, Stanley Monteith and G. Edward Griffin. These are among the people he repeatedly refers to in the movie as his “sources.”\n\nDavid Icke, who has been called “one of the most extreme of all conspiracy theorists,” is not a small player in Thrive. In fact, he is featured more prominently in the movie than anyone other than Foster Gamble. An extended interview with him, intercut with supporting material, forms much of the middle section of the film.\n\nThough this is not mentioned in Thrive, Icke is well-known for advocating utterly bizarre theories, including that the entire world is run by a secret group of reptilian humanoids who drink human blood and conduct satanic rituals. Forty-three U.S. Presidents, he says, have been such reptilian beings, and many of them, including Barack Obama and George W. Bush, have been part of global satanic pedophile rings that murder hundreds of thousands of children a year. I wish I was making this stuff up, but I’m not. This is what Icke teaches.\n\nAnd I deeply regret to say that my old friend Foster Gamble seems to concur. As Foster wrote in a public forum:\n\n“In our film, we do not go into his (Icke’s) research on reptilians, nor his immensely important investigations into global satanic pedophile rings, because it does not serve our film. That does not mean that revealing what is happening to hundreds of thousands of our most vulnerable every year should not be exposed and stopped.”\n\nUnfortunately, Icke’s war on common sense goes much further. He says that the Global Elite's plan for world domination was laid bare in a document titled The Protocols of the Elders of Zion. This document is actually a notorious hoax, published in Russia around 1903. It supposedly presents a plan by the Jewish people to take over the world, and was a primary justification used by Adolph Hitler as he initiated the Holocaust. This fraudulent document was also used to justify the violent pogroms and massacres of the Jewish people in pre-Soviet Russia.\n\nHow anyone could take seriously a man who espouses such “information” is beyond me. But Thrive actually relies heavily on Icke’s “insights,” both in the movie and as a source of “data” for its website.\n\nAnother of Thrive’s primary sources, and another of the authors Foster Gamble told me I should read in order to better understand Thrive, is Eustace Mullins. I honestly find it difficult to convey the level of anti-semitism in Mullins’s books, without it seeming that I am exaggerating. So I will let Mullins’s own words speak for themselves:\n\n“We must remember that there is no Jewish crime per se, since the existence of the Jewish parasite on the host is a crime against nature, because its existence imperils the health and life of the host...\n\nThis religious ceremony of drinking the blood of an innocent gentile child is basic to the Jew's entire concept of his existence as a parasite, living off the blood of the host...\n\nThe Jews do not want anyone to know what Nazism is. Nazism is simply this--a proposal that the German people rid themselves of the parasitic Jews. The gentile host dared to protest against the continued presence of the parasite, and attempted to throw it off.”\n\nThe title of one of Eustace Mullins’s books is: Hitler, An Appreciation. While Foster Gamble evidently believes that Mullins has shed valuable light on banking systems and other aspects of the “Global Domination Agenda,” I have no interest in looking to such individuals for insight into anything.\n\nThe Gambles state that they do not necessarily agree with all of the thoughts and beliefs of their sources, but rather that they have incorporated only those ideas they find useful and with which they agree. I’m sure the Gambles do not condone Mullins’ overt anti-semitism, but I find it disturbing that the thinking of these men has been used as the foundation for some of the key ideas presented in Thrive. While I do not believe the Gambles are themselves guilty of anti-semitism, I do believe they are naïve and gullible, and that in depending heavily on sources such as Icke and Mullins they have unwittingly allowed anti-semitism to become a subtext in their work.\n\nViewers of the movie may not realize that Gamble’s central thesis, that a handful of families control the world and plan to enslave humanity, mirrors an argument that Joseph Goebbels made in his notorious Nazi propaganda film The Eternal Jew: that a handful of banking families, many of them Jewish, run the world and seek global domination.\n\nTwo of the other sources that Foster Gamble recommended to me so that I might better understand Thrive are Stanley Monteith and G. Edward Griffin. Monteith, who happens to be a neighbor of mine, has long been involved with Pat Robertson’s Christian Coalition, and professes that the environmental movement is nothing but a front for the effort to create a global police state. Both Monteith and Griffin have long been officers of the John Birch Society, a far-right political organization that first came to public attention when one of its founders proclaimed that Dwight Eisenhower wasn’t the genial war hero and popular President he seemed, but rather “a conscious, dedicated agent of the international communist conspiracy.” Griffin, who is prominently featured as an expert and “Pioneer” on the Thrive website, played a key role in the third party candidacy of George Wallace when the overtly racist and vehemently segregationist Alabama Governor sought the U.S. Presidency.\n\nThese are only a few of the ultra-right wing sources whose ideas and agendas pervade Thrive. Many Americans first learned of the Austrian economist Ludwig von Mises when Michele Bachman, seeking the Republican nomination for the Presidency, said she read his books at the beach. Cited frequently and admiringly on the Thrive website, von Mises’s brand of laissez-faire capitalism is hard-core. In his eyes, nearly all government intervention in the economy is strictly verboten, and taxes are a crime against freedom.\n\nBuoyed by lush visual effects and lovely words, the Thrive film has been attractive to many who long for a more just and beautiful world, and who know how often we are deceived and exploited by the powers that shouldn’t be. “In times of universal deceit,” wrote George Orwell, “telling the truth will be a revolutionary act.” But what is the revolution Thrive would bring? Foster Gamble says that Thrive is not political, but both the movie and website call for the end of taxation even for the rich. Thrive’s goal is a world in which public schools and all welfare programs, including social security, have been terminated. Instead of police, we have private security forces. As Foster Gamble puts it, “Private security works way better than the state.”\n\nThat may be true for the rich who can pay for it. But who, I might ask, would pay to protect low-income communities if all security was privatized?\n\nEventually there would be no government, and just about everything would be privately owned, including roads. “It’s clear that when you drive into a shopping center you are on a private road, and almost without exception it is in great shape,” explains the Thrive website.\n\nI want to underscore that although I think the Gambles are promoting some dangerous ideas, I do not think either Foster or his wife Kimberly are sinister or malicious, which is why it has been a very painful process for me to write this critique. I have known them to be kind people who mean well, and I have long considered Kimberly in particular to be one of my closest friends. But I have found it necessary to speak out in this way, because some of the ideas at the heart of Thrive strike me as frightening and misguided, and they most certainly are not ones with which I want to be associated. I have spent decades exposing and seeking to undermine powerful industries whose ways of doing business are diametrically opposed to the public welfare. In my view, the deregulation of the economy, and the demolition of government programs that Thrive proposes, would take us even further in the direction of a winner-take-all economy in which wealth would concentrate even more in the hands of the financial elites.\n\nAs one of the signers, evolutionary biologist Elisabet Sahtouris, writes:\n\n“Without community, we do not exist, and community is about creating relationships of mutual benefit. It does not just happen with flowers and rainbows, and no taxes.”\n\nEach of us who have signed the statement disassociating ourselves from Thrive have dedicated our lives to creating and conveying positive visions of how to create a truly thriving, just and sustainable way of life. We have been part of vast movements toward generating a human presence on this planet that is spiritually fulfilling, socially just, and environmentally responsible. We do not want to see our names, reputations, and influence used to fuel unsubstantiated claims or misguided policies. We want to see them used to strengthen individuals and communities, and to serve the ability each of us possesses to live with respect for ourselves, for one another, and for the truth of our interdependence.\n\nAs another of the signers, Paul Hawken, writes:\n\n“The world is riven by people who are convinced they are right, while others are wrong. Dualism permeates political, economic, cultural and religious conflict. It is the true source of suffering and the despoliation of the world. This wound cannot be healed by the us/them divisions that inform Thrive. Evil most certainly exists, but the core of evil is ignorance, and it cannot be repelled by righteousness or by making others wrong. It is only through compassion that we can create true transformation.”\n\nWe do not deny the evil in the world. It is here and it is real. But there is also hope here, and it too is real.\n\nIt is hope that believes we can build trust, build community, and build a better world. Such hope is not the blind belief in something which has little possibility of ever materializing. It is the hope which remains open to miracles while investing the sweat and perseverance to lend the Universe a hand in creating those miracles. It is the hope that is borne from knowing that it is far too late, and our situation far too serious, to indulge in the luxuries of pessimism, paranoia, and finger-pointing.\n\nThe state of the world is perilous. But it is not too late to love, not too late to dream, and not too late to believe in ourselves and each other.\n\nIn the end, we are all in this together. Each step you take to lessen the amount of fear in yourself and the world brings us closer to a world reflective of the beauty that exists -- sometimes buried and other times apparent -- in each of us. Every act you take that increases the amount of trust and compassion in your relationships helps us move from a world created by privilege to a world created by community.\n\nAs the poet Adrienne Rich wrote, “So much has been destroyed. I have cast my lot with those who, age after age, perversely, with no extraordinary power, reconstitute the world.”\n\nTo see the full dialogue between the Thrive Filmmakers and Pioneers, and to add any comments, please visit: www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers.\n\nTo see the response from the Thrive Filmmakers, Foster and Kimberly Gamble, go to: http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie", "opengraph": {"type": "cause", "site_name": "John Robbins’ Critique of Thrive Movie | Article", "image": "http://www.thrivemovement.com/images/poster_thumbnail.jpg", "title": "John Robbins’ Critique of Thrive Movie | Article", "url": "http://www.thrivemovement.com/john-robbins-critique-of-thrive-movie-humanity-and-sanity"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thrivemovement.com/pioneer?article_id=530&article_title=John%20Robbins", "https://www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers", "https://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie"], "authors": [], "publish_date": null}