{"result_id": "316006", "URL": "https://www-.thrivemovement.com/myth-enlightened-leadership-and-challenge-true-freedom.blog", "timestamp": "2023-04-25 17:41:31 CEST+0200", "meta": {"description": "Do you have the right not to be violated, to drink unpolluted water and breathe fresh air? Is it something people should vote on or is it simply your inalienable right?", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "https://www.thrivemovement.com/myth-enlightened-leadership-and-challenge-true-freedom.blog", "encoding": "utf-8"}, "image": null, "domain": "www-.thrivemovement.com", "title": "A Taste of True Freedom", "cleaned_text": "This article originally appeared in Connection Magazine, which recently devoted an entire issue to the topic of Liberty.\n\nWe recently returned from a meeting with Governor José Calzada of Querétaro, Mexico, where we were invited to address 1,500 youth leaders from throughout his country. Mexico has more young people now than ever before in its history — over 40% of the overall population — and they are making some bold and intelligent moves to empower the youth. The Governor, a front-runner for the Presidency of Mexico, along with his cabinet of young people, consider the information in our film THRIVE, and the accompanying whole-systems Solutions Strategies, to be a critical part of awakening the next generation and wanted these youth leaders to join the more than 20 million people (in 24 languages) who have seen THRIVE since its release in November 2011.\n\nOur meeting with Governor Calzada was a great and somewhat surreal experience: There we were in a formal meeting with high-level government officials talking naturally about UFOs and the transport technologies they use to travel through the cosmos — and how that informs new energy technologies on our planet. Topics like these, which are controversial here in America, are normalized in Mexico, as they are in a host of other countries where imperialist wars of aggression to maintain control over fossil fuels is not the overriding agenda.\n\nWe were reflecting on how what is controversial in one arena is taken for granted in another. Interestingly, the one topic that seems to inspire the most controversy is Liberty — more than ETs, or the conspiracy for global domination. One of the first times we publicly encountered the issue of Liberty was during the light brown apple moth spray issue here in Santa Cruz County.\n\nAfter learning about the proposed spray program, we joined with others to introduce the 12-sector solutions model to help coordinate our efforts to stop the spray. The 2007 spray program was a billion dollar earmark by then-President Bush to spray ten chemicals, some of them known carcinogens and endocrine disrupters. The program proposed aerial spraying over an area inhabited by seven million people throughout northern California for nine months every year for up to 10 years — all supposedly to eradicate a tiny moth that was doing no damage. The coalition ended up successfully defeating the program, after just six months of coordinated effort. But at one point in the process, one contingent of the activists working to stop the spray suggested that we organize to put the issue on the ballot so people could vote on it.\n\nThis is where things heated up. We were not willing to support a vote on the issue. It felt to us like voting on whether or not the government should allow rape. Not only was there a very real chance that the vote would be rigged, but if they had a billion dollars for the campaign, they could certainly invest some of that into propaganda to convince people that it was a safe and necessary program.\n\nBut apart from that, we were prompted to ask: What about inalienable rights? What about the right we have not to be violated with toxins against our will? What about the right to clean air and water? It was a striking confrontation with the limits of “majority rule” because whether or not the majority could be convinced that the spray was safe, we believed that the right not to be violated was non-negotiable, and that this was a chance to lay claim to that.\n\nLiberty — not to be confused with the Libertarian political party — is a trans-political, principle-based philosophy that holds the non-initiation of force as the core navigating tenet. In this system, polluters would be personally prosecuted instead of allowing corporations to buy their way out of accountability with “cap and trade.” It is a system of self-organizing that transcends politics with the core inalienable right to not be violated — for every living thing. It includes rules, but no rulers. And we believe it constitutes one of the most important conversations on the planet today.\n\nWhile people all along the political spectrum acknowledge the raging disparity of wealth and lack of justice, they each seem to believe that all would be well if only their party were in charge. We call this “the myth of enlightened leadership.” It is fundamentally flawed logically because when one party “wins,” all is “not well” for the 49% whose wishes are not accounted for. Taxation, which is the funding base of every government, relies on coercively requiring people to fund programs and policies whether they agree with them or not. So there is a built in dis-ease at its core because all people will never agree on the best use of funds.\n\nWe do not believe you can achieve freedom through coercion. Some say, “Tough luck, it’s part of what we agree to by being citizens.” But we never made that agreement. Rather, we have found the only thing everyone agrees with is that they don’t want to be violated against their will. This may be the one agreement that can actually move us beyond the political polarity gridlock to a truly thriving society. The principle of non-violation holds the key to real freedom, security and prosperity for all. Rule by the “majority” perpetuates a never-ending flip-flop between one priority and another, while missing the central issues of honest money, peace, and innate human rights.\n\nWe have been led to believe that coercive associations and authoritarian governments are the best we can do, but in reality, when people are prosperous enough to be able to, we care for ourselves and each other far more effectively than any government ever has. The Economic Freedom of the World Report shows each year that the more economic and social freedom people have, the more secure, healthy, and prosperous they are.\n\nGovernments have actually been responsible for more death and destruction of their own citizens than any other entity. Every government in the history of the world has grown at the expense of the population it was supposedly set up to serve. And every government taxes people’s wages and/or purchases to fund its growth. As Stefan Molyneux points out, “It took little more than a century for the US — founded on the idea of limited government — to break the bonds of the constitution, institute the income tax, take control of the money supply and the educational system and begin its catastrophic expansion.”\n\nNonetheless, vast numbers of people are dependent on the government for their very subsistence, and the rigged economic system ensures that it is so. It would be devastating to simply eliminate taxes and the services they provide until people are empowered with the money and power they are currently forced to forfeit. But this doesn’t mean we need new taxes, it means we need to redirect tax money currently overfunding the military and fraudulent interest to the Federal Reserve into programs that truly support those people and ecosystems that have been most damaged by the corruption.\n\nThe notion of actually transcending involuntary government is so new for most that many questions arise, as they did for us. What about the roads, security, and schools, etc.? Here are links that address the most common myths and misunderstandings:\n\nEliminating new taxes often sounds callous because it has not been offered with a compassionate strategy for transition. With THRIVE, we designed a process of three overlapping stages to ensure that the needs of people are tended to along the way to a truly voluntary society. It is based on the best of both “the left” and “the right,” and finally transcends the limits of each as it moves to truly open forms of self-organization based on the principles of freedom and integrity.\n\nSo many people who are great at pointing out the problems associated with the “other party’s” position are at a loss for viable, just solutions. On the left, socialist scenarios-as-solutions are having a hey-day, and on the right, fascist imperialist strategies are at the fore. But beyond both there is a new model of human organization that can revolutionize world society to release people’s untapped and suppressed potentials. It requires a worldview as radically new as the notion of a round world was to the “flat-worlders.” And it requires a thoughtful, compassionate, strategic transition process to implement.\n\nStage One carries the Progressive ethic of compassionate action and entails bringing as much integrity as possible to current systems and helping those most in need. Some examples of actions to take in this stage are campaign finance reform, the repeal of corporate personhood, the end of the Federal Reserve’s ability to make up money out of nothing and charge taxpayers interest on it, and the introduction of the precautionary principle, where corporations and governments are required to prove the safety of something rather than that onus being the responsibility of those impacted by their policies — GMOs being a good example.\n\nStage Two is more like traditional Conservatism — shrinking government to the protection of individual rights and commons such as water, air and fisheries. It involves a return to sound currencies and, with the increased wealth returned to the people from Stage One, it supports a true un-subsidized free market of voluntary exchange. Both these tracks include an end to wars of aggression — foreign and domestic.\n\nIn Stage Three, the wealth and well-being that people have as a result of Stages One and Two enable people to care for themselves and each other through voluntary associations that operate with non-violation as the core principle. This stage represents a means, an end, and an insight. Complete Liberty, or Voluntaryism as it is sometimes called, represents a society of free association. It does not argue for the specific form that voluntary arrangements will take, only that force be abandoned so that individuals in society may flourish. In this model of Liberty, the means determine the end; people cannot be coerced into freedom.\n\nFROM POLITICAL VIOLENCE TO PRINCIPLES OF PEACE\n\nThe Nolan Chart, represented below, illustrates the shared strategies that both Liberals and Conservatives rely on, i.e. coercion-based funding of programs, be they war or welfare. Liberty is the strategy that allows us to lift off the spectrum of coercion and two party gridlock.\n\nWhat on Earth will it take? This is the question we ask in THRIVE. The point of the movie is to provide the minimum sufficient information we feel is needed to inform truly leveraged solutions. Thrive’s Solutions Hub currently hosts over 900 groups from more than 90 countries — all organized around principle-based solutions to a range of 100+ different issues. These solutions require deep and thoughtful reflection and bold, unprecedented action. We invite you to join the conversation, and to begin with some questions:\n• If there were a way to have accessible and good roads, education and healthcare, help for the poor, a respected system of justice, etc. — without anyone being violated against their will, including an involuntary income tax — would you want that?\n• When, if ever, is it OK for someone to coerce or violate someone else except in authentic self-defense?\n• Do you think that an authoritarian power using coercion is necessary in order for humans to be compassionate?\n• Can violence ever be a sustainable basis for a peaceful society?\n\nFor more information, we invite you to visit the Liberty section of our website.\n• Videos\n• “Government Explained” — to an ET\n• If You Were King\n• Books\n• None The Secrets to Nonviolent Prosperity: The Principles of Liberty by Trevor Z. Gamble", "opengraph": {"type": "cause", "site_name": "The Myth of Enlightened Leadership and The Challenge of True Freedom | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/132/original/Screen_Shot_2013-11-13_at_1.png", "title": "A Taste of True Freedom", "url": "http://www.thrivemovement.com/myth-enlightened-leadership-and-challenge-true-freedom.blog", "description": "In this recent article for Connection Magazine, Kimberly and Foster take a deeper look at the opposing nature of inalienable rights vs. majority rule, and explore what they believe is truly the core issue of our time, Liberty."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.connectionmagazineonline.com/", "http://santacruz.theconnect.com/pdf-download-connection-magazine-november-2013/", "http://www.thrivemovement.com/the_movie", "http://www.thrivemovement.com/solutions-solutions_strategy", "http://www.thrivemovement.com/solutions-liberty", "http://www.thrivemovement.com/solutions-solutions_strategy", "http://www.freetheworld.com/2011/reports/world/EFW2011_complete.pdf", "http://www.thrivemovement.com/solutions-liberty#article-2366", "http://www.thrivemovement.com/solutions-liberty#solutions", "http://voluntaryist.com/", "https://en.wikipedia.org/wiki/Nolan_Chart", "http://www.thrivemovement.com/solutions-hub", "http://www.thrivemovement.com/liberty-solutions-strategies", "http://www.thrivemovement.com/solutions-liberty", "http://www.thrivemovement.com/solutions-liberty#solutions", "https://www.youtube.com/watch?v=P772Eb63qIY", "https://www.youtube.com/watch?v=EUS1m5MSt9k", "https://www.youtube.com/watch?v=z0HtWSlFCAQ", "https://www.amazon.com/gp/product/B004Z7ZT0A/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B004Z7ZT0A&linkCode=as2&tag=thrive07-20", "https://www.amazon.com/gp/product/145075063X/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=145075063X&linkCode=as2&tag=thrive07-20", "https://www.amazon.com/gp/product/1466477857/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=1466477857&linkCode=as2&tag=thrive07-20", "http://thedailybell.com/", "http://www.freedomainradio.com/", "http://freestateproject.org/", "http://completeliberty.com/", "http://www.freetalklive.com/", "http://www.strike-the-root.com/", "http://www.larkenrose.com/", "http://voluntaryist.com/", "http://mises.org/", "http://www.titanians.org/"], "authors": [], "publish_date": null}