{"result_id": "316007", "URL": "http://ww.thrivemovement.com/how-share-difficult-information-without-losing-friendships.blog", "timestamp": "2023-04-25 17:41:33 CEST+0200", "meta": {"description": "In this video blog, THRIVE filmmakers Foster and Kimberly Gamble share some helpful tips for effectively discussing challenging and controversial information with family and friends.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/how-share-difficult-information-without-losing-friendships.blog", "encoding": "utf-8"}, "image": null, "domain": "ww.thrivemovement.com", "title": "VIDEO: How to Share Difficult Information with Friends Without Losing Friendships", "cleaned_text": "In this video blog, THRIVE filmmakers Foster and Kimberly Gamble share some helpful tips for effectively discussing challenging and controversial information with family and friends.\n\nRead a transcript of the audio (to translate the transcript, choose your language at the top of this page)\n\nFOSTER: Hi Folks. Foster and Kimberly Gamble here from THRIVE and we’ve been seeing that all over the world hundreds of millions of people are waking up to what’s really going on and then running into the difficult challenge of “How do I share this information with my friends and still keep my relationships.” And yet, very few people are actually talking about that process, about the frustration, about the loneliness, about the urgency, and about the pain of that. So, people have asked us to share what we’ve been learning about how to share difficult information with your friends without losing the friendships.\n\nKIMBERLY: For me, the most important thing has been to really just accept that unpacking covert agendas is not everybody’s thing. And that doesn’t mean that they aren’t wonderful people and so I think it’s fair to ask and expect that I be respectful that this is part of my path, but it doesn’t mean that it is theirs. And I think the problem happens when those of us who see this growing global police state feel a sense of urgency like “oh, people just need to wake up to this!” but, in fact, being desperate with an agenda to convince people, it doesn’t work.\n\nFOSTER: The second thing we’ve found is to keep it personal. Instead of just dumping a whole bunch of information on someone, share what you’re feeling in the process. I found it effective to talk about what I used to believe and then the new understandings that my research has led me to: the fact that I felt angry as I found out that young people are being sent off to war under false pretenses and the sadness that’s come up for me when I realize that the corrupt global banking system is destroying billions of lives. And then my own fear not only at the thought of my own children and grandchildren growing up in a toxic world under a global police state, but, even very personally, of my fear of losing my own credibility in trying to share about this with the people that I love.\n\nKIMBERLY: It’s really helpful to ask questions instead of imposing conclusions. Sometimes I’ll say, “Do you think it’s a good idea for us to have a financial system that’s run by a private corporation that won’t disclose who its owners are and that won’t even agree to an audit?” Or, “Did you know that a former lobbyist from Monsanto is now the Secretary of Agriculture and I’m concerned about that? How do you feel about it?” Or even, “Did you know that hundreds of former military and government officials have spoken out about the fact that they believe there’s ET/UFO contact happening here on this planet and that there are dozens of other governments that have opened up their records and disclosed this as well and what do you think about that?” And then, actually listen to what the answer is and allow the conversation to flow from there.\n\nFOSTER: Be careful to distinguish facts from interpretation. For instance, in the chemtrails situation, there’s a lot of data that planes are spraying these aerosols and a lot of data about what these chemicals are and how harmful they can be. But in terms of the actual motivations and who is spraying (exactly why and how and so forth), that’s still in the realm of speculation. It hasn’t been proven yet so keep that distinct. In the area of 9/11, the facts and the physics contradict, drastically, the official 9/11 Commission report. But exactly what happened, by whom and why, that’s still in the realm of speculation so we need to be careful to distinguish the one from the other. Otherwise, we lose our credibility.\n\nKIMBERLY: I feel so much more encouraged and empowered now that I understand what is going on instead of just thinking there’s this random human failure. And we found, in the course of making THRIVE, in fact, that it was consistent that people who were the most informed are also the most hopeful. And, I think the other part of that is that as we feel empowered that we can do something about it, that opens up our interest in becoming more informed. And so, to speak from that, I know I was on a plane one time and I picked up the paper and started reading about how air traffic controllers were sleep deprived and overworked and that the planes weren’t being adequately repaired and I just felt like “I do not want to know about this. I’m going to be stuck on the plane for another eight hours and there’s nothing I can do about it.” And I thought, “Oh, this must be how people feel about the state of the world.” And I realized that, for me, I feel like there’s so much that we can do and I’m so aware of people working on solutions everywhere that there’s a problem so that I’m so hopeful about that that when I speak from that, it’s a much more of an invitational conversation than if I’m somehow sharing my absolute fear and desperation.\n\nFOSTER: Timing is everything and Kimberly has been very patient with me as I’ve learned that bedtime is not the ideal opportunity for sharing the next gory detail of how the secret societies, through the shadow government, are taking away our privacy and our rights and our money and all that type of stuff. And I’ve also noticed that this is such a dominant conversation that having it in a social situation where the purpose is celebrating someone’s birthday or an anniversary or a wedding or something like that is probably not the best time to bring up the fact that the Federal Reserve is not actually stabilizing our economy, they’re actually consolidating wealth and power while they’re stealing your hard-earned wages. That doesn’t really honor the intention of the host or hostess for that gathering, so what I’ve found useful is if somebody brings up a provocative point or question or something like that, to just acknowledge it and say, “You know, that’s something I would really love to talk about with you in a different setting so why don’t you give me a call (or I’ll call you) and let’s have lunch where we can go into this without breaking the mood of this particular occasion.”\n\nAnd one more along the same lines is that we have found that tidbits of information are very risky whereas immersion is really helpful. So, if you just drop on someone all of a sudden, “Hey, did you know that there are devices that can pull energy right out of space. That’s the good news, BUT, you know, it’s all being suppressed, inventors are disappearing and so forth.” You can sound really crazy if that’s out of context. Another example is if you start going on all of a sudden about “THEY are poisoning our food and our water and our air and dumbing down our kids at school” or whatever, it really undermines your credibility if people don’t have a context for that or the immersion in that particular topic. So, what we’ve found most effective is share a DVD like Thrive or the many helpful books and web links that are out there. We’ve got the Resource Tree on the thrivemovement.com website where people can really go and find the references that are very authoritative, third-person fact-checked, and so forth.\n\nKIMBERLY: And then there’s also the inevitable recovery that has to happen from those encounters where it just didn’t go right. You can feel it when it’s just uncomfortable and you’ve alienated somebody or they’re not feeling good about it and I know, for me, it’s just a matter of just stopping and feeling that and acknowledging that that is actually what’s going on. And then, apologizing and asking, “I didn’t mean for this to happen. Can you help me figure out what just went wrong and what I might be able to do in the future to make this more successful?” And, again, I think when we share, then we’re friends again, trying to unpack what happened to the relationship, which is core to this whole thing anyway.\n\nAgain, I think it’s that desperation that we need everybody to get it and that that’s probably what went wrong is that we had an agenda in our end of the conversation and to reflect on that and to really work hard, instead, to come from our confidence that we can do this. You know, 6% of the people were involved in the American Revolution and actively engaged and, in fact, billions of people are waking up all over this planet. It doesn’t take everybody to be on the forefront of this. And for those of us who are and we’re going to get out there and do this trial and error with the conversation, we hope that this has been helpful to you and we invite you to please share with us what works and doesn’t work for you at www.thrivemovement.com. Just go ahead and write in to [email protected]. We’re in this together.", "opengraph": {"type": "cause", "site_name": "How to Share Difficult Information with Friends Without Losing Friendships | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/061/original/Screen_Shot_2013-05-16_at_12.06.28_PM.png", "title": "VIDEO: How to Share Difficult Information with Friends Without Losing Friendships", "url": "http://www.thrivemovement.com/how-share-difficult-information-without-losing-friendships.blog", "description": "Learn some helpful tips from THRIVE Filmmakers about discussing controversial information with family and friends."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.thrivemovement.com/", "http://www.thrivemovement.com", "/cdn-cgi/l/email-protection#a6cfc8c0c9e6d2ced4cfd0c3cbc9d0c3cbc3c8d288c5c9cb99d5d3c4ccc3c5d29bf2cfd6d5839496c0c9d4839496f5cec7d4cfc8c1"], "authors": [], "publish_date": null}