{"result_id": "316021", "URL": "http://www.thrivemovement.com/news-flash-cia-invents-conspiracy-theory.blog", "timestamp": "2023-04-25 17:42:01 CEST+0200", "meta": {"description": "You know how uncomfortable it can feel to bring up “conspiracy theories” in general conversations? That’s just what the CIA wanted us to feel. The ridicule that is often associated with discussing conspiracy is actually the result of a propaganda campaign that the CIA initiated in the 1960’s to divert attention from people’s inquiry into the Kennedy assassination.", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/news-flash-cia-invents-conspiracy-theory.blog", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "News Flash — CIA Invents “CONSPIRACY THEORY”", "cleaned_text": "It is a little-known though well-documented fact that the origin of the campaign to ridicule research into conspiracies was initiated by the CIA in 1967 to undermine the credibility of those who questioned the official claims of the Warren Commission regarding the so-called facts of the Kennedy assassination.\n\nGiven the challenge we and others feel when speaking out about conspiracies, I think Lance deHaven-Smith is right when, in his new book Conspiracy Theory, he suggests “the CIA’s [covert and illegal] campaign to popularize the term ‘conspiracy theory’ and make conspiracy belief a target of ridicule and hostility must be credited…with being one of the most successful propaganda initiatives of all time…”\n\nOf course not all proclaimed conspiracies are true. There are competent conspiracy analysts and incompetent ones, just as there are skilled and shoddy reporters, historians or practitioners of any discipline.\n\nWhat Does “Conspiracy” Actually Mean?\n\nThe Merriam Webster dictionary defines “conspire” as: “to plot, to contrive, to scheme — to join in a secret agreement to do an unlawful or wrongful act.”\n\nIt is well documented that many conspiracy theories are true. (See resources below.) Just a few days ago, the CIA admitted to what conspiracy analysts have been saying for 40 years: that the agency helped organize the coup that deposed Mohammad Mosaddegh and imposed the Shah in 1953 to get access to Iranian oil.\n\nNonetheless, I have seen many otherwise intelligent people close their minds to credible information as soon as the term “conspiracy” is evoked — even though America itself was founded on what would now be called a “conspiracy theory.” After all, the American Revolution was fought on the basis of the alleged “conspiracy” of King George of England to control and unfairly tax the new world.\n\nConspiracy theories are such a threat to the status quo that infiltration, censorship and bans have even been proposed. In 2008, Cass Sunstein, the former Administrator of the Obama Whitehouse Office of Information and Regulatory Affairs and former Professor at the University of Chicago, wrote a paper on “Conspiracy Theories”. His prescription for dealing with ‘conspiracy theorists’? … “cognitive infiltration of “extremist” groups, and, if it gets bad enough, possible censorship of free speech. He actually suggests that the US Government use such tactics as:\n• Impose some kind of tax, financial or otherwise, on those who disseminate such theories.\n\nThis is especially interesting given that even Sunstein admitted that some “conspiracy theories” are actually true — including Operation Northwoods, a plan by the Department of Defense (DoD) to simulate acts of terrorism and to blame them on Cuba to falsely justify invasion. That one, fortunately, President Kennedy discovered and shut down.\n\nOne of the ways conspiracies are philosophically justified by those who perpetrate them is through the notion of the “noble lie”. This term was coined by Leo Strauss, who was the philosophical grandfather of the Neo-conservative movement and who advocated state political propaganda and covert actions to protect a society’s traditional beliefs from “unrestrained inquiries” — or in other words — “conspiratorial theorizing.” He believed that scientific criticism of official accounts of important historical events, even when those criticisms were true, “undermined respect for the nation’s laws and traditional beliefs.” “Weapons of Mass Destruction” and “regime change” are examples of “noble lies” — untruths put forth to achieve an end goal that could not be achieved without manufactured evidence to sway public opinion.\n\nRemember, it was the neo-conservative PNAC — the Project for a New American Century — that called for “a new Pearl Harbor” to justify invading the middle east — a noble lie used to dismantle the US Constitution (Patriot Act, Military Commissions Act, NDAA etc). This ended up being the major turning point in leading the US and the world toward police state tyranny, under the overarching “noble lie” of defending against “terrorism.”\n\nToday, critical thinking and overcoming the stigma of “conspiracy theory” can help us keep from getting duped into being poisoned by schemes like GMOs to solve hunger, chemtrails to solve global warming, toxic vaccines to prevent disease, fluoride to prevent tooth decay, and radiating smart meters to lower our electric bills — to name just a few.\n\nThe main website erected to undermine the Thrive movement — Thrive Debunked — based its entire premise on the notion that there is “No such thing as Conspiracy.” John Robbins was in THRIVE exposing the conspiracy undermining the food sector. Deepak Chopra revealed the hidden agenda of pharmaceuticals in the health arena. Paul Hawken described how corporations are covertly destroying the environment and John Perkins, the “economic hitman,” told how he had been part of the secret conspiracy destroying the culture and stealing the resources of one country after another around the world. Then THRIVE put these and many other expert pieces together to show how the same elite bankers are manipulating virtually every sector for their own profit and control. Each of these “pioneers” then turned around and dissociated from THRIVE, claiming they didn’t want to be associated with a “conspiracy” movie.\n\nIntelligence takes many forms: intellect, knowledge, cleverness, wit and intuition for example. But perhaps what is most called for in this era of massive deceit is open-mindedness — coupled with common sense and rigorous discernment. Critical thinking, evidence, fact checking, logic, research, and the ability to say “MAYBE, I don’t know” while we consider new information is imperative. Without it, we can fall prey to truly sinister and dangerous effects.\n\nSo, if you haven’t already, I invite you to step out of the “hassle-free” zone as if our future depends on it — because it does. Here are some key steps:\n• Some conspiracies that have been proven include:\n• The Reagan administration was convicted of “conspiracy” in the Iran Contra affair.\n• When the AMA tried to shut down Chiropractors, they were found guilty of “conspiracy.”\n• Tobacco companies were found guilty of “conspiracy” to withhold critical health information from the public. Additional articles on “conspiracies” that turned out to be true:\n• 19 Conspiracy Theories That The Media Now Admits Are Conspiracy Facts by End of the American Dream\n• 33 Conspiracy Theories That Turned Out To Be True by Gary Oldman\n• 16 Conspiracy Theories That Turned Out To Be True by Intellihub You can also learn more about one of the biggest conspiracies of all in the “Global Domination Agenda” section of our website.\n• Don’t buy into unsubstantiated attacks. Critics of conspiracy theory often resort to adjectives and ad hominem attacks, instead of facts. This lures people away from the evidence presented, and puts the focus on the peoples’ personalities and associations, which reinforces negative stereotypes of conspiracy theorists. Avoid personality attacks and stick to the facts. Apparently, according to a recent study, more commentators on the Internet are intelligently addressing conspiracy analysis and fact than are disputing it. Here are a couple of video clips that show the desperation of conspirators to demean conspiracy analysts:\n• Approach conspiracy topics gently and thoughtfully. My wife, Kimberly, and I have had a lot of practice with this. Your delivery and approach to discussing new ideas makes a big difference. Here’s a video guide on how to have difficult conversations with friends without losing friendships:\n\nIf we allow ourselves to have our critical thinking stopped by the threat of being associated with “conspiracy,” I believe we make ourselves easy to dupe, manipulate, divide and conquer. We lose the power we can have when instead we share our insights and transparently and respectfully explore our different perspectives to encourage bold, honest inquiry into what is going on and what we can do to create a world where everyone has the chance to thrive.", "opengraph": {"type": "cause", "site_name": "News Flash —  CIA Invents “CONSPIRACY THEORY” | Thrive", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/090/original/Conspiracy.png", "title": "News Flash — CIA Invents “CONSPIRACY THEORY”", "url": "http://www.thrivemovement.com/news-flash-cia-invents-conspiracy-theory.blog", "description": "How did “conspiracy theory” become the target of ridicule?"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/c0sdhjU9miw\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/c0sdhjU9miw"}], "links": ["http://www.jfklancer.com/CIA.html", "https://www.youtube.com/watch?feature=player_embedded&v=gMrJu8Gx9eY", "http://ssrn.com/abstract=1084585", "http://www.thrivemovement.com/the_movie", "https://youtu.be/rSj5tST9YEE", "http://endoftheamericandream.com/archives/14-conspiracy-theories-that-the-media-now-admits-are-conspiracy-facts", "http://amresolution.com/2013/02/05/33-conspiracy-theories-that-turned-out-to-be-true/", "http://intellihub.com/2013/07/20/16-conspiracy-theories-that-turned-out-to-be-true/", "http://www.thrivemovement.com/the_problem-gda", "http://www.presstv.com/detail/2013/07/12/313399/conspiracy-theorists-vs-govt-dupes/", "https://youtu.be/-eVFDY8IN1s", "https://youtu.be/6K5M0xtxQVQ", "https://youtu.be/s9Jw0pwTtus", "https://youtu.be/3K49vP-1LKg", "https://youtu.be/rRYJ4SOVAJw", "../../stay-informed"], "authors": [], "publish_date": null}