{"result_id": "316028", "URL": "http://www.thrivemovement.com/who-killing-healers-and-why", "timestamp": "2023-04-25 17:42:13 CEST+0200", "meta": {"description": "MUST READ: Who is killing the healers? #FollowTheMoney #MedicalMafia #BigPharma", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/who-killing-healers-and-why", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Who is KILLING THE HEALERS and Why?", "cleaned_text": "In June of 2015, a well-respected Florida health practitioner, Dr. Jeffrey Bradstreet, went missing and was then discovered floating face down in a North Carolina river, a bullet hole in his chest. Foul play?\n\nWhy would anyone order a hit on a generous family man who was just trying to do good? The death is still shrouded in mystery. Authorities almost immediately ruled his death a suicide, but his family says otherwise. Who shoots themselves in the chest to commit suicide, while positioned in just such a way that they will fall into a river?\n\nDr. Bradstreet’s own son was brain damaged following an MMR vaccine at 12 months of age. The experience helped convince the doctor to look into a link between the vaccine and autism. He was working on two leading edge areas of medical inquiry.\n\nFirst, he was doing research that seemed to support the compelling notion that certain vaccines could induce autism. He ended up testifying twice about this before Congress. Second, he was working with a new compound out of Switzerland that was greatly relieving, if not outright curing, cancer and other diseases. With vaccine revenues over $25 billion and cancer drugs over $100 billion, pharmaceutical industries risk losing huge profits if research like Bradstreet’s continued positively and reached a wide audience. In fact, it could spell the end of numerous mega corporations.\n\nWas there any evidence to document a financial motive?\n\nYes, just three days before his death, Bradstreet’s research facility had been raided by U.S. government agents to shut down his research and halt his treatment of patients. The warrant that describes the items to be seized indicates a motive to protect pharmaceutical dominance and suppress natural cures.\n\nOK, but such an isolated incident doesn’t mean there’s a major conspiracy to suppress cures and eliminate holistic doctors. Maybe he was depressed, or cheating, or got in with the wrong crowd…\n\nIndeed, but what if I told you there was another holistic doctor, Dr. Nicholas J. Gonzalez, known for helping actress Suzanne Sommers overcome her cancer, who died unexpectedly just a month later. Gonzalez had been in excellent health and his sudden collapse was apparently “cardiac related,” but a subsequent autopsy showed no evidence of this.\n\nAll right, two could still be coincidence. What was he working on?\n\nDr. Gonzalez focused a lot on holistic alternatives to radiation and on exposing the dangers and destructive history of the more than 100 chemotherapy drugs, revealing that they were developed from poisonous nerve gas. Here is an interview filmed shortly before his death where he emphasizes the importance of patients believing in whatever treatment they choose.\n\nBut we don’t know what really happened with either of these two doctors. That’s pretty thin evidence claiming any sort of campaign against holistic doctors.\n\nAnd if there were three? How about five, or eight, or ten? The tragic reality is that there have been at least thirteen holistic doctors who have “turned up dead or missing” in just a few months. Here is a timeline of recent suspicious doctor deaths:\n\nAnd what did they have in common besides being “holistic?”\n\nAlmost all of them were operating in ways that undermined traditional pharmaceutical-based treatments.\n\nI can understand the risk of exposing that certain vaccines seem to be causing autism, but what is this cancer treatment they were working with?\n\nIt’s called GcMAF. It stands for Globulin component Macrophage Activating Factor and it’s a human protein that the body makes naturally, but that some people lack in part or entirely. In this video, you can see the GcMAF activating the body’s own macropohages, which can then attack and destroy breast cancer cells in vitro:\n\n“GcMAF and/or oral Colostrum MAF macrophage activation therapy is indicated in the treatment of any diseases where there is immune dysfunction or where the immune system is compromised,” explains the website of a clinic out of Japan that sells an oral form of GcMAF.\n\nWhat is this GcMAF useful for?\n\nBesides cancer, the conditions listed as appropriate candidates for benefit from GcMAF treatment include:\n\nGcMAF is also showing itself to be effective for treating autism.\n\nI personally know individuals who have been dramatically helped by taking GcMAF. Marco Ruggerio delivered a paper at the AutismOne conference in May of 2015 — just before these murders started. Over the summer, patients who were using it had their supplies cut off from their original source in Switzerland where the company was being harassed and threatened. Subsequent shipments from another country were intercepted at the U.S. border, though eventually allowed through. Authorities in the UK have also been confiscating this beneficial compound.\n\nHere is the documentation for a patent involving GcMAF, held by Japanese researcher, Nobuto Yamamoto.\n\nDr. Robert O. Young, holistic practitioner and author of the pH Miracles books, now says he is wearing a body camera. Others have hired bodyguards. Some continue with business as usual. Some have stopped recommending GcMAF to patients out of fear for their lives. This, of course, is most likely the secondary reason for assassinations of holistic doctors — to intimidate others into stopping their alternative practices, their purchase of natural remedies and their speaking out against the traditional cancer sickness industry that banks on the continuing wave of new cases.\n\nIt is a sad irony of our current upside-down Orwellian police state that some of the families of the victims have tried, without success, to get the FBI to do deeper investigations.\n\nAre you claiming these deaths are in fact part of some kind of CONSPIRACY?\n\nCritical thinking requires each of us to assess if there are common threads that indicate a hidden agenda behind this violence. I believe the conspiratorial aspects of this suppression go even deeper. One of the things that GcMAF does is kill a protein made by all cancer cells called nagalase, which is excreted by cancer cells to disarm the human immune system. Nagalase causes immunodeficiency.\n\nIt seems that most of the doctors who recently died mysterious deaths were connected to treatment practices that employed GcMAF to defeat the effects of nagalase and successfully boost the immune system’s ability to fight certain diseases.\n\nHere is a video that suggests that nagalase is intentionally put into vaccines to weaken the immune system. Dr. Bradstreet found that autistic children tended to have a highly elevated level of nagalase in their blood. He claimed to have tested over 400 autistic children for the viral marker nagalase, and found that close to 80% of them had significantly elevated levels. This would make sense as part of a dumbing down and depopulation agenda as described in THRIVE (at 1:33:55). Bradstreet treated 1,100 patients with GcMAF, with an 85% response rate.\n\nAs contrary as it is to how they are promoted, vaccines have been proven to be an ideal mode of transmission for covert purposes, including spreading clandestine sterilization and fatal illness. The World Health Organization, UNICEF, and the U.S. Centers for Disease Control have been caught over 30 times covertly attempting to sterilize the birth age girls and women of various populations in Africa, Mexico, South America and the Philippines. Recently in the Mexican town of La Pimienta, 53 children were vaccinated for tuberculosis, rotavirus and hepatitis B — the same strains targeted by U.S. vaccines for children. 75% of the town’s children ended up in the hospital or dead.\n\nThere has been virtually no mainstream media coverage of either the success of GcMAF, its suppression or the death of all these practitioners. Why not? In my experience, lack of mainstream media coverage is a common sign of a larger hidden and suppressive agenda.\n\nMaybe the mainstream media reporters are simply unaware of what’s going on?\n\nI’m sorry to say this is not the case. Erin Elizabeth, the primary health blogger tying these deaths together repeatedly and specifically appealed to Time magazine to interview her and to investigate and cover these stories. Time had been sniffing around for an interview on the holistic doctor deaths. Family members told Erin and she wrote Time saying they were in mourning, but that she could do an interview, as she had been covering the story for months. They received her request, but would not respond to her communications.\n\nIn THRIVE, we covered the suppression of treatments and cures developed by Royal Rife, Rene Caisse, Harry Hoxey, and Max Gerson. We unfortunately see the same pattern continuing, not only with these holistic practitioners, but with others in our Solutions Hub Network who are being harassed, threatened, covertly radiated with ELF waves and who have had attempts on their lives.\n\nAnother potentially related horrific event was the “Aquarust” amphetamine poisoning of 29 alternative medicine practitioners at a health conference in September near Hamburg, Germany. Fifteen ambulances took the afflicted to nearby hospitals. None died.\n\nI don’t have the definitive proof that all of the doctors who’ve died suspiciously were murdered in an organized plot. But I have no doubts, after decades of research, that there are those who would protect their profits and control “at any cost”. One of my personal goals is to help expose these sociopathic criminals and obsolete their agenda. I hope that this summary will help shine the light on the numerous tragic suppressions of the brilliant innovators trying to bring vibrant health, safe and cheap energy, whole foods and clean water to the world. Part of how we can help them is to take their stories and concerns seriously.\n\nWHAT TO DO?\n\nSpread the word. Education is the foundation of any effective action. Dare to bring up these challenging topics. Be sensitive to timing and setting. Use questions that join participants in a quest for truth rather than trying to force information and perspective on those who are not yet exposed to this sad reality, or who are not ready to consider it.\n\nUse alternative media, but also use any leverage with more mainstream outlets to get them to at least raise questions about these incidents of suppression and to put an investigative reporter on them.\n\nIf you have the resources, donate to help victim’s families and to pay for private investigators to go after the truth. (contact Erin Elizabeth at Health Nut News.)\n\nYou can also donate to the Indigenous Health Care Practitioners Organization (IHCPO), a Native American group that certifies over 200 practitioners under native sovereignty to practice alternatively without limitation by the FDA and AMA.\n\nThe truth will have its day, and health will have its way.", "opengraph": {"type": "cause", "site_name": "Who is KILLING THE HEALERS and Why? | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/001/589/original/12-doctors.png", "title": "Who is KILLING THE HEALERS and Why?", "url": "http://www.thrivemovement.com/who-killing-healers-and-why", "description": "At least 13 holistic doctors have “turned up dead or missing” in just a few months… What’s really going on?"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe width=\"480\" height=\"360\" src=\"https://www.youtube.com/embed/D1WZrnCcH24?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/D1WZrnCcH24?rel=0"}], "links": ["http://scienceblogs.com/insolence/files/2015/07/BradstreetSearchWarrant.pdf", "https://www.youtube.com/watch?v=24YkS4bwHvs", "http://www.healthnutnews.com/recap-on-my-unintended-series-the-holistic-doctor-deaths/", "http://www.saisei-mirai.or.jp/gan/index_eng.html", "http://www.naturalnews.com/050553_Dr_Bradstreet_GcMAF_cancer_therapy.html", "https://www.youtube.com/watch?v=TPsVpuYw11c", "https://www.gov.uk/government/news/regulator-warns-against-gcmaf-made-in-unlicensed-facility-in-cambridgeshire", "https://www.google.com/patents/US5620846", "http://www.richardpresser.com/wordpress/is-this-the-real-reason-holistic-doctors-are-being-killed-and-vanishing/", "https://www.youtube.com/watch?v=cALgIHETMDU", "http://www.thrivemovement.com/the_movie", "http://www.naturalnews.com/049669_vaccine_injury_depopulation_agenda_deadly_side_effects.html", "https://www.youtube.com/watch?v=6gzTeO5z02g", "http://www.healthnutnews.com/contact/", "https://ihcpo-nsn.org", "http://bit.ly/1RfHMar", "http://bit.ly/1RfHMar", "http://bit.ly/1NbCN2O", "http://bit.ly/1UpErG0"], "authors": [], "publish_date": null}