{"result_id": "316004", "URL": "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie", "timestamp": "2023-04-25 17:41:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/images/favicon.ico", "canonical": "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie", "encoding": "utf-8"}, "image": null, "domain": "www.thrivemovement.com", "title": "Foster and Kimberly Gamble's Response to John Robbins Critique | Article", "cleaned_text": "This is a response to John Robbins' recent critique of THRIVE, entitled Humanity and Sanity: Standing for a Thriving World (and Challenging the Movie THRIVE).\n\nTo see the full dialogue between the Thrive Filmmakers and Pioneers, and to add any comments, please visit: www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers.\n\nWe appreciate the tireless commitment to humanity that John Robbins’ work reflects and we honor his choice to organize and speak out on behalf of those who feel that THRIVE’s message is somehow counter to his vision of a better world. Unfortunately, the process by which he has expressed his concern relies on misrepresentation of our film and its message, and describes our offering not by what we say or include in the film so much as by the associations of some of the people from whom we have learned certain information. It’s like saying the people who made the movie must be suspect because the stuff they didn’t include was really bad. This distracts from a more fruitful conversation where core issues and strategies can be discussed and debated with respect and curiosity so that our mutual process can indeed contribute something of value in these perilous times.\n• He has not corrected a single fact from THRIVE;\n• He confirms the sociopathic and greedy destructiveness of a few banking elite controllers, but relies on “coincidence theory” to justify the success of the elite’s endeavors in every sector of human endeavor across the globe;\n• His solutions are more of what we’ve been doing that got us into the mess we’re in, and more of what hasn’t worked to get us out;\n• He derides free energy with no research or facts, while ignoring numerous eye-witness reports (including our own) and ignoring the brutal suppression of numerous inventors;\n• He implies that the mass of humanity is not compassionate or competent enough to take care of one another without an authoritarian state, even if they are prosperous and free.\n\nWe have repeatedly invited John to participate in a constructive and respectful public or private conversation to discuss the issues and to engage in a meaningful exploration of solution strategies. Sadly, he has refused every time.\n\nIn just 5 months, millions of people have verified the usefulness of our movie and website, and THRIVE-inspired solution groups are forming in cities all over the world. So what is the need that THRIVE is meeting? We believe it is the call for bold new solutions that finally transcend the political polarity of left and right and reveal principles by which a lasting new paradigm of solutions can emerge and be sustained. Let’s see how:\n\nIn his article, John Robbins states, “There is no doubt that staggering wealth and power is today concentrated in the hands of a tiny minority of humanity. The combined net worth of the world’s richest thousand or so people — the planet’s billionaires — is almost twice that of the poorest 2.5 billion... It is also certain that networks exist among the most powerful people that enable a remarkably few people to shape the world’s economy, to determine what is known and what is not, which views are accepted and which are not, and what priorities and values will prevail. They decide whether we will live in war or peace, how our treasure will be spent, and they have proven to be eminently successful at enriching themselves at the expense of the common good.”\n\nJohn would have us believe not just that this is a coincidence, but that it is actually everyone’s fault. He states:\n\n“This disparity is nothing less than an indictment of our civilization.”\n\nOnly a few years ago, Robbins was deceived out of a significant amount of his savings by the Ponzi scheme of Bernie Madoff. He was very public about the deception and who did it. (http://www.huffingtonpost.com/john-robbins/whos-done-more-damage-ber_b_795250.html) So it seems strange, as billions are having their lives destroyed by the greatest national and global Ponzi scheme in history (the international central banking scheme)... that naming who, how and why suddenly becomes “us and them” fantasies “about secret conspiracies that distract us from the work at hand.” The real source of the problem, says Robbins, “is in all of us, and in the economic systems we have collectively produced.” We believe this is an uninformed and dangerous interpretation that undermines people’s ability to recognize the power we have to change the dynamic.\n\nIf you feel you are personally responsible for the mortgage fraud, for the devaluation of the dollar, for the wars of aggression killing millions of innocent people with your money, for the lack of decent health care, and for the lies of the corporate media, then what THRIVE offers is not for you. If you instead believe that we have been deceived and deprived of our power and feel ready to reclaim it, then we encourage you to join with the millions of people empowered by THRIVE to come together in this bold time of awakened action to stand up for our lives and our future.\n\nMuch of Robbins portrayal of THRIVE relies on the technique of guilt by association, which basically precludes benefitting from anyone’s research unless you agree with everything they say. This approach would allow us to learn only from the small few with whom we share a political perspective.\n\nTHRIVE offers an integration that transcends party politics. We spent years doing our homework – listening to people who disagree so that we could do the critical thinking for ourselves. We found value in many perspectives, and took the gems of each to help create the coherent picture that THRIVE offers.\n\nRobbins questions our judgment for interviewing G. Edward Griffin in the film because he’s a member of the John Birch Society. We do not endorse the John Birch Society, nor the Democratic Party nor the Republican Party nor any political Party. Our intention was never to make a political movie nor can we discern the value or logic of being judged by the political affiliations of the people from whom we have learned. In the case of Griffin, we deeply value the thorough research that he has done to expose that the UN was in fact originated by the Rockefellers; it’s controlled with unfair advantage by the elite nuclear countries; and it’s deemed noble because it considers “granting” us rights [Universal Declaration] that we believe should already be inalienable – for ALL people, and not in a way that they can be taken away, which the Universal Declaration allows. Griffin also has revealed valuable research about the suppression of cancer cures and the deceptive control and destruction of human lives by a corrupt money system (Fiat money and The Federal Reserve).\n\nRobbins also does not feel comfortable being in a movie with David Icke, who he says “advocates utterly bizarre theories” –although none of the theories John objects to are in THRIVE. Instead, Icke provides a very sound critique of the money system: that banks have the power to create money out of nothing; that the Federal Reserve can rig “booms and busts” by lowering and raising interests rates; and that “the greatest prison people live in is the fear of what other people think.” We benefitted from this analysis, and find that millions of others feel similarly, which is why he’s included in THRIVE. We stand by what Icke says in the film, just as Robbins and the dissociates stand by what they say in the movie.\n\nWe question the value of John avoiding this key information and instead focusing on the other work of people intentionally NOT included nor endorsed in THRIVE.\n\nAnother person we learned from was Ludwig von Mises, who experienced the horrors of communism and fascism in Europe and spent his lifetime exploring principles of ethics and logic that would protect the freedom and security of each person. Von Mises is one of those who inspired us to do the deep personal inquiry needed to answer fundamental moral questions, like:\n\nThese are questions that John Robbins has refused to answer in our correspondence with him.\n\nWe believe we could have a valuable public conversation with all of the Pioneers in THRIVE about these very questions and more. We invite them all to engage with us in a meaningful dialog.\n\nWhat Robbins repeatedly avoids recognizing is the Stages of Solutions which THRIVE offers, including the best of the Progressives (Stage 1), the best of the Conservatives (Stage 2), and then more far reaching and inclusive solutions which ultimately transcend the limits of both and go for the principles that people like von Mises and Molyneux explore in depth – and which we recommend holding as a beacon as we begin the bold transition that can take us beyond the limits of our current system into a non-coercive world that truly works for everyone (Stage 3).\n\nRobbins states, “global warming may be one of the most serious threats faced by humanity and many of the other species on the planet.” We do not question that the climate is changing. Clearly glaciers don’t just start melting on their own. What we do question is what is causing it, which informs what communities should be doing to prepare. A key question is: how can we stop climate change from being used to convince good people to support a carbon tax that would fund a system of global governance that would be run by the World Bank and enforced by global police and which holds no promise for meeting the needs of most people on the planet? This is what we and people like Lord Monckton are warning about. What’s called for here is to distinguish between denying that the climate is changing (which we do not) and valuable inquiry into some of the deeper issues surrounding climate change (which we do). This is a distinction we feel would serve people far more than name-calling and disassociation.\n\nJohn Robbins claims we said Japan’s earthquake was caused by HAARP – an electromagnetic antenna array project in Alaska that can focus 3.6 billion watts of radio-frequency energy into a single area of the atmosphere. We hope John said this because he misremembered and was not just distorting this for effect. In fact, what we said is that we check into major earthquakes now that we are familiar with HAARP’s involvement in causing other quakes. We currently have no evidence of HAARP causing Japan’s earthquake, however, there is ample evidence of HAARP involvement in both the Chile and Haiti quakes.\n\nBoth the Chile and Haiti quakes immediately followed maximum charging of the HAARP antenna – which was cut off just as the quakes started. In the case of Haiti, the US just happened to have 10,000 troops at the southern tip of Florida who moved quickly to take over the Haitian capitol airport. Clinton and Bush Sr. took over the relief effort, which has done little. Meanwhile, the gold and oil discovered in a recent resource assessment by President Aristede before he was ousted in a CIA-backed coup, are now looking like they will end up in the coffers of the Northern elite. There are many pictures, patents, videos, books, contracts etc. which prove HAARP’s existence – all of which are available here on the THRIVE website: http://www.thrivemovement.com/human-geo-engineering-chemtrails-and-haarp.\n\nWe agree with John that some vaccines have had useful effects. However, Mercury, Squalene and endocrine disruptors are not necessary parts of vaccines. They are dangerous toxins that go way beyond what John Robbins calls “troubling side effects.” The rest of the story is that vaccinations have been used by certain people through certain organizations – especially the WHO and UNICEF – to covertly sterilize people, usually brown-skin populations. The US has been caught multiple times doing just that. The fact checking for this is available at http://www.thrivemovement.com/fact_checks.\n\nEspousing that our current predicament is simply the consequence of our personal actions and consciousness distracts us with more vague, generalized guilt and confusion. It keeps us from recognizing who is most responsible for the pain and suffering on this planet, and how and why it’s happening... and then creating solutions commensurate with the reality of the threat at hand. Our empowerment comes not from imagining that we are responsible for the schemes that have most people on the planet suffering, but from waking up and taking action – something that vast numbers of people are doing all over the world.\n\nPeople who are at the effect of this agenda do not resist naming it and are frankly tired of poetic but nonetheless inaccurate assessments that wax on about how if we just worked a little harder on our shadows or dug a little deeper into our hearts we would not be in this mess, as Robbins implies. Our experience is that most people are thoughtful, caring, resilient, compassionate and capable, when given the chance to be, and that our predicament is not in fact our fault. It is, however, our challenge.\n\nPerhaps most disheartening of all is John’s continuous implication that we are in any way anti-Semitic. Foster’s own children are half Jewish. Robbins’ slurs against David Icke in the same vein are similarly reprehensible. If he were to actually read Icke’s writings and what he has stood for, he would find in Icke a courageous defender of the validity and rights of every individual. And at the same time Icke does not shy away from naming the deeds and agenda of some of the Rothschilds just because their heritage happens to be Jewish. Icke knows the truth of the agenda is not about ethnicity or religion. John D. Rockefeller was a Baptist, J. P. Morgan a Catholic and Andrew Carnegie an atheist.\n\nTHRIVE’s 3-Stage Solution Strategy – Caring for Those in Need While Stopping Wars of Aggression\n\nWe believe that people need to be taken care of with tax dollars as we transition to a world where people can choose for themselves how to spend their money – and where people have their own money to spend! The 3-stage solutions process outlined in the THRIVE movie and website shows how those most disadvantaged by our corrupt systems can be nurtured in transition by re-directing current tax revenue away from wars of aggression and eliminating the interest paid to the Federal Reserve – without creating new violations. Rather than stay stuck in an old failed paradigm, we ask that John and others imagine a world beyond scarcity – where we can actually stop being forced to hand over our money and our power to a group of controllers to make decisions for us. As our 3-stage solution model depicts clearly, we recognize the need for government to care for people as we transition to voluntary systems of social organization. With our beacon of non-violation, we ultimately stand for no authoritarian coercion of and theft from any human being. That is the seed of tyranny upon which all would-be dominators depend. Fortunately, as the Economic Freedom of the World report, and our own early American history show, the more individual and economic freedom people have the more prosperous, secure and healthy they are.\n\nMost people work at least one third of the year to pay for taxes. If everyone had this money to spend themselves, as they will when the Pentagon budget is cut in half and they no longer have to pay interest to the Federal Reserve, then we could in fact create a whole new way of relating and providing for ourselves and each other. Our proposed Stages 1 & 2 continue to include public schools and support programs, while transitioning gradually out of state-dependent and violence-based, mandatory systems. Robbins and the Authoritarian welfare programs he promotes both assume that human beings lack compassion, while taking away the time and money that people would naturally use to care for one another.\n\nWe welcome intelligent and respectful exploration of this transition process. Abdicating our own decision-making and resources to the aggregated power of an involuntary government has NEVER in history led to a truly thriving population. We are committed to a strategy that includes the well being of everyone – not just some and not just the majority, because we believe it is possible for all humans to thrive.\n\nWe invite any and all of the dissociate pioneers to step forward and engage in a direct public discussion with us about anything that THRIVE actually stands for. Then we can have a conversation that will be truly useful and profound.\n\nHere are a few reviews of THRIVE:", "opengraph": {"type": "cause", "site_name": "Foster and Kimberly Gamble's Response to John Robbins Critique | Article", "image": "http://s3.amazonaws.com/thrivemovementassets/resources/images/000/000/956/original/foster-kimberly.jpeg", "title": "Foster and Kimberly Gamble's Response to John Robbins Critique | Article", "url": "http://www.thrivemovement.com/foster-and-kimberly-gamble-response-to-john-robbins-critique-of-thrive-movie"}, "tags": [], "tweets": [], "movies": [], "links": ["http://projectearth.com/founder-essays/view/46-humanity-and-sanity", "http://www.thrivemovement.com/public-dialogue-between-thrive-movie-filmmakers-and-pioneers", "http://www.huffingtonpost.com/john-robbins/whos-done-more-damage-ber_b_795250.html", "../../human-geo-engineering-chemtrails-and-haarp", "../../fact_checks", "http://www.onecommunityranch.org/thrive/", "http://www.awareguide.com/index.php/articles/blogs/item/370-2011top", "http://grinningplanet.com/environmental-movies/t/thrive-review.htm", "http://quantumkool.com/2011/11/22/thrive-the-movie-changing-what-is-possible/", "https://removingtheshackles.blogspot.com/2012/04/thrive-now-everyone-can-watch-it.html", "../../odyssey-magazine-how-to-thrive", "http://www.glocals.com/forums/general/Thrive-and-control-your-destiny-or-it-will-be-taken-away-from-you-and-your-children-and-theirs----152065.htm", "http://www.flipleaf.com/pcmedia/positivelife17/spring2012"], "authors": [], "publish_date": null}