{"result_id": "317008", "URL": "https://www.treason.news/2021-08-18-navy-commander-sounds-alarm-on-mandatory-covid-vaccine-for-military.html", "timestamp": "2023-04-25 17:43:07 CEST+0200", "meta": {"description": "Regular readers know we’ve been reporting that the injuries and deaths related to the experimental COVID-19 vaccines are much higher than previous vaccines, but that doesn’t seem to matter to the powers that be in our government. In fact, the more harmful they become, the more our left-wing, Marxist authoritarian masters are pushing them, even […]", "lang": "en", "keywords": "catastrophe,civil war,covid vaccines,covid-19,military,military readiness,myocarditis,national security,risk,U.S. military,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2021-08-18-navy-commander-sounds-alarm-on-mandatory-covid-vaccine-for-military.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "U.S. Navy commander sounds the alarm on mandatory COVID vaccine for all military: It will create a national security crisis", "cleaned_text": "U.S. Navy commander sounds the alarm on mandatory COVID vaccine for all military: It will create a national security crisis\n\nRegular readers know we’ve been reporting that the injuries and deaths related to the experimental COVID-19 vaccines are much higher than previous vaccines, but that doesn’t seem to matter to the powers that be in our government.\n\nIn fact, the more harmful they become, the more our left-wing, Marxist authoritarian masters are pushing them, even to the point of literally putting our country at grave risk.\n\nEarlier this month, flunky Defense Secretary Lloyd Austin dutifully announced at the bidding of Joe Biden’s handlers that every currently serving military member will be forced to take the jab or face disciplinary action and court martial for ‘disobeying a lawful order.’\n\nMind you, current research has shown that while young people are not at risk of developing a serious case of COVID and dying from it, there is an elevated association between the vaccines and conditions like myocarditis and blood clotting in young people.\n\nGiven that by far, most members of the U.S. military are young, this fact alone should be a major red flag. But it isn’t; the Pentagon is going ahead with the vaccines anyway, though now, finally, some in the ranks are sounding the alarm bell.\n\nIn a two-and-a-half page paper, Navy CDR. J.H. Furman is warning that mass inoculation of U.S. military personnel could turn out to be a catastrophe.\n\n“The forced vaccination of all military personnel with the present COVID-19 vaccines may compromise U.S. national security due to the unknown extent of serious vaccine complications,” writes Furman, according to Revolver.news. “Further study is needed before committing the Total Force to one irreversible experimental group. Initial reports leave more concern for the COVID-19 vaccinations than the virus itself for the (at present) exceptionally healthy military population.”\n\nFurman is a career United States naval officer, naval aviator, and foreign area officer with extensive experience advising senior military, diplomatic, and international organization leadership. The commander has spent years serving throughout Africa, Asia, Europe, the Middle East at sea, ashore and airborne. He also holds a Master of Arts in Security Studies from the Naval Postgraduate School.\n\nFurman’s paper is not long, weighing in at just two and a half pages plus an equally long list of citations. But he nevertheless hits all the key points for why imposing COVID-19 vaccines on the entire general populace is driven by hysteria, not real concern for saving lives or stamping out the virus.\n\nHere are the highlights of Furman’s concerns:\n\n— Since most U.S. military personnel are very young and in better-than-average to excellent physical condition, they are in two categories of those least likely to become seriously affected by the virus. Thus far, Furman points out, only 24 out of 2.2 million U.S. military personnel have passed away because of the virus, or less than 1 per 91,000 members.\n\n— “There is reason to believe severe or even fatal side-effects from existing COVID-19 vaccines are more common than reported, and could even prove deadlier to otherwise-healthy servicemen than COVID-19,” Revolver News noted, citing available research indicating that young people suffer from outsized negative COVID vaccine reactions.\n\n— An evolving body of research indicates that the mRNA vaccines (the kind used by the Moderna and Pfizer shots) could have unanticipated bad effects on the immune systems of younger recipients.\n\n— “Currently, the U.S. military has proven completely capable of weathering COVID-19 without any loss of effectiveness, so forcibly making the entire service a test case for a novel type of vaccine is a pointless risk,” Revolver News noted.\n\nIn his paper, Furman adds that “the vaccine is more seriously injuring this unique population than the virus itself,” noting that a study in JAMA found that “23 U.S. service members experienced post-vaccination moderate to severe myocarditis who were otherwise healthy and non-symptomatic.”\n\nWill Furman’s arguments matter? Given the way the vaccine is being pushed by the Biden regime, the answer is obvious.", "opengraph": {"title": "U.S. Navy commander sounds the alarm on mandatory COVID vaccine for all military: It will create a national security crisis", "type": "article", "url": "https://www.treason.news/2021-08-18-navy-commander-sounds-alarm-on-mandatory-covid-vaccine-for-military.html", "site_name": "Treason News", "description": "Regular readers know we’ve been reporting that the injuries and deaths related to the experimental COVID-19 vaccines are much higher than previous vaccines, but that doesn’t seem to matter to the powers that be in our government. In fact, the more harmful they become, the more our left-wing, Marxist authoritarian masters are pushing them, even […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2021/08/US-navy-carrier-warships.jpg"}, "tags": ["covid vaccines", "covid-19", "U.S. military", "vaccine wars", "national security", "catastrophe", "myocarditis", "risk", "vaccines", "military readiness", "civil war", "military"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2021-06-23-athlete-recovered-from-covid-facing-different-future.html", "https://www.revolver.news/2021/08/navy-commander-warns-national-security-threat-from-mandatory-vaccination/", "http://www.pandemic.news", "https://www.revolver.news/2021/08/navy-commander-warns-national-security-threat-from-mandatory-vaccination/", "https://www.naturalnews.com/2021-06-23-athlete-recovered-from-covid-facing-different-future.html"], "authors": [], "publish_date": null}