{"result_id": "317043", "URL": "https://www.treason.news/2023-03-15-taxpayers-double-billed-government-projects-wuhan.html", "timestamp": "2023-04-25 17:43:35 CEST+0200", "meta": {"description": "The United States government may have duplicated payments for projects at labs in Wuhan, China, including the lab where the Wuhan coronavirus (COVID-19) was engineered and subsequently leaked to the public. Catherine Herridge and Analisa Novak of CBS reported that these labs may have billed both the National Institutes of Health (NIH) and the U.S. Agency for International […]", "lang": "en", "keywords": "badscience,big government,China,conspiracy,corruption,covid-19,deception,double billing,finance riot,government debt,insanity,money supply,national debt,pandemic,real investigations,research,Taxes,taxpayer dollars,traitors,treason,Wuhan Institute of Virology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2023-03-15-taxpayers-double-billed-government-projects-wuhan.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Investigation shows taxpayers may have been DOUBLE BILLED by US government for projects in Wuhan", "cleaned_text": "Investigation shows taxpayers may have been DOUBLE BILLED by US government for projects in Wuhan\n\nThe United States government may have duplicated payments for projects at labs in Wuhan, China, including the lab where the Wuhan coronavirus (COVID-19) was engineered and subsequently leaked to the public.\n\nCatherine Herridge and Analisa Novak of CBS reported that these labs may have billed both the National Institutes of Health (NIH) and the U.S. Agency for International Development (USAID), according to records they reviewed. (Related: America spent $11 TRILLION on COVID-19 but nearly NOTHING on compensating those injured by the vaccines.)\n\n“What I’ve found so far is evidence that points to double billing, potential theft of government funds,” noted Diane Cutler, a former federal investigator with over 20 years of experience handling cases of white-collar crime and healthcare fraud. “It is concerning, especially since it involves dangerous pathogens and risky research.”\n\nTaxpayers may have paid twice for gain-of-function research\n\nWhile reviewing evidence of possible double payments, Cutler found that U.S. government grants may have gone to support “high risk research” that was ongoing in China right before the COVID-19 pandemic.\n\nCutler was hired by Republican Sen. Roger Marshall of Kansas, who took her discoveries to USAID and the agency’s internal watchdog, which launched a new probe regarding the possible double payment.\n\nAccording to Cutler, she poured through over 50,000 documents proving that the U.S. government, using taxpayer funding, may have made duplicate payments for everything from Chinese employee salaries and travel expenses to medical supplies and equipment.\n\nSources told Herridge and Novak that these payments may be worth tens of millions of dollars. These same sources familiar with U.S. government grant records were given by Herridge and Novak with ample opportunity to contest the reporting but chose not to dispute it. This strongly suggests that the reporting is accurate.\n\nFurthermore, spokespersons from USAID and NIH have declined to comment. A USAID inspector general spokesperson declined to comment “on the existence of a specific open investigation.”\n\nNovak and Herridge noted that any independent investigation into the possibility of double billing could take at least six months to complete.\n\nThe Federal Bureau of Investigation and the Department of Energy believe COVID-19 originated from a lab leak. Specifically, these agencies believe it is highly likely COVID-19 originated from the Wuhan Institute of Virology, which was conducting viral research on coronaviruses when SARS-CoV-2 first emerged.\n\nGiven the impact the COVID-19 pandemic has had on the U.S., Marshall believes a 9/11-style commission needs to be established to figure out whether American taxpayer dollars were used to fund research on the coronavirus.\n\n“I think there are 1.1 million reasons that American taxpayers should care,” he said in a statement, referring to the number of Americans who have supposedly died due to COVID-19. As of press time, the U.S. is listed as having 1,111,342 cumulative deaths caused by COVID-19.\n\n“You’ll have a plane crash. We want to find out why the plane crashes,” said Marshall. “We go to any lengths to do that. And the hope is we don’t have another plane crash for the same reason.”\n\nLearn more about COVID-19, including its origins, at Pandemic.news.\n\nWatch this clip from “The Bottom Line with Dagen and Duffy” on Fox Business as hosts Dagen McDowell and Sean Duffy interview Republican Sen. Rick Scott of Florida, who is certain that COVID-19 came from the Wuhan Institute of Virology.\n\nThis video is from the News Clips channel on Brighteon.com.\n\nModerna CEO Stephane Bancel admits company made 100K COVID-19 vaccine doses in 2019 before the pandemic even started.\n\nEcoHealth Alliance whistleblower Dr. Andrew Huff spills the beans to Mike Adams about DARPA, bioweapons and their ties to Wuhan.\n\nGREED GALORE: Pfizer CFO tells investors that COVID will continue to be a “multi-million dollar franchise for many years to come.”", "opengraph": {"title": "Investigation shows taxpayers may have been DOUBLE BILLED by US government for projects in Wuhan", "type": "article", "url": "https://www.treason.news/2023-03-15-taxpayers-double-billed-government-projects-wuhan.html", "site_name": "Treason News", "description": "The United States government may have duplicated payments for projects at labs in Wuhan, China, including the lab where the Wuhan coronavirus (COVID-19) was engineered and subsequently leaked to the public. Catherine Herridge and Analisa Novak of CBS reported that these labs may have billed both the National Institutes of Health (NIH) and the U.S. Agency for International […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/03/United-States-Treasury-Money-Taxes-Return-.jpg"}, "tags": ["pandemic", "conspiracy", "taxpayer dollars", "big government", "deception", "national debt", "China", "double billing", "corruption", "Wuhan Institute of Virology", "money supply", "covid-19", "real investigations", "government debt", "treason", "finance riot", "insanity", "Taxes", "research", "traitors"], "tweets": [], "movies": [], "links": ["https://www.wnd.com/2023/03/investigation-u-s-taxpayers-may-paid-twice-wuhan-operations/", "https://www.cbsnews.com/news/us-government-agencies-may-have-been-double-billed-projects-wuhan-china-records-indicate-probe/", "https://www.naturalnews.com/2023-03-02-america-spent-trillions-covid-nothing-vaccine-injured.html", "http://english.whiov.cas.cn/", "http://biggovernment.news", "https://covid19.who.int/region/amro/country/us", "https://pandemic.news/", "https://www.brighteon.com/b1538357-137e-4aaa-97ac-9864f2316441", "https://www.brighteon.com/channels/newsclipsnow", "https://www.brighteon.com/channels/newsclipsnow", "https://plague.info/2023-03-13-emails-fauci-paper-disprove-wuhan-lab-leak.html", "https://www.naturalnews.com/2023-03-10-fauci-prompted-scientists-fabricate-covid-natural-origin.html", "https://www.naturalnews.com/2023-03-08-moderna-ceo-100k-covid-vaccines-manufactured-2019.html", "https://www.infections.news/2023-02-03-andrew-huff-divulges-links-darpa-bioweapons-wuhan.html", "https://newstarget.com/2022-11-11-pfizer-cfo-covid-multi-million-dollar-franchise.html", "https://www.wnd.com/2023/03/investigation-u-s-taxpayers-may-paid-twice-wuhan-operations/", "https://www.cbsnews.com/news/us-government-agencies-may-have-been-double-billed-projects-wuhan-china-records-indicate-probe/", "https://covid19.who.int/region/amro/country/us", "https://www.brighteon.com/b1538357-137e-4aaa-97ac-9864f2316441", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-03-15-taxpayers-double-billed-government-projects-wuhan&linkname=Investigation%20shows%20taxpayers%20may%20have%20been%20DOUBLE%20BILLED%20by%20US%20government%20for%20projects%20in%20Wuhan", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}