{"result_id": "317016", "URL": "https://treason.news/2023-03-08-who-positioning-global-health-dictatorship-masses-distracted.html", "timestamp": "2023-04-25 17:43:14 CEST+0200", "meta": {"description": "Newly proposed amendments to the International Health Regulations (IHR) would give the World Health Organization (WHO) dictatorial control over “public health,” which now includes free speech that is deemed to be “misinformation” or “disinformation.” If ratified, these amendments would force all United Nations member states, including the United States, to adopt vaccine passports. When the […]", "lang": "en", "keywords": "corrruption,deep state,dictatorship,disinfo,free speech,Globalism,health freedom,Liberty,money supply,national security,national sovereignty,pandemic treaty,police state,Public Health,Suppressed,treason,Tyranny,vaccine passports,vaccine wars,vaccines,WHO,World Health Organization", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2023-03-08-who-positioning-global-health-dictatorship-masses-distracted.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "World Health Organization positioning to become global health dictator while masses are distracted with “lab leaks”", "cleaned_text": "World Health Organization positioning to become global health dictator while masses are distracted with “lab leaks”\n\nNewly proposed amendments to the International Health Regulations (IHR) would give the World Health Organization (WHO) dictatorial control over “public health,” which now includes free speech that is deemed to be “misinformation” or “disinformation.”\n\nIf ratified, these amendments would force all United Nations member states, including the United States, to adopt vaccine passports. When the next plandemic arrives, in other words, the WHO will only allow those in compliance with the latest vaccine mandates to travel, work, eat, and live.\n\nThe WHO’s director-general would also be granted the authority to declare an international public health emergency at any time, just like Donald Trump did on March 11, 2020, in response to the Wuhan coronavirus (Covid-19), plunging the country into a totalitarian police state.\n\nIf the WHO gets its way, these will become global public health emergency declarations that inevitably lead to more lockdowns, mask mandates, jab mandates, travel restrictions, and whatever else the powers that be deem suitable as final solutions for the next “disease” scare.\n\nThe WHO’s plan is to invoke a Pandemic Treaty, allowing it to basically control the affairs of the entire world. And this is all being forged at a time when the media is distracting everyone with the “lab leak” scandal and the so-called “Lockdown Files.”\n\n“Is it a coincidence? Or are they distracting us so there’s less resistance?” asks The Exposé. “Or are they hoping the world’s population will beg for WHO to take over because our governments have failed us?”\n\n“Who are they? Only 13% of WHO’s budget comes from member states. The other 87% comes from mostly private institutions and individuals.”\n\nAmendments to 2005 IHR coupled with Pandemic Treaty spells game over for health freedom\n\nThere are actually two agreements the WHO is working on right now that will massively expand its powers in the event of a declared health emergency or pandemic: the IHR amendments and the Pandemic Treaty, which are similar but separate in scope.\n\nThe proposed amendments to the 2005 IHR include changing WHO’s advisory activities to mandatory, even when there is just a potential emergency rather than a real one. These amendments also allow the WHO to mandate medical treatments, overriding national sovereignty, in many cases.\n\n“Adoption of amendments only requires a simple majority,” notes The Exposé about how easily this threat could become a reality. “NO signature by country leaders and NO Senate or Parliament votes are needed.”\n\nThe Pandemic Treaty poses similar threats while creating additional ones. This would allow the WHO to arbitrarily speed up the drug approval process, sending to market every new emergency drug or vaccine at warp speed.\n\nThe Pandemic Treaty also supports and promotes gain of function research, which is believed to be what led to the creation and unleashing of the Fauci Flu.\n\n“Adoption of WHO CA+ requires a 2/3 vote by the World Health Assembly and can enter into force upon signature by nation’s leader,” reports explain.\n\nA conceptual zero draft of the Pandemic Treaty was discussed back in December and shared with member states on Feb. 1, 2023. From Feb. 27 through March 3, “relevant stakeholders” and WHO member states considered it, and the next thing to occur is a progress report that will be presented at the 76th World Health Assembly in 2023.\n\nIf all goes as planned, a final draft of the Pandemic Treaty will be submitted for consideration by the 77th World Health Assembly in 2024. As for the IHR amendments, those will likewise be presented to the World Health Assembly in 2024.\n\nThe latest news about the WHO’s push for dictatorial control over the entire world can be found at Tyranny.news.", "opengraph": {"title": "World Health Organization positioning to become global health dictator while masses are distracted with “lab leaks”", "type": "article", "url": "https://www.treason.news/2023-03-08-who-positioning-global-health-dictatorship-masses-distracted.html", "site_name": "Treason News", "description": "Newly proposed amendments to the International Health Regulations (IHR) would give the World Health Organization (WHO) dictatorial control over “public health,” which now includes free speech that is deemed to be “misinformation” or “disinformation.” If ratified, these amendments would force all United Nations member states, including the United States, to adopt vaccine passports. When the […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/03/WHO-symbol.jpg"}, "tags": ["Liberty", "deep state", "national security", "money supply", "corrruption", "dictatorship", "vaccine passports", "Public Health", "disinfo", "national sovereignty", "pandemic treaty", "vaccine wars", "treason", "Suppressed", "World Health Organization", "WHO", "police state", "Tyranny", "vaccines", "free speech", "health freedom", "Globalism"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/03/07/whos-plans-to-become-global-health-dictator/", "https://trumpwhitehouse.archives.gov/presidential-actions/proclamation-declaring-national-emergency-concerning-novel-coronavirus-disease-covid-19-outbreak/", "https://www.naturalnews.com/2022-05-01-blackrock-vanguard-controlling-america-centralized-food-production.html", "http://tyranny.news", "https://expose-news.com/2023/03/07/whos-plans-to-become-global-health-dictator/", "https://trumpwhitehouse.archives.gov/presidential-actions/proclamation-declaring-national-emergency-concerning-novel-coronavirus-disease-covid-19-outbreak/", "https://www.naturalnews.com/2022-05-01-blackrock-vanguard-controlling-america-centralized-food-production.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-03-08-who-positioning-global-health-dictatorship-masses-distracted&linkname=World%20Health%20Organization%20positioning%20to%20become%20global%20health%20dictator%20while%20masses%20are%20distracted%20with%20%E2%80%9Clab%20leaks%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}