{"result_id": "317037", "URL": "https://treason.news/2021-11-18-smallpox-biowar-globalists-prepare-perfect-scheme-to-cover-up-vaccine-deaths-epidemic.html", "timestamp": "2023-04-25 17:43:31 CEST+0200", "meta": {"description": "The good news is that the Biden vaccine mandate is almost certainly going to be struck down by the Sixth Circuit Court of Appeals. This will hand Biden a crushing defeat of his attempted agenda to mass exterminate the American people via “vaccine” bioweapons. The bad news is that once the vaccine mandate is struck […]", "lang": "en", "keywords": "biological warfare,biowar,bioweapons,deep state,depopulation,genocide,pandemic,smallpox,terrorism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2021-11-18-smallpox-biowar-globalists-prepare-perfect-scheme-to-cover-up-vaccine-deaths-epidemic.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "The SMALLPOX BIOWAR – globalists prepare “perfect” scheme to cover up vaccine deaths and cancel mid-term elections by unleashing a new, deadly epidemic", "cleaned_text": "The SMALLPOX BIOWAR – globalists prepare “perfect” scheme to cover up vaccine deaths and cancel mid-term elections by unleashing a new, deadly epidemic\n\nThe good news is that the Biden vaccine mandate is almost certainly going to be struck down by the Sixth Circuit Court of Appeals. This will hand Biden a crushing defeat of his attempted agenda to mass exterminate the American people via “vaccine” bioweapons.\n\nThe bad news is that once the vaccine mandate is struck down, globalists will be forced to resort to their next devastating strategy to achieve their goals of genocide and depopulation. It looks like their next weapon is going to be Marburg, Ebola or Smallpox.\n\nSmallpox is the most likely choice because it is extremely contagious and almost no one has immunity against it. Bill Gates has repeatedly warned — with a creepy grin — that America should be ready for a smallpox terrorism attack targeting US airports. When Bill Gates warns about something like this, it’s usually because globalists are planning to carry it out.\n\nYahoo News reported this week that vials labeled “smallpox” were discovered in a Merck laboratory, in violation of US law. In the continental United States, only the CDC’s facility in Atlanta is authorized to store smallpox vials. So what is Merck — a vaccine manufacturer — doing with smallpox vials?\n\nYou wouldn’t be crazy to suppose they’re working on the next big bioweapons release to generate another wave of profits from smallpox vaccines.\n\nBut a smallpox release by the globalists accomplishes much more than just depopulation…\n\nThe effect of a deliberate smallpox release by the anti-human globalists would be a covering up of covid vaccine deaths, which are already beginning to wildly accelerate. Millions of people will die around the world from covid vaccines in just the next six months as immune suppression, Antibody Dependent Enhancement and cancer tumors growths all accelerate. The globalist cabal is desperate to distract the world from the depopulation effects of the vaccine, so they need some larger mass death catastrophe to take the blame.\n\nSecondarily, a smallpox outbreak would also allow the criminals in D.C. to declare a national emergency and suspend the 2022 mid-term elections, where they are likely to be politically slaughtered. Current polls, if projected into election results, show that Democrats are very likely to lose the House, Senate and numerous state governorship and state legislatures, leaving Biden (or Harris) with no effective power other than unconstitutional executive decrees (which the courts keep shooting down).\n\nThus, Democrats need a bigger catastrophe to cancel the 2022 elections. Smallpox (or Marburg) is their “perfect” choice, given that they have zero respect for human life and would sacrifice every last living American if doing so would keep them in power. They are like crazed, insane animals, willing to do absolutely anything to maintain their control.\n\nBill Gates paints a picture like “12 Monkeys” with airport release of smallpox\n\nBill Gates has warned governments to prepare for smallpox terror attacks and future pandemics by investing billions into research and development.\n\nThe Microsoft founder suggested that the ‘germ games’ could prepare nations for bio-terrorism such as smallpox attacks on airports. Mr Gates warned that bioterrorism caused epidemics could be worse than naturally occurring ones.\n\nWhy did Bill Gates specifically choose smallpox and airports for his example? Because that’s the most effective way for bioterrorists — i.e. depopulation globalists — to initiate their next biowar. It’s a scene ripped right out of 12 Monkeys, the dystopian sci-fi film starring Bruce Willis and Brad Pitt.\n\nFurthermore, a globalist release of smallpox would likely trap many vaccine skeptics and anti-mask individuals who have become accustomed to taking few precautions in public. While “covid” turned out to be little more than a renamed flu, weaponized smallpox has at minimum a 30% mortality rate and can go much higher depending on its configuration. To survive smallpox, Americans would have to lock themselves down for an extended period of time… perhaps an entire year, with virtually no supplies of food, fuel, medicine, water or other essentials. Many people who have dismissed the severity of covid would inadvertently expose themselves to smallpox, with devastating consequences.\n\nThe bigger the crisis, the more the powers that be can assert their false authority and deprive people of basic civil liberties (and human rights). That’s why a smallpox deployment is the single most effective strategy that anti-human globalists can pursue right now to further enslave humanity and crush the United States of America.\n\nWill they really pull the trigger on this and release it? We have no way of knowing in advance, but we’ve already seen their willingness to unleash other horrendous weapons against humanity that are resulting in mass death across the planet (i.e. spike protein “vaccine” injections that are biowarfare murder weapons).\n\nAccording to OurWorldInData.org, 52.4% of the world’s population has received a covid vaccine. That’s over 4 billion people, and the number is growing by nearly 30 million per day. With a 50% long-term fatality rate from these vaccines — spanning short term, medium term and long term causes of death — it means globalists are effectively slaughtering 15 million human beings per day.\n\nThat’s TWO Nazi Holocausts each day, every day, as the vaccine holocaust continues to mass murder humanity. All the deaths aren’t instantaneous, so it will take years for these numbers to be fully realized, but once a person is injected, their death clock is already counting down.\n\nGet full details on the smallpox scenario in today’s Situation Update podcast via Brighteon.com:\n\nDiscover a new podcast each day — along with mind-expanding interviews with top people — at:", "opengraph": {"title": "The SMALLPOX BIOWAR – globalists prepare “perfect” scheme to cover up vaccine deaths and cancel mid-term elections by unleashing a new, deadly epidemic", "type": "article", "url": "https://www.treason.news/2021-11-18-smallpox-biowar-globalists-prepare-perfect-scheme-to-cover-up-vaccine-deaths-epidemic.html", "site_name": "Treason News", "description": "The good news is that the Biden vaccine mandate is almost certainly going to be struck down by the Sixth Circuit Court of Appeals. This will hand Biden a crushing defeat of his attempted agenda to mass exterminate the American people via “vaccine” bioweapons. The bad news is that once the vaccine mandate is struck […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/04/HRR-2021-11-18-Situation-Update.jpg"}, "tags": ["biological warfare", "bioweapons", "pandemic", "biowar", "deep state", "terrorism", "genocide", "depopulation", "smallpox"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2021-11-17-biden-vaccine-mandate-looks-doomed.html", "https://news.yahoo.com/vials-labeled-small-pox-found-in-lab-near-philadelphia-003127682.html", "https://news.yahoo.com/bill-gates-warns-smallpox-terror-115657596.html", "http://biowar.com", "https://ourworldindata.org/covid-vaccinations", "http://vaccineholocaust.org", "http://Brighteon.com/757a7df2-9d8c-412f-8095-d2aba1dff321", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2021-11-18-smallpox-biowar-globalists-prepare-perfect-scheme-to-cover-up-vaccine-deaths-epidemic&linkname=The%20SMALLPOX%20BIOWAR%20%E2%80%93%20globalists%20prepare%20%E2%80%9Cperfect%E2%80%9D%20scheme%20to%20cover%20up%20vaccine%20deaths%20and%20cancel%20mid-term%20elections%20by%20unleashing%20a%20new%2C%20deadly%20epidemic", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}