{"result_id": "317045", "URL": "https://www.treason.news/2023-03-31-tiktok-ban-many-us-states-just-gaslighting.html", "timestamp": "2023-04-25 17:43:37 CEST+0200", "meta": {"description": "Nearly every “smart” device is a spying apparatus for Big Government, just in case you did not know that already. There is no real “privacy” anymore, but the talking heads in Washington DC would have us believe otherwise. Sure, over 30 countries around the world have already banned TikTok over security concerns, but how are […]", "lang": "en", "keywords": "Beijing Biden,CCP,Chinese Communist Party,communist China,Glitch,national security,privacy watch,schiff lies,Social media,spy app,Spygate,spyware,surveillance,TikTok,tiktok app,watched", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2023-03-31-tiktok-ban-many-us-states-just-gaslighting.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "TikTok ban in many US states is just gas-lighting about spying app “concerns” while every other app and social media platform spies on us 24/7/365", "cleaned_text": "TikTok ban in many US states is just gas-lighting about spying app “concerns” while every other app and social media platform spies on us 24/7/365\n\nNearly every “smart” device is a spying apparatus for Big Government, just in case you did not know that already. There is no real “privacy” anymore, but the talking heads in Washington DC would have us believe otherwise. Sure, over 30 countries around the world have already banned TikTok over security concerns, but how are those “concerns” any different than what’s been happening with security and privacy issues with every smart device used for the past 20 years? Big Government has been collecting private citizen data in every way, including every social media post, text, email, phone call, video conference, and comments made on the internet. So, you were saying? In America, of course, the Democrats want to keep TikTok… wait for it… “for the children.”\n\nTikTok is owned by the Chinese Communist Party, but so is Beijing Biden\n\nYoung people in America are being brainwashed by the Democrat Party, and apps like TikTok are very important for the crooks in Washington DC to build that “base” of voters and upcoming voters (teens) who actually value social media, gender fluidity, Hollywood, Disney, and other communist platforms for their news and entertainment.\n\nMeanwhile, public universities and state governments across the country are banning the TikTok app from official devices because the CCP owns it, so it just might happen to be part of their spy ware apparatus, like the balloon that floated over America while Biden watched, eating his ice cream cones.\n\nFor Democrats, votes are far more important than national security, so “activists” are saying that banning TikTok would be a “slap in the face” for the young voter base. Meanwhile, every camera at every road intersection, ATM, over highways, in downtown districts, and Google Earth, are recording every move every American makes. Want a slap in the face, just try out the vaccine passport app and take a guess WHO is spying on your medical records and tracking your vaccine “status.”\n\nPlus, every purchase made without cash is recorded and the data collected, analyzed, and scrutinized for reverse marketing purposes. Every app on every smart device is also a data collection hub for collecting private information and using it against the consumers, to manipulate their buying habits and track their lifestyle habits, like tracking gun and ammunition purchases. Even smart TVs spy on kids in the living rooms of their homes.\n\nInstead of banning ONE social media app, how about banning illegal voting, closing the borders of this country, preventing the CCP from buying massive swaths of US land, and ending the beginning of WWIII in Ukraine? Banning TikTok is just a head fake, and it’s gas-lighting the real communist infiltration and takeover of the Republic. Take a closer look at it all and it’s quite obvious.\n\nNew House Speaker Kevin McCarthy boots communist Adam Schiff off the House Intelligence Committee, so Schiff complains about it on TikTok\n\nWhat better platform for American communists to complain about limited communist resources for spying on Americans than on the CCP’s favorite spy ware app TikTok? That’s just what Adam “Commie” Schiff just did. You simply can’t make this stuff up.\n\n“Hello, I’m Congressman Adam Schiff with some troubling news. Today Kevin McCarthy removed me from the Intelligence Committee all for doing my job, for holding Trump accountable and standing up to the extreme MAGA Republicans. We knew it would be bad when Republicans took over but it’s far worse than we expected.”\n\nIf anyone in Congress chooses to ban TikTok over CCP spying concerns, then it’s also time to impeach Beijing Biden, the best spy and cohort the CCP has, who literally has his demented brain trying to remember the nuclear codes for starting WWIII. Do your own research and don’t use Google. Try the search engine Brave BETA and get more truth news and real information. Bookmark Censored.news to your favorite websites for truth news that’s being censored from the rest of media as you read this.", "opengraph": {"title": "TikTok ban in many US states is just gas-lighting about spying app “concerns” while every other app and social media platform spies on us 24/7/365", "type": "article", "url": "https://www.treason.news/2023-03-31-tiktok-ban-many-us-states-just-gaslighting.html", "site_name": "Treason News", "description": "Nearly every “smart” device is a spying apparatus for Big Government, just in case you did not know that already. There is no real “privacy” anymore, but the talking heads in Washington DC would have us believe otherwise. Sure, over 30 countries around the world have already banned TikTok over security concerns, but how are […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/03/Woman-Covid-19-App-Phone-Vaccine-Passport.jpg"}, "tags": ["CCP", "TikTok", "schiff lies", "national security", "communist China", "watched", "Spygate", "privacy watch", "Social media", "surveillance", "tiktok app", "spy app", "Glitch", "Beijing Biden", "spyware", "Chinese Communist Party"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/technology/2022/dec/30/explainer-us-congress-tiktok-ban", "https://naturalnews.com/035110_Facebook_spying_smartphones.html", "https://naturalnews.com/2022-09-26-states-issue-warning-credit-card-companies-tracking-gun-ammo-sales.html", "https://naturalnews.com/2017-02-09-is-your-tv-spying-on-you.html", "https://www.thegatewaypundit.com/2023/03/democrats-are-afraid-to-ban-chinese-spy-app-tiktok-because-its-popular-with-their-young-voters/", "https://www.thegatewaypundit.com/2023/01/adam-schiff-complains-removed-intel-committee-tiktok-chinese-spyware-application/", "https://search.brave.com/", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://www.thegatewaypundit.com/2023/01/adam-schiff-complains-removed-intel-committee-tiktok-chinese-spyware-application/", "https://www.theguardian.com/technology/2022/dec/30/explainer-us-congress-tiktok-ban", "https://naturalnews.com/035110_Facebook_spying_smartphones.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-03-31-tiktok-ban-many-us-states-just-gaslighting&linkname=TikTok%20ban%20in%20many%20US%20states%20is%20just%20gas-lighting%20about%20spying%20app%20%E2%80%9Cconcerns%E2%80%9D%20while%20every%20other%20app%20and%20social%20media%20platform%20spies%20on%20us%2024%2F7%2F365", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}