{"result_id": "317005", "URL": "https://www.treason.news/2022-09-26-covid-policies-about-control-not-science-based.html", "timestamp": "2023-04-25 17:43:04 CEST+0200", "meta": {"description": "A cabinet minister for the Canadian province of Alberta has admitted that the Wuhan coronavirus (COVID-19) pandemic lockdowns and vaccine mandates were never based on science, but rather were focused on centralizing “political control and power.” “It was never about science but about political control and power,” tweeted Alberta’s Minister of Labor and Immigration Kelechi […]", "lang": "en", "keywords": "Alberta,badhealth,badmedicine,big government,Canada,conspiracy,covid-19,deception,freedom,government control,health freedom,honest,Jason Kenney,Kaycee Madu,lockdowns,medical fascism,medical martial law,Medical Tyranny,politics,traitors,vaccine mandate,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-09-26-covid-policies-about-control-not-science-based.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Alberta cabinet minister admits COVID-19 policies were about “political control and power” and not based on science", "cleaned_text": "Alberta cabinet minister admits COVID-19 policies were about “political control and power” and not based on science\n\nA cabinet minister for the Canadian province of Alberta has admitted that the Wuhan coronavirus (COVID-19) pandemic lockdowns and vaccine mandates were never based on science, but rather were focused on centralizing “political control and power.”\n\n“It was never about science but about political control and power,” tweeted Alberta’s Minister of Labor and Immigration Kelechi “Kaycee” Madu, a member of the ruling United Conservative Party (UCP).\n\nMadu was reacting to a tweet by CTV News announcing the end of the federal COVID-19 vaccine mandate for people entering Canada by the end of September. (Related: COVID-19 vaccines are killing shocking numbers of doctors in Canada.)\n\nHis comment predictably received massive backlash. The Alberta New Democratic Party (NDP), the province’s leading left-wing opposition group, called on Premier Jason Kenney to remove Madu from his cabinet.\n\n“Frankly, it’s a new low for this minister,” claimed provincial lawmaker Irfan Sabir, a member of the Alberta NDP. “These comments are way over the line. They’re disrespectful to many, many Albertans who fell sick, who lost loved ones, who lost jobs and businesses.”\n\nMadu thanked people who stood up to “tyrannical” COVID policies\n\nIn addition to criticizing COVID-19 lockdowns and vaccine mandates, Madu also thanked Freedom Convoy protesters and other demonstrators “who had the courage to mobilize against these tyrannical policies.”\n\n“They endured a lot of hate, name-calling, suffered and vilified on behalf of all of us,” wrote Madu. “I thank them!”\n\nThese comments in support of the health freedom protests similarly received strong criticisms. Duane Bratt, a political scientist from Mount Royal University, claimed that Madu’s comments are hypocritical because he served in the cabinet of Kenney, who imposed vaccine mandates and lengthy lockdowns on Albertans.\n\n“Did he support provincial COVID restrictions? Or were provincial COVID restrictions about science and not political control? After all, he was a member of that cabinet. He’s still a member of that cabinet,” said Bratt.\n\nBratt went further to suggest that Madu, who he called a “lightning rod” for controversy since his election in 2019, could lose his seat in the next election. He even suggested that Madu could cost the UCP other seats in Edmonton, the major urban center of Alberta and where 27 of the provincial Legislative assembly’s 87 seats are elected. The UCP currently holds seven of the 27 seats in Edmonton.\n\n“He is not going to win his seat in Edmonton. The UCP is not going to win a seat in Edmonton,” claimed Bratt.\n\nLori Williams, another Mount Royal political scientist, agrees with Bratt. “This is a very extreme position for Kaycee Madu to be taking and one that could jeopardize the future electoral fortunes of the UCP,” she claimed.\n\nKenney has so far declined to comment on Madu’s criticism of COVID-19 policies and gratitude to health freedom protesters, telling local media that he doesn’t monitor the lawmaker’s Twitter account.\n\n“If you want to hear Minister Madu’s views, or clarification from him, I suggest you talk to him,” he said.\n\nLearn more about how nations like Canada handled the COVID-19 pandemic at Pandemic.news.\n\nWatch this clip and learn how the leading cause of death in Alberta is listed as “unknown.”\n\nThis is from the Alex Hammer channel on Brighteon.com.\n\nIT’S THE VACCINE: “Unknown causes” are now the leading cause of death in Alberta, Canada.\n\nTop killer in Alberta: Deaths from “ill-defined and unknown causes” (aka covid vaccines) are skyrocketing.\n\nANOTHER Canadian doctor, 26, dies from covid injections – that makes SEVEN in just two weeks.\n\nCanadian legal group blasts Alberta magistrate who ruled that doctors can require COVID vaccination before organ transplants.\n\nCanadian doctors: Government data clearly show spike in COVID cases after vaccinations.", "opengraph": {"title": "Alberta cabinet minister admits COVID-19 policies were about “political control and power” and not based on science", "type": "article", "url": "https://www.treason.news/2022-09-26-covid-policies-about-control-not-science-based.html", "site_name": "Treason News", "description": "A cabinet minister for the Canadian province of Alberta has admitted that the Wuhan coronavirus (COVID-19) pandemic lockdowns and vaccine mandates were never based on science, but rather were focused on centralizing “political control and power.” “It was never about science but about political control and power,” tweeted Alberta’s Minister of Labor and Immigration Kelechi […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/09/covid-lockdown-chains.jpg"}, "tags": ["conspiracy", "big government", "deception", "honest", "covid-19", "vaccine mandate", "Alberta", "medical martial law", "health freedom", "Kaycee Madu", "Jason Kenney", "politics", "Canada", "Medical Tyranny", "medical fascism", "government control", "vaccines", "traitors", "freedom", "lockdowns"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/alberta-govt-minister-admits-covid-restrictions-were-all-about-political-control-and-power/", "https://naturalnews.com/2022-08-29-covid-vaccines-killing-doctors-in-canada.html", "https://edmonton.ctvnews.ca/alta-minister-thanks-convoys-says-covid-19-restrictions-were-about-political-control-and-power-1.6076854", "https://www.mtroyal.ca/", "https://pandemic.news/", "https://www.brighteon.com/cb0f4af6-ed4e-44db-ae23-05cc3cb1cddc", "https://www.brighteon.com/channels/alexhammer", "https://www.brighteon.com/channels/alexhammer", "https://vaccines.news/2022-09-02-unknown-causes-leading-cause-of-death-canada.html", "https://vaccinedeaths.com/2022-08-23-top-killer-alberta-deaths-unknown-covid-vaccines.html", "https://vaccines.news/2022-08-17-7th-canadian-doctor-dies-covid-vaccines-2weeks.html", "https://pandemic.news/2022-07-20-jccf-blasts-alberta-magistrate-covid-vaccine-transplants.html", "https://pandemic.news/2021-11-24-data-shows-spike-in-covid-cases-after-vaccinations.html", "https://www.lifesitenews.com/news/alberta-govt-minister-admits-covid-restrictions-were-all-about-political-control-and-power/", "https://edmonton.ctvnews.ca/alta-minister-thanks-convoys-says-covid-19-restrictions-were-about-political-control-and-power-1.6076854", "https://www.brighteon.com/cb0f4af6-ed4e-44db-ae23-05cc3cb1cddc", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-09-26-covid-policies-about-control-not-science-based&linkname=Alberta%20cabinet%20minister%20admits%20COVID-19%20policies%20were%20about%20%E2%80%9Cpolitical%20control%20and%20power%E2%80%9D%20and%20not%20based%20on%20science", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}