{"result_id": "317036", "URL": "https://www.treason.news/2023-03-03-covid-lab-leak-greatest-coverup-medical-history.html", "timestamp": "2023-04-25 17:43:30 CEST+0200", "meta": {"description": "In response to the latest revelation that the lab leak theory is the most plausible cause of the Wuhan coronavirus (COVID-19) pandemic, Sen. Rand Paul (R-KY) dubbed the theory’s suppression “one of the greatest cover-ups in modern medical history.” The senator remarked during an appearance on Fox News‘ “Hannity” that many of the documents outlining how […]", "lang": "en", "keywords": "badhealth,big government,China,conspiracy,coronavirus,coverup,covid-19,declassification,Department of Energy,gain-of-function,infections,lab-leak theory,outbreak,pandemic,Rand Paul,research,science deception,science fraud,Suppressed,White House,Wuhan lab", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2023-03-03-covid-lab-leak-greatest-coverup-medical-history.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Sen. Rand Paul: COVID lab leak among the greatest coverups in modern medical history", "cleaned_text": "Sen. Rand Paul: COVID lab leak among the greatest coverups in modern medical history\n\nIn response to the latest revelation that the lab leak theory is the most plausible cause of the Wuhan coronavirus (COVID-19) pandemic, Sen. Rand Paul (R-KY) dubbed the theory’s suppression “one of the greatest cover-ups in modern medical history.”\n\nThe senator remarked during an appearance on Fox News‘ “Hannity” that many of the documents outlining how scientists from the Department of Energy (DOE) came upon this conclusion are classified. He continued: “But the New York Times reported from the DOE that their scientists now believe that this came from a lab is actually classified and somebody leaked it illegally.” (Related: Energy Department now admits COVID-19 most likely originated in Wuhan lab.)\n\n“When [Dr.] Anthony Fauci made the decision to fund dangerous gain-of-function research in Wuhan under the auspices of an authoritarian government, [it] was one of the worst decisions ever made. And there’s been a cover-up ever since the very beginning. [This will] get out in history [as] probably one of the worst decisions that any government bureaucrat ever made.”\n\nThe senator for the Bluegrass State exhorted program host Sean Hannity to look at Fauci’s emails with Dr. Francis Collins, former director of the National Institutes of Health, over the matter.\n\n“[They were] conspiring, basically, to cover this up,” said Paul. “But now we have a mountain of evidence.”\n\nGiven everything that has happened, the senator told Hannity: “This is how idiotic these people are. How moronic; they have destroyed trust … because they’re really telling you stuff that’s obviously not true.”\n\nThe son of former Rep. Ron Paul (R-TX) also took a swipe at the Centers for Disease Control and Prevention (CDC) over its guidance regarding COVID-19 vaccines.\n\n“No parent with any lick of common sense would allow their kid to be vaccinated after they’ve already had COVID and myocarditis from the vaccine. But the CDC’s recommendation is that your kid should get a second vaccine as soon as their heart is better,” he said.\n\n“This is why nobody trusts the CDC because no mom with any bit of common sense would ever subject their kid to another vaccination after they added heart inflammation from the first one.”\n\nPaul demanded the Biden administration to declassify documents that allegedly outline how the DOE surmised the lab leak theory as the likely cause of the COVID-19 pandemic.\n\nThe senator made this call in a tweet, writing: “Classified documents leaked … showing scientists at DOE believe COVID leaked from Wuhan lab.” He also included a link to a story in the Wall Street Journal about the aforementioned documents.\n\nOther Senate Republicans joined Paul, including Missouri Sen. Josh Hawley. “The American people deserve the full truth about [COVID-19’s] origins. No more whitewash. I will again introduce legislation to make the U.S. government’s intelligence reports on COVID more open to the public,” Hawley tweeted.\n\nArkansas Sen. Tom Cotton also joined the fray, tweeting: “[Regarding] China’s lab leak, being proven right doesn’t matter. What matters is holding the Chinese Communist Party accountable so this doesn’t happen again.”\n\nBut the GOP lawmakers could face a daunting challenge from the executive branch.\n\nWhite House Press Secretary Karine Jean-Pierre refused to confirm if the Biden administration will release an unclassified version of the DOE’s assessment regarding the Chinese lab leak theory. John Kirby, spokesman for the National Security Council, also refused to directly address the concern.\n\nHead over to Pandemic.news for more about the COVID-19 lab leak theory.\n\nWatch Kentucky Sen. Rand Paul rebuke Dr. Anthony Fauci for “not following the science” below.\n\nThis video is from the Excellent PODCASTS & Real NEWS channel on Brighteon.com.\n\nRand Paul: ‘Fauci has the blood of 7 million people on his hands.’\n\nSenator Rand Paul goes head-to-head with Anthony Fauci over COVID-19 vaccines.\n\nSen. Rand Paul: Dr. Fauci should testify under oath about money given to Wuhan lab.\n\nDr. Rand Paul doubles down, takes on Dr. Fauci and the coronavirus gain-of-function coverup.\n\nRand Paul verbally backhands Anthony Fauci after Biden health czar claimed his critics are “anti-science.”", "opengraph": {"title": "Sen. Rand Paul: COVID lab leak among the greatest coverups in modern medical history", "type": "article", "url": "https://www.treason.news/2023-03-03-covid-lab-leak-greatest-coverup-medical-history.html", "site_name": "Treason News", "description": "In response to the latest revelation that the lab leak theory is the most plausible cause of the Wuhan coronavirus (COVID-19) pandemic, Sen. Rand Paul (R-KY) dubbed the theory’s suppression “one of the greatest cover-ups in modern medical history.” The senator remarked during an appearance on Fox News‘ “Hannity” that many of the documents outlining how […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/03/Editorial-Use-Rand-Paul-Podium.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "outbreak", "declassification", "coverup", "China", "covid-19", "White House", "science deception", "coronavirus", "Department of Energy", "Suppressed", "infections", "Wuhan lab", "gain-of-function", "science fraud", "Rand Paul", "research", "lab-leak theory"], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/rand-paul-covid-lab-leak-one-of-the-greatest-coverups-in-modern-medical-history/", "https://naturalnews.com/2023-02-28-energy-department-covid-originated-from-wuhan-lab.html", "http://research.news", "https://summit.news/2023/02/28/rand-paul-calls-for-declassification-of-covid-lab-leak-documents/", "https://pandemic.news/", "https://www.brighteon.com/5676f445-43ad-4174-b1d0-b49dce9f5206", "https://www.brighteon.com/channels/the1jeremy", "https://randpaul.news/2022-12-07-fauci-blood-of-millions-on-his-hands.html", "https://vaccines.news/2022-09-16-rand-paul-fauci-head-to-head-vaccines.html", "https://pandemic.news/2021-09-04-fauci-should-testify-about-funding-wuhan-lab.html", "https://pandemic.news/2021-05-18-dr-rand-paul-takes-on-dr-fauci-coronavirus-gain-of-function-coverup.html", "https://faucitruth.com/2021-11-30-rand-paul-verbally-backhands-anthony-fauci-critics-anti-science.html", "https://www.infowars.com/posts/rand-paul-covid-lab-leak-one-of-the-greatest-coverups-in-modern-medical-history/", "https://summit.news/2023/02/28/rand-paul-calls-for-declassification-of-covid-lab-leak-documents/", "https://www.brighteon.com/5676f445-43ad-4174-b1d0-b49dce9f5206", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-03-03-covid-lab-leak-greatest-coverup-medical-history&linkname=Sen.%20Rand%20Paul%3A%20COVID%20lab%20leak%20among%20the%20greatest%20coverups%20in%20modern%20medical%20history", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}