{"result_id": "317030", "URL": "https://www.treason.news/2022-07-18-top-7-ways-biden-regime-is-decimating-america.html", "timestamp": "2023-04-25 17:43:25 CEST+0200", "meta": {"description": "There is no longer “safety in numbers,” especially when it comes to about 200 million Americans taking the advice and guidance of the US government and regulatory agencies. Anyone who takes the advice of the FDA and CDC is venturing down a rabbit hole of dangerous, experimental medications and pesticide-laden, processed GMO food, all of […]", "lang": "en", "keywords": "badhealth,Biden regime,Censored Science,Censorship,civil unrest,Collapse,conspiracy,currency collapse,deception,deep state,depopulation,disinformation,dollar demise,food shortages,food supply,frankenfood,great reset,green tyranny,health freedom,Inflation,infrastructure,misinformation,scarcity,spike protein,supply chain,toxic vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-07-18-top-7-ways-biden-regime-is-decimating-america.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Top 7 ways Biden Regime is decimating America and the populace", "cleaned_text": "Top 7 ways Biden Regime is decimating America and the populace\n\nThere is no longer “safety in numbers,” especially when it comes to about 200 million Americans taking the advice and guidance of the US government and regulatory agencies. Anyone who takes the advice of the FDA and CDC is venturing down a rabbit hole of dangerous, experimental medications and pesticide-laden, processed GMO food, all of which fuels the chronic sick care industry of America. To rub salt in that ‘long term’ wound, the economy is quickly crashing and burning (by design), causing consumers and patients to spend even more of the quickly-dwindling money they have left. Misinformation is at an all-time high, and it’s mostly thanks to the FDA, the CDC and the highly corrupt Biden Regime. Let’s take a closer look.\n\nThe combination of major issues Americans face today is leading to mass casualties and apocalyptic situations. None of these problems are accidental or caused by natural forces, but rather are well-planned and executed by corrupt corporations, government agencies, and of course, Big Pharma.\n\nChronic inflammation, for example, has always been a problem for the majority of Americans who eat processed food daily, drink tap water, take prescription drugs, and get every vaccine the CDC recommends. Now, the Fauci Flu clot shots are clogging the vascular system of hundreds of millions of ‘patients’ with spike proteins that exacerbate health problems to the fullest extent.\n\nNow the FDA and CDC are pushing these dangerous, experimental gene therapy injections for children, babies and pregnant women alike. This will surely skyrocket the ‘sudden death syndrome’ that’s sweeping the nation, and the ‘spontaneous abortions’ that are supposedly unexplainable by doctors.\n\nThe majority of Americans are still falling for the age old, lying mantra about vaccines that they are “safe and effective,” when they are actually very dangerous and ineffective.\n\nSupply chain issues are all by design, thanks to COVID-19 lockdowns, factory shut downs, fires, explosions and employee firings over non-compliance of illegal vaccine mandates. This is driving the cost of everything through the roof, and most families can barely afford their energy bills, mortgage, rent, food, medicine, fuel and other basic necessities and supplies.\n\nAmerica’s food and fuel production infrastructure being dismantled purposely by the evil Biden Regime\n\nLife and living is hard enough without the government purposely wrecking every working system around. Worried about the pandemic? Don’t get “vaccinated” with protein prions that clog your blood and cleansing organs. Tough to pay the bills because taxes are high and pay is low? Inflation is only worsening by the day, so there’s no relief there. Trying to eat healthy to boost your immune system? Good luck. The US government is trying to transition everyone to eating only lab-concocted food that causes cancer, so no help there. Trying to run a business so you can be your own boss and retire early? The Biden Regime is trying to bankrupt all private businesses using COVID-19 as an excuse, while choking out the supply chain and printing trillions of dollars to wreck the economy. No help there. In fact, it’s just the opposite – pure decimation of every working system.\n\nTop 7 ways Biden Regime is decimating America and all Americans\n\n#4. Blocking and suffocating the supply chain in order to usher in lab-made food\n\n#5. Printing and laundering trillions of dollars that drives inflation through the roof\n\n#6. Censoring all information that protects the health and safety of Americans\n\n#7. Fostering the biggest misinformation campaign ever about war and vaccines\n\nDo your own research and don’t use Google. Try the search engine Brave BETA and get more truth news and real information. Bookmark Censored.news to your favorite websites for truth news that’s being censored from the rest of media as you read this.", "opengraph": {"title": "Top 7 ways Biden Regime is decimating America and the populace", "type": "article", "url": "https://www.treason.news/2022-07-18-top-7-ways-biden-regime-is-decimating-america.html", "site_name": "Treason News", "description": "There is no longer “safety in numbers,” especially when it comes to about 200 million Americans taking the advice and guidance of the US government and regulatory agencies. Anyone who takes the advice of the FDA and CDC is venturing down a rabbit hole of dangerous, experimental medications and pesticide-laden, processed GMO food, all of […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/07/Flag-American-Broken-America-Art-Grunge-Usa.jpg"}, "tags": ["conspiracy", "great reset", "deep state", "dollar demise", "deception", "currency collapse", "scarcity", "Censored Science", "Inflation", "spike protein", "toxic vaccines", "misinformation", "civil unrest", "infrastructure", "supply chain", "frankenfood", "depopulation", "disinformation", "Collapse", "Censorship", "Biden regime", "food supply", "green tyranny", "health freedom", "food shortages"], "tweets": [], "movies": [], "links": ["naturalnews.com/2022-07-01-fake-lab-meat-nightmare-for-human-health.html", "https://naturalnews.com/2022-02-16-the-worst-covid-misinformation-spreaders-on-the-planet.html", "https://naturalnews.com/2022-04-22-pattern-of-fires-striking-food-facilities-across-the-usa-suggests-arson.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://search.brave.com/", "https://www.censored.news/", "https://www.naturalnews.com/2022-05-27-covid-pandemic-not-real-vaccine-pandemic-is.html", "https://www.censored.news/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-07-18-top-7-ways-biden-regime-is-decimating-america&linkname=Top%207%20ways%20Biden%20Regime%20is%20decimating%20America%20and%20the%20populace", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}