{"result_id": "317021", "URL": "https://www.treason.news/2022-08-10-research-group-says-covid-biological-warfare-ccp.html", "timestamp": "2023-04-25 17:43:18 CEST+0200", "meta": {"description": "The Center for Security Policy (CSP) has published a new report claiming that the Wuhan coronavirus (Covid-19) is a “murderous weapon” by the Chinese Communist Party (CCP) to take down its enemies. Entitled “The CCP is at War with America,” the report declares that there is no evidence the Fauci Flu is a natural virus […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,biological warfare,CCP,Censored Science,Center for Security Policy,China,Chinese Communist Party,COVID,deception,depopulation,global dominance,great reset,national security,pandemic,Plandemic,Wuhan coronavirus,WWIII", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-08-10-research-group-says-covid-biological-warfare-ccp.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Research group says covid is “biological warfare” by the CCP", "cleaned_text": "Research group says covid is “biological warfare” by the CCP\n\nThe Center for Security Policy (CSP) has published a new report claiming that the Wuhan coronavirus (Covid-19) is a “murderous weapon” by the Chinese Communist Party (CCP) to take down its enemies.\n\nEntitled “The CCP is at War with America,” the report declares that there is no evidence the Fauci Flu is a natural virus – or that it is even a virus at all since it has never been isolated.\n\nThe Chinese Virus was created either in a lab or by governments and the media, and it continues to be used as a weapon against the economy and our constitutional rights.\n\nFormer House Intelligence Committee Chairman Pete Hoekstra and former Deputy Under Secretary of Defense Lieutenant General William “Jerry” Boykin both contributed to the book, which the CSP describes as an “exercise in competitive analysis that strongly challenges the Director of National Intelligence’s September 2021 conclusion.”\n\nThat DNI report concluded that the world may never know where the Wuhan Flu actually came from, while CSP says it is clear that the Chinese communist regime is to blame.\n\n“The preponderance of evidence indicates that SARS-CoV-2 was lab-manufactured,” the report reads. “In any event, Beijing acted with murderous intent in spreading the disease beyond China’s borders.”\n\nWhen the Fauci Flu first appeared in Wuhan in the latter half of 2019, the CCP could have done more to keep it contained there – or at least contained within China. Instead, the communist regime intentionally let it loose to contaminate the world, the report claims.\n\nThe CCP had been running various “biological warfare” programs – and still is – that the report claims are linked to the release of the Chinese Flu. This suggests that the plan all along was to disrupt the global economy with a bioweapon such as covid.\n\nOnce the communist regime knew about the release of covid, it could have restricted travel to keep it from spreading, the report further adds. Rather than do this, the CCP kept the borders open while siphoning up the global supply of personal protective equipment (PPE).\n\n“Xi’s regime clearly saw the imperative need to ensure that it would not suffer economic privation alone, to the advantage of its enemies, especially the United States,” the report reads.\n\n“Actively spreading the virus was, thus, a means of waging economic warfare, and the Chinese Communists applied themselves to doing so with a vengeance.”\n\nRecognizing that lockdowns and other restrictive measures posed a threat to its own economy, communist China actively pushed these restrictions on other countries, the report goes on to suggest.\n\nRather than weather the storm by itself, the CCP made sure to rope in the rest of the world, much of which complied by enforcing business closures, social distancing measures, mask mandates and other lockdown-related tyranny.\n\n“A principal beneficiary of such economic trauma would be the Chinese Communist Party,” the report explains.\n\nSince at least the early 1990s, China has supposedly been feverishly building bioweapons in the hopes that it can one day depopulate and take over the United States. Perhaps this was the intent with covid?\n\nUp until recently, these plans were mostly a secret. Now, however, we are learning that the CCP has wanted to expand its borders using biological weapons.\n\n“Right now, it is not the time to openly break with [America],” said Chinese general Chi Haotian about his country’s eventual plans for America. “Our reform and opening to the outside world still rely on their capital and technology.”\n\nIf all goes as planned, biological weapons will become the vehicle through which the CCP achieves global domination, the report claims. A careful evaluation of the propaganda that China has released publicly over the years strongly suggests that bioweapons are a major component in Chinese global dominance.\n\n“If Chinese scientists succeed in designing pathogens targeting only foreigners, the next germ, virus, or microbe from China could end non-Chinese societies,” the report further reads.\n\n“Xi will be the first supremo to possess a weapon making worldwide Chinese rule possible.”\n\nEvery person outside of China who died from “covid” should be considered a “murder victim,” the report adds. And the CCP must be held accountable, it says, otherwise the regime will only continue to unleash bioweapons until its goals are accomplished.\n\n“We must never again allow our constitutional freedoms to be denied on the pretext of a public health emergency, especially at the insistence of foreign powers, let alone our mortal enemy,” the report concludes.\n\nA commenter at The Epoch Times chimed in that had China stopped international travel at the beginning of the plandemic, there never would have been the global consequences we all witnessed and suffered through.\n\nThe latest news coverage about the Chinese Virus can be found at Pandemic.news.", "opengraph": {"title": "Research group says covid is “biological warfare” by the CCP", "type": "article", "url": "https://www.treason.news/2022-08-10-research-group-says-covid-biological-warfare-ccp.html", "site_name": "Treason News", "description": "The Center for Security Policy (CSP) has published a new report claiming that the Wuhan coronavirus (Covid-19) is a “murderous weapon” by the Chinese Communist Party (CCP) to take down its enemies. Entitled “The CCP is at War with America,” the report declares that there is no evidence the Fauci Flu is a natural virus […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/08/wuhan-virology-hazmat-suits.png"}, "tags": ["biological warfare", "CCP", "pandemic", "great reset", "Plandemic", "Center for Security Policy", "national security", "COVID", "global dominance", "deception", "WWIII", "China", "depopulation", "Wuhan coronavirus", "Censored Science", "Chinese Communist Party"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/covid-19-was-ccp-biological-warfare-new-research-group-says_4647000.html", "https://naturalnews.com/2021-10-20-covid-virus-never-isolated-shown-to-cause-disease.html", "http://pandemic.news", "https://www.theepochtimes.com/covid-19-was-ccp-biological-warfare-new-research-group-says_4647000.html", "https://naturalnews.com/2021-10-20-covid-virus-never-isolated-shown-to-cause-disease.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-08-10-research-group-says-covid-biological-warfare-ccp&linkname=Research%20group%20says%20covid%20is%20%E2%80%9Cbiological%20warfare%E2%80%9D%20by%20the%20CCP", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}