{"result_id": "317017", "URL": "https://www.treason.news/2022-09-16-israeli-health-minister-plotted-manipulation-covid-vaccines.html", "timestamp": "2023-04-25 17:43:15 CEST+0200", "meta": {"description": "An Israeli journalist and health researcher has blown the lid on the Holy Land’s cover-up with regards to covid “vaccinations.” Israel’s Ministry of Health (IMoH), we now know, lied about the shots by covering up a slew of data showing their dangers and ineffectiveness. Instead of immediately halting Operation Warp Speed, Israel covered up the […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,chemical violence,conspiracy,corruption,COVID,deception,fraud,genocide,immunizations,Israel,manipulation,medical censorship,Medical Tyranny,medical violence,Pfizer,Plandemic,science deception,vaccine death,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-09-16-israeli-health-minister-plotted-manipulation-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "LEAKED FOOTAGE: Israeli health minister plotted to manipulate covid vaccine expert report to avert litigation", "cleaned_text": "An Israeli journalist and health researcher has blown the lid on the Holy Land’s cover-up with regards to covid “vaccinations.”\n\nIsrael’s Ministry of Health (IMoH), we now know, lied about the shots by covering up a slew of data showing their dangers and ineffectiveness.\n\nInstead of immediately halting Operation Warp Speed, Israel covered up the data and proceeded to join the rest of the globalists in pushing the jabs on the people of the world.\n\nDr. Yaffa Shir-Raz is the one credited with exposing the coverup. She leaked a video to Twitter last month depicting pediatric specialist Prof. Mati Berkowitz, head of the Clinical Pharmacology and Toxicology unit at Shamir Medical Center and head of the research team appointed by the Israeli Ministry of Health (IMoH) to investigate the safety of Fauci Flu shots, manipulating and lying about an expert report on adverse events.\n\nBerkowitz’s study directly contradicts the IMoH’s claims that major side effects from covid injections are rare, brief, and / or transient. This is why he cautioned IMoH senior officials against sharing the findings publicly for fear that they might get sued.\n\n“Here we will have to really think medical-legal,” Berkowitz said. “Why medical-legal? Because for quite a few adverse events we said, ‘okay, it exists, and there is a report, but still get vaccinated.'”\n\n“I mean, we have to think about how to write it and how to present it correctly so this will not yield lawsuits later: ‘Wait, wait, wait, you said everything will pass and you can get vaccinated. And now look what happened to me. The phenomenon continues.'”\n\nThe Israeli government is responsible for the injury and death of untold MILLIONS of people\n\nAccording to Yaffa, the Zoom meeting depicted, which took place in early June, is when the research team submitted its reports to IMoH senior staff. The report looked specifically at the mRNA (messenger RNA) shot from Pfizer, the brand widely distributed across Israel.\n\nThat report included an analysis of other reports received between December 2021 and May 2022 in a new reporting system, similar to the Vaccine Adverse Event Reporting System (VAERS) here in the United States, that was launched in December 2021.\n\n“The findings revealed a range of long-term SEs (serious events), including ones not listed by Pfizer, and a high rate of rechallenge (recurrence of an SE after repeated doses), which as the team repeatedly stresses, establish causal relations with the vaccine,” Yaffa wrote.\n\nThe main findings of the report that was presented to the IMoH include:\n• The identification and characterization of side effects not listed by Pfizer, including neurological damage (hypoesthesia, paresthesia, tinnitus, and dizziness), back pain, and digestive symptoms in children (i.e., abdominal pain)\n• Most covid jab side effects are long term, lasting weeks, months, a year, or even more, with many patients still suffering to this very day. Such injuries include menstrual irregularities and neurological damage, musculoskeletal injuries, gastrointestinal problems, and kidney and urinary system damage\n• The more jabs a person gets, the worse these side effects become\n• Menstrual disorders are particularly prominent post-injection, with more than 90 percent of reports suggesting that these effects are long term. After three months post-injection, more than 60 percent of patients are still suffering\n\n“Nevertheless, the IMOH withheld the findings for 2 months, even from their own expert committee which decided 3 weeks later to clear the vaccine for infants,” Yaffa writes about how this information was systematically ignored and buried by Israeli officials.\n\n“Only on August 9, two months later, the IMoH decided to publish a formal report.”\n\nThe latest news about Israel’s covid jab coverup can be found at Corruption.news.", "opengraph": {"title": "LEAKED FOOTAGE: Israeli health minister plotted to manipulate covid vaccine expert report to avert litigation", "type": "article", "url": "https://www.treason.news/2022-09-16-israeli-health-minister-plotted-manipulation-covid-vaccines.html", "site_name": "Treason News", "description": "An Israeli journalist and health researcher has blown the lid on the Holy Land’s cover-up with regards to covid “vaccinations.” Israel’s Ministry of Health (IMoH), we now know, lied about the shots by covering up a slew of data showing their dangers and ineffectiveness. Instead of immediately halting Operation Warp Speed, Israel covered up the […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/09/Israel.jpg"}, "tags": ["conspiracy", "manipulation", "big government", "fraud", "COVID", "deception", "medical violence", "Pfizer", "corruption", "science deception", "chemical violence", "immunizations", "medical censorship", "vaccine wars", "Israel", "Medical Tyranny", "vaccine injury", "genocide", "vaccines", "vaccine death", "Plandemic"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/09/report-leaked-video-shows-israeli-ministry-healths-planned-manipulate-expert-report-adverse-events-avoid-lawsuits-experts-found-serious-safety-issues-lied-public/", "https://naturalnews.com/2022-09-07-israel-lied-people-died-covid-vaccine-deception.html", "http://corruption.news", "https://www.thegatewaypundit.com/2022/09/report-leaked-video-shows-israeli-ministry-healths-planned-manipulate-expert-report-adverse-events-avoid-lawsuits-experts-found-serious-safety-issues-lied-public/", "https://naturalnews.com/2022-09-07-israel-lied-people-died-covid-vaccine-deception.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-09-16-israeli-health-minister-plotted-manipulation-covid-vaccines&linkname=LEAKED%20FOOTAGE%3A%20Israeli%20health%20minister%20plotted%20to%20manipulate%20covid%20vaccine%20expert%20report%20to%20avert%20litigation", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}