{"result_id": "317039", "URL": "https://treason.news/2022-02-24-pfizer-partnered-ccp-pharmaceutical-company-military-combat.html", "timestamp": "2023-04-25 17:43:33 CEST+0200", "meta": {"description": "Back in 2011, pharmaceutical giant Pfizer signed a memorandum of understanding with a China-based drug manufacturer called Shanghai Pharmaceutical Co. Ltd. that we now know supported the “military combat” efforts of the communist regime’s People’s Liberation Army (PLA). Pfizer reportedly approached the Chinese military-linked pharmaceutical firm to expand its own market access into China, and […]", "lang": "en", "keywords": "Big Pharma,bioweapons,Bourla,CCP,China,collaboration,communism,corruption,deception,evil,military combat,People's Liberation Army,Pfizer,Shanghai Pharmaceutical Co,spike protein,treason,Twisted,vaccine wars,vaccines,virology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2022-02-24-pfizer-partnered-ccp-pharmaceutical-company-military-combat.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "To expand profits, Pfizer reportedly partnered with CCP-linked pharmaceutical company that engaged in “military combat” with China’s People’s Liberation Army", "cleaned_text": "To expand profits, Pfizer reportedly partnered with CCP-linked pharmaceutical company that engaged in “military combat” with China’s People’s Liberation Army\n\nBack in 2011, pharmaceutical giant Pfizer signed a memorandum of understanding with a China-based drug manufacturer called Shanghai Pharmaceutical Co. Ltd. that we now know supported the “military combat” efforts of the communist regime’s People’s Liberation Army (PLA).\n\nPfizer reportedly approached the Chinese military-linked pharmaceutical firm to expand its own market access into China, and Shanghai Pharmaceutical saw this as an opportunity “for the companies to jointly pursue potential business opportunities in China,” according to the memo.\n\n“The potential partnership is intended to leverage both companies’ strengths,” Pfizer proudly announced at the time, adding that the deal would result in “matching Pfizer’s global capabilities in developing innovative medicines with Shanghai Pharmaceutical’s capabilities and reach in the China market.”\n\n“The companies plan to explore future cooperation opportunities, including further distribution and commercialization, research and development activities, manufacturing and equity investment opportunities,” it was further revealed as part of an information leak.\n\nAnother Shanghai Pharmaceutical partner linked to Wuhan Institute of Virology\n\nMore than a decade has gone by since, and Pfizer’s little partnership with this Chinese Communist Party (CCP)-linked operation is finally coming out in the open, as are the terms that Shanghai Pharmaceutical is bound to suggest treason on the part of Pfizer.\n\nAccording to reports, Shanghai Pharmaceutical is subject to Article 7 of China’s National Intelligence Law, which requires that “any [Chinese] organization or citizen shall support, assist, and cooperate with state intelligence work.”\n\nAn unearthed “Corporate Social Responsibility Report” from 2020 also reveals that Shanghai Pharmaceutical’s longstanding collaborations with the PLA involved “organizing and implementing drug storage on behalf of the military combat,” a project that was worth roughly $2.4 million.\n\n“In addition, since 2007, [Shanghai Pharmaceutical] has begun to organize and implement drug storage on behalf of the military combat,” the documents further explain.\n\n“The amount was more than RMB15 million, and Shanghai Pharma was the storage enterprise while other subsidiaries acted as emergency units. It is now the East China region (Shanghai) drug security mobilization center.”\n\nIf that is not all bad enough, it also came out that Shanghai Pharmaceutical was partnered with China’s Secondary Military Medical University (SMMU), also known as the People’s Liberation Army Naval Medical University.\n\nThis partnership forged a plan for Shanghai Pharmaceutical to provide “a certain amount of R&D (research and development) funding input annually for the establishment of advance of ‘SMMU – Shanghai Pharmaceutical Translational Medicine Alliance’ to carry out R&D cooperation in fields of new medicine and medical devices development and so forth,” a press release explained.\n\nIn other words, Shanghai Pharmaceutical has been working for the Chinese military to develop new drugs and medical devices. Keep in mind that the Chinese military and its government are enemies of the United States, geopolitically speaking.\n\nBut wait, there is more: SMMU also reportedly has ties to the Wuhan Institute of Virology (WIV), which is the place where the Wuhan coronavirus (Covid-19) is believed to have originated.\n\nThe Deputy Director of WIV’s Academic Committee, Hongyang Wang, had a listed affiliation with SMMU on the school’s website before it was mysteriously scrubbed in mid-2020.\n\nThe Chinese military has been pushing for a “vaccine passport” system since at least 2018, which was well before the plandemic began, just to be clear. And Pfizer, which we now know has been working with the Chinese military, also just so happens to be pushing for jab passports.\n\nMeanwhile, Pfizer’s U.S. lobbying efforts for this and other devious schemes reached an all-time high in 2021 at the height of the plandemic. It must all just be a coincidence, right?\n\nMore related news coverage about Pfizer can be found at Corruption.news.", "opengraph": {"title": "To expand profits, Pfizer reportedly partnered with CCP-linked pharmaceutical company that engaged in “military combat” with China’s People’s Liberation Army", "type": "article", "url": "https://www.treason.news/2022-02-24-pfizer-partnered-ccp-pharmaceutical-company-military-combat.html", "site_name": "Treason News", "description": "Back in 2011, pharmaceutical giant Pfizer signed a memorandum of understanding with a China-based drug manufacturer called Shanghai Pharmaceutical Co. Ltd. that we now know supported the “military combat” efforts of the communist regime’s People’s Liberation Army (PLA). Pfizer reportedly approached the Chinese military-linked pharmaceutical firm to expand its own market access into China, and […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/02/Coronavirus-Covid-19-Pfizer-Vaccine-Syringe-Vial.jpg"}, "tags": ["Big Pharma", "deception", "China", "Pfizer", "corruption", "People's Liberation Army", "bioweapons", "communism", "virology", "spike protein", "Shanghai Pharmaceutical Co", "collaboration", "vaccine wars", "military combat", "treason", "Bourla", "CCP", "evil", "Twisted", "vaccines"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/2022/02/21/pfizer-partnered-with-arm-of-chinas-military/", "https://www.omicsonline.org/universities/Second_Military_Medical_University/", "http://english.whiov.cas.cn/", "http://corruption.news", "https://thenationalpulse.com/2022/02/21/pfizer-partnered-with-arm-of-chinas-military/", "https://naturalnews.com/2022-02-23-pfizer-manipulated-immunity-covid-vaccine-negligence-fraud.html", "https://www.omicsonline.org/universities/Second_Military_Medical_University/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-02-24-pfizer-partnered-ccp-pharmaceutical-company-military-combat&linkname=To%20expand%20profits%2C%20Pfizer%20reportedly%20partnered%20with%20CCP-linked%20pharmaceutical%20company%20that%20engaged%20in%20%E2%80%9Cmilitary%20combat%E2%80%9D%20with%20China%E2%80%99s%20People%E2%80%99s%20Liberation%20Army", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}