{"result_id": "317023", "URL": "https://treason.news/2021-08-11-bidens-pentagon-massive-risk-ordering-all-military-personnel-experimental-covid19-vaccine.html", "timestamp": "2023-04-25 17:43:20 CEST+0200", "meta": {"description": "Democrats have long known that the very last bastion of pro-American culture is the U.S. military, and since the Biden regime has taken over, the effort has been to fundamentally transform our patriotic fighting force into a ‘woke’ force of pansies who couldn’t fight their way out of a paper sack but whose rank-and-file members can […]", "lang": "en", "keywords": "badhealth,badmedicine,coronavirus,covid vaccines,covid-19,Lloyd Austin,military,national security,Pentagon,soldiers,treason,vaccine injury,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2021-08-11-bidens-pentagon-massive-risk-ordering-all-military-personnel-experimental-covid19-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "Biden’s Pentagon taking massive risk by ordering ALL military personnel to get experimental COVID-19 vaccine", "cleaned_text": "Biden’s Pentagon taking massive risk by ordering ALL military personnel to get experimental COVID-19 vaccine\n\nDemocrats have long known that the very last bastion of pro-American culture is the U.S. military, and since the Biden regime has taken over, the effort has been to fundamentally transform our patriotic fighting force into a ‘woke’ force of pansies who couldn’t fight their way out of a paper sack but whose rank-and-file members can recite critical race theory dictates verbatim.\n\nNow, in an effort to debilitate a large segment of the force even as Russia and China are rising and joining forces, the Pentagon is instead putting our entire fighting force at risk by ordering every member to get a COVID-19 vaccine, no questions asked.\n\n“I will seek the president’s approval to make the vaccines mandatory no later than mid-September, or immediately upon” licensure by the Food and Drug Administration, “whichever comes first,” Defense Secretary Lloyd Austin said in a memo to all military personnel, in warning all of them them to prepare for the requirement.\n\n“I will not hesitate to act sooner or recommend a different course to the President if l feel the need to do so,” he added.\n\nOf course, Biden will give the go-ahead for the mass vaccination of our entire military force, because he recently ordered all federal employees and federal contractors to get the jab as well — no questions asked.\n\nAustin’s memo, by the way, also serves as a WARNO — warning order — to military commands so they can begin marshaling the materials and infrastructure to get vaccination up and running when the defense secretary gives the order.\n\nNow, all said, there is pushback to the effort, as noted by the Springfield News-Sun newspaper in Illinois:\n\nThe calls are coming at a time when Defense Secretary Lloyd Austin is expected to ask President Biden to waive a federal law that allows service members to have the option to refuse in the case of vaccines that have not been fully licensed by the Food and Drug Administration (FDA). “We have been getting calls from Airmen at Wright-Patterson,” attorney Greg Rinckey, of the New York law firm Tully Rinckey, told a separate newspaper last week. He said that some military members “are scared and skeptical, basically, to take the vaccine when it’s an experimental vaccine.” “That’s really what we’re seeing,” he added, noting that his office has been fielding “multiple calls” from members who are considering class-action lawsuits and other legal pushback since the vaccines are experimental and have an outsized injury record. “Up until the point the vaccine is … FDA-approved, military members can’t be mandated to take the vaccine, unless the president of the United States would waive that requirement,” Rinckey said. “It’s very similar to what we kind of saw with the anthrax vaccine back in the ‘90s.” The Pentagon, however, is preparing for the pushback, apparently. “Military officials have said that once the vaccine is mandated, a refusal could constitute failure to obey an order, and may be punishable under the Uniform Code of Military Justice,” the AP reported. Rinckey appeared to agree that the military would have the authority to order troops to get vaccinated, predicting “an interesting case.” “I tend to think, if it comes down to a court, I think a court would probably say that it could be mandated by the military, because the military is in close proximity,” he said. “You’re on a ship; you’re in a barracks.” Get ready to pick up arms, Americans, because we’ll be needed to fight Russia and Chinese invaders once our own military has been debilitated.", "opengraph": {"title": "Biden’s Pentagon taking massive risk by ordering ALL military personnel to get experimental COVID-19 vaccine", "type": "article", "url": "https://www.treason.news/2021-08-11-bidens-pentagon-massive-risk-ordering-all-military-personnel-experimental-covid19-vaccine.html", "site_name": "Treason News", "description": "Democrats have long known that the very last bastion of pro-American culture is the U.S. military, and since the Biden regime has taken over, the effort has been to fundamentally transform our patriotic fighting force into a ‘woke’ force of pansies who couldn’t fight their way out of a paper sack but whose rank-and-file members can […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2021/08/Soldier-Military-Army-War-Helicopter-Battlefield-Force.jpg"}, "tags": ["covid vaccines", "covid-19", "soldiers", "vaccine wars", "national security", "treason", "Lloyd Austin", "vaccine injury", "vaccine mandate", "coronavirus", "Pentagon", "military"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/asia/2021/08/10/china-russia-military-muscle-afghanistan/", "https://apnews.com/article/coronavirus-vaccine-us-military-requirement-pentagon-3975940c732352f72e41f6e34a3a2669", "https://www.springfieldnewssun.com/local/military-law-attorney-takes-calls-from-wpafb-airmen-on-vaccine/ICYOIIXPXBEH5NMG3BFYC3WO4Y/", "http://www.nationalsecurity.news", "https://www.naturalnews.com/2021-06-30-vaccine-adverse-events-covid19-jabs-cdc.html", "https://twitter.com/B52Malmet/status/1424779515612438531", "https://www.breitbart.com/asia/2021/08/10/china-russia-military-muscle-afghanistan/", "https://www.springfieldnewssun.com/local/military-law-attorney-takes-calls-from-wpafb-airmen-on-vaccine/ICYOIIXPXBEH5NMG3BFYC3WO4Y/", "https://www.naturalnews.com/2021-06-30-vaccine-adverse-events-covid19-jabs-cdc.html"], "authors": [], "publish_date": null}