{"result_id": "317013", "URL": "https://treason.news/2022-07-18-how-pfizer-profited-from-the-pandemic.html", "timestamp": "2023-04-25 17:43:12 CEST+0200", "meta": {"description": "STORY AT-A-GLANCE The COVID-19 pandemic has been a real boon to Pfizer. Not only has it doubled Pfizer’s annual revenue, it has also given the drugmaker unique weight in determining U.S. health policy — something that concerns even staunch vaccine-pushers like Dr. Paul Offit Pfizer’s revenue in 2021 was $81.3 billion — approximately double that […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,CDC,conspiracy,corruption,covid-19,Dangerous Medicine,deception,FDA,insanity,pandemic,Pfizer,pharmaceutical fraud,traitors,treason,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2022-07-18-how-pfizer-profited-from-the-pandemic.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "How Pfizer profited from the pandemic", "cleaned_text": "How Pfizer profited from the pandemic\n• The COVID-19 pandemic has been a real boon to Pfizer. Not only has it doubled Pfizer’s annual revenue, it has also given the drugmaker unique weight in determining U.S. health policy — something that concerns even staunch vaccine-pushers like Dr. Paul Offit\n• Pfizer’s revenue in 2021 was $81.3 billion — approximately double that of 2020 — and the COVID shot accounted for $36.78 billion of that\n• Pfizer’s COVID jab dominates 70% of the U.S. and European markets, and Paxlovid, its COVID drug, has become a standard treatment choice in hospitals. This despite findings showing the shot doesn’t prevent infection or transmission, and that Paxlovid causes severe rebound and supercharges mutations\n• The U.S. had thrown away 82.2 million expired COVID jab doses as of mid-May 2022, yet the Biden administration ordered another 105 million doses at the end of June 2022 for a fall booster campaign that will cost taxpayers $3.2 billion\n• Pfizer’s contracts are almost exclusively slanted in Pfizer’s favor. They’re guaranteed payment while having no financial liability for injuries and deaths, and it appears this indemnification applies even if they were to be found guilty of fraud\n\nAccording to Kaiser Health News (KHN),1 the COVID-19 pandemic has been a real boon to Pfizer. Not only has it yielded “outsize benefits” in terms of profits, but it has also “given the drugmaker unusual weight in determining U.S. health policy.”\n\nWhen President Biden in September 2021 offered boosters to Americans — not long after [Pfizer CEO Albert] Bourla had recommended them — Dr. Paul Offit, director of the Vaccine Education Center at Children’s Hospital of Philadelphia … wondered, ‘Where’s the evidence you are at risk of serious disease when confronted with COVID if you are vaccinated and under 50?’ Policies on booster recommendations for different groups are complex and shifting, Offit said, but the CDC, rather than Bourla and Pfizer, should be making them. ‘We’re being pushed along,’ he said. ‘The pharmaceutical companies are acting like public health agencies.’”\n\nThe fact that a vaccine-pusher like Offit — infamous for claiming a baby can safely tolerate 10,000 vaccines at once3 — is questioning and pushing back against Pfizer’s influence over health policy reveals just how brazen, unethical and potentially dangerous that is.\n\nAccording to Allen, Pfizer’s revenue in 2021 was $81.3 billion4 — approximately double that of 2020 — and the COVID shot accounted for $36.78 billion5 of that. For comparison, Lipitor, Pfizer’s previous top selling statin, generates roughly $2 billion a year,6 while their strep vaccine, Prevnar 13 rakes in $6 billion a year.7\n\nIts mRNA gene transfer injection against COVID now dominates 70% of the U.S. and European markets, and Paxlovid, Pfizer’s COVID drug, has become a standard treatment choice in hospitals. This, despite researchers finding Paxlovid (molnupiravir) causes severe rebound and supercharges mutations.\n\nIn a rational scenario, that finding would have put a stop to its use, but no. In an official health advisory8 to the public, issued May 24, 2022, the U.S. Centers for Disease Control and Prevention first warns that Paxlovid is associated with “recurrence of COVID-19 or ‘COVID-19 rebound,’” and then in the very next sentence stresses in bold print a narrative supporting its use and enriching Pfizer with instructions saying:\n\nAllen also notes that, during an investor call, a Pfizer official highlighted reports of Paxlovid’s failure, but spun it into “good news” for investors, as patients may require multiple courses!9 Obviously the objective has long ago shifted from helping humans to raping them for as much profit as possible.\n\nSimilarly, while Pfizer’s COVID jab clearly doesn’t prevent infection or spread, and Americans are rejecting the shots in growing numbers — 82.2 million doses had expired and were chucked in the trash as of mid-May 202210 — the U.S. government still went ahead and ordered another 105 million doses at the end of June 2022.\n\nThese are intended for a fall booster campaign, at a cost to taxpayers of $3.2 billion.11 The U.S. is actually paying about 50% more for each of these new jab boosters this time around — $30.47 per dose compared to $19.50 per dose paid for the first 100 million doses.\n\nThe U.S. government has also promised to purchase another 20 million courses of Paxlovid, at an eye-watering cost of $530 per five-day course. Basically, Pfizer is being financially rewarded for producing products that are useless at best and dangerous at worst, and we’re all paying for it. In case you’re curious, that is another $10.6 billion transferred from U.S. taxpayers to Pfizer.\n\nAfter you likely thought it couldn’t ever get any worse, KHN also touches on, but doesn’t delve into, the fact that Pfizer suggested they skip human trials as they move forward with jabs that are reformulated for newer variants. If this strikes you as crazy, you’d be right. It’s sheer madness, but the U.S. Food and Drug Administration — a clearly captured agency — has already surreptitiously agreed to this egregious miscarriage of science.\n\nHow this wicked scheme, known as the “Future Framework,”12 was adopted by the FDA without formal vote is explained by Toby Rogers, Ph.D. — a political economist whose research focus is on regulatory capture and Big Pharma corruption13 — in the video above. He also explained it in a June 29, 2022, Substack article:14\n\nIn 2021, secret details of Pfizer’s contracts came to light, showing they are essentially holding countries hostage to nonnegotiable demands for payment in full AND freedom from liability.15\n\nIn late February 2021, The Bureau of Investigative Journalism reported16 that Pfizer was demanding countries put up sovereign assets as collateral for expected vaccine injury lawsuits resulting from its COVID-19 jab.\n\nSeveral countries, including Brazil, Chile, Colombia, the Dominican Republic and Peru, agreed to this demand, putting up bank reserves, military bases and embassy buildings as collateral. In short, theses governments are guaranteeing Pfizer will be compensated for any expenses resulting from injury lawsuits against it, so the company won’t lose a dime if its COVID shot injures people.\n\nShockingly, these terms are binding even if those injuries are the result of negligent company practices, fraud or malice!\n\nIn October that same year, Public Citizen published the secret contracts17,18 between Pfizer and Albania, Brazil, Colombia, Chile, Dominican Republic, the European Commission, Peru, the U.S. and the U.K., further revealing the extent to which these countries handed power over to Pfizer. In almost all scenarios, Pfizer’s interests come first.\n\nFor example, government purchasers must acknowledge that the effectiveness and safety of the shots are completely unknown, all while indemnifying Pfizer against any and all financial liability. This is the ultimate corporate maleficence, using their leverage to force the kill shot down these countries’ throats and avoiding any personal responsibility for damages.\n\nEven if Pfizer eventually is convicted of fraud in the U.S. and loses all its liability protection from the COVID jabs because of it, that judgment would not impact these foreign contracts. These countries sold their souls to Pfizer and have absolutely no recourse but to pay even if the shots kill everyone.\n\nThe contracts for at least four countries also secure Pfizer’s intellectual property rights even if the company is found to have stolen intellectual property rights of others. In such case, the government purchaser becomes the liable party. As explained by Public Citizen:19\n\nEqually shocking is that countries are forced to follow through on their vaccine orders even if other drugs or treatments emerge that can prevent, treat or cure COVID-19.20 Is it any wonder, then, that governments around the world have suppressed the use of safe and effective outpatient drugs like hydroxychloroquine and ivermectin?\n\nIf these drugs were allowed to be used and could be proven to work, the COVID injections would be completely unnecessary and their emergency use authorization would disappear, yet governments are on the hook for hundreds of millions of doses.\n\nThe fact that Pfizer has behaved like a criminal who works out a cover story for a planned murder before committing it is not surprising, considering its history. Pfizer, has been sued in multiple venues over unethical behavior, including unethical drug testing and illegal marketing practices.21\n\nIn his 2010 paper,22 “Tough on Crime? Pfizer and the CIHR,” Robert G. Evans, Ph.D., Emeritus Professor at Vancouver School of Economics, described Pfizer as “a ‘habitual offender,’ persistently engaging in illegal and corrupt marketing practices, bribing physicians and suppressing adverse trial results.”\n\nBetween 2002 and 2010 alone, Pfizer and its subsidiaries were fined $3 billion in criminal convictions, civil penalties and jury awards. They are recurrent criminal felons. None of these convictions has deterred their nefarious behavior.\n\nIn 2011, Pfizer agreed to pay another $14.5 million to settle federal charges of illegal marketing,23 and in 2014 they settled federal charges relating to improper marketing of the kidney transplant drug Rapamune to the tune of $35 million,24 as well as $75 million to settle charges relating to its testing of a new broad spectrum antibiotic on critically ill Nigerian children.\n\nAs reported by the Independent25 at the time, Pfizer sent a team of doctors into Nigeria in the midst of a meningitis epidemic. For two weeks, the team set up right next to a medical station run by Doctors Without Borders and began dispensing the experimental drug, Trovan. Of the 200 children picked, half got the experimental drug and the other half the already licensed antibiotic Rocephin.\n\nEleven of the children treated by the Pfizer team died, and many others suffered side effects such as brain damage and organ failure. Pfizer denied wrongdoing. According to the company, only five of the children given Trovan died, compared to six who received Rocephin, so their drug was not to blame.\n\nThe problem was they never told the parents that their children were being given an experimental drug. What’s more, while Pfizer produced a permission letter from a Nigerian ethics committee, the letter turned out to have been backdated. The ethics committee itself wasn’t set up until a year after the trial had already taken place. Pfizer’s rap sheet also includes bribery, environmental violations, labor and worker safety violations and more.26\n\nNow, despite Pfizer being one of the least ethical drug companies, we’re told to trust them with our very lives, and the lives of our precious children. They’re going to put out booster shots this fall that have undergone absolutely no testing whatsoever, and we’re to simply throw caution to the wind because Pfizer — which has no liability whatsoever — says so.\n\nIn 2014, Pfizer faced a surge of lawsuits that accused it of hiding known side effects of its anticholesterol drug Lipitor.27 They got off scot-free that time, as a federal judge dismissed thousands of cases alleging the drug caused Type 2 diabetes.28,29 But at least they had liability and could be sued.\n\nWhen it comes to the COVID jabs, injured patients and family members of those killed by it won’t even have the ability to sue for damages, as governments around the world have indemnified them completely, and it looks as though they might not even be liable even if they’re found guilty of fraud. But we will have to see what the courts rule on that one. Still, that any nation would agree to a contract like that is just mindboggling.\n\nMeanwhile, mounting evidence shows the COVID shots destroy immune function over time, and Pfizer’s own trial data reveal deaths and serious adverse events numbering in the tens of thousands.\n\nIt’s hard to tell who’s more deserving of punishment — Pfizer or the equally captured federal agencies, the FDA and the CDC, that go along with them and do nothing to protect the lives of the youngest members of our society. Clearly, it’s up to us to protect ourselves and our loved ones, because wolves in sheep’s clothing are ruling the roost — they’re making all the decisions, and captured agencies are simply doing their bidding.", "opengraph": {"title": "How Pfizer profited from the pandemic", "type": "article", "url": "https://www.treason.news/2022-07-18-how-pfizer-profited-from-the-pandemic.html", "site_name": "Treason News", "description": "STORY AT-A-GLANCE The COVID-19 pandemic has been a real boon to Pfizer. Not only has it doubled Pfizer’s annual revenue, it has also given the drugmaker unique weight in determining U.S. health policy — something that concerns even staunch vaccine-pushers like Dr. Paul Offit Pfizer’s revenue in 2021 was $81.3 billion — approximately double that […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/07/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "covid-19", "vaccine wars", "Big Pharma", "treason", "FDA", "insanity", "deception", "vaccines", "Pfizer", "pharmaceutical fraud", "traitors", "corruption", "CDC"], "tweets": [], "movies": [], "links": ["https://articles.mercola.com/sites/articles/archive/2022/07/18/pfizer-covid-profits.aspx", "https://takecontrol.substack.com/p/remdesivir-paxlovid-molnupiravir", "https://takecontrol.substack.com/p/coronavirus-vaccine-booster-shot-health-effects", "https://takecontrol.substack.com/p/pfizer-documents-reveal-vaccine-dangers", "https://articles.mercola.com/sites/articles/archive/2022/07/18/pfizer-covid-profits.aspx", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-07-18-how-pfizer-profited-from-the-pandemic&linkname=How%20Pfizer%20profited%20from%20the%20pandemic", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}