{"result_id": "317018", "URL": "https://www.treason.news/2022-09-19-sns-might-be-used-harmful-mass-experiments.html", "timestamp": "2023-04-25 17:43:16 CEST+0200", "meta": {"description": "In 1999, Congress allocated $50 million in taxpayer funds to create the Strategic National Stockpile (SNS). This little-known alphabet agency works alongside the federal government to prepare for bio-terror attacks, natural disasters, plagues and pandemics. Today, the agency has a budget of a half a billion dollars. While the Federal Emergency Management Agency (FEMA) stockpiles […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Bioterror,conspiracy,deep state,doctor patient relationship,forced drugs,forced protocols,forced vaccines,future pandemics,medical experiments,medical resources,national emergency,national security,pandemic creation,strategic national stockpile,Top Secret,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-09-19-sns-might-be-used-harmful-mass-experiments.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "What is the Strategic National Stockpile and how might it be used to carry out harmful mass experiments on the population?", "cleaned_text": "What is the Strategic National Stockpile and how might it be used to carry out harmful mass experiments on the population?\n\nIn 1999, Congress allocated $50 million in taxpayer funds to create the Strategic National Stockpile (SNS). This little-known alphabet agency works alongside the federal government to prepare for bio-terror attacks, natural disasters, plagues and pandemics. Today, the agency has a budget of a half a billion dollars.\n\nWhile the Federal Emergency Management Agency (FEMA) stockpiles food, water and generators, the SNS stockpiles medical supplies, drugs and vaccines in a secret warehouse just outside of Washington D.C. Today, the agency has an inventory that is valued at over $7 billion and has private locations across the country.\n\nGovernment rapidly stockpiling medical supplies for efficient delivery across the country\n\nThese supplies may be deployed during a terror attack, as seen in 2001 after the World Trade Center was struck. The supplies may be activated during a bio-terror threat, as seen during the anthrax, Ebola, H1N1 and Zika scares. The supplies may be deployed after a catastrophic hurricane, as witnessed during Hurricane Katrina in 2005, Hurricane Sandy in 2012, and Hurricanes Harvey and Irma in 2017.\n\nIn 2020, the SNS was called upon to deliver N95 respirators, surgical face masks, face shields, gloves and disposable gowns to states across the nation. As of late, the SNS has been aggressively stockpiling new medical supplies and medications, but what exactly are they stockpiling and what is the government preparing for now?\n\nEach state now has a plan to quickly and efficiently receive and distribute SNS medicines and medical supplies to local communities. The director of the SNS, Greg Burel, said the SNS warehouses are being built up around the country and their location is to remain classified.\n\n“If everybody knows exactly what we have, then you know exactly what you can do to us that we can’t fix,” Greg Burel, told the National Public Radio in a recent interview. “And we just don’t want that to happen.”\n\nNPR science writer Nell Greenfieldboyce was cleared to tour one of the secretive SNS sites. Greenfieldboyce reported that the stockpiles include small pox vaccines, antibiotics, antivirals, painkillers, IV fluids, wound care supplies, ventilators, drugs to treat radiation sickness, and even antidotes to counter chemical weapons.\n\nStrategic National Stockpile could be used to carry out global experiments during future plandemics\n\nThe Strategic National Stockpile is a bureaucracy with the power to determine universal protocols in a national emergency. This bureaucracy theoretically has the power to delegate and prescribe a one-size-fits-all medical plan during a crisis. After a hurricane, flood, or wildfire, these medical resources are often necessary and welcomed. However, during an outbreak or pandemic, these resources may not be suited for every community. The drugs and vaccines cause more harm than good, and do so on a mass scale. The agencies in charge of determining the stockpile’s contents include the Department of Defense, the CDC and the FDA. They coordinate through the Public Health Emergency Medical Countermeasures Enterprise.\n\nIn essence, the SNS could serve as a conduit to conduct mass medical experiments on the population. If communities rely on a national protocol and a pre-determined national stockpile, local doctors and hospitals are forced to respond to crises in exactly the same manner. An antiviral and nutraceutical protocol could cheaply mitigate severe disease and save lives, but if the treatment is not in the national stockpile, then the doctors who use this protocol will not have access to it during an emergency.\n\nInstead, they may have to rely on ventilators that could lead to ventilator-associated pneumonia. They may have to prescribe drugs that may have worse side effects. What role did the SNS play in providing the wrong kind of drugs and protocols during the covid-19 national emergency? How might this bureaucracy be used in the future to cause mass harm to the population?\n\nShould a multi-disciplinary panel of medical professionals from all across the country have a say in what should be included in the strategic national stockpile? There is already evidence that the World Health Organization is planning for future pandemics and governments are planning out the next five pandemics. How might the SNS be used to carry out global experiments that cannot be tailored to the individual? How might these one-size-fits-all approaches be used to circumvent the doctor-patient relationship and disregard the unique medical situation an individual may face during a future national emergency?", "opengraph": {"title": "What is the Strategic National Stockpile and how might it be used to carry out harmful mass experiments on the population?", "type": "article", "url": "https://www.treason.news/2022-09-19-sns-might-be-used-harmful-mass-experiments.html", "site_name": "Treason News", "description": "In 1999, Congress allocated $50 million in taxpayer funds to create the Strategic National Stockpile (SNS). This little-known alphabet agency works alongside the federal government to prepare for bio-terror attacks, natural disasters, plagues and pandemics. Today, the agency has a budget of a half a billion dollars. While the Federal Emergency Management Agency (FEMA) stockpiles […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/09/Coronavirus-Ventilator-Patient-Hospital.jpg"}, "tags": ["Top Secret", "conspiracy", "future pandemics", "big government", "deep state", "national security", "forced drugs", "medical experiments", "medical resources", "national emergency", "pandemic creation", "Bioterror", "forced protocols", "forced vaccines", "strategic national stockpile", "doctor patient relationship", "WHO"], "tweets": [], "movies": [], "links": ["https://www.allnewspipeline.com/Government_Is_Madly_Preparing_To_Repopulate_The_World.php", "http://medicine.news", "https://www.npr.org/sections/health-shots/2016/06/27/483069862/inside-a-secret-government-warehouse-prepped-for-health-catastrophes", "https://www.phe.gov/Preparedness/mcm/phemce/Pages/default.aspx", "https://www.ccjm.org/content/87/10/633", "https://www.nbcnews.com/health/health-news/remdesivir-shouldn-t-be-used-hospitalized-covid-19-patients-who-n1248320", "https://www.brighteon.com/38e1bbbe-5f00-4ad5-b42a-20d7e25f4d02", "https://www.allnewspipeline.com/Government_Is_Madly_Preparing_To_Repopulate_The_World.php", "https://www.npr.org/sections/health-shots/2016/06/27/483069862/inside-a-secret-government-warehouse-prepped-for-health-catastrophes", "https://www.phe.gov/Preparedness/mcm/phemce/Pages/default.aspx", "https://www.ccjm.org/content/87/10/633", "https://www.nbcnews.com/health/health-news/remdesivir-shouldn-t-be-used-hospitalized-covid-19-patients-who-n1248320", "https://www.brighteon.com/38e1bbbe-5f00-4ad5-b42a-20d7e25f4d02", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-09-19-sns-might-be-used-harmful-mass-experiments&linkname=What%20is%20the%20Strategic%20National%20Stockpile%20and%20how%20might%20it%20be%20used%20to%20carry%20out%20harmful%20mass%20experiments%20on%20the%20population%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}