{"result_id": "317047", "URL": "https://treason.news/2021-10-24-vaccine-mandate-gut-americas-weapons-research-firing-top-scientists.html", "timestamp": "2023-04-25 17:43:39 CEST+0200", "meta": {"description": "The diabolical nature of the Biden regime puts America and Americans more at risk every day as these lunatics continue to exploit the COVID-19 pandemic to weaken our country in the face of our enemies, such is their hatred for our liberties. Nuclear weapons may be one of those things we, as members of the […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Biden regime,covid-19,employment,Joe Biden,Los Alamos,national defense,national security,nuclear lab,nuclear scientists,nuclear weapons,research,stupid,termination,vaccine mandate,vaccine wars,vaccines,weapons research,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://treason.news/2021-10-24-vaccine-mandate-gut-americas-weapons-research-firing-top-scientists.html", "encoding": "UTF-8"}, "image": null, "domain": "treason.news", "title": "Vaccine mandate being used to gut America’s weapons research assets by firing top scientists at Los Alamos", "cleaned_text": "Vaccine mandate being used to gut America’s weapons research assets by firing top scientists at Los Alamos\n\nThe diabolical nature of the Biden regime puts America and Americans more at risk every day as these lunatics continue to exploit the COVID-19 pandemic to weaken our country in the face of our enemies, such is their hatred for our liberties.\n\nNuclear weapons may be one of those things we, as members of the human race, may wish we could un-invent, but they are here now, have been for decades, and they are now a vital part of our national security. But the current regime is hell-bent on destroying even this advantage we hold over our two primary competitors — Russia and China — which have nuclear weapons inventories of their own.\n\nAccording to multiple reports, literally dozens of employees at the Los Alamos nuclear weapons research and development lab in New Mexico face termination after refusing to get a COVID vaccine, and among those at risk of being fired include some of our country’s top nuclear scientists.\n\nThe deadline for all federal workers and federal contractors at the lab to get the vaccine has come and gone and it’s not clear at this point if any of the highly skilled researchers have actually been terminated, but clearly that is a consideration and if we lose those personnel, there isn’t any way to rapidly replace the skill set and the decades of knowledge they collectively obtain.\n\nTo that point, 114 employees filed a lawsuit seeking an injunction against the vaccine mandate, which The Hill reported last week, “Workers at the New Mexico laboratory, which created the atomic bomb, filed a lawsuit claiming that exemptions to the mandate have been denied without proper justification.”\n\nHowever, a state judge has already struck down the suit, KRQE13 reported:\n\nOn Friday, Judge Jason Lidyard denied the request of the 114 employees asking for the vaccine mandate at LANL to be blocked. Jonathan Diener is an attorney representing some of the plaintiffs, who argued to the judge that LANL should be considered a government entity.\n\n“To me, it’s perfectly clear that employment is a benefit that the government is giving these people at LANL and they’re taking it away because they’re exercising their constitutional right to decide what goes in their body,” said Diener.\n\nAccording to the Los Alamos National Laboratory, workers had until Oct. 15 to be vaccinated. “Employees granted religious exemptions will go on vacation or unpaid leave until pandemic conditions improve. Judge Lidyard said that was an ‘ok’ religious accommodation,” the local outlet reported.\n\n“That was not a real accommodation and I’m shocked that the judge accepted that as a legitimate accommodation for those people,” said Diener.\n\nIn a statement, officials from Triad National Security LLC, the federal contractor that runs the lab, said, “Triad values the contributions of all employees, and our decision to mandate the vaccine was made only after considerable thought.\n\n“The safety and health of our employees remains our top priority as we fulfill our national security mission, and as a result, our vaccine mandate remains in effect. We appreciate the thorough review and consideration provided by the court on the important issues presented at the hearing,” the statement continued.\n\nThe company said that 96 percent of employees at the lab were vaccinated, but clearly, some of the most important and talented employees — nuclear scientists — were not.\n\n“The plaintiffs include scientists, nuclear engineers, project managers, research technicians and others who have some of the highest security clearances in the nation for the work they do,” The Associated Press reported.\n\n“Some employees have estimated the lab could lose anywhere from 4% to 10% of the workforce because of the mandate,” the newswire service continued.\n\nThis pandemic has been so politicized — by Democrats seeking to expand and consolidate unconstitutional powers — it almost has to have been intentional.", "opengraph": {"title": "Vaccine mandate being used to gut America’s weapons research assets by firing top scientists at Los Alamos", "type": "article", "url": "https://www.treason.news/2021-10-24-vaccine-mandate-gut-americas-weapons-research-firing-top-scientists.html", "site_name": "Treason News", "description": "The diabolical nature of the Biden regime puts America and Americans more at risk every day as these lunatics continue to exploit the COVID-19 pandemic to weaken our country in the face of our enemies, such is their hatred for our liberties. Nuclear weapons may be one of those things we, as members of the […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2021/10/Explosion-Bomb-Nuclear-Atomic-Atom-Energy-Cloud.jpg"}, "tags": ["Joe Biden", "covid-19", "vaccine wars", "stupid", "White House", "nuclear lab", "national security", "nuclear weapons", "research", "national defense", "employment", "Biden regime", "weapons research", "Los Alamos", "nuclear scientists", "termination", "vaccine mandate", "vaccines"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2021-10-21-covid-vaccine-plunges-to-just-3-percent-effectiveness.html", "https://thehill.com/homenews/state-watch/576872-dozens-of-workers-at-los-alamos-nuclear-lab-sue-over-vaccine-mandate", "https://apnews.com/article/coronavirus-pandemic-science-business-lawsuits-nuclear-weapons-15c0540921706abe2c0088100b644e8c", "http://www.pandemic.news", "https://apnews.com/article/coronavirus-pandemic-science-business-lawsuits-nuclear-weapons-15c0540921706abe2c0088100b644e8c", "https://thehill.com/homenews/state-watch/576872-dozens-of-workers-at-los-alamos-nuclear-lab-sue-over-vaccine-mandate", "https://www.naturalnews.com/2021-10-21-covid-vaccine-plunges-to-just-3-percent-effectiveness.html"], "authors": [], "publish_date": null}