{"result_id": "317011", "URL": "https://www.treason.news/2022-10-07-nih-awards-new-grant-to-ecohealth-alliance.html", "timestamp": "2023-04-25 17:43:10 CEST+0200", "meta": {"description": "The National Institutes of Health (NIH) awarded a new grant to EcoHealth Alliance (EHA), the group responsible for gain-of-function research in Wuhan, China. Led by Peter Daszak, EHA’s research alongside the Wuhan Institute of Virology (WIV) gave rise to the Wuhan coronavirus (COVID-19) pandemic. The $653,392 grant titled “Analyzing the potential for future bat coronavirus emergence in […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,bat coronavirus,big government,biological weapons,bioterrorism,biowar,corruption,covid-19,EcoHealth Alliance,gain-of-function research,infections,National Institutes of Health,outbreak,pandemic,Peter Daszak,research grant,Richard Ebright,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-10-07-nih-awards-new-grant-to-ecohealth-alliance.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "NIH awards new grant to group behind covid gain-of-function research in Wuhan", "cleaned_text": "NIH awards new grant to group behind covid gain-of-function research in Wuhan\n\nThe National Institutes of Health (NIH) awarded a new grant to EcoHealth Alliance (EHA), the group responsible for gain-of-function research in Wuhan, China. Led by Peter Daszak, EHA’s research alongside the Wuhan Institute of Virology (WIV) gave rise to the Wuhan coronavirus (COVID-19) pandemic.\n\nThe $653,392 grant titled “Analyzing the potential for future bat coronavirus emergence in Myanmar, Laos and Vietnam” was awarded to the New York-based EHA on Sept. 21. It seeks to identify areas of potential concern for future pandemic emergence in order to help public health authorities suppress an outbreak before it breaks containment.\n\nEHA elaborated that the grant’s long-term goal is to “build pandemic preparedness strategies to better predict sites and communities where wildlife-origin viruses are likely to emerge, and to disrupt emergence in [emerging infectious disease] hotspots around the world.\n\nThe group proposed to collect samples of viruses from wildlife and then “rapidly supply viral sequences and isolates for use in vaccine and therapeutic development,” likely meaning that the researchers could ship live viruses around the globe.\n\n“Most pandemics are caused by animal-origin viruses that emerge in regions where people have high contact with wildlife and where illnesses or outbreaks may be missed. This project builds on two decades of work that identifies the border region of Southern China, Myanmar, Laos and Vietnam as a high risk for future emergence of novel coronaviruses and the potential site where SARS-CoV-2 first ‘spilled over’ from bats to people,” the grant’s public health relevance statement said.\n\n“We will conduct in-depth surveys and serological testing in communities with high exposure to wildlife, identify wildlife reservoirs of the coronaviruses they are exposed to and use clinic-based surveillance to assess cases and clusters of associated illnesses – as well as testing public health strategies – to disrupt spillover and spread.” (Related: Emails show NIH funded gain-of-function research on bat coronaviruses.)\n\nEHA investigated by Congress over role in COVID-19 pandemic\n\nThe Sept. 21 grant followed earlier funding issued to EHA, alongside an investigation by Congress over the organization’s role in the COVID-19 pandemic.\n\nIn August 2022, the NIH terminated a sub-grant awarded to the WIV which was part of an earlier grant to EHA. The institute informed the House Oversight Committee that the organization led by Daszak had refused to turn over laboratory notebooks and other records as mandated.\n\n“NIH has requested, on two occasions, that EHA provide … the laboratory notebooks and original electronic files from the research conducted at WIV,” the institute stated in a letter to the committee. “To date, WIV has not provided these records.”\n\nThe NIH later informed EHA and WIV of the sub-grant’s termination on Aug. 19 for “material non-compliance with the terms and conditions of the award.” It wrote: “Since WIV is unable to fulfill its duties, … the WIV [sub-grant] is terminated for failure to meet award terms and conditions requiring provision of records to NIH upon request.”\n\nRichard Ebright, a molecular biologist with Rutgers University‘s Waksman Institute, commented on EHA’s multiple ongoing grants. The group led by Daszak already had two prior grants that are still ongoing, and the third one involved the WIV which is under negotiation.\n\n“It is disturbing that additional funding continues to be awarded for the same high-risk research that may have caused the current pandemic, before there has been a national investigation of the origin of the current pandemic,” he said.\n\nEbright, a staunch critic of Daszak, also zeroed in on the latter’s noncompliance with NIH requests for information. The molecular biologist cited requests sent by the institute on Nov. 5, 2021 and Jan. 6 for the notebooks and electronic files. Given this, he also found it “disturbing that additional funding continues to be awarded to a contractor that the NIH has reported to have repeatedly and seriously violated contractual terms and conditions of a grant.”\n\nCorruption.news has more stories about corrupt practices in the federal government.\n\nWatch EHA President Peter Daszak recount how his research team collected virus samples in China and manipulated them.\n\nThis video is from the SoulSearcher channel on Brighteon.com.\n\nThe NIH is funding a new animal experiment center in Texas to develop vaccines for EBOLA… when will the next “lab leak” go down?\n\nPentagon exposed for funneling $39 million to Peter Daszak, EcoHealth Alliance to produce novel coronavirus bioweapons.\n\nUkrainian biolabs linked to EcoHealth Alliance, which helped create and unleash COVID-19.", "opengraph": {"title": "NIH awards new grant to group behind covid gain-of-function research in Wuhan", "type": "article", "url": "https://www.treason.news/2022-10-07-nih-awards-new-grant-to-ecohealth-alliance.html", "site_name": "Treason News", "description": "The National Institutes of Health (NIH) awarded a new grant to EcoHealth Alliance (EHA), the group responsible for gain-of-function research in Wuhan, China. Led by Peter Daszak, EHA’s research alongside the Wuhan Institute of Virology (WIV) gave rise to the Wuhan coronavirus (COVID-19) pandemic. The $653,392 grant titled “Analyzing the potential for future bat coronavirus emergence in […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/10/Coronovirus-Research-Microscope-Medical-Gloves.jpg"}, "tags": ["National Institutes of Health", "pandemic", "Peter Daszak", "big government", "covid-19", "gain-of-function research", "biowar", "bat coronavirus", "bioterrorism", "EcoHealth Alliance", "outbreak", "research grant", "infections", "corruption", "Richard Ebright", "Wuhan coronavirus", "biological weapons"], "tweets": [], "movies": [], "links": ["https://theintercept.com/2022/10/04/ecohealth-alliance-lab-leak-nih-grant/", "http://english.whiov.cas.cn/", "https://reporter.nih.gov/search/DKCQxd3djUSwa0pi_hvk2A/project-details/10522470", "https://naturalnews.com/2022-07-25-nih-funded-gain-of-function-research-coronaviruses.html", "https://www.rutgers.edu/", "https://corruption.news/", "https://www.brighteon.com/f0a3dc59-07ae-4a00-925f-d62d511e7de6", "https://www.brighteon.com/channels/soulsearcher", "https://medicalexperiments.news/2022-01-25-nih-funding-new-animal-experiment-center-in-texas-develop-ebola-vaccines.html", "https://treason.news/2021-06-08-pentagon-millions-daszak-ecohealth-alliance-coronavirus-bioweapons.html", "https://biggovernment.news/2021-11-09-nih-ecohealth-self-police-risky-experiments-wuhan.html", "https://biologicalweapons.news/2022-03-22-ukrainian-biolabs-linked-to-ecohealth-alliance.html", "https://conspiracy.news/2021-06-07-ecohealth-alliance-president-thanked-fauci.html", "https://theintercept.com/2022/10/04/ecohealth-alliance-lab-leak-nih-grant/", "https://reporter.nih.gov/search/DKCQxd3djUSwa0pi_hvk2A/project-details/10522470", "https://www.brighteon.com/f0a3dc59-07ae-4a00-925f-d62d511e7de6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-10-07-nih-awards-new-grant-to-ecohealth-alliance&linkname=NIH%20awards%20new%20grant%20to%20group%20behind%20covid%20gain-of-function%20research%20in%20Wuhan", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}