{"result_id": "317031", "URL": "https://www.treason.news/2022-02-24-tom-renz-pentagon-hiding-vaccine-injury-data.html", "timestamp": "2023-04-25 17:43:26 CEST+0200", "meta": {"description": "Ohio attorney Tom Renz denounced the Department of Defense (DoD) for concealing data on Wuhan coronavirus (COVID-19) vaccine injuries. He also criticized the vaccine mandates for undermining military readiness on the Feb. 22 edition of his Brighteon.TV program “Lawfare with Tom Renz.” Renz presented data from the Pentagon’s Defense Medical Epidemiological Database (DMED), which consolidates […]", "lang": "en", "keywords": "badhealth,badmedicine,Brighteon.tv,covid-19,Department of Defense,DMED,Lawfare with Tom Renz,military,military readiness,national security,pandemic,Tom Renz,vaccine,vaccine data,vaccine injury,vaccine mandate,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2022-02-24-tom-renz-pentagon-hiding-vaccine-injury-data.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Tom Renz slams Pentagon for HIDING vaccine injury data – Brighteon.TV", "cleaned_text": "Ohio attorney Tom Renz denounced the Department of Defense (DoD) for concealing data on Wuhan coronavirus (COVID-19) vaccine injuries. He also criticized the vaccine mandates for undermining military readiness on the Feb. 22 edition of his Brighteon.TV program “Lawfare with Tom Renz.”\n\nRenz presented data from the Pentagon’s Defense Medical Epidemiological Database (DMED), which consolidates information from the Defense Medical Surveillance System. According to the attorney, critics claimed that the DMED data is incorrect – which is not actually the case.\n\n“If you look at this [and] go down to cancers, all cancers, you [will] see almost a 300 percent increase. One of the big things that I’ve [heard] a number of doctors and people say [is] ‘Well, how could that be?’ Cancer takes a long time to develop and that’s not normal,” he said.\n\nRenz previously mentioned this increase in cancers following vaccination during a Jan. 25 roundtable hosted by Sen. Ron Johnson (R-WI). He told the lawmaker that cancers and miscarriages after vaccination increased three times – more than the five-year average – in just a year’s time. The lawyer added that neurological issues caused by the COVID-19 vaccine jumped from 82,000 to 863,000 during the same time period. (Related: Tom Renz reveals the names of vaccine damage Pentagon whistleblowers during Johnson roundtable.)\n\n“The point is that now, they’re attacking the data because it’s inconvenient. Before, we always have to follow the data. Here, the data is clear as day: Cancer went up [by] 300 percent. Now [that] the data shows something that they don’t like – [it’s now] don’t trust the data, it’s wrong [and] there’s clearly a mistake in the data,” said Renz.\n\n“The COVID [vaccines] are – according to Moderna, Pfizer and anyone else – a gene therapy. It’s a new category of drug, it’s never been out there before. You just don’t know what it’s going to do. And as we all know, there were no long-term studies, [not] even any real short-term studies. The studies on [these] were all garbage from top to bottom. This is fraud from beginning to end.”\n\nRenz also pointed out why the Pentagon is going to great lengths to cover up the DMED data. “They’re terrified of this data [because] not only does it show that the vaccines are poisonous, but it also means that the DoD is going to have to spend a ton of money on taking care of the veterans they’re poisoning for the rest of their lives. That’s a nightmare for these guys,” he said.\n\n“Think about the kid who’s 18 years old and [in] perfect health, goes into the military, gets the jab and gets thrown out shortly thereafter because they developed some sort of issue like myocarditis. If you’re not in the military for over a certain period of time, you don’t get [veterans’] benefits [or] any sort of coverage. We’re damaging the kids, we’re throwing them out; they’re not able to do much because of their health issues and they don’t have coverage, [so] they’re out of luck. This is a tragedy.”\n\nThe attorney also cited a leaked senior leader brief that mentioned the actual number of vaccinated military personnel. While President Joe Biden wants everyone to believe that all active-duty and reserve members are vaccinated, the document revealed that only three-fourths of all military members received the COVID-19 shot.\n\n“Now, Biden wants to throw out everybody that’s not fully [vaccinated.] Well, you got 339,833 [service members] that are only partially [vaccinated,] and 179,952 that are either not vaccinated or unknown. He’s [going to] start a war with [Russia] while throwing our 25 percent of our military – are you serious? How about China? We’re poisoning most of our military; do we really want to throw out the rest?”\n\nAside from the actual service members, Renz mentioned that 71.4 percent of civilian employees and contractors are either unvaccinated or have an unknown vaccination status. He commented: “These are other people that are supporting the military. That’s [more than] 1.8 million between our military and our supporting civilian contractors that he wants to throw out. Does that seem like good policy for anybody?”\n\nDoD document proves that military’s purge of unvaccinated servicemen putting country at risk.\n\nOur nation’s security is at risk due to Biden’s illegal military vaccine mandate, experts warn.\n\nViral video shows increasing number of illnesses in US military following COVID vaccines.\n\nCover up: DOD silent after whistleblowers expose COVID ‘vaccine’ injuries in military.\n\nWatch the full Feb. 22 edition of “Lawfare with Tom Renz” below. Catch new episodes of the program every Tuesday at 11:30-12 p.m. on Brighteon.TV.\n\nSuppressed.news has more articles about the DoD concealing vaccine injury data.", "opengraph": {"title": "Tom Renz slams Pentagon for HIDING vaccine injury data – Brighteon.TV", "type": "article", "url": "https://www.treason.news/2022-02-24-tom-renz-pentagon-hiding-vaccine-injury-data.html", "site_name": "Treason News", "description": "Ohio attorney Tom Renz denounced the Department of Defense (DoD) for concealing data on Wuhan coronavirus (COVID-19) vaccine injuries. He also criticized the vaccine mandates for undermining military readiness on the Feb. 22 edition of his Brighteon.TV program “Lawfare with Tom Renz.” Renz presented data from the Pentagon’s Defense Medical Epidemiological Database (DMED), which consolidates […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2022/02/pentagon-aerial-defense-e1460559589961.jpg"}, "tags": ["pandemic", "DMED", "covid-19", "Department of Defense", "national security", "Lawfare with Tom Renz", "vaccine", "vaccine data", "Brighteon.tv", "vaccine injury", "vaccine mandate", "military readiness", "Wuhan coronavirus", "Tom Renz", "military"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/ac4a39cf-6f3a-493e-ba42-933471c261e3", "https://brighteon.tv", "https://www.brighteon.com/94ece6cd-828e-4a2b-92ec-e321f46b2ede", "https://naturalnews.com/2022-01-28-tom-renz-reveals-vaccine-damage-pentagon-whistleblowers.html", "http://vaccineinjurynews.com", "https://vaccinewars.com/2022-02-22-military-purge-of-unvaccinated-country-at-risk.html", "https://nationalsecurity.news/2022-01-26-nations-security-risk-military-vaccine-mandate.html", "https://vaccinedamage.news/2022-02-03-increasing-illnesses-military-due-to-covid-vaccines.html", "https://pandemic.news/2022-02-11-dod-silent-whistleblowers-expose-vaccine-injuries-military.html", "https://www.brighteon.com/ac4a39cf-6f3a-493e-ba42-933471c261e3", "https://brighteon.tv", "https://suppressed.news", "https://www.brighteon.com/ac4a39cf-6f3a-493e-ba42-933471c261e3", "https://www.brighteon.com/94ece6cd-828e-4a2b-92ec-e321f46b2ede", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2022-02-24-tom-renz-pentagon-hiding-vaccine-injury-data&linkname=Tom%20Renz%20slams%20Pentagon%20for%20HIDING%20vaccine%20injury%20data%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}