{"result_id": "317032", "URL": "https://www.treason.news/2023-02-06-russia-exposes-hunter-biden-biolab-operator-metabiota-in-ukraine.html", "timestamp": "2023-04-25 17:43:26 CEST+0200", "meta": {"description": "As part of their special military operations in Ukraine, the Russian Defense Ministry has obtained over 20,000 documents connected to a US biolab project in Ukraine called Metabiota. Ukrainian President Volodymyr Zelensky ordered all documents related to Metabiota be destroyed right before the Russians initiated their special military operation in Ukraine. The World Health Organization […]", "lang": "en", "keywords": "biological warfare,biological weapons,biosecurity state,biowar,bioweapons,Censored Science,conspiracy,corruption,deep state,EcoHealth Alliance,Exposed,future pandemics,gain-of-function,Hunter Biden,Joe Biden,medical police state,Metabiota,Pentagon,Peter Daszak,research,Russian military,terror,Ukraine biolabs,vaccine development,wef,WHO,world economic forum", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2023-02-06-russia-exposes-hunter-biden-biolab-operator-metabiota-in-ukraine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Russia exposes Ukrainian biolab operator Metabiota and its connections to the Pentagon, Hunter Biden, EcoHealth Alliance, and the WEF", "cleaned_text": "Russia exposes Ukrainian biolab operator Metabiota and its connections to the Pentagon, Hunter Biden, EcoHealth Alliance, and the WEF\n\nAs part of their special military operations in Ukraine, the Russian Defense Ministry has obtained over 20,000 documents connected to a US biolab project in Ukraine called Metabiota. Ukrainian President Volodymyr Zelensky ordered all documents related to Metabiota be destroyed right before the Russians initiated their special military operation in Ukraine. The World Health Organization – the entity that installed a global medical police state – called on Zelensky to destroy all documents related to biolabs in Ukraine, forfeiting transparency of suspected bioweapons research. The US embassy in Ukraine also removed all their Ukraine bioweapons lab documents from the web.\n\nHowever, on Monday January 20, 2023, the Russian Ministry of Foreign Affairs (MFA) claimed to have incriminating documents. The MFA asserted, “The materials confirm that the Pentagon aimed at creating elements of a biological weapon, & testing it on the population of Ukraine.” These are startling allegations that involve Hunter Biden, Joe Biden, and the Pentagon, and implicate Peter Daszak of EcoHealth Alliance and members of the World Economic Forum.\n\nBiolab activity in Ukraine connected to Hunter Biden, Peter Daszak, and the Pentagon\n\nThis Ukrainian biolab operator – Metabiota – is led by Nathan Wolfe, a prominent Stanford virologist who has previously worked on gain-of-function coronavirus research with Peter Daszak at EcoHealth Alliance. Dr. Daszak is the infamous scientist who took grants from Dr. Anthony Fauci at the National Institutes of Allergy and Infectious Disease (NIAID) to offshore illegal gain-of-function coronavirus research at the Wuhan Institute of Virology in China. Nathan Wolfe serves on the editorial board of EcoHealth Alliance and is a member of DARPA’s Defense Science Research Council. Wolfe and Daszak co-authored a paper together in 2017 on “Global patterns in coronavirus diversity.”\n\nThe unethical virology research that took place in China could very easily be conducted and expounded upon in Ukraine, with Daszak and Wolfe sharing their research and coordinating new business ventures that involve bioweapons manufacture and predatory vaccine development.\n\nOf course, Ukrainian biolabs should have been fully decommissioned after American politicians promised to do so with the 2005 Nunn-Lugar Cooperative Threat Reduction Act. These biolabs were previously operated by the Soviet Union, but were decommissioned after the Soviet Union was dissolved. The US promised to destroy all biological and chemical weapons at these sites, but it turns out that there is more to the story.\n\nIn fact, Hunter Biden’s firm – Rosemont Seneca Technology Partners (RSTP) – invested half a million dollars in Ukrainian biolab operator Metabiota, while using his family influence at the White House to lock in business deals with Ukrainian oligarchs. Biden also got Goldman Sachs and Morgan Stanley involved in the investments (according to emails obtained from the Hunter Biden laptop). The Pentagon eventually got on board with Metabiota, too, and invested $23.9 million in a contract for bioresearch. Back in 2014, Metabiota vice president Mary Guttieri communicated directly with Hunter Biden, promising to “leverage our team, networks, and concepts to assert Ukraine’s cultural and economic independence from Russia and continued integration into Western society.”\n\nAlso in 2014, Hunter Biden was reached by Burisma manager Vadym Pozharshki, who wanted to make a deal with Metabiota in Ukraine. Hunter invited the Burisma manager to meet with he and his dad, then Vice President Joe Biden. The three met in Washington, DC on April 16, 2015 (according to emails from the Hunter Biden laptop). Less than a month later, on May 12, 2014, Hunter joined the Board of Directors of Burisma Holdings, and began earning $1 million per year. As part of the corrupt deal, two of Hunter Biden’s employees at Rosemont Seneca Partners – Neil Callahan and John DeLoche – were appointed to the board of Metabiota. By October of that year, John DeLoche, managing director at RSTP, wrote to the boss, Hunter Biden, that the company would “increase our investment in Metabiota by 250 k.”\n\nOn Oct. 9, 2014, John DeLoche wrote to Hunter Biden, Devon Archer, and RSTP manager Rob Walker: “Is there anyone we can call in DC to get a sense of how legit Metabiota is viewed within the various government agencies? We want to make sure we thoroughly do our diligence here, especially as Goldman and now Morgan Stanley will be doing diligence on the fund and Metabiota towards investing in both. Additionally, who have we introduced them to in DC? Can you please provide a list of the various folks within Cornerstone as well as outside the firm where we have made intros? This data will go in our investment memo which we are trying to complete and get to potential LPs by Tuesday.”\n\nOn Oct. 9, 2014, Rob Walker responded: “I am going to have a friend reach out to DoD on the down low.” Not long thereafter, the DOD awarded $23.9M to Metabiota, furthering US government involvement in corrupt bioweapons development, and bringing Metabiota to the forefront of international spotlight.\n\nRussian military exposing corrupt biolabs in Ukraine that the Biden regime seeks to conceal\n\nIn 2021, the World Economic Forum anointed Metabiota as their WEF Tech Pioneer and promoted the corrupt venture as the future for controlling pandemics. Members of the WEF are working to implement vaccine passports globally while building the infrastructure to enforce a biosecurity state where civil liberties and human rights are a thing of the past.\n\nRussian Ambassador to the United States Anatoly Antonov said the current US administration “fails to suppress public discussion” and must answer for their lies. “In the United States itself, various investigations have been initiated with regard to federal bioprojects, including on the gain-of-function research, and side effects of vaccination,” the Russian Ambassador to the UN said. “No matter how Washington tries to dodge, sooner or later it will have to answer questions that were raised by the Russian Federation. One should remember: any lie has an expiration date.”\n\nAntonov accused the US government of “contradicting themselves” by trying to hide their biolab programs. The Pentagon calls their work “peaceful biological research projects” and put out a fact sheet in 2021 claiming their work is “weapons of mass destruction reduction efforts.” Antonov claimed the U.S. government is now “actively relocating the unfinished projects from Ukraine to the countries of Central Asia and Eastern Europe” and shifting programs to “civilian structures” such as HHS and USAID. “They obviously hope that it will help them avoid criticism and deflect the blow from the Pentagon,” Antonov claimed.\n\nAntonov asserts: “If US biological research in Ukraine was purely peaceful, then why were the activities so promptly curtailed? Why are these issues handled by the military? The answer is obvious: Washington had and has something to hide!”", "opengraph": {"title": "Russia exposes Ukrainian biolab operator Metabiota and its connections to the Pentagon, Hunter Biden, EcoHealth Alliance, and the WEF", "type": "article", "url": "https://www.treason.news/2023-02-06-russia-exposes-hunter-biden-biolab-operator-metabiota-in-ukraine.html", "site_name": "Treason News", "description": "As part of their special military operations in Ukraine, the Russian Defense Ministry has obtained over 20,000 documents connected to a US biolab project in Ukraine called Metabiota. Ukrainian President Volodymyr Zelensky ordered all documents related to Metabiota be destroyed right before the Russians initiated their special military operation in Ukraine. The World Health Organization […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/02/America-Ukraine-Fire-Flags.jpg"}, "tags": ["biological warfare", "conspiracy", "Ukraine biolabs", "world economic forum", "deep state", "corruption", "medical police state", "Censored Science", "bioweapons", "Metabiota", "biosecurity state", "Pentagon", "vaccine development", "wef", "Joe Biden", "Peter Daszak", "Hunter Biden", "EcoHealth Alliance", "gain-of-function", "WHO", "Russian military", "biological weapons", "future pandemics", "biowar", "research", "terror", "Exposed"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/02/hunter-bidens-biolab-firm-metabiota-linked-ecohealth-world-economic-forum-russia-claims-20-000-biolab-documents/", "https://www.thegatewaypundit.com/2023/01/zelensky-sent-government-decree-destroy-information-hunter-bidens-metabiota-company-day-russian-invasion-including-hunter-documents-metabiota/", "https://www.naturalnews.com/2022-03-02-why-did-us-embassy-website-remove-all-evidence-ukrainian-bioweapons-labs.html", "https://twitter.com/mfa_russia/status/1620085243956068358", "https://www.congress.gov/bill/109th-congress/senate-bill/313/text", "https://nypost.com/2022/03/26/hunter-biden-played-role-in-funding-us-bio-labs-contractor-in-ukraine-e-mails/", "https://nypost.com/2021/05/26/hunter-biden-arranged-secret-dinner-with-business-partners-and-vp-joe/", "https://docs.house.gov/meetings/JU/JU00/20191211/110331/HMKP-116-JU00-20191211-SD984.pdf", "https://widgets.weforum.org/techpioneers-2021/", "https://www.defense.gov/News/Releases/Release/Article/3057517/fact-sheet-on-wmd-threat-reduction-efforts-with-ukraine-russia-and-other-former/", "https://twitter.com/RusEmbUSA/status/1620183737999974400?s=20&t=0Y-0fi564oW5Fgx5bM3SKQ", "https://twitter.com/RusEmbUSA/status/1620619612772786177?cxt=HHwWgoDT9fG8zP0sAAAA", "https://www.thegatewaypundit.com/2023/02/hunter-bidens-biolab-firm-metabiota-linked-ecohealth-world-economic-forum-russia-claims-20-000-biolab-documents/", "https://www.thegatewaypundit.com/2023/01/zelensky-sent-government-decree-destroy-information-hunter-bidens-metabiota-company-day-russian-invasion-including-hunter-documents-metabiota/", "https://www.naturalnews.com/2022-03-02-why-did-us-embassy-website-remove-all-evidence-ukrainian-bioweapons-labs.html", "https://twitter.com/mfa_russia/status/1620085243956068358", "https://www.congress.gov/bill/109th-congress/senate-bill/313/text", "https://nypost.com/2022/03/26/hunter-biden-played-role-in-funding-us-bio-labs-contractor-in-ukraine-e-mails/", "https://nypost.com/2021/05/26/hunter-biden-arranged-secret-dinner-with-business-partners-and-vp-joe/", "https://docs.house.gov/meetings/JU/JU00/20191211/110331/HMKP-116-JU00-20191211-SD984.pdf", "https://widgets.weforum.org/techpioneers-2021/", "https://www.defense.gov/News/Releases/Release/Article/3057517/fact-sheet-on-wmd-threat-reduction-efforts-with-ukraine-russia-and-other-former/", "https://twitter.com/RusEmbUSA/status/1620183737999974400?s=20&t=0Y-0fi564oW5Fgx5bM3SKQ", "https://twitter.com/RusEmbUSA/status/1620619612772786177?cxt=HHwWgoDT9fG8zP0sAAAA", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-02-06-russia-exposes-hunter-biden-biolab-operator-metabiota-in-ukraine&linkname=Russia%20exposes%20Ukrainian%20biolab%20operator%20Metabiota%20and%20its%20connections%20to%20the%20Pentagon%2C%20Hunter%20Biden%2C%20EcoHealth%20Alliance%2C%20and%20the%20WEF", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}