{"result_id": "317019", "URL": "https://www.treason.news/2023-03-06-biden-surrenders-us-sovereignty-who-health-emergency.html", "timestamp": "2023-04-25 17:43:17 CEST+0200", "meta": {"description": "Thanks to fake president Joe Biden, Americans are losing their medical freedom. The Biden regime this week affirmed its commitment to what it described as a “legally binding” accord that grants the World Health Organization (WHO) total control over the United States every time there is a “pandemic.” A statement from Ambassador Pamela Hamamoto at […]", "lang": "en", "keywords": "Biden,Dangerous,deep state,Globalism,health,health freedom,lockdowns,mandates,medical fascism,Medical Tyranny,national security,Pandemic Accord,pandemic treaty,privacy watch,sovereignty,surveillance,Traitor,treason,WHO,World Health Organization", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.treason.news/2023-03-06-biden-surrenders-us-sovereignty-who-health-emergency.html", "encoding": "UTF-8"}, "image": null, "domain": "www.treason.news", "title": "Biden regime surrenders U.S. sovereignty to WHO – no more medical freedom, especially during a “health emergency”", "cleaned_text": "Biden regime surrenders U.S. sovereignty to WHO – no more medical freedom, especially during a “health emergency”\n\nThanks to fake president Joe Biden, Americans are losing their medical freedom.\n\nThe Biden regime this week affirmed its commitment to what it described as a “legally binding” accord that grants the World Health Organization (WHO) total control over the United States every time there is a “pandemic.”\n\nA statement from Ambassador Pamela Hamamoto at the WHO’s fourth meeting of the Intergovernmental Negotiating Body (INB) opens with a canned condemnation of Russia’s “full-scale invasion” of Ukraine, calling it an “unprovoked, unjustified war.” It then segues into the Biden regime’s commitment to the “Pandemic Accord,” which is described as “a major component of the global health architecture for generations to come.\n\n“We seek a Pandemic Accord that builds capabilities; reduces pandemic threats posed by zoonotic diseases; enables rapid and more equitable responses; and establishes sustainable financing, government, and accountability to ultimately break the cycle of panic and neglect.”\n\nBiden is bypassing the need for Senate approval by avoiding calling its Pandemic Accord a “treaty” – even though it has the full force of one\n\nIn Geneva this week, international leaders have converged to discuss a so-called “Zero Draft” of the agreement, which would hand over near-limitless power to the WHO to not only manage a global pandemic emergency but also to declare one on a whim.\n\nOnce a health emergency is declared, every signatory to the Zero Draft, including the U.S., must relinquish its national sovereignty and hand over all authority and power to the WHO, which operates as the public health arm of the United Nations.\n\n“This includes caving to them on treatments, lockdowns and vaccine mandates along with government surveillance,” explains The Gateway Pundit.\n\n“Even more chillingly, the Biden regime does not feel they need to submit this agreement for Senate approval because they are not calling it an official treaty despite it having the full force of one.”\n\nFor the past year, the Biden regime has been negotiating the terms of this agreement with the WHO. It is being carefully crafted to avoid having to include Congress while still allowing maximum power and authority to be handed over to the globalists.\n\nIn her announcement, Hamamoto specified that the final agreement cannot include “common but differentiated responsibilities and capabilities,” calling such an idea “not appropriate.”\n\n“We look forward to seeking common ground to best ensure universal application while also ensuring capacities are strengthened so that countries can meet their obligations,” she said, adding that the final agreement “must stand the test of time while building on the lessons from previous pandemics” in order for the U.S. and the WHO to “build a strong global health architecture for all.”\n\n“Finally, the Pandemic Accord must stand the test of time while building on the lessons from previous pandemics,” her announcement concludes. “By creating solutions that are flexible and adaptable, by laying out commitments that are clear regarding triggers and responsibilities, and by strengthening coordination and capacities, together we can build a stronger global health architecture for all.”\n\nIf ever there was a blatant act of treason by this corrupt regime, this is it. Biden and his cronies are no longer even trying to hide their true intentions for America, which include sacrificing the Constitution on the altar of “public health.”\n\n“All treaties require congressional approval,” one commenter emphasized about the absolute lawlessness of this regime. “Joebama is not following the law again.”\n\nMore news coverage about Biden’s assault on medical freedom can be found at Tyranny.news.", "opengraph": {"title": "Biden regime surrenders U.S. sovereignty to WHO – no more medical freedom, especially during a “health emergency”", "type": "article", "url": "https://www.treason.news/2023-03-06-biden-surrenders-us-sovereignty-who-health-emergency.html", "site_name": "Treason News", "description": "Thanks to fake president Joe Biden, Americans are losing their medical freedom. The Biden regime this week affirmed its commitment to what it described as a “legally binding” accord that grants the World Health Organization (WHO) total control over the United States every time there is a “pandemic.” A statement from Ambassador Pamela Hamamoto at […]", "image": "https://www.treason.news/wp-content/uploads/sites/48/2023/03/Joe-Biden-Weekend-In-Delaware.jpg"}, "tags": ["deep state", "national security", "privacy watch", "sovereignty", "health", "Biden", "health freedom", "pandemic treaty", "mandates", "treason", "Dangerous", "World Health Organization", "Medical Tyranny", "Pandemic Accord", "surveillance", "WHO", "medical fascism", "Traitor", "lockdowns", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/03/update-biden-regime-confirms-commitment-to-legally-binding-agreement-which-will-surrender-u-s-pandemic-authority-to-chinese-backed-world-health-organization-for-generations-to-come/", "https://naturalnews.com/2022-04-27-world-health-organization-pandemic-treaty-destroy-freedoms.html", "http://tyranny.news", "https://www.thegatewaypundit.com/2023/03/update-biden-regime-confirms-commitment-to-legally-binding-agreement-which-will-surrender-u-s-pandemic-authority-to-chinese-backed-world-health-organization-for-generations-to-come/", "https://naturalnews.com/2022-04-27-world-health-organization-pandemic-treaty-destroy-freedoms.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftreason%2F2023-03-06-biden-surrenders-us-sovereignty-who-health-emergency&linkname=Biden%20regime%20surrenders%20U.S.%20sovereignty%20to%20WHO%20%E2%80%93%20no%20more%20medical%20freedom%2C%20especially%20during%20a%20%E2%80%9Chealth%20emergency%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}