{"result_id": "318005", "URL": "https://www.trialsitenews.com/a/moderna-covid-19-vaccine-boost-offers-modest-benefit-over-pfizer-biontech-in-large-uk-matched-cohort-study-07bea3f8", "timestamp": "2023-04-25 17:43:42 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/moderna-covid-19-vaccine-boost-offers-modest-benefit-over-pfizer-biontech-in-large-uk-matched-cohort-study-07bea3f8", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Moderna COVID-19 Vaccine Boost Offers Modest Benefit Over Pfizer-BioNTech in Large UK Matched Cohort Study", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/53a66d4a-166e-4839-7fff-ff3afc0f4b00/public", "description": "British and American researchers conducted a&nbsp;matched cohort study emulating a comparative effectiveness trial, by linking primary care, hospital and COVID-19 surveillance records available within the OpenSAFELY-TPP research platform during periods when both delta and omicron variants predominated circulation. Their goal: compare the effectiveness of the Pfizer-BioNTech COVID vaccine (BNT162b2) and the Moderna vaccine (mRNA-1273) during the mass booster program in England. A total of 3,237,918 adults receiving either a booster dose of either Pfizer-BioNTech (BNT162b2) or AstraZeneca (ChAd0x1) as part of the national mass booster program across England who also received a primary course of either Pfizer-BioNTech or AstraZeneca were tracked to determine the study endpoint: recorded COVID-19 test, or related COVID-19 hospitalization or death and non-COVID-19 related death at 20 weeks after receiving the booster dose. The study team represented by lead author William J. Hulme an epidemiologist at University of Oxford, Nuffield Department of Primary Care Health Sciences, the Bennett Institute for Applied Data Science reports that the matched observational study of adults estimated a modest benefit of a booster vaccination with mRNA-1273 compared with BNT162b2 in preventing positive COVID-19 tests and hospital admission with COVID-19 20 weeks post-vaccination during a period when delta and omicron predominated.\nImportantly this study, published in&nbsp;the BMJ, &nbsp;tapped into a database (OpenSAFELY-TPP) covering approximately 40% of the English population and includes rich clinical information enabling a close match of Pfizer-BioNTech and Moderna vaccinated persons to control for potential confounding, part of the quest to investigate a range of clinical outcomes from severe COVID-19 while comparing comparative effectiveness across clinical subgroups. The study enabled the researchers to closely match BNT162b2 and mRNA-1273 recipients to control for potential confounding, examine a range of clinical outcomes, including severe covid-19, and compare comparative effectiveness between important clinical subgroups."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}