{"result_id": "318033", "URL": "https://www.trialsitenews.com/a/top-british-immunologists-covid-19-mrna-vaccine-platform-appears-a-dead-end-c7c2369a", "timestamp": "2023-04-25 17:43:58 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/top-british-immunologists-covid-19-mrna-vaccine-platform-appears-a-dead-end-c7c2369a", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Top British Immunologists: COVID-19 MRNA Vaccine Platform Appears to be a Dead End", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/56353ab3-2cd1-4654-9f16-7af92fcc1f00/public", "description": "With 70% of the population targeted with mass COVID-19 vaccination, herd immunity was promised as a natural positive outcome by the promoters of the COVID-19 vaccines early on. This was communicated by the World Health Organization, National Institutes of Health, Centers for Disease Control and Prevention and countless other agencies. But how could that have happened with a non-sterilizing vaccine that failed to fully stop viral transfer targeting a pathogen, an RNA virus that mutates frequently like influenza? Of course, the value of the vaccine correctly was pivoted to focus on the reduction of morbidity and mortality. But the 70% targets remained along with pervasive mandates which by the summer of 2021, were unethical as the platform failed to neutralize and with mutating variants became ever less durable. The experts that tried to call this out early on in the pandemic found themselves ignored or even censored. A recent editorial in The Lancet infectious Diseases by a pair of scientists from Imperial College of London,  both immunology experts, stated that as we enter the fourth year of the COVID-19 pandemic, rather than having a clear path to herd immunity, instead we face a far &ldquo;less certain&rdquo; tomorrow. The pair of highly respected British immunologists including Prof. Rosemary Boyton,  and Prof. Danny Altmann  reveal the COVID-19 vaccination reality of today in surprisingly frank terms. Despite this unprecedented mass vaccination program worldwide, &ldquo;societal attempts to live with the virus have relied on hybrid immunity,&rdquo; meaning the measurable plus non-measurable, tangible and intangible protective benefits afforded by both vaccination and the natural immunity bestowed by pre-existing infection. After reviewing the comment &ldquo;Imprinted hybrid immunity against XBB reinfection,&rdquo; it becomes clear just how much we have missed the mark with the mass vaccination program. \nAlthough the most recent bivalent vaccines are adapted to BA.4 and BA.5 in the United States, those pathogens disappeared months ago. But the Imperial College London immunologists point out that less viral sequencing tracking leads to far less certainty as to what any particular variant is doing worldwide. Protection from infection seems less now, but overall, Omicron appears less virulent, so there are tradeoffs."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}