{"result_id": "318042", "URL": "https://www.trialsitenews.com/breaking-news-novavax-traditional-vaccine-brings-imminent-competition-to-the-genetic-based-vaccines-currently-under-eua", "timestamp": "2023-04-25 17:44:02 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/breaking-news-novavax-traditional-vaccine-brings-imminent-competition-to-the-genetic-based-vaccines-currently-under-eua", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Breaking News Novavax’ Traditional Vaccine Brings Imminent Competition to the Genetic-based Vaccines Currently Under EUA", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/a275ee0d-ab88-4251-ad23-475725f57c00/public", "description": "U.S-based Novavax (Nasdaq: NVAX) reports today that its COVID-19 vaccine candidate called NVX-CoV2373 or “Coronavax” demonstrated 100% protection against moderate and severe disease and 90.4% overall efficacy, keeping this investigational product competitive with both mRNA-based vaccine products under emergency use authorization (EUA) as well as superior to the Johnson and Johnson Adenovirus-based vaccine, which is also authorized for deployment in the USA on an emergency basis.&nbsp;NVX-CoV2373 is a recombinant nanoparticle protein-based experimental vaccine, and could become the first vaccine available in the USA that does not use a gene therapy-based vaccination method. Meeting its clinical trial endpoints during the PREVENT-19 pivotal Phase 3 clinical trial, this study included 29,260 participants across 119 trial site organizations in both America and Mexico.&nbsp; The PREVENT-19 study evaluated the efficacy, safety, and immunogenicity of the Novavax candidate, and focused on the recruitment of study participants who are epidemiologically more likely to be impacted by the disease (e.g. the elderly, minorities, those with co-morbidities).&nbsp;But facing what is considered intense competition in what is increasingly in the USA a COVID-19 vaccine surplus-based market, the company&nbsp;(which is heavily funded by the American government) is today guided by such sages as the New York Times’ Carl Zimmer to seek alternative options other than the standard emergency use authorization (EUA) direct to market pathway here domestically. Assuming the consuming American public will seek the more novel gene-based vaccination products, Zimmer hints at options such as the&nbsp;full registration, which would delay the product’s market entry by many months while also considering export deals such as supplying vaccine product to low-to middle-income countries (LMICs).&nbsp;But TrialSite puts forth a different point of view: that the American public will greatly benefit from this vaccine product brought this far thanks to the funding of CEPI, the Bill and Melinda Gates Foundation, and the U.S. government.&nbsp;With what would be considered a more traditional vaccine potentially ready for the market, a true comparison of COVID-19 vaccine safety signals comparing the more traditional Novavax protein/adjuvant vaccine to the mRNA and recombinant adenovirus technology-based vaccines would be possible by the end of 2021. TrialSite analysis suggests that there is a substantial market for a more traditional vaccine, which may be accepted by US citizens hesitant to accept the mRNA and recombinant adenovirus-based genetic vaccine products, which express SARS-CoV-2 spike protein in the cells and tissues of vaccine recipients.\n\n\n"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}