{"result_id": "318027", "URL": "https://www.trialsitenews.com/a/covid-19-vaccine-injured-file-class-action-lawsuit-against-astrazeneca-in-uk-2ed6447c", "timestamp": "2023-04-25 17:43:55 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/covid-19-vaccine-injured-file-class-action-lawsuit-against-astrazeneca-in-uk-2ed6447c", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "COVID-19 Vaccine Injured File Class Action Lawsuit Against AstraZeneca in UK", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/95584382-3861-4808-077b-def2cdd13e00/public", "description": "Originally developed at University of Oxford, Jenner Institute the AstraZeneca COVID-19 vaccine,  while credited with saving millions of lives, also associates with adverse side effects and debilitating injuries. This vaccine was to be more accessible, economical and available as compared to the mRNA-based vaccines from Pfizer-BioNTech and Moderna. Due to concerns about safety, the modified chimpanzee adenovirus ChAdOx1 vaccine which demonstrated 81.3% efficacy after the second jab preventing symptomatic COVID-19 during clinical trials, never progressed to market availability in America. Like the other COVID-19 vaccines, a confluence of factors dilutes their efficacy, particularly the ongoing mutation of the SARS-CoV-2 pathogen itself. For example, efficacy dipped to 61% against the Delta variant and breakthrough infections are commonplace with the various circulating Omicron subvariants. After several months, the protection is gone.&nbsp;Now, a British law firm is filing a class action lawsuit on behalf of persons that either died or are essentially permanently disabled due to vaccine-induced injury. A key argument: The government didn&rsquo;t sufficiently disclose the risks to the masses that were either strongly encouraged or even mandated to receive the jab. \nBy September 2022, almost 25 million first doses of the Oxford/AstraZeneca vaccine and 27.2 million of the Pfizer/BioNTech vaccine had been administered in the UK. Around 50 million AstraZeneca doses have been given in total across Britain."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}