{"result_id": "318007", "URL": "https://www.trialsitenews.com/a/who-covid-19-vaccination-strategy-moves-away-from-prioritizing-healthy-childrenamerica-becomes-more-isolated-in-approach-eaccf84c", "timestamp": "2023-04-25 17:43:43 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/who-covid-19-vaccination-strategy-moves-away-from-prioritizing-healthy-childrenamerica-becomes-more-isolated-in-approach-eaccf84c", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "WHO COVID-19 Vaccination Strategy Moves Away from Prioritizing Healthy Children—America Becomes More Isolated in Approach", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/6b16b53a-e805-4e54-2698-68435634a700/public", "description": "Perhaps a one-size-fit-all COVID-19 vaccination scheme isn&rsquo;t best after all, at least not during the Omicron period of the pandemic, or for that matter, during the transition to the endemic stage of COVID-19. Now, the World Health Organization (WHO) is adjusting its position on COVID-19 vaccination, recently pointing out that some cohorts don&rsquo;t necessarily need a COVID-19 vaccine due to such factors such as preexisting immunity from previous infection and/or vaccination. For example, healthy children and adolescents are not high on the priority list for COVID-19 vaccination ongoing. Why? Because the risk-benefit argument for the healthy young cohort becomes tenuous at best. WHO now pays far more attention to a risk stratification scheme concerning COVID-19 vaccination. High-risk groups, from the elderly to persons with multiple comorbidities are now, according to new WHO positioning, at the top of the COVID-vaccination list. Noteworthy, among factors to consider in the COVID-19 risk-benefit analysis is COVID-19 vaccine performance.\nThe latest positioning is the result of the March 20-23 meeting of the WHO Strategic Advisory Group of Experts on Immunization (SAGE) where the roadmap for prioritizing the use of COVID-19 vaccines in a bid to reflect the impact of Omicron and high population-level immunity due to both infection and vaccination was revised."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}