{"result_id": "318008", "URL": "https://www.trialsitenews.com/a/covid-19-vax-adverse-events-surged-in-2021no-big-deal-according-regulators-medical-establishment-9dec40f8", "timestamp": "2023-04-25 17:43:44 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/covid-19-vax-adverse-events-surged-in-2021no-big-deal-according-regulators-medical-establishment-9dec40f8", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "COVID-19 Vax Adverse Events Surged in 2021—No Big Deal According Regulators & Medical Establishment", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/b44a9024-b63d-4dee-4e35-9d63b0e5bb00/public", "description": "Recently, the Western Australian state government released the Western Australian Vaccine Safety Surveillance (WAVSS) system for vaccinations received in 2021. Based on the information in this report, it&rsquo;s clear that the vaccination rollout in 2021 led to a surge of adverse event follow immunization (AEFI) reports as compared to 2020&mdash;in total, 10726 reports of AEFIs. Delayed for six months, the report reveals that reactions to COVID-19 vaccination ranged from mild complaints (headache sore arm) to serious concerns (anaphylaxis) to even death. According to Senator Gerard Rennick  of the Liberal National Party, a disturbing 48% of the AEFis from COVID-19 vaccination incidence in Western Australia in 2021 were &ldquo;managed&rdquo; by an ER and further 9% required hospitalization.&nbsp;&nbsp; \nIn total, 5.75 million vaccinations occurred, which is up from 2.07 million in 2020. While health agencies, regulators and the overall medical establishment appeared unphased by the report this had to do with their perception of the benefits of the mass vaccination program. Given the size of the rollout, the rate of AEFI was approximately 0.002. This figure fits into the TrialSite estimate for the United States on the low end&mdash;the estimated serious adverse event to injury range equals 0.002 to 0.008.&nbsp;&nbsp;"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}