{"result_id": "318032", "URL": "https://www.trialsitenews.com/a/uk-study-finds-no-material-risk-for-mortality-associated-with-mrna-vaccines-young-men-7bb39e94", "timestamp": "2023-04-25 17:43:58 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/uk-study-finds-no-material-risk-for-mortality-associated-with-mrna-vaccines-young-men-7bb39e94", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "UK Study Finds No Material Risk for Mortality Associated with mRNA Vaccines & Young Men", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/22315f05-f62b-4180-a3b3-e03332491700/public", "description": "A team of physicians and scientists in the United Kingdom investigated the risk of death after receiving the COVID-19 vaccine or a positive SARS-CoV-2 test in young persons. With numerous studies shining a light on the intersection of COVID-19 vaccination and risk of cardiovascular concerns such as myocarditis in young persons, tapping into real world health data via linked electronic health record data in England, the study team represented by corresponding authors Vahe Nafilyan and Charlotte R. Bermingham applied a self-controlled case series design to investigate the risk of cardiac and all-cause mortality in young persons (Age 12 to 29 years). Both authors, data quants, are affiliated with the UK&rsquo;s Office for National Statistics, and Nafilyan is a faculty member at the London School of Hygiene and Tropical Medicine. The study authors point out that &ldquo;there is no significant increase in cardiac or all-cause mortality in the 12 weeks following COVID-19 vaccination compared to more than 12 weeks after any dose.&rdquo; Noteworthy, the study result led to the finding that there is an increase in cardiac-related deaths in women involving non-mRNA vaccines (e.g., AstraZeneca). Meanwhile, the study authors find a link between COVID-19 illness and risk for death associated with cardiovascular concerns does increase.\nImportantly, these mixed findings may surprise COVID-19 vaccine critics that argue that the mRNA vaccines are associated with higher risk for cardiovascular mortality. The study here generated minimal evidence for such risk in males 12 weeks after receiving the jab. However, the UK-based study team did report finding a mortality risk associated with the female subgroup linked to the first dose of the non-mRNA vaccine, or AstraZeneca&rsquo;s vaccine."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}