{"result_id": "318012", "URL": "https://www.trialsitenews.com/a/retrospective-survey-studypfizer-mrna-covid-19-vaccine-no-safety-outcome-difference-than-other-vaccines-in-children-under-5-a1d74e86", "timestamp": "2023-04-25 17:43:45 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/retrospective-survey-studypfizer-mrna-covid-19-vaccine-no-safety-outcome-difference-than-other-vaccines-in-children-under-5-a1d74e86", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Retrospective Survey Study—Pfizer mRNA COVID-19 Vaccine No Safety Outcome Difference Than Other Vaccines in Children Under 5", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/1fd903b7-17b3-4f35-d092-57741709a100/public", "description": "Do the COVID-19 mRNA vaccines have a different safety track record than other vaccines commonly used in children under the age of five years old? A group of scientists and physicians based in Germany sought out to answer this question. Represented by corresponding author Cho-Ming Chao, M.D., Ph.D., HELIOS University Medical Center, Witten/Herdecke University  in Germany, and colleagues from multiple prestigious academic medical center designed a retrospective study to evaluate the safety of the Pfizer-BioNTech COVID-19 mRNA vaccine (BNT162b2) used off-label in children younger than 5 years, comparing to the safety profile of non-SARS-CoV-2 vaccines used in the same cohort. An investigator-initiated retrospective cohort study included parents or caregivers who registered their children for COVID-19 vaccination in outpatient care facilities in Germany. Done via an authenticated online survey, the investigators sought to better understand short-term safety data of 1 to 3 doses of 3 to 10 &mu;g BNT162b2 in children from birth to younger than 60 months. The study team designed co-primary outcomes associated with frequency of 11 categories of symptoms post the jab, including bivariate analysis and regression models adjusted for key data elements from age and weight to sex and height. They summarize that there is little difference in safety signals between the mRNA-based COVID-19 vaccine from Pfizer-BioNTech and other pre-COVID vaccines. This study has limitations and builds on assumptions which should be understood.\nSo, what did the Germany-based team find?"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}