{"result_id": "318020", "URL": "https://www.trialsitenews.com/fda-approval-of-pfizer-puts-consumers-in-ultimate-squeeze-prep-act-liability-shields-ongoing-while-fed-state-local-authorities-now-force-vaccinations", "timestamp": "2023-04-25 17:43:51 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/fda-approval-of-pfizer-puts-consumers-in-ultimate-squeeze-prep-act-liability-shields-ongoing-while-fed-state-local-authorities-now-force-vaccinations", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "FDA Approval of Pfizer Puts Consumers in Ultimate Squeeze: PREP Act Liability Shields Ongoing While Fed/State & Local Authorities Now Force Vaccinations", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/fff12e5e-4664-4c19-6a0b-fb155ec07f00/public", "description": "With the recent Food and Drug Administration (FDA) “approval” of the mRNA-based vaccine Comirnaty came the assumption that the liability shield protecting the drug and vaccine manufacturers, in this case Pfizer, would be lifted as the emergency use authorization (EUA) is no longer needed. But this isn’t the case at all with this most recent authorization under the Biden Administration. No, the reality is very different today for the healthcare consumer. Of course, one frequently discussed policy driver for the FDA approval of Pizer’s mRNA-based vaccine was to reduce vaccine hesitancy. That’s because the general public would perceive the vaccine to be permanently approved instead of an emergency use scenario. Not widely broadcast to the public is the support the approval provides to back up widespread vaccine mandates at the federal, state, and local employer level to the private sector. The recent approval was unorthodox, involving two distinct letters, one to Pfizer continuing the EUA and the other to BioNTech granting full approval to Comirnaty. Most healthcare consumers don’t realize that the recent FDA approval does nothing to protect their interests should injury or death result from an inoculation. That’s because both the approval and the EUA fall under what’s called the Public Readiness and Emergency Responsiveness Act, also known as PREP Act or PREPA. Now those pharmaceutical companies that have approved products such as Pfizer benefit on both sides, while they maximize revenue thanks to mandates and minimize legal risks thanks to all-encompassing liability shields under the PREP Act. Moreover, TrialSite suggests the duration of this coverage could run until 2024. What is the PREP Act, and why hasn’t the liability shield been lifted? What are the implications?\n\n\n"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}