{"result_id": "318006", "URL": "https://www.trialsitenews.com/a/portfolio-manager-claims-deaths-from-covid-vaccine-are-underestimated-b0b9c471", "timestamp": "2023-04-25 17:43:43 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/a/portfolio-manager-claims-deaths-from-covid-vaccine-are-underestimated-b0b9c471", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Portfolio Manager Claims Deaths from Covid Vaccine are Underestimated", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/24b9f84e-4bae-46ef-7e4a-8efd750b2f00/public", "description": "Edward Dowd  is a former managing director, portfolio equity manager at BlackRock Capital, a founding member of Phinance Technologies  and calls himself a &ldquo;numbers cruncher&rdquo;. He&rsquo;s been interviewed by TrialSite News  and currently has a book out called &ldquo;Cause Unknown, The Epidemic of Sudden Deaths in 2021 &amp; 2022.&rdquo; Interviewed by TrialSite last year, Dowd claimed the Food and Drug Administrator (FDA) should never have approved Pfizer's COVID-19 vaccine, revealed alarming mortality data and explained how investors on Wall Street could be the key to turning things around.\nSubsequently, Dowd has pointed out how Pfizer has benefited from the pandemic. \"Here's a statistic that everyone needs to know. It took decades and decades for Pfizer to get to $40 billion in revenues, before Covid. After Covid, in one year, $90 Billion...From when it was founded to right before Covid, it took decades to get to 40 plus billion. I did some back of the envelope math in 2021, you have to go back to when we were at the fever pitch of terror and fear. If you remember correctly, they were talking about quarterly boosters, with vaccine passports, you have to get your papers checked. This is back in 21, so I did some back of the envelope math, if this had occurred and Pfizer got half of the global share of the vaccine, and I assumed 5 billion people, 2 billion not abstained, and I looked at what they were charging for the vaccine. Quarterly boosters that would have gotten them $390 billion in revenue. That is what they wanted to take, and that would've been bigger than Apple's revenue stream.\""}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}