{"result_id": "318014", "URL": "https://www.trialsitenews.com/serious-group-of-scientists-declare-covid-19-vaccine-risks-too-high-to-ignore", "timestamp": "2023-04-25 17:43:47 CEST+0200", "meta": {"description": "Transparent coverage of clinical research", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.trialsitenews.com/serious-group-of-scientists-declare-covid-19-vaccine-risks-too-high-to-ignore", "encoding": "utf-8"}, "image": null, "domain": "www.trialsitenews.com", "title": "Serious Group of Scientists Declare COVID-19 Vaccine Risks Too High to Ignore", "cleaned_text": "", "opengraph": {"image": "https://imagedelivery.net/WEWiZyGwyq-Q4qn_WluYYg/85c7d6b4-ce5a-4031-e7c3-5c931e6bfe00/public", "description": "In what will most likely be ignored by the mainstream is a potential bombshell of a peer-reviewed, published paper warning the world to slow down on the mass COVID-19 vaccinations. A diverse, multi-disciplined group from both Europe and the U.S. recently raised questions about COVID-19 vaccination in children. About 42.5 million recorded COVID-19 cases in America have led to the highest number of deaths worldwide: approximately 681,222 deaths, according to&nbsp;Johns Hopkins University. With their findings published in the journal&nbsp;Toxicology Reports,&nbsp;the researchers first clarify that the bulk of the official COVID-19-attributed deaths per capita occur in the elderly with high comorbidities, while the COVID-19 attributed deaths per capita in children are negligible. The paper’s authors write that the great majority of “normalized post-inoculation” deaths occur in the elderly with high comorbidities, while “normalized post-inoculation” deaths in kids are small but not negligible. A provocative piece given the dominant societal narrative at this point in time, the authors’ data crunching leads to what undoubtedly is a claim rejected by much of the academic medical establishment, which is that COVID-19 vaccination leads to a five-fold increase in deaths in the most vulnerable age (65 and above) demographic. Therefore, the risk-benefit ratio of the mass vaccination program for children must be thoroughly vetted. While most may disagree with these research findings, what if they are correct…, or even just partly correct?\n\n\n"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}