{"result_id": "320001", "URL": "https://www.truth11.com/the-covid-vaccine-is-killing-people-in-huge-numbers/", "timestamp": "2023-04-25 17:44:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/the-covid-vaccine-is-killing-people-in-huge-numbers/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "The COVID Vaccine Is Killing People In Huge Numbers", "cleaned_text": "Guilty CDC, Govt, MSM, Pharma.. all enforce SILENCE on 100% emerging proofs of Covid Vaccine Massacre.\n\nSchwab study proves the COVID vaccines are killing massive numbers of Us.\n\n\n\nWill the CDC ever acknowledge it? No way! Their evidence to debunk this study? None whatsoever. They simply ignore it. So does the mainstream medical community and the press.\n\nI’ve written about the Schwab paper before, but I wanted to put it all in an article to make it easy to reference.\n\nBasically, this study, written by top German scientists and published in a prestigious German peer-reviewed medical journal, proves that the COVID vaccines kill people. They basically started with 35 bodies who died within 20 days of a COVID shot, and focused on 5 where no other cause of death could be ascribed. All 5 had similar findings consistent with a vaccine injury and inconsistent with any other known cause of death.\n\nThis suggests that at least 5/35 or 14% of people who die within 20 days of vaccination were likely killed by the vaccine. Note that is a lower bound.\n\nDespite having world-famous pathologist Peter Schirmacher as the senior author on the paper, the Schwab paper will never be covered in the mainstream media anywhere in the world. It was published Nov 22, 2022 and ignored by the media.\n\nA massive study, involving vaccine data from hundreds of countries, proves that the COVID-19 vaccines have caused a significant increase in total cases and deaths associated with COVID-19. The study proves that the COVID-19 vaccines are not only ineffective, but they are driving illness and death.\n\nHaving more than 14% of the deaths 20 days after vaccination being caused by the vaccine should be an immediate stopping condition in any sane world.\n\nBut medicine today is dictated by politics, not science.\n\nSo the vaccine will continue to be recommended and nobody will be warned about how deadly the vaccine is.\n\nThis article on Peter McCullough’s Substack published on December 4 entitled Found Dead at Home after COVID-19 Vaccination points out that 71% of a random sample of people who died unexpectedly within 20 days of the vaccine and underwent an autopsy to determine the cause of death, died of a primary symptom that is caused by the vaccine.\n\nIf there was ever a stopping condition for an experimental intervention, that SHOULD do the trick shouldn’t it?\n\nMcCullough was describing the paper by Schwab: German scientists conclusively linked the COVID vaccine and sudden death for the first time.\n\nIn plain English, it means that “the COVID shot kills people by damaging their heart.”\n\nThey looked at 35 patients; 10 were excluded as having died from pre-existing conditions, leaving 25 people.\n\nOf the 25, the study found 5 which likely died exclusively from vaccine-induced myocarditis and no other case.\n\nSo they only examined the histopathology of five bodies (3 female, 2 male) who met the criteria of myocarditis and had no other likely cause of death because they were looking to assess whether the vaccine caused myocarditis leading to sudden unexpected death.\n\nThey basically were looking for the “cleanest” proof of death, but it’s likely that all 71% of the cases (25 out of 35) died from the vaccine, it’s just harder to “prove” that.\n\nThey pointed out that one of the 5 they investigated had herpes, but nobody ever dies from herpes so they left that patient in.\n\nThey found heart damage consistent with vaccine-induced myocarditis in all 5 cases that they examined in depth.\n\nMore interestingly is the death timing. The subjects were taken from a 20 day window, but the mean time to death was 2.5 days which matches what the Israeli MoH found in their study (see Figure 5).\n\nSee Table 2 in the Schwab paper for the death timing of each case. If it was not related to the shot, it wouldn’t be clustered so close to the shot. It would be evenly distributed.\n\nThey wrote that they have NEVER seen anything like this before in any patient:\n\nThen they said they they’ve ruled out everything for these 5 cases except the vaccination:\n\nMy personal favorite part is that the vaccine leaves a “fingerprint” when it kills:\n\nIn plain English, “the damage pattern in the shoulder (injection site) was the same as in the heart.” This means if the vaccine didn’t kill the patient, this may be the greatest “coincidence” in medical history.\n\nSchwab was the first author but Peter Schirmacher was the senior author on the paper. Peter Schirmacher is a world-famous pathologist, one of the top 100 pathologists in the world.\n\nSchirmacher was also one of the first pathologists to link these vaccines with deaths and tell the world about it. More than a year ago, on August 1, 2021, he looked at 40 deaths within 2 weeks after vaccination and determined that at least 30% to 40% of the deaths could be linked to the vaccine.\n\nI was told that they threatened to kill his family so he went undercover which is why he was completely unreachable when I tried to contact him in August 2021).\n\nTop cardiologists such as Dr. Peter McCullough immediately recognized the importance of this paper. See this news story on the vaccine-related COVID deaths and this FOX News segment featuring Peter McCullough. It is consistent with the research described by Dr. Ryan Cole here.\n\nWatch this video from John Campbell entitled Myocarditis German evidence who explains the significance of the paper. Also, did you notice that throughout the video (such as at 12:10), Campbell has to expressly point out what he is “allowed” to talk about?\n\nHave you ever wondered what he would say if his speech wasn’t muzzled? Don’t people have a right to know that? Or is the public better off when clinicians’ speech is muzzled? Finally, look at all the comments on the video.\n\nIn particular, this comment tells you all you need to know about Campbell’s video:\n\nHere is Dr. Been’s video about the Schwab paper.\n\nThe question everyone should be asking is why is this research only now appearing two years after the vaccine roll out? Why are no autopsies being done in the US? Why is nobody in the US publishing similar research?\n\nThe question for the reader is whether you have a more likely explanation for these deaths than vaccine induced?\n\nHere is Dr. Moran’s video about the Schwab paper which in the first 5 minutes talks in detail about the prospective Thailand study where 7 out of 202 males developed myocarditis or pericarditis within just two weeks after their second dose of the vaccine.\n\nThis is far greater than the risk of myocarditis from COVID (which creates NO added risk per this large-scale Israeli study of 196,992 unvaccinated adults after Covid infection).\n\nA rate of 3.5% of teenage males (which is 1 in every 29 teenage males) being diagnosed with myocarditis post-vaccine is a disaster. If the vaccine isn’t causing this, what is? This cannot be simply “bad luck” that these kids all developed spontaneous myocarditis; the rate is too high and the timing is suspicious.\n\nThe precautionary principle of medicine requires us to halt the vaccine for kids, but the US ignored it, no further research is being done.\n\nYou simply can’t have 96 kids in Canada dying suddenly for no reason in just a 3 month period after the jabs rolled out. Read this article by Bill Makis which covers each case along with the pictures of everyone who died: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months – a warning call for Canadian parents.\n\nIt’s behind a subscriber paywall, but the $5 to subscribe helps offset the tremendous time investment Dr. Makis made to compile the list.\n\nDo you think he would even bother to spend his time on this if it wasn’t extraordinary?\n\nHere is a subset of the 96 profiles in his article:\n\nFor more information on proving a vaccine caused death\n• ‘Most definitive way’ to determine whether shots were the cause.\n• How to obtain an autopsy to prove a vaccine injury\n• Ryan Cole on looking for signs that the vax caused a death\n• My Ryan Cole interview: the medical examiners aren’t ordering the proper tests. The standard tests won’t show a vaccine death.\n• HOW TO OBTAIN AN AUTOPSY TO PROVE VACCINE INJURY\n\nThe key information is that all autopsies take tissue samples. But only half the time will they turn these tissue samples into microscope slides. Once you have the slides, they can be examined to see if there are lymphocytic infiltrates that are unusual. If there are, then the pathologist should taken further steps (such as staining) to look at the type of infiltrates such as was done in the Schwab study.\n\nThe COVID vaccine is killing people in huge numbers.\n\nThe Schwab paper is a good indicator that at least 14% of the people who died within 20 days of vaccination were killed by the vaccine, but the actual number is likely higher than that since that was the bare minimum of cases that could be definitively proved that no other cause existed. Peter McCullough went further and pointed out that 71% of the people who died within 20 days of vaccination had symptoms consistent with a vaccine-caused death.\n\nOther papers (e.g., Rancourt, Skidmore, etc.) show the vaccines are killing on average about 1 person per 1,000 doses overall. In America, that’s over 600,000 Americans.\n\nInterestingly, when eye drops kill a person, they are recalled. When vaccines kill 600,000 Americans, we mandate them.\n\nUnfortunately, the medical community, health authorities, government agencies, and mainstream media will continue to look the other way because to admit the truth would simply be too embarrassing. They will not debate. They will not answer any questions we have. They simply want to censor us and avoid talking about it. And, above all, they want to make sure that the public will never see the death-vax records that will tell everyone exactly what is going on. Those records must never be disclosed.\n\nWe live in interesting times. It’s clear to anyone who looks seriously at the data that the US is killing massive numbers of people with these vaccines.\n\nBut they don’t want to hear any arguments that they may have made a mistake about these vaccines.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "The COVID Vaccine Is Killing People In Huge Numbers", "description": "The Free Online\n\nSteve Kirsch\n\nGuilty CDC, Govt, MSM, Pharma.. all enforce SILENCE on 100% emerging proofs of Covid Vaccine Massacre.\n\nSchwab study proves the COVID vaccines are killing massive numbers of Us.\n\n\nWill the CDC ever acknowledge it? No way! Their evidence to debunk this study? None whatsoever. They", "url": "https://www.truth11.com/the-covid-vaccine-is-killing-people-in-huge-numbers/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/03/02Shah-videoSixteenByNine3000.jpg", "article:published_time": "2023-03-22T14:01:23.000Z", "article:modified_time": "2023-03-22T14:01:23.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "1125"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://link.springer.com/article/10.1007/s00392-022-02129-5?ref=truth11.com", "https://link.springer.com/article/10.1007/s00392-022-02129-5?ref=truth11.com", "https://thepathologist.com/power-list/the-power-list-2015/peter-schirmacher?ref=truth11.com", "https://petermcculloughmd.substack.com/p/found-dead-at-home-after-covid-19?ref=truth11.com", "https://petermcculloughmd.substack.com/p/found-dead-at-home-after-covid-19?ref=truth11.com", "https://link.springer.com/article/10.1007/s00392-022-02129-5?ref=truth11.com", "https://stevekirsch.substack.com/i/107447693/the-study-also-showed-that-the-vaccines-are-causing-kids-to-have-heart-attacks-and-die?ref=truth11.com", "https://link.springer.com/article/10.1007/s00392-022-02129-5/tables/2?ref=truth11.com", "https://thepathologist.com/power-list/the-power-list-2015/peter-schirmacher?ref=truth11.com", "https://www.sueddeutsche.de/wissen/wissenschaft-heidelberg-chef-pathologe-pocht-auf-mehr-obduktionen-von-geimpften-dpa.urn-newsml-dpa-com-20090101-210801-99-647273?ref=truth11.com", "https://www.sueddeutsche.de/wissen/wissenschaft-heidelberg-chef-pathologe-pocht-auf-mehr-obduktionen-von-geimpften-dpa.urn-newsml-dpa-com-20090101-210801-99-647273?ref=truth11.com", "https://www.sueddeutsche.de/wissen/wissenschaft-heidelberg-chef-pathologe-pocht-auf-mehr-obduktionen-von-geimpften-dpa.urn-newsml-dpa-com-20090101-210801-99-647273?ref=truth11.com", "https://www.clarkcountytoday.com/news/autopsy-study-ties-deaths-to-covid-vaccine/?ref=truth11.com", "https://rumble.com/v1zph35-autopsies-prove-sudden-deaths-attributable-to-covid-vaccines.html?ref=truth11.com", "https://www.youtube.com/watch?v=2SLp6B_kkRI&ref=truth11.com", "https://www.youtube.com/watch?v=j_DdSMn55cA&ref=truth11.com", "https://www.youtube.com/watch?v=j_DdSMn55cA&ref=truth11.com", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F051fd8a8-a215-4ccf-8539-b219c8edc556_647x138.png?ref=truth11.com", "https://www.youtube.com/watch?v=0a0iZ5fYKfo&ref=truth11.com", "https://www.youtube.com/watch?v=2mWZY6vmdBM&ref=truth11.com", "https://twitter.com/DrEliDavid/status/1589992021561073669?ref=truth11.com", "https://makismd.substack.com/p/over-96-canadian-children-ages-2?ref=truth11.com", "https://makismd.substack.com/p/over-96-canadian-children-ages-2?ref=truth11.com", "https://makismd.substack.com/p/over-96-canadian-children-ages-2?ref=truth11.com", "https://www.clarkcountytoday.com/news/autopsy-study-ties-deaths-to-covid-vaccine/?ref=truth11.com", "https://stevekirsch.substack.com/i/109241918/how-to-obtain-an-autopsy-to-prove-a-vaccine-injury?ref=truth11.com", "https://stevekirsch.substack.com/p/ryan-cole-on-looking-for-signs-that?ref=truth11.com", "https://stevekirsch.substack.com/i/68538726/my-ryan-cole-interview-the-medical-examiners-arent-ordering-the-proper-tests-the-standard-tests-wont-show-a-vaccine-death?ref=truth11.com", "https://theredlist.co.za/en/how-to-obtain-an-autopsy-to-prove-vaccine-injury?ref=truth11.com", "https://petermcculloughmd.substack.com/p/found-dead-at-home-after-covid-19?ref=truth11.com", "https://stevekirsch.substack.com/p/new-paper-an-estimated-13-million?ref=truth11.com", "https://stevekirsch.substack.com/p/new-peer-reviewed-study-217000-americans?ref=truth11.com", "https://stevekirsch.substack.com/p/a-worldwide-call-for-data-transparency?ref=truth11.com", "https://substack.com/profile/40661664-steve-kirsch?ref=truth11.com", "https://thefreeonline.com/2023/03/22/guilty-cdc-govt-msm-pharma-all-enforce-silence-on-100-emerging-proofs-of-covid-vaccine-massacre/?ref=truth11.com"], "authors": [], "publish_date": "2023-03-22T14:01:23.000Z"}