{"result_id": "320048", "URL": "https://www.truth11.com/untitled-947/", "timestamp": "2023-04-25 17:45:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-947/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Physician Assistant Fired for Reporting COVID-19 Vaccine Adverse Events to VAERS", "cleaned_text": "Deborah Conrad, a physician assistant in New York, was fired from her job after reporting COVID-19 vaccine adverse reactions to the Vaccine Adverse Events Reporting System (VAERS).\n\n100 Percent Fed Up – In 2021, Conrad began to notice that the side effects of the COVID-19 vaccines were being ignored by fellow medical professionals and that her colleagues were hesitant to report them.\n\n“After the vaccines came out, there was this uptick in unusual symptoms, some of which I had never seen in my 20-year career,” Conrad told The Epoch Times. “In every case, it was in somebody who had received the COVID-19 vaccine.”\n\nUntil the Covid vaccines were released to the public, Conrad had never encountered an adult patient with respiratory syncytial virus (RSV). Suddenly, patients were being admitted with RSV and, according to Conrad, “Every patient who came in with RSV was vaccinated for COVID. It wasn’t normal.”\n\nConrad also revealed that she saw children who had recently been vaccinated come down with intense cases of pneumonia who had previously been completely healthy.\n\n“They weren’t able to walk or eat, and they were completely and totally fatigued,” Conrad said of the adolescents with pneumonia.\n\nConrad also addressed the rising cases of myocarditis associated with the Covid vaccine.\n\n“A lot of these myocarditis cases came in with fevers because of this massive inflammatory response that was taking place in the body, so they would be labeled as septic, treated as if we were treating pneumonia or fevers of unknown origin,” said Conrad. “We’d treat them with antibiotics and all sorts of other things, not realizing that they were having heart failure.”\n\nWhen Conrad began trying to file reports with VAERS, she was met with backlash from the leadership at her workplace.\n\n“They kept telling me ‘we’re looking into it’ and ‘we’ll get back to you.’ Around April 2021, leadership came back and said no one else is reporting injuries – implying that I was crazy and there was nothing really going on with the vaccines,” Conrad revealed.\n\nShe was then accused of overreporting to VAERS and told that “by doing VAERS reports ad even discussing VAERS that it was an admission that the vaccines were unsafe, so it’s contributing to vaccine hesitancy.”\n\nHer workplace became a “very hostile environment” after that.\n\n“No one cared,” Conrad said. “Finally, I had had it. It was. so unethical; I couldn’t take it anymore. These VAERS reports are critical to assuring these vaccines are safe for us all. I could no longer be a part of a system that is lying to the American people.”\n\n“I couldn’t remain silent, even if it meant losing my career and everything I worked for,” she added. “I was fired a few weeks later and walked out like a criminal in front of all my peers.”\n\nAfter being fired for speaking the truth and advocating for patient safety, Conrad realized that the “whole system is corrupt” and how unethical the relationship is between federal officials and the pharmaceutical-industrial complex.\n\n“The light in this whole experience for me is that now I’m aware of how deep the lies and corruption really are,” Conrad said.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Physician Assistant Fired for Reporting COVID-19 Vaccine Adverse Events to VAERS", "description": "Henry Makow.com\n\n\n\n\n\nThe Gateway Pundit | Patty McMurray\n\nDeborah Conrad, a physician assistant in New York, was fired from her job after reporting COVID-19 vaccine adverse reactions to the Vaccine Adverse Events Reporting System (VAERS).\n\n100 Percent Fed Up – In 2021, Conrad began to notice that the side effects of", "url": "https://www.truth11.com/untitled-947/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/03/Screen-Shot-2023-03-21-at-12.12.33-PM.png", "article:published_time": "2023-03-21T16:14:38.000Z", "article:modified_time": "2023-03-21T16:20:13.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "1196"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/physician-assistant-fired-after-reporting-adverse-reactions-to-the-covid-19-vaccine-to-vaers/?ref=truth11.com", "https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html?ref=truth11.com", "https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html?ref=truth11.com", "https://www.thegatewaypundit.com/2023/03/physician-assistant-fired-after-reporting-adverse-reactions-to-covid-19-vaccine-to-vaers/?utm_source=rss&utm_medium=rss&utm_campaign=physician-assistant-fired-after-reporting-adverse-reactions-to-covid-19-vaccine-to-vaers", "https://henrymakow.com/2023/03/march-21---your-government-wants.html?ref=truth11.com"], "authors": [], "publish_date": "2023-03-21T16:14:38.000Z"}