{"result_id": "320017", "URL": "https://www.truth11.com/untitled-988/", "timestamp": "2023-04-25 17:44:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-988/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Pork Injected With Merck’s mRNA Livestock Vaccine Since 2018", "cleaned_text": "\n• For the last couple of years, I’ve recommended not eating pork due to its high linoleic acid (LA) content, but there’s an even bigger reason to avoid it now. Since 2018, pork producers have been using customizable mRNA-based “vaccines” on their herds.\n• The very first RNA-based livestock vaccine, a swine influenza (H3N2) RNA shot licensed in 2012, was developed by Harrisvaccines. The company followed up with an avian influenza mRNA shot in 2015. Harrisvaccines was acquired by Merck Animal Health later that year.\n• CureVac developed an mRNA-based rabies shot for pigs in 2016.\n• The swine vaccine platform Sequivity, introduced in 2018, was developed by Merck in partnership with Moderna. Sequivity can produce endlessly customized “vaccines,” none of which undergo safety testing.\n• Americans have been eating pork treated with gene therapy for nearly five years already, and even more of our meat supply is about to get the same treatment. mRNA-lipid nanoparticle shots for avian influenza are in the works, as are mRNA shots for cows. Lobbyists for the Cattlemen’s Association recently confirmed they intend to use mRNA “vaccines” in cattle, which might affect both dairy and beef.\n• Missouri House Bill 1169 would require labeling of products that can alter your genes. It would also require companies to share information about the potential transmissibility of gene-altering interventions, and asserts that fully informed consent must be given for all vaccines, gene therapies and medical interventions.\n\nFor the last couple of years, I’ve recommended not eating pork due to its high linoleic acid (LA) content, but there’s an even bigger reason to avoid it now.\n\nSince 2018, pork producers have been using customizable mRNA-based “vaccines” on their herds, and this has slipped completely under the radar. I myself just found out about it.\n\nAs described on Merck’s animal health website:\n\n“A revolutionary swine vaccine platform, SEQUIVITY harnesses RNA particle technology to create customized prescription vaccines against strains of influenza A virus in swine, porcine circovirus (PCV), rotavirus and beyond. It’s supported by a sophisticated dashboard filled with comprehensive data and insights …\n\n“Sequivity is a custom swine vaccine platform … Sequivity only targets swine pathogen gene sequences of interest. Doesn’t replicate or cause disease, delivering pathogen information to the immune system … There’s no need to transfer or handle live material like autogenous, killed or modified live vaccines …\n\n“Targets existing and evolving swine pathogens, including diseases not covered by conventional swine vaccines. Allows for the creation of multivalent formulations by blending RNA particles to target multiple swine pathogens in one shot.”\n\nFirst RNA ‘vaccine’ for livestock licensed in 2012\n\nMerck was not alone in developing veterinary mRNA shots, however. They weren’t even first on the scene, although they later acquired the company that started it all.\n\nThe very first RNA-based livestock vaccine, a swine influenza (H3N2) RNA shot, was licensed over a decade ago in 2012, and was developed by Harrisvaccines. The company followed up with an avian influenza mRNA shot in 2015. Harrisvaccines was acquired by Merck Animal Health later that year.\n\nCureVac developed an mRNA-based rabies shot for pigs in 2016. (On a side note, they began conducting human rabies shot trials in 2020 in response to the World Health Organization’s goal to achieve “zero human rabies deaths by 2030.”)\n\nIn 2016, Bayer also partnered with BioNTech to develop mRNA “vaccines” for both livestock and pets, but it doesn’t appear they ever launched anything.\n\nSo, in retrospect, it appears Americans have been eating pork treated with gene therapy for the past five years, and even more of our meat supply is about to get contaminated with the same treatment.\n\nIn addition to the avian influenza RNA shot for chickens licensed in 2015, newer mRNA-lipid nanoparticle shots for avian influenza are also in the works.\n\nIowa State University is also working on an mRNA shot for cows, and lobbyists for the Cattlemen’s Association recently confirmed they intend to use mRNA “vaccines” in cattle, which might affect both dairy and beef.\n\nMerck and Moderna: Partners in mRNA jab race since 2015\n\nThe same year Merck purchased Harrisvaccines (2015), it also entered into a partnership with Moderna to develop a number of undisclosed mRNA “vaccines.” It was slated to be a three-year collaboration, with a one-year optional extension, in which Merck would perform research and development and commercialization of five potential products using Moderna’s mRNA technology.\n\nAs reported by Genetic Engineering & Biotechnology News at the time:\n\n“Moderna has agreed to design and synthesize the mRNA product candidates directed against selected targets through its mRNA Therapeutics™ platform.\n\n“The platform builds on the discovery that modified mRNA can direct the body’s cellular machinery to produce nearly any protein of interest — ranging from native proteins to antibodies and other entirely novel protein constructs with therapeutic activity inside and outside of cells.”\n\nSequivity, introduced in 2018, was one of the products that came out of that partnership. As explained by Merck (both on its website and in the video below), Sequivity is not so much a single vaccine as it is a platform that can be endlessly customized — all without additional safety analyses over and beyond the initial ridiculously inadequate testing.\n\nAs noted by Zoetis, the largest producer of veterinary drugs and vaccines:\n\n“Sequivity has safety and efficacy studies based on the platform with a historical initial isolate, not likely the isolate that customers would be requesting in their product.”\n\nSequivity is customized as follows:\n• Pathogen is collected and sent to a diagnostic lab.\n• The gene of interest is sequenced and sent electronically to Sequivity analysts.\n• A synthetic version of the gene of interest is synthesized and inserted into the RNA production platform.\n• The RNA particles released from incubated production cells are harvested and formulated into a customized “vaccine.”\n\nUsing this platform, a customized “vaccine” can be created in as little as eight weeks. Now, what could go wrong by not testing every new shot for safety?\n\nIn my view, there is any number of safety hazards, as every pathogen has distinct effects, and tricking the animal’s body to produce that pathogen (or a pathogenic portion of that pathogen, as done with SARS-CoV-2) can have wildly unexpected side effects.\n\nWe’ve clearly seen this with the SARS-CoV-2 spike protein in humans. Pfizer’s own documentation lists 158,000 recorded side effects, and many of these diseases and conditions have never before been reported in response to a vaccine.\n\nI reviewed this evidence in “Newly Released Pfizer Documents Reveal COVID Jab Dangers” and “CDC Aware of Hundreds of Safety Signals for COVID Jab.”\n\nYet despite the obvious risks, the U.S. Food and Drug Administration has gone ahead and authorized updated COVID shots to be released on an annual basis without additional safety testing, and apparently safety testing of mRNA shots used in animals was foregone nearly five years ago!\n\nThe risk of dangerous side effects is one of the reasons why not all conventional vaccines work out. Some simply cause too many problems. Now we’re to believe that the possibility for dangerous side effects doesn’t exist just because we’re forcing the body to produce the antigen internally?\n\nIf anything, the possibility for problems is higher than ever, as exposure to the antigen is continuous for a long period of time, possibly for the life of the animal.\n\nEven organic pork producers can use mRNA shots\n\nUnfortunately, due to search engines now only providing a short list of curated and heavily censored content, it’s been impossible to determine how many pork producers in the U.S. use Sequivity.\n\nWithout that data, I recommend erring on the safe side and avoiding pork altogether, including organic pork, as organic standards do not have any rules on the use of vaccines, mRNA-based or otherwise.\n\nSeeing how the Sequivity platform has been around for nearly five years already, it seems reasonable to assume nearly all large-scale swine producers have made this transition.\n\nWhat do the cells in mRNA-treated meat contain?\n\nThe question now is, how do mRNA shots affect the meat?\n\nFor now, this is speculative, as we do not know whether veterinary mRNA shots are substituting uridine with pseudouridine, as was done in the COVID-19 shots. But if they do, then one of the obvious concerns would be that the mRNA might end up in the final meat product that you eat because this substitution makes it extremely difficult to destroy.\n\n“Natural RNA is made of two purines adenine and guanine and two pyrimidines cytosine and uracil.\n\n“The replacement of uracil with its ribose ring (uridine) with N-1-methyl-pseudouridine, a synthetic product makes the genetic code for the Wuhan Spike protein better stabilized on lipid nanoparticles, long-lasting, and very efficient in terms of evading cellular destruction and able to undergo repeat reading by ribosomes for continued protein synthesis.\n\n“Morais et al indicate that both Pfizer and Moderna chose development strategies replacing all uridine units with pseudouridine, making the entire strand completely ‘unnatural’ to the human body. Thus vaccine consultants, companies, and patients unfortunately gambled on how long mRNA would be active within the human body.\n\n“Fertig et al found lipid nanoparticles with mRNA were measurable in plasma for — 15 days. Recently, Castruita et al demonstrated mRNA in blood out to 28 days. Röltgen et al have found mRNA in lymph nodes 60 days after injection.\n\n“None of these studies demonstrated complete clearance of mRNA from a group of patients.\n\n“This is worrisome since injections are recommended in some populations just a few months apart implying there will be stacking of long-lasting mRNA in the body without adequate opportunity for clearance and elimination.\n\n“We will look back for many years and ask: how could so many people readily accept injections of heavily modified synthetic genetic code giving the body instructions to manufacture a disease promoting and lethal protein engineered in a biosecurity lab in Wuhan, China?\n\n“Repeated administrations of mRNA studded with apparently indestructible pseudouridine may have changed the course of lives forever.”\n\nIf mRNA shots can cause significant disease in humans, how has it affected our pork supply for the last five years? And how will it affect beef and chicken in the future? Can consuming genetically manipulated meat affect your health? These are questions that currently do not have answers and must be thoroughly and comprehensively investigated.\n\nBig Ag didn’t tell us what they were doing\n\nOne of the most frustrating aspects of this is that the industry didn’t tell us they were using novel gene therapy to spin up customized “vaccines” in weeks without any safety testing. The only reason many of us became aware of this issue in recent weeks was because attorney Tom Renz started warning about it.\n\n“I have been talking about gene therapy vaccines being introduced into the food supply without providing people informed consent on my Twitter account … as well as pushing Missouri HB1169 which is our best bet of stopping this happening.\n\n“This is a nightmare scenario whereby people’s genetics are potentially altered with ‘factory foods’ without them even knowing. Let me begin by putting to rest any questions as to whether this can happen. The idea of vaccines in food has been around for a long time …\n\n“Here is an article published in the NIH (you know — by our government) talking about foods ‘under application’ to be genetically modified to become edible vaccines — FROM 2013 … The fact that food can be altered to act as a vaccine is not disputable.\n\n“Which foods and in what ways is more of a question. It is claimed that beef, pork, etc. cannot transfer vaccination from the meat to the consumer of the meat. At initial glance that would make sense (cow DNA and people DNA is quite different and an mRNA designed for cows would probably not be able to transfer directly to people), but that is NOT the whole story.\n\n“You have to remember that the additives in the mRNA vaccines are by no means ‘proven safe’ and we don’t even actually know what all is in these shots … Ultimately the mRNA jabs still have not undergone long-term testing because long-term testing can take 10-20 years and they have not existed that long so any claims about the safety or efficacy of the stuff that’s in them are garbage at best.\n\n“What we do know about the mRNA vaccines is that they do not stop the spread of disease … and really do not help in any way with anything. We also do know that these jabs were demonstrated, in vitro, to alter the genetic makeup of some cells and I would say it is incredibly likely that they do the outside the Petri dish.\n\n“Given that we are now talking about a new level of genetic engineering with unknown effects and no long-term studies, do the potential genetic changes the mRNA injections facilitate pose a long-term risk to humans that ingest the altered food? Before you say no, wouldn’t you prefer it be tested rather than being the subject of the experiment?”\n\nAs noted by Renz, Missouri House Bill 1169 would require the labeling of products that can alter your genes. It also asserts that fully informed consent must be given for all vaccines, gene therapies and medical interventions, and would require companies to share information about the potential transmissibility of gene-altering interventions.\n\nThe pushback by industry against this bill has been enormous, which should tell you something. It doesn’t ban anything; it only requires transparency. That, apparently, is a serious threat to industry, and the most obvious reason for that is because they’d have to admit that all sorts of foods can have gene-altering effects.\n\nNot only might this destroy Big Ag, but it would also decimate any surreptitious attempts by Big Pharma to use the food supply as a tool to distribute vaccines unbeknownst to consumers.\n\nAs noted by Renz, “Big pharma DOES NOT WANT people to know they are going to use food to alter their genetics.”\n\nFarmers are also being set up as the fall guys, and they need to be made aware of this.\n\n“The lobbyists opposing this bill … are pushing to shut this bill down because factory mega-farmers like Bill Gates, the CCP, and others want to put vaccines in your food. These guys are supporting the big money but this will come at the expense of the family farmers.\n\n“The problem is that the major factory farmers like Gates have legal teams that can set up defense shields against the torts that may come if the food supply starts poisoning people …\n\n“Meanwhile, the small farmers will be at risk of being sued if it turns out that the food they are selling is unsafe despite the fact that most of them will not necessarily know what is happening.\n\n“If the corn growers, soybean, cattle, and pork associations actually cared about the farmers they would be demanding the seed companies and vaccine manufacturers indemnify the small farmers for these products rather than opposing a bill that would force them to tell the farmers what they are doing.\n\n“The corruption regarding this bill is amazing. Ultimately the labeling requirement would likely serve to protect farmers from being sued because the makers of seed and vaccines would have to make sure the farmers knew if they were putting potential gene therapies into their products. The opposition from the ag lobby is not to help the farmers, it is to help their own pockets.”\n\nAs noted by Renz, if this bill is passed in Missouri, it could help protect the food supply of the entire U.S.\n\nIn the meantime, I recommend avoiding all pork products, including organic ones, as they not only have high levels of the omega-6 fat, linoleic acid, because of the grains they are fed, but virtually all have been contaminated with the mRNA vaccines for the past five years.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Pork Injected With Merck’s mRNA Livestock Vaccine Since 2018", "description": "Infowars.com\n\n\n\n * For the last couple of years, I’ve recommended not eating pork due to its high linoleic acid (LA) content, but there’s an even bigger reason to avoid it now. Since 2018, pork producers have been using customizable mRNA-based “vaccines” on their herds.\n * The very first RNA-based", "url": "https://www.truth11.com/untitled-988/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/Screen-Shot-2023-04-11-at-4.42.06-PM.png", "article:published_time": "2023-04-11T20:44:22.000Z", "article:modified_time": "2023-04-11T20:44:22.000Z", "article:tag": "FOCUS ARTICLES", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "971"}, "tags": ["FOCUS ARTICLES", "VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "200", "height": "113", "embed_code": "<iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/m7oc0THI_OE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" title=\"2018 World Pork Expo: Merck Animal Health Launches SEQUIVITY\"/>", "src": "https://www.youtube.com/embed/m7oc0THI_OE?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jSQKIQt9RKc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" style=\"max-width: 100%; padding: 0px !important; margin: 0px !important; min-width: 700px !important; min-height: 394px !important;\"/>", "src": "https://www.youtube.com/embed/jSQKIQt9RKc"}], "links": ["https://takecontrol.substack.com/p/linoleic-acid-health-effects?ref=truth11.com", "https://www.youtube.com/watch?v=m7oc0THI_OE&ref=truth11.com", "https://www.merck-animal-health-usa.com/species/swine/sequivity?ref=truth11.com", "https://childrenshealthdefense.org/defender/mrna-vaccines-livestock-big-pharma/?ref=truth11.com", "https://www.drugs.com/vet/swine-influenza-vaccine-rna.html?ref=truth11.com", "https://www.wattagnet.com/articles/13973-harrisvaccines-gains-usda-licensure-of-swine-flu-vaccine?ref=truth11.com", "https://www.merck-animal-health.com/blog/2015/09/21/harrisvaccines-receives-usda-conditional-license-for-avian-influenza-vaccine-rna/?ref=truth11.com", "https://www.merck-animal-health-usa.com/newsroom/harrisvaccines-receives-production-platform-vaccine-licensure-first-of-its-kind-granted-by-usda?ref=truth11.com", "https://www.merck.com/news/merck-animal-health-to-acquire-harrisvaccines/?ref=truth11.com", "https://pubmed.ncbi.nlm.nih.gov/27336830/?ref=truth11.com", "https://www.curevac.com/en/curevac-announces-positive-results-in-low-dose-1-%C2%B5g-rabies-vaccine-clinical-phase-1-study/?ref=truth11.com", "https://www.fulcrum7.com/blog/2023/1/20/is-mrna-entering-our-food-supply?ref=truth11.com", "https://www.genengnews.com/topics/drug-discovery/bayer-partners-with-biontech-to-develop-mrna-vaccines-drugs-for-animal-health/?ref=truth11.com", "https://www.sciencedirect.com/science/article/pii/S0264410X23003432?ref=truth11.com", "https://twitter.com/RenzTom/status/1642229969555259395?ref=truth11.com", "https://www.agri-pulse.com/articles/17852-animal-health-battle-could-have-new-weapon-in-hog-vaccine-platform?v=preview&ref=truth11.com", "https://www.genengnews.com/topics/omics/merck-co-moderna-launch-100m-mrna-partnership/?ref=truth11.com", "https://www.zoetisus.com/content/_assets/docs/Pork/FLUSURE-XP-Product-Comparison-Chart.pdf?ref=truth11.com", "https://www.merck-animal-health-usa.com/species/swine/sequivity?ref=truth11.com", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-trial-failures-cola/?ref=truth11.com", "https://takecontrol.substack.com/p/pfizer-documents-reveal-vaccine-dangers?ref=truth11.com", "https://takecontrol.substack.com/p/cdc-aware-hundreds-safety-signals-covid-jab?ref=truth11.com", "https://takecontrol.substack.com/p/fdas-new-vaccine-strategy?ref=truth11.com", "https://www.usda.gov/media/blog/2020/10/27/organic-101-allowed-and-prohibited-substances?ref=truth11.com", "https://petermcculloughmd.substack.com/p/critical-role-of-pseudouridine-in?ref=truth11.com", "https://www.frontiersin.org/articles/10.3389/fcell.2021.789427/full?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9313234/?ref=truth11.com", "https://onlinelibrary.wiley.com/doi/10.1111/apm.13294?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8786601/?ref=truth11.com", "https://tomrenz.substack.com/p/eat-your-vaccines-i-mean-vegtables?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7120417/?ref=truth11.com", "https://www.michigancapitolconfidential.com/news/pfizer-admits-covid-vaccine-was-never-meant-to-stop-transmission?ref=truth11.com", "https://legiscan.com/MO/text/HB1169/2023?ref=truth11.com", "https://childrenshealthdefense.org/defender_category/big-pharma/?ref=truth11.com", "https://missourifarmersunion.us/2021/03/29/why-farmers-are-worried-about-bill-gates-and-other-non-farming-land-owners/?ref=truth11.com", "https://childrenshealthdefense.org/defender/bill-gates-farming-technology-food-sovereignty/?ref=truth11.com", "https://www.infowars.com/posts/are-you-eating-pork-injected-with-mercks-mrna-livestock-vaccine?ref=truth11.com"], "authors": [], "publish_date": "2023-04-11T20:44:22.000Z"}