{"result_id": "320016", "URL": "https://www.truth11.com/the-vaccine-deaths-and-injuries-continue/", "timestamp": "2023-04-25 17:44:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/the-vaccine-deaths-and-injuries-continue/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "The Vaccine Deaths And Injuries Continue", "cleaned_text": "We have reported on so many sudden deaths and injuries that we decided to stop writing individual articles for each one due to the huge numbers. Simply because we know you are aware of the deaths being caused and you don't need or want this site dedicated to truth or your email overrun with these reports.\n\nWe continued to take a screen shot of the person and date and posted these in the Images + Memes section as it is still very important to see and for the asleep to see the damage being caused.\n\nBut then the images + meme pages started to become more and more filled with these reports to the point I have stopped adding most as we will have memes and images proving truth lost in a sea of obituarys.\n\nThis volume becomes a problem for journalism during genocide of the majority of the population.\n\nWe are all very aware of all who have suffered and died due to these deadly vaccines. At this point someone would have to be completely in denial to not know the truth.\n\nWe will still report on these but are now not adding them to the Images + Meme section.\n\nThese peoples deaths and injuries are important and deserve to be acknowledged to the world, to assist in bringing the guilty to justice and to warn others to avoid these deadly injections. However the numbers are so many that we have to again change how we are reporting these.\n\nThe mainstream media on the other hand have not reported them at all. People see us in independent media addressing the vaccine injured and killed by the millions, and they see nothing from mainstream media.\n\nThey are aware of this difference and are posting images and information about the vaccine killed and injured on the windows of mainstream media outlets.\n\nThose MSM outlets reported on every death of the alleged covid virus, yet they will not report one about a vaccine injured or killed person. They are aware. Their windows are covered in the truth.\n\nThis is the difference between independent media and mainstream media. Truth vs lies and the people know it.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "The Vaccine Deaths And Injuries Continue", "description": "Dylan Eleven | Truth11.com\n\nWe have reported on so many sudden deaths and injuries that we decided to stop writing individual articles for each one due to the huge numbers.  Simply because we know you are aware of the deaths being caused and you don't need or want this site", "url": "https://www.truth11.com/the-vaccine-deaths-and-injuries-continue/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/Screen-Shot-2023-02-28-at-8.59.58-AM-2.png", "article:published_time": "2023-02-28T14:30:06.000Z", "article:modified_time": "2023-02-28T14:51:41.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "1136", "image:height": "1062"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2023-02-28T14:30:06.000Z"}