{"result_id": "320028", "URL": "https://www.truth11.com/untitled-884/", "timestamp": "2023-04-25 17:45:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-884/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "COVID-19 Vaccine Injured Doctors Are Finally Starting To Speak Up • And They Are Shocked That The Medical Establishment Abandons Them", "cleaned_text": "‘I apologize on behalf of my profession for refusing to listen to patients with vax injuries’ – Dr. Michael Huang, physician who treated 4,000 COVID patients says he’s seen hundreds of COVID-19 vaccine injuries, cancer, pregnancy loss, etc.\n\nDr. Melissa Halvorson Smith is a gynecologist from North Dakota and heads the Women’s Health Center. She was injured by 2 doses of Pfizer COVID-19 mRNA vaccine. In her words (click here):\n\nDr. Smith has been shocked by the horrible treatment she has received from her physician colleagues as a COVID-19 vaccine injured patient.\n\nDr. Shmuel Shapira MD MPH (Col) led Israel’s effort to develop a coronavirus vaccine and was the Head of the Department of Military Medicine of Hebrew University Faculty of Medicine and IDF Medical Corps (read more here):\n\n“Professor Shmuel Shapira might be the most senior ranking medical-scientist in the world to openly criticize the COVID vaccines.”\n\nOn May 13, 2022, Dr. Shapira said: “I received 3 vaccinations (Pfizer), I was physically injured in a very significant way as many others were injured”\n\nDr. Kerryn Phelps is the former President of the Australian Medical Association (AMA). She and her partner were COVID-19 vaccine injured. She is the highest ranking Australian medical doctor to admit to being COVID-19 vaccine injured (read more here):\n\n“Dr. Phelps revealed she was also diagnosed with a vaccine injury from her second dose of Pfizer in July 2021, “with the diagnosis and causation confirmed by specialist colleagues”.\n\n“In my case the injury resulted in dysautonomia with intermittent fevers and cardiovascular implications including breathlessness, inappropriate sinus tachycardia and blood pressure fluctuations.”\n\n“Dr. Phelps said both reactions were reported to the Therapeutic Goods Administration (TGA) “but never followed up”.\n\n“She revealed she had spoken with other doctors “who have themselves experienced a serious and persistent adverse event” but that “vaccine injury is a subject that few in the medical profession have wanted to talk about”.\n\nDr. Danice Hertz, a 64 year old physician was “horribly ill” and “incapacitated” after getting Pfizer’s COVID-19 mRNA vaccine. Her story is here (click here):\n\nDr. Stephen Wright (UK) died at age 32, from blood clots caused by the AstraZeneca COVID-19 vaccine.\n\nMark Steyn conducted several interviews with the family:\n\nIt is crucial for doctors who have been COVID-19 vaccine injured to speak up and let the world know what has happened to them and how they have been treated by their colleagues and the medical establishment in general, once they became COVID-19 vaccine injured patients.\n\nIt is also important for everyone, vaccinated or unvaccinated, to be kind to these doctors as they share their painful stories with us. Their voices will be crucial in turning the tide on the COVID-19 vaccine propaganda, gaslighting and censorship.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "COVID-19 Vaccine Injured Doctors Are Finally Starting To Speak Up • And They Are Shocked That The Medical Establishment Abandons Them", "description": "Europe Reloaded | Pam Barker\n\nVideo: Laura Ingraham with California Dr. Michael Huang\n\n‘I apologize on behalf of my profession for refusing to listen to patients with vax injuries’ – Dr. Michael Huang, physician who treated 4,000 COVID patients says he’s seen hundreds of COVID-19 vaccine injuries, cancer, pregnancy loss,", "url": "https://www.truth11.com/untitled-884/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/03/Screen-Shot-2023-03-02-at-5.46.20-PM.png", "article:published_time": "2023-03-02T22:46:45.000Z", "article:modified_time": "2023-03-02T22:46:45.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "1194"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://twitter.com/nsjs1234?ref=truth11.com", "https://kanekoa.substack.com/p/twitter-censors-pfizer-injured-israeli?ref=truth11.com", "https://twitter.com/shmuelcshapira/status/1525377945551904768?ref=truth11.com", "https://dailysceptic.org/2022/12/20/top-australian-doctor-reveals-she-is-vaccine-injured-and-says-doctors-are-being-censored/?utm_source=dlvr.it&utm_medium=twitter", "https://www.news.com.au/finance/economy/federal-budget/covid-vaccine-injury-payouts-explode-to-77-million-budget-reveals/news-story/df39fcf430c6cadb487a9914df7a3422?ref=truth11.com", "https://childrenshealthdefense.org/defender/dr-danice-hertz-injured-pfizer-covid-vaccine/?ref=truth11.com", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-5-to-11-year-olds-fda-emergency-use-authorization/?ref=truth11.com", "https://www.ninds.nih.gov/Disorders/All-Disorders/Paresthesia-Information-Page?ref=truth11.com", "https://twitter.com/CWTAIC/status/1545768658114428931?ref=truth11.com", "https://www.europereloaded.com/covid-19-vaccine-injured-doctors-are-finally-starting-to-speak-up-and-they-are-shocked-that-the-medical-establishment-abandons-them/?ref=truth11.com"], "authors": [], "publish_date": "2023-03-02T22:46:45.000Z"}