{"result_id": "320042", "URL": "https://www.truth11.com/untitled-863/", "timestamp": "2023-04-25 17:45:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-863/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "“Turbo Cancer” Post COVID-19 Vaccination", "cleaned_text": "21-Year Old Evan Fishel Died of Leukemia Only Four Days After Diagnosis.\n\nAs an Oncologist, I diagnosed 10,000s of Canadian cancer patients and treated 100s with Targeted Radionuclide Therapy. I have seen many horrific things during my career. But I have never seen a rapid progression like this.\n\nFrom Diagnosis to death in 4 days\n\n21 year old California University student Evan Fishel was graduating from Cal Maritime Academy and was accepted to Berkeley Law School. He died on Feb.10, 2023, 4 days after being diagnosed with Leukemia (click here).\n\nHis University, Cal Maritime Academy had a COVID-19 vaccine mandate and to this day, recommends COVID-19 booster shots based on CDC guidelines (click here).\n\nI never liked the term “turbo cancer”. It doesn’t sound very scientific. However, it is a term that has caught on and is now recognized as a frightening phenomenon following COVID-19 vaccination.\n\nIn November 2021, a small paper was published by Goldman et al: “Rapid Progression of Angioimmunoblastic T Cell Lymphoma Following Pfizer mRNA vaccine booster shot” (click here).\n\nThis image will be familiar to many:\n\nI performed thousands of PET/CT scans like this in Edmonton, Alberta with radio-labeled glucose, to diagnose cancer patients. Other than the normal brain, heart and radioactive urine in the bladder, the rest of the black dots are cancer-filled lymph nodes in the neck, axillae and iliac regions.\n\nThis was a 66 yo man who had 2 Pfizer COVID-19 mRNA vaccines and developed an aggressive lymphoma 6 months later (left image). In preparation for chemotherapy, doctors gave him a Pfizer COVID-19 mRNA booster shot (!!!). Within a few days, the patient reported “considerable swelling of neck lymph nodes”. Fortunately, his doctors wanted another PET/CT scan to have a more precise baseline scan before his chemotherapy, so they did one 8 days after the COVID-19 booster shot.\n\nIn the image on the right, the cancer effectively exploded all over the body, growing and spreading to new groups of lymph nodes in new locations. The authors themselves noted just how abnormal this was:\n\n“First, the dramatic speed and magnitude of the progression manifested on two 18F-FDG PET-CT performed 22 days apart. Such a rapid evolution would be highly unexpected in the natural course in the disease.”\n\n“this is the first observation suggesting that administration of a SARS-CoV-2 vaccine might induce AITL (lymphoma) progression”\n\nThis was the first time that “turbo cancer” following COVID-19 vaccination was caught on a PET/CT scan, and it was purely by chance.\n\nThere was another small study by Zamfir et al. reporting two cases of aggressive lymphoma that developed within a week following Pfizer COVID-19 mRNAvaccination (click here). This study includes some gruesome pictures of these rapidly progressing cancers.\n\nNo one has been able to properly explain these cases. One US surgical oncologist wrote a long article in Dec.2022 claiming that “turbo cancer” doesn’t exist (click here). In his article, he also doesn’t provide any explanation for these shocking cases, and his entire argument rests on a series of faulty assumptions on what the spike protein mRNA can or cannot do.\n\nThe effects of COVID-19 vaccines on the immune system are extremely complex and not fully understood. However, based on several studies I can best summarize it like this:\n\nCOVID-19 vaccines “reprogram” the immune system (click here). This reprogramming alters the normal communication between immune system cells (production of certain cytokines), and it also alters the function and activity of certain immune cells.\n\nAs the authors of another study noted (click here):\n\n“…revealed dramatic alterations in gene expression of almost all immune cells after vaccination”\n\nMIT scientist Stephanie Seneff and Texas Cardiologist Dr.Peter McCullough wrote an article titled “Innate Immune Suppression by SARS-CoV-2 mRNA vaccinations” (click here) which describes complex mechanisms by which mRNA vaccines impair immune system signaling, leading to innate immune suppression:\n\nThere is also a study that suggests that SARS-CoV-2 spike protein strongly interacts with tumor suppressor proteins p53 and BRCA-1/2, potentially turning them off (click here):\n\n“p53 and BRCA are the well-known tumor suppressor proteins, that regulate downstream genes in response to numerous cellular stress and are frequently mutated in human cancer”\n\nIn some people, this immune system “reprogramming” or innate immune system suppression leads to a complete loss of protection against cancer cells arising and spreading rapidly.\n\nRecently, on the “Ask Dr. Drew” show, US pathologist Dr. Ryan Cole showed evidence of the extensive presence of spike protein in lymphoma tumors (view here).\n\nNeedless to say, COVID-19 mRNA vaccine spike protein should not be found in malignant tumours.\n\nThere are many anecdotal reports on twitter from people who describe “turbo cancers” suffered by their family members following COVID-19 vaccination. Most of these seem honest enough to take seriously, but it is clear that doctors are not taking these cases seriously enough.\n\nMy take. Many obituaries now talk about a “brief but courageous battle with cancer”. We need more autopsies with immunohistochemical staining for the spike protein in cases of rapidly progressing cancer, but we will not be getting them anytime soon. Certainly not in Canada.\n\nSo far, doctors are not taking this issue seriously, and by the time they do, it will be far too late for many, and we may have a full blown healthcare catastrophe on our hands.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "“Turbo Cancer” Post COVID-19 Vaccination", "description": "Global Research  /  Dr. William Makis\n\n\n21-Year Old Evan Fishel Died of Leukemia Only Four Days After Diagnosis.\n\nAs an Oncologist, I diagnosed 10,000s of Canadian cancer patients and treated 100s with Targeted Radionuclide Therapy. I have seen many horrific things during my career. But I have never seen a", "url": "https://www.truth11.com/untitled-863/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/Screen-Shot-2023-02-21-at-8.09.03-PM.jpeg", "article:published_time": "2023-02-22T01:10:55.000Z", "article:modified_time": "2023-02-22T01:10:55.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "1169"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://www.gofundme.com/f/evan-fishel-celebration-of-life-expenses-fund?ref=truth11.com", "https://www.csum.edu/alert/covid-19/index.html?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8656165/?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9316988/?ref=truth11.com", "https://sciencebasedmedicine.org/do-covid-19-vaccines-cause-turbo-cancer/?ref=truth11.com", "https://www.medrxiv.org/content/10.1101/2021.05.03.21256520v1?ref=truth11.com", "https://www.nature.com/articles/s41421-021-00329-3?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9012513/?ref=truth11.com", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7324311/?ref=truth11.com", "https://rumble.com/v2862c2-dr.-ryan-cole-shares-terrifying-biopsy-results-which-could-explain-rise-in-.html?ref=truth11.com", "https://www.globalresearch.ca/rapid-turbo-cancer-after-covid-19-vaccination-21-year-old-evan-fishel-died-leukemia-only-4-days-after-diagnosis/5809358?ref=truth11.com"], "authors": [], "publish_date": "2023-02-22T01:10:55.000Z"}