{"result_id": "320035", "URL": "https://www.truth11.com/untitled-118/", "timestamp": "2023-04-25 17:45:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-118/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Pfizer’s “Secret” Report on the Covid Vaccine. Beyond Manslaughter. The Evidence is Overwhelming. The Vaccine Should Be Immediately Withdrawn Worldwide", "cleaned_text": "Prof Michel Chossudovsky and Caroline Mailloux – Lux Media and Global Research May 17, 2022\n\nThe following video interview with Prof. Michel Chossudovsky pertains to the Confidential Pfizer Report released as part of a Freedom of Information (FOI) procedure.\n\nThe report is a bombshell. The vaccine was launched in mid-December 2020. By the end of February 2021, “Pfizer had already received more than 1,200 reports of deaths allegedly caused by the vaccine and tens of thousands of reported adverse events, including 23 cases of spontaneous abortions out of 270 pregnancies and more than 2,000 reports of cardiac disorders.”\n\nThis Confidential Pfizer Report provides data on deaths and adverse events recorded by Pfizer from the outset of the vaccine project in December 2020 to the end of February 2021, namely a very short period (at most two and a half months).\n\nWhat is contained in Pfizer’s “confidential” report is detailed evidence on the impacts of the “vaccine” on mortality and morbidity. This data which emanates from the “Horse’s Mouth” can now be used to confront as well formulate legal procedures against Big Pharma, the governments, the WHO and the media.\n\nVideo Interview with Prof. Michel Chossudovsky on the “Secret” Pfizer Report\n\nAmong all major Big Pharma actors, Pfizer has a criminal record in the U.S.\n\nCan we trust a Big Pharma vaccine conglomerate which pleaded guilty to criminal charges by the US Department of Justice (DoJ) including “fraudulent marketing” and “felony violation of the Food, Drug and Cosmetic Act”?\n\nNational health authorities claim that the Covid-19 “vaccine” will save lives. That’s a lie.\n\nThere is a worldwide upward trend of vaccine deaths and injuries. The latest official figures (April 3, 2022) point to approximately:\n\n69,053 Covid-19 injection related deaths and 10,997,085 injuries for the EU, US and UK Combined for a population of 830 million people\n\nBased on reported cases. Only a small fraction of the victims or families of the deceased will go through the tedious process of reporting vaccine related deaths and adverse events to the national health authorities. Based on historical data (Electronic Support for Public Health–Vaccine Adverse Event Reporting System (ESP:VAERS, p. 6):\n\n“Adverse events from drugs and vaccines are common, but underreported. … less than 0.3% of all adverse drug events and 1-13% of serious events are reported to the Food and Drug Administration (FDA). Likewise, fewer than 1% of vaccine adverse events are reported. (emphasis added)\n\nThis Confidential Pfizer Report released as part of a Freedom of Information (FOI) procedure provides data on deaths and adverse events recorded by Pfizer from the outset of the vaccine project in December 2020 to the end of February 2021, namely a very short period (at most two and a half months).\n\nThe Pfizer BioNTech vaccine was launched in the US on the 14th of December after the granting of Emergency Use Authorization on December 11, 2020.\n\nIn a twisted irony, the data revealed in this “insider report” refutes the official vaccine narrative peddled by the governments and the WHO. It also confirms the analysis of numerous medical doctors and scientists who have revealed the devastating consequences of the mRNA “vaccine”.\n\nWhat is contained in Pfizer’s “confidential” report is detailed evidence on the impacts of the “vaccine” on mortality and morbidity. This data which emanates from the “Horse’s Mouth” can now be used to confront as well formulate legal procedures against Big Pharma, the governments, the WHO and the media.\n\nIn a Court of Law, the evidence contained in this Big Pharma confidential report (coupled with the data on deaths and adverse events compiled by the national authorities in the EU, UK and US) is irrefutable: because it is their data and their estimates and not ours.\n\nBear in mind: it’s data which is based on reported and recorded cases, which constitute a small percentage of the actual number of vaccine related deaths and adverse events.\n\nThis is a de facto Mea Culpa on the part of Pfizer. #Yes it is a Killer Vaccine\n\nPfizer was fully aware that the mRNA vaccine which it is marketing Worldwide would result in a wave of mortality and morbidity. This is tantamount to a crime against humanity on the part of Big Pharma.\n\nPfizer knew from the outset that it was a killer vaccine.\n\nIt is also a Mea Culpa and Treason on the part of corrupt national governments Worldwide which are being threatened and bribed by Big Pharma.\n\nNo attempt has been made by the governments to call for the withdrawal of the killer vaccine.\n\nPeople are told that the vaccine is intended to save lives.\n\nClick here to read the Pfizer report.\n\nAlso see details in the Appendices.\n\nFor details of the report, see Bombshell Document Dump on Pfizer Vaccine Data", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Pfizer’s “Secret” Report on the Covid Vaccine. Beyond Manslaughter. The Evidence is Overwhelming. The Vaccine Should Be Immediately Withdrawn Worldwide", "description": "Tap News  /  Weaver\n\n\nProf Michel Chossudovsky and Caroline Mailloux – Lux Media and Global Research May 17, 2022\n\nThe following video interview with Prof. Michel Chossudovsky pertains to the Confidential Pfizer Report released as part of a Freedom of Information (FOI) procedure.\n\nThe report is a bombshell. The vaccine was launched", "url": "https://www.truth11.com/untitled-118/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2022/05/49BA60D1-CA46-40EE-BBED-5664A3792984.jpeg", "article:published_time": "2022-05-19T11:43:51.000Z", "article:modified_time": "2022-05-19T11:43:51.000Z", "article:tag": "FOCUS ARTICLES", "article:publisher": "https://www.facebook.com/ghost", "image:width": "300", "image:height": "169"}, "tags": ["FOCUS ARTICLES", "VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/author/michel-chossudovsky?ref=truth11.com", "https://www.globalresearch.ca/author/mailloux?ref=truth11.com", "https://www.globalresearch.ca/jaccuse-governments-worldwide-lying-you-people-populations-they-purportedly-serve/5750650?ref=truth11.com", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf?ref=truth11.com", "https://www.biopharma-reporter.com/Article/2020/12/14/US-starts-COVID-19-vaccinations-after-Pfizer-vaccine-authorized?ref=truth11.com", "https://phmpt.org/wp-content/uploads/2021/11/5.3.6-postmarketing-experience.pdf?ref=truth11.com", "https://www.globalresearch.ca/bombshell-document-dump-pfizer-vaccine-data/5763397?ref=truth11.com", "https://www.globalresearch.ca/author/michel-chossudovsky?ref=truth11.com", "https://www.globalresearch.ca/video-pfizers-secret-report-on-the-covid-vaccine-beyond-manslaughter-the-evidence-is-overwhelming-the-vaccine-should-be-immediately-withdrawn-worldwide/5780561?ref=truth11.com", "https://www.thetruthseeker.co.uk/?p=253675&ref=truth11.com", "https://tapnewswire.com/2022/05/pfizers-secret-report-on-the-covid-vaccine-beyond-manslaughter-the-evidence-is-overwhelming-the-vaccine-should-be-immediately-withdrawn-worldwide/?ref=truth11.com"], "authors": [], "publish_date": "2022-05-19T11:43:51.000Z"}