{"result_id": "320022", "URL": "https://www.truth11.com/dr-kaiser-treating-hundreds-of-nurses-for-vaccine-injuriesbecause-these-nurses-cant-get-treated-at-kaiser-because-they-are-gaslighted-by-kaiser-doctors-its-really-tragic/", "timestamp": "2023-04-25 17:44:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/dr-kaiser-treating-hundreds-of-nurses-for-vaccine-injuriesbecause-these-nurses-cant-get-treated-at-kaiser-because-they-are-gaslighted-by-kaiser-doctors-its-really-tragic/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Dr Treating Hundreds Of Nurses For Vaccine Injuries", "cleaned_text": "Why is he treating hundreds of Kaiser nurses for vaccine injuries? It’s because these nurses can’t get treated at Kaiser because they are gaslighted by Kaiser doctors. It’s really tragic.\n\nHe remembers one day when he had 10 vax injured nurses in his office and 9 out of 10 had clinical myocarditis following the COVID vaccine.\n\nMy Twitter post on Michael Huang generated over 1M views in just the first two days:\n\nCheck out this Twitter post with the video:\n\nHuang’s office is at 1301 Secret Ravine Parkway in Roseville. And the parking lot for the Sutter Roseville Cancer Center which is across the street now overflows into his parking area!\n\nThat parking lot used to be nearly empty before the shots rolled out. But the shots are great for the cancer center’s business apparently. Dr. Huang talks about the dramatic increase in cancer patients post-vaccine in the interview. Coincidence?\n\nIf the vaccine is so safe, why is the parking lot now full for the cancer center? Hmmmm…..gotta wonder about that one.\n\nSo when the Cancer Center isn’t releasing their numbers, looking at their parking lot is a way to learn the truth.\n\nInjury rates before vs. after vax\n\nHuang has been practicing for over 20 years. Before the COVID vaccines rolled out, he’d only seen less than 5 vaccine injuries. Now he’s seen thousands.\n\nBut the comparison is unfair because there are so few doctors in California who will see vaccine injured patients.\n\nBut Huang’s point is this. If this were a safe vaccine, he wouldn’t be seeing ANY vaccine injured patients. The very fact he’s seen THOUSANDS is very troubling.\n\nDr. Huang uses Epic but doesn’t know how to do the queries to get the exact stats on his patients. If you are a master of Epic and can instruct him how he can look at his patient data to gather stats, please contact me.\n\nDr. Huang is one of the very few courageous doctors in the US who will see vaccine injured patients and issue mask and vaccine exemptions.\n\nFor helping to save lives, the medical boards have gone after him to try to revoke his license to practice medicine. They want to set an example to others not to defy the government narrative. Huang is forced to pay their legal bills to attack him. So he has to fund his own defense as well as pay the expenses for the medical boards. It’s really a messed up system that nobody wants to fix.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Dr Treating Hundreds Of Nurses For Vaccine Injuries", "description": "Steve Kirsch\n\nWhy is he treating hundreds of Kaiser nurses for vaccine injuries? It’s because these nurses can’t get treated at Kaiser because they are gaslighted by Kaiser doctors. It’s really tragic.\n\nHe remembers one day when he had 10 vax injured nurses in his office and", "url": "https://www.truth11.com/dr-kaiser-treating-hundreds-of-nurses-for-vaccine-injuriesbecause-these-nurses-cant-get-treated-at-kaiser-because-they-are-gaslighted-by-kaiser-doctors-its-really-tragic/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/Screen-Shot-2023-02-26-at-5.30.19-PM.png", "article:published_time": "2023-02-26T22:36:32.000Z", "article:modified_time": "2023-02-26T22:36:32.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "1058", "image:height": "554"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://www.huangmdoffice.com/?ref=truth11.com", "https://stevekirsch.substack.com/p/michael-huang-md-in-california-has?ref=truth11.com"], "authors": [], "publish_date": "2023-02-26T22:36:32.000Z"}