{"result_id": "320040", "URL": "https://www.truth11.com/untitled-865/", "timestamp": "2023-04-25 17:45:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-865/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Canada’s Youngest Athletes, Ages 6-13 Are Dying Suddenly • COVID-19 Vaccine Mandates For Children Playing Sports Were A Crime", "cleaned_text": "Canada’s youngest athletes, ages 6-13 are dying suddenly: COVID-19 vaccines are banned for kids under 18 in Scandinavian countries.\n\nCanadian politicians, Public Health Officials and healthcare leaders committed many serious crimes during the COVID-19 pandemic, but one of the most heinous was the forced COVID-19 mRNA vaccination of healthy child athletes in 2021-2022 so they could continue to play sports. Here are some of Canada’s youngest athletes who died suddenly in the past 3 months.\n\nPresley played football in Regina, Saskatchewan. She died suddenly on Jan.13, 2023.\n\nAs reported by the Regina Leader-Post:\n\n“Presley was introduced to the Regina Victorias — Regina Minor Football’s first all-female team. As a second-year defensive back with the Victorias, Presley helped her team win the 2022 Prairie Girls Football League championship on Oct. 27.\n\nAt the Victorias’ awards banquet, held in November, Presley was named the team’s most improved player. Presley was part of the youngest age group when she joined the Victorias in 2021, as a Grade 7 student. The oldest players are in Grade 12.\n\n“She would go up to the coaches and say, ‘Put me in. I’m not scared,’ ” Rod Wilchuck remembers.\n\nJeremy was a hockey player in Sainte-Martine, Quebec. He died suddenly on January 3, 3023. A local newspaper reports: “the young boy was passionate about hockey”\n\nSlade was a hockey player from Calgary, Alberta. He died suddenly on Nov.29, 2022. A statement from the family reads:\n\n“Slade passed away suddenly after just a four day illness and his sweet little heart just couldn’t take it.”\n\n“Ayla was an accomplished equestrian who loved her poly Holly and horse Titanium”\n\nShe developed flu-like symptoms on Nov.26, 2022, was sent home from emergency and died three days later from complications of Strep A infection (click here).\n\nAyla’s family expressed concerns about the medical care that she received\n\n“The family has raised questions about why Ayla was not put on antibiotics earlier”\n\n“Nothing seemed urgent enough until it was too late.”\n\nDanielle lived in Richmond, British Columbia. She was a hockey player, a member of the Richmond Ravens U7 girls hockey team. She died suddenly on Nov.26, 2022\n\n“According to an Instagram post by dad Denis Cabana, Danielle had caught the flu at the same time as her sisters around Remembrance Day.\n\nDanielle was taken to the hospital last Wednesday when she appeared to be still fighting the flu after her sisters had recovered. She was soon moved to the ICU where she was diagnosed with myocarditis due to the flu.\n\nShe subsequently received two heart procedures and began to breathe on her own last Saturday, but ultimately passed away after suffering a “massive stroke.”\n\nEric was a hockey player who lived in Calgary, Alberta (click here).\n\n“A natural athlete, Eric played several sports but his focus was hockey and golf”.\n\n“Eric Homersham, a Grade 8 student student at West Island College, died Nov.9 after collapsing at a school basketball tryout.”\n\n“Eric, the youngest of three siblings, had been with the southeast Calgary youth Wolverines Hockey Club for eight years, joining the program as a Timbit in 2014. He started with the U15 Division 1 team this season.”\n\nI believe COVID-19 mRNA vaccines severely damage the immune systems and hearts of young children. This damage may take 6-12 months to fully manifest.\n\nNot surprisingly, Canadian health authorities are trying to pretend these sudden deaths of Canada’s youngest athletes are not happening.\n\nHowever, they can only ignore this serious problem so long.\n\nThe graphs below show 2-dose mRNA uptake on the left and booster mRNA uptake on the right, as percentage of all Canadian children ages 5-11, and 12-17.\n\nThe Canadian government stopped publishing these graphs in January 2023.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Canada’s Youngest Athletes, Ages 6-13 Are Dying Suddenly • COVID-19 Vaccine Mandates For Children Playing Sports Were A Crime", "description": "Europe Reloaded\n\nPam Barker\n\nCanada’s youngest athletes, ages 6-13 are dying suddenly: COVID-19 vaccines are banned for kids under 18 in Scandinavian countries.\n\nDr. William Makis MD\n\nCanadian politicians, Public Health Officials and healthcare leaders committed many serious crimes during the COVID-19 pandemic, but one of the most heinous", "url": "https://www.truth11.com/untitled-865/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/Screen-Shot-2023-02-23-at-7.28.56-AM.png", "article:published_time": "2023-02-23T12:31:43.000Z", "article:modified_time": "2023-02-23T12:32:44.000Z", "article:tag": "FOCUS ARTICLES", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2522", "image:height": "1644"}, "tags": ["FOCUS ARTICLES", "VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://infotel.ca/newsitem/celebration-of-life-for-west-kelowna-girl-who-died-from-flu-complications/it95629?ref=truth11.com#:~:text=Ayla%20Grace%20Loseth%20was%20taken,aunt%20Katie%20told%20iNFOnews.ca.", "https://www.evanjstrong.com/obituary/Eric-Homersham?ref=truth11.com", "https://makismd.substack.com/p/canadas-youngest-athletes-ages-6?utm_source=cross-post&publication_id=1385328&post_id=104551885&isFreemail=true&utm_campaign=956088&utm_medium=email", "https://www.europereloaded.com/canadas-youngest-athletes-ages-6-13-are-dying-suddenly/?ref=truth11.com"], "authors": [], "publish_date": "2023-02-23T12:31:43.000Z"}