{"result_id": "320036", "URL": "https://www.truth11.com/the-truth-about-vaccine-genocide-is-not-misinformation-or-hate-speech-an-obvious-attempt-to-cover-up-genocide/", "timestamp": "2023-04-25 17:45:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/the-truth-about-vaccine-genocide-is-not-misinformation-or-hate-speech-an-obvious-attempt-to-cover-up-genocide/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "The Truth About Vaccine Genocide Is Not \"Misinformation\" • An Obvious Attempt To Cover Up Genocide That The Covid Karens Will Get Behind To Hide From The Truth", "cleaned_text": "Despite a billion dollar campaign of lies to hide vaccine genocide, the big picture, bottom line truth, still remains clear as day and has not wavered since the beginning of this global war on humanity: There was no pandemic and they have committed genocide by vaccine.\n\nGovernments world wide are trying to hide this truth by calling it \"misinformation\".\n\nThis strategy seems pathetic to us who know the truth, but for the genocidal maniacs, covid Karens and vaccine suicidal idiots it is a possible way out.\n\nCovid karens and Uber vaxxed are not rational or critical thinkers. After 3 years of oxygen deprivation from psychotic mask wearing, 5 toxic jabs causing clots throughout their brains, changing their personality and worse; do you think any of them have enough brain cells left to see this obvious ploy? \n\n\n\nMany are still in full denial, and are tired from doing mental gymnastics trying to avoid the fact they were wrong to get a damaging and deadly vaccine. They are looking for a way out, and \"misinformation' may be it.\n\nIt allows them, even at this late stage, to pretend the truth we have been telling them is incorrect and they will beg for censorship against this menace \"misinformation\" aka the truth.\n\n\"Hate speech\" is another term they relate to as they feel hate may be coming their way for their past covid zeal and vaccine murder thirst.\n\nAs pathetic as it is, they will promote and rally behind this false narrative just like they did with every other covid lie, all just as ridiculous as this.\n\nThe sad thing is, if the vaccinated did figure it out they made a mistake being a covid Karen vaccine conformist cheerleader, they could try to save themselves by detoxing the vaccine. But instead they will call for the end of free speech to save themselves from the truth.\n\nWe must continue to help the brain injured masses see the truth. I know it is extremely exhausting as they are still holding out, and yelling at us for trying to help them.\n\nMost of my family and old friends labeled my advice and warnings as a crazy conspiracy theorist. I sent a personal email to every single person I have ever known in April of 2020, warning them not to get the vaccine and why. I was ignored by most friends and family and ridiculed. My father completely cut me off and told me not to speak to him again.\n\nMy father admitted on his death bed he knew I was trying to help him, and that the vaccine had caused his stroke, turbo cancer and then killed him.\n\nHe was the only one who would admit it. It took his death to do so.\n\nNot one other person, has admitted they were wrong, or that the vaccine is killing people. Not one has thanked me or apologized for attacking me, or for cutting me out of their lives for trying to help them.\n\nI am not alone. I am sure you all have experienced this same treatment. As the video below shows, so has Rosanne Barr.\n\nPersonally I still have patience for the deluded masses. They know not what they do. We must rise above their behaviour and provide them with truth, love and support. Even though they spit in our faces, still.\n\nWe are not them, thankfully.\n\nLet us remind them of the truth as simply as we can:\n• The flu completely disappeared and the same number of people died of the new rebranded term Covid, than in previous years due to the flu.\n• There were no excess deaths in 2020.\n• No person has ever proven Covid to exist as an identifiable virus, anywhere in the world.\n\n= There was no pandemic.\n• Lockdowns and masks were about control of the people, not a fictitious virus.\n\n= A deliberate violation of our rights and destruction of our economies.\n• The vaccine was introduced in late 2020. It has injured and killed millions of people around the world.\n• Excess injuries, disabilities and sudden deaths continue to increase in the vaccinated.\n• Knowing this they are still vaccinating people with the deadly clot shots.\n• Our governments are still denying the vaccine is causing excess deaths.\n• Doctors are ignoring the vaccine injured and not treating them properly, blaming everything but the vaccine.\n• And now they are focusing on the terms \"misinformation\" and \"hate speech\" as a pathetic excuse for silencing the truth about vaccine genocide.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "The Truth About Vaccine Genocide Is Not \"Misinformation\" • An Obvious Attempt To Cover Up Genocide That The Covid Karens Will Get Behind To Hide From The Truth", "description": "Dylan Eleven • Truth11.com\n\nDespite a billion dollar campaign of lies to hide vaccine genocide, the big picture, bottom line truth, still remains clear as day and has not wavered since the beginning of this global war on humanity:     There was no pandemic and they have committed genocide by vaccine.", "url": "https://www.truth11.com/the-truth-about-vaccine-genocide-is-not-misinformation-or-hate-speech-an-obvious-attempt-to-cover-up-genocide/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/Screen-Shot-2023-01-18-at-10.23.13-AM-2.png", "article:published_time": "2023-02-24T23:32:37.000Z", "article:modified_time": "2023-02-25T00:46:14.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "1536", "image:height": "1264"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2023-02-24T23:32:37.000Z"}