{"result_id": "320012", "URL": "https://www.truth11.com/cdc-confirms-that-majority-of-fatal-covid-vaccines-were-knowingly-sent-to-red-states/", "timestamp": "2023-04-25 17:44:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/cdc-confirms-that-majority-of-fatal-covid-vaccines-were-knowingly-sent-to-red-states/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "CDC Confirms That Majority of Fatal Covid Vaccines Were Knowingly Sent to Red States", "cleaned_text": "Last year, we published a report entitled, “Evidence that US Government Targeted Red States with Deadly Batches of Vaccine”, a story that most outlets ignored.\n\nPrivate leaked documents from the CDC show a list of expiry dates and only certain lots are included.\n\nThe very same lots found to be highly toxic in Paardekooper’s database.\n\nThis mode of deployment allows government the ability to direct deadly batches into specific populations, such as Red States.\n\nAnalysis of the number of dying per 100,000 vaccinated in 50 states shows us that the overwhelming majority of vaccine deaths are happening in Red States. [1.]\n\n2nd Smartest Guy in the World on Substack also reported on it and has recently published an update, writing that, “Now, we have a more robust and far-more damning view of this carefully distributed depopulation scheme.”\n\nBack in October of 2021, The Éxposé publishes a report on data found in the USA’s VAERS (Vaccine Adverse Event Reporting System), which reveals that 100% of COVID-19 vaccine deaths had been caused by just 5% of the batches – batches that can be identified.\n\nAnd these deadly batches were not distributed evenly. The top 8 states with the highest vaccination death rate, Kentucky, Arkansas, West Virginia, Montana, Alaska, North Dakota, Wyoming and Tennessee are all Red States.\n\n19 of the top 24 on the list are Red States and California has been the least affected by the deadly lots of COVID vaccine.\n\n“The numbers show that Kentucky has a 1,900% worse vacination death rate than the Democrat-controlled California, suggesting the Republican state received 20 times the amount of deadly batches of COVID-19 vaccine than the Democrat-controlled state received.”\n\nFlorida, number 20 on the list of most vaccine deaths per vaccination received three times the amount of deadly batches than California, with its vaccination death rate at 200% higher than California’s.\n\nThe author points out that these deadly batches would be better classified as “rapid kill lots” and “slow kill lots”, as we are now seeing more evidence that they kill over time.\n\nAnd the evidence shows that Red States were targeted with the Rapid Kill Shots. This would go along with the United Nations Agenda 2030 plan, which seeks to move the entire population into crowded cities and federalize all of Flyover Country in the name of Climate Change.\n\nThey have less than 7 years to accomplish this and they are deadly serious about it. The US Government is in lockstep with the United Nations and they will resort to murder and democide to accomplish their goals of total control.\n\nMany are suggesting that this is what is happening in East Palestine, Ohio right now.\n\nThe people of America are under attack by their own government, who is never going to quit until they accomplish their goals or unless they are stopped.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "CDC Confirms That Majority of Fatal Covid Vaccines Were Knowingly Sent to Red States", "description": "Paul Craig Roberts\n\nThe latest video by Greg Reese.\n\n\n\nTRANSCRIPT\n\nLast year, we published a report entitled, “Evidence that US Government Targeted Red States with Deadly Batches of Vaccine”, a story that most outlets ignored.\n\nPrivate leaked documents from the CDC show a list of expiry dates and only certain", "url": "https://www.truth11.com/cdc-confirms-that-majority-of-fatal-covid-vaccines-were-knowingly-sent-to-red-states/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/03/Screen-Shot-2023-03-01-at-6.33.53-PM.jpeg", "article:published_time": "2023-03-01T23:35:45.000Z", "article:modified_time": "2023-03-01T23:35:45.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "2000", "image:height": "1190"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://www.2ndsmartestguyintheworld.com/p/cdc-confirms-100-of-reported-covid?ref=truth11.com", "https://howbad.info/cdcexpiry3.pdf?ref=truth11.com", "https://howbad.info/states.html?ref=truth11.com", "https://www.paulcraigroberts.org/2023/03/01/cdc-confirms-that-majority-of-fatal-covid-vaccines-were-knowingly-sent-to-red-states/?ref=truth11.com"], "authors": [], "publish_date": "2023-03-01T23:35:45.000Z"}