{"result_id": "320038", "URL": "https://www.truth11.com/untitled-187/", "timestamp": "2023-04-25 17:45:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/untitled-187/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Health Canada is hiring for the Centre for Immunization Surveillance", "cleaned_text": "Truth Unmuted / Jesse Smith\n\n\n\nHealth Canada has confirmed to The Counter Signal that they are hiring for the Centre for Immunization Surveillance as part of the Vaccine Rollout Task Force, which will gather the health data of millions of Canadians across the country.\n\nAccording to an email sent by Health Canada’s media relations team, the Centre for Immunization Surveillance is an organizational component within Vaccine Rollout Task Force that is looking to hire epidemiology candidates skilled in economics and social science (EC) data collection.\n\nThe Counter Signal was notified of the internal job postings, many of which come with an over six-figure price tag and are open to the Canadian Armed Forces, late last week after journalist Andy Lee was contacted by a follower possibly employed by Health Canada.\n\nHealth Canada lists four levels for which they’re hiring.\n\nThose at the highest level (EC-07) are expected to manage teams and have “experience with the operation of surveillance systems at the national level.” They should also have experience developing and maintaining national collaborative networks at the federal or provincial level on surveillance and be able to conduct quantitative epidemiologic data analysis.\n\nHealth Canada adds that “The conditions of employment for the opportunities include a “Secret” level security clearance and full vaccination against COVID-19 unless accommodated based on a medical, religious or other prohibited ground.”\n\nThose listed as EC-04 and EC-06 should have experience conducting epidemiologic or bio-statistical research, surveys and analysis. Those in the former level should also be adept in their methodology and capable of creating statistical quality control procedures and computer programs, while those in the latter group need to be good at working in teams and proposing future projects.\n\nThose listed as EC-05 are expected to have experience in planning, designing, and conducting recurring and non-recurring epidemiological, bio-statistical and statistical analyses and surveys and recommend the nature, scope and objectives of studies, analyses and surveys.\n\nAccording to Health Canada, “The Vaccine Rollout Task Force (VRTF) is a Branch within the Public Health Agency of Canada which is headed by an executive-level Vice-President. The VRTF has identified a variety of staffing needs and recently launched several Expressions of Interest for at-level temporary assignment opportunities (as seen in the screenshot).”\n\nWhile Health Canada did not provide details on what kinds of projects members of the Centre for Immunization Surveillance or VRTF will undertake, the agency’s actions throughout the pandemic may indicate what the federal government plans to continue to do.\n\nAs previously reported by The Counter Signal, as part of their pandemic response, the Public Health Agency of Canada contracted tech company BlueDot to take Canadians’ mobile phone data and prepare supposedly anonymized reports to understand how Canadians were travelling.\n\nThe scope of these reports is vast and included when Canadians visited family members or friends, went to the grocery store or LCBO, travelled between towns and provinces, and likely everywhere else. It also tracked how long Canadians spent at each location, reports the Canadian Press.\n\n“Questions remain about the specifics of the data provided if Canadians’ rights were violated, and what advice the Liberal government was given,” said Alberta MP Damien Kurek.\n\nIndeed, many on the ethics committee say they were shocked at the breadth of the reports given, which were nearly all-encompassing, detailed personal behavioural profiles, though names, phone numbers, and addresses were not attached to the profiles.\n\nThe Public Health Agency argued that collecting the data was “not about following individuals’ trips to a specific location, but rather in understanding whether the number of visits to specific locations have increased or decreased over time.”\n\nBlueDot CEO Kamran Khan also said that his company isn’t interested in Canadians’ individual movement or behaviour and that all profiles were not attributed to a name or person.\n\n“None of the information ever includes demographic information or specific identifiers or anything like a name, telephone number, email or address,” he said.\n\n“The data and analysis that we do provide are indicators: statistical summaries of anonymous device information, such as the total number of devices travelling between two cities.”\n\nAs per Health Canada’s website, other duties of the Centre for Immunization Surveillance will likely include the following:\n• Continuously monitoring the safety of marketed vaccines in Canada\n• Identifying increases in the frequency or severity of previously identified vaccine-related reactions\n• Identifying previously unknown adverse events (PDF) following immunization that could possibly be related to a vaccine (unexpected AEFI)\n• Providing timely information on AEFI reporting profiles for vaccines marketed in Canada that can help inform immunization-related decisions\n\nNow that the pandemic is essentially over, with cases dropping precipitously and travel restrictions around the world ending, it isn’t clear why Health Canada and the federal government feel it’s necessary to continue collecting Canadians’ health data for statistical analysis.\n\nIt could be that the government is anticipating a new viral outbreak in the near future. Or it could be that the government is preparing to launch a new COVID campaign to administer the up to 100 million COVID vaccines that Moderna’s new Quebec facility will begin producing as soon as 2024.\n\nEither way, it appears that, unlike vaccine efficacy, Canada’s health and safety obsession isn’t going to wane any time soon.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Health Canada is hiring for the Centre for Immunization Surveillance", "description": "Truth Unmuted  /  Jesse Smith\n\nHealth Canada has confirmed to The Counter Signal that they are hiring for the Centre for Immunization Surveillance as part of the Vaccine Rollout Task Force, which will gather the health data of millions of Canadians across the country.\n\nAccording to an email sent by Health", "url": "https://www.truth11.com/untitled-187/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2022/06/FE684B2B-FE6A-4356-9074-B7C536033C5A.jpeg", "article:published_time": "2022-06-02T21:29:42.000Z", "article:modified_time": "2022-06-02T21:29:42.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "1280", "image:height": "720"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://thecountersignal.com/trudeau-spied-on-canadians-throughout-the-pandemic/?ref=truth11.com", "https://bluedot.global/?ref=truth11.com", "https://www.ctvnews.ca/canada/canadians-trips-to-liquor-stores-pharmacies-tracked-via-phones-during-pandemic-1.5890563?cid=sm%3Atrueanthem%3A%7B%7Bcampaignname%7D%7D%3Atwitterpost%E2%80%8B&taid=62743752b2a94c00017ddbf5&utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=twitter", "https://www.canada.ca/en/public-health/services/immunization/canadian-adverse-events-following-immunization-surveillance-system-caefiss.html?ref=truth11.com", "https://thecountersignal.com/less-than-10-per-cent-got-covid/?ref=truth11.com", "https://thecountersignal.com/greece-scraps-vaccine-passport/?ref=truth11.com", "https://montreal.ctvnews.ca/moderna-montreal-factory-will-make-canada-an-mrna-leader-says-trudeau-1.5881671?ref=truth11.com", "https://thecountersignal.com/ontario-covid-death-rate-among-vaccinated-surpasses-unvaccinated/?ref=truth11.com", "https://truthunmuted.org/the-counter-signal-health-canada-is-hiring-for-the-centre-for-immunization-surveillance/?ref=truth11.com"], "authors": [], "publish_date": "2022-06-02T21:29:42.000Z"}