{"result_id": "320003", "URL": "https://www.truth11.com/kelly-slater-a-staunch-critic-of-the-experimental-covid-vaccine/", "timestamp": "2023-04-25 17:44:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/kelly-slater-a-staunch-critic-of-the-experimental-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Kelly Slater Discussing The Deadly Covid Vaccine", "cleaned_text": "Kelly Slater, the legendary surfer from Cocoa Beach, Florida, has revealed that his mother suffered an adverse reaction to the Pfizer shot.\n\nSlater along with former World No. 4 Australian tennis player Pat Cash joined in the Hoody’s Athletes with Voices series, where they talked about “environmental lockdowns” (minor restrictions imposed by governments to reduce emissions) and “Smart Cities.”\n\nThe two global legends were labeled by mainstream media in Australia as “cooker” – an Australian slang term for conspiracy theorists.\n\nLast year, the legendary surfer called out the Aussies for their insane COVID-19 vaccination policies. Slater is a staunch critic of the experimental COVID vaccine.\n\n“Maybe Stockholm Syndrome can now change its name to Melbourne/Australia Syndrome,” wrote an irritated Slater.\n\nDuring the discussion, Slater criticized big pharma, saying that many individuals he knew had died after receiving the experimental vaccine.\n\n“A number of people I know died. I know a doctor who stopped administering in Australia because two or three of his patients died on the Sunshine Coast.”\n\nSlater revealed that his mother suffered transverse myelitis, a neurological disorder caused by inflammation of the spinal cord, after receiving the Pfizer shot. He also said that his mother’s friend is now slowly dying from the adverse reaction to the vaccine.\n\n“My mom was personally affected. She lost feeling in her jaw and tongue and in her hands and feet. She has what seems to be some type of transverse myelitis.”\n\n“My friend’s mother from Barbados is in the hospital right now in Florida and she’s dying slowly from the effects of the Pfizer vaccine. She’s on a quick dark, downward spiral and they don’t know how to fix it.”\n\nSlater expressed concern that the once-great western countries are headed down a dangerous authoritarian path.\n\n“It’s baffling to me that anyone would be forced to have a vaccine to keep their career, their job, their schooling, their place in society, their ability to go buy food in the store, all these things, it’s like a dystopian society to me. And I don’t think people realize that because it comes on in small waves and get you conditioned to being okay with this and then this and then this and then this rule.”\n\nSlater is opposed to making the shot mandatory, especially for those who choose not to have it.\n\n“Man, it’s wild, but if you want the vaccine go get it. That’s fine. I’d rather you not because if something did happen, you can’t really reverse it, but force it onto me or my loved ones and don’t make me out to be a bad person because of it. ‘Cause if it works then you’re fine and you shouldn’t worry about me.”", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Kelly Slater Discussing The Deadly Covid Vaccine", "description": "The Gateway Pundit  /  Jim Hoft\n\n\n\n\nKelly Slater, the legendary surfer from Cocoa Beach, Florida, has revealed that his mother suffered an adverse reaction to the Pfizer shot.\n\nSlater along with former World No. 4 Australian tennis player Pat Cash joined in the Hoody’s Athletes with Voices series, where they", "url": "https://www.truth11.com/kelly-slater-a-staunch-critic-of-the-experimental-covid-vaccine/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/02/kelly-slater-1.jpg", "article:published_time": "2023-02-17T21:04:10.000Z", "article:modified_time": "2023-02-17T21:04:10.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "1600", "image:height": "990"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Surf Legend Kelly Slater discussing his mother's and friends 𝙐𝙣𝙛𝙤𝙧𝙩𝙪𝙣𝙖𝙩𝙚 Vaccine 𝘾𝙤𝙞𝙣𝙘𝙞𝙙𝙚𝙣𝙘𝙚𝙨....🔥 <a href=\"https://t.co/ZNQ7ICrLSN?ref=truth11.com\">pic.twitter.com/ZNQ7ICrLSN</a></p>— 𝙍𝙄𝙎𝙀𝙈𝙀𝙇𝘽𝙊𝙐𝙍𝙉𝙀 (@Risemelbourne) <a href=\"https://twitter.com/Risemelbourne/status/1624910105052598273?ref_src=twsrc%5Etfw&amp;ref=truth11.com\">February 12, 2023</a></blockquote>\n \n"], "movies": [], "links": ["https://t.co/ZNQ7ICrLSN?ref=truth11.com", "https://twitter.com/Risemelbourne/status/1624910105052598273?ref_src=twsrc%5Etfw&ref=truth11.com", "https://www.thegatewaypundit.com/2023/02/american-surfer-legend-kelly-slater-reveals-mother-suffered-adverse-reaction-pfizer-shot-video/?ref=truth11.com"], "authors": [], "publish_date": "2023-02-17T21:04:10.000Z"}