{"result_id": "320007", "URL": "https://www.truth11.com/covid-19-vaccine-vaccine-induced-psychosis/", "timestamp": "2023-04-25 17:44:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/04/TRUTH11.COM-Web-Icon-1.png", "canonical": "https://www.truth11.com/covid-19-vaccine-vaccine-induced-psychosis/", "encoding": "utf-8"}, "image": null, "domain": "www.truth11.com", "title": "Covid-19 Vaccine Vaccine Induced Psychosis", "cleaned_text": "Brain fog, anxiety and ‘vaccidents’ – the gift of modern medicine \n\n\n\nI don’t know what you see each day on the roads. I am amazed at how many walls are being knocked down, sign posts demolished and even lamp posts bent over. It was rare to see such things pre-CVD. A young man was killed not far by two lorries racing in the early hours using both lanes of the road leaving him nowhere to go (A5 near Nesscliffe). It seems as if traffic has sped up or maybe I’m simply getting slower. Yet what of all the knocked over street furniture – almost a daily occurrence? Is there a cause. This article from Dr Mercola seems to suggest there might be. It fits what I am seeing very well. Reading the cases below, the common factor is they have their perception changed by the you know what. I have seen personality changes in friends – from optimistic and care free to stressed and anxious. It’s sad to see. Yet we must bear up….\n\nCOVID-19 vaccines can significantly impact mental health. Family members have reported brain fog, mood changes, personality changes, hostility and anger, erratic driving, confusion and more. Sometimes, the impact on mental health is catastrophic.\n\nHere are 13 cases that will give you a new perspective on what COVID-19 vaccines can do to the mental health of a person with no prior psychiatric history.\n\nA 31-year-old, single Hispanic man without past medical or psychiatric history, was brought to emergency by police because of erratic and bizarre behavior (Reinfeld et al.)\n\nHe was found to be anxious, guarded, superficial and grandiose. He reported becoming ‘clairvoyant’, being able to talk with dead people, hearing ‘people drumming outside his house’ and the constant voice of a co-worker whom he believed to be a paramour, but was not.\n\nAll these symptoms began one month ago, after receiving the first dose of Moderna COVID-19 vaccine, and markedly worsened three weeks later after receiving the second dose. Previously, he was working full-time as an office manager.\n\n45 yo woman with no psychiatric history, presented to psychiatry after having psychosis for 3 months. (Alphonso et al.)\n\nHer new-onset paranoia and auditory hallucinations began 1 month after receiving her second Moderna COVID-19 vaccine. She abruptly quit her job of 18 years and stopped eating—losing 56 lb in 4 months.\n\nThe patient would only get dressed in the dark, believing people could see her in her closet or bathroom behind a closed door. She would pace all day and stopped doing the household chores she had done for years.\n\nShe would wake her husband in the middle of the night trying to convince him that the neighbors were going to hurt her and were breaking into their home. She became angry when he tried to convince her these things were not real. Due to this irrational fear, she would sleep only 2 to 3 hours per night and no longer slept in the bedroom, preferring to lock herself in the bathroom to sleep.\n\nShe heard whispers of people talking about her and would carry on full conversations with them. She would only do this in a room alone with the door closed. Family would ask her who she was talking to, and she would become angry.\n\nA 37 yo Japanese man with no psychiatric history had Moderna booster shot and complained of headache, a floating sensation and difficulty concentrating. (Kita et al)\n\nHe presented 4 days later with talkativeness, and grandiose delusions, saying that he had won 2 billion yen in horse racing. He also presented with emotional instability, such as crying, sleeplessness, excitement, hyperactivity and sexual deviance.\n\nHe was discharged. Nine days after Moderna booster he jumped from the 2nd floor of his house, and was brought back to hospital by ambulance. He exhibited flight of ideas, hyperactivity, distraction, hyperthymia and religious delusions, such as saying “my child is God”. He displayed lack of insight and became enraged when his actions were restricted.\n\nHe was diagnosed with acute mania with psychotic features and stayed 66 days in the hospital.\n\n42 yo man with no psychiatric history was admitted to psychiatric emergency 5 days after 1st dose of Pfizer with complaints of irritability and sleeplessness. (Yesilkaya)\n\nThe patient had delusions that his family was being followed by the deep state and that they were in danger.\n\nAt clinical examination, his speech output, speed as well as psychomotor activity were increased. The patient’s affect was anxious and mood was dysphoric. He exhibited a loosening of associations, described persecutory and reference delusions and displayed a lack of insight. The Young Mania Rating Scale (YMRS) score was 45.\n\nAt the routine psychiatric evaluation 15 days after discharge, the patient declared that he was unable to remember the initiation of psychiatric symptoms.\n\n45 yo Latvian man with no psychiatric history presented 1 month after 2nd dose of mRNA vaccine, accompanied by his parents because of bizarre behavior and an attempted suicide by hanging in the early morning. (Renemane et al.)\n\nImmediately after his 2nd mRNA dose, he developed insomnia, unreasonable anxiety and tremor.\n\nAfter 2 weeks, he realized that he has been jinxed as he found some white powder under the carpet in his apartment. From that moment, he became cautious, did not leave the apartment, and reported persecution.\n\nOn the last day before his visit to the psychiatric clinic, the patient saw a man walking past the windows of his apartment and watching him. The patient described the thoughts in his head as not his own, giving him commands to observe the person on the street. He did not sleep that night and had a strong belief that he should commit suicide. He attached a rope, tried to hang himself, but his father stopped him.\n\nIn psychiatric department, he was found to be emotionally withdrawn, immersed in his experiences, hypomimic (he sat in one position, spoke very quietly, did not actively participate in the conversation, answered questions in monosyllables or in short sentences after a long pause). He was disoriented to time and reported he was full of fear. He was hospitalized for 4 weeks.\n\n20 yo woman presented to ER with urinary frequency, anxiety, insomnia and a fixation that she suffered from irritable bowel and kidney disease 1 week after 1st dose of Pfizer (Flannery et al.)\n\nShe displayed waxing and waning hypochondriacal delusions that she had contracted COVID-19 and that “her body was shutting down.” The patient was also noted to have some motor dysfunction and a transient bout of aphasia.\n\nShe also had accusatory auditory hallucinations but denied suicidal or homicidal ideation. She was kept overnight. The following morning the patient removed her clothing and had a bowel movement on the floor. She was admitted and put on medication, but became increasingly psychotic, then had a grand mal seizure and was admitted to ICU.\n\nShe also exhibited symptoms of ongoing catatonia, answered questions in short sentences in a monotonous tone with low phonation. She could ambulate, but slowly and with a one-person assist mainly to aid with initiation of movement.\n\nShe was diagnosed with autoimmune encephalitis and spent 45 days in the hospital.\n\n38 yo Brazilian woman with no psychiatric history, developed fever, shivering and myalgia 24hr after 1st Pfizer dose. Within a week she became agitated and did not recognize relatives. (Neves et al.)\n\nShe became aggressive, and presented disheveled with poor hygiene, unfriendly face, lacking self-orientation and refusing to talk to staff and uncooperative with doctors. Her thought was delusional. She believed staff were persecuting her, that several city mayors were her parents. Her mood was dysphoric and enraged.\n\nShe was put on psychiatric medications but didn’t improve. After 6 months of hospitalization, she remained hostile, persecutory and refusing to talk to staff and her psychosis was defined as refractory. She never recovered.\n\n15 yo Taiwanese boy with no psychiatric history presented to ER with agitation, involuntary limb stretching and screaming 2 days after 2nd dose of Pfizer (Yen-Li Lien et al.)\n\nAfter admission, he was observed to demonstrate bizarre behaviors, including sitting up and lying down frequently and taking up the mannerism of praying in bed.\n\nWe also noted auditory hallucinations and delusions. After discharge, his hallucinations and bizarre behavior persisted for > 1 month, requiring additional treatment with steroids.\n\nCase 9: 51 yo Caucasian man, married with kids, has psychosis after AstraZeneca\n\nThe patient had his first dose of AstraZeneca COVID-19 vaccine in mid March 2021. (Roberts et al.)\n\nTen days later, his wife observed that he was becoming confused, with a significant change in his behavior. He was taken to the emergency department of the local general hospital by ambulance after he stopped eating, drinking and communicating.\n\nHe was confused and disoriented in time and place. His communication ranged from speaking in short sentences, sometimes whispering or mumbling to being completely mute. He was thought disordered. When he was given some paper to write down his thoughts, he was unable to write anything meaningful and was drawing lines only.\n\nHe stated that he was hearing voices, both male and female, saying the word ‘Covid’ to him, but he could not elaborate any further. His mood was labile and informed his behavior, which was bizarre and at times very disinhibited.\n\nOn one occasion he was incontinent of urine.\n\n18 female student with no psychiatric history was brought to emergency by family members for irrelevant talk and bizarre behavior. (Grover et al.)\n\nShe received her first dose of the vaccine, and within 2–3 h she developed high grade fever with chills, and multiple episodes of loose stools. These symptoms were followed by dizziness and one episode of fall.\n\nAs per family members fever subsided the next day, but patient reportedly started to remain anxious. She was not able sleep at night, frequently woke-up, appeared fearful and would appear to be staring in between. She would keep on pacing around and would appear distressed. Over the next 3 to 4 days, she started to remain irritable, talk irrelevantly, try to run away from home, voiced delusions of persecution and reference, and reported visual hallucinations of seeing Gods and demons.\n\nIn view of the continued symptoms and emergence of catatonia in the form of mutism, staring, rigidity and negativism, she was started on lorazepam.\n\n22 yo woman of Middle Eastern origin presented to hospital with 3 week history of frontal headache and fatigue a few days after 2nd dose of AstraZeneca. (Takata et al.)\n\nSymptoms did not respond to tylenol and progressed to a two-day history of confusion and hallucinations (visual and tactile). She reported seeing “disco balls” and experiencing someone touching her skin.\n\nShe was alert but disorientated to time, person and place, and agitated with a labile affect; she complained of auditory and visual hallucinations – for example, that the room was on fire – and delusions that were often hyper-religious in nature. She was also seen to be gesturing to the air as if responding to unseen stimuli.\n\nAfter discharge from hospital, her family report that she has not recovered back to her pre-morbid state. She is quieter and more withdrawn now, and still has residual psychotic symptoms of occasionally seeing green lights and praying more than before.\n\n45 yo Croatian man developed unusual behavior 5 days after AstraZeneca. He became anxious, suspicious, paranoid, disorganized and complained of headaches. (Borovina)\n\nTwo weeks after COVID-19 vaccination, persecutory delusions and delusions of reference led him to suicide attempt by stabbing himself in the abdomen.\n\nHe had surgery and spent 23 days in the hospital.\n\n46 yo single mother and teacher was brought to ER by her daughter with complaints of muttering to herself, decreased sleep and appetite, hearing the voice of her husband who died 15 years back and fearful that something might happen to her and her daughter (Krishna et al.)\n\nOn repeated asking why this may happen, she explained that her husband’s voice is telling her that they would die of an accident and this would happen in the near future. Her family members noticed that she started to mutter to herself, her personal care was reduced, she stopped going to her work, and mostly preferred to stay at home for the past 20 days.\n\nThese symptoms started after 3 days of receiving the second dose of the Covishield (AstraZeneca) vaccine.\n\nDuring clinical examination her affect was restricted to dull, her psychomotor activity slow, she frequently got distracted, muttering to herself as she could hear her husband’s voice talking to her during the interview and also could not pay attention to the questions asked.\n\nThese cases paint a picture that doesn’t require further comment.\n\nIt is important to note, however, that COVID-19 vaccine spike protein does localize to the brain, where it can cause severe inflammation that may be autoimmune in nature (click here).\n\nSuch a tragic case of autoimmune encephalitis after Pfizer vaccine was reported in a 35 year old Swiss woman who developed fever, rash, behavioral changes and severe recurrent seizures 8 days after her 2nd Pfizer dose (Werner et al).\n\nShe was in and out of hospital of two months and never recovered, as she now has a seizure disorder requiring medication for life.\n\nThese episodes of psychosis have occurred after Pfizer, Moderna and AstraZeneca. In many cases, the vaccinated person was completely fine after 1st or 2nd dose but had a psychosis after 2nd dose or booster shot.", "opengraph": {"site_name": "Truth11.com", "type": "article", "title": "Covid-19 Vaccine Vaccine Induced Psychosis", "description": "Brain fog, anxiety and ‘vaccidents’ – the gift of modern medicine\n\n\nTap News  /  Tapestry\n\n\nI don’t know what you see each day on the roads.  I am amazed at how many walls are being knocked down, sign posts demolished and even lamp posts bent over.  It was rare to see", "url": "https://www.truth11.com/covid-19-vaccine-vaccine-induced-psychosis/", "image": "https://cdn.getmidnight.com/6908ab1f9a9ecdaba4ee2509cb3451aa/2023/03/_115371409_gettyimages-1265248637.jpg", "article:published_time": "2023-03-10T12:31:13.000Z", "article:modified_time": "2023-03-10T12:31:13.000Z", "article:publisher": "https://www.facebook.com/ghost", "image:width": "976", "image:height": "549"}, "tags": ["VIDEOS", "SOLUTIONS", "DOCUMENTS", "IMAGES+MEMES", "FOCUS"], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/science/article/pii/S0165178121004613?ref=truth11.com", "https://www.psychiatrist.com/pcc/covid-19/vaccine-induced-psychosis-etiology-consider-age-covid-19/?ref=truth11.com", "https://assets.researchsquare.com/files/rs-2086934/v1/823182fa-511c-43fe-ab6d-f5b6df7bd01d.pdf?c=1663959168&ref=truth11.com", "https://reader.elsevier.com/reader/sd/pii/S2666354621001666?token=9CF723C66FBC8987F17FABADB9808A114203EAA794A1DDBE0FE76D0DE85B6E6DA24FA4F82D0352E6292C73F7E991CEE7&originRegion=us-east-1&originCreation=20230308091111&ref=truth11.com", "https://www.psychiatria-danubina.com/UserDocsImages/pdf/dnb_vol34_noSuppl%208/dnb_vol34_noSuppl%208_56.pdf?ref=truth11.com", "https://www.frontiersin.org/articles/10.3389/fneur.2021.764197/full?ref=truth11.com", "http://file///G:/=%202%20-%20PERSONAL%20=/432-editoracao-final.pdf?ref=truth11.com", "https://www.pediatr-neonatol.com/article/S1875-9572(22)00268-6/fulltext?ref=truth11.com#%20", "https://wchh.onlinelibrary.wiley.com/doi/epdf/10.1002/pnp.723?src=getftr&ref=truth11.com", "https://www.sciencedirect.com/science/article/pii/S0920996422000354?via%3Dihub=&ref=truth11.com", "https://link.springer.com/content/pdf/10.1186/s12883-021-02517-w.pdf?ref=truth11.com", "https://hrcak.srce.hr/file/405804?ref=truth11.com", "https://www.tjpipstsb.org/article.asp?issn=2455-8559%3Byear%3D2022%3Bvolume%3D8%3Bissue%3D2%3Bspage%3D113%3Bepage%3D115%3Baulast%3DKrishna&ref=truth11.com", "https://www.mdpi.com/2076-393X/10/10/1651?ref=truth11.com", "https://www.frontiersin.org/articles/10.3389/fneur.2022.946644/full?ref=truth11.com", "https://tapnewswire.com/2023/03/brain-fog-anxiety-and-vaccidents-the-gift-of-modern-medicine/?ref=truth11.com"], "authors": [], "publish_date": "2023-03-10T12:31:13.000Z"}