{"result_id": "321025", "URL": "https://www.twisted.news/2023-01-23-nazis-dehumanized-jews-democrats-conservatives-big-pharma-unvaccinated.html", "timestamp": "2023-04-25 17:45:47 CEST+0200", "meta": {"description": "During the Holocaust, the Nazis called the Jews cockroaches and rats. They were all referred to as subhuman, so the rest of society would agree that it wasn’t cruel to exterminate them, just like pests. This categorization opened the door for medical experiments on them, cruel treatments, and of course, genocide, as witnessed in the […]", "lang": "en", "keywords": "Big Pharma,conspiracy,corruption,deep state,dehumanized,Demoncrats,ethics,evil,fully unvaccinated,fully vaccinated,Holocaust,insanity,intolerance,left cult,morals,Nazis,political division,political opponents,slaves,societal collapse,subhuman,Twisted,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2023-01-23-nazis-dehumanized-jews-democrats-conservatives-big-pharma-unvaccinated.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "LESS THAN HUMAN: Nazis dehumanized Jews in WWII like Democrats do to Conservatives, and like Big Pharma does to the unvaccinated", "cleaned_text": "LESS THAN HUMAN: Nazis dehumanized Jews in WWII like Democrats do to Conservatives, and like Big Pharma does to the unvaccinated\n\nDuring the Holocaust, the Nazis called the Jews cockroaches and rats. They were all referred to as subhuman, so the rest of society would agree that it wasn’t cruel to exterminate them, just like pests. This categorization opened the door for medical experiments on them, cruel treatments, and of course, genocide, as witnessed in the concentration camps.\n\nThe depopulation agenda is in full swing in America right now, but most Americans can’t see the forest for the trees. Communists run this country, but the fake news, fake elections, and fake “medicine” propaganda have the majority of the populace living in fear and succumbing to the wrath of the CCP-led Biden Regime and Big Pharma’s vaccine-induced genocide.\n\nWe are witnessing most Democrats functioning as extreme liberals who absolutely HATE anyone who isn’t just like them. Most Democrats dive head first into the poison well, including getting “fully vaccinated” for Covid, wearing their bacteria-breeding mask 24/7/365, and spewing venom at Conservatives, Trump fans, and anyone who is “fully Unvaccinated.” This is very similar to the non-Jewish German citizens, SS police, and soldiers during WWII who complied with the agenda to treat Jews as subhuman, and thus deserving of torture and even mass-murder.\n\nWithout a doubt, most Trump haters, who all suffer from Trump Derangement Syndrome, would happily attend a massacre of Trump and his supporters and gladly applaud the whole event.\n\n“Vaccinated” Americans are treating fellow unvaccinated Americans like lepers, and Democrats are treating Conservatives like domestic terrorists\n\nThough the Covid “vaccines” are not really vaccines at all, are not safe, and are not effective (as the CDC claims incessantly), still the “vaccinated” sheeple believe it’s the “fully unvaccinated” people (who are the healthiest people in the country by far), who are the ones killing off the vaccinated (this doesn’t even make sense if vaccines work). Sadly, it’s their own government and the richest white men in the world who want them dying and dead, while going broke, blaming innocent people, and supporting their own demise.\n\nMeanwhile, inside the new one-party Amerika, politics have become so divisive that the Demoncrats, as they’re now called, are becoming violent and enraged with hatred. So much so that they want everyone to die that doesn’t see things their way.\n\nJust as many white people in America viewed the blacks who were slaves as subhuman (including children), and Nazis treated Jews as slaves (including children), today many Americans view conservatives and the unvaccinated as terrorists and sub-humans who do not deserve life or liberty. History is repeating itself, but the far Left and the sickly-vaccinated can’t see it at all. They’ve been blinded by fear, propaganda, and fake news.\n\nWill the sadistic leaders in Washington DC now use their weaponized organizations, including the FBI, CIA, CDC, FDA, DHS, CPS, and FEMA to put more conservatives and unvaccinated people in prisons (think Jan 6’ers and people in hospitals with ‘Covid’), traffic children on the black market, and demonize all opposition (including Americans with opposing opinions) as “domestic terrorists?”\n\nWhere and when will honest, sane, hard-working Americans draw the line that the tyranny can’t cross? Will Biden’s Third Reich put all political opponents and Big Pharma ‘deniers’ in FEMA prisons (concentration camps on US soil) in the next few years? Stay tuned to find out, as the elections are fixed to keep the tyranny in complete control. Guard your guns, your land, and your health, because they’re coming to try to take it all. Tune your scamdemic frequency to Censored.news for truth news about the Republic that’s being censored from the rest of media as you read this.", "opengraph": {"title": "LESS THAN HUMAN: Nazis dehumanized Jews in WWII like Democrats do to Conservatives, and like Big Pharma does to the unvaccinated", "type": "article", "url": "https://www.twisted.news/2023-01-23-nazis-dehumanized-jews-democrats-conservatives-big-pharma-unvaccinated.html", "site_name": "Twisted News", "description": "During the Holocaust, the Nazis called the Jews cockroaches and rats. They were all referred to as subhuman, so the rest of society would agree that it wasn’t cruel to exterminate them, just like pests. This categorization opened the door for medical experiments on them, cruel treatments, and of course, genocide, as witnessed in the […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2023/01/zombie_80321131.jpg"}, "tags": ["conspiracy", "Big Pharma", "Nazis", "deep state", "left cult", "morals", "corruption", "Holocaust", "Demoncrats", "societal collapse", "fully unvaccinated", "political division", "dehumanized", "intolerance", "ethics", "insanity", "Tyranny", "slaves", "evil", "political opponents", "Twisted", "subhuman", "fully vaccinated"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https://studyfinds.org/nazi-propaganda-holocaust/", "https://naturalnews.com/2021-04-27-globalist-next-move-ostracize-unvaccinated-like-hitler-ostracized-jews.html", "https://naturalnews.com/2021-11-22-vaccinated-americans-refusing-unvaccinated-relatives-thanksgiving-christmas.html", "https://naturalnews.com/2022-10-16-fully-unvaccinated-safest-defense-against-contracting-covid.html", "https://www.npr.org/2011/03/29/134956180/criminals-see-their-victims-as-less-than-human", "https://naturalnews.com/2018-08-02-trump-derangement-syndrome-driver-commits-vehicular-assault.html", "https://naturalnews.com/2022-08-16-former-cia-nsa-director-trump-should-be-executed-if-guilty-espionage.html", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://12ft.io/proxy?q=https://studyfinds.org/nazi-propaganda-holocaust/", "https://www.npr.org/2011/03/29/134956180/criminals-see-their-victims-as-less-than-human", "https://naturalnews.com/2021-04-27-globalist-next-move-ostracize-unvaccinated-like-hitler-ostracized-jews.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2023-01-23-nazis-dehumanized-jews-democrats-conservatives-big-pharma-unvaccinated.html&linkname=LESS%20THAN%20HUMAN%3A%20Nazis%20dehumanized%20Jews%20in%20WWII%20like%20Democrats%20do%20to%20Conservatives%2C%20and%20like%20Big%20Pharma%20does%20to%20the%20unvaccinated", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}