{"result_id": "321026", "URL": "https://twisted.news/2022-10-17-canada-assisted-suicide-capital-of-the-world.html", "timestamp": "2023-04-25 17:45:48 CEST+0200", "meta": {"description": "It is constitutional to perform medically assisted suicide in Canada, thanks to Bill C-14, also known as the Medical Assistance in Dying Act (MAiD). Any Canadian who could show that their death is “reasonably foreseeable” would be deemed eligible. In 2017, the first full year following MAiD’s passing, a government study reported that 2,838 people opted for assisted […]", "lang": "en", "keywords": "assisted suicide,badhealth,badmedicine,big government,Canada,conspiracy,Dangerous Medicine,demonic times,euthanasia,evil,insanity,Justin Trudeau,Medical Assistance in Dying Act,medical violence,murder,Twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2022-10-17-canada-assisted-suicide-capital-of-the-world.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Canada to become ASSISTED SUICIDE capital of the world", "cleaned_text": "Canada to become ASSISTED SUICIDE capital of the world\n\nIt is constitutional to perform medically assisted suicide in Canada, thanks to Bill C-14, also known as the Medical Assistance in Dying Act (MAiD). Any Canadian who could show that their death is “reasonably foreseeable” would be deemed eligible.\n\nIn 2017, the first full year following MAiD’s passing, a government study reported that 2,838 people opted for assisted suicide. The numbers skyrocketed to 10,064 by 2021, accounting for more than three percent of all deaths in Canada that year.\n\nA total of 31,664 MAiD deaths had been recorded and the large majority were in the 65 to 80 age bracket when they died.\n\nIn 2017, only 34 MAiD deaths were in the 18- to 45-year-old group. It increased to 49 in 2018; 103 in 2019; 118 in 2022; and 139 in 2021. Today, thousands of people who could live for many years are applying to kill themselves. Doctors taking an increasingly liberal view when it comes to defining “reasonably foreseeable” death may have contributed to the increase in applications.\n\nAccording to Rupa Subramanya, a freelance columnist for National Post and Nikkei Asia, the government amended the original legislation in 2021, stating that one could apply for MAiD even if one’s death were not reasonably foreseeable. “This second track of applicants simply had to show that they had a condition that was “intolerable to them” and could not “be relieved under conditions that they consider acceptable.”\n\nIn March 2023, Prime Minister Justin Trudeau’s government is scheduled to expand the pool of eligible suicide-seekers to include the mentally ill and “mature minors.” This move solicited various negative reactions. Palliative care physician Dr. Dawn Davies, a MAiD supporter when it was first conceived, said she is worried about where this might lead. She could imagine kids with personality disorders or other mental health issues saying they wanted to die.\n\n“Some of them will mean it, some of them won’t,” she said. “And we won’t necessarily be able to discern who is who.”\n\nAttorney Hugh Scher, the founder of Scher Law Professional Corporation, told Subramanya that while other countries have explored extending assisted suicide to minors, those governments have insisted on substantial safeguards, including parental notification and consent.\n\n“Canada is poised to become the most permissive euthanasia regime in the world, including for minors and people with only psychiatric illness, having already removed the foreseeability of death or terminal illness as an essential condition to accessing euthanasia or assisted suicide,” Scher said. (Related: Canadian hospice group pushes to normalize euthanasia of children who are “suffering” – many due to vaccine injuries.)\n\nScher is a consultant to Margaret Marsilla, a mother who found out that his son had an appointment with a doctor who would facilitate his death. Marsilla is doing everything she can just to save him.\n\nAccording to LifeSiteNews, her son Kiano Vafaeian confirmed that Dr. Joshua Tepper withdrew his support from the young man’s attempt to end his life through MAiD – thanks to his mother Margaret’s social media campaign, which included a petition posted on both Change.org and CitizenGo.\n\nMarsilla said: “We managed to put a little bit of fear in [the doctor], but another doctor might pick up the situation.”\n\nKiano, 23, was depressed, diabetic and had lost his vision in one eye. He didn’t have a job or a girlfriend. Marsilla was able to access her son’s email on September 7, and learned that he had his death scheduled on September 22.\n\n“I am confirming the following timing: Please arrive at 8:30 am. I will ask for the nurse at 8:45 am and I will start the procedure at around 9:00 am. Procedure will be completed a few minutes after it starts,” the doctor said in the email. The procedure entailed administering two drugs: first, a coma-inducing agent; then, a neuromuscular blocker would stop Kiano’s breathing. He would be dead in five to 10 minutes.\n\nOn September 16, Tepper texted Marsilla to say that he’d postponed her son’s death until September 28. After five days, the doctor texted her again to say that he wasn’t going through with it. He apparently wanted nothing more to do with Kiano.\n\nEuthanasia.news has more stories about assisted suicide.\n\nWatch the below video that talks about how the Trudeau administration offers assisted suicide to a veteran struggling with PTSD.\n\nThis video is from the Prisoner channel on Brighteon.com.\n\nNew Zealand now paying euthanasia doctors $1,000 a pop to murder covid patients.", "opengraph": {"title": "Canada to become ASSISTED SUICIDE capital of the world", "type": "article", "url": "https://www.twisted.news/2022-10-17-canada-assisted-suicide-capital-of-the-world.html", "site_name": "Twisted News", "description": "It is constitutional to perform medically assisted suicide in Canada, thanks to Bill C-14, also known as the Medical Assistance in Dying Act (MAiD). Any Canadian who could show that their death is “reasonably foreseeable” would be deemed eligible. In 2017, the first full year following MAiD’s passing, a government study reported that 2,838 people opted for assisted […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/10/Euthanasia.jpg"}, "tags": ["conspiracy", "murder", "big government", "euthanasia", "evil", "assisted suicide", "Justin Trudeau", "medical violence", "Canada", "Medical Assistance in Dying Act", "Twisted", "demonic times", "insanity"], "tweets": [], "movies": [], "links": ["https://www.commonsense.news/p/scheduled-to-die-the-rise-of-canadas", "http://insanity.news", "https://naturalnews.com/2022-08-05-canada-normalize-euthanasia-children-suffering-vaccine-injuries.html", "https://www.lifesitenews.com/news/23-year-old-canadian-mans-assisted-suicide-bid-thwarted-following-moms-social-media-campaign/?utm_source=digest-canadian-2022-09-29&utm_medium=email&fbclid=IwAR3ScpxpAPE14tUiNXqJzrW5M11lrCez1XhlVtzzqX7oTOarC1lNAlTIO0E", "http://Euthanasia.news", "https://www.brighteon.com/3ee1b805-b40f-431a-9ce6-b37d0a94dee6", "https://www.brighteon.com/channels/theprisoner", "https://naturalnews.com/2022-01-02-new-zealand-paying-euthanasia-doctors-murder-covid-patients.html", "https://pandemic.news/2022-01-03-new-zealand-green-lights-euthanasia-covid-patients.html", "https://evil.news/2021-11-25-euthanasia-infanticide-promoting-philosopher-wins-berggruen-prize.html", "https://www.commonsense.news/p/scheduled-to-die-the-rise-of-canadas", "https://www.lifesitenews.com/news/23-year-old-canadian-mans-assisted-suicide-bid-thwarted-following-moms-social-media-campaign/?utm_source=digest-canadian-2022-09-29&utm_medium=email&fbclid=IwAR3ScpxpAPE14tUiNXqJzrW5M11lrCez1XhlVtzzqX7oTOarC1lNAlTIO0E", "https://www.brighteon.com/3ee1b805-b40f-431a-9ce6-b37d0a94dee6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-10-17-canada-assisted-suicide-capital-of-the-world.html&linkname=Canada%20to%20become%20ASSISTED%20SUICIDE%20capital%20of%20the%20world", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}