{"result_id": "321035", "URL": "https://twisted.news/2021-06-08-military-scientist-fauci-died-covid-vaccine-patent.html", "timestamp": "2023-04-25 17:45:55 CEST+0200", "meta": {"description": "A Chinese military scientist by the name of Zhou Yusen who was paid by Anthony Fauci and the National Institutes of Health (NIH) to conduct dangerous gain of function research on bat coronavirus at the Wuhan Institute of Virology reportedly turned up dead just months after filing a patent for a Wuhan coronavirus (Covid-19) “vaccine” […]", "lang": "en", "keywords": "badmedicine,badscience,coronavirus,COVID,covid-19,deaths,Died,Fauci,foul play,grants,military scientist,NIH,outbreak,pandemic,SARS-CoV-2,scientists,Virology,Zhou Yusen", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2021-06-08-military-scientist-fauci-died-covid-vaccine-patent.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "FOUL PLAY? Military scientist funded by Fauci died mysteriously after filing covid vaccine patent", "cleaned_text": "A Chinese military scientist by the name of Zhou Yusen who was paid by Anthony Fauci and the National Institutes of Health (NIH) to conduct dangerous gain of function research on bat coronavirus at the Wuhan Institute of Virology reportedly turned up dead just months after filing a patent for a Wuhan coronavirus (Covid-19) “vaccine” back in February 2020.\n\nZhou, 54, had been working with “bat woman” Zhengli Shi to genetically manipulate coronaviruses at the WIV using grant money from Fauci. Sharri Markson of The Weekend Australian wrote all about this in her upcoming book, What really happened in Wuhan.\n\nEcoHealth Alliance and several American universities also funneled cash to Zhou and his colleagues, which is supposedly under investigation by the Biden regime. We now know that tens of millions of American tax dollars were used to genetically modify (GMO) bat coronavirus for the purpose of developing bioweapons.\n\n“The revelation shows American money was funding risky research on coronaviruses with People’s Liberation Army Scientists – including decorated military scientist Zhou Yusen and the Wuhan Institute of Virology’s ‘Bat Woman,’ Shi Zhengli,” reports Zero Hedge.\n\nZhou had been working on novel coronavirus vaccines since at least 2006\n\nFor all of last year, Zhou’s mysterious death was shrouded in secrecy, only recently coming to light thanks to the diligent work of independent investigators. Zhou, by the way, was an award-winning scientist at the PLA Laboratory of Infection and Immunity at the Beijing Institute of Microbiology and Epidemiology.\n\nDespite his high ranking and lengthy career, Zhou was paid no tribute after his passing, nor was it ever even mentioned in the media. Only in a passing Chinese media report from last July was Zhou’s death given a casual reference, as well as again at the end of December in a scientific paper.\n\n“Both had the word ‘deceased’ in brackets after his name,” says Zero Hedge about how little attention Zhou’s life was given.\n\nThe suspicious timing of Zhou’s death coupled with the fact that neither China nor the United States seem to have wanted anybody to know about it is concerning, to say the least. There was clearly an attempt by the powers that be to cover the whole thing up indefinitely.\n\nPerhaps Zhou knew so much about Fauci’s criminality that he had to be “suicided” in Hillary Clinton-type fashion to keep him from spilling the beans. This seems to be a more likely scenario than Zhou just so happening to pass right when he was planning to unveil an injection for the Chinese Virus he was paid by Fauci to create.\n\nZhou also could have revealed to the world early on that the natural origin plandemic narrative was a farce, and thus had to be silenced. Whatever the case may be, it is clear that his mouth was forcibly shut to keep up the ruse.\n\nConsidering the timeline and its implications, Zhou died three months after filing a patent for a Chinese Virus injection on Feb. 24, 2020. This would suggest that he was already working on this vaccine before the plandemic was even publicly announced.\n\n“… keep in mind that Moderna was able to design the sequence for their COVID-19 vaccine just two days after Chinese officials released its genetic sequence on Jan. 11, 2020 – filing for their first related patent in March, two months later,” Zero hedge further adds.\n\n“Also note that Zhou had been working on coronavirus vaccines since at least 2006 in response the original SARS-CoV outbreak – authoring a study which found that ‘the vaccines containing the (receptor-binding domain) of SARS-CoV S protein may induce sufficient neutralising antibodies and long-term ­protective immunity against SARS-CoV challenge in the ­established mouse model.'”\n\nMore of the latest news about Wuhan coronavirus (Covid-19) deception can be found at Pandemic.news.", "opengraph": {"title": "FOUL PLAY? Military scientist funded by Fauci died mysteriously after filing covid vaccine patent", "type": "article", "url": "https://www.twisted.news/2021-06-08-military-scientist-fauci-died-covid-vaccine-patent.html", "site_name": "Twisted News", "description": "A Chinese military scientist by the name of Zhou Yusen who was paid by Anthony Fauci and the National Institutes of Health (NIH) to conduct dangerous gain of function research on bat coronavirus at the Wuhan Institute of Virology reportedly turned up dead just months after filing a patent for a Wuhan coronavirus (Covid-19) “vaccine” […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2021/06/Fauci-Committee-Hearing-Coronavirus.jpg"}, "tags": ["pandemic", "grants", "covid-19", "Virology", "Zhou Yusen", "scientists", "outbreak", "Fauci", "COVID", "military scientist", "NIH", "SARS-CoV-2", "coronavirus", "deaths", "foul play", "Died"], "tweets": [], "movies": [], "links": ["http://english.whiov.cas.cn/", "https://www.zerohedge.com/political/fauci-funded-wuhan-military-scientist-filed-covid-vaccine-patent-days-after-pandemic", "https://www.naturalnews.com/2020-05-08-virologists-lying-origins-coronavirus-contains-gain-of-function-gene-sequences.html", "http://pandemic.news", "https://www.zerohedge.com/political/fauci-funded-wuhan-military-scientist-filed-covid-vaccine-patent-days-after-pandemic", "https://www.naturalnews.com/2020-05-08-virologists-lying-origins-coronavirus-contains-gain-of-function-gene-sequences.html"], "authors": [], "publish_date": null}