{"result_id": "321028", "URL": "https://www.twisted.news/2022-02-01-die-off-is-here-life-insurance-payouts-skyrocket-258-as-post-vaccine-deaths-accelerate.html", "timestamp": "2023-04-25 17:45:49 CEST+0200", "meta": {"description": "In a little-known Reuters story that garnered almost no attention in the corporate media, Dutch insurer Aegon revealed its third quarter, 2021 life insurance payouts skyrocketed 258% compared to third quarter, 2020 payouts. The difference, of course, is found in covid vaccines. In 2020, vaccines weren’t yet available, so payouts for Aegon only reached $31 […]", "lang": "en", "keywords": "badhealth,biological weapons,biowar,depopulation,evil,life insurance,mortality,spike protein,Twisted,Vaccine deaths,Vaccine Holocaust,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2022-02-01-die-off-is-here-life-insurance-payouts-skyrocket-258-as-post-vaccine-deaths-accelerate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "THE DIE-OFF IS HERE: Life insurance payouts skyrocket 258% as post-vaccine deaths rapidly accelerate", "cleaned_text": "THE DIE-OFF IS HERE: Life insurance payouts skyrocket 258% as post-vaccine deaths rapidly accelerate\n\nIn a little-known Reuters story that garnered almost no attention in the corporate media, Dutch insurer Aegon revealed its third quarter, 2021 life insurance payouts skyrocketed 258% compared to third quarter, 2020 payouts. The difference, of course, is found in covid vaccines. In 2020, vaccines weren’t yet available, so payouts for Aegon only reached $31 million. But after three quarters of aggressive vaccinations throughout 2021, the death benefit payouts hit $111 million, an increase of 258%.\n\nDutch insurer Aegon, which does two-thirds of its business in the United States, said its claims in the Americas in the third quarter were $111 million, up from $31 million a year earlier. U.S. insurers MetLife and Prudential Financial also said life insurance claims rose. South Africa’s Old Mutual used up more of its pandemic provisions to pay claims and reinsurer Munich Re raised its 2021 estimate of COVID-19 life and health claims to 600 million euros from 400 million.\n\nInsurance companies are slowly coming to realize the truth about covid vaccines, even as the complicit, murderous mainstream tries to cover up the accelerating deaths. The death signals now emerging in the finances of insurance companies can’t simply be swept under the rug, and given that a 258% increase was recorded for Q3, 2021, it begs the obvious question: How much worse will this be for Q4, 2021? Or Q1, 2022?\n\nOn any “normal” (pre-covid) day in America, about 7,700 people die. If those deaths rise by 100%, that means an extra 7,700 people are dying each day. Multiply that over one year, and it’s an additional 2.8 million deaths. Note this is for merely a 100% increase in deaths.\n\nAegon is reporting a 258% increase in payouts on life insurance policies. Although Aegon doesn’t insure the entire country, obviously, this data point should be raising alarms among those people paying attention. If we start to consistently see something like a 200% increase in all-cause mortality, that would mean an extra 15,000+ people are dying each day in America. That’s a vaccine holocaust playing out in real time.\n\nTruth be told, we’re probably at that point right now. The data sets just haven’t caught up yet with the reality of what’s happening in February, 2022. Cancer death rates have almost certainly doubled in 2021 and are headed for even higher numbers in 2022, but the cancer industry — dominated by pharma interests — will of course bury the numbers as long as possible to avoid anyone asking questions of why so many people are dying from cancer all of a sudden.\n\nThe vaccine holocaust is real and accelerating… MILLIONS will die in America\n\nSo not only do we have an actual vaccine holocaust taking place in America right now, we have a holocaust cover-up being run by all the complicit, murderous parties, including Big Pharma, Big Tech, Big Media and Big Government. They’re all in on it. They’re all mass murderers, and they’re all working to cover this up as long as possible so they can coerce even more people into committing vaccine suicide before the body count becomes undeniable.\n\nThat’s the level of evil we’re dealing with in society right now, and it’s all being run under the banner of “science.”\n\nUnder this dangerous death cult of “science,” the whole world is supposed to pretend that covid vaccines are halting infectious, transmission and hospitalizations, all while looking the other way when so many vaccinated people prematurely die. Israel, at a 96.2% vaccination rate across the population, is now leading the world in covid cases per capita. This proves the vaccine has the opposite effect that we were promised in the name of “science.” In fact, the more a country vaccinates its people, the higher covid cases rise.\n\nThat’s because, of course, the vaccine is the pandemic. Covid would be over by now if not for the vaccines continuing to inject people with spike protein bioweapons that cause organ failure and death. It’s no coincidence that vaccine injury symptoms are then categorized as “covid” by the corrupt, murderous medical establishment that receives financial kickbacks from the government for killing people with ventilators and remdesivir.\n\nHershey company goes all in with Satan, rejects employees of faith\n\nThe Hershey company, meanwhile, is firing all its unvaccinated employees, confirming that it is an evil corporation that denies faith-based exemptions from deadly vaccines. As The Epoch Times reports:\n\n“I really thought I’d be OK,” Kim Durham, a payment analyst and sourcing buyer, told The Epoch Times. “I thought, you cannot question my faith. Nobody can question that.”\n\nDurham asked for a religious accommodation in August and assumed she would get it.\n\n“I thought this was behind me until September when I met with an HR representative. It was an interrogation on your religious beliefs. They twisted your words and tried to put words in your mouth. It was terrible. I was asked such personal questions that had nothing to do with religion.”\n\nShe was shocked when, in November, she received word that her request for religious accommodation had been denied.\n\nEveryone interviewed mentioned being troubled by similar questions during the meetings, usually held with an immediate supervisor and someone from HR, such as:\n\nHave you ever been vaccinated? Are your children vaccinated? How do you protect yourself when you leave your home? How often do you go to church? Do you take Tylenol, Ibuprofen, Tums, or Midol?\n\nSo the Hershey company, which sells low-grade processed, sugar-filled candy bars that promote diabetes and obesity, is interrogating employees over whether they take Tums? And if they take Tums, they’re not allowed to object to spike protein mRNA injections?\n\nSomething tells me the Hershey company is now run by God-hating demons, just like most other large corporations in America and around the world.\n\nSee more news about the rise of demonism and satanism at DemonicTimes.com\n\nGet the full story on Hershey, Apple and other demonic corporate entities in today’s hard-hitting Situation Update podcast:\n\nFind more information-packaged podcasts each day, along with special reports and emergency updates, at:\n\nAlso follow me on:\n\nJoin the free NaturalNews.com email newsletter to stay alerted about new, upcoming audiobooks that you can download for free.\n\nDownload my current audiobooks — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:", "opengraph": {"title": "THE DIE-OFF IS HERE: Life insurance payouts skyrocket 258% as post-vaccine deaths rapidly accelerate", "type": "article", "url": "https://www.twisted.news/2022-02-01-die-off-is-here-life-insurance-payouts-skyrocket-258-as-post-vaccine-deaths-accelerate.html", "site_name": "Twisted News", "description": "In a little-known Reuters story that garnered almost no attention in the corporate media, Dutch insurer Aegon revealed its third quarter, 2021 life insurance payouts skyrocketed 258% compared to third quarter, 2020 payouts. The difference, of course, is found in covid vaccines. In 2020, vaccines weren’t yet available, so payouts for Aegon only reached $31 […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/02/HRR-2022-02-01-Situation-Update.jpg"}, "tags": ["evil", "biowar", "Vaccine deaths", "life insurance", "vaccine injury", "Twisted", "depopulation", "spike protein", "vaccines", "Vaccine Holocaust", "mortality", "biological weapons"], "tweets": [], "movies": [], "links": ["https://uk.finance.yahoo.com/news/life-insurers-adapt-pandemic-risk-070702607.html", "http://vaccineholocaust.org", "https://www.theepochtimes.com/hershey-fires-unvaccinated-employees_4240297.html", "http://DemonicTimes.com", "http://Brighteon.com/9e5a5b09-9f5c-4a33-9c57-f5910de9e042", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://GhostWorld.co", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-02-01-die-off-is-here-life-insurance-payouts-skyrocket-258-as-post-vaccine-deaths-accelerate.html&linkname=THE%20DIE-OFF%20IS%20HERE%3A%20Life%20insurance%20payouts%20skyrocket%20258%25%20as%20post-vaccine%20deaths%20rapidly%20accelerate", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}