{"result_id": "321002", "URL": "https://www.twisted.news/2021-04-27-globalist-next-move-ostracize-unvaccinated-like-hitler-ostracized-jews.html", "timestamp": "2023-04-25 17:45:23 CEST+0200", "meta": {"description": "According to the Marxist playbook, it’s time to begin disarming the unvaccinated in America and moving them all to the Covid ghettos, like lepers. No vaccine passport? No traveling for you. No job. No groceries. Time to starve to death or get the jabs. Your choice. The globalist agenda is to turn all of the […]", "lang": "en", "keywords": "american marxism,antivax,Biden regime,BLM,CCP,evil,Hitler,Holocaust,Marxism,Marxists,mRNA,Nazis,Twisted,Vaccine Holocaust,vaccine passports,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2021-04-27-globalist-next-move-ostracize-unvaccinated-like-hitler-ostracized-jews.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "Globalist next move in the Marxist playbook: Ostracize the unvaccinated like Hitler ostracized the Jews", "cleaned_text": "Globalist next move in the Marxist playbook: Ostracize the unvaccinated like Hitler ostracized the Jews\n\nAccording to the Marxist playbook, it’s time to begin disarming the unvaccinated in America and moving them all to the Covid ghettos, like lepers. No vaccine passport? No traveling for you. No job. No groceries. Time to starve to death or get the jabs. Your choice. The globalist agenda is to turn all of the vaccinated American sheeple against the unvaccinated. Treat them like they’re diseased and spreading leprosy. Blame them for all the plight of the country. They are the blight. They ruin the economy. Right?\n\nHow quickly we forget this is exactly how the Third Reich came to power. The Nazis did disarm millions of Jews and other “political opponents” under their 1938 gun confiscation laws. The government was a dictatorship, exactly like the communists who stole the US presidential election just 6 months ago. They now want to disarm the people they want to destroy most, and that’s the “anti-vaxxers,” as they call them, because the anti-vaxxers are also the majority of gun owners, and land owners, and smart people who know that the mRNA vaccine series is a biological, genocidal weapon in disguise.\n\nThe communists in the White House now do not want their “targets” to be able to fight back, so they have begun a massive campaign to convince all the vaccinated sheeple to ostracize, hate and pressure the non-vaxxers into compliance, or else, face the wrath of the New National Socialists – meaning the Biden Regime teamed up with the Chinese Communist Party. Put on your “yellow badge” (Nazi punishment for disobedience) or be shot in the back of the head (in the arm with a deadly vaccine) by the new Nazi police (American Medical Industrial Complex).\n\nThe New National Socialists of America need all gun owners to get vaccinated or their plan to destroy America won’t work\n\nJust like Hitler, the Democrats in Washington know that if they don’t disarm their opponents, they simply can’t wage a winnable war against them. There’s only two ways to take these automatic weapons away from law-abiding Americans: kill them all with dirty vaccines or create gun confiscation laws, like red-flag laws, where all the vaccinated morons tell the FBI we’ve all gone mental, so they can go door to door and save America from all this “gun violence.”\n\nSo, if you go just about anywhere these days in America, you hear all the vaccinated idiots checking in with each other to see if relatives, neighbors and coworkers have gotten their shots, and “both of them,” or no hugs! The media has convinced all the jabbed sheeple that their safe with each other, as long as they ostracize the unvaccinated. Most of these hypochondriac, brain-washed patients of the state would happily send the unvaccinated to concentration camps, just to save themselves from Covid-19.\n\nWhere will the Marxists house the unvaccinated for the American Holocaust?\n\nThe vaccine passports are the best way the Marxists can control the population that doesn’t vaccinate. These Nazi-style “papers” will allow the Biden Regime to deny work, travel and even food for those who do not take the dirty mRNA China flu vaccines. It’s just a matter of time before the Biden/CCP regime creates ‘ghettos’ for housing (exterminating) the anti-vaxxers.\n\nWhen will the Biden/CCP trains start coming around and loading up the unvaccinated, to be transported to the ghettos (FEMA death camps) and force-vaccinated until death does its part? Where will those ‘detention centers’ be located? NFL football stadiums and NBA coliseums, since those leagues already back BLM and the destruction of America? When will the FBI start confiscating automatic weapons by going door to door, like the SS police?\n\nThat’s what it’s going to take to bring down America and eliminate the true patriots who know better than to get the Bill Gates DNA-altering dirty jabs. Tune your internet frequency to Pandemic.news for updates on the Covid-19 Plandemic as it develops into a more severe biological war waged by Democrats on all Americans.", "opengraph": {"title": "Globalist next move in the Marxist playbook: Ostracize the unvaccinated like Hitler ostracized the Jews", "type": "article", "url": "https://www.twisted.news/2021-04-27-globalist-next-move-ostracize-unvaccinated-like-hitler-ostracized-jews.html", "site_name": "Twisted News", "description": "According to the Marxist playbook, it’s time to begin disarming the unvaccinated in America and moving them all to the Covid ghettos, like lepers. No vaccine passport? No traveling for you. No job. No groceries. Time to starve to death or get the jabs. Your choice. The globalist agenda is to turn all of the […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2021/04/auschwitz-holocaust-jews-nazis.jpg"}, "tags": ["antivax", "CCP", "vaccine passports", "evil", "Nazis", "Marxism", "mRNA", "Biden regime", "Twisted", "Hitler", "vaccines", "BLM", "Vaccine Holocaust", "Marxists", "Holocaust", "american marxism"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/political/reasons-why-leftists-will-never-successfully-disarm-americans", "https://www.naturalnews.com/2021-04-20-big-pharma-chasing-new-covid19-variants-vaccines.html", "https://www.dw.com/en/the-star-of-ostracism-and-death/a-19509598", "https://www.naturalnews.com/2021-04-24-vaccine-passports-set-stage-for-communist-america.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.zerohedge.com/political/reasons-why-leftists-will-never-successfully-disarm-americans", "https://www.naturalnews.com/2021-04-24-vaccine-passports-set-stage-for-communist-america.html"], "authors": [], "publish_date": null}