{"result_id": "321022", "URL": "https://twisted.news/2022-05-27-bill-gates-bioterrorists-plan-for-global-control.html", "timestamp": "2023-04-25 17:45:44 CEST+0200", "meta": {"description": "In “The Corbett Report” above,1 independent journalist James Corbett reviews the contents of Bill Gates’ book, “How to Prevent the Next Pandemic.” “It’s every bit as infuriating, nauseating, ridiculous, laughable and risible as you would expect,” he says. “This is a ridiculous book … There’s certainly nothing of medical or scientific value in here … It’s a baffling […]", "lang": "en", "keywords": "big government,bill gates,bioterrorism,conspiracy,corruption,COVID,deception,deep state,enslaved,global control,globalists,International health regulations,national security,Plandemic,propaganda,surveillance,Tyranny,who pandemic treaty", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2022-05-27-bill-gates-bioterrorists-plan-for-global-control.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Bill Gates the bioterrorist’s plan for global control", "cleaned_text": "In “The Corbett Report” above,1 independent journalist James Corbett reviews the contents of Bill Gates’ book, “How to Prevent the Next Pandemic.”\n\n“It’s every bit as infuriating, nauseating, ridiculous, laughable and risible as you would expect,” he says. “This is a ridiculous book … There’s certainly nothing of medical or scientific value in here … It’s a baffling book even from a propagandistic perspective …\n\nGates’ goal in writing the book is to disarm the public and prepare us to accept the agenda that Gates and his allies would like to impose on the world. Ultimately, what this is about is drumming up general public support — or at least general public understanding — of the unfolding biosecurity agenda.”\n\n“Imagine yourself sidled up to a bar. A talkative guy sits down on the stool next to you. He has decided that there is one thing wrong with the world. It can be literally anything. Regardless, he has the solution.\n\nIt’s interesting and weird for a few minutes. But you gradually come to realize that he is actually crazy. His main point is wrong and so his solutions are wrong too. But the drinks are good, and he is buying. So you put up with it. In any case, you will forget the whole thing in the morning.\n\nIn the morning, however, you realize that he is one of the world’s richest men and he is pulling the strings of many of the world’s most powerful people. Now you are alarmed. In a nutshell, that’s what it’s like to read Bill Gates’s new book ‘How to Prevent the Next Pandemic.’”\n\nCorbett goes through Gates’ book chapter by chapter, so if you’re short on time, you can review the ones that interest you the most:\n\nChapter 3: Get better at detecting outbreaks early (timestamp: 26:21)\n\nChapter 4: Help people protect themselves right away (timestamp: 31:01)\n\nChapter 8: Close the health gap between rich and poor countries (timestamp: 50:49)\n\nAfterword: How COVID changed the course of our digital future (timestamp: 1:03:00)\n\nBy now, you’ve probably heard that the World Health Organization is attempting to seize control over global pandemic monitoring and response, and ultimately, all health care decisions. But did you know Bill Gates, the largest funder of the WHO (if you combine funding from his foundation and GAVI), also intends to play a key part in this takeover?\n\nAs Gates explains in a video at the beginning of Corbett’s report, he’s building a pandemic response team for the WHO, dubbed the “Global Epidemic Response & Mobilization” or GERM Team. This team will be made up of thousands of disease experts under WHO’s purview, and will monitor nations and make decisions about when to suspend civil liberties to prevent spread of an illness.3\n\nAlas, as noted by “Rising” host Kim Iversen in the video compilation above, if COVID-19 has taught us anything, it’s that stopping the spread of a virus is more or less impossible, no matter how draconian the rules. Meanwhile, the side effects of lockdowns and business shutdowns are manifold.\n\nPeople’s health has suffered from lack of health care. Depression and suicide have skyrocketed. Economies have gone bust. Violent crime has risen. Tucker also points out the false premise behind Gates’ pandemic prevention plan, stating:4\n\n“This theory of virus control — the notion that muscling the population makes a prevalent virus shrink into submission and disappear — is a completely new invention, the mechanization of a primitive instinct.\n\nSmallpox occupies a unique position among infectious diseases as the only one affecting humans that has been eradicated. There are reasons for that: a stable pathogen, a great vaccine, and a hundred years of focused public health work. This happened not due to lockdowns but from the careful and patient application of traditional public-health principles.\n\n[T]he attempt to crush a respiratory virus through universal avoidance could be worse than allowing endemicity to it to develop throughout the population.”\n\nDuring COVID, we basically traded false protection against one thing for a multitude of other ills that are far worse in the long run. Now, Gates and the WHO want to make this disastrous strategy the norm.\n\nOnce again, we see Gates is basically paying the WHO to dictate what the world must do to make him a ton of money, because he’s always heavily invested in the very “solutions” he presents to the world. While he’s built a reputation as a philanthropist, his actions are self-serving, and more often than not, the recipients of his “generosity” end up worse than they were before.\n\nCase in point: After 15 years, Gates’ Green Revolution in Africa (AGRA) project has now been proven an epic fail.5 Gates promised the project would “double yields and incomes for 30 million farming households by 2020.”\n\nThat false prognosis was deleted from the AGRA website in June 2020, after a Tuft University assessment revealed hunger had actually increased by 31%. February 28, 2022, the first-ever evaluation report6 confirmed the failure of AGRA.\n\nBut getting back to the globalists’ plan to seize global control through biosecurity governance, they are attempting to do this using two different avenues. If we fail to fight off both attacks, we’ll end up under totalitarian governance.\n\nThe first attack comes in the form of amendments7 to the International Health Regulations (IHR). The second attack comes through a new international pandemic treaty with the WHO.\n\nStarting with the first takeover strategy, as you read this, countries around the world are in the process of voting on amendments to the IHR.8 By May 28, 2022, the World Health Assembly will have concluded their vote on these amendments and, if passed, they will be enacted into international law in November 2022.\n\nThe IHR, adopted in 2005, is what empowers the WHO to declare a Public Health Emergency of International Concern (PHEIC).9 This is a special legal category that allows the WHO to initiate certain contracts and procedures, including drug and vaccine contracts. While the IHR grants the WHO exceptional power over global health policy already, under the current rules, member states must consent to the WHO’s recommendations.\n\nThis is one key feature that is up for revision. Under the new amendments, the WHO would be able to declare a PHEIC in a member state over the objection of that state. The amendments also include ceding control to WHO regional directors authorized to declare a Public Health Emergency of Regional Concern (PHERC).\n\nIn summary, the IHR amendments establish “a globalist architecture of worldwide health surveillance, reporting and management,” Robert Malone, Ph.D., warns,10 and we the public have no say in the matter.\n\nWe have no official avenue for providing feedback to the World Health Assembly, even though the amendments will give the WHO unprecedented power to restrict our rights and freedoms in the name of biosecurity. There’s not even a publicly available list of who the delegates are or who will vote on the amendments.\n\nA summary of the proposed changes to the IHR was recently provided by Malone.11 In all, the WHO wants to amend 13 different IHR articles (articles 5, 6, 9, 10, 11, 12, 13, 15, 18, 48, 49, 53 and 59), the end result of which is the following:12\n\n1. “Increased surveillance — Under Article 5, the WHO will develop early warning criteria that will allow it to establish a risk assessment for a member state, which means that it can use the type of modeling, simulation, and predictions that exaggerated the risk from COVID-19 over two years ago. Once the WHO creates its assessment, it will communicate it to inter-governmental organizations and other member states.\n\n2. 48-hour deadline — Under Articles 6, 10, 11, and 13, a member state is given 48 hours to respond to a WHO risk assessment and accept or reject on-site assistance. However, in practice, this timeline can be reduced to hours, forcing it to comply or face international disapproval lead by the WHO and potentially unfriendly member states.\n\n3. Secret sources — Under Article 9, the WHO can rely on undisclosed sources for information leading it to declare a public health emergency. Those sources could include Big Pharma, WHO funders such as the Gates Foundation and the Gates-founded-and-funded GAVI Alliance, as well as others seeking to monopolize power.\n\n4. Weakened sovereignty — Under Article 12, when the WHO receives undisclosed information concerning a purported public health threat in a member state, the Director-General may (not must) consult with the WHO Emergency Committee and the member state. However, s/he can unilaterally declare a potential or actual public health emergency of international concern.\n\nThe Director General’s authority replaces national sovereign authority. This can later be used to enforce sanctions on nations.”\n\nOnce the amendments are adopted by the World Health Assembly, nations will have only a limited time — six months — to reject them. That would put us into November 2022. Any nation which hasn’t officially rejected the amendments will then be legally bound by them, and any attempt to reject them after the six-month grace period will be null and void.\n\nAttack No. 2: The WHO Pandemic Treaty\n\nThe second attempt to gain global control is through an international pandemic treaty with the WHO. An intergovernmental negotiating body (INB) was established as a subdivision of the World Health Assembly in December 2021,13 for the purpose of drafting and negotiating this new pandemic treaty.\n\nIn summary, the WHO wants to make its pandemic leadership permanent. It can then extend its power into the health care systems of every nation, and eventually implement a universal or “socialist-like” health care system as part of The Great Reset.\n\nWhile a WHO-based universal health care system is not currently being discussed, there’s every reason to suspect that this is part of the plan. WHO Director-General Tedros Adhanom Ghebreyesus has previously stated that his “central priority” as director-general is to push the world toward universal health coverage.14\n\nAnd, considering the WHO changed its definition of “pandemic” to “a worldwide epidemic of a disease,”15 without the original specificity of severe illness that causes high morbidity,16,17 just about anything could be made to fit the pandemic criterion.\n\nThe problem with this treaty is that it simply cannot work. The whole premise behind this pandemic treaty is that “shared threat requires shared response.” But a given threat is almost never equally shared across regions.\n\nTake COVID-19 for example. Not only is the risk of COVID not the same for people in New York City and the outback of Australia, it’s not even the same for all the people in those areas, as COVID is highly dependent on age and underlying health conditions.\n\nThe WHO insists that the remedy is the same for everyone everywhere, yet the risks vary widely from nation to nation, region to region, person to person. They intend to eliminate individualized medicine and provide blanket rulings for how a given threat is to be addressed, and this can only result in needless suffering — not to mention the loss of individual freedom.\n\nAre You Ready to Cede All Authority to Gates-Led Group?\n\nIn closing, Gates’ GERM team would be the ones with the authority to declare pandemics and coordinate global response.18 Are you ready to cede all authority over your life, health and livelihood to the likes of Gates? I hope not.\n\nIn the video above, Del Bigtree with “The Highwire” provides poignant examples where Gates is now admitting what “The Highwire,” I and many others have been saying since the earliest days of the COVID pandemic, and getting censored and deplatformed for it.\n\nGates is two years behind everyone else, yet despite his apparent inability to interpret the readily available data, he now wants power to dictate health rules to the whole world. We can’t let that happen.\n\nIt’s going to require a global response to prevent these two power grabs, starting with the IHR amendments under vote by the World Health Assembly. To that end, the World Council for Health has launched a global #StopTheWHO campaign. Here’s how you can get involved:19", "opengraph": {"title": "Bill Gates the bioterrorist’s plan for global control", "type": "article", "url": "https://www.twisted.news/2022-05-27-bill-gates-bioterrorists-plan-for-global-control.html", "site_name": "Twisted News", "description": "In “The Corbett Report” above,1 independent journalist James Corbett reviews the contents of Bill Gates’ book, “How to Prevent the Next Pandemic.” “It’s every bit as infuriating, nauseating, ridiculous, laughable and risible as you would expect,” he says. “This is a ridiculous book … There’s certainly nothing of medical or scientific value in here … It’s a baffling […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/05/Editorial-Use-Bill-Gates-Microphone.jpg"}, "tags": ["conspiracy", "International health regulations", "big government", "enslaved", "bioterrorism", "deep state", "global control", "COVID", "globalists", "deception", "national security", "bill gates", "surveillance", "who pandemic treaty", "corruption", "Plandemic", "propaganda", "Tyranny"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "570", "height": "315", "embed_code": "<iframe class=\"youtube-player\" src=\"https://www.youtube.com/embed/KyRkbe5wfcQ?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" width=\"570\" height=\"315\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe>", "src": "https://www.youtube.com/embed/KyRkbe5wfcQ?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://expose-news.com/2022/05/26/bill-gates-bioterrorist/", "https://takecontrol.substack.com/p/the-who-pandemic-treaty?s=r", "https://expose-news.com/2022/05/26/bill-gates-bioterrorist/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-05-27-bill-gates-bioterrorists-plan-for-global-control.html&linkname=Bill%20Gates%20the%20bioterrorist%E2%80%99s%20plan%20for%20global%20control", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}