{"result_id": "321004", "URL": "https://twisted.news/2023-02-16-romanian-senator-claims-turkeys-earthquake-caused-by-geological-weapon.html", "timestamp": "2023-04-25 17:45:28 CEST+0200", "meta": {"description": "Romanian Senator Diana Lovanovici spoke out at the Romanian Parliament recently. She believes “globalists” have been using pandemic messaging, vaccine programs, and global censorship to carry out genocide against the human race. For years, members of the World Economic Forum (WEF) have claimed that the Earth is overpopulated, that the human race needs to be […]", "lang": "en", "keywords": "conspiracy,decpetion,deep state,depopulation,earthquake,earthquake machines,environment,geological weapons,Globalism,globalists,NATO,peace,President Erdogan,psychopaths,Russian,tectonic inteference,Turkey,Ukraine,wef,World War Three", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2023-02-16-romanian-senator-claims-turkeys-earthquake-caused-by-geological-weapon.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Romanian Senator claims Turkey’s earthquake was caused by a geological weapon, part of a mass genocide agenda", "cleaned_text": "Romanian Senator claims Turkey’s earthquake was caused by a geological weapon, part of a mass genocide agenda\n\nRomanian Senator Diana Lovanovici spoke out at the Romanian Parliament recently. She believes “globalists” have been using pandemic messaging, vaccine programs, and global censorship to carry out genocide against the human race. For years, members of the World Economic Forum (WEF) have claimed that the Earth is overpopulated, that the human race needs to be reduced to achieve planetary goals.\n\nRomanian Senator Diana Lovanovici believes that these “demented and psychopathic people” are causing wars, leveraging natural disasters to their advantage, while creating man-made catastrophes to kill off as many people as possible. She also made the claim that these psychopaths are using “geological weapons” to cause catastrophic earthquakes and aftershocks.\n\n“It is very clear to me that at this point, things at the international level have gotten out of hand, the fools are playing as God, and they think they have won the game.” Lovanovici said “these demented and psychopathic people who cause wars and cataclysms using unconventional weapons” view humans as “just numbers they can get rid of.”\n\nEvidence of geological weapons surfaces in Turkey, to allegedly punish President Erdogan for his neutrality in the Ukrainian-Russian war\n\n“Dear fellow Senators,” Lovanovici began. “For three years, we have been experiencing a real campaign of mass killing worldwide, either through alleged pandemics and the imminent need to inject untested vaccines that kill people, or through wars that reduce the world’s population, but rearranges international politics, realigns power poles and alters borders. We have lived to witness the production of earthquakes on command which is actually an attack on Turkey by the greatest of the world who totally disliked being set up by Recep Tayyip Erdogan, the President of Turkey.”\n\nThe President of Turkey has remained neutral in the Ukrainian-Russian war. Erdogan has tried to mediate, instead of escalate the war and further the death toll. As the second greatest military power within NATO, President Erdogan is in a position to escalate the war in Ukraine, but time and time again, he has showed restraint. He refused to expand NATO’s presence to Russia’s border, and he even blocked Sweden’s accession to NATO.\n\nNow it appears that the psychopaths are trying to wage war against their own allies, coercing more world leaders to join in on World War Three. Lovanovici claims that geological weapons have “existed for a very long time” for experimental purposes. She claims they are currently being used in Turkey to retaliate against President Erdogan.\n\nThe latest 7.8 magnitude earthquake that impacted Southern Turkey and Syria claimed the lives of roughly 33,000 people. Tens of thousands more have suffered significant injuries after facing severe aftershocks that felt “like Armageddon.”\n\nLovanovici said, the earthquake has produced “150 aftershocks…without the existence of an epicenter” in an area that has been “artificially stimulated by geological weapons.” The secret service in Turkey is currently investigating criminal intervention in the chain reaction events that destabilized the tectonic plates in the region.\n\n“Now, it has been put into practice. If we look carefully at the map of Turkey, we will see that it is furrowed by gas and oil pipelines, this being actually one of the goals: their destruction,” she said. “But, 10 seconds before the occurrence of the so-called earthquake, the Turks closed these pipelines. In addition, 24 hours before the earthquake, 10 countries withdrew their ambassadors from Turkey. Five days before its occurrence, the Romanian Ministry of Foreign Affairs issued a travel warning for Romanian citizens in Turkey, although there was no danger, as did other countries. By killing people, they served their interests. The maps shown on all the television channels show that there was no epicenter, but a line with thousands of earthquakes.”\n\nRomanian Senator calls for the death penalty for all psychopaths who are killing off the population\n\nLovanovici stood up for Romania and the sovereignty, protection, and peace of the people, that they would not be used as cannon fodder in a psychopaths’ war.\n\n“It is imperative that all the nations, the peoples of the world, rise up together, wake up from daily comfort and carelessness, and just like in 1848 we’ll begin the struggle for liberation from the yoke of psychopaths, of demented people who steal our happiness and the beautiful world in that we live in. That’s why I urge all of you who still want to live in a world of God, and not of Satan, I urge you to rise up to fight, to a world revolt to free us all and to destroy these enemies, because in this moment we are in LEGITIMATE DEFENSE.”\n\nShe finished, “TAKE THE CLAWS OFF TURKEY! TAKE THE CLAWS OFF ROMANIA! TAKE THE CLAWS OFF GOD’S PEOPLE! WARNING TO THE PSYCHOPATHS OF THE WORLD: IF YOU NEED PEOPLE TO DIE, WE NEED YOU TO PERISH TOO! IT’S ALL OR NOTHING! AN EYE FOR AN EYE AND A TOOTH FOR A TOOTH! TALION’S LAW!”", "opengraph": {"title": "Romanian Senator claims Turkey’s earthquake was caused by a geological weapon, part of a mass genocide agenda", "type": "article", "url": "https://www.twisted.news/2023-02-16-romanian-senator-claims-turkeys-earthquake-caused-by-geological-weapon.html", "site_name": "Twisted News", "description": "Romanian Senator Diana Lovanovici spoke out at the Romanian Parliament recently. She believes “globalists” have been using pandemic messaging, vaccine programs, and global censorship to carry out genocide against the human race. For years, members of the World Economic Forum (WEF) have claimed that the Earth is overpopulated, that the human race needs to be […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2023/02/Earthquake-Seismograph-Seismometer-Quake-3D-Detector-Activity.jpg"}, "tags": ["conspiracy", "deep state", "President Erdogan", "Turkey", "peace", "globalists", "environment", "tectonic inteference", "earthquake machines", "wef", "earthquake", "depopulation", "decpetion", "NATO", "World War Three", "psychopaths", "Russian", "geological weapons", "Ukraine", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/02/must-watch-romanian-senator-slams-globalists-mass-genocide-using-alleged-pandemic-covid-death-jabs-claims-turkeys-earthquake-man-made-attack-video/", "https://twitter.com/CallMeTripleSix/status/1624796919745888258", "https://www.thegatewaypundit.com/2023/02/must-watch-romanian-senator-slams-globalists-mass-genocide-using-alleged-pandemic-covid-death-jabs-claims-turkeys-earthquake-man-made-attack-video/", "https://twitter.com/CallMeTripleSix/status/1624796919745888258", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2023-02-16-romanian-senator-claims-turkeys-earthquake-caused-by-geological-weapon.html&linkname=Romanian%20Senator%20claims%20Turkey%E2%80%99s%20earthquake%20was%20caused%20by%20a%20geological%20weapon%2C%20part%20of%20a%20mass%20genocide%20agenda", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}