{"result_id": "321019", "URL": "https://www.twisted.news/2020-12-10-canada-approves-pfizer-biontech-vaccine-aborted-fetal-cell-line.html", "timestamp": "2023-04-25 17:45:42 CEST+0200", "meta": {"description": "Canada has given its approval to the COVID-19 vaccine from Pfizer-BioNTech despite the fact that it was tested on fetal cells that were taken from an aborted baby. In Health Canada’s announcement of the approval, they said: “The data provided supports favourably the efficacy of Pfizer-BioNTech COVID-19 vaccine as well as its safety.” In their […]", "lang": "en", "keywords": "aborted fetal cell lines,abortions,anaphylaxis,badhealth,badmedicine,cell lines,coronavirus,covid-19,evil,health freedom,Pfizer,Twisted,vaccine,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2020-12-10-canada-approves-pfizer-biontech-vaccine-aborted-fetal-cell-line.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "Canada approves Pfizer-BioNTech vaccine tested on aborted fetal cell line", "cleaned_text": "Canada has given its approval to the COVID-19 vaccine from Pfizer-BioNTech despite the fact that it was tested on fetal cells that were taken from an aborted baby.\n\nIn Health Canada’s announcement of the approval, they said: “The data provided supports favourably the efficacy of Pfizer-BioNTech COVID-19 vaccine as well as its safety.”\n\nIn their announcement, they made it clear that the vaccine should not be given to young people, stating: “The vaccine is approved for people who are 16 years of age and older. Its safety and effectiveness in people younger than 16 years of age have not yet been established.”\n\nHowever, not surprisingly, their official website downplays the potential side effects of the vaccine, saying that they are similar to those seen with other shots and are “mild or moderate.”\n\nThe website says that the potential adverse effects “included things like pain at the site of injection, body chills, feeling tired and feeling feverish,” which are “common side effects of vaccines and do not pose a risk to health.”\n\n“As with all vaccines, there’s a chance that there will be a serious side effect, but these are rare. A serious side effect might be something like an allergic reaction,” they added.\n\nAllergic reactions to Pfizer vaccine prompted a warning in the UK\n\nAllergic reactions have been a major concern in the UK, who had to issue an anaphylaxis warning on the Pfizer vaccine after administering it for just a few days and warned people with a history of allergies to medicine, vaccines or food not to get the jab. Anaphylaxis occurs when the immune system overreacts to something, and it can be life-threatening. The reactions are believed to be caused by the polyethylene glycol, or PEG, the vaccine contains.\n\nAnd although Health Canada has said that the data they reviewed did not identify any major safety concerns, the UK government’s instructions for the same vaccine warn that it should not be given to women who are pregnant or breastfeeding. They also admit that it is not known how the vaccine could impact fertility. The UK guide also says that women should avoid getting pregnant in the first two months after receiving the vaccine.\n\nThere are also some ethical concerns at play as the vaccine was reportedly tested using the HEK 293 cell line, although it is not in the final product. This fetal cell line was derived from kidney tissue that was taken from a healthy baby boy aborted in the Netherlands some time in the 1970s.\n\nPfizer is one of the companies that has formed a partnership with the Bill and Melinda Gates Foundation to accelerate bringing these vaccines to market.\n\nPrime Minister Justin Trudeau has said that as many as 249,000 doses of the vaccine, which is administered in two doses, will be available before year’s end. These will largely be given to residents and staff in long-term care homes. The vaccines use mRNA technology and have to be kept at temperatures of between -112 and -76 degrees Fahrenheit.\n\nThe country also has contracts with six other vaccine manufacturers and is reviewing an additional three options, including Moderna’s vaccine, which may be approved soon.\n\nIn bad news for Canadians who are concerned about the vaccine, the chief medical officer of Ontario, Dr. David Williams, has said that proof of vaccination may become mandatory if people want the freedom to move around and access different buildings and facilities.\n\nDr. Michael Yeadon, who spent three decades working for pharmaceutical firms, including Pfizer, has voiced serious reservations about the vaccine, writing: “There is absolutely no need for vaccines to extinguish the pandemic. I’ve never heard such nonsense talked about vaccines. You do not vaccinate people who aren’t at risk from a disease. You also don’t set about planning to vaccinate millions of fit and healthy people with a vaccine that hasn’t been extensively tested on human subjects.”\n\nThe signs are everywhere that getting this vaccine is not a good idea, and it’s scary to think just how bad it’s going to get as mass vaccinations get underway.", "opengraph": {"title": "Canada approves Pfizer-BioNTech vaccine tested on aborted fetal cell line", "type": "article", "url": "https://www.twisted.news/2020-12-10-canada-approves-pfizer-biontech-vaccine-aborted-fetal-cell-line.html", "site_name": "Twisted News", "description": "Canada has given its approval to the COVID-19 vaccine from Pfizer-BioNTech despite the fact that it was tested on fetal cells that were taken from an aborted baby. In Health Canada’s announcement of the approval, they said: “The data provided supports favourably the efficacy of Pfizer-BioNTech COVID-19 vaccine as well as its safety.” In their […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2020/12/Coronavirus-Vaccine-Covid-19.jpg"}, "tags": ["aborted fetal cell lines", "covid-19", "abortions", "anaphylaxis", "evil", "cell lines", "vaccine", "Twisted", "vaccines", "Pfizer", "coronavirus", "health freedom"], "tweets": [], "movies": [], "links": ["https://lifesitenews.com/news/breaking-canada-approves-pfizer-vaccine-tested-on-cell-line-of-aborted-baby?utm_source=top_news&utm_campaign=standard", "https://www.reuters.com/article/health-coronavirus-britain-vaccine/uk-issues-anaphylaxis-warning-on-pfizer-vaccine-after-adverse-reactions-idUSKBN28J1DX", "https://vaccines.news/", "https://lifesitenews.com/news/breaking-canada-approves-pfizer-vaccine-tested-on-cell-line-of-aborted-baby?utm_source=top_news&utm_campaign=standard", "https://www.reuters.com/article/health-coronavirus-britain-vaccine/uk-issues-anaphylaxis-warning-on-pfizer-vaccine-after-adverse-reactions-idUSKBN28J1DX"], "authors": [], "publish_date": null}