{"result_id": "321018", "URL": "https://twisted.news/2022-03-24-states-taking-away-children-to-collect-money.html", "timestamp": "2023-04-25 17:45:41 CEST+0200", "meta": {"description": "The Social Security Disability Insurance (SSDI) is expected to run out of money by 2026 due to corrupt practices in the agency. In the March 22 episode of “Critical Disclosure Radio,” guest Pamela Olson talked about the proliferation of the SSDI pot in all 50 states for giving children “assistance.” “This is a system set up […]", "lang": "en", "keywords": "baby Cyrus,big government,child endangerment,Child Services,child trafficking,conspiracy,corruption,deception,domestic terrorism,evil,insanity,kidnapping,social services,traitors,Twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2022-03-24-states-taking-away-children-to-collect-money.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Simply EVIL: States are taking away children from parents to collect money", "cleaned_text": "Simply EVIL: States are taking away children from parents to collect money\n\nThe Social Security Disability Insurance (SSDI) is expected to run out of money by 2026 due to corrupt practices in the agency. In the March 22 episode of “Critical Disclosure Radio,” guest Pamela Olson talked about the proliferation of the SSDI pot in all 50 states for giving children “assistance.”\n\n“This is a system set up to steal children,” she said.\n\nOlson noted that the hospital, the county and even the state get the maximum amount from an over-bloated budget for all the children that they take away from their families. “Let’s save our children because literally, the government is gobbling them up like [they’re] candy,” Olson said.\n\nAccording to Olson, there are volumes of children in welfare services through the Child Welfare Bureau as social workers have been given orders to take children away from their parents if they refuse to wear masks or take the Wuhan coronavirus (COVID-19) vaccine shots.\n\nChildren, whose parents were deemed “neglectful” by the government, are taken out of their homes for around 72 hours before giving them back. The Federal Bureau of Investigation said around 88 to 92 percent of these children are harmed while put in foster care.\n\n“I’m talking physically, emotionally, mentally and or sexually; 82 percent of the time those children are sexually abused in their placement, or are trafficked in their placement,” Olson said. (Related: CPS threatens to take sick child away from mother for choosing medicinal marijuana over toxic chemotherapy.)\n\nOne of the cases that Olson talked about is with Idaho’s ten-month-old baby Cyrus, who was taken away from his parents by the state due to severe malnourishment but has been returned to them after week-long protests by activists.\n\nOfficials told the baby’s mother that they made the decision to take her son into Child Protective Services (CPS) because according to his doctors he was severely malnourished, and an officer said that their main concern was the care of the child. The mother was arrested on March 121 when she refused to give him up.\n\nMembers of People’s Rights group, as well as the child’s grandfather, called the action “medical tyranny” and accused that officials were kidnapping the child. Others called CPS a “child trafficking ring.”\n\nSome members of the group went after the presiding judge in the case. They publicly release personal information online, including audio alerts, that included the judge’s name and address of her vehicle’s VIN number. (Related: Covid TYRANNY: Judge rules child must be taken away from mother because she isn’t vaccinated.)\n\n“She is known to take children from loving parents,” the alert said, adding that she and other sex offenders in her neighborhood were working together to take children away.\n\nOlson said mothers are always the ones who are being targeted by social services. “If you’re all alone, and you’re having a child and you don’t have family around and you’re new to the area, they’re going to find a way to steal that child,” she said.\n\nShe noted that even children in abusive homes are in better shape than being removed from their environment and going someplace unfamiliar to them. She also said that because of the pandemic, children are less resilient than they were a few years ago. “Children are no longer resilient when you’ve got six-year-olds committing suicide,” she said. “This is a broken system specifically set up to ensure the American family stays broken, traumatized and unable to function.”\n\nThe younger a child is, the higher the chances they have of developing sociopathic or psychopathic tendencies. However, the main difference is in the traumas that these children experience.\n\n“It’s very difficult not to get into a victim mentality when you are a foster child because the entire system does not listen to you, treats you less than a stray dog, dresses you in filthy clothes and barely feeds and takes care of your medical and dental needs,” Olson said. “Why would these children trust anybody of any ilk after being in something like that? We are raising a distrustful, paranoid, absolutely mentally messed up future.”\n\nWatch the video below to know more about government-sanctioned “kidnapping” of children.\n\nThis video is from the Critical Disclosure Radio channel on Brighteon.com.\n\nCPS threatens to take sick child away from mother for choosing medicinal marijuana over toxic chemotherapy.\n\nCOVID Nazis? German mom has kids ripped away from her for questioning pandemic restrictions.\n\nState seizes child from mother over diaper rash as medical kidnapping accelerates.\n\nCPS takes baby from mother to ‘protect against’ parents seeking a second opinion.\n\nArmed agents kidnap child from mother who used holistic treatments instead of pharmaceutical drugs to treat condition.", "opengraph": {"title": "Simply EVIL: States are taking away children from parents to collect money", "type": "article", "url": "https://www.twisted.news/2022-03-24-states-taking-away-children-to-collect-money.html", "site_name": "Twisted News", "description": "The Social Security Disability Insurance (SSDI) is expected to run out of money by 2026 due to corrupt practices in the agency. In the March 22 episode of “Critical Disclosure Radio,” guest Pamela Olson talked about the proliferation of the SSDI pot in all 50 states for giving children “assistance.” “This is a system set up […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/03/Children-Bored-Lockdown-Covid-19.jpg"}, "tags": ["baby Cyrus", "Child Services", "big government", "conspiracy", "evil", "social services", "kidnapping", "child endangerment", "domestic terrorism", "deception", "insanity", "Twisted", "child trafficking", "traitors", "corruption"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/a8c492a2-e31c-4f4c-964d-feb3738fe3f4", "http://biggovernment.news", "https://naturalnews.com/042019_medicinal_marijuana_toxic_chemotherapy_CPS.html", "https://www.idahopress.com/news/local/after-a-week-of-protests-child-in-welfare-case-returned-to-parents/article_499b3c39-2698-54fe-8647-74eb0ffc3251.html", "http://trafficking.news", "https://naturalnews.com/2021-08-31-judge-child-taken-from-mother-not-vaccinated.html", "https://www.brighteon.com/a8c492a2-e31c-4f4c-964d-feb3738fe3f4", "https://www.brighteon.com/channels/criticaldisclosure", "https://naturalnews.com/042019_medicinal_marijuana_toxic_chemotherapy_CPS.html", "https://tyranny.news/2022-01-06-german-mom-has-kids-taken-away-for-questioning-pandemic-restrictions.html", "https://naturalnews.com/048910_medical_kidnapping_diaper_rash_cancer_survivor.html", "https://naturalnews.com/040261_CPS_child_kidnapping_medical_opinion.html", "https://tyranny.news/032090_Maryanne_Godboldo_health_freedom.html", "https://www.brighteon.com/a8c492a2-e31c-4f4c-964d-feb3738fe3f4", "https://www.idahopress.com/news/local/after-a-week-of-protests-child-in-welfare-case-returned-to-parents/article_499b3c39-2698-54fe-8647-74eb0ffc3251.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-03-24-states-taking-away-children-to-collect-money.html&linkname=Simply%20EVIL%3A%20States%20are%20taking%20away%20children%20from%20parents%20to%20collect%20money", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}