{"result_id": "321017", "URL": "https://twisted.news/2023-02-14-well-known-archaeologist-mysteriously-fired-from-job.html", "timestamp": "2023-04-25 17:45:41 CEST+0200", "meta": {"description": "Archaeologist and university professor David Keller was mysteriously fired from his job at Sul Ross State University in Texas back in December of last year, but no one wants to say why. The 52-year-old Keller made waves as an an award-winning author and courageous researcher of human history. A mid-2022 report from the university stated […]", "lang": "en", "keywords": "Big Bend National Park,big government,campus insanity,Center for Big Bend Studies,conspiracy,David Keller,deception,fascism,freedom,Liberty,politics,Sul Ross University,Suppressed,Texas,Tyranny,Unexplained,West Texas", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2023-02-14-well-known-archaeologist-mysteriously-fired-from-job.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Well-known archaeologist mysteriously fired from his job, and no one wants to say why", "cleaned_text": "Well-known archaeologist mysteriously fired from his job, and no one wants to say why\n\nArchaeologist and university professor David Keller was mysteriously fired from his job at Sul Ross State University in Texas back in December of last year, but no one wants to say why.\n\nThe 52-year-old Keller made waves as an an award-winning author and courageous researcher of human history. A mid-2022 report from the university stated that he had delivered grants to Sul Ross’ Center for Big Bend Studies (CBBS) for 21 years. But these accolades did not matter to the university, which fired Keller while he was in the midst of three significant projects.\n\n“It was humiliating, sad and infuriating all at the same time. That was my career, my livelihood and much of my identity. To fire me in such a swift and cavalier manner felt very unfair considering my time there,” Keller told Texas Monthly following his firing. The archaeologist added that he had been planning to retire in five years’ time if he was not unceremoniously terminated.\n\nHe recounted the university informing him: “We’re not going to tell you why, and we appreciate your service, and you need to pick up your stuff and go.”\n\nSeveral Sul Ross officials kept silent on the details of why Keller was axed from his position.\n\n“I don’t see how there’s a story here,” CBBS program coordinator Michelle Lacey-Olivares told the Daily Caller. Further pressing by the outlet led her to remark that Keller himself “knows why he was fired.”\n\nCBBS Director Bryon Schroeder, meanwhile, said Keller’s termination was not his decision. “It was an issue that came to life with the university. It was a university decision,” he said before refusing to comment further.\n\nSul Ross President Carlos Hernandez did not reply to requests for an interview. Provost Louis Harveson refused to speak about Keller’s termination as it was a “personnel issue.” According to Keller, Harveson was the one who informed him of his dismissal.\n\nKeller’s supporters attended his Jan. 27 going-away party at the Hotel Ritchey in Alpine, Texas. Several attendees who had collaborated with the archaeologist described him as the most virtuous and hardworking archaeologist in far West Texas. While most wanted to know the real reason for his dismissal, others were angry at how the issue was managed.\n\nAccording to the now-dismissed archaeologist, Sul Ross’ decision to terminate him stemmed from his work at Big Bend National Park near the Mexican border. Prior to his firing, Keller’s work permit there had been suspended. He added that even Harveson himself told him that his research at the park had something to do with his termination.\n\nThings may be pointing in this direction, as Keller is believed to have posed a threat to the narrative. Only two years ago, he found evidence that a group of Mexican boys and men were shot to death in 1918 by Texas Rangers and suspected members of the U.S. Cavalry. He allegedly found the remains of the victims while digging at Big Bend. (Related: Amateur archaeologist decodes messages hidden in cave art inscriptions.)\n\nIn a statement, park officials said CBBS contacted them in December 2022 concerning “issues” about Keller’s work there. They suspended his work permit, but added that the archaeologist was dismissed before “any concerns could be cleared up.”\n\nTyranny.news has more stories like this.\n\nWatch Graham Hancock expound on the global control of archaeology in the video below.\n\nThis video is from the Brian Ruhe channel on Brighteon.com.\n\nArchaeologists discover ancient tombs filled with actual GIANTS… “unusually tall and strong” people once roamed the planet.\n\nArchaeologists discover ruins of Mayan civilization in Guatemala using LiDAR technology.\n\nBible stories come to life: Archaeologists unearth extraordinary mosaic showing what might be Jesus feeding the 5,000 with five loaves.\n\nScientists uncover “invisible” ancient Hebrew inscription that can only be seen with advanced technology.", "opengraph": {"title": "Well-known archaeologist mysteriously fired from his job, and no one wants to say why", "type": "article", "url": "https://www.twisted.news/2023-02-14-well-known-archaeologist-mysteriously-fired-from-job.html", "site_name": "Twisted News", "description": "Archaeologist and university professor David Keller was mysteriously fired from his job at Sul Ross State University in Texas back in December of last year, but no one wants to say why. The 52-year-old Keller made waves as an an award-winning author and courageous researcher of human history. A mid-2022 report from the university stated […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2023/02/Your-Fired-Post-It-Note-Yellow.jpg"}, "tags": ["West Texas", "conspiracy", "big government", "Liberty", "fascism", "politics", "deception", "Suppressed", "Texas", "Unexplained", "Big Bend National Park", "David Keller", "Center for Big Bend Studies", "freedom", "campus insanity", "Sul Ross University", "Tyranny"], "tweets": [], "movies": [], "links": ["http://dailycaller.com/2023/02/07/sul-ross-fires-david-keller-archaeologist-wont-explain-why/", "http://www.sulross.edu", "http://www.texasmonthly.com/news-politics/david-keller-fired-sul-ross-state-university/", "http://campusinsanity.com", "https://www.naturalnews.com/2023-01-13-amateur-archaeologist-decodes-messages-hidden-cave-art.html", "http://Tyranny.news", "http://www.brighteon.com/d4e7a81e-cc40-4c23-b143-e8c8df4226e7", "https://www.brighteon.com/channels/brianruhe", "https://naturalnews.com/2017-07-06-archaeologists-discover-ancient-tombs-filled-with-actual-giants-unusually-tall-and-strong-people-once-roamed-the-planet.html", "https://www.research.news/2023-01-11-archaeologists-discover-mayan-civilization-ruins-using-lidar.html", "https://naturalnews.com/2020-09-22-archaeologists-unearth-mosaic-showing-jesus-feeding-5000.html", "https://naturalnews.com/2017-07-26-scientists-uncover-invisible-ancient-hebrew-inscription-that-can-only-be-seen-with-advanced-technology.html", "http://dailycaller.com/2023/02/07/sul-ross-fires-david-keller-archaeologist-wont-explain-why/", "http://www.texasmonthly.com/news-politics/david-keller-fired-sul-ross-state-university/", "http://www.brighteon.com/d4e7a81e-cc40-4c23-b143-e8c8df4226e7", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2023-02-14-well-known-archaeologist-mysteriously-fired-from-job.html&linkname=Well-known%20archaeologist%20mysteriously%20fired%20from%20his%20job%2C%20and%20no%20one%20wants%20to%20say%20why", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}