{"result_id": "321021", "URL": "https://twisted.news/2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html", "timestamp": "2023-04-25 17:45:43 CEST+0200", "meta": {"description": "In a public declaration of support this week for the transgender mutilation of children, Assistant Secretary for Health at the Department of Health and Human Services (HHS) “Rachel” Levine told America that the entire Biden regime is fully on board with surgically altering and pharmaceutically drugging the nation’s children for the purposes of promoting gender […]", "lang": "en", "keywords": "Biden,Biden regime,brainwashed,children,depopulation,drugging,evil,gay mafia,groomers,HHS,indoctrination,left cult,LGBT,mutilation,perversion,Rachel Levine,Trans,transgender,transhumanism,Twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "HHS tranny “Rachel” Levine says mutilating and drugging children has “highest support” from Biden regime", "cleaned_text": "HHS tranny “Rachel” Levine says mutilating and drugging children has “highest support” from Biden regime\n\nIn a public declaration of support this week for the transgender mutilation of children, Assistant Secretary for Health at the Department of Health and Human Services (HHS) “Rachel” Levine told America that the entire Biden regime is fully on board with surgically altering and pharmaceutically drugging the nation’s children for the purposes of promoting gender “transitions.”\n\nLevine, a mentally ill man who thinks he’s a woman, indicated that the Biden regime is offering its “highest support” for the practice, which involves removing the genitals of young boys, the breasts of young girls, and drugging both boys and girls with various cocktails of puberty blockers and cross-sex hormones.\n\nLevine’s disturbing endorsement of these horrific procedures and prescriptions occurred during an appearance he made at the Pediatric Grand Rounds session of Connecticut Children’s Medical Center in Hartford.\n\n“I’m a positive and optimistic person, and I choose to be positive, optimistic. And I think that the wheels will turn on this,” Levine said about so-called “gender-affirming care,” which is being heavily promoted right now by the left, in relation to the upcoming 2024 election.”\n\n“I think that it’s not going to be politically advantageous. It wasn’t particularly in 2022. And so, I think that as we look to all the different elections in 2024, I think the next two years are going to be challenging. But I am positive and optimistic and hopeful that the wheel will turn after that and that this issue won’t be as politically and socially such a minefield.”\n\nFirst it was homosexuality, then transgenderism, and soon they will push to normalize pedophilia\n\nTo be clear, gender-affirming care is just a nicer-sounding euphemism for the predatorial grooming and conversion of children into the Cult of LGBT. By confusing and indoctrinating them early, the trans cult has found an in to chemically and surgically castrate and destroy the bodies of the innocent – all in the name of “medicine.”\n\n“This barbaric practice is now defended with a religious fervor from the modern Pedo-Left,” noted Shane Trejo, writing for BigLeaguePolitics.\n\nDr. Stanley Goldfarb from the Do No Harm advocacy organization spoke with Fox News this week about Levine’s statements, explaining that there is “no good evidence that children treated with gender-altering hormones or puberty blockers improved mental health assessments.”\n\n“Levine’s appearance at Connecticut Children’s Hospital praising ‘gender-affirming care’ for minors and claiming it will be fully embraced is wrong and must be countered,” Goldfarb said.\n\n“Despite assertions to the contrary, a recent study from the University of Washington showed that there was absolutely no change in the psychological well-being of children with gender dysphoria treated with these medications.”\n\nGoldfarb went on to stress the fact that “irrevocable harm” is being done to every child who opts for the transgender deception. All the procedures and drugging cause permanent harm that cannot be undone later in life – there is no going back, in other words, and many children with transgender regret will end up committing suicide as a result.\n\n“There can be irrevocable harm being done to children by those pushing for these radical, ideologically driven, treatments,” Goldfarb said. “Treatment for minors needs to be based on rigorous scientific inquiry, not on dubious, agenda-driven studies or the demands of activists.”\n\nIn Trejo’s view, the child transgender push will inevitably lead to the left pushing to normalize pedophilia, which is the next phase of the LGBTP agenda.\n\n“A modern Crusade needs to be fought in order to crush this insanity,” Trejo argues. “Christian Nationalism is the only answer.”\n\nThe latest news about the Biden regime’s obsession with children’s genitals can be found at Evil.news.", "opengraph": {"title": "HHS tranny “Rachel” Levine says mutilating and drugging children has “highest support” from Biden regime", "type": "article", "url": "https://www.twisted.news/2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html", "site_name": "Twisted News", "description": "In a public declaration of support this week for the transgender mutilation of children, Assistant Secretary for Health at the Department of Health and Human Services (HHS) “Rachel” Levine told America that the entire Biden regime is fully on board with surgically altering and pharmaceutically drugging the nation’s children for the purposes of promoting gender […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2023/03/rachel_0.png"}, "tags": ["left cult", "drugging", "Biden", "groomers", "HHS", "transgender", "Rachel Levine", "brainwashed", "indoctrination", "mutilation", "depopulation", "LGBT", "evil", "children", "perversion", "gay mafia", "Biden regime", "Twisted", "transhumanism", "Trans"], "tweets": [], "movies": [], "links": ["https://bigleaguepolitics.com/transgender-health-official-says-drugging-and-mutilating-children-has-highest-support-from-biden-administration/", "https://naturalnews.com/2022-03-17-usa-today-proclaims-biological-man-woman-of-year.html", "https://www.washington.edu/", "http://evil.news", "https://bigleaguepolitics.com/transgender-health-official-says-drugging-and-mutilating-children-has-highest-support-from-biden-administration/", "https://naturalnews.com/2022-03-17-usa-today-proclaims-biological-man-woman-of-year.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html&linkname=HHS%20tranny%20%E2%80%9CRachel%E2%80%9D%20Levine%20says%20mutilating%20and%20drugging%20children%20has%20%E2%80%9Chighest%20support%E2%80%9D%20from%20Biden%20regime", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}