{"result_id": "321001", "URL": "https://twisted.news/2022-01-10-twitter-genocide-censorship-ivermectin-prevent-covid-deaths.html", "timestamp": "2023-04-25 17:45:22 CEST+0200", "meta": {"description": "A pre-print study that shows positive health outcomes when taking low-dose ivermectin prophylactically has been banned from Twitter for being “misleading.” The social media giant has decided that this actual science showing a 68 percent reduction in mortality when taking ivermectin cannot be allowed on the platform – though no clear explanation was given as […]", "lang": "en", "keywords": "banned,Big Tech,Censored,Censorship,COVID,fascism,genocide,ivermectin,Plandemic,rigged,Study,tech giants,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2022-01-10-twitter-genocide-censorship-ivermectin-prevent-covid-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Twitter complicit in GENOCIDE by censoring large-scale study revealing ivermectin can prevent 68% of covid deaths", "cleaned_text": "Twitter complicit in GENOCIDE by censoring large-scale study revealing ivermectin can prevent 68% of covid deaths\n\nA pre-print study that shows positive health outcomes when taking low-dose ivermectin prophylactically has been banned from Twitter for being “misleading.”\n\nThe social media giant has decided that this actual science showing a 68 percent reduction in mortality when taking ivermectin cannot be allowed on the platform – though no clear explanation was given as to why, which suggests the “fact checkers” simply do not want people learning the truth about ivermectin.\n\nThe study involved 220,517 people in the Brazilian city of Itajaí who were offered free ivermectin from the government. The goal of the research was to determine the impact of taking ivermectin for a Wuhan coronavirus (Covid-19) infection.\n\nIt turns out that in the real world, taking ivermectin – or what the lying mainstream media and FDA have been calling “horse paste” – helps to save lives from severe covid symptoms and death.\n\nEach participant’s baseline personal and medical information was collected in order to dispense the appropriate dosages of prophylactic ivermectin, which was determined to be 0.2 mg per kilogram of body weight.\n\nThe participants were told to take this amount of ivermectin for two consecutive days every 15 days.\n\nAmong the 220,517 people in Itajaí who were offered the remedy, 133,051, or 60.3 percent, accepted it while 87,466, or 39.7 percent, declined. Those in the group that declined were evaluated as control subjects.\n\nIn the end, it was learned that “regular use of ivermectin led to a 68% reduction in COVID-19 mortality.” After adjusting for “residual variables,” that percentage jumped to 70 percent.\n\nFurther, hospitalizations in the ivermectin group were 56 percent lower compared to the control group. When adjusting for those same residual variables, the hospitalization rate in the ivermectin group were determined to be 67 percent lower.\n\n“These results indicate that medical-based optional prescription, citywide covered ivermectin can have a positive impact in the healthcare system,” the study’s authors wrote.\n\nTwitter is committing mass murder by preventing people from learning the truth about ivermectin\n\nThis is great news in the fight against covid, and is especially promising because the sample size evaluated was large. Twitter disagrees, though, and will not allow people to access the study on its platform.\n\nThis is despite the fact that the study is the “world’s largest,” according to co-author Dr. Pierre Kory, to look at the repurposing of the Nobel Prize-winning drug in the treatment of the Fauci Flu.\n\nThe paper “meticulously collected data from hundreds of thousands of patients [and found] massive reductions in hospitalization & death,” Dr. Kory tweeted before Twitter interjected to remove the “misleading” information. “The ‘Controversy’ [is thus] over.”\n\nNumerous other studies have shown promising results for ivermectin as well, demonstrating that it is exceptionally safe and powerfully effective. In fact, ivermectin is arguably the safest, cheapest and most effective way to stop covid, yet it is strictly forbidden in the United States.\n\nAccording to Twitter, which claims to be the one true oracle of all things science, publishing real-world data that favors the use of ivermectin constitutes “misinformation.” Anyone who tries will have the tweet blocked from being “replied to, shared or liked.”\n\n“Wow, Twitter can’t be bothered to explain why they disagree with the methodology of this research paper,” tweeted Alachua Chronicle editor Jennifer Cabrera about Twitter’s censorship of the new Brazilian study.\n\n“They just label it misinformation. That probably means you should read it.”\n\nIn the comment section over at LifeSiteNews, one person suggested that ivermectin is far safer than the “DNA-mRNA vaccines” being peddled by the government.\n\n“If FDA authorizes EUA vaccine use … they are GROSSLY negligent by not giving ivermectin a similar EUA,” this same person added.\n\nMore related news about social media censorship can be found at Censorship.news.", "opengraph": {"title": "Twitter complicit in GENOCIDE by censoring large-scale study revealing ivermectin can prevent 68% of covid deaths", "type": "article", "url": "https://www.twisted.news/2022-01-10-twitter-genocide-censorship-ivermectin-prevent-covid-deaths.html", "site_name": "Twisted News", "description": "A pre-print study that shows positive health outcomes when taking low-dose ivermectin prophylactically has been banned from Twitter for being “misleading.” The social media giant has decided that this actual science showing a 68 percent reduction in mortality when taking ivermectin cannot be allowed on the platform – though no clear explanation was given as […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/01/Prescription-Medicine-Orange-Caplet-Disease-Doctor-Drug.jpg"}, "tags": ["Censored", "fascism", "tech giants", "banned", "rigged", "COVID", "Censorship", "Twitter", "genocide", "ivermectin", "Study", "Plandemic", "Big Tech"], "tweets": [], "movies": [], "links": ["https://www.researchgate.net/publication/356962821_Ivermectin_Prophylaxis_Used_for_COVID-19_Reduces_COVID-19_Infection_and_Mortality_Rates_A_City-Wide_Prospective_Observational_Study_of_220517_Subjects_Using_Propensity_Score_Matching", "https://www.lifesitenews.com/news/twitter-suppresses-massive-study-showing-ivermectin-reducing-covid-mortality-by-68/", "https://naturalnews.com/2021-12-29-medical-deep-state-continues-lie-about-ivermectin.html", "http://censorship.news", "https://www.researchgate.net/publication/356962821_Ivermectin_Prophylaxis_Used_for_COVID-19_Reduces_COVID-19_Infection_and_Mortality_Rates_A_City-Wide_Prospective_Observational_Study_of_220517_Subjects_Using_Propensity_Score_Matching", "https://www.lifesitenews.com/news/twitter-suppresses-massive-study-showing-ivermectin-reducing-covid-mortality-by-68/", "https://naturalnews.com/2021-12-29-medical-deep-state-continues-lie-about-ivermectin.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-01-10-twitter-genocide-censorship-ivermectin-prevent-covid-deaths.html&linkname=Twitter%20complicit%20in%20GENOCIDE%20by%20censoring%20large-scale%20study%20revealing%20ivermectin%20can%20prevent%2068%25%20of%20covid%20deaths", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}