{"result_id": "321040", "URL": "https://www.twisted.news/2021-10-26-america-north-korea-re-education-camps-cdc-grocery-stores-cardboard-food.html", "timestamp": "2023-04-25 17:45:59 CEST+0200", "meta": {"description": "If you’re wondering whether America will plunge into a Venezuela-style financial collapse vs. a North Korea-style tyrannical authoritarian police state, it seems that the North Korea outcome is currently winning the race. The CDC — Centers for Disease Creation — is now demanding that unvaccinated police and government workers be “forcibly re-educated” reports NewsPunch. It […]", "lang": "en", "keywords": "badhealth,badmedicine,CDC,communism,food shortage,food supply,grocery,insanity,Marxism,medical fascism,Medical Tyranny,obey,Orwellian,outrage,propaganda,re-education camps,vaccine wars,vaccines,Walensky", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2021-10-26-america-north-korea-re-education-camps-cdc-grocery-stores-cardboard-food.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "America becomes North Korea: Re-education camps announced by the CDC, grocery stores display cardboard food printouts to hide bare shelves while Biden babbles", "cleaned_text": "America becomes North Korea: Re-education camps announced by the CDC, grocery stores display cardboard food printouts to hide bare shelves while Biden babbles\n\nIf you’re wondering whether America will plunge into a Venezuela-style financial collapse vs. a North Korea-style tyrannical authoritarian police state, it seems that the North Korea outcome is currently winning the race.\n\nThe CDC — Centers for Disease Creation — is now demanding that unvaccinated police and government workers be “forcibly re-educated” reports NewsPunch. It sounds like something ripped right out a soviet-era brainwashing and indoctrination plot:\n\nCDC Director Rochelle Walensky declared that the Biden regime is planning to force unvaccinated police and government workers to take “counseling” and lessons so that they change their minds about taking the shots.\n\n“There is a plan, should these people not want to be vaccinated, towards education and counseling to get people the information they need so that they are feeling comfortable in getting vaccinated,” Walensky declared.\n\nSo if you disagree with the idea of being injected with a deadly, experimental cocktail that has likely already killed at least 250,000 Americans (source: Dr. Zev Zelenko), you are somehow in dire need of mental help, according to the CDC.\n\nYou are no longer allowed to have an informed, rational view based on available data. Your mental health will be challenged — and “corrected” — in order to conform to the delusions of the very State that’s trying to exterminate you.\n\nGrocery store shelves being “stocked” with cardboard posters depicting food products in order to cover bare shelves\n\nOne of the key characteristics of totalitarian regimes is the incessant effort to conceal the failures of their disastrous policies. As inflation grips the nation, they pretend there’s no real inflation at all. As the supply chain collapses, they mock those who complain and tell you to “lower your expectations.” And as grocery store shelves go bare, they go to tremendous lengths to create the illusion that shelves still contain an abundance of food, even if they have to print out food posters on cardboard on install the cardboard into the food bins where the actual food is supposed to be.\n\nThe following photos show this already happening the US and UK:\n\nGosh, the fake products even have price tags to make them more convincing:\n\nThe only bins not half empty are the ones with fake printouts:\n\nAnd here’s an example of “filling out” a shelf that would otherwise look empty if not for all the cans of chow mein being spread out:\n\nMaking the fake food supply chain collapse scenario even worse, fake president Joe Biden is threatening to force truck drivers all across the country to take the covid death shots. According to The Epoch Times, nearly one-third of truckers might just quit rather than get jabbed.\n\nIf you think the supply chain problems are bad right now, wait to see what happens if even a quarter of the current truck drivers throw in the towel. We’re talking supply chain-a-geddon scenarios for years to come. Mass famine won’t be far behind…\n\nGet full details on all this and much more in today’s Situation Update podcast, which also features a comedy routine about the prosecution of Chinese bioware scientists called, “Hu’s on first?”\n\nGet a new podcast each day (and amazing interviews) at:", "opengraph": {"title": "America becomes North Korea: Re-education camps announced by the CDC, grocery stores display cardboard food printouts to hide bare shelves while Biden babbles", "type": "article", "url": "https://www.twisted.news/2021-10-26-america-north-korea-re-education-camps-cdc-grocery-stores-cardboard-food.html", "site_name": "Twisted News", "description": "If you’re wondering whether America will plunge into a Venezuela-style financial collapse vs. a North Korea-style tyrannical authoritarian police state, it seems that the North Korea outcome is currently winning the race. The CDC — Centers for Disease Creation — is now demanding that unvaccinated police and government workers be “forcibly re-educated” reports NewsPunch. It […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2021/10/Fake-Food-Grocery-Shelves.jpg"}, "tags": ["food shortage", "communism", "vaccine wars", "medical fascism", "Orwellian", "Marxism", "grocery", "re-education camps", "Medical Tyranny", "vaccines", "food supply", "obey", "outrage", "Walensky", "insanity", "propaganda", "CDC"], "tweets": [], "movies": [], "links": ["https://newspunch.com/cdc-director-unvaccinated-police-government-workers-to-be-forcibly-re-educated/", "https://m.theepochtimes.com/mkt_morningbrief/biden-plays-chicken-with-semitruck-drivers_4063261.html", "http://Brighteon.com/8002a292-316d-43d8-8fbf-cd2cc3c5b071", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2021-10-26-america-north-korea-re-education-camps-cdc-grocery-stores-cardboard-food.html&linkname=America%20becomes%20North%20Korea%3A%20Re-education%20camps%20announced%20by%20the%20CDC%2C%20grocery%20stores%20display%20cardboard%20food%20printouts%20to%20hide%20bare%20shelves%20while%20Biden%20babbles", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}