{"result_id": "321016", "URL": "https://twisted.news/2023-01-27-project-veritas-bombshell-pfizer-illegal-gain-function.html", "timestamp": "2023-04-25 17:45:40 CEST+0200", "meta": {"description": "Dr. Robert Malone had the privilege of helping Project Veritas put together a new exposé about Pfizer’s covid cash cow: its mRNA covid “vaccine.” An undercover Project Veritas reporter spoke with Jordon Trishton Walker, who is in charge of Pfizer’s research and development, strategic operations, and mRNA scientific planning division. What he revealed is nothing […]", "lang": "en", "keywords": "Big Pharma,cash cow,corruption,COVID,deception,directed evolution,evil,gain-of-function,Illegal,money supply,Pfizer,pharmceutical fraud,Project Veritas,Twisted,vaccine,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2023-01-27-project-veritas-bombshell-pfizer-illegal-gain-function.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Project Veritas BOMBSHELL: Pfizer director admits company carries out illegal gain-of-function research", "cleaned_text": "Dr. Robert Malone had the privilege of helping Project Veritas put together a new exposé about Pfizer’s covid cash cow: its mRNA covid “vaccine.”\n\nAn undercover Project Veritas reporter spoke with Jordon Trishton Walker, who is in charge of Pfizer’s research and development, strategic operations, and mRNA scientific planning division. What he revealed is nothing short of shocking.\n\nIn essence, Pfizer is engaged in illegal gain-of-function research – or some tweaked version of it called “directed evolution” – that the company is using to develop an endless stream of new injections for all the latest “variants” and “subvariants.”\n\nWalker admitted on tape that Pfizer is working on intentionally “mutating” the disease so it evades all previous mRNA injections – that way those who took the initial series and boosters will need to take even more of them in the coming months and years.\n\nThe following video is the final product of Dr. Malone and Project Veritas’ latest work concerning Pfizer’s ongoing covid injection scam:\n\nIs Pfizer creating and unleashing new covid strains so people keep taking its latest vaccines?\n\nIn a nutshell, Walker confirmed what many have already long known about Pfizer: that the company only cares about money. Pfizer also has no ethics or morals, so it is willing to do whatever it takes to get that money – including by committing crimes.\n\nWalker admitted, then tried to backtrack, that Pfizer is essentially performing gain-of-function research – but with a twist – on the covid virus. Its goal is to get ahead of the latest variants and subvariants by already having new injections ready before they appear.\n\nMuch like how vaccine corporations try to predict what the next “seasonal flu” strain will be in advance, Pfizer has begun tampering with covid in an effort to see how it might mutate next in order to have new vaccines ready and waiting.\n\n“You’re not supposed to do gain of function research with the viruses,” Walker said. “They recommend not. But you do things like selected directional mutations to try to see if you can make it more potent.”\n\nIn other words, Pfizer is manipulating covid in an attempt to make it stronger and more infectious – and maybe even more deadly. Then the company plans to have the “cure” ready for people after the more potent strain has been released.\n\n“They’re still kind of conducting the experiments on it, but it seems like from what I’ve heard they’re kind of optimizing it,” Walker added about Pfizer’s work on mutating covid. “But they’re going slow because everyone’s very cautious. They obviously don’t want to accelerate too much.”\n\nWalker then admitted to the reporter that this was Pfizer’s plan all along: to keep covid as “a cash cow” that continues to generate obscene profits for the company. And with the help of “revolving door” politics between government and industry, there should be no problems getting each new vaccine iteration approved and released at warp speed.\n\n“The gentleman seems to have absolutely no moral compass at all about what he’s doing. The hubris and arrogance and immaturity,” Malone commented about Walker’s admissions during the interview.\n\n“If this is the quality of individuals within Pfizer that are making these huge decisions that risk global public health with such a casual disregard for the human toll, it’s profoundly corrupt in terms of would it be feasible for Pfizer to circumvent international or national law? I think that is undeniable.”\n\nThe latest news about Pfizer can be found at Evil.news.", "opengraph": {"title": "Project Veritas BOMBSHELL: Pfizer director admits company carries out illegal gain-of-function research", "type": "article", "url": "https://www.twisted.news/2023-01-27-project-veritas-bombshell-pfizer-illegal-gain-function.html", "site_name": "Twisted News", "description": "Dr. Robert Malone had the privilege of helping Project Veritas put together a new exposé about Pfizer’s covid cash cow: its mRNA covid “vaccine.” An undercover Project Veritas reporter spoke with Jordon Trishton Walker, who is in charge of Pfizer’s research and development, strategic operations, and mRNA scientific planning division. What he revealed is nothing […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2023/01/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["vaccine wars", "evil", "Big Pharma", "Project Veritas", "directed evolution", "Illegal", "COVID", "pharmceutical fraud", "deception", "vaccine", "Twisted", "gain-of-function", "Pfizer", "vaccines", "cash cow", "corruption", "money supply"], "tweets": [], "movies": [], "links": ["https://www.projectveritas.com/news/pfizer-executive-mutate-covid-via-directed-evolution-for-company-to-continue/", "https://rwmalonemd.substack.com/p/project-veritas-has-broken-pfizers", "https://naturalnews.com/2021-10-08-pfizer-admits-covid-vaccines-aborted-baby-cells.html", "http://evil.news", "https://www.projectveritas.com/news/pfizer-executive-mutate-covid-via-directed-evolution-for-company-to-continue/", "https://rwmalonemd.substack.com/p/project-veritas-has-broken-pfizers", "https://naturalnews.com/2021-10-08-pfizer-admits-covid-vaccines-aborted-baby-cells.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2023-01-27-project-veritas-bombshell-pfizer-illegal-gain-function.html&linkname=Project%20Veritas%20BOMBSHELL%3A%20Pfizer%20director%20admits%20company%20carries%20out%20illegal%20gain-of-function%20research", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}