{"result_id": "321027", "URL": "https://www.twisted.news/2021-01-21-vaccine-skeptics-labeled-extremist-groups-merger-big-pharma-police-state.html", "timestamp": "2023-04-25 17:45:48 CEST+0200", "meta": {"description": "The rise (and success) of President Donald Trump and the threat his tens of millions of supporters pose to the existing establishment order (the deep state) is so immense there is a movement afoot by the powers that be to eliminate them before they grow strong and organized enough to take America back. One of […]", "lang": "en", "keywords": "Alexandria Ocasio-Cortez,authoritarianism,badhealth,Big Pharma,Britain,CNN,Congress,coronavirus,covid-19,enemies,extremists,fake science,Imran Ahmed,media,medical fascism,obey,pandemic,President Trump,science,terrorists,Trump administration,Tyranny,U.S.,vaccine concerns,vaccine danger,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2021-01-21-vaccine-skeptics-labeled-extremist-groups-merger-big-pharma-police-state.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "Vaccine skeptics now being labeled part of “extremist” groups in latest merger of Big Pharma and the police state government", "cleaned_text": "Vaccine skeptics now being labeled part of “extremist” groups in latest merger of Big Pharma and the police state government\n\nThe rise (and success) of President Donald Trump and the threat his tens of millions of supporters pose to the existing establishment order (the deep state) is so immense there is a movement afoot by the powers that be to eliminate them before they grow strong and organized enough to take America back.\n\nOne of the ways this effort is taking shape is to simply designate Trump’s supporters, among them Americans who remain skeptical of vaccines, as “extremist” groups, enemies of the state and terrorists.\n\nAs Big Pharma — bolstered by the former president’s COVID-19 vaccine push — grows in wealth and power, the industry is emulating Corporate America and Big Tech by growing closer to the leviathan federal government.\n\nAs noted by Technocracy News, last month The Hill claimed the “anti-vaccination movement sees COVID-19 as an opportunity” to shore up its opposition, adding: As public health officials seek to reassure Americans on the safety and efficacy of the COVID-19 vaccine, anti-vaccine efforts could prevent the country from reaching herd immunity.”\n\nMeanwhile, a separate report in The Times said the British “government regards tackling false information about COVID-19 vaccination as a rising priority,” likely for the very same concern.\n\nAnd yet, how do ‘democracies’ justify utilizing cyber warfare against citizens just to implement public health policies that not all may agree with (and certainly policies that ‘the science’ doesn’t always prove)?\n\nAren’t concerns over the safety of vaccines legitimate? Should they not be part of the policy debate and discussion? Since when is it okay to impose uncertain healthy policies on supposedly free people the same way a dictatorial leader would? (Related: After abandoning objective science and endorsing left-wing political agendas, how is the Lancet still considered a medical journal?)\n\nNot if the objective, the real objective, is control over the population; when control is the overriding goal, then discussion is an impediment.\n\nAnd along those lines, ‘opponents’ to government policy — in this case, when governments have decided that ‘vaccines are good’ and ‘dissent to vaccines is bad,’ the powers that be then must not simply disagree with their opponents, they have to demonize, dehumanize and de-legitimize them, even if it means putting their lives in danger with false accusations of “extremism.”\n\nIn July 2020, Imran Ahmed, a member of the Steering Committee on Countering Extremism Pilot Task Force under the British government’s Commission for Countering Extremism and the chief executive of the Centre for Countering Digital Hate (CCDH), told The Independent he considers anti-vaxxers “an extremist group that pose a national security risk,” because “once someone has been exposed to one type of conspiracy it’s easy to lead them down a path where they embrace more radical world views that can lead to violent extremism.”\n\nWho thinks like this? Authoritarians do. Dictators. Tyrants. There is absolutely nothing to link concern over vaccines to violent extremism. Nothing.\n\nBut the same kind of tyranny is brewing in the ‘land of the free’ — across the pond in America.\n\nBefore President Trump even boarded Air Force One out of D.C., Democrats and their sick, twisted media lapdogs began fantasizing about “deprogramming” his 74 million-plus supporters by sending them all to ‘reeducation camps’ so they can indoctrinate them back into the Biden/Democrat/Deep State fold.\n\nSome of them have actually said as much out loud, including Marxist-Anarchist Alexandria Ocasio-Cortez. The New York Post reported:\n\nOcasio-Cortez said the House subcommittee on civil rights she serves on has held hearings over the prior two years on white supremacy and said there are programs to “de-radicalize” brain-washed adherents.\n\nBut she said funding was not a priority for those programs during the Trump years.\n\n“There are people who are radicalized right now. It’s going to take a very long time to de-radicalize these people and a lot of effort,” she said.\n\nJust a few years ago, she would have been run out of Congress for saying things like that. Now, post-Trump, she not only gets away with it, she is celebrated for it and her thoughts are echoed across other platforms — including so-called “news” networks like CNN, whose ‘media watchdog’ doesn’t even push back on calls to censor competitors.\n\nSee more at Vaccines.news.", "opengraph": {"title": "Vaccine skeptics now being labeled part of “extremist” groups in latest merger of Big Pharma and the police state government", "type": "article", "url": "https://www.twisted.news/2021-01-21-vaccine-skeptics-labeled-extremist-groups-merger-big-pharma-police-state.html", "site_name": "Twisted News", "description": "The rise (and success) of President Donald Trump and the threat his tens of millions of supporters pose to the existing establishment order (the deep state) is so immense there is a movement afoot by the powers that be to eliminate them before they grow strong and organized enough to take America back. One of […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2021/01/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["pandemic", "vaccine danger", "Big Pharma", "Congress", "U.S.", "covid-19", "coronavirus", "obey", "President Trump", "vaccine wars", "science", "Alexandria Ocasio-Cortez", "media", "Imran Ahmed", "Tyranny", "medical fascism", "Britain", "enemies", "terrorists", "vaccine concerns", "CNN", "Trump administration", "vaccines", "extremists", "authoritarianism"], "tweets": [], "movies": [], "links": ["https://www.technocracy.news/mercola-digital-anti-hate-group-labels-vaccine-skeptics-as-national-security-threat/", "https://www.naturalnews.com/2021-01-20-how-is-the-lancet-still-considered-a-medical-journal.html", "https://nypost.com/2021/01/15/aoc-proposes-funding-to-deprogram-white-supremacists/", "http://www.vaccines.news", "https://nypost.com/2021/01/15/aoc-proposes-funding-to-deprogram-white-supremacists/", "https://www.technocracy.news/mercola-digital-anti-hate-group-labels-vaccine-skeptics-as-national-security-threat/", "https://www.naturalnews.com/2021-01-20-how-is-the-lancet-still-considered-a-medical-journal.html"], "authors": [], "publish_date": null}