{"result_id": "321031", "URL": "https://twisted.news/2021-03-07-vaccinating-gorillas-at-zoos-coronavirus.html", "timestamp": "2023-04-25 17:45:52 CEST+0200", "meta": {"description": "The first animals to be jabbed with Wuhan coronavirus (Covid-19) vaccines live at the San Diego Zoo, which is experimenting with the injections to see how other mammals besides humans respond to them. Several orangutans and bonobos have reportedly received the shots, which were “developed specifically for animals.” A couple great apes considered to be […]", "lang": "en", "keywords": "animals,badhealth,badmedicine,badscience,coronavirus,covid-19,gene therapy,gorillas,immunization,insanity,lunatics,medical fascism,mRNA,San Diego Zoo,vaccination,vaccine,vaccine wars,Zoetis", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://twisted.news/2021-03-07-vaccinating-gorillas-at-zoos-coronavirus.html", "encoding": "UTF-8"}, "image": null, "domain": "twisted.news", "title": "Now they’re vaccinating gorillas at the zoo for coronavirus", "cleaned_text": "Now they’re vaccinating gorillas at the zoo for coronavirus\n\nThe first animals to be jabbed with Wuhan coronavirus (Covid-19) vaccines live at the San Diego Zoo, which is experimenting with the injections to see how other mammals besides humans respond to them.\n\nSeveral orangutans and bonobos have reportedly received the shots, which were “developed specifically for animals.” A couple great apes considered to be “most at risk” and “easily vaccinated” were also given two doses each of the Chinese virus vaccine for animals.\n\nThe animal jab was developed by a veterinary pharmaceutical company called Zoetis, which says the doses should be administered about three weeks apart from one another.\n\n“This isn’t the norm,” Nadine Lamberski, the chief conservation and wildlife health officer at the San Diego Zoo Wildlife Alliance, told National Geographic.\n\n“I haven’t had access to an experimental vaccine this early in the process and haven’t had such an overwhelming desire to want to use one.”\n\nThe move comes after eight gorillas at the zoo tested “positive” for Chinese germs back in January.\n\n“The gorilla troop at the San Diego Zoo Safari Park are doing well and appear to be on their way to a full recovery,” the zoo said in a statement.\n\nDogs, cats, mink, tigers, lions and various other animals have also reportedly tested positive for the China flu, though this could be a fluke seeing as how even a papaya tested “positive” last spring.\n\nZoetis is a subsidiary of Pfizer, which makes mRNA coronavirus vaccines for humans\n\nZookeepers and conservationists are particularly concerned about gorillas as all species of them are currently listed as endangered or critically endangered on the IUCN Red List, which classifies “susceptibility to disease” as a primary threat.\n\nWith fear-mongering about the spread of Covid-19 still at a fever pitch, it is understandable that those who watch the news are afraid that all gorillas everywhere might drop dead.\n\nThis writer is surprised that the San Diego Zoo has not yet tried to force its gorillas and other animals to wear a mask at all times so as to avoid infecting their close familial groups, not to mention masked visitors.\n\nHeck, the gorillas could wear two or even three masks, which would provide added protection. Any gorilla that removes the masks or pulls them below the nose could be fined or banned from the exhibit.\n\n“Now more than ever before, we can all see the important connection between animal health and human health,” said a spokesman from Zoetis, a subsidiary of Pfizer, which manufactures the infamous two-dose messenger RNA (mRNA) Chinese virus vaccine for humans.\n\n“While thankfully a Covid vaccine is not needed for cats and dogs at this time, we have applied our early development work to help the Great Apes at the San Diego Zoo and in other species on an experimental basis for emergency uses.”\n\nSo far, the zoo says no vaccinated animals have suffered any visible adverse reactions. It is unclear what the Zoetis vaccine for animals actually contains, and whether it is similar to the human variety made by Pfizer.\n\n“It’s not like we randomly grab a vaccine and give it to a novel species,” the company added. “A lot of thought and research goes into it – what’s the risk of doing it and what’s the risk of not doing it. Our motto is, above all, to do no harm.”\n\nLamberski insists that because the vaccine is made for a specific pathogen rather than a specific species, it can be given to gorillas, birds, or any other creature at the facility. Many of the apes at the zoo also receive flu and measles vaccines that were originally developed for humans.\n\nTo keep up with the latest strange news about the Wuhan coronavirus (Covid-19), be sure to check out Pandemic.news.", "opengraph": {"title": "Now they’re vaccinating gorillas at the zoo for coronavirus", "type": "article", "url": "https://www.twisted.news/2021-03-07-vaccinating-gorillas-at-zoos-coronavirus.html", "site_name": "Twisted News", "description": "The first animals to be jabbed with Wuhan coronavirus (Covid-19) vaccines live at the San Diego Zoo, which is experimenting with the injections to see how other mammals besides humans respond to them. Several orangutans and bonobos have reportedly received the shots, which were “developed specifically for animals.” A couple great apes considered to be […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2021/03/Gorilla-Animal-Ape.jpg"}, "tags": ["gorillas", "San Diego Zoo", "covid-19", "immunization", "medical fascism", "gene therapy", "vaccine wars", "Zoetis", "vaccine", "lunatics", "animals", "coronavirus", "insanity", "mRNA", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.cbsnews.com/news/great-apes-san-diego-zoo-receive-covid-19-vaccine/", "https://www.naturalnews.com/2020-05-10-faulty-coronavirus-tests-in-tanzania-false-positives.html", "http://pandemic.news", "https://www.cbsnews.com/news/great-apes-san-diego-zoo-receive-covid-19-vaccine/", "https://www.naturalnews.com/2020-05-10-faulty-coronavirus-tests-in-tanzania-false-positives.html"], "authors": [], "publish_date": null}