{"result_id": "321039", "URL": "https://www.twisted.news/2022-07-18-who-planning-to-keep-global-pandemic-going.html", "timestamp": "2023-04-25 17:45:58 CEST+0200", "meta": {"description": "The globalists in the World Health Organization (WHO) are preparing to unleash the next infectious disease to keep the world under control until at least 2030. This is according to Marion Koopmans, a Dutch virologist who works with the WHO. She admitted during an interview that the organization has a 10-year plan, supposedly to deal with the […]", "lang": "en", "keywords": "badhealth,badscience,bill gates,biological warfare,biological weapons,bioterrorism,biowar,conspiracy,covid-19,David Sorensen,deep state,enslaved,evil,globalists,infections,insanity,Marion Koopmans,outbreak,Plandemic,Twisted,World Health Organization", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.twisted.news/2022-07-18-who-planning-to-keep-global-pandemic-going.html", "encoding": "UTF-8"}, "image": null, "domain": "www.twisted.news", "title": "WHO is planning to keep the pandemic going for 10 years, pushing new diseases if necessary", "cleaned_text": "WHO is planning to keep the pandemic going for 10 years, pushing new diseases if necessary\n\nThe globalists in the World Health Organization (WHO) are preparing to unleash the next infectious disease to keep the world under control until at least 2030.\n\nThis is according to Marion Koopmans, a Dutch virologist who works with the WHO. She admitted during an interview that the organization has a 10-year plan, supposedly to deal with the current Wuhan coronavirus (COVID-19) pandemic and an expected second pandemic. (Related: WHO attempts to take control of future plandemics in a “totalitarian power grab” move.)\n\n“This has been in the WHO’s 10-year plan for some time,” said Koopmans. “That plan says that there will be a major infectious disease crisis.”\n\n“Why does the WHO have a 10-year plan announcing 10 years of pandemics? How can they know?” asked David Sorensen in a video detailing evidence that the WHO is planning to keep the pandemic going until 2030.\n\nFor context, Koopmans is a former member of the WHO’s first team to go to China to investigate the origins of the COVID-19 pandemic. She was removed from the group following reports revealing her extensive ties to the Chinese Communist Party.\n\nIndependent news site the National Pulse exposed Koopmans’ role on a scientific advisory board for the Centers for Disease Control of Guangdong, China.\n\n“She has advised on the building of the laboratory capacity for emerging infectious disease detection in this region, and has ongoing research collaborations trying to unravel emergence and spread of viruses through the animal production chain in this region,” read a summary of her work with the Chinese-run body.\n\nBill Gates heavily involved in planning the next pandemic\n\nBill Gates, who has accumulated an additional $50 billion in wealth simply by distributing vaccines, is part of the effort preparing the world to accept that the next pandemic is on its way.\n\nDuring an interview with liberal comedian Stephen Colbert, Gates admitted that there will be a “pandemic two” once the world is no longer willing to go along with the restrictions put in place for the COVID-19 pandemic, which he calls “pandemic one.”\n\n“Most of the work we’re going to do to be ready for pandemic two – I call this pandemic one – most of the work we’ll do to be ready for that are also the things we need to do to minimize the threat of bioterrorism,” said Gates.\n\nIn a separate interview, Gates and his ex-wife Melinda even admitted that the next pandemic will keep people’s attention focused on the spreading disease.\n\n“We’ll have to prepare for the next one. That will get attention this time,” he said. Both he and Melinda were grinning and chuckling the whole time they were announcing the coming of the second pandemic.\n\nGates has been preparing for the pandemic as early as 2018, when he said a global pandemic is on its way and that it could wipe out as many as 30 million people.\n\n“Bill Gates is essentially the owner of the WHO,” commented Sorensen. He added that thousands of physicians and scientists worldwide agree that the WHO- and Gates-engineered pandemic was planned with the purpose of increasing the globalists’ control over the world and reducing the world population.\n\nLearn more about the plans of the globalists at Globalism.news.\n\nWatch this video from David Sorensen as he discusses the WHO’s 10-year plan for ongoing infectious diseases from 2020 to 2030.\n\nThis video can be found in the channel The Prisoner on Brighteon.com.\n\nInternational group funded by Bill Gates warns that one of 11 new viruses will become “next pandemic.”\n\nBiden wants more money to prepare for the “second pandemic” he promises is coming.\n\nDr. Jim Meehan: Monkeypox outbreak was ENGINEERED because people are no longer afraid of C OVID-19.\n\nNonprofit funded by CNN co-founder was PREPARING for the monkeypox outbreak in 2021.", "opengraph": {"title": "WHO is planning to keep the pandemic going for 10 years, pushing new diseases if necessary", "type": "article", "url": "https://www.twisted.news/2022-07-18-who-planning-to-keep-global-pandemic-going.html", "site_name": "Twisted News", "description": "The globalists in the World Health Organization (WHO) are preparing to unleash the next infectious disease to keep the world under control until at least 2030. This is according to Marion Koopmans, a Dutch virologist who works with the WHO. She admitted during an interview that the organization has a 10-year plan, supposedly to deal with the […]", "image": "https://www.twisted.news/wp-content/uploads/sites/29/2022/07/WHO-symbol.jpg"}, "tags": ["biological warfare", "conspiracy", "deep state", "outbreak", "covid-19", "David Sorensen", "bioterrorism", "globalists", "enslaved", "World Health Organization", "infections", "bill gates", "insanity", "Marion Koopmans", "biological weapons", "evil", "biowar", "Twisted", "Plandemic"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/d480a270-c714-4f89-a871-ea9a88c4da3c", "https://naturalnews.com/2022-06-17-who-attempts-take-control-of-future-plandemics.html", "https://thenewamerican.com/covid-investigator-removed-from-who-team-after-china-ties-revealed/", "https://stopworldcontrol.com/proof/", "https://globalism.news/", "https://www.brighteon.com/d480a270-c714-4f89-a871-ea9a88c4da3c", "https://www.brighteon.com/channels/theprisoner", "https://outbreak.news/2022-07-15-bill-gates-11-new-viruses-next-pandemic.html", "https://pandemic.news/2022-06-24-biden-wants-more-money-prepare-another-plandemic.html", "https://infections.news/2022-06-14-monkeypox-outbreak-engineered-people-not-afraid-covid.html", "https://plague.info/2022-06-13-nonprofit-preparing-for-monkeypox-outbreak-in-2021.html", "https://www.brighteon.com/d480a270-c714-4f89-a871-ea9a88c4da3c", "https://thenewamerican.com/covid-investigator-removed-from-who-team-after-china-ties-revealed/", "https://stopworldcontrol.com/proof/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ftwistednews%2F2022-07-18-who-planning-to-keep-global-pandemic-going.html&linkname=WHO%20is%20planning%20to%20keep%20the%20pandemic%20going%20for%2010%20years%2C%20pushing%20new%20diseases%20if%20necessary", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}