{"result_id": "323042", "URL": "https://www.ukcolumn.org/video/there-are-no-plans-for-an-inquiry-solely-on-vaccine-safety", "timestamp": "2023-04-25 17:46:43 CEST+0200", "meta": {"description": "An All-Party Parliamentary Group recently decided that there was no need for a vaccine safety inquiry. The dismissive decision was devastating for those suffering the reality of vaccine adverse reactions.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/there-are-no-plans-for-an-inquiry-solely-on-vaccine-safety", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "\"There are no plans for an inquiry solely on vaccine safety\"", "cleaned_text": "Charlet Crichton, a founder member of support group UK CV Family, and Dr Christian Buckland, psychotherapist and counsellor, Doctor of Psychology, recount their experiences at the recent All-Party Parliamentary Group (APPG) on Vaccine Damage held at Westminster on 20 October 2022 under the chairmanship of Sir Christopher Chope. Dr Buckland has been supporting the group and attended the meeting at UK CV Family’s invitation. The two guests discuss with Brian Gerrish and Debi Evans the devastating decision by the UK Government not to commission an inquiry specifically into Covid vaccination harms.\n\nUK CV Family currently has over 800 members who, ‘following the science’ and trusting the Government, accepted their invitation for a Covid-19 vaccine but have been abandoned by the NHS, experts and professionals since they started to suffer serious adverse reactions. Sir Christopher Chope's positive contact with the jab-injured and his willingness to help ensure that a cross-party meeting was scheduled. It should be noted that Charlet and her UK CV Family colleague Caroline Pover, along with other vaccine-injured people, have worked tirelessly to achieve this engagement by parliamentarians, despite being feeling very unwell much of the time.\n\nThe original APPG meeting, scheduled for 16 September, was postponed due to the passing of Queen Elizabeth II, dashing the hopes of over seventy of the vaccine-injured who had gone to great lengths and cost to book accommodation and make special arrangements to attend. The meeting was rescheduled at short notice, giving MPs and those wishing to attend less than a week to rearrange their diaries. The effort required to attend meetings and events for those with vaccine injuries is immense, both physically and psychologically.\n\nWith many uninjured members of the public in attendance at the rescheduled meeting, it was disappointing to see that many of the vaccine-injured who had facilitated the meeting had been sidelined, as other agendas became central to the debate. Professional experts were preferred on the day to those who are experts by experience, who felt excluded.\n\nFrustrated at how the meeting agenda had appeared to change, the vaccine-injured found their voices were silenced, or at times even publicly chastised. Trapped between a rock and a hard place, those with vaccine injuries find themselves on the receiving end of cruel comments from many of the vaccinated, who refuse to believe that injections could be responsible for their symptoms, and some of the unvaccinated, who call them ‘stupid’ for having been injected.\n\nIt is for those of us who are fortunate enough to have good health to advocate for those who are vaccine-injured. There but for the grace of God go any of us. There is no room for recriminations or blame: the race is on to get this community the help, advice and compassion that they need, through no fault of their own. Some, tragically, have taken their own lives in desperation; others have lost their homes, jobs and income. Many have used all their savings to seek expert opinions that the NHS has not offered them, as detailed in previous UK Column interviews.\n\nThis honest, humble and truthful interview allows Charlet Crichton to speak on behalf of those she represents, and of those who may not have been able to attend or who did attend but were not afforded the real evidence from the real experts: those living with Covid vaccine adverse reactions.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/there-are-no-plans-for-an-inquiry-solely-on-vaccine-safety", "title": "\"There are no plans for an inquiry solely on vaccine safety\"", "description": "An All-Party Parliamentary Group recently decided that there was no need for a vaccine safety inquiry. The dismissive decision was devastating for those suffering the reality of vaccine adverse reactions.", "image": "https://www.ukcolumn.org/sites/default/files/2022-11/No%20Plans%20for%20Vaccine%20Safety%20Charlet%20Thumb.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/search?keywords=Crichton", "https://ukcvfamily.org", "https://www.ukcolumn.org/search?keywords=Buckland", "https://www.parallelparliament.co.uk/APPG/covid-19-vaccine-damage", "https://www.ukcolumn.org/search?keywords=Chope", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "https://www.ukcolumn.org/video/vaccine-damage-real-people-wayne"], "authors": [], "publish_date": "2022-11-08T18:33:31+00:00"}