{"result_id": "323023", "URL": "https://www.ukcolumn.org/article/why-are-we-still-giving-people-covid-19-vaccines", "timestamp": "2023-04-25 17:46:32 CEST+0200", "meta": {"description": "The refusal by the MHRA to consider vaccine injury makes a mockery of any pretensions they claim to have that their only concern is public safety.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/why-are-we-still-giving-people-covid-19-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Why Are We Still Giving People COVID-19 Vaccines?", "cleaned_text": "Recently, Austria, Denmark, Norway, Iceland, Estonia, Latvia, Lithuania, Luxembourg, Romania and Italy put a hold on their roll out of the AstraZeneca COVID-19 vaccine, AZD1222.\n\nIn the case of Italy, this followed the deaths of 43-year-old soldier Stefan Patern and 50-year-old Sardinian police officer, David Villa.\n\nBoth men were taken ill and died within 48 hrs of receiving the vaccine. This added to the growing tally in Italy of people who have died shortly after vaccination. Neither man was known to have any underlying health conditions.\n\nAustria, Estonia, Latvia, Luxembourg and Lithuania temporarily halted the roll out of one specific batch of the Astrazeneca's vaccine following concerns raised about potential blood clotting problems.\n\nAustria suspended their roll out following the death of a 49-year-old nurse, and severe health complications apparently induced in a 35-year-old woman who suffered a pulmonary embolism after vaccination with AZD1222.\n\nDenmark, Norway and Iceland temporarily suspended all AstraZeneca vaccines, pending investigation. Soren Brostrom Director General of the Danish Health Authority, said:\n\nMeanwhile, in the UK, Dr Phil Brian, safety lead for the Medicines and Healthcare products Regulatory Agency (MHRA), urged people to continue with their vaccinations:\n\nThis approach seems to be at odds with the precautionary principle. Other European countries have suspended their use of the vaccine precisely because they don't know if there is a link between the vaccines and the deaths. The correlation is the reason for caution, yet the MHRA are suggesting that caution need not be applied.\n\nIt is hard to understand this rationale. There are no completed clinical trials for any of the vaccines currently being administered across the UK and mainland Europe.\n\nPfizer's phase III trial won't be completed until January 2023 and AstraZeneca’s will be complete in February 2023.\n\nWhile the MHRA highlight that the link between the blood clotting problems and the vaccines has not been confirmed, the safety and efficacy of the vaccines have not been confirmed either. The MHRA makes no mention of this.\n\nThe MHRA's most recent adverse events report notes that more than 500 people have died shortly after receiving COVID-19 vaccines:\n\nThis statement is concerning. The MHRA seems to be claiming that if a person dies shortly after receiving a COVID-19 vaccine this does not indicate that there is any link to the vaccine.\n\nThis is simply wrong. If someone dies shortly following the administration of a drug then it does indicate that the drug may have been the cause, even if it does not prove it.\n\nThe MHRA and UK government appear to want it both ways here: a death following vaccination, no matter the cause, is not vaccine related, yet a death following a positive SARS-CoV-2 PCR test result, no matter the cause, is definitively a COVID-19 death. In neither case is there a determination to investigate.\n\nThe MHRA is also eager to highlight that those who have died following the vaccine were elderly people or people with underlying illness. Clearly they consider this another reason not to consider any vaccine injury possible.\n\nAccording to the Office of National Statistics (ONS), of the approximate 125,000 deaths attributed COVID-19 in the UK around 113,000 were over the age of 65.\n\nOf these, approximately 19,000 were aged between 65 -74, around 40,000 deaths were among those aged 75 - 84 and the remaining 54,000 were aged over 85.\n\nUp until October 2020, the average age of a COVID-19 death in the UK was 82.4 years. This was slightly older than the average age of mortality from all other causes which was 81.5 years.\n\nIn December 2020, the ONS responded to a freedom of information request seeking further information on comorbidity associated with COVID-19 mortality. They stated that up until June 2020 only 8.9% of COVID-19 deaths had no other underlying illness. The remaining 91.1% had at least 1 other underlying illness, with an average of 2.3 comorbidities per decedent recorded during March and April 2020. However, the ONS added:\n\nIt appears every effort has been made to maximise reported COVID-19 mortality while minimising, or even denying, any vaccine related mortality.\n\nThe picture is not any better in the EU. COVID-19 vaccines approved by the European Medicines Agency (EMA) haven’t completed clinical trials either.\n\nModerna's mRNA vaccine phase III trial isn't due for completion until October 2022 and Johnson & Johnson's Janssen trials won't conclude until May 2023. The other two vaccines approved by the EMA are Astrazeneca's AZD1222 and Pfizer/BioNTech's BNT162b2 (called Comirnaty in the EU.)\n\nHowever, statements from the Danish authorities and other national regulators indicate the same disparity between required standards of evidence as we have seen here in the UK.\n\nThis has not gone unnoticed by the scientific and medical community.\n\nTraditional vaccines, such as whole pathogen and sub unit vaccines, work by introducing dead or weakened pathogens to stimulate a direct immunological response.\n\nNucleic Acid Vaccines, such as mRNA and recombinant vector vaccines work differently. They introduce genetic material to encode the cellular production of an antigen response without exposure to the target pathogen.\n\nBoth mRNA and recombinant vector vaccines are types of gene based vaccines.\n\nAstrazeneca AZD1222 is a recombinant vector vaccine. It uses a genetically modified chimpanzee adenovirus to carry a SARS-CoV-2 spike protein to the cells which the immune system then recognises to elicit an an immune response.\n\nPfizer/BioNTech's and Moderna's vaccines are based upon messenger RNA (mRNA) encapsulated in lipid nano-particles, which protect the mRNA from being broken apart by the body's enzymes. Once the mRNA enters the cell it stimulates the production of the SARS-CoV-2 spike protein, prompting the subsequent immune response.\n\nWhile both recombinant viral vector and mRNA are relatively new vaccine technologies, mRNA gene based vaccines have never been used with a human population. Given that there are no completed clinical trials this means they are, in fact, experimental gene based vaccines.\n\nIn light of the concerning reports of increased mortality and adverse events related to the vaccines, a group of eminent scientists and physicians calling themselves Doctors for COVID Ethics, have submitted an open letter the European Medicines Agency (EMA).\n\nHaving thoroughly reviewed the available trial data and scientific literature, they urgently sought answers to their scientific and medical concerns.\n\nThe letter was submitted privately as a matter of urgency to the EMA on 28 February, 2021. The EMA did not respond, therefore the scientists and physicians published the letter for all to see on 10 March.\n\nThey noted the correlation between the vaccine roll-out and the spike in mortality in care homes. This correlation suggests that the MHRA's belief that there are just over 500 vaccine deaths following vaccination may be an underestimate. However, as the MHRA do not accept the concept of vaccine related deaths, an investigation by the UK's vaccine regulator seems unlikely.\n\nOf primary concern to the Doctors for COVID Ethics was the potential for the vaccines to damage endothelial cells which form the barrier between blood vessels and tissues, including the blood brain barrier, potentially leading to problems including blood clots. This was something one the the eminent signatories Professor Sucharit Bhakdi highlighted in his video statement.\n\nThey sought evidence from the EMA that the trials had ruled out the possibility that the gene based vaccines wouldn't get into the blood stream and precipitate a potentially fatal overreaction of the immune system.\n\nThey asked for evidence that the potential for blood coagulation and a profusion if ischaemic lesions had been ruled out prior to approval. If the EMA could not provide this evidence Doctors for COVID Ethics informed the EMA:\n\nThere is clearly enough anecdotal, statistical, scientific and medical evidence to have serious misgivings about the so called emergency approval of these vaccines, especially considering, as pointed out by Doctors for COVID Ethics, that they were approved after most of the population had already been exposed to SARS-CoV-2.\n\nThe silence from the EMA and the refusal to even consider vaccine injury by the MHRA, makes a mockery of any pretensions they claim to have that their only concern is public safety.\n\nTheir continual refusal to consider the scientific and medical opinion, not only of qualified people across the continent, but also of some of the most eminent, is beginning to look very suspicious indeed.\n\nYou can read more of Iain's work at In This Together", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/why-are-we-still-giving-people-covid-19-vaccines", "title": "Why Are We Still Giving People COVID-19 Vaccines?", "description": "The refusal by the MHRA to consider vaccine injury makes a mockery of any pretensions they claim to have that their only concern is public safety.", "image": "https://www.ukcolumn.org/sites/default/files/vaxcover.png", "article:author": "Iain Davis", "article:publisher": "UKColumn", "article:published_time": "2021-03-12T21:18:00+00:00", "article:modified_time": "2021-05-27T22:27:33+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://novice.svet24.si/clanek/novice/svet/604a3916d1c09/smrti-vojaka-in-policista-po-cepljenju-z-astrazeneco", "https://www.rte.ie/news/coronavirus/2021/0311/1203346-coronavirus-vaccine/", "https://clinicaltrials.gov/ct2/show/study/NCT04368728?term=NCT04368728&rank=1", "https://clinicaltrials.gov/ct2/show/study/NCT04368728?term=NCT04368728&rank=1", "https://web.archive.org/web/20210311120336/https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsregisteredweeklyinenglandandwalesprovisional/latest", "https://archive.is/ThrPB", "https://www.ons.gov.uk/aboutus/transparencyandgovernance/freedomofinformationfoi/covid19deathswithnootherunderlyinghealthconditions", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsinvolvingcovid19englandandwales/deathsoccurringinapril2020", "https://www.ema.europa.eu/en/human-regulatory/overview/public-health-threats/coronavirus-disease-covid-19/treatments-vaccines/covid-19-vaccines", "https://www.clinicaltrials.gov/ct2/show/NCT04470427", "https://www.clinicaltrials.gov/ct2/show/NCT04614948?term=NCT04614948&draw=2&rank=1", "https://www.niaid.nih.gov/research/vaccine-types", "https://timesofindia.indiatimes.com/india/this-is-how-the-oxford-vaccine-works/articleshow/77101858.cms", "https://doctors4covidethics.medium.com/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-f6e17c311595", "https://www.ukcolumn.org/article/why-there-correlation-between-vaccine-rollout-and-increased-covid%E2%80%9319-mortality", "https://bit.ly/3rGIRgD", "https://in-this-together.com"], "authors": [], "publish_date": "2021-03-12T21:18:00+00:00"}