{"result_id": "323049", "URL": "https://www.ukcolumn.org/article/what-explains-rising-cases-among-the-vaccinated", "timestamp": "2023-04-25 17:46:49 CEST+0200", "meta": {"description": "Developing evidence suggests that an intrinsic component of the innate immune system, tasked with recognising and activating the immune system to respond to bacteria and viruses, may be altered after vaccination.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/what-explains-rising-cases-among-the-vaccinated", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "What Explains Rising Cases Among the Vaccinated?", "cleaned_text": "In a prior article, this author has covered how mRNA Covid vaccine has been demonstrated to alter the function of toll-like receptors (TLRs). It was hypothesised that the functional change may be connected to anecdotal reports of both an increase and change in cancer presentation. In addition, because of the importance of TLRs in recognising foreign invaders in the body, including viruses, those changes may lead to an increased risk of infection, including SARS-CoV-2, and may hamper the safe resolution of said infection.\n\nThis article will introduce to the reader the concept of Innate Trained immunity (ITM), and speculate how this may be playing an important but generally unrecognised part in the battle against Covid-19. By drawing on current infection data; vaccine-induced alteration of TLR function; and ITM, we will tentatively expand the original hypothesis.\n\nFor a significant time, the fundamental understanding of the immune system separated it into two broad categories: Innate & Adaptive. The innate part was usually first in to the battle against infection but was considered non-specific, in that it did not possess a specific memory of the foreign invader. It had not adapted to it, and was more of a blunt instrument, albeit effective. Innate immunity can clear infection without inducing long-lived adaptive immunity antibodies\n\nOn the other hand, the adaptive immune system, takes a while longer to respond and learn how to specifically and more efficiently deal with the invader, generating highly specific memory antibodies.\n\nVaccination aims to stimulate that adaptive response so that if you become infected, the immune system will be primed to specifically deal with it:\n\nThe innate and adaptive arms of the immune system interact, in reality, in complex ways and both need to function optimally in order that we remain healthy and free of disease.\n\nMore recently, the view that components of the innate immune system did not possess adaptive functions has changed and, indeed, there is an adaptive function. That is important because it may indicate that a potentially lethal flaw in our immune system – that the adaptive immune system can out compete the innate immune system, and leave us vulnerable to viral adaption - may be mitigated.\n\nHow does the innate immune system generate adaptive immunity? One word - Epigenetics:\n\nSimply put: Epigenetics is the study of control mechanisms of genes, that are inherited from one generation to the next. Of note, Epigenetics specifically references inherited control mechanisms that alter the expression of genes, and not inherited genes.\n\nThis is an important distinction and describes a vital process, without which, the Human Race would not have survived. For example, if a tribe moved from a very hot climate to a very cold climate, and they relied solely on their genes to adapt, it may take generations for the most efficient genes to aid survival to be selected. Too late for the tribe. But if the control mechanisms could up-regulate certain genes and down regulate others to find the best adaptive fit, quickly, then survival is better assured.\n\nOne of the earliest indications of epigenetic changes, was work done on Woolly Mammoths and Neanderthals:\n\nWould it not be a logical conclusion, therefore, that the immune system also possessed an ability to adapt epigenetically – even the innate immune system?\n\nDr Mihai G. Netea writes in The epigenetic ghost of infections past:\n\nImportant genetic control mechanisms such as methylation and acetylation are rapidly reprogramming how our genes are expressed, in order to adapt them to the current infectious environment. Just like they did for our ancestors.\n\nLau et al in Epigenetic control of innate and adaptive immune memory demonstrate the effects of those epigenetic controls:\n\nPresently, we have plausible biological, epigenetic mechanisms that support an expanded view of the immune response in general and innate immunity, specifically. But what of current data?\n\nBelow is a graph depicting the relative risk reduction of Covid-19 cases between the vaccinated and unvaccinated. It is based on English data including vaccine uptake in the population:\n\nThe yellow trendline with a high R2 demonstrates that the higher the percentage of vaccine uptake, the less protection one has against acquiring Covid-19. From left to right also reflects younger to older cases, a consequence of vaccine roll-out reflecting older age groups being vaccinated first. The graph was generated from age-stratified data comparing the risk of Covid-19 between the vaccinated and unvaccinated. So, as we move from left to right, the vaccinated are at higher risk of infection and Covid-19 compared to the unvaccinated.\n\nThe graph shows that as more of the population is vaccinated (green arrow), the vaccinated are protected less and are at greater risk of infection compared to the unvaccinated (red arrow)\n\nOne explanation that may arise to explain the decreasing trend-line (yellow) is age. As the increase in vaccine uptake from left to right would reflect the vaccine roll-out: older first; younger last. But each plot reflects stratified age data: vaccinated and unvaccinated matched by age groups. So, as vaccine uptake increased (and presumably the longer one had been vaccinated) the risk of infection and being a Covid-19 case also increased, compared to the unvaccinated.\n\nAnother reason for the difference between vaccinated and unvaccinated may be waning antibodies. Although waning antibody protection after vaccination does contribute to the poor results of the vaccinated, it doesn’t explain them completely.\n\nIf it was just waning antibodies, then the graph plots would show a levelling-off of risk between the vaccinated and unvaccinated; it wouldn’t show an increased risk for the vaccinated. Something else is happening here.\n\nFrom a prior article we discussed how toll-like receptors detect foreign pathogens, raise the alarm and activate the innate immune system. We also noted that a key paper by Dominguez-Andres et al demonstrated that:\n\nThat being the case, are we seeing it play out in current Covid-19 data? We term that negative hampering of TLRs, Immune Tolerance; the opposite of adaptive trained immunity.\n\nOn the other hand we know from published literature that naturally infected and recovered Covid-19 case are showing trained innate immunity.\n\nInterestingly, recovery from the infection is accompanied by long-term transcriptional, epigenetic and functional rewiring of monocytes (also called trained immunity), inducing changes in the innate immune responses after COVID-19.\n\nCould it be that the unvaccinated are benefiting from trained immunity and the vaccinated are being hampered with immune tolerance? And is that sufficient to change the course of disease in the vaccinated versus unvaccinated populations?\n\nOne of the confusing problems with the data was the apparent decreased mortality rate of the vaccinated, whilst the infection rates seemed to be moving in the opposite direction. Alarming suggestions of Marek’s disease aside, it just didn’t make sense.\n\nHowever, this recent analysis by Professor Fenton may shed some light on that:\n\nGiven the above, is a clearer picture perhaps beginning to form? Are the vaccinated, that appear to be starting to show both an increased rate of Covid-19 cases and, from Professor Fenton’s analysis, mortality, compared to the unvaccinated, suffering from a vaccine-induced modification of vital, innate immune mechanisms?\n\nIf so, are the unvaccinated and vaccinated populations diverging: is one becoming more immunologically trained, benefiting from greater protection from Covid-19 disease and death; and the other, immunologically tolerant, and doing worse?\n\nThere is abundant evidence now that natural immunity is robust and long lasting by comparison to vaccine-induced immunity. But we are told that is it beneficial, even if recovered from natural infection, to be vaccinated. This author’s view, given the above data alone, not even considering the exhaustive analysis beyond the scope of this article, does not support that conclusion. Relying on a temporary increase in antibody levels as justification to get vaccinated after infection fails to take into account the complexity of the immune response, and may be detrimental.\n\nAre we surprised, therefore, to read the following from Eurosurveillance:\n\nDoes vaccination abrogate the protection afforded to a naturally infected and recovered person, that tends not to be re-infected? An important question, but the above report does not fill us with much confidence, also noting that the HCW was wearing full PPE.\n\nDeveloping evidence suggests that an intrinsic component of the innate immune system called toll-like receptors, tasked with recognising and activating the immune system to respond to bacteria and viruses, may be altered after vaccination. That alteration may hamper the immune system’s ability to detect and act appropriately against SARS-CoV-2 — inducing, in part, an Immune Tolerance, and increasing the risk of significant infection.\n\nThe innate immune system, contrary to prior held views, can ‘remember’ past infections demonstrating a crucial adaptive ability called Immune Training and is essential to fight infection.\n\nCurrent data may highlight vaccine-induced Immune Tolerance as a divergence between vaccinated and unvaccinated populations, with an increase in case and mortality rates amongst the vaccinated compared to the Immune Trained unvaccinated.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/what-explains-rising-cases-among-the-vaccinated", "title": "What Explains Rising Cases Among the Vaccinated?", "description": "Developing evidence suggests that an intrinsic component of the innate immune system, tasked with recognising and activating the immune system to respond to bacteria and viruses, may be altered after vaccination.", "image": "https://www.ukcolumn.org/sites/default/files/2021-10/genetic-jigsaw.jpg", "article:author": "Dr Mike Williams", "article:publisher": "UKColumn", "article:published_time": "2021-10-30T11:57:45+01:00", "article:modified_time": "2021-10-30T12:55:14+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/stabilising-the-code", "https://www.ncbi.nlm.nih.gov/books/NBK279396/", "https://www.nature.com/articles/s41577-020-0285-6#ref-CR4", "https://www.nature.com/articles/s41577-020-0285-6#ref-CR5", "https://www.nature.com/articles/s41577-020-0285-6#ref-CR7", "https://www.nature.com/articles/s41577-020-0285-6#ref-CR6", "https://www.nature.com/articles/s41577-020-0285-6#ref-CR8", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2791696/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2791696/#R1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2791696/#R2", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2791696/#R3", "https://academic.oup.com/icb/article-abstract/60/6/1469/5848649?redirectedFrom=fulltext", "http://www.sci-news.com/genetics/neanderthals-woolly-mammoths-cold-adaptation-genes-07078.html", "https://www.nature.com/articles/s41577-021-00605-z.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6225771/", "https://www.ukcolumn.org/article/stabilising-the-code", "https://www.medrxiv.org/content/10.1101/2021.05.03.21256520v1.full.pdf", "https://www.nature.com/articles/s41556-021-00689-8", "http://www.eecs.qmul.ac.uk/~norman/papers/inconsistencies_vaccine.pdf", "https://brownstone.org/articles/79-research-studies-affirm-naturally-acquired-immunity-to-covid-19-documented-linked-and-quoted/", "https://medicalxpress.com/news/2021-10-vaccine-doses-boost-antibody-airways.html", "https://www.eurosurveillance.org/content/10.2807/1560-7917.ES.2021.26.39.2100822#html_fulltext", "https://www.eurosurveillance.org/content/10.2807/1560-7917.ES.2021.26.39.2100822#r5"], "authors": [], "publish_date": "2021-10-30T11:57:45+01:00"}