{"result_id": "323047", "URL": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iii-the-hot-lots", "timestamp": "2023-04-25 17:46:46 CEST+0200", "meta": {"description": "In the central part of his testimony to Reiner Füllmich, Dr Mike Yeadon sets out with graphic evidence from the US VAERS reporting system why it is mathematically impossible for the same substance to be contained in all batches of Covid jabs, unless the data fed into VAERS is unusably bad.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iii-the-hot-lots", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Dr Mike Yeadon's key testimony — Part III: The Hot Lots", "cleaned_text": "So, then, moving on to the hot lots: I mentioned earlier that I came up with an explanation for why many people have no side effects [from Covid injections] and [yet] some people get very ill and even die. That might be true, but the reason I even [took a while before I] thought of it was that you should expect pharmaceutical mass manufacturers to be good at least at one thing—and they are very good at this: consistent high-quality purity manufacture from batch to batch. They’re very good at this because that’s what their business is: they manufacture tablets, capsules, sprays and injections in the billions of doses. If you think of something like Lipitor, a cholesterol-lowering drug: it’s given to a substantial minority of the population in older age—you know, one tablet a day, forever. They would have made tens of billions of doses. It’s not easy to make these [new Covid] genetic vaccines, but making a few hundred million, I think, would be absolutely in the wheelhouse of Janssen & Janssen and Pfizer. Moderna, at least, was a new company, so I can’t say; but I trusted that these companies were doing what I knew they were very good at doing: what they did for their business. [But] then I stumbled across a couple of people independently who'd been doing their own analysis of the [US-specific] VAERS database. What they were doing, and no-one else seemed to have done it, was: they were pulling the vaccine batch or lot number—it might be eight digits, six digits, a mixture of alphanumeric characters—and comparing the profile of adverse events, comparing one lot to another lot with the same manufacturer. Their expectation was, it would be like a scattering of adverse events across all the [US] states and all of the lots—but they didn’t find that. This person [Craig Paardekooper] found that something like 90 per cent of the adverse events were associated with less than 10 per cent of the lots. [Note by UK Column: What is debated by some of those poring over the data subsequently is whether the batch numbers as supplied by the manufacturers are perhaps so riddled with typographical errors, such as mistaking zeros for letter O and ones for letter I, that batches might be inadvertently lumped together in this analysis. Yeadon does address this point below.] I remember seeing that some months ago, and I immediately knew the significance of it, because—as I’ve said—although I’m not in any way a manufacturing expert, I worked for decades with people who were, and I knew their pride and the necessity of meeting their anti-adulteration regulations, which require tremendously reproducible product from lot to lot.\n\nI’m elaborating a little bit to tell you that they don’t just throw everything into a bucket, like home brewing beer: stir it a bit, put it in the bucket. All this is done with just incredible levels of control—as you'd expect: you want it to be reproducible. So the effects of following what’s called good manufacturing practice, or GMP—as required by a medical regulator even for an emergency-approved product—[are that] it should be the case that the lots effectively contain the same stuff wherever it was made and whenever it was made: it’d be the same stuff. And I know they’re capable of doing that. Now, if that’s true, [then] if you draw a lot at random from the VAERS system and examine the outcomes, the performance—that is, the number of people who’ve reported adverse events—it ought to be pretty similar from batch to batch to batch. If it’s very different, I’m afraid I can tell you with certainty—I would be able to prove this mathematically if needed, in court—it’s not possible to go from two or three adverse events reported for a given lot and another lot [to] have 5,000 adverse events. It’s not possible if you only vary the products a little bit. You might imagine, “Well, they’re doing this at speed and it’s novel; Mike’s being a bit hard on them.” No. if you only have a small difference, you only get a small difference in the performance. If you go from effectively nothing to the worst outcomes ever reported to VAERS, I am prepared to state and to prove that that means it’s not the same material in the lots that produce bad side effects. You may not appreciate the significance of what I just told you, that it’s not the same stuff. If you thought [what everyone’s been getting] was the Pfizer/BioNTech Covid-19 vaccine that was used in the clinical trials: some of the batches contain something different. I cannot know what it is, but it’s definitely not the same stuff. As the above slide sets out, if it contains the same product, the performance should be pretty similar; just a little variation.\n\nI'm not the analyst; in fact, it's an irony I'm the person speaking. I'm the only person [in Team Enigma] not capable of doing the information technology. But one reason I'm speaking is because of my deep experience of pharmaceutical research and development, and knowledge from people who are experienced about manufacture. What I've described is true. Also, the people doing this work are self-starters: we've got a degree of independence and we're all speaking out because something awful is happening. As I mentioned in my introduction, it's quite normal, I'm afraid, for every medicine to have some kind of side effect. I think it was a very old physician, Paracelsus [of the Renaissance era], that said, \"All medicines are poisonous; it's just a question of dose.\" That's kind of true: rat poison used at very low doses, or its modern analogy, can be really useful to thin your blood. But that means you need consistency from dose to dose to dose. And it was true that in the first half of the twentieth century, many pharmaceutical outfits—that were probably quite small at the time—were occasionally careless, if not outright reckless, and adulterated products. That is, products were not the same from tablet to tablet or injection into injection. And so that brought about these FDA regulations that relate to what's known as adulteration. Really, it's about reproducibility, purity and so on. For the lawyers, this is very important. My colleague who put this together taught me something I didn't know: those [early twentieth-century FDA] regulations were formed to make sure that badly manufactured products were never again foisted on the public. They said that \"if it's not made as you have described, and made consistently—so more than a tiny variation fraction of one per cent; perhaps that's allowed, batch to batch—we will declare it to be adulterated.\" And the thing is that adulteration per se—manufacturing and release of materials which I assert, and others in this team agree, are performing very differently one from another—by definition means that it's not the same stuff. By definition, it's adulterated, and I think by definition that they have broken various laws.\n\nNow, these next couple of slides are the crucial ones. Along the bottom, there are the—meaningless to me—[batch] numbers associated with all these injectable flu vaccine products over many many years, and on the vertical axis are the number of serious adverse events. You can see there were just a couple of outliers: one with about 22 serious adverse events. A serious adverse event is something that would bring you to hospital, extend your hospital stay, could threaten your life, require urgent intervention to save your life, something like that. These are not a sore arm or a bad headache; this is something really bad. But [there are mere single-digit numbers of adverse event per flu jab batch], with the exception of the one on the left there, with 23 serious adverse events. A lot might contain several tens of thousands of doses. We don't know what it is every time, but what we can say is that since—as I’ll show in a moment—the number of adverse events [with Covid jabs] can vary thousandfold, it's not possible for the difference in batch size or lot size to be the whole explanation for the differences. It might contribute to it, but we've done some preliminary examination where we have managed to find out exactly how many doses there were in a group of lots; and when we looked at the relationship between the number of doses in the batch and the number of adverse events in the batch, there's no relationship. So that’s not the driver. With the flu vaccines, there are just two lots where something went wrong—we don't know why—and there were a relatively large number [of serious adverse events]: 22 and 37. But look at the rest: there are hundreds and hundreds; thousands; tens of thousands of lots [of flu vaccine lots in VAERS] where, on average, my eye is telling me that the smooth average is around four serious adverse events per lot. But more importantly than that, I think, you'll agree it kind of looks like static: just background noise. Remember, if you dose a large population—you could dose them with saline too and get this effect, because people do get ill [of various causes anyway]—you might put on red socks today and have a heart attack; obviously, the red socks didn't cause your heart attack—but if you were tracking the relationship between your new product with socks and side effects, you would end up with a product with a profile that looks like this. So side effects associated with a an intervention does not necessarily mean that it's bad. As I mentioned earlier, this sort of correlation is not causation. But—and this is really good work by my colleague—I wanted to show you what we think a normal, well-manufactured, consistent, high-quality product looks like in the real world, when you give it to millions of people over time. So now, with that established, the baseline is around four, and the highest value [of adverse reactions with flu jab lots] was 37.\n\nSo this, by now, should start to take your breath away. These are the Covid vaccines. There are three manufacturers, because it's the US commercial utilities. It’s just these three. We don't know about AstraZeneca. Remember I said that the rolling average was about four adverse events per batch? Well, you know, the scale on the Y-axis here is thicker, the thin blue line [for the Y-axis] at the bottom is more than four [the scale is such that four adverse events would not show up on it]! And the red line—this is the worst ever you can see—there was a single case out of 22,300 flu vaccine batches, and that was 37. But really, that's probably way over what the representative was. The representative [number of adverse reactions per batch of flu jab] was somewhere around four. But that's the top [ever for flu jab adverse reactions]. Look how many batches of Covid products are worse than that! And yet, let me just point out, for example, right in the centre there: that batch number looks like it [has only] either one or two [adverse reactions].\n\n[UK Column note: The batch number which Yeadon reads out from the bottom axis of the slide at this point is not consistent with the format of any others, happens to be in North American telephone number format, and turns out to be the telephone number of a medical clinic in Minnesota, so it is possible that it is not actually a manufacturer's lot number.] And then its neighbour [has] one or two; its neighbour, one or two; its neighbour, one or two. But then, suddenly, you come on this one here: EN6201. It looks like it's six hundred serious adverse events. Again, if you had a serious adverse event yourself, you would think, \"Thank God I didn't die.\" It's quite close to death. And look at the number of them. There's a number of things I want to point out here. One is the extreme level of side effects that we're seeing: orders of magnitude [worse than flu jab adverse reactions], I would say. Just the rolling average here is looking like, I don't know, between 100 and 200, instead of four! [We see] that these are really toxic products. They really are toxic products. That's bad enough, but—as I argued—if you're a cancer sufferer, you might accept a dangerous intervention if, on balance, it could extend your life or its quality by a year or so. But these products have been given to the general public, most of whom are perfectly well. That's the normal deal with the vaccine: you're perfectly well when you turn up at the doctor's office, you get an injection, and you leave and you're still perfectly well, and all that's happened is you've acquired a defence against a specific pathogen. That's the deal. What we shouldn’t have is that you occasionally get seriously ill and some of you die. That's not a good deal. [Yet] that is what is happening from these products, and they're being pushed on everyone, when—as I've argued—if you're recovered, infected, you're immune; if you're a child, you're not vulnerable to the virus; healthy young people [do not need it] and for pregnant women we do not know that it's safe, and we should not, on the precautionary principle, be administering it [to them]. And yet your governments are pushing these on you. it's not a public health measure. If it was a public health measure, the three or four things I’ve just said would be true. It's not a public health measure.\n\nAnd [bearing in mind] all I said earlier about discarding normal pandemic handling plans and replacing them by absurd lies, that have had the effect of frightening people (and we think that that was the objective): now you've seen this information, and your economies are on the verge of absolute extinction. And so I think that's the evil triumvirate: frighten the people, damage the economy, force them—persuade them or force them as necessary—to accept these injections, some of which are killing people. Why would they want to do that? And this is why I got to the conclusion I [reached]. I racked my brain: there may be other explanations. It's not money, by the way. The pharmaceutical companies, of course, are having an absolute field day, a high water mark in terms of profitability. That cannot be the motive; it’s the effect of using Big Pharma to drive these products into the population. It can't be the motive. Why can't it be the motive? Because there are huge numbers of industrial sectors that are absolutely [driven] almost into the ground: the airline industry—I don't know how they're surviving, almost two years of non-normal operation; hotel and catering, holiday trade; and all of these things. So remember that the only people who could possibly make this happen, or at least have to agree in order that this happens in their world, would be the owners of the people, what Catherine Austin Fitts called \"Mr Global\": global big capital. So I'm absolutely sure that money alone, profit alone, is not the motivation, because [while] there might be a couple of sectors doing really well [out of Covid], eight sectors are doing so badly as to more than outweigh the benefits that accrue to the drug companies. But let's just go back to the slide, because it's not just this extreme toxicity; it's the variability. Now, let's just look at the Pfizer bumps, because there's a nice range there. \"Nice\" is the wrong word, sorry; I'm sounding like a scientist. These are people. These are people who've suffered, and some of whom have died. But as you cast your eye across the axis at the bottom, you can see that some of the [batch] numbers there are associated with very small numbers [of adverse effects]. They're so small, you can't see it registering on the thickness of the Y-axis marking zero. And yet, close to them, there are a whole bunch of batches that have got 400 to 600 serious adverse events per lot, and they're roughly the same size. That means it's not the same product that's got this Pfizer Covid-19 vaccine that it says on the box or or on the vial. It's not the same stuff. It's not the same stuff. I'm certain it's not; an assessment. It's not \"maybe\"; I'm absolutely certain. There is something called the law of mass action, which applies to all biological properties I've ever seen. And if it does come to court, I will walk you through the history of that: why it is that shape and why this means it cannot be the case that these middle Pfizer lots are the same material as the ones immediately to the left and to the right. These drug companies are highly professional outfits. They know how to manufacture reproducibly, and we saw that with the flu vaccines over decades. They know how to do it; they haven't done it. I'm afraid I've come to the conclusion that they're doing it on purpose, because they're so professional, and after a year they know this data. This data is their window onto the world. They can go into VAERS; they can filter for their own products, and their own lot and batch numbers; and they can see what's happening. They know. So the fact they haven't stopped this tells me that they're at least okay with it—and I fear that this is deliberate.\n\nWhy might it be deliberate? Well, as as we have seen over the last two years, Big Tech firms like Google, Facebook, YouTube, Twitter and so on have persistently said, \"We're not having anyone making a comment or a recording that disagrees with what the public health officials say, and we're going to call that 'misinformation', and basically we're going to censor you, and maybe de-platform you.\" What that means is that a qualified person like me—and I promise I have no axe to grind whatsoever, other than telling you what I think is true, which is that we're facing a global crime—people like me cannot speak to the public, because the tech companies have decided not to let me. That's true of mainstream TV, mainstream radio; I've only ever appeared on [mainstream] radio where they maligned me. They've told lots of lies about me, so I then threatened them, and then they deleted the recording—which tells you something: wasn't it that I was correct? So it's the combination of Big Tech and Big Media—and by that, I mean mainly TV around the world; they control what's coming into your house, so if you just turn your TV on over the last two years in the same way that you ever have done, you're only going to hear a one-sided [presentation]. And in my view, it's mendacious; it's a completely misleading description of what's going on. You'll never hear things like this. And you should. You should. You should see both sides of it. The fact you're not allowed to, I think, tells you that they know there's something bad going on, and they're going to make damned sure that people like Dr Mike Yeadon and Dr Robert Malone and Dr Peter McCullough and so on will never darken the studios of the BBC or CNBC—because if we were given an hour, I think we could destroy this story. Easily. I think we're plausible: we're being honest, and gain absolutely nothing from making up the stories I'm describing in horror.\n\nI've said that the variability is extreme, and I've said that the media controls the message, and they censor people like me. If they want to tell you that \"there's a nasty variant that's just come along that's killing more people than previously\", you've no way of knowing if that's true or not. And I don't think you should trust anything they say about this, because they've definitely lied about everything else I've been able to hear. But if they said \"there's a new variant or a new virus that's ten times more lethal than Covid, and don't worry, the innovative pharmaceutical industry has rustled up a new vaccine; run and get your top-up, your booster, your new vaccine\"—what happens if they choose to give you the one that's called EN6201 instead of EN1201? Well, the answer is, probably thousands of people are going to die. And imagine all the manufacturers doing that. And across the world, all the time, the media is giving you a very frightening message—and the appropriate response, if these guys were being honest, would be, \"OK, let's deploy these vaccines as we tune them and so on.\" But it's all lies; it's all misleading; and I worry [about] what you've seen in front of you there. I've described it to other people by saying, \"I'm worried that this is the calibration of a killing weapon.\" [What if, soon,] there are vaccines that would be, say, ten times more lethal than Covid [jabs]—so killing one in a hundred people instead of one in a thousand, roughly: they could just move along and just deploy [bad] batch X or batch Y or batch Z, and that [mass death] is what would happen. And I've got no reason to make this stuff up. I've never been a conspiracy theorist; if anything, I'd be the sort of person who would chuckle at other people having conspiracy theories, and of course, now I realise what a mug I've been for the last 61 years for believing what I've been told. So the bottom line—you can see it from here: it's not the same stuff in each glass bottle. That's an offence, in all sorts of ways, against adulterated drugs law [21 U.S. Code §351]. It cannot be accidental, because they are professionals that know how to manufacture consistently. It's not possible [to admit the excuse] that \"This is small variation in product because it's an emergency situation and difficult to make.\" No, the law of mass action would mean that in order to get these enormous differences in “performance”—you know, serious adverse events—you would have to have a very a sizeable difference—I would say a ten- to hundredfold difference in an active ingredient—if there was if there was an active ingredient that produced these side effects. I'm confident, and we did the experiments; I'd be roughly right [with this prediction on that basis]. I've done hundreds of experiments like that—not with people, of course—and [determined that] we'd need to go up in dose by a good 300 times to go from baseline to these numbers. I'm absolutely sure about that. I’d bet a lot of money on it. So, because they're good at manufacturing, and because this data has been available to them all the time—they can look as the VAERS data comes in, so they've known about this, and that means they accept it—it's [therefore] either intentional, or if whatever is [in the shots] has proven too difficult to manufacture, they should still not be allowed to discharge these, as it were, into the public environment, because they're very lethal.\n\nSome people have said to me, \"Mike, these are brand new products, as you've said, and early on we heard that the Pfizer product had to be stored at, like, -80ºC, so that means they're rather unstable. Maybe, Mike, what's happening is, they're just going off occasionally. You know, bad handling; people not used to what's called a cold chain; things like this.\" Well, I don't think that's true. For one thing, when products degrade, they generally lose activity: a piece of it falls off. If you imagine a car degrading, you might lose one wheel and the top part of the engine. It doesn't suddenly turn into a lethal flying machine; it will lose function, and that's what I would expect to happen. Now on a one-off, yes, maybe a novel product like this might break in half and you end up with two supertoxic bits of mRNA; but we're seeing the same thing with three products made by three different companies, and we're seeing two different technologies: Moderna and Pfizer are mRNA; the Janssen is a DNA [technology]. No, it's not possible. I’ve just said the rule of thumb is that degradation results in a loss of functions, not acquisition of extreme exquisite toxicity. And we've got three products and two technologies doing that? No, that's not the explanation. Whoever's doing this—and here's the thing: I have no idea what it is they have done—but I'm more frightened of these vaccines than I was before seeing this work with my colleague. I think that's the long and short of it, really. All of the early stuff, you're being lied to, and I can prove that on several occasions. I would like to direct people who haven't seen me before to my interview with Del Bigtree on The Highwire, and that, I think, will educate you on what I was seeing as the principal lies. And I certainly would like to attach a sixteen-minute link with three or four people talking that will provide you convincing evidence that the authorities knew that asymptomatic transmission was complete garbage. And if that's true—and it is true; it's garbage—everything else falls to pieces. And when we come to the vaccines, if they were a public health measure, they'd be directed only to the people who could get most benefit from it, and never to children, healthy young people, pregnant women, and those who have already recovered. And yet a coach and horses has been driven right over those.\n\nSo that's about where we are. The reason I'm here is, I want to work with anyone—through Stiftung Corona Ausschuss and anywhere else—that can help wake people up, because I don't know how to fix this, but if enough people say, \"We've had enough now; we're not going to comply with it any more,\" [it will end]. I noticed in northern England, there were a group of several thousand children from secondary school in Lancashire who formed a union, and they just said, \"You know what? We're not wearing the masks any more, and no, we're not going to put these cotton buds up our nose twice a week. Not doing it any more.\" And that's all we need to do, because I am telling you there is no unusual threat in your environment except from your government and their policies and the pharmaceutical industry. There's nothing going on other than the sort of psychological warfare, and the economic damage, and then these wretched vaccines So we can we can still take our old normal back—hopefully in a better form—but it requires us to just take a little courage in our hand and say, \"I do not comply any more. I do not comply.\" And you're not doing anyone any good by complying; you're not saving yourself; you're certainly not saving your children. That's all you need to do, and they can't arrest everybody, right? One or two people decide to demonstrate, they could be arrested; if ten thousand schoolchildren say, \"We're not going to school with masks and testing,\" and they just cross their arms and say, \"What are you going to do, then?\", that's how you take it back. That's how we take it back.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iii-the-hot-lots", "title": "Dr Mike Yeadon's key testimony — Part III: The Hot Lots", "description": "In the central part of his testimony to Reiner Füllmich, Dr Mike Yeadon sets out with graphic evidence from the US VAERS reporting system why it is mathematically impossible for the same substance to be contained in all batches of Covid jabs, unless the data fed into VAERS is unusably bad.", "image": "https://www.ukcolumn.org/sites/default/files/2022-01/Mike%20Yeadon%2C%207%20Jan%202022.jpg", "article:author": "UK Column Reporters", "article:publisher": "UKColumn", "article:published_time": "2022-02-03T08:21:21+00:00", "article:modified_time": "2023-01-13T19:18:16+00:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-i-the-eight-covid-lies", "https://odysee.com/@Corona-Investigative-Committee:5/Mike-Session-86-en:0", "https://rwmalonemd.substack.com/p/how-bad-is-my-batch", "https://jessicar.substack.com/p/the-vax-lot-saga-continues", "https://jessicar.substack.com/p/getting-to-the-bottom-of-potential", "https://openvaers.com/", "https://www.law.cornell.edu/uscode/text/21/351", "https://www.spreaker.com/user/ubngo/ex-pfizer-vp-concerned-about-experimenta", "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iv-questions-answered-1", "/writer/uk-column-reporters"], "authors": [], "publish_date": "2022-02-03T08:21:21+00:00"}