{"result_id": "323027", "URL": "https://www.ukcolumn.org/video/the-vaccine-injured-journey-where-are-they-now-vaccine-damage-real-people", "timestamp": "2023-04-25 17:46:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/the-vaccine-injured-journey-where-are-they-now-vaccine-damage-real-people", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "The Vaccine Injured Journey—Where are they now? (Vaccine Damage—Real People)", "cleaned_text": "When the Covid–19 vaccination drive began in 2021, many who trusted government and science establishments availed themselves of the offer of an experimental Covid–19 injection to keep themselves, their loved ones and our NHS safe. Since the rollout of the ‘vaccinations’, UK Column News has been following many of those who have been injured—through no fault of their own—as a result of listening to the experts and trusting the science.\n\nTo mark the start of 2023, Debi Evans was delighted to welcome both Charlet Crichton and Wayne Cunnington back to UK Column to update our viewers and listeners on their vaccine injury journeys: both their individual experiences and those of the fellow victims for whom they campaign. Both Charlet and Wayne have become repeat contributors to UK Column and it is always a pleasure to speak to them.\n\nCharlet is a co-founder of the vaccine injury support and advice group, UK CV Family. Last time we spoke to Charlet, the group comprised 600 members. Due to a worryingly dramatic increase, Charlet and her team now support over 1,000 vaccine-injured individuals and their families, with more joining every day. This New Year, we ask what the future holds for those with vaccine injuries and what we who are uninjured can do to support them in their work for the year ahead.\n\nWith the NHS in utter collapse, what effect is the failure of the healthcare system having on their ability to access the medical help they need? Can they get to specialist appointments—which often are long journeys away from home even when they are reachable? Is the system prioritising the vaccine-injured in order to secure for them the urgent treatment and answers they need—or is it in fact ignoring them, belittling them and refusing to listen to a word they say about their own health?\n\nThose with vaccine injuries do not just suffer physical symptoms and conditions; most of those suffering serious and life-changing adverse events are also beset with anxiety, fear, sleeplessness and distress. Many have lost their jobs, income, relationships, and homes. The ripple effect of their situations—which are all unique—are immense. In the millisecond that it took a someone to inject a novel ‘vaccine’ into their arms, their lives changed forever.\n\nCharlet takes the opportunity to expresses her warm gratitude to all of the UK Column viewers and listeners who have supported UK CV Family over the last year. The group has a fundraiser page and, whilst every financial donation is very gratefully received and appreciated, Charlet is quick to emphasise that anyone is welcome to contact UK CV Family whether or not they donate; all the group's help is given for free and with love.\n\nIn this interview, Charlet puts out an appeal for anyone qualified in psychology or psychiatry who may be willing to donate a few professional hours to help support members of the group. Many of those she champions are not just suffering with crippling adverse events but also depression, loneliness and fear, which is having a detrimental effect on their mental health. Messages of support are precious and hugely important; every message counts. UK CV Family's e-mail address is: [email protected]\n\nWayne Cunnington—also a past contributor to UK Column himself, and AstraZeneca vaccine-injured—is also still waiting for answers. The years and months drag by, and every day is a fight to obtain answers, justice and, most urgently, treatment. He has been shunned and ignored by the Yellow Card scheme administrators at Britain's medicines regulator, the MHRA, as well as by AstraZeneca and the Patient Safety Commissioner.\n\nWayne has been campaigning vigorously despite having had his life changed almost overnight, and he continues to call for truth. He tells us how he is getting along with his application to the Vaccine Damage Payment Scheme, run by the NHS Business Services Agency and not the responsibility of the MHRA. Brain fog, migraines, tiredness and exhaustion have become the ‘new normal’ for Wayne—but in spite of all of that, and having been banned from Twitter (from telling the truth), he continues to write articles on Substack and campaigns on Gettr.\n\nCharlet, Wayne and others—despite their injuries and some days feeling terribly ill—refuse to give up fighting to establish the truth of the matter. They carry on with dignity, honesty and equanimity.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/the-vaccine-injured-journey-where-are-they-now-vaccine-damage-real-people", "title": "The Vaccine Injured Journey—Where are they now? (Vaccine Damage—Real People)", "image": "https://www.ukcolumn.org/sites/default/files/2023-01/C5C02D23-C742-4838-BEA8-8424BBAB2A12.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://ukcvfamily.org/", "https://www.ukcolumn.org/writer/debi-evans", "https://www.ukcolumn.org/video/vaccine-damage-real-people-adam", "https://www.ukcolumn.org/article/what-is-medicrime", "https://www.gofundme.com/f/uk-cv-family", "/cdn-cgi/l/email-protection#02676c73776b706b6771427769617464636f6b6e7b2c6d7065", "https://www.ukcolumn.org/writer/wayne-cunnington", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.gov.uk/government/news/contacting-the-patient-safety-commissioner-for-england", "https://www.ukcolumn.org/article/alex-mitchell-and-his-fight-for-vaccine-induced-thrombocytopenia-sufferers", "https://www.ukcolumn.org/article/mhras-letter-to-debi-evans-we-didnt-use-our-ai-tool-to-assess-yellow-card-data-on-covid", "https://waynecunnington.substack.com/", "https://gettr.com/user/realcoffeeman1_"], "authors": [], "publish_date": "2023-01-05T16:55:58+00:00"}