{"result_id": "323003", "URL": "https://www.ukcolumn.org/article/clotting-and-covid-science", "timestamp": "2023-04-25 17:46:19 CEST+0200", "meta": {"description": "If we were to rely on mainstream news and government reports, we might be led to believe that clotting problems with Covid vaccines were entirely unexpected and rare.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/clotting-and-covid-science", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Clotting and Covid Vaccine \"Science\"", "cleaned_text": "Even a cursory look at social media demonstrates that there are three main areas of concern around Covid vaccines at the moment: clotting disorders; abnormal menses; and the possibility that those that are vaccinated are shedding that vaccine material.\n\nThere are of course other significant concerns not least neurological damage following receipt of the vaccine but, as you will see, that may be as a consequence of one of the other three.\n\nOnly one of these concerns is recognised by governments and health agencies at the moment – clotting disorders; the other two are not.\n\nI’m going to try and sketch out what we know about the first; the other two will be for later articles. I’ll attempt to use the scientific and medical literature to help me to do that.\n\nThe problem of clots after Covid vaccination was taken more seriously when a preprint paper appeared in Research Square investigating reports “of some vaccine recipients developing unusual thrombotic events and thrombocytopenia”.\n\nThe researchers “investigated whether such patients could have a prothrombotic disorder caused by platelet-activating antibodies directed against platelet factor 4 (PF4), as is known to be caused by heparin and sometimes other environmental triggers”.\n\nIn short: some of the patients were positive for antibodies to PF4 and the authors concluded that “The AZD1222 [AstraZeneca] vaccine is associated with development of a prothrombotic disorder that clinically resembles heparin-induced thrombocytopenia but which shows a different serological profile”.\n\nThey proposed calling this new problem vaccine-induced prothrombotic immune thrombocytopenia (VIPIT). Something tells me that name is going to be changed ASAP.\n\nThe authors’ conflict(s) of interest included receiving fees from AstraZeneca’s competitor, Pfizer. This is something we may have to forgive them for, as any help in unravelling this problem is much needed.\n\nEffectively we have two opposing problems here: thrombosis forming a clot that can block a vessel supplying blood to an organ; and thrombocytopenia reducing the number of platelets that are needed to form a clot, causing bleeding, aka haemorrhage. Either of these problems can be very difficult to manage and extremely dangerous, even lethal for the patient -- but to have both at the same time!\n\nThe combined thrombosis and thrombocytopenia linked to Covid vaccination is being considered as something new and very rare, and if clotting happens in a vital organ … well, we’re seeing the results: young people that should not be dying, are.\n\nAt the time of writing this article, Reuters reported:\n\nConsidering that adverse events are generally accepted to be massively underreported, that is very concerning.\n\nIf we were to rely on mainstream news and government reports, we might be led to believe that clotting problems with Covid vaccines were entirely unexpected and rare.\n\nYet the first warnings about the Astrazeneca clotting disorder came before the preprint (above) was published: and long before they even started making the current Covid ‘vaccines’. Well over a decade before, to be precise.\n\nAdenoviral viral vector delivery systems that are being employed by Astrazeneca, Sputnik and Johnson & Johnson, for example, were known to be problematic in the past. In 2007 a research paper laid it out very clearly:\n\nIt was known in 2007 that the same vector used for many of the Covid vaccines consistently caused thrombocytopenia. But apparently, that did not deter the UK regulatory authorities from allowing an emergency authorisation for that technology to be released not just on the UK population but also many other countries around the world.\n\nIn September 2020, another paper was published SARS-CoV-2 binds platelet ACE2 to enhance thrombosis in COVID-19, that outlined a problem with SARS-CoV-2:\n\nBut what has that got to do with the vaccine?\n\nThis paper identified a spike protein as causal factor in clotting. And, of course, a spike protein is what is being produced by most of the Covid vaccines. Alarm bells should have been ringing with regulators, but nothing was done.\n\nIt should also be noted that platelet-leukocyte aggregation was mentioned in both the 2007 and 2020 papers. How did the authorities and drug manufacturers miss that?\n\nOf more concern was the fantastic work of Magro et al, available as early as October 2020, in a paper entitled Severe COVID-19: A multifaceted viral vasculopathy syndrome.\n\nThey demonstrated brilliantly that in small blood vessels the spike protein, all by itself, can induce clotting by docking in various tissues.\n\nWe see immediately a reason why overweight people have a higher risk of a poorer outcome from SARS-CoV-2 infection. We also get a prophetic warning of what was to come post vaccination — brain clots and death.\n\nDr Magro and her colleagues exquisitely demonstrated that the spike protein, even absent viral RNA, could cause thrombosis:\n\nThe above diagram depicts the virus attaching to the inner lining of small blood vessels, causing an immune reaction and destruction of the infected cells. That results in debris being released — pseudovirions — that travel to other areas, where the process repeats itself with some modifications.\n\nIn the brain (below), those viral-free pseudovirions (including spike protein) induce a clotting response initiated by a part of the immune system called Complement. Specifically, the Mannose Binding Lectin Complement pathway.\n\nThe key point to this paper in relation to Covid vaccines is that the spike protein, devoid of viral RNA travels to the brain and causes clotting. Once again, in case you needed reminding: Covid vaccines produce such a spike protein.\n\nAnother paper by Nuovo et al, entitled Endothelial cell damage is the central part of COVID-19 and a mouse model induced by injection of the S1 subunit of the spike protein, which also featured Dr Magro, was available online from 24 December 2020.\n\nThere seems to be a common theme developing here.\n\nThe journey doesn’t end there. SARS-CoV-2 spike protein S1 induces fibrin(ogen) resistant to fibrinolysis: Implications for microclot formation in COVID-19:\n\nLoosely translated: the spike protein may contribute to clotting and those clots may be resistant to be being broken up by the body.\n\nAnother one: The SARS-CoV-2 spike protein alters barrier function in 2D static and 3D microfluidic in-vitro models of the human blood-brain barrier:\n\nNot only can the spike protein cause clots all by itself, that may well be resistant to being broken up, it also looks like it also may alter the blood-brain barrier, causing neurological damage.\n\nAs if mocking the intelligence of those that still believe in science this, just published — SARS-CoV-2 spike protein alone may cause lung damage:\n\nThe spike protein alone can be studied whilst it alone is causing lung injury … does that raise any alarm bells within the scientific community?\n\nA recent paper stated clearly that the risk of clotting from a Covid vaccine is far less than if you contract SARS-CoV-2. The message is that taking risk/reward into account, everyone should be vaccinated.\n\nWell, those pushing that narrative failed to take into account that to make that risk/reward calculation, the risk in the Oxford paper has to be multiplied by the risk of actually being (officially) diagnosed with Covid. Once that is done, the risk is much higher for those vaccinated.\n\nThe image below demonstrates how successful the current crop of vaccines are at producing spike proteins. The white arrows point to spike proteins on the cell surface following the Astrazeneca vaccine. Those vaccine induced spike proteins were claimed to provoke an immune response to protect life — but, based on the literature I have referenced, we should now look at them very differently.\n\nSimply put, there is overwhelming evidence that the SARS-CoV-2 spike protein (that is also synthetically produced by the Covid vaccines) is a central part of the mechanisms of morbidity and mortality of SARS-CoV-2, and therefore is also a risk of the vaccine. In regard to clotting, that risk is greater if you receive a vaccine.\n\nThe data clearly demonstrate that the last thing you would ever want to do is make a vaccine that produces a spike protein. As the literature clearly showed, it would cause significant damage, including brain clots and death. And that literature, for the most part, was available before the release of Covid vaccines to the public.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/clotting-and-covid-science", "title": "Clotting and Covid Vaccine \"Science\"", "description": "If we were to rely on mainstream news and government reports, we might be led to believe that clotting problems with Covid vaccines were entirely unexpected and rare.", "image": "https://www.ukcolumn.org/sites/default/files/2021-05/spike-protein.jpg", "article:author": "Dr Mike Williams", "article:publisher": "UKColumn", "article:published_time": "2021-05-02T11:25:30+01:00", "article:modified_time": "2021-05-19T10:40:18+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.researchsquare.com/article/rs-362354/v1", "https://emedicine.medscape.com/article/202158-overview", "https://www.reuters.com/business/healthcare-pharmaceuticals/british-regulator-cites-41-more-blood-clot-reports-following-astrazeneca-shots-2021-04-29/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://pubmed.ncbi.nlm.nih.gov/17148587/", "https://jhoonline.biomedcentral.com/articles/10.1186/s13045-020-00954-7", "https://www.sciencedirect.com/science/article/abs/pii/S109291342030191X", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7758180/pdf/main.pdf", "https://www.medrxiv.org/content/10.1101/2021.03.05.21252960v1", "https://pubmed.ncbi.nlm.nih.gov/33053430/", "https://medicalxpress.com/news/2021-04-sars-cov-spike-protein-lung.html", "https://osf.io/a9jdq/", "https://pubs.acs.org/doi/10.1021/acscentsci.1c00080"], "authors": [], "publish_date": "2021-05-02T11:25:30+01:00"}