{"result_id": "323006", "URL": "https://www.ukcolumn.org/article/why-we-must-question-vaccine-efficacy-and-safety-claims", "timestamp": "2023-04-25 17:46:22 CEST+0200", "meta": {"description": "The claim by Public Health England that Covid-19 vaccines have saved 27,000 lives is based on assumptions written into a computer model. Are these assumptions reliable and is there clear clinical evidence to substantiate them?", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/why-we-must-question-vaccine-efficacy-and-safety-claims", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Why We Must Question Vaccine Efficacy And Safety Claims", "cleaned_text": "The BBC claims that vaccines have reduced mortality by 95%. They state:\n\nThey add the Public Health England (PHE) \"estimate\" that 27,000 lives have been saved. Politicians — for example, the new Health Secretary, Sajid Javid — have made similar claims. They assert that vaccines' efficacy is proven and that they are known to be safe.\n\nAll claims, no matter who makes them, must be supported by evidence.\n\nIn this case, when we look at the evidence allegedly \"proving\" vaccine efficacy and safety, there are many unresolved questions. It seems these claims cannot be trusted. There are reasons for doubt.\n\nThe BBC proclamation is based upon the models of the PHE and MRC Biostatistics Unit's COVID-19 working group (PHE/MRC).\n\nThe PHE and MRC have created the PHE/Cambridge real-time pandemic surveillance model. Using this model, they claim the vaccination programme has prevented between 6.4 and 7.9 million infections and 26,100 and 28,400 deaths in England alone. The PHE and MRC add:\n\nThis is an estimate, based upon assumptions, compared to a model of a worst-case scenario. So the question is, what are the assumptions informing the \"worst-case scenario\" and the subsequent claims about lives saved? Are these assumptions reliable and is there clear clinical evidence to substantiate them?\n\nThe PHE and MRC have created their Nowcast and Forecast model. This is where we find the initial assumption:\n\nThis assumption is based upon Public Health England's Covid-19 Vaccine Surveillance Reports.\n\nIn these reports, PHE state that they work with the Medicines and Healthcare Regulatory Agency (MHRA), NHS England and other government and academic partners. They claim the safety of the Covid-19 vaccines is continually monitored by the MHRA, who have judged that the benefits of the vaccine outweigh the potential risks. This judgment has been made in keeping with the Covid-19 Vaccine Surveillance Strategy.\n\nThey don't link to these large clinical trials in the surveillance report, so we are left uncertain. Presumably, PHE are referring to the vaccine clinical trials. It seems odd that they don't cite them.\n\nThe clinical trials for the vaccine include the Pfizer and BioNTech trial of BNT162b2 (NCT04368728), which is still in the recruitment phase; AstraZeneca's AZD1222 (or ChAdOx1-S) trial (NCT04516746), due to be completed in February 2023; Moderna's mRNA vaccine phase III trial (NCT04470427), which should be concluded by October 2022; and Johnson & Johnson's Janssen trial (NCT04614948), which it is hoped will near completion in May 2023.\n\nThere are no results posted for any of these trials, so it is difficult to understand how PHE can possibly know that the vaccines are \"highly efficacious\". Similarly, without completed clinical trials for the vaccines, and no published clinical trial data, it is also a mystery how the MHRA have been able to judge that they are safe.\n\nThe British Medical Journal, among others, recognised that the vaccine trials were, in any event, incapable of assessing either efficacy or safety. Some interim trial results are available but the Lancet reported that these suffered from selective use of data, inconsistent disease definition, evident bias, and the trial protocols differed between vaccines, even changing mid-trial in some instances. With mixed endpoints, it wasn't clear from these interim analysis who were the primary beneficiaries of the claimed efficacy.\n\nThe vaccine's clinical trials were all designed to be randomised control trials (RCTs). Safety and efficacy was meant to be measured by comparing the outcomes of the vaccinated cohort against those of a control group who did not receive the vaccine. All of the various vaccine trial protocols were designed to assess these outcomes over a two- to three-year period.\n\nHowever, long before they were due for completion, the studies were apparently unblinded. The pharmaceutical corporations have seemingly now administered the vaccine to the members of their placebo control groups. This means that none of the current Covid-19 vaccines are subject to randomised control trials as claimed. The British Medical Journal stated:\n\nPHE claims of between 55% and 70% efficacy cannot be based upon the vaccine clinical trial data, as there isn't any, and the available interim analysis is pretty shoddy stuff. So what is the basis for this conclusion? For this, they cite some observational studies and their own surveillance reports. In other words, the PHE claims are largely based upon their own, self-referenced, reports.\n\nFor example, Public Health England's own study considered observations of the effectiveness of the Pfizer-BioNTech and Oxford-AstraZeneca vaccines on symptoms, hospital admissions, and mortality in older adults in England. The researchers pointed out that those initially vaccinated with the Pfizer vaccine faced \"higher odds of testing positive for Covid-19 in the first nine days after vaccination\" than the unvaccinated.\n\nThe researchers assessed that this was because the early adopters were those most at risk from Covid-19. They considered those who later received the AstraZeneca vaccine to be at marginally less risk, as they weren't as vulnerable as the initial Pfizer recipients. They therefore adopted a \"stratified approach\" for their analysis of the vaccinated.\n\nThey then studied hospitalisation within 14 days of a positive test result. For the vaccinated, they calculated the hazard ratio. This broadly indicated the different degree of the risk faced by the subject under study.\n\nAccording to the PHE study, the lowest hazard ratio for Pfizer was 0.48, but for AstraZeneca it was 0.41. The researchers then inferred additional hazard protection for the vaccine recipients, based upon these ratios. However, they didn't undertake any hazard ratio analysis for the unvaccinated, so these comparisons were meaningless.\n\nThose over 80 who were unvaccinated had a 15.35% chance of hospitalisation; the Pfizer recipients, who had been vaccinated in the last 14 days, had 14.06% chance; and the AstraZeneca subjects a 11.06% chance. For those who had been vaccinated more than 14 days before a positive test with Pfizer, hospitalisation chances dropped to 9.14%, and for AstraZeneca it was 7.14%.\n\nThis appears to be one source for the \"55% to 70% efficacy\" claimed by PHE. However, it is an observational study, not a clinical trial, so this cannot be the large clinical trial which shows the vaccines to be \"highly efficacious\".\n\nThe study also compared mortality within 21 days of a \"positive Covid-19 test.\" For the unvaccinated over-80s, this was said to be 13.3%; for the Pfizer vaccine, it was 10.4% within 14 days of vaccination, and 6.8% at more than 14 days after vaccination.\n\nPHE's observational study appears to show hospitalisation and mortality efficacy for those vaccinated with both the first and second doses of Pfizer jab, and hospitalisation efficacy for the first AstraZeneca dose. However, as the AstraZeneca rollout occurred later than distribution of the Pfizer jab, researchers did not have time to assess the impact of the AstraZeneca second dose on mortality.\n\nThere are some major additional caveats.\n\nAs we do not know the hazard ratio for the unvaccinated, it wasn't clear whether the PHE study was comparing like with like, in terms of risk. More importantly the study relied upon a definition of a Covid-19 \"case\" based upon positive RT-PCR tests.\n\nRT-PCR is a test for nucleotide sequences specified in the WHO Protocols for RT-PCR testing, with the relevant sequences identified in a January 2020 paper by Corman, Drosten et al. These nucleotide sequences are said to be unique to the SARS-CoV-2 viral genome. Yet research by the Spanish medical journal D-Salud showed that the Corman-Drosten sequences (primers and probes) stipulated in the WHO protocols did not appear to be unique to the SARS-CoV-2 published genome.\n\nScientists have issued a formal request that the Corman-Drosten paper be withdrawn pending genuine scientific validation. The Corman-Drosten Review Report found seven serious scientific flaws in the study.\n\nThe primers were inaccurate, non-specific and inadequate; the binding (annealing) temperature used in the study was too high, again giving non-specific results; the study used 45 PCR amplification cycles, meaning the RT-PCR identified nothing but genetic background noise; there was no bio-molecular verification of the results and no controls were applied to viral detection; no standardised operating procedures were described to enable others to repeat the experiment; and the study design was imprecise, greatly increasing the chances of false results.\n\nThe Corman-Drosten paper was submitted for review on 21 January 2020, accepted on the 22nd and published on the 23rd. Proper peer review does not seem to have been possible in such a timeframe. The paper was first published in Eurosurveillance and two of the study's lead authors, Christian Drosten and Chantal Reusken, were themselves members of the Eurosurveillance editorial board.\n\nCurrently, the UK Government claim they have conducted 209 million PCR tests, of which 4.8 million were positive, representing 2.3% of tests. The UK Scientific Advisory Group for Emergencies (SAGE) estimated the RT-PCR false positive rate to vary between 0.8% and 4.0%, with a mean false positive rate of 2.3%.\n\nTherefore, at the lower estimate, 1.7 million of the alleged 4.8 million \"cases\" could be false positives. As we approach the mean, it is possible that none of the claimed cases are based upon genuine positives.\n\nYet it isn't quite that straightforward, because the Government state that their test numbers include multiple tests of the same individuals and, latterly, they have also included lateral flow tests.\n\nSo the 4.8 million positives almost certainly accounts for a higher percentage of \"individuals tested\". Unfortunately, the Government have not said how many duplicate tests there are, and so we don't know the full false positive picture. Nonetheless, it is significant and this has massive implications for observational studies, such as those cited by PHE, which base their assumptions of \"case numbers\" upon RT-PCR tests.\n\nMost importantly, an RT-PCR test is not a test for a disease. The degree to which it can be said to accurately identify the presence of the virus is highly dubious, but it absolutely cannot identify the subsequent disease of Covid-19. In no way can you claim, as PHE have, that a positive RT-PCR test \"confirms\" a \"case\" of Covid-19. Their claim of 55% to 70% effectiveness is looking increasingly dubious.\n\nAnother paper that PHE referenced was based upon the UK Covid-19 Infection Survey (CIS). The CIS attempts to measure the prevalence of SARS-CoV-2 antibody responses in the population. PHE cited one of two comparative studies, which used CIS data, to compare the antibody response elicited by the Pfizer and AstraZeneca vaccines to those following infection without the vaccines. The findings, reported by the BMJ, revealed:\n\nThis indicated that there was no appreciable difference to SARS-CoV-2 immunity between those vaccinated and those who had been naturally infected with the SARS-CoV-2 virus. The difference was that those who were naturally infected faced the risk from the disease (Covid-19). These were seemingly reduced, but not eliminated, by vaccination. However, the vaccinated also faced the additional risk from the vaccine.\n\nIt is therefore vital to understand the risk from the vaccine to calculate the relative risk/benefit profile of the vaccines compared to natural infection. None of the studies cited by PHE considered this risk. They assume that the MHRA's judgement that the vaccines were safe was based upon a thorough evaluation. As we shall see, it was not.\n\nOn 30 April 2021, the UK Government launched a committee review of the evidence surrounding the proposed vaccine passports. In the corresponding press release, they stated:\n\nFive months into their vaccine rollout, the UK Government still had no idea what the effect the vaccines had on transmission. The reason why they didn't know was because there are no completed clinical trials for the vaccines.\n\nPHE's description of how they calculated the impact of the vaccines on infections and transmission leave many questions unanswered. Speaking about infections, they state:\n\nPHE are referencing so called asymptomatic transmission. This is something they assume to be real in their observational studies and models.\n\nThe Wuhan University of Science and Technology carried out screening on nearly 10 million Chinese citizens in Wuhan. Of the 9,865,404 participants without any previous history of COVID-19, a mere 300 were identified as being positive and asymptomatic. 1,174 close contacts of the asymptomatic positive cases were tracked and traced. None of them tested positive. The scientists concluded:\n\nOf the 34,424 people previously diagnosed with COVID-19, 107 (0.310%) subsequently tested positive again, but all of them were asymptomatic. All of the asymptomatic cases, with an age range between 10 and 89, had low viral loads. There was no reason or evidence to suggest they would infect anyone or redevelop symptoms of Covid-19.\n\nA study conducted in the Republic of Ireland, published in May 2020, found no evidence of secondary transmission of Covid-19 from children attending school in Ireland. A meta-analysis of studies looking at SARS-CoV-2 transmission within and between households, conducted by the Department of Biostatistics at Florida State University, also found extremely limited evidence of asymptomatic transmission among all age ranges. They considered 54 transmission studies, collectively analysing 77,758 \"cases\".\n\nFrom these, they calculated the secondary attack rate (SAR). This is the likelihood of infection occurring within specific group under a defined set of circumstances; in this case, households living in overcrowded conditions. The Florida researchers found the following:\n\nThe 0.7% chance of asymptomatic transmission was negligible. This figure was for both asymptomatic (low viral load) and presymptomatic (higher viral load) infections combined.\n\nAn analysis of 73 studies, collectively evaluating 5,340 test subjects, ascertained that viable viral shedding (transmission of the virus in high enough load to infect someone else) was short-lived among people with symptoms. The researchers stated:\n\nDuring a June 2020 press briefing, Maria van Kerkhove, the WHO's technical lead for the COVID-19 pandemic, made it abundantly clear that asymptomatic transmission was very rare:\n\nJust one day later, Dr Mike Ryan, Executive Drector of the WHO Health Emergencies Programme, back-pedalled swiftly, claiming that van Kerkhove's statement was \"misinterpreted.\" For her part, Dr van Kerkhove was clear about what she meant. She responded to the comments of Dr Ryan by conceding that the \"models\" show asymptomatic spread but that real world data did not.\n\nThe PHE/MRC Nowcast and Forecast model assumes that the PHE surveillance figures for reduced infection and transmission are correct. PHE surveillance also cites the SIREN study. This said nothing at all about transmission of the virus, but claimed more than a 70% reduction in infection rates following two doses of the Pfizer vaccine. Again, this appears to be serving as a source for the PHE claim of up to 70% effectiveness.\n\nSIREN allegedly evaluated infections among 20,641 vaccinated and 2,683 unvaccinated health workers. They monitored each group at two-week intervals for a number of months. They then calculated the total accumulated number of days each cohort had been monitored, and divided that by the number of positive RT-PCR results per cohort, to derive a figure of incidents per 10,000 days cumulative monitoring.\n\nFor the unvaccinated, this was said to be 14 incidents per 10,000 days, and for the vaccinated it dropped to four incidents per 10,000 days, following the second dose. Subsequently, the SIREN scientists reported:\n\nThe problem with the SIREN study is that they did not appear to monitor both groups using the same method. The study stated that they would follow up the vaccinated cohorts for 59 days post first dose and 39 days post second dose: the periods where the vaccinated were effectively at risk of possible infection.\n\nIn order to make a meaningful comparison with the unvaccinated, the amount of time they were exposed to potential infection, hazard and risk would need to have been the same.\n\nHowever, the data reported in the study does not seem to correspond to the proposed study design. The 2,683 unvaccinated subjects were monitored for a total of 710,587 cumulative days, which appears to equate to approximately 265 days per unvaccinated study subject.\n\nThe study seems to show that they monitored the 20,641 vaccinated subjects for a total of 108,256 days, equating to 5.25 days per vaccinated study subject.\n\nIt appears that the unvaccinated were exposed to potential infection, health hazards and risks far longer than the vaccinated cohort. The unvaccinated were seemingly monitored continuously throughout the entire trial, whereas the vaccinated were monitored in specific monitoring windows.\n\nThe SIREN study was assessing health workers. This apparent disparity in the duration of monitoring suggests that the unvaccinated were more likely to come into contact with SARS-CoV-2 positive patients, had a higher risk overall than the vaccinated cohort, and faced additional health hazards. Consequently, the chances of the unvaccinated group returning positive test results or falling ill were considerably higher than for the vaccinated group.\n\nThis requires explanation. If this was the case, as the data suggests, then the results from the SIREN study for the Pfizer vaccine were \"null.\" No conclusion can be drawn; this suggests that the SIREN scientists' claim that vaccines reduced infection rates was unfounded.\n\nThere is no distinction here between antibodies gleaned from vaccination and those from natural infection. Consequently, the PHE assessment of vaccine effectiveness in reducing transmission is unusual:\n\nYet five months into the vaccine rollout, the Government said they didn't know what impact the vaccines had on transmission. Do they believe PHE or not?\n\nThe PHE assumption is based upon a claimed proof for the effective reduction of infections, not on clinical trial data. Their claims about reduced transmission are equally questionable. Perhaps this explains government hesitancy. The evidence underpinning the PHE/MRC Nowcast and Forecast model is similarly vague.\n\nEven a casual glance at the governments own number of \"cases\" shows no difference between the reduction in cases in May 2020, without any vaccines, and the post-vaccination case reduction in February and March 2021. If anything, case reduction has been slower following vaccinations than it was without. There certainly is no statistical evidence of vaccines reducing \"infection rates\".\n\nWith a reliance upon RT-PCR testing, nearly all of the studies referenced by PHE, including their own, have measured \"alleged\" infections. By assuming, without evidence, that asymptomatic transmission exists, PHE's claim that reduced infection rates demonstrate an inferred reduction in transmission is groundless.\n\nAs mentioned above, the major problem with all these assessments of efficacy and safety, other than the absence of any clinical trials, is that they assume the risks from the vaccine are negligible and that the MHRA are monitoring the situation. The UK Government claim that nearly 45 million Britons have received at least one vaccine. However, their statistics for vaccine adverse reactions, reported via the MHRA's Yellow Card system, suggest a considerable health risk from the vaccines.\n\nCurrently, just over 1 million adverse reactions, many of them serious, and 1,403 deaths have been reported to the Yellow Card system. In 2018 the MHRA, who are responsible for monitoring and supposedly investigating adverse events, revealed:\n\nThere is no evidence that the MHRA have done anything to rectify this problem. This suggests the possibility of approximately 14,000 UK vaccine-related deaths. Given that genuine Covid-19 mortality is a low percentage of the claimed figure (due to massive over-reporting based upon RT-PCR tests), the direct harm caused by the vaccine could be comparable to that caused by Covid-19. This possibility is simply ignored in PHE Covid-19 Vaccine Surveillance Reports.\n\nWhen researchers submitted a Freedom of Information Request to PHE, asking how they had arrived at their claimed efficacy and safety figures, PHE stated:\n\nThose parameters are defined in PHE vaccine impact assessment for December 2020 to March 2021. In turn, this then uses the PHE/MRC model, under discussion in this article, as the \"proof\" of efficacy and safety. PHE appear to be making claims based upon an eternal feedback loop. The PHE/MRC Nowcast and Futurecast model is the evidence upon which the model is itself based.\n\nThese claims do not appear to be born from any kind of reliable scientific method. What we have instead are assumptions, based upon estimates, which are themselves produced by the self same estimates and assumptions. It is difficult to know how to describe this. All we can say is that the evidence base for these claims appears to be very weak.\n\nOf significant concern is that the PHE vaccine impact assessment makes no assessment of vaccine harm. This is removed entirely from their models. They have no clinical trial data upon which to factor in possible vaccine harm, and absolutely cannot make claims about the relative risk/benefit profile of the vaccines without this data.\n\nThe constant refrain from the MHRA and vaccine manufacturers is that there is no proof determining how many deaths are caused by the Covid-19 vaccines. This is true insofar as postmortem examinations and investigations by the regulators would be needed to clearly establish vaccine mortality. To date, the regulators have not shown any willingness to carry out such investigations. However, they do at least concede that the Covid-19 vaccines can be lethal.\n\nThe UK Government's information for recipients of the AstraZeneca Covid-19 vaccine stated:\n\nTherefore, there is certainly evidence that the vaccines pose a risk which the unvaccinated don't face. The only question is the scale of that risk. But unless the regulators actually investigate those risks, it will remain completely unknown. As long as it remains unknown, there is no justification to any claim that the benefits of the vaccines outweigh the risks. It is untenable.\n\nThe Norwegian health authorities did undertake a risk assessment. Their data showed that the risks from the AstraZeneca vaccine outweighed the risk of Covid-19 for Norwegians under 65. They halted the use of the Vaxzevria (AZD1222 brand name) vaccine.\n\nAlas, it seems we have little hope of a similar level of scrutiny in the UK. The interim trial results for the Pfizer BioNTech trial C4591001 (NCT04368728) were cited throughout the MHRA's Authorisation for Temporary Supply for the vaccine. However, when independent researchers used a Freedom of Information request (FoIR) to ask about why the trials didn't assess the vaccine's impact upon pregnant women, the MHRA stated:\n\nThis indicates that the MHRA hadn't even read the interim trial data that they had cited prior to granting emergency approval of the vaccine. This seeming lack of interest in the most basic regulatory oversight is exemplified by the Chief Executive of the MHRA, Dr June Raine.\n\nIn early June 2021, Dr Tess Lawrie (MBBCh, DFSRH, PhD) was concerned enough about vaccine safety to write to the MHRA urging a halt to the vaccine rollout. Dr Lawrie is a medical researcher, public health policy advisor and contributing research author to the prestigious Cochrane Review. She and her team analysed the adverse reaction reporting in the UK. Writing to June Raine, she stated:\n\nOn 4 June 2021, the MHRA extended the emergency Covid-19 vaccine authorisation to allow the injection of children aged between 12 and 15 years. Announcing the authorisation, June Raine said:\n\nAs the risk to children from Covid-19 is zero, there are no potential benefits to vaccinating them. There are clearly risks associated with the vaccines — and Raine's claim that the vaccine benefit outweighed the risk was wrong. Far from having carefully reviewed the interim clinical trial data, there is good reason to suspect that the MHRA hadn't even read it.\n\nSuch as it is, this is the basis for the PHE/MRC Nowcast and Forecast model. Their statement that \"vaccine efficacy is assumed against both infection and death\" is reasonable, because it is indeed little more than an assumption. They don't have a clue about the vaccine risks, and their models are undoubtedly inaccurate. The only question is how far they deviate from reality.\n\nThey have then contrasted their assumptions with the \"worst-case scenario\" to come up with claims about saving thousands of lives. This model of the worst case comes from the paper by Birell et al. 2020. This is largely based upon assumed numbers of \"cases\", wrongly identified through RT-PCR, informing inaccurate reproduction numbers founded upon dubious concepts like asymptomatic spread.\n\nThe efficacy of the vaccines is assumed, based upon the highly questionable PHE \"science\" we have discussed, while the risks from the vaccines are ignored to produce a completely useless risk/benefit profile. This allows politicians and media outlets like the BBC to make bold claims about how wonderful the vaccines are, using computer models which appear to be about as realistic as Sim City.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/why-we-must-question-vaccine-efficacy-and-safety-claims", "title": "Why We Must Question Vaccine Efficacy And Safety Claims", "description": "The claim by Public Health England that Covid-19 vaccines have saved 27,000 lives is based on assumptions written into a computer model. Are these assumptions reliable and is there clear clinical evidence to substantiate them?", "image": "https://www.ukcolumn.org/sites/default/files/2021-07/Alotofvaccines.png", "article:author": "Iain Davis", "article:publisher": "UKColumn", "article:published_time": "2021-07-02T19:37:56+01:00", "article:modified_time": "2022-10-04T09:16:25+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://archive.is/BkUX0", "https://www.mrc-bsu.cam.ac.uk/blog/latest-modelling-suggests-that-covid-19-vaccines-have-prevented-7-2m-infections-and-27000-deaths/", "https://www.mrc-bsu.cam.ac.uk/now-casting/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/995101/Vaccine_surveillance_report_-_week_24_v2.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/974300/COVID-19_vaccine_surveillance_strategy_March21.pdf", "https://clinicaltrials.gov/ct2/show/results/NCT04368728?term=NCT04368728&rank=1", "https://clinicaltrials.gov/ct2/show/NCT04516746?term=AZD1222&draw=3&rank=3", "https://www.clinicaltrials.gov/ct2/show/NCT04470427", "https://www.clinicaltrials.gov/ct2/show/NCT04614948?term=NCT04614948&draw=2&rank=1", "https://archive.is/l9s8X", "https://archive.is/hf7nU", "https://archive.is/Ew05E", "https://www.bmj.com/content/373/bmj.n1088", "https://www.bmj.com/content/373/bmj.n1088", "https://web.archive.org/web/20200315194723/https://www.who.int/docs/default-source/coronaviruse/real-time-rt-pcr-assays-for-the-detection-of-sars-cov-2-institut-pasteur-paris.pdf?sfvrsn=3662fcb6_2", "https://archive.is/hEnZv", "https://web.archive.org/web/20210304105558/http://philosophers-stone.info/wp-content/uploads/2020/11/The-scam-has-been-confirmed-Dsalud-November-2020.pdf", "https://archive.is/zK9JZ", "https://web.archive.org/web/20210319053159/https://www.eurosurveillance.org/upload/site-assets/imgs/2020-09-Editorial%20Board%20PDF.pdf", "https://web.archive.org/web/20201101025107/https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/895843/S0519_Impact_of_false_positives_and_negatives.pdf", "https://www.ndm.ox.ac.uk/files/coronavirus/ciscommunityvaccinationpaper20210417complete.pdf", "https://web.archive.org/web/20210309172025/https://www.ons.gov.uk/surveys/informationforhouseholdsandindividuals/householdandindividualsurveys/covid19infectionsurveycis", "https://archive.is/l9s8X", "https://archive.is/jIapw", "https://web.archive.org/web/20201202162657/https://www.nature.com/articles/s41467-020-19802-w", "https://www.eurosurveillance.org/content/10.2807/1560-7917.ES.2020.25.21.2000903", "https://archive.is/axsj1", "https://www.sciencedirect.com/science/article/pii/S2666524720301725", "https://www.bitchute.com/video/CXvrchlYJoQB/", "https://archive.is/7AYHZ", "https://web.archive.org/web/20200803041332/https://amp.theguardian.com/world/2020/jun/09/who-expert-backtracks-after-saying-asymptomatic-transmission-very-rare", "https://poseidon01.ssrn.com/delivery.php?ID=717095022119089096018000027011073081019000032009017018022116038047113040016101098126017104094096103089068037048096116122114118121002096090075112109116050046070088084001024017032071021101123061053017024119047011084088065125064074121096072122064072117005076029089093029111015097067019102018099&EXT=pdf&INDEX=TRUE", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://archive.is/vF0Tr", "https://archive.is/5Ov80", "https://in-this-together.com/ukc/FOI-Vaccines-001.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/977249/PHE_COVID-19_vaccine_impact_on_mortality_March.pdf", "https://web.archive.org/web/20210611064423/https://www.gov.uk/government/publications/regulatory-approval-of-covid-19-vaccine-AstraZeneca/information-for-uk-recipients-on-covid-19-vaccine-AstraZeneca", "https://archive.is/7fRMP", "https://web.archive.org/web/20210126195346/https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/944544/COVID-19_mRNA_Vaccine_BNT162b2__UKPAR___PFIZER_BIONTECH__15Dec2020.pdf", "https://web.archive.org/web/20210521131852/https://www.whatdotheyknow.com/request/pfizerbiontech_covid_19_vaccine_2", "https://web.archive.org/web/20210610142714/https://b3d2650e-e929-4448-a527-4eeb59304c7f.filesusr.com/ugd/593c4f_b2acdef3774b4e9ca06e9fae526fd5cd.pdf", "https://web.archive.org/web/20210604104950/https://www.gov.uk/government/news/the-mhra-concludes-positive-safety-profile-for-pfizerbiontech-vaccine-in-12-to-15-year-olds", "https://www.medrxiv.org/content/10.1101/2020.08.24.20180737v1.full-text"], "authors": [], "publish_date": "2021-07-02T19:37:56+01:00"}