{"result_id": "323043", "URL": "https://www.ukcolumn.org/article/the-rationale-for-the-continued-vaccine-roll-out-is-not-evident", "timestamp": "2023-04-25 17:46:43 CEST+0200", "meta": {"description": "The evidence underpinning claimed efficacy and safety for the Pfizer BNT162b2 vaccine is highly questionable.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/the-rationale-for-the-continued-vaccine-roll-out-is-not-evident", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "The Rationale for the Continued Vaccine Roll-Out is Not Evident", "cleaned_text": "We appear to have serious problems with the Covid-19 vaccination programme. The evidence underpinning the claimed efficacy and safety of the Pfizer BNT162b2 vaccine is highly questionable. Statistical analysis raises numerous issues, and until these are addressed, the alleged benefits cannot be shown to outweigh the risks.\n\nWith wider concerns expressed by some of the world's leading immunologists, virologists and epidemiologists, justification for the continued vaccination programme appears to be lacking. Possible unacceptable risk is evident in every nation which has vaccinated a significant proportion of its population.\n\nThe vaccines appear to increase the mortality risk from Covid-19, something the authorities and the regulatory agencies have so far shown little or no interest in investigating.\n\nSome of what we are about to discuss is necessarily speculative. It is based upon a full statistical analysis—but, absent a comprehensive investigation, we cannot be certain why this analysis appears to show an increased Covid-19 mortality risk following vaccination.\n\nEqually, refusal to investigate this correlation is untenable. No claim of either vaccine safety or efficacy is justified without properly accounting for this statistical analysis.\n\nRecently, the UK Column interviewed, among others, Dr Hervé Seligmann (Part 1 here). Dr Seligmann has a B.Sc. in Biology from the Hebrew University of Jerusalem. He earned an M.Sc. in 1991 and gained his Ph.D in 2003. He has had over 100 scientific papers published. He works at the Emerging Infectious and Tropical Diseases Research Unit, Faculty of Medicine, Aix-Marseille University, Marseilles, France. His statistical research partner is the engineer Haim Yativ.\n\nDr Seligmann and Mr Yativ have posted an informative English-language resource page where you can see recent updates to their research. Their analysis of Israeli data appears to show a significant increased risk of Covid-19 mortality (for the vaccinated) during the period between receipt of the first and second vaccine doses, and for a brief period following the second dose. Their research has focused upon the Pfizer/BioNTech BNT162b2 vaccine (tozinameran).\n\nTheir research impacts the risk/benefit analysis for the Pfizer BioNTech mRNA vaccine. It brings the claims made about its efficacy and safety into considerable doubt. Their analysis should be assessed in light of the absence of completed clinical trials for the BNT162b2 vaccine, which are still in the recruitment phase.\n\nNor are there any completed clinical trials for any of the other leading vaccines used in western nations. AstraZeneca's AZD1222 (or ChAdOx1-S) trial (NCT04516746) is due to be completed in February 2023. Moderna's mRNA vaccine phase III trial (NCT04470427) should be concluded by October 2022. Johnson & Johnson's Janssen trial (NCT04614948) is expected to near completion in May 2023.\n\nThere are no posted results for any of these trials. The vaccines have all been approved for population use under emergency authorisation for this reason. They are unlicensed medications and do not have marketing authorisation. The approval decision was made based solely on data provided to the regulators by the manufacturers.\n\nIn Israel, on 11 February 2021, Ynet published an article in which they made the following claim:\n\nIt is important to note that Ynet's statement is based upon an analytical comparison made between the \"completely vaccinated\" and the \"unvaccinated\". Further data from the Israeli Ministry of Health was then made available and was reported on 11 March by the German media outlet Correctiv.org. Dr Seligmann and Mr Yativ then reanalysed the original datasets and found clear discrepancies between the data and the reported \"benefits\" of the vaccines.\n\nKey to this issue was that the claimed \"benefits\" were only measured from completion of the second dose, and took no account of the risks in the five-week period between and immediately following the first and second dose. Seligmann and Yativ referred to this window as the \"period of vaccination\". We will use the abbreviation \"PoV\" for this period throughout the rest of this article.\n\nSeligmann and Yativ analysed the data from the Israeli Ministry of Health (included in their report—linked above) and the data from Dagan et al., 2021. They continue to monitor the datasets but, as already stated, this analysis was for the period up to 11 March.\n\nThey calculated an unvaccinated person's Covid-19 mortality baseline risk from data covering the 303-day period between 1 March 2020 and 20 December 2020, when the Israeli BNT162b2 vaccine rollout began. They analysed the percentage of cases and deaths for the two age groups in the Israeli data (those below and those above 60 years of age) published by the actuaries at the health insurance company Clalit.\n\nUsing this data, Seligmann and Yativ calculated the daily percentage chance of Covid-19 mortality for the respective, unvaccinated cohorts. For those under 60, it was 0.00000257% per day. For Israeli citizens over 60, it was 0.00022631% per day. The data released by the Israeli Ministry of Health, for various intervals in the PoV, were then compared to these unvaccinated baselines.\n\nBetween 0 and 13 days after the first dose of the Pfizer vaccine, the Covid-19 daily mortality risk for the over 60's was 0.003303%. This was more than 14.5 times higher than for the unvaccinated. More than thirteen days following the first dose of vaccination, this risk increased to 0.005484% per day; a risk more than 24.2 times greater than among the unvaccinated. This increased further, for the first six days after the second dose, to 0.006076% — representing a 26.85-fold increased risk of Covid-19 mortality for the vaccinated.\n\nIn the second week following the second dose, the risk for the over-60s remained at 18.4 times higher for the vaccinated. This gradually reduced to 6.7 times worse than the unvaccinated at fourteen days following the second dose, and the excess risk continued to decrease over the the next few weeks. The data showed that there is a a PoV of approximately five weeks during which there is a significantly increased risk of dying from Covid-19 for the vaccinated over-60s.\n\nA similar increased risk of Covid-19 mortality was seen in the data for the under-60s. In the first two weeks following the first dose, the risk was increased 23.86 times. This increased further to a 42.4-times elevated risk in the second week after the first dose. In the first week following the second dose, the data indicated a 94-fold increase in the daily Covid mortality risk for the vaccinated. For the period studied, there was no noted increased risk to the under-60s beyond the first week following the second dose.\n\nSeligmann and Yativ’s statistical analysis clearly showed a significantly higher risk of Covid-19 mortality for the vaccinated during the PoV. They then noted that once the vaccine had taken full effect, the Covid-19 mortality risk for the vaccinated reduced below the risk for the unvaccinated. They found an apparent benefit from the vaccine once the PoV had ended.\n\nTaking into account that the general population risk of Covid-19 mortality is so low, they were able to calculate how many days of full vaccine protection would be required to compensate for the significant increased daily mortality risk during the PoV.\n\nFor the over-60s, after the first dose, the BNT162b2 vaccine would have to provide nearly two years of full protection (690.62 days) to achieve any net benefit. Seligmann and Yativ stated:\n\nThe researchers also noted a number of important caveats. For example, the age distribution and relative risk classes for the unvaccinated wasn't clear in the Israeli data. This could be a compounding factor for their analysis, and they have requested clarification. They have yet to receive a response.\n\nTheir initial analysis did not take account of non Covid-19 mortality patterns. They also disregarded the fact that vaccine protection is not absolute. They went on to extrapolate their research to look at broader mortality patterns. This indicated even further reason for concern, especially among children, suggesting that the vaccinated pose a risk to the unvaccinated.\n\nSeligmann and Yativ noted that the Israeli Ministry of Health and the co-authors of the Dagan, et al. paper had commercial conflicts of interest with Pfizer. However, sticking to the data presented in the Dagan, et al. paper, they noted an overall threefold increase on Covid-19 infection rates for the vaccinated during the five-week PoV.\n\nWe might add our own caveat at this point: a positive RT-PCR test is not evidence of a \"case\" of Covid-19. However, Seligmann’s calculations are based upon the government's definition of a case.\n\nIn summation, Seligmann and Yativ have identified an elevated risk of both infection and subsequent Covid-19 mortality, during the PoV with BNT162b2. This is so marked that to justify it, the absolute protection conferred by the vaccine (an absolute protection which is known not to exist) would have to be prolonged (for many years—without any need of boosters or further vaccination). If this is not the case, then any net benefit from the vaccine is extremely unlikely.\n\nMedia reports from Israel would seem to admit that a net benefit does not exist. The New York Times recently reported:\n\nThe Daily Telegraph reports that BNT162b2 recipients are already being required to take a booster. Pfizer CEO Albert Bourla announced that Pfizer's claimed efficacy drops to 84% within six months. Bourla stated that supposed \"efficacy\" against severe disease declines by 6% every two months. He alleges that this necessitates the booster.\n\nIf Seligmann and Yativ's statistical analysis is correct, this strongly indicates that there is no possible Covid-19 health benefit for the BNT162b2 vaccine. Consequently, a \"booster\"—of something which appears to cause harm—would be irrational.\n\nSeligmann and Yativ's findings have seemingly been corroborated by the research of Dr Steve Ohana and Dr Alexandra Henrion-Caude. They found a large spike in mortality among the 20-49 age group in Israel. They then compared this to other nations with a high vaccine coverage (taking the jurisdiction of England & Wales) and noted the same phenomenon. They concluded:\n\nIn addition, Peter Schirmacher, director of the Pathological Institute in Heidelberg, Germany, who advocates Covid-19 vaccination, has highlighted the need for immediate post-mortem examinations of the vaccinated. Schirmarcher carried out more than forty autopsies on people who died shortly after vaccination in Germany. He found that up to 40% of them died from cerebral vein thrombosis or autoimmune disease that could be attributable to the vaccines.\n\nThere is even a suggested mechanism explaining how this increased mortality could be occurring. An autopsy of a recently vaccinated 86-year-old decedent found that the S-protein (spike protein), whose production is induced by the BNT162b2 vaccine, was found in almost every organ of the man's body. This is contrary to the claims of the mRNA vaccine manufacturers, who maintain that the S-protein is only produced by and remains at the vaccine site.\n\nDoctors for Covid Ethics are among the many renowned scientists and physicians who have raised concerns about the S-protein produced by the body's cells following an mRNA Covid jab. They state:\n\nNot only is there statistical evidence suggesting cause for concern; there is physiological evidence that could account for the data. It is not known whether the apparent increased mortality is derived from this suggested mechanism—and that is the point. Without a proper investigation, no-one knows.\n\nReason for Concern in the UK\n\nCurrently in the UK, the MHRA Yellow Card scheme data suggests that more than 1,500 people may have died as a result of vaccination. In addition, the MHRA has stated that Yellow Card reports only represent 10% of total vaccine related mortality, suggesting a plausible 15,000 vaccine related deaths so far in the UK.\n\nThe MHRA now states that this under-reporting estimate should not be used for Covid-19 vaccines, because (they allege) awareness of their Yellow Card scheme for vaccine adverse drug reactions has somehow improved. They have offered no evidence to substantiate this claim.\n\nWe might ask what the point of the MHRA Yellow Card scheme is. On the one hand, the agency states that its purpose is to act as an \"early warning system\" for possible vaccine harm. Yet the MHRA also states:\n\nThis would be acceptable if the MHRA had investigated those possible adverse reactions to establish whether they were ADRs. Again, there is no evidence that they have. All we can say is that the MHRA does not interpret them as vaccine ADRs. Therefore, the chance of their Yellow Card scheme actually providing an \"early warning\" would appear to be nil.\n\nIf we apply Seligmann and Yativ's analysis to the UK vaccine rollout data, a very worrying picture emerges. The Israeli researchers considered the BNT162b2 vaccine in Israel. This brand was also the first vaccine administered to the most vulnerable in the UK. It is not unreasonable, therefore, to apply their findings to the UK data.\n\nThe first dose of the BNT162b2 was given to Margaret Keenan on 8 December 2020. The vaccine rollout began in earnest between a week and two weeks later. As in Israel, it was in full swing by 20 December 2020.\n\nBrian Pinker was the first person in the UK to receive an AstraZeneca vaccine, on 4 January 2021, nearly a month later. The rollout of the AstraZeneca vaccine also took a couple of weeks to get fully up to speed.\n\nThe vaccines were distributed in keeping with the UK Government's priority schedule. This meant that the first to receive the vaccine were the most vulnerable in British care homes, hospitals and other care settings.\n\nOn 10 January 2021, the then Health Secretary, Matt Hancock, confirmed figures reporting that 2.3 million people had been vaccinated for Covid-19 in the UK. While specific data on the vaccine distribution has not been released, it is clear that the vast majority of these people must have received BNT162b2.\n\nOn 22 November 2020, the seven-day average for daily Covid-19 mortality in the UK stood at 466.4. By 8 December—the day of Keenan's vaccination—the average had dropped to 428.9. This represented a decline of 8% in the daily mortality average in just over two weeks.\n\nBy 19 January 2021, the seven-day daily Covid-19 mortality average had increased by nearly 300% to 1285.7. Using Seligmann and Yativ's PoV—assuming a full BNT162b2 vaccine programme from 15 December onward, and using the UK Government’s own statistics—it appears that a significant proportion of 29,755 reported Covid-19 deaths may have been attributable to the increased mortality risk presented by the vaccine.\n\nWe cannot say, without a thorough investigation, what that proportion is. However, the distribution of that mortality does appear to correlate strongly with the distribution suggested by Seligmann and Yativ's analysis.\n\nTherefore, it is reasonable to conclude that the Yellow Card data indicating a possible 1,500 vaccine-related deaths appears to underestimate vaccine harm considerably. The known phenomenon of under-reporting—combined with the remarkable correlation between the Israeli analysis, the vaccine rollout of BNT162b2 and the official UK Government statistics—suggests that the Pfizer vaccine is dangerous.\n\nAs the data currently stands, it seems that many thousands of alleged Covid-19 deaths may have occurred due to the additional risks posed by the BNT162b2 vaccine alone. Given the lack of clinical trials, it is not possible for anyone to state categorically that any of the major Covid-19 vaccines is either effective or safe; certainly not Pfizer BNT162b2.\n\nGovernment claims of lives saved do not stand up to scrutiny. When we also consider the growing evidence of risks associated with other vaccines, the rationale for the continued vaccine rollout is not evident.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/the-rationale-for-the-continued-vaccine-roll-out-is-not-evident", "title": "The Rationale for the Continued Vaccine Roll-Out is Not Evident", "description": "The evidence underpinning claimed efficacy and safety for the Pfizer BNT162b2 vaccine is highly questionable.", "image": "https://www.ukcolumn.org/sites/default/files/2021-08/Vax001.jpg", "article:author": "Iain Davis", "article:publisher": "UKColumn", "article:published_time": "2021-07-30T19:42:56+01:00", "article:modified_time": "2021-08-21T15:16:16+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://doctors4covidethics.org/letter-to-physicians-four-new-scientific-discoveries-crucial-to-the-safety-and-efficacy-of-covid-19-vaccines/", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-2-international-scientific-experts-discuss-covid-19-vaccine", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-1-international-scientific-experts-discuss-covid-19-and-vaccines", "http://www.nakim.org/israel-forums/viewtopic.php?t=270812", "https://clinicaltrials.gov/ct2/show/results/NCT04368728?term=NCT04368728&rank=1", "https://clinicaltrials.gov/ct2/show/NCT04516746?term=AZD1222&draw=3&rank=3", "https://www.clinicaltrials.gov/ct2/show/NCT04470427", "https://www.clinicaltrials.gov/ct2/show/NCT04614948?term=NCT04614948&draw=2&rank=1", "https://archive.is/9MsOS", "https://www.ynetnews.com/health_science/article/Hkm6mJmW00", "https://correctiv.org/faktencheck/2021/03/11/covid-19-in-israel-nein-die-impfung-erzeugt-keine-40-mal-hoehere-sterblichkeit/", "https://in-this-together.com/ukc/Selligmann-Yativ-Paper.pdf", "https://pubmed.ncbi.nlm.nih.gov/33626250/", "https://www.clalit.co.il/he/your_health/family/Pages/corona_in_israel.aspx", "https://www.ukcolumn.org/video/doctors-for-covid-ethics-symposium-session-1-the-false-pandemic", "https://www.ukcolumn.org/article/covid-19--everything-and-nothing", "https://archive.is/NvEGv", "https://archive.is/xlKBt", "https://www.msn.com/en-us/health/medical/13-of-israels-older-population-has-received-covid-19-booster-shot-as-delta-cases-rise/ar-AAN4UDP", "https://archive.is/hsq79", "https://archive.is/oOL3I", "https://thepathologist.com/power-list/the-power-list-2015/peter-schirmacher/", "https://www.welt.de/vermischtes/article232900871/Corona-Pathologe-fordert-mehr-Obduktionen-von-Geimpften.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8051011/", "https://www.pfizer.com/news/hot-topics/the_facts_about_pfizer_and_biontech_s_covid_19_vaccine", "https://doctors4covidethics.org/wp-content/uploads/2021/08/Complement-activation-and-vaccines.pdf", "https://www.ukcolumn.org/video/frances-long-time-vaccine-policy-chief-covid-policy-is-completely-stupid-and-unethical", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/article/greater-manchester-vaccination-centre-and-mhras-yellow-card-adr-scam-part-1", "https://archive.is/vF0Tr", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1005194/Coronavirus_vaccine_-_summary_of_Yellow_Card_reporting_14.07.21_clean.pdf", "https://archive.is/2SflP", "https://web.archive.org/web/20210130210628/https://www.dailymail.co.uk/news/article-9134945/Britains-great-vaccine-roll-plan.html", "https://coronavirus.data.gov.uk/details/deaths", "https://www.ukcolumn.org/article/why-we-must-question-vaccine-efficacy-and-safety-claims", "https://www.ukcolumn.org/index.php/article/clotting-and-covid-science"], "authors": [], "publish_date": "2021-07-30T19:42:56+01:00"}