{"result_id": "323004", "URL": "https://www.ukcolumn.org/article/mhras-letter-to-debi-evans-we-didnt-use-our-ai-tool-to-assess-yellow-card-data-on-covid", "timestamp": "2023-04-25 17:46:20 CEST+0200", "meta": {"description": "The MHRA tells UK Column's Debi Evans that its vaunted £1.5 million Artificial Intelligence tool was not used for the assessment of Yellow Card data on reported Covid vaccine injuries.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/mhras-letter-to-debi-evans-we-didnt-use-our-ai-tool-to-assess-yellow-card-data-on-covid", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "MHRA's letter to Debi Evans: We didn't use our AI tool to assess Yellow Card data on Covid vaccine harms", "cleaned_text": "We reproduce below the letter received by Debi Evans from Andy Morling at the UK's pharmaceutical regulator MHRA, as discussed in UK Column News on 7 December 2022 (commencing at 16:11).\n\nThe artificial intelligence tool purchased by the MHRA that is the subject of part of the below letter was reported by Healthcare IT News as follows on 4 November 2020: \"The Medicines and Healthcare [products] Regulatory Authority (MHRA) has paid Genpact UK a tender of £1.5m to develop an AI tool to sift through the high volume of reports of adverse reactions to COVID-19 vaccines.\"\n\nThe MHRA's actual usage of the AI tool as set out below by Andy Morling could instead be put in lay terms as filling in the blanks in Yellow Card submissions.\n\nThank you for attending and submitting your questions to the MHRA’s Public Board which was held in November 2022, asking what mechanism was put in place for the adverse events expected from COVID-19 vaccines, and whether MHRA are considering approving the Moderna COVID-19 vaccines for 6-month-old babies. The large number of questions that we receive, often means that we are unable to answer all questions during the session, but I hope I can address the points you raise. I have also provided additional information at the end of this letter in response to the questions you asked at the Board within the chat function. This was regarding support for vaccine injured which I hope reassures you that patient safety is our highest priority.\n\nRegarding your first question, with any major new UK vaccination campaign, we always develop a proactive vigilance strategy, and the COVID-19 vaccines are no exception. Like all medicines, vaccines can cause side effects. Most are mild and short-term, and not everyone gets them. Some side effects can come to light when used by a larger number of people than took part in clinical trials.\n\nWith respect to the anticipated volume of suspected adverse drug reaction (ADR) reports for the COVID-19 vaccination programme, this was estimated from a number of previous vaccination campaigns. We acknowledged that actual numbers of reports would be dependent on various factors including the number of doses administered and use of concurrent treatments (for instance to manage fevers). Our past experience with other new immunisation campaigns is that we tend to receive a single Yellow Card report per 1,000 doses administered and so we prepared our surveillance systems on that basis. It is important to note that a report of a suspected side effect is not proof that the vaccine caused it but a suspicion of this by the reporter.\n\nWe developed a range of resources and technology to support the proactive vigilance of the COVID-19 vaccination programme. The use of artificial intelligence (AI) was one element of that. We take every report of a suspected side effect seriously and we have combined the review of reports of adverse events of special interest with statistical analysis of anonymised clinical records. This specific AI tool chosen for the surveillance of COVID-19 vaccines was due to the potential size and scale of the vaccination campaign. The tool was not used for assessment of Yellow Card data [emphasis added], but to help ensure that all the information from the reporter is well structured to support analysis and subject to robust quality assessment.\n\nIn response to your second question, immunisation schedules are drawn up by the Joint Committee on Vaccines and Immunisations (JCVI) and are published on the UK-HSA website, there are also useful COVID specific resources that you can refer to. As outlined in previous responses, the MHRA issues regulatory approval for use of COVID-19 vaccines in the UK, the Joint Committee on Vaccination and Immunisation (JCVI) advises the Government on COVID-19 vaccination policy, including which age groups should be offered a vaccine.\n\nThe safety of the COVID-19 vaccines is of paramount importance to us; no new vaccine for children will be approved by the MHRA unless the expected standards of safety, quality and effectiveness are met. Furthermore, as with all vaccines and medicines, their on-going safety is continuously monitored, and benefits and possible risks remain under review. Should a new safety issue be confirmed we will act promptly to inform patients and healthcare professionals and take appropriate steps to mitigate any identified risk and protect public health.\n\nFinally, regarding the questions raised at the Board in the chat function, the MHRA also works closely with public health partners to review the effectiveness and impact of the vaccines, to ensure the benefits continue to outweigh any side-effects. The National Institute for Health and Care Research (NIHR) has allocated more than £110million for COVID-19 vaccine research that includes consideration of vaccine safety, covering monitoring of adverse reactions. The Department of Health and Social Care (DHSC) has also commissioned a £1.6million programme of work through the NIHR to understand the rare condition of blood clotting with low platelets following COVID-19 vaccination.\n\nDue to the complex nature of cases, Vaccine Damage Payment Scheme (VDPS) assessments can only be undertaken by medical professionals with specialised training. As COVID-19 is a recent addition to the scheme, time was needed to understand the adverse events associated with the vaccines and procure the clinical capability required to assess claims. All claimants will be notified of updates to their claims by the NHS Business Services Authority (NHSBSA), which manages the operation of the VDPS on behalf of the DHSC.\n\nFor further information if you may wish to contact the NHSBSA directly.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/mhras-letter-to-debi-evans-we-didnt-use-our-ai-tool-to-assess-yellow-card-data-on-covid", "title": "MHRA's letter to Debi Evans: We didn't use our AI tool to assess Yellow Card data on Covid vaccine harms", "description": "The MHRA tells UK Column's Debi Evans that its vaunted £1.5 million Artificial Intelligence tool was not used for the assessment of Yellow Card data on reported Covid vaccine injuries.", "image": "https://www.ukcolumn.org/sites/default/files/2023-01/s960_MHRA_GovUK.jpg", "article:author": "UK Column Reporters", "article:publisher": "UKColumn", "article:published_time": "2023-01-03T12:24:24+00:00", "article:modified_time": "2023-01-05T19:34:32+00:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.gov.uk/government/organisations/medicines-and-healthcare-products-regulatory-agency", "/video/uk-column-news-7th-december-2022", "https://www.healthcareitnews.com/news/emea/uk-use-ai-covid-19-vaccine-side-effects", "https://yellowcard.ukcolumn.org/yellow-card-reports"], "authors": [], "publish_date": "2023-01-03T12:24:24+00:00"}