{"result_id": "323038", "URL": "https://www.ukcolumn.org/article/monkeypox-and-the-covid-19-vaccine", "timestamp": "2023-04-25 17:46:40 CEST+0200", "meta": {"description": "What we are witnessing now with monkeypox suggests Covid vaccine-induced immunological compromise and foul play.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/monkeypox-and-the-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Monkeypox and the Covid-19 Vaccine", "cleaned_text": "UK Column has covered various aspects of the Covid-19 virus and has looked in depth at the significant negative effects of the Covid-19 vaccine, including clotting, and also the change in immunological mechanisms after vaccination. Those mechanisms were used to explain the poor performance of the Covid-19 vaccine campaign, highlighted by an increased relative risk of infection for those vaccinated compared to the unvaccinated.\n\nThis article will address the current atypical spread of monkeypox virus around the world. To be clear, up until now, monkeypox hasn’t caused large clusters of infection in separate countries at the same time—that is highly unusual.\n\nMonkeypox is one of the four genera of pox viruses that can infect humans. There are two distinct clades of monkeypox virus; the current infections are the West African version and are typically mild, with a death rate of less than one per cent. Chicken pox is an unrelated herpes virus, specifically Varicella.\n\nIt needs to be explained why we are seeing such a highly unusual pattern of infections. The medical concern is that we are witnessing an increase in human-to-human transmission.\n\nCurrent data indicate that there are 107 confirmed cases—of which 19 have been hospitalised—and 85 suspected cases, with four hospitalisations among them. Taking only the confirmed cases, we thus obtain an 18% hospitalisation rate; combining the cases of all statuses, we get a 12% hospitalisation rate. However, those percentages will change as the cases increase.\n\nEarly data suggest that there is an increased risk amongst men who have sex with men.\n\nIn Stabilising the Code, we learned that:\n\nSpecifically, they altered the genetic code of RNA.\n\nThe RNA alteration results in the body’s immune defences—specifically, toll-like receptors (TLR)—not recognising foreign invaders like viruses. As I continued to set out in Stabilising the Code:\n\nDominguez-Andres et al. discovered that not only had that technology worked well, but it appeared to have induced long term immune tolerance in the vaccinated:\n\nToll-like receptors were found not to work as well after vaccination as before. That was not supposed to happen. Obviously, you need your TLRs to be working in order to fend off viruses like monkeypox.\n\nStack and Bowie investigated monkeypox virus and the role of TLR 4:\n\nHarte et al. demonstrated that pox virus suppresses the host defence by blocking TLR 3:\n\nWe also know that TLRs, upon detecting a virus, will activate other parts of the immune system. Khanmohammedi and Rezaei write:\n\nIt being the case that TLRs activate other parts of the immune system—and given that, due to alterations in the vaccine mRNA, TLRs are no longer as responsive—we should expect to see a difference in downstream immunological profiles as well after vaccination.\n\nClearly, the attenuation (weakening) of TLRs after Covid-19 vaccination is having a significant negative effect: in this case, the possible reduction of interferon in response to infection—an important defence against viruses.\n\nPox viruses, like so many other viruses, have developed to try to outwit the human immune defences.\n\nThat has been observed in the science literature, such as Arndt et al., Evasion of the Innate Immune Type I Interferon System by Monkeypox Virus; and Johnstone et al., who demonstrate just why the virus needs to do so, in: In vitro inhibition of monkeypox virus production and spread by Interferon-β.\n\nIndeed, pivotal to the success or failure of the monkeypox virus is its ability to overcome TLRs and switch off interferon.\n\nOf course, once the immune system is primed to have a weaker response by TLRs and IFN, then it is more susceptible to pox infection. All that is then required to challenge it is exposure to the target virus.\n\nThe immune system is a symphony of complex responses, so an altered TLR response does not guarantee successful infection upon exposure to monkeypox virus—but it does increase the chances of it, since a major, initial defence mechanism has been weakened; especially if other factors increase that susceptibility.\n\nWho is being infected?\n\nThe list of those known to be infected with monkeypox in the recent outbreaks is almost exclusively male, with reports of male-to-male sex being a common factor. It is still very early in the investigation, so that picture may change. However, it is well understood that men who have sex with other men have a demonstrably increased risk of infection with such viruses.\n\nThe current published list of those infected with monkeypox has one woman on it. That, plus the relatively high percentage of gay and bisexual men suggests it may be being spread through sexual networks.\n\nThe question has to be asked, though: why now? Men haven’t just started having sex with other men. And are all the cases connected?\n\nThe global incidences of monkeypox—and the apparent, highly unusual, velocity of spread—argues that something new has entered the equation; something has changed.\n\nWhat is the new factor?\n\nLockdown my have played a part in immune reduction in adults, due to the deprival of human contact, as described in Medical News Today:\n\nYet most countries are relatively back to normal now, with people socialising again; and, unless there are chronic effects, the very fact that close contact is hypothesised as a mechanism of monkeypox spread argues against a policy of social isolation of those infected.\n\nI suggest that we would be foolish to ignore chronic immune alteration due to Covid-19 mRNA vaccination, and the specific attenuation of TLRs that has been leading to altered interferon production and increasing susceptibility to viruses such as monkeypox.\n\nThankfully, most cases are mild, but tragically, we will see fatalities, as we do with other diseases, and the affect that the Covid-19 vaccine-induced altered immune response will have on monkeypox mortality is unknown. We will, no doubt, also be seeing more fear-mongering by the media and governments.\n\nOf course, they have already started; in fact, long before the first reported cases this month even happened.\n\nThe Strengthening Global Systems to Prevent and Respond to High-Consequence Biological Threats tabletop exercise conducted in partnership with the Munich Security Conference (the largest annual meeting of the intelligence agencies of the Western world) in November 2021 seems accurately to have predicted this current monkeypox scenario—even down to the month it started.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/monkeypox-and-the-covid-19-vaccine", "title": "Monkeypox and the Covid-19 Vaccine", "description": "What we are witnessing now with monkeypox suggests Covid vaccine-induced immunological compromise and foul play.", "image": "https://www.ukcolumn.org/sites/default/files/2022-05/monkeypox-exercise.jpg", "article:author": "Dr Mike Williams", "article:publisher": "UKColumn", "article:published_time": "2022-05-23T10:58:56+01:00", "article:modified_time": "2022-05-25T19:10:53+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["yellowcard.ukcolumn.org", "https://www.ukcolumn.org/index.php/article/clotting-and-covid-science", "https://www.ukcolumn.org/index.php/article/stabilising-the-code", "https://www.ukcolumn.org/article/what-explains-rising-cases-among-the-vaccinated", "https://www.sciencedirect.com/topics/neuroscience/poxviruses", "https://www.ncbi.nlm.nih.gov/books/NBK574519/", "https://pubmed.ncbi.nlm.nih.gov/25794504/", "https://docs.google.com/spreadsheets/d/1CEBhao3rMe-qtCbAgJTn5ZKQMRFWeAeaiXFpBY3gbHE/edit#gid=0", "https://www.ukcolumn.org/article/stabilising-the-code", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8071766/", "https://www.immunology.org/public-information/bitesized-immunology/receptors-and-molecules/pattern-recognition-receptors-prrs", "https://www.medrxiv.org/content/10.1101/2021.05.03.21256520v1", "https://www.sciencedirect.com/science/article/pii/S0021925820434386", "https://rupress.org/jem/article/197/3/343/39714/The-Poxvirus-Protein-A52R-Targets-Toll-like", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8014260/", "https://www.medrxiv.org/content/10.1101/2021.04.20.21255677v2.full.pdf", "https://pubmed.ncbi.nlm.nih.gov/26246580/", "https://virologyj.biomedcentral.com/articles/10.1186/1743-422X-9-5", "https://dx.doi.org/10.1186%2Fs12889-016-3149-z", "https://docs.google.com/spreadsheets/d/1CEBhao3rMe-qtCbAgJTn5ZKQMRFWeAeaiXFpBY3gbHE/edit#gid=0", "https://www.pinknews.co.uk/2022/05/20/what-is-monkeypox-symptoms-gay-bisexual-men-explainer/", "https://www.medicalnewstoday.com/articles/how-have-pandemic-lockdowns-affected-the-immune-system#The-psychological-effects-of-isolation-on-immunity", "https://www.nti.org/wp-content/uploads/2021/11/NTI_Paper_BIO-TTX_Final.pdf"], "authors": [], "publish_date": "2022-05-23T10:58:56+01:00"}