{"result_id": "323028", "URL": "https://www.ukcolumn.org/video/anecdotals-a-realistic-look-at-vaccine-injury-with-jennifer-sharp", "timestamp": "2023-04-25 17:46:34 CEST+0200", "meta": {"description": "Those reporting harm from Covid jabs face being ignored and silenced. There is no honest attempt by the authorities to measure the scope of vaccine injury. So the stories remain anecdotes and their narrators remain—the Anecdotals.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/anecdotals-a-realistic-look-at-vaccine-injury-with-jennifer-sharp", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Anecdotals—A realistic look at vaccine injury with Jennifer Sharp", "cleaned_text": "American filmmaker Jennifer Sharp was injured by a Covid–19 injection. When she started to speak about her experiences, she was silenced; shamed; ignored. She was told she should say nothing about what had happened; moreover, that she had a moral duty to to keep it secret, for the greater good.\n\nThen the mandates came, and she was not just injured but now also excluded from society. As she did not have the second shot, her vaccine status was \"unvaccinated\", despite her having received, and been injured by, a Pfizer/BioNTech Covid–19 vaccine. When she found she could not work due to her vaccine status, she decided to tell her story in film. In fact, she told not only her own story but those of many others too, all dismissed as anecdotes.\n\nThese people have been abandoned and silenced. They are the anecdotals.\n\nSharp based her film Anecdotals around a series of questions. For example, were the vaccine trials really rigorous and thorough? Twelve-year-old Maddie de Garay was in the Pfizer trial. She was damaged so badly that she was forced to use a wheelchair and a feeding tube. This information was not communicated in the assessment of the trial. Other anecdotals had severe reactions to their first jab and had to withdraw from the trial as a result. The trial report simply recorded them as withdrawing from the study. It did not admit why.\n\nThe firm also exposes that the burden of proof has been reversed. Those injured are being asked to prove that it was the vaccine that caused the the harm. We are not supposed to doubt the vaccine safety, despite the evidence, but we are supposed to doubt the injured, irrespective of the evidence. Their testimonies are not evidence, we are told. They are just anecdotal.\n\nSo those injured are not being studied; the evidence is not being gathered. The evidence remains anecdotal because of neglect. Or is it callous disregard?\n\nAnd what of those US doctors who spoke out, or who developed protocols to help their patients that conflicted with the recommendations of the CDC? They faced loss of job, loss of medical licence, loss of career. The result? Doctors are afraid. Too afraid to speak truthfully in public; too afraid to issue medical certificated to those who should have received an exemption from the vaccine mandates; too afraid even to report the adverse reactions. The medical profession is finding that it is in an ugly time.\n\nWith the restriction on the freedom of doctors to do their job, the rights of the patients—rights to appropriate medical care and rights to information—are eaten away. Informed consent becomes impossible.\n\nJennifer Sharp notes that misinformation on Covid–19 was added to the definition of terrorism by the United States Government during the Covid–19 lockdown. That terrorism was conflated with supplying medical care and speaking truthfully shows just how far the state was willing to go to protect its narrative.\n\nIn closing, Sharp discusses the friends she has made across political and cultural boundaries that would once have been a significant impediment, but that fell away as those injured by the vaccine found common cause and a shared objective. They support, love and fight for each other. Their anthem is the heartrending song by Five Times August, Fight For You.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/anecdotals-a-realistic-look-at-vaccine-injury-with-jennifer-sharp", "title": "Anecdotals—A realistic look at vaccine injury with Jennifer Sharp", "description": "Those reporting harm from Covid jabs face being ignored and silenced. There is no honest attempt by the authorities to measure the scope of vaccine injury. So the stories remain anecdotes and their narrators remain—the Anecdotals.", "image": "https://www.ukcolumn.org/sites/default/files/2023-02/Jennifer%20Sharp.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/why-are-we-still-giving-people-covid-19-vaccines", "http://www.anecdotalsmovie.com/", "https://www.goodreads.com/book/show/8217167-callous-disregard", "https://www.ukcolumn.org/video/musician-brad-skistimas-five-times-august-fighting-for-our-children", "https://www.youtube.com/watch?v=USMBS7u8Bes"], "authors": [], "publish_date": "2023-02-23T18:36:15+00:00"}