{"result_id": "323010", "URL": "https://www.ukcolumn.org/video/vaccine-damage-real-people-wayne", "timestamp": "2023-04-25 17:46:23 CEST+0200", "meta": {"description": "In an upsetting testimony, UK Column interviews Wayne about his adverse reactions to Covid vaccination.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/vaccine-damage-real-people-wayne", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Vaccine Damage—Real People: Wayne", "cleaned_text": "Many people have been diagnosed as vaccine-injured after a Covid-19 vaccination. Some have received compensation from the UK Government, but others have not yet had their personal adverse reactions recognised—even though the vaccine has changed their lives and caused them major trauma.\n\nWayne Cunnington, banned from Twitter for describing what has happened to him, is one of these people.\n\nHe kindly agreed to tell us his story so that others may be aware of the dangers of vaccine adverse reactions.\n\nUK Column’s nursing correspondent, Debi Evans, and Brian Gerrish spoke to Wayne about his experiences of living with his vaccine adverse reactions.\n\n00:40 Brian Gerrish: Good afternoon. We are here for a very interesting discussion with a gentleman called Wayne, who’s kindly agreed to talk to the UK Column. He’s a man who’s in the wars after receiving a Covid-19 vaccination. This is a subject which seems to be coming to the fore more and more. We’ve had a number of people contact us and want to explain what has happened to them. One of the undertones has been that they don’t feel that they’ve been listened to. So Wayne, thank you very much for agreeing to speak to Debi and myself this afternoon.\n\n01:20 Wayne: Thank you for having me on.\n\n01:23 Brian Gerrish: Well, we’re going to limit the time, because you’ve got a commitment, and also because you’re limited in the time you can be in front of the computer, which perhaps we can discuss a little bit more. But really, we want to give you the floor to say anything you’d like to say about your experiences and what you’d like to tell the wider public to help inform them about matters to do with Covid vaccinations.\n\nPerhaps it would be good to start at the beginning. Tell us a little bit about yourself, and then what happened on the journey to have the vaccination, and then what you’ve experienced subsequently.\n\n02:09 Wayne: I was a very healthy 51-year-old male. I worked a lot. I trained a lot, exercised, I ran a lot as well, generally very healthy. Nothing bar the odd cold. Through my mother being ill the previous year, 2020—subsequently, she passed away—and amidst the fear factor being driven by the media and the Government, I foolishly decided to protect my father and have the vaccine in February 2021.\n\nIt was the worst decision that I could ever have made, looking back. There’s no way I would have even contemplated it if I had been aware of just some of the slightest side effects. But I had my vaccine in February, and there’s no changing it. Within just moments, I started to have a slight headache and an aching arm. But within hours, it was a crippling headache that I had. I’d gone to sleep with painkillers, just trying to clear the pain. And nothing really helped for days.\n\nI battled with my doctors for two weeks to take me seriously, but they didn’t want to listen. They just said, \"Well, don’t worry, it’s just normal side effects.\" There was no informed consent to anything. You basically get a vaccine: they thrust a piece of paper in your hand, saying, \"Here you are: you might get some side effects, but don’t worry about it.\"\n\nSo two weeks to the day—I’d been battling to see a doctor and hearing different things like, \"Yes, we will see you\"; \"No, we don’t need to see you\"—I finally got to see a doctor, two weeks to the day.\n\nMy condition was so severe at that stage, I’ve lost all awareness of how serious it was: my dizziness, my … I now call it brain fog, but by then I was delirious. I wasn’t aware of how seriously ill I was. I could barely walk. My doctor sounded so worried on the phone. He said, \"I need to see you now,\" but I just wasn’t making any sense. Within seconds of seeing me in the hallway in the doctor’s surgery—because I’d driven there without actually thinking; nobody in their right mind would drive when they’re that seriously ill—within seconds of him seeing me he said, \"I’m going to call an ambulance.\"\n\nThat was a journey that I hadn’t…er…it was a strange time. The paramedic saw me. He told me that they were going to tell me to make my story seem much worse than it was. But when they checked my blood pressure, it was 201/120. [In response,] he said, \"Don’t worry, we don’t need to now tell you to pretend you’re much more serious to get your case seen more seriously.\"\n\nThat started off eleven days in hospital. They didn’t really know what to do. They saw me with extreme high blood pressure, which is a side effect of the vaccines. All they could do was treat that, which was [with] blood pressure medication and pain relief, because by that stage, my brain was so inflamed it was causing me brain tissue damage. The condition it gave me was called hypertension—and, if unchecked, it does more and more damage. Over the days and days, I was trying to get in to see my doctor, with a seriously bad headache. It was doing more damage.\n\nI was told by the admitting doctor that if only I’d got there sooner, the damage would never have been that severe. But over the days [in hospital], I had a CAT scan, I had an MRI, I had a lumbar puncture, deep ophthalmic scans just to discount anything else that was going on in my body.\n\nWhat it came down to was the demyelination of the tissue surrounding the brain, which in fact gave me brain tissue damage. It was clear on the MRIs that there was a white clouding over the temporal lobes, which, even months later, was still there. Although the pattern had changed, it still didn’t mean it wasn’t any better. It just meant something else.\n\nThere were so many things going on in my brain. I now get migraines regularly. It’s enhanced more with computer use. The more I try to do normal things, normal life things, it triggers it. So it’s hard to stay away from the things I enjoy, but you try to keep going.\n\nWithin days of me being discharged, because they didn’t know what to do, I had a diagnosis of MS and/or dementia because of the tissue damage. This has lead to no other further treatment. Basically, they’re overseeing my case. I’ve had further MRIs. I’ve seen neurologists. I’ve made improvements in certain areas, but then I’ve made much deeper changes in others. And so I had to finally admit that that wasn’t going to work any more.\n\nI tried to work several times in the last year, after being in that hospital several other times through a worsening in the brain information, that was causing full body numbness. So I battled through using a walking stick, to losing it, to thinking I was going to improve, to then getting worse, getting back to work—and that really did not agree with my body, I can’t take working with computers much.\n\nOn the physical side of things, I just don’t have the energy, I’m just so fatigued. I probably don’t go out walking for more than once a week now, if I can do that, which I did today. It just leaves me worn out for days. The muscle ache just means that you look normal, but you don’t feel normal. So from January this year, I decided that was it. I left my job and decided to go through along the term of rehabilitation. Hopefully, this is going to make a bit more difference, but at the moment it doesn’t.\n\nMy doctor, from day one of seeing me in the doctor’s surgery before we called the ambulance, said, \"Yes, we’ll take your case seriously and we’ll put your injury through the Yellow Card system,\" so the hospital doctor supposedly did. But since that day, the narrative changed. So what he then decided to do was try to do everything but take me seriously. \"It must be something else causing the issue.\" And I’ve had really silly tests and exams, like 24-hour urine tests, just trying to discount absolutely anything else causing the injury.\n\nTo this day, he still won’t accept that it is [caused by the Covid vaccine], although he originally accepted that it was a vaccine-related injury. And the hospital went ahead and admitted that, and put it on my discharge papers that I got from the hospital. So all the evidence is there. Right from the word “go”, I knew what was being accepted, so that gave me the drive to carry on, and try and tell people my story early on last year. And just try and help give people better information, because the more information you have, the better decision you can make for your own health.\n\nBut as for my own well-being, I’ve pretty much been left alone. The doctor doesn’t ring me. All I do is get is repeat prescriptions every month. I can’t get that for free, because blood pressure medication isn’t seen as a serious issue. Although I’ve now been left with hypertension through no fault of my own, it’s something that I now need to be treated for—for the rest of my life.\n\nThe pain relief I needed at the height was Zapain, which is a codeine-paracetamol mix. I have my maximum, up to 8 a day sometimes. And Sumatriptan, which is a migraine relief medication. All these I need to keep me going.\n\nThe doctors, they just get to a point when they just cut off and they really don’t want to know any more. People like myself have struggled to get anywhere—even half as far as what I have. I think what helped my case is the fact that I got it admitted, early on, on the discharge notes. But for many people, I think the narrative changed around March/April time [2021]. Doctors were quite strictly told, \"Do not accept blame through vaccines,\" and so it then became much harder for people.\n\n13:19 Brian Gerrish: Wayne, thank you very much for that. At the beginning, you said you were silly, but I don’t think you were silly at all. You were thinking about your family, and you were following guidance. It’s easy for all of us to look back and say we shouldn’t have done something. But at the time you made the decision, you were following what was very clear guidance from the government that people should have vaccines because those vaccines would keep them safe, and would also keep their families and loved ones safe. That was the message.\n\nHindsight enables you to say that of yourself, but I don’t think it’s true at the time because you followed the guidance. Can I just ask, what did you do as a job? You said you decided to stop now.\n\n14:12 Wayne: It was a fairly active role I had. I was a fire safety officer for a food retail company that’s been on the high street for many years. You probably might guess who it might be. So I spent probably two or three hours a day on a computer working on risk assessments, and things like that. For the first four or five hours, I had to accept deliveries at 5 o’clock in the morning: a lot of leg work, a lot of back work, but it was good because you’re fit, active, healthy—and I never found it an issue to complete.\n\nTo try to do a very small amount of that, at the end of last year when I tried to return to work, I was doing four hours a day, and it was very exhausting. I just found it too much. I really couldn’t cope with it. When you’ve got a half-functioning brain, that’s the only way I can describe it, it’s like a faulty hard drive, you just cannot process words quickly enough in those sorts of situations. I need a lot of time to think about what I need to say sometimes. It’s hard to think of things off the cuff.\n\nIt was a hard decision. It was only after physically trying my best to try and do my job that I kind of had to step back. I was under pressure from the company itself for many months. I had really, really tough conversations on the phone with them, and they were just putting a lot of pressure on me all the time: “Why are you off?” — “Well, I’ve told you.”\n\nI suppose I could have gone through some kind of appeal process at some point, but at the end of the day, I’d had enough.\n\n16:18 Brian Gerrish: I’d like to bring Debi in, but just one more question from me, if I may: when you had the vaccine, Wayne, where did you go to have your vaccine? You don’t have to give me the exact location, but I mean, was it one of the vaccination centres, or did you have it done somewhere else?\n\n16:36 Wayne: Yes, it was at my doctor’s local surgery. They have a marquee set up in the car park. So basically, you would drive up to it and a doctor would come over to you because they had a doctor overseeing it. And from there, you’d spend five minutes sitting in the car park waiting for any side effects to appear, so I was told to then just drive off.\n\n17:06 Brian Gerrish: And did you get handed any leaflets or documentation talking about risks?\n\n17:16 Wayne: Yes, so I had the vaccination, then I had this piece of paper put in my hand. Originally, it was very basic in what it told you, and the side effects associated with it. Over the months, I have seen further ones where they’re a bit more detailed. But mine—there was certainly no mention, by the doctor, as to anything to be worried about. Now, they tell you that if you have a continuous headache for more than three or four days, seek medical advice. Well, I was speaking to a doctor every couple of days, and I couldn’t get seen. All I was told was, \"Don’t worry about it, you’re fine, it’s just normal, it’s side effects.\"\n\n18:04 Brian Gerrish: Thank you for that. The key bit for me there is the vaccine came first, and the piece of paper arrived second.\n\n18:17 Wayne: That’s right. But there’s no chance to actually assess for yourself. If they gave you a piece of paper and they said, \"Take a moment to read that, and if you then want to proceed then that’s up to yourself\"—[but instead, it was,] \"You need the vaccine. But here’s a bit of paper to read while you’re waiting.\"\n\n18:33 Debi Evans: Well, Wayne, I’ve got a couple of questions. I’ll make them really short so that you haven’t got to go into anything too detailed. As I understand it, you’ve had one AstraZeneca. Is that correct?\n\n18:53 Debi Evans: I notice on Twitter, Sheffield—yes, indeed, there’s your card with your batch number and stuff on it—I noticed that Sheffield Health and Care Partnership are saying on Twitter, to people who’ve had serious adverse reactions, not to worry about [adverse reactions] and to continue going for vaccinations.\n\nSince the first injection, when you had all these absolutely terrible adverse reactions, has anybody suggested that you should have more?\n\n19:29 Wayne: No. My hospital doctor said, \"You shouldn’t have further ones because this one has done so much damage—put you at risk from various autoimmune diseases in your not-too-distant future.\" My own doctor agreed that it was in my best interest not to have further ones. I have had dozens and dozens of text messages—like many other people have had—saying, \"Don’t forget to get your next booster,\" or whatever. I’ve repeatedly had to go back to the doctor [to ask,] \"Can you please get somebody to stop this? It’s intimidating. it’s just putting the pressure on.\"\n\nI did get an exemption letter in the end, just in case government pressure got a little bit more serious, because it seemed to be going that way last year.\n\n20:28 Debi Evans: And also, Wayne, you’ve had to leave your job, and you’ve got an elderly father as well to look after, and you’re going through the grief of the passing of your mum—has anybody helped you with regards to the Department of Work and Pensions? Are you able to access any benefits in order to help you just sustain yourself a little bit financially for the meantime?\n\n21:00 Wayne: Yes. The interesting thing was, I managed to get the Department of Work and Pensions onto things quite early on through help from my MP. That was fine up until I decided to try and work again, because then it had stopped and started and stopped and started. I had countless letters reminding me of what I needed to do, and I knew myself what I needed to do, but they just kept telling you what to do.\n\nI tried to apply for PIP [welfare] early on in the year because I knew it took a little while, from what somebody else was saying. When I finally got an answer, it was when I had got really ill again. I was being rushed back into hospital. They decided to reject my claim. I didn’t have any points at the time. So I never actually went back to that. All I had was the basic sickness benefit.\n\nJust recently, I’ve had a few negative letters/replies from my pension company, because I’m trying to access my pension pots through ill health. It’s unacceptable. I got to the final stages of accepting the sum of money and sending back the forms, and then they say, \"Well, no, you’re not going to get any money after all.\"\n\nSo we’re going through a few discussions at the moment trying to work out what’s happened, because, if you weren’t going to give me a settlement, why did I get the settlement figure? So I’ve gone back to PIP, through my MP again. I had a lovely phone call from a lady, Alison Worrall, and she rang me and told me exactly what I needed to do. And she’s now put me through in mandatory reconsideration of my original assessment, which probably won’t go anywhere, I don’t expect it to, really.\n\nBut she also suggested me reapplying for a new assessment, which I’m hopefully going to be doing hopefully at some point this weekend, what’s left of it. Yes, I need to do something because I had certain ideas in my mind, and then it all just starts falling apart. Pension companies start to worry that so many people are accessing monies, and they then don’t want to make it easy for people. So, yes, we’ll see.\n\n23:30 Brian Gerrish: So, if I heard that correctly Wayne, your MP has been quite helpful to you?\n\n23:36 Wayne: Yes, [Philip] Hollobone. Yes, very helpful.\n\n23:40 Brian Gerrish: And we have been speaking, again recently, to Sir Christopher Chope MP, who’s been doing some really good work in trying to gather information about people who were reacting from vaccine adverse reactions and [who] are absolutely in the trap, the difficult position you’re in. it would be encouraging if your MP was also speaking to Sir Christopher Chope. I’m not sure whether he is or not. Sorry, is it him or her?\n\n24:12 Wayne: Yes, it’s ‘him’, Philip Hollobone. He said that he’s very supportive of Sir Christopher Chope and his Bill. He’s also put me in touch with—what’s her name? Raine?\n\n24:34 Wayne: Yes. So I finally got a reply from her a few days ago via one of her colleagues after waiting for about four or five months for a reply, I just finally got one. It’s not actually anything, it’s just to say that it’s been acknowledged. So there’s still little things happening. Hollobone obviously he says he’s helping people, and I believe him, but you can’t really see anything to that effect. Hopefully, he’s doing a little bit more behind the scenes, but time will tell on that.\n\n25:07 Brian Gerrish: OK, and presumably—sorry, Debi—I was just going to say, presumably if June Raine had come back to you, the key question is, \"Was a Yellow Card submitted?\" [So], did any of the medical team who’ve interacted with you, did any of those people submit a Yellow Card?\n\n25:29 Wayne: See, that’s the interesting thing, because my doctor said he’d originally submitted one. The hospital also said they were going to submit one. I then had doubts, a month or so after I was discharged from hospital in March, as to whether they’d actually done it. The narrative just seemed to be a bit strange that was coming back from them. So I decided, \"You know what? I’ll just submit one myself.\"\n\nSo I submitted it to them. I submitted one notification to AstraZeneca themselves. I had some dialogue with them for a little while. They were going to refer me to their neurological team in Liverpool. I had some dialogue with them for a little while, and then nothing, absolutely nothing. AstraZeneca stopped talking. They then started saying, \"We want you to fill out another form.\" And I said, \"Well, I’ve just filled one out for you,\" [and they’d reply,] \"Well, we need another one.\" I had a lot of silly e-mails like that.\n\nIn the end, I basically just told them, \"Well, look, I’m fed up with the same information from yourselves, you’re not helping me.\" They were not acknowledging the injury in the first place, so I stopped talking to them.\n\nI did actually start again, recently, just trying a few different avenues to find out if there’s any more information, if there’s any more help from anyone in these companies. And the same sort of replies keep coming back: \"Yeah, well, we’re interested in cases.\" But there’s no real evidence as to them doing much about it.\n\n27:08 Brian Gerrish: Just to be a bit precise, when June Raine communicated with you, was she even acknowledging that a Yellow Card had been received about your case?\n\n27:22 Wayne: No. I actually posted this, on a tweet: my message and that reply. Basically, it was acknowledging me, but it was also saying, \"If you haven’t reported it to the Yellow Card system yet, we recommend that you do so.\" So they hadn’t actually read my e-mail; they just basically sent out a standard reply to somebody. It’s quite a lengthy reply, but they didn’t actually say anything. It just said, \"For new cases, you should be doing this, you should be doing that\"—and not, \"Oh, we’re sorry to hear of your injury,\" or whatever. Yes, quite bulk standard really.\n\n28:13 Brian Gerrish: The other question that comes to mind is, have you been able to speak to any other people who’ve experienced similar problems, or indeed any other adverse effects, not necessarily the same as yours, but anybody else you could speak to who’s suffering?\n\n28:33 Wayne: Well, last year, quite early on, I was at a loss. I was cut adrift from my doctors, my work, and I discovered somebody through social media. There’s a group called Clubhouse, and it’s very much like a social media app where you get to talk to people, but you can have medical doctors, specialists, all just talking together discussing problems. Through that, I met some really good people who set up another group called No More Silence. There was another one called Real Not Rare.\n\nBasically, through those I’ve given my story and talked to a lot of people who’ve had similar issues. And I also then tried Ivermectin in August/September time, and found a very good benefit from a lot of the symptoms I was suffering, like brain fog. And for probably a period of about a month or so, I felt like I was really getting somewhere, really improving.\n\nBut over time, my condition then worsened again. It’s the spike protein that continually causes the problems in the body, and it’s self-replicating, so if you then take something to treat that, it’s brilliant, for a short period of time, but then the spike protein carries on building in the body again. I’ve tried something again recently, but it didn’t work as well this time, because I feel the condition is getting worse in my body, which is then finding it harder to be treated.\n\nSo all I can do is alleviate that with the pain relief that I take, and the Sumatriptan for the migraines, and just do what I can do on a daily basis. The worst days, I don’t do very much at all; probably just sit in the garden looking at the birds. And on a better day, I might then go for a walk or something else. It’s not the life I imagined myself leading, but you know, I can’t look back, I’ve just got to keep looking forward.\n\n31:20 Brian Gerrish: I’ve found it incredible that we’ve got people now coming into contact with the UK Column to tell us about their experiences, and we spoke to two ladies the other day. We did a recording with them, Charlet and Caroline, and they have both suffered pretty severe effects, which have completely stopped them living a normal life. They clearly found that the most difficult thing was, well, two things:\n\n- they spoke about the fact that when they tried to speak to other people to explain what they knew was different—you know, \"I do not feel well\"—that when they tried to explain this to other people, it was almost as if other people didn’t believe them;\n\n- and they said, \"And then you suddenly find yourself in a realm where you don’t know where to go for help.\"\n\nNow, you clearly have been able to at least get into the NHS system. It hasn’t produced help for you, but there was some engagement, and also your MP engaged, which was a positive thing.\n\nWhat we understand from the now-gathering number of people that are talking to Caroline and Charlet is that many people haven’t even had that engagement from their GP, nor have they had it from other NHS sources or from MPs. And so they’re saying that, in addition to the physical effects they’re suffering, they feel very isolated.\n\n33:17 Wayne: Well, you do. You don’t know where to turn. I mean, I felt so lost and down that through sheer desperation, by the end of the year, I’d taken this Ivermectin as a last ditch effort to try something different. And for me, it really helped. And it was only because a number of other people I’ve been talking to on the self-help groups on social media, they’d tried it for severe seizures and shakes that they had, and found it to be really beneficial. So I thought, \"Right, what have I got to lose? I’ve got to try something.\"\n\nI have been aware of those two ladies myself. At some point or other, all our paths have crossed on different platforms, because I was seeking help all the time—because not one thing that will work for you will work for somebody else. It might help a little; it doesn’t fully solve the problems: the neurological issues, the headaches, the strange dreams, the rapid heart rates. We all then have to try something else: that’s then your herbal teas, your herbal baths then just to calm your heart rate enough just so you can think about sleeping.\n\nIt’s all about just trying to talk to somebody, and by sharing your story on Twitter or other social media as I did, I came across so many people. I probably had just a few hundred people that I connected with before all this happened. And then shortly afterwards—March time—once I started sharing my story to people, then I had, like, seven and a half thousand people [following me by the time of being suspended].\n\nThese were people that were helping me, and also I was helping them, because people were contacting me for help at the same time: \"Have you any ideas of what I can do, because I had a vaccine to go on holiday?\"—a twenty-something-year-old guy, and then he was basically left in the similar situation as myself; very upset, very down; didn’t know what to do.\n\nAll you can do at that stage is give some ideas, what things you can do quite easily. And I think he did get some help in the end, but then there’s so many people you can keep in touch with everyone. I lost all of that when I was suspended from the site—purely for saying that I’d taken some Ivermectin.\n\n36:02 Brian Gerrish: Wayne. I picked up from what you’ve said to us so far that you’ve clearly been researching. I think this must be quite a difficult thing to do, because you’re delving into something which isn’t currently—it’s going to be stressful, isn’t it? Because you’re researching your own problem…\n\n36:29 Wayne: Doctors only give you ideas of what might be going on with you. They don’t really know. They can suggest things. And the drugs that I was on last year, whether I needed to be on all of them, who knows? They [doctors] don’t know themselves; they can only suggest it. And at the time, it seemed to help. What you then had to do is actually do is find something that calms you enough, and relaxes you enough, to then look at everything else in a better way. I now find, if I get stressed, herbal tea will help me just take that edge off.\n\nI used to be on Diazepam and Bisoprolol and beta blockers last year because my health was so erratic. I had ten different medications at one stage. Some of those were fighting against me, causing me brain inflammation—to make it even worse—which they didn’t know. It’s just that your body is in such a mess after having these vaccines that they don’t know half the side effects that then come out. And certainly, when it starts to happen to many many more people, then they suddenly realise there’s a connection.\n\n37:49 Brian Gerrish: And, Wayne, have you been able to actually look at the full Yellow Card data? Because the UK Column did work, Mike Robinson and a couple of other people did work, to make that Yellow Card database visible and fully searchable. But it is incredible that the MHRA itself has got well over one and a half million adverse reactions logged, and over two thousand people have died, and yet there’s no visible proactive—that’s a word I don’t like, for all sorts of reasons, but there’s no visible proactive investigation into what has gone on.\n\nYou would think we’d already be into a major public inquiry to say, \"We’ve recorded all these adverse reactions.\" The first question is a reasonable one: we need to first establish which of these adverse reactions are actually caused by the vaccine. But then we need to say, \"All these people have suffered these life-changing effects, what are we going to do about it?\"\n\nOne of the things that Debi’s picked up on is that with other medications, where there’s been a problem affecting relatively few people compared to these vaccine statistics, they’ve actually stopped giving people the particular drug. But in this case, it’s as though they’re ignoring the reality of the adverse reactions. Do you agree with that, Debi? How do you see it?\n\n39:38 Debi Evans: Yes, I absolutely do. And if we go back to the letter that I received from the Royal College of General Practitioners, clearly, the Honourable Secretary said then that GPs are not aware of the serious adverse reactions; they’re not aware of what to look for. So obviously, when they’re seeing all of these symptoms that they’ve never seen clustered before, they don’t know what it is, so they don’t know how to treat it.\n\nSo if they’re not told about a serious adverse reaction, and if they’re not of the ingredients of the vaccine, then how can they know how to treat people like Wayne when they exhibit these serious adverse reactions?\n\nMy big comment on all of this is: we’re hearing about all the physical symptoms that Wayne and others are going through, but how does this affect your mental health and your anxiety levels and the way your life has been changed, when all you’ve done is trusted what you’ve been told and you’ve followed the advice, and you’ve done what the experts told you to do? I mean, this must be having a huge impact on your mental health.\n\n40:48 Wayne: That’s right, it does. You find it hard to keep things together. How I’ve managed to get to this stage that I’m at at the moment, I don’t know, but it’s quite a miracle. You still have your ups and downs, everybody does.\n\nBack at the start of last year, they were aware of the Yellow Card syste,m because they quoted it to me in March [at the time of hospital admission] as then going to report it. So they know it exists. If they really wanted to, they could have been more aware of it over the weeks and months as the cases then started to happen.\n\nI knew another guy who was in the Kettering General [Hospital] the week before me. He’d been in there a few weeks because he’d lost full use of his body through his vaccine. And I was told by the nurse, who was treating me, that they were administering his case. So they do happen; they see it happen. But at some point or other, somebody is there saying, \"But we don’t really want too many people knowing about this.\" Whereas if cases were shared early on, people would have been much more aware of the associated risks, wouldn’t they?\n\n42:16 Debi Evans: Wayne, if June Raine was watching this, and if June Raine is watching this, what would be your message to the MHRA and June Raine, do you think? Sorry to put you on the spot, and if you can’t think of an answer, don’t worry. It was just an idea. What would you say to her?\n\n42:33 Wayne: Well, off the top of my head, I struggle, to try to pull words together off the cuff. I need time to think about things.\n\nPeople have been injured through a lack of coordination and thoughts in how things would be affecting others. They certainly need to accept that these have happened. And, going forward, they need to put their hand up and say, \"Look, yes, mistakes were made.\" And they need to do something about it, don’t they?\n\n43:11 Wayne: It’s late, but better late than never.\n\n43:14 Brian Gerrish: Yes. That, for me, really spells it out. I cannot understand how there can be so much data, which has been officially collected, it’s not even as if this is data that some other organisation has put put together. This is the data that the [British] pharmacovigilance organisation, the MHRA, [has compiled]; the organisation which says it has a responsibility to ensure that dispense drugs, medicines and vaccines are safe. They then collect data, which to anybody with reasonable intelligence, would suggest that there are problems, and then it’s as if that data does not exist.\n\nIt’s as if June Raine and Alison Cave, the [chief] safety officer at the MHRA, cannot even see their own data. Because what she’s talking about—and Debi is absolutely on the case with this—is, every time we’re looking at an MHRA board meeting (we're watching and listening), what are they talking about? They’re talking about moving forward to even better relations with the pharmaceutical companies.\n\n44:37 Wayne: Whereas it should be a better relationship with the patients.\n\n44:41 Wayne: You shouldn’t be looking at the finances coming in, you know. It’s like when you work in the retail sector, you should be looking at the customer. That’s what it all comes down to. But they’re not; they’re looking at the provider—making as much money for them as possible by keeping as quiet as much as they can about the risks.\n\n45:07 Brian Gerrish: Yes, and you work in a very specific professional risk area, which is fire risk and fire safety. If, in a particular business across the UK, we had fires breaking out, somebody would be saying, \"Well, hang on a minute; this seems to be following a common pattern.\" You know, is it a particular piece of machinery? Or is there arson at work? You would follow that risk through.\n\nBut the other thing which we know for a fact is that the MHRA has not carried out any quantitative risk assessment into its own Yellow Card data. And I find this—I think \"mind-boggling\" is the word.\n\n46:00 Wayne: Well, it’s over a year now, isn’t it? I mean, you guys were putting your information out quite early on. I remember sharing that same information. I must have connected with you, because I connected with so many people. I can’t remember half of those people now, because my brain just doesn’t function that well, but the data has been going around for over a year. The information has been there, but nobody wants to acknowledge it. It’s like, \"Well, we’ve got to keep quiet, we’ve got to keep that to the side because the shareholder won’t be happy,\" or whatever. That’s what the emphasis has been on, hasn’t it?\n\n46:36: Brian Gerrish: Yes, I would say so. And I think you’ve hit the nail on the head there, because as far as the MHRA concerned, it’s the shareholder which is important, the pharmaceutical shareholder, it’s not the man or woman in the street who’s been subjected to the vaccination.\n\nWayne, I’m going to say thank you. I suggest we stop there, because it’s a good place to stop. And I would very much hope that you’ll be prepared to speak to us again.\n\n47:07 Brian Gerrish: Thank you. Particularly, when we’ve had the opportunity to speak to more people, because it’s like we’ve— how do we describe it, Debi? It’s like suddenly—is it a flood? Well, not quite yet. But there’s a lot of people now wanting to speak, and wanting to speak to us, about what’s happened to them.\n\nAnd I like to think that we can do our part to help some of these groups, such as the ones that you’ve mentioned, where people are trying to come together to help themselves. If we can give that a bigger media boost, I think we’ll all start working together.\n\n47:53 Wayne: Definitely. It’s been gathering momentum over the last few months, and there are a certain few people on social media at the moment who really seem to be helping to drive that. And anything that you guys can do as well—it can only be a good thing, can’t it?\n\n48:13 Debi Evans: We won’t give up, Wayne. We won’t give up.\n\n48:15 Wayne: That’s good. Thank you very much.\n\n48:16 Brian Gerrish: No, I don’t think we’re really going to give up. The more we learn, the more we are motivated on this one to actually hold people to account, because this is what it’s about. This is about real lives. It’s not some economic thing, where you can say, \"Oh dear, it’s a bit of a shame. Let’s move on.\" This is serious stuff. So certainly, we feel commitment on it.\n\nAnd let’s just end on the note that it has been encouraging that, for the first time, we’ve actually got MPs that seem to be showing an interest and are starting to do some work as a group. So we need to encourage those MPs as much as we can, because I’m sure they’re going to be up against some pretty tough backlash, which is along the lines of \"Don’t rock the boat.\"", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/vaccine-damage-real-people-wayne", "title": "Vaccine Damage—Real People: Wayne", "description": "In an upsetting testimony, UK Column interviews Wayne about his adverse reactions to Covid vaccination.", "image": "https://www.ukcolumn.org/sites/default/files/2022-07/Wayne%20Thumb.001.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/alex-mitchell-and-his-fight-for-vaccine-induced-thrombocytopenia-sufferers", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://twitter.com/SheffieldHCP/status/1536045673488990209", "https://www.ukcolumn.org/video/transcript-sir-christopher-chope-mp-on-vaccine-adverse-reactions-and-the-need-for", "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/article/when-is-enough-enough-do-no-harm"], "authors": [], "publish_date": "2022-07-29T16:33:13+01:00"}