{"result_id": "323030", "URL": "https://www.ukcolumn.org/video/fatal-outcome-vaccine-damage-real-people", "timestamp": "2023-04-25 17:46:35 CEST+0200", "meta": {"description": "Alex Kelly’s emotional and raw account of the fateful day when she returned home from work to find her 71-year-old mother, retired nurse Anthea, dead on the floor—four days after having her first AstraZeneca Covid–19 injection.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/fatal-outcome-vaccine-damage-real-people", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Fatal Outcome (Vaccine Damage—Real People)", "cleaned_text": "Alex Kelly returned home from work on 28 January 2021 to find her 71-year-old mother Anthea, a retired nurse let down by her own NHS like many others, dead on the floor—four days after having her first AstraZeneca Covid-19 injection. Alex describes how, in blind panic, she phoned for an ambulance whilst trying to resuscitate her beloved mum, to no avail.\n\nSince the interim death certificate stated the cause of death as ‘pneumonitis induced by AstraZeneca injection’, the coroner was instructed to carry out a formal inquest. Alex tells us of her disbelief and anger at being told six months later, in June 2021, that an inquest was not to be held after all.\n\nAre coroner’s inquests simply failing to be held because of increasing demand, or is there something more sinister at play? Alex recounts her journey and how she turned to UK CV Family for advice and support. Their encouragement has now led to her setting up a sister group for the bereaved: for those that have lost loved ones to a fatal Covid–19 vaccine adverse reaction.\n\nDetermined to get justice for their mum, and still in shock, Alex and her younger brother James decided to take advice from an experienced medical solicitor, Peter Todd (website | e-mail: [email protected] | Twitter), who gave them much peace of mind with his challenge to the coroner’s decision.\n\nAs if things could not get any worse, in December 2021 Alex’s beloved brother James aged became very sick and breathless. He was admitted to hospital with Covid–19, where his condition deteriorated further, and he was transferred to the Intensive Care Unit with mechanical ventilation.\n\nWe hear how Alex—after being told that there was no more that could be done to save her brother’s life, and despite begging to stay in the hospital to be with him when he passed—was ordered by staff to return home. James died alone that very night, at 3 am. The last text message Alex received from her brother reads:\n\nAlex continues to fight for justice for her mother, as well as gradually being able to grieve for both her mother and her brother. Determined to alert others to the peril her family has faced, Alex plucks up her courage to speak exclusively to UK Column and urges others to seek help and advice if they tragically find themselves in a similar situation.\n\nDuring our interview, Alex is joined by Lily, her late mother’s elderly dog, who sat with her and remained with her when she died. It’s not just humans whose lives change in a split second.\n\nMention is made at the end of this interview of the Truth Be Told campaign and of CoviLeaks (website | Twitter).\n\nIf you are struggling and need advice or support, please get in touch with UK CV Family.\n\nThe Anthea Kelly Memorial Fund for Covid–19 Vaccine Injured and Bereaved is here.\n\nThis interview was recorded in memory of Anthea and James.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/fatal-outcome-vaccine-damage-real-people", "title": "Fatal Outcome (Vaccine Damage—Real People)", "description": "Alex Kelly’s emotional and raw account of the fateful day when she returned home from work to find her 71-year-old mother, retired nurse Anthea, dead on the floor—four days after having her first AstraZeneca Covid–19 injection.", "image": "https://www.ukcolumn.org/sites/default/files/2023-01/Alex%20Kelly.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/video/nhs-betrays-its-own-nurse-abandoned-in-soiled-bed", "https://www.ukcolumn.org/video/there-are-no-plans-for-an-inquiry-solely-on-vaccine-safety", "https://www.scomo.com/our-people/peter-todd.html", "/cdn-cgi/l/email-protection", "https://twitter.com/petertodd", "https://fund.freewick.com/campaign/3/truth-be-told", "https://covileaks.co.uk/", "https://twitter.com/covileakscvvam", "https://www.ukcvfamily.org/", "https://www.patreon.com/user?u=87994238"], "authors": [], "publish_date": "2023-01-12T15:54:07+00:00"}