{"result_id": "323034", "URL": "https://www.ukcolumn.org/article/covid%E2%80%9319-big-pharma-players-behind-uk-government-lockdown", "timestamp": "2023-04-25 17:46:37 CEST+0200", "meta": {"description": "Is the private sector now going to be spying on the workforce? Vanessa Beeley examines the revolving-door policy between philanthrocapitalism, Big Pharma and government agencies, all effectively working in lock-step to promote the global immunisation agenda.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/covid%E2%80%9319-big-pharma-players-behind-uk-government-lockdown", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "COVID–19: The Big Pharma players behind UK Government lockdown", "cleaned_text": "\"To achieve world government, it is necessary to remove from the minds of men their individualism, loyalty to family tradition, national patriotism, and religious dogmas.\"\n\n — Dr George Brock Chisholm, who served as the first Director-General of the World Health Organisation (WHO) from 1948 to 1953\n\nIn Part One of Who controls the British Government response to Covid–19?, I began an investigation into the individuals and entities that are, effectively, driving the UK Government response to Covid–19. In Part Two, I will expand upon the Big Pharma and Artificial Intelligence (AI) links already identified and will introduce new connections that appear to have considerable bearing upon the UK Government's Covid–19 strategy. I will expand upon the Bill Gates connections to the various organisations that are advocating global immunisation.\n\nThe UK Government chief medical adviser and Chief Medical Officer for England, Chris Whitty, is saying that a return to “normal” in the short-term is “wholly unrealistic”. Whitty is telling us that the “highly disruptive” social distancing policy will be in place “for really quite a long period of time”. “Highly disruptive” is a euphemism for the devastation of the world economy and the horrifying knock-on effect — an estimated 50% of the world workforce are at risk of losing their livelihood.\n\nThe UK Government has been promoting the concept of “immunity passports” as a means of loosening the draconian lockdown measures. It is very possible that facial recognition technology may dictate who can exit lockdown and return to work. To get a passport, individuals must upload an image of their face to the app along with their ID (passport or driving licence). They are then tested to ascertain if they have had the virus and developed immunity. The app will then generate a QR code, which the employer will use to verify ID and immunity before allowing the employee back to work.\n\nOnfido’s track and trace app, under serious consideration by the UK Government.\n\nThe UK health service’s innovation agency NHSx has called for businesses and technology experts to submit their ideas for providing immunity passports. Companies currently making proposals to the UK Government include Onfido, Yoti, IDnow, OCL, and iDenfy.\n\nThese UK Government “track and trace” plans still face various obstacles — including the questionable accuracy of some of the antibody tests — but the spectre of increased surveillance and government control over the workforce, and many other aspects of civil liberty, looms undeniably on the horizon.\n\nAs I pointed out in Part One, it is no coincidence that the Oxford University start-up, Microsoft-funded facial recognition firm Onfido “has recently raised $100 million (now $200m) to boost its ID technology” to enable the creation of immunity passports. According to an interview with Onfido’s CEO, Husayn Kassai, the firm had previously offered a service that “automates background checks on prospective employees before they are accepted for work”; it would appear that immunity passports are a logical extension to what is, effectively, private sector spying on the workforce.\n\nA more recent article proclaims: “Onfido in talks with government about systems to help Britons return to work”. Onfido, already at “pilot stage” in other countries, is claiming that its proposals could be executed within months and that the “health certificate through app technology” is “gaining traction”. Onfido claims this technology could be the linchpin of the new “normality” and key to stimulating the economy — as backed by Bill Gates/Microsoft and undeniably in lock-step with ID2020’s manifesto.\n\nMany analysts have highlighted the danger of ID2020 being introduced under cover of the Covid–19 “crisis”:\n\nThe team behind the UK Government Covid–19 response\n\nMy focus in Part One was largely on the role of Imperial College and Prof. Neil Ferguson in “modelling” the virus infection trajectory and influencing the UK Government response, as he has done previously, with a 100% failure rate on the accuracy of his virtual predictions. My focus in Part Two is to put the spotlight on other members of the UK Government advisory committee and to reveal their connections to Big Pharma and the for-profit sector linked to the Covid–19 response.\n\nNeil Ferguson defends lockdown policy while conveniently forgetting the failure record of his “model”\n\nIn a recent interview, Neil Ferguson defended his Covid–19 predictions, which now appear to have been greatly exaggerated.\n\nFerguson reinforced the message that Britons “cannot go completely back to normal, until we have a vaccine there will be a degree of social distancing in place” (emphasis added).\n\nFerguson also confirmed the UK Government's track-and-trace policy: “Longer-term social distancing will be required, not at the levels we have today, if we have contact tracing in place” (emphasis added).\n\nWith numbers not adding up to Ferguson’s alarmist projections, the subsequent lockdown of the economy, and now the UK Government's potential roll-out of mandatory vaccinations and biometric surveillance of the workforce, we could be forgiven for suspecting that the overarching agenda was always the increased surveillance and control of the majority of the population.\n\nAt this point, I would like to go back in time to 2009 and Ferguson/Imperial College’s analysis of swine flu, H1N1: they claimed this virus would take the lives of 65,000 people in the UK. In the end, 457 people died from the virus.\n\nIn response to the threat of swine flu, Big Pharma giant GlaxoSmithKline (GSK) developed the Pandemrix vaccine, with disastrous consequences. An alleged sixty patients who suffered brain damage as a result of the vaccine were allocated £60 million in compensation by the UK Government. Most of the victims were children. As one report has it: “It was subsequently revealed that the vaccine, Pandemrix, can cause narcolepsy and cataplexy in about one in 16,000 people, and many more are expected to come forward with the symptoms.”\n\nA later British Medical Journal (BMJ) report deemed that GSK and health authorities had failed to warn the public of the vaccine’s alarming “safety signal”.\n\nThe vaccine was developed by GSK and patented in September 2006. Pandemrix contained a flu strain recommended by the WHO. After reports of brain damage began to emerge, the WHO revised their advice to urge “restricted use” for people under the age of 20. Pandemrix is no longer licensed for use, but at the time, the Gordon Brown-led Labour government had granted GSK indemnity. Details of that agreement have never been made public.\n\nFrom 2012 to March 2018, Sir Patrick Vallance was president of research and development at GSK. He went directly from GSK to his post as the UK Government chief scientific adviser.\n\nWhile Vallance and the UK Government are favouring AstraZeneca — in partnership with Oxford University — to fast-track vaccine development, GSK is also in the race.\n\nGSK is working in collaboration with the Coalition for Epidemic Preparedness Innovations (CEPI), “aimed at helping the global effort to develop a vaccine” for Covid–19. The UK Government has invested £50 million in CEPI to support the rapid vaccine and immunoprophylactic development against “unknown pathogens” (also referred to as Disease X). Bill Gates was one of the original and most influential sponsors of CEPI; more details later in this article.\n\nSo, the UK Government appears to favour AstraZeneca, but Vallance and the government also appear to be subtly supporting Vallance’s former employer, GSK, despite their Pandemrix fiasco.\n\nWhile Vallance was in charge of research and development at GSK, collaboration with the Bill and Melinda Gates foundation was increased. In 2013, a new partnership between GSK and the Gates Foundation was announced: to “accelerate research into vaccines for global health needs”.\n\nWhat we start to see here is the very definition of a revolving-door policy between philanthrocapitalism, Big Pharma and government agencies, all effectively working in lock-step to promote the global immunisation agenda, with massive projected profit for the Big Pharma complex and in particular for the members closely associated with Gates, the WHO, UNICEF, and world governments, as already discussed in Part One.\n\nScientists, epidemiologists and analysts are not speaking as one voice on Covid–19\n\nGoing back to the Ferguson interview I mentioned earlier, my observation is that Ferguson was ill at ease, appearing to defend a script rather than opening up the discussion to include other models and expert opinions that vehemently disagree with his assessment.\n\nEminent epidemiologist and bio-statistician Prof. Knut Wittkowski has been an outspoken critic of lockdown and social distancing from the outset. In a recent interview, Perspectives on the Pandemic, he spoke about the Ferguson model:\n\nEven Dr Anthony Fauci, Ferguson’s counterpart in the US, has also cast doubt on the efficacy of these models to determine government response to any given virus:\n\nThe fact that Ferguson ploughs on regardless — and without any reference to his appalling record and disastrous consequences for the British public — suggests that he functions largely as an outreach agent for actors with vested interests who are exploiting him to keep the Government on track with their own profit-driven Covid–19 campaigns.\n\nThe Big Pharma monopoly dictating the “new normal” in global healthcare\n\nWho are CEPI? CEPI is the Coalition for Epidemic Preparedness Innovations. CEPI was launched at Davos in 2017 by the governments of Norway and India, the Bill & Melinda Gates Foundation, the British-based Wellcome Trust global health “charity”, and the World Economic Forum. CEPI is described as an “innovative partnership between public, private, philanthropic and civil organisations”, to which I would add governments: the coalition has received investment from the governments of Germany, Japan, Australia, the UK, Belgium and Canada. Their primary role in relation to Covid–19 is the “development of platforms that can be used for rapid vaccine development against unknown pathogens” (2018).\n\nHistorian and author Prof. Michel Chossudovsky is convinced that CEPI is “seeking a monopoly role in the vaccination business, the objective of which is a global vaccine project”. As I have previously reported, CEPI is key to the success of the Gates “vaccine decade” project, which reaches its conclusion in 2020 — coinciding with the outbreak of Covid–19. CEPI brings together the main players in biotechnology, Big Pharma and associated global health charities, governmental agencies, and university R&D to drive us towards global immunisation.\n\nCEPI’s euphemistically named “wider community” is represented by five non-voting members or observers; these include the World Bank, which is the principal financial institution holding CEPI funds, and a representative from the WHO. Every governing body or complex that is promoting global immunisation registers the same entities as influencers and sponsors. Again and again, the conflict of interest question must be raised in relation to the Covid–19 response.\n\nJust as Sir Patrick Vallance was linked to GSK, so Chris Whitty, the UK Government's Chief Medical Advisor, was on the interim board of CEPI until the permanent board was announced in 2018. Should we be surprised that the UK Government has invested £50 million in CEPI while being advised by Whitty?\n\nWhitty with Matt Hancock. “The expert we need in the coronavirus crisis.”\n\nWhitty also received Gates funding in 2008: $40m for malaria research in Africa. The fact that Whitty was involved in the kick-start of CEPI, Gates' immunisation monopoly project, should therefore not come as a huge surprise.\n\nFerguson’s model was generated under the auspices of the Vaccine Modelling Impact Consortium, hosted by Imperial College — both effectively funded by Bill Gates and Britain's Wellcome Trust (primarily).\n\nIn December 2018, CEPI went into partnership with Imperial College, London. CEPI provided funding of US$8.4 million for Imperial College to work on a vaccine platform that can be used to “rapidly develop vaccines against pathogens — even unknown ones”. The platform was appropriately named RapidVac and was focused on producing vaccines for H1N1, rabies and Marburg virus as “proof of concept”. The next step would be to develop vaccines rapidly in responses to “new and unknown pathogens, known as ‘Disease X’”. So, one year before the Covid–19 outbreak, Imperial College was working on a vaccine for “Disease X”.\n\nAn Imperial College statement claimed that the partnership of CEPI and IC aimed to develop vaccines “against new and unknown pathogens within 16 weeks from identification of antigen to product release for trials” (emphasis added). This is an extraordinary claim, when vaccines have a typical R&D gestation period of up to fifteen years before being safely approved for public consumption. In addition, we must also always consider that there is a very strong argument against the use of vaccines altogether; perhaps a subject for another article.\n\nThe genome sequence of Covid–19 was published online in mid-January and researchers reportedly sprang into action. The global quest for a vaccine excompasses some ten to fifteen serious programmes. CEPI is reportedly funding six of these programmes: CureVac, Inovio Pharmaceuticals, Moderna, and the Universities of Oxford, Imperial College and Queensland in Australia. We can also now add GSK to the list of participants partnered with the UK Government-assisted CEPI.\n\nIn Part One, I discussed GAVI, the self-proclaimed vaccine alliance. GAVI was established twenty years ago and incorporates the members of the Gates Foundation “Global Health Leaders Launch Decade of Vaccines Collaboration” consortium: those include, once again, the WHO, the World Bank, UNICEF and governments. The UK Government is GAVI’s top sponsor. In turn, GAVI sponsors the VIMC, where Ferguson models his response to Covid–19 — hosted by Imperial College.\n\nIn December 2018, the same month that CEPI went into partnership with Imperial College, the board of GAVI approved a proposal for the Kingdom of Norway to support CEPI through a bond scheme backed by a new Norwegian “pledge to the International Finance Facility for Immunisation” (IFFIm).\n\nUtilising the bond scheme, Norway funded CEPI to the sum of US$58.1 million. Gates-funded, Gates-established GAVI was the broker for this sponsorship deal, which funnelled money to the Gates-funded, Gates-established CEPI. Other sponsors are clearly involved, but I am just making the point of the revolving-door policy in relation to these consortiums that bring together private, public and global health sectors to further vaccine promotion globally. As Gavi’s website proudly states, the alliance now vaccinates almost half of the world’s children.\n\nThe UK Government blurring the lines between private and public sector when it comes to vaccines\n\nThe UK Government not only funds Gates-generated projects indirectly through CEPI and GAVI; there is also a direct collaboration that is off the radar of most reporting on the government’s response to Covid–19. If you enter the search term “Bill Gates” as an implementing partner into the UKAID development tracker, a number of vaccine-related projects are revealed.\n\nThis week, the Prime Minister, Boris Johnson, co-hosted the virtual Coronavirus Global Response International Pledging Conference — to “drive forward the global race for coronavirus vaccines, treatments and tests” (emphasis added).\n\nAccording to information published, the UK has already provided £744 million of UKAID for the global response to Covid–19. That includes £388 million in support for new vaccines, tests and treatments. The UK has pledged £250 million to CEPI (the biggest contribution of any country).\n\n£40 million has gone to support rapid development of Covid–19 treatments; £23 million to develop rapid tests for the virus; and £75 million to the WHO critical health systems response. The UK has also pledged the equivalent of £330 million per year for five years to GAVI, the self-proclaimed vaccine alliance.\n\nThe UK Government is effectively focusing on the market sector it has most heavily invested in — global immunisation — at a time when the British domestic economy is being forced to its knees by the government response to Covid–19.\n\nPerhaps at this stage, one might still argue that the UK Government has the welfare of its citizens at the forefront of its agenda; but delving a little deeper makes it much harder to draw that conclusion.\n\nNot only was Chris Whitty previously sponsored by Bill Gates and on the interim board of CEPI; he now chairs the UK Vaccine Network (UK VN). The UK VN brings together “industry, academia and relevant funding bodies to make targeted investments in specific vaccines and vaccine technology for infectious diseases with the potential to cause an epidemic”.\n\nThe UK Vaccine Network provides funding for vaccine development programmes. Projects supported by the DHSC through the UK Vaccine Network are listed here.\n\nUnder Chris Whitty’s administration — Whitty is co-lead for the National Institute for Health Research (NIHR) — the NIHR and UK Research and Innovation are giving another £20 million to CEPI for Covid–19 vaccine development. This is in addition to the £50 million already given by the UK Government to CEPI.\n\nThe timing of Boris Johnson’s “humanity versus virus” conference is unlikely to be coincidental, following as it does hot on the heels of World Immunisation Week.\n\nA document produced by Public Health England (PHE) provides a greater insight into how hard the UK Government is promoting vaccines during the Covid–19 “crisis”. The 2020 theme is “Vaccines work for all” — coinciding with the last year of the Gates “vaccine decade” of the 2010s.\n\nHashtags like #CarryOnVaccinating are being deployed, and the “vaccines work for all” campaign will focus on “how vaccines — and the people who develop, deliver and receive them — are heroes by working to protect the health of everyone, everywhere”.\n\nThe WHO has designated 2020 the International Year of the Nurse and the Midwife. Why? Because of those professions' “crucial role as early vaccine champions for new parents and parents-to-be and life course vaccination, making sure older adults have their routine protection”. What a clever way to harness the genuinely dedicated nursing staff to promote vaccines to a huge market sector.\n\nThe outsourcing of vaccine promotion continues. There are social media memes prepared earlier that can be uploaded and shared to Facebook, Instagram and Twitter by an unsuspecting public, who will thus advertise global immunity for free.\n\nThe language of the report is sinister in its behavioural nudging: “Last year, WHO declared vaccine hesitancy among the top ten threats to global health”. A civilian population in lockdown — desperate to stimulate the economy, to return to work and to avoid being infected with “Pandemic 1” — will be easily gaslighted by such a lexicon into accepting anything that will address the concerns that have been imprinted into their subconscious.\n\nThe document details the need to “counter the infodemic”, i.e. expert opinion that does not comply with the Big Pharma/WHO diktats:\n\nWe are, of course, already seeing this infodemic warfare in action: the YouTube CEO recently announced that YouTube would remove any video deemed to be in contravention of advice being given by the WHO. A recent statement from the Secretary-General of the UN, Antonio Guterres, reinforces the WHO recommendations. Guterres condemns what he claims to be “a dangerous epidemic of misinformation”. Journalist and researcher Michael Swifte described the vaccine agenda as follows:\n\nReading through this PHE document is a veritable exercise in Behavioural Insights methodology: again, no coincidence, when one considers British expertise in “nudging” the public towards any given pre-determined agendas or decisions that benefit the ruling classes. This excellent article at UK Column provides a comprehensive analysis of the role played in the Covid–19 response by Behavioural Insights.\n\nPublic Health England — who are they, and how are they linked to Porton Biopharma?\n\nAccording to one report, PHE exists to “protect and improve the nation’s health and wellbeing, and reduce health inequalities”. PHE is an “operationally autonomous executive agency, sponsored by the Department for Health and Social Care (DHSC)\".\n\nIn June 2018, PHE transferred its drug development to a new state-owned company, Porton Biopharma Ltd (PBL), which is wholly owned by Her Majesty's Secretary of State for Health (currently Matt Hancock). Perhaps unsurprisingly, PBL has the only UK-licensed anthrax vaccine among its portfolio. We are told that “the future success and revenue growth of PBL will provide PHE with an income dividend which will be ploughed back into the delivery of its priorities”. Once again, we see the revolving door between government agencies and private, for-profit sectors with a focus on vaccines.\n\nThe Secretary of State for Health and Social Care, Matt Hancock, is also owner of Porton Biopharma during his tenure; but that is not the only tie that Hancock appears to have to for-profit entities that stand to benefit from Covid–19 response strategies.\n\nA recent report in the Byline Times detailed “highly controversial contracts” which will enable British ministers and senior health officials to “mine confidential data from tens of thousands of Covid–19 hospital patients”. These contracts have allegedly been awarded to technology companies “without being put out to competitive tender, NHS has disclosed”. Microsoft is included in those companies; that is, Bill Gates is present.\n\nBabylon Health — the NHS is not for sale (!)\n\nBoth Hancock and Dominic Cummings, chief adviser to the Prime Minister, have questionable ties to Babylon Health, a prominent health tech firm implementing AI. Cummings held an undisclosed consultancy job at this healthcare venture: a firm endorsed by the government and at the top of the list to receive a National Health Service (NHS) Fund cash injection of £250 million.\n\nAccording to an article in The Bureau Investigates, during 2018, Cummings “advised Babylon Health on its communications strategy and senior recruitment just months before its GP at Hand app was publicly backed by Matt Hancock.”\n\nJonathan Ashworth, the shadow health secretary (British opposition spokesman on health), condemned the Cummings/Hancock connection to Babylon:\n\nIn case anyone is in doubt over Hancock’s enthusiasm for the Babylon GP at Hand app, it is highly advisable to read this article published at the British Medical Journal (BMJ), written by Rachel Clark, a doctor specialising in palliative medicine:\n\nAnd, last week he featured in a double-page, Babylon-sponsored puff piece in the Evening Standard entitled “Technology can be a great fixer for the NHS.” Its centrepiece was an interview proclaiming Hancock’s ringing endorsement of Babylon: he declared GP at Hand to be “a force for good within the NHS”.\n\nAlthough this detail may appear to be an excursus away from the involvement of the UK Government Covid–19 health advisory board in the promotion of global vaccine programmes, it serves as a further demonstration of the blurring of lines between commercial interests and the welfare of citizens.\n\nThis relationship is highlighted in legendary journalist John Pilger’s latest documentary The Dirty War on the NHS, a film I cannot recommend highly enough for its stark portrayal of the stealth privatisation of the NHS. Babylon Health was founded by former Goldman Sachs banker Ali Parsa, who also co-founded and acted as CEO of a private healthcare company, Circle — the first private business to operate an NHS hospital. That hospital was Hinchingbrooke, which proved to be a disastrous enterprise.\n\nYes, Bill Gates has a connection to Babylon, too. In March 2020, Babylon’s Rwanda-focused virtual care subsidiary, Babyl, signed a ten-year partnership with the Rwandan government giving every citizen over the age of 12 access to digital health consultations. The project is heavily subsidised by the Rwandan government and the Bill Gates Foundation and promises (!) to “make health care affordable” for even the poorest communities. Again, we must ask to what degree these apps are serving as surveillance instruments for government agencies.\n\nThe alleged war criminal and President of Rwanda, Paul Kagame, and Bill Gates proclaim: “Every vaccine is a shot of adrenaline into the heart of the African economy.”\n\nCue the Babylon Covid–19 Care Assistant app. The app provides a four step care programme to subscribers: information, symptom checker and live chat with healthcare experts, a care plan, and video consultation with a healthcare professional.\n\nWe are informed: “The app is free to download. Using the service is free in Birmingham and London through the NHS. However, users located elsewhere will have to sign up for pay-as-you-go or annual subscriptions to the service. Annual plans start from £149. One-off consultations can cost as much as £49 each time.”\n\nCummings and Hancock — tag team that pushed for lockdown while promoting vaccines\n\nCummings is accused of pressuring Boris Johnson’s advisers to adopt a draconian lockdown policy to combat Covid–19. If this is true, it must raise the question, yet again, of how much the UK Government's policy is influenced by genuine medical expert opinion and how much by commercial, Big Pharma, interests and agendas — interests and agendas which are demonstrably also those of the UK Government.\n\nCertainly, members of the scientific advisory committee “were shocked, concerned and worried for the impartiality of advice” after Cummings effectively gatecrashed the Scientific Advisory Group for Emergency (SAGE) meetings.\n\nJust this week, Hancock warned that there has been \"no greater demonstration in modern history\" of a need for a vaccine. Previously, in September 2019, Hancock had stated that the government was looking seriously at mandatory vaccines for state school pupils. Falling vaccination rates for children in the UK prompted Hancock to consider prohibiting self-determination among parents who do not agree with vaccination regimes.\n\nThe fact that Cummings used his influence to politicise the SAGE meetings, and that Hancock is not averse to using his influence to promote private sector businesses with links to the NHS, should alert us to the possibility that both individuals are exploiting Covid–19 to further the aims of those whom they are connected to and potentially profit from. Bill Gates takes pride of place at the heart of the advisory network that has introduced and maintained lockdown in the UK — a lockdown not to be relaxed “until a vaccine is available”.\n\nCovid–19 is pushing us towards global health fascism\n\nCovid–19 threatens an imminent “new normal” of global health tyranny and unprecedented government control and surveillance. The SAGE team was very likely derailed by Cummings’ political agenda and undue influence that he brought to bear upon the committee, which should have remained impartial and science-focused.\n\nThe most influential members of the UK Government advisory team have demonstrated a blatant conflict of interest through their connections to the Bill Gates empire, but the British Government itself has invested heavily in the global immunisation concept that Gates is engineering through all manner of public and private sector initiatives.\n\nThe WHO is the global health governing body and is heavily influenced and financed by Bill Gates. In January 2020, the WHO published its R&D blueprint prioritising novel Coronavirus vaccine clinical trials. The WHO's Working Group for Vaccine Prioritisation aimed in that blueprint to provide guidance and recommendations to vaccine developers and to identify candidates who could be considered for further development and evaluation.\n\nThe WHO is effectively a self-regulatory entity in charge of world health but with little public accountability, particularly where vaccines are concerned. The Global Advisory Committee on Vaccine Safety (GACVS) was established by the WHO in 1999 to respond to vaccine safety issues of “potential global importance”.\n\nBill Gates is demanding indemnity against lawsuits before he agrees to distribute vaccines. We are all being fast-tracked into a future where our medical self-determination is in serious jeopardy and where those who decide for us will, potentially, not be held accountable for any health-endangering side effects.\n\nWe have already seen the devastating consequences of mass immunisation during the H1N1 epidemic, with questionable Big Pharma transparency regarding risk, as found by those who were given a vaccination that left them brain damaged for life.\n\nExperts in the field have warned against rushing through a Covid–19 vaccine, bearing in mind it can usually take up to fifteen years of rigorous testing prior to approval. Any attempt to compress this process must carry risks. Dr Peter Hotez, Dean of the National School of Tropical Medicine at Baylor College of Medicine, told Reuters:\n\nIn 2009, Dr Wolfgang Wodarg initiated the Committee of Inquiry into the WHO's role in H1N1 ('swine flu') held by the Parliamentary Assembly of the Council of Europe in Strasbourg. In this recent interview, Wodarg describes Bill Gates as “crazy” to be attempting to shortcut research and development. Wodarg also talks about the “secret contracts” between states and Big Pharma that perhaps determine the trajectory of vaccine development.\n\nThe H1N1 vaccine travesty must serve as a warning against precipitous vaccine development motivated by lockdown cabin fever, when the lockdown itself is looking more and more likely to be orchestrated to achieve precisely this outcome.\n\nAt the same time, as the possibility of compulsory vaccination is under discussion, the government intends to roll out a surveillance apparatus that will ensure forever-control over an already politically weakened workforce pushed ever deeper into financial insecurity, first by austerity measures and now by Covid–19.\n\nIt is very important to push back against the emotional triggering that is being generated by the state-aligned media and agencies. The behavioural insight experts are working hard to nudge us towards dependency on the state — but we must not surrender our individual and collective independence. We must determine the drivers behind this “crisis”, identify the causes, and deal with the symptoms without succumbing to fear or panic. It is not easy; but our futures depend upon our ability to see what is really going on and to respond accordingly.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/covid%E2%80%9319-big-pharma-players-behind-uk-government-lockdown", "title": "COVID–19: The Big Pharma players behind UK Government lockdown", "description": "Is the private sector now going to be spying on the workforce? Vanessa Beeley examines the revolving-door policy between philanthrocapitalism, Big Pharma and government agencies, all effectively working in lock-step to promote the global immunisation agenda.", "image": "https://www.ukcolumn.org/sites/default/files/covid-19-big-pharma.jpg", "article:author": "Vanessa Beeley", "article:publisher": "UKColumn", "article:published_time": "2020-05-06T19:32:00+01:00", "article:modified_time": "2020-05-07T13:22:21+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "https://www.theguardian.com/world/2020/apr/29/half-of-worlds-workers-at-immediate-risk-of-losing-livelihood-due-to-coronavirus", "https://www.businessinsider.com/coronavirus-uk-in-talks-with-id-startups-over-immunity-passports-2020-4", "https://www.facebook.com/watch/?v=3021415934619066", "https://techcrunch.com/2020/04/15/onfido-the-ai-based-id-verification-platform-raises-100m-led-by-tpg/", "https://www.biometricupdate.com/202004/uk-immunity-passport-proposals-leverage-biometric-facial-recognition", "https://www.biometricupdate.com/companies/onfido", "https://www.biometricupdate.com/companies/yoti", "https://www.biometricupdate.com/companies/idnow", "https://www.biometricupdate.com/companies/idenfy", "http://www.ox.ac.uk/research/research-in-conversation/entrepreneurial-academics/husayn-kassai-and-onfido", "https://onfido.com/us/", "https://techcrunch.com/2020/04/15/onfido-the-ai-based-id-verification-platform-raises-100m-led-by-tpg/", "https://www.theguardian.com/politics/2020/may/03/coronavirus-health-passports-for-uk-possible-in-months", "https://techcrunch.com/2020/04/15/onfido-the-ai-based-id-verification-platform-raises-100m-led-by-tpg/", "https://www.biometricupdate.com/202004/immunity-certificates-should-leverage-biometrics-to-alleviate-privacy-concerns-says-id2020s-executive-director", "https://www.globalresearch.ca/coronavirus-causes-effects-real-danger-agenda-id2020/5706153", "https://www.youtube.com/watch?v=Yb9iaDoXJF8", "https://www.youtube.com/watch?v=6cYjjEB3Ev8&feature=youtu.be", "https://www.ibtimes.co.uk/brain-damaged-uk-victims-swine-flu-vaccine-get-60-million-compensation-1438572", "https://www.ibtimes.co.uk/brain-damaged-uk-victims-swine-flu-vaccine-get-60-million-compensation-1438572", "https://www.fiercepharma.com/vaccines/glaxosmithkline-fails-to-warn-pandemic-flu-vaccine-s-alarming-safety-signal-bmj-report", "https://www.who.int/vaccine_safety/committee/topics/influenza/pandemic/h1n1_safety_assessing/narcolepsy_statement_Jul2011/en/", "https://www.independent.co.uk/news/health/coronavirus-vaccine-risks-research-nhs-lockdown-pandemrix-adjuvant-a9470306.html", "https://twitter.com/uksciencechief/status/1255828316096991232", "https://www.fiercebiotech.com/biotech/british-government-enlists-astrazeneca-bia-for-new-pandemic-vaccine-taskforce", "https://www.genengnews.com/news/astrazeneca-joins-u-of-oxford-and-spinout-to-develop-covid-19-vaccine/", "https://www.thepharmaletter.com/article/gsk-links-with-cepi-to-develop-a-vaccine-for-the-2019-ncov-virus", "https://cepi.net/news_cepi/2-billion-required-to-develop-a-vaccine-against-the-covid-19-virus/", "https://www.gsk.com/en-gb/media/press-releases/new-partnership-between-gsk-and-the-bill-melinda-gates-foundation-to-accelerate-research-into-vaccines-for-global-health-needs/", "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "https://www.ukcolumn.org/article/retired-chief-eu-epidemiologist-how-long-can-you-keep-lockdown-democracy", "https://www.aier.org/article/stand-up-for-your-rights-says-bio-statistican-knut-m-wittkowski/", "https://www.youtube.com/watch?v=k0Q4naYOYDw", "https://m.washingtontimes.com/news/2020/apr/28/coronavirus-hype-biggest-political-hoax-in-history/?utm_campaign=shareaholic&utm_medium=facebook&utm_source=socialnetwork&fbclid=IwAR3S79hdIjN4mrU3i71O0VGsyDngksPPGx664CzctEAJa1znf3WAC25OOVc", "https://flat.bio/story/154247/cepi-launches-3-accelerated-vaccine-development-pr/", "https://cepi.net/news_cepi/cepi-announces-new-permanent-board/", "https://www.globalresearch.ca/after-the-lockdown-a-global-coronavirus-vaccination-program/5706547", "https://cepi.net/news_cepi/cepi-announces-new-permanent-board/", "https://www.theguardian.com/society/2020/mar/04/prof-chris-whitty-the-expert-we-need-in-the-coronavirus-crisis", "https://www.theguardian.com/society/2020/mar/04/prof-chris-whitty-the-expert-we-need-in-the-coronavirus-crisis", "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "https://www.fiercepharma.com/vaccines/global-coalition-invests-imperial-college-london-s-rna-vaccine-platform-to-fight-disease-x", "https://www.imperial.ac.uk/news/189447/tailor-made-disease-vaccines-created-million-project/", "https://www.youtube.com/watch?v=T8HfTo5ofYY&t=62s", "https://sciencebusiness.net/news/good-progress-being-made-towards-covid-19-vaccine-says-epidemic-response-group", "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "https://www.gavi.org/news/media-room/coalition-epidemic-preparedness-innovation-turns-iffim-accelerate-funding-new", "https://www.gavi.org/investing/innovative-financing/iffim/", "https://www.gavi.org/our-alliance/about", "https://www.youtube.com/watch?v=NQ29vgOpTQQ&t=1205s", "https://devtracker.dfid.gov.uk/search?query=Bill+Gates&includeClosed=0", "https://www.gov.uk/government/news/pm-its-humanity-against-the-virus", "https://www.gov.uk/government/groups/uk-vaccines-network", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/827983/projects-currently-being-funded-by-ukvn.pdf", "https://www.ukri.org/news/20-million-rapid-response-for-novel-coronavirus-research/", "https://www.gov.uk/government/publications/vaccine-update-issue-307-april-2020-world-immunization-week", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/882827/PHE_11652_VU_307_April_2020.pdf", "https://twitter.com/hashtag/carryonvaccinating", "https://twitter.com/VanessaBeeley/status/1255908325906173953", "https://www.youtube.com/watch?v=8tX7qZ5lRPs&feature=youtu.be", "https://twitter.com/ShoebridgeC/status/1254364437982699523", "https://youtu.be/1_d8sNJ4o1g", "https://www.ukcolumn.org/article/behavioural-insights-second-team-leading-uk-governments-covid-19-response", "https://www.gov.uk/government/news/phe-drug-development-to-transfer-to-new-state-owned-company", "https://www.gov.uk/government/news/phe-drug-development-to-transfer-to-new-state-owned-company", "http://www.portonbiopharma.com/", "https://twitter.com/MattHancock/status/1088390904858202112", "https://bylinetimes.com/2020/04/22/palantir-coronavirus-contract-did-not-go-to-competitive-tender/", "https://www.babylonhealth.com/", "https://www.thebureauinvestigates.com/stories/2019-10-11/conflict-of-interest-questions-over-dominic-cummings-job-at-health-tech-firm-babylon", "https://www.theguardian.com/politics/2018/nov/30/matt-hancock-accused-of-breaching-code-over-gp-app-endorsement", "https://blogs.bmj.com/bmj/2018/12/04/rachel-clarke-why-matt-hancocks-promotion-of-babylon-worries-doctors/", "https://www.gov.uk/government/speeches/my-vision-for-a-more-tech-driven-nhs", "https://www.gponline.com/health-secretary-wants-loads-companies-follow-gp-hands-example/article/1492843", "http://www.pmlive.com/pharma_news/controversy_grows_around_gp_at_hand_service_after_ministers_endorsement_1252569", "https://www.telegraph.co.uk/news/2018/09/12/hancock-attacks-nhs-block-progress-says-patients-should-able/", "https://www.standard.co.uk/futurelondon/health/matt-hancock-on-ai-and-the-nhs-a3998006.html", "https://twitter.com/johnpilger/status/1253537596342325248", "https://www.youtube.com/watch?v=rHZcXrc9_wk", "https://www.theguardian.com/society/2015/jan/09/circle-patients-hinchingbrooke-sick-dream-impossible", "https://www.mobihealthnews.com/news/europe/babylon-inks-10-year-partnership-rwandan-government", "https://bereanresearch.org/the-year-rwanda-goes-purpose-driven-un-begins-biometric-registration-of-citizens/", "https://www.globalresearch.ca/rwanda-under-the-repressive-government-of-paul-kagame-washingtons-proxy-police-state/5500388", "https://www.cnn.com/2019/03/22/opinions/african-health-key-economic-growth-paul-kagame-bill-gates/index.html", "https://www.express.co.uk/life-style/science-technology/1259222/Coronavirus-Symptom-Checker-iPhone-Android-App-UK", "https://www.cnn.com/2019/03/22/opinions/african-health-key-economic-growth-paul-kagame-bill-gates/index.html", "https://www.theguardian.com/world/2020/apr/26/attendees-of-sage-coronavirus-meetings-worried-by-presence-of-dominic-cummings", "https://www.express.co.uk/news/uk/1277698/Matt-Hancock-COVID19-vaccine-anti-vaxxers-coronavirus-Health-Secretary-latest-news-update", "https://www.theguardian.com/society/2019/sep/29/government-seriously-considering-compulsory-vaccinations-matt-hancock", "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine?WT.mc_id=20200430165003_COVID-19-vaccine_BG-TW&WT.tsrc=BGTW&linkId=87665522", "https://www.youtube.com/watch?v=XON2XeGDE6A&t=19m38s", "https://multipolar-magazin.de/artikel/the-gates-foundations-vaccination-activism", "https://www.who.int/publications-detail/who-r-d-blueprint-novel-coronavirus-ncov-vaccine-prioritization-for-clinical-trials", "https://www.who.int/vaccine_safety/initiative/communication/network/_gacvs/en/", "https://childrenshealthdefense.org/news/heres-why-bill-gates-wants-indemnity-are-you-willing-to-take-the-risk/", "https://www.politico.eu/article/coronavirus-vaccine-how-long-will-it-take-to-develop/", "https://www.businessinsider.com/coronavirus-vaccine-quest-18-months-fauci-experts-flag-dangers-testing-2020-4", "https://www.pnas.org/content/117/15/8218", "https://www.youtube.com/watch?v=BrBuv6kq6Rc&feature=youtu.be"], "authors": [], "publish_date": "2020-05-06T19:32:00+01:00"}