{"result_id": "323014", "URL": "https://www.ukcolumn.org/video/you-are-not-alone-peter-todd-consultant-solicitor-maverick-vaccine-injury-expert", "timestamp": "2023-04-25 17:46:27 CEST+0200", "meta": {"description": "In gentle, easy-to-understand language, experienced vaccine injury compensation lawyer Peter Todd affords a valuable and unique glimpse into his world, the role of the coroner and the pathologist, and how an inquest proceeds.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/you-are-not-alone-peter-todd-consultant-solicitor-maverick-vaccine-injury-expert", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "You are not alone—Peter Todd, Consultant Solicitor, ‘Maverick’ Vaccine Injury Expert", "cleaned_text": "In January 2021, Alex Kelly returned home from work to find her mother lying lifeless on the floor. Anthea Kelly had received her first AstraZeneca vaccine days earlier. Tragically, Anthea died that day, leaving her daughter Alex and son James in utter grief and shock.\n\nSuspecting their mother’s death was caused through the vaccine, they proceeded with a request for a post mortem, which was to be followed by a coroner’s inquest. However, the original decision to proceed with an inquest was—without reason—reversed, much to the family’s alarm.\n\nWhat could they do now? Was there a way of appealing the decision? Who could advise them?\n\nEnter Peter Todd, Consultant Solicitor, Scott-Moncrieff Solicitors, who has over 25 years’ experience. His area of law is Public and Administrative Law; he specialises in common-law disputes, public law, contentious costs, catastrophic/fatal injury claims, claims for birth defects caused by chemical or pharmaceutical exposure, and criminal injury cases.\n\nMore specifically, he has expertise in cases involving acquired spinal cord injury or brain injury, injury caused by vaccines, organophosphates, and various defective pharmaceutical products under the Consumer Protection Act 1987. His legal advice applies to the jurisdiction of England and Wales.\n\nReassured by his wealth of knowledge and experience of injuries and death caused by vaccines, Alex and her late brother James sought Peter’s legal advice. A judicial review was applied for, but was not required in the end, as the coroner decided that an inquest would be held after all.\n\n The inquest was finally heard, establishing that part of the cause of death was attributable to the AstraZeneca Covid vaccine that Anthea Kelly had received.\n\nPeter Todd kindly agreed to give up some of his valuable time to talk to Debi Evans. In gentle, easy-to-understand language, he gives us a valuable and unique glimpse into his world, the role of the coroner and the pathologist, and how an inquest proceeds.\n\nWhat is an inquest? What is a coroner? What is a judicial review? What do normal members of the public, with no legal knowledge, do if we need help should a loved one die from a suspected unnatural cause? Whom do we appeal to, should our requests be refused? What are the costs? Who pays?\n\nFor those who are bereaved or who are suffering vaccine injury, life doesn’t get more difficult. While those who are bereaved should be allowed to grieve, those who are vaccine-injured should be allowed to concentrate on getting the medical help they need, in order to move on with their lives. But that is not happening in reality. Many are struggling just to get up in the morning, let alone micro-manage their way through official paperwork, forms, appointments, and phone calls.\n\nMany families are unable to afford professional legal representation. However, Peter’s maxim is:\n\nAs Covid vaccine injuries, serious adverse reactions and vaccine deaths appear to be receding quietly from our news feeds and television screens, we must ensure that they are never forgotten or ignored.\n\nIn memoriam to Anthea Kelly, Alex has set up a Memorial Fund, which has been designed to operate as a private legal aid scheme, set up to help those families who need some financial support when in a similar position. For as little as £1 a month (there are higher tiers for anyone wishing to pledge more), anyone can become a patron.\n\nFunds received will be used to pay for legal expenses for the vaccine-injured and bereaved. Understanding that times are harsh and some may not be able to contribute, Alex’s simple request is that if those reading could please share the page, that would help spread the word far and wide. That fundraising page is here.\n\nTo hear the background story of Alex, Anthea, James and Lily (beloved canine companion), view Alex's first interview for UK Column.\n\nPeter Todd can be e-mailed at [email protected].", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/you-are-not-alone-peter-todd-consultant-solicitor-maverick-vaccine-injury-expert", "title": "You are not alone—Peter Todd, Consultant Solicitor, ‘Maverick’ Vaccine Injury Expert", "description": "In gentle, easy-to-understand language, experienced vaccine injury compensation lawyer Peter Todd affords a valuable and unique glimpse into his world, the role of the coroner and the pathologist, and how an inquest proceeds.", "image": "https://www.ukcolumn.org/sites/default/files/2023-03/F826E9A0-0E61-4EC2-837C-0472699BF798.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.scomo.com/our-people/peter-todd.html", "https://www.patreon.com/user?u=87994238", "https://www.ukcolumn.org/video/fatal-outcome-vaccine-damage-real-people", "/cdn-cgi/l/email-protection#f0a0a49f9494b083939f9d9fde939f9d"], "authors": [], "publish_date": "2023-03-14T09:31:38+00:00"}