{"result_id": "323009", "URL": "https://www.ukcolumn.org/video/frances-long-time-vaccine-policy-chief-covid-policy-is-completely-stupid-and-unethical", "timestamp": "2023-04-25 17:46:23 CEST+0200", "meta": {"description": "The professor of infectious diseases who wrote France's pre-Covid vaccination policy accuses the \"unethical\" pharmaceutical protégés who have supplanted him of deliberately discrediting Covid-19 treatments so that they can \"market their so-called vaccines\", and calls for them to be held accountable.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/frances-long-time-vaccine-policy-chief-covid-policy-is-completely-stupid-and-unethical", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "France's long-time vaccine policy chief: Covid policy is \"completely stupid\" and \"unethical\"", "cleaned_text": "* All the above translations are by third parties and were made before the last few corrections to names and chemicals were published to the below English original transcript.\n\nUK Column was recently able to interview top French vaccine expert Professor Christian Perronne on the subject of Covid-19 vaccines.\n\nProfessor Perronne is Head of the Medical Department at Raymond Poincaré Hospital in Garches, the teaching hospital for the University of Versailles-St Quentin near Paris. He was the University's Head of Department for Infectious and Tropical Diseases from 1994 onwards, but was fired from that position a few months ago. He is a Fellow of France's biomedical research centre of world standing, the Institut Pasteur, from which he graduated in bacteriology and virology and where he served as Deputy Director of the National Reference Centre for Tuberculosis and Mycobacteria until 1998.\n\nHe has chaired many top-level health committees, including the French Specialist Committee for Communicable Diseases, and the High Council on Public Health (French acronym: HCSP), which advises the government on public health policy and vaccination policy. He is not anti-vaccine and indeed wrote France's vaccination policy for many years, as well as presiding over the National Consultation Group on Vaccination, also known as the Technical Committee on Vaccination (CTV).\n\nProfessor Perronne was also the Vice-President of the European Advisory Group to the World Health Organisation. At national level in France, he has chaired the Infectious and Tropical Diseases Teaching College (CMIT), the Infectious Diseases Federation (FFI, which he co-founded), the High Council for Public Hygiene (CSHP), and the National Medical and Healthcare products Safety Agency (ANSM, previously AFSSAPS), which evaluates the health risks of medicines and is France's sole regulator of biomedical research. Until 2013, he sat on the Scientific Council of the French Microbiology and Infectious Diseases Research Institute (IMMI/INSERM).\n\nDespite Professor Perronne's extensive knowledge and experience of communicable diseases, vaccines and vaccine policy at national and governmental level in France, he was quickly censored for speaking out on the subject of Covid-19 vaccines, their claimed efficacy and their identifiable risks. In short, he was professionally sidelined, his reputation was attacked and his professional opinions were censored.\n\nWe are therefore delighted to be able to offer this very brave and highly knowledgeable man the opportunity to express his professional opinions and concerns to our audience both in the UK and worldwide, by means of this crucial video interview.\n\nProfessor Perronne was joined by Dr Anne-Marie Yim, who kindly facilitated this interview. Anne-Marie is herself highly qualified to speak on vaccines and their effects in the body, having worked as a protein and immune response research expert within the wider pharmaceutical and vaccine industry.\n\nBoth our guests speak excellent English, but to assist viewers and listeners who may miss some points due to the inevitable variability of overseas video and audio connections, Alex Thomson from UK Column has kindly provided a transcript of the interview below.\n\nWe encourage our audience to share the video interview, this covering article and the transcript as widely as possible, so that as many people as possible can understand the critical concerns around Covid-19 vaccines. By facilitating understanding of these concerns, we hope to help more people make a fully informed choice in their decision to accept or reject a Covid-19 vaccine.\n\nIt would be very much appreciated if native speakers of French with sufficiently good English could help by producing a French translation of our discussion, which they would be very welcome to upload to their own websites and/or send to us in either textual, subtitled-video or dubbed-video format. We would like to see the benefits of this interview available to a wide Francophone audience. The same applies to translations, subtitling or dubbing in other languages, of course.\n\nIt may be helpful to those watching and listening to the video interview to do so with a printed copy of the transcript below, as this will help clarify the audio, conversation and some content.\n\nIf our viewers and listeners find the video informative and helpful, we encourage them to freely share this material with a link back to the UK Column home page. Thank you.\n\nTranscript of UK Column interview with Professor Christian Perronne and Dr Anne-Marie Yim, July 2021\n\nBrian Gerrish: Welcome to all our UK Column viewers and listeners. We’re very pleased to have two distinguished experts with us, who are going to be talking with us about the subject of Covid-19 and also the vaccination policy which we’re seeing unfolding in the United Kingdom, France and worldwide.\n\nFirst of all, I’d like to welcome Anne-Marie Yim. Anne-Marie and I have spoken previously, so it’s a pleasure to have her back again. She’s going to be joined tonight by Professor Christian Perronne, and I think we’re going to have an extremely good discussion.\n\nSo, Anne-Marie, thank you for joining us. Please will you tell the audience a little bit about your professional background and your qualifications?\n\nAnne-Marie Yim: Hello, and thank you for UK Column for having us tonight with Professor Perronne. It’s a great privilege for us as French citizens to be able to address your British audience.\n\nMy name is Anne-Marie Yim, I’m a French citizen, and I was born in Cambodia. I have a Ph.D. in organic chemistry, in peptide proteins, from the University of Montpellier, which is now the Institut des Biomolécules Max Mousseron. I have been doing a post-doctorate in proteomics, which is identifying membrane proteins, at the University of Michigan, under Professor Samir Hanash, who is a well-known expert in this field. I also worked with Professor Joseph Holoshitz on the inflammation process in rheumatoid arthritis.\n\nI also have a Master’s in intellectual property, and since 2018, I have been studying the law related to patent engineering [the preparation of patent applications], at CEIPI in Strasbourg. I have also worked as a patent engineer here in Luxembourg, but very briefly, because I didn’t very much like the environment.\n\nAnd then I started my own structure in 2018, and I’m basically a sciences and languages tutor for children from primary school to high school and above, up to university.\n\nBrian Gerrish: Thank you very much for that, Anne-Marie. And Professor Perronne, welcome to UK Column. It’s wonderful to have you with us. I’d just ask that you also tell us a little about yourself, your professional background, and I also understand that since you have spoken out contrary to some of the official government policy around Covid-19 and vaccinations, you’ve been censored, you’ve been prevented from speaking out.\n\nChristian Perronne: Thank you very much for the invitation. I’m Professor Christian Perronne. I work at a university hospital near Paris, with the University of Versailles. I was the head of department for infectious diseases since late 1994, but I was fired from that position a few months ago because of my public statements.\n\nI embarrass our government because I was working for various governments, of both the right wing and the left wing of politics, and for fifteen years I was chairman of many committees, [including] the High Council on Public Health, which advises the government on public health policy and vaccination policy. I was also the vice-president of a group of experts for the European region of the WHO.\n\nSo I was involved in the management of several epidemics and pandemics, with different governments, and when I saw how the epidemic was managed since February-March 2020, I was amazed. I saw that it was completely crazy. That’s why I spoke out in the media, but now I’m censored in the media.\n\nBrian Gerrish: This brings us to the crux of the matter. I think it’s important that we say to the audience: in the first place, neither yourself nor Anne-Marie Yim are anti-vaccine. Would you like to tell us a little bit more about your position on that?\n\nChristian Perronne: I am not anti-vaccine, because I wrote the vaccination policy for France for a great many years. But the problem is that the products they call “vaccines” for Covid-19 are not really vaccines. That’s my problem.\n\nBrian Gerrish: Can we just press a little bit further? If they’re not vaccines, what would you call them?\n\nChristian Perronne: Maybe genetic modifiers; I don’t exactly know the proper term from a scientific point of view. But when you inject messenger RNA to produce a huge amount of a spike protein, a fragment of the SARS-CoV-2 virus, you can’t control the process. And the problem is that in human cells, we know that RNA might go back to DNA.\n\nNormally, it goes from DNA to RNA—this may be a little bit difficult for a general audience to understand—but it may go in the reverse direction, because we have in our chromosomes, in our genome, genes in our DNA originating from retroviruses, of animal origin centuries or millennia ago, and these can code for enzymes which can code in the reverse direction.\n\nSo we now know (it’s officially published), and now we find, in the human genome, sequences of DNA corresponding to the RNA of the virus. That’s proof that what I said in an open letter in December [2020], saying that it was dangerous to inject these products, has now been confirmed. And all the governments continue! To me, it’s a great mistake.\n\nBrian Gerrish: And, Anne-Marie, can we ask you the same question? If, in principle, you’re not against vaccination, what are we facing?\n\nAnne-Marie Yim: Experts in virology and working in the field of vaccines are saying that it’s not a vaccine, because usually when you have a virus—for example, the flu, et cetera—you take the virus and you kill it with formaldehyde or with ultraviolet light (which is called attenuation of the virus), so that it’s harmless. You then inject it, along with a physiological serum and usually an adjuvant, to boost your immune system. And that is the definition of a vaccine.\n\nAnd then, for the core delivery part of the vaccine, if you like: you can use different vectors if you wish to inject it. But here, with Pfizer and Moderna and BioNTech and Johnson & Johnson [Janssen], [it’s different]: Pfizer, Moderna and BioNTech are mRNA vaccines, and AstraZeneca and Johnson & Johnson are DNA viral. Usually, you [start with] the DNA, and the DNA is transformed into RNA, and the RNA is read, and that brings the ribosome to the S-protein [spike protein].\n\nBut here, you have a sequence of a gene—and that’s the first time this has ever been done. So clearly, it’s genetic material that is being injected into your body. And it should not be labelled “vaccine”, because that’s deceiving.\n\nSo a lot of scientists are saying it’s a genetic injection. That’s why they [prefer to] call it “a jab”.\n\n\n\nBrian Gerrish: Professor Perronne, what I’d like to ask you—and this is for the wider audience, for people who are really trying to get on with their lives and suddenly we’ve had these amazing events unfold—what do you think is actually happening? What is being done around us with respect to Covid-19, the claims of a pandemic, and then the “vaccination” programme?\n\nWhy have all of the special effects come into place when—over many, many years, of course—every winter we have flu and people die, but there’s certainly not been these tremendous counter-measures coming into place? What do you think is happening around Covid-19 and the “vaccine” programme, and why is it happening?\n\nChristian Perronne: I think you should put this question to the politicians, because in the history of infectious disease medicine, it has never happened that a state or politicians recommend systematic vaccinations for billions of people on the planet for a disease whose rate of mortality now is 0.05%. That’s a very low rate of mortality! And they’re making everybody afraid that there’s a new so-called “Delta variant” coming from India, but in fact all these variants are less and less virulent, and we now know that [with] this so-called “vaccine”, in the population that is inoculated at large, it is in these people that the variants emerge.\n\nSo I don’t understand why the politicians and the various authorities in different countries are asking for mass inoculations while the disease is so mild. And we know that over 90% of cases are in very old people. And we can treat them: we have treatments. There are hundreds of publications showing that early treatments work: there’s hydroxychloroquine, azithromycin, ivermectin, zinc, Vitamin D, and so on—it works! There are publications!\n\nSo all these products, so-called “vaccines”, are useless, because we can perfectly well control an epidemic. And the best example is in India: there, you have a billion and a half people, with many different states. In the states where they treated people with ivermectin, zinc, Doxycycline and Vitamin D, the epidemic [remained] at a very low rate: it was quite [soon] finished. But in the states where they banned these antibiotic and antiviral treatments which work on the virus, and [where] they promoted the “vaccine” and also promoted Remdesivir (coming from France and Belgium, because Remdesivir was so toxic and not efficacious: the French and Belgians sent planeloads of Remdesivir to the Indian people!), in these areas of India where they used “vaccines” and Remdesivir, the epidemic came back, with new cases of mortality. That’s proof that if you treat early, you can succeed and the epidemic will be over very rapidly.\n\nIn all the countries with massive inoculation of these products (I don’t like the term “vaccination”), we see that you have a recurrence of the epidemic, with new cases of death.\n\nMike Robinson: Professor Perronne, I’d like to delve into hydroxychloroquine and ivermectin in a little more detail in a minute, but before we get there, you said something in your last comment there that just raises a question. Is there currently a pandemic? What you said suggests there isn’t. Was there ever a pandemic?\n\nBut, as well as that, with respect to the “variants”: the mainstream media and the politicians are pushing—on the normal Sunday morning politics programmes—once again very strongly that the “Delta variant” and the “subsequent variants” which are coming along are going to have an extremely negative impact on anyone who’s unvaccinated at the moment. They’re saying that this coming winter, the “vaccinated” are going to be fine generally, but the unvaccinated are going to have a very hard time.\n\nSo is there a pandemic, was there ever a pandemic, but as well as that, should the unvaccinated be afraid of the current “variants” that are out there, and the coming “variants”?\n\nChristian Perronne: Exactly the reverse! Vaccinated people are at risk of the new variants. In transmission, it’s been proven now in several countries that vaccinated people should be put in quarantine and isolated from society. Unvaccinated people are not dangerous; vaccinated people are dangerous to others. That’s been proven in Israel now, where I’m in contact with many physicians. They’re having big problems in Israel now: severe cases in hospitals are among vaccinated people. And in the UK also, you had a larger vaccination programme and there are problems [there] also.\n\nBut also, the “variants” are not very dangerous. All the “variants” since last year are less and less virulent. That’s always the story in infectious diseases. In my hospital, in March-April 2020, the whole building was full of people with Covid-19: fifty patients. And the so-called \"second”, “third”, “fourth waves” were just very small waves, because the hospitals are not full any more. But in the media, they said that all the hospitals were full of patients. That’s not true. Of course, the epidemic was going on, but the “variants” were less and less virulent.\n\nYou know, in August 2020, they said, “The ‘Spanish variant’ will kill all of Europe!”—but in the end, there was no real problem.\n\nAfter that, they said, “The British variant!”, and after that, “The New Zealand variant!”, and “The American variant!”, and “The South African variant!”, and so on. All that is only media stuff. It’s not scientifically-based. The “Delta variant” is of very low virulence. If you look at the official rates of the disease and of death in Brazil and India, which were the two last countries in the world with an active transmission of the disease, all the curves are going down. And now, the epidemic is quite over in many countries worldwide.\n\nYet now, you have governments obliging their citizens to be inoculated with these so-called “vaccines”—and in the countries where they did that, once the epidemic was [already] finished, the epidemic came back, and deaths started again.\n\nIn Vietnam, for example, it was an amazing success, they had only a few dozen deaths over more than a year, [the epidemic] was finished, and then one of the ministers said, “We have to vaccinate the whole population!” It’s now nearly mandatory, and after the start of this vaccination campaign, the epidemic came back and fatal cases occurred again. That’s proof that these inoculations are not a vaccine, but may facilitate the reappearance of the disease and also of deaths.\n\nMike Robinson: And indeed, that’s exactly what we saw in the UK, because in October-November [2020], we saw a new wave coming along, which seemed to plateau out and even to be falling again. As soon as the “vaccination” programme began around 8 December, it peaked—in mid-January, we had quite a peak—and then in February and March, that peak fell very steeply. The graph was very similar to what happened in 2020. And what happened in 2021 has been, according to the politicians, “because of vaccination”. There doesn’t seem to be any consideration in this of what normally happens in a respiratory flu year.\n\nSo could you say something about that, and also whether the policy of lockdown and “vaccinations” was the right one, or whether herd immunity, as was originally discussed, would have been a better way to move forward with this?\n\nChristian Perronne: Regarding lockdown, we now have the proof, by comparison between many countries in the world, that lockdown was completely useless, because the countries with the strictest policies of restricting civil liberties and so on, like France—France is a champion of the suppression of liberties today—have the worst results in the world.\n\nIn late June 2020, we were [already] able to look at lethality. Lethality is the rate of death from the cases diagnosed. We could maybe speak thirdly [as a third factor in the equation] about PCR tests—PCR tests are not very reliable—but at that time, PCR tests were not available and the diagnosis relied on the physician, on a CT scan of the chest and so on, and it was a good and reliable diagnosis.\n\nFrance was the worst country in the world. Yemen was a little bit worse than France, but Yemen is a country in war, with destruction of the health system, where hospitals have been destroyed. And imagine that France, which was rated ten years ago by the WHO as the best system in the world, had the worst results of mortality, lethality, in the world!\n\nWe cannot really rely on the statistics in many countries, because with PCR tests, which amplify the RNA of the virus when you have small fragments from this swab that you put in the nose, PCR tests are much more amplified, and so we have many, many false positive results.\n\nNow, from August 2020 [until] now, most of the so-called “positive cases” are false positive cases. So they invented the so-called “second wave”, “third wave”. Of course, the epidemic was not over; there were also new cases, and unfortunately people who died. I agree about that. But now, the numbers are not reliable.\n\nAnne-Marie Yim: I agree, because the PCR test was put in place by a scientist whose name was [Christian] Drosten, and it has been shown that with a cut-off of amplification above 25 [cycles]—if you go above 45 or 50 [cycles], as some laboratories are doing—you will get 97% false positives and only 3% true positives. So these tests are very unreliable.\n\nThat’s why a physician, Dr Nathalie Eraud, proposed, instead of doing a PCR test, doing serological tests, meaning you go into the plasma and you [measure] the dosage of neutralising antibodies [immunoglobulin G (IgG)] that are directed against the Covid virus. This is much more reliable. If the [IgG] dosage [found] is high, it means you are protected and you do not need vaccinations. That’s what we need to tell people: that they are protected.\n\nAnd, as I said, the wife of [Professor] Adrian [V.S.] Hill, who is the scientist who invented the AstraZeneca vaccine, said that we cannot reach herd immunity through vaccination.\n\nAs I think the WHO said, herd immunity should be achieved when you’ve vaccinated at 80% of the population—but that is only a legal definition, and it is not scientifically-based. Therefore, it should be considered null and void. It should not apply. You cannot apply that, because herd immunity is the field of [Professor] Dolores Cahill, an immunologist, so she’s an expert in it, and she said that once you’ve been infected with it and you don’t die, [that is to say] you’ve recovered, your innate immune system [starts] building antibodies for life. Your B lymphocytes, located in the bone marrow, build up antibodies.\n\nThere’s a recent study that has been presented by a Thai doctor in Germany, Dr Sucharit [Bhakdi]. He has been presenting some results saying that they have been dosing the level of antibodies in people who have had the first and the second injection. What they found out is that it’s not the immunoglobulin M that is detected, but immunoglobulin G and A, which means it’s the long-term antibodies that are presented.\n\nIf it’s the first time your body’s seen a virus, your body will produce immunoglobulin M, which is the first response. But if the antibody knows the virus and your body has memorised it and recognises it, then you secrete immunoglobulin G and A. And that’s what happens after the first injection and after the second injection. So this proves that we have already achieved herd immunity.\n\nChristian Perronne: Just a comment to complete what Anne-Marie said: we should by now have reliable serological tests. Serology is where you draw a blood sample and you look for the antibodies that your body has produced against a virus, if you had the disease weeks or months previously. The problem is that no lab in the world has developed a reliable serological test. That’s terrible.\n\nThe French physician David Mendels has published about this, comparing several serological tests (around twelve; I don’t remember the exact number) from China, Germany, France and other countries. They were all assessed by the Pasteur Institute in Paris, France. Most of these tests were bulls**t. They could not correctly identify the number of antibodies.\n\nI think that’s terrible, because I think that the scientific community, [owing to] some conflicts of interest, didn’t want to develop reliable serological tests, because if we had done that, we would be able to see today that most of the British, French, German, Spanish population are now immunised.\n\nBut if they showed that, it would be a big problem for the marketing by the pharmacological companies, because they would not be able to impose the vaccination policy, because I think that most people in Europe and other countries worldwide are already immunised. There is herd immunity.\n\nSo they did all they could do not to have reliable serological tests, and to me, that’s a great scandal.\n\nBrian Gerrish: Anne-Marie, I’d like to ask you effectively the same question that I asked Professor Perronne just now, which is the question of what is happening. His response to me was that I would do better to ask the politicians, and I understand his answer, because we’re in very strange times. We have what I’m going to call a scientific-medical policy which is being forced into action in the UK and France and other countries. This is being driven by the politicians. There is very little scientific debate about what’s happening, and people who do challenge the political policies, like Professor Perronne, are finding themselves censored or silenced, or they lose their jobs.\n\nSo my question to you is, what do you think is happening? What is Covid-19, and why are we facing the restrictions and the vaccine policies that we are?\n\nAnne-Marie Yim: Everybody has been reporting that during the last year, and the first lockdown in March 2020, every physician, such as general practitioners [family doctors], had received a protocol, like Dr [Benoît] Ochs [in Luxembourg], or even Dr Perronne, or Dr Francis Christian in [Saskatoon,] Canada.\n\nBasically, they’ve been reporting the same thing: that they had been bypassed by the political protocol that has been put [in place] to detect and treat the disease at the early stage, meaning that people who were sick with flu from Day 1 to Day 5, with symptoms like coughing or loss of smell, inability to swallow, and so on, were sent to a centre, especially in Luxembourg.\n\nThe general practitioners had an order to close their practice. Like Dr Ochs, they closed their practice. They had to work in military centres from 48 to 72 hours, where they didn’t have the right to treat patients but only to prescribe an order for the [patients] to be tested to find out if they were positive. And then, if they were [positive], they were sent back home with a box of paracetamol or Doliprane [French marketing name for paracetamol] or whatever.\n\nAnd they were waiting for complications to happen, until Day 12, such as that the patient couldn’t breathe any more, they had shortness of breath. And when he had shortness of breath, he would dial the 112 [emergency] number, and then they would send an ambulance and take him to ICU, the emergency [treatment ward], to have an induced coma and to be intubated and have oxygenation. And they were forbidden to take heparin, which is an anti-inflammatory medication, and aspirin, which is an anticoagulant.\n\nAnd therefore, when they were forbidden to take hydroxychloroquine too, there were complications and people would have a stroke. Their lungs were failing, so [they had] cytokine storm, inflammation process, and they would have water in their [lung] alveolae, and then they would lose 40% to 60% of their lung [capacity], and they couldn’t breathe. And the oxygen-CO2 exchange wouldn’t work, so basically they didn’t have oxygen [reaching] the brain or other organs, so they would have complications like necrosis of the tissue.\n\nAnd [then] they would get a bacterial infection, and then sepsis, and they would die. So they would have only around a 50% chance of recovery.\n\nSo now, everybody has agreed that that was a huge political mistake, and that this protocol is a total malpractice. Physicians need to treat patients at an early stage, and not let the disease progress so that people will die. [Refusal to treat] is called non-assistance à personnes en danger [“failure to assist those in peril” in the French criminal code], so it’s a call of duty for a physician not to let people die. The Hippocratic Oath says primum non nocere, which means “First, do no harm”. So you must not harm patients, and here, clearly, we are harming the patients.\n\nPhysicians in France are being driven by a protocol [derided] as the “four D's”. The four D’s stand for Doliprane [paracetamol], domicile [“send home”], dodo, which means “sleep”, and lastly décès, “death”. That’s totally wrong. And now, all the scientists have been doing scientific research and they found out that paracetamol does indeed trigger cytokine storm, which results in organ failure.\n\nThey found out that paracetamol is able to induce oxidative stress, which is when you have a superoxide forming (when you are deoxygenated, a molecule called hydrogen peroxide forms, which has great oxidative power). The paracetamol is able to block an enzyme called glutathione reductase.\n\n[Further explanation of the above paragraph that was subsequently sent to UK Column by Dr Yim:\n\n The blocking of glutathione reductase by paracetamol prevents the formation of glutathione in the body; glutathione is necessary to reduce the oxidative stress caused by radical oxygen species (ROS), just as the graphene oxide in the Covid jabs inhibits glutathione reductase.]\n\nConsequently, the body is not able to break down these radical oxygen species (ROS) into water and oxygen.\n\nWhat this means, to be clear, is that paracetamol blocks the body’s mechanism for reducing ROS, resulting in apoptosis, the death of cells. That’s what it means.\n\nSo we now know that paracetamol is wrong [as a treatment here].\n\nMike Robinson: It’s very interesting that you say that, Anne-Marie, because if I think back to March, April and May 2020, in the British media, it was Ibuprofen that was being demonised as being “dangerous”, which was pushing people towards paracetamol. So is Ibuprofen dangerous in the same way?\n\nAnne-Marie Yim: That’s what people have been reporting, but actually, the disease involves different stages, and it triggers some molecular pathways, such that you cannot administer [the same] drug at a different time and a different dosage.\n\nA very simple example: if you give 200 mg hydroxychloroquine for five days, [within the patient's post-infection range] Day 5 to Day 12, you can clear up or kill the virus. When the viral load is almost nil, you’ve got rid of the virus. But if you administer, for example, 2 mg hydroxychloroquine at the ICU in an induced coma, you can have heart attack problems and it can result in death. That’s what they have been trying to show with the RECOVERY Trial. They are trying to say, “See, hydroxychloroquine doesn’t work! It kills patients if you administer it at a late stage.” Of course, [you should] treat it at an early stage!\n\nThe same applies to Ibuprofen. Apparently, they said that Ibuprofen should not be administered, but Dr Ochs has found interesting results: that people who have been vaccinated have a very high level of D-dimers [proteins in blood tests indicating a clotting process], and a lot of physicians have been reporting blood clots forming with AstraZeneca.\n\nBut those blood clots are very unusual. They are not the result of the normal thrombosis process, with all the cascades where you have fibrinogen being transformed, being triggered by the thrombin, into fibrin, and you have that in combination with platelets, and then you have the clots. [Rather,] here, with Covid-19, you have thrombocytopoenia, which means a very low level of platelets.\n\nSo basically, it is coagulations, but that is not induced by the formation of platelets with fibrin as expected. Rather, it is induced by another process, of leukocytes acting with a protein which is on the surface of the endothelial cells of the arteries which is called E-selectin. So it’s the interactions of E-selectin with leukocytes that’s forming these clots.\n\nFor example, Dr Ochs prescribes Vitamin C and Ibuprofen to vaccinees who have a high level of D-dimers, a normal leukocyte level with a high level of C-reactive protein (CRP)—which is an indicator of inflammation processes—and a low level of platelets (thrombocytopoenia).\n\nThis is very important, because some physicians have found that if you let the disease progress, some people will have clots forming in the occipital lobe, which is the back part of the brain, and if you give too much heparin or too much aspirin [to them], you will dissolve the clots. But then, if you drop below a certain level, if [the clots] are too freed, you start to have haemorrhaging, because you don’t have enough platelets.\n\nSo it’s a very, very difficult symptom, and a complex disease, that evolves. And you should administer a given medicine at a certain time and at a certain dosage. The same medicine can either save lives or kill. So Ibuprofen, for example, is administered when there is a high level of D-dimers, a normal level of leukocytes, a high level of CRP, and a low level of platelets. In those conditions, you can administer Vitamin C and Ibuprofen, and the patients recover: the D-dimers come back to normal, and the clots disappear.\n\nSo Ibuprofen is a treatment to dissolve the clots, but it should be administered with all the parameters [in place], if you like.\n\nThat was a very complex answer, because it’s a very complex disease, actually.\n\nMike Robinson: Thank you. You mentioned the RECOVERY Trial. I’d like to ask Professor Perronne about that trial in the UK. [Microbiologist] Professor Didier Raoult was quoted as saying that it was “the Marx Brothers doing science”.\n\nThe RECOVERY Trial in the UK did seem deliberately to overdose, if that’s not too strong a word, the people taking part in the trial. I think they were using an initial dose of 2400 mg [hydroxychloroquine] and that was followed up over the next ten days with a maximum dose of 800 mg per day. So I was wondering whether you agree with Professor Raoult about that, and whether you have concerns about the announcement that the UK is perhaps about to run a similar trial on Ivermectin.\n\nChristian Perronne: I was amazed by the design of the RECOVERY Trial, because on the first day, I think they used more than four or five times the European Medicines Agency’s maximum authorised dose of hydroxychloroquine. We know that hydroxychloroquine may be an adjunct of suicide if you take a very high dosage. And we see that in the RECOVERY Trial, the mortality rate was high, much higher than in other trials.\n\nSo they modified the evaluation criteria, and we are not able to gain access to the original database [indicating] at which point in time along the therapeutic course the participants died. They maybe made that information disappear.\n\nI think that we had a problem of excess mortality in this trial due to completely stupid very high dosages of hydroxychloroquine. And when a French journalist asked the professor at, I think, Oxford University, whose name I don’t remember [Martin Landray], who was in charge of the trial, “Why did you use this very high and toxic dosage of hydroxychloroquine?”, he replied, “Oh, yes, it’s the usual dosage to treat amoebic dysentery.” I was so amazed, because hydroxychloroquine is not the [usual] treatment for amoebic dysentery.\n\nSo this guy was probably an epidemiologist—I don’t exactly know his CV [N.B.: Landray is indeed an epidemiologist]—but I saw that he didn’t understand anything about infectious diseases, about anti-infection drugs, and [yet] he was the leader of an international trial. International, because French scientists also participated in that trial.\n\nSo, for me, it was something so terrible. I couldn’t imagine that experts could do this kind of trial, and I couldn’t imagine that ethics committees could give authorisation for this kind of trial, with dosages which were very dangerous.\n\nMike Robinson: Yes, that was Professor Landray. Just to finish that off, are you concerned that the ivermectin trial that the UK Government has announced may go in the same direction?\n\nChristian Perronne: Ivermectin is a very good product but it’s not been proven [to the satisfaction of the WHO] that ivermectin works. [For hydroxychloroquine,] we have had many published studies, including randomised studies—because very often last year, when experts said hydroxychloroquine worked very well, there were randomised studies in China showing that it worked well, but after that, the studies by Didier Raoult in Marseilles were not randomised; they were open evaluations. So yes, [ivermectin] works very well, but it’s not been proven: there was no placebo, and it was not randomised.\n\nBut I agree that when you have over 80%, sometimes 90% success, you don’t need a placebo. That’s a completely stupid idea. Even the WHO published recommendations several years ago that it’s not necessary to have a placebo [test] in a crisis situation when you have non-toxic drugs that work. It’s a completely stupid idea [that placebo tests are essential], coming from scientists who are not scientists any more. They are charlatans, I don’t know what.\n\nSo for hydroxychloroquine, I agree, but unfortunately there are not many randomised studies. But for ivermectin, there were randomised studies, and now it’s been proven. And in India now, it’s spectacular. In the Indian states where they widely used ivermectin, the success was huge, and in the states of India where they didn’t use ivermectin but they were inoculating with this so-called “vaccine”, it was a catastrophe.\n\nIf you look at the world news, there’s a woman [Dr Soumya Swaminathan, as reported by UK Column News from 1hr17' on 30 June 2021] who was at a high level in the WHO [Chief Scientist] who’s Indian, and now she’s on trial [UK Column note: has been indicted] in India because she said that ivermectin was not useful and was toxic and so on.\n\nTo think that ivermectin is toxic is completely stupid: hundreds of millions, maybe billions of people in the world have taken ivermectin for [parasitic] diseases, for [lymphatic] filariasis and so on. So it’s a very well-known product. No, it works; it’s completely proven.\n\nBut the problem with all the drug [regulatory] agencies in the world—the FDA in the United States, the European Medical Agency, the French drug agency—they all say “No, hydroxychloroquine doesn’t work; azithromycin doesn’t work; ivermectin doesn’t work,” despite many, many published proofs that they work. Because if they acknowledge that they do work, it’s impossible for them to market their so-called “vaccines”. That’s the only reason; it’s a marketing reason.\n\nFor me, it’s terrible, and I think all these people one day should have to give account for why they took these decisions, which are completely against any ethical basis.\n\nAnne-Marie Yim: I totally agree. Professor Perronne was talking about Professor Didier Raoult from the Marseilles hospital. He’s the first infectious diseases specialist to have healed people [of Covid-19] in France with a protocol of hydroxychloroquine, azithromycin, and—later on—zinc. But at first, there was a big controversy because he had been healing people without randomised, blind tests [as a basis].\n\nThat’s [the requirement for] a protocol that has been made by pharmaceutical laboratories when they have a candidate drug in their pipeline: they test it on animals first, and then, if it works, it goes to Phase I, and then they can progress it to Phases II, III and IV, before they get AMM [autorisation de mise sur le marché: authorisation to market the drug].\n\nThe thing is, when it’s being tested, they give it to physicians, and the physician first chooses a population of about fifty people, and then a hundred, and then 3,000, and so on. Half of them get a placebo (so only a physiological serum) and the other half get the active agent, the drug.\n\nAnd then they compare [to see] whether there is a result or not. And that’s what “randomised, blind trials” means: “blind” because the physician doesn’t know which patients get the placebo and which group of patients get the real drug.\n\nSo the reason why it was so controversial was because Professor Raoult had done his study with, I think, only twenty people or fewer, and he didn’t do the placebo test, meaning that he treated all his patients with hydroxychloroquine and azithromycin—and he got 100% recovery. They said, “Your trial is not valid because you didn’t have a control group” (meaning the placebo group). “You should have given twenty other people the physiological serum.” And he said, “When I have people who are sick and dying, I don’t play with their lives. I had a duty to treat them. That’s why I didn’t do a placebo test.”\n\nAnd all the physicians backed him up, especially the Chinese community and the African community [in France] training for Ph.D. (he was born in Senegal, so he has a strong connection with physicians and researchers in Africa). They were all behind him. They said, “Who cares about a placebo test? It is valid!”\n\nAnd then he redid a trial with 3,000 people, because they had said, “Your results are not valid because you didn’t have a placebo control group and the cohort—meaning the [number of] people tested—was too small to be significant; you should do it on 3,000 people at least; that’s when you [can] move on to Phase II.” All those protocols have been established by the pharmaceutical laboratories [for] when they are seeking authorisation by the health agencies to market the drug.\n\nMike Robinson: It’s a bit ironic, then, that the vaccine manufacturers have all gotten rid of their placebo groups, by giving their groups the vaccine!\n\nAnne-Marie Yim: Yes, they were always testing their drugs with placebos. They choose men, women, a spread of ages, so that they have a [representative] group, and they look at whether [participants] have only Covid, or whether they have Covid with co-morbidities—meaning, for example, a weak heart or Type II diabetes. So they very much do look at people [for participation in trials]: their sex, age, whether they have any diseases, whether they [just] have Covid or whether they have Covid plus anything else. And then they will split the group in two, to have the same [spread of] people in each group.\n\nFor instance, if they have a woman in her thirties [in the active-drug group], they should have a woman in her thirties [in the placebo group], and so on: with Covid, or with Covid and diabetes, or with Covid and heart failure, or without Covid, [all matched]. And they keep these two populations the same between the group that receives the placebo and the group that receives the drug—in this case, ivermectin.\n\nChristian Perronne: For me, the great scandal [is that] all these experts said it’s not normal that some studies had no randomised control group and so on, but [actually,] in France, the government sponsored two big trials: a DisCoVeRy trial which was called “international”, “European”, but [in which] in fact there were only a few people included outside France; and [secondly] the iCovid [as heard] study.\n\nAnd there was a study comparing different strategies: Remdesivir, Retrovir (which is an anti-inflammatory HIV drug), and I can’t remember all the branches of the study, all the groups. There was also a hydroxychloroquine group, and the iCovid study included [a group treated with] hydroxychloroquine plus azithromycin.\n\nWhen the fraudulent study was published in The Lancet, they said that hydroxychloroquine was “dangerous” or “not effective”. Two days later, the Minister of Health forbade continuation of the hydroxychloroquine groups in the randomised official trials [in France]. It was stopped immediately.\n\nBut in fact, some slides from the intermediate analysis of these two studies leaked out on the Internet, and we could see clearly that when the Minister said “Stop hydroxychloroquine!”, the only group that had an efficiency of less death was the group using either hydroxychloroquine in the DisCoVeRy study, or hydroxychloroquine plus azithromycin in the iCovid study.\n\nIt was not yet statistically significant, because from DisCoVeRy, it was planned to have 1,500 patients [treated with that protocol] but in fact they had only three thousand [presumably Professor Perronne meant to say 'three hundred'], and for iCovid it was the same.\n\nSo it was not completely significant, but when you look at the curves, it was spectactular: [deaths] with hydroxychloroquine were much lower.\n\nAnd then, the experts responsible for these studies didn’t show these slides—of course, I got the slides another way. They said, “Oh, no, hydroxychloroquine is finished!” But in fact, that was not [seen] at all in our studies, but it was a great public lie coming from scientific experts.\n\nAnd unfortunately, two weeks later it [became apparent that] the Lancet study was fraudulent, but the minister never changed his policy; he continued to ban hydroxychloroquine. And now, we have people saying that I’m not a scientific guy. They are unscientific. They are the charlatans. They don’t rely on good science.\n\nAnd I’m deeply shocked at all these so-called “experts” who are advisers to our authorities, who are on the TV every day, and most of them have huge conflicts of interest with pharmaceutical companies that make Remdesivir, that also make the “vaccine” and so on. It’s a great scandal.\n\nI think that all these guys in the media should be fired, if we are to follow French law, and also [those] in other European countries should be fired from the official committees. They should not be advisors any more.\n\nThey should not be chairmen of groups. I was Chairman of the High Council on Public Health for Infectious Diseases for fifteen years, so I know all about that; I know the whole system. For me, it’s a great scandal.\n\nAnne-Marie Yim: Yes, it’s corruption, it’s corruption. Basically, they are lying, and they are discarding good scientific people like Professor Perronne or Professor Raoult, and trying to discredit them publicly. And we know that Remdesivir enhances the inflammatory process and does not work at all compared to hydroxychloroquine.\n\nSo they are trying to block studies, as Professor Perronne says; trying to lie to the general public, saying that hydroxychloroquine does not work and Remdesivir does work. It’s the same with ivermectin: they’re trying to conduct these studies, but then they are cheating in the results.\n\nIt is shameful. It’s a scandal. Scientifically, it’s a fraud, and politically, it’s a crime. The Indian Bar Association are right now suing the Chief Scientist of the [WHO in India] for all the policy going on, which has resulted worldwide in more than three million deaths.\n\nBrian Gerrish: I think we would absolutely agree: we’re looking at charlatans. We’re looking at politicians, and also members of health organisations, who say they are there to protect the public, but the reality is they’re not protecting the public; they’re allowing the public to be harmed as a result of these so-called “vaccinations”.\n\nCould I come back to Professor Perronne again, and ask for his opinion on the vaccine adverse reactions? We’ve now collected considerable data about the adverse reactions, and here in the UK, the figures that are collected by the regulatory authority, the MHRA, are now at over one million adverse effects recorded, and deaths are at about 1,400, so this is significant damage.\n\nProfessor Perronne, what is your view of the adverse effects that are being recorded at the moment?\n\nChristian Perronne: In the past, with other, real vaccines, there were some crises, problems with some side effects; but neither for myself nor among friends and family have I ever seen such severe side effects. I even know of two deaths around me: the mother of a friend, and a guy who was the cousin of another friend, who died from the “vaccine”.\n\nSpeaking personally as a French citizen, I see around me cases of death, cases of paralysis. One woman, a neighbour who was vaccinated, several days afterwards developed malignant arterial hypertension; she had never had hypertension [high blood pressure] her whole life. Several thromboses, partial paralysis, arthralgic [joint pain] problems—around me, I have seen many cases.\n\nI think that the databases [of adverse effects] in some countries are not accurate, because in these cases that I could see, I know that the general practitioners [family doctors] did not want to report the death or the side effect to the authorities, saying, “No, it’s just a coincidence!”\n\nSo, many, many side effects are not being reported. If there is a stroke, they say, “Oh no, it’s not the vaccine; it’s [just] a stroke; this person was old, so it’s normal to have a stroke.”\n\nBecause I speak with my patients (I have some patients who are high-level directors of companies), I know—they tell me—that the physicians in the big companies where many employees were “vaccinated” (I don’t like using this term “vaccinated”) [saw that they] had problems, but the occupational health doctors didn’t want to report the cases to the French authority. So it’s not being connected with the “vaccine”; it’s [being put down as] “coincidence”.\n\nIf we compare the French database with the Dutch database, with the same proportion of patients vaccinated [in both populations], the rate of reporting is much lower in France [as reported by UK Column News from 22:50 on 30 June 2021]. That’s not normal! But if we then look at the European level, we see that there are huge numbers of deaths and serious side effects.\n\nWe know—it’s officially acknowledged by the CDC, the Centers for Disease Control in the United States—that many young people who are “vaccinated” (let’s say “inoculated”) have had heart problems: myocarditis, inflammation of the cardiac muscle, or pericarditis, inflammation of the envelope around the heart. So that’s official; it’s reported worldwide.\n\nAnd if we look at the comparison of the rate of mortality in others, we find that in vaccinated children, it could be close. As we know, children don’t develop the disease [Covid-19] at a high rate, and very few children have had severe cases, and the rate of [Covid] death in children is near zero. We now know that the risk of death and of severe problems is much higher if you are vaccinated than not vaccinated [as a child].\n\nAnd now, we see in some countries that most of the problems, of the cases, are coming from vaccinated people, who are transmitting the disease. And of course, this is not official language, but in France, the government lies: they say, “Although we have seen some cases, it is the fault of the unvaccinated for contaminating the vaccinated.”\n\nI’m a Fellow of the Louis Pasteur Institute; I’ve worked in the field of vaccination for years and years. This is the first time in my life that I’ve heard from companies, from the manufacturers, from the ministers, from the WHO [such talk]: “It’s a very good vaccine—but we have to tell you that if you are vaccinated, you can get the disease anyway! And we’re not sure, but it may slow the transmission.”\n\nThis is not normal. If you are vaccinated with an efficient vaccine, you are protected. You should not have to wear a mask any more; you should have a normal life. But in fact, in many countries, they say, “Oh, you’ve been vaccinated, but you’re not really protected.” And now they say to the vaccinated—who are supposed to be protected, who should have confidence!—“Oh, the unvaccinated will contaminate you!”\n\nNow, as regards the “health passport”: you know that they published [this proposal] five weeks ago in Israel, and they were close to civil war in Israel. They were fighting inside families. The “vaccine” was mandatory for physicians, for students. And now, they’ve stopped that [requirement].\n\nIn France now, President Macron will speak tomorrow evening [12 July], and is expected to say [as he duly did] that vaccination will be mandatory for health care workers, health providers and to participate in some [aspects of] public life. I think this is a great scandal, and I think there will be a civil war if we go this way.\n\nBrian Gerrish: Anne-Marie, could I ask you the same question about vaccine adverse reactions? We are seeing the figures collected here in the UK; we know that the MHRA says [that] perhaps only 10% of the most serious reactions are [ever] recorded, and the MHRA also says that perhaps only 2% to 4% of the more minor adverse reactions are recorded.\n\nSo there is gross under-recording of the serious reactions, and yet the public is constantly told that they’re safe. What do you think is the main reason for such a huge increase in adverse reactions from the “vaccine”?\n\nAnne-Marie Yim: As you say, the official numbers of deaths from “vaccinations” are around 15,000 [across Europe]. It was 14,000 but it’s been increasing, and we now officially have 15,000 deaths [registered in] the Pharmacovigilance Network [Eudravigilance]. And indeed, it is under-reported. People are saying 10%; in France, sometimes even 5%. So you should multiply this number by [up to] a hundred, yes.\n\nFirst, why under-reported? Because it should be done by a medical doctor: for example, when you have a vaccination and you experience adverse reactions, you should go and see a physician, your MD, and you should tell him, and then he is supposed to file a form online, and it takes fifteen minutes, and it goes to a network.\n\nFor example, in Luxembourg, we need to send it to the group in Nancy [eastern France], because we work with the [French] Région du Grand Est. That’s the reason why the numbers are lower [than reality], are being under-reported: whether the CDC or VAERS, all those official sites are reporting blood clots with AstraZeneca, and with Pfizer you have Bell's palsy.\n\nAs Professor Perronne says, you can have myocarditis, especially among the young. That’s what Dr Hervé Seligmann said [Part 1 | Part 2 of UK Column interview]: in Israel, they have seen young people getting myocarditis, especially men under 45. As Professor Perronne says, there is a correlation [between age and Covid vaccine mortality]: a lot of old people are dying and not young people.\n\nWhy? Because [the young] have a high level of glutathione, and so they are not dying; they’re protected, compared with the oxidative stress induced by the vaccination [in the elderly].\n\nI want to emphasise that although I know we’re not talking about treatments, it’s very important [to point out] that people who have intravenous glutathione injections recover very well, because this liberates [them from] the oxidative stress-induced effects.\n\nThe secondary adverse [reactions] are basically cytokine storm, which leads to organ failure. And it can be the heart, the brain, the lung or the kidney. You can have the process [in any of those organs]. The pulmonary disease progresses very rapidly, and when it develops to a certain stage, you have this inflammation process and these clots that then go everywhere, into your organs.\n\nIf they go into your brain, you have [a thrombosis]; if it goes into your heart, of course, and you have all this inflammation process, this leaking of the water into the organ, then the organ [the heart] stops functioning.\n\nBasically, you’re being shut down; your vital functions are being shut down. And it can be very abrupt and very brutal, and it can all happen in 24 hours.\n\nAnd now, people have been discovering that there’s this graphene oxide: a Spanish team has been reporting this graphene oxide [entering] the brain, that is also causing Guillain-Barré syndrome, and that is eating up the myelin, [the coating] on the nerves.\n\nPeople have also been reporting allergic reactions, like anaphylactic shock, and also sometimes bleeding from the skin.\n\nThese are very severe adverse reactions, and yet the media keep telling us, “The vaccine is safe, is efficient, and the benefits greatly outweigh the risks, so we should keep on vaccinating people”!\n\nI think this is all propaganda. The reality is, the vaccine doesn’t work. It kills in 42% of these cases, but if you bring that into a randomised population, that means it kills all the time, it kills 100% of the time. So basically, it triggers the ageing process and cancer, and this is only the beginning. I think this is [just] the beginning of what we are going to see.\n\nThey are lying to us. They say it’s safe; no, it’s not safe, it kills people. It does kill people. It does not protect against the variants; it does not protect against the transmissibility; it does not protect against the disease.\n\nSo why are we having it? People who are taking the “vaccine” say, “Oh, it’s because I want to travel. I want to go on vacation. I want to go to school. I want to be able to take my exam. I want to be able to go to the restaurant. I want to be able to have a normal life.” That’s basically what people are saying.\n\nOne of the main [phenomena] being reported is the magnetic test at the site of vaccination: it sticks. People have been measuring these, and there’s an electromagnetic field that is engineered.\n\nPeople have been digging into this and have found that there’s a lipid nanoparticle that is being manufactured by this company called Aqua Therapeutics, who are providing [it to] Pfizer/BioNTech [and] Moderna.\n\nThey [the lipid nanoparticles used to deliver Covid-19 vaccines] have three components: basically, first, phospholipids (a fat), cholesterol and polyethylene glycol (PEG200)—but it also contains a ferric oxide pegylation [polymer attachment] of graphene oxide which is inserted into the phospholipid layer.\n\nAnd that goes into your brain. It can cross the blood-brain barrier. Normally, it shouldn’t, but it can go and pass into your brain.\n\nAnd there is also this graphene oxide. Basically, everything about this injection is poisonous: not just this messenger RNA and these spike proteins, which cause inflammations and which can be integrated into [your] DNA, but also the graphene oxide. So clearly, from every point of view, this is a poison.\n\nBrian Gerrish: Thank you very much for taking us through what is a very difficult subject for a lot of people to hear about, but we have to be realistic about the concerns over what’s happening.\n\nI’d like to come back to Professor Perronne. Just one last question, as you’ve covered a lot of ground. Professor, I’d like to ask you: if you were in control at the moment, if you held power in France, what would you do to solve the situation that you see?\n\nChristian Perronne: First of all, I would stop the so-called “vaccination” campaign. I would promote, among general practitioners, early treatment with ivermectin, zinc, Vitamin C and Doxycycline or azithromycin.\n\nAlso, I would encourage the strict isolation of symptomatic patients, because that’s the way to control the transmission: just two weeks of isolation is enough, during the contagious period of symptomatic people, but strictly isolated, with a mask if needed and so on. Treat them very early. And if you do that, it rapidly ends [transmission].\n\nI’m in favour of strict isolation of symptomatic patients, but the lockdowns which were embedded in many, many countries in the world are completely stupid. You don’t stop an epidemic with a lockdown, with masks in the street! That was shown in Denmark, with randomised studies with people wearing and not wearing masks. The mask is not efficient.\n\nSo I would immediately re-establish all civil liberties, because now, France is no longer a democracy; it’s like a dictatorship, with only five or six people around the table now able to bypass Parliament and say “vaccination is mandatory” and so on.\n\nSo re-establish liberty; re-establish democracy; stop these useless so-called “vaccination” campaigns for a disease with a very, very low mortality rate; and immediately treat patients without [waiting for centralised] confirmation.\n\nAnd also, stop PCR testing of the asymptomatic general population. It’s completely anti-scientific. The people who developed the PCR test never, never did PCR tests of asymptomatic patients at large scale, because you get a huge rate of false positives.\n\nSo it’s very simple: you isolate the cases, you treat them, and it’s over.\n\nBrian Gerrish: Thank you very much indeed, Professor.\n\nAnd, Anne-Marie, what would you say to your scientific colleagues who at the moment don’t seem to see the dangers that you see?\n\nAnne-Marie Yim: I think they do all see it, but they are scared.\n\nThere are two types of scientists: those who [engage in] bribery and who are corrupted, with Dr Fauci and all the others, with Bill Gates and all of those people. They are in the cockpit right now.\n\nGood professors, like Professor Perronne and Professor Raoult, or Dr Ochs, are being sued and taken to tribunals by the [profession] of medicine itself. The Medical Council is suing French doctors, and it’s the same in France, in Canada, in Luxembourg; we see the same pattern everywhere. It’s a pattern that we are seeing here.\n\nYou know, we have to have the courage to go to these people and say, “You are corrupted. All the policies that you are imposing are nonsense. It’s not scientifically-based; it’s not legally-based. You are trying to take away our liberties. You are putting social pressure on us: if you don’t get vaccinated, you will lose your job. And if you want to travel, you need the vaccine. This is blackmail.”\n\nAll the scientists should have the courage to say, “Enough is enough.” Not only scientists; lawyers too. They all know the truth. Everybody knows the truth; it’s just a matter of whether we fight or not fight. Do we conform to society, to the system, or don’t we? And I think that our thirst for liberty and freedom should overcome our fear, and we should just say, “Stop. Stop this vaccination campaign. Stop it, and stop it now.”\n\nBrian Gerrish: Thank you very much for joining us. It’s been really fantastic to hear the information that you’ve put across on this very important subject.\n\nWe hope that by broadcasting this material, other people will start to wake up to the dangers of the “vaccine” programme.\n\nSo, Professor Perronne and Anne-Marie Yim, we hope very much that your information will help many people in our audience and further afield to understand what is happening, and to become part of putting a stop to it.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/frances-long-time-vaccine-policy-chief-covid-policy-is-completely-stupid-and-unethical", "title": "France's long-time vaccine policy chief: Covid policy is \"completely stupid\" and \"unethical\"", "description": "The professor of infectious diseases who wrote France's pre-Covid vaccination policy accuses the \"unethical\" pharmaceutical protégés who have supplanted him of deliberately discrediting Covid-19 treatments so that they can \"market their so-called vaccines\", and calls for them to be held accountable.", "image": "https://www.ukcolumn.org/sites/default/files/2021-08/Prof%20C%20Peronne%20Intro%20Image%2012Aug21%20Fin.001.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://la-verite-vaincra.nohost.me/display/a035a612-1561-1dd1-65da-c8a643531646", "http://le-blog-sam-la-touch.over-blog.com/video-l-ancien-chef-de-la-politique-vaccinale-francaise-declare-que-la-politique-sanitaire-concernant-la-covid-est-completement-stupide-et-c", "https://tkp.at/2021/08/17/franzoesischer-impfexperte-professor-christian-perronne-zum-thema-covid-19-impfstoffe/", "https://trikooba.com/destacado-experto-en-vacunas-frances-afirma-que-las-personas-vacunadas-corren-el-riesgo-de-las-nuevas-variantes-y-deben-ser-puestas-en-cuarentena/", "https://www.detoxed.info/dr-christian-perronne-esperto-francese-di-malattie-infettive-i-vaccinati-sono-a-rischio-con-le-varianti-e-sono-pericolosi-per-gli-altri/", "https://avoin.media/2021/08/19/rokotteilla-luotiin-riskiryhma-ranskan-rokoteohjelmaa-johtanut-christian-perronne/", "https://dimpenews.com/2021/08/20/%ce%bc%ce%b5%ce%b3%ce%ac%ce%bb%ce%b7-%ce%bd%ce%af%ce%ba%ce%b7-%cf%83%cf%84%ce%bf-%ce%b9%cf%83%cf%81%ce%b1%ce%ae%ce%bb-%cf%84%ce%bf-%ce%b5%ce%bc%ce%b2%cf%8c%ce%bb%ce%b9%ce%bf-%cf%83%cf%84%ce%b1%ce%bc/", "https://twitter.com/tcvatandasi16/status/1429084273533927427", "https://twitter.com/seigi15/status/1429305340827291657", "https://www.frontnieuws.com/gevaccineerde-mensen-lopen-risicos-voor-de-nieuwe-varianten-gevaccineerde-mensen-zijn-gevaarlijk-voor-anderen-moeten-geisoleerd-worden-van-de-samenleving-professor-christ/", "https://theconversation.com/profiles/christian-perronne-775874", "https://www.hcsp.fr/explore.cgi/personne?clef=2222", "https://www.lemonde.fr/m-le-mag/article/2020/11/18/qui-est-vraiment-christian-perronne-medecin-referent-des-complotistes_6060208_4500055.html", "https://www.agoravox.fr/actualites/sante/article/crise-sanitaire-lettre-ouverte-du-229193", "https://brandnewtube.com/watch/are-people-dying-misdiagnosed-r-bryan-ardis-dr-reiner-fuellmich-and-dr-wolfgang-wodarg_BSqeH7nhg8I41rM.html", "https://www.ukcolumn.org/article/covid-19--everything-and-nothing", "https://www.youtube.com/watch?v=SkOL3YLK61M", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(20)30322-4/fulltext#%20", "https://www.youtube.com/watch?v=jO9yCq7Hmro", "https://www.nature.com/articles/d41586-021-01442-9", "https://childrenshealthdefense.eu/aiovg_videos/an-urgent-message-from-professor-sucharit-bhakdi-covid-vaccine-a-lethal-danger/", "https://www1.racgp.org.au/newsgp/clinical/we-need-reliable-serological-tests-to-track-corona", "https://www.youtube.com/watch?v=vrjmY_ffgAg", "https://www.luxtimes.lu/en/luxembourg/pandemic-board-suspends-medical-doctor-for-airing-covid-doubts-60ef116cde135b923601a5b5", "https://thestarphoenix.com/news/local-news/saskatoon-surgery-professor-suspended-terminated-from-key-roles", "https://www.youtube.com/watch?v=qPjcxsGNYD4", "https://ashpublications.org/blood/article/128/6/753/35780/The-role-of-leukocytes-in-thrombosis", "https://www.sciencedirect.com/science/article/pii/S0006497120342567", "https://www.recoverytrial.net/", "https://www.ukcolumn.org/article/the-hydroxychloroquine-scandal", "https://twitter.com/raoult_didier/status/1272878389305774080/", "https://www.ema.europa.eu/en/news/covid-19-reminder-risks-chloroquine-hydroxychloroquine", "https://www.ndph.ox.ac.uk/team/martin-landray", "https://www.recoverytrial.net/news/statement-from-the-chief-investigators-of-the-randomised-evaluation-of-covid-19-therapy-recovery-trial-on-hydroxychloroquine-5-june-2020-no-clinical-benefit-from-use-of-hydroxychloroquine-in-hospitalised-patients-with-covid-19", "https://twitter.com/JamesTodaroMD/status/1274039753109880833", "https://pubmed.ncbi.nlm.nih.gov/13738658/", "https://patient.info/travel-and-vaccinations/travellers-diarrhoea-leaflet/amoebiasis", "https://www.ukcolumn.org/ukcolumn-news/uk-column-news-30th-june-2021", "https://indianbarassociation.in/wp-content/uploads/2021/06/LEGAL-NOTICE-FOR-CONTEMPT_JUNE-13-2021.pdf", "https://theprint.in/india/bar-association-serves-legal-notice-to-who-chief-scientist-over-ivermectin-guidelines/676672/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7507250/", "https://clinicaltrials.gov/ct2/show/NCT04315948", "https://www.thelancet.com/journals/lanrhe/article/PIIS2665-9913(21)00030-8/fulltext", "https://www.thelancet.com/journals/lanrhe/article/PIIS2665-9913(20)30378-7/fulltext", "https://brandnewtube.com/watch/are-people-dying-misdiagnosed-r-bryan-ardis-dr-reiner-fuellmich-and-dr-wolfgang-wodarg_BSqeH7nhg8I41rM.html", "https://www.nextbigfuture.com/2021/06/india-could-sentence-who-chief-scientist-to-death-for-misleading-over-ivermectin-and-killing-indians.html", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/ukcolumn-news/uk-column-news-30th-june-2021", "https://www.newstatesman.com/world/europe/2021/07/why-emmanuel-macron-gambling-vaccine-passports-france", "https://www.ukcolumn.org/article/greater-manchester-vaccination-centre-and-mhras-yellow-card-adr-scam-part-1", "https://www.adrreports.eu/en/eudravigilance.html", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-1-international-scientific-experts-discuss-covid-19-and-vaccines", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-2-international-scientific-experts-discuss-covid-19-vaccine", "https://www.laquintacolumna.net/", "https://acuitastx.com/technology/lipid-nanoparticles/", "https://research.thea.ie/bitstream/handle/20.500.12065/3045/Cytotoxicity%20review%20priyanka2018.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6215243/", "https://carterheavyindustries.files.wordpress.com/2021/02/effectiveness-of-adding-a-mask-recommendation-to-other-public-health-measures-to-prevent-sars-cov-2-infection-in-danish-mask-wearers-nov-2020.pdf"], "authors": [], "publish_date": "2021-08-12T11:24:19+01:00"}