{"result_id": "323024", "URL": "https://www.ukcolumn.org/video/ukc-interview-vaccine-adverse-reactions-a-letter-to-my-mp", "timestamp": "2023-04-25 17:46:33 CEST+0200", "meta": {"description": "Brian Gerrish interviews the producer of the documentary on adverse Covid jab reactions, UK CV Family: A Letter To My MP.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/ukc-interview-vaccine-adverse-reactions-a-letter-to-my-mp", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "UKC Interview: Vaccine Adverse Reactions — A Letter To My MP", "cleaned_text": "Brian Gerrish interviews James Freeman, director and co-producer of the documentary film UK CV Family: A Letter To My MP.\n\nBrian and James are joined by Dr Christian Buckland, doctor of psychology in psychotherapy and counselling, who provided professional commentary and support.\n\nUK CV Family: A Letter To My MP can be viewed on:\n\n\n\n The interview commences with an extract from the documentary.\n\n\n\n00:27 Sir Christopher Chope in the House of Commons:\n\n00:38 TEXT: This film is not about COVID-19 or the COVID-19 vaccines. It’s about people who did what they were told was the right thing.\n\nA clip is shown of Boris Johnson saying he had just had the vaccine and “did not feel a thing”. He urges people to “get their vaccination” and to “get it when you’re asked to do so”, adding that “It’s good for you, it’s good for your family, and it’s a great thing for the whole country.”\n\n The then Health Secretary, Sajid Javid, speaks to viewers, saying, “Please, please, please get out there and get the jab.” The then Communities Secretary, Michael Gove, adds: “If you can be vaccinated, and you refuse to, that’s a selfish act, putting other people’s lives and health at risk.”\n\n1.25 TEXT: But many people were injured, and now they are being ignored.\n\n01:39 Brian Gerrish: I’m delighted to be talking about a film which is available on Odysee. The film is A Letter To My MP (2022). Today, I’m going to be joined by the director and co-producer, James Wells [Freeman]. I’m also going to be joined by the psychotherapist, Dr Christian Buckland, who participated in the film.\n\nThe film is about people who have suffered damage from vaccines. Their story is put across in a very measured way. The aim, and I’ll be learning more about the aim of the film, is to educate people in the UK about what these people have suffered, and how difficult it’s been for them to actually get their message across.\n\nI’d like to start off by welcoming James Wells [Freeman]. Thank you very much for joining us today. I understand that you’re actually a Plymouth boy yourself, so you’re coming home today, I think.\n\n02:55 James Freeman: I am, yes. I lived in Milehouse, went to school in Southway Comprehensive, so yes, I spent quite a few years in Plymouth. Plymouth Sound—I used to go out fishing there on a boat with my dad. So I have very fond memories of Plymouth.\n\n03:12 Brian Gerrish: Our studio background is part of the view out over the Sound towards Drake's Island. No doubt you’ll have been fishing in some of the spots around there. Let’s bring Dr Christian Buckland on screen. Christian, we’ve spoken before. Thank you for participating, and thank you for your original work in helping with the film itself.\n\n03:47 Dr Buckland: Thank you very much for being interested in it. You’ve been one of the most outspoken people about vaccine damage, so I’m really grateful that you’ve been helping to get the message out. Thank you.\n\n04:00 Brian Gerrish: We’ve been trying. One of the things we’re going to be talking about is how difficult it is to get the message out. Let’s come back to you James. The floor is yours. The aim is for UK Column is to be assisting in getting that message out. You were director of the film A Letter To My MP. Tell us how this film came about. How did you get involved with people who’ve suffered vaccine adverse reactions?\n\n04:35 James Freeman: First of all, thank you for having me on the show to talk about this really really important topic. I’ve been involved in the background and on social media over the last couple of years trying to fight for our freedoms, against a lot of the restrictions, particularly vaccine passports. So I’ve built up a network of people doing the same thing. One of those people I’ve been working with this year is Dr Tess Lawrie, who heads EbMCsquared. She’s also a director at the World Council for Health.\n\nI’ve actually interviewed Tess, and I published an hour-long interview back in February; so I was already in touch with Tess. It was around March when Tess invited me to a meeting with the leaders of a vaccine support group. It’s run by people that are vaccine-injured, for people that are vaccine-injured, so nobody else is allowed to join the support group.\n\nI didn’t know what to expect. I was already aware that there was probably an issue with the vaccines, and they are not as safe as we’ve been told. But, as I said, I didn’t know what to expect, so I went along to the Zoom meeting. I was quite shocked to hear about the numbers involved; the number of people in the group and some of the stories they were telling.\n\nParticularly, I think, one of the things that really hit me initially with hearing about their experiences, was the fact that on social media—and this is not just in the UK; this is globally—a lot of these support groups keep on getting shut down by Facebook and other social media platforms for \"spreading misinformation\", which is actually not true, because these are closed groups, so they’re support groups, and they’re set up particularly for that. They don’t talk about politics and all the other stuff. Clearly, they’re talking about their injuries they’ve had from the vaccines. And they keep on getting shut down.\n\nI thought, that is just so terrible, because when you understand how lonely a place it is when you’re vaccine-injured, then when you find some support [and] that is shut down, that’s a really difficult thing to understand. I say it’s a lonely place, and that’s because, first of all just getting acknowledgment that it was to do with the vaccine is really difficult. You’d think it would be quite easy. You go into the doctors, you’ve had a vaccine, and then a couple of days later this happened. But quite often, doctors are reluctant to associate the injuries with the vaccine. That’s not all doctors, but there’s an awful lot of doctors out there that are gaslighting the vaccine-injured people.\n\nThen, of course, what do you do? Well, you go online, because the first thing you want to do is try and find out what’s happening to you if you’re not getting any acknowledgment of it. Then they were being shut down online. I just thought that was really really terrible. I’d listened to their stories, and I just thought; I’ve got to try and do something to raise awareness of this.\n\nObviously, I was aware of Sir Christopher Chope. He’s got a Vaccine Damage Bill that he’s trying to get through Parliament, with two aims. The first issue is to hold an independent public inquiry to try to find out how widespread this is, because we just don’t know, although there are a few clues, which I’ll talk about in a minute. And then the second part of it is, for people that weren’t acknowledged they’ve been damaged by the vaccines—some people have actually been killed by the vaccines—[to ensure that] they actually get a decent payout, because at the moment the maximum payout in the UK is £120,000, which hasn’t increased with inflation. It was set up in 2007, so even if it had just increased with inflation it should be around £180,000 now.\n\nBut if you’ve been killed, for your family as compensation, that’s a pittance, particularly if you’ve been injured and disabled, as many people have, and you can never work again. Well £120,000 is just not going to cut it. So I wanted to raise awareness of this, because I do think that if the general public understood how many people have been injured and the situation they’re in, they would want to help.\n\nThat was the main aim of the film: to try to raise awareness and get help for these people who’ve been injured.\n\n09:45 Brian Gerrish: That was a very comprehensive run-through. How soon into the vaccine programme did people start to suffer adverse reactions to such an extent that they were starting to post things on social media? My second question is: as a result of your interaction with those people, when did you actually start working on the film?\n\n10:21 James Freeman: In terms of injuries, that started to happen on day one. In the early days, the censorship online was a lot stricter that it is now. Even now, people are still getting banned from Facebook and Twitter, and shadowbanned, and all the other techniques they use for talking about this. [But] certainly, in the early days, if you talked about vaccine injuries, you would just be banned straight out. So I think it started happening from day one, but the message wasn’t getting out. In terms of when I started the film, it was literally the next day after having the meeting [that] I thought, \"I’ve got to do something.\"\n\nSo I called the leaders of the support group UK CV Family and I said that I was interested in making a film—which is a little bit bonkers, really, because I’ve never made a documentary and I’m not a professional cameraman. I’ve done a few interviews, so I’m fairly technology-literate, but that’s about it.\n\nThey were really keen on the idea, so the first thing I did after that was call somebody who had made a documentary dealing with vulnerable people, to get some advice on how to go about it, to make sure I go about it in the right way, and that I don’t make it a bad experience for people or make their situation worse.\n\nThat call scared the life out of me, because I was given examples of things that have gone wrong in other documentaries, where they’ve agreed to film people and they’ve actually gone on and filmed them, and then, for whatever reason, in editorial it’s been decided that they’re not going to use the content. The impact that has on people is huge, because if you’re in that situation and you’re vulnerable anyway, you can’t treat people like that.\n\nSo I had that call to try to learn some of the lessons. I came off that call thinking, “What have I got myself into here?”. That was when I gave Dr Tess Lawrie a call and said, \"I want to do this documentary, but I cannot just go and do it by myself. I’ve got no experience of doing this. Do you know of a psychologist that would get onboard to support the project?\" And that was when Tess put me in touch with Christian.\n\nSo I called Christian, we had quite a lengthy chat on the phone for about an hour, and we clicked. We were right on the same page in terms of our view of what’s going on and what needed to be done, and that it was a really, really important topic, and really important to raise awareness of this. So Christian agreed to help. He’s been fantastic. He was fantastic throughout the project.\n\nI genuinely believe I couldn’t have done the film without the support of Christian, because the weight and the worry about potentially something going wrong, and making somebody’s situation worse than what it already was, would have been too much to bear. So thank you, Christian, for supporting the film.\n\n14:06 Brian Gerrish: What date was it when you had made the decision to start making the film?\n\n14:18 James Freeman: I think it was back in March, April. It all happened very quickly. I decided to do the film, and within a few weeks we’d already drawn up all the consent forms. We had come up with a process between us: Christian would have a chat with the people that wanted to be part of it, to make sure they understood what doing this would entail and that they fully consented. Within three weeks, I was on road driving across the UK interviewing people: Kent, Birmingham, Swansea, and so on.\n\n15:25 Brian Gerrish: This is about vaccine damage, but we are also talking psychology. UK Column has experienced this in the field of child abuse.\n\nChristian, you came in to offer some advice about how to deal with the people who’d suffered the vaccine adverse reactions. How were you finding them yourself? Were you learning about their experiences at that time, or had you already come to understand something about the extent of the reactions, the damage and the suffering they were causing?\n\n16:46 Dr Buckland: I had noticed online that people were being censored straight away. It was very clear. You’d start to follow people, then realise they’d disappeared for a couple of weeks, and they’d come back and say they had been banned. So I was aware the censorship was there. I don’t think I was aware to the level I am now, until I really got involved with the project.\n\nAs James said, it was a really important conversation that we had at the start, because my initial feeling was, I’m not sure if I want to be part of this, because I want to ensure, if we do it, it has to be that anyone who is involved was put first, over [the interests of] any documentary—because of exactly what you’re saying: they have already been rejected, they’ve been physically harmed.\n\nThe most important thing for me here was not to psychologically harm them as well, because they’re already being that by being censored. It was actually a really nice conversation to have with James, to understand that the whole remit was to simply raise awareness that these people have been injured and they need some help. So that was my introduction into it.\n\nI’ve done psychological screening for TV production companies in the past, so we knew what we could do. What I wasn’t aware of was the level of censorship and the amount of harm that had been caused to them.\n\n18:46 Brian Gerrish: I noticed, when I watched the film, that all of them—if my memory is correct, all of them—were close to tears at one point. The effect on them was very clear. [With] the trauma they’d been through, it was very clear they’d been greatly effected. So I can understand the need for your input.\n\nLet’s talk about the types of thing that these individuals are describing, because many people think, \"Well, vaccine adverse reactions, we’ve heard a bit about that, what the Government says or what the NHS is talking about, maybe some side effects, some aches and pains, feeling a bit under the weather, maybe even feeling a little bit flu-like.\" Those have been the generic descriptions by the authorities for vaccine adverse reactions.\n\nBut as we’re hearing from the people who have come forward in the documentary, they are talking about really major events. They’re talking about heart palpitations. They’re talking about severe headaches. They’re talking about pains shooting up their legs and having difficulty walking.\n\nSomething that was particularly poignant: I think at least two of them said, \"When we went to bed, because we felt so awful, we weren’t actually sure that we’d wake up.\" These are people who are suffering horrific side effects in a physical sense, but they were also suffering mentally.\n\n20:53 Dr Buckland: Absolutely. It’s not just the injury that’s happened to them; it’s the knock-on effects that have occurred. These aren’t simple everyday headaches or flu-like symptoms, these were life changing events. They were traumatic. The impact on them has been huge; on relationships, friendships, jobs, income and more. All of those things have really big knock-on effects as well.\n\nSo you’ve got the injury that’s happened—which for a lot of people is excruciating pain and extremely debilitating—but then you’ve got the knock-on effect of all the relationship part, the employment part, income and so on—and they’re really huge, because when you put them together, you’ve got a recipe for people being really harmed. I was very concerned about seeing this.\n\nIn my job, I’m used to hearing very difficult stories—that normally doesn’t faze me—but I actually found listening to these stories very upsetting, because there was so little help out there for them. That’s not to say [this applies] for everyone, because some doctors have been amazing. But for a lot of people, they’re getting very little help, if any at all.\n\nA lot of people are not even being acknowledged, and that’s the bit that’s really difficult. So you’re completely right, it’s not just your simple flu-like symptoms, and headaches, and colds, and a sore arm; these are life-changing events. to me, they all have a traumatic component to them.\n\n22:29 Brian Gerrish: One gentleman in the film was describing how it felt and how it had affected him, and he was saying in the film that this was immediately impacting on his wife, because she was completely upset at seeing him suffer and also didn’t know what to say, because they’re caught in a trap.\n\nThe other factor that goes with this is that many of these people didn’t even know who to talk to. They’re describing trying to talk to family, friends, perhaps members of the public, who simply didn’t believe the symptoms that they were describing. So you’re suffering, and when you attempt to talk about the things you’re suffering, people are rejecting you or putting a wall up or not believing you. That is extremely hard for people.\n\n23:38 Dr Buckland: The thing that I wasn’t prepared for was the level of different attacks that these people, who had been injured, were facing. There were people who didn’t believe them; there were people who wanted them to shut up because \"you’re spreading misinformation—it’s not true\". It seemed to be coming from all different angles.\n\nOne of my big concerns is, when people are attacked, they withdraw from society quite often. People are worried about being attacked, so they think, \"I’m not going to put myself out there.\" And so lots of people were self-censoring. So when they’d be explaining why they hadn’t been about, some people were telling me, \"Well, I didn’t bother telling them I was injured by a vaccine; I just said I’d been unwell,: because they’re frightened of the response that they’re going to get.\n\nWhen people withdraw from society, what I find is that you start to see increases in the feelings of anxiety, because people are worried and anxious about going out. But you also start to see depressive symptoms, because people aren’t taking pleasure in the activities they were doing before.\n\nSo the attacks that were coming from different directions were actually making people become emotionally unwell as well. And lots of [the affected] people have suffered no psychological issues in the past, and now all of a sudden, as a result of their injury, they’re starting to suffer this way.\n\nYou mentioned earlier about someone’s wife finding it very difficult, and if you think about it like this—and I’m not talking about anyone in particular here—if a man has been a strong man in a family, and then all of sudden he’s been injured and can’t perform the roles he’s been doing before, that’s really destabilising for everybody; for the person who’s been injured, but also the loved ones around. Seeing your strong father or your strong husband really struggling is so damaging, because that’s really hard and upsetting.\n\nSo the knock-on effect this has throughout the family is huge. It’s things like that that I think don’t go recognised because you think it’s just going to be this one incident that’s happened, someone has been injured, but actually, it affects the whole family.\n\n25:42 Brian Gerrish: There was a varied reaction when they went to seek medical help. We want to stress the positive things. We know that there have been many GPs [family doctors] and people inside NHS hospitals that have done very good work, but nevertheless, for many of these people, they initially went to try and get some medical opinion on what was happening to them, they also found that they were in a very difficult environment.\n\nSome of them couldn’t actually get to see a GP because of all the problems with GP appointments (that we know about). You’re deeply worried, you want to sit down with another human being, the doctor, and discuss your problems, and you find you can’t do that—so you speak to them via the telephone, which completely changes the dynamic and the human interaction.\n\nAnd then we’ve got people who succeed in seeing a GP, but they don’t know what’s wrong with them. They then perhaps move on to the NHS, and in hospital they’re then subjected to tests, with people saying “We’re not sure.” You can almost detect the relief from some of the people who’ve spoken in the film who did finally get an acknowledgment that, yes, they’d been damaged by the vaccines. So that was a relief in one sense.\n\nBut on the other hand, they were getting that full blow that now they knew they had been damaged by the vaccine adverse reactions. This is trauma; correct me if I’m using the wrong term, but this to me as a layperson, seems to be trauma, whichever direction these individuals went in.\n\n27:29 Dr Buckland: Absolutely, I think you’ve hit the nail on the head there. Everyone that I’ve come across who’s been injured has experienced a traumatic event. If that trauma isn’t handled with care and compassion, it can easily lead to developing post-traumatic stress disorder (PTSD). We know for a fact that in order to minimise any chances of trauma turning into PTSD, you need to be able to encourage people to able to talk freely and openly about the experience they’ve had. If you silence or censor or ridicule or dismiss their experience, then you greatly increase the chances of developing PTSD.\n\nI witnessed that from some of the people I talked to. PTSD can come out in really different ways, whether it’s dreams, or all of a sudden you can’t do something—maybe you’ve been attending an appointment at a hospital regularly and all of a sudden one day something’s different, you just cannot physically get out of the car and go for your appointment, and you don’t know why. That, to me, can be a trauma response, because for whatever reason, whatever happened that day—it could just be a smell, it could just be a song on the radio that’s transported you back in time to when the traumatic event happened. Trauma, if it’s not handled with care, can easily lead to PTSD, and that is even more debilitating. The chances of things like suicide then start to increase.\n\nAnd that is why you’re correct, it is trauma. These are traumatic experiences, and they need to be handled really really well. Every root, unfortunately, does feel like it has a trauma component to it. People are struggling for a long time to get a diagnosis, to get an acknowledgement that this is what’s happened to them; and then, when they get that, there will be a sense of relief—but: \"OK, brilliant, I’ve been taken seriously, but now what? Now I’ve got a diagnosis, what does that mean for me?\" All these different stages are quite difficult.\n\nTo me, that’s why it’s really important that psychological support is provided all throughout this, firstly to stop the traumatic event turning into PTSD, and secondly to talk through the whole experience and hold their hand, in terms of \"What does it mean now that you now have a diagnosis?\", and coming to terms with those bits.\n\nWithout the emotional support, my concern is that we will greatly impact their physical recovery. So the two need to go hand in hand; physical investigations/medical treatment and psychological help as well. The two need to go together.\n\n30:40 Brian Gerrish: We need to say to people: these individuals followed government guidance and were doing what they felt was right, so it’s down to us to show compassion and understanding so that humanity gets through this together. We don’t want to be divided as groups, because this is very often how the government tries to push things into the long grass.\n\nJames, these individuals were also trying to seek help elsewhere—they were trying to speak to their MPs, they were trying to speak to the media—and what comes across very clearly is that they were being told, \"Well, we’re interested, but we’re not allowed to report on what’s happening to you.\" Some of the newspapers, I understand, simply pushed people away. So they were rejected by the media. Also, it would appear that they were rejected by some of the MPs. I don’t know what your comment would be on that.\n\n32:15 Dr Buckland: In the film, Claire [featured at 27:45] got vaccine injuries including thrombosis. She was in hospital, and it was really down to her that she didn’t die. She was very, very close. She suffers from migraines; she has for years. The reason she was in hospital was because she’d had a migraine that was like nothing she’d ever had before: excruciating to the point where she was in tears. Her husband said, “We’ve got to get you in hospital.”\n\nThey did all the tests, and they basically wanted to give her paracetamol and send her home and say that it was just a migraine. It was only when she refused to go home and said that it was nothing like she’d ever had before—[that] was that decision that saved her life. I think it was about three to four days. She had huge blood clots, basically clotting all of the arteries going into her liver, and it was only because she was actually in hospital, and they identified it in time, that she made it through.\n\nThe first thing she did over the next few days is she thought, \"I’ve got to warn other people: not against the vaccines, but if you suffer these symptoms, please contact your doctor immediately\"—because she put it off for about five to ten days before she went into hospital.\n\nShe wanted to warn people, so she contacted about thirty different press organisations and newspapers. Only two of them came back to her, and the message from one of them was that \"we’re not allowed to publish this stuff.\" The other news agency said, \"We don’t get involved in anti-vax stuff.\"\n\nThat’s another paradox here. People try to portray it as anti-vax, which is ridiculous, because these people had the vaccine. So it’s not anti-vax. They actually took the vaccine, and they did what they were told was the right thing to do.\n\nThat’s the theme that runs through the film. I didn’t want to get involved in any of the politics. This is not even about the vaccines. It’s not about whether the vaccines work or whether they damage people. This is about a group of people that did what they were told was the right thing; they were injured; and now they’re being ignored by the very people who are telling them that they needed to have the vaccine.\n\nOne of the other things Clare talks about is the fact that her MP is Nadine Dorries [Mid Bedfordshire]. Obviously, she’s the Secretary of State for the Department of Culture, Media and Sport. Clare wrote to her over the course of a year. I think it was over fifty times she wrote to her and e-mailed her, describing her situation, saying that she’d nearly died, that she’d been in hospital, that it was actually confirmed that it was down to the vaccine, and asking Nadine for help with finding resources, [with] working out how she should support herself, because she couldn’t work.\n\nWith over fifty e-mails and letters, she didn’t get one reply. All she got was an automated response. In fact, Nadine only replied after we started running the trailer for the film, where she talks about \"her MP\"—she doesn’t say [in the trailer] who it was, but she talks about the fact that her MP just ignored her for over a year. Then, suddenly, Nadine got in touch—her office did. But that’s disgraceful, isn’t it? She was just asking for help.\n\nSo that’s what the film is about: it is about a group of people who just need help. They need recognition and acknowledgement that this has happened to them. And then a lot of them need financial support because they cannot work. And Wayne, in the film [featured at 16:45], talks about the fact that he’s had to give up his job: he just couldn’t do his job any more. He’s basically on crutches and in a wheelchair. He’s had to have his bedroom moved downstairs because it’s too dangerous for him to walk up the stairs by himself. So he can’t work.\n\nAt the moment, he’s had no compensation. in fact, the Government is telling him that he needs to go to meetings for Job Seeker’s Allowance, which is just ridiculous. That’s the purpose of the film: to get acknowledgment and to get help for some very, very vulnerable people that are just being ignored at the moment.\n\n37:23 Brian Gerrish: We are here making this programme because we want to help people who are suffering vaccine adverse reactions. The groups that have come together have decided that they want to approach it by just focusing on the fact that people are being injured: they’re seeking help, they’re seeking treatment, and that is not happening. In the early stages, there wasn’t even any form of compensation available to them.\n\nSo the issue is very focused for these people. It’s simply about the fact that we have people who are damaged, they go seeking help, they’re not getting the help, they’re trying to reorganise their lives, so what should they do? And this is a very different angle from looking in the wider sense as to what the whole vaccine issue is about. So we’re going to stay with that line—the line the people who have been damaged want—which is just focussing on what has happened to them, and the strange situation where they don’t seem to be able to get any proper response from the state.\n\nI’ll just add that the UK Column, from very early on, did some really good work. Mike Robinson and some helpers started to talk about the MHRA Yellow Card vaccine adverse reactions statistics. And if somebody’s watching or listening to this particular interview and they’re not aware of it, they can go to the UK Column website and just search for \"vaccine adverse reaction Yellow Card\". It’s actually on the front page.\n\nThose statistics are: 1.5 million recorded vaccine adverse reactions with the MHRA, and—this is a key tragedy—2,191 people who’ve been recorded as dying, it would seem, as vaccine adverse reactions. Now, the MHRA is one of the bodies in the UK tasked with the safety of the public in respect to pharmaceutical products, and that includes vaccines. But we know that many of the people who suffered vaccine adverse effects didn’t seem to get a proper response from the MHRA. We know of people who got in touch with them, but nothing happened for weeks, and then maybe they were asked some questions about the circumstances of the vaccine adverse reactions, then it has gone quiet.\n\nSo we’re in a strange situation where a lot of MPs don’t want to engage, the media doesn’t seem to want to engage, but also the MHRA—responsible for safety, along with a Commission on Human Medicines—is not responding either. This, to me, is a key question. Why is it that the bodies tasked with the safety of people for vaccines and pharmaceutical products are not reacting when individuals are coming forward with very good evidence, including diagnoses that they have indeed suffered vaccine adverse reactions? How do you explain this, James?\n\n41:58 James Freeman: What the Government will say about the Yellow Card reporting system is that it’s self-reported. if you’re vaccine-injured, you can report, or your GP can report, to the system. That 1.5 million adverse reactions is actually reported by, I think, just over 450,000 people. It’s important to point out, first of all, that it’s self-reported, but secondly, that the vast majority of those events, you would say, are kind of minor. So they’re the kind of things that the Government are saying; \"Well, you’ve just got a flu-like symptom, or you might feel under the weather, or you’ve got a sore arm.\"\n\nThe other really important thing to point out here is that we know from self-reporting systems that they always under-report. It’s difficult to know by how much, but in the past, we’re talking up to 90% under-reporting of cases. There are a lot of serious reports on there; as you pointed out, there are over 2,000 deaths. There are lots of reports of things like myocarditis, Bell’s palsy, and lots of other quite serious conditions. To me, that’s a huge red flag that the Government should be jumping on and investigating further.\n\nBut they’re doing nothing, unfortunately. When you bring up these figures, as Christopher Chope MP has, the Government says that \"it’s self-reported and you can’t use the figures.\" In fact, Sir Christopher Chope was actually \"fact-checked\" by the UK Statistics Authority because a Labour MP wrote to the authority to complain that Sir Christopher was saying that serious injuries could be as high as in the tens of thousands, which is what I think as well.\n\nWhen you look at the available evidence, we can’t say for sure, but there’s certainly lots of evidence to suggest that that could be the case. There’re probably some politicians that don’t realise the scale and are worried that \"if we start talking about this, it’ll impact the uptake of the vaccines,\" which many still think have saved an awful lot of lives. I think that’s questionable, and I don’t want to get into that here, and that’s certainly not the purpose of the film.\n\nBut [for the purposes of] explaining why some MPs are not talking about this, that will be one of the reasons, because they think it will damage the vaccine campaign. One of the things we also know is that there’s an awful lot of Big Pharma money floating about, and people that own patents—there are very famous, powerful people that own patents to the vaccine—they’re giving an awful lot of money to the UK media and the global media and to research institutions and all sorts of organisations, including government as well.\n\nSo there’s a lot of vested interest in the vaccines and the vaccine programme, which is what makes this whole thing so important, and why it’s so important to raise awareness, because the general public, I don’t think, have really woken up yet to the scale of the injuries and what’s actually going on. I think most people would be quite disgusted to learn that there are people that have been permanently disabled, who—even though it’s on their medical record that it’s down to the vaccine—still haven’t received a penny from the Government over a year later. They’re just being left by themselves.\n\nWayne talks about the fact that he’s worried that he’s going to lose the family home, and there’s three generations living in that home. I think most of the general public would be quite disgusted to learn that that’s being done in our name. That’s what makes the film so important, in terms of raising awareness and to get help for them.\n\n45:44 Brian Gerrish: James, I completely understand what you’re saying there. I absolutely understand this need to be very focused on the people who’ve suffered, but it is remarkable [that there is no action taken] when we have a government agency like the MHRA and the Commission on Human Medicines, both of them tasked with protecting the public from failures in medical pharmaceutical products, and data has been collected. And you’re quite right, of course: when data is collected into the Yellow Card system, that does not automatically mean it was the vaccine that caused the problem.\n\nWhat the public is led to believe is that the agency—we’ll stick with the MHRA—then looks at that data in order to identify whether the vaccine did or did not cause it. But it’s very evident—from a lot of work that not only the UK Column has done, but many other doctors who’ve been challenging the MHRA—that the MHRA are simply not doing any analysis on the statistical data they collect, in order to ascertain whether vaccines are safe. Correct me if I’m wrong: I understand that you’ve got a background in statistics, and with the Office for National Statistics. Is that correct?\n\n47:16 James Freeman: I’ve never done or led medical statistics and health statistics. That’s not my area of specialism when I was at the Office for National Statistics. I can comment on statistics, and I understand data, and I understand questions, but I’m certainly not an expert in that area. The thing for me with all of this which kind of shows that things have broken down with this whole vaccine programme is, first of all, that we know that this is a new technology.\n\nThis MHRA technology is brand new. It was only allowed unauthorised under emergency legislation, because the government argued that we were in an emergency situation. It’s not got any long-term safety data. These are facts now. The big bit of evidence that shows that something has gone really really wrong—globally, not just in this country—is the fact that the Government is pushing it on the entire population no matter what their risk profile is. So we’re even seeing now children as young as five: the Government is recommending that they have this vaccine despite the fact there’s no long-term safety data.\n\nThose facts alone—and they are facts; they’re not disputable—those facts alone should raise a huge question. When you have a new experimental drug or treatment, you have to do human trials before you give it to the whole population. You do not give it to the whole population, because history is littered with examples where things have gone wrong. Thalidomide in the Sixties: that went wrong, and people didn’t realise until later on. So things can go wrong.\n\nSo when you see our health agencies and the government taking a new treatment, that doesn’t have long-term safety data, and giving it to the whole population, for me, that is a huge red flag. Particularly now, over this last year, there’s no case to be made that there’s an emergency any more. So why is the government rolling it out further? [For] the further segments of the population—as I said, five-year-olds now—it just makes no sense at all.\n\nTo me, it’s clear evidence that something has gone terribly wrong in our country. I’ve got my own ideas what that is. We’ve seen that the mainstream media has largely been captured by corporate money. And I think our governments have been captured as well, and our health agencies. I think something has gone terribly wrong. People need to be made aware of this.\n\n50:26 Brian Gerrish: I totally agree with that. I’m just going to stress that the UK Column has repeatedly asked the MHRA for their quantitative risk assessment into the vaccines, on the basis that they’re collecting data which appears to indicate a lot of side effects and deaths, so where is their risk assessment? We have been consistently stonewalled, to the extent that we’re now very confident that there has never been a risk assessment carried out.\n\nYes, your point is correct. There have been other pharmaceutical products that have had far fewer recorded side effects, suspected side effects, [yet] then the safety agencies such as the MHRA have taken a reaction. They are commenting at the moment on problems with a drug called sodium valproate, where people have been damaged. This is a big part of what the MHRA says is its safety work to keep the public safe. But when we talk about vaccines, it’s as though they put up a wall, and they don’t want to talk about these adverse effects, to the extent that you start to say, \"Well, what is the reason? Is there some vested interest that prevents the safety agency from doing its job?\"\n\nI’m just going to come back across to Christian, because I feel we’re heading into psychology again. If we’re discussing why officials would not want to do their job to keep people safe, there’s got to be some form of psychology at work. Why are sensible, educated professionals not engaging with members of the public who are coming forward to say, \"Look, we’ve suffered serious adverse reactions\"?\n\nWhat I’m really asking you, Christian is, what is going on in the minds of these individuals? Because I can’t work it out. Why does an MP not want to engage with a constituent who’s demonstrating major problems? Why do June Raine or Alison Cave, the two ladies with a responsibility for safety in the MHRA, not want to engage with members of the public who are showing severe side effects?\n\n53:00 Dr Buckland: That’s the million dollar question. There are lots of potential reasons. I think one of them is fear. I think that actually, it’s a lot easier to go along with the official narrative. It’s safer, because we’re being told, \"This is the narrative,\" so [they think,] \"if I just follow that, everything should be OK. If we start to ask questions and we open a Pandora’s box, what does that look like?\"\n\nSo I think there is a little bit of being scared, in general, of actually, what does it mean if we start to acknowledge these things. A big belief here is, I think, a lot of professional feel that the vaccine rollout is such a success, and it’s been put put on such a high pedestal, that [with] acknowledging that there could be problems—that people may have been damaged, that people may have died from it—actually, it starts to slip off that pedestal. And I think professionals don’t want that. It’s very destabilising if we have our original view knocked.\n\nSo I think a lot of professionals want the vaccine rollout to remain on the pedestal: that it has saved all these lives and it’s done no harm. To start acknowledging that it actually may well have caused harm makes you then look at the risk-benefit analysis, which people don’t really want to do, probably because it’s been administered to so much of the population.\n\nWhat would it mean if we actually made a mistake? I think there’s big element of being frightened of [the mere thought], \"What if this is a mistake?\"\n\nThe other important thing is, the MHRA have stated they anticipated a certain amount of adverse effects. To me, the question is, if that number—and I’ll need you to remind me, if you can, of what that number is—if they were anticipating this level of adverse events, what was in place for those? Number one, [in order] to work out whether they are the pain in the arm, the flu-like symptoms, and which ones are going to be more severe, debilitating injuries. And once they’ve identified the ones that are severe, what safety mechanisms were put in place to look after these people? That to me, is the really important question.\n\n55:23 Brian Gerrish: We know from watching the MHRA’s own board meetings, and other events where MHRA officials have spoken, that they did anticipate adverse reactions. I think June Raine is on record saying that she expected something like 100,000; I may not be correct on that figure, but she quoted a figure.\n\nAnd then it’s acknowledged that there’s a lot of Yellow Card data, but there doesn’t appear to be any planned safety net; there doesn’t appear to be any reaction. When you look at the MHRA officials in their Zoom board meeting, they talk in a very lighthearted, jokey way about the whole subject—what a [lot of] good they’re doing and how they’ve put in place these wonderful artificial intelligence systems to protect the public—but there’s no substance to what they’re talking about. If you say, \"So where’s the safety net? What are you doing to investigate the people who’ve suffered?\", they simply don’t respond.\n\nSo you’re saying you think this could be out of fear; that once the true reality starts to hit home, it could cause a lot of problems for these individuals. But I’m going to say, gently, that if we’ve got the situation running in parallel where we have the Government’s SPI-B body, which is one of the sub-groups of SAGE, a scientific group advising the government on vaccines. We know from their own minutes that the SPI-B team was talking about using applied psychology in order to ramp up fear in the wider UK public in order to get people to have a greater uptake of the vaccine.\n\nNow, that wasn’t people acting out of fear. On the contrary, it seems to me that you had officials who were using political psychology in a pretty aggressive way to get their agenda through. That seems to me to suggest—I’m going to use the word—malice.\n\n57: 49 Dr Buckland: [Regarding] the parts that you talked about with SPI-B, when they said that \"there’s a percentage of the population who aren’t frightened enough,\" basically, and \"we need to use hard-hitting emotional messaging to get through to them and change their behaviour\": it’s really interesting [that] in that document, they say that using these techniques will have negative repercussions. So it’s acknowledged that ramping up fear artificially, and inflating fear, will have negative impacts. That is a well-known thing. In my job, I don’t try to scare someone into change, [because] it has huge long-term psychological implications.\n\nPsychology is all about co-construction. It’s not about frightening people into submission, because [that] causes damage. My concern is, was a judgement made that \"we wanted a certain change right now\"—and that was more important than the long-term damage? [This possibility,] to me, is why there need to be independent inquiries into things like ‘nudges’, and ethical frameworks drawn up to look at the use of psychology—because, in my opinion, psychology has been weaponised, especially using fear, because fear has been the driving force throughout the last couple of years to gain behavioural change. It has caused damaged both physically and psychologically.\n\nSo when talking about psychology being used to influence vaccine uptake: absolutely, it’s been used all throughout the last couple of years. So going back to the question [of the missing] safety net, that’s the question that’s really key. What was the safety net for the people that you knew were going to be damaged? And that’s the bit I think really needs to be pressed home, and pressure needs to be put on, because you said that people are talking quite jovially in these meetings. Well, I’m not finding it jovial to be sitting and listening to these stories; they’re actually really distressing. I’m just having to listen to it; I’m not living the lives of people who have been injured. It’s really really hard for a lot of these people.\n\nSo I find it kind of offensive if it’s actually seen as jovial and \"Oh, what a great job\", because you’ve also got to look at the damage that’s been caused, and ensure that anyone who’s been damaged is looked after. That, to me, is just ethical. And, as James rightly said, people who took part in the documentary did what they thought was the right thing. “We’re all in this together”—that was the mantra of the vaccine rollout, \"we’re in this together\". And now they feel the people who told them \"we’re all in this together\" have abandoned them. It just feels so ethically wrong to me. But it feels so important to get the message home that these people have been so damaged for doing what they were told was the right thing.\n\n01:01:01 James Freeman: When we talk about damage, obviously there’s damage to people. I think [with] the way the Government has gone about this whole affair, they’ve done a huge injustice and damage to trust in healthcare in the UK. What I’ve seen the Government do over the last two years with this vaccine programme—the coercion, the bullying, the mandates as well; remember, some people were [vaccine-]mandated in the care sector—seeing all that, and then also seeing the consequences.\n\nTwo things can be true; you can say that it’s possible that the vaccines maybe saved lives, but it can also be true, at the same time, that people can be injured. And the fact that the Government is ignoring them and is not helping them, now that they’ve done what they were told and coerced into doing—quite frankly, it’s blown away all of my trust in healthcare. I won’t be getting the vaccine. What the Government has actually done is turn me into somebody who is now anti-vax, because I wasn’t before.\n\nBut now, I literally do not trust the Government and what they say. There’s been signals in the Pfizer data, which are coming out now—that they wanted to put a lid on for 75 years—that show that they knew that they weren’t as safe as what they were saying to the public. Early on, if you look back at a lot of the TV interviews with politicians and celebrity doctors, a lot of them are saying it’s 100% safe and 100% effective. Well, we know that’s not the case. And that’s not something we’ve stumbled upon, because the Government must have known this. They must have known this early on.\n\nSo, as far as I’m concerned, I don’t trust our healthcare system any more, and I don’t trust the Government. I think there’s a lot of people across the UK that are like that now. And the implications going forward are [that] for other healthcare programmes that are desperately needed, people now, who have lost trust, are just going to shun that. That’s going to have consequences for other healthcare programmes that we really do need.\n\n01:40:06 Brian Gerrish: So, James, we’ve lost trust. I agree with that. But also, we’ve lost truth, haven’t we? We seem to be in a UK in 2022 where you’re not allowed to talk about things that are true. When you have people coming forward giving a testimony about their vaccine injury, and it has been medically diagnosed as a vaccine injury, the response of the press and the media and even elements of the Government is, \"We don’t want to talk about you\". This is the suppression of truth.\n\nUK Column did an interview, back in 2021m with a lady whose husband was very quickly paralysed after a vaccine. He was subsequently diagnosed with Guillain-Barré syndrome and he spent over 400 days in hospital. He has [recently] received this £120,000 vaccine damage payout, so there’s no ifs or buts about whether that was a vaccine damage incident. He suffered the injury, it was diagnosed, and he received a government payout. Yet when UK Column had posted the interview that we did in the early days, that testimony, was taken down by YouTube as \"misinformation\". I think I’m right in saying that A Letter To My MP, your video, has also been taken down. Is that correct?\n\n01:05:49 James Freeman: They’ve taken down the sound on one of the trailers because they say that I haven’t got the copyright. I’m contesting that at the moment, because I have actually got the copyright to all the music. On YouTube, I didn’t even get to publish it. I uploaded the video and it did all its checks, and said \"No.\" But, obviously, it’s still available. It’s on BrandNewTube, Odysee and Rumble at the moment.\n\n01:06:37 Brian Gerrish: Right. I’d watched it on Odysee. One of the things we’re going to do our best [with] is to help boost the viewing numbers, because I think on Odysee it’s still in the hundreds. This video should be in the millions. Millions of people need to see what’s happening here.\n\n01:06:55 James Freeman: It’s been watched by, I think, over about 230,000 people on BrandNewTube. It’s also on Rumble [links at the top of this transcript]. We also—me and Christian—have done a live viewing via the World Council for Health, and that was, I think, in the tens of thousands of views there. So I’d say overall, globally, it’s probably been viewed certainly 300,000, if not 400,000 times. But I think more people need to see it.\n\nOne thing I will say on this thing about us losing truth is that not only have we got the Big Tech companies and mainstream media censoring information that is true; we’ve also had a lot of experience of TV personalities, especially doctors that go on morning shows (I won’t mention any names), but also government ministers that have actually been putting out misinformation.\n\nI actually had a complaint upheld with the UK Statistics Authority against Nadine Dorries, because she was one minister—although the Prime Minister also repeated this, as did Sajid Javid—they were claiming for quite some time that 90% of all the people in intensive care units were unvaccinated, which was just a lie. The UK Statistics Authority upheld my complaint, because what was actually the figure they were quoting was people who are receiving the most extreme form of care in ICU. I think it was based upon 140—just 140 [patients]—across the UK, and 90% of those were unvaccinated.\n\nOne of the things they also didn’t say was that when very, very sick people that are in hospital, they do not get vaccinated, because actually vaccinating them would put them at risk. So there’s another reason for that as well. Basically, they were taking this figure based upon 140 people, and ministers were then on TV and in the newspapers claiming that \"it’s all unvaccinated people in ICUs\", which is absolute rubbish.\n\nAnd I was shouting about this, along with Jamie Jenkins, who’s a former health statistician and colleague at the Office for National Statistics. We were shouting about this for a long time, because data was there—and ministers knew, because we were writing to them, we were putting messages out on social media, so they knew that data was incorrect. It took the UK Statistics Authority to write a public letter to Nadine Dorries for her to stop using that figure. But that went on for weeks and weeks.\n\nThere are other examples where ministers have put out misinformation. Well, the general public who are trying to raise the alarm bell using truthful information, like your interview with [the wife of] that gentleman who was disabled by the vaccine, being censored—at the same time, we’ve got ministers going on TV making claims which are not factual, including that they’re \"totally safe and effective\". So something very, very bad has gone wrong to our democracy over the last two years in the context of this whole episode with Covid and the vaccines.\n\n01:10:41 Brian Gerrish: I’ll just add to that. Sir Christopher Chope, who’s one the excellent MPs who is now standing up to be counted to see what he can do to help, when he’s spoken on the subject of vaccine adverse reactions in the House of Commons, there were only six MPs [under one per cent of Members] there. UK Column has seen this with child abuse. When MPs do stand up to talk about very important and emotive subjects, suddenly nobody is in the House.\n\nI’m always appalled, I think is the right word, by that. We’re talking some very serious things, aren’t we? We’ve got the vaccine damage to these individuals in the first place. They’re suffering badly. And we’re getting a shutdown of truth. And we’re getting misinformation being put out by our own government.\n\nThis is a dangerous situation that we’re in. What can we fit, healthy, able-bodied people who are now learning about the fact that many people are suffering some pretty horrific vaccine adverse reactions—what can we do to help these people?\n\n01:12:07 Dr Buckland: I think it’s all about talking: talking your truth, and getting stories out. One of the most important ways of getting information through to people is through storytelling, So if you’ve seen the documentary, tell someone about it. What you’ll find is that people will say, \"Oh, I didn’t know that. I assumed that it’s safe and effective. I assumed that everyone was going to be OK.\"\n\nThe other thing that some people have said to me is, \"I know that no medicines are 100%, so I just assumed that [those with adverse reactions] would be looked after.\" And I think that’s the key: actually getting the message through that these people haven’t been looked after—they’ve been completely abandoned. The message to me is: stories, tell people, talk about this topic. It’s not a taboo topic, which for some reason it seems to have become.\n\nMy hope is—and this was always the thing that James and I came back to at the start—it’s about acknowledgment. If we acknowledge that this has happened to certain people, as he rightly says, you can hold two beliefs here: you can believe that the vaccine has saved millions of lives, and you can also hold it true that lots of people have been injured by it as well. It’s OK. If there’s that acknowledgement that there has been some damage, then there will be awareness.\n\nTo me, if we get awareness, then maybe more of the medical profession will start to ask more probing questions. Maybe, when someone in their twenties turns up to the GP claiming that they’ve got chest pain and they’ve never had it before, instead of it being dismissed as anxiety, which I was hearing a lot was happening, maybe they could ask probing questions, such as: \"When did you last have a vaccine? Did you take a vaccine? And when was that last one? And could the two be connected?\"\n\nTo me, if someone’s been injured, early intervention is key. So if medical professionals are asking more probing questions, and being able to rule out, or rule in, whether it’s related to a vaccine, then that will be great. So when you’re saying, \"What can we all do?\"—it’s talking about it more.\n\n01:14:22 Brian Gerrish: Thank you for that. And of course, that is a very easy thing for people to do, because we all like talking and we can talk in many different places.\n\nAnd finally, James, you’ve got the UK Column audience here. What would you like to say about the work that you’ve done, and what you’d like our audience to do to help you promote the film?\n\n01:14: 52 James Freeman: First of all, watch it. Watch the film. Tell people you know about the film. It’s free. There was never any aim to make any money out of this. Somebody needed to help them. So that’s the first thing; watch it and tell other people to watch it.\n\nSecondly, I would say that people need to be contacting their MPs about this, and asking questions, because at the moment, as you said, the debate on the vaccine programme happened in the House of Commons—there were six MPs in there—and this is for Sir Christopher Chope’s Vaccine Damage Bill. When you think about how many vaccines have been given out over the last two years, it’s an incredibly important thing that has happened in the UK. So for only six MPs to turn up to that debate is quite shocking, as it’s a hugely important topic.\n\nEven if you believe that the vaccines have saved lots of lives, you’d think that would be an argument, actually, to make sure, for the people who have actually have been harmed by it, that we look after them properly—because that way, at least people know then that, if the argument is that it is rare (and I would dispute how rare it is,) but if the argument is that these injuries are rare, and also that the Government will take care of you if you’re unfortunate enough to have something happen, that is actually a positive contribution to the vaccine programme. It doesn’t threaten it.\n\nBy what the Government is doing at the moment, which is ignoring it, the truth will come out. People like me, and lots of other people, will ensure that the truth comes out. Slowly. It might take time, like these things do, but it will come out. That is going to do more damage to future healthcare programmes than anything else that the government could do. So it just doesn’t make anything sense, when you unpack it like that, and you think about it.\n\nSo yes, contact your MP, but talk about it with people. For me, whether you take the vaccine or not comes down to risk. Are you at risk from Covid? We know that the vaccine doesn’t stop you transmitting Covid. Early on, we were told it did stop transmission. It doesn’t; we know that now. Again, that’s not disputed by the Government and healthcare professionals. If you’re not at risk from Covid and it doesn’t stop you from passing it on, why would you get the vaccine?\n\nSo having these conversations, which at the moment unfortunately our government isn’t doing, and that’s clearly evident from the fact they’re now rolling out the vaccines to five-year-olds, which makes me feel sick. I’ve got two young children, and to think that we’ve got a new treatment which has got no long-term safety data, which we’re rolling out to five-year-olds, and telling people that they’re safe and effective—at least question that, how safe they are.\n\nIt just seems absolute madness when that age group, in particular, there’s a minuscule risk from Covid. So I think that people need to talk about these things, because the Government isn’t.\n\n01:18:42 Brian Gerrish: James, thank you very much. At the end of your film, you’re showing the people who have suffered these terrible effects actually putting letters into the postbox to their MP. I’d just add to that: many people say to the UK Column, \"Yes, but it doesn’t make any difference, I haven’t had a reply.\" Our response to that is always the same: yes, it does make a difference. It’s to do with writing the right things: clear, measured letters to the MPs, always polite and respectful, because that actually gives the letter a weight and power of its own, but putting the letters in.\n\nAnd, of course, we need this to happen in volume. It’s not going to have an effect if it’s five or ten people. But if there are thousands of people writing to their MP, yes, it does make a difference. It’s much better to write a handwritten letter, so it is your letter, than to use a template, in our experience.\n\nJames Wells and Dr Christian Buckland, thank you very much for joining me today. I have watched your film several times, and I’m going to say that A Letter To My MP has made an impact on me. And I’m sure that if we encourage UK Column viewers to watch it, it’s going to make an impact on them. And yes, we’re going to ask them to make sure they share it with as many people as possible.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/ukc-interview-vaccine-adverse-reactions-a-letter-to-my-mp", "title": "UKC Interview: Vaccine Adverse Reactions — A Letter To My MP", "description": "Brian Gerrish interviews the producer of the documentary on adverse Covid jab reactions, UK CV Family: A Letter To My MP.", "image": "https://www.ukcolumn.org/sites/default/files/2022-07/james-freeman-christian-buckland-interview.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/video/transcript-sir-christopher-chope-mp-on-vaccine-adverse-reactions-and-the-need-for", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/video/dr-tess-lawrie-covid-19-policy-failures-vaccine-adverse-reactions-regulatory-failures-who", "https://ebmcsquared.org/", "https://worldcouncilforhealth.org/", "https://www.ukcolumn.org/article/alex-mitchell-and-his-fight-for-vaccine-induced-thrombocytopenia-sufferers", "https://bills.parliament.uk/bills/2926", "https://ukcvfamily.org/", "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "https://www.ukcolumn.org/blogs/dont-hate-mainstream-journalists-feel-sorry-for-them", "https://www.ukcolumn.org/search?keywords=MHRA", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/article/when-is-enough-enough-do-no-harm", "https://www.ukcolumn.org/search?keywords=SPI-B", "https://www.ukcolumn.org/search?keywords=psychology", "https://www.thesun.co.uk/tvandshowbiz/13733273/this-morning-ofcom-complaints-coronavirus-vaccine-dr-sara/", "https://www.ukcolumn.org/video/the-harsh-reality-of-vaccine-adverse-effects"], "authors": [], "publish_date": "2022-07-14T15:47:47+01:00"}