{"result_id": "323046", "URL": "https://www.ukcolumn.org/video/a-good-man-down-the-fatal-reality-of-vaccine-adverse-reactions", "timestamp": "2023-04-25 17:46:46 CEST+0200", "meta": {"description": "Former Greater Manchester Police Sergeant Peter John Meadows trusted the UK Government's Covid 19 Vaccination policy. The decision cost him his life.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/a-good-man-down-the-fatal-reality-of-vaccine-adverse-reactions", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "A Good Man Down: The Fatal Reality of Vaccine Adverse Reactions", "cleaned_text": "Former Greater Manchester police sergeant Peter John Meadows trusted the UK Government's Covid-19 vaccination policy. The decision cost him his life. It has taken his two brave daughters, Louise and Lisa, to expose what took place from the time he was vaccinated until he died. Despite collecting vaccine adverse reaction data via their Yellow Card system, designed to keep the UK public safe, the UK Government's Medicines and Healthcare products Regulatory Agency (MHRA) has taken no investigatory action to protect the UK public from future such fatal vaccine reactions. In an interview with Brian Gerrish of the UK Column, Louise and Lisa warn an innocent and ill-informed UK public of the reality of vaccine adverse reactions, and highlight the cover-up of over a thousand deaths and approximately three quarters of a million UK Yellow Card adverse reaction statistics.\n\nIn the second part (01:25:50), Brian Gerrish and Debi Evans analyse the whole vaccination procedure which has taken down a wonderful and much-loved former policeman, husband and father. They examine the part played by the GP and the NHS, official procedures and guidance, and more. The heart attacks which Peter Meadows suffered after vaccination are common and were recorded, along with many other vaccine adverse reactions, in the MHRA Yellow Card system. Even so, the MHRA fails to analyse the data that it collects so as to warn the UK public of nearly 760,000 such adverse effects and over 1,100 deaths to the date of this video. The figures are now, as of Monday 17 May 2021, even greater, with some 786,350 recorded vaccine adverse reactions and 1,143 Deaths.\n\nThe failure of the MHRA to fully report this tragedy cannot be accidental. In reality, it is a calculated assault on the health of the UK public, and a calculated murder on those never warned of the risks of fatal vaccine adverse reactions before they accepted a COVID-19 vaccination.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/a-good-man-down-the-fatal-reality-of-vaccine-adverse-reactions", "title": "A Good Man Down: The Fatal Reality of Vaccine Adverse Reactions", "description": "Former Greater Manchester Police Sergeant Peter John Meadows trusted the UK Government's Covid 19 Vaccination policy. The decision cost him his life. ", "image": "https://www.ukcolumn.org/sites/default/files/2021-05/Louise_Meadows.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-05-17T16:21:40+01:00"}