{"result_id": "323037", "URL": "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "timestamp": "2023-04-25 17:46:40 CEST+0200", "meta": {"description": "A support group for people experiencing life-changing adverse reactions from Covid injections tells UK Column: \"Until this is covered in the mainstream media, people are just not going to people believe it.\"", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Adverse reactions to Covid jabs: \"Will I wake up in pain—or will I wake up at all?\"", "cleaned_text": "UK Column speaks to UK CV Family, a “friendly UK-based community of individuals that experienced adverse reactions (ADRs) after receiving their Covid-19 vaccines”.\n\nIn this interview, Brian Gerrish and UK Column Nursing Correspondent Debi Evans speak to Charlet Crichton and Caroline Pover and ask them about their experience of adverse reactions to Covid vaccines. They also learn about how UK CV Family was formed, how UK CV Family supports others, and how people with adverse vaccine reactions can get help and support.\n\nThe interview video embedded on this page concludes with a short conversation (not transcribed below) between Brian Gerrish, Debi Evans, and Dr Christian Buckland, Doctor of Psychology in Psychotherapy and Counselling. In that interview, Debi Evans points out that there is no ICD 10 code for vaccine injury.\n\n00:45 Debi Evans: I’m joined this afternoon by Brian Gerrish from UK Column, Charlet Crichton and Caroline Pover.\n\nCaroline and Charlet, I’m delighted to be able to welcome you, although I wish I was welcoming you under different circumstances. Very briefly, for people that haven’t met you, that don’t know you, that haven’t seen your amazing book, Caroline (which I’m sure we’ll show many times), would you [both] be kind enough to give us an introduction about yourselves and how we have found ourselves talking here today? Shall we start with you, Charlet?\n\n\n\n01:23 Charlet Crichton: My name’s Charlet. I had an adverse reaction to my AstraZeneca vaccine last year. And in that process, I formed a support group for people in the UK that are also suffering from adverse reactions to their vaccine. It became increasingly obvious that there was a need for a support group because of the situation we found ourselves in. It was through the support group that I met Caroline.\n\n\n\n 01:53 Debi Evans: And, Caroline, please introduce yourself.\n\n\n\n 01:57 Caroline Pover: My name’s Caroline. I also had an adverse reaction to AstraZeneca last year. I’m the author of Covid Vaccine Adverse Reaction Survival Guide. I regularly speak out about adverse reactions to the covid vaccine. I’m a member of UK CV Family, the group that Charlet set up, and I try to support her as much as I can.\n\n\n\n 02:24 Debi Evans: Charlet, can you tell us a bit more about your support group, and where can people find you?\n\n\n\n 02:30 Charlet Crichton: Our support group is primarily Facebook-based, but we do have a website. There’s an e-mail address on there, and there’s lots of information about how to get support through us.\n\n\n\n 02:50 Debi Evans: Caroline, I know that you’ve done talks at the Better Way Conference, and you’ve been very vocal in speaking out. Your book is phenomenal. The two of you work together very closely. Bearing in mind that you both are suffering from serious adverse reactions, how many people are you currently supporting?\n\n\n\n 03:22 Charlet Crichton: At the moment, we’re just nearing 600, but we’re growing by about thirty per week.\n\n\n\n 03:31 Debi Evans: That’s horrifically astonishing. I can’t imagine what you’re waking up to every morning. I’ve seen some of the e-mails you’ve been receiving. Can you tell us about what you’re receiving in the morning in your e-mail box?\n\n\n\n 03:51 Charlet Crichton: It’s devastating. We get people from all over the UK writing to us telling us about what they’re experiencing both physically and mentally with this condition. It’s very hard for people to have an illness like this and feel like they’re not getting any support from the professionals they’re seeing.\n\nSo I’ll open up my e-mail inbox and there’ll be five or six a day from people who are absolutely desperate for someone to talk to, and listen to them, and give them some guidance about where to go next.\n\n\n\n 04:33 Caroline Pover: We also get e-mails from family members who are very concerned about their family. I got an e-mail recently from someone whose father had been sectioned [committed involuntarily to a mental institution] because of a reaction that he’d had. We get a lot of e-mails from mums who are concerned about their children: it tends to be daughters in their twenties.\n\nAnd we also get e-mails from people who have dealt with adverse reactions to other vaccines in the last twenty years, not just the Covid vaccine. It’s quite an interesting range of people who are contacting us for certain kinds of support, or to reach out to offer support to us too.\n\n\n\n 05:18 Debi Evans: Who is supporting you? You’ve done loads of work e-mailing MPs and e-mailing the [local] NHS trusts. Tell me and the listeners about the diligent work that you’ve been doing behind the scenes, and what kind of response have you been receiving from the people that you’ve been e-mailing.\n\n\n\n 05:44 Charlet Crichton: We started a campaign a few months ago, which consisted of three parts:\n\n1) To e-mail researchers, scientists and doctors with a letter detailing how many of us there were, and there was a survey that we did on the group, so it had all our symptoms, our age ranges and so on. We sent that to doctors and scientists, basically begging for help. We ended up with three responses. We sent it to over 110 doctors, scientists and researchers.\n\n2) To reach out to the media. We put together a press release talking about the fact that we’re not getting any help and we’re desperate. We asked them to please help this group of people in the UK who aren’t being listened to. We didn’t get one reply.\n\n3) The third part of the campaign was more detailed, and we’re still doing it. Caroline can tell you about that.\n\n\n\n 07:03 Caroline Pover: We’ve had an MP campaign. It started in March, when we sent out very detailed e-mails directly to the MPs of each of our members. We send them information and we ask them to find out more about what is going on with their constituent. We ask them to provide support, whether they need support accessing NHS services or whether they need support accessing financial benefits.\n\nWe also ask them to support Sir Christopher Chope in the efforts that he’s making in trying to raise awareness in Parliament about what’s happening to us. We want our MPs in general to be more aware of what’s happening to people who are vaccine-injured. We’ve contacted 178 MPs. As of today, almost 30% of those have responded in a supportive manner, so we see that as very encouraging.\n\n08:08 Debi Evans: I’d like to bring Brian in here, because he’s spoken at great length to Sir Christopher Chope, and we are looking to talk to some more MPs and to find some support from those who are supporting Sir Christopher Chope.\n\n\n\n 08:29 Brian Gerrish: Well, the first thing we’ve got to say is that it was wonderful to have such an easy dialogue with Sir Christopher Chope. In general, over the years, whatever the subject that UK Column has been reporting, one that we consider to be important, we’ve found it extremely difficult to engage with MPs. Whether it’s to do with child abuse or it’s to do with fraud and corruption, it’s difficult to get MPs to engage.\n\nIt was very refreshing that in a really short space of time, Sir Christopher Chope was so upfront and said, \"Yes, I’m aware of what the UK Column has been reporting,\" so he agreed to do the interview with us. That was wonderful. Then we asked him if he was on his own or whether he was getting support from other MPs, and he said he was getting support from other MPs. We didn’t ask him at that point for names, but it was encouraging that he is also saying that he’s getting help. Together with what you’ve just said, I think this is quite a positive picture.\n\nA little bit that I’d like to add for myself is that right back at the start of the vaccine programme, UK Column started to work on vaccine adverse reactions, and that led to Mike Robinson and the team putting up the searchable database of the Yellow Card system on the UK Column website. We started to see these statistics pouring in.\n\nInitially, we were just looking at them as statistics, because there are no names, there’s no data on individuals; they are just raw statistics saying \"adverse reaction\" and what it was. Then we got our first report from a lady saying her husband had been paralysed from the neck down as a result of a vaccine adverse reaction.\n\nWhen we broadcast that interview with her, where she gave a totally factual testimony of what happened, in a matter of a few days, we were banned from YouTube for publishing that report. What really made it interesting was, about a month later, the Daily Mail printed quite a big article on the very same story, but they weren’t censored.\n\nListening to both of you now, what’s been really brought home to me is that we started out looking at statistics, but of course those statistics were about real people and what had happened to those people.\n\n\n\n11:22 Charlet Crichton: And they are real people. The disbelief that this could be happening to real people, and not just a few, is a wide opinion of a lot of people that obviously aren’t seeing what some of us are going through because it is so hidden. We even have support group members whose families don’t believe them—because they aren’t seeing it on the telly. They can’t see how their son, daughter, husband or wife could be ill from the vaccine, because it’s not being talked about.\n\nSo we’ve got some members that are living with this illness—heart problems, ME/Chronic Fatigue Syndrome symptoms, nausea, paraesthesia [burning skin]—who are not believed by their family members because this subject is so heavily censored.\n\n12:24 Brian Gerrish: Can I jump in with another question? How many of the people who contact you know that what they’ve got is a vaccine-induced reaction? Or are they people who are putting two and two together: they’ve had the vaccine and within a matter of minutes there was an adverse reaction, so they can say from their personal experience, \"This has got to be the vaccine, because one minute I was OK and the next minute I wasn’t\"?\n\nPresumably, there are also people who had the onset of symptoms which occurred a little bit later. Out of those people, how are they able to say it’s the vaccine? Has there been a medical diagnosis, or has something else allowed them to be confident in pointing a finger at the vaccine?\n\n\n\n 13:20 Charlet Crichton: I think the thing to remember is that when this comes on, it doesn’t just come on with one symptom. You will be hit with a barrage of symptoms: for me, it was about 35 symptoms at the height of it. So you go to bed one day, and then you wake up with these symptoms. For a lot of people, yes, they do have an immediate reaction within hours of the vaccine, and it's very obvious: [for] some, within minutes of the vaccine. And then there are these people that seem to get this reaction between seven and fourteen days later.\n\nPersonally, I’ve spoken to consultants that have actually said to me, \"That is is the time period where your immune system really starts to kick in. It’s the ramping-up of the immune system, which seems to hit at about day ten, and that is pretty clear.\" So I think there are some people that may have initially just thought: \"What’s gone on? What’s happened to me?\" And then thought, \"Yes, it’s the vaccine,\" and put two and two together themselves.\n\nAnd then there are those people who have been clearly diagnosed, or it happened immediately, and it’s very clear-cut.\n\n\n\n 14:10 Caroline Pover: Some people know that something is not right. I was vaccine-ignorant; I had no idea this could happen. So for a lot of people, it would not even occur to them that it was [caused by] a vaccine. It definitely didn't occur to me until the paramedics told me.\n\n15:44 Brian Gerrish: For some people, the realisation didn't occur until quite some time later, when they'd been suffering effects and they started to research and began to put two and two together.\n\n\n\n15:55 Debi Evans: In my experience, I was speaking to a friend of mine just a week ago who had been feeling unwell for a long time, and was complaining of all sorts of symptoms and had put it down to many different things but in fact hadn't tracked it back to the vaccine. I had to be very gentle, because even to that second, that friend hadn't given the vaccine any consideration at all.\n\nWe need people such as yourselves to help us know how to talk to people, and know how to inform people, by being very gentle. I've seen people's diagnoses with \"myocarditis associated with vaccine\", so we know there is a causal link, and I believe that [the then Health Secretary] Sajid Javid has already admitted there is a concern and a causal link. And yet it seems that you aren't being listened to by anybody.\n\nWhen you put your Yellow Card in to the MHRA, did you receive any kind of response?\n\n17:06 Charlet Crichton: I did. I had an e-mail with a reference number, and that was it. So I've reported it three times now, I think, and I've had three separate reference numbers, but no other communication.\n\n17:22 Caroline Pover: I got an automated response and I sent them updates regularly—I still do send them updates—and normally, either I get an automated response or I get something that just says, \"Thank you for sending the information.\"\n\nBut I don't think they're doing anything; nobody's asked me for any further information; there’s no indication that investigations are going on. I do think—Charlet can probably correct me if I'm wrong with this—last week was the first time that any of our members received an e-mail from the Yellow Card system asking for more information. That's one person out of almost 600, and just last week was the first time.\n\n18:10 Caroline Pover: That's the only time we've seen anybody asking for further information.\n\n18:20 Debi Evans: That's very interesting, because I'm wondering whether that information will go to the Yellow Card Biobank. You know that UK Column has been following the MHRA and watching the MHRA board meetings that they were transmitting through YouTube, and we've asked many, many questions to the MHRA.\n\nAs we know, Sir Christopher Chope has been asking many questions to Dame June Raine, and we believe that nobody is receiving any answers back from anybody from pharmacovigilance [at the MHRA], and the answers that we are getting back are not satisfactory, because we're asking for all of this to stop pending an immediate investigation.\n\nWhat is your message to people watching?\n\n19:00 Charlet Crichton: My message would be, if you think you’ve had an adverse reaction, go to your doctor or go to Accident & Emergency, explain what's happening; don’t be afraid to talk about it.\n\nThat's the first thing: don't sit at home wondering why your feet have suddenly gone numb, doing nothing about it. Go to your doctor, talk to your doctor. Come to our website for support. We'll get back to you within the day, I promise.\n\nThere are other people you can talk to. You're not alone and you don't have to do it alone.\n\n19:43 Debi Evans: Caroline, I would love to highlight your book again, Covid Vaccine Adverse Reaction Survival Guide, for anybody that's watching who has any of these symptoms that Charlet and Caroline are talking about.\n\nThis really is what it says on the cover: it's a survival guide. It tells you where to go, maybe what to expect, how you might be feeling, how to deal with life in a very different way—because everything's topsy-turvy.\n\nWhat interested me, Caroline, was how you both—and how people generally with vaccine adverse reactions that aren't being listened to by people—regard other people in the community.\n\nI know that some labels you're having to deal with are pretty shocking: \"vaccine silencers\", \"vaccine deniers\", \"vaccurious\" (I think that's your term there, Charlet), \"vaccine victim saviours\" and \"vaccine vampires\".\n\nFrom where we're sitting, we're anxious to get answers and help for you as quickly as possible. So what would you like us to do to support you, bearing in mind that we don't ever want to fit into any of those [categories]? Explain a bit about your experiences with different people and how they've reacted to you.\n\n21:22 Caroline Pover: One of the things I say a lot is: make yourself a safe space for someone who is adverse reaction-injured to talk to. The way that you make yourself a safe space for somebody who's vaccine-injured is not by sharing your opinion on the vaccine, or on vaccination in general, or on the Government, or on Covid, or on any of those other things.\n\nThe way that you make yourself a safe space is not to have judgement on any of those things; you keep those to yourself. You talk gently; in fact, you don't do much talking, you do a lot of listening.\n\nYou listen kindly and without any judgement. You just let people know that it's OK to talk to you if they're struggling, and you won't judge them, you won't call them stupid or sheep or any of those things; you'll just be kind and listen. That applies to anybody, regardless of what you think about vaccination.\n\n22:30 Debi Evans: How do you feel when you wake up of a morning? How does it affect your life on a day-to-day basis?\n\n22:45 Charlet Crichton: Most mornings, it takes about an hour and a half, two hours, to be able to sit up in bed; otherwise, I feel very faint. I have postural orthostatic tachycardia syndrome since the vaccine, so as soon I raise my head off the pillow, I start to feel as if I'm fainting, so I have to lie back down. After about an hour and a half, I can then swing my legs round, and I have to do some calf raises and things before I can get up.\n\nThe first thing I notice I feel when I open my eyes is this intense kind of buzzing throughout my whole body, and that's what I wake up to every morning. That, and a pulsatile tinnitus—a whooshing sound in my ears constantly. My hands also buzz quite a bit in the morning, and I'm very nauseous.\n\nSo imagine a really, really heavy night out on the tiles and that hangover feeling. I've had that for fifteen months, on top of the fainting feeling in the morning—and during the day, but it’s especially bad in the morning,\n\nAnd every day, I lie there and I just think to myself: \"Well, is this going to be a 3 out of 10 day, is it going to be a 4 out of 10 day? Am I going to be able to walk my dog today, or am I going to be on the sofa all day asleep, or am I going to have to stay in bed, even?\"\n\nAs I gradually come to, I check which limbs are working properly that day: are my hands working properly, or have I got a tremor in that arm today? Can I speak coherently, am I stuttering or slurring my words a little bit? And do I have head pressure? Because sometimes I wake up with this awful head pressure that's just there all day.\n\nThat's how I wake up every morning now.\n\n24:25 Debi Evans: Are you getting help, Charlet? How are your doctors? Are you receiving consultant help? I’ve heard through you that some of you have had to pay for your own treatment and for your own tests, and that's it's becoming extremely expensive, on top of everything else.\n\n24:58 Charlet Crichton: My GP [family doctor] is helpful, but doesn’t know what to do. I have spent about £8,000 of my savings: £250 for a thirty-minute appointment. People who don’t have money to go private have not yet seen a consultant for over a year.\n\n25:59 Caroline Pover: Will I wake up in pain, or will I wake up at all? My partner is very supportive. He does everything, but it is very isolating and exhausting. If I try to make plans, I may or may not be able to do it. It takes a week to recovery from the exertion of seeing a friend. After fifteen months, you tend to give up trying to see friends.\n\n27:37 Brian Gerrish: What kind of reaction did you get at Accident & Emergency?\n\n27:47 Caroline Pover: They were lovely. Paramedics were lovely too, and in fact diagnosed it as an AstraZeneca/Oxford reaction even before I got to A&E. And A&E were lovely.\n\nMy GP is very good; she lets me lead. But her referrals have been rejected. She accepts that it’s a vaccine adverse reaction.\n\n28:55 Brian Gerrish: The MHRA has collected 1.5 million [Covid vaccine] adverse reactions, and yet the MHRA and the Government are not recognising that adverse reactions exist. It would be nice to see more recognition for vaccine-injured people. It would be good from the media. There is a need to talk about this.\n\n30:30 Brian Gerrish: The third thing you said you did was to approach the media. Did that include the press, the BBC and the TV channels; and, if you didn't get a response initially, have you got more engagement with them since then?\n\n30:57 Charlet Crichton: It was ITV and all major news outlets plus the Times and the Daily Telegraph. We had a massive e-mail list. We sent out one press release and then later one with the Letter To My MP film, but there was no response.\n\n31:34 Caroline Pover: A media contact told us they were \"not allowed to talk about it\" and said that “anything negative about vaccine adverse effects is not going to happen.”\n\n32:32 Brian Gerrish: So there is censorship and we are not allowed to talk about it.\n\n32:54 Charlet Crichton: That’s why it’s important that we can talk to each other. Not hearing about it in the media at all compounds the isolation.\n\n33:52 Caroline Pover: Until this is covered in the mainstream media, people are just not going to believe that it exists.\n\n34:30 Brian Gerrish: [gives a personal experience of coming across a man from Devon County Council with a clipboard promoting vaccines in the village shop]\n\nI followed him out and said to him very nicely, \"You are promoting the vaccines, but do you know about the adverse reactions?\" He said, \"No.\"\n\nI said, \"Are you aware that the MHRA, the agency tasked with vaccine safety, has a list of adverse reactions totalling 1.5 million, and that there are people who are no longer here as a result of vaccination? Are you aware of all that data?\"\n\nHe said, \"No.\" I said, \"Then don’t you think your employers should have told you?\" The omission of information within the public bodies that should be helping is sinister.\n\n36:48 Debi Evans: It's wicked. I wrote to Sir Munir Pirmohamed, who's head of pharmacovigilance [for Britain], Chair of the Commission on Human Medicines. I was extremely concerned to see some of the language he was using in his reply.\n\nHe said these are only suspected adverse reactions and \"could be coincidental\". Now, clearly, they are not, and clearly, the people in control of pharmacovigilance, whom we're meant to place our trust in, are doubting your actual adverse reactions and calling them \"suspected adverse reactions\".\n\nAnd let's not forget, these [Covid vaccinations] are Black Triangle medicines, thus experimental, and therefore should be under extra scrutiny.\n\nTo me, this is more than sinister. It's tyranny; they are lying. In my opinion, these people should be removed from office straight away, because we're not getting the answers from them. Clearly, they know the data: it's on the MHRA website. And yet I have seen people censored for putting that data up. I've seen people putting their stories online, only to be told that it's censored and they're not allowed to speak. Have you experienced any of that?\n\n38:52 Charlet Crichton: Yes, people have been shut down. They connect to talk about how they feel, but if they use the wrong word—for example, the words “vaccine” or “Pfizer”—they get controlled, and later maybe shut down.\n\nWe’ve had a lady advertising what was happening, and she was shut down. We have to use codewords in our discussions! The censorship is literally of us talking about our symptoms.\n\n41:01 Debi Evans: I asked Jeremy Hunt about adverse reactions, and he said that he was also very concerned and that he would take it to the Health and Social Care Committee of the House of Commons.\n\nWhat would be your message to other MPs who have promised to do something and haven't—or to Dame June Raine or Sir Munir Pirmohamed?\n\n42:00 Charlet Crichton: I think if you can spend billions of pounds on vaccine campaigns, you can spend millions of pounds helping us.\n\n42:15 Caroline Pover: It’s a complicated situation. We know no magic cure is coming any time soon. We’re not expecting that. We want somebody to say: \"We don’t know how this happened, but we’re going to give everyone counselling.\" The mental health impact is huge; they could provide mental health support.\n\n43:40 Brian Gerrish: People with underlying mental health conditions who then get adverse reactions have been hit twice.\n\nWhen you started out and you were looking for places to go, you talked to GPs, the NHS and so on. You’re now learning of Pirmohamed and others who have a special responsibility for public safety. Are you now managing to get a better response from people who really are holding responsibility within the government system—that is, are you getting more out of the MHRA or the Commission on Human Medicines?\n\n45:50 Caroline Pover: About 30% of MPs are listening and asking questions, which is good and carries a lot of weight. Even if they don’t have the answers but they are willing to ask questions, that helps. But it’s slow.\n\nI don’t think much is happening in the medical system. Definitely, nothing is happening in the media. But I do think things are changing. The MPs are listening, which is encouraging; and once they start talking to each other, that's going to lead to more help for us.\n\n47:00 Brian Gerrish: Sir Christopher Chope told us that he was quite affronted that he had asked a question of the MHRA in Parliament and simply did not get a response to a relatively simple question. This alerted him to something being wrong with the organisation.\n\nAt that point in our interview with him, Debi explained more of the pharmacovigilance system to him: for example, [that the Covid vaccinations are] Black Triangle experimental medicines, meaning that there has to be heightened scrutiny of them because there could be adverse effects.\n\nAnd then we've got the whole of the MHRA system collecting data on adverse reactions. It’s going into a black hole—or it's going to assist the pharmaceutical industry through these biobanks that Debi has mentioned.\n\n48:51 Charlet Crichton: There should have been an app for every person, so they could see the effects in everyone, so they could see the trends: who is fine, who gets it in a few days and so on.\n\nThere should have been more care in the way the vaccination programme was done. In Japan, there was a questionnaire, and for some people, their doctor said, \"No, you shouldn’t have the vaccine.\"\n\n50:35 Brian Gerrish: What was your experience at the vaccine centre like?\n\n50:42 Caroline Pover: I don’t like going back to it. I wasn’t given information about it until I was on my way out. Staff were present, but people were not told what potential adverse reactions were possible.\n\n51:39 Brian Gerrish: From your experience with the 600 people you’ve got on board, what is the simplest adverse reaction, and what would you regard as the most life-changing?\n\n52:12 Charlet Crichton: That’s difficult to say, because every reaction has the possibility to become life-changing.\n\nThere are some people that have been left with an ongoing allergy-type symptom. If you look at that on the surface, you think, \"Well, I’ll pop a couple of antihistamines and you’re done\"—but it’s not like that; it’s life-changing. They’re on multiple medications, they can’t eat the foods that they used to, they react to things even like water now. They can have anaphylaxis and have to carry epipens.\n\nThe reactions are so varied, and there are so many symptoms. And what we tend to see is a combination of different syndromes all rolled into one. People will generally have two or three syndromes going on, whether that’s a mast cell activation or a small-fibre neuropathy or a neuropathy of some sort, chronic migraines and so on. So you’ll get a cluster of these.\n\nI was unfortunate to get nearly all of them: everything on the list that you’ll hear people say. I haven’t had any seizures, not proper seizures, but I do get clonic seizures in my sleep sometimes. But Caroline, what’s the least severe reaction that we’ve seen?\n\n53:34 Caroline Pover: I don’t know; they’re all pretty debilitating. Some things you just find a way of managing, but with this, you’re still dealing with it fifteen months later. This is life. You’re completely debilitated. I don’t function. I function at about 30% of what I did before the vaccine.\n\n54:14 Debi Evans: Yes, because, Charlet, your job was physical. Tell everybody what you were doing before, and now you can’t.\n\n54:19 Charlet Crichton: Yes, I was a sports therapist, so I was on my feet a lot rehabilitating patients that had a sports injury of some sort. So a lot of it is hands-on work. The other part of it is using your mental capacity to work out rehabilitation plans and exercise plans for people.\n\nI think I could do some of it now, but I certainly can’t be on my feet for that long. After about five minutes standing in one place, I start to tremor, the blood pools in my feet, I start to feel very faint, I get tachycardia.\n\nI have several different types of arrhythmia; I’ve had periods of ventricular tachycardia, and also a second-degree heart block, which means that my heart rate slows down very quickly and then speeds up again.\n\nAll these things make you feel really really dizzy. So I couldn’t physically do my job at the moment, and I haven’t been able to work since June last year. I’m being supported by my partner. I haven’t yet received a penny in benefits. I have applied, but it’s taking months and months to work out whether I’m allowed PIP or not.\n\n55:46 Debi Evans: That’s a Personal Independence Payment. For anybody that’s watching, if they’ve ever seen a form for PIP, it’s probably about forty pages long: they want you to answer every single question in great detail. I’m sure, for you, that is a huge effort, trying to navigate your way around the Department for Work and Pensions.\n\nHave either of you had successful applications with PIP; are you still awaiting answers? And how are the rest of the group managing with benefits?\n\n56:22 Caroline Pover: Mine has been rejected twice, and I’m currently waiting for a tribunal date, which they say will be in a few months.\n\n56:33 Brian Gerrish: We’ve done an extremely interesting hour's worth of analysis on what’s been happening, so we’d like to thank both of you for joining us. Before you go, what can our UK Column audience do for you? What would you like all the people who listen to this, or watch it, to do in order to help you and your group?\n\n57:00 Charlet Crichton: You can come to our website and you can send us an e-mail to the address on the website. We can help you send a letter to your MP to ask them to look into supporting us and what we're doing.\n\nYou can also watch our documentary, which is also called A Letter To My MP, by James Wells [James Freeman].\n\nAnd you can just talk about this: talk about this with an open mind, and as Caroline says, make a safe space. Don't let politics come into it: if someone approaches you or you think someone needs to talk about something like this, just give them a safe area to speak to you.\n\n58:00 Carline Pover: I was terribly upset one day and I bumped into a friend of mine I hadn't seen for a long time. She asked me how I was, and I said that I was in so much pain: my hands, my eyes and my head had just been killing me.\n\nAnd she just put her hands on my temples, and her hands were cold, and it felt really lovely. I just cried and cried there on the street. She didn't tell me her opinion about things; she didn't talk about anything like that in that moment. She just held me. She held my pain, and she let me express it, and she didn't have to fix it; she didn't have to do anything with that.\n\nShe was just there for me, and we need more people, not just relating to vaccine injury, but we just need to that as humanity. We need more of that kind of love and care. We don't need to care what somebody's politics are and actually what they think about vaccines; we just need to be kinder to each other.\n\n59:20 Brian Gerrish: I'll add to that: we'll ask all the viewers and listeners to share this, and, as we always say, to do your own research on vaccine adverse reactions, and of course to visit your website, and to spread the word.\n\nThis is what we want to do: to alert people to what you've suffered, to what other people are suffering, so that ultimately we can try to do something about it.\n\nTo both of you, thank you very much for joining us.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/adverse-reactions-to-covid-jabs-will-i-wake-up-in-pain-or-will-i-wake-up-at-all", "title": "Adverse reactions to Covid jabs: \"Will I wake up in pain—or will I wake up at all?\"", "description": "A support group for people experiencing life-changing adverse reactions from Covid injections tells UK Column: \"Until this is covered in the mainstream media, people are just not going to people believe it.\"", "image": "https://www.ukcolumn.org/sites/default/files/2022-07/UK%20CV%20Family%20Thumb.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcvfamily.org/", "https://www.ukcolumn.org/video/vaccine-damage-real-people-charlet", "https://en.wikipedia.org/wiki/International_Classification_of_Diseases", "https://carolinepover.com/bookshop-1", "www.ukcvfamily.org", "https://betterwayconference.org/", "https://www.ukcolumn.org/video/transcript-sir-christopher-chope-mp-on-vaccine-adverse-reactions-and-the-need-for", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/video/the-harsh-reality-of-vaccine-adverse-effects", "https://www.dailymail.co.uk/news/article-9712333/Four-Brits-develop-Guillain-Barr-syndrome-just-days-having-AstraZenecas-Covid-jab.html", "https://ukcvfamily.org/", "https://carolinepover.com/bookshop-1/ols/products/covid-vaccine-adverse-reaction-survival-guide", "https://www.ukcolumn.org/video/ukc-interview-vaccine-adverse-reactions-a-letter-to-my-mp", "https://www.ukcolumn.org/article/when-is-enough-enough-do-no-harm", "https://twitter.com/paulturner2012/status/1522320686320168967", "https://ukcvfamily.org/", "https://www.ukcolumn.org/video/ukc-interview-vaccine-adverse-reactions-a-letter-to-my-mp", "https://ukcvfamily.org/"], "authors": [], "publish_date": "2022-07-18T21:57:48+01:00"}